{"url": "Batonn_insurgency", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Batonn insurgency"}, {"tag": "p", "text": "The Batonn insurgency, also known informally as the war for Batonn, was a conflict of the Batonn sector insurgency, which took place sometime before the mission to Reklam Station. Local dissatisfaction with the rule of Governor Restos fueled the emergence of an insurgent movement led by Nevil Cygni, a shadowy former pirate and consultant who adopted the persona \"Nightswan.\" Nightswan engineered the Batonn insurgency as a means of destroying the Chiss Admiral Thrawn, a rising star in the Imperial Navy. The Batonn insurgents seized the Imperial garrison on Scrim Island and successfully fended off Admiral Durril's attempt to recapture the island."}, {"tag": "p", "text": "Studying the insurgents' tactics, Admiral Thrawn managed to defeat the insurgents on Scrim Island and force their surrender. The surviving Batonn insurgents led by Nightswan regrouped at the Creekpath Mining and Refining complex on Batonn's main continent. The Empire and Batonn Defense Force lay siege to the mining complex. Thrawn's attempts to end the crisis peacefully were fraught by an Imperial Security Bureau operation to blow up the mine and Nightswan's distrust of the Empire."}, {"tag": "p", "text": "Ultimately, the Lothalian Governor Arihnda Pryce ended the insurgency by blowing up the Creekpath mine to hide her murder of the ISB Agent Gudry. The resulting explosion killed all the Batonn insurgents and numerous civilians. At the urging of Pryce, Thrawn took credit for ending the Batonn insurgency and was promoted by Emperor Palpatine to the rank of Grand Admiral."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, the rebel leader Nevil Cygni, who adopted the pseudonym \"Nightswan\", led a galactic-wide insurgency against the Galactic Empire. Nightswan harried the Empire by raiding tibanna and iridium shipments, disrupting the supply of doonium metals and Wookiee slaves, and stirring up rebellion on worlds such as Umbara, Cyphar, Batonn, Denash, and Sammun. Nightswan also hired the Higher Skies Advocacy Group led by Driller MarDapp to collect intelligence on senior Imperial officials on Coruscant including Moff Ghadi and Grand Moff Wilhuff Tarkin. Higher Skies worked with the martial arts instructor Juahir Madras to recruit senatorial bodyguards into spies."}, {"tag": "p", "text": "Nightswan's movements were tracked by the Chiss Imperial Navy rising star Thrawn and his friend and Ensign, Eli Vanto. With the help of political allies such as the Imperial Security Bureau Colonel Wullf Yularen and the Lothalian Governor Arihnda Pryce, Thrawn and Vanto managed to expose and foil several of Nightswan's schemes. In the process, Vanto and Thrawn uncovered evidence that the Empire was chanelling vast amounts of precious metals for an unknown mega-project later revealed to be the first Death Star. Nightswan and Thrawn eventually took an interest in outsmarting each other. Seeking to best Admiral Thrawn once and for all, Nightswan instigated an insurgency on Batonn, whose mines supplied metals to the Galactic Empire's expanding military and war machine."}, {"tag": "p", "text": "On Batonn, growing popular discontentment with the corrupt Governor Restos sparked the emergence of an insurgent movement led by Nightswan. The Batonn insurgents had a hideout within the Creekpath Mining and Refining complex near Paeragosto City on the planet's main continent. Around 2 BBY, Batonn insurgents overran and took control of the Imperial garrison on Scrim Island, an offshore island that lay 300 km west of the main continent. They took a hundred hostages including Imperial Navy troopers, technicians, and some civilian workers. The Batonn insurgents controlled the island's deflector shield, shoreline defenses, and three of its ion cannons."}, {"tag": "p", "text": "In response to the events at Scrim Island and other local sector insurgencies, Fleet Admiral Jok Donassius convened a high-level meeting at Imperial High Command. This meeting was attended by several Admirals including Thrawn, Durril, and Kinshara, Governor Restos, Governor Wistran of Denash, Governor Estorn of Sammun, Governor Pryce, Commander Vanto, and Colonel Yularen. Regarding the Scrim hostage crisis as an affront to the Empire, Fleet Admiral Donassius ordered Admiral Thrawn to destroy the rebels immediately. When Thrawn proposed first studying the island, an impatient Donassius reassigned the mission to the more pliable Admiral Durril. Thrawn's Ninety-Sixth Task Force was instead tasked with dealing with the Sammun insurgents while Governor Kinshara's forces were deployed to Denash."}, {"tag": "h2", "text": "The campaign"}, {"tag": "h3", "text": "Battle of Scrim Island"}, {"tag": "h4", "text": "Admiral Durril's assault"}, {"tag": "p", "text": "Admiral Durril commanded the One Oh Third Task Force's assault on Scrim Island from the Imperial Star Destroyer Judicator. The Judicator and its escort Imperial light cruisers and frigates bombarded Scrim Island but were unable to pierce through the deflector shield. During the assault, the insurgent commanded alternated between firing the island's ion cannons and closing and retracting the shields. These tactics succeeded in baffling Admiral Durril and his task force, who were unable to hit the enemy cannons. The Batonn insurgents also managed to inflict damage on the Judicator and its escort ships. Instead of adjusting to his opponents' tactics, Admiral Durril continued his ineffective attacks."}, {"tag": "p", "text": "Meanwhile, eight small freighters took off from Scrim Island and headed to the main continent. Seven freighters flew under low cover to avoid detection while the eighth rose into space. With Durril's portside escort ships was immobilized by ion damage, the Batonn insurgents unleashed their turbolaser cannon on the Judicator. The insurgents then immobilized the starboard escort ships with their western ion cannon. They then used their turbolaser cannon to damaged the Judicator's superstructure, weapons, and systems."}, {"tag": "h4", "text": "Spying on Nightswan"}, {"tag": "p", "text": "Unknown to both Durril and the Batonn insurgents, the space battle was being watched by Admiral Thrawn and Commander Vanto in their captured smuggling freighter Slipknot. Taking advantage of a loophole in Fleet Admiral Donassius' orders, Thrawn had dispatched Commander Karyn Faro and the Ninety-Sixth Task Force to deal with the Sammun insurgents. He also deployed Captain Brento's light cruiser Shyrack to monitor the seven freighters' movements. Posing as the smuggler \"Horatio Figg\", Vanto managed to establish contact with the insurgents under the pretext of buying stolen Imperial weapons."}, {"tag": "p", "text": "Following the insurgents' coordinates, Eli and Thrawn flew the Slipknot into a Nomad starship. While Thrawn hid aboard the freighter to plan their escape, Vanto met with the insurgent leader Nevil Cygni, who identified himself as Nightswan. Vanto learned that Nightswan was behind their earlier encounters with insurgents and that he had engineered the Battle of Scrim Island to defeat Thrawn. Thrawn managed to stage a distraction by blowing up the Slipknot's engine compartment. Having collected the necessary intelligence, the two then escaped aboard a stolen freighter. Meanwhile, Captain Brento evacuated Admiral Durril's battered forces."}, {"tag": "h4", "text": "Thrawn's assault"}, {"tag": "p", "text": "After learning that Thrawn had gathered intelligence on the Batonn insurgents, Donassius assigned Thrawn the task of taking back Scrim Island. Thrawn's Ninety-Sixth Task Force consisted of the Star Destroyer Chimaera and three light cruisers Shyrack, Flensor, and Tumnor, and two frigates. Based on the intelligence he had gathered during their undercover mission, Thrawn devised a strategy to break the siege of Scrim Island. To trick the insurgents into underestimating his forces, Thrawn ordered the three light cruisers to descend into Batonn's atmosphere. As planned, the light cruisers' were struck by the insurgents' ion cannons, which disabled their primary weapons and main drives. However, their communications, secondary weapons, and auxiliary drives still remained intact."}, {"tag": "p", "text": "Thrawn shifted the light cruisers and the Chimaera towards an angle that prevented the insurgents from bombarding his task force. Using the light cruisers as a shield, Thrawn used the Chimaera's turbolaser crew to bombard the waters around Scrim Island, generating tsunamis that overwhelmed the insurgents' ion and turbolaser cannons. As a result, the Scrim Island commander surrendered to Thrawn and lowered the island's shields. Imperial forces captured the insurgents and freed the hostages. Following the battle, Thrawn also ordered Commander Faro to tractor the three light cruisers back into space for repairs. Vanto also reported the pacification of the Scrim Island insurgents to the galactic capital Coruscant. While the Battle for Scrim Island was over, Thrawn warned that the \"war for Batonn\" had not yet been won."}, {"tag": "h3", "text": "Siege of the Creekpath mine"}, {"tag": "h4", "text": "Continuing the hunt"}, {"tag": "p", "text": "Using Captain Brento's information, Commander Vanto was able to track the shipping vectors of the seven freighters to the Creekpath Mining and Refining complex, which lay near Paeragosto City on the main continent. Nightswan and his followers had retreated into the mining complex where they set up their base within the mine. They were joined by many local inhabitants who had grievances with the Galactic Empire and its representative Governor Restos. Since Governor Restos had requisitioned most of the city's soldiers for his personal use, the Batonn insurgents were able to peacefully take over the mine and shelter beneath its DSS-02 regional shield. In response, Imperial ground forces and the Batonn Defense Force blockaded the perimeters of the shield."}, {"tag": "p", "text": "While Nightswan had hoped that the Empire would withdraw from Batonn, Thrawn was determined to end the insurgency. Thrawn's command of the Creekpath complex siege was complicated by the Imperial Security Bureau's interference. Seeking to rescue her parents Talmoor and Elainye Pryce, Governor Arihnda Pryce of Lothal convinced Colonel Wullf Yularen that she could infiltrate the mining complex and gather intelligence on the insurgents' defenses. Yularen agreed on the condition that she was accompanied by Agent Gudry, who was tasked with gathering intelligence on the insurgents' defenses and planting explosives on the deflector shield generator. This would enable Thrawn's orbiting task force to take out the insurgents. With Thrawn's connivance, Pryce and Gudry managed to land at Paeragosto City and travel to the Creekpath mine."}, {"tag": "p", "text": "Thrawn also brought the damaged light cruisers Flensor, Shyrack, and Tumnor into low orbit for repairs. The ships were surrounded by various repair barges and ships. Thrawn had arranged the light cruisers at the ends of a wide equilateral triangle. While it appeared that Thrawn had left the light cruisers in a vulnerable position, he had secretly outfitted the repair barges with TIE fighters loaned by Admiral Durril. Thrawn planned to use the light cruisers as a bait to draw an attack from Nightswan's forces. Thrawn's unusual strategy alarmed Colonel Yularen but Commander Vanto reassured him that Thrawn knew what he was doing."}, {"tag": "h4", "text": "The elusive peace"}, {"tag": "p", "text": "Meanwhile, Pryce and Gudry managed to find Pryce's parents. Though they expressed sympathy for the insurgents, Talmoor agreed to lead Gudry into the mine, where the insurgents had set up base, under the pretext of finding Gudry's friend \"Blayze Jonoo.\" Unknown to Talmoor, this was a ruse for Gudry to collect intelligence and to plant explosives. However, Pryce then reneged on her agreement to help Gudry and returned home to evacuate her parents. Despite being abandoned by Pryce, Gudry managed to attached explosive caps to the deflector shield and a cache of explosives. He also discovered that the insurgents had several police gunships and skim fighters. Gudry reported his successful mission and findings to Colonel Yularen."}, {"tag": "p", "text": "Elsewhere, Thrawn made contact with Nightswan and arranged to meet at a nearby field to find a peaceful solution to the siege. As a seasoned officer, Thrawn wanted to avoid causing high civilian casualties in the densely populated Creekpath mining complex. Thrawn tried to present the Empire as a lesser evil to the chaos and \"evil things\" in the Unknown Regions but Nightswan was determined to bring down the Empire in order to create a better galactic order. Thrawn then offered Nightswan a place among the Chiss Ascendancy. Despite his respect for Thrawn, Nightswan turned down his offer since he was unwilling to abandon his followers to the \"tender mercies\" of the Empire and Governor Restos. Still, Nightswan exacted a promise from Thrawn to protect the civilians of Creekpath."}, {"tag": "p", "text": "Shortly later, Thrawn was picked up by Colonel Yularen, who chastised the Admiral for parleying with the enemy. While the two were close friends, Yularen warned that such contacts could be misconstrued as treason. When Colonel Yularen questioned him about the unusual positioning of the light cruisers, Thrawn reassured him that the cruisers were in safe hands. Now that Gudry had attached the explosives to both the deflector shield and explosives, Thrawn returned to the Chimaera to resume command."}, {"tag": "h4", "text": "Blood and fire"}, {"tag": "p", "text": "Meanwhile, a vindictive Gudry confronted Pryce before she and her parents could flee to safety. To avoid drawing attention, he demanded that she leave her parents behind if she wanted to live. Pryce refused to abandon her parents and fought with Gudry. Following a struggle, she shot him dead. Unaware of Pryce's actions, Thrawn convinced Colonel Yularen to loan him a squad of soldiers to rescue Pryce and Gudry. Thrawn also ordered the Imperial ground forces on the northern and western frontiers of the Creekpath mining complex to begin harassing the Batonn insurgents with limited fire."}, {"tag": "p", "text": "Shortly later, a fleet of thirty insurgent starships emerged from hyperspace and approached the damaged light cruisers, intending to finish them off. Thrawn then deployed the TIE fighters hidden inside the repair barges and bombarded the enemy starships with the Chimaera's turbolaser cannon. Meanwhile on Batonn, Pryce and her parents managed to escape the insurgent picket lines to the safety of the Imperial lines. After learning that Colonel Yularen had sent a squad to find Gudry, she detonated the remote cap in the explosives cache. This generated an explosion which devastated the mine, killing all the insurgents inside and numerous civilians."}, {"tag": "p", "text": "In space, the remaining insurgent ships retreated after learning of the bombing of the Creekpath facility. Thrawn allowed the stragglers to flee in order to demoralize their compatriots. Despite the Empire's victory over the Batonn insurgents, Thrawn was displeased at the high loss of civilian lives. He ordered the ground forces to search and rescue survivors from the ruined complex. The deflector shield however had confined the blast within the Creekpath complex and civilian housing. Pryce's parents were horrified at what they believed to be the Empire's actions but Pryce blame the insurgents in an attempt to deflect her own culpability."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The bombing of the Creekpath Mining and Refining complex ended the Batonn insurgency in the Galactic Empire's favor. Despite the confirmed deaths of Nightswan and his fellow insurgents, Admiral Thrawn and Colonel Yularen were distressed by the high civilian death toll. Governor Pryce theorized that the insurgents had captured Agent Gudry and that he had blown the mine up in an attempt to prevent his capture. Yularen was skeptical of her account since he did not believe that Gudry would have detonated the explosives cache first. Since the explosion had destroyed much of the evidence, Yularen, Thrawn, and Commander Vanto were forced to accept Pryce's account. While the Imperial Senate ordered an inquiry, Yularen was skeptical they would find sufficient evidence to reconstruct what actually transpired that night."}, {"tag": "p", "text": "Following the Batonn insurgency, Governor Pryce convinced Thrawn to take credit for the victory at Batonn. She also offered to serve as his political adviser and to smooth his transfer to the high-powered Seventh Fleet. While Thrawn agreed to work with Governor Pryce due to her political savvy, he and Commander Vanto privately confided that Pryce was somehow complicit in the Creekpath bombing. After receiving news of the Imperial victory at Batonn, Emperor Palpatine invited Thrawn for a private audience at the Imperial Palace on Coruscant. In recognition of his services, Thrawn was promoted to the rank of Grand Admiral. During the meeting, Thrawn confirmed Nightswan and Vanto's theories that the Empire had been siphoning off metal resources for a mega-project known as the Death Star. He also met with the mysterious Darth Vader."}, {"tag": "p", "text": "Grand Admiral Thrawn's new-found prestige following the Batonn insurgency led Governor Pryce to petition Governor Wilhuff Tarkin to reassign Thrawn and the Seventh Fleet to the Lothal sector. This brought Thrawn into conflict with the Phoenix Cell, which had established a base in that sector. While the ISB Agent and rebel spy Alexsandr Kallus expressed concerns that civilian casualties outweighed the insurgents, Pryce rationalized that they were within \"acceptable margins\" since the rebel presence in the Batonn sector had been destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Batonn insurgency was first indirectly reference in the Star Wars Rebels Season Three premiere \"Steps Into Shadow'\", which debuted at Celebration Europe on July 16, 2016. The conflict was later explored in further depth and detail in Timothy Zahn's 2017 novel Thrawn, which serves as a Canonical origins story for Thrawn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}