{"url": "Batonn_sector_insurgency", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Nightswan's campaign", "Category:Rebellions and uprisings"], "nodes": [{"tag": "h1", "text": "Batonn sector insurgency"}, {"tag": "p", "text": "An insurgency was fought in the Batonn sector between a coalition of insurgent groups on the planets Batonn, Denash, and Sammun against the rule of the Galactic Empire. The insurgent coalition was led by Nightswan, a shadowy insurgent leader who wanted to overthrow the Empire. The Batonn sector insurgency came to a violent end at the siege of the Creekpath Mining and Refining complex on Batonn. Following Nightswan's death there, the surviving insurgents fled into space. Due to his role in eliminating the rebel presence in the Batonn sector, the Emperor promoted Thrawn to Grand Admiral and placed him in command of the Seventh Fleet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, the pirate and insurgent leader Nevil Cygni (or \"Nightswan\") led an insurgent campaign against the Galactic Empire; which he regarded as a corrupt tyranny. Nightswan engaged in a range of activities including smuggling doonium, iridium, and tibanna to bankroll his campaign against the Empire. Nightswan's rebellious activities took the form of operating a spy ring on Coruscant and liberating enslaved Wookiees. Nightswan's activities drew the attention of the Chiss Imperial Navy officer Mitth'raw'nuruodo, his colleague Eli Vanto, and Imperial Security Bureau Colonel Wullf Yularen, and the ambitious Lothalite Governor Arihnda Pryce."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the attempted secession of the Botajef, the Batonn insurgents under Nevil Cygni captured and took hostage the Imperial garrison on Scrim Island. In response, Fleet Admiral Jok Donassius dispatched Admiral Durril to retake the island. Durril's One Oh Third Task Force was repelled by the insurgent forces on Scrim Island. Meanwhile, other elements of the Imperial Navy led by Admiral Kinshara and Commander Karyn Faro neutralized the insurgent forces on Denash and Sammun. However, most of the Denash insurgents managed to evacuate to Batonn's Creekpath Mining and Refining complex where they joined forces with the Batonn insurgents under Nightswan."}, {"tag": "p", "text": "Thrawn's Ninety-Sixth Task Force later managed to use cunning tactics to neutralize Scrim Island's defenses and force the surrender of the insurgents there. Thrawn's attempts to end the siege of the Creekpath complex peacefully were undermined by an Imperial Security Bureau operation to plant explosives in the Creekpath and Governor Pryce's ignition of the explosives to hide her murder of the ISB Agent Gudry. The resulting explosion wiped out the Batonn insurgents and killed many civilians."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite the high death toll, the pacification of the Batonn sector was considered an Imperial victory because the rebel presence in the Batonn sector had been eliminated. As a reward for his services, the Emperor promoted Thrawn to Grand Admiral and placed him in command of the Seventh Fleet. Due to his stellar reputation, Governor Pryce's enlisted Thrawn's help in combating the Phoenix Cell and Spectres rebel cell in the Lothal sector. Following a prolonged campaign, Thrawn succeeded in identifying the Phoenix Squadron's base on Atollon and inflicted heavy casualties on the rebels during the Battle of Atollon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Batonn sector insurgency was first indirectly referenced in the Star Wars Rebels Season Three television movie Star Wars Rebels: Steps Into Shadow, which premiered at Celebration Europe on July 16, 2016. It later appeared in Timothy Zahn's 2017 novel Thrawn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}