{"url": "Star_Wars_(1977)_69", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 69"}, {"tag": "p", "text": "Star Wars 69: Death in the City of Bone is the sixty-ninth issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Continuing where the last issue left off, Leia Organa and C-3PO have just been captured by the Galactic Empire, due to the duplicity of the bounty hunter, Dengar. Leia and C-3PO are escorted to the City of Bone in a transport barge where they meet with the Imperial Commander, the Suprema, who assures them that he will soon crush the resistance on Mandalore and kill Fenn Shysa. As Dengar communicates with the Suprema about tracking down Shysa, Princess Leia and C-3PO are led away by stormtroopers. However, one of the stormtroopers is in fact Fenn Shysa in disguise, and he frees the two Rebels. Shysa explains that after Organa had knocked him unconscious, he had awoken to find the princess being captured by the Imperials. Discovering a perfect way to infiltrate the base, Shysa had knocked out one of the perimeter guards and took his place. Shysa tells the princess that he will help her recapture Dengar if she will help him free his friend, Tobbi Dala, from his cell in the City of Bone. After Leia agrees, the group make their way to Dala's cell and mount a rescue. With the two Mandalorian friends reunited, the group decides to mount an attack on the fortress."}, {"tag": "p", "text": "Shysa shoots a flare out the window of the city, triggering an assault by his forces. In the commotion that follows, Dala commandeers an airspeeder, and the group make their way back to the Suprema's headquarters. As a shoot-out ensues with the Imperial forces, Organa and Dala destroy the control box powering the energy links of the Mandalorian slaves. Free of their restraints, the Mandalorians rise up against their captors, causing a riot to break out in the city. The rebels use the distraction to enter the Suprema's headquarters, but find the Imperial leader waiting for them. The alien shoots Dala in the chest, mortally wounding him, but the rest of the Rebels are able to stop him from doing any further damage. Dala is near death, but he promises his old friend that he'll open the doors of the city, letting the Mandalorian slaves escape to join up with Shysa's forces who are arrayed outside. True to his word, Dala opens the doors, and the Mandalorians are allowed to escape. As Princess Leia and Shysa escape in their airspeeder, Dala closes the doors, preventing the pursuing Shrike Squadron from pursuing them. The squadron smash headlong into the sides of the city, creating a chain reaction of exploding fuel and ammunition, incinerating the inside of the city and killing both the Suprema and Tobbi Dala. Back at the Mandalorian camp, Shysa forces Dengar to talk by threatening to kill him. Dengar claims that he was not the one working with Fett, but that he overheard someone telling Fett about a hideout in the near the Anga system. Although the mission to find Fett had been a wild goose chase, Leia takes solace in the fact that the Empire's presence on Mandalore has been crippled."}, {"tag": "p", "text": "Meanwhile, on the Wheel, Lando Calrissian and Chewbacca are pursuing Bossk, believing that he might be the bounty hunter who had worked with Fett during the search for the Millennium Falcon. The duo have found a patron, Vorol, who knows where Bossk is, and Chewbacca threatens him until he gives up the information. After hearing the location, Calrissian is shocked. \"Aw, no. No! Not…there!\" he proclaims."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The animal from which the City of Bone is made out of is never identified in this issue. It was eventually revealed to be a mythosaur in the Star Wars Insider article, The History of the Mandalorians."}, {"tag": "p", "text": "The New Essential Chronology placed this two-part story just prior to Star Wars: Shadows of the Empire."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}