{"url": "Star_Wars_(1977)_71", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 71"}, {"tag": "p", "text": "Star Wars 71: Return to Stenos is the seventy-first issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Lando Calrissian, Luke Skywalker, Chewbacca, and R2-D2 land on the planet Stenos in the Millennium Falcon, intent on tracking down IG-88 and Bossk, who they believe one might have been working with Boba Fett during the search for the Millennium Falcon. They hope that one of the hunters will lead them to Fett, who still has Han Solo captive, frozen in carbonite. As Lando and Luke prepare to enter the capital city, Chewbacca and Artoo stay behind, as droids and Wookiees are uncommon on the planet, and they don't want to draw unwanted attention. The duo decide to start their search in the nearest bar, but as soon as they settle in, Lando is recognized by Barpotomous Drebble, a former enemy of Lando's who yells out that he will give 10,000 credits to the person who captures him. Although Calrissian assumes that no one will take up Drebble's offer, the tavern is soon ablaze with blasterfire, as every patron tries to claim the bounty. As the two Rebels cower behind a table, Skywalker decides to take action, using his lightsaber to cut through the support pillar of the cantina, collapsing a good portion of the building. As the duo make their escape, they inadvertently spot Bossk among the crowd and begin to pursue him. However, their chase leads them right back to the front of the bar they had just vacated, and a new group of people, who want to claim Drebble's bounty."}, {"tag": "p", "text": "The two Rebels take off running, but get split up. Skywalker finds himself in an alley, where he is surprised to see Rik Duel and Dani, alive and well. Rik explains how he and his gang escaped from the Stenaxes by blaming Quorl Matrin and running when the Stenaxes attacked. Although Skywalker is immediately distrustful of Duel, the smuggler claims that he holds no grudge against him and that he needs his help in finding Chihdo, his Rodian partner who had inexplicably gone missing. Skywalker, Dani, and Duel make their way through the streets of Stenos, but before they have even begun to search, Luke is pulled aside by Lando, who was hiding in a different alley. Lando explains to Luke that he's found Han. Lando points out a carbonite slab being hauled through the streets of the city, and the two Rebels begin to tail it, hoping to see their friend at last. The two follow the carbonite block into a large building, where it has been set down in a large room. However, as they approach the slab, they find that the person trapped in the carbonite is not Han, but instead, Chihdo. Bossk and IG-88C had used the carbonite block as a lure, to draw the Rebels into their camp. As Luke and Lando turn to leave, they find that they are surrounded by a large group of bounty hunters led by Bossk, who points at the two Rebels and states, \"You're surrounded.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}