{"url": "Star_Wars_(2015)_12", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 12"}, {"tag": "p", "text": "Star Wars 12 is the twelfth issue of the Marvel comic book series Star Wars and the fifth and final issue of the series' second story arc, Showdown on the Smuggler's Moon. The issue, written by Jason Aaron with art by Stuart Immonen, was released on November 18, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Han to the rescue"}, {"tag": "p", "text": "Holding the higher ground, Han Solo demands that Dengar step away from Chewbacca. Princess Leia Organa adds that his \"wife\" has an itchy finger. Undaunted, Dengar threatens to hurl a thermal detonator at him. However, Chewbacca grabs Dengar and throws him over the edge of the building. Dengar disappears in a ball of explosion."}, {"tag": "p", "text": "Han checks on Chewbacca and asks what he is doing on Nar Shaddaa. The Wookiee responds that he is rescuing Skywalker. C-3PO asks if he saved the day while Leia convinces them to follow the squadron of TIE fighters."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "As TIE fighters converge on the Palace of Grakkus the Hutt, the roggwart \"Kongo\" grabs Skywalker with one of his cybernetic arms. As the crowd cheers, Skywalker wishes that Ben could perform one of his miracles. At that point, Kongo is shocked by his shock collar."}, {"tag": "p", "text": "Before Grakkus can react, his three IG-100 MagnaGuards are destroyed by Gamemaster, who announces that his arena is closed and that the Hutt is under arrest. TIE fighter pilots enter Grakkus' viewing box and the arena. Meanwhile, Squad Five eliminates the remaining MagnaGuards while R2-D2 retrieves Skywalker's lightsaber from Grakkus' storeroom."}, {"tag": "p", "text": "As the TIE pilots lead Grakkus into the arena, the Hutt protests at Gamemaster's lack of \"gratitude.\" The Imperial agent replies that only a Hutt would count not killing him as \"kindness\" and reveals that he is an Imperial spy. Gamemaster says that the Empire is interested in his Jedi collection. Grakkus threatens to unleash the crowd on the Imperials but Gamemaster responds that he would not hesitate to shoot him."}, {"tag": "p", "text": "Grakkus then reveals his secret weapon and triggers \"Arena Protocols Grakkus Five\" a localized electromagnetic pulse weapon that disables the Imperials' blasters and communications. Grakkus uses his physical strength and cybernetic legs to attack the Imperial TIE fighter pilots, revealing himself as a fighter. As the crowd bets on Graballa, a TIE fighter pilot says they need back up but Gamemaster says that the EMP has shortened the comms."}, {"tag": "p", "text": "Just then, Kongo, whose shock collar has been deactivated, attacks the Imperials. Skywalker is grabbed by two TIE fighter pilots. However, R2-D2 fires Skywalker's lightsaber towards him. Skywalker activates his weapon and strikes the TIE pilots down."}, {"tag": "h3", "text": "Rescuing Skywalker"}, {"tag": "p", "text": "Meanwhile, Solo, Leia, Chewbacca, and Starros enter Grakkus' palace just as a crowd of spectators flee the rampaging roggwart \"Kongo.\" Sana insists on staying with Solo, unwilling to lose her \"investment.\" Solo and his comrades attempt to shoot Kongo but their blasters don't work. Leia sees stormtroopers up ahead. Just then, they encounter R2-D2 who throws them several lightsabers."}, {"tag": "p", "text": "Armed with lightsabers, Chewbacca, Solo, and Princess Leia take down several stormtroopers. Luke Skywalker confronts Gamemaster, who tackles him to the ground. Gamemaster reveals himself as an undercover stormtrooper and intends to take Skywalker into Imperial custody. However, he is distracted when Grakkus grabs Gamemaster, seeking to feed him to his lizards. However, Gamemaster uses his lightsaber to sever Grakkus' mechanical limbs, throwing him to the ground."}, {"tag": "p", "text": "Skywalker reunites with Han and R2-D2, who has recovered Ben's journal. Skywalker wants to recover the holocrons from Grakkus' museum but is forced to flee when stormtroopers armed with operational blasters storm the arena."}, {"tag": "p", "text": "Meanwhile, Leia rescues Sana Starros from the rubble. Starros reveals that she is not really Solo's wife and that their marriage was part of a robbery that went sour. As Leia helps her out of the arena, Starros toys with the idea of renegotiating their deal. After escaping the rampaging roggwart, the rebels and Starros depart Nar Shaddaa on the Millennium Falcon and Volt Cobra"}, {"tag": "h3", "text": "Reporting to Lord Vader"}, {"tag": "p", "text": "While stormtroopers take Grakkus into Imperial custody, Sergeant Kreel, who has abandoned his pseudonym Gamemaster, reports to Darth Vader. He tells the Sith Lord that Grakkus has helped them rid the galaxy of more scattered traces of the Jedi but that the \"boy\" is still at large."}, {"tag": "p", "text": "Vader questions him about the boy's identity but Kreel is unable to name the boy. Vader, crushes a holocron in his hand, responds that the boy will be crushed just like the rest of the Rebellion and asks the Sergeant to tell him everything he knows. Meanwhile, Skywalker reflects on Kenobi's journal aboard the Falcon."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}