{"url": "Star_Wars_(1998)_28", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Star Wars (1998) 28"}, {"tag": "p", "text": "The Hunt for Aurra Sing, Part 1 is the twenty-eighth issue in the Star Wars: Republic series of comics. It was published on March 28, 2001 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Get ready for some electrifying lightsaber battle action! Aurra Sing arrives on Coruscant with a mean streak, killing Jedi within the very shadows of the Temple. The Jedi Council must now decide how to deal with the infamous bounty hunter. Several Jedi Knights volunteer for the honor of bringing Sing to justice. But do they want justice or vengeance? It's going to take more than a grudge to bring down an assassin with a reputation for killing Jedi."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Jedi Masters Peerce, J'Mikel and J'Mikel's Padawan, Xiaan Amersu, are investigating the streets of Coruscant looking for the bounty hunter, Aurra Sing. Aurra is wanted for the deaths of several Jedi. They instead, find the bodies of four eviscerated Republic Peace Officers. Aurra Sing is hiding in the shadows waiting to strike. Leaping down, she slaughters Peerce and J'Mikel with her red lightsabers, but not before J'Mikel burns her across the face with one final, lucky slash. Aurra lets young Xiaan live, due to her age, but she promises to kill her when she is old enough to be a full Jedi."}, {"tag": "p", "text": "Xiaan returns to the Jedi Temple and informs the council of what has transpired. Mace Windu must now decide which Jedi should lead the mission to bring Aurra Sing down. A'Sharad Hett volunteers for the mission, but Mace feels that his vengeful personal history with Aurra Sing will create too much friction. The Jedi known as the Dark Woman enters the room and likewise volunteers to lead the mission, but Mace feels that the Dark Woman's priorities are skewed due to the fact that Aurra was once her Padawan. After much deliberation, it is decided that Ki-Adi-Mundi, A'Sharad Hett and Adi Gallia will lead the mission to capture Aurra Sing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}