{"url": "Star_Wars_(1977)_7", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 7"}, {"tag": "p", "text": "Star Wars 7 is the seventh issue of the Legends comic book series Star Wars. It was co-written by Roy Thomas and Howard Chaykin, with art by Chaykin and Frank Springer, and it was first published by Marvel Comics on October 11, 1977. The issue features the story \"New Planets, New Perils!,\" which was the series' first story set after the events of Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Han and Chewie head out to pay their debt to Jabba, when they're attacked by pirates!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After bidding farewell to their Rebel friends, Han Solo and Chewbacca set out to return to Tatooine to pay off their debt to Jabba the Hutt. En route, they are hijacked by space pirate Crimson Jack and his gang of thugs. The pirates take the reward money given to Han and Chewbacca by the Rebel Alliance for rescuing Princess Leia Organa but spare their lives."}, {"tag": "p", "text": "Forced to lay low because they cannot pay Jabba, the two seek refuge on the planet Aduba-3. There they are hired by Pera, a priest of the Sacred Way, to bury a recently deceased borg. Although they meet with some resistance from the locals who object to having a borg buried in their traditional mound, they do eventually find their way to the burial site. After completing that task, the two smugglers are relaxing in a local cantina, where they are presented with a much deadlier job."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The issue had a shipping date of September 13, 1977, an on-sale date of October 11, 1977, and a January 1978 cover date."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Star Wars 7 features the story \"New Planets, New Perils!,\" which was one of the first installments of what eventually became the Star Wars Expanded Universe. It introduces the characters Crimson Jack and Jolli, who are recurring characters in the series."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}