{"url": "Star_Wars_(2015)_2", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 2"}, {"tag": "p", "text": "Star Wars 2 is the second issue of the Marvel comic book series Star Wars and the second of six issues in the series' first story arc, Skywalker Strikes. The comic continues the events of Star Wars 1 and takes place between the events of Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back. The issue, written by Jason Aaron with art by John Cassaday, was released on February 4, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE GREATEST SPACE ADVENTURE OF ALL TIME CONTINUES!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Clash of the Skywalkers"}, {"tag": "p", "text": "Luke Skywalker does not heed Obi-Wan Kenobi's advice to run from Darth Vader, instead opting to stand his ground against the Sith Lord. Vader is dismissive of Luke's Jedi training, noting that Luke looks like an \"untrained child\" in the way he handles a lightsaber. Nonetheless, Vader appears curious as to the identity of the young rebel."}, {"tag": "p", "text": "Luke angrily blames Vader for the murder of his father, however Vader fails to recognise him to which he notes that he had already murdered too many fathers to remember. Luke then attacks Vader, however his lack of training is no match for the skills of the Sith Lord. Vader easily parries Luke's blows before knocking the young Jedi to the ground and force pulls Luke's lightsaber from his hand."}, {"tag": "p", "text": "Rather than kill Luke, Vader continues to be curious as to who he is and who had sent him to Cymoon 1. In his anger, Luke then reveals that he was at the Death Star when Vader murdered Obi-Wan. Vader then mocks Obi-Wan as a poor example of a Jedi Master, highlighting Luke's lack of ability with a lightsaber as an example. Vader then demands Luke to reveal his knowledge of the Rebellion's plans, the purpose of his mission to Cymoon 1 and the identity of the pilot whom destroyed the Death Star."}, {"tag": "p", "text": "Although threatened with immediate execution by Vader, Luke refuses to reveal any more information to the Sith Lord. Vader, aware of his futile efforts prepares to execute him. However as he is about to deliver the killing blow, he becomes aware for the first time that he is holding onto his old weapon as a Jedi."}, {"tag": "h3", "text": "Hijacking the AT-AT walker"}, {"tag": "p", "text": "Vader, startled and confused by this revelation, momentarily hesitates in delivering the killing blow. This distraction is just long enough for Han Solo, controlling the rogue AT-AT walker to save the day. The AT-AT crashes through the room in which Luke and Vader were having their showdown. Both Luke and Vader are knocked clear of one another."}, {"tag": "p", "text": "Han alerts Luke over the intercom that he is attempting to clear a path through the facility and that he should join the rescued prisoners in following the AT-AT out of the facility. Princess Leia Organa meanwhile criticizes Han's clumsy piloting of the AT-AT to which Han blames the poor handling on bad design. Leia angrily notes that he nearly stepped on a Twi'lek prisoner and should instead focus on trying to step on the startled Vader. Han, however notes he is having difficulty enough trying to get out of the facility rather than focusing on trying to step on people. The two continuously argue whilst trying to pilot the AT-AT."}, {"tag": "p", "text": "Vader quickly recovers and orders the stormtroopers to kill all the prisoners and the rebels. In the confusion, Luke asks Obi-Wan for guidance in killing Vader and preventing any more of the prisoners from dying. However he realizes this is in vain, seeing Vader easily slaughtering the prisoners with both his and Luke's lightsaber, Luke ponders to himself \"What have I done?\"."}, {"tag": "p", "text": "Meanwhile in the AT-AT, Leia continues to berate Han to which she observes that the cannons for the walker are still inactive. Han confidently reassures her that R2-D2 is working on it. However even R2-D2 appears to be struggling to activate the cannons, to which Leia hopes and pleads over the intercom for C-3PO to arrive in the Millennium Falcon quickly."}, {"tag": "h3", "text": "C-3PO's misadventure"}, {"tag": "p", "text": "However, C-3PO is nowhere near being able to rescue his crew, noting that the local species had arrived and had began scavenging the Falcon for its parts. Leia demands that Threepio find any way possible to get to the facility as quickly as possible."}, {"tag": "p", "text": "A more than hesitant Threepio complies, grabbing a cloak to disguise himself from the scavengers as well as a small blaster pistol. He emerges from the Falcon where he politely asks the scavengers to refrain their activities before doing his best effort to intimidate them into thinking he is \"seriously armed\"."}, {"tag": "p", "text": "The ploy, however is a complete failure when Threepio clumsily drops the blaster and his cloak falls off. Threepio immediately announces his surrender. When the scavengers attempt to communicate with him, Threepio fails to recognize their language despite his incredible language skills. The scavengers thereafter quickly decide to blast him."}, {"tag": "h3", "text": "Finding a speeder bike"}, {"tag": "p", "text": "Meanwhile, Luke is trying to round up the few surviving prisoners, however his efforts continue to be in vain as Vader and the stormtroopers continue to find and slaughter the prisoners with ease. Luke begins to lose all hope, silently communicating to Obi-Wan that he is not his father and that he just a stupid farm boy."}, {"tag": "p", "text": "However he suddenly notices a group of parked 74-Z speeder bikes. Remembering his speeder bike qualities, he rushes and hops onto the bike to which he charges Vader and the stormtroopers at full speed. Cannons blazing, Luke wipes out the stormtroopers standing around Vader."}, {"tag": "p", "text": "As Luke speeds away, Vader becomes noticeably impressed at Luke's flying skills to which he further ponders who the boy is and Obi-Wan's interest for him. However he is not given long to ponder as Han has finally turned his attention to doing his best to use the AT-AT to step on Vader."}, {"tag": "p", "text": "As Han raises the AT-AT's front right leg to step on Vader, he is suddenly bewildered when the leg refuses to go back down to earth to crush Vader. Leia notes that Vader is using the Force to hold the leg in the air. Han does his best to reason that what Vader is doing is not possible. However Vader's Force powers are undeniable."}, {"tag": "h3", "text": "The heat of battle"}, {"tag": "p", "text": "However at that moment, Artoo had finally managed to get the blaster cannons working to which Han desperately fires the cannons at Vader. Vader taking hit from the blaster cannons is flung clear and is forced to break his hold on the AT-AT. The walker now free finally is able to smash its way out of the facility."}, {"tag": "p", "text": "Leia, so happy at Artoo's work notes that she could kiss him to which arouses a jealous response from Han. He then turns his attention to angrily trying to communicate with Threepio. Threepio, however, is being rounded up in pieces by the scavengers and notes to himself that he is going to shut down for a while."}, {"tag": "p", "text": "In the confusion, Vader lost his grip on his old lightsaber to which Luke quickly retrieves. Han notes over the intercom that Vader had been destroyed, Luke whom is on his way to regroup with the AT-AT is however skeptical that Vader was so easily defeated."}, {"tag": "p", "text": "Vader, however was lucky to survive the incident with the AT-AT, he had been submerged under the rubble of the caved in hanger facility and his helmet had been blown off his head after the blast. He forced his way out of submersion and desperately scrambles to find and put on his helmet. However he isn't able to do so without a single stormtrooper, much to his horror seeing the face of the horribly scarred Sith Lord. Vader, leaving no witnesses to his true appearance, quickly killed the lone stormtrooper, twisting and snapping his neck."}, {"tag": "p", "text": "He quickly regains his composure to which he is contacted over the intercom by Overseer Aggadeen whom remarks the core had gone into meltdown to which he pleaded that they evacuate the facility. Vader, however cooly denies the request noting that death would only await Aggadeen anyway if he was unable to get the reactor under control. He orders the remaining the stormtroopers to regroup and hunt down the rebels. Vader commanded his troops to wipe out all the rebels with the exception of the young rebel he had previously encountered."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}