{"url": "Star_Wars_(1998)_22", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Star Wars (1998) 22"}, {"tag": "p", "text": "Twilight, Part 4 is the twenty-second issue in the Star Wars: Republic series of comics. It was published on September 27, 2000 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "After finally finding his Padawan apprentice, Aayla Secura, Jedi Quinlan Vos uncovers a chain of corruption and vice that reaches much further than he ever thought possible... leading all the way to the Galactic Senate on the planet of Coruscant! It's up to Quinlan to find the parties responsible for the kidnap and torture of his Padawan and bring them to justice. Make sure you don't miss this exciting final chapter in the Twilight story arc."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Confronting Pol Secura proves fruitful, as he reveals the location of his niece Aayla, and the name of his secret patron, a senator on Coruscant named Chom Frey Kaa. When Quinlan Vos attempts to kill Pol, Aayla sends out an instinctive force blast, which knocks Pol Secura and Quin over a high ledge. As Vilmarh Grahrk saves Quin, Secura falls to his death. As Quin and Villie flee the planet, a message from Jedi Master Mace Windu instructs him to return to the Jedi Temple on Coruscant. Quin agrees, but says that he must find the one behind the glitteryll conspiracy first. At Villie's hideout on Coruscant, the Devaronian uses a blaster to stun Quin, putting his plan in motion. Villie turns the Jedi over to the corrupt senator Kaa, and after confirming his payment, releases Quin. Just then, Mace Windu arrives with Villie's droid, who had recorded the Senator's words. When Quin attempts to kill the Senator, a lightsaber duel between him and Master Windu ensues. As Windu fights off the amnesiac Jedi, he convinces him to submit for retraining. The Jedi agrees, and returns with him to the Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}