{"url": "Star_Wars_(1977)_9", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 9"}, {"tag": "p", "text": "Star Wars 9 is the ninth issue of the Legends comic book series Star Wars. It was written by Roy Thomas, illustrated by Howard Chaykin, and first published by Marvel Comics on December 13, 1977. It features the story \"Showdown on a Wasteland World!,\" in which the Star-Hoppers of Aduba-3 defend the village Onacra from the Cloud-Riders."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When the High-hounds attack, a mythical monster is summoned that may mean the end for a village as well as Han and Chewie!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo, Chewbacca, and the Star-Hoppers of Aduba-3 arrive at Ramiz's village Onacra, only to find it under attack by flying High-hounds. They repel the beasts, saving the life of a young girl named Merri, who is the daughter of Oncho, the village spokesman. Their relief is short-lived as Serji-X Arrogantus and his Cloud-Riders attack. The Star-Hoppers valiantly defend the village from the attack, but not without cost, as FE-9Q is destroyed in the fray. However, Merri's grandfather the Old One, a shaman, dismisses the hired spacers' help and summons a large, mythical reptilian monster called the Behemoth from the World Below to handle the invading Cloud-Riders."}, {"tag": "p", "text": "Meanwhile, Luke Skywalker informs Leia Organa that he has found a new location for the Rebel Alliance base in the Drexel system. The transmission suddenly ends, and a worried Leia sets out to find Luke."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Roy Thomas was the writer/editor on this issue. Howard Chaykin and Tom Palmer were the illustrators, Tom Palmer the colorist, John Costanza the letterer, and Archie Goodwin the consulting editor on this issue. This issue includes a special pin-up page of Han, Chewbacca, Luke, and Leia drawn by Howard Chaykin."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}