{"url": "Star_Wars_(1998)_41", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Star Wars (1998) 41"}, {"tag": "p", "text": "The Devaronian Version, Part 2 is the forty-first issue in the Star Wars: Republic series of comics. It was published on May 8, 2002 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "At last—the truth about how Villie wound up on the prison planet Kiffex, the truth on how he defeated a Dark Jedi and duped the Jedi for his freedom, and the truth about why he took Quinlan Vos as his apprentice. Well, sort of the truth. Well, okay, maybe not the truth at all. It's the second part of THE DEVARONIAN VERSION, our rogue Vilmarh Grahrk's side of the story thus far. A good place for new readers and a fun revision for long time readers. And if you believe this, Villie has a nice moon called Nar Shaddaa he would like to sell you!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Vilmarh Grahrk continues to relate the story of his work for \"Bobo.\" As the Yinchorri attack the Jedi Temple, Bobo steals into the inner sanctum of the Temple. Meanwhile, at the Yinchorri base, the Jedi strike team is able to stop their forces, but at the same time, according to Villie, infighting begins among the Jedi. Shortly after, Villie supposedly finds the Jedi, and offers to help them get their treasure back, for a price. Next, Villie tells how he tracked down Bobo, and extorted the Jedi treasure from him, after which he let his stalking onsonker eat Bobo. He then returns the treasure to the grateful Jedi. Villie then details his relationship with one Quinlan Vos. He tells of how Vos was a former Guardian, kicked out of the service for his alcohol problem, and how the two of them perpetrated a scam with Vos posing as a Jedi, until Vos became too arrogant. Villie claimed that in an attempt to prove he really was a Jedi, Vos demanded Grahrk shoot him, so he could parry the blast. However, according to the Devaronian, Vos failed, and was killed in the attempt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}