{"url": "Star_Wars_(1977)_64", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 64"}, {"tag": "p", "text": "Star Wars 64: Serphidian Eyes is the sixty-fourth issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Princess Leia Organa learns that the monarch of Serphidi, King S'Shah, is entering into talks with the Galactic Empire to establish an Imperial base on their planet. She sends Luke Skywalker, Cinda Tarheel and Berl to Serphidi on an information-gathering expedition."}, {"tag": "p", "text": "As the Rebel pilots reach the Belial system, a squad of Imperial TIE fighters come out of Serphidi's shadow and attacks them. One of the fighters damages Captain Tarheel's S-foils forcing her to crash land on a mountain butte on the planet's surface. Skywalker and Berl follow her down to make sure that she is safe."}, {"tag": "p", "text": "After confirming that Tarheel is still alive, the Rebels are shocked to discover several Serps advancing on their position riding atop of large, lizard-mounts. One of them fires a blast from an energy-lance, killing Berl. Captain Tarheel is stunned and taken prisoner. The Serps bring her back to the castle of King S'Shah."}, {"tag": "p", "text": "Luke tries to track their movements, but is distracted when he finds a carnivorous plant monster attacking an aging Serp named Elglih. He saves Elglih and takes him to his home in Harmony Glade. Luke learns that Elglih is loyal to the Rebel Alliance and wants to see S'Shah dethroned. The only way to legally unseat S'Shah however is by participating in an event known as a Doom-Joust. Elglih volunteers to partake in the deadly war-games and names Luke as his squire. Luke is offended at the suggestion, but acquiesces."}, {"tag": "p", "text": "On the day that the Doom-Joust is scheduled to commence, Elglih finally realizes that he is too infirm to possibly beat the stronger King S'Shah. Luke volunteers to fight in Elglih's place and openly challenges S'Shah. During the competition, Luke succeeds in dismounting the monarch from his lizard-steed. S'Shah however, withdraws a weapon known as a micro-jolt and prepares to fire it at Skywalker while his back is turned. Elglih warns Luke of the danger, and the young Jedi spins around firing his energy lance killing S'Shah."}, {"tag": "p", "text": "Elglih becomes the new monarch of the Serp people and pledges to keep Imperial influences away from Serphidi. Captain Tarheel is released from the castle dungeons and the two pilots return to the Rebel base on Arbra."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Since this issue was published between Luke's suspension in previous issues #62-63 and his reinstatement in issue #65, the story may actually take place before or after those issues."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}