{"url": "Star_Wars_(1977)_67", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 67"}, {"tag": "p", "text": "Star Wars 67: The Darker is the sixty-seventh issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "As the Rebel leaders discuss a plan to rescue the captured Han Solo; C-3PO, Chewbacca, Plif, and several other Hoojibs venture into the depths of some unexplored tunnels near the hidden Rebel base on Arbra. They are in search of R2-D2 who had wandered off to investigate a faint cry for help, but the cry was a ruse to lure the droid to the home of the Darker. The Darker, a creature made up of dark energies of the ancient civilization of Arbrans, was trapped in an abandoned underground city by a large force field created by the Arbrans. As Threepio and Chewbacca enter the city, they see Artoo has been captured by the dark creature who intends to use the droid's components to develop a mechanism to disable the force field which holds him captive. Chewbacca tries to stop him, but the Darker uses his ability to manipulate emotions to turn the Wookiee against the protocol droid. Threepio is eventually able to free Chewbacca from his possession, and also free R2-D2 from his bonds. He then instructs Chewbacca to capture and hurl the Darker into the force screen realizing this would destroy the creature. Not only is the Darker killed when Chewbacca throws him into the screen, but the cave surrounding the city begins to collapse. The group evacuates the city into a connecting tunnel before it is completely turned to rubble."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In this issue Bossk is referred to as the Monarch of the Qotile system."}, {"tag": "p", "text": "R2-D2 is seen to be dismantled into his component parts (head, trunk, legs) - something Lucasfilm had contemplated doing in Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}