{"url": "Star_Wars_(2015)_32", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)", "Category:Star Wars: The Screaming Citadel"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 32"}, {"tag": "p", "text": "Star Wars 32 is the thirty-second issue of Star Wars and the fourth issue of Star Wars: The Screaming Citadel, a crossover event between Marvel Comics' Star Wars and Doctor Aphra series. Star Wars 32 is written by Jason Aaron and illustrated by Salvador Larroca. It was released on June 14, 2017"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Working together"}, {"tag": "p", "text": "The Wookiee Black Krrsantan attacks Bombinax, smashing through his helmet and chest armor with his bare hands. He then throws the Unidentified Queen of Ktath'atn's lieutenant to his death over the cliff. The protocol droid Triple Zero is excited by the spectacle. Triple Zero then convinces the Abersyn symbiote–infected not to to attack him, Princess Leia Organa, Sana Starros, and Beetee by pointing him to the symbiote–enhanced \"morsels\" inside the Screaming Citadel."}, {"tag": "p", "text": "As Black Krrsantan scurries away, Leia asks what they have unleashed but Starros responds that they had no choice because the Queen of Ktath'atn does not play by any rules. She reasons that they have to fight monsters with monsters in order to save Han Solo and Luke Skywalker. Starros also calls Triple Zero and Beetee \"monsters\", which Triple Zero takes as a compliment. Princess Leia tells them they have to hurry with their mission to rescue Han and Leia. When Starros asks about Dr Aphra, Leia responds that the archaeologist is capable of looking after herself."}, {"tag": "h3", "text": "Prisoners of the Queen"}, {"tag": "p", "text": "In her throne room, the Queen demands that her guards bring her food since the events of the morning have left her famished. Dr Aphra defends blowing up the Queen's breakfast table but reminds the Queen that she tried to infect her with a symbiote. Despite their earlier conflict, the Queen honors her side of the agreement and reactivates the Rur crystal. The Queen warns Dr Aphra that the Citadel harbors many dark secrets and tells her to refrain from asking any more questions if she values her sanity."}, {"tag": "p", "text": "Dr Aphra asks about Luke Skywalker, who is bound to a chair and has a gas-masked around his face. When Aphra asks if the Queen is going to implant a symbiote inside him, the Queen responds that she wants to feast on the Jedi. Skywalker pleads for help but Dr Aphra announces she is leaving. The Queen orders Varroa to guide Aphra through the tunnels to the nearby village. However, she secretly orders him to ensure that her ship does not make it out of orbit."}, {"tag": "p", "text": "Vespinax informs the Queen that Skywalker's friends have a stolen a symbiote and implanted it inside the Wookiee Black Krrsantan, who had been in quarantine and killed Bombinax. The Queen remarks that some species like Wookiees are too strong for even the symbiotes. Unwilling to dissolve the hive's communion since that would entail having to re-infect the villagers, she orders her minions to bring the Wookiee in as many pieces as they can. Vespinax volunteers for the job but the Queen decides to replace her fallen apprentice with the captive Han Solo"}, {"tag": "p", "text": "Despite Solo's protests, the Queen has one of her Abersyn symbiotes pierce Solo's neck with its ovipositor. The Queen then forces Solo to drink a blue fluid from a tube, teliling him to drink and be reborn. An infected Solo asks the Queen how he can serve her. As Black Krrsantan defeats a guard, Princes Leia asks the droids to plug into the tower's computer so that they can find their friends. Triple Zero replies that he and Beetee are not that \"kind of droids\" and instead proceeds to interroage a fallen guard."}, {"tag": "h3", "text": "Converging journeys"}, {"tag": "p", "text": "However, they are interrupted by an infected Han Solo, who shoots Triple Zero on his right shoulder. Solo is donning armor and orders the guards to destroy the droids and bring the women to him. Leia, Starros, and the droids flee. Leia is soon cornered by Solo and the Queen's guards. Solo tells her that her war is at an end, adding that there is no more Rebellion and Empire. As he presents an Abersyn symbiote, he tells Leia that there is now only one Queen."}, {"tag": "p", "text": "Meanwhile, Triple Zero asks Beetee why they are risking their circuits to save the rebels and ponders whether Dr Aphra would betray them. Beetee responds sarcastically to Triple Zero's remarks in Binary. Meanwhile, Dr Aphra tells Varroa to give her a fast ship but not to expect to see it or her again. As Aphra wonders what is causing those screams coming from the Screaming Citadel, she tries to tell herself she is not sorry for abandoning her companions."}, {"tag": "p", "text": "However, Eternal Rur speaks to Dr Aphra, telling her that he sees through her lies and remarks that she is filled with regret. Dr Aphra responds that Rur does not know her but Eternal Rur responds that she betrayed someone and is struggling with guilt; an unusual occurrence for her. Aphra tries to justify her actions by claiming that Skywalker is a dumb kid but Eternal Rur reiterates that she is struggling with guilt. He warns her that she is unlikely to leave this planet alive. When Rur claims that she has got no friends left, Eternal Rur tells her that is not true."}, {"tag": "p", "text": "While the infected Solo tries to infect Princess Leia with a symbiote, Triple Zero and Beetee observe a gun battle between Starros and the guards. Starros demands to know what the droids are doing. Triple Zero responds they were going to betray her but Starros convinces them to help save her rebel friends in return for killing Aphra. Beetee comes to Black Krrsantan's aid, blasting the guards attacking the Wookiee. Triple Zero remarks that he is starting to like Starros and opines they should murder her last. Before Solo can infect princess Leia, Starros attacks him and punches him in the arm."}, {"tag": "h3", "text": "The hive king"}, {"tag": "p", "text": "Skywalker manages to break free with the restraints and fights with the Queen's guards. Impressed by his Force powers, she orders them not to damage his flesh. Skywalker retrieves his lightsaber and cuts a guard down. Skywalker confronts the Queen but she uses her Force powers to disappear."}, {"tag": "p", "text": "However, Dr Aphra uses explosives to blow a hole through a window. She confronts the Queen, boasting of her bravery and insanity in scaling the Screaming Citadel. Dr Aphra demands that Skywalker be returned to her. Angered that Dr Aphra is breaking the terms of their bargain, she orders her guards to bring her a symbiote."}, {"tag": "p", "text": "Dr Aphra responds that she knows why the Queen did not want to infect Skywalker. As the strongest being, Skywalker ranks at the top of the food chain in the symbiote hive mind. A symbiote infects Skywalker, who assumes the identity of the \"hive king.\""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}