{"url": "Star_Wars_(2015)_7", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 7"}, {"tag": "p", "text": "Star Wars 7 is the seventh issue of the Marvel comic book series Star Wars. The issue, written by Jason Aaron and with art by Simone Bianchi, was published on July 29, 2015. The story is a one-off adventure featuring Obi-Wan Kenobi during his exile on Tatooine, as excerpted from his journal that was discovered by Luke Skywalker."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A Jedi in hiding"}, {"tag": "p", "text": "The story opens with members of Jabba's criminal empire brutalizing a moisture farmer. The farmer implores them not to take his water because he needs to trade it for food in order to feed his children. A Weequay enforcer dares the man to confront Jabba himself before hitting him with a rifle butt. The Weequay warns the other moisture farmers that they will be returning tomorrow to collect more \"water taxes\" and suggests that they get back to work."}, {"tag": "p", "text": "A cloaked Obi-Wan Kenobi, who is watching, clenches his fist. Kenobi resists the urge to intervene. Kenobi recalls that he has spent years hiding on Tatooine, following the Great Jedi Purge. No longer a Jedi General nor a Jedi Master, Kenobi settles in a humble dwelling in the Dune Sea. Kenobi bides his time keeping an eye on Luke Skywalker, the son of his former padawan Anakin Skywalker."}, {"tag": "p", "text": "Kenobi wanted to train the boy but his uncle Owen Lars refused to allow it, not trusting the Jedi. When Jabba's henchmen turn up to collect Jabba's water tax from the Lars moisture farm, Kenobi confronts the enforcers, telling them that they have taken enough water for the day and to head back to Jabba's Palace before the next dust storm. However, a Zabrak enforcer points the muzzle of his gun below his beard, telling the old man to mind his business."}, {"tag": "p", "text": "Unable to train Skywalker, Kenobi resolves to keep the boy safe while hoping that he aspires to be more than a moisture farmer. In his journal, Kenobi writes that this was the worst drought anyone on Tatooine could remember, especially with Jabba's enforcers collecting water taxes. Unwilling to let people die, Kenobi seeks help from his late Master Qui-Gon Jinn while lying on a pile of rocks."}, {"tag": "h3", "text": "Helping the people"}, {"tag": "p", "text": "Traveling to a town, Kenobi convinces a merchant to sell the local people black melons, fruits that grow in the Jundland Wastes. While the fruits are bitter, Kenobi reassures the merchant that their milk is safe to drink because the Tusken Raiders have been using them for years. Kenobi tells the merchant to tell the farmers."}, {"tag": "p", "text": "At that point, Jabba's enforcers arrive. However, Kenobi uses the Force to cause their guns to misfire. This gives the townsfolk courage and they drive the criminals away. Fearing the risk of his Force powers being discovered, Kenobi decides to return to his hermitage. Back home, Skywalker confides with his late Master his struggles about not being able to help the people as a Jedi."}, {"tag": "h3", "text": "Rescuing Skywalker"}, {"tag": "p", "text": "That night, Kenobi senses Skywalker is in danger. Back at the Lars moisture farm, Owen Lars and Beru Whitesun Lars search for Skywalker, who has gone missing. Having a strong sense of justice, Skywalker attempts to steal water from Jabba's enforcers' speeder. However, he is caught. A defiant Skywalker tells the enforcers that the water belongs to the farmers and not Jabba."}, {"tag": "p", "text": "The Weequay enforcer toys with the idea of selling Skywalker as a slave. However, the speeder's lights blow up. Just then, something drags the Weequay enforcer through the Force before hurling him through the air. The unseen threat then takes out the enforcers one by one, hurling them to the ground and levitating their guns. Skywalker is also knocked to the ground in the process by the assailant, who tells him to stay out of the way."}, {"tag": "p", "text": "An unidentified LOM-series protocol droid tries to intimidate the assailant but he and another droid are crushed by rocks.\nThe assailant then rams the speeder into the Weequay enforcer, knocking him to the ground. The unseen assailant then emerges from the darkness, revealing himself as Kenobi. Kenobi carries Skywalker back to his family's homestead."}, {"tag": "p", "text": "The following morning, Beru and Owen find a sleeping Skywalker outside their home. Beru asks Luke if he is okay but Skywalker can't remember. As a result of Kenobi's vigilante action, the farmers receive their water back. A week later, the drought comes to an end and the farm's moisture vaporators start working again."}, {"tag": "p", "text": "An enraged Jabba seeks to find the thief but none of his enforcers know what he looks like or his name. In his journal, Kenobi writes that his name is Obi-Wan Kenobi. He vows that a young boy's courage gives him the assurance that the Jedi will not end with him. Kenobi wishes he could tell Skywalker the story one day and so many others."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "In the present, Skywalker is reading \"The Journals of Ben Kenobi\" and tells R2-D2 to mind steering their T-65B X-wing starfighter a bit longer. He admits that he does not know where they are going but is working on it."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}