{"url": "Star_Wars_(toy_line)", "categories": ["Category:Real-world articles", "Category:Stub", "Category:Kenner toy lines"], "nodes": [{"tag": "h1", "text": "Star Wars (toy line)"}, {"tag": "p", "text": "Kenner's original vintage Star Wars toy line ran from 1977 to 1979 in the wake of the immense popularity of the 1977 theatrical release of Star Wars: Episode IV A New Hope. The toy line featured a variety of characters and vehicles from the film. It was succeeded by Kenner's vintage The Empire Strikes Back toy line in 1980."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "In an effort to create a full-scale licensing program for the 1977 film Star Wars: Episode IV A New Hope when such a concept was still in its infancy, Lucasfilm Ltd. and Twentieth Century Fox executives failed to convince major toy companies of the era to create a Star Wars line. However, the idea did interest Bernie Loomis, president of Kenner Products, then a subsidiary of cereal maker General Mills, who felt the Star Wars film had promise for manufacturing toys. Loomis later admitted that, while intrigued by the film before its release, he assumed Star Wars would be fleeting, and that Kenner did not consider the project a major investment."}, {"tag": "p", "text": "Kenner signed its contract to produce Star Wars toys just a month before the film's May 25 release. Once the film unexpectedly turned into a tremendous success, Kenner was faced with a problem. Because the normal manufacturing cycle for three-dimensional model toys was twelve to eighteen months, Kenner's first Star Wars figures would not be ready for the 1977 Christmas shopping season. Loomis's solution, against the advice of most marketers, was the \"Early Bird Certificate Package\"—Kenner riskily shipped 600,000 empty cardboard boxes that included mail-away redemption certificates guaranteeing customers that they would be among the first to own a future package of four Star Wars figures, which ultimately included Luke Skywalker, Princess Leia Organa, Chewbacca, and R2-D2. Although the media harshly criticized the tactic and many packages went unsold, Loomis was pleased, as it allowed him to maintain public interest in the figures until their 1978 release."}, {"tag": "p", "text": "The Star Wars line's first twelve figures shipped in the spring of 1978 and sold for as little as $1.97 apiece, making it difficult for Kenner to keep up with demand. By the time Kenner's \"vintage\" toy line ended in 1985 following the conclusion of the Star Wars original trilogy, the company sold approximately 250 million action figures."}, {"tag": "p", "text": "Although Star Wars author Stephen J. Sansweet noted in his 1999 book Star Wars: The Action Figure Archive that Kenner's original Star Wars product line lasted from 1978 to 1979, he later stated in his 2012 book Star Wars: The Ultimate Action Figure Collection that the line lasted until 1980. In fact, the Star Wars line's final toy releases came in 1979 before Kenner transitioned to its The Empire Strikes Back line in 1980."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Many action figures based on background characters from A New Hope did not have proper names, leading Kenner to use nicknames used during the film's production. Many of them would later receive proper names in the works of the Expanded Universe. These characters included Walrus Man, Hammerhead, and Death Star Droid. The toy line included two versions of \"Snaggletooth\", later named Zutton and Zutmore. In many cases, the characters' outfits did not match the costumes seen on film."}, {"tag": "p", "text": "For a toy included in the Death Star Space Station playset, Kenner designed the full body of the \"Death Star Trash Compactor Monster\" (later named \"dianoga\"), which was not seen in the film. That design would be contradicted by later Expanded Universe works."}, {"tag": "p", "text": "Though most of the line featured toys based on the film, a few original items were produced. The Imperial Troop Transporter from 1979 went on to appear in fiction as early as October of that year in the Star Wars Marvel Comics series. The Droid Factory playset would eventually be represented in the Expanded Universe by the monster droids seen in 2006's The New Essential Guide to Droids."}, {"tag": "p", "text": "An illustration of Greedo in the 1984 children's book and record set Star Wars Adventures in ABC was based on the design of his original action figure instead of the costume seen in A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}