{"url": "Star_Wars_(2020)_13", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2020)", "Category:Star Wars: War of the Bounty Hunters"], "nodes": [{"tag": "h1", "text": "Star Wars (2020) 13"}, {"tag": "p", "text": "Star Wars 13 is the thirteenth issue of the canon comic book series Star Wars. It was written by Charles Soule, illustrated by Ramon Rosanas and Rachelle Rosenberg, and published by Marvel Comics on May 12, 2021. It features the prelude story \"The Hunt for Han Solo,\" which leads into the Star Wars: War of the Bounty Hunters crossover event."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "PRELUDE TO WAR OF THE BOUNTY HUNTERS: \"THE HUNT FOR HAN\" CHEWBACCA has heard from an old friend with intelligence on the location of notorious bounty hunter BOBA FETT, known to be in possession of HAN SOLO. Along with LUKE SKYWALKER, the loyal Wookiee sets off in search of his lost friend, on an adventure to Nar Shadaa…[sic] the SMUGGLER'S MOON! But will this mission prevent plucky astromech droid ARTOO DETOO from passing along a crucial message to Luke, one that will affect the fate of the entire Jedi Order…?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Colorist Rachelle Rosenberg colored a page of Star Wars 13 during a live stream on her Twitch account."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In Star Wars 13, C-3PO and Luke Skywalker state that he found his yellow lightsaber on the planet Elphrona. However, in issue 6, in which Skywalker finds the lightsaber, he is on the planet Tempes. Writer Charles Soule stated on Twitter that it was a mistake by him, and that it will be fixed in later printings and collection editions."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}