{"url": "Star_Wars_(comic_strip)", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "Star Wars (comic strip)"}, {"tag": "p", "text": "Star Wars was a comic strip published in newspapers from 1979 to 1984 and distributed by the Los Angeles Times Syndicate and the Watertown Daily Times."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The strip was originally planned to be written and drawn by Al Williamson, but after working on it for two weeks, the work was scrapped. Russ Manning wrote and drew the published strip until poor health forced him to retire from it. Russ Helm took over writing duties with Princess Leia, Imperial Servant, followed later by Archie Goodwin with an adaptation of the novel Han Solo at Stars' End. Williamson joined Goodwin for the next story, The Bounty Hunter of Ord Mantell, and their partnership continued until the final strip, published in 1984."}, {"tag": "p", "text": "As the strip was being published, The Official Star Wars Comic Strip Contest was held, with a deadline of Halloween 1979."}, {"tag": "h3", "text": "Reprints"}, {"tag": "p", "text": "Decades later, Dark Horse Comics edited, colored, and reprinted most of these stories in two comic-book series: Goodwin and Williamson's strips in Classic Star Wars, and Helm and Manning's in Classic Star Wars: The Early Adventures. These comics did not include Planet of Kadril or the Sunday strips. Later, Han Solo at Stars' End was reprinted under the Classic Star Wars title, as was the Sunday strip The Constancia Affair. The Star Wars Scrapbook is a department of the comic strip."}, {"tag": "p", "text": "In 2005, StarWars.com's Hyperspace began publishing the newspaper strips alongside all-new stories. All of Manning's daily strips were included, as were most of Goodwin's."}, {"tag": "p", "text": "According to the Star Wars Insider magazine's Special Edition 2012 article \"The Empire Strips Back,\" Dark Horse Comics planned to collect and anthologize these comics."}, {"tag": "p", "text": "The comic strips later got anthologized in the form of the Epic Collection (which dealt with the comic-book reprints) as well as the three-volume Star Wars Newspaper Comics."}, {"tag": "h2", "text": "Stories"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}