{"url": "Star_Wars_(2015)_8", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 8"}, {"tag": "p", "text": "Star Wars 8 is the eighth issue of the Marvel comic book series Star Wars and the first of five issues in the series' second story arc, Showdown on the Smuggler's Moon. The issue, written by Jason Aaron with art by Stuart Immonen, was released on August 19, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Trouble in the Monsua Nebula"}, {"tag": "p", "text": "An Imperial Star Destroyer arrives in the Monsua Nebula, having been alerted to the presence of two hostile vessels on an uncharted planet in the system. One of the vessels include a stolen Imperial shuttle. Unable to scan the planet, the Star Destroyer dispatches several TIE fighters and bombers. Under the Captain's orders, the TIE bombers commence a bombing run."}, {"tag": "p", "text": "On the planet's surface, Princess Leia Organa is shocked to discover that Han Solo was allegedly married to Sana Starros. Solo asks Sana how she discovered them. Sana responds that she merely left a probe droid in the planet's orbit, waiting for them to turn up. Sana knows that the planet had been their favorite rendezvous. Sana kisses Solo before shoving her blaster up his chin."}, {"tag": "p", "text": "Sana remarks that Princess Leia is a bit scrawny for Solo's taste while Princess Leia is still shocked that Solo had a wife. Solo denies that he was married to Starros. Princess Leia decides to leave the two of them to sort out their problems but Sana recognizes her and attempts to collect the bounty on her head. Starros tells Princess Leia that Solo had scammed the daughter of a Sultan of the Boz Pity system. She believes that Solo is scamming Princess Leia as well."}, {"tag": "p", "text": "Solo denies Starros' claims but Princess Leia demands to know why his \"wife\" is pointing a gun at her. Solo denies that Starros is his wife. Starros offers to show them documents but their argument is interrupted by the sight of proton bombs falling through the atmosphere. Leia attempts to board the stolen Imperial shuttle but Starros orders the Volt Cobra'slaser cannons to destroy the shuttle, trapping them here. Sana tells Solo that his \"little scam\" is over and that it's time for him to pay up. She intends to sell Princess Leia to the Galactic Empire and to reclaim her \"husband\" Solo."}, {"tag": "h3", "text": "Into the depths of the Smuggler's Moon"}, {"tag": "p", "text": "Meanwhile, Luke Skywalker is frustrated that his late Master Obi-Wan Kenobi only left him with a book of stories rather than a guide to fighting with lightsabers and using the Force. Still seeking Jedi knowledge, Skywalker decides not to return home to the Alliance Fleet until he has found some answers. Intending to seek the Jedi \"home\", Skywalker however winds up on Nar Shaddaa, the \"Smuggler's Moon\", a planet inhabited by outlaws and pirates."}, {"tag": "p", "text": "Lost, Skywalker decides to find the worst-looking bar. However, he sticks out like a \"sore thumb.\" The Zabrak bartender tells the bar's patrons to kill and rob Skywalker, viewing him as easy meat. Skywalker fights back but is throw against a table. He draws his lightsaber, awing the crowd. An alien thief spots Skywalker and tells his colleagues to bring the big guy down."}, {"tag": "p", "text": "The Zabrak bartender backs down and asks Skywalker where he got his weapon from. Skywalker responds that he had come to conduct business and that they tried to kill him. The bartender apologizes for his rudeness and offers his a drink. Skywalker reiterates that he had come seeking information on how to get to Coruscant. The bartender responds that the Jedi Temple is heavily guarded by Imperial forces and offers to \"help\" in return for Skywalker trading his lightsaber."}, {"tag": "p", "text": "Skywalker refuses to surrender his father's lightsaber. The bartender responds that this bar used to belong to his father and asks if Skywalker still wants to go to Coruscant. Since Skywalker is unwilling to trade his lightsaber, the bartender orders his henchmen to rob Skywalker and feed him to the scum-squids. Skywalker draws his lightsaber but is electrocuted by the alien thief's magna-glove, who then runs off with his lightsaber. Skywalker races after the thief while the bartender bellows orders to recover the lightsaber."}, {"tag": "h3", "text": "Turning the tables"}, {"tag": "p", "text": "Back on the uncharted planet, Sana Starros contacts the Imperial Star Destroyer, seeking to collect the Imperial bounty on Princess Leia. Solo tries to reason with Sana but Princess Leia chides him for his naivete with dealing with women. When Sana speaks to Solo, Solo apologizes for being a scoundrel."}, {"tag": "p", "text": "Princess Leia kicks Solo into Sana Starros, causing her to drop the gun. Leia retrieves a pistol from her left boot and holds them at gunpoint. Leia tells Solo and Starros that she is not about to let them sell her off to the Empire. Just then, a flight of TIE fighters and bombers break through the atmosphere."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}