{"url": "Star_Wars_(2015)_60", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars 60"}, {"tag": "p", "text": "Star Wars 60 is the sixtieth issue of the canon comic book series Star Wars. It was written by Kieron Gillen, illustrated by Angel Unzueta, and published on January 23, 2019 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"THE ESCAPE\" PART FOUR! [sic] You can escape the horror of the galaxy. But only for a while. The return of SCAR SQUADRON."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Tula's plan"}, {"tag": "p", "text": "At Thane Markona's Estate's on Hubin, C-3PO has been reattached with new legs. However, he has little time to celebrate regaining his mobility as R2-D2 informs him that Luke Skywalker is preparing to duel Sergeant Kreel of Scar Squadron. C-3PO also sees that Han Solo and Princess Leia Organa have been stunned while Sana Starros has been captured. Thane Markona and his daughter Tula Markona watch.."}, {"tag": "p", "text": "Aero questions Kreel's decision to duel Skywalker but the stormtrooper has been eager to duel with Skywalker. Before the duel, Skywalker and Tula Markona share a kiss. She warns him not to think of fleeing through the woods but discreetly passes him a smoke grenade. Markona tells his daughter not to create a scene as he officiates over the duel, reminding them not to destroy his lovely home."}, {"tag": "p", "text": "Kreel charges at Skywalker and gains the upper hand. However, Skywalker retreats and releases a smoke grenade that blinds him. Thane Markona denounces Skywalker as a coward who has rejected his hospitality, allowing the Imperials to hunt him down. While the others hunt Skywalker, Kreel orders Aero to guard the prisoners. Tula distracts Aero by asking who Sana Starros is and whether she is important Skywalker. While distracted, Tula stuns him from behind."}, {"tag": "p", "text": "When MK-1 arrives with C-3PO and R2-D2, Tula frees Starros and gets MK-1 to provide Solo and Leia with stimulants. Tula apologizes for the deception and says that it was part of their escape plan. Solo asks Starros what happened to her. A bruised Starros tells Solo that she escaped the Star Destroyer but was pursued by Scar Squadron and tortured. When Leia asks Tula about her plan, Tula tells them that they have to get to the Clan Markona village. She charges MK-1 with looking after the mansion until Clan Markona returns."}, {"tag": "h3", "text": "Fare-welling a mentor"}, {"tag": "p", "text": "Luke Skywalker meets Thane Markona, who was privy to Tula's plan, in the Markona graveyard. He is pleased that Skywalker has passed every test that he has set. Skywalker wants to go back and retrieve Leia and Han but Markona reassures him that Tula is looking after them. With Scar Squadron after Luke, Markona explains that the Death Star had shown him what the Empire was and that he wanted to know who the Rebellion was by testing Luke and his friends."}, {"tag": "p", "text": "He praises Skywalker for his bravery and devotion and Han for not killing someone he wasn't sure deserved death. Skywalker recalls that Tula was furious when he activated the communicator. Markona agrees but explains that his daughter has only known peace and fears the military duties that await her. He explains that Clan Markona is a military unit and that Tula will be raising the alarm in the village."}, {"tag": "p", "text": "Markona tells Skywalker that Clan Markona has made arrangements to flee Hubin in the event of an Imperial visit. Markona admits that he and his clan obtained Hubin by undertaking a mission to gather data from a secure location from the Empire. Markona admits that he has blood on his hands. While Clan Markona owes the universe a debt, he prefers to be in credit. Markona shows Skywalker the way to the village."}, {"tag": "p", "text": "Skywalker is unwilling to leave Markona but he tells Skywalker to go because the universe needs its hero and that it is pointless for both of them to die here. Markona decides to stay behind to atone for all the wrongs that he had done as a mercenary. When the stormtroopers catch up with him, Markona draws his blasters, telling them that this is his promised hospitality."}, {"tag": "h3", "text": "The evacuation"}, {"tag": "p", "text": "At the Markona village, Han and Leia find the locals evacuating aboard the Imperial landing craft. Tula explains that her people had hoped that Hubin would be their retirement but regrets that it was merely a long holiday. While Markona exchanges fire with the stormtroopers, Tula explains that her father was testing the Rebellion and that they passed. Deeming the rebels worthy, she decides that Clan Markona will join the Rebellion."}, {"tag": "p", "text": "When Leia asks why Thane is not leading them, she explains that her father will not be accompany them. As R2-D2 and C-3PO hack into the shuttle, Markona is knocked to the ground by blaster fire but is determined to continue fighting with his vibroblades. Taunting the Imperials that Skywalker would have thrashed them, he charges at them only to be gunned down by blaster fire. Despite their victory, the Imperials discover that this was merely a ruse for the rebels and Clan Markona to steal their shuttle."}, {"tag": "p", "text": "As Solo flies the shuttle, he asks Starros to help him navigate. Before reporting for duty, Starros destroys the IT-O Interrogation Unit that had tortured her. Skywalker wants to chat with Tula but she is still struggling with the pain of leaving her home."}, {"tag": "p", "text": "Meanwhile, Scar Squadron finds themselves stranded on Hubin with no transportation offworld. They are greeted by MK-1, who informs them that they lack a transmitter and that the next scheduled contact with the outside world is in four months time. He offers them hospitality at Clan Markona's mansion. The stormtroopers are attacked by a pack of thanraxes, who are not afraid of strangers. MK-1 tells the stormtroopers to enjoy their stay."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}