{"url": "Star_Wars_(2015)_6", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2015)"], "nodes": [{"tag": "h1", "text": "Star Wars (2015) 6"}, {"tag": "p", "text": "Star Wars 6 is the sixth issue of the Marvel comic book series Star Wars, and the final chapter of the series' first story arc, Skywalker Strikes. The comic, written by Jason Aaron with art by John Cassaday, was on June 3, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE CONCLUSION OF \"SKYWALKER STRIKES\"!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Skywalker versus Fett"}, {"tag": "p", "text": "After being blinded by Boba Fett's flash grenade in Obi-Wan Kenobi's home, Luke Skywalker is disoriented. Fett whips his head with the butt of his rifle and orders him to stay down. Despite being blinded Skywalker punches Fett but bruises his hands against his Mandalorian armor. Fett warns Skywalker not to waste his time. Skywalker thinks that Fett is a stormtrooper."}, {"tag": "p", "text": "Skywalker realizes that he has been blinded by a flash grenade. Fett orders him not to move. Skywalker demands to know who hired Fett and where he is taking him. Fett kicks Skywalker in the head for resisting, intending to knock him unconscious. However, Skywalker ignites his lightsaber and tells Fett that he is not going anywhere. Fett dismisses the blinded Skywalker but Luke responds that a Jedi does not need eyes."}, {"tag": "p", "text": "Fett dismisses Skywalker's threats but Skywalker responds that he should not have come. Guided by the Force, Skywalker advances with his lightsaber but Fett dodges his blow and fires his whipcord thrower. Skywalker manages to slice the cord with his lightsaber, causing the bolt to explode. Fett trips over R2-D2, leading Skywalker to taunt him that his armor is noisy. Fett responds that his mouth is noisy before charging at Luke with his jetpack."}, {"tag": "h3", "text": "An unexpected romance"}, {"tag": "p", "text": "Meanwhile, Princess Leia Organa and Han Solo discover that the uncharted stormy world has a beautiful surface that is covered in grass, trees, waterfalls, and large rocky structures. Solo explains that he had crashlanded on the planet earlier and used it as a hiding place for his smuggled goods. Solo reassures Leia that the TIE fighters won't pursue them because their pilots can't navigate through the violent storms and their scanners cannot pierce down here."}, {"tag": "p", "text": "While entering a cave hidden by a waterfall, Leia tells Solo that this planet will be useful for the Rebellion. Solo reassures her that only he and Chewbacca know about the planet's existence. Solo then offers Leia some Corellian wine."}, {"tag": "p", "text": "Meanwhile, one of the TIE pilots think that the rebel fugitives are dead because they could not have survived those storms. However, his colleague thinks that they better be sure or they will be in trouble. Just then, an unidentified vessel jets pass them. The TIE pilots demand that the vessel identify itself but a hooded figure tells them that she won't be long."}, {"tag": "h3", "text": "Fight at Kenobi's home"}, {"tag": "p", "text": "Back at Kenobi's home, Luke's jacket is cut by Fett's Mandalorian vambrace. Skywalker tries to strike Fett with his lightsaber but Fett cuts him with his vambrace. Fett gives Skywalker a third chance to put down his lightsaber. Skywalker responds that Kenobi would never surrender but Fett taunts him that Kenobi is dead before shooting Skywalker in the shoulder."}, {"tag": "p", "text": "Fett says he was supposed to bring Skywalker back alive but is able to settle for \"breathing.\" Skywalker responds that a Jedi can feel the Force flowing through him. Fett fires a blaster bolt but Skywalker deflects it with his lightsaber. Fett ignites his jetpack and charges at Skywalker. knocking him to the ground. Before Fett can gain the upper hand, R2-D2 hurls a box at Fett, knocking the bounty hunter unconscious."}, {"tag": "p", "text": "Skywalker asks R2-D2 what happened and if this was the box they found. R2-D2 leads the blinded Skywalker out of Kenobi's wrecked home and back to his starfighter. As the day rises, Skywalker regains his sight and tells R2-D2 to fire up the converters. He examines the box and finds a book titled The Journals of Ben Kenobi."}, {"tag": "h3", "text": "A ghost from Solo's past"}, {"tag": "p", "text": "Back on the uncharted world, Leia takes offense at Solo's flirtation and hurls Corellian wine at him. She tells him that they are on a mission of vital importance for the Rebellion and rebuffs his attempt at dating. Solo responds that the wine was not cheap and says that he has every right to drink after saving their lives. Leia counters that they would not be here if he had lost his nerve."}, {"tag": "p", "text": "Solo takes offense but the their argument is interrupted by the sound of starship engines. This ship belongs to the mysterious masked figure who was pursuing them. Leia realizes this is not an Imperial ship and asks who else knows about this place. Solo tells them to run and they dodge laser blasts. As the ship lands, Leia asks who has found them."}, {"tag": "p", "text": "The mysterious woman tells Leia not to bother asking Solo, claiming that he is a liar. She introduces herself as Sana Solo, Solo's wife. Solo buries his forehead in his hand while Leia responds with shock to the revelation that Solo had a wife. Armed with a blaster, Sana demands to know who she is."}, {"tag": "h3", "text": "Vader's son"}, {"tag": "p", "text": "Fett flies the Slave I to Darth Vader's Imperial Star Destroyer. Fett reports that he lost the rebel pilot. Vader is staring out a viewport. While Vader is disappointed, he asks Fett if he brought anything of value. Fett responds that the fugitive is named Skywalker. Vader does not turn, leading Fett to assume that they are done here and to take his leave. After Fett has left, Vader uses the Force to crack the transparisteel window while he grapples with the revelation that he has a son."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}