{"url": "Star_Wars_-_The_Official_Magazine_85", "categories": ["Category:Real-world articles", "Category:Star Wars - The Official Magazine"], "nodes": [{"tag": "h1", "text": "Star Wars - The Official Magazine 85"}, {"tag": "p", "text": "Star Wars - The Official Magazine 85 (German: Star Wars - Das offizielle Magazin 85) is an issue of Star Wars - The Official Magazine released on March 22, 2017. Among other things, the issue covers a farewell tribute to Carrie Fisher, an editorial on Chewbacca, coverage on the Death Star and its secrets, and coverage of Star Wars material up to 1985."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "Mit Ausgabe 85 hat STAR WARS - Das Offizielle Magazin eine neue Heimat bei PANINI. Seit 20 Jahren ist STAR WARS - Das Offizielle Magazin die ultimative Quelle für alle Anhänger der Saga, die vor und hinter die Kulissen des erfolgreichsten aller Zeiten blicken wollen. Neben Porträts zu Stars und Machern, Making-of-Reportagen, exklusiven Kurzgeschichten und Comics erhält der Leser Poster und attraktive Gewinnspiele. Deshalb freuen wir uns sehr, dieses etablierte Magazin ab 2017 den Fans anbieten zu können."}, {"tag": "p", "text": "Das Offizielle Star Wars Magazin - Jetzt neu bei Panini"}, {"tag": "p", "text": "Neben der regulären Kiosk-Ausgabe ist DAS OFFIZIELLE STAR WARS-MAGAZIN außerdem als erweiterte Fan-Ausgabe JOURNAL OF THE WHILLS erhältlich. Diese Ausgabe gibt es exklusiv im Abo über unseren Redaktionspartner Miracle Images (www.journal-of-the-whills.de), dem Betreiber des Offiziellen Star Wars Fanclubs."}, {"tag": "p", "text": "(Translation: With issue 85, Star Wars-the official magazine has a new home at Panini. For 20 years, Star Wars-the official magazine is the ultimate source for all followers of the saga who want to look ahead and behind the scenes of the most successful of all time. In addition to portraits of stars and creators, making-of reportages, exclusive short stories and comics, the reader receives posters and attractive sweepstakes. Therefore we are very pleased to be able to offer this established magazine from 2017 to the fans."}, {"tag": "p", "text": "The official Star WarsMagazin–now new at Panini"}, {"tag": "p", "text": "In addition to the regular Kiosk edition, the official Star Wars magazine is also available as an extended Fan edition Journal of the WHILLS. This edition is available exclusively in the subscription via our editorial partner Miracle Images (www.journal-of-the-whills.de), the operator of the official Star Wars fanclub.)"}, {"tag": "h2", "text": "External links"}]}