{"url": "Star_Wars_2014_Del_Rey_Sampler", "categories": ["Category:Real-world articles", "Category:Del Rey Promotional samplers"], "nodes": [{"tag": "h1", "text": "Star Wars 2014 Del Rey Sampler"}, {"tag": "p", "text": "Star Wars 2014 Del Rey Sampler is a sampler e-book published by Del Rey containing excerpts from their books. It was released on July 15, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This eBook sampler is the perfect way to prepare for the next exciting era of Star Wars storytelling! With Episodes VII, VIII, and IX on the horizon, Del Rey is proud to present the first wave of novels that are part of the official Star Wars film canon, created in collaboration with the newly formed Lucasfilm Story Group. The exclusive previews of these four books, starring fan favorites and set during and before the original trilogy, will transport you once again to a galaxy that doesn't feel quite so long ago, or so far away...."}, {"tag": "p", "text": "A NEW DAWN by John Jackson Miller\nSet during the mysterious \"Dark Times\" between Episodes III and IV, A New Dawn tells the story of how two of the lead characters from the animated series Star Wars Rebels first came to cross paths."}, {"tag": "p", "text": "TARKIN by James Luceno\nBestselling Star Wars veteran James Luceno gives Grand Moff Tarkin the Star Wars: Darth Plagueis treatment, bringing the legendary character from A New Hope to full, fascinating life."}, {"tag": "p", "text": "HEIR TO THE JEDI by Kevin Hearne\nThe author of The Iron Druid Chronicles pens a thrilling new adventure set between A New Hope and The Empire Strikes Back, and—for the first time ever—written entirely from Luke Skywalker's first-person point of view."}, {"tag": "p", "text": "LORDS OF THE SITH by Paul S. Kemp\nWhen the Emperor and his notorious apprentice, Darth Vader, find themselves stranded in the middle of insurgent action on an inhospitable planet, they must rely on each other, the Force, and their fearsome fighting skills to prevail."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}