{"url": "Star_Wars_2016_Del_Rey_Sampler", "categories": ["Category:Real-world articles", "Category:Del Rey Promotional samplers"], "nodes": [{"tag": "h1", "text": "Star Wars 2016 Del Rey Sampler"}, {"tag": "p", "text": "Star Wars 2016 Del Rey Sampler is a sampler eBook published by Del Rey containing excerpts from their books and short stories from Star Wars Insider. It was first released on March 18, 2016 at C2E2 and then at various other conventions Del Rey attended throughout the year. It received an eBook release on April 11, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Come home to Star Wars with this ebook sampler of excerpts from Del Rey's latest novels—including the official adaptation of The Force Awakens—set a long time ago in a galaxy far, far away...."}, {"tag": "p", "text": "In this year's sampler, you'll also find selections from the Battlefront videogame tie-in novel and from a pair of gripping titles that fill the gaps between Episodes VI and VII."}, {"tag": "p", "text": "Plus, don't miss four Star Wars short stories presented in their entirety: \"Bait\" by Alan Dean Foster, \"Inbrief\" by Janine K. Spendlove, and \"Blade Squadron\" and \"Blade Squadron: Zero Hour\" by David J. Williams and Mark S. Williams!"}, {"tag": "p", "text": "BLOODLINE by Claudia Gray\nTaking place in the years before the events of The Force Awakens, this thrilling novel from the New York Times bestselling author of Star Wars: Lost Stars recounts the birth of the Resistance as witnessed by Leia Organa."}, {"tag": "p", "text": "THE FORCE AWAKENS by Alan Dean Foster\nThe acclaimed novelization of Star Wars: Episode VII: The Force Awakens, the international megahit film directed by J. J. Abrams, Alan Dean Foster's sweeping narrative \"gives us glimpses of an even more vast, unseen universe,\" raves The Washington Post."}, {"tag": "p", "text": "AFTERMATH by Chuck Wendig\nThe second Death Star has been destroyed, the Emperor killed, and Darth Vader struck down. Devastating blows against the Empire, and major victories for the Rebel Alliance. But the battle for freedom is far from over."}, {"tag": "p", "text": "BATTLEFRONT: TWILIGHT COMPANY by Alexander Freed\nA companion novel inspired by the blockbuster videogame Star Wars: Battlefront, this action-packed adventure \"effortlessly thrusts readers onto the frontlines of the Galactic Civil War in a gripping tale\" (New York Daily News)."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}