{"url": "Star_Wars_2017_Del_Rey_Sampler", "categories": ["Category:Real-world articles", "Category:Del Rey Promotional samplers"], "nodes": [{"tag": "h1", "text": "Star Wars 2017 Del Rey Sampler"}, {"tag": "p", "text": "Star Wars 2017 Del Rey Sampler is a sampler eBook published by Del Rey containing excerpts from their books and short stories from Star Wars Insider. It was first released on March 2, 2017 at ECCC and then at various other conventions Del Rey attended throughout the year. It received an eBook release on June 20, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Can't wait for The Last Jedi? Lose yourself in a galaxy far, far away with this ebook sampler of excerpts from Del Rey's latest Star Wars novels—including a Rogue One adaptation and prequel."}, {"tag": "p", "text": "Timothy Zahn returns with a revealing portrait of one of the most cunning and ruthless warriors in the history of the Galactic Empire. Chuck Wendig completes his epic trilogy bridging the gap between Episodes VI and VII. And Senator Leia Organa stars in her own novel set in the years before The Force Awakens."}, {"tag": "p", "text": "Plus, don't miss five Star Wars short stories new to the 2017 sampler: \"Scorched\" by Delilah S. Dawson, \"Blade Squadron: Kuat\" by David J. Williams & Mark S. Williams, \"Voice of the Empire\" by Mur Lafferty, \"Turning Point\" by Jason M. Hough, and \"TK-462\" by Sylvain Neuvel."}, {"tag": "p", "text": "THRAWN by Timothy Zahn\nIn this definitive novel, readers will follow Thrawn's rise to power, uncovering the events that created one of the most iconic villains in Star Wars history."}, {"tag": "p", "text": "BLOODLINE by Claudia Gray\nFollowing the Battle of Endor, Leia Organa—now a respected senator—must protect the fledgling democracy from both outside dangers and treachery from within."}, {"tag": "p", "text": "AFTERMATH: LIFE DEBT by Chuck Wendig\nAs the New Republic fights to restore peace to the galaxy, Norra Wexley leads a search and rescue mission to the Wookiee homeworld, where Chewbecca has been captured and Han Solo has disappeared."}, {"tag": "p", "text": "CATALYST by James Luceno\nIn this prequel to Rogue One: A Star Wars Story, Jyn Erso's family must untangle a web of deception to save themselves—and the galaxy itself."}, {"tag": "p", "text": "ROGUE ONE by Alexander Freed\nA new hope rests in the hands of an unlikely band of allies—if only they can capture the plans to a machine of unimaginable destructive power. Go beyond the film with a novelization featuring new scenes and expanded material."}, {"tag": "p", "text": "AFTERMATH: EMPIRE'S END by Chuck Wendig\nAs the final showdown between the New Republic and the Empire draws near, all eyes turn to a once-isolated planet: Jakku."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}