{"url": "Star_Wars_107", "categories": ["Category:Real-world articles", "Category:Articles with cut elements", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 107"}, {"tag": "p", "text": "Star Wars 107: All Together Now is the one-hundred-seventh issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker, Leia Organa, Han Solo, and Dani, together with a mixed team of commandos, including their new-found Imperial and Nagai allies, Knife and Den Siva, are attacking the Tof-held world of Saijo, where the Tof field headquarters are located. They have learned from the Nagai that this is the location of the Tof prince Sereno, who is leading the invasion, and hope to take him hostage, thereby forcing the Tofs to surrender."}, {"tag": "p", "text": "During the early parts of the infiltration, an argument breaks out between Han and Knife, but it is mediated by Mandalore Fenn Shysa. Luke reflects on the long course of war thus far, Dani reveals that a special relationship has been formed between her and Siva, and Knife expresses interest in becoming a Jedi."}, {"tag": "p", "text": "The party then infiltrates the Tof administrative palace, the men as (fake) prisoners and Dani and Leia disguised as Tof ladies in veiled dresses. There they find not only Prince Sereno, but also the Dark Lady Lumiya, who has committed herself to the Tof cause. As the party attacks, a Tof commander calls for air support from the bulkship Merriweather, which lies in orbit, but the Tof fighters are intercepted by Rogue Squadron, led by Wedge Antilles, and the Millennium Falcon, piloted by Lando Calrissian and Chewbacca. Meanwhile, Knife is wounded by Lumiya, but Leia distracts her before she can administer the coup de grace. This instead makes Leia Lumiya's target, but as she is about to shoot her, she is herself shot in the back by a Tof officer and apparently killed (although she survives to appear again much later). Luke then captures Prince Sereno, who reluctantly surrenders, and the Tof turned traitor is revealed to be Bey, who has worked for some time as an undercover agent among the Tof. As Han, Knife, and Bey reunite, Luke expresses hope that in the future, all the various factions and species who have allied against the Tof will finally be able to coexist in peace."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The peaceful ending was certainly true at the time the comic was written, as it was the final issue of Marvel Star Wars. In light of the continuity now prevalent, however, Luke's hopes were not fulfilled for many years to come."}, {"tag": "p", "text": "The issue was the final issue of the original run of the series. On May 29, 2019, more than thirty-three years later, it was followed by a special commemorative 108th issue released in celebration of Marvel Comics' 80th anniversary."}, {"tag": "p", "text": "In this issue, Han Solo tells Knife that Plif and his hoojibs are the only telepaths in the Alliance of Free Planets. Luke Skywalker had already used his telepathy to communicate with Leia from Cloud City years before, but Han Solo could still be skeptical about a Force-based telepathy, and not about an evolution-based telepathy."}, {"tag": "p", "text": "The cover of the issue features a Hiromi, although the Hiromi do not appear in the inner story."}, {"tag": "p", "text": "The 2009 article The Forgotten War: The Nagai and the Tofs later revealed that this issue takes place four months after the previous issue, and the group involved is actually the New Republic. The use of the term Alliance of Free Planets is retconned as part of the Nagai's insistence that they only made a truce with the Alliance, not the newer organization."}, {"tag": "p", "text": "The publisher's summary in Marvel Age 41 describes a different story that was never published. It reads: Sometimes a reputation can hurt more than it helps. That's what Luke Skywalker discovers when he lands on a frontier-style world and discovers everyone is out to become known as the man who shot Luke Skywalker! Written by Jo Duffy, penciled by Cynthia Martin and inked by Ken Steacy."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}