{"url": "Star_Wars_88", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 88"}, {"tag": "p", "text": "Star Wars 88: Figurehead is the eighty-eighth issue of the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Marvel continues to present all-new post-Jedi adventures! It's a diplomatic mission, just perfect for Princess Leia and Mon Mothma to handle—until they stumble upon Imperial forces fighting to control a strategic stronghold! And the Imperial forces are winning! \"Figurehead\" is written by Jo Duffy, penciled by Bob McLeod, and inked by Tom Palmer!"}, {"tag": "p", "text": "The return of one of our most requested characters! From the Star Wars canon comes... Shira Brie! Shira is Luke Skywalker's second deadliest enemy! We'll leave it to you to find out Luke's deadliest enemy—but only if you buy this phenomenal issue!"}, {"tag": "p", "text": "Continuing the post-Jedi adventures of our heroes! This issue: Princess Leia, on a diplomatic mission to another world, encounters a cyborg villain we'll be seeing lots of in the future!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Mon Mothma, Leia Organa, and a delegation of the new Alliance of Free Planets have come to the planet Herdessa to meet with the powerful Herdessan Guild. The planet has had recent financial success, and the Alliance has come to negotiate a possible political membership. However, during the introductions, Princess Leia is greeted with a chorus of boos. While puzzling over the less than friendly welcome, Leia is hit full in the face by a clump of mud. The Herdessan Guild tries to downplay the incident, claiming that the culprits are simply malcontent rabble, and that the planet's security force will apprehend them. The head of the security forces, the cyborg Lumiya leads her forces in the pursuit, while the delegation makes their way to more comfortable surroundings for the negotiations. After a long meal, the Herdessan Guild members, Brylin, Tof, and Gaza, begin to attract suspicion from the Alliance members. They refuse to let the planet's citizens have a say in the diplomatic meeting, and the negotiations fail to materialize, as the Guild suggests that the Alliance simply spend the day relaxing and enjoying the pleasure of the planet."}, {"tag": "p", "text": "Irritated by the lack of progress, Leia excuses herself to take a walk. Outside of the Guild headquarters, she witnesses Lumiya apprehending the woman who threw the mud at her, Suzu. The woman struggles desperately against the cyborg, claiming that she and her partner, Finn, will now likely be killed as an example to anyone else who might rise up against the Guild. Leia, shocked by the claims, interferes in the arrest, allowing Suzu to escape Lumiya's clutches. Lumiya, refusing to let her captive escape, tries to shoot down Suzu with blasters concealed in her hands. Leia attacks Lumiya, smashing her to the ground to prevent her from killing an unarmed person. Leia chases after Suzu, trying to get to the bottom of the situation. Lumiya fires her blasters after Leia, but the Princess escapes to find Suzu holed up in a bombed out building with several hungry and starving Herdessans. Suzu claims to Leia that only those affiliated with the Guild have enjoyed the planet's prosperity, and that those outside of their power were subject to torture or a spot on the slave block. Before Leia can decide what to do about the situation, the hideout is stormed by Lumiya and her security forces. The Herdessan rebels are easily beat back, falling quickly to Lumiya's forces. Leia escaped the carnage, hoping to find a way to even the odds."}, {"tag": "p", "text": "Lumiya pursues Leia through the streets, where she learns that the middle class are much too frightened to oppose the guild, creating a system where the government is unopposed in its oppressive actions. Meanwhile, Mothma and the rest of the Alliance delegation are captured by the guild, intent on selling them into slavery. The guild has allied itself with the Galactic Empire, and the pretense dropped, stormtroopers enter the street to crack down on the minor uprising that has resulted in the shootout with the Herdessan rebels. Lumiya, having lost Leia, uses a loudhailer to announce to the populace that they need to leave their homes so that they can make sure that nobody is harboring the Princess. Leia and Suzu, having both escaped the Imperials, hide in the bushes nearby, trying to think of a plan. Lumiya announces that if Leia is not apprehended in two minutes, she will begin executing the prisoners. After the time has passed, Lumiya selects Finn from the group and prepares to kill him. Suzu, unable to let her lover be killed, jumps from the bushes and points behind her to where Leia is located."}, {"tag": "p", "text": "The stormtroopers search the bushes, but Leia and Suzu have tricked the Imperials. Leia emerges from the opposite side of the courtyard and opens fire, quickly freeing several of the captives and arming them. The Herdessans slowly begin to push back the Imperials, and Lumiya comes face to face with Leia. The princess fires a blaster bolt into the cyborg, hitting one of her power packs, creating an explosion that takes Lumiya out of the fight. The momentum of the battle turns completely when the middle class finally decides to rise up, flanking the Imperial forces and capturing the guild members and their forces. With the battle won and many of the Imperials in custody, Mon Mothma tells Leia that it is time to go—they need to warn the rest of the Alliance that the Empire is continuing to operate in increased capacity, even so soon after their recent defeat at Endor. Before the Alliance's departure, Leia warns Suzu and Finn that Lumiya had disappeared following the end of the fight, and that they should keep an eye out for her. From the bushes, Lumiya, badly damaged, promises that Leia will soon learn how dangerous of a foe she really is."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This issue features the first appearance of Lumiya. In later issues, the design of Lumiya changes. Lumiya does not reappear until several issues later in Star Wars 95. This issue is also the first identification of the Alliance of Free Planets as the delegation brought to Herdessa is introduced with this name."}, {"tag": "p", "text": "Mon Mothma says in Star Wars 85 that Leia has been sent on a diplomatic mission. Whether that was a separate mission or whether Mothma later joined Leia on her mission to Herdessa is unknown. Leia later returns to Endor in Star Wars 90."}, {"tag": "p", "text": "Although Lumiya's identity as Shira Brie is not revealed until Star Wars 96, the publisher's summary for this issue in Marvel Age #16, published in April 1984, announces Shira's return. When the book is solicited again in Marvel Age #18, the reference to Shira is removed."}, {"tag": "p", "text": "Figurehead was originally intended to appear in the previous issue."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}