{"url": "Star_Wars_77", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 77"}, {"tag": "p", "text": "Star Wars 77: Chanteuse of the Stars... is the seventy-seventh issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Appearing for one issue only—the songstress who will melt your heart and shatter your wine glass. We mean none other than Leia Organa, \"Chanteuse of the Stars.\" The rebel alliance may hinge on her ability to entertain a group of Ambassadors, and with her singing voice, (Dazzler she ain't!) the rebels may have to throw down their arms and surrender!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following their mission to Iskalon in the previous issue, Lando Calrissian, Leia Organa, Luke Skywalker, Chewbacca, C-3PO, and R2-D2 return to Haven Base on Arbra and report the destruction on Iskalon, as well as their failure to locate Tay Vanis. The presiding Rebel General thanks the team for trying their best, but relates that he has new information on the search. Although both Yom Argo and Tay Vanis had recovered information on the Empire's new secret weapon, another rebel had apparently recovered the same information. However, the information suggests that this rebel is none other than Han Solo. Leia steps up to tell the General that it couldn't possibly have been Solo, since he had been frozen in carbonite well before Tay Vanis' disappearance. However, the General claims that the Empire, the people who had arranged Solo's imprisonment, are the ones who had let slip the information. The General proposes that the group split up into two teams: one to track Han Solo and the mysterious story, and another to follow new information about Tay Vanis. Lando, Chewbacca, and the two droids decide to follow the trail for Solo, while Luke and Leia are sent to Kabray Station to follow a lead about Vanis. In order to infiltrate the diplomatic summit there, the Hoojib Plif is sent with them, to pose as the diplomat for the planet Arbra, with Luke and Leia as his aides. As Lando and his team decide not to use the Millennium Falcon for their mission, Luke and Leia use the Falcon to dock with Kabray Station and enter the diplomatic meeting along with Plif and a group of Hoojibs."}, {"tag": "p", "text": "The two Rebels decide to split up, and they both begin to search for a message that has been left on the station by Vanis. As Luke begins to search the private rooms with Plit, Leia sneaks outside the meeting place into the back rooms with the entertainment and the kitchen. After searching thirteen suites, Luke finally discovers the message in one of the rooms. However, as the Rebels are set to leave, they overhear a conspiracy to poison the Imperial Governor to prevent a deal he was set to make with the Pursians. Unfortunately, at the same time, Leia is mistaken for Shirley, the \"Chanteuse of the Stars\", and forced to perform a musical number for the governor. Luke tries to get near the governor, but he is sidetracked by a group of Zeltron females who are inexplicably attracted to him. As a poisoned soup is placed in front of the governor, Luke tries to rush to the rescue, but in his scramble, one of the Lahsbee delegates matures into a Huhk, terrorizing the banquet. In the commotion that follows, Luke is able to knock the soup away from the governor."}, {"tag": "p", "text": "However, as the stormtroopers on the station try to subdue the beast, they find that their blaster's power packs have been drained of energy. As the Huhk reaches out to attack Luke, Plif signals Leia to continue singing her song. Leia complies, and the Huhk's rage is sated. As Leia continues to sing, the monster sits at Leia's feet, watching her performance. Luke sits with his Zeltron admirers, thankful that the crisis was averted. Luke ponders what will happen when Leia finishes the song, hoping that she knows a lot of verses."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rebel General on the planet Arbra who Leia reports to is not identified by name during the comic. However, as General Carlist Rieekan has been established as the head of Haven Base in Arbra: Sanctuary In the Storm, it is assumed that Rieekan is the General in this comic."}, {"tag": "p", "text": "At the end of the issue, it says that the next issue will feature Han, Chewie, and Lando in The Big Con, but in fact, the next issue is Star Wars 78."}, {"tag": "p", "text": "In the original English version, a female Zeltron asks Plif the Hoojib \"Gee... are you little fellows any fun?\". In a somewhat deviating translation, the same Zeltron ask \"Må jeg ikke nok få dig med i seng?\" (\"Can I please take you to bed with me?\") in the official Danish language version."}, {"tag": "p", "text": "The New Essential Chronology placed the search for Tay Vanis (continuing here and concluded in issue #80) after Star Wars: Shadows of the Empire."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}