{"url": "Star_Wars_98", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Classic Star Wars", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 98"}, {"tag": "p", "text": "Star Wars 98, also published as Classic Star Wars: The Vandelhelm Mission, is the ninety-eighth issue of the Legends comic book series Star Wars. It was written by Archie Goodwin, illustrated by Al Williamson, and first published by Marvel Comics on May 14, 1985. It features the story \"Supply and Demand,\" in which Han Solo is sent on a mission to the planet Vandelhelm."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Han heads out on a mission to a former Imperial prison planet, with Nien Nunb as his co-pilot on the Millennium Falcon. When he gets there, he is surprised to see that his job is to escort a woman and her child. But when the Imperials show up, things get dangerous for Han."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While Chewbacca is on leave to Kashyyyk, and Leia is meeting with some of the major players in the Alliance of Free Planets, Han is forced to go on a mission to a former Imperial prison planet, with Nien Nunb as his co-pilot on the Millennium Falcon. When he gets there, he is surprised to see that his job is to escort a woman and her child to Vandelhelm to sort out problem with the Metalsmiths Guild supplying the Alliance with \"ores and alloys and stuff.\" Apparently, the current Guildmaster Orrk has allied himself with the Galactic Empire and was abashed when he found out that the royalty whom Han escorts is coming back. Imperial Admiral Mordur has assured the Guildmaster that the \"venerated ones\" will die. When the Millennium Falcon comes out of hyperspace, it has come out right in the middle of mined asteroid field. Moff Vordur was expecting a large Rebel cruiser. The plan failed."}, {"tag": "p", "text": "On Vandelhelm, the group was greeted by the Guildmaster himself. Han began criticizing the work of the guild. Orrk defends himself by saying how selflessly the metalsmiths work. He also mentions that Han's passengers are the last descendants of the two families that initially founded the metal-rich planet."}, {"tag": "p", "text": "Han returns to the Millennium Falcon, only to find his co-pilot taken hostage by the Imperial stormtroopers. Orrk has also taken the royals hostage, and has revealed his partnership with the Empire to Han. The child jumps on Orrk's leg, throwing him off-balance. Han uses the moment and shoots the stormtrooper holding Nien. He tries to make a shot at Orrk, but can't because he might hit the royals. So he jumps on Orrk. Unfortunately for Han, the Guildmaster is of much heavier and stronger build, which results in Han dragging off the platform where the Millennium Falcon was held. However, the woman has shot Orrk, and Han pulled him down, which resulted in his death. Later, Han heard a familiar sound, which was a crackle on Chewbacca's rifle. Apparently, two stormtroopers have seen the whole scene and emerged from the corner. Nien Nunb has seen that, and shot them in time."}, {"tag": "p", "text": "The group goes to the Millennium Falcon. At the same time, Admiral Mordur has entered the command codes for the drone barges filled with ore, and launches them to follow his lead ship, which he pilots to the Sun. Han notices that, and he boards the ship. Eventually, Han and the Admiral fight each other on the command deck of the ship in Zero-G conditions. Han wins, and tries to shut down the signal to drone barges. He can't. When he thinks that all is already lost, that he, the Millennium Falcon, the crew and the barges are going to burn down in the sun, he hears Lando Calrissian's voice, who has arrived on a EF76 Nebulon-B escort frigate. He tractor-beamed the Millennium Falcon, and tells Han that he used the command code to take the barges in. Apparently, the royals knew the codes, but didn't tell Han about it. The comic finishes as we see the kid hugging Han."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars 98 was originally scheduled to feature the story \"Far, Far Away,\" which was ultimately rescheduled to appear in issue 101. In 1995, Star Wars 98 was republished by Dark Horse Comics as Classic Star Wars: The Vandelhelm Mission and featured recolored artwork by James Sinclair."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}