{"url": "Star_Wars_89", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 89"}, {"tag": "p", "text": "Star Wars 89 is the eighty-ninth issue of the Legends comic book series Star Wars. It was written by Ann Nocenti, illustrated by Bret Blevins, and first published on August 14, 1984 by Marvel Comics. The issue features the story \"I'll See You in the Throne Room!,\" in which Luke Skywalker faces the notorious King Blackart and uncovers a treacherous plot."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Luke finds himself fighting more for revenge than for freedom…is he on the path to the dark side?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Battle of Solay"}, {"tag": "p", "text": "Following the Battle of Endor, many worlds have been enveloped in revolution as the Empire struggles to keep control over the galaxy despite the deaths of both the Emperor and Darth Vader. On Solay, a planet of ten suns, freedom fighters have risen up to overthrow the Empire-backed Solay Royal Court."}, {"tag": "p", "text": "Led by Raggold and the newly arrived Rebel hero, Luke Skywalker, the revolutionaries succeed in storming the court of King Blackart, defeating his royal guard. However, in the heat of battle, Raggold falls, struck by a fatal blaster shot. With his dying words, he tells Luke that he was killed by a traitor, one who had come from within their own ranks. Luke immediately wants to hunt down Raggold's killer, but he is stopped by Mary, another freedom fighter, who tells him that revenge is not the way. Luke reluctantly agrees, and the two witness the capture of King Blackart, where he is stripped of his crown."}, {"tag": "p", "text": "With the Rebel victory, the freedom fighters begin to celebrate wildly, enjoying the new found freedom they have earned. Luke is concerned about the lack of rebuilding on the part of the victorious rebels, claiming that it is not enough to have been against something, one must be for something—a new government. However, Luke is distracted by Mary, who claims that the revolutionaries have earned this celebration, and Luke slowly loses his resolve."}, {"tag": "h3", "text": "Imperial attack"}, {"tag": "p", "text": "A week later, and there is no end to the celebrations. Luke is still dwelling on the lack of progress and claims that they need to track down the last remnants of the pro-Imperial government and make sure that they are gone. However, he is once again distracted by Mary, whose beauty has captivated Luke. Mary kisses Luke, and Luke suggests that the two get away from the revelry for a few hours."}, {"tag": "p", "text": "Mary leaves to arrange for a ship to take them away from the area, but as soon as she disappears, a loud rumbling appears in the distance. Luke and the celebrating freedom fighters look outside to see a massive Imperial fleet above the planet. The Empire has come to quell the uprising, and the revolutionaries are unprepared to deal with the threat. A riot breaks out and the rebels scatter as the Imperials begin to bombard the planet."}, {"tag": "p", "text": "Mary, attempting to make her way back to Luke, is hit by blaster fire from the Imperial ships and falls, badly wounded. The rioting rebels quickly attempt to strip Mary of her valuables, but Luke fights them off, using the Force to lift Mary from the crowd. Luke takes Mary in his arms, but she is barely clinging onto life. With her final words, she asks that Luke hold onto the promise of what could have been. With Mary dead, Luke becomes determined to find the traitor who had killed Raggold and now allowed Mary to be killed."}, {"tag": "h3", "text": "Finding Blackart"}, {"tag": "p", "text": "Luke walks through the Solay streets where he encounters a young thief known as Scamp. Scamp agrees to help Luke find the traitor if he can be allowed to steal from those that Luke interrogates. Scamp tells Luke that the revolution had always been a scam. An Imperial Governor had financed the revolution to overthrow the monarchy so that he could step in and reconquer the world easily. Everyone had been set up for a fall, and the traitor had been the only one to profit."}, {"tag": "p", "text": "Scamp leads Luke to a rich Rebel who is living comfortably. Luke uses the Force to lift the man into the air, and begins to choke him to get answers. The rebel admits that there was a traitor, but the only thing he knows is that he was a spy who had killed Raggold. Luke contemplates killing the man, but honoring Mary's memory, he lets him live."}, {"tag": "p", "text": "Scamp and Luke make their way to the Solay Spaceport, intent on finding Blackart, who must know who the traitor is. Blackart is attempting to get off-world, but Luke confronts the ex-King, demanding information from him. Blackart claims that he doesn't know anything about the traitor, and he attacks Luke, escaping to a rocket ship. Just as it seems Blackart will escape, Scamp puts Luke on a jump platform which propels him into the air. Using a wing pack, Luke attacks Blackart's escaping ship with his lightsaber, causing the rocket to crash. Luke interrogates Blackart, who reiterates that he knows nothing about the traitor. The Empire set him up for a fall, and he would kill the traitor himself if he could find him."}, {"tag": "h3", "text": "The traitor revealed"}, {"tag": "p", "text": "Luke begins to despair, reflecting on his mission. The desire for revenge has gotten to him, and he can feel the pull of the dark side of the Force. Not sure where to go next, Luke offers to help bring Scamp's stolen loot back to his house. Scamp is greeted by his large family, who are happy to see him home. However, the celebration is interrupted by Scamp's father who takes all the stolen loot for himself. Luke is shocked by the man's ungratefulness, but Scamp stops Luke from intervening."}, {"tag": "p", "text": "Scamp leads Luke to a cantina to meet with Braxas, a local infochant. Braxas has made it his business to know everything about Solay, but as a result, has gotten a price on his head. He wants Luke to get him off the world, and in return, he will reveal who the traitor is. However, Braxas has one last test for Luke before he will accept him as a suitable pilot. Braxas orders the Braxas special, a dish that includes a live scorpion. In order to test Luke's nerves, Braxas requests that Luke eat the dish with chopsticks, using his non-prosthetic hand."}, {"tag": "p", "text": "Luke passses the test, and Braxas hands over the tape revealing Raggold's murderer. Luke watches the tape only to discover that it was Raggold who had been the traitor. Wracked with guilt, Raggold had committed suicide at the conclusion of the battle. Luke, shocked by the revelation, and he resolves to abandon his attitude of revenge. Luke and Braxas escape Solay in Luke's shuttle, but Luke resolves to return to Solay someday to complete the work that Mary and Raggold had started."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars 89 was originally scheduled to feature the story \"The Choice,\" which ultimately appeared in issue 90."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}