{"url": "Battle_Circle", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Ceremonies", "Category:Mandalorian culture", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Battle Circle"}, {"tag": "p", "text": "The Battle Circle was an area in which Mandalorians engaged in duels and honed their combat skills in mock battles."}, {"tag": "h2", "text": "Rules"}, {"tag": "p", "text": "The rules of the Battle Circle were few and simple. First, no deathblows were permitted. Second, neither combatant was allowed to leave the Battle Circle. Third, the only weapons allowed were those permitted by the combatant who had the most honor. This could range from unarmed combat to vibroblades and vibroswords, depending on the preference of the more honorable combatant. Fourth, in order to challenge the champion or former champions of the Battle Circle, one needed the recommendation of one who was a champion at one point."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Meetra Surik visited the camp on Dxun, she was invited to test her skills with Mandalorian warriors. She fought with five combatants, moving her way from the least respected to the highest in accordance with Mandalorian culture. Firstly, she beat the young recruit Davrel in unarmed combat. Secondly, the quartermaster Kex challenged Surik, so she was allowed to choose the terms of the match: unarmed, swords, or use of the Force and lightsaber. Regardless of her choice, she won. Thirdly, the seasoned warrior Tagren was also beaten in unarmed combat. However, after the fight with Tagren, Surik had to prove herself worthy of fighting the two champions: Kelborn or Bralor. After helping Kelborn dispatch some of Colonel Tobin's men, she was allowed to fight the champions. Kelborn was beaten in a contest of swordsmanship, while Bralor allowed the Surik to use her full arsenal, including the Force, but nevertheless was defeated by the Jedi."}, {"tag": "p", "text": "Millennia later, during the Clone Wars, two members of the Cuy'val Dar, Dred Priest and Isabet Reau secretly formed battle circles on Kamino to train clone troopers. However, troopers would often sustained fatal injuries. When tipped off by Mij Gilamar, Jango Fett put an end to this practice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}