{"url": "Star_Wars_91", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 91"}, {"tag": "p", "text": "Star Wars 91: Wookiee World is the ninety-first issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The villain's name is Knife, and he's out to enslave the world of the Wookiees and Chewie's brother-in-law is helping him! \"Wookiee World\" written by Jo Duffy, penciled by Tony Salmons and inked by Tom Palmer."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following their diplomatic mission to Keyorin, Lando Calrissian, Han Solo, and Chewbacca make their way to Kashyyyk, Chewbacca's homeworld. After landing at the spaceport outside of Chewbacca's hometown, the three head towards Chewbacca's home to reunite with his wife and son. However, on the way there, they are confronted by a mysterious pale warrior who has made friends with Chewbacca's brother-in-law, Vargi. The warrior introduces himself as \"Knife\", a nickname that the local Wookiees have given him, since they cannot pronounce his true name. Knife and Vargi suggest that the group make their way to Chewbacca's home to enjoy drinks. When the group arrives, they find the house abandoned, much to Chewbacca's worry. Lando and Han reassure their friend, claiming that his family are probably out shopping and will be back soon. The group enters Chewbacca's home to enjoy drinks and pass the time until the absent family returns. As Lando and Han voice their suspicions about Knife, Chewbacca's son, Lumpy, appears at the door. Lumpy is accompanied by three Wookiees, who brandish their weapons at Han, Lando, and Chewbacca. The rogue Wookiees are working for Knife, who explains that he is holding Chewbacca's family captive and that he hopes to reactivate the Kashyyyk slave trade. Han assumes that Knife is working for the Galactic Empire, but Knife claims that he has nothing to do with the Imperials."}, {"tag": "p", "text": "Knife places his three new captives in binders, and escorts Chewbacca out of the house. Knife plans to parade the Wookiee hero through the city in order to dishearten the resistance to his slave trade. Han and Lando are kept inside the house as captives until Knife can decide what to do with them. While Chewbacca is led outside to watch his people loaded onto slave ships, Lando and Han are able to escape from their captivity. Han frees Chewbacca from his chains, but he is caught by Vargi, who viciously beats Chewbacca as punishment. Han intervenes, only to have Vargi's wrath turned on him. Han is knocked unconscious, but not before Chewbacca intervenes, starting an uprising against the slave traders. As Chewbacca and Vargi grapple, Knife tries to quell the uprising, preparing to kill Chewbacca with one of his blades. However, Lando, having just freed Chewbacca's family, shoots the weapon out of Knife's hand. With his family free, Chewbacca puts all his weight behind his blows, quickly defeating Vargi. The tide of the skirmish quickly turns, and as the Wookiees celebrate their victory, Knife is able to escape. Han attempts to chase after their enemy, but Knife is able to steal Lando's ship, the Cobra, escaping offworld. Han is furious that Knife has escaped, but he claims that he will set up a rematch with the mysterious figure as soon as he can."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This issue takes place after Star Wars 85 and concurrently with the previous issue, Star Wars 90. This issue also marks the first appearance of the Nagai, who will go on to be the major villains until the end of the Marvel run. Chewbacca's homeworld is spelled \"Kazhyyyk\" in this comic, differing from the correct spelling of \"Kashyyyk\"."}, {"tag": "p", "text": "The Nagai introduced in this comic, Knife, claims that the Wookiees have nicknamed him \"Knife\" as they cannot pronounce his name. However, Knife's real name is never revealed in the later Marvel comics, and even his fellow Nagai refer to him as \"Knife.\" Knife's real name was revealed in the Star Wars Gamer 1 article, The University of Sanbra Guide to Intelligent Life: The Marvel Series, which gave him the name, \"Ozrei N'takkilomandrife\"."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}