{"url": "Star_Wars_82", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 82"}, {"tag": "p", "text": "Star Wars 82: Diplomacy is the eighty-second issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Shortly after the Battle of Endor, Luke Skywalker is on the forest moon of Endor training with the local Ewoks, including Wicket W. Warrick. The Ewoks attack Skywalker with spears and rocks, and the young Jedi Knight is able to fend off their attacks, finishing by levitating Wicket into the air. Following his training session, Skywalker is approached by Lando Calrissian, Chewbacca, C-3PO, and Admiral Ackbar. Ackbar tells Skywalker about the Rebellion's plan to set up a new government. He tasks the Jedi Knight with visiting several worlds to ask their leaders if they would attend and participate in a planetary council. The Hoojib Plif decides to go along on Skywalker's mission, and the two depart Endor in his X-wing starfighter."}, {"tag": "p", "text": "The first planet on Skywalker's list is Iskalon, and the Jedi is hesitant to return due to the destruction that took place the last time Skywalker visited the world. Skywalker makes a bearing for the destroyed city of Pavillion and is shocked to see a starship landed among the wreckage. Skywalker lands near the ship and begins to investigate, looking for sign of the Iskalonians. However, the ship actually belongs to Rik Duel, and Skywalker is immediately pounced on by Dani, a Zeltron who Skywalker had previously encountered. The woman is incredibly infatuated by Skywalker, and Luke is forced to fend off her advances. Upon talking with Duel and Chihdo, Skywalker learns that the Moonshadow is on Iskalon to salvage the wreckage from the attack by the Empire. Skywalker and Plif are appalled by Duel's tactics, and they try to convince him to leave the world and their equipment alone. However, Duel refuses, claiming that this is the best caper he has ever cooked up. During their conversation, a Chiaki rises out the water and attacks the salvagers. Skywalker is able to ward off the beast, but Plif reads the Chiaki's mind before it returns to the ocean. The monster had actually been drawn to the surface by the Iskalonians, who had been angered by the \"airbreathers\" coming to their world."}, {"tag": "p", "text": "Skywalker senses an incoming attack, and he knocks the Rik Duel gang aside. The Iskalonians emerge from the sea equipped with water tanks but are met head on by Skywalker who does everything he can to fend off the attack without killing anyone. Before the Iskalonians can step up their attack, they are stopped by Kiro, who has recognized Skywalker. Kiro asks his friend why he is helping the Rik Duel gang, who are heartless scavengers. Skywalker claims that he only came as a diplomat to talk with the School's leader, and he was just as disappointed in the Rik Duel gang's actions. Mone, the leader of the School, appears to Skywalker, but he immediately asks the man to leave Iskalon. Although the Empire has been defeated at Endor, Mone and the School are still hesitant to trust offworlders, and they want no contact with outsiders. Luke is depressed by Mone's answer, but he agrees to leave. As Skywalker commands Rik Duel and his gang to leave as well, Kiro speaks with Mone, trying to convince him to send a representative back to the Alliance. However, Mone refuses, claiming that the School cannot send anyone, and if anyone does leave, they cannot represent the Iskalonians."}, {"tag": "p", "text": "Even with Mone's command, Kiro decides to ask Luke to take him along, having become bored of his role on the planet. Equipping himself with a high-impact water tank suit, Kiro prepares to leave Iskalon. Having no room aboard his X-wing, Kiro is forced to board the Moonshadow instead. As the group leaves Iskalon, the school stares with incredulity, in disbelief over Kiro's choice to leave the world. As an Iskalonian asks Mone whether Kiro will miss his home, Mone responds that Kiro will miss it no more than the School will miss him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This is the first Marvel Star Wars issue featuring Luke Skywalker that takes place after Star Wars: Episode VI Return of the Jedi. The story takes place concurrently with Star Wars 81, as Ackbar claims that Leia and Han are away on Tatooine, referencing the events of the previous issue."}, {"tag": "p", "text": "The storyline begun in this issue—with Skywalker visiting worlds to ask them to send representatives back to the Alliance on Endor—does not continue until 5 issues later, in Star Wars 87, despite a story by that title being advertised on the final page as the next issue. The solicitation for this issue in Marvel Age #10\nadvertises Still Active After All These Years, meaning the story in this issue—like the previous three issues—was originally intended to appear a month earlier, but was pushed back when Hoth Stuff! was published in issue 78."}, {"tag": "p", "text": "In the story, C-3PO says \"Chewbacca feels he still has more to learn from the Hoojibs and more to teach them... and I'm needed here to translate their tongue.\" As the Hoojibs are telepathic, their tongue does not need any translation. This line is more probably a typo, with Chewbacca wanting to learn from and teach the Ewoks, as referred by Han Solo and Princess Leia in the previous issue."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}