{"url": "Star_Wars_79", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars 79"}, {"tag": "p", "text": "Star Wars 79: The Big Con is the seventy-ninth issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "All new adventures of the world famous characters from the greatest science fantasy epic ever! You won't believe the car chase this issue with Lando and a drunken Wookiee, as the search for Han Solo continues!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After being sent on a search for Han Solo in a previous issue, Lando Calrissian and Chewbacca travel to the planet Arcan IV to interview some old contemporaries of Solo's, Lemo and Sanda's gang. In order to not rouse their suspicions, the two travel to the world in Lando's ship, the Cobra instead of the Millennium Falcon. Lando and Chewbacca both wear a disguise to enter Lemo and Sanda's den, and Calrissian identifies himself as Captain Drebble, claiming that he is searching for Solo. In order to convince the gang to help the Rebels search for Solo, Lando claims that Han was secretly a very talented treasure hunter, citing his discovery of the lost idol Vol as proof. Calrissian is aware that the gang is searching for two valuable relics, the Dancing Goddess and the Minstrel, and he hints that Solo will be able to help them find the two artifacts. In reality, Calrissian is just searching for any information that the gang might have on Solo's whereabouts."}, {"tag": "p", "text": "In their guises as fellow pirates, the Rebels inadvertently raise the ire of one of the gang members, Koruu, who attempts to shoot \"Captain Drebble\" in the back. However, Lando is able to quickly turn on his attacker and throw a knife through his chest, killing him and earning the gang's respect. Lemo and Sanda invite the two Rebels to dinner, planning to figure out \"Drebble's\" plan and then kill him. During dinner, the gang attempts to get Lando drunk on Deltron spice wine to make him spill his plans. However, before Lando can become too intoxicated, he learns that the gang believes that Solo is headed for Tatooine, to be turned over to Jabba the Hutt. Lando claims that he had heard that rumor, but when the duo had gone to Tatooine earlier, Fett had not arrived yet. Upon hearing the pirates claims, the Rebels finally know for sure that Han is to be delivered to Tatooine. Unfortunately for Lando, when he tells the gang of his journey to Tatooine, he accidentally mentions Chewbacca's name, and the group pulls their weapons on him. Chewbacca is able to help them make a break for it when he swings his bench at the gang, knocking several of them across the room. Chewbacca and Lando flee from the restaurant and commandeer a hover car, fleeing into the city. As Lemo and Sanda's gang give chase, Lando is forced to stop momentarily to ask a prostitute for directions. However, the woman is in a foul mood, as her customer base had been dried up by the presence of pirates on the planet. Mistaking Lando for being with the same crowd, she gives him faulty directions, leading him down the wrong street towards oncoming traffic. As Lemo and Sanda catch up with the Rebels, both groups find themselves trying to dodge the oncoming vehicles."}, {"tag": "p", "text": "Lando and Chewbacca are able to jump their car into an empty street, but a couple of Lemo and Sanda's crew are killed trying to make the same turn, smashing their craft into nearby buildings and other vehicles. However, the pirate gang continue the chase, firing their blasters at the fleeing duo. Tired of being shot at, Chewbacca jumps from Calrissian's hovercar onto one of the pirates' vessels. After throwing the rival group from their vehicle, the Wookiee commandeers the vehicle. Now in two separate hover cars, Lando tells Chewie to meet him back at the Cobra, and they split up. As they both simultaneously lose their pursuers, they end up taking opposite routes, inadvertently setting themselves up for a head-on collision. As both Lando and Chewbacca's cars crash into each other, the Rebels are thrown from the wreckage, only to land directly in front of Dafi, a member of Lemo and Sanda's gang. Although the pirate initially plans to kill the pair, she happens to spy a small statue that had fallen out of Lando's pocket. The Minstrel, one of the artifacts that the gang had been searching for, was in Calrissian's possession all along, as he had won it in a card game a long time ago. Upon seeing the statue, Dafi is filled with a desire for the artifact, and she snatches it from the Rebels. When the rest of the gang shows up, she believes that they have come to steal her prize, and she begins to shoot her blaster wildly at the group. In the chaos that follows, Chewbacca and Lando are able to sneak back to the Cobra. Lando is excited to have confirmed the final whereabouts of Han Solo—Jabba's headquarters on Tatooine. As the duo leave the world, Lando wonders just what the gang wanted with the Minstrel, claiming that it might be worth investigating after they save Han. To top it off, he also wonders what they would have done to him had they known that he also possessed the Dancing Goddess, the other statue that the gang was after."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sanda claims in this issue that the bounty on Han Solo was one hundred thousand credits."}, {"tag": "p", "text": "Lando mistakenly calls the Stenax homeworld \"Stenax\" instead of \"Stenos.\""}, {"tag": "p", "text": "The Star-Words letter page of issue 87 hinted that Lando Calrissian's disguise as Captain Drebble in this issue is based on the anime character Captain Harlock."}, {"tag": "p", "text": "This issue includes a one-page comic about assistant editor Eliot Brown explaining how to build a Darth Vader costume, but in the end George Lucas reprimands him."}, {"tag": "p", "text": "The Big Con was originally intended to appear in the previous issue but was pushed back when Hoth Stuff! was published instead. This issue was originally scheduled to feature Lady, which was later retitled Ellie and published in the next issue."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}