{"url": "Star_Wars_Adventures:_The_Light_and_the_Dark", "categories": ["Category:Real-world articles", "Category:Future trade paperbacks", "Category:Book stubs", "Category:Star Wars Adventures (2020) trade paperbacks"], "nodes": [{"tag": "h1", "text": "Star Wars Adventures: The Light and the Dark"}, {"tag": "p", "text": "Star Wars Adventures: The Light and the Dark is the forthcoming first canon trade paperback that collects issues 1–6 of the 2020 comic-book series Star Wars Adventures. It is scheduled to be published by IDW Publishing on November 23, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Brand-new middle-grade stories featuring all your favorite characters from the far reaches of the Star Wars galaxy, spanning the entire Skywalker Saga and beyond!"}, {"tag": "p", "text": "Three oversized stories featuring Rey, Finn, and Poe; Qui-Gon Jinn and the mighty Wookies [sic] of Kashyyk; [sic] and Padmé and Anakin; plus half a dozen short stories including tales of villainy starring Kylo Ren and Darth Vader himself!"}, {"tag": "p", "text": "First, Poe and Finn take Rey to a remote planet to continue her Jedi training. But they're surprised to find that the First Order's reach extends far and wide. Then, Qui-Gon joins the Wookiees of Kashyyyk for a special Life Day celebration! And after that, Padmé and Anakin face a major predicament as they struggle to navigate the politics of the Republic!"}, {"tag": "p", "text": "Meanwhile, on the Dark Side, Kylo Ren faces the difficulties of leadership and the politics of fear. And, following the siege of Hoth, Darth Vader explores the secrets of the abandoned Rebel base. All this, and new stories of dastardly exploits by Grand Moff Tarkin, Darth Maul, Tobias Beckett and Val, and the sinister Nihil."}, {"tag": "p", "text": "Collects the first six issues of the new Star Wars Adventures series starting in 2020."}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}