{"url": "Star_Wars_Adventures_Free_Comic_Book_Day_2019", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Canon Free Comic Book Day comics", "Category:Star Wars Adventures (IDW) one-shot comics", "Category:Star Wars Adventures: Tales from Vader's Castle"], "nodes": [{"tag": "h1", "text": "Star Wars Adventures Free Comic Book Day 2019"}, {"tag": "p", "text": "Star Wars Adventures Free Comic Book Day 2019 is a one-shot issue of the canon comic book anthology series Star Wars Adventures. It features the story \"Droid Hunters,\" which ties into the miniseries Star Wars Adventures: Tales from Vader's Castle. The issue was written by Cavan Scott, illustrated by Derek Charm, and published as a Free Comic Book Day title on May 4, 2019 by IDW Publishing."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The stars have aligned: This year, Free Comic Book Day coincides with Star Wars Day! Han and Chewie race against pirates in a search for one of three identical droids that contain the location of a legendary treasure. But what our favorite smugglers don't know is the other two droids are booby trapped! Trickery and double-crosses abound in this original story set before A New Hope! May the Fourth be with you!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The treasure hunt begins"}, {"tag": "p", "text": "At Fortress Vader on the planet Mustafar, Lina Graf was trying to contact Thom Hudd. As Graf and CR-8R \"Crater\" were sneaking through Darth Vader's fortress, Crater reminded Graf of all the times that Hudd had tried and failed to help them since joining the Alliance to Restore the Republic. This reminded him of the lost treasure of Rane Mahal."}, {"tag": "p", "text": "Sometime earlier, Han Solo and Chewbacca were at The Labyrinth on Kelada getting a drink while they were smuggling cargo for Jabba Desilijic Tiure. But while they were talking, the pirate, Makkeer ran into Solo and requested for his help. Gwarm chased after Makkeer and captured them. Solo defended Makkeer and punched the captain. The owner of The Labyrinth, Lorana fired at Gwarm and told him to leave her cantina. Solo asked Makkeer why they were after him and he told Solo that they were after the treasure of Rane Mahal. The coordinates to the treasure were located in one of three NP-unit droids. One of the droids was on Kelada."}, {"tag": "h3", "text": "Droid hunt"}, {"tag": "p", "text": "Shortly after, Solo located the droid and stole it. He called for Makkeer but when he had arrived Gwarm's gang had taken him captive. Solo threw the food the droid was supposed to be serving at the gang and the three ran off. Makkeer remembered the password to the droid and called it out. The droid recognized it but activated it's booby traps. The droid did not contain the coordinates. But they also attracted the attention of Imperial stormtroopers. Chewbacca acted quickly and rolled the droid at the stormtroopers and allowing for them to escape."}, {"tag": "p", "text": "The next droid was located at the Droid museum located on Nubia. At the museum Solo, Chewbacca, and Makkeer took a tour through the museum. When the tour guide got to a display that showed the NP-unit droids, they were not there. Instead Gwarm's droid, R5-P8 was there and opened fire on Solo and the others. Chewbacca chased after the droid as it caught up to a Zygerrian pirate who possessed another NP-unit. As she and R5 speed off, she made plans to take a bounty for herself. But when she activated the droid, the droid released it's booby trap which was knockout gas which caused the pirate to pass out. Solo and the others escaped and headed off to Ogem where the last droid was located."}, {"tag": "p", "text": "The droid was in the possession of Gwellis Bagnoro who was a expert data forger. When Solo arrived at the cave Bagnoro was in, he was stopped by Gwarm. Bagnoro was sleeping nearby but Gwarm had managed to steal the final droid. But then Gagnoro's protective pet, Izby attacked Gwarm and Solo took the droid."}, {"tag": "h3", "text": "Behind Solo's back"}, {"tag": "p", "text": "Back on the Millennium Falcon, Solo brought the droid onboard and activated it. A map projected from the droid and gave them their next location. Solo ordered Chewbacca to fly off to Sakreen. When they arrived to Sakreen they were met by Gwarm's Corona-class armed frigate, Hand of Am-Shak. The ship chased the Falcon to the surface but was unable to catch it. The treasure was located at Rane Mahal's galleon but before Solo could land, the Hand of Am-Shak returned attacked. But on the Falcon, Makkeer made his real intentions known. He betrayed Solo for Gwarm by installing ion scramblers which caused the Falcon to malfunction and crash. Gwarm and his associate, Thok left their ship and went to the galleon to retrieve their prize."}, {"tag": "p", "text": "They found the treasure chest but were stopped by Solo who had Chewbacca held Makkeer hostage. Chewbacca through Makkeer at Gwarm knocking him out. Solo went over to the treasure but was pushed back by it's defenses. But then a voice started to speak from inside the chest. The treasure chest opened up to reveal the pirate queen, Rane Mahal who was the treasure all along. She asked Solo what she brought him and he guessed she needed a ship. Solo told Mahal that Gwarm's ship would be perfect for her but Gwarm tried to prove otherwise. More of her crew appeared and took Gwarm and his gang to be sold to a slaver. Solo and Chewbacca did not like that and tried to get Gwarm back but Mahal managed to escape. Solo allowed for them to escape, knowing he was not a hero."}, {"tag": "p", "text": "On the Hand of Am-Shak, one of Mahal's pirates brought forth one of the NP-unit droids on the ship. Mahal opened the droid but the droid used a ion scrambler which caused everyone to panic and get shocked back. Solo had reprogrammed the droid to do this when opened. The ship started to overload as the Millennium Falcon took off."}, {"tag": "p", "text": "Back at Fortress Vader, Crater finished his story but Graf was still curious to why Hudd was still in danger. Crater believed that Graf was too trusty but Graf thought Crater was too jumpy. She believed that they had nothing to worry about as the Dark Lord of the Sith, Darth Vader looked down on them."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}