{"url": "Star_Wars_Annual_(1977)_2", "categories": ["Category:Real-world articles", "Category:Marvel Star Wars Annual"], "nodes": [{"tag": "h1", "text": "Star Wars Annual (1977) 2"}, {"tag": "p", "text": "Star Wars Annual 2: Shadeshine! is the second annual issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker, Lando Calrissian, and C-3PO are running from Imperial stormtroopers when they happen across a convent containing a golden statue of Han Solo. The Rebels are puzzled until Rov Vetter Piin appears, declaring that Solo is the savior of Ventooine and activating a control on the statue containing a recording of Solo's voice which recounts the story of how Solo saved the planet. Solo and his co-pilot Chewbacca were traveling to Ventooine to deal in Sansanna spice. Unfortunately when Solo asks around in a local cantina, he is run out of the place labeled as a supporter of the Satab. As Solo runs from the crowd, he also happens to save Tieress Chrysalla, the consort to the Satab, from an assassination attempt. Solo is brought back to the Satab's palace as a hero where he discovers that the Satab rules the planet through the use of a stone known as the Shadeshine. A new Satab must be chosen every year because the power of the stone is able to burn out a person's body. The old Satab then goes to the Hall of Satabs where he is placed in suspended animation with the other former Satabs until a cure can be found for the burnout. Solo is placed in line to take the title, but before the current Satab can \"promote\" Solo, Chrysalla takes his place, saving him from becoming enslaved to the shadeshine. Solo tries to fight off the Satab, but with the power of the Shadeshine he is too powerful. Luckily, Chrysalla comes to Han's rescue preventing the Satab from entering the Hall of Satabs in time, causing him to implode into a pile of ash. Chrysalla then ends the rule of the Shadeshine by walking into the Hall of Satabs herself. Han is declared a hero for ending the rule of the Satabs, and a statue is made in his honor. Back in the present, stormtroopers finally catch up with Luke and the gang. Luke is able to trick the troopers into entering the Hall of Satabs by placing a memory stone with his voice in the nullification chamber. The Imperials enter the room and are immediately placed into suspended animation. Luke, Lando, and C-3PO then escape the planet in a Y-wing."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}