{"url": "Star_Wars_Annual_(1977)_3", "categories": ["Category:Real-world articles", "Category:Marvel Star Wars Annual"], "nodes": [{"tag": "h1", "text": "Star Wars Annual (1977) 3"}, {"tag": "p", "text": "Star Wars Annual 3: The Apprentice is the third and final annual issue in the Marvel Star Wars\nseries of comic books."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When a young boy hoping to become a Jedi Knight finds no encouragement from Luke Skywalker, Darth Vader welcomes him to the Dark Side of the Force. An allegory of space, power, and human nature crafted by Jo Duffy, scripter; and Klaus Janson, pencils, inks and colors."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Darth Vader is on board a Star Destroyer speaking with several Imperial officers. The Dark Lord lays down a plan to subjugate the Belderone system, beginning with the planet Belderone, where the Empire has set up a secret factory. A Rebel base on the planet Kulthis has been detected, and Vader plans to use the Empire's presence on Belderone as a staging point for a devastating attack on Kulthis. General Andrid is skeptical of Vader's plan, believing that it is born of a romantic sentiment, perhaps from his days as a Jedi Knight. Vader coldly rebukes the man, warning the general not to provoke him, as he will surely feel the Dark Lord's wrath."}, {"tag": "p", "text": "Meanwhile, on Belderone, a young man, Flint runs through the city streets, yelling for his friend Barney. A Rebel ship has landed in the spaceport, and Flint is eager to go see it and who it might bring. Barney is less than enthused, but Flint convinces him to come along. As the two friends make their way to the spaceport, Flint's mother, Zana warns Flint not to be late to his shift at the factory, as the Imperial supervisors are very strict about the citizens missing their enforced shifts. Flint promises that he'll be back in time, and the two young men run to the spaceport, just in time to see the Rebel group depart from their ship. Luke Skywalker, Lando Calrissian, Leia Organa, Chewbacca, R2-D2, and C-3PO make up the Rebel party, and they immediately begin to talk with the citizens gathered around, trying to confirm rumors that an Imperial operation is taking place is on the world. After mentioning that they came from Kulthis, the crowd thins dramatically, as no one wants to be associated with anyone from a Rebel-sympathizing world. However, Flint and Barney step forward, having spotted Skywalker's lightsaber. Flint's father had also been a Jedi Knight, and he confronts Skywalker, asking if his father had also been a Jedi Knight. Luke, having recently discovered that Darth Vader is his father, lies, claiming that his father was only a \"navigator on a spice freighter\". Despite this, Flint is still excited by the presence of outsiders, and he decides to bring them into the city, leading them towards his mother's tavern. As the Rebels are invited inside, a worker at the tavern recognizes them and contacts General Andrid."}, {"tag": "p", "text": "Andrid decides to go above Darth Vader and deal with the problem himself. He contacts three assassins that are stationed on the world and gives them the Rebels' location. However, the attack goes poorly. Skywalker senses the incoming attack with the Force, and the Rebels easily dispatch two of the assassins. The group attempts to capture the third man, but he immediately commits suicide. Skywalker's quick reflexes in the shoot-out confirm for Flint that Skywalker is indeed a Jedi, confident that only the Force could have made him so good. The sneak attack confirms for the Rebels that a serious operation is taking place on Belderone with the objective of destroying the Rebel base on Kulthis. While Lando and Leia decide to stay on Belderone, Chewbacca and Luke take the Millennium Falcon back to Kulthis to warn the Rebels. A squadron of one person craft had been arrayed before the Rebels had come to Belderone, and the group hopes that they can attack the Imperials before they can begin their attack on Kulthis. As the Millennium Falcon leaves the world, Flint and Barney contact the Rebels, deciding to show them the factory, and what they had been building."}, {"tag": "p", "text": "Meanwhile, back in space, Darth Vader receives word of General Andrid's foolish attack. Knowing that the Rebels have now been alerted to the Empire's presence, he Force Chokes the man to death, and decides to begin the Imperial attack immediately, placing Colonel Maldrod in charge of the attack. Back on Belderone, the Rebels arrive at the factory only to see several AT-AT walkers emerging from the underground structure. The Imperials plan to go straight through the nearby town and rendezvous with several Imperial bulk cruisers that will bring them to Kulthis. Leia and Lando make their way into the factory as Flint and Barney jump in a landspeeder and make their way to the town, hoping to warn the populace of the incoming walker attack. However, as they reach the town, Flint accidentally crashes the speeder, knocking the both of them unconscious. With the AT-ATs threatening to destroy the town, Skywalker arrives with the squadrons from Kulthis. A fierce battle begins to break out near the city, and one of the AT-ATs begins to rampage through the city, destroying everything in its path. The Rebels are finally able to destroy all the AT-ATs and the AT-AT factory with help from Leia and Lando who had been able to commandeer one of the walkers."}, {"tag": "p", "text": "The following morning, Flint awakens from his unconsciousness to find his town completely obliterated. He spies Barney lying nearby still unconscious and believes that he is dead. Flint runs to his mother's tavern and begins to search the rubble. Among the wreckage, he finds his mother's lifeless body, filling him with horrible grief. As Flint mourns over the destruction, he is found by Darth Vader, who sympathizes with his plight. Vader asks Flint to join the Empire, claiming that he will eventually give the young man special training to make him \"someone who matters very much.\" Meanwhile, back with the Rebels, Barney has been patched up, and he has decided to join the Rebellion, as his entire family was killed during the battle. Leia tries to apologize for the destruction of the city, but Barney claims that he knows the Rebels are not to blame."}, {"tag": "p", "text": "Back with the Imperials, Flint has donned his stormtrooper armor. As he gives one last look at a photograph of his former life with his mother, he puts on his helmet and boards an Imperial transport vessel. Darth Vader approvingly watches the rest of his stormtroopers board the Imperial ship."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The timeline placement for this comic as given in the Marvel Star Wars collection, Star Wars: A Long Time Ago... Volume 5: Fool's Bounty is between Star Wars 78 and Star Wars 79. However, this placement is likely due to publication date, as Luke, Lando, Leia, Chewbacca, R2, and 3PO are all together in this issue, whereas they are split up into two groups for issues 78 and 79."}, {"tag": "p", "text": "The AT-ATs seen in this issue seem to be much larger than the average AT-AT. This is seen when an X-wing starfighter is able to land on top of one of the vehicles without any overlap. Although this inconsistency may simply be the result of artistic interpretation, Abel G. Peña has theorized in an online essay, \"The State of the Galactic Civil War,\" that these may in fact have been new experimental walkers."}, {"tag": "p", "text": "It is interesting to note that Darth Vader recruits Flint into the Empire after he finds the young man grieving over his dead mother. Although purely coincidence, since Star Wars: Episode II Attack of the Clones was released almost twenty years after this particular comic, Vader's loss of his own mother to Tusken Raiders eerily resembles the situation that Flint experiences. Especially his attempt to rush to his mother's safety, but arriving too late to save her."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}