{"url": "Star_Wars_Anthology_Series", "categories": ["Category:Real-world articles", "Category:Anthology films", "Category:Stand-alone films"], "nodes": [{"tag": "h1", "text": "Star Wars Anthology Series"}, {"tag": "p", "text": "The Star Wars Anthology Series is the banner title for a series of stand-alone Star Wars films, beginning with Rogue One: A Star Wars Story in December 2016. It was first announced at Celebration Anaheim on April 19, 2015."}, {"tag": "h2", "text": "Development"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "In April 2012, five months before Lucasfilm Ltd. was sold to The Walt Disney Company, Star Wars creator George Lucas and producer Kathleen Kennedy sat to talk about the future of Star Wars. In one of their conversations, Lucas told Kennedy that he was planning to retire from blockbuster films and was going to focus on smaller and independently budgeted features, but he told her about the possibility of making more films centered in various characters from the Star Wars universe. Screenwriter Lawrence Kasdan was hired to write a Han Solo-centric film: \"And when I got there, they said, here we have nine ideas. And those were George's ideas. And I said, well I'm not sure I wanna do this. I've really done a lot of Star Wars. And they said, but look, one of these is Han Solo. I said, well okay. I do love Han Solo.\" (After Disney purchased Lucasfilm, he turned his attention to Star Wars: Episode VII The Force Awakens.)"}, {"tag": "h3", "text": "After the Disney deal"}, {"tag": "p", "text": "News that the Disney-Lucasfilm brand was developing several theatrical pictures separate from the core, episodic Star Wars saga was reported in 2013, with Lawrence Kasdan and Simon Kinberg slated to write their own individual spinoff films. While director Gareth Edwards' then-untitled Rogue One project was announced in 2014 as the first of these standalone features, it was not until the following year on April 19 at Celebration Anaheim that the announcement was made that the spinoff films would collectively be known as the Star Wars Anthology Series."}, {"tag": "p", "text": "Josh Trank signed on to direct an Anthology film in 2014 but left the project after a year to pursue other opportunities."}, {"tag": "p", "text": "On July 7, 2015, Lawrence Kasdan's Anthology film was given a release date of May 25, 2018, with Christopher Miller and Phil Lord attached to direct, and Kasdan's son Jon Kasdan contributing to the script as well. The film would follow the story of a young Han Solo. On June 20, 2017, it was announced that Lord and Miller were stepping away from the project. on June 22, it was announced Ron Howard would assume directorial duties on the film."}, {"tag": "h3", "text": "Future possibilities"}, {"tag": "p", "text": "In July 2015, director Guillermo del Toro, who was at one point considered to direct Star Wars: Episode VII The Force Awakens, commented that he pitched an idea for a film about Jabba Desilijic Tiure, and in 2017, it was reported that the idea was one of the many projects considered by Lucasfilm Ltd.\nIn August 2017, several sources rumored that a film focusing on Obi-Wan Kenobi was in development, with Stephen Daldry in negotiations to direct it and with Ewan McGregor potentially reprising his role. This film later became the Obi-Wan Kenobi series for Disney+. It was also reported that Lucasfilm was considering various spin-off films focused on many beloved Star Wars characters like Boba Fett or Master Yoda."}, {"tag": "p", "text": "In September 2018, Bob Iger told The Hollywood Reporter that Lucasfilm had reevaluated its release schedule for future films: \"I made the timing decision, and as I look back, I think the mistake that I made — I take the blame — was a little too much, too fast. You can expect some slowdown, but that doesn't mean we're not gonna make films. J.J. [Abrams] is busy making [Episode] IX. We have creative entities, including [Game of Thrones creators David] Benioff and [D.B.] Weiss, who are developing sagas of their own, which we haven't been specific about. And we are just at the point where we're gonna start making decisions about what comes next after J.J.'s. But I think we're gonna be a little bit more careful about volume and timing. And the buck stops here on that.\""}, {"tag": "p", "text": "According to production designer Neil Lamont, when the announcement was made, his team was working on a spin-off that involved Tatooine."}, {"tag": "h2", "text": "Films"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}