{"url": "Star_Wars_Battlefront_II", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Articles with an excess of redlinks", "Category:Cleanup", "Category:Incomplete lists", "Category:2017 computer and video games", "Category:Battlefront series", "Category:Canon computer games", "Category:Canon console video games"], "nodes": [{"tag": "h1", "text": "Star Wars Battlefront II"}, {"tag": "p", "text": "Star Wars Battlefront II is a video game created by Electronic Arts and developed by DICE, Motive Studios and Criterion Games. It was released on November 17, 2017. The game is a sequel to the 2015's Star Wars Battlefront and includes content from all three trilogies, and has three times as much content as the original had at launch."}, {"tag": "h2", "text": "Story"}, {"tag": "p", "text": "The storyline predominantly follows Iden Versio, commander of the Imperial Special Forces unit Inferno Squad. Upon witnessing the destruction of the second Death Star, Versio's troops look to her for direction. Versio tells her troops that they will avenge the Emperor."}, {"tag": "p", "text": "The story spans thirty years, beginning in the waning months of the Galactic Civil War and concluding at the destruction of Starkiller Base."}, {"tag": "p", "text": "There are segments in the campaign where other characters are playable as well, including Luke Skywalker, Han Solo, Kylo Ren, Lando Calrissian and Princess Leia Organa."}, {"tag": "h2", "text": "Plot"}, {"tag": "h3", "text": "Main Story"}, {"tag": "h4", "text": "Escaping from the Invincible Faith"}, {"tag": "p", "text": "Somewhere in space, a U-wing transport carrying a high-value prisoner is escorted to the Mon Calamari Security Cruiser Invincible Faith by two A-wing interceptors. A rebel officer, having profiled the prisoner, warns the ship's captain that she is highly trained in deception, infiltration, and extraction: she's special forces. The ship's captain interrogates her, identifying her as Iden Versio, commander of Inferno Squad in the Imperial Special Forces. He asks her to hand over an access code for her droid, but she doesn't respond. The captain proceeds to implore her to join the Rebel Alliance, warning her that his technicians will slice her droid either way and that the Galactic Empire's time has come, to which she replies that he's right: the Empire's time has come. After he leaves, Iden remotely activates her ID10 seeker droid, Dio, through her helmet, which shocks the Sullustan rebel technician. Dio sneaks through the Invincible Faith's ventilation, eventually making it to Iden's cell and freeing her from her cuffs. The droid slices open the door while Iden makes contact with Agent Gideon Hask, who asks her if the Rebels have figured out that she wanted to be captured. Iden sneaks past a briefing between key Rebel personnel and Admiral Gial Ackbar, who invites the Invincible Faith to join the rest of the Alliance Fleet amassing at Sullust to launch a surprise attack on the second Death Star above Endor, unaware that the Empire has already learned of this and is planning a trap. Iden moves towards the ship's communications center, where she erases an intercepted transmission from Moff Raythe that would have informed the Rebellion of the Empire's trap. This triggers an alarm, but Iden equips herself with a blaster and makes it to an airlock. She is intercepted by the Imperial raider Corvus, which jumps into hyperspace before the Invincible Faith can strike back. Iden reunites with Hask and Agent Del Meeko, and tells Hask to send a message to Admiral Garrick Versio: the Emperor's plan is safe. She watches over a hologram of the Death Star in orbit of Endor and remarks that the Rebellion will die today."}, {"tag": "h4", "text": "The Emperor's trap"}, {"tag": "p", "text": "The Emperor's trap is played out at the Battle of Endor. Nevertheless, the Rebel fleet under Admiral Ackbar's command is able to stand its ground. Admiral Versio watches from his Star Destroyer Eviscerator as Darth Vader's Super Star Destroyer Executor is brought down and crashes on the surface of the Death Star II, to which the Admiral calls Admiral Firmus Piett a fool. He tells an Imperial officer to put him in contact with Inferno Squad, which is on Endor's surface scouting the Death Star's shield generator. Commander Iden Versio informs her father, the Admiral, that the planetary shield generator has been destroyed beyond repair. The Admiral commands her to wipe out the Rebel troopers there and return to the Corvus to prevent the Emperor's plan from failing. Agent Meeko covers Commander Versio and Agent Hask as they take on the Rebel troopers, though they are too late to capture the saboteurs. After the Rebels are wiped out, Inferno discusses where they can find nearby TIE fighters when suddenly, the second Death Star explodes. They are overwhelmed with shock and grief, but Iden quickly takes control of the situation and tells her agents that they can grieve later and need to move. Admiral Versio informs Iden that Vice Admiral Rae Sloane, as the highest-ranking living commanding officer, has ordered a full retreat, and stresses to Iden that Inferno needs to survive and get off the forest moon. Inferno reinforces a squad of stormtroopers pinned down by Rebel forces and moves towards Platform 4 with them. Rebel forces are deployed across the forest moon to prevent Imperial troops from escaping and to secure their positions on the moon. Nevertheless, Inferno escape aboard three TIE fighters before the Rebels can sabotage them."}, {"tag": "p", "text": "Hask makes it to the Corvus while Iden and Del fly through the wreckage of the second Death Star, remembering that Inferno was created by Iden's father, Admiral Versio, after the destruction of the first Death Star to prevent something like this from happening again. The Corvus comes under attack from Rebel starfighters and bombers, but Iden and Del fend them off. Iden is privately contacted by her father, who tells her to meet with him on the Eviscerator for her next orders while Del and Hask stay behind on the Corvus. With the Corvus repaired, they jump to hyperspace, fleeing the aggressive Rebel fleet."}, {"tag": "h4", "text": "New orders"}, {"tag": "p", "text": "The Eviscerator and Corvus regroup above Vardos in the Jinata system, the homeworld of the Versio family. On the bridge of the Eviscerator, Garrick informs his daughter that the Emperor is dead. He shares with his daughter a Messenger droid he has received, which projects a hologram of the dead Emperor's final command: to begin Operation: Cinder at once. When Iden attempts to ask what their target is, the Messenger launches itself at her, telling her she is not verified. Garrick escorts his daughter away from it and hands Inferno's next assignments to her, warning her that her orders are unusual but that they are now living in unusual times."}, {"tag": "p", "text": "The Corvus travels to an Imperial shipyard in orbit of Fondor, where they are to provide security for Moff Raythe, who is procuring satellites essential for Operation: Cinder in his docked Star Destroyer Dauntless. However, the shipyard comes under surprise attack from a Rebel fleet. While Del remains on the Corvus, Iden and Hask make their way to their TIE fighters and defend the Dauntless from CR90 corvettes and Rebel U-wing transports. Iden protects Hask from Rebel starfighters before boarding the Rebel Mon Calamari star cruiser to disable its ion cannons that are firing on the Dauntless. Iden and Hask disable them, though the last explosion nearly sends Iden hurling into space, who is narrowly saved by the cruiser's closing gates. They return to their TIE fighters and take to the stars, though are ordered by Moff Raythe to attack the Imperial facility itself in order to free the Dauntless from the shipyard's jammed clamps. When Iden asks what their target is, Moff Raythe tells her that, now more than ever, power is the only path to peace, and Admiral Versio will take part in cleansing the galaxy clean to remind the people of the galaxy that the Empire is still in control. The Dauntless is ultimately freed and opens fire on the Rebel cruiser with its turbolasers, destroying it. Moff Raythe tells Iden that her father will be proud."}, {"tag": "h4", "text": "Encountering the enemy"}, {"tag": "p", "text": "After the defense of Fondor, Inferno is granted access to the Emperor's Observatory on Pillio, one of many Observatories established by the Emperor across the galaxy for various classified purposes. Agent Del Meeko is sent alone to shut down the Mantle defense system and destroy the Observatory as its contents could be used by the Rebel Alliance against the Empire. Meeko travels to Pillio aboard a single Lambda shuttle with stormtrooper forces, unaware that the new age Jedi Knight and Rebel Commander Luke Skywalker is already there with his astromech R2-D2 on his own mission to the Observatory. Luke is forced to defend himself when the stormtroopers open fire on him, but encounters Meeko trapped in amber by Pillio's native Scritters. Meeko initially doesn't recognize Skywalker until the Jedi uses his lightsaber to free him. He doesn't understand why an enemy of the Empire would help him, to which Skywalker replies it's simply because he asked. Facing a common enemy and mission, Meeko is forced to work with Skywalker to defend themselves against Pillio's bugs and locate the Observatory. Despite Skywalker's shouts, Meeko hurls a thermal detonator at the bugs, ripping open the cave's grounds beneath them. Nevertheless, they reach the Observatory, where Skywalker defends Meeko from the bugs as he shuts down its security systems."}, {"tag": "p", "text": "After the Mantle defense system is shut down, they are nearly overwhelmed as they run towards the Observatory, but the bugs strangely fly away from it and thus Skywalker and Meeko. Skywalker uses the Force to open the Observatory's doors, leaving Meeko as to wonder why the Emperor would create a facility that could only be opened using the Force. Skywalker tells Meeko that he already knows, to which Meeko asks in disbelief if Skywalker is telling him that the man who destroyed the Jedi Order was secretly one of them. Skywalker tells Meeko, however, that, as a boy growing up on Coruscant, he feared the wrong thing. Meeko remarks that the Emperor was only protecting junk, but Skywalker takes interest in a particular compass and asks Meeko if he can keep it. Meeko asks Skywalker why he would let him do that since his orders are to destroy the Observatory and Skywalker is an enemy, to which Skywalker replies simply because he asked. Meeko decides to let Skywalker keep the compass. Skywalker then asks Meeko to reconsider his mission, saying that the Empire has already done enough damage to many innocent worlds."}, {"tag": "p", "text": "As they depart from the Observatory, Meeko asks Skywalker how they can just walk away and pretend like this never happened. Meeko confesses his growing doubts in the Empire to Skywalker, who tells Meeko that he has a choice. Meeko misinterprets this as a choice between the Empire and the Rebellion, but Skywalker corrects him in that it's simply a choice to be better. Skywalker wishes Meeko \"may the Force be with you\" as he leaves, walking off into the sunset with Meeko watching from behind."}, {"tag": "h4", "text": "Inferno's target"}, {"tag": "p", "text": "Meeko returns to the Corvus with Hask and Iden, who informs them that their next assignment is to extract Protectorate Gleb from Vardos. Gleb serves as headmaster of the Future Imperial Leaders Military Preparatory School, raised both Hask and Iden, and also serves as an officer in Jinata Security. Iden is unsure how this relates to Operation: Cinder but states that they must trust the Admiral. However, when they arrive to Vardos, they find the satellites, which are climate disruption arrays, being deployed by the Dauntless, pointed out by Meeko, in orbit of Vardos. Inferno is shocked to see this, and Hask recalls that they were never informed of their target. An angered Iden confronts her father aboard the Eviscerator, pleading with her father that Vardos and its people are loyal to the Empire. Her father rationalizes that Operation: Cinder will spread fear throughout the galaxy that will allow the Empire to continue its rule by fear in order to control the galaxy and maintain order. Iden continues to try and appeal to her father that Vardos is their home, to which he responds, raising his voice, that the Empire is their home and that they will do as the Emperor commands. Iden says that she will not take orders from dead men, causing her father to assert his authority over her, shouting that she takes orders from him before reminding her that her orders are to extract Protectorate Gleb alone. He dismisses her, though Iden walks off with a bitter face. The Admiral tells an Imperial officer to patch him in with Agent Hask."}, {"tag": "p", "text": "The Corvus lands in an Imperial facility on Vardos, where hurricanes and superstorms are forming from the beams being shot down by the satellites. Iden says that they will find Gleb in the Archive in Kestro. During their walk there, they encounter disgruntled protesting civilians and learn that any aircraft attempting to leave the planet will be shot down. Iden, Del, and Hask debate this turn of events; Iden notes that the people on Vardos are their people, and that their own troopers are in harm's way, while Hask retorts that their fearlessness in the face of the storms shows true discipline, and that Operation: Cinder is a test to prove that they are worthy of what is to come. They eventually make it to the Archive, where they find Gleb and a Rodian agent among a group of civilians. As Hask escorts Gleb and the agent away, orange lightning hits one of the buildings, causing part of its structure to fall, the resulting debris nearly crushing a civilian. With Iden's approval, Del tells the civilians to run to the Corvus. Hask tries to stop it, but Iden commands him to stand down. Hask reminds Iden and Del that their orders are to extract the Protectorate Gleb alone. Del says he doesn't recognize the Empire anymore, and Iden defends him, pointing out that it is the Empire's duty to protect civilians from things like Operation: Cinder. When Hask asserts that this is the \"new Empire,\" Del finally says that he wants no part in this new Empire and will follow his commanding officer. Hask asks Iden if these are her orders, which are treason, and Iden says they are. Hask refuses to lower his weapon and warns that defiance will be the death of them before pointing it at Iden, but she shoots Hask first in his leg, buying time for Iden and Del to escape. Hask contacts Admiral Versio and informs him that Commander Versio and Agent Meeko have abandoned the mission and committed treason."}, {"tag": "p", "text": "Iden and Del sneak their way through the city, reluctantly shooting Imperial troops who notice them and learning that the Admiral has ordered their deaths. They manage to steal an AT-AT and use it to take out the anti-air batteries across the city, eventually destroying a satellite array that disables all anti-air batteries across the sector. Del pilots the AT-AT to the Corvus while Iden shoots at Imperial forces firing at them, including AT-STs, demolition troopers, turbolasers and another AT-AT. She blows up the barricade at the Imperial facility where the Corvus is docked, but a bolt of lightning disables the AT-AT. Iden and Del regroup with their crew, who are under fire from Imperial troops and cover them as the Imperial raider's ramp is lowered and the refugees get on board. The lightning storm protects them from an advancing AT-AT walker, and they escape as scout walkers arrive at the facility. They evade the Eviscerator and the Dauntless and jump to hyperspace."}, {"tag": "p", "text": "Meanwhile, Agent Hask returns to the Eviscerator with Protectorate Gleb and her agent, reporting to Admiral Versio, who congratulates Hask on the \"success\" of his mission and promotes him to Commander."}, {"tag": "h4", "text": "Combating Cinder"}, {"tag": "p", "text": "In the Vorpal Nebula in the Outer Rim Territories, Iden and Del discuss the situation, not knowing where to go next. Iden notes that some of their crew stayed loyal with them and is helping protect the refugees, who are frightened and confused but safe, while Del makes repairs to her droid. Del tells Iden to leave with the Corvus and let him stay alone in a TIE fighter, sending a general distress call to the Rebellion, but Iden refuses to abandon him. Ultimately, they decide to surrender to the Rebel Alliance, sending a general distress transmission which is intercepted by Danger Leader Shriv Suurgav. After the Restoration captures the Corvus and her crew, General Lando Calrissian arrives and confronts Iden and Del. He thanks them for the intel they provided on Operation: Cinder and offers them two T-65B X-wing starfighters to start a new life. Calrissian learns that Operation: Cinder is targeting Naboo, the homeworld of the Emperor himself. Iden and Del warn that the Empire is changing and so are its tactics. Calrissian gives them a choice of fighting with them against Operation: Cinder or running away. Though not wanting to join the Rebellion, Iden and Del reluctantly agree to help combat Operation: Cinder."}, {"tag": "p", "text": "Calrissian arrives above Naboo with his fleet and Danger Squadron, which Iden and Del have temporarily joined under the call signs Danger Five and Danger Six, reinforcing Princess Leia Organa who is already there with a host of Rebel troopers and fighting in the stars in three N-1 starfighters against Imperial forces led by Captain Lerr Duvat and the climate disruption array satellites. Iden, Del, Shriv, and Danger Squadron help Leia and the Rebel and Naboo pilots take out the climate disruption arrays, then cover their Y-wing bombers as they make bombing runs on the Star Destroyer Torment. With the Torment's shields disabled, the Restoration opens fire on it, destroying it. However, Idel and Del noticed that some Imperial troops transports and TIEs evacuate the Star Destroyer, but instead of retreating to the nearest safe zone, per standard protocol, they headed toward Theed, the capital of Naboo."}, {"tag": "p", "text": "Danger Squadron makes its way towards Theed, where Iden, Del, and Shriv help reinforce the Rebel troops there fighting in battle against the Imperial forces. They split up to reactivate power relays that can be used to activate Theed's defense system: an ion pulse that spreads across the city from the royal palace, which was installed after the Invasion of Naboo by the Trade Federation. Leia and her troops cover Del as they make their way across the city with Del wiring the power relays back online. With the power relays online, they make their way to the central street where Rebel forces battle against stormtroopers and an advancing AT-AT walker. Leia and her troops cover Del as he reactivates the defense system in the palace, falling back as the stormtroopers push their line. Del gets the system online, and the Rebel forces fall back inside the palace as the ion pulse is detonated, disabling the Imperial forces' blasters, walkers, and starfighters. Rebel troops rush out, and the Imperial forces surrender."}, {"tag": "p", "text": "Princess Leia confronts Iden and Del after the battle in the royal palace, having learned that they are Inferno Squad from General Calrissian. Leia notes that watching them in battle, this fight against the Empire means something more to them than trying to run away. Iden says that there is no excuse for the damage they've done against the Rebel Alliance, and would like to continue fighting with them if they would allow them to, having realized they have been fighting for the wrong side this whole time. Leia says that people like Iden and Del give the galaxy hope, and hope is the reason that they will triumph over the Empire. She then welcomes them to the New Republic."}, {"tag": "h4", "text": "Tracking a missing general"}, {"tag": "p", "text": "Months later, Leia Organa, now a Senator in the Galactic Senate on Chandrila, reaches out to Iden Versio, who leads Inferno Squad in the New Republic Defense Force. Leia tells Iden that she has tracked down a missing general of theirs to Takodana, and asks that she find Han Solo."}, {"tag": "p", "text": "In Takodana Castle, Han tells Maz that he has learned of an Imperial defector, Ralsius Paldora, who has valuable information for the Republic and how to liberate the Wookiees back on Kashyyyk, who were held hostage by Grand Moff Lozen Tolruck and his faction. Solo eventually finds Paldora, a statistician, who has hidden away his intel in data cubes in Takodana's forests. Paldora tells Solo that he gathered his information from a man named Rax, an Imperial officer consolidating much of the fractured Empire. As they leave, they spot Imperial forces arriving on the planet, forcing Solo and Paldora to fight their way through the forests. They make their way to the Millennium Falcon with Chewbacca, Solo's Wookiee copilot, and fight in the skies against an Imperial light cruiser and TIE fighters with the aid of Inferno Squad. Solo successfully destroys it, sinking it to the bottom of Nymeve Lake, and extracts Paldora off the planet. On the Corvus, Solo contacts Leia and thanks Inferno for the help."}, {"tag": "h4", "text": "Operations in the Anoat sector"}, {"tag": "p", "text": "Iden learns from Paldora's intel that her father has been running operations on Bespin and Sullust in the Anoat sector, which is under heavy lockdown by Governor Ubrik Adelhard and his faction. She and Del contact Senator Organa and ask for authorization to sabotage her father's operations and potentially capture him. Leia notes that she is not their commanding officer, but Del fears that Fleet command will not approve of a mission that could be deemed too personal. Understanding, Leia shares her approval with Iden and Del to pursue their mission. The two fly alone to Chinook Station in the clouds of Bespin, which is being used for refueling Admiral Versio's Imperial fleet, hoping to sabotage it and capture Gideon Hask, who they've learned is there as well. They infiltrate the station, wearing stormtrooper armor as disguise. However, when they reach the top of the platform, they learn that Hask has set them in a trap. They try to go after him, but his Star Destroyer escapes, and alarms are triggered across Chinook Station, forcing them to fight their way out."}, {"tag": "p", "text": "Unable to reach their X-wings, Iden reluctantly agrees to hijack a cloud car with Del. They use the cloud car to ignite the fueling sites at Chinook Station; the explosion causes a chain reaction that brings down three Star Destroyers still docked there. Though Chinook Station is destroyed, thus crippling Admiral Versio's fleet's fueling source, Hask and the admiral escape."}, {"tag": "p", "text": "Sometime later, Lando and Shriv, the latter now a member of Inferno Squad, undertake the mission to an abandoned Imperial weapons depot on Sullust hoping to capture the weapons for the New Republic. However, when they arrive, they find that, despite Sullust being liberated, which Shriv had been part of, Imperial forces have recaptured the weapons depot and are using it for arms manufacturing. Lando decides that their best course of action is to destroy the weapons depot instead. Lando reaches the control center while he sends Shriv to look for a means of transport in order to escape. Lando causes the lava in the weapons depot to overflow and escapes with Shriv aboard an AT-ST, but they are unable to make it to a nearby Imperial shuttle in time for escape. As the lava rises, Shriv sarcastically remarks to Lando that if he dies today, he's glad Lando will too. However, just in the nick of time, Iden arrives with the Corvus and saves them from the overflowing lava."}, {"tag": "h4", "text": "Showdown at Jakku"}, {"tag": "p", "text": "Admiral Ackbar has ordered all Republic forces to Jakku in the Western Reaches, where the Imperial Army and Imperial Navy have been reconvened, consolidated from Imperial fleets by Rax, among them her father's. The expected showdown is believed to possibly mean the end of the Galactic Civil War. The Republic Navy arrives, initiating the Battle of Jakku, while soldiers of the New Republic army are landed on the desert surface of Jakku. In the skies of Jakku, the Corvus receives a large number of distress calls from their sector. Iden and Shriv make their way to two X-wing starfighters while Del holds the Corvus and directs them towards the sources of the distress calls. They first land at a crashed Star Destroyer, where TIE bombers are deploying from and being used to harass Republic troops in the sector. Iden and Shriv fight against the stormtroopers defending the Star Destroyer and take it out before taking off to the skies again. They reinforce Captain Lindsey and his troops on the ground, who is on the march to Carbon Ridge to take out a mysterious Imperial research facility but has been intercepted by two AT-AT walkers and Imperial forces. Iden uses binoculars to indicate to the Starhawk Unity the coordinates of the AT-AT walkers so that it can launch orbital bombardments on them. The AT-AT walkers are taken out, and Inferno helps Lindsey and his troops take out the Imperial troops attacking them, allowing them to continue their advance to Carbon Ridge."}, {"tag": "p", "text": "Iden and Shriv return to their X-wings and make it back to the Corvus, but they fall under attack from Imperial forces led by Hask, who pilots a modified TIE interceptor. After a hefty dogfight, Iden shoots him down, seemingly killing him, and decides to go after her father after spotting the Eviscerator, disabling communications with Del and the Corvus. She crash lands on top of the Eviscerator and fights her way through Imperial stormtroopers, making her way through a hole punched in the Eviscerator. As she makes her way to an elevator to the Star Destroyer's bridge, she hears an Imperial officer give a command to retreat to Counselor Rax and Admiral Versio order for evacuation before being cut off, learning that her father is still here. On the bridge, Admiral Versio gives the go for his right hand Imperial officer to leave while Iden confronts her father, telling him that he doesn't have to go down with the Empire. Garrick declines his daughter's rescue attempt. He tells her that Rax expects him to leave to, but he has also refused him. Garrick explains how he's given his life to the Empire and can scarcely believe that all that's left of it is being destroyed here. A Republic escort frigate crashes near the bridge of the Eviscerator, and Garrick falls into his daughter's hand but ultimately lets go. He tells his daughter that she is strong and urges her to find peace in her life as he resolves to go down with his ship. Realizing she cannot convince her father and seeking to get back to Del, Iden runs off as the Eviscerator begins to plummet to Jakku's sandy plains, the Star Destroyer exploding around her. She makes her way to an escape pod and launches towards Jakku."}, {"tag": "p", "text": "Iden regains consciousness as Del finds her escape pod and lifts it open. He tells Iden that the battle is over, and that they have won. The two embrace and kiss as Shriv arrives with Dio. He then directs Iden and Del over a sandy hill, where they watch over the wreckage of the Imperial fleet."}, {"tag": "h4", "text": "Decades later"}, {"tag": "p", "text": "Thirty years later, an Upsilon-class command shuttle arrives to Pillio, which has become dry and arid. The dark warrior Kylo Ren disembarks from his command shuttle with stormtroopers of the First Order and meets with Protectorate Gleb and Jinata Security, who have captured the Corvus and taken its crew prisoner. On the bridge of the Corvus, Kylo confronts a hurt and collapsed Del Meeko, who sarcastically says that if Kylo wanted to hire his ship, he could have just asked. Kylo interrogates Del over information regarding the map to Skywalker, which Del plays dumb with, leading to Kylo to infiltrate his mind with the Force. Kylo experiences Del's memories, from his time as a shoretrooper on Scarif to the formation of Inferno Squad, to the Battle of Endor, where Kylo notes that Del and Iden are married now and have a daughter and that it was Iden who turned him into a traitor, to Del's encounter with Skywalker on Pillio, which Kylo notes is where Del found faith, to a fight on Vardos involving Jinata Security troopers and First Order stormtroopers. Kylo notes that Vardos is where their \"family\" was torn apart as he slices through Iden, Del, and Hask in their Inferno uniforms. Kylo mocks Del as a coward, and continues to press him for where Lor San Tekka of the Church of the Force took the map to Skywalker, the last Jedi, all the while mentally torturing him. Finally, Del tells Kylo that San Tekka took it to Bayora."}, {"tag": "p", "text": "Kylo lets go and leaves Del to Gideon Hask, who is now a First Order officer. Hask continues to call Del a coward and expresses his \"disappointment\" in him for abandoning his post as a soldier, trading it in for a simple life of fatherhood and hauling cargo on the Corvus. Del remarks that everyone changes, including Hask himself, who \"used to be dead.\" Hask then hints at his intentions to kill Iden. Del pleads with Hask not to go after Iden, calling him by his first name, warning his former friend that it will not end well for him. Hask, however, takes out his blaster pistol and repeatedly shoots Del, killing him. Outside the Corvus on Pillio, an angered Hask confronts Gleb over her failure to keep Project Resurrection confidential, reminding her that the First Order helped Jinata Security rebuild Vardos and maintain control over the Jinata system. Gleb tells Hask it was an honest mistake, and says that they will relocate the Pillio operation and triple efforts on Athulla. Hask says that he will leave some of his men behind to assure this goes through. Before leaving, he turns to Gleb and tells her to bury the bodies of Del Meeko and his crew but to leave the Corvus intact. Gleb warns that this will allow Iden to track it and lead her to Pillio, to which Hask replies that he is counting on it."}, {"tag": "h3", "text": "Resurrection DLC"}, {"tag": "h4", "text": "Mission to Athulla"}, {"tag": "p", "text": "Iden Versio and her daughter, Zay, practice maneuvers in their X-wing starfighters at Kiara's Comet Cluster in the Hartaga system. Iden receives a message from the Corvus, which she assumes is from her husband and Zay's father, Del Meeko. Instead Shriv Suurgav tells Iden he needs to see her, and will send coordinates to meet."}, {"tag": "p", "text": "Iden and Zay dock with the Corvus at Pillio. Shriv tells them that he was sent by General Organa to investigate rumors of a First Order operation called Project: Resurrection, which the Resistance suspects is responsible for a number of people disappearing. Shriv's scanners picked up the Corvus on the surface of Pillio, and found the ship abandoned and the planet strip-mined. He found no sign of Del, but checked the ship's logs to find that before Pillio he had visited Athulla, a planet on the edge of the Jinata system."}, {"tag": "p", "text": "The Corvus arrives at an asteroid field surrounding Athulla, where they are contacted by an Athullan expecting Del, who was investigating Jinata Security kidnapping families from their planet. The signal is jammed by the J-Sec Nebulon-B frigate Opportunity, captained by Leema Kai. Kai orders the Corvus to surrender, but Iden and Zay destroy all of the frigate's transport and starfighter escorts, then disable its engines. Leema Kai attacks them in his modified N-1 starfighter which can launch seismic charges. Iden destroys Kai's fighter, killing him, and the Opportunity surrenders after Zay threatens to fire a barrage of concussion missiles at the ship as a bluff. The frigate's crew tell Shriv that Project: Resurrection is run by Protectorate Gleb from Jinata Security headquarters on Vardos."}, {"tag": "h4", "text": "Return to Vardos"}, {"tag": "p", "text": "The Corvus arrives at Iden's homeworld of Vardos—once an Imperial utopia, but now an ash-strewn wasteland due to the effects of Operation: Cinder decades earlier. Iden orders Zay to stay aboard the Corvus, while she and Shriv confront Gleb at the Archive building. As they make their way through the ruins of Kestro, they see red lights streaking through the sky—the destruction of the Hosnian system by the First Order's Starkiller Base."}, {"tag": "p", "text": "Entering the Archive, Iden finds Gleb dead on the floor. Gideon Hask steps out of the shadows, saying the Protectorate had outlived her usefulness to Project Resurrection and the First Order. Iden accuses them of kidnapping children, but Hask refers to Resurrection as \"rescuing\" children, and forging them into an army for the First Order. Shriv says the Senate will not allow it, but Hask informs them that the Senate and the Hosnian system have been destroyed. He tells Iden that on this great day, he chose to be with her where it all began—the defection of Inferno Squad from the Empire at the Vardos Archive. Hask gloats that he is at last getting his revenge for Iden's actions that day—first by killing Del, and then her daughter. He gestures outside, where a Star Destroyer opens fire on the Corvus, destroying it. Hask orders his squad of stormtroopers to interrogate Iden and Shriv for information on the Resistance. As they are escorted outside, a Jinata Security officer throws a thermal detonator at the troopers, allowing Iden to disarm and incapacitate them."}, {"tag": "p", "text": "With J-Sec and the First Order occupied with fighting each other, Iden orders her droid Dio to slice a relay station to detect the homing beacons from the Corvus's escape pods. They locate two pods but both are empty; however, Dio picks up a third beacon, where they find Zay has set up a sniper's nest to defend herself. After clearing the area of First Order and J-Sec troops, Iden tells Zay that her father is dead—she blames herself for not joining the Resistance earlier, and resolves to board Hask's Star Destroyer, the Retribution, to kill him. Shriv and Zay assure her it isn't her fault, and Shriv welcomes Iden to the Resistance."}, {"tag": "h4", "text": "Aboard the Retribution"}, {"tag": "p", "text": "Iden, Zay and Shriv steal two TIE fighters and join a squadron in formation around the capital ship. When the Retribution asks why they haven't remained on Vardos as ordered, they open fire on the other TIEs and engage them in a dogfight. Dio's scan picks up a weak spot on a heat sink near the ship's aft engines, which Iden destroys allowing them to fly inside its superstructure. As they fly inside, Retribution jumps into hyperspace, causing their ships to crash. Iden and Zay locate a computer terminal, which Dio slices to reveal details of Project Resurrection: the abduction of thousands of children to train as Stormtroopers, the construction of hundreds of capital ships in the Unknown Regions, and the plans for a First Order Dreadnaught. After Dio has downloaded the plans, Iden resolves to rip the ship out of hyperspace. She sends Shriv to find them a means of escape, then she and Zay plant ion detonators on the Retribution's hyperdrive generators."}, {"tag": "p", "text": "As Iden places the last charge on the backup generator, Hask appears and holds Zay at gunpoint. Iden drops her weapon, and as Hask shoots at her, Zay knocks him off balance. Hask throws Zay off the platform, but she is caught by Iden. Zay hands her mother a blaster, and she shoots Hask who falls to his death. Iden and Zay detonate the charges, destroying the hyperdrive and forcing the Retribution to drop out of lightspeed within view of Starkiller Base. Iden collapses and Zay realizes she has been critically wounded. She promises to get help, but Iden is resigned to her fate, telling her daughter as she dies that they fight so that others may live, and that if they die, it had better be for the same reason. As Zay looks sadly out into space, Starkiller Base explodes, creating a new star."}, {"tag": "p", "text": "Zay, Dio and Shriv arrive at the base on D'Qar in a commandeered Special Forces TIE Fighter, where they are nearly shot down by a Resistance patrol. After Shriv confirms their identity, Zay is contacted by General Organa, who tells them the First Order is on its way to D'Qar, and assigns them an urgent mission to seek help and reinforcements from their allies in the Outer Rim. Zay and Shriv accept the mission, and jump to lightspeed..."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The game returns to the roots of the classic Battlefront games, using a class-based system for infantry troopers with each class having a shared progression system, but with equipment differing depending on faction."}, {"tag": "p", "text": "The trooper classes offered are Officer, Assault, Heavy, and Specialist."}, {"tag": "p", "text": "More vehicles are included for all factions, including Tauntauns and the AT-RT. Space battles also return with new starships. Vehicles are also to be a part of a new customization and progression system."}, {"tag": "p", "text": "Vehicles, heroes, and reinforcements can be purchased in matches by gaining Battle Points through play rather than picking up a token as it was with the previous game."}, {"tag": "p", "text": "Playable hero and villain characters from the films have been expanded upon, with players able to customize skills to their liking. Creative Director Bernd Diemer stated that he wanted the heroes to have more depth rather than feeling like a momentary power up."}, {"tag": "p", "text": "The game also featured loot boxes. Initially, these loot crates, which could be purchased with money, contained game altering abilities, but due to receiving heavy criticism, microtransactions were temporarily disabled at launch. On March 16, 2018, microtransactions were confirmed to be returning, albeit for cosmetic items only, which could be directly purchased while loot boxes would only contain in-game currency and other cosmetics, such as emotes. Progression is now entirely linear; playing as a particular class allows players to upgrade its abilities and unlock new ones."}, {"tag": "h3", "text": "Game Modes"}, {"tag": "h2", "text": "Music"}, {"tag": "p", "text": "Gordy Haab composed and orchestrated the musical score of Star Wars Battlefront II. The score was performed by the London Symphony Orchestra and London Voices at Abbey Road Studios, and was nominated in the 2017 G.A.N.G. Awards."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The game's development was revealed in an interview with an EA executive in 2016. More information, including its development by DICE and Motive Studios, was revealed during EA's Livestream during E3 2016."}, {"tag": "p", "text": "The game's development is a collaboration between DICE, who developed the multiplayer, Motive Studios, who developed the single-player mode, and Criterion Software, who developed the vehicle and flight controls. The game includes content from all three film trilogies. A goal of the game's story is to humanize the Empire in ways that haven't been seen before."}, {"tag": "p", "text": "On April 12, 2017 a teaser trailer was leaked giving confirmation that the game would include content from all three main Star Wars eras, a single-player campaign, and heroes such as Kylo Ren, Rey, Darth Maul, and Yoda. EA premiered this trailer the following day during their panel at 2017's Celebration Orlando. A gameplay trailer for the game was released on June 10, 2017 during the Battlefront II panel at E3 2017."}, {"tag": "p", "text": "The single-player trailer was released in October 2017, with a preview on The Star Wars Show."}, {"tag": "p", "text": "While working on the game, the development team notably consulted Emil Fortune's reference book Star Wars: Galactic Atlas. Additionally, the team worked with Lucasfilm Ltd.'s Story Group on the campaign and characters, including making sure Luke Skywalker's character arc was consistent, and keeping the game in line with other Star Wars visuals, according to Game Director Mark Thompson."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "In April 2017 during the presentation at Star Wars Celebration, it was confirmed that the game would be released on November 17, 2017 and November 14 for those pre ordering the Deluxe Elite Trooper Edition. An open beta was held from October 4 to October 11."}, {"tag": "h3", "text": "Reception"}, {"tag": "h4", "text": "Pre Release"}, {"tag": "p", "text": "When the game was announced it was received with mostly positive reaction by most fans, largely because of the inclusion of all three cinematic eras, a single-player campaign, and improved gameplay from the previous reboot of the series. However, after the open beta, the game received criticism for the use of loot boxes and crates, with many players worried over the supposed introduction of a \"pay to win\" system and random progression not tied to player skill."}, {"tag": "p", "text": "The game, alongside EA itself, was lambasted for locking Heroes and making players \"grind\" large amounts, some estimated to be around 40 hours, to unlock a single character, which in turn would encourage the purchases of Loot crates to make it easier for the player to unlock them. When EA responded to the criticism on Reddit, their comment received several hundred thousand downvotes, more than any other Reddit comment by magnitudes."}, {"tag": "p", "text": "After the huge backlash and reception of the loot crate system, EA and DICE temporarily removed microtransactions from the game on launch to focus on refining the loot crate system for another time."}, {"tag": "h4", "text": "Post Release"}, {"tag": "p", "text": "The game was met with mixed to positive reception from critics with a metascore of 65 (PC), 68 (PS4), 66 (Xbox One) on Metacritic, with most critics pointing out the improvement over the first game with content, but criticizing the story and the progression system calling it convoluted and messy. A few critics also pointed out the plethora bugs and glitches infecting the game at launch, which appeared predominantly in the Xbox One version.[source?] On the other hand, reaction from players and fans was almost universally negative, with Metacritic user scores below 1 (out of 10) for all three versions, in large part due to the progression system."}, {"tag": "p", "text": "During this time, Mat Everett left the role of community manager due to the backlash, and Ben Walke stepped into the role."}, {"tag": "p", "text": "The game faced heavy criticism for its economic and progression system due to being tied to microtransactions that allowed players to purchase a certain amount of \"crystals,\" an in-game currency, in order to then purchase loot crates that could be used to randomly unlock and upgrade Star Cards. Furthermore, the game received criticism for the high amount of \"credits,\" another in-game currency, it cost in order to purchase playable hero and villain characters, which would take hundreds of hours of grinding in order to obtain. The fallout from the microtransactions scandal was massive enough to attract attention from mainstream news outlets such as CNN and The Wall Street Journal. Disney and Lucasfilm have also publicly sided with gamers and criticized EA over the latter's handling of the game. Along with reportedly having the potential to harm the game's sales prospects, the incident also further hurt EA's public image; EA's shares on Wall Street dropped by 2.5% on launch day."}, {"tag": "p", "text": "In response to the criticism, microtransactions were immediately disabled at launch, albeit temporarily. The cost to purchase heroes was also lowered by 75%. On March 16, 2018, developer DICE announced microtransactions would be returning in April, which can only be used to purchase cosmetic items; the progression system was redesigned in order to be linear, and was released on March 21."}, {"tag": "h4", "text": "Government responses"}, {"tag": "p", "text": "EA's incorporation of loot boxes into the Battlefront II game has also attracted the attention of several governments. On November 15, the Belgian Gaming Commission announced that it would be investigating whether the inclusion of loot boxes constituted gambling. In response, EA denied allegations that their loot boxes constituted gambling, asserting they were part of a \"fun and fair game experience.\" On November 22, the Belgian Gambling Commission ruled that EA's microtransactions constituted a form of gambling. The Belgian Minister of Justice Koen Geens also regarded the \"mixing of gaming and gambling as dangerous\" for the mental health of children and called for a ban on gaming loot boxes throughout the European Union."}, {"tag": "p", "text": "In response to the Belgian Gambling Commission's investigation, the Dutch Gambling Commission also announced their own investigation into microtransactions in Battlefront II. EA's practices also drew criticism from United States officials. In a video statement, Hawaiian State Representative Chris Lee described Battlefront II as \"a Star Wars-themed online casino designed to lure kids into spending money\" and announced his intention to introduce legislation banning such practices in his state. Another Hawaiian State Representative Sean Quinlan likened online gambling in the game to encouraging children to smoke."}, {"tag": "p", "text": "In addition, gambling regulators in South Korea, Singapore, Australia, and the United Kingdom have also expressed disapproval of Electronic Arts' incorporation of loot boxes into gaming products including Battlefront II."}, {"tag": "h3", "text": "Editions"}, {"tag": "p", "text": "In its original release, two editions of the game were available: the Standard edition and the Elite Trooper Deluxe Edition. (The Elite Trooper Deluxe Edition included Rey and Kylo Ren The Last Jedi skins, early access to the game, and game upgrades for weapons and Heroes.) A third edition, the Celebration Edition, was released on December 5, 2019."}, {"tag": "h2", "text": "Downloadable content"}, {"tag": "p", "text": "DICE hinted that the game will not include a season pass, unlike the previous game, instead they wanted to find a better alternative in order to avoid \"fragmenting\" the community of players.\nIt was confirmed during EA Play 2017 that there would not be a season pass; rather, all downloadable content will be free for all players and will be included in events called Seasons."}, {"tag": "h3", "text": "The Last Jedi Season"}, {"tag": "p", "text": "The first Season expansion, The Last Jedi Season was released on December 5 and is centered around Star Wars: Episode VIII The Last Jedi, the eighth film in the Star Wars saga which was released on December 15, 2017. It features a space map over D'Qar, the new planet Crait, Resistance hero Finn and First Order villain Captain Phasma."}, {"tag": "h4", "text": "Battlefront II Resurrection"}, {"tag": "p", "text": "The Last Jedi Season also featured a campaign addition available December 13, named Battlefront II: Resurrection, which details Commander Iden Versio's journey during the First Order's rise to power and contains three chapters."}, {"tag": "h3", "text": "Solo Season"}, {"tag": "p", "text": "On May 3, EA Star Wars announced on Twitter that the second Season in the game would be based on the character of Han Solo, releasing alongside Solo: A Star Wars Story. The first part of the Han Solo Season was released on May 16 and features the returning map set in Jabba's Palace, a new game mode (Hero Showdown), new skins for Leia Organa and Lando Calrissian based on their disguises in Star Wars: Episode VI Return of the Jedi, and the addition of starfighters to Arcade. The second part of the Han Solo Season was revealed in a trailer on June 6 and its content released on June 12, which included a new map on Kessel, the Millennium Falcon as it appears in Solo: A Star Wars Story, the returning game mode Extraction, and new skins for Han Solo, Lando Calrissian, and Chewbacca as they appear in Solo: A Star Wars Story."}, {"tag": "h3", "text": "Clone Wars content"}, {"tag": "p", "text": "The game's Design Director, Dennis Brännvall, teased that Star Wars: The Clone Wars content was going to be added to the game at some point in the future. At EA Play it was revealed that in the fall of 2018, a third season focused on the Clone Wars was going to be released, the season would include a map featuring Geonosis, new Clone Trooper skins, and General Grievous, Obi-Wan Kenobi, Count Dooku, and Anakin Skywalker as playable characters. General Grievous was released on October 30, 2018 with an alternate \"Battle Damaged\" appearance. Obi-Wan Kenobi together with the 212th Battalion skins and a \"Shattered\" General Grievous skin followed up on November 28 alongside the Geonosis Galactic Assault map. In December, a new appearance of Obi-Wan Kenobi titled “General Kenobi” was released, based on his Star Wars: The Clone Wars armor (prior to the mid-third season)."}, {"tag": "p", "text": "Count Dooku was released on January 23, 2019, followed by an alternate \"Dark Ritual\" appearance less than a week later. Anakin Skywalker, along with the 501st and Coruscant Guard skins, and a general update for all Clone trooper skins, including armored clone officers, were released on February 27, 2019."}, {"tag": "p", "text": "Also initially scheduled for February but then pushed back to March 26, 2019 was Capital Supremacy: a new, large-scale game mode, featuring both capture points and capital ship takedowns, as well as two new Clone Wars Era Reinforcements and lightsaber combat improvements, which included no more stagger to a hero whose attack is blocked, plus the requirement of stamina to attack. It also featured a new appearance for Count Dooku: His sleepwear from the third season of The Clone Wars.[source?] On March 12, 2019, two new reinforcement classes were announced: Dual DC-17 pistol-wielding ARC Troopers and BX-series droid commandos, also released on March 26."}, {"tag": "p", "text": "On April 2, 2019, three new locations were announced as being in development for Capital Supremacy. The first location, Kashyyyk, was released on April 24, and May and June release date for the next two. On May 10, 2019, the second location was revealed to be Kamino, and released on May 22. The third, Naboo, was revealed on June 7, 2019 - the first day of E3 2019 - and slated for a June 26 release, along with the unveiling of a large amount of upcoming content for the next few months. Among them were droidekas, Anakin Skywalker's Jedi General appearance from the early seasons of The Clone Wars, the TX-130 Saber-class fighter tank, additional clone trooper skins, and another Capital Supremacy location, released on September 25, 2019: Felucia. A new type of enforcer was also released that same day: the Clone commando."}, {"tag": "h3", "text": "The Rise of Skywalker content"}, {"tag": "p", "text": "On December 4th 2019, DICE detailed the content coming December 17th, to tie into the release of The Rise of Skywalker. These included new appearances for Finn, Rey, and Kylo Ren, and a new planet, being the jungle world of Ajan Kloss based on the new movie. Four reinforcements were also added, the Sith trooper and a revamped Jet Trooper for the First Order, and two new ones for the Resistance, an Ovissian Gunner and a Caphex Spy. In January 2020, more content was released, with capital supremacy including the sequel era, as well as two new playable heroes, BB-8 and BB-9E."}, {"tag": "h3", "text": "Original trilogy content"}, {"tag": "p", "text": "Following the release of content from The Rise of Skywalker, a new focus on content from the original trilogy was announced. The first update including this content was released in February 2020, which included a new appearance for Imperial Jet Troopers, as well as playable Ewok and Imperial Security Bureau agent reinforcements. New weapons were also added. Additionally, further content set for release in March 2020 was announced, which included the addition of the original trilogy content to other modes such as Supremacy, as well as the addition of Scarif. Capital Supremacy has been renamed \"Supremacy\" due to the lack of capital ships in the original trilogy settings of the game mode."}, {"tag": "h2", "text": "References to other Star Wars media"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}