{"url": "Star_Wars_Art:_Visions", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars Art"], "nodes": [{"tag": "h1", "text": "Star Wars Art: Visions"}, {"tag": "p", "text": "Star Wars Art: Visions is a book of artwork from Abrams Books released on November 1, 2010. It contains 120 full-color and black-and white paintings inspired by the Star Wars saga from more than 100 renowned artists and features a foreword by George Lucas as well as an introduction by Jonathan W. Rinzler. Because of the large number of images, there is also a bigger, more expensive, limited special edition of the book released on October 1 with more than 40 additional illustrations as well as \"behind the scenes\" pictures, processes and sketches of the contributors and five hand-signed, archival-quality 10 × 12\" giclé prints."}, {"tag": "p", "text": "J.W. Rinzler started producing the book in 2005 and continued working on it from time to time. The teaser poster of the book was first spotted at Comic-Con International 2009, with a new painting from the book being released monthly at StarWars.com since October 2009 for the following six months. After an official announcement of the book in March 2010, StarWars.com continued revealing sneak previews and lists of contributors from the book over the next six months until its publication. To promote the book, three images by Donato Giancola, Gene Colan and Ed Binkley were published in a tie-in with the Topps trading cards. After an initial date of October 28, the publishing date was pushed back from October 1 to November 1 2010 in April."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Limited Edition"}, {"tag": "p", "text": "When Star Wars debuted in 1977, it revolutionized the visual landscape of mainstream American filmmaking, transporting fans to new galaxies and introducing them to countless now-classic characters, costumes, aliens, planets, and starships. By 2005, with the last film in theaters, the Star Wars Saga had become a phenomenon impacting cultures across the globe."}, {"tag": "p", "text": "From the beginning, the Star Wars aesthetic was influenced by comic book artists from the 1930s to the 1970s; famed illustrators Chesley Bonestell, John Berkey, Frank Frazetta, and others; as well as classical artists. Just as George Lucas drew upon the work of N. C. Wyeth and Norman Rockwell for his own visual inspiration, he has now invited more than 100 of the most well-known and promising working artists-across several disciplines, genres, and countries-to draw upon the entire Star Wars galaxy for inspiration."}, {"tag": "p", "text": "Star Wars: Visions collects these magnificent artworks for the first time. Featuring pieces by renowned artists such as Amano, Allan R. Banks, Harley Brown, Gary Carter, James Christensen, Michael Coleman, Kinuko Craft, Jim Dietz, Phillipe Druillet, Donato Giancola, Ann Hanson, H. R. Giger, Daniel Greene, Ron Kleeman, Arantza Martinez, Syd Mead, Moebius, Paul Oxborough, Alex Ross, Anthony J. Ryder, Carl Samson, Dolfi Stoki, William Stout, Dan Thompson, Julie Bell and Boris Vallejo, Scott Waddell, Yuqi Wang, and Jamie Wyeth, Star Wars: Visions is a breakthrough tribute to the worldwide inspiration that Star Wars has fostered for over three decades."}, {"tag": "p", "text": "Star Wars Visions: Limited Edition features more than fifty paintings and illustrations not seen in the trade edition, as well as \"behind-the-scenes\" shots of artists' working processes, preporatory sketches, and more. Presented in a delux format, with a real-cloth cover and clamshell case, the Limited Edition also comes with five 10 × 12\" high-quality archival giclee prints, signed by artists Jamie Wyeth, Alex Ross, Moebius, Donato Giancola, and Daniel Greene."}, {"tag": "h3", "text": "Regular Edition"}, {"tag": "p", "text": "Star Wars Visions collects a wealth of art - hand-picked by George Lucas - produced by a variety of artists, illustrators, designers and cartoonists, working across all genres and styles to celebrate their favourite characters, themes, worlds and moments from the Star Wars Universe."}, {"tag": "h2", "text": "List of artworks"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In 2013, the picture Young Leia by Anthony J. Waichulis, which mentions the princess' dreams of being \"surrounded by oceans of sand,\" was referenced in the fifth issue of the Official Star Wars Fact File remake series, thus elevating this particular image to unambiguous inclusion in the Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}