{"url": "Battle_Scars", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Incomplete lists", "Category:The Bad Batch episodes"], "nodes": [{"tag": "h1", "text": "Battle Scars"}, {"tag": "p", "text": "\"Battle Scars\" is the seventh episode of the animated web-TV series Star Wars: The Bad Batch. The episode was released on June 11, 2021."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "As they traverse a decommissioned medical facility, the Batch encounter an unexpected threat."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The lizard heist"}, {"tag": "p", "text": "In space, the Havoc Marauder is pursued by three gunships. As Hunter mans the rear gun, he asks how long it will take before they can jump into hyperspace. Tech says that depends on how long it takes Echo to get the hyperdrive online, which the cyborg snaps he is working on. Omega, strapped in next to a cage which is also somewhat secured, says she thinks that Ruby is getting scared, prompting Wrecker to express surprise that she named the lizard."}, {"tag": "p", "text": "As the pursuit continues, Wrecker asks what is with their pursuers. When Omega points out that they did steal from them, Tech responds that the Rhokai stole the lizard first and that they are merely \"intercepting\" it. Hunter counters that the Rhokai don't see it that way. The lizard's cage falls and the frightened lizard flees, jumping onto Wrecker. As the large clone panics, Omega tells him to stay calm as he is scaring Ruby. Echo says that the hyperdrive is online just as Omega manages to secure Ruby in her cage. Tech pulls the ship's lever, taking the Havoc Marauder into hyperspace."}, {"tag": "h3", "text": "Money troubles"}, {"tag": "p", "text": "Back on Ord Mantell, the Bad Batch and Omega show Ruby to Cid, who remarks that the lizard is strange-looking. When Echo asks what her client wants the lizard for, Cid speculates that it could be a pet or maybe he wants to turn it into stew, but she doesn't know and doesn't care. Hunter remarks as long as she gets paid, and Cid agrees that he's catching on, adding that they also get paid. Cid leads them to the back, and Echo and Tech follow her with the lizard in the cage."}, {"tag": "p", "text": "Hunter notices a few patrons in Cid's Parlor, including someone in a hooded cloak. Omega and Wrecker seek Hunter's permission to go on leave, since it's a tradition that makes the kid happy. Hunter reluctantly agrees, but warns them not to stay away for too long. The cloaked patron stares at Omega and Wrecker while taking a drink. In Cid's office, the Trandoshan gives them a third of the credits they were promised. When Hunter and Echo protest, Cid replies that she was promised three times the rate, not them. Echo asks how this is a mutually beneficial arrangement, but Cid says that she is generous due to the debt they owe her."}, {"tag": "p", "text": "When Hunter asks what she is talking about, she presents him with a datapad for docking fees, port charges, gear, fuel, rations, and 20 cartons of Mantell Mix. In the market, Wrecker and Omega buy two cartons of Mantell Mix from a Pantoran hawker. When the hawker tells them that they owe 14 credits, Wrecker has the cost put onto Cid's tab."}, {"tag": "p", "text": "Back at Cid's cantina, Bolo and Ketch approach the hooded stranger, Bolo angrily claiming that the man is in his seat. The cloaked figure sips his drink. The Weequay remarks he is ignoring them, and the Ithorian reiterates his demand for the stranger to get up."}, {"tag": "p", "text": "Meanwhile, Cid tells Hunter, Echo and Tech that she likes them but that she is not running a charity. She tells them that they need a big score in order to get even. When Echo asks for clarification, Cid says that the tactical droid would have made a lot of money but they bungled it up. Cid warns them to figure something out before they see her ugly side, and Tech makes a quip about her appearance. Before Cid can respond, they hear blaster fire inside the bar."}, {"tag": "h3", "text": "An old friend"}, {"tag": "p", "text": "Returning outside, the clones see Bolo and Ketch fleeing upstairs. The hooded stranger rests his weapon on a table. When Cid asks who he is, the stranger reveals himself as the former Clone Captain Rex. Cid grumbles about having to host another clone and warns the Bad Batch that she is done taking in strays, adding that this isn't a clone clubhouse. Leaving, Cid grumbles that the clones think they own the place."}, {"tag": "p", "text": "As Hunter approaches Rex, Echo asks where the Captain has been. Rex replies that it's a long story. Later, Rex explains that he has been keeping a low profile since the Clone Wars ended. Tech agrees, saying that Imperial files have listed Rex as being killed in action. Rex replies that being dead in the Galactic Empire's eyes has its advantages. When Echo asks how he tracked them down, Rex tells them that Trace and Rafa Martez told him that a squad of rogue clones helped them on Corellia. Adding that the sisters told him they were traveling with a kid, Rex asks who she is."}, {"tag": "p", "text": "Hunter explains that the kid is named Omega and that she is a clone like them. Just then, Wrecker and Omega arrive. Wrecker recognizes Rex and gives him a bear hug, leading Rex to say that it's nice to see him as well in a somewhat strained voice. Omega is surprised at how happy Wrecker is, saying that she thought they didn't like the regs, and Wrecker tells her they like this one before putting Rex down. Hunter introduces Rex to Omega. Rex kneels to talk to Omega, telling her that he has met many clones in his time but never one like her. Omega steps forward and deduces that Rex is a Generation One clone trooper based on the lines on his face. Amused, Rex quips that he has been around."}, {"tag": "p", "text": "Wrecker agrees before grimacing and touching his head, telling Tech he needs another med patch. When Tech reminds Wrecker that he used the last one, Rex asks what is wrong. Wrecker claims it is just a headache. When Echo observes that Wrecker's headaches are becoming more frequent, Rex takes an interest. Tech tells Rex that their deviant nature appears to have impeded the functionality of their inhibitor chips, with the exception of Crosshair. Alarmed, Rex asks if they haven't removed their chips."}, {"tag": "p", "text": "When Tech confirms this is the case, Rex slowly reaches for his blaster pistol. He says that the chips make them a threat to everyone, including Omega. When Rex describes them as ticking time bombs, Hunter tells him to take it easy. Rex warns them that the inhibitor chips are dangerous, having experienced Order 66. Rex is unwilling to bury any more of his brothers, saying that the chips are something they cannot control, as he couldn't. He says that this is a risk they don't want to take. Omega looks to Hunter, who frowns. Hunter asks how they should take out their biochips. Letting go of his pistol, Rex says that is a good question and that he will be in touch."}, {"tag": "h3", "text": "Rendezvous on Bracca"}, {"tag": "p", "text": "Later, the Havoc Marauder travels through hyperspace. While Wrecker clutches his head in pain, Omega helps Tech with some tools as he works on his chip scanner, Gonky serving as a makeshift table. Wrecker is uneasy about the plan, but Hunter reminds him that they have agreed to meet Rex on Bracca. Wrecker says that Rex wants to cut open his head, and Tech replies that all of them are going for the surgery. Omega corrects him that she isn't since she does not have an inhibitor chip."}, {"tag": "p", "text": "Wrecker grumbles that it's not fair that Omega doesn't have a chip. When Hunter asks Tech about progress on his brain scanner, Tech says that since Rex's chip was removed, he was able to establish a baseline by comparing his brain scan to theirs; taking into account any cellular anomalies. Omega says he means that he is almost finished. Wrecker is unsure about doing this, but Hunter says that they should trust Rex."}, {"tag": "p", "text": "The Havoc Marauder descends into the planet Bracca's biosphere, flying over a starship graveyard. Echo picks up Rex's beacon. The ship lands amidst wrecked starships in a damaged hangar, next to a Y-wing. Rex is waiting for them, and greets the Batch when they arrive. When Wrecker asks how a junk planet is going to help them, Rex tells the clones to follow him. The squad dons their helmets and follows Rex up the ridge of a wrecked capital ship. Rex says that Bracca may not have much to look at, but the junk world has exactly what they need."}, {"tag": "p", "text": "Pointing to a wrecked Venator-class Star Destroyer lying in the distance, Rex says that he had his inhibitor chip removed on a Jedi Cruiser like that one. When Wrecker asks why they landed far away from the ship, Hunter spots something and warns everyone to take cover. As a hover barge flies by, Tech looks at it and identifies it as belonging to the Scrapper Guild. Rex explains they control the planet, and that is why they landed where they did, noting the importance of avoiding their patrols. The clones head deeper into the wreckage."}, {"tag": "h3", "text": "Through the wreckage"}, {"tag": "p", "text": "Rex tells Echo that Fives tried to warn him about the chips, but that he did not understand at the time. Echo says that it is still hard to believe. Rex asks the Bad Batch how they found out about the chips. To Rex's surprise, Echo replies that Omega told them. The clones clamber up a partially submerged wrecked ship. Omega gazes at the wreckage of the Venator, amazed at how big it is up close. Rex notes that the ship was part of the first batch of its class off the assembly line, something that Wrecker quips also applies to Rex. Passing by a low-lying area filled with water, Hunter observes the swamp and senses movement, warning Tech to stay above the waterline."}, {"tag": "p", "text": "Large avian creatures glide over them as the clones navigate up the wreckage, and they enter with Rex leading the way across an improvised bridge. Traversing the ship's corridors, Rex says that the last time he was aboard a Jedi Cruiser, it did not end so well. Echo asks Rex how he got his chip out since he said he couldn't control it, to which Rex replies that he had help."}, {"tag": "p", "text": "The clones encounter a large gap in the wreckage, leading all the way down to the water below. Rex tells the others that the medical bay is on the far side, and then tells Wrecker to grab a large cable nearby when asked how they are going to get across. The clones cross the gap by crawling along the cable, but Wrecker, the last to go, is nervous due to his fear of heights, claiming that the others should leave him as his head doesn't hurt anymore. Omega encourages him not to look down. Wrecker finally begins to cross, but his weight causes the cable to sag and eventually snap, leaving Wrecker to fall before finding himself dangling by one leg just above the water."}, {"tag": "p", "text": "As the others ask if he is alright, Omega spots a dark shape in the water below and Hunter orders Wrecker to start climbing immediately. The tentacle of a dianoga erupts from the water and grabs Wrecker, who cuts it off with his vibro-knife as the others try to pull him up. However, more tentacles emerge from the water and seize Wrecker, dragging him underwater. After a moment of silence, Wrecker manages to surface and grab the cable, but the creature is unwilling to let him go. As Rex, Hunter and Tech pull Wrecker up, Echo fires on the creature, forcing it to let Wrecker go. After Wrecker has been pulled to safety, Rex quips that it makes them miss fighting clankers, and Wrecker agrees."}, {"tag": "h3", "text": "The medbay"}, {"tag": "p", "text": "The clones travel down a dark corridor and approach a chamber sealed by a partially opened blast door. Rex kneels down to look into the room, and several rodents scatter as they lift the door. Rex and Tech shine their torches around the derelict medical bay. Tech notes that the room is no longer a sterile environment, but after Rex asks him if he would prefer the facilities on Kamino, Tech admits this will have to do."}, {"tag": "p", "text": "Echo begins calibrating the surgical pod with his mechanical arm while Tech prepares the equipment. As Omega watches with concern, Tech fits his chip scanner over Wrecker's head. Hunter puts the squad's backpacks and helmets, including Wrecker's, at the side of the room. Omega tells Hunter that she's worried about how safe the surgery is, since just because it worked on Rex doesn't mean it will work on the others. Rex counters that it is more dangerous to leave the chips in, and Hunter agrees, telling Omega that they have to do it regardless of the risk."}, {"tag": "p", "text": "Omega fears being orphaned if the procedure goes wrong, but Hunter reassures her that she's stuck with them and they aren't going anywhere. Tech finds Wrecker's inhibitor chip 90 degrees from his right orbital floor, below the parietal and temporal intersection. Just then, Wrecker pulls the scanner off and growls to Tech to get the device away from him. Omega calms him down, sensing something is not right. Rex quietly comments that they need to speed things up, and Echo works on the controls. As the operating machine boots up, Rex tells the Bad Batch that they got lucky since very few clones were immune to the effects of Order 66."}, {"tag": "p", "text": "Hunter says when the regular clone troopers attacked the Jedi on Kaller, they did not understand why. Wrecker continues groaning in pain. Hunter says they couldn't save the Jedi General, but they helped her Padawan escape. Tech is about to inject Wrecker when the bigger clone grabs his wrist and has a sudden change in demeanor. Wrecker then begins choking Tech and states that he is in direct violation of Order 66. He lifts Tech and hurls him across the room."}, {"tag": "h3", "text": "Danger from Wrecker"}, {"tag": "p", "text": "Wrecker dons his helmet and retrieves his blaster rifle. He faces Rex, who reaches for one of his blaster pistols. Wrecker knocks the gun from Rex's hand as he fires a stun blast, sending it into a light. Hunter grabs Omega and shelters her as the clones take cover as Wrecker begins firing at them. Echo expresses concern that he will destroy the medical equipment if he stays in the room. Hunter decides they should draw him out, telling Omega to stay with the unconscious Tech. He throws a canister at Wrecker, which he destroys with his blaster, filling the room with smoke that allows the clones to retreat from the room."}, {"tag": "p", "text": "Wrecker follows them into the corridor, exchanging fire with Rex. Hunter throws his vibroblade at Wrecker, causing him to drop his blaster. Echo faces Wrecker with a canister as an improvised shield, but the bigger clone hurls him at Rex, which knocks both of them out. Hunter fights Wrecker with another canister and manages to knock off his helmet before Wrecker stabs it with his knife, causing him to drop it as it spews its contents. Jumping on Wrecker's back, Hunter attempts to render him unconscious while yelling at him to snap out of it, but the larger clone pins him against a wall. He proceeds to choke Hunter, saying that all clones in violation of Order 66 should be terminated."}, {"tag": "p", "text": "Omega shoots at Wrecker from behind with his blaster, causing Wrecker to drop Hunter. Wrecker confronts Omega, and she flees down the corridor but reaches a blast door. As Wrecker approaches, she manages to slide under the door. Before she can find another exit, Wrecker enters the room. Omega takes cover under a sheet of scrap metal. Wrecker searches the room for Omega, but a frightened rat flees the first spot he checks. Wrecker soon finds Omega and faces her. Omega tries to reason with Wrecker, telling him it is the inhibitor chip and not his will. Wrecker denounces her as a traitor and says she should be terminated. Omega pleads with him to stop, begging him that she does not want to hurt him. Before she can shoot him, he grabs the rifle. Wrecker says that \"good soldiers follow orders\" before raising his blaster. However, a slightly injured Rex stuns him from behind."}, {"tag": "h3", "text": "The surgical operation"}, {"tag": "p", "text": "Later, the clones surround the surgical pod as Wrecker lays inside. As the machine operates on Wrecker, Echo asks if the procedure is supposed to take this long. Rex says he doesn't know since he has never been on the operating side before. Omega looks distraught while Hunter watches vigilantly. Tech says the procedure is complete and brings Wrecker out."}, {"tag": "p", "text": "Omega tries to wake Wrecker, but he doesn't respond. Tech says that Wrecker is unconscious and his vitals have not yet stabilized. Rex speaks to Hunter, telling him it could take a while for Wrecker to regain consciousness and suggesting that he take Omega topside for some air. However, Omega insists on staying with Wrecker until he wakes up, pulling up a chair to sit next to him."}, {"tag": "p", "text": "Later, Rex stands alone in the door of the medical bay, gazing pensively at his helmet, while the others are gathered around Wrecker, some of them having fallen asleep. Wrecker wakes up and tousles Omega's hair, asking why the long face. Omega is delighted and the Bad Batch welcome their comrade back. Holding up Tech's scanner, Rex says one chip down and three to go before asking who is next."}, {"tag": "p", "text": "Later, Tech emerges from the operating tunnel, touching his bandaged head. A guilt-ridden Wrecker lays a reassuring hand on Omega. He apologizes for what happened, saying that he tried to control it but that he couldn't make it stop. Omega understands and says it is okay. She treats him to some Mantell Mix for ending the mission, because it's a tradition, and the two eat."}, {"tag": "h3", "text": "Farewell"}, {"tag": "p", "text": "Meanwhile, outside the Star Destroyer, Rex talks to someone on his wrist comm, saying that he will meet them at the rendezvous by the next rotation. Hunter approaches, having figured that Rex is not yet out of the fight. Rex says he spent his life defending the Galactic Republic, so he's not going to stop now. Hunter points out that the Republic is gone, but Rex counters that not all of it is, saying they are both still here, and others are out there too. He believes that the Bad Batch's skills will be a tremendous asset."}, {"tag": "p", "text": "Hunter says things have changed, adding that Omega needs them and that he has to do what is best for the squad. Rex asks what that is, and Hunter says he is still figuring that out. Rex tells them to let him know when they have sorted their lives out. He tells the boys he will see them around and to stay out of trouble. The two troopers bid each other farewell. Hunter tells Rex that if he is ever in a bind, he knows how to reach them. After exchanging a nod, Rex disappears into the nighttime fog."}, {"tag": "p", "text": "Unknown to the clones, they are being watched by a Scrapper Guild patrol through a pair of macrobinoculars. One scrapper tells his comrade that there are intruders present aboard the cruiser, and orders that the Empire be notified."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "While sitting at the bar, Rex's wrist comm is on his left wrist instead of his right, a mistake which is not corrected until Wrecker and Omega return to the bar. When the group has to take cover from a Scrapper Guild patrol, Rex's kama is missing in the shot of the group looking up from below. Echo has a bandage on his temple when activating the surgical pod and when working at the controls after Wrecker's headache intensifies, even though he has not yet had his inhibitor chip removed. Wrecker does not wear his backpack during his rampage, but is seen with it in one shot while he chases Omega."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "\"Battle Scars\", which is primarily set on Bracca, was released on June 11, 2021. That same day marked the PlayStation 5, Xbox Series S, and Xbox Series X release of the video game Star Wars Jedi: Fallen Order, for which Bracca was designed."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}