{"url": "Battle_aboard_the_Empirical", "categories": ["Category:Legends articles", "Category:Battles of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "Battle aboard the Empirical"}, {"tag": "p", "text": "Two years before the Battle of Yavin, a battle occurred on the Empirical in the Dominus system. The Empirical, a modified cruiser that belonged to the Sith Lord Darth Vader, was a mobile research vessel that conducted highly classified experiments on prisoners and unique alien species. In addition to a bridge crew of Imperial officers, the Empirical's security personnel was composed of a platoon of Imperial soldiers handpicked by Vader."}, {"tag": "p", "text": "Six months before the battle took place, Darth Vader discreetly transferred the damaged body of his unconscious apprentice, Starkiller, to the Empirical. Known only as \"Subject 1138,\" the crew assumed that Starkiller was just another one of the Dark Lord's experiments. As a result of Vader's machinations, the entire crew was caught by surprise when Starkiller broke out of the medical bay in an escape attempt. As the ship's military personnel unsuccessfully attempted to kill the apprentice, the holodroid PROXY maneuvered the Empirical on a direct course for the Dominus system's star, in accordance with Vader's order to protect the secrecy of Starkiller's existence. Together with PROXY and former Captain Juno Eclipse, Starkiller escaped on the Rogue Shadow just before the Empirical was destroyed by the star."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Starkiller assassinated Shaak Ti, a fugitive Jedi Master who had been hiding in exile on the planet Felucia, he was ordered to return to the Executor by the Sith Lord Darth Vader. By eliminating one of the last surviving members of the Jedi High Council, Starkiller's achievement was acknowledged by Vader, who assured his secret apprentice that the time had come to overthrow Darth Sidious, better known in public as the Emperor Palpatine. Though he contained his enthusiasm in front of his master, Starkiller was elated by the thought of finally becoming a true Sith. Aside from his service to Vader, the Emperor's downfall was a goal that Starkiller had been trained for over a number of years."}, {"tag": "p", "text": "Before returning to the Executor, Captain Juno Eclipse inquired about the future of her assignment as the eighth pilot of Starkiller's experimental stealth starship, the Rogue Shadow. Due to Starkiller's budding rapport with female officer, he promised to support her military career. He also envisioned his future as an official Sith Lord while Vader succeeded Sidious as emperor of the galaxy. Unknown to Starkiller, however, Eclipse inadvertently discovered Vader's scheme to assassinate the Emperor. Torn between her loyalty to her sovereign and commanding officer, she reluctantly remained silent on the issue."}, {"tag": "p", "text": "Upon his return to the Executor, Starkiller rendezvoused with Darth Vader on the bridge of the incomplete Super Star Destroyer. Beyond the viewport, both master and apprentice watched as the Emperor's fleet of Imperial Star Destroyers converged on the Executor's position. Starkiller assumed that Vader had manipulated Palpatine into a trap, but his assumption was proved incorrect when Vader stabbed Starkiller through the abdomen with his lightsaber; the Emperor's spies, Vader claimed, had followed the apprentice all the way to the Executor. When Starkiller collapsed on the floor in utter shock and pain, Lord Sidious \"entered\" the chamber, communicating through the holodroid PROXY. After angrily accusing Vader of treason, specifically for training Starkiller in the first place, Sidious ordered him to kill the wounded apprentice. Faced with the threat of his own destruction, Vader complied and proceeded to telekinetically thrash his apprentice across the chamber. Afterward, he hurled Starkiller through the viewport and into the vacuum of space, much to Sidious' sadistic delight."}, {"tag": "p", "text": "While Starkiller was unconscious, his body was collected from the vacuum by Darth Vader's droids and brought to the Dark Lord's science vessel, the Empirical. Other than his designation as \"Subject 1138,\" the crew of the Empirical knew nothing else about Starkiller, and thus they simply regarded him as another one of Vader's secret experiments. For six months, Starkiller remained in a comatose state while his body was steadily repaired. During the process, Starkiller believed himself to be dead as he experienced a multitude of visions and memories. When he finally awoke, he was relieved for the end of the visions, but also became enraged when he saw Darth Vader. While Starkiller was restrained on the operating table, Vader revealed that the \"execution\" had been staged. According to Vader, Starkiller's life had been saved so that they could execute a new plan aimed at Sidious' destruction. When Starkiller contemplated defiance, Vader threatened to kill him by activating the self-destruct sequence on the Empirical. However, Vader also pointed out that Starkiller had a second chance to fulfill his destiny by eventually becoming a true Sith Lord, as well as an opportunity for vengeance against Sidious. After considering his master's offer for a moment, Starkiller grudgingly agreed, and thus he was freed from his restraints."}, {"tag": "h2", "text": "Escape from the Empirical"}, {"tag": "p", "text": "Darth Vader elaborated that with Palpatine's spies watching his every move, he needed a distraction to divert attention away from him. While the laboratory droids provided him with a new lightsaber, Starkiller suggested an assassination, though Vader dismissed it, as no single act of that kind would gain Palpatine's notice. Instead, Vader tasked Starkiller with a mission to create a rebellion that would challenge the Emperor's reign over the galaxy; an alliance of rebels and dissidents. Vader gave Starkiller free rein in how to pursue his objective. However, Starkiller was also ordered to sever all ties to his past, with the exception of PROXY, in order to ensure that no one discovered his continued service to Vader. With a final assurance that the dark side of the Force was always with Starkiller, Vader ended his transmission, and thus revealed that he had been communicating through PROXY."}, {"tag": "p", "text": "PROXY was overjoyed by his master's survival, as it meant that he could still still have an opportunity to terminate Starkiller, which would then complete his primary programming. But due to Vader's orders, PROXY was focused on ensuring Starkiller's escape from their present location. Through PROXY, Starkiller learned that he was on board the Empirical in the Dominus system. PROXY then hacked into the ship's navigation system and placed it on a collision course with the Dominus star in accordance with Vader's wish that all witnesses were to be destroyed. In order to ensure that all Imperials aboard the Empirical died, PROXY also jettisoned all of the escape pods as well."}, {"tag": "p", "text": "When Starkiller inquired about Juno Eclipse, PROXY informed him that she was alive and onboard the Empirical. Her association with Starkiller effectively destroyed her career and she was declared a traitor to the Empire. As they encountered Imperial stormtroopers stationed aboard the doomed vessel, Starkiller activated his new lightsaber and realized that it was actually the former weapon of Jedi General Rahm Kota. Despite PROXY's cautious reminder that Starkiller was ordered by Vader to sever all connections to his past, the apprentice chose to make a beeline to the prison cell in order to retrieve Eclipse before the Empirical was destroyed."}, {"tag": "p", "text": "As Eclipse regained consciousness, she was surprised to see that Starkiller was still alive, despite the fact that she had been told of his \"death\" aboard the Executor. Although Starkiller disobeyed Vader by saving Eclipse's life, he chose to hide from her the fact that he still served the Dark Lord. After declaring his allegiance to the Empire at an end, the apprentice brought Eclipse with him, and explained his actions with the excuse of how he still required her as a pilot. Explosive bolts severed the umbilical that connected the Rogue Shadow to the Empirical just as they boarded, and Starkiller ordered PROXY to fly the ship away from the science vessel as it collided into the Dominus star. Eclipse took control of the ship almost immediately after, having regained most of her senses by then."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once they had escaped, Juno Eclipse confided in Starkiller her uncertainty about the future. Since her former life with the Empire was over, she was unsure of what to do with herself. Starkiller then revealed his plan to build an army in order to launch a full-scale rebellion against the Empire, though he purposely neglected to mention any detail about Darth Vader's involvement in the plot. With no other purpose left to follow, Eclipse agreed to aid his cause."}, {"tag": "p", "text": "Before Starkiller could begin his rebellion, however, he realized that he first needed to establish contact with the Empire's enemies. He then thought of Rahm Kota, the Jedi whom he suspected had survived their previous duel in the TIE Fighter Construction Facility above Nar Shaddaa. Their search for the general eventually led them to Cloud City on Bespin where Starkiller was forced to defend Kota—drunk and depressed—from Imperial soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This conflict does not appear as a playable level in the Playstation 2, PSP or Nintendo Wii versions of the game, although the event itself did happen those versions via cutscenes relating to Vader's rebuilding Starkiller and his new mission plans, and saving Juno Eclipse from the doomed ship."}, {"tag": "p", "text": "In the Xbox 360/PS3 version, Starkiller is referred to as Subject 1138."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}