{"url": "Star_Wars_Comic_UK", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Star Wars Comic UK"], "nodes": [{"tag": "h1", "text": "Star Wars Comic UK"}, {"tag": "p", "text": "Star Wars Comic UK was a magazine published monthly by Titan Magazines. It contained mostly reprints of comics published by Dark Horse, until volume 6 and 7. It was titled Star Wars: The Clone Wars since the beginning of volume 5 on December 2009 because of the release and success of the Star Wars: The Clone Wars television series. It changed its title for the last time, to Star Wars Comic, at the beginning of volume 7 in January 2014 when its stories mostly focused on the characters from the original trilogy (it existed in alternation with Clone Wars stories until issue 8). The magazine ended in December 2014 when the publishers lost their license to publish Star Wars material in the UK."}, {"tag": "p", "text": "A new Star Wars UK magazine titled Star Wars Rebels Magazine has been published by Egmont UK Ltd since January 2015."}, {"tag": "h2", "text": "Issues"}, {"tag": "h3", "text": "Volume 4"}, {"tag": "p", "text": "Volume 4 reprinted various comic stories."}, {"tag": "h3", "text": "Volume 5"}, {"tag": "p", "text": "Volume 5 reprinted various comic stories."}, {"tag": "h3", "text": "Volume 6"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Volume 6 of the Star Wars: The Clone Wars Magazine saw the introduction of original comic stories. These stories have not been published anywhere outside of the UK and US releases of the Star Wars: The Clone Wars magazine."}, {"tag": "h3", "text": "Volume 7"}, {"tag": "p", "text": "With the conclusion of The Clone Wars: The Lost Missions, the \"Star Wars: The Clone Wars\" magazine was relabeled \"Star Wars Comic\" magazine. These issues continued to feature exclusive comic stories, this time moving away from the Clone Wars era. None of the stories featured in Star Wars Comic Magazine have been published elsewhere."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "p", "text": ""}]}