{"url": "Star_Wars_Episode_III:_Revenge_of_the_Sith_(video_game)", "categories": ["Category:Real-world articles", "Category:2005 computer and video games", "Category:Legends console video games", "Category:LucasArts games"], "nodes": [{"tag": "h1", "text": "Star Wars Episode III: Revenge of the Sith (video game)"}, {"tag": "p", "text": "Star Wars Episode III: Revenge of the Sith was a 2005 video game based on the movie of the same name. It centers around Obi-Wan Kenobi and Anakin Skywalker as the Clone Wars come to an end. There are seventeen levels, interlaced with over twelve minutes of footage from the movie. It was released on May 5, 2005, for the PlayStation 2, Xbox, Game Boy Advance and Nintendo DS. Additionally, a version was made available for mobile phones on April 2, and a version for the PlayStation Portable was cancelled and never released. On April 28, 2015, the game was released for download on PlayStation Network, and made available to play on PlayStation 3. Also, unlike other Star Wars video games, there was also going to be a Nintendo GameCube release, but that one was cancelled for unknown reasons as well."}, {"tag": "h2", "text": "Storyline"}, {"tag": "p", "text": "The game follows the movie storyline very closely, incorporating footage from the movie into the game and blending it well with the game portion itself. It involves playing through the events as either Anakin Skywalker and Obi-Wan Kenobi, with radically different events taking place in either. As Obi-Wan, much of the game is centered around destroying General Grievous, while the Anakin levels chronicle his fall to the dark side of the Force and extermination of the Jedi Order. This includes Anakin's attack on the Jedi Temple, which culminates in a duel with Serra Keto, who happens to be the best student of Cin Drallig, who Darth Vader later fights and kills along with Keto. The game ends with the duel on Mustafar between Darth Vader and Obi-Wan. There are two different endings to the final battle, the first being that Obi-Wan defeats Anakin like in the film, the second being that Anakin kills Obi-Wan then meets the Emperor who gives him a new red lightsaber, Anakin in turn kills the Emperor and claims the new Empire for his own. The Game Boy Advance and Nintendo DS versions of Episode III are much the same to the console versions, except as a side-scrolling action game. The other difference is that while the PS2 and Xbox versions feature a singular campaign, with player controlling Obi-Wan or Anakin depending on their scenes in the film, the GBA and NDS versions feature two separate campaigns for each one. The DS version also features uses for its touch-screen capability. The game was also released on the mobile phone and followed the storyline of all other versions. It bares resemblance to 1999's Star Wars: Episode I: The Phantom Menace videogame where the overall game is the same as the actual film with a few minor changes in exposition and background information."}, {"tag": "h3", "text": "Gameplay"}, {"tag": "h3", "text": "Console Version"}, {"tag": "p", "text": "The player alternates between playing as Anakin Skywalker and Obi-Wan Kenobi, reliving various scenes from the film through the game's missions. There are 17 levels, interlaced with over 12 minutes of footage from the movie. The game's combat system is heavily concentrated on lightsaber combat. Each of the playable characters (with the exception of the MagnaGuard) is equipped with at least one lightsaber. There are three basic attacks: fast attacks which do the least amount of damage, strong attacks which do more damage but are slower to execute, and the slowest but strongest critical attacks. These attacks can be mixed to create combination attacks. Attacks can also be charged up for greater strength. One feature of the game is called a Saber Lock - a sequence in which the player's character clashes swords with an opponent."}, {"tag": "p", "text": "The game features an experience system, whereby the player's character can upgrade attacks and gain new ones as they progress through the game."}, {"tag": "h3", "text": "Portable Version"}, {"tag": "p", "text": "The handheld versions of the game are played as a 2.5D side-scrolling beat 'em up game, where players can freely choose to play as either Obi-Wan or Anakin, traversing across roughly a dozen levels to battle a variety of enemies and occasionally dodge deadly hazards, such as a laser trap or a missile launcher. Both characters have nearly identical attack moves, and can gain access to special unlockable moves that can be unleashed when a \"fury\" or \"focus\" gauge is filled up during battle."}, {"tag": "h3", "text": "Alternate ending"}, {"tag": "p", "text": "In the PS2 and Xbox versions, after completing \"Friendship in Flames\", one more mission \"Revenge of the Sith\", is unlocked. It gives the player the opportunity to play as Anakin (aka Darth Vader) during the duel on Mustafar, with the objective of defeating Obi-Wan Kenobi. The duel plays out the same until the very end, where Anakin avoids Obi-Wan's blade in his leap behind Obi-Wan to the lava river bank and fatally stabs Obi-Wan with his lightsaber, killing him. He then kicks Obi-Wan's corpse near the lava. Anakin is then greeted by Palpatine as he steps out from his shuttle, who he then tells him, \"Excellent work my apprentice. There are none left to oppose us; the galaxy is ours now.\""}, {"tag": "p", "text": "After being presented with a brand new Sith lightsaber, Anakin activates his lightsaber and stabs Palpatine. The clone troopers raise their weapons and aim at Anakin for killing the emperor, but do not fire. They lower their weapons as Anakin says, \"No... the galaxy belongs to me...!\""}, {"tag": "p", "text": "It is unknown if Sidious killed Yoda in this non-canonical ending, or if Yoda survived the duel. There is also no mention whatsoever in the game of the confrontation between Yoda and Sidious. Palpatine only declares that \"There are none left to oppose us,\" causing confusion as to whether or not Yoda's fate was the same as it was in the film. This alternate ending is named in the game as \"Ultimate Revenge Of The Sith\" as the Sith finally won against the Jedi."}, {"tag": "p", "text": "Also, without Obi-Wan, Padmé would not be taken to Polis Massa and not be able to give birth to Luke and Leia Skywalker, and probably would die before even giving birth, thus Luke and Leia would never be born, leaving the galaxy without any new hope forever."}, {"tag": "p", "text": "Alternatively, although it is not shown, it could be presumed that she would give birth in Vader's care. Whether or not Padmé would die in childbirth, Luke and Leia would be raised in their father's footsteps."}, {"tag": "h2", "text": "Characters"}, {"tag": "h3", "text": "Playable"}, {"tag": "h3", "text": "Non-playable"}, {"tag": "h2", "text": "Levels"}, {"tag": "p", "text": "In addition to the main story levels, there are bonus levels and characters the player can unlock and play as, such as Yoda, General Grievous, an IG-100 MagnaGuard and Darth Vader. Most of these levels consist of the player mainly fighting wave after wave of enemies. An added bonus level is the player taking on the role as Darth Vader during his final encounter with Obi-Wan/Ben Kenobi in the original Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Multiplayer mode"}, {"tag": "p", "text": "The game also features a multiplayer duel mode, in which two players face off against each other. Players can choose Obi-Wan, Anakin, Count Dooku, General Grievous, Mace Windu, Cin Drallig, or Serra Keto. Darth Vader, and \"Ben Kenobi\", from Episode IV can also be unlocked for this mode."}, {"tag": "p", "text": "Each battle can be won with either the best of one, three or five rounds, depending on the options chosen. In addition, all characters have equal health and energy, with all status upgrades acquired by Anakin and Obi-Wan eliminated to balance the fight against the other opponents. However, all of the upgraded techniques and Force Powers are available and each of the other characters has special abilities and maneuvers."}, {"tag": "p", "text": "In addition to the original costumes found throughout the Single Player campaign, each character has a different costume that is used when each player chooses the same character, so that players can tell their characters apart. Some of these costumes depict Sith versions of certain Jedi characters and vice-versa. If one plays Mace Windu fighting Anakin Skywalker on the Death Star, it's sort of implied it's the same as the true film timeline minus Windu and Yoda being the only two living heroes from Revenge of the Sith, Vader never crippled and dying instead at Windu's hand."}, {"tag": "h2", "text": "DS Starfighter"}, {"tag": "p", "text": "In the DS version, there are 3D starfighter battles incorporating the touch screen to manage your shields and view Radar and scores. There are three missions for each Anakin and Obi-Wan in single player, and a multiplayer providing 8 maps and 17 ships:"}, {"tag": "h2", "text": "Music"}, {"tag": "p", "text": "No original music from the film is used, since recording of the soundtrack had not been completed when the game's production ended. This is also the case in LEGO Star Wars: The Video Game. As a result, music from all of the other five movies is used. The cutscenes also use music from the other media. In the levels \"The Final Lesson\" and \"Assassination on Mustafar,\" music from Star Wars: Knights of the Old Republic II: The Sith Lords is also used. This music can also be found in some multiplayer duel levels. Music from Episode III was not added in the 2006 \"Greatest Hits\"/\"Platinum Hits\" release of the game on PS2 and Xbox."}, {"tag": "p", "text": "In the GBA and DS versions, however, music from the film as well as The Phantom Menace and Attack of the Clones was indeed used, although the output slightly varied due to differences in sound output between the two handheld systems. The former utilized a more synthesized track while the latter was generally closer to the music from the film."}, {"tag": "h2", "text": "Differences between the movie and game"}, {"tag": "p", "text": "Most differences are about character deaths. Due to the fact that the game was released prior to the movie, many of the most important character deaths were changed so as to not spoil the movie. For example:"}, {"tag": "h2", "text": "Differences between various games"}, {"tag": "p", "text": "In addition to the above mentioned differences between the movie and the games, there also differences between various versions of the games as well:"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}