{"url": "Star_Wars_Episode_I:_The_Phantom_Menace_(soundtrack)", "categories": ["Category:Real-world articles", "Category:Film soundtracks"], "nodes": [{"tag": "h1", "text": "Star Wars Episode I: The Phantom Menace (soundtrack)"}, {"tag": "p", "text": "The Star Wars Episode I: The Phantom Menace score was composed and conducted by John Williams and performed by the London Symphony Orchestra. It was released in three formats:"}, {"tag": "p", "text": "The original album was released to accompany the film (May 4, 1999). This release is a single CD containing 17 tracks from selections of the score, meant to stand alone as a separate listening experience and not as one hears the score in the film. John Williams edited each track to present the score as one would hear it in a concert suite."}, {"tag": "p", "text": "This album was also available on a two-LP set through specialized retailers such as Star Wars Insider."}, {"tag": "p", "text": "The two-CD Ultimate Edition was released due to popular demand (November 14, 2000). This set presents the score predominantly as heard in the film (with most of the edits, loops, tracked music, and post-production changes in place). Although not exactly what is heard in the film, this set was meant to be listened to as one would hear the score in the film."}, {"tag": "p", "text": "None of the releases contain the entire score (although the back cover of the Ultimate Edition falsely claims that it contains \"every note recorded\"). Currently, no complete release has been made."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Score Information"}, {"tag": "p", "text": "Recorded in Abbey Road studios over a week, starting on February 10, 1999 performed by the London Voices and London Symphony Orchestra, Star Wars: Episode I The Phantom Menace was the first Star Wars score Williams had composed in over 16 years."}, {"tag": "p", "text": "The scores of the following two films would rely heavily upon tracking from this score, a decision that Williams and George Lucas had made early into production of the film."}, {"tag": "p", "text": "No complete score has ever been released, but missing bits and pieces can be heard in various LucasArts video games."}, {"tag": "p", "text": "After the release of the album, the popularity of a more complete bootleg version of the score began to steal profits. Sony released the Ultimate Edition, presenting the score nearly as it is heard in the film while falsely marketing itself as \"every note ever recorded.\""}, {"tag": "p", "text": "A list of all known slate numbers and original cue titles follows:"}, {"tag": "h3", "text": "Differences between the versions"}, {"tag": "p", "text": "In the recording studio, Williams records cues multiple times. The film and album versions of a track can be drastically different. One cue can be made up of several takes, putting together the best moments of each, replacing flubbed notes."}, {"tag": "p", "text": "Since each track is run several times, each performance differs slightly. Occasionally, Williams will change orchestrations on the spot."}, {"tag": "p", "text": "Examples of different takes:"}, {"tag": "p", "text": "Several source cues composed by Williams' son, Joseph. Alternates of cues and alternate recordings of \"Duel of the Fates\" have unknown slate numbers and for the most part are unreleased."}, {"tag": "h2", "text": "Credits"}, {"tag": "h3", "text": "London Symphony Orchestra[4]"}, {"tag": "h4", "text": "1st Violins"}, {"tag": "h4", "text": "2nd Violins"}, {"tag": "h4", "text": "Violas"}, {"tag": "h4", "text": "Cellos"}, {"tag": "h4", "text": "Basses"}, {"tag": "h4", "text": "Flutes"}, {"tag": "h4", "text": "Oboes"}, {"tag": "h4", "text": "Horns"}, {"tag": "h4", "text": "Trombones"}, {"tag": "h4", "text": "Timpani"}, {"tag": "h4", "text": "Percussion"}, {"tag": "h4", "text": "Cretan Lyra, Cümbüs"}, {"tag": "h4", "text": "Bassoons"}, {"tag": "h4", "text": "Clarinets"}, {"tag": "h4", "text": "Trumpets"}, {"tag": "h4", "text": "Tuba"}, {"tag": "h4", "text": "Piano"}, {"tag": "h4", "text": "Harps"}, {"tag": "h4", "text": "Recorders"}, {"tag": "h4", "text": "Synthesizers"}, {"tag": "h4", "text": "Staff"}, {"tag": "p", "text": "* Performed on the original Star Wars soundtrack recording (March 1977)"}, {"tag": "h3", "text": "Additional credits[5]"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}