{"url": "Star_Wars_Episode_I:_Racer", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:1999 computer and video games", "Category:2000 computer and video games", "Category:Legends computer games", "Category:Legends console video games", "Category:LucasArts Archive Series", "Category:Racing games"], "nodes": [{"tag": "h1", "text": "Star Wars Episode I: Racer"}, {"tag": "p", "text": "Star Wars Episode I: Racer is a racing game released by LucasArts for Microsoft Windows, Nintendo 64, Game Boy Color, Macintosh, and Dreamcast platforms."}, {"tag": "p", "text": "It is a racing game that is based on the podracing scene from Star Wars: Episode I The Phantom Menace, putting the player in the cockpit of 23 (25 counting cheat code character replacements in the Nintendo 64 version) different podracers on 25 different tracks on 8 unique worlds. Jake Lloyd, Andrew Secombe, Lewis MacLeod, Greg Proops, and Scott Capurro all reprise their roles from the movie."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Tournament structure"}, {"tag": "p", "text": "Players can enter the tournament with a character, wherein placing first, second, or third earns the player prize winnings (if chosen) and unlocks the champion of the track. Not all tracks feature unlockable racers; however, winning a race also unlocks new tracks. With the prize money, players can buy upgrades for their podracers."}, {"tag": "h3", "text": "Amateur Podracing Circuit"}, {"tag": "h3", "text": "Semipro Podracing Circuit"}, {"tag": "h3", "text": "Galactic Podracing Circuit"}, {"tag": "h3", "text": "Invitational Podracing Circuit"}, {"tag": "h2", "text": "Planets"}, {"tag": "h2", "text": "Starting Racers"}, {"tag": "h2", "text": "Unlockable Racers"}, {"tag": "h2", "text": "Cheat Code Racers"}, {"tag": "h2", "text": "Upgrades"}, {"tag": "h2", "text": "Other versions"}, {"tag": "h3", "text": "PC version"}, {"tag": "p", "text": "The PC version has different cheat codes, as well as additional cut scenes for the racetracks introductions as well as an opening cinematic (scenes of which were re-created with in-game models and tracks in the N64 version). It should be noted that in the PC's opening movie, Gasgano is seen being knocked out of the Boonta Eve Classic by Sebulba, though other sources list Gasgano as having finished the race. The music is vastly superior in the PC version (it plays from the CD and is in WAV format), and the speedometer uses vector graphics instead of raster graphics in the N64 version, for a superior effect. Also, the title screen is different, and the PC version supports multiplayer over IPX, instead of multiplayer on the same platform."}, {"tag": "h3", "text": "Game Boy Color Version"}, {"tag": "p", "text": "The Nintendo Game Boy Color version of the game is notably different from the other versions. Tracks are played out like Drag Races, as in there is one lap. Players race against a track favorite, and winning will grant the player a new character to play as. In addition, at the game's start only Anakin Skywalker is available. All of the racers, except Neva Kee, appear, but only a handful of the planets remain. The planets in this version are Tatooine, Ando Prime, Baroonda, Mon Gazza, and Malastare. However, each planet has four different courses. Upon beating four races on one planet, players may duel Sebulba. If they win, they gain Sebulba's pod. If they lose a future race, they lose Sebulba's pod until they unlock it again."}, {"tag": "h4", "text": "Gameboy Color Planets and Courses"}, {"tag": "h3", "text": "Playstation 4 and Nintendo Switch release"}, {"tag": "p", "text": "Twenty-one years after the original release of the game, it received an HD re-release for PlayStation 4 and Nintendo Switch that added local multiplayer functionality. It was originally scheduled for May 12, 2020, but was delayed and eventually released on June 23 of that same year. The Switch version also supports motion controls, allowing players to use them to operate the individual throttles of the podracer's twin engines."}, {"tag": "h3", "text": "Xbox One"}, {"tag": "p", "text": "The Xbox One version released on October 27, 2020."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "In March 2004, GMR Magazine rated Episode I Racer the fifth best Star Wars game of all time. WatchMojo.com ranked the game as an honorable mention in a Top 10 Star Wars Video Games list."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the Episode I novel and movie, Anakin Skywalker's podracer was clocked at 941 kph (about 585 mph), granting it the title \"Fastest Podracer in the Galaxy\". Episode I Racer disregards this information because podracers, with maximum acceleration, could achieve speeds of 1046.1 kph (650 miles per hour) without boosting."}, {"tag": "p", "text": "Also, in the game, Ben Quadinaros's podracer had a boost thrust of +643.7 kph (400 mph), which is double the boost thrust of Anakin's pod, 321.9 kph (200 mph), thus granting Quadinaros's pod a stunning top speed of 1689.8 kph, (1050mph) which is the fastest speed of all podracers, on a flat surface."}, {"tag": "p", "text": "Strangely, the game also shows Anakin Skywalker potentially racing on a number of planets, and even being favored for a race track on the planet Baroonda, even though there is very little (if any) indication that he ever raced on any planet other than Tatooine. Therefore, it is likely that any involvement he had with podracing on these other planets would be non-canon in the Legends continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}