{"url": "Star_Wars_Contest", "categories": ["Category:Real-world articles", "Category:Legends comic strips", "Category:Real-world events"], "nodes": [{"tag": "h1", "text": "Star Wars Contest"}, {"tag": "p", "text": "The Star Wars Contest, full name The Official Star Wars Comic Strip Contest, was a contest that was created shortly after A New Hope was created."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the successful release of Star Wars: Episode IV A New Hope, as well as the release of the daily/Sunday strips in the Los Angeles Times, LucasFilm decided to create a contest promoting the eventual release of Star Wars: Episode V The Empire Strikes Back and hold it nationally."}, {"tag": "p", "text": "At least three ads were created that advertized the contest: The first had a picture of C-3PO and R2-D2 floating through space with the words \"Announcing the Official Star Wars Comic Strip Contest!!!\" above the image and \"You could win First Prize and attend the gala U.S. film premiere of the continuing Star Wars saga \"The Empire Strikes Back\" below it, just before the text describing the contest and how to enter; the second was largely similar to the first in general, although it replaced the image and and the large print accompanying the text with an image of R2-D2 saying \"Join me at the gala U.S. film premiere of my new film \"The Empire Strikes Back\" I want you there with me\" and closing with a \"bleep bleep,\" and the text stating \"R2-D2 wants you to enter his official Star Wars Comic Strip Contest.\" The second ad is also the only instance where R2 speaks basic; The third ad is similar to the prior two, although it instead has Luke Skywalker mentioning to Leia that she has no idea what Star Wars comic strip fans have in store for them, with Leia replying that she had heard about the new contest that will send the national winner to the U.S. Gala premiere of The Empire Strikes Back, and the accompanying text stating \"Enter the official STAR WARS comic strip CONTEST.\""}, {"tag": "h2", "text": "Rules of entry"}, {"tag": "p", "text": "The rules were simple: The contestant simply had to write a letter and/or postcard to LucasFilm Ltd. confirming that they have read the comic strip in the Spokesman Review, by midnight on Halloween of 1979, of which the winners will then be determined randomly at an independent firm."}, {"tag": "p", "text": "The location for letter/postcard submissions were at:"}, {"tag": "h2", "text": "Prizes"}, {"tag": "h3", "text": "Grand Prize"}, {"tag": "p", "text": "The grand prize winner won an all-expenses paid vacation for two at the gala U.S. Premiere at the then-continuing entry of the Star Wars movie saga, The Empire Strikes Back. The winner, and his/her guest, will then fly on a commercial airline, stay at a luxury hotel, and receive a full allowance on all meals."}, {"tag": "h3", "text": "Runner-up"}, {"tag": "p", "text": "The runner up won a special selection of Star Wars toys, games, books, and craft kits worth $150.00, as well as two complementary tickets to The Empire Strikes Back that will be issued upon release locally."}, {"tag": "h3", "text": "Third Prize"}, {"tag": "p", "text": "Those who won third prize locally would receive one Random House issued book The Star Wars Question and Answer Book About Space per letter/postcard."}, {"tag": "h2", "text": "External links"}]}