{"url": "Star_Wars_Encyclopedia", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Legends reference books"], "nodes": [{"tag": "h1", "text": "Star Wars Encyclopedia"}, {"tag": "p", "text": "The Star Wars Encyclopedia is a 1998 reference book published by Del Rey Books and written by Stephen J. Sansweet, the director of content management at Lucasfilm Ltd. and science fiction author. It was intended to bring together the wealth of information about the Star Wars universe which had up until that point been published in separate sources, and according to Sansweet was based upon the second edition of the Guide to the Star Wars Universe and first generation of the Essential Guide books."}, {"tag": "p", "text": "Ten years later it was finally updated and superseded by The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Its vast history and environs have been explored, studied, and chronicled extensively for more than twenty years. Now, this landmark volume—a definitive reference devoted exclusively to the Star Wars milieu—draws together data from films, radio dramas, novels, short stories, computer games, and more, running the full gamut of this extraordinary galaxy."}, {"tag": "p", "text": "From science and technology to history and geography; from culture and biography to ecology and cosmology; from \"abo\" and \"Abrax\" to \"zwil\" and \"Zirtran's Anchor,\" this all-encompassing, fully illustrated, alphabetical reference covers all the elements which have developed and expanded the Star Wars universe, creating a rich and diverse history that spans millennia. Its scope ranges from the renowned and infamous (\"Luke Skywalker,\" \"Darth Vader\") to the obscure and enigmatic (\"Tnun Bdu\"); from the history of the Sith Wars to the Galactic Civil War that pit the Rebel Alliance against the Empire. It introduces us to the natives and customs of planets as diverse as Tatooine and Dagobah, and even to the secrets and beliefs of the Jedi Knights."}, {"tag": "p", "text": "As a bonus for the intensive researcher, this massive reference includes the complete timeline of major events in Star Wars history."}, {"tag": "p", "text": "Every key element that exists in the world of Star Wars is supplied here—in clearly defined entries that have been researched and written by one of the leading authorities on the Star Wars universe."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "A"}, {"tag": "h3", "text": "B"}, {"tag": "h3", "text": "C"}, {"tag": "h3", "text": "D"}, {"tag": "h3", "text": "E"}, {"tag": "h3", "text": "F"}, {"tag": "h3", "text": "G"}, {"tag": "h3", "text": "H"}, {"tag": "h3", "text": "I"}, {"tag": "h3", "text": "J"}, {"tag": "h3", "text": "K"}, {"tag": "h3", "text": "L"}, {"tag": "h3", "text": "M"}, {"tag": "h3", "text": "N"}, {"tag": "h3", "text": "O"}, {"tag": "h3", "text": "P"}, {"tag": "h3", "text": "Q"}, {"tag": "h3", "text": "R"}, {"tag": "h3", "text": "S"}, {"tag": "h3", "text": "T"}, {"tag": "h3", "text": "U"}, {"tag": "h3", "text": "V"}, {"tag": "h3", "text": "W"}, {"tag": "h3", "text": "X"}, {"tag": "h3", "text": "Y"}, {"tag": "h3", "text": "Z"}, {"tag": "h2", "text": "Second edition"}, {"tag": "p", "text": "During a January 28, 2004 Hyperspace celebrity chat, it was Steve Sansweet's opinion that there would be a updated edition to the Star Wars Encyclopedia."}, {"tag": "p", "text": "Sansweet again confirmed a second Encyclopedia is on its way at his \"Star Wars Spectacular\" presentation at ComicCon on July 15, 2005. He explained that he and Lucas Licensing were still in the process of deciding how to go about writing a new Encyclopedia. He gave an example of the process, saying that they were trying to decide whether to make the new book a second volume or an entirely new Encyclopedia."}, {"tag": "p", "text": "In a December 2005 post at the StarWars.com message boards, Sue Rostoni claimed that the format had been decided on; any entries from the first edition of which new information has been revealed will be updated and included in the second edition of the Encyclopedia, while entries with no new information will not be included. She also revealed that the new edition will be written in the same format as the first, and that Lucas Licensing was looking at a possible release date of Fall 2008."}, {"tag": "p", "text": "Sansweet later announced in Star Wars Insider 87 (May/June 2006) that work had begun on an updated version of his Star Wars Encyclopedia."}, {"tag": "p", "text": "At the 2007 Comic-Con, the Star Wars publishing panel revealed that a second edition of the book will be written by Sansweet and Pablo Hidalgo (the two previously collaborated on Star Wars Chronicles: The Prequels), and that it will be published in Fall of 2008."}, {"tag": "p", "text": "In April 2008, Random House added an entry on The Complete Star Wars Encyclopedia; this was subsequently reported by Club Jade."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Curiously, Darth Vader has a blue lightsaber and Luke Skywalker has a red lightsaber when pictured on the cover. The explanation given is that the art was taken directly from Drew Struzan's art for the Revenge of the Jedi film poster and wasn't changed, as an homage to that poster."}, {"tag": "p", "text": "The entry for Dak Ralter is accompanied by an image of Derek Klivian."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}