{"url": "Battle_above_Desevro", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle above Desevro"}, {"tag": "p", "text": "A battle occurred above Desevro when the Galactic Empire attacked a convoy of the New Republic from two fronts. On one front, was the Imperial II-class Star Destroyer Overseer and Titan Squadron led by Captain Terisa Kerrill, who sought to gain data from the convoy on the location of Project Starhawk, while on the other Imperial front was Captain Amos aboard the Imperial II-class Star Destroyer Tormentor, the last Star Destroyer in the local fleet. Due to the fatal recklessness of Amos and the Tormentor, Titan Squadron was only able to gain the sector coordinates for Project Starhawk."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "From the intelligence gathered following the extraction of Agent Thorn from the orbital outpost above Hosnian Prime, Captain Terisa Kerrill discovered that a convoy of New Republic engineers was traveling from Hosnian Prime to Project Starhawk's secret base. The convoy's charted path would lead them straight through the contested territory of Desevro, and attempt to conceal its presence in a local debris field. Local Imperial forces were advised not to interfere. Titan Squadron would follow the convoy through the wreckage, and allow them to jump to hyperspace, to calculate all possible destinations along their trajectory to find Project Starhawk."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Titan Squadron arrived outside the debris field, and Titan Three, in a TIE/rp Reaper attack lander, activated a squadron mask to screen their ships from the New Republic convoy and avoid detection. In addition, Titan flew slowly through debris clusters within the debris field as cover to stay out of sight and avoided any boosting."}, {"tag": "p", "text": "Just as they arrived at their holding position to allow the approaching convoy to pass, a severely damaged Imperial II-class Star Destroyer, the Tormentor from the local Imperial forces, dropped out of hyperspace in front of the convoy. It started its own missile attack on the convoy, interfering with Titan's mission and potentially losing the intel to the location of Project Starhawk. Kerrill ordered Titan Squadron to protect the convoy by destroying the missiles. Captain Amos, foolish and eager to destroy the enemy forces, could not understand why Kerrill's forces were protecting the New Republic ships. While Amos' Star Destroyer engaged the EF76 Nebulon-B escort frigate and the CR90 corvettes, a squadron of T-65B X-wing starfighters joined the battle and engaged Titan Squadron. Three of the GR-75 medium transports tried to escape to hyperspace, but were quickly disabled with Titan Three's ion cannons."}, {"tag": "p", "text": "The Overseer arrived and launched three Lambda-class T-4a shuttles, each loaded with a boarding party, docked onto the disabled transports to retrieve the intel, while Titan Squadron continued to fend off waves of X-wings. Once the intel was retrieved, Titan Squadron escorted the shuttles back to the Overseer, keeping the X-wings off their tails. Just as the shuttles made it safely to the hangar bay, Captain Amos reported that he had won, and had defeated the remaining frigate and corvettes. However, Kerrill warned him to stay clear of the exploding frigate, but it was too late for the stubborn captain, as the explosion took out the Tormentor and cost Amos his life."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the intel safely onboard the Overseer, Kerrill finally had the sector coordinates for Project Starhawk. With that, Kerrill ordered Titan Squadron to destroy all the remaining disabled transports, to send a clear message to Commander Lindon Javes, that Titan Squadron were coming for him. Kerril's forces would later follow a convoy into the Zavian Abyss into an ambush that revealed the Starhawk for the first time, which damages the Overseer. Eventually, Kerrill learns the exact location of Project Starhawk and leads an assault with Titan Squadron on the Nadiri Dockyards and the Starhawk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}