{"url": "Star_Wars_Episode_III:_Revenge_of_the_Sith_(soundtrack)", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Film soundtracks"], "nodes": [{"tag": "h1", "text": "Star Wars Episode III: Revenge of the Sith  (soundtrack)"}, {"tag": "p", "text": "The Star Wars: Episode III Revenge of the Sith soundtrack was released by Sony Classical on May 3, 2005, more than two weeks before the release of the film. The music was composed and conducted by John Williams and performed by the London Symphony Orchestra and London Voices. A music video titled A Hero Falls was created for one of the film's themes, \"Battle of the Heroes,\" featuring footage from the film."}, {"tag": "p", "text": "The soundtrack also came with a collectors' DVD, Star Wars: A Musical Journey, at no additional cost. The DVD featured sixteen music videos set to remastered selections of music from all six film scores, set chronologically through the saga."}, {"tag": "p", "text": "This album was chosen as one of Amazon.com's Top 100 Editor's Picks of 2005 (#83)."}, {"tag": "p", "text": "Like most John Williams releases, the album soundtrack does not present the entire score. Instead, it presents highlights from the score edited together in a concert suite-like program, presenting a musical story over the course of the album."}, {"tag": "p", "text": "On May 4, 2018, a remastered version of the soundtrack, utilizing music originally mixed for the film, was released by Walt Disney Records."}, {"tag": "h2", "text": "Track list"}, {"tag": "p", "text": "Total time: 70:46"}, {"tag": "h2", "text": "Tracks"}, {"tag": "h3", "text": "Star Wars Main Title And the Revenge of the Sith"}, {"tag": "p", "text": "The track starts off with the main theme. Although the previous films, and indeed, Episode III, had a quieter descend into the next piece, here, earlier than previous films, this track does not follow the music heard in the film after the opening titles."}, {"tag": "h3", "text": "Anakin's Dream"}, {"tag": "p", "text": "The track plays during Anakin Skywalker and Padmé Amidala's scenes at her apartment, Anakin's nightmare, and the following scene on Padmé's veranda. A statement of \"Across the Stars\" appears at 0:26, and again at 2:27, while brief portions of the \"Force Theme\" are heard from 3:33."}, {"tag": "h3", "text": "Battle of the Heroes"}, {"tag": "p", "text": "This track starts to play after Obi-Wan and Anakin are caught in a collapsing control arm on Mustafar and ends when Obi-Wan Kenobi leaves Anakin on the edge of the lava river. This is actually a concert suite of the theme."}, {"tag": "h3", "text": "Anakin's Betrayal"}, {"tag": "p", "text": "This track, a sorrowful adagio representing the fall of the Jedi, underscores the Order 66 sequence, and is reprised when Anakin confronts his wife shortly before the duel on Mustafar. It has a similar tone and style to \"The Immolation Scene.\""}, {"tag": "h3", "text": "General Grievous"}, {"tag": "p", "text": "The first part of this track (up to about 1:25) appears when Obi-Wan is searching for Grievous. Most of the rest appears during the end of the wheel bike chase and the final fight between the characters on the landing platform, although parts of it were not used. A militaristic version of the \"Force Theme\" is heard at 0:38, heralding Obi-Wan's arrival on the Tenth Level. Starting at 1:25, the track becomes an action piece."}, {"tag": "h3", "text": "Palpatine's Teachings"}, {"tag": "p", "text": "The first part of this track plays while Palpatine is telling Anakin the story of his old master, Darth Plagueis. The second half of the track consists of the music in the scenes where Anakin learns that Palpatine is a Sith Lord and Anakin's mission from the Jedi Council."}, {"tag": "h3", "text": "Grievous And The Droids"}, {"tag": "p", "text": "This track plays during the bridge fight on the Separatist flagship, and also when General Grievous escapes after dueling Obi-Wan on Utapau."}, {"tag": "h3", "text": "Padmé's Ruminations"}, {"tag": "p", "text": "The cue—a mournful, wailing voice proceeded by a slow string section—underscores the otherwise silent moment between Anakin and Padmé prior to the duel in the Chancellor's office. The second part of the track plays when Palpatine instructs Anakin to go to the Jedi Temple and kill all the Jedi inside."}, {"tag": "h3", "text": "Anakin Vs. Obi-Wan"}, {"tag": "p", "text": "This track plays under Obi-Wan and Anakin's lightsaber duel on Mustafar. Some of the track also plays while Yoda and Palpatine are dueling in the underbelly of the Senate Rotunda. As the track starts off, the beat is set by the strings, low brass, and percussion. The trumpets then come in with a short soli each followed by a cymbal crash. Then the low brass comes in with the theme from \"Battle of the Heroes.\" After that a selection of \"The Duel,\" from Episode V, is heard followed by the return of \"Battle of the Heroes.\" Next is a longer version of \"The Imperial March.\" Then the rhythm speeds up right before the march returns. After the march, \"Battle of the Heroes\" returns. It goes through a few different versions before going into a variation of \"Force Theme.\""}, {"tag": "h3", "text": "Anakin's Dark Deeds"}, {"tag": "p", "text": "This track is played during Anakin Skywalker's attack on the Executive Separatist Council and Palpatine's announcement to the Galactic Senate of his new Galactic Empire and his self-proclamation as Galactic Emperor. It continues as Obi-Wan Kenobi confronts Padmé Amidala about where Anakin has gone, and then discovers that Anakin is the father of her children. It plays until the end of Skywalker's destruction of the Separatist Council."}, {"tag": "h3", "text": "Enter Lord Vader"}, {"tag": "p", "text": "The cue plays at the start of Anakin Skywalker's mission to Mustafar, and as Obi-Wan Kenobi and Yoda fight the clone troopers outside the Jedi Temple. A rendition of Anakin's \"B-theme,\" first heard in Episode I, and associated with \"Shmi's Theme,\" plays after the opening percussion. A statement of \"The Imperial March\" appears at 03:19, as well as a truncated version of the \"Force Theme\" at 03:44, followed by \"The Emperor's Theme.\""}, {"tag": "h3", "text": "The Immolation Scene"}, {"tag": "p", "text": "This track plays directly after the duel on Mustafar, when Darth Vader is defeated on Mustafar and burnt alive."}, {"tag": "h3", "text": "Grievous Speaks To Lord Sidious"}, {"tag": "p", "text": "This track plays while General Grievous talks to Darth Sidious and when Padmé leaves Coruscant to go to Mustafar. It contains the theatrical motif \"General Grievous's theme.\""}, {"tag": "h3", "text": "The Birth Of The Twins And Padmé's Destiny"}, {"tag": "p", "text": "This track plays while Padmé gives birth to Luke Skywalker and Leia Skywalker, and continues through her death and Anakin's rebirth as the mechanized Darth Vader. The second part of the 3:37 track contains an extended version of the \"Funeral\" cue in the Phantom Menace song \"The High Council Meeting and Qui-Gon's Funeral.\""}, {"tag": "h3", "text": "A New Hope And End Credits"}, {"tag": "p", "text": "The longest track on the album plays while Luke and Leia are being taken to their future homes and then during the end credits. Here, Leia's theme, Binary Sunset/The Throne Room and End Title (Ep. IV), and Battle of the Heroes all play before the finale."}, {"tag": "h2", "text": "Recording information"}, {"tag": "p", "text": "John Williams' score to this film was recorded at Abbey Road Studio with the London Symphony Orchestra and London Voices."}, {"tag": "p", "text": "This list shows the slate, title, and recording date for each cue.[source?]"}, {"tag": "p", "text": "Also recorded on February 3: Revenge of the Sith DVD Version (\"Battle of the Heroes,\" presumably)."}, {"tag": "h2", "text": "Differences between the album, film, and initial score"}, {"tag": "p", "text": "The score presented in the film is different in many respects from what John Williams had intended, because of George Lucas' editing choices."}, {"tag": "p", "text": "Due to the process Lucas puts his films through during editing, many scenes were streamlined and music was removed. Also true to form for the prequel trilogy, many scenes contained pre-planned tracked music. Such is the case of \"The Tide Turns\" from Star Wars: Episode I The Phantom Menace, tracked in for the scene when Anakin flies the now-crippled Invisible Hand for a crash landing on Coruscant."}, {"tag": "p", "text": "Another source of differences between the music in the film and on the soundtrack is that in the recording process, John Williams recorded cues multiple times and used those takes to make one edit of the track."}, {"tag": "p", "text": "The music in the opening of the film—after the scroll—starts with only low taiko drums, which continue until the music is finally tracked in, and continue layered underneath the music. The album recording, however, does not have such prominent percussion and, in some cases, has slightly different orchestrations in the parts that can be compared to the film. The differences stem from changes made during the recording process and from alternate takes of the same cue. The actual landing of the ship in the film also contains a partial ending not heard on the album."}, {"tag": "p", "text": "The album also contains alternate versions of some of the battle cues, as well as most of the unused segment \"The Elevator Scene.\" \"I Am the Senate,\" a piece drastically altered in the film, originally featured music to score the scene where Palpatine is attempting to persuade Anakin to join him while shocking Mace Windu. This music was cut from the film, but it can be heard in the video games. Another cue, \"Padmé's Ruminations,\" is different from what is heard on the album, both in its mix and in the vocal performance."}, {"tag": "p", "text": "Much of the film contains percussion alternates. For example, \"Moving Things Along\" (\"Enter Lord Vader\" on the album) has a percussion track in the film not present on the album. This stems from the fact that the percussion of many cues was recorded separately, to be laid onto the cue in mixing."}, {"tag": "p", "text": "\"Battle of the Heroes\" begins with strings on the album but not in the movie, and in the movie the ending is different, although this stems from the fact that the version on the album is a concert-suite representation of the cue."}, {"tag": "p", "text": "Williams' album \"End Credits Medley\" is much longer than the piece heard in the film. The end credits for the film mainly include the original Star Wars theme and a selection of the new cues, such as \"Battle of the Heroes\" as well as a reprisal of \"Princess Leia's Theme.\" The album medley, however, includes as well as these themes a reprise of \"The Throne Room\" suite from A New Hope."}, {"tag": "p", "text": "\"Duel of the Fates\" also makes an appearance in the score. This time, however, the choir was rerecorded and layered over the choirless recording from The Phantom Menace."}, {"tag": "p", "text": "Most of the score can be heard in the album and various LucasArts video games, but a complete release has yet to be made."}, {"tag": "h2", "text": "Star Wars: A Musical Journey"}, {"tag": "p", "text": "Star Wars: A Musical Journey is a bonus DVD included with the soundtrack. The DVD, which runs for just over an hour, contains a collection of music video clips from the Star Wars films set to selected themes from Williams's scores. The music has been remastered in Dolby 5.1 surround sound. It also contains a preview trailer for the video game adaptation of the movie. Each clip features an introduction by actor Ian McDiarmid. The program can be watched with or without this introduction."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}