{"url": "Star_Wars_Commemorative_Postage_Stamps", "categories": ["Category:Real-world articles", "Category:Merchandise"], "nodes": [{"tag": "h1", "text": "Star Wars Commemorative Postage Stamps"}, {"tag": "p", "text": "Star Wars Commemorative Postage Stamps are any postage stamp produced with a Star Wars theme. They often feature specially commissioned or well-known artwork from the Star Wars saga and are most common in the United States."}, {"tag": "h2", "text": "United States"}, {"tag": "p", "text": "The United States Postal Service, or USPS, produced stamps commemorating the 30th anniversary of the theatrical release of Star Wars: Episode IV A New Hope. They were released on May 25, 2007 and included 15 first-class 41¢ postage stamps featuring artwork by well-known artist Drew Struzan."}, {"tag": "p", "text": "Text describing the roles each featured character or vehicle played in the Star Wars Saga appears on the back of the souvenir sheet."}, {"tag": "p", "text": "Customers of the USPS and Star Wars fans alike were invited to vote on their favorite stamp of this series. Yoda received the most votes and was released as a souvenir sheet featuring his winning stamp."}, {"tag": "h3", "text": "Stamp contents"}, {"tag": "p", "text": "A Droids-themed set of 55¢ Forever stamps is scheduled for release on May 4, 2021, featuring 10 droid characters:"}, {"tag": "h2", "text": "Other countries"}, {"tag": "h3", "text": "Saint Vincent and the Grenadines"}, {"tag": "p", "text": "The Caribbean nation of Saint Vincent and the Grenadines produced two sets of Star Wars stamps in 1996. The first set featured six classic pieces of concept art by Star Wars artist Ralph McQuarrie. The second set featured silver foil stamps of the box art for the 1995 release of the original trilogy on VHS. They also released gold foil stamps featuring the VHS covers."}, {"tag": "h3", "text": "Australia"}, {"tag": "p", "text": "Australia released a limited edition collectors pack that contained ten stamps showcasing the vehicles and vessels of the Star Wars saga through Attack of the Clones. The collection also included twenty sheets of Star Wars stationery and envelopes."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}