{"url": "Star_Wars_Episode_V:_The_Empire_Strikes_Back_(soundtrack)", "categories": ["Category:Real-world articles", "Category:Film soundtracks"], "nodes": [{"tag": "h1", "text": "Star Wars Episode V: The Empire Strikes Back (soundtrack)"}, {"tag": "p", "text": "The score for Star Wars: Episode V The Empire Strikes Back, composed by John Williams, was recorded in 18 sessions at the Anvil Studios and the Abbey Road Studios over three days in December 1979 and a further six days in January 1980 by the London Symphony Orchestra. Between A New Hope and The Empire Strikes Back, Williams had also used the London Symphony Orchestra for the film's score of The Fury, Superman and Dracula. The score won another Oscar nomination for Williams."}, {"tag": "p", "text": "The soundtrack was first released as a 75-minute double LP five days before the premiere of the film but the first compact disc release ran only half the length of the 2 LP set. Re-recordings of the score even included music that was not on the original CD soundtrack."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "In 1980, the disco label RSO Records released the film's original soundtrack in a double-album, with two long-playing (LP) records. Combined, the two records featured 75 minutes of film music. This double LP package also included a booklet presentation with pictures of the main characters and action sequences from the film. Featured at the end of the booklet was an interview with John Williams about the music and the new themes, such as the iconic \"Imperial March (Darth Vader's Theme)\" and \"Yoda's Theme\". It also included a brief explanation of each track. The front cover artwork featured the mask of Darth Vader against the backdrop of outer space; and the back cover featured the famous \"Gone with the Wind\" version of the poster art. As a side note, this package marked the final time a double LP soundtrack set was ever issued (Episode VI, the final movie to have an LP soundtrack released, had only a single disc, also released by RSO Records). A double-cassette edition was also released."}, {"tag": "p", "text": "In 1985, the first Compact Disc (CD) release of the soundtrack was issued by Polydor Records, which had absorbed RSO Records and its entire music catalog. This CD release, however, reduced the music content from the 75 minutes featured in the 1980 double-album down to 42 minutes. The tracks were also re-arranged differently. For instance, the first track on the CD is the \"Imperial March\" instead of the \"Star Wars/Main Theme\"."}, {"tag": "p", "text": "In 1993, 20th Century Fox Film Scores released a special four-Compact Disc box set: Star Wars Trilogy: The Original Soundtrack Anthology. This anthology included the soundtracks to all three of the original Star Wars films in separate discs. The disc dedicated to The Empire Strikes Back restored the original 75 minutes from the 1980 LP version and included new music cues never released before for a total of nineteen tracks. On the fourth bonus disc, five additional tracks from Empire were included in a compilation of additional cues from the other two films. This CD release also marked the first time that the famous \"20th Century Fox Fanfare\" composed by Alfred Newman in 1954 was added to the track listing, preceding the Star Wars Main Theme."}, {"tag": "p", "text": "In 1997, RCA Victor released a definitive two-disc set coinciding with the Special Edition releases of the three movies of the original trilogy. This original limited-edition set featured a 32-page black booklet that was encased inside a protective outer slipcase. The covers of the booklet and the slipcase had the Star Wars Trilogy Special Edition poster art. This booklet was very detailed, providing extensive notes on each music cue and pictures of the main characters and action sequences from the movie. The two discs were placed in sleeves that were on the inside front and inside back covers of the booklet. Each disc had a glittery laser-etched holographic logo of the Empire. The musical content featured the complete film score for the first time. It had all of the previously released tracks, including extended versions of five of those tracks with previously unreleased material, and six brand new tracks of never before released music for a total of 124 minutes. All the tracks were digitially remastered for superior clarity of sound. They were also re-arranged and re-titled from the previous releases to follow the story of the film in chronological order. RCA Victor re-packaged the Special Edition set later in 1997, offering it in slimline jewel case packaging as an unlimited edition, but without the stunning presentation and packaging that the original \"black booklet\" version offered."}, {"tag": "p", "text": "In 2004, Sony Classical acquired the rights to the classic trilogy scores since it already had the rights to release the second trilogy soundtracks (The Phantom Menace and Attack of the Clones). And so, in 2004, Sony Classical re-pressed the 1997 RCA Victor release of the Special Edition Star Wars trilogy, inlcuding The Empire Strikes Back. The set was released in a less-than-spectacular package with the new art work mirroring the first DVD release of the film. Despite the Sony digital remastering, which minimally improved the sound heard only on high-end stereos, this 2004 release is essentially the 1997 RCA Victor release."}, {"tag": "h2", "text": "Track listing for the first release on LP"}, {"tag": "h4", "text": "Side one"}, {"tag": "h4", "text": "Side two"}, {"tag": "h4", "text": "Side three"}, {"tag": "h4", "text": "Side four"}, {"tag": "p", "text": "Total Time: 74:34"}, {"tag": "h2", "text": "Track listing for the first release on CD"}, {"tag": "p", "text": "Total Time: 41:23"}, {"tag": "h2", "text": "Star Wars Trilogy: The Original Soundtrack Anthology"}, {"tag": "p", "text": "In 1993, Twentieth Century Fox Film Scores released a four CD box set containing music from the original Star Wars Trilogy. This release marked the first time that the complete contents of the original double-LP releases of the scores from the first two movies became available on CD. Disc two in the set was devoted to The Empire Strikes Back, with further tracks on disc four."}, {"tag": "h2", "text": "Track listing for the complete score"}, {"tag": "p", "text": "In preparation for the 20th anniversary releases of the Special Editions of the original trilogy of films, Twentieth Century Fox spent four months, from April to July 1996, transferring, cleaning and preparing the original soundtracks for special two disc releases. The original release, by RCA Victor in 1997, consisted of limited edition books with laser etched CDs inside the front and back covers with each book. In the case of The Empire Strikes Back, the discs are etched with the logo for the Empire. The discs were given an unlimited release in a two disc jewel case, also by RCA Victor later that year. They were again rereleased in 2004 by Sony Music, with new artwork paralleling the first DVD release of the original trilogy."}, {"tag": "h4", "text": "Disc one"}, {"tag": "p", "text": "Total Time: 62:43"}, {"tag": "p", "text": "*previously unreleased"}, {"tag": "p", "text": "**contains previously unreleased material"}, {"tag": "h4", "text": "Disc two"}, {"tag": "p", "text": "Total Time: 61:44"}, {"tag": "p", "text": "*contains previously unreleased material"}, {"tag": "p", "text": "**contains previously unreleased material"}, {"tag": "h2", "text": "Bibliography"}]}