{"url": "Battle_against_the_Benathy_(First_Order)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Cleanup", "Category:Battles in Wild Space", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Battle against the Benathy  (First Order)"}, {"tag": "p", "text": "At some point prior to the Attack on Tuanul, Kylo Ren and his troops fought the Benathy on their homeworld to prevent King Kristoff and their people from expanding their territory."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Sometime after the Battle of Jakku, Kylo Ren traveled to a world in Wild Space to negotiate with the Benathy about halting their expansions, as they had already conquered four planets and wiped out all life on them. Accompanying him was Ruthford, an Imperial stormtrooper who had fought the Benathy alongside Ren's grandfather and was the sole survivor. Ruthford had accompanied Ren to advise him on dealing with the Benathy. He also set troops on the planet, just in case the negotiations went foul."}, {"tag": "p", "text": "The duo headed to a tent where the king of the Bethany, Kristoff, waited. He told Ren to have a seat, but Ren declined, saying that that it would make him look like an infant. Ren then proceeded to order Kristoff to quit expanding his land, but the king wouldn't budge. He said he remembered when Vader had come demands. He had killed their last king and a battle ensued, but even he couldn't defeat their god. Ren remarked that he'd put Kristoff's people down, but Kristoff replied by saying that they got back up. Ren tried to again convince the ruler to stop his expansion by using the Force. But still, the monarch was not agreeable to Ren's terms. Ruthford, who was standing in the back, advised the king to listen to Ren's command, or else. This infuriated the king, but before he could strike out, Ren stabbed him in the head, killing him and beginning a battle."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "A savage battle broke out. Ruthford advised Ren to retreat, knowing the brute strength of the Benathy. Ren refused, saying Vader never would have. Ruthford told Ren that his grandfather fought well and strong and thousands died on both sides. But the one thing Vader was not able to defeat was their god."}, {"tag": "h3", "text": "Death of a god"}, {"tag": "p", "text": "As the battle raged, a massive Zillo Beast arose. This beast was their god and it was virtually invincible, and even Vader had failed to kill the creature. The Zillo Beast raged and was able to attack a First Order ship overhead. However, Kylo Ren was determined to destroy it. He ordered his men to get his shuttle. As Ren leaped onto his shuttle, Ruthford told him that he could not prove anything to his dead grandfather. But Ren pressed on. Ruthford thought that he was a stupid kid as he watched the shuttle fly off. Igniting the crimson blade of his lightsaber, Ren jumped off the platform of his shuttle and into the mouth of the Zillo Beast. Ruthford watched from below disappointed, saying Kylo would not have impressed Vader, right as the beast came tumbling down. Ren had entered the animal and killed it from inside."}, {"tag": "p", "text": "The Benathy immediately quit fighting and bowed to the blood-covered Ren. After killing their god, he ordered them to serve the First Order."}, {"tag": "p", "text": "He had also earned the newfound respect and admiration of Ruthford."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}