{"url": "Battle_at_Elessia", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battle stubs", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle at Elessia"}, {"tag": "p", "text": "Between 3 ABY and 4 ABY, a battle was fought at Elessia between the Alliance to Restore the Republic and Galactic Empire, when Imperial Commander Ellian Zahra and her forces intercepted transmissions between the rebel Fourth and Seventh Divisions, who were attempting to regroup after the Alliance Fleet was scattered after the Battle of Hoth."}, {"tag": "p", "text": "Zahra initially intended to send her assault group to attack the Fourth Division in order to exact revenge on Princess Leia Organa for the death of her mentor, Grand Moff Wilhuff Tarkin, but was convinced to instead send her second strike force to attack Organa's group as it was closer to the Fourth Division, and Zahra's group was closer to the Seventh Division. By the time the second force had arrived, however, the Fourth were already heading to Elessia to regroup with the Seventh, arriving shortly after Zahra's assault group began attacking the Seventh."}, {"tag": "p", "text": "As the two rebel divisions battled the Imperial forces, Zahra boarded the Fourth Division's EF76 Nebulon-B escort frigate and disabled the safety controls on the vessels reactor, but insisted that she would reactivate them if Organa spoke with her alone in the ships engine room. Organa complied with the request and made her way to the engine room. After Zahr informed Organa of her reasoning why she sought revenge and before she could carry it out, Zahra was informed by Lieutenant Gorr that her flagship, Tarkin's Will, was taking significant fire from the rebel divisions and that he was preparing to flee and that she should return to the ship. Zahra fled the rebel ship, and made her way to the Tarkin's Will before it departed Elessia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}