{"url": "Battle_at_Fostar_Haven", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle at Fostar Haven"}, {"tag": "p", "text": "During the Galactic Civil War, a battle broke out at Fostar Haven when the Galactic Empire learned that Alderaanians that had survived the destruction of their planet Alderaan had gathered at the station."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the interrogation of Princess Leia Organa, Grand Moff Wilhuff Tarkin ordered the destruction of Alderaan as a test for the Death Star. Darth Vader then ordered Commodore Rae Sloane to hunt down the remaining Alderaanians across the galaxy. She gathered a fleet of five Quasar Fire-class cruiser-carriers, nine Arquitens-class command cruisers, four Raider-class corvettes, four Imperial Gozanti-class cruisers, and the Imperial II-class Star Destroyer, the Vigilance. They had received intelligence that some survivors would cross the Fostar Haven spaceport. Rae Sloane dispatched Lindon Javes and his Helix Squadron to intercept and destroy them. He arrived with an initial force of five Quasar carriers, five Arquitens cruisers, and two Gozanti transports, along with several squadrons of TIE/ln space superiority starfighters and his personal TIE Advanced v1 to the port. Captain Canonhaus, in command of the Majestic, was reportedly assigned in a support role, ordered to guard the perimeter from escaping refugees and perform other support duties such as navigational interdiction and logistics."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Imperial raid"}, {"tag": "p", "text": "Upon arriving in the system, the TIE fighters began to scan the BFF-1s in the area, although only catching an illegal arms dealer. However, embarrassed by the action of the Empire, the dock master had the station's defense systems activated, attacking the TIE fighters. Upon dealing with the defenses, twelve T-65B X-wing starfighters came out of a tunnel and engaged the TIE fighters."}, {"tag": "h3", "text": "The defection"}, {"tag": "p", "text": "After defeating the X-wings, Terisa Kerrill and her wing-mate found the Alderaanian refugees inside three GR-75 medium transports and moved in to destroy them, however they were stunned by Javes, who decided that some things the Empire did were going too far. He helped the transports escape the tunnels and opened fire in the tunnel, causing a cave-in, trapping the two TIE pilots. The refugees moved in to escape, but were stopped by the Vigilance and four more Arquitens cruisers."}, {"tag": "h3", "text": "Alliance rescue"}, {"tag": "p", "text": "The transports contacted Admiral Gial Ackbar, who initially dispatched the five X-wings of Echo Squadron. By time they arrived, another Arquitens-class cruiser, a Raider-class corvettes, and two Quasar-class carriers had joined the blockade at the other side of the tunnels. Echo squadron raced to get to the transports, but Echo Five was killed just getting there. The squadron assisted Lindon in defending the transports from TIE fighters. One of the Quasars bore down on them and launched another wave of TIEs at the group, killing Echo Two in the process, but a rebel CR90 corvette arrived with a UT-60D U-wing starfighter and destroyed the carrier. Lindon begged Ackbar to send more help, claiming the Imperials were merely preparing for a larger attack on the transports. Ackbar then sent two CR90 corvettes, a EF76 Nebulon-B escort frigate, and a MC80 Liberty Type Heavy Star Cruiser to cover their escape. Echo Squadron then engaged and destroyed a Raider-class corvette, allowing the transports to escape. The empire managed to destroy their Nebulon-B frigate, but the unit destroyed their tracking systems and fled the area, thus preventing the Empire from tracking them or the refugees."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Lindon Javes defected to the Alliance to Restore the Republic, becoming a valuable member and quickly rose through the ranks. His two subordinates were disgraced by the Empire, being reassigned to the Outer Rim Territories. Kerill was assigned to the Meram Sector, eventually becoming a captain. Captain Canonhaus was reportedly assigned to handle the legal followup, with the understanding that he ensure that the incident appeared to have been executed within the bounds of Imperial law. Canonhaus would later claim that he actually went out of his way to ensure that every aspect of his report was misfiled, reclassifying Darth Vader as a transport ship and reporting that the incident revolved around gambling debts made by the Emperor. Despite this, Canonhaus supposedly never received any remarks on his deliberate misfiling, indicating that none of the official documents were actually read."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}