{"url": "Star_Wars_Graphic_Novel_Adaptation_Box_Set", "categories": ["Category:Real-world articles", "Category:Future books", "Category:Star Wars Movie Adaptations"], "nodes": [{"tag": "h1", "text": "Star Wars Graphic Novel Adaptation Box Set"}, {"tag": "p", "text": "Star Wars Graphic Novel Adaptation Box Set is a forthcoming box set containing the graphic novel adaptations of the original trilogy and sequel trilogy. The set is scheduled to be published by IDW Publishing on November 9, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Explore the Star Wars universe in a whole new light with this box set of stylishly illustrated graphic novel adaptations of the Original Trilogy and the Skywalker Saga. [sic]"}, {"tag": "p", "text": "“Help me, Obi-Wan Kenobi. You're my only hope.”"}, {"tag": "p", "text": "“Do. Or do not. There is no try.”"}, {"tag": "p", "text": "“That's how we're gonna win. Not fighting what we hate, saving what we love.”"}, {"tag": "p", "text": "“Confronting fear is the destiny of a Jedi.”"}, {"tag": "p", "text": "Relive all the events from the twin sunset over Tatooine to the lightning-streaked skies of Exegol with this handsome selection of paperbacks, adapted from the films by writer Alessandro Ferrari. Each book combines the epic wonder of a galaxy far, far away with streamlined, young-reader friendly designs, making this a visual treat for longtime fans and a great introduction for newcomers."}, {"tag": "p", "text": "This special box set collects the graphic novel adaptations of A New Hope, The Empire Strikes Back, Return of the Jedi, The Force Awakens, The Last Jedi, and The Rise of Skywalker."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Collected graphic novels"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The box set was originally listed as Star Wars Episodes IV–IX Graphic Novel Adaptation Box Set before the official cover and title's reveal in early 2021."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}