{"url": "Battle_at_Lansend_Twenty-Six", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Battle at Lansend Twenty-Six"}, {"tag": "p", "text": "After an attack on the transport Sempre, insurgents and freed Wookiee slaves attacked the space station Lansend Twenty-Six in an attempt to liberate their companions. With their communications jammed, Lansend Twenty-Six could not call on the nearby Baklek Base for support, but were aided by the Chimaera under the command of Commodore Thrawn, who had anticipated the attack. The forces were defeated soon after."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, the xenophobic Galactic Empire exploited the Wookiee species as an expendable slave labor force; regarding them as beasts. The Empire exploited the Wookiees because their large, robust physiology allowed them to work in harsh and dangerous conditions. Enslaved Wookiees were used to harvest lumber, work in mines, build Imperial weapons such as the Death Star, and as test subjects in medical and weapons experiments. In addition, the Empire turned the Wookiee homeworld of Kashyyyk into a giant slave labor camp and renamed it Imperial territory G5-623."}, {"tag": "p", "text": "The pirate and insurgent leader Nightswan waged an insurgent campaign against the Empire. He and his followers engaged in various activities including smuggling doonium, tibanna, and iridium to raise funds for people hurt by the Empire. Eight weeks before the attack on the troop carrier Sempre, Nightswan's followers stole the frigate Castilus and two squadrons of V-19 Torrent starfighters. They ambushed the Sempre, freed the enslaved Wookiees, and killed the Imperial crew and stormtrooper contingent aboard."}, {"tag": "p", "text": "The Imperial Star Destroyer Chimaera under the command of Commodore Thrawn responded to the Sempre's distress transmission. While stormtrooper Major Ayer tried to keep the ship's cargo a secret, Thrawn and Lieutenant Commander Eli Vanto insisted on inspecting the Sempre. They discovered that the troop carrier was transporting Wookiee slaves. Due to the tribal nature of Wookiee culture, Thrawn realized that the liberated Wookiees would seek vengeance against those who participated in the slaving: the space station Lansend Twenty-Six, which processed Wookiee slaves exported offworld."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As Thrawn had predicted, the insurgents and liberated Wookiees traveled to Lansend Twenty-Six. Since a saboteur had managed to sabotage the long–range comm and starboard–side defense system, the insurgents were able to penetrate the space station. However, the station's commander Colonel Zenoc managed to capture the saboteur and fire the station's portside weapons. After contacting Baklek Base for help, the Chimaera arrived at Lansend Twenty-Six to find the processing station under attack. After establishing contact with Colonel Zenoc, Commodore Thrawn requested the schematics of her base."}, {"tag": "p", "text": "By then, the insurgents had breached the starboard docking hatch and were fighting their way inside. The insurgents' frigate and starfighters also tried to take out the portside defenses so that they could land another boarding party in a pincer movement. Thrawn directed his TIE fighters to engage the enemy V-19s. Commander Vanto then reported that the portside V-19 force had split up with half engaging the TIEs while the other half lay siege to the station. Though the insurgents dispatch starboard V-19s to defend the Castilus, Commander Karyn Faro took out the ship's hyperdrive."}, {"tag": "p", "text": "After ordering the TIEs to focus on the V-19s, Thrawn asked Colonel Zenoc if there were any slaves in sections A-four, A-five or B-five. Zenoc reluctantly confirmed the presence of non-military personnel in B-five. Thrawn ordered her to evacuate all personnel to B-eight so that Commander Faro's gunners could use the Chimaera's turbolasers to target seven points on the station's starboard side. Once Zenoc had complied, the Chimaera bombarded the sections of the station where the insurgents had boarded, trapping them. Thrawn also took care not to target B-five, which was now isolated from the rest of the station."}, {"tag": "p", "text": "With the boarders neutralized, Thrawn then turned his forces' attention to battling the frigate and V-19s. Thrawn then informed Colonel Zenoc that his forces would continue operations until the Baklek reinforcements arrived. By that stage, enemy forces were down to the crippled frigate and three functioning V-19s. Thrawn gave orders for Commander Faro to capture prisoners for interrogation."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle at Lansend Twenty-Six, Imperial forces captured the insurgents and secured the Wookiee slaves. Thrawn's forces also retrieved the Sempre and returned it to Imperial hands. Thrawn also left the Wookiee slaves on Lansend Twenty-Six, regarding them as Imperial assets who were being returned to their proper owners. When Lieutenant Commander Vanto expressed unease that the Empire was using slaves, Thrawn tried to rationalize slavery and insisted that the Wookiees would be treated like Imperial assets."}, {"tag": "p", "text": "Despite the defeat of Nightswan's forces at Lansend Twenty-Six, other rebel groups such as the Spectres took an interest in liberating Wookiee slaves. Later, the former smuggler and Rebel Alliance General Han Solo sought to honor his life debt to Chewbacca by freeing Wookiee slaves on Kashyyyk. After months of trial and failure, Solo and Chewbacca mustered a motley force of former slaves and allies that succeeded in liberating Kashyyyk from Imperial rule and exploitation in 5 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}