{"url": "3PO-series_protocol_droid/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:3PO-series protocol droid models", "Category:3PO-series protocol droids"], "nodes": [{"tag": "h1", "text": "3PO-series protocol droid"}, {"tag": "p", "text": "The 3PO-series protocol droid was a Human-cyborg relations protocol droid produced by Cybot Galactica. The model series had very similar aesthetic design in its casing to other Cybot Galactica droid model series such as the TC-series, 3PX-series, and 5YQ-series protocol droids."}, {"tag": "p", "text": "One of the most famous droids of this series was C-3PO, one of the heroes of the Rebel Alliance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Cybot Galactica on the factory world of Affa, the 3PO-series protocol units were considered the most advanced Human-cyborg relations droids in the market for over a hundred years. Production on the line began at least as far back as 112 BBY and continued well into the time of the New Republic."}, {"tag": "p", "text": "The success of the 3PO-series led Cybot Galactica to produce the C-series protocol droids during the rule of the New Republic. They had a market cost of 3,000 credits."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "The typical 3PO-series droid stood at approximately 1.7 meters in height with a humanoid build. Most units were programmed with a subservient, service oriented personality and a typical 3PO unit would never attack, under any circumstances even if it was in self-defense."}, {"tag": "p", "text": "With its standard components (head, torso, legs, arms and hands), a typical 3PO unit would weigh around 77.6 kg, and its maximal speed was 21km/hr."}, {"tag": "p", "text": "Each droid was equipped with a SyntheTech AA-1 VerboBrain making them capable of storing enormous amounts of information, the additional memory space was often used to keep communication modules in the active memory so that long delays could be avoided while searching for linguistic information on mid-translation. A TranLang III communications module allowed them to be fluent in over six million forms of communication, even if they could not respond in all of them for a lack of proper communication appendages. They also had the skills necessary to quickly analyze new unregistered languages and translate them into more well-known ones."}, {"tag": "p", "text": "They were even provided with an olfactory sensor that allowed them to comprehend pheromonal communication. Other useful features were a factory-standard restraining bolt mount, and the fact that their shutdown switch was conveniently located at the back of their neck, on a very easy to reach place."}, {"tag": "p", "text": "Some models, such as the pricey E-3POs, also included the TechSpan I module, making it possible to interface with Imperial networks and undocumented technologies of Imperial subcontractors."}, {"tag": "h2", "text": "Color variations"}, {"tag": "p", "text": "Droids in the 3PO-series came in a variety of colors, the most usual being gold, silver and white. Their colored plating, however, was known to be prone to corrosion. The following is a list of all known plating colors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The basic shape of C-3PO, and thus the 3PO-series, was inspired by Maria, a robot in the 1927 German silent film Metropolis, and sculptress Liz Moore further developed the droid's design."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}