{"url": "Star_Wars_Infinities:_Return_of_the_Jedi", "categories": ["Category:Real-world articles", "Category:Star Wars Infinities"], "nodes": [{"tag": "h1", "text": "Star Wars Infinities: Return of the Jedi"}, {"tag": "p", "text": "Star Wars Infinities: Return of the Jedi is a 4-part comic sub-series of Star Wars Infinities. It was published from November 2003 to November 20, 2004, then compiled as a trade paperback on March 31, 2004."}, {"tag": "p", "text": "It deals with what could have happened following the chaos of failed negotiations between Jabba Desilijic Tiure and \"Boushh.\""}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In the topsy-turvy Infinities universe, a single, seemingly insignificant event can alter the fate of the galaxy. Continuing with the tradition begun in Star Wars Infinities: A New Hope, we now give Return of the Jedi the Infinities treatment! When the plan to rescue Han Solo from Jabba the Hutt falls apart, Princess Leia, Lando Calrissian, and Chewbacca embark on another rescue mission that puts them into direct conflict with Boba Fett. Meanwhile, Luke's late arrival on Dagobah ends with him being captured by Darth Vader and the Emperor, just as the second Death Star is about to go on-line! Will the return of the Jedi become the end of the Jedi? The surprising climax is as exciting as that of the film on which it is based, but different from anything Star Wars fans have seen before! Collecting the four-issue miniseries."}, {"tag": "h2", "text": "Story summary"}, {"tag": "p", "text": "At the palace of Jabba Desilijic Tiure, Leia Organa, disguised as the bounty hunter Boushh, is making her offer to Jabba of Chewbacca in an attempt to gain the Hutt's trust. But things go horribly wrong. When C-3PO is knocked down by Jabba following her demand of \"fifty thousand, no less\", the droid's head comes off, leaving her with no means to communicate with the Hutt. With no translator and forced to reveal herself to the entire assembly, she pulls the thermal detonator and threatens to use it unless Jabba cooperates to release Solo."}, {"tag": "p", "text": "Lando Calrissian, noticing Boba Fett drawing his weapon, knocks him aside, sending his shot into Leia's elbow, accidentally activating the thermal detonator."}, {"tag": "p", "text": "As the crowd scatters, Fett takes the carbonite block of Han Solo away and Leia and Chewbacca chase after him. Leia attempts to stop him, but is unsuccessful, one shot accidentally hitting the block's control panel and two other shots missing him. With no other option, she, Lando, and Chewbacca escape the palace shortly before it blows up when the thermal detonator goes off; C-3PO is destroyed in the explosion and Jabba, Bib Fortuna, and Salacious Crumb are killed. Boba Fett brings Solo aboard the Slave I and flees Tatooine."}, {"tag": "p", "text": "Commandeering the Khetanna, they meet with Luke and R2-D2 in the desert and decide to search the local smuggler hangouts in order to find out where Fett has gone. Luke promises Leia that he will find Han."}, {"tag": "p", "text": "Onboard the second Death Star, Darth Vader meets the arriving Emperor Palpatine, who orders Vader to stay near him, as events have not been going the way he has envisioned them recently."}, {"tag": "p", "text": "On Tatooine, Luke is able to get a lead on Boba Fett's whereabouts.\nOn Dagobah, the near-dead Yoda converses with Obi-Wan Kenobi, who assures him that Luke will arrive. But it is not to be, and Yoda passes into the Force. Palpatine, Vader and Luke feel this at the same time, Luke departing Tatooine to head to Dagobah to find out what happened, while Palpatine orders Vader to do the same."}, {"tag": "p", "text": "Arriving on Dagobah, Luke finds that Yoda has died. But both Yoda and Obi-Wan appear before him. The ghosts confirms Vader's claim that he is Luke's father and reveals that Leia is Luke's sister. They tell him that he must face Vader. When Luke refuses, they say that if he cannot, then Leia must. Luke, not willing to risk her life, finally agrees. Realizing that he has to confront Vader on his own, Luke has R2 record a message for Leia, send a message to the Rebellion."}, {"tag": "p", "text": "Meanwhile, Leia, Chewbacca and Lando have tracked Boba Fett to an unidentified forested planet on the Outer Rim Territories, where he intends to deliver the carbonite block of Han back into Imperial hands. Leia and the others managed to prevent this, killing Fett in the skirmish. They then leave the planet (with Leia piloting Slave I) and head to the Rebel rendezvous at Sullust."}, {"tag": "p", "text": "Departing Dagobah, Luke is captured by a Star Destroyer and transported to the Second Death Star in orbit over Endor and is brought before the Emperor. Palpatine reveals to Luke that he knows that Luke hopes that his friends will not come to rescue him, then showing him what they will expect when they do arrive: a massed Imperial fleet."}, {"tag": "p", "text": "On the Home One, Han is finally unfrozen from the carbonite. However, the medics tell Leia that due to the long period of carbon freeze and damage to the controls, it is unlikely that he will ever be able to regain his eyesight. Lando then prepares the Falcon for an assault on the second Death Star that is scheduled to commence when the station's energy shield is destroyed by a Rebel unit on Endor's moon. Asked to come to the war room by Mon Mothma and before the fleet leaves for Endor, the group listens to Luke's message, saying that Leia is his sister and that Vader is their father. They also find out that he has been captured and taken to the Death Star and that no rescue attempt is to be made."}, {"tag": "p", "text": "Meanwhile, a team inserted onto Endor make their way into the shield generator bunker. Suddenly, a massive group of stormtroopers and AT-ST's arrive, forcing the remainder of the troops to attack."}, {"tag": "p", "text": "Back onboard the Home One, Leia steals Slave I and heads for the Death Star on the Endor system to try and rescue Luke. Left with no other option, the entire fleet enters hyperspace and follows her. Han realizes what has happened and asks Lando if he can accompany him and Chewbacca on the Falcon."}, {"tag": "p", "text": "Arriving on the Death Star via Gate C-23, Leia fights her way past the guards, but is eventually subdued and brought before Palpatine. She arrives in time to watch as the Alliance fleet arrives and is ambushed by the waiting Imperial fleet while waiting for the ground assault team to destroy the shield generator. The Battle of Endor has begun!"}, {"tag": "p", "text": "On the forest moon, the fighting between the Rebels and Imperials draws close to Bright Tree Village, upsetting the Ewoks there. As the Rebels make a suicide attack on the shield bunker, the Ewoks spring into action, attacking both sides."}, {"tag": "p", "text": "With the shield generator damaged, the Falcon heads for the moon's surface and, with a still blind Han taking Chewbacca's place in manning the quad turrets after Chewbacca is injured by pursuing TIE fighters, they take out the shield generator dish. Wedge Antilles leads several X-wings inside the Death Star, where they destroy the main reactor. Lando takes the Falcon back to the Death Star to rescue Luke and Leia."}, {"tag": "p", "text": "Onboard the Death Star, Palpatine orders Vader to kill Leia, but is stopped by Luke, who engages in a lightsaber duel. Vader overpowers Luke with the Emperor telling him to join them or die. Leia attempts to intervene, but is subdued by Force Lightning from the Emperor. Not swayed by the Emperor proposal, Luke reveals to Vader that he and Leia are both his children. Vader is stunned by the revelation but says it is too later for him allowing Luke and Vader's duel to continue. Vader is overpowered by Luke, losing an arm in the process. But still, the Dark Lord is powerful enough to drive Luke to his knees. Luke boldly declares that he will not fight Vader anymore, and says that if he wants to strike both him and Leia down, he should do so now. Instead, Vader falls to his knees and starts to beg forgiveness, causing him to turn from the dark side of the Force and become Anakin Skywalker once again."}, {"tag": "p", "text": "Suddenly, the station is rocked with a huge explosion. As the station's crew begin to evacuate, the Emperor escapes, Luke and Leia, carrying their wounded father, make their way to the hangar bay, where Lando and the Falcon awaits them. The entire group makes it off the station before its destruction."}, {"tag": "p", "text": "Shortly thereafter, the entire group meets onboard the Home One. Although the Death Star has been destroyed, Luke informs Mon Mothma that Palpatine has disappeared and is still a threat. The heroes, including a redeemed Anakin Skywalker (a Jedi once more and now clad in an all-white version of the life-support suit he wore as Vader), agree to help the Rebels to hunt him down, with Luke saying the Emperor doesn't stand a chance."}, {"tag": "h2", "text": "Parallels to the original story"}, {"tag": "p", "text": "The Infinities story included a few \"tongue-in-cheek\" references to the original version of Star Wars: Episode VI Return of the Jedi:"}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Movies Infinities"}]}