{"url": "Battle_at_TFP-9", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Chommell sector"], "nodes": [{"tag": "h1", "text": "Battle at TFP-9"}, {"tag": "p", "text": "A battle took place near the Station TFP-9 in the Naboo system in 33 BBY. Pirate forces attacked the station prompting Naboo's Royal Fighter Corps to intervene. What they weren't aware was that the attack was a ploy in an attempt to steal their starfighters."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 33 BBY Agamar Governor Challep was seeking out ways to bolster his planets defences, in particular his starfighter contingency. To that end he purchased technology related to fighters and weapons, including Droid starfighters from Xi Char. His sights were then set on Naboo's N-1 Starfighters and on at least three occasions he attempted to purchase them as well as N-X Police Cruisers. But Queen Amidala's Advisory Council declined all the attempts."}, {"tag": "p", "text": "Insisting on studying the prospects of the starfighters, he managed to contact Dren Melne, a Naboo born mercenary and seasoned pilot who had developed a strong contempt for his home thanks to his family. Eventually a \"demonstration\" was prepared and Station TFP-9 was the target."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Early stages"}, {"tag": "p", "text": "The station was attacked by a raiding squadron of Z-95 Headhunters and a Hornet-class carrier. The Station's defences at the time were in the middle of an upgrade and two YT-1250 freighters were present at the attack and they weren't able to defend it on their own as sure enough one was disable and the other was gone, presumably destroyed, and the station's shields were being strained."}, {"tag": "h3", "text": "Naboo Responds"}, {"tag": "p", "text": "Naboo then sent two N-1 fighters from Bravo Flight with Dren Melne as Bravo Eight and Essarra Till, his lover and wingman as Bravo Seven. 12 N-X Police Cruisers under Echo Flight with Rhys Dallows as Echo Five were also dispatched. After Till hailed the Z-95s to order a ceasefire the fighters responded by engaging the two flight groups. Till would manage to shoot one down while Echo flight managed to handle the rest with minimal damage. Till then assigned Echo One and Two to join up with her on an attack run to the carrier when another squadron of Z-95 Headhunters, armed with Concussion missiles and a second carrier under the command of Captain Sorran of the Velumina arrived ordering that the Naboo fighters power down and surrender their fighters, during this the first carrier then deployed Droid starfighters."}, {"tag": "h3", "text": "Dren's Betrayal"}, {"tag": "p", "text": "It was at this point in battle, Dren Melne revealed that his loyalties were with Sorran's employer, and Melne broke of formations and attacked both Echo's One and Two. He managed to shoot down Two, causing it to collide with Echo one and destroy the pilot's Astromech droid, Dren continued his pursuit and was toying with Echo one in an effort to force Essara Till to surrender. Till pursued Dren trying to lock him on with her proton torpedoes but was then attacked by three of the Droid fighters, damaging her systems, while the rest engaged Echo flight. Till didn't stand down though and managed to destroy one of the droid pursuers. When she managed to regain her composure she found Dren engaging Echo flight and disabled both Echo Eight and Seven, while Echo's Four, Nine, Eleven and Twelve were destroyed by the Droid Fighters."}, {"tag": "h3", "text": "Unexpected turnaround"}, {"tag": "p", "text": "Realizing that this was a losing battle she ordered her forces to surrender, but instead of following suit she then went straight for the first carrier and despite being pursued by the droid fighters and the firepower of the capital ship, managed to drain the carrier's shields with her torpedoes, despite hers being drained as well by laser fire. Soon she was joined by Rhys Dallows who shot down a droid fighter, stating that he couldn't comply with the order. The two joined together and after Till took out the shield generator both fighters conjoined a missile attack that destroyed the first carrier. Turning their attention to Dren Melne, who was engagning Echo Six, it was there that Dren destroyed Echo Six, killing the pilot."}, {"tag": "h3", "text": "Dren's death"}, {"tag": "p", "text": "As the remaining Z-95s and Melne were heading back to the second carrier with both Rhys and Essara in pursuit, Till had just launched her last pair of torpedoes at Dren Melne when Captain Sorran informed Melne that this exercise has been deemed a failure and launched multiple missiles, one of each at Rhys and Till and the rest at Dren who had just intercepted Till's torpedoes. Dren protested about his deal and offered his own fighter, which Sorran counter argued about his pursuers could still disable his fighter and even if he did jump to lightspeed his fighter could still be traced. Till only managed to shoot down four of the missiles before one managed to strike her ship and cripple it, while at least eight missiles struck Dren's ship, destroying it and killing Dren."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although a victory for Naboo, the battle took a particular heavy toll for the Royal Space Fighter Corps as only five of Echo Flight's twelve pilots survived the skirmish. A memorial and planet wide day of remembrance was planned as a result."}, {"tag": "p", "text": "Within five days, Senator Sio Bibble debriefed Till and Rhys with Ric Olié about their investigations. Governor Challep denied his people's involvement in the incident, although an investigation revealing his recent purchases as well as the attempted purchases of the N-1 starfighters and police cruisers could imply otherwise. Investigations into Dren revealed that he received one hundred thousand credits on Ord Mantell which was transferred to Selton but couldn't trace the origins. After an inquiry to Dren's family was met with hostility, they concluded to have reached dead ends. Till felt that Dren's family was the core reason for his betrayal as where she was met with open arms after returning, Dren was exiled in response to his pursuit as a mercenary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}