{"url": "Star_Wars_Insider_150", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars Insider 150"}, {"tag": "p", "text": "Star Wars Insider 150 is the 128th issue of the magazine Star Wars Insider and the 58th published by Titan Magazines. The issue focuses on the LEGO Star Wars sets and video games, and also has updates on Star Wars: Episode VII The Force Awakens. Two newsstand edition covers feature a LEGO Han Solo and two LEGO clone trooper minifigures, while the comic store exclusive edition features a LEGO Obi-Wan Kenobi minifigure. It was released on June 10, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In this special 150th issue of Star Wars Insider, original editor Dan Madsen recalls how the Insider began, and highlights some of the best features and interviews from the entire run. Plus, an exclusive guide to the final episodes of Star Wars: The Clone Wars and a special update on the next animated Star Wars spectacular: Star Wars Rebels — and maybe, just maybe, Episode VII The Force Awakens! We'll also be starting the first part of an exclusive look at the LEGO Star Wars phenomenon from brick to videogame to TV smash-hit, and exploring the amazing art that goes into creating Sideshow Collectibles' stunning Star Wars Mythos collection! Build your collection!"}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Features"}, {"tag": "h3", "text": "Departments"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Beginning with Star Wars Insider 150, Titan Magazines altered the issue number for the magazine's UK version to bring it in line with the US edition. The magazine's UK version had previously been numerically behind the US edition."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "All Star Wars Insider fiction beginning with the short story \"Blade Squadron,\" which began in Star Wars Insider 149 and culminated in Insider 150, are part of the new Star Wars canon."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}