{"url": "Star_Wars_Insider_58", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Magazine issue stubs", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars Insider 58"}, {"tag": "p", "text": "Star Wars Insider 58 is the fifty-eighth issue of Star Wars Insider magazine. It was released to newsstands on February 5, 2002."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Features"}, {"tag": "p", "text": "Joel Edgerton shows us what Uncle Owen was like before he became a grumpy old man."}, {"tag": "p", "text": "Bonnie Piesse talks about inhabiting the role of Luke Skywalker's Aunt Beru and how visiting Tatooine is far more daunting than working at the circus."}, {"tag": "p", "text": "Most fans know Billy Dee Williams as the smooth Lando Calrissian, but there's far more to the creative talents of this veteran actor."}, {"tag": "p", "text": "The new Star Wars trading card game includes an early look at images from Attack of the Clones."}, {"tag": "p", "text": "A legion of fans prefer the glorious Empire to the scrappy Rebellion, at least when it comes to making a fashion statement."}, {"tag": "h3", "text": "Departments"}, {"tag": "p", "text": "Counting blue ghosts, defending sneaky Jedi, and championing heroic handmaidens. Don't you people have jobs?"}, {"tag": "p", "text": "From the trailers to pick-up shots, Producer Rick McCallum reports on the final phases of Attack of the Clones."}, {"tag": "p", "text": "Jedi as a religion, trailer mania, star sightings, and more."}, {"tag": "p", "text": "How a Toydarian junk dealer came to life in The Phantom Menace."}, {"tag": "p", "text": "The Star Wars Roleplaying Game gets more than a facelift in a revised and expanded edition."}, {"tag": "p", "text": "After the tragic events of Star By Star, Elaine Cunningham takes Jaina Solo on a The New Jedi Order: Dark Journey."}, {"tag": "p", "text": "Jango Fett and Zam Wessell, together again for the first time."}, {"tag": "p", "text": "The dirtiest jobs the Rebellion ever faced."}, {"tag": "p", "text": "How much is George's autograph really worth?"}, {"tag": "p", "text": "Test your knowledge of the Mos Eisley cantina."}, {"tag": "p", "text": "New innovations in magazine technology provide actual answers to your Star Wars questions."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}