{"url": "Star_Wars_Insider_60", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Magazine issue stubs", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars Insider 60"}, {"tag": "p", "text": "Star Wars Insider 60 is the sixtieth issue of Star Wars Insider magazine. It was released to newsstands on June 4, 2002. This issue came packaged with promotional trading cards for the Wizards of the Coast Attack of the Clones trading card game and the Topps Attack of the Clones silver foil-stamped movie card set, while the newsstand version was available in an exclusive polybag. It's also the last issue to feature the writing of longtime contributor (and former Managing Editor) Scott Chernoff, who left to pursue a career in writing for television."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Features"}, {"tag": "p", "text": "A picture's worth a thousand words, but nobody can read a movie that vast. Here's some of what you might have missed from the first dozen times you watched Attack of the Clones."}, {"tag": "p", "text": "Ewan McGregor has made the role of Jedi Knight Obi-Wan Kenobi his own. The star discusses heroic dismemberments, fake mullets, and memorable lines."}, {"tag": "p", "text": "Queen, senator, clothes horse, temptress, and battle droid butt-kicker, Padmé Amidala is a woman of many talents, and it takes a talented actress to bring her to life."}, {"tag": "p", "text": "Anakin Skywalker is mad, bad, and dangerous to know. Luckily, Hayden Christensen has only two things in common with the character he portrays: he's tall and exceptionally talented."}, {"tag": "p", "text": "George Lucas shares his thoughts on the history of the Star Wars saga, strange twists of fate, and a glimpse of the future."}, {"tag": "p", "text": "Take a peek at the novelization, and feast your eyes on some fantastic images from the film."}, {"tag": "p", "text": "Sneaky, faithful, or just plain deadly, the droids of Attack of the Clones come in all shapes and sizes."}, {"tag": "p", "text": "That Mos Eisley cantina was a children's theme park compared to this den of scum and villainy."}, {"tag": "p", "text": "We take a look at what's in the cards for recent and upcoming Star Wars collecting."}, {"tag": "p", "text": "Maybe you recognize him as Dr. Frederick Childon or Vice Principal Scott Guber, but Anthony Heald has more Star Wars acting credits than anyone who appeared in the movies."}, {"tag": "h3", "text": "Departments"}, {"tag": "p", "text": "Your praise, your corrections, your requests. Why does it always have to be about you, anyway?"}, {"tag": "p", "text": "Harry Potter, Monsters Inc., Ice Age . . . we know you saw them just for the Star Wars previews."}, {"tag": "p", "text": "Don't lose your place in line when the new toys arrive."}, {"tag": "p", "text": "The new figures have arrived, but they're only the first in a relentless assault on a store near you."}, {"tag": "p", "text": "What they lack in accuracy they made up in sheer numbers. Learn how the wizards at Industrial Light & Magic created an army of battle droids."}, {"tag": "p", "text": "Spin the wheel, roll the dice, and choose your destiny."}, {"tag": "p", "text": "Read about Anakin Skywalker's life before Attack of the Clones, then follow Boba Fett's life afterward."}, {"tag": "p", "text": "You know Boba Fett's origin now, but what do you know about his father? Jango Fett: Open Seasons reveals the bounty hunter's dark origins."}, {"tag": "p", "text": "Not since Mommy Dearest has a hanger been this important to a movie. It's a hangar, you say? Now we get it!"}, {"tag": "p", "text": "Don't worry, we aren't going to touch your Episode II stuff, so put the lightsaber down, slowly. . . ."}, {"tag": "p", "text": "We think there's a hidden message in this one somewhere."}, {"tag": "p", "text": "Walking brains and backward alphabets explained."}, {"tag": "p", "text": "The poster. 'Nuff said?"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}