{"url": "Star_Wars_Insider_46", "categories": ["Category:Real-world articles", "Category:Magazine issue stubs", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars Insider 46"}, {"tag": "p", "text": "Star Wars Insider 46 is the forty-sixth issue of Star Wars Insider magazine. It was published in October 1999."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Features"}, {"tag": "p", "text": "Liam Neeson, Samuel L. Jackson, and Jake Lloyd sat down for brief Q&A sessions with the Insider right after they first saw The Phantom Menace. Find out how the Jedi judge the final product—and discover their new hopes for Episode II."}, {"tag": "p", "text": "Never-before-published photos! Take a look at the \"home movie mockumentary\" made by Return of the Jedi's assistant director during the 1982 filming of Jedi that stars Warwick Davis, along with hilarious cameos from Mark Hamill, Harrison Ford, Carrie Fisher, and more!"}, {"tag": "p", "text": "Beautiful reproductions of the concept art that showed the look of The Phantom Menace are showcased in this exclusive excerpt from The Art of Episode I. From early Podracers to the intriguing Sith Witch, you won't believe your eyes!"}, {"tag": "p", "text": "Master, what's a bongo? It's a Gungan sub, of course, and it's just one of a new fleet of speeders, ships, and tanks that power the forces of good and evil in the first episode of the Star Wars saga. A revealing, in-depth overview from David West Reynolds, author of Star Wars: Episode I The Visual Dictionary."}, {"tag": "p", "text": "After four movies, two cartoons, innumerable commercials, and one \"Holiday Special\" as the beloved protocol droid C-3PO, Anthony Daniels is still going strong as one of the biggest stars in the Star Wars universe. The author of the Insider's Wonder Column tells Scott Chernoff what the part means to him, and where he hopes to take it in the future."}, {"tag": "h3", "text": "Departments"}, {"tag": "p", "text": "Our readers explore the dark side of Jar Jar Binks and Internet spoilers."}, {"tag": "p", "text": "Rick McCallum gears up for Episodes II and III."}, {"tag": "p", "text": "The stars turn out for Episode I's U.K. premiere; Indy invades video; Smithsonian show hits the road; Shmi Skywalker plays Jesus' mom; we go inside the digital projection booth; and much, much more."}, {"tag": "p", "text": "Admiral Ozzel—shlemiel or schlimazel?"}, {"tag": "p", "text": "Co-editor Paul Martin Smith brings balance to the film."}, {"tag": "p", "text": "An exclusive interview with Vector Prime scribe R. A. Salvatore; plus, we train our long range sensors on upcoming Star Wars books."}, {"tag": "p", "text": "All your Star Wars collecting questions answered, with renewed vigor."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}