{"url": "Star_Wars_Insider_43", "categories": ["Category:Real-world articles", "Category:Magazine issue stubs", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars Insider 43"}, {"tag": "p", "text": "Star Wars Insider 43 is the forty-third issue of Star Wars Insider magazine. It was published in April/May 1999. Three cover variants were available for issue 43: a newsstand version featuring Qui-Gon Jinn, a subscriber-exclusive version featuring Darth Maul, and a Previews Exclusive version similar to the subscriber version but with different coloring for the Star Wars Insider logo."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "This issue was published with two different covers and a Previews Exclusive cover."}, {"tag": "h3", "text": "Features"}, {"tag": "p", "text": "As Boss Nass, leader of the Gungans, actor Brian Blessed looms large over Episode I—even though we never see his real face. Blessed tells the Insider's Scott Chernoff who's the Boss."}, {"tag": "p", "text": "In the conclusion of our coverage of George Lucas' meeting with the Australian press, he talks about the origins of Star Wars, and the future of the saga."}, {"tag": "p", "text": "They're all here—from familiar frends like astromech (R2) droids and protocol droids (like C-3PO), to new foes like starfighter droids and Sith probes—it's an exclusive guide to the droids of The Phantom Menace from Daniel Wallace, author of Star Wars: The Essential Guide to Droids."}, {"tag": "p", "text": "They came, they saw, the conquered. Ryan Morris takes Insider readers inside the 1998 Decipher Star Wars Customizable Card Game Championship Tournament, where it really is how you play the game."}, {"tag": "p", "text": "From the model shop to the executive suite, meet the magnificent seven who have been with Lucasfilm from the first Star Wars movie through the latest. The Insider's Kevin Fitzpatrick tells us why they stayed in that galaxy far, far away."}, {"tag": "h3", "text": "Departments"}, {"tag": "p", "text": "Our readers count down the days to Episode I"}, {"tag": "p", "text": "You wanted it, you got it—12 pages of exclusive Phantom Menace photos! Meet the main characters of Episode I!"}, {"tag": "p", "text": "David Tattersail brings light to the Force."}, {"tag": "p", "text": "Ballantine launches Star Wars fiction's \"New Jedi Order\"; New Episode I trailer; Vanity Fair photo spread; new Saga arcade game; and much more."}, {"tag": "p", "text": "Ladies and gentlemen, the other Greedo."}, {"tag": "p", "text": "It's here—Dark Horse's official Episode I comic adaptation!"}, {"tag": "p", "text": "All your Star Wars collecting questions answered, with flair."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}