{"url": "Star_Wars_Kids_(1997)", "categories": ["Category:Real-world articles", "Category:Star Wars Kids"], "nodes": [{"tag": "h1", "text": "Star Wars Kids (1997)"}, {"tag": "p", "text": "Star Wars Kids was a magazine published by Scholastic from July 1997 to February 1999. It was home delivered as a supplement to the subscription to Star Wars Missions, with a new issue each month. There were twenty issues in total, with each one highlighting a certain character from the Original trilogy and a planet from either the films or the Expanded Universe."}, {"tag": "h2", "text": "Regular features"}, {"tag": "h3", "text": "Brain Blasters"}, {"tag": "p", "text": "A quiz, comprising approximately fifteen questions, all to do with the Original trilogy and the Expanded Universe."}, {"tag": "h3", "text": "Star Wars Kids Talks To…"}, {"tag": "p", "text": "An interview with an actor portraying the selected character of the month, be it Mark Hamill for the Luke Skywalker issue, Harrison Ford for the Han Solo issue, or David Prowse, James Earl Jones and Sebastian Shaw for the Darth Vader issue."}, {"tag": "h3", "text": "Space Science"}, {"tag": "p", "text": "This section contained educational information about real-world space and compared it to a location or item in the fictional Star Wars universe."}, {"tag": "h3", "text": "Who Is That Alien?"}, {"tag": "p", "text": "Two fact files about a certain alien species, seen either in the films or the EU."}, {"tag": "h3", "text": "On Our Planet"}, {"tag": "p", "text": "A section comparing a climate on Earth with one of the planets from the Star Wars universe."}, {"tag": "h3", "text": "Yoda's Puzzle Pages"}, {"tag": "p", "text": "This section consisted of crosswords and wordsearches that were related to the Star Wars universe."}, {"tag": "h3", "text": "Star Wars Missions Bonus Page"}, {"tag": "p", "text": "This page would be a supplement to the roleplaying game found in the Star Wars Missions scenario. To play this properly, the user would require the equipment delivered with the Star Wars Missions starter pack."}, {"tag": "h3", "text": "A-Maze-Ing Universe"}, {"tag": "p", "text": "A maze for readers to play though that would usually relate to the selected planet for the month."}, {"tag": "h3", "text": "Comic"}, {"tag": "p", "text": "Each issue would contain one-fifth of a complete short comic story. There were four comics in total: The Rebel Thief, X-Wing Marks the Spot, Imperial Spy, and \"Death Star Pirates\". There was also a short comic called The Gambler's Quest in Issue #12."}]}