{"url": "Star_Wars_Jedi:_Fallen_Order", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:2019 computer and video games", "Category:Canon computer games", "Category:Canon console video games"], "nodes": [{"tag": "h1", "text": "Star Wars Jedi: Fallen Order"}, {"tag": "p", "text": "Star Wars Jedi: Fallen Order is a canon single-player video game that was developed by Respawn Entertainment. It was released by Electronic Arts on November 15, 2019. The game tells an original story about Cal Kestis, a surviving Jedi Padawan, five years after the events of Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "From Respawn Entertainment comes a brand-new action adventure game which tells an original Star Wars story about Cal Kestis, a Padawan who survived the events of Star Wars: Revenge of the Sith. Play, and become a Jedi."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Escape from Bracca"}, {"tag": "p", "text": "Around 14 BBY, five years after the end of the Clone Wars, former Jedi Padawan Cal Kestis works in a junkyard on the planet Bracca scrapping ships from the Clone Wars, but is forced to use his Force powers to save his friend Prauf during an accident. Unbeknownst to them, the event was captured by a nearby Imperial probe droid which transmits the footage to the Galactic Empire, revealing Cal's true identity to the Imperials. The Empire dispatches two Inquisitors trained by Darth Vader, the Second Sister and the Ninth Sister, to take down Kestis. While being pursued by the Second Sister, who kills Prauf, Cal is rescued by Cere Junda and Greez Dritus, and flees Bracca aboard Greez's ship, the Mantis. Cere tells him she is a former Jedi and knew Cal's Jedi Master, Jaro Tapal."}, {"tag": "h3", "text": "Discovering the Zeffo"}, {"tag": "p", "text": "Cere takes Cal to the planet Bogano where an ancient vault is located, and hopes that Cal can open it. On the way to the Vault, Cal befriends a small droid named BD-1, which shows him a message from Cere's former Master, Eno Cordova. Cordova's message reveals that the Vault was built by an ancient civilization called the Zeffo, and that he hid a Jedi holocron containing a list of the locations of Force-sensitive children inside; Cere believes this list could be the genesis of a restored Jedi Order that can topple the Empire. However, the only way to access it is to follow Cordova's path and pass his tests."}, {"tag": "p", "text": "The only leads Cal has are the location of the Zeffo homeworld, and a tomb on the planet Dathomir. On Zeffo, they find a clue that the Zeffo had contact with Kashyyyk, meaning Cordova's contact there, the Wookiee chieftain Tarfful, may have information about them."}, {"tag": "h3", "text": "Journey to the Origin Tree"}, {"tag": "p", "text": "On Kashyyyk, Cal teams up with Saw Gerrera and his Partisans to fight the Imperial occupation forces enslaving the native Wookiees. Unable to find Tarfful, Cal returns to Zeffo to investigate a tomb when he encounters the Second Sister again. The Second Sister reveals that she was Cere's Padawan, Trilla Suduri, who was captured by the Empire when Cere betrayed her location under torture. She warns Cal that Cere will inevitably betray him before retreating. Cal learns that he needs to find a Zeffo Astrium to unlock the Vault before he is knocked out and captured by a bounty hunter."}, {"tag": "p", "text": "When Cal wakes up, he is forced to fight in a gladiatorial arena at the whims of crime lord Sorc Tormo. He is rescued by Cere and Greez, and Greez apologizes since Sorc kidnapped Cal due to his gambling debts. They then receive a communication that Tarfful is willing to speak to Cal, and they return to Kashyyyk. Tarfful instructs Cal to seek answers on top of Kashyyyk's Origin Tree. There, he finds another recording of Cordova telling him that an Astrium can be found on Dathomir, but he is then attacked by the Ninth Sister. Cal defeats the Inquisitor and makes his way to Dathomir."}, {"tag": "h3", "text": "Trials on Dathomir"}, {"tag": "p", "text": "Upon landing, Cal's progress is immediately impeded by the Nightsister Merrin, who blames the Jedi for the massacre of her people during the Clone Wars, and does everything in her power to keep him away. After experiencing a flashback where he remembers Jaro sacrificing himself to protect him from the clone troopers during the Purge, Cal is attacked by Jaro's spirit, resulting in his lightsaber being destroyed."}, {"tag": "p", "text": "Cal then encounters another former Jedi, Taron Malicos, who sought to learn the power of the Nightsisters and manipulated them against the Jedi. Malicos offers to teach Cal how to handle the dark power of Dathomir against Merrin's wishes. Cal refuses and flees Dathomir when Merrin attacks. Cere admits that when she learned Trilla became an Inquisitor, she briefly fell to the dark side, which is why she had cut off her connection to the Force."}, {"tag": "p", "text": "They then travel to Ilum to find a kyber crystal so Cal can build a new lightsaber. Returning to Dathomir, Cal faces Jaro's spirit again, defeating him by overcoming his feelings of guilt over his death. Malicos again attempts to sway Cal to the dark side, and he attacks when Cal refuses. Merrin helps Cal defeat Malicos, and he is able to convince her to join the Mantis crew."}, {"tag": "h3", "text": "Recovering the holocron"}, {"tag": "p", "text": "The crew returns to Bogano, and Cal uses the Astrium to unlock the Vault and reveal the holocron. Trilla manages to steal the holocron and escape. Cere reassumes her position as a Jedi Master and grants Cal the rank of Jedi Knight. They proceed to assault the Inquisitor headquarters on Nur, where Cal is able to defeat Trilla and recover the holocron."}, {"tag": "p", "text": "Cere attempts to make amends with Trilla, but Darth Vader intervenes and kills Trilla for her failure. Cal and Cere barely evade Vader and escape the fortress. Cere falls unconscious from using all of her power to delay Vader, and Cal attempts to drag her to the surface of the lake, but he fails in doing so and is doomed to drown. Luckily, Merrin intervenes and saves them from drowning. With the holocron now in their possession, the crew wonders what they should do with it. Realizing that gathering the Force-sensitive children would only make it easier for the Empire to target them, Cal destroys the holocron, deciding that their fates should be left up to the Force before asking where they should go next."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Star Wars Jedi: Fallen Order is a third-person action-adventure video game with a single-player story. Game director Stig Asmussen, known for directing God of War III, has described the game as having \"thoughtful combat, agile exploration, and Metroidvania level design.\""}, {"tag": "p", "text": "The game features four difficulty settings: Story Mode, Jedi Knight, Jedi Master, and Jedi Grand Master. The difficulty setting impact statistics such as parry timing, incoming damage, and enemy aggression."}, {"tag": "p", "text": "On May 4, 2020, Respawn Entertainment released a free content update for all platforms that gives players a chance to fight any enemy in the battle grid mode and also adds the combat challenges mode, where you fight through waves of enemies. Along with this, they also released the New Journey+ ability which enables players to play through the story with cosmetics from previous playthroughs."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "According to Asmussen, Star Wars Jedi: Fallen Order began as a non–Star Wars game and was adapted into the series after various individuals at Electronic Arts (EA) saw footage of early development. When his team first met with Lucasfilm, the company was not interested in a Jedi-centered game; the developers then had to work to create a story that would justify the use of Jedi. The game was first announced on May 4, 2016, and its title was revealed during the E3 press conference on June 9, 2018. An exclusive first look at Star Wars Jedi: Fallen Order debuted on April 13, 2019 during Celebration Chicago. Motion capture for the game has depicted a duel between a Jedi and a foe with a red lightsaber."}, {"tag": "p", "text": "Merchandise for the game debuted as part of Triple Force Friday, which was held on October 4, 2019. and the game was released on November 15, 2019. Pre-ordering the game included an orange lightsaber blade, a unique skin for BD-1, a Mygeeto Campaign lightsaber hilt, and an Umbaran Campaign lightsaber hilt. (These cosmetic items were later released to all players). Fortnite Battle Royale released a stormtrooper skin that was available for free with purchase of the game from the Epic Games store."}, {"tag": "p", "text": "A book titled The Art of Star Wars Jedi: Fallen Order was published on November 19, 2019 by Dark Horse Comics."}, {"tag": "h2", "text": "Music"}, {"tag": "p", "text": "Stephen Barton and Gordy Haab composed the score for Jedi: Fallen Order. In addition, segments of music from the Star Wars saga composed by John Williams was incorporated into the game. An original soundtrack was digitally released on August 21, 2020."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "A comic book miniseries called Star Wars: Jedi Fallen Order - Dark Temple debuted in September 2019, and serves as a prequel to the game."}, {"tag": "p", "text": "According to Matt Martin of the Lucasfilm Story Group, some hints at Star Wars Jedi: Fallen Order were included in the 2017 comic book series Star Wars: Darth Vader: Dark Lord of the Sith. These connections include the Ninth Sister, the Purge Troopers, and the Second Sister, which first appeared in the series' sixth, thirteenth, and nineteenth issues, respectively."}, {"tag": "p", "text": "In both Star Wars Jedi: Fallen Order and the comic book Jedi Fallen Order - Dark Temple 1, the Second Sister pilots a TIE/IN interceptor. This seemingly retcons information from the reference book TIE Fighter Owners' Workshop Manual, which states that TIE interceptors were not produced until 3 BBY."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "The game received positive reviews from critics. On the review aggregation website Metacritic, the game for PC holds a score of 81 out of 100, based on thirty-two critics, indicating \"generally favorable reviews.\" Some critics considered the game an improvement over EA's previous Star Wars games, and some critics praised its combat system. Dan Stapleton from IGN gave the game a 9/10, stating that \"Star Wars Jedi: Fallen Order makes up for a lot of lost time with a fantastic single-player action-adventure that marks the return of the playable Jedi.\""}, {"tag": "p", "text": "In an EA earnings call for the period ending on March 31, 2020, company CEO Andrew Wilson commented on the success of Star Wars Jedi: Fallen Order, referring to the game as the first title in a new franchise."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}