{"url": "Battle_between_the_Malevolent_and_the_Endeavor", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Imperial Fleet Operation: Clean Sweep", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle between the Malevolent and the Endeavor"}, {"tag": "p", "text": "The battle between the Malevolent and the Endeavor, also known as the frigate duel—Malevolent vs. Endeavor, was a space battle between the Alliance to Restore the Republic and the Galactic Empire noted for its level of power parity."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "An Imperial EF76 Nebulon-B escort frigate, the Malevolent, and a Rebel EF76 Nebulon-B escort frigate, the Endeavor, engaged one another at range in deep space. Each frigate deployed its starfighter complement: TIE interceptors, bombers, and fighters from the Malevolent, A-wings, Y-wings, and Z-95s from the Endeavor. The commanders of both frigates tasked their faster starfighters (the TIE interceptors and A-wings) with intercepting and shooting down the starfighter craft and warheads of the enemy strike force (the TIE bombers and Y-wings), which had been given the mission of assaulting the enemy capital ship. Half of each complement of starfighters consisted of space superiority fighters (the TIE fighters and Z-95 Headhunters), which were ordered to escort their respective strike forces."}, {"tag": "p", "text": "The commander of the Malevolent knew that the Emperor's Eagles, an elite starfighter squadron equipped with TIE Avengers and Assault Gunboats, were lying in wait nearby. In the mission briefing for the Imperial pilots, the prospect of the Eagles swooping in to save the day (and promptly taking all the credit) was dangled as incentive for the fighter jockeys to accomplish their missions quickly and with minimal losses. Similarly, although the commander of the Endeavor was aware that elements of Rogue Squadron, the elite Rebel group, could reach the scene of the battle in time to play a decisive role, the mission briefing for Rebel personnel belied his feeling that it would be rather embarrassing for his crew and pilots to force the Rogues to show up and help win a mathematically even battle for them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Frigate Duel – Malevolent vs. Endeavor\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side, both sides have conflicting mission objectives, and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Imperial Fleet Operation: Clean Sweep, using the default craft assigned to the player."}, {"tag": "p", "text": "Eagle Squadron will enter the battle as reinforcements either in TIE Avengers or Assault Gunboats. Rogue Squadron will enter the battle as reinforcements either in A-wings or X-wings."}, {"tag": "p", "text": "The frigate duel served to contrast the naming philosophy behind many Imperial ships as opposed to many Rebel ships. Imperial ships were often named, as was the Malevolent, for emotions or actions commonly characterized as antagonistic, tyrannical, or negative. (Other examples include the Accuser, the Rage, and the Dominator. Rebel ships were often named, like the Endeavor, for emotions or actions signifying benevolence, boldness, or positivity. (Other examples include the Liberty, the Emancipator, and the Equity.)"}, {"tag": "h2", "text": "Appearances"}]}