{"url": "Battle_droid", "categories": ["Category:Canon articles", "Category:Battle droid models", "Category:Battle droids"], "nodes": [{"tag": "h1", "text": "Battle droid"}, {"tag": "p", "text": "Battle droids, also known as combat droids, clankers, droid soldiers, or battle bots, were a type of droid designed for combat. Over the years, many different models of battle droid were being utilized by various factions throughout the galaxy. One such faction was the Confederacy of Independent Systems, which used a number of different models of battle droid during the Clone Wars to make up the Separatist Droid Army. Under the command of General Grievous, varying models of battle droids fought against the Galactic Republic's clone troopers until the final days of the war, when the Confederate battle droids were deactivated by the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems used a variety of battle droids in their droid army. These droids, including B1-series battle droids, which were the main infantry of the Separatists, B2-series super battle droids, and droidekas, were produced in large factories on planets such as Geonosis. The Separatist Droid Army was lead by the Kaleesh cyborg General Grievous. Droids like the B1 battle droid were ineffective in small numbers, but they had the ability to overwhelm enemies in large groups. Battle droids were led by commanders such as Grievous or Asajj Ventress, and organic officers could be assisted by specialized OOM command battle droids. T-series tactical droids and super tactical droids also commanded battle droids throughout the Clone Wars, and these units could assist organic leaders. One super tactical droid was Kalani, a general who led Confederate forces against insurgents on Onderon, but, after the Onderonian Civil War, Kalani escaped to Agamar."}, {"tag": "p", "text": "The main enemy of the battle droids were the clone troopers of the Galactic Republic. The troopers were able to think independently and creatively, while battle droids like the B1 were \"dim-witted\" and easily taken down by clones. However, the battle droids of the Separatists outnumbered the clones, and Count Dooku once claimed that clones were outnumbered one hundred to one. During the war, clone troopers, and even some of the Jedi, referred to battle droids by the nickname of \"clankers.\""}, {"tag": "p", "text": "The Chiss Ascendancy came to learn of the Clone Wars and that battle droids made up the majority of the Confederacy military; when Senior Captain Mitth'raw'nuruodo \"Thrawn\" recounted that information to sky-walker Che'ri, she questioned the tactical advantage of such a military, understanding that an enemy had the chance to deactivate droids upon accessing their controls and that their programming could be altered during an enemy incursion into a factory. Thrawn also noted that their intended programming may possess exploitable weaknesses, concluding that a desire to lessen deaths was useless if it resulted in losing the war."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "Although battle droids were outlawed by the Galactic Empire in the wake of the Clone Wars, companies such as Holowan Laboratories and Arakyd Industries were able to evade the ban by having their products reclassified as security droids. The galactic population's general distrust of fourth class droids and the failure of the dark trooper program helped to turn the Joint Chiefs away from using battle droids. Nevertheless, Instructor Pell Baylo felt that Galactic Emperor Sheev Palpatine expected his military personnel to obey orders as if they were mindless droids."}, {"tag": "p", "text": "Even during the early months of the Imperial Era, battle droids and other pieces of surviving Separatist equipment were considered useless in the face of Imperial technology, such as the Star Destroyers of the Imperial Navy. The smuggler Has Obitt believed that surviving CIS equipment, such as the remaining battle droids, would be dismantled or destroyed. Indeed, surviving battle droids were all authorized to be decommissioned, which really meant destroyed, in specialized decommissioning facilities on worlds like Corellia, although some surviving Separatist equipment was allowed to fall into the hands of anti-Imperial insurgents, which gave an excuse for the Imperial Military to take over legacy worlds."}, {"tag": "p", "text": "Battle droids remained active on Agamar due to the intervention of Kalani, who was able to block the deactivation order initiated by Darth Vader after he killed the Separatist leaders. When the Empire arrived on Agamar, Kalani was able to flee with several B1 battle droids."}, {"tag": "h3", "text": "Galactic Civil War and New Republic Era"}, {"tag": "p", "text": "Later, during the Galactic Civil War, Temmin Wexley owned a modified battle droid named Mister Bones who acted as a companion to him. After the rebellion on Akiva in 4 ABY, the two joined the New Republic and Wexley's mother Norra Wexley in the fight against the Galactic Empire. Mister Bones perished during the Battle of Jakku in 5 ABY."}, {"tag": "p", "text": "Around 9 ABY, an Imperial Remnant led by Moff Gideon continued upon the Empire's dark trooper program by successfully fielding several third-generation design Dark Troopers. Gideon's entire platoon of combat droids was destroyed by the Jedi Master Luke Skywalker during the second rescue of Grogu."}, {"tag": "p", "text": "One B1 battle droid, R0-GR, came to serve under the Resistance and write \"droidography,\" a guide to the various models of droids in the galaxy, to teach organics more about the droids they interacted with. R0-GR also stated that he was the last B1 battle droid, but he had learned of the existence of Mister Bones, and this led R0-GR to say that his statement might have not been entirely true."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}