{"url": "Star_Wars_Kirigami", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Arts and crafts books", "Category:Canon reference books", "Category:Journey to Star Wars: The Last Jedi"], "nodes": [{"tag": "h1", "text": "Star Wars Kirigami"}, {"tag": "p", "text": "Star Wars Kirigami is a canon activity book in which readers can create fifteen starship and vehicle models from the Star Wars saga films using the paper-cutting art of kirigami. It was written by Marc Hagan-Guirey and published by Chronicle Books on September 1, 2017, as part of Journey to Star Wars: The Last Jedi."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Celebrated paper artist and designer Marc Hagan-Guirey has applied his genius to the Star Wars galaxy in this book of 15 unique kirigami (cut-and-fold) ships featured in the saga's films. Ranging in difficulty from beginner to expert, each beautifully detailed model features step-by-step instructions and a template printed on cardstock—all that's needed are a utility knife, a cutting mat, and a ruler. Clear tips and guidance through the tricky stages help readers craft their own X-wing, Imperial Star Destroyer, Millennium Falcon, and a dozen more ships and vehicles, each accompanied by colorful and inspiring photographs of the final model on display (or ready for a jump to Hyperspace)."}, {"tag": "h2", "text": "Models"}, {"tag": "p", "text": "01. Pod Racer\n02. Armored Assault Tank (AAT)\n03. Republic Gunship\n04. \n05. Jedi Starfighter\n06. Republic Attack Cruiser\n07. Luke Skywalker's Landspeeder\n08. Sandcrawler\n09. T-47 Snowspeeder\n10. Millennium Falcon\n11. Star Destroyer\n12. X-wing \n13. Rey's speeder\n14. SF TIE Fighter\n15. TIE Silencer"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}