{"url": "Star_Wars_Miniatures", "categories": ["Category:Real-world articles", "Category:Legends miniatures games", "Category:Star Wars Miniatures", "Category:Wizards of the Coast"], "nodes": [{"tag": "h1", "text": "Star Wars Miniatures"}, {"tag": "p", "text": "Star Wars Miniatures is a fast-paced RPG-style game by Wizards of the Coast featuring miniature 34mm scale models of characters and vehicles from across the Star Wars saga. It was published between 2004 and 2010."}, {"tag": "h2", "text": "Collecting"}, {"tag": "p", "text": "For collectors, the underside of each model's base contains information on the set, rarity, and the model's unique number in the set. The models can also be used to represent created characters or non-playable characters (NPCs) in the Star Wars Roleplaying Game. Many of the miniatures have similar molds and base sizes to the unpainted figures found in Star Wars: Imperial Assault and some players choose to swap out the Fantasy Flight miniatures with the ones produced in the Wizards of the Coast Miniatures Game."}, {"tag": "p", "text": "For help with all the Characters (unique and non-unique, special abilities, Force powers, and commander effects), a resource has been created at SWMGamers under the Archives of the Jedi. This resource was developed by players and fans for assistance with rules of the game."}, {"tag": "h2", "text": "Gaming"}, {"tag": "p", "text": "The primary use, however, is with the special Star Wars Miniatures rules. This game pits two or more squads against each other in a quick and heated death-match scenario. Players will agree on a point total (100, 150 and 200 being the official standards) and create a squad that does not exceed the chosen point total for one of the following formats:"}, {"tag": "p", "text": "Once all players' squads are ready, the units are deployed on to a gridded map--typically on opposite sides. The map can be customized with terrain tiles that come with some sets and books. The units are \"activated\" two at a time during each \"phase\" of play. Players can choose to move a unit six grid spaces and attack (in either order), or move twelve grid spaces but not attack. In order to attack, players roll a twenty-sided dice (known as a d20) and add on their unit's attack bonus. If the combined total is greater than or equal to the defending unit's defense, the attack hits its mark and damage is dealt. The player/team that completely defeats all of their opponents, score enough victory points, or forces their opponents to forfeit, is declared the victor."}, {"tag": "p", "text": "In the game, the vast majority of characters have Special Abilities, which give unique gameplay options to the player in addition to both offensive and defensive resources. Special Abilities come in all different levels of effectiveness, some being game-breaking (or even game-ending) while others are rarely utilized at all."}, {"tag": "p", "text": "Also, Force-sensitive characters (Jedi, Sith, etc.) can have Force Powers. These powers are drawn on from the Force (represented in the game by spending Force points) and are usually more powerful than Special Abilities. However, like Special Abilities, some Force Powers are much more effective than others. These statistics and abilities are recorded on the unit's corresponding stat card. The card details a unit's faction, hit points (HP), defense, attack, special abilities, force powers, and other advanced information. The other side features a reference sketch used in the creation of the model."}, {"tag": "h2", "text": "Miniatures sets"}, {"tag": "p", "text": "Sixteen sets of miniatures have been released, though there is talk of another company buying the rights to the game and continuing the line. Each of the first ten sets contains sixty figures of varying rarity. Later sets, beginning with Clone Wars, contain forty figures:"}, {"tag": "p", "text": "The community of players has continued to release \"virtual\" sets. These sets consist of new cards/statistics that can be used with the existing miniatures from WotC. These community-developed cards can be used in tournaments sponsored by the player community. (As of June, 2011, the most active online communities for Star Wars Miniatures players are at www.bloomilk.com and www.swmgamers.com. Information about tournaments and the virtual sets can be found there.) Here are the virtual sets:"}, {"tag": "p", "text": "Apart from the standard sets, several non-random themed packs have been released:"}, {"tag": "h2", "text": "Ultimate Missions"}, {"tag": "p", "text": "The Ultimate Missions book series is a supplement for Star Wars Miniatures. One book is released for each expansion (including one that covers all eras) and includes scenarios, gameplay ideas, full maps, and terrain tiles to further expand the game's playability. However, due to poor sales, the Ultimate Missions series was discontinued shortly after the Revenge of the Sith set came out. Many online scenarios also utilize the maps and tiles found in these books. The three books are Ultimate Missions: Clone Strike, Ultimate Missions: Rebel Storm, and Ultimate Missions: Revenge of the Sith."}, {"tag": "h2", "text": "Star Wars Miniatures: Starship Battles"}, {"tag": "p", "text": "In 2006, Wizards of the Coast released a \"space battle\" version of Star Wars Miniatures. It is not backward-compatible with Star Wars Miniatures."}, {"tag": "h2", "text": "External links"}]}