{"url": "Star_Wars_Main_Title", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Star Wars Main Title"}, {"tag": "p", "text": "The \"Star Wars Main Title\" is the theme played at the beginning of every theatrically released Star Wars film so far and almost every other piece of Star Wars media (video games, TV series, etc.). The film scripts refer to this opening theme as \"war drums.\" It was composed by John Williams and performed by the London Symphony Orchestra. It quickly became one of the most recognizable theatrical motifs in the history of film."}, {"tag": "p", "text": "The \"Main Title\" segues directly into a piece created specifically for each film. These are: \"The Arrival at Naboo\" or \"Boarding the Federation Battleship\" (Star Wars: Episode I The Phantom Menace); \"Ambush on Coruscant\" (Star Wars: Episode II Attack of the Clones); \"The Revenge of the Sith\" (Star Wars: Episode III Revenge of the Sith); \"Rebel Blockade Runner\" (Star Wars: Episode IV A New Hope), which goes on to quote the ending of \"Mars\" from Gustav Holst's \"The Planets\"; \"The Ice Planet Hoth\" (Star Wars: Episode V The Empire Strikes Back); \"Approaching the Death Star\" (Star Wars: Episode VI Return of the Jedi); \"The Attack on the Jakku Village\" (Star Wars: Episode VII The Force Awakens). \"Main Title and Escape\" (Star Wars: Episode VIII The Last Jedi). \"Fanfare and Prologue\" (Star Wars: Episode IX The Rise of Skywalker)."}, {"tag": "p", "text": "The theme is described by John Williams as representing the ideas of heroism and adventure, both of which are prominent throughout the films. He used numerous musical phrases to accent certain steps in the hero cycle, depicting the tales of Luke Skywalker, the protagonist in the original trilogy. He used mainly brass to give the theme a majestic feel."}, {"tag": "p", "text": "The theme seems to appear in-universe during a celebration of Life Day, in which Princess Leia sings a tune similar to the theme."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "John Williams was referred to George Lucas by Steven Spielberg to be the composer of the score for Star Wars: Episode IV A New Hope (at the time just called Star Wars). When creating the main theme for the film, John Williams attempted to compose a piece with an \"idealistic, uplifting but military flare [sic] to it.\" He wanted the theme to mainly feature the strong brass section of the London Symphony Orchestra, as he himself played brass when he was young. He tried to set it in the most \"brilliant register of the trumpets, horns and trombones\" in order to have a \"blazingly brilliant fanfare\" at the start of the piece, and thus the score. He also did this in order to have the title contrast with the second theme which was more lyrical, adventurous, and romantic in style."}, {"tag": "h2", "text": "Symbolism"}, {"tag": "p", "text": "The \"Main Title\" is symbolic of many aspects of the Star Wars saga. The most prevelant of these would be the idea of heroism and adventure. The following phrases each represent a particular step toward heroism:"}, {"tag": "p", "text": "The theme is also used to represent the character Luke Skywalker in the original trilogy. However, due to the non-existence of Luke at the time, the theme is not used for this purpose in the prequel trilogy, neither in the sequel trilogy or in the Anthology films."}, {"tag": "p", "text": "The title is also referred to in the scripts as \"war drums\"."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "The \"Main Title\" starts off as a fast and rather complicated phrase for the brass. After the short intro, the theme goes into the most recognized melody, with the trumpets playing. The strings come in after the trumpet melody is played twice. The strings play a calmer, more peaceful melody before the brass comes back in with the main melody. The melody plays through twice before the strings finish the theme with a fast, diminuendoing phrase."}, {"tag": "h2", "text": "Similarities with other compositions"}, {"tag": "p", "text": "Many people claim that John Williams' scores for the Star Wars saga (mainly the Original Trilogy) are very similar to (or even plagiarized from) other composers' works. One such connection has been made between the \"Star Wars Main Title\" and the main theme from the Golden Age film \"King's Row\" by Erich Korngold. The two themes share similar melodies and orchestration, with the first eight notes being identical, though the last three in \"King's Row\" are played slower than in the \"Main Title\". The two melodies then go in different directions. The \"Star Wars Main Theme\" resembles many \"heroic\" melodies, such as the \"Siegfried Horn Call\" from Wagner's Ring Cycle. Sections of the motif can also be heard in Carl Nielsen's Fifth Symphony. Curiously, the London Symphony Orchestra, who recorded the Star Wars soundtrack, had recorded the first complete Nielsen Symphony cycle under Danish conductor Ole Schmidt just the year before Star Wars. Also of interest is the Paramount Pictures 'logo theme' which shares the first (and only) six notes of this theme in a faster, sped up version."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the Star Wars movies"}, {"tag": "p", "text": "The \"Main Title\" also occurs within the films themselves, notably: as a faster, dramatic variant in The Phantom Menace, when Qui-Gon Jinn and Obi-Wan Kenobi fight B1-Series battle droids aboard Saak'ak, when the CIS and Republic armies charge towards each other in Attack of the Clones, when Obi-Wan delivers Luke to Tatooine in Revenge of the Sith, during the chasm shootout in A New Hope, when Luke flees from the wampa in The Empire Strikes Back, when Luke fights Jabba the Hutt's henchmen over the sarlacc in Return of the Jedi, and again during Poe Dameron's trench run on Starkiller Base (part of Scherzo for the X-Wing's) in The Force Awakens."}, {"tag": "p", "text": "In Rogue One: A Star Wars Story even if there isn't an opening crawl, the theme is present during the appearance of C-3PO and R2-D2."}, {"tag": "p", "text": "Although the film lacks an opening crawl, the theme makes appearances in the score for Solo: A Star Wars Story. Notably, these appearances include the first appearance of the Millennium Falcon in the film, as well as the ship's escape from The Maw."}, {"tag": "h3", "text": "In the EU"}, {"tag": "p", "text": "In Star Wars: The Clone Wars (both the film and the TV series), a shortened version with an altered rhythm appears as the main title sequence. It also appears in the episode Slaves of the Republic when Anakin signals R2-D2."}, {"tag": "p", "text": "This theme is also played during the opening crawl of almost all Star Wars video games. Commonly they use the original version, segueing directly into \"Rebel Blockade Runner\". A notable exception is the opening crawl of Star Wars: TIE Fighter, which features a version of \"The Imperial March\"."}, {"tag": "p", "text": "The theme appears in all three of the LEGO Star Wars games as well as all four Battlefront games. It makes an appearance in Star Wars: Galactic Battlegrounds along with its expansion pack. The theme is also played in Star Wars: Jedi Knight: Dark Forces II and Jedi Outcast. Star Wars: Knights of the Old Republic and The Sith Lords contain the theme. The theme also makes an appearance in Star Wars: Jedi Starfighter, Star Wars: Starfighter, Star Wars: Rogue Squadron, Star Wars: Shadows of the Empire, and Star Wars:The Clone Wars. The title also appears in the The Clone Wars games Republic Heroes, Jedi Alliance, and Lightsaber Duels."}, {"tag": "p", "text": "The theme also appears in all the videogames published in 1970s and 1980s, but as many not connected notes."}, {"tag": "p", "text": "Leia Organa sings a song for the Life Day celebration in The Star Wars Holiday Special, very similar in tune to the Theme. This is a superficial indication that \"Star Wars Theme\" exists in-universe. Some of the lyrics to this song include:"}, {"tag": "p", "text": "In the first episode of the Star Wars radio drama adaptation, the theme is used as background music for an Imperial Academy recruitment commercial which Luke Skywalker listens to in his home on Tatooine."}, {"tag": "p", "text": "Similar indications exist with \"Imperial March\" (implied in The Paradise Snare to be the official in-universe martial anthem of the Imperial Navy) and \"Duel of the Fates\" (heard from ghastly voices in the Ice Crypts of Coruscant)."}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The \"Main Title\" appears in each of the saga film's soundtracks during the opening crawl and the end credits."}, {"tag": "p", "text": "However, many of the films and their soundtracks contain snippets of the theme in the film itself. In the The Phantom Menace soundtrack, the piece occurs twenty seconds into \"Panaka and the Queen's Protectors\". The theme makes an additional appearance in the track \"Fighting The Destroyer Droids\" on the Ultimate Edition soundtrack. In the Attack of the Clones soundtrack and Revenge of the Sith soundtrack, the theme only appears in the opening crawl and the end credits. The theme appears in two tracks (excluding the opening crawl and credits) in the A New Hope soundtrack. These are \"Rescue of the Princess\" / \"Tractor Beam/Chasm Crossfire\" and \"Land of the Sandpeople\". In the The Empire Strikes Back soundtrack, the piece is featured in \"Luke's First Crash\" and \"Carbon Freeze/Luke Pursues The Captives/Departure of Boba Fett\". In the Return of the Jedi soundtrack, the piece occurs in *\"The Pit of Carkoon\" / \"Sail Barge Assault\" (1:35) or \"The Return of the Jedi\", \"The Emperor Arrives\" / \"The Death of Yoda\" / Obi-Wan's Revelation\" (3:58), \"The Battle of Endor\", and \"Sail Barge Assault (Alternate)\" (0:51)."}, {"tag": "p", "text": "In the score for Solo: A Star Wars Story, the theme appears in several tracks, including \"L3 and Millennium Falcon,\" \"Reminiscence Therapy\" and \"Into the Maw.\""}, {"tag": "p", "text": "The theme is also used in several Expanded Universe soundtracks. In the Shadows of the Empire soundtrack, the motif is used strictly in the first track and is performed by the Royal Scottish National Orchestra. In The Clone Wars soundtrack, the first and last tracks contain the only occurrences of the theme. This recording is performed by the City of Prague Philharmonic Orchestra."}, {"tag": "p", "text": "The \"Main Title\" segues directly into a piece created specifically for the event occurring after the opening crawl in each film. These are: \"The Arrival at Naboo\" or \"Boarding the Federation Battleship\" (Star Wars: Episode I The Phantom Menace); \"Ambush on Coruscant\" (Star Wars: Episode II Attack of the Clones); \"The Revenge of the Sith\" (Star Wars: Episode III Revenge of the Sith); \"Rebel Blockade Runner\" (Star Wars: Episode IV A New Hope), which goes on to quote the ending of \"Mars\" from Gustav Holst's \"The Planets\"; \"The Ice Planet Hoth\" (Star Wars: Episode V The Empire Strikes Back); \"Approaching the Death Star\" (Star Wars: Episode VI Return of the Jedi)."}, {"tag": "h3", "text": "In other merchandise"}, {"tag": "p", "text": "The theme is also used in several other forms of merchandise. This includes numerous audio cards and a Tooth Tunes tooth brush."}, {"tag": "h3", "text": "In popular culture"}, {"tag": "p", "text": "The \"Main Title\" has become one of the most recognized theatrical themes ever written."}, {"tag": "p", "text": "On the January 21, 1978 episode of Saturday Night Live, Bill Murray's lounge singer character sang a version of the Star Wars theme with lyrics. Some of the lyrics include:"}, {"tag": "p", "text": "Star Wars,\nGive me more Star Wars,\nNothing but Star Wars,\nDon't let them end"}, {"tag": "p", "text": "Ah, Star Wars,\nIf they should bar wars,\nPlease let these Star Wars,\nStay!"}, {"tag": "p", "text": "And hey!,\nHow 'bout that nutty Star Wars bar?,\nCan you believe all the creatures in there?,\nAnd hey!,\nDarth Vader in that black and evil mask,\nDid he scare you as much as he scared me?"}, {"tag": "p", "text": "Star Wars,\nThose near and far wars,\nStar Wars!"}, {"tag": "p", "text": "The song was also performed after the 20th Century Fox Fanfare in set one of the international tour of Star Wars: In Concert. The concerts were conducted by Dirk Brosse."}, {"tag": "p", "text": "The theme appears in the end credits of the special Robot Chicken: Star Wars, where it is sung by chickens. Disco artist Meco released a disco version of the theme in 1977 on the album Star Wars and other Galactic Funk. It reached #1 on the Billboard Hot 100 on October 1. It held that position for two weeks. The single became the biggest-selling instrumental single in the history of recorded music, being the first to be certified platinum (2 million units) by the RIAA. Meco's version eventually was used officially in the Star Wars franchise with Star Wars: Rogue Squadron III: Rebel Strike, where it played in the arcade mode of the game upon approaching the arcade cabinets. Similarly, it also played when pressing certain buttons on Kamino in the game LEGO: Star Wars."}, {"tag": "p", "text": "It has also been heard in The Lego Movie when Emmett and the Master Builders are arguing how to access Lord Business' tower."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}