{"url": "Star_Wars_Missions_13:_Prisoner_of_the_Nikto_Pirates", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 13: Prisoner of the Nikto Pirates"}, {"tag": "p", "text": "Star Wars Missions 13: Prisoner of the Nikto Pirates is the thirteenth adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on September 1, 1998."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Millennium Falcon has been damaged and captured by bloodthirsty Nikto pirates. You are trapped in the pirates' Predator-class vessel…with only one chance to break free. Time is already running out. Your mission: to steal the parts needed to fix the Falcon, repair your ship, and make a daring escape."}, {"tag": "p", "text": "May the Force be with you."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Han Solo, Chewbacca, Luke Skywalker, and Leia Organa all travel to a Skrilling salvage ship, in search of supplies for the establishment of Echo Base on Hoth. While bartering there, C-3PO encounters the ancient droid B-1D4, an expert in gender relations. Wondeefor engages in a datalink with 3PO, which greatly enhances the protocol droid. Organa, impressed with Wondeefor, buys her. The Falcon then leaves for Dweem, but its hyperspace engine is damaged, leaving it stranded. The M'hendosat discovers the Falcon, and its captain, Kassihm, orders that Solo's ship be salvaged and torn apart. Solo, once aboard, plans to trap the Nikto pirates and repair his ship. One of the Rebels manages to escape the Nikto craft and roams free on the M'hendosat, wreaking havoc, while their compatriots are left behind to deal with the boarding party. Those left are all knocked out by Bothan stun spores and thrown in the brig. Meanwhile, the escapee begins sabotaging the Nikto ships."}, {"tag": "p", "text": "The Rebel powers up the droids, which have been left behind. Beewondeefor then begins convincing the M'hendosats computer to deactivate all security systems and unlock the cell doors. The Rebel then steals all the required parts to fix the Falcon, before saving his companions and escaping. During the Rebels' escape, the ship's power core sustained significant damage and was destroyed. Kassihm, however, was able to escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}