{"url": "Star_Wars_Missions_2:_Escape_from_Thyferra", "categories": ["Category:Real-world articles", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 2: Escape from Thyferra"}, {"tag": "p", "text": "Star Wars Missions 2: Escape from Thyferra is the second adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on October 1, 1997."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Rebel forces have found an Imperial conspiracy involving contaminated bacta, a deadly substance that can poison entire planets. In order to stop the Empire, the Rebels travel to Thyferra…where they are trapped by a squadron of stormtroopers! Your mission: to escape from Thyferra…before it's too late."}, {"tag": "p", "text": "May the Force be with you."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "As HIMS Liquidator lies in wait over Delrakkin for the arrival of the Death Star I, Admiral Termo views a holotape recorded by Grand Moff Wilhuff Tarkin several weeks prior. Tarkin's holorecording tells Termo to send a coded transmission to B90-478R, and to await further instructions."}, {"tag": "p", "text": "Meanwhile, back on Yavin 4, C-3PO, Luke Skywalker, Leia Organa, and Han Solo explain to General Jan Dodonna about the contaminated bacta that the Death Star had been carrying. Alarmed, Dodonna decides to dispatch a team to Thyferra to investigate. Organa volunteers, and she and her entourage board the Millennium Falcon, and set course for Thyferra. On the way, R2-D2 is able to repair the ancient droid, Q-7N."}, {"tag": "p", "text": "Back on the Liquidator, Termo contacts B90-478R, only to learn that he is, in fact, speaking with Galactic Emperor Palpatine. Palpatine informs him that Tarkin is dead, and the Death Star was destroyed."}, {"tag": "p", "text": "The Falcon enters the Polith system safely, with a Y-wing brought in tow as a backup. However, upon landing on Thyferra, all of the Rebels are captured. But Q-7N and one of the Rebels escape, with a view to helping the others. They commandeer the Y-Wing and land it a few blocks away from the Imperial garrison. The Rebel then tries to find Voralla Morbo, a local who is sympathetic to the Rebellion. However, on the way, they are tricked by a Kubaz, and almost robbed. The Rebel is able to fight their way out of the situation, save a Vratix named Plurra from slavery and return to the other Rebels."}, {"tag": "p", "text": "The group meet with Morbo, and she tells them that a modified Imperial Carrack cruiser picked up a large amount of alazhi several weeks ago, and shipped it to Delrakkin. Picking up on the lead, Organa, Solo and Skywalker prepare to set course for Delrakkin."}, {"tag": "h2", "text": "Mission Pack #2"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}