{"url": "Battle_for_Jedha", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Battles of Jedha", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle for Jedha"}, {"tag": "p", "text": "The battle for Jedha occurred on the holy moon after a group of rebels led by Princess Leia Organa participated in a mission to Jedha during the Galactic Civil War. They attempted to make contact with the surviving members of Saw Gerrera's Partisans."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the destruction of Jedha's Holy City and the Death Star, the surviving Partisans and some of the Holy City inhabitants regrouped. They followed Saw Gerrera's second in command, Benthic and continued to fight the Galactic Empire's remaining forces on Jedha. During this time, the Rebel Alliance was searching for a new base."}, {"tag": "p", "text": "Both the Empire and the Kingdom of Shu-Torun led by Commander Befa were ordered retrieve the remaining kyber crystals from Jedha. Befa's troops, however, were unable to retrieve no more than a box full due to the continued resistance and Jedha's climate change."}, {"tag": "p", "text": "Lord Vader asked Shu-Torun's queen Trios to send her specialists to Jedha to mine the remaining Kyber crystals. He also instructed Trios to supply the rebels with information to disrupt their efforts on Jedha and infiltrate the Alliance as they build their new fleet. Vader told her to let him know at the moment when the Rebels were about to go into hiding. To ensure her mission, Vader and Trios eliminated her guards and attendants."}, {"tag": "h2", "text": "The assault"}, {"tag": "p", "text": "Several Partisans under Ubin Des fought several snowtroopers who shot down their T-47 airspeeder. They were rescued by Rebel Alliance Commander Luke Skywalker. Together, they made their escape and boarded the Millennium Falcon. Des met with Captain Han Solo and Princess Leia Organa after they made their way to NaJedha and spoke with Organa about re-establishing the ties between the Alliance and Partisans to stop the Empire. Des and Chulco Gi agreed to take them to the Partisans' base. At the base, Benthic believed that they should kill Organa and her allies, but agreed to listen to her. He then agreed to accept her supplies and spoke with her about re-joining the Alliance."}, {"tag": "p", "text": "The Imperial forces then came under the command of Commander Kanchar and his civilian adviser, Queen Trios of Shu-Torun. After \"relieving\" Befa of his command, Kanchar and Trios made plans to retrieve the remaining kyber from Jedha. Together, they discovered that Gerrera and his partisans had horde of kyber stored at the Catacombs of Cadera that Trios's miners had discovered. Kanchar then issued an edict stating that Jedha was now a prohibited moon. Trios prepared the drill citadel and allowed Kanchar to deploy it to Jedha."}, {"tag": "h3", "text": "Attack in Ai-jed"}, {"tag": "p", "text": "Skywalker went with Gi and Des to Ai-jed. They saw that the stormtroopers were incinerating people. Skywalker fought the stormtroopers killing them all. Skywalker, Gi and Des regrouped with Benthic and Solo. Together, they saw the drill citadel land and planned to destroy it."}, {"tag": "h3", "text": "Attacking the Drill citadel"}, {"tag": "p", "text": "Skywalker attacked one of the miners as he and Benthic boarded the drill citadel. Benthic forced one of the technicians to lower the shields so that the Partisans and the Falcon could attack the citadel. As Des distracted the gunners, Solo and Organa were then able to destroy the citadel mine. Despite the setback, Trios assured Kanchar that the Leviathan would finish the job."}, {"tag": "p", "text": "Luke went with Gi to learn more about the Jedi at the chasm. As they approached, they then came under attack by a sand slug. Skywalker was able to kill it and ran into two members of the Central Isopter. Skywalker then listened to the Central Isopters answers."}, {"tag": "h3", "text": "Attacking the Leviathan"}, {"tag": "p", "text": "The Partisans then planned to attack the Leviathan. Solo, Organa, and Benthic studied the Leviathan, as one of Partisans teams attacked. Des was able to plant an explosive on it, but it had no effect. Organa and Solo then flew one of the airspeeders to save Des's team. During this time, Luke rescued Chewbacca from a TIE after retrieved plans to the Leviathan and rendezvoused with the Partisans and Leia's team after they rescued Des' team."}, {"tag": "p", "text": "Leia then planned a way to infiltrate the Leviathan with Benthic. The plan was for one team to infiltrate the bridge while the second team piloted the Leviathan to the hole where Jedha City once stood. Luke took 3PO and Leia aboard the Leviathan. Together, they were able to disable the Leviathan's weapons. However, Commander Kanchar found the Partisans and attacked the Partisans' base. The Partisans and several of the refugees boarded the Falcon and escaped. Benthic was wounded in the attack and Solo took charge."}, {"tag": "p", "text": "Kanchar then attempted to shoot the Falcon down as it approached the Leviathan. However, weapons were down and had to be rebooted. Kanchar was confronted by Skywalker with his lightsaber. However, Kanchar was armed with a weapon in his cybernetic arm. Solo and the Partisans landed on the Leviathan and fought the stormtroopers. As Leia and R2 prevented reinforcements from attacking Solo, Leia was confronted at blaster point by Trios."}, {"tag": "h4", "text": "An unexpected ally"}, {"tag": "p", "text": "After Trios gloated to Leia, she asked her to punch her. Trios then revealed that she was the one who leaked the Leviathan's plans to Chewbacca. As Leia questioned Trios' reasons, Solo and the Partisans went to the bridge. Skywalker fought Kanchar as well, evading his built-in flame thrower. Trios told Leia that after Vader killed her father and family, Trios promised herself that Shu-Torun would not suffer Alderaan's fate. Trios also told Leia that while the Empire raised its quota on Shu-Torun, her people have stockpiled resources. Leia knew that the Alliance could use the resources to rebuild the fleet."}, {"tag": "p", "text": "Skywalker was able to knock out Kanchar and met up with Leia. Leia agreed to have Trios act as an informant within the Empire. Luke and Leia left as Trios summoned more guards to ensure her loyalty to the Empire. Luke and Leia then went to the bridge where they were picked up by the Falcon. As the Falcon made its escape, the Leviathan went into the Chasm. Only Trios, Kanchar and several of her guards were able to escape before the Leviathan fell into the chasm."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Falcon dropped off the surviving Partisans and refugee on NaJedha. Benthic promised that he and his partisans would guard Jedha until it was gone. Leia agreed to have the Partisans work with the Alliance once again. Ubin Des was then given the Medal of Bravery by Captain Solo in recognition for her actions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}