{"url": "Battle_for_Botajef", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Belsmuth sector", "Category:Battles of the Imperial Era"], "nodes": [{"tag": "h1", "text": "Battle for Botajef"}, {"tag": "p", "text": "A battle for Botajef occurred sometime during the reign of the Galactic Empire. The battle was sparked by Governor Quesl's attempted secession of Botajef, which was a cover to steal the planet's valuable art collections for himself. Commodore Thrawn led the Imperial forces in the battle and exposed Governor Quesl's fraud. This ended the battle peacefully in the Empire's favor."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The planet Botajef was home to the Jefi species, whose history was one characterized by long periods of passive allegiance followed by brief periods of fiery conflict that led to new leadership and another era of passive allegiance. This cyclical history was reflected in Jefi art, which was characterized by curves interrupted by stark lines or sharp angles, with a color palette mirroring the group emotional and ethical spectrum. By the Imperial Era, Botajef had come under the rule of the Galactic Empire, who appointed Governor Quesl to rule the planet. While Quesl was a human, he managed to used his leadership skills to convince the Jefi to submit to his rule."}, {"tag": "p", "text": "Prior to the Batonn insurgency, Governor Quesl decided to secede Botajef from the Galactic Empire. Since this secession brought up memories of the devastating Clone Wars, the Galactic Empire refused to tolerate Botajef's secession. While Quesl had managed to convince the Jefi to support him, the secession was a cover for his plan to steal priceless Botajef art and sell them offworld by staging his own death during a confrontation with the Empire.\nFleet Admiral Jok Donassius dispatched Commodore Thrawn to bring the separatists to heel. Thrawn was assigned this mission because xenophobic elements of the Imperial Military despised the Chiss alien and wanted him to fail."}, {"tag": "p", "text": "Out of duty, Commodore Thrawn accepted the mission. During the fifteen hour journey to Botajef, Thrawn studied the planet's history and art. He was also helped by Weapons Officer Lieutenant Pyrondi, who explained that the Jefies followed those whom they regarded as great leaders. Thrawn's forces consisted of the Imperial Star Destroyer Chimaera while the Botajef Defense Force consisted of two CR90 corvettes and seven squadrons of V-19 Torrent starfighters; with five squadrons based in the north-polar base and two based in the south-polar base."}, {"tag": "h2", "text": "The confrontation"}, {"tag": "p", "text": "Upon emerging from hyperspace, the Chimaera was met by Governor Quesl's two CR90 corvettes. Governor Quesl ordered the Imperials to leave but Thrawn claimed that Botajef's secession violated the formal rules established in Section Eighteen, Paragraph Four of the treaty that the Jefies signed with the Empire after the Clone Wars. While Thrawn distracted the Governor, four TIE fighters flew past the starboard corvette. This did not startle the corvettes who maintained stationary."}, {"tag": "p", "text": "When Quesl denied there was such a treaty, Thrawn added that Paragraph Seven of the treaty stated that the governor or other leaders must fully disarm before any secession talks. Thrawn then demanded that Quesl remove the turbolaser emplacements around his palace. Quesl mocked Thrawn and dared him to destroy them himself. Thrawn then instructed Senior Lieutenant Yve to dispatch six TIE fighters to take out the turbolasers. Due to Yve's superb training, the Imperial TIE fighters easily destroyed the turbolasers without damaging Quesl's palace."}, {"tag": "p", "text": "Thrawn then directed Commander Karyn Faro to shift the Chimaera towards starboard in the direction of the corvette holding position there. This shook the Botajef corvette and caused the comm display of Quesl to shake. At that point, Commander Eli Vanto realized that Quesl was on one of the corvettes rather than the palace. Noticing the paintings behind Quesl, Thrawn deduced that Quesl had instigated the secession as a plot to fake his death and escape offworld with Botajef's art. When Quesl insisted the Jefies were still loyal to him, Thrawn countered that they would only obey a respected leader and that Quesl no longer held that respect."}, {"tag": "p", "text": "Admitting defeat, Quesl remarked that he could have sold the art for billions offworld. When Quesl asked how Thrawn had bested him, the Commodore replied that his human crew had twitched in response to what he thought was an impending collision. However, the other corvette had trusted their leader implicitly and showed no fear since it was crewed by Jefies. Thrawn then gave orders for Quesl and his crew to be brought aboard the Chimaera and the artwork returned. Thrawn added that the Jefies needed to be \"enlightened\" and that a new leader needed to be chosen until Coruscant could send a new governor. He also gave orders for the Imperial pilots to remain alert but assured them that no conflict was anticipated."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thrawn defused the Botajef uprising peacefully without any bloodshed. Following the defeat of Governor Quesl, the stolen artwork was returned. Thrawn took steps to inform the chief of the Botajef Defense Force and the Jefies about the real situation. Thrawn also instructed Commander Vanto to contact Imperial High Command on Coruscant to inform them that the situation on Botajef had been peacefully resolved. In private, Thrawn confided with Commander Faro that the fictitious Clone Wars-era treaty had been a ruse for him to distract Governor Quesl until his movement under the tractor beam's pull gave final confirmation of his presence aboard one of the CR90 corvettes. The peaceful resolution of the Botajef uprising dealt a blow to those within the Empire who had hope to discredit the alien \"outsider\" Thrawn. In addition, the conflict's peaceful resolution enabled Thrawn to concentrate on eliminating the shadowy insurgent leader Nightswan"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle for Botajef first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the titular character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}