{"url": "Star_Wars_Missions_18:_Rogue_Squadron_to_the_Rescue", "categories": ["Category:Real-world articles", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 18: Rogue Squadron to the Rescue"}, {"tag": "p", "text": "Star Wars Missions 18: Rogue Squadron to the Rescue is the eighteenth adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on February 1, 1999."}, {"tag": "h2", "text": "Blurb"}, {"tag": "p", "text": "The Empire has seized a Corellian Action IV bulk freighter. As a member of Rogue Squadron, you must find out why the Imperial forces have taken the vessel. Then you must stop them. Your mission: to free the freighter's crew from their detention cells, and to infiltrate the hijacked craft."}, {"tag": "p", "text": "May the Force be with you."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "On Imperial Center, Darth Vader meets with Palpatine, and delivers Wilhuff Tarkin's holotape. The holotape stipulates the concept of gravity well projectors and indicates how they can be created. Palpatine, intruiged, appoints General Mordak head of the Gravity well scheme, and dispatches Vader to Fondor, to oversee the creation of the Executor."}, {"tag": "p", "text": "Meanwhile, on the uncharted red planet, Q-7N and his Rebel allies assess the damage done by the Empire. Q-7N finds nothing of value, however. A message pod, sent by Rogue Squadron, arrives on the planet, with a message from Wedge Antilles, who requests that Leia Organa and her friends join him on Kwenn Space Station."}, {"tag": "p", "text": "At Kwenn Space Station, Antilles, Wes Janson, and Tycho Celchu are investigating a Action VI transport that the Empire has detained, the Stellar Manx. While snooping about, they are set upon by a squad of Stormtroopers. The Rogues split up, and one of them eludes the Imperials by swimming through an aquarium."}, {"tag": "p", "text": "The lone Rogue encounters Captain Kar Lamoran in the detention cell, and frees her, along with her crew. Making their way back to Lamoran's Action VI, the Rogue encounters more security droids. The ship, however, takes off before they can reach it, but the Rogue pursues it, boards it, and takes it back to Space Station Kwenn. During his expedition, the Rogue also finds out that Darth Vader is in charge of the Imperial operation, and that the freighter's destination was Bonadan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}