{"url": "Star_Wars_Missions_11:_Bounty_Hunters_vs._Battle_Droids", "categories": ["Category:Real-world articles", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 11: Bounty Hunters vs. Battle Droids"}, {"tag": "p", "text": "Star Wars Missions 11: Bounty Hunters vs. Battle Droids is the eleventh adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on July 1, 1998."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "You are a bounty hunter. You are engaged in a fight to the death against a lethal squadron of battle droids. The droids' leader, Wuntoo Forcee Forwun, will stop at nothing in his quest to rule the galaxy. You must stand in his way. But be careful — the droids are not your only enemies. Other bounty hunters want to get to Forwun before you do. The reward is high — and the risks are extraordinary."}, {"tag": "p", "text": "Good luck."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Star Destroyer Decimator heads through hyperspace on a course for Vactooine. The ship, now under the control of 12-4C-41's Droid Army, is under the command of 12-4C-41, who regrets the recent loss at Tatooine. Nevertheless, he resolves to build his foundries on Vactooine, and return, to exact vengeance on EV-9D9. Meanwhile, at Jabba's Palace, the biker Twitch delivers a broken K4 security droid to 9D9, who begins interrogating it."}, {"tag": "p", "text": "Meanwhile, on Dennogra, IG-88B hunts Han Solo, who was recently on the planet dealing with the Ithorian treasure merchant Sprool. Entering the Zio Snaffkin Cantina, 88 finds the place completely wrecked, with all the patrons killed. The only patron of the cantina still alive is the notorious bounty hunter and 88's rival Boba Fett. Soon after, Dengar and Bossk arrive on Dennogra, but the bounty hunters are soon met by a message droid from Jabba the Hutt, ordering them to hunt down Wuntoo's droid army. The bounty hunters all scramble to their ships and begin dogfighting, but only one of them escapes to the Vactooine system. There, the hunter encounters the Decimator, which is hiding behind the largest moon of Vactooine. Wuntoo, in the Decimator, launches TIE/sa bombers to intercept, but they are quickly swept aside by the hunter."}, {"tag": "p", "text": "The Decimator, searching for its lost bombers, captures the bounty hunter in a tractor beam, bringing it into the landing bay. A K4 security droid boards the ship, but the hunter quickly dispatches it, before launching the ship's escape pod across the hangar floor, gaining the element of surprise. Despite this, the hunter is captured, and thrown in one of the Decimator's cells. The hunter does not give up, however, and defeats his guards, before questioning K-2PQ. Learning that the droids are renegades, and that they were hunting 9D9 and not Jabba, the hunter destroys 2PQ, and escapes the ship, programming the drone barge to travel to Tatooine on their way out. Upon returning to Tatooine, the hunter is set upon by Zuckuss and 4-LOM, but defeats them. Jabba, impressed, pays the hunter their fee. On Vactooine, however, Wuntoo's forces have successfully subjugated the mining colony."}, {"tag": "p", "text": "On Yavin 4, Luke Skywalker detects that something is amiss when Vactooine is late for a shipment, and requests permission to investigate."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Zuckuss is labeled a \"Gann\" in this book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}