{"url": "Star_Wars_Missions_1:_Assault_on_Yavin_Four", "categories": ["Category:Real-world articles", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 1: Assault on Yavin Four"}, {"tag": "p", "text": "Star Wars Missions 1: Assault on Yavin Four is the first adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on September 1, 1997."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The first Death Star has been destroyed. But the Empire remains. An Imperial cruiser has landed on Yavin Four. The Rebel base is threatened. Your mission: to prevent the assault on Yavin Four…at any cost."}, {"tag": "p", "text": "May the Force be with you."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Over the planet Delrakkin, Admiral Termo awaits a transmission from Grand Moff Wilhuff Tarkin in the Yavin system. When the transmission does not arrive, Termo grows concerned, and prepares to dispatch a strike team to Yavin."}, {"tag": "p", "text": "Meanwhile, at the Great Temple on Yavin 4, the Rebels are celebrating the destruction of the Death Star, until C-3PO interrupts them with the news that R2-D2 has discovered something interesting. According to the Death Star plans, the battle station was carrying copious amounts of bacta as cargo. While Luke Skywalker, Han Solo and Leia Organa ponder what this could mean, Threepio receives a relay signal from a beacon in the system, and informs the Rebels that an unknown ship has entered the system. Their sensors indicate that it is a modified Carrack cruiser, probably searching for the Death Star. General Jan Dodonna orders that they lay low, and allow the ship to pass, but Solo disobeys, and sets out after the craft in the Millennium Falcon. Upon reaching the craft, Solo opens fire, and forces the Carrack to crash land on Yavin 4. Dodonna decides that they must send a force out to stop the survivors from sending a distress signal and alerting the Empire to their presence."}, {"tag": "p", "text": "Dodonna selects one of the Rebels to scout ahead and survey the Imperial strength. The scout, using a speeder bike, reaches a clearing, and is nearly captured by Imperial stormtroopers, but quickly defeats them. The scout then finds more stormtroopers who are planning to launch a distress beacon, and quickly kills them too. Realizing that they will not be able to neutralize all of the Imperials, the scout disguises themselves as a Stormtrooper, hijacks an Imperial landspeeder, attaches their speeder bike to the back of it and sneaks into the Imperial camp. However, the scout forgets to turn off their comlink, and their cover is soon blown. The scout quickly escapes into a nearby temple to avoid capture. Within the temple, the scout encounters a battle droid, but defeats it. Venturing further into the temple, the scout encounters two more battle droids, and defeats them, as well as a worm-like creature. The scout then discovers Q-7N, a security droid left by the Sith builders of the temple. 7N, thinking that the scout is an Imperial, sends the scout hurtling through a trapdoor, and pits them against two stormtroopers. The scout kills the two stormtroopers with ease, only for Q-7N to reveal that they were in fact holograms. Convinced that the scout is friendly, Q-7N aids them in their quest to capture the Imperial captain. The scout is able to escape, but is pursued by Captain Skeezer. Q-7N slams himself against the captain, knocking him out and saving the scout. The scout then returns to the Rebel base with the damaged ancient droid."}, {"tag": "p", "text": "Afterwards, Artoo repairs Q-7N, while Solo learns from the captured Captain Skeezer that the bacta carried by the Death Star was contaminated."}, {"tag": "h2", "text": "Mission Pack #1"}, {"tag": "p", "text": "In addition to being the first book in the series, this mailing included the introduction kit. The kit included a thin black plastic carrying case embossed with Darth Vader's helmet, a thick plastic membership card that read \"The Future of the Galaxy Depends on You\", a welcome letter titled \"Prepare for the your first mission!\", the Mission Points Scoring Pad, Mission Guide, one black 12-sided die and one white 6-sided die, and a copy of Star Wars Kids: The Magazine for Young Jedi Knights 1. Game items included a map of the Yavin system and twelve Mission Team Cards (Set 1)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}