{"url": "Star_Wars_Mazes", "categories": ["Category:Real-world articles", "Category:Arts and crafts books"], "nodes": [{"tag": "h1", "text": "Star Wars Mazes"}, {"tag": "p", "text": "Star Wars Mazes, originally titled Star Wars Mazes: Find Your Way Through a Galaxy Far, Far Away and Star Wars: Mazes From a Galaxy Far, Far Away, is a canon activity book written and illustrated by Sean C. Jackson. Published by Chronicle Books on July 20, 2021, the book features illustrated mazes of scenes and locations throughout the Star Wars saga."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Expert maze creator and lifelong Star Wars fan Sean C. Jackson brings the saga to life through more than 30 beautifully illustrated mazes of iconic scenes and locations ranging from the forest moon of Endor to Bespin's Cloud City, the dark side planet of Exegol, Jabba's palace, pod races, clone armies, and much more. Each full-color maze includes notes about the environment and special bonus elements to find hidden along the way."}, {"tag": "p", "text": "Star Wars fans of all ages will enjoy racing through the corridors of the Death Star, scavenging inside a fallen star destroyer on Jakku, searching the rocky cliffs of Ahch-To, and much more."}, {"tag": "p", "text": "• EXPLORE A GALAXY FAR, FAR AWAY: Immerse yourself in a brand new way when you explore your favorite Star Wars locations via exciting mazes."}, {"tag": "p", "text": "• ACCOMPLISH MISSIONS WITH EACH MAZE: Each of the dozens of unique mazes comes with its own mission that's accomplished by finishing the maze, such as \"Return to the base to escort the last transport off planet,\" \"Take the smuggler Han Solo back to your ship,\" and \"Locate Jedi Master Yoda in the mysterious swamp.\""}, {"tag": "p", "text": "• EXTRA, FINDABLE ITEMS IN EACH MAZE: In addition to the maze itself, each includes other game activities or elements to find."}, {"tag": "p", "text": "• BEAUTIFULLY ILLUSTRATED AND REPLAYABLE: The gorgeously detailed full color mazes may be solved by pen or pencil, but using a non-writing item to follow the paths leaves the book ready to replay."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}