{"url": "Star_Wars_Missions_7:_Ithorian_Invasion", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Star Wars Missions books"], "nodes": [{"tag": "h1", "text": "Star Wars Missions 7: Ithorian Invasion"}, {"tag": "p", "text": "Star Wars Missions 7: Ithorian Invasion is the seventh adventure book in the Star Wars Missions young-reader series and roleplaying game. It was published by Scholastic on March 1, 1998."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Bounty hunters have taken Grubba the Hutt to the planet Ithor. You must get him back. The Ithorian leader Momaw Nadon has offered to help you. But in return you must aid him in his revolt against the Empire. Imperial forces have taken control of Ithor's center, the Tafanda Bay. Your Mission: to liberate the Ithorians—and find Grubba the Hutt—before it is to late."}, {"tag": "p", "text": "May the Force be with you."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Captain Han Solo, in the Millennium Falcon approaches Ithor, hoping to reclaim possession of Grubba the Hutt. His passengers are Luke Skywalker, Princess Leia Organa of Alderaan, Momaw Nadon, R2-D2, and C-3PO. Attempting to evade Imperial detection, he modifies the Falcon's transponder to transmit the data of an diplomatic shuttle, while masquerading as the ship of Master Torturer Sir Vengnar Heiff. The Imperials allow them to approach the Tafanda Bay a herdship that resides above Ithor's surface. Meanwhile, on the Tafanda Bay, General Olan Dewes gives Dengar, Eron Stonefield, and Udin a tour of some botanical gardens. The three bounty hunters have captured Grubba, and are keeping him safe on the herdship."}, {"tag": "p", "text": "Feigning a crash so the Imperials will not be surprised when Heiff fails to appear, Solo sets the Falcon down at the Nadon Shrine. There, Nadon is reunited with his wife, Fandomar, and his son, Do-Forow. Before allowing Solo and his companions to hunt for Grubba, however, Nadon insists that they consult The Oracle. The Oracle tells the group of the plight of the Ithorians, before sending them to the Tafanda Bay. Meanwhile, on the herdship, Dewes receives word that the real Heiff will be coming to Ithor to interrogate Ithorian prisoners."}, {"tag": "p", "text": "One of the Rebels is selected to accompany Nadon to the Tafanda Bay. After spending the night in the jungle, the pair encounter several dangers, including Imperial Stormtroopers. Eventually, they are able to board the Bay, where they are confronted by Ithorians sympathetic to the Empire, led by Boma Inondo. The Rebel knocks the Ithorian into a pile of berries, while the other Ithorians relent, and explain that Sir Vengar Heiff is on board. Planning to raid the Imperial armory and start an uprising on the Bay, the Rebel and the Ithorians encounter an IG-88 assassin droid, which they destroy. Taking the Imperial weapons, the Ithorians engage the Imperials, beginning the First Battle of Ithor. Seizing the control room, General Dewes is captured, and the Alliance Fleet enters the system, driving off the Imperial presence. The Rebel then attempts to find Sir Heiff, in the prison bays. Combating the Master Torturer, the Rebel is able to incapacitate Heiff, and leaves him to the mercy of the Ithorians. The Rebel then encounters three bounty hunters, who are able to flee the Bay with what seems to be a sack containing Grubba. Fortunately, it only contained Grubba's dinner, and the young Hutt is found safe and alive in one of the herdship's staterooms."}, {"tag": "p", "text": "Solo then contacts Jabba, requesting that he meet him on Togoria to negotiate the transfer of Grubba. The Hutt crimelord agrees, but then secretly informs Dengar of their rendezvous, ordering him to kill Solo upon arrival."}, {"tag": "h2", "text": "Mission Pack #7"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}