{"url": "Star_Wars_Maker_Lab", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Arts and crafts books", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "Star Wars Maker Lab"}, {"tag": "p", "text": "Star Wars Maker Lab is a canon children's arts-and-crafts book with step-by-step instructions for creating Star Wars-themed science projects using household items. It was written by Liz Lee Heinecke and Cole Horton, and was released by DK Publishing on July 3, 2018."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ever wanted to move things without touching them like a Jedi can? Or grow your own kyber crystal? Or maybe explode a balloon with a beam of energy, just like the Death Star? Now you can!"}, {"tag": "p", "text": "With 20 amazing projects, Star Wars™ Maker Lab teaches your budding Padawan how to become a Master of science, in both the real world and the Star Wars galaxy. Using clear step-by-step instructions, the book guides home scientists and makers through each exciting experiment–from making Jabba's gooey slime or a hovering landspeeder, to an Ewok catapult and a glowing Gungan Globe of Peace. Each experiment has fact-filled panels to explain the real-world science as well as the Star Wars science fiction from the movies."}, {"tag": "p", "text": "With projects that are out of this world, this fantastic Star Wars book can keep children entertained for hours, making use of many household items such as cardboard tubes, baking soda, cornstarch, straws, balloons, and food coloring. There is also plenty to keep more adventurous scientists enthralled, with instructions to make your own bristlebot mouse droid, lightsaber duel, and Mustafar volcano. Star Wars Maker Lab supports STREAM topics and helps children to learn the basics of science by traveling through the Star Wars galaxy. May the (static) Force be with you!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}