{"url": "Star_Wars_Origami:_11_Amazing_Paper_Folding_Projects_from_a_Galaxy_Far,_Far_Away....", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Arts and crafts books", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "Star Wars Origami: 11 Amazing Paper Folding Projects from a Galaxy Far, Far Away...."}, {"tag": "p", "text": "Star Wars Origami: 11 Amazing Paper Folding Projects from a Galaxy Far, Far Away.... is an origami art book by Chris Alexander. It contains twelve characters to fold, with forty-two sheets of paper. Each character has a paragraph before the folding instructions to explain who they are. The book also has two pages of trivia; one gives a list of weapons and characters, asking to match up the character to his or her weapon of choice, and the other provides eight multiple-choice trivia questions."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The power of the Force meets the joy of origami. Here is everything you need to create a galaxy of Star Wars characters out of paper. The ingenious models are created by Chris Alexander, the master of Star Wars origami, and come with complete step-by-step directions as well as an introduction to origami definitions, symbols, and basic folds. This kit includes a full color book of instructions, plus 42 sheets of unique folding paper, illustrated with meticulously detailed original art - so you can fold 3 each of 11 different models of beloved Star Wars characters."}, {"tag": "h2", "text": "Foldable characters"}, {"tag": "p", "text": "While the title of the book implies that there are only eleven foldable characters, there are actually twelve, as the instructions for Jango Fett are also to be used for Boba Fett. Each character is assigned a rank from the Jedi Order to imply their difficulty, ranging from Youngling, to Padawan, to Jedi Knight, to Jedi Master. The following is a list of all foldable character, along with their levels of difficult:"}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "p", "text": "ISBN 9780761191025; January 1, 2016; Workman Publishing Company, Inc.; US paperback"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}