{"url": "Star_Wars_Omnibus:_Shadows_of_the_Empire", "categories": ["Category:Real-world articles", "Category:Star Wars: Mara Jade – By the Emperor's Hand", "Category:Star Wars: Shadows of the Empire Omnibus"], "nodes": [{"tag": "h1", "text": "Star Wars Omnibus: Shadows of the Empire"}, {"tag": "p", "text": "Star Wars Omnibus: Shadows of the Empire is the eleventh Star Wars Omnibus collection from Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Beginning with Shadows of the Empire, Luke, Leia, and Chewbacca are determined to foil Boba Fett's plan to deliver carbonite-encased Han Solo to Jabba the Hutt. But these heroes are up against more than they realize. Darth Vader searches for Luke, hoping to turn him to the dark side, and a new threat, Xizor, the ruthless leader of the criminal organization Black Sun, seeks to gain the trust of the Emperor by killing Skywalker and overthrowing Vader! Then, in Shadows of the Empire: Evolution, a beautiful human-droid -- previously an assassin for Xizor -- searches to find her human side as Luke Skywalker tracks her across the galaxy, determined to bring her to justice! And finally, in Star Wars: Mara Jade – By the Emperor's Hand, the Emperor's personal assassin carries out her last mission, determined to succeed despite the death of her Master -- even if it costs her life!"}, {"tag": "p", "text": "This enormous collection features all your favorite characters from the original Star Wars trilogy: Luke Skywalker, Princess Leia, and Han Solo! It includes stories written by acclaimed novelists Timothy Zahn and Steve Perry!"}, {"tag": "h2", "text": "Back Cover Summary"}, {"tag": "p", "text": "In the time between the events in The Empire Strikes Back and Return of the Jedi, Princess Leia Organa, Luke Skywalker and Chewbacca attempt to rescue Han Solo from the notorious bounty hunter Boba Fett, while the criminal Prince Xizor and Darth Vader make plans to control, or destroy, the leaders of the Rebel Alliance."}, {"tag": "p", "text": "Shadows of the Empire was a multimedia Star Wars event - a film-without-the-film - in which a major story was told across a series of novels, comic books, role-playing games, a video game, and trading cards. Shadows even had its own soundtrack."}, {"tag": "p", "text": "Included here is the complete comic series as well as two stories that followed in its wake: Star Wars: Mara Jade – By the Emperor's Hand, the story of the Imperial assassin who would one day wed the New Republic's greatest hero, Luke Skywalker; and Shadows of the Empire: Evolution, a direct sequel to Shadows of the Empire."}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}