{"url": "Battle_for_Sullust", "categories": ["Category:Canon articles", "Category:Articles with unconfirmed canonicity", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle for Sullust"}, {"tag": "p", "text": "A battle occurred during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire on Sullust."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Directly following the Siege of Inyusu Tor the Alliance to Restore the Republic sent forces to Sullust. Their first move was to capture an Imperial hangar and make it their base. The rebels then sent four Rebel troopers to an Imperial Hanger to steal critical Imperial war machine plans. They were successful in finding the plans but had to fight their way out. After subduing multiple waves of Imperials, the Millennium Falcon arrived with a small rebel fleet consisting of 1 EF76 Nebulon-B escort frigate and 2 CR90 Corvettes. The remaining rebels then escaped with the plans aboard the Millennium Falcon. Meanwhile, Darth Vader found the rebel base and arrived in his Star Destroyer. Vader ordered the Imperial ground force to deploy an All Terrain Armored Transport escorted by All Terrain Scout Transports To destroy the base. Gial Ackbar then sent an MC80 Star Cruiser to aid the rebels in their escape. The rebels attacked the AT-AT but failed to destroy to it. The Empire was successful in destroying the base."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once the rebel base was destroyed and Darth Vader left the planet Alliance High Command discovered that Sullust had a direct Hyperlane to Endor and the new DS-2 Death Star II Mobile Battle Station. They then decided that they would gather their fleet over Sullust, so a small fleet consisting of at least 2 MC80 Star Cruisers and a small amount of frigates and corvettes was sent in to take out any imperial threat before the rest of the fleet arrived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}