{"url": "Star_Wars_PocketModel_TCG", "categories": ["Category:Real-world articles", "Category:Legends card games", "Category:Legends miniatures games", "Category:Star Wars PocketModel TCG"], "nodes": [{"tag": "h1", "text": "Star Wars PocketModel TCG"}, {"tag": "p", "text": "The Star Wars PocketModel TCG trading card game was manufactured by WizKids Games, when it was a division of The Topps Company, Inc. The game incorporated the use of constructable starship miniatures—punched out of styrene cards—as well as card decks and dice. The game was officially released on June 19, 2007. Miniatures included ship and vehicle classes from all films and some Expanded Universe sources, representing Rebel, Imperial, Republic, and Separatist forces. The game was produced by WizKids, Inc. until November 10, 2008, when Topps terminated the game company's operations and discontinued its brand lines, including Star Wars PocketModel TCG."}, {"tag": "p", "text": "In July of 2009, National Entertainment Collectors Association, Inc. (NECA) won the bid to purchase the licenses of former WizKids Games products. The rights that NECA bought from Topps to produce PocketModel brand games, however, did not include the rights to the Star Wars franchise. Therefore, WizKids/NECA has no current plans to produce further Star Wars-themed games."}, {"tag": "h2", "text": "Rules"}, {"tag": "p", "text": "The game was played in turns between 2-8 players. Each player would use a deck of cards—for combat and as objectives—to supplement a fleet of miniatures, called units. Each unit had a value represented by build stars. The number of build stars a unit had told what the unit cost to add to a player's fleet, with smaller units represented by a 1 to 3 build star cost, and larger units, such as capital ships, represented by a 4 to 5 build star cost. Build stars were also often referred to by combat cards, objective cards, and in the rules of the game. Each unit also had four values—Attack, Damage, Defense, and Shields. Units that a player controlled in the game were called friendly units. Units that the opponent controlled in the game were called opposing units."}, {"tag": "p", "text": "A game was played with at least thirty build stars of units—with twenty stars of units active at the beginning of the game, and the rest held in reserves—along with a deck of at least thirty cards. Game play began with each player shuffling their decks and placing them face down on their respective sides of the table, in an area designated as the Home Zone. Each player then blindly drew three cards from the top of their own decks and placed them face down next to their decks, representing the Objectives targeted by any opposing players. Then, after deciding who would go first, players selected units with an aggregate number of twenty build stars—amounting to anywhere from four to twenty miniatures—and placed them in front of the three face down Objective cards. Drawing three more cards to their hands, each player would alternate—beginning with the designated first player—making a choice between either one of three actions or passing to the next player. Cards used during play were placed in a Used pile to be shuffled after all cards in the player's starting deck were drawn. This \"recycling\" of cards prevented stagnation in the game, and allowed a greater frequency of opportunity to draw and play certain cards the player placed in the deck as part of their strategy."}, {"tag": "p", "text": "Players would move units into position to \"strike\" Objective cards in opposing Home Zones, while defending their own Home Zone's Objective cards against opposing units. Objectives losing a strike were considered destroyed and placed into the card owner's used piles. In order for units to \"battle\" each other, both players rolled dice—adding red color-coded Attack bonus attributes, when applicable—to try to beat or tie the total blue-marked Defense value of the opposing unit. If a unit was hit, damage was calculated by adding the yellow-indicated Damage strength of the friendly unit to any applicable bonuses and comparing the total to the opposing unit's green-colored Shield rating. Allocation of damage was depicted by placing styrene damage tabs, called counters, on affected units after a battle. Existing cumulative damage—represented by subtracting the printed Shield value by any attached damage counters—was further decreased by the total damage calculated from the battle action. If damage sustained on a unit was greater than that unit's cumulative Shield-minus-Damage value, the opposing unit was considered \"destroyed\" and placed out of play in the unit owner's reserves. A game was considered over when either all units of one player were left in play, or all but one player's Objectives were destroyed."}, {"tag": "h3", "text": "Cards"}, {"tag": "p", "text": "There were two categories of cards in this game: Combat cards and Objective cards. Combat cards could be played only during a \"combat action\", and they had special effects on the game during battles between space or ground units. Objective cards mainly could be used only in the home zone of the player that the card belongs to. They represented essential resources that opponents sought to destroy, and also had special immediate or lasting effects on the game. With the release of the Scum & Villainy expansion, new objectives, called Forward Objectives had a special ability allowing one card of that type per player to be played into the contested zone, potentially for a total of up to eight objectives active in the contested zone depending on the number of players in the game. Before the game was discontinued by Topps and the WizKids company sold to NECA, the Clone Wars Conquest expansion of the game was in final production stages. Included in the expansion's features were Unique Objectives, which had their own special game mechanic."}, {"tag": "p", "text": "Although not entirely pertinent to game play, cards were numbered in each set according to rarity, beginning with common cards, then uncommon, followed by rare, and finally, with the release of the Clone Wars Tactics expansion, holo. Though not any rarer than previous rare cards in a set, the last few cards of each set—and the cards labeled \"Holo\" in later sets—were printed with foil. These foil printings initially were exclusive to combat cards bearing images of prominent characters from the Star Wars Universe. With the release of the second expansion of the game Order 66, however, foil printed objective cards were introduced. Reprints of other rare cards in foil with alternate images were issued for the purpose of being used as tournament prizes. Two versions of the \"alternate art\" foil cards were printed for prize support. The word \"WINNER\" appeared in silver letters on the bottom-right side of the card designated for the tournament champion. Fellowship winners—the official designation for runners-up—were awarded an alternate art foil without the \"WINNER\" label. These foil reprints had the same collector number as the original counterparts from the sets they were from."}, {"tag": "h4", "text": "Icons"}, {"tag": "p", "text": "Icons printed on cards were used in conjunction with the icons printed on the bases of playing pieces (ships, vehicles, or creatures referred to as units) in the game. When a unit in a battle had an Icon in common with the combat card played with that unit, it received the ability from that card. Units with green Match Icons benefited from card abilities with matching green icons. Units with silver Power Match Icons benefited from card abilities with matching silver icons, yet gained other special persistent abilities during game play as well. Gold Wild Icons granted abilities to a variety of units, such as those with a certain number of build stars."}, {"tag": "p", "text": "Match Icon (green hexagon) — Card abilities activated with units bearing matching icons on their bases."}, {"tag": "p", "text": "Wild Icon (yellow/gold triangle) — Unless specified, may be used with any unit."}, {"tag": "p", "text": "Power Match Icon (gray/silver diamond) — Abilities activate with unit bearing matching icon(s) on its base, but also a persistent special ability granted, sometimes in lieu of a regular turn."}, {"tag": "p", "text": "GA First introduced in the Ground Assault expansion.\nO66 First introduced in the Order 66 expansion.\nSAV First introduced in the Scum and Villainy expansion.\nTFU First introduced in \"The Force Unleashed\" Collector's Tin released with the Scum and Villainy expansion.\nCW First introduced in the Clone Wars expansion.\nCWT First introduced in the Clone Wars Tactics expansion.\nCWQ To have been introduced in the Clone Wars Conquest expansion."}, {"tag": "h3", "text": "Units"}, {"tag": "p", "text": "The playing pieces in the game are made up of different starships, vehicles, and riding creatures from the Star Wars universe. A space unit was identified by the black background on its base, while a ground unit had a base with a beige background. Space units are able to attack other space or ground units in any zone. Ground units only attack other ground units in any zone, but are allowed to attack space units in a home zone, as well as defending against space units in the contested zone."}, {"tag": "p", "text": "In addition to the art and designs printed on the styrene units, later expansions introduced chrome-plated units. Collector's tins produced toward the end of the game's run included foil printed variants of units from the game."}, {"tag": "p", "text": "Large scale units—called Mega PocketModels—made of foam core were issued to small gaming retail shops and at conventions in order to draw the attention of groups of people to the game. Booths for WizKids used the oversize units at conventions on large tables in demonstrations of the game. Mega units became included as prize support that promotional envoys of WizKids would issue to winners at official tournaments. Due to the popularity of the large-scale units among collectors and fans of the game, WizKids released two Mega PocketModel versions of Clone Wars capital ship units for retail distribution."}, {"tag": "h4", "text": "Affiliations"}, {"tag": "p", "text": "A player did not need to use units of the same affiliation, but could mix and match units from different affiliations and eras to build a fleet. Affiliations were identified by their respective logos printed either on the base or the support stem. Affiliations sometimes had significance in a game, due to certain cards targeting specific factions."}, {"tag": "p", "text": "Alternately, with the release of the \"Order 66\" expansion, the Jedi Order was considered to be a faction in of itself with the introduction of combat and objective cards that targeted units with the word Jedi in the unit's name (i.e. Mace Windu's Jedi Fighter Tank)."}, {"tag": "p", "text": "Initially, the only unit without an allegiance to any faction is the Episode III variant of the Millennium Falcon unit which was released with a commemorative tin at the Star Wars Celebration IV event. However, with the release of \"Scum and Villainy\", more units were printed without faction affiliations."}, {"tag": "h2", "text": "Sets"}, {"tag": "p", "text": "Each set—the initial release, or Base Set, and any subsequent expansions—was available through the purchase of individual foil packs, which had a suggested retail price of $4.99. Designed to be playable in a mini-version of the game right out of the pack, each pack of the Star Wars PocketModel TCG includes:"}, {"tag": "p", "text": "The full game was played with a fleet of PocketModels of up to 30 \"build stars\" (a fleet size point limiter with units ranging in point values from 1 to 5), and a deck of 30 cards."}, {"tag": "p", "text": "The Base Set and the Ground Assault expansion contain 120 game cards (some of which are printed as foils), and 36 styrene cards of units (larger units filled an entire card, while smaller units fit 2 to 4 on a card). Units available in these packs include ground units with beige bases, and space units with black bases. Silver or gold borders around the bases indicate uncommon and rare trade value respectively. Units with silver- or gold-colored borders are generally considered more powerful than, and are not usually distributed as prolifically as, common units (units without a colored border on their bases). Rare and uncommon units usually cost more in build stars, limiting the number of powerful units included in a fleet. Common units are generally more plentiful in distribution, and are cheaper in build cost, making them easier to incorporate into a player's fleet."}, {"tag": "p", "text": "Beginning with the third set (also called the second expansion), Order 66, sets are made up of 60 cards as well as a lesser number of styrene sheet units."}, {"tag": "h2", "text": "Expansions"}, {"tag": "p", "text": "The game was planned to be released in several (over six) expansions and several supplemental products. Expansions are the way in which new cards and units were released to add to the game. However, due to the loss of the Star Wars license during the termination and sale of the WizKids company, the brand line remains incomplete."}, {"tag": "h3", "text": "Expansions produced by WizKids"}, {"tag": "h3", "text": "Expansions not released"}, {"tag": "h2", "text": "External links"}]}