{"url": "Star_Wars_Rebels:_Recon_Missions", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:2015 computer and video games", "Category:Canon mobile games", "Category:Star Wars Rebels"], "nodes": [{"tag": "h1", "text": "Star Wars Rebels: Recon Missions"}, {"tag": "p", "text": "Star Wars Rebels: Recon Missions is a mobile game developed by Gigataur and published by Disney Interactive featuring characters, locations, and technology from the Star Wars Rebels television series. The game was released on March 26, 2015 for iOS, Android, and Windows devices. It was announced in July 2016 that the app would cease operations at the end of the month."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Rebels wanted! Are you ready to stand up against the Empire? Become an intergalactic hero in Star Wars Rebels™: Recon Missions, the new action-platformer mobile game!"}, {"tag": "p", "text": "Take on 4 FREE levels of battle against the Empire as Ezra Bridger, dodge TIE fighters, blast Stormtroopers, and drive an Imperial AT-MP. With in-app purchases, wield a Lightsaber™, fight Star Wars™ bosses, drive an AT-DP, and unlock 30 more levels and 50+ unique challenges. Customize and expand a secret Rebel Haven where heroes can hide out and rescue citizens. And, interact with characters like Zeb the muscle of the Ghost team, Hera the pilot, and even Chopper the grumpy Droid™."}, {"tag": "p", "text": "Fight to save citizens of Lothal and restore hope to the Star Wars Rebels universe by joining the rebellion today! The game features enhanced shading and dynamic visual effects through Metal support, which gives players a truly unique Star Wars Rebels, experience."}, {"tag": "p", "text": "Based on the hit TV show, Star Wars Rebels™!"}, {"tag": "h2", "text": "Plotline"}, {"tag": "p", "text": "After a tutorial, where the Spectres investigate a mine, they form a secret hideout known as Haven. From there they launch a series of mission to disrupt Imperial forces and rescue Lothal citizens."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}