{"url": "Star_Wars_Rebels:_Steps_Into_Shadow", "categories": ["Category:Real-world articles", "Category:Canon television films", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Star Wars Rebels: Steps Into Shadow"}, {"tag": "p", "text": "Star Wars Rebels: Steps Into Shadow is a one-hour long, two-part television movie that served as the premiere of the third season of the animated television series, Star Wars Rebels. The television movie event was written by writers Steven Melching and Matt Michnovetz and directed by Bosco Ng and Mel Zwyer. The movie premiered on July 16, 2016 at Celebration Europe and it made its television debut on September 24, 2016 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ezra, having grown in power, leads a mission to break the crew's old friend Hondo Ohnaka out of prison. Meanwhile, Grand Admiral Thrawn -- a master Imperial strategist -- has vowed to dismantle and destroy the growing rebellion."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Prison break"}, {"tag": "p", "text": "Ezra Bridger and several other members of the Spectres including Garazeb Orrelios, Sabine Wren, and Chopper break into the Imperial prison on Naraka in order to rescue their occasional ally Hondo Ohnaka. The rebels climb under a walkway where there are two patrolling Imperial stormtroopers. Sabine pulls a stormtrooper down by his leg while Ezra attacks the second stormtrooper and throws him down the ravine. Zeb compliments Ezra for his plan. The two rebels are joined by Sabine and the team narrowly avoid an Imperial sensor light. Ezra then contacts Chopper and tells him to jump down the cliff since it is too risky for him to activate his loud rocket boosters which may alert the Imperials. Chopper reluctantly obeys and narrowly avoids falling through a sensor light when Ezra halts his descent by using the Force, Zeb then catches the astromech droid and places him on the walkway."}, {"tag": "p", "text": "Chopper then opens the door to the prison. The rebels head to cell 6609 where their ally Hondo is being held. Sabine is reluctant to rescue the scheming Weequay pirate but Ezra reassures her that they need the information he has. After unlocking the cell, the rebels also meet the Ugnaught Terba, who is Hondo's cellmate. Ezra greets Hondo while Sabine and Zeb remind the pirate that he must give them the information that he had promised. Hondo responds that Terba has the information they need. When Sabine sighs about having to rescue an extra person, Ezra replies that this is twice the fun. Sabine then spots a stormtrooper sneaking up behind Ezra."}, {"tag": "p", "text": "A firefight quickly breaks out and the rebels flee through the corridor. Ezra contacts Hera Syndulla and tells her to bring the Ghost for a \"44 scoop.\" After exchanging fire with the stormtroopers, the rebels flee down a turbolift. In the lift, Sabine hands Hondo a Mandalorian blaster and tells him to make himself useful. She also reminds him to return it. Upon exiting the lift, Ezra and Sabine shoot several stormtroopers down. Ezra then charges through several stormtroopers and cuts them down with his new green lightsaber. Terba then demands a double share but Hondo refuses, calling him a \"greedy pig.\" Terba then calls the deal off and flees through the entrance to the prison only to be blasted to death by an AT-DP walker."}, {"tag": "p", "text": "The rebels are trapped between an AT-DP walker and stormtroopers on the outside and inside of the prison. Sabine hurls a detonator through the door, which kills the pursuing Imperials behind them. Chopper then shuts the door. When Sabine reminds Ezra that they have to escape, he tells her that he has it under control. Ezra then uses the Force to take over the AT-DP driver's mind and uses him to take out the remaining stormtroopers. The pilot then drives his walker over the edge of the platform, presumably killing himself. When Sabine asks him when Kanan Jarrus taught him that, he coldly replies that Kanan did not. The rebels are then attacked from behind by stormtroopers emerging from the prison. At that moment, the Ghost dives under the bridge. At Ezra's command, the rebels and Hondo jump aboard and flee Naraka."}, {"tag": "p", "text": "Once aboard the Ghost's cockpit, Hera asks Zeb and Ezra whether the Imperial walker was helping them. Zeb replies that Ezra used a mind trick on the pilot. Ezra meanwhile replies that he did what he had to do. Sabine and Hondo then enter the cockpit. Hondo thanks the rebels for rescuing him but demands to be paid. After Sabine mentions that Hondo's mate Terba perished during the prison escape, Hera reprimands Ezra and tells him that he should have been responsible for everyone in the mission. Ezra angrily replies that he was responsible for only the details that he knew before storming out. An angry Ezra returns to his room where he blames Terba for his own death. Ezra also tells himself that the rebels would never have succeeded without him. Presence, the entity inhabiting the Sith holocron, tells him that his anger gives him strength. When she asks the youth what he needs, Ezra responds that he wants to become more powerful and stronger so that no one can hurt his friends again."}, {"tag": "h3", "text": "Plans in motion"}, {"tag": "p", "text": "Meanwhile on an Imperial Star Destroyer, Governor Arihnda Pryce enters Grand Moff Wilhuff Tarkin's office for a private meeting. When Tarkin asks her how things are going on Lothal, Pryce responds that everything on the planet is secure apart from the recent rebel attack on Naraka's prison. She fears that the rebels will pose a larger threat to the Empire in the future. Tarkin agrees and notes that while Darth Vader had dealt with the rebels' Jedi leadership, the Phoenix Cell has proved particularly stubborn. Tarkin then asks what Pryce for her suggestions on what the Empire should do next. Pryce responds that she wants the Seventh Fleet. When Tarkin asks her about her thoughts on Admiral Kassius Konstantine, Pryce tells him that he is more of a politician than a career officer. Pryce adds that she needs someone who sees the bigger picture. Pleased, Tarkin grants her command of the Seventh Fleet."}, {"tag": "p", "text": "On Atollon, Hondo asks for his payment but Hera responds that his rescue is payment. When Hondo tells her that he needs a starship and suggests the Ghost, Hera tells him to backoff. Hondo then says that he wants a starship with a hyperdrive, moving cargo hold, shields, and a crew. Commander Jun Sato then reminds Hondo that he will only honor the deal if his information is proven useful. Hondo then tells the Phoenix rebel leadership about the Imperial demolition station called Reklam Station, which is located on the planet Yarma. Based on Terba's information, Hondo tells them that thousands of decommissioned Republic Y-wing starfighters are being dismantled for scrap at Reklam Station. He adds that Terba had worked as a laborer there before being imprisoned for trying to escape."}, {"tag": "p", "text": "When Hera queries about the age of the starfighters, Rex tells her that the Y-wings are old but reliable combat fighters. Ezra then advocates proceeding with the mission but Hera suggests sending a scouting party to probe Reklam Station to verify Hondo's information. Hondo is unhappy that the rebels still don't trust him. Pleased with Ezra's performance during the previous mission, Sato appoints him lieutenant commander of the Mission to Reklam Station. Sabine, Zeb, and Hera congratulate Ezra. When Hera tells Ezra that his master Kanan would have been proud, Ezra shrugs that his master is never around."}, {"tag": "p", "text": "Meanwhile, Kanan meditates at the outskirts of Chopper Base near the sensor beacons. He then hears a voice calling out to him from the wilderness. Hera then comes up behind him and tells Kanan that she had expected to see him at the briefing. She also tells Kanan that Ezra blames himself for what had happened during the previous mission to Malachor to Kanan and Ahsoka Tano; who is presumed dead. Kanan tells her that he holds no ill will towards Ezra. Hera says he should talk to Ezra. Later, Kanan enters Ezra's room and senses the Sith holocron on the table. Ezra is reluctant to talk to Kanan since he is about to embark on his mission to Reklam Station. Kanan is unhappy that his apprentice has been learning about the dark side. An argument breaks out between the master and apprentice. Ezra insists that he is using the Sith holocron for good but Kanan responds that acting out of anger is a trap that leads to the dark side. When Kanan takes the holocron, Ezra storms out of the room but not before telling his master that he doesn't need him nor the holocron."}, {"tag": "h3", "text": "Separate journeys"}, {"tag": "p", "text": "Later, Ezra and his fellow rebels including Rex and Hondo travel to Reklam Station on the Phantom. Sabine tells them that they cannot travel directly to the Yarma system and must drop out of hyperspace at Sereeda Waypoint. Hondo points out that Sereeda Waypoint is located in Mining Guild territory and that doing so would jeopardize their mission and his payment. Sabine replies that they have to try while Chopper activates the hyperdrive under her command. Meanwhile, Kanan is meditating outside Chopper Base when the voice tells him to come closer. Kanan takes a sensor beacon to ward off the krykna, large spider creatures native to Atollon."}, {"tag": "p", "text": "Back in space, the Spectres exit hyperspace at Sereeda Waypoint only to be cornered by a Mining Guild space patrol, who demands that they identify themselves and state their business. Ezra apologizes for the intrusion but the Mining Guild captain responds that they have made an unauthorized jump into Mining Guild territory. When the captain orders them to slow down, Sabine speeds up the Phantom. The Phantom is soon pursued by two TIE/mg Mining Guild starfighters but Chopper and Sabine shoot down the ships with laser cannons. Sabine then orders Chopper to jump into hyperspace. When Ezra insists on finishing off the last remaining Mining Guild ship in order not to leave witnesses, Rex backs Sabine up and they make the jump into hyperspace."}, {"tag": "p", "text": "Meanwhile on Atollon, the voice leads Kanan to a series of mesas in the wilderness. There, Kanan encounters a massive creature known as Bendu. Bendu tells Kanan that his imbalance awoke him from his slumber. Kanan quickly deduces that the creature is another Force wielder. Bendu replies that while the Jedi and the Sith wield the Ashla and the Bogan, he is the one in the middle. The stranger introduces himself as Bendu while Kanan identifies himself as a Jedi Knight and tells him that he fears that his apprentice Ezra is turning to the dark side."}, {"tag": "p", "text": "Kanan then shows Bendu Ezra's Sith holocron. Bendu examines the holocron and remarks that an object could be used for both good and evil. He adds however that a person can choose to change themselves. When Bendu asks Kanan about his sensor marker, Kanan tells him that it keeps the krykna away. Bendu then destroys the machine and tells Kanan that he is trying to help him. When Kanan argues that he needs the sensor marker for his own protection, Bendu tells him that his eyes cannot be healed but that he can teach Kanan to see with his other senses."}, {"tag": "h3", "text": "Enter Thrawn"}, {"tag": "p", "text": "Aboard an Imperial Star Destroyer, Admiral Konstantine tells Grand Moff Tarkin that Governor Pryce is overestimating the threat posed by the Phoenix rebels. He dismisses them as a small local insurgency that does not constitute a large-scale galactic-wide threat to the Empire. At that point, Grand Admiral Thrawn enters the room and responds that he would like the insurgency to remain that way. Tarkin introduces the Grand Admiral, who tells the other Imperials including Pryce and Agent Kallus that the Emperor had recently promoted him to that position for his victory at Batonn. When Kallus comments that the civilian casualties outnumbered the insurgent casualties, Pryce responds that Thrawn had eradicated the rebel presence in the Batonn sector."}, {"tag": "p", "text": "When Tarkin asks Thrawn about what he thinks of Governor Pryce's theory about the rebels in the Lothal sector, Thrawn brings up a hologram about the rebels' recent rescue of Hondo Ohnaka from Naraka's prison. He adds that within an hour of Hondo's rescue that Phoenix Group had destroyed Mining Guild starships at Sereeda Waypoint. While they may seem unrelated, Thrawn points out that Hondo's cellmate Terba was a laborer at Reklam Station, which is just one jump away from the waypoint. Governor Pryce tells her fellow officers that Thrawn thinks the rebels plan to raid Reklam Station and steal the starfighters for their fleet. Thrawn adds that the expansion of the rebel fleet is a threat to the Emperor's plans and the Empire. Thrawn vows to tear the rebels apart piece by piece and that he would turn them into the architects of their own destruction."}, {"tag": "h3", "text": "Heist at Reklam Station"}, {"tag": "p", "text": "Meanwhile, the Phantom arrives above Yarma. While Sabine cannot see anything, Hondo reassures her that it is within the gas planet. Sabine and Chopper eventually spot the station within the gassy atmosphere of Yarma. The two see the Y-wings being dismantled and quickly estimate that only fourteen starfighters are left. Ezra tells them to move it but Zeb reminds him that they are only on a reconnaissance mission. Ezra reiterates that he was given command of the mission and that he is changing their plan. Sabine reluctantly complies with the young Jedi. After the Phantom bumps into an Imperial DTS-series Dismantler Droid, Zeb expresses anger towards Hondo for keeping this information from them."}, {"tag": "p", "text": "At Reklam Station, an Imperial officer informs Commander Brom Titus about the perimeter breach and that he has activated the dismantler droids. Titus thinks that it is the rebels that Governor Pryce had warned them about. A dismantler droid closes in on the Phantom but Chopper shoots it down with the ship's rear cannon. Rex then opens the rear exit and fights with another dismantler droid, which he calls a clanker. He almost falls out but Zeb grabs his ankle and pulls him back into the ship. Rex manages to destroy the dismantler droid. However, the Phantom is hit and the ship loses power and begins plummeting into the depths of Yarma. Back at the station, Titus is tracking the movements of the dismantler droids and the Phantom. Sabine regains control of the ship and docks beneath the station. After losing contact with the dismantler droids, Titus orders his men to alert Governor Pryce."}, {"tag": "p", "text": "Ezra and his fellow rebels park the Phantom beneath a platform and board the station. Ezra orders his comrades to shut down the conveyor belt. Shortly later, they encounter several Ugnaught workers. Hondo speaks to the Ugnaughts and wins them over by telling that that he was Terba's friend and that the rebels have come to liberate them. Ezra gets Hondo to tell the workers to shut down the plant. When Commander Titus asks Laborer 429 why the conveyor belt has shut down, the Ugnaught tells him that it has malfunctioned. Titus then angrily tells the laborer to repair the conveyor belt or he would be thrown down Yarma's atmosphere. Having stopped the conveyor belt, Ezra orders his team to prepare the Y-wings for takeoff but Sabine points out that they have to be refueled first. Rex comments that this would not be their first or last complication while Zeb adds that Kanan would have loved this mission."}, {"tag": "h3", "text": "Kanan's trials"}, {"tag": "p", "text": "Meanwhile, Kanan asks Bendu how he should regain his sight. Bendu tells him to empty himself and to turn behind and walk forward. Bendu can see two krykna spiders watching Kanan but Kanan can only perceive them through the Force. Kanan admits that his encounter with the krykna had been influenced by their foul smell. Kanan is soon surrounded by the two krykna but they do not attack him. Bendu explains that Kanan's hostility towards them stemmed from not seeing them for what they are. Kanan begins making peace with the krykna when he suddenly senses that Ezra is in trouble and flashes his blue lightsaber. Kanan then realizes that the krykna had been hostile earlier because they had been feeding off his fear, anger, and hatred."}, {"tag": "p", "text": "After Kanan deduces that he has isolated himself from everyone and the Force, Bendu tells him that he has regained his sight by rediscovering his connection to the Force. Kanan then tells Bendu that he has to leave in order to help Ezra and his team. Since he can sense the krykna spiders through the Force, he has no fear of them. Kanan then tells Bendu to keep the Sith holocron as a gift. Behind him, Bendu laughs."}, {"tag": "h3", "text": "Stealing the Y-wings"}, {"tag": "p", "text": "Back at Reklam Station, the rebels have refueled the remaining Y-wing starfighters. However, they are spotted by a dismantler droid. Commander Titus dispatches a squad of stormtroopers, overrides the conveyor belt, and activates the magnetic locks. This traps the Y-wings and the rebels. In response, Hondo contacts the Ugnaught workers, who tell him that everything has been overriden by the control tower. Ezra and Rex go to deal with the control tower and orders Sabine and the others to finish refueling the ships. After Ezra and Rex leave, Chopper is ambushed by a dismantler droid and hurled onto the canopy of a Y-wing. The dismantler droid then leaps onto the Y-wing that Sabine is standing on and causes her to lose her balance. Zeb manages to grab onto to her while holding a rope. Sabine and Zeb then exchange fire with the dismantler droid but it begins to shake the fighter. Ezra sends Rex to save Sabine, Zeb, and Chopper while he goes to shut down the control tower."}, {"tag": "p", "text": "Hondo and the Ugnaughts follow Ezra into the complex. Ezra climbs a ladder and discovers a Sentinel-class landing craft insider a hangar. Ezra is soon attacked by several stormtroopers but fights back with his lightsaber. At the point, he is contacted by Hera who demands to know what is going on. Ezra claims that everything is alright but Commander Sato immediately deduces that Ezra's recon mission has turned into a recover mission. Hera and Sato give orders to mobilize the Phoenix rebel fleet. Aboard the Ghost, Hera is joined by Kanan, whom she is glad to see. The two then depart for Reklam Station."}, {"tag": "p", "text": "Back at Reklam Station, Rex uses a crane to lift the dismantler droid and then challenges it to a fight. He uses the crane to trap the droid against a metal container before throwing it into Yarma's depths. The droid explodes into flames as soon as it lands in the planet's volatile gas-filled depths. Rex then rushes to help Sabine, Zeb, and Chopper. Meanwhile, Ezra is surrounded by stormtroopers but takes them out with his lightsaber and Force powers. Hondo and the Ugnaughts soon follow and offer to guard the shuttle while Ezra rushes to confront the commander."}, {"tag": "p", "text": "In the command center, Commander Titus assures Governor Pryce he will capture the rebels. Pryce wishes him well and tells him that she will be coming to reinforce him. Ezra storms the command center and takes out Titus' stormtroopers. He and Brom recognize each other from their earlier encounter involving the top-secret Imperial Interdictor, which is classified as a Star Destroyer. Titus has been demoted to running a junkyard for his incompetence and sees capturing the rebels as an opportunity to regain his former rank as Admiral. Ezra uses the Force to destroy Titus' blaster and then disarms the Imperial officer. He then repeats his demand for Titus to unlock the bombers."}, {"tag": "p", "text": "Titus responds that he had sabotaged the control unit and that the only way to unlock them is to cut power to the entire station. Ezra is about to destroy the power unit but Titus points out that doing so would send everyone aboard the stations including his rebel friends to a fiery demise. Ezra responds that his friends would be fine but not the commander. Ezra uses his lightsaber to cut power to the station while the commander orders an evacuation. Meanwhile, Sabine and Zeb sense the magnetic locks have been unlocked. When Sabine asks about the sound, Ezra tells her that he has shut down the station's power and that he will escape on the Phantom. Sabine tells Chopper to tap into the relay navigation system and to remote-pilot the Y-wings. Chopper protests but Zeb shoves him into a Y-wing's astromech socket."}, {"tag": "p", "text": "Meanwhile, Hondo and the Ugnaught laborers escape in the Imperial landing craft. Aboard the lead Y-wing, Rex tells Chopper to stop complaining and to get the Y-wings airborne. Chopper remote-pilots the Y-wings which fly into space. Before they can jump into hyperspace, Chopper, Sabine, and Rex discover that the Imperials have removed them. The Y-wings travel to space but are blocked by an Imperial Star Destroyer that is commander by Pryce, Konstantine, and Kallus. The Star Destroyer releases a swarm of TIE fighters. Sabine remarks karabast which prompts Zeb to remark that she learned something from him. Back at the station, Ezra tries to reach the Phantom but the platform breaks apart and falls down with the Phantom into Yarma's volatile depths. Ezra tries to contact Sabine but cannot reach her. In desperation, he calls to his master Kanan for help."}, {"tag": "h3", "text": "Showdown above Yarma"}, {"tag": "p", "text": "In space, Sabine and the other rebels engage in a dogfight with the TIE fighters. Fortunately for Sabine's team, the Ghost and the Quasar Fire-class cruiser-carrier Phoenix Nest emerge from hyperspace. Hera orders Sabine and her team to get their Y-wings aboard the fighter-carrier. The Y-wings begin landing inside the carrier."}, {"tag": "p", "text": "Aboard the Star Destroyer, Governor Pryce orders Kallus to contact Grand Admiral Thrawn. Hera and Kanan fly the Ghost to Reklam Station. Inside Yarma's atmosphere, they spot Ezra clinging on for dear life. Kanan goes to the rear hangar bay to rescue the boy. While Ezra is afraid to jump, Kanan convinces him to let go of his fear and to trust him. The station crashes into the depths of Yarma and explodes. Back in space, the rebels fight with the Imperial fleet."}, {"tag": "p", "text": "Kallus, Konstantine, and Pryce watch the battle from the bridge of their Star Destroyer. Kallus then informs Pryce that they have received a transmission from Thrawn. With Thrawn online via hologram, Pryce tells the Grand Admiral that the battle had unfolded as he had anticipated and that the rebel fleet, which consists of three battle cruisers, has come to the rescue. Thrawn responds that this is not the rebel fleet and orders his subordinates to allow the rebels to escape with their \"meager rewards.\" Governor Pryce complies with Thrawn's orders. When Konstantine expresses puzzlement, Pryce tells him that Thrawn has a much larger objective in mind that the capture of a single rebel cell. Meanwhile on the Ghost, Ezra says he can explain what happened to the Phantom but Hera tells him to save it for later. She tells Commander Sato to get them out of here and the Phoenix rebels flee into hyperspace."}, {"tag": "h3", "text": "Homecoming"}, {"tag": "p", "text": "Back at Chopper Base, Hera reprimands Ezra for disobeying orders, endangering his team, and destroying the Phantom. When he points out that the rebels had secured five Y-wing starfighters, Hera responds that he disobeyed her orders and suspends his command. When Zeb vouches for Ezra and suggests suspending him and the other team members, Hera points out that the mission had been Ezra's responsibility. Hera then tells Sabine that they have orders to deliver their Y-wings to General Jan Dodonna's unit, which is part of the rebellion that grows day by day. Sabine agrees with Hera's view that they need all the help they can get if they want to defeat the Empire."}, {"tag": "p", "text": "Later, Ezra apologizes to his master Kanan for using the Sith holocron. When Ezra asks Kanan what he did with it, Kanan tells him that it is safe. Ezra also thanks Kanan for coming back to save him. Kanan tells his apprentice that he always comes back and the two reconcile."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This premiere episode was originally broadcast as one episode, and the episode was kept that way for its release on digital video storefronts, such as iTunes. However, in the videodisc release of Season 3, the episode was split into two parts, with the first part ending during the Phantom's descent towards Reklam Station."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}