{"url": "Battle_for_the_Razor%27s_Kiss", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Hunt for Zsinj", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle for the Razor's Kiss"}, {"tag": "p", "text": "The battle for the Razor's Kiss was a battle in 7 ABY between General Han Solo's New Republic fleet and the forces of Warlord Zsinj, for the possession of the Super Star Destroyer Razor's Kiss."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "This battle occurred almost immediately after the Battle of Kuat, as soon as the New Republic forces were able to track Zsinj's fleet."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "When Zsinj escaped with the Razor's Kiss, he only made a short quick jump away from Kuat. He then reverted to realspace both to pay the pirates who had assisted him and counting his losses, while Captain Raslan's team finished securing the Razor's Kiss. Raslan reported to Zsinj that the Super Star Destroyer was fully functional except for the hyperdrive who was expending too much power when operating. Zsinj waved that problem away, and shared a moment of triumph with his trusted second-in-command, General Melvar. As both men commented on the success of their operation, they were interrupted by Iron Fist's Captain Vellar, who reported the appearance of a Mon Calamari Star Cruiser and accompanying ships straight ahead of them. The Warlord immediately ordered a coordinated hyperspace jump for both Star Dreadnoughts, but Mon Remonda moved directly in the Super Star Destroyers' paths, preventing them a clear line out of the system. Instead of changing course, Zsinj amended his orders to both of the ships, commanding to bring all turbolasers to bear on the cruiser, with the intent of finally killing his nemesis Han Solo."}, {"tag": "h3", "text": "Parasite One strikes"}, {"tag": "p", "text": "When she saw the Razor's Kiss deflector shields power up, Shalla Nelprin, who thanks to her previous initiative during the takeover of the destroyer had managed to commandeer a hyperdrive-equipped TIE Interceptor and attach herself to the hull of the Super Star Destroyer as Parasite One, restarted her starfighter and proceeded to blow both shield generator domes on Razor Kiss' command tower, before destroying the bridge transparisteel viewport. She then passively landed back onto the tower, waiting for an opportunity to escape. She would do so minutes later, when the New Republic fighters had engaged the Razor's Kiss, and rejoined her fellow Wraiths in battle."}, {"tag": "h3", "text": "The battle unfolds"}, {"tag": "p", "text": "Zsinj quickly ordered Iron Fist to adopt a defensive position ahead of the unshielded Razor's Kiss, and launched all his starfighters. Wedge Antilles, commander of the starfighter portion of Solo's forces, ordered all squadrons to fire proton torpedoes at Razor Kiss. Because the New Republic squadrons had blown out the bridge, the ship did not respond to Iron Fist's communications. Just as the vessel was considered lost, they received a response from Razor Kiss. A Kuati stormtrooper had taken over the auxiliary bridge by killing one of Zsinj's men there, and was trying to retake Razor's Kiss to Kuat, but, faced with the ship's destruction, he opted to collaborate with Zsinj instead. Zsinj quickly patched him trough to his communication officer, and both men managed to slave Razor's Kiss helm and engines to the Iron Fist."}, {"tag": "p", "text": "Wedge Antilles meanwhile ordered the Rogue Squadron to engage the TIEs, while the Wraiths accompanied the Polearms and their B-wings in attacking Razor's Kiss. Just as Iron Fist began firing on Mon Remonda, General Solo ordered all starboard batteries to fire back. Mon Remonda kept changing its position, and due to the natural shape and configuration of the ship, it could bring down more of its guns. The ship fired constant and full broadsides while Iron Fist could only use those forward turbolasers that could suppress far enough to keep the cruiser in range. Confronted with this, Zsinj ordered his ship to fire on the engines to stop the ship in space."}, {"tag": "h3", "text": "Parasite Two strikes"}, {"tag": "p", "text": "As battle raged, the numerical superiority of Zsinj fighters began to take it's toll, but as the tiding looked grim for Wraith Squadron, they were rescued by an old friend. General Crespin, leading the Screaming Wookiee Y-Wing trainee squadrons entered the fight, using concentrated fire to overwhelm any TIE in his squadron's path. Wedge then ordered the B-Wings to form up with Crespin and continue their runs on both Super Star Destroyers while releasing Wraith Squadron from escort duty and ordering them to help the Rogues and Polearms."}, {"tag": "p", "text": "Zsinj eventually did knock out Mon Remonda's engines, but before he could even give further orders, an explosion occurred which rocked the bridge. Voort saBinring, who had previously half crashed on Iron Fist bridge as Parasite Two was able to bring his fighter back online and fire at the ship's port-side shield generator dome until it exploded, reducing Iron Fist shields by fifty percent on his exposed side. To avoid giving the Mon Remonda an opportunity to damage Iron Fist severely, Zsinj ordered for all personal aboard Razor Kiss to abandon ship, and for all TIEs to be recalled back to Iron Fist."}, {"tag": "p", "text": "Wedge and the rest of the squadrons began to fire at the TIEs retreating back to Iron Fist, taking down more in that timeframe than in the entire battle. As the two capital ships exchanged fire, Razor Kiss began to fire off escape pods. Iron Fist then hyperspaced out, leaving Razor Kiss intact in the New Republic's hands, until the ship self-destructed, sending debris in all directions."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "While costly, the battle for the Razor's Kiss was a New Republic victory, since they managed to destroy Zsinj's newly acquired Super Star Destroyer. Shalla Nelprin got promoted to Lieutenant and was assigned half of Razor's Kiss kill, allowing her to paint one half of a SSD on her cockpit. Zsinj ordered all possible debris from Razor's Kiss salvaged. Foreseeing a possible defeat in the future, he would use those with an orbital nightcloak to fake the destruction of Iron Fist later in the campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}