{"url": "Star_Wars_Resistance", "categories": ["Category:Real-world articles", "Category:Canon animated television series", "Category:Star Wars Resistance"], "nodes": [{"tag": "h1", "text": "Star Wars Resistance"}, {"tag": "p", "text": "Star Wars Resistance is an animated television series that premiered on October 7, 2018, and concluded on January 26, 2020, having aired on Disney Channel. The series was created by Dave Filoni and executive produced by Athena Yvette Portillo, Justin Ridge, and Brandon Auman. It stars Christopher Sean, Suzie McGrath, Scott Lawrence, Myrna Velasco, Josh Brener, Donald Faison, Bobby Moynihan, and Jim Rash, with appearances from Oscar Isaac as Poe Dameron and Gwendoline Christie as Captain Phasma."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The series is set between the events of Star Wars: Episode VI Return of the Jedi and Star Wars: Episode VII The Force Awakens, in a time when the Resistance is still learning about the growing threat of the First Order. It centers on the character of Kazuda Xiono, a young pilot in General Leia Organa's Resistance who is tasked with spying on the growing threat of the First Order."}, {"tag": "p", "text": "Slashfilm reported November 12, 2018 that a more specific timeline was revealed in episode 1.6 of Resistance Rewind. In that episode, executive producer Justin Ridge let slip that Star Wars Resistance takes place six months before the events of The Force Awakens, revealing: \"Because this series takes place six months before The Force Awakens we have a lot of connective tissue to what we see in the movie. So eventually our events in the show will parallel what happens in the movie.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars Resistance was created by Dave Filoni, head of Lucasfilm Animation who led the creative team on Star Wars: The Clone Wars and Star Wars Rebels. The inspiration for the series was Filoni's interest in World War II aircraft and fighter pilots, with his grandfather's time as a pilot during the war being a particular influence on him. In the announcement of the series, Filoni noted that the series would capture the sense of excitement around high-speed racing, which Star Wars had depicted in many stories over the years. Executive producer Justin Ridge elaborated: \"It was a concept Dave came up with: he wanted to have a show that went more into 'How is the First Order gathering materials? What is the First Order doing before The Force Awakens?' It grew from that initial seed.\" For the show's setting, Filoni was also inspired by the sitcom Cheers; Executive producer Athena Yvette Portillo explained this to StarWars.com: \"He said, 'I want a show that takes place in one set that you go to constantly. You get to know the patrons, you get to know the people, and you introduce new characters…and it's all about their way of life'\""}, {"tag": "p", "text": "Resistance begins six months prior to the Battle of Starkiller Base, and eventually crosses over with the events of Star Wars: Episode VII The Force Awakens. When the series began development, the creative team was unsure of the details of Star Wars: Episode VIII The Last Jedi and Star Wars: Episode IX The Rise of Skywalker, so they had to be careful to avoid any possible continuity conflicts with those films. The show was planned to last only two seasons, so as to bridge the gap between the two films."}, {"tag": "p", "text": "In September 2016, Disney Television president Ben Sherwood revealed that he had been working with Lucasfilm on a new animated series. When the third season of Star Wars Rebels debuted, it was announced that Filoni had stepped down as Supervising Director, in of helping to develop \"future animation development.\" Pablo Hidalgo revealed that Filoni and crew were working on the new series as of September 2017. In February 2018, it was reported that Lucasfilm Ltd. filed a trademark for the name Star Wars Resistance (rumors of such a series had stretched back to 2014). The series was officially announced on April 26, 2018 for a debut in the fall of that year. Despite creating the show, Filoni confirmed in an August 12 interview that he would not be working as directly in a day-to-day capacity on Resistance as he had on previous projects, given his work on the revival of The Clone Wars, but he would still provide notes and direction to the story team, a role Filoni compared to George Lucas' input on The Clone Wars. The show's animations were produced by Polygon Pictures. They are rendered in CG and based on the anime animation style, with major inspirations being Robotech, Lupin the Third and the films of Hayao Miyazaki. Many of the show's designs are based on unused original trilogy concept sketches from artists such as Joe Johnston, Ralph McQuarrie and Nilo Rodis-Jamero."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "Star Wars Resistance premiered on October 7, 2018. In the days leading up to the premiere, the show had a presence at the 2018 New York Comic Con; a life-sized model of the Fireball was present, and Hasbro released a toy line based on the series."}, {"tag": "p", "text": "On August 4, 2019, it was announced that the second season would premiere on October 6, 2019 when the Season 2 trailer was released. It was also revealed to be the final season of the show."}, {"tag": "h3", "text": "Critical reception"}, {"tag": "p", "text": "In 2019, the first season was nominated for an Emmy for \"Outstanding Children's Programming,\" and won a Saturn for \"Best Animated Television Series.\" In 2020, the second season was also nominated for an Emmy for \"Outstanding Children's Program.\""}, {"tag": "h3", "text": "Home video"}, {"tag": "p", "text": "The first season was released on DVD on August 20, 2019."}, {"tag": "p", "text": "Both seasons are available on the Disney+ streaming service; The first season was available at launch on November 12, 2019, whereas the second season became available on February 25, 2020."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Seasons"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}