{"url": "Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Wizards of the Coast sourcebooks"], "nodes": [{"tag": "h1", "text": "Star Wars Roleplaying Game Saga Edition Core Rulebook"}, {"tag": "p", "text": "The Star Wars Roleplaying Game Saga Edition Core Rulebook is the main rulebook for Saga Edition, the latest and final roleplaying game (RPG) system released by Wizards of the Coast. Released on June 5, 2007, the game system was an update and overhaul of the previous Star Wars Roleplaying Game. Previous versions of the Core Rulebook include the Star Wars Roleplaying Game Core Rulebook (2000) and the Star Wars Roleplaying Game Revised Core Rulebook (2002)."}, {"tag": "p", "text": "The Saga Edition Core Rulebook includes statistics from all of the Star Wars films as well as the Expanded Universe. Significant changes from the previous rules system include:"}, {"tag": "p", "text": "Many combat examples in the book have been illustrated using Star Wars Miniatures pieces in place of characters."}, {"tag": "h2", "text": "Basic Summary"}, {"tag": "p", "text": "Saga Edition is based on the d20 system, which uses a twenty-sided die for most of its core mechanics, such as determining the outcome of skill checks and attack rolls. For damage rolls, health, and starting credits, other dice are used, such as ten-sided, four-sided, six-sided, and twelve-sided dice."}, {"tag": "p", "text": "Unlike the fourth-edition RPG Dungeons and Dragons (which is published by the same company), there are only five base classes: Jedi, Noble, Scout, Scoundrel, and Soldier. The Jedi class is proficient with lightsaber combat and use of the Force. Although generally used for actual Jedi, the class is also occasionally used for other Force-sensitives of similar skills such as Sith or Jensaarai. The Noble class is primarily focused on social skills such as deception and persuasion, as well as the ability to boost their allies. However, they have low combat abilities. The Scoundrel class offers the ability to focus on various skills such as computer slicing, piloting, stealth, and mechanics, as well as abilities that impede their opponents. The scoundrel is usually seen as the \"Han Solo\" of the group. The Scout class can focus on exploration, tracking, survival, stealth, or piloting. The Soldier class is highly proficient at combat, with the ability to use a variety of weapons and armor. There are also Prestige Classes which can be selected at higher levels. These allow for greater specialization of abilities."}, {"tag": "h2", "text": "Additional Materials"}, {"tag": "h2", "text": "Awards"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}