{"url": "Star_Wars_Trading_Card_Game", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Star Wars Trading Card Game"], "nodes": [{"tag": "h1", "text": "Star Wars Trading Card Game"}, {"tag": "p", "text": "The Star Wars Trading Card Game is a game that was produced by Wizards of the Coast after the license for collectible card games was given to that company at the end of 2001. Prior to this, Decipher held the license, and used it to produce the Star Wars Customizable Card Game, Young Jedi Collectible Card Game, and Jedi Knights Trading Card Game. Near the end of 2005, Wizards of the Coast announced that the Star Wars Trading Card Game would be put on indefinite hold, although they would still retain the license. However, an announcement was made on January 28, 2010, stating that, \"with the economic downturn,\" the license to produce all of their Star Wars lines would be allowed to expire in May of that year with no renewal. After the license expired, Wizards of the Coast no longer produced any Star Wars–related material."}, {"tag": "p", "text": "After Wizards of the Coast stopped making the cards, a nonprofit, player-elected community called the Independent Development Committee, or IDC for short, began making virtual cards that can be downloaded and printed out to continue game play. They currently have twenty-three expansions available for download."}, {"tag": "h2", "text": "Game play"}, {"tag": "p", "text": "In the Star Wars TCG, unit cards are placed in three different arenas: Space, Ground, and Character. The object of the game is to control two of these three arenas. To control an arena, one of the two sides (Light or Dark Side) must be the only one with a unit(s) in that arena, if either side has cards in an arena while the other side does not, they control that arena. To kill enemy cards, thus removing them from the arena they were in and placing them in the discard pile, the cards must fight each other. These battles take place in the arenas: Space cards fight in Space arena, Ground cards in the Ground arena, etc."}, {"tag": "h3", "text": "Cards"}, {"tag": "p", "text": "There are seven different types of cards: Space (colored blue), Ground (green), Character (purple), Battle (red), Mission (yellow), Location (depending on the arena they are played in), and Equipment (silver). Each player picks up one card each turn, during the Command Phase. If you run out of cards, then nothing special happens; simply keep playing with the cards you have until you win or lose the game."}, {"tag": "h4", "text": "Unit cards"}, {"tag": "p", "text": "Space, Ground, and Character cards all fight in their respective arenas (unless using a special ability). These units all cost build points to deploy and start in the deck. Space, Ground, and Character cards are all referred to as unit cards; other cards are not unit cards."}, {"tag": "p", "text": "Ground units represent infantry and vehicles. In the earlier sets before Location cards were created, Ground cards also represented locations. Characters represent individuals, including individual droids. Space cards represent all starships."}, {"tag": "h5", "text": "Contesting units and bidding"}, {"tag": "p", "text": "A contested unit is a unit of which the other player has a unit with the same name in play (if there's one with the same name on your side then they need to be stacked, see \"Stacking units\" section below), some units have different names but should be treated as having the same, these units are Anakin Skywalker and Darth Vader, Beru Lars and Beru Whitesun, Padmé Amidala and Queen Amidala, Chancellor Palpatine and Emperor Palpatine and Darth Sidious."}, {"tag": "p", "text": "To contest units each player bids Force, if there is two pairs of contested units then the Dark Side chooses which to bid on first. The Dark Side starts by making a bid of zero or more, the Light Side player then makes their bid of zero or more. The bidding goes on until one player stops or runs out of Force (you can't bid more than your total Force or less than the last bid). Once the bidding has ended each player adds up the total build cost of all their units, stacked units count as one, and adds it to the amount of Force they last bid. Whichever player ends up with the highest number wins, as always, Dark Side wins draws. The player who wins then pays the Force of his last bid and may keep his contested unit in play. The player who loses retreats their contested unit. The player who loses doesn't have to pay any Force."}, {"tag": "h5", "text": "Stacking units"}, {"tag": "p", "text": "When you're building a unique unit which has the same name as a unique unit you already have in play on your side then you do things slightly differently (if there's one with the same name on your opponent's side then they are contested, see \"Contesting units\" section above). There are some units that should be treated as if they have the same name. (For these units see the \"Contesting units\" section above.) Anyway, first, with stacking units, if the new unit's build cost is less or equal to that of the units that are already in play (if you're adding to a stack then go by the top card's build cost), then you only need one build point to deploy the new unit. You may put the new unit at the top or bottom of the stack. Bear in mind that only the top card will \"be used\" as such. Every card underneath the top card gives the top card +10 speed, +1 power and +1 health; you can't use the special abilities of the cards under the top card. Once you've put the new card in the stack you're finished."}, {"tag": "p", "text": "Now if the new card's build cost is more than the old card, things get different again. You start the same, you only need one build point, if you want to put the new card under the old card then you may do so, and you're done. If, however, you want to put the new card on top of the old one you must first figure out the difference in cost between the old and new card, and then pay that in build points, you then put the new card at the top of the stack and you're done."}, {"tag": "p", "text": "A few things to bear in mind with stacking units. You can't have more than one of the same version unit in a stack (so you couldn't have Anakin (A) and Anakin (A) in the same stack, but you could have Anakin (D) and Anakin (B) in the same stack). You can't put more cards into a stack that already has four units in it. You can only stack unique units. Treat a stack as if it were a single unit. If the stack dies, then every card in the stack dies. Ignore all effects to cards underneath the top one."}, {"tag": "p", "text": "To rearrange the cards in a stack, during your build phase find the card you want to move to the top. If that card has a smaller or equal build cost to the unit currently on top, then move it up for free. If the unit you want to move to the top of the stack has a greater build cost than the unit currently at the top, then you pay the build cost difference between the two units in build points, and then move the unit you want on top of the stack to the top. If you have a pilot in the stack, and the stack is currently piloting, then if you rearrange the stack you must move it into the appropriate arena, or, if the card getting moved to the top is a pilot, to what every the new unit pilots."}, {"tag": "h4", "text": "Battle cards"}, {"tag": "p", "text": "Battle cards are red colored cards that are normally played during the Battle step to cause an effect (e.g. prevent damage, add extra power etc.). Battle cards normally cost Force, and are built in your hand, you have to build Battle cards in one go. Battle cards can be played at any pass-or-play chance, which you'll be told about in \"playing the game\"."}, {"tag": "h4", "text": "Mission cards"}, {"tag": "p", "text": "Mission cards are yellow colored cards that normally cost build points. When a Mission card has build points equal to its build cost on it, then turn it around, do what it says, and then discard it. Mission cards are built in the Build zone."}, {"tag": "h4", "text": "Location cards"}, {"tag": "p", "text": "Location cards give both the players a continuous special effect for an arena (e.g. give all neutral units +2 health). Location cards cost build points and are deployed the same way as a unit card, Location cards color varies depending on what arena it's in (blue for Space, green for Ground and purple for Character). There are three different types of Location cards: Location – Space, Location – Ground and Location – Character, all three of these are deployed in their respective arena, you may only have one Location card for each arena, so when a Location card is put into play in an arena where a Location card is already in play, then, if the new Location cards build cost is more than the old Location cards, the new one replaces the old and the old one gets put in the discard pile. If the cost of the new Location is less than the old ones then the player wishing to deploy the new Location card must first pay Force equal to that of the old Location cards. You may have as much as three Location cards in play, so long as they are in separate arenas (Ground, Space and Character). The position of a Location card while in play is in-between the Dark Side's area and the Light Side's area."}, {"tag": "h4", "text": "Equipment cards"}, {"tag": "p", "text": "Equipment cards are silver cards that give bonuses to the units they are attached to (e.g. give +3 power to equipped unit). Equipment cards are built in the same way as unit cards, they cost Force and are built in the Build zone. As soon as an Equipment card has build points on it equal to its build cost, turn it the right way up, but leave it in your Build zone as you would a retreated unit."}, {"tag": "p", "text": "Once an Equipment card is built it may be moved onto the appropriate unit (Each Equipment card states what type of unit it can be attached to), to do this you pay the equip cost, which will be one the card, cost to equip varies for different cards, and move it under the unit you want to equip. The equipped unit then gets the bonuses stated on the card. There is no limit to how many Equipment cards one unit may have. When a unit equipped with an Equipment card or cards is discarded, the Equipment card is moved back to your Build zone and may be equipped again to a different card."}, {"tag": "h4", "text": "Neutral cards"}, {"tag": "p", "text": "Neutral cards can be on either side (Light or Dark Side), the side they are on depends on who owns them. If both players have the same unique card then the cards are contested."}, {"tag": "h4", "text": "Parts of a Card"}, {"tag": "p", "text": "On every Space, Ground and Character card (these three are all called unit cards) on the left side, there are three sets of numbers. The top number (with a small \"S\" to the right of it) is the speed of the card. The speed determines the order in which the cards can attack or use their special effects in, if it is a draw then, as always, the Dark Side goes first. The power of the card (located below the speed and has a small \"P\" to the right of it) is the amount of dice that can be rolled in an attack. Below the power is the health (with a small \"H\" next to it) which is the amount of damage from the attacks that the card can withstand before it is discarded."}, {"tag": "p", "text": "To the right of the speed, power and health amounts, is the area that contains the special effects that the card has, as well as \"flavor text\" (text added such as quotes from a character or general information related to the card)."}, {"tag": "p", "text": "For some cards, mainly Characters, there is a small letter in a circle. Some units have more than one version of the same unit (e.g. Yoda has a version A, version B, version C, etc.). If two cards of the same unique unit are played (e.g. Darth Vader A and B), then these cards must be stacked.\nThe top left corner of the card is the unit's build cost (the amount of build points needed to put the unit into play). To the right of the build cost, is the unit's name as, well as the arena it is to be played in, and the type of unit they are (e.g. Jedi Master, Bounty hunter, Trade Federation droid). In the top right corner is the side that the card is on (Light, Dark or neutral)."}, {"tag": "p", "text": "Other information on the card not related to game play is the number of the card from the expansion it is in, and the rarity. The rarity is how hard it is to get that card. Common (shown by a circle) is the easiest to get, followed by uncommon (a diamond) and rare (a star). This information is found at the bottom right of unit cards and on the bottom left of the other cards. Also is the Expansion symbol, depicting which expansion that card comes from. This is found in the colored section just below the speed and above the power."}, {"tag": "h3", "text": "Force and Force meter"}, {"tag": "p", "text": "The force is a very important element in the playing of the game. It is used for various things, mainly as a cost to use abilities and bidding. The game mats contained a force meter to keep track of how much force you have, though some players used a 20 sided dice instead.[source?] At the start of each turn, both players gain four force. Players lose force when paid as a cost for an ability, or due to a card effect. A player cannot have less than 0 force, nor can they pay for an ability requiring more force than they possess."}, {"tag": "h3", "text": "The Zones of Play"}, {"tag": "p", "text": "Each player has their own zones of play. They are:"}, {"tag": "h3", "text": "Deck building"}, {"tag": "p", "text": "To play the game you will need a deck, deck building is fairly easy, and as long as your deck stays within all of these rules it should be legal. Firstly, your deck must have at least sixty cards in it, with at least twelve of each type of unit. You may not have Dark and Light Side cards in the same deck. Another thing is that you may not have more than twice as many unit cards of another type (so if you had twelve Space the most you'd be allowed of another kind of unit would be twenty-four). And lastly, your deck may not have more than four of the same version of the same card (this applies to all cards, not just units)."}, {"tag": "h3", "text": "The Three General Rules"}, {"tag": "p", "text": "These three rules are always true in the game and are good to know before playing."}, {"tag": "h3", "text": "Playing the game"}, {"tag": "p", "text": "Initial setup of the game commences, the game continues in turns consisting of three phases (Ready, Command and Battle). Turns repeat until the game is won (A draw is not possible, though temporary stalemates may occur)."}, {"tag": "h4", "text": "Setup"}, {"tag": "p", "text": "Setup is similar to the building part of the Command Phase. You start with 30 build points, these can't be saved so it is a good idea to use as many as possible. You start building your units as you would in the Command Phase, but you may not build Mission, Equipment or Location cards. Unlike in the Command Phase you draw one card and into your hand every time you enter a card into an arena, keeping 7 cards in your hand or in the Build Zone. At the end, you may partially build a card to use up the last few build points. You can't do this mid-way through Setup (any card you build mid-way must be finished before you start the next), and you must show the card to your opponent before putting it down. Example: If I have used 28 points, I have 2 left. I spend them on a 7 cost card, leaving it with 5 left."}, {"tag": "h4", "text": "The Ready Phase"}, {"tag": "p", "text": "In the ready phase each player gets +4 Force and untaps all their tapped units. The Dark Side should, as always, do this first. The Light Side player then rolls one die and each player then gets an amount of build points equal to the total of the die. If either player has at least one card in every arena, that player gets one extra build point. Some cards have abilities that affect the roll, those abilities are played in this phase."}, {"tag": "h4", "text": "The Command Phase"}, {"tag": "p", "text": "In the Command Phase both players draw a card and get a chance to build unit and Mission cards. The Dark Side starts, first they draw one card, then collect Bounty and then pay Upkeep, the Light Side then does the same. After this you move on to what is known as the build phase, in which you may build units and Mission cards. To do this you use build points, you may move any Mission or unit card from your hand to your build zone, when you put a card down you must put at least one build point on it, remember to put all cards that are being built face down so that you opponent cannot see them."}, {"tag": "p", "text": "You may only build on cards that are in your build zone, to build on cards in your build zone you just put build points on any card in that zone. When you have a unit with the same amount of build points on it as it costs you may move it in to the appropriate arena (Character, Ground or Space). If you have a Mission card with the same amount of build points on it that it costs then you keep that in your build zone until the time that the Mission card says it may be used."}, {"tag": "p", "text": "You may now rearrange the order of stacked units, remember you can only have four cards in each stack, this is done by paying Force equal to the build cost difference between the card you want to change and the card it will end up being on top of. Next you move pilots on or off Units, each pilot may only be moved once, but you may move as many pilots as you want. After this you may move cards that have been retreated back into the appropriate arena, this includes cards that you retreated in order to use their Reserves. And finally you may retreat cards into the build zone, remember to put these cards facing upwards, so that you know that they are not being built, and tap them."}, {"tag": "h4", "text": "The Battle Phase"}, {"tag": "p", "text": "The Battle Phase begins with a play-or-pass chance where the players are able to play battle cards, use some abilities of cards, and attach Equipment. First you have a play-or-pass chance, in which players are allowed to use Mission and Location cards. After this, the battle begins in the Space arena. The card with the highest speed, if there is a draw between speeds then the Dark Side goes first, may attack an enemy unit by rolling a number dice according to the power, 4s, 5s and 6s are hits, 1s, 2s and 3s are misses (so a unit with 6 power would throw 6 dice, if the dice landed on 2, 2, 2, 2, 5 and 6 then the amount of attack would be two). Before damage is placed, another play-or-pass chance is carried out. After this, damage is then added, and if the damage done is greater than or equal to the enemy's health, then the card is discarded. Some Units have abilities which require them to tap, they may use these instead of attacking. The card with the next highest speed then attacks, until all cards in the space arena have been tapped. The battle then moves onto the Ground arena, where the same formula is followed, then onto the Character. When all Character units have attacked, the turn ends. If either player has control of two arenas at the end of this phase then they win the game, otherwise a new turn is began by going back to the Ready Phase and repeating."}, {"tag": "h4", "text": "Winning the Game"}, {"tag": "p", "text": "The game is won when one player controls at least two arenas at the end of the turn, controlling meaning that one player has cards in play in two arenas where the other player doesn't (retreated units are not counted as being \"in play\"). An arena is contested (uncontrolled) if both players have cards in play, or if there are no cards in play in that arena."}, {"tag": "h3", "text": "Abilities and Meanings"}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Star Wars Trading Card Game was considered by many to be a game of luck, with very little skill, mainly due to the fact that dice were used. However, many players disagreed with this and argued that it involved no more luck than other Wizards of the Coast games. Many players also disliked the game as they saw it as an inferior version of Decipher's Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Expansions and other cards"}, {"tag": "h3", "text": "Expansion sets"}, {"tag": "h3", "text": "Promotional cards"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"Parry\" ability was intended for the never-released Rise of the Empire expansion by Wizards of the Coast. It was introduced into the game in the IDC's first expansion, Fall of the Republic. It automatically prevents X damage when a natural 1 is rolled."}, {"tag": "p", "text": "The fan-based message board site Rebelbasers.com was first (and only) mentioned in the RotS Rulebook credits."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}