{"url": "Battle_in_Drelliad_village", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Separatist War"], "nodes": [{"tag": "h1", "text": "Battle in Drelliad village"}, {"tag": "p", "text": "The Battle of Drelliad Village was a battle in 3643 BBY during the Ord Mantell Civil War, between the Galactic Republic-backed government, the Ord Mantell Central Authority, and the insurgent Mantellian Separatist Movement. It was an attempt from the separatists forces to seize the Drelliad village and its spaceport."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the ratification of the Treaty of Coruscant in 3653 BBY and the start of the Cold War, the Galactic Republic tried not to lose any more worlds than it already has, rewarding and consolidating even the most gangrened governments. On Ord Mantell, the corrupt Central Authority greatly benefited from this politic, to the dissatisfaction of its opposants. Enraged by the situation, they founded the Mantellian Separatist Movement, and started a violent civil war. As chaos erupted on the planet, the separatists destroyed numerous spaceports, and the conflict came to focus on the island Avilatan, where republican loyalists defended Fort Garnik in an attempt to protect the surrounding remaining spaceports, last link between the Republic and Ord Mantell."}, {"tag": "p", "text": "The Drelliad village was one of the last spaceports in activity, and as such, was an important target for separatist forces. They prepared well for the attack, planning on a quick assault with the help of various supports. War droids and armor-piercing missiles launchers would be ready to subdue any heavy resistance. Remote control stations were programmed to take control of the village's anti-air cannons network. And finally, to cut the possibility of a quick reaction from the Mantellian Army, the separatists had prepared three signal jammers (Alpha, Beta and Delta), and deployed a sniper team supported by scouts in the hills between the village and Fort Garnik, a week before the battle."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "The attack, the level of preparation and specialized equipment wasn't expected by Republic intelligence. However, the timing of the separatist attack was quite unlucky for them, as two unrelated republican assets were converging on Drelliad spaceport around the time of the assault. A sergeant of the Republic Special Forces Division, newly recruited in Havoc Squad to operate on Ord Mantell with the objective to find a missing bomb, arrived sometime before the attack. Welcomed by Lieutenant Bex Kolos, they both left the village in a Manka-class armored transport, heading to Fort Garnik."}, {"tag": "p", "text": "While the APC was maneuvering right outside of the village, the separatist were moving fast to assault it. Coming on landspeeders from the seafront, they established a beachhead next to their objective. Taking over the village quickly, they deployed their equipment in haste, putting down long-range communication, and taking over the network of three anti-air cannons protecting the village. Spotting the moving APC, the separatists attacked it with their armor-piercing missile launchers, destroying the cockpit. While the pilot was dead, the two member of Havoc Squad managed to get out safely of the immobilized vehicle. Assessing the situation, Kolos ordered the Sergeant to take care of any stock of missiles brought by the separatists in the village, while he would try to repair the APC."}, {"tag": "p", "text": "Meanwhile a XS stock light freighter with a shipment of blasters destined to Republic loyalists was landing, under separatist fire, on the Drelliad spaceport. Representing Rendia Freight on the site, Skavak welcomed and paid the smuggler, and rushed to discharge the cargo. However, he was interrupted by his partner, Corso Riggs. Corso had been observing the separatist attack from outside of the village, and was well aware of how dangerous they were. He had witness them destroying a republic transport by hijacking the defensive network with remote control stations. After Corso Riggs shared this information, the group agreed that the newly arrived smuggler should go outside of the spaceport hangar, and deal with the stations. In the meantime, Skavak and Corso were to hurry to get the cargaison on the ground."}, {"tag": "p", "text": "The Sergeant and the smuggler soon reached Sergeant Blyes and the Thirty-first Recon. an unit of the Mantellian Army that was already engaged with the separatists. They had tried to warn their headquarters in Fort Garnik with long range communication, and failing to do so, even attempted to send a runner, only for the soldier to be killed by one of the sniper in the hills surrounding Drelliad village. Blyes asked for its newfound allies to help him and destroy the jammers put by the separatists in the village. They accepted, and attacked the separatists, killing dozens of them while completing their tasks."}, {"tag": "p", "text": "The Sergeant soon received an holo-communication from Bex Kolos, informing him that the APC was definitely out of commission, and ordering him to reach Fort Garnik. But the troubles of the smuggler were far from over. While he was busy putting the air defense network out of order, Skavak had decided to betray him and Corso, letting a separatist team enter in the previously locked hangar. Corso managed to call the smuggler to warn him, but was soon sucker punched by Skavak, who also stole his blaster, Torchy. Rushing to the hangar, the smuggler quickly dispatched the separatists, only to witness his own ship leaving the landing pad with Skavak in the pilot seat, and the blasters shipment still in the cargo hold. After Corso regained consciousness, they managed to call Skavak, only for him to mock them. Knowing that his boss, Viidu, would want to hear about Skavak treason, and would be the only one able to track the smuggler's XS stock light freighter, Corso advised his comrade in misfortune to meet Viidu at Fort Garnik. He would join them later, but needed first to lock down the hangar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The events of the Battle in Drelliad village first appeared in the MMORPG Star Wars: The Old Republic, where the zone of the Drelliad village is a constant warfare. There, the mission \"Clearing the Air\" is common to both class, while \"Hit the Ground Running\" and \"Landing Party\" are respectively specific to the Soldier and the Smuggler classes, and are their very first missions. Furthermore, the common mission \"Sniper Hunt\", which is to be undertaken on the way to Fort Garnik, offers some more informations."}, {"tag": "p", "text": "\"Hit the Ground Running\" starts before the others missions, since it's introduction cinematic show Drelliad village before the attack, while \"Landing Party\" start right during the attack, with Corso Riggs' first dialog mentioning the destruction of the APC."}, {"tag": "p", "text": "A few inconsistencies can be noted in the Soldier mission \"Hit the Ground Running\". The first cinematic show Bex Kolos at the entrance of the village, with the APC in his back, then the camera cut to him looking at a shuttle landing on the spaceport, only a few meters from where he stand, with the Soldier disembarking, and the camera then cut several time between those two point of view as the Soldier and Kolos meet and get in the APC, which is a camera trick, since those two places are separated by several dozens meters, and a whole building (the spaceport hangar). When in the APC, the driver say the line \"Approaching Drelliad village, sir\", which they just left. Furthermore, while the APC is said to be heading to Fort Garnik, it is in fact heading to the west for a much longer road close to Oradam village, instead of the more direct road to Fort Garnik, south of Drelliad village."}, {"tag": "p", "text": "Another small inconsistency, this time in the Smuggler mission \"Landing Party\", is the line \"Separatists took over the local air defense cannon\" from Corso Riggs, while the game shows Drelliad village to be surrounded by three anti-air cannons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}