{"url": "Star_Wars_Trivial_Pursuit", "categories": ["Category:Real-world articles", "Category:Real-world board games"], "nodes": [{"tag": "h1", "text": "Star Wars Trivial Pursuit"}, {"tag": "p", "text": "Star Wars Trivial Pursuit is a Star Wars–themed Trivial Pursuit game that comes with a set of questions. The object is to collect all the color pies and answer a final question. It was released by Parker Brothers on April 2, 2005."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The overall gameplay is much like that of any other Trivial Pursuit title. Each player picks a piece and uses the character that the piece represents. Another player draws a card and asks a question if the piece is on a regular square. If the person answers it correctly, then they get to go again. Once they get an answer wrong, play passes to the next player. Like classic Trival Pursuit, when a player lands on a pie square, another player asks a question from the color. If they answer it wrong, they do not get the pie. If they get it right, they place the corresponding color pie into the small slot on their piece's base. Once the player collects all six pies, they travel to the center, where they started, and answer a final question. If they answer correctly, they win."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Classic trilogy"}, {"tag": "p", "text": "The four pieces that come with the game are Leia Organa Solo, Han Solo, Darth Vader, and Luke Skywalker. The Collector's Edition of this version featured a sealed pack of cards pertaining to Star Wars: Episode I The Phantom Menace that served as a sneak preview to the film."}, {"tag": "h3", "text": "DVD saga variation"}, {"tag": "p", "text": "If a person lands on a pie square, they are to answer the corresponding DVD question. When only five seconds remain, every other player may answer the question. After collecting all six pie pieces, you must answer a \"For the Win\" question. If you answer correctly, you win the game. If not, you must keep playing. The four pieces that come with the game are Yoda, Obi-Wan Kenobi, Darth Vader, and Luke Skywalker."}, {"tag": "h2", "text": "Bibliography"}]}