{"url": "Battle_in_the_Chorax_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Rachuk sector", "Category:Battles of the Coruscant campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle in the Chorax system"}, {"tag": "p", "text": "A battle occurred in the Chorax system in 6 ABY when Captain Uwlla Iillor of the Galactic Empire ambushed the New Republic starfighter unit Rogue Squadron, using the Immobilizer 418 cruiser Black Asp to pull the squadron out of hyperspace."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 6 ABY, after Rogue Squadron was reformed, they were pulled out of hyperspace while en-route to a new base on the planet Talasea, in the Morobe system."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The battle began when the Imperial Interdictor cruiser Black Asp, commanded by Captain Uwlla Iillor, ambushed the Baudo-class yacht Pulsar Skate in the Chorax system. The Black Asp took New Republic-affiliated smuggler Mirax Terrik by surprise using an in-system hyperspace jump, and activated its gravity well projectors before Terrik could escape. A full squadron of TIE Interceptors were then launched to overtake the modified yacht."}, {"tag": "p", "text": "Fortunately for Terrik, Rogue Squadron had plotted a course through the Chorax system to their new base on Talasea, and were pulled out of hyperspace by the Black Asp. The Rogues outfought the Imperial starfighters and knocked out the Black Asp's forward shields, forcing the Interdictor to withdraw. Rogue pilot Corran Horn's X-wing was disabled by an ion cannon shot from the Black Asp, but he managed to restore partial power and shot down two Interceptors using targeting data provided by Tycho Celchu's Lambda-class shuttle Forbidden."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In all, seven TIE Interceptors were shot down, while the Rogues suffered no losses. Horn's X-wing was carried to Talasea by the Pulsar Skate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle first appeared in the 1996 novel, X-Wing: Rogue Squadron, written by Michael A. Stackpole."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}