{"url": "Star_Wars_Vol._1:_The_Destiny_Path", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 2020) trade paperbacks"], "nodes": [{"tag": "h1", "text": "Star Wars Vol. 1: The Destiny Path"}, {"tag": "p", "text": "Star Wars Vol. 1: The Destiny Path is a trade paperback compilation of Marvel Comics' 2020 Star Wars, collecting issues 1–6 from the ongoing series. The collection was published on November 10, 2020."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"No…I am your father.\""}, {"tag": "p", "text": "In the wake of the events following The Empire Strikes Back, it is a dark time for the heroes of the Rebellion. The Rebel fleet…scattered following a disastrous defeat at the Battle of Hoth. Han Solo…lost to the bounty hunter Boba Fett after being frozen in carbonite. And after being lured into a trap on Cloud City and bested in a vicious lightsaber duel against the evil Darth Vader, Luke Skywalker…learned the horrible truth about his past. Vader did not kill Luke's father, Anakin - Vader is Luke's father! Now, after narrowly escaping the dark lord's clutches, and wounded and reeling from the revelation, Luke, Princess Leia, Lando Calrissian, the Wookiee Chewbacca and the droids C-3PO and R2-D2 must fight their way back to the Rebel Alliance - for the fate of the entire galaxy is at stake! After so many losses, is victory still possible? But, what Leia, Luke and their ragtag band of freedom fighters do not realize is that they have only traded one Imperial trap for another! Enter the cunning and vengeful Imperial Commander Ellian Zahra, at the helm of the Tarkin's Will! Writer Charles Soule (DARTH VADER) and artist Jesús Saiz (DOCTOR STRANGE) are taking us all to the galaxy far, far away!"}, {"tag": "p", "text": "COLLECTING: STAR WARS (2020) 1-6"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}