{"url": "Star_Wars_home_video_releases", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:Home video", "Category:Real-world lists"], "nodes": [{"tag": "h1", "text": "Star Wars home video releases"}, {"tag": "p", "text": "This page describes the significant home video releases of official Star Wars films, television shows, and documentaries, excluding releases which did not come directly from Lucasfilm (such as Star Wars Tech or spoof programs like Robot Chicken: Star Wars)."}, {"tag": "h2", "text": "1977"}, {"tag": "p", "text": "In 1977, Ken Films released selected scenes from the original Star Wars onto Super 8 film. They were available in black-and-white silent, color silent, and color sound varieties. The United States market also saw Spanish-language versions of the scenes (as \"La guerra de las galaxias\")."}, {"tag": "h2", "text": "1979"}, {"tag": "p", "text": "In 1979, 20th Century Fox released The Making of Star Wars on VHS and Betamax tape cassette systems."}, {"tag": "h2", "text": "1982"}, {"tag": "h3", "text": "A New Hope"}, {"tag": "p", "text": "The very first home video release of any Star Wars film came in May 1982 when 20th Century Fox Video released Star Wars: Episode IV A New Hope on VHS, Betamax, LaserDisc, CED VideoDisc, and V2000 tape cassettes."}, {"tag": "h2", "text": "1984"}, {"tag": "h3", "text": "The Empire Strikes Back"}, {"tag": "p", "text": "CBS/FOX released Star Wars: Episode V The Empire Strikes Back on VHS, Betamax, LaserDisc, CED VideoDisc, and V2000 tape cassettes in November 1984."}, {"tag": "h2", "text": "1986"}, {"tag": "h3", "text": "Return of the Jedi"}, {"tag": "p", "text": "CBS/FOX released Star Wars: Episode VI Return of the Jedi on VHS, Betamax, LaserDisc, CED VideoDisc, and V2000 tape cassettes on February 25, 1986."}, {"tag": "h3", "text": "A New Hope Japanese Widescreen Special Collection"}, {"tag": "p", "text": "In 1986, CBS/Fox released A New Hope on LaserDisc in Japan as part of its \"Special Collection\" brand. This also marked the first letterbox release of the film."}, {"tag": "h2", "text": "1987"}, {"tag": "h3", "text": "The Empire Strikes Back and Return of the Jedi Japanese Widescreen Special Collection"}, {"tag": "p", "text": "In 1987, CBS/Fox released The Empire Strikes Back and Return of the Jedi on LaserDisc in Japan as part of its \"Special Collection\" brand. This also marked the first letterbox release of both films."}, {"tag": "h2", "text": "1988"}, {"tag": "h3", "text": "Droids and Ewoks VHS releases (CBS/FOX)"}, {"tag": "p", "text": "In 1988, CBS/FOX released PAL-formatted VHS tapes for various European and Australian markets. The following represent the ten UK releases:"}, {"tag": "h2", "text": "1989"}, {"tag": "p", "text": "In 1989, the original version of Star Wars and Return of the Jedi were released in anamorphic widescreen format on Super 8 film by Derann Film Services. Star Wars and The Empire Strikes Back received their first US-region widescreen LaserDisc releases."}, {"tag": "h2", "text": "1990s"}, {"tag": "p", "text": "In the 1990s, Classic Home Cinema released The Empire Strikes Back in its entirety on Super 8 film."}, {"tag": "h2", "text": "1990"}, {"tag": "h3", "text": "Return of the Jedi (Widescreen)"}, {"tag": "p", "text": "In 1990, Return of the Jedi had a widescreen LaserDisc release in the US."}, {"tag": "h3", "text": "Ewok movies on VHS and LaserDisc (MGM)"}, {"tag": "p", "text": "The Ewok Adventure and Ewoks: The Battle for Endor were released on VHS and LaserDisc by MGM Home Entertainment in 1990."}, {"tag": "h3", "text": "Droids and Ewoks VHS releases (J2 Communications)"}, {"tag": "p", "text": "Six VHS volumes of episodes from Star Wars: Droids: The Adventures of R2-D2 and C-3PO and Ewoks were released on VHS by J2 Communications in 1990."}, {"tag": "h2", "text": "1992"}, {"tag": "h3", "text": "Letterbox Collector's Edition"}, {"tag": "p", "text": "In 1992, the original trilogy was released on VHS in letterbox format in the United States. The transfers were derived from the 1989–1990 American letterbox LaserDiscs. The set included a fourth tape, From Star Wars to Jedi: The Making of a Saga, and an abridged version of the book George Lucas: The Creative Impulse."}, {"tag": "h2", "text": "1993"}, {"tag": "h3", "text": "The Definitive Collection"}, {"tag": "h2", "text": "1995"}, {"tag": "h3", "text": "Star Wars \"Faces\" VHS/LaserDisc"}, {"tag": "p", "text": "A new box set was released on VHS and LaserDisc on August 29, 1995. It would be the last time that the original versions of the Classic Trilogy were released on both formats. The widescreen LaserDisc is derived from the transfer used on the 1993 Definitive Collection set. The sole special feature is a three-part interview about the trilogy with George Lucas, conducted by Leonard Maltin. These releases in the U.S. also were the first in home video history to use the 1995 domestic 20th Century Fox Home Entertainment logo, and feature it without the fade-out."}, {"tag": "h3", "text": "Star Wars Trilogy overseas VHS/LaserDisc"}, {"tag": "p", "text": "Outside the United States and Canada, the Classic Trilogy was packaged with new posters created by John Alvin."}, {"tag": "h2", "text": "1996"}, {"tag": "h3", "text": "Star Wars Animated Classics"}, {"tag": "h2", "text": "1997"}, {"tag": "h3", "text": "Special Editions"}, {"tag": "p", "text": "The Special Edition cuts of the original trilogy were released on VHS and LaserDisc on August 26, 1997. The cassettes came in either pan-and-scan or widescreen formats and included featurettes on the making of the new cuts."}, {"tag": "h2", "text": "2000"}, {"tag": "h3", "text": "The Phantom Menace (VHS/LaserDisc)"}, {"tag": "p", "text": "Star Wars: Episode I The Phantom Menace was released on video worldwide between April 3 and 8, 2000 (France got it later in the year). The release was VHS only, though an English-language LaserDisc was released in Japan and appeared on the Video CD format in most of Asia."}, {"tag": "h3", "text": "Original trilogy reprints"}, {"tag": "p", "text": "The Star Wars Trilogy VHS set was reprinted and repackaged in 2000; the covers now include logos resembling the ones used for The Phantom Menace (episode numbers and subtitles). They were also available on Video CD at this time. While the Special Edition cuts were used, no mention is made on the packaging. The same changes were implemented on the Japanese LaserDisc. It would be the final release of the original trilogy on VHS, and the last-ever Star Wars release on LaserDisc."}, {"tag": "h2", "text": "2001"}, {"tag": "h3", "text": "The Phantom Menace (DVD)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The Phantom Menace was released on DVD as a two-disc set in 2001, almost two years after the movie's theatrical release; it was the first Star Wars film to be officially released on DVD. The DVD version of the film had several scenes edited and inserted by George Lucas, making it slightly different from and longer than its original theatrical release. The DVD also includes an audio commentary by George Lucas, producer Rick McCallum, editor Ben Burtt, animation director Rob Coleman, and visual effects supervisors John Knoll, Dennis Muren, and Scott Squires, as well as an easter egg (on-set bloopers) accessible through the sound menu by selecting THX and pressing 1138."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The second DVD in the set contains various bonus features:"}, {"tag": "p", "text": "This DVD release is of significantly lesser quality, compared to the later Star Wars movies DVD releases. However, for the Blu-ray version, the image quality was digitally restored from the DVD release and a digital Yoda replacing the original puppet, among other changes, were implemented. The film was also made available on VHS."}, {"tag": "h2", "text": "2002"}, {"tag": "h3", "text": "The Story of Star Wars"}, {"tag": "p", "text": "The Story of Star Wars was a three-disc VideoNow Color release."}, {"tag": "h3", "text": "Attack of the Clones"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Star Wars: Episode II Attack of the Clones was released on DVD in November 2002 as a two-disc set that has picture and sound mastered from the original digital source material. The movie has several elements edited or added in by George Lucas that make the DVD version of the film slightly different from the theatrical release. The DVD also includes an audio commentary by George Lucas, producer Rick McCallum, editor Ben Burtt, animation director Rob Coleman and visual effects supervisors Pablo Helman, John Knoll, and Ben Snow, as well as an easter egg (on-set bloopers) accessible through the sound menu by selecting THX and pressing 1138."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The second DVD in the set contains various bonus features:"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The film was also released on VHS and a three-disc Video CD. The release included the eight deleted scenes which played after the end credits. These included deleted scenes and a segment of Star Wars: Connections."}, {"tag": "h3", "text": "R2-D2: Beneath the Dome"}, {"tag": "p", "text": "R2-D2: Beneath the Dome is a 20-minute mockumentary made as a fun project by the cast and crew of Attack of the Clones. It uses interviews, fake archive photos, film clips, and behind-the-scenes footage to tell the \"true\" life story of R2-D2. On December 26, 2002 it was released on DVD, which contained all three segments that were originally aired on US TV and released on StarWars.com, plus the ending credits and an easter egg of photos of R2-D2 on the sets of the Star Wars films. This DVD was a low-profile, non-advertised release."}, {"tag": "h2", "text": "2004"}, {"tag": "h3", "text": "Star Wars Trilogy DVD set"}, {"tag": "p", "text": "The Star Wars Trilogy DVD set, released in September 2004, was the first release of the original trilogy on DVD. It was a four-disc edition, which included the following:"}, {"tag": "p", "text": "The movies on the DVDs were the 1997 Special Edition versions with several additional changes added especially for this release, including an extensive and comprehensive high-definition digital cleanup and several major image adjustments made in order to make the films visually resemble the prequel trilogy. Each of the movies DVD also includes an audio commentary by George Lucas, Ben Burtt, Dennis Muren, and Carrie Fisher (The Empire Strikes Back commentary also features Irvin Kershner)."}, {"tag": "p", "text": "The fourth DVD in the set contains various bonus features:"}, {"tag": "h3", "text": "Star Wars: Ewok Adventures"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "On November 23, 2004, Lucasfilm and 20th Century Fox released both \"Ewoks\" made-for-TV movies on DVD, which presents the films in their original 1.33:1 aspect ratio with a Dolby Digital 2.0 English audio track and English subtitles. The release was billed as Star Wars: Ewok Adventures, a \"double feature\" of Caravan of Courage and its sequel, The Battle for Endor. The disc itself is double-sided, featuring one film on each side. The DVD release featured no extras."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars Animated Adventures"}, {"tag": "h4", "text": "Ewoks"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Ewoks was released on DVD on November 23, 2004 as an edited compilation under the title Star Wars Animated Adventures: Ewoks. It contains eight episodes of the original series, edited together as two full-length films. Episodes 2, 1, 3, and 9 were edited together to make The Haunted Village, and episodes 10, 5, 4, and 13 were edited together to make Tales from the Endor Woods. The Haunted Village combines four loosely related episodes into one story, while Tales from the Endor Woods connects four seemingly unrelated stories via a voiceover by Alex Lindsay intended to be an adult Wicket. The original opening credits and theme song are not included as part of the films, and were replaced with simple credit sequences."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Droids"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Droids was released on DVD on November 23, 2004 as an edited compilation under the title Star Wars Animated Adventures: Droids. It contains eight episodes of the original series, edited together as two full-length films. Episodes 5–8 were edited together to make The Pirates and the Prince, and episodes 10–13 were edited together to make Treasure of the Hidden Planet. The Pirates and the Prince combines four of the five episodes of the Mon Julpa arc into one story, while Treasure of the Hidden Planet combines the four episodes of the Mungo Baobab arc into one story. Though \"Coby and the Starhunters\" was originally part of the Mon Julpa story arc, the episode isn't included in the feature version. The original opening credits and theme song are not included as part of the films, and were replaced with simple credit sequences. Besides cutting the theme song of the series, many other small modifications were made for the home video releases, most notably changes to the soundtrack."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "2005"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars: Clone Wars Volume One"}, {"tag": "p", "text": "The first volume of the Star Wars: Clone Wars animated television series was released on DVD on March 22, 2005. It comprises seasons one and two, which in turn are made up of Chapters 1–20. The DVD also includes following features:"}, {"tag": "h3", "text": "Star Wars Trivial Pursuit: Saga Edition DVD"}, {"tag": "p", "text": "The Saga Edition of Star Wars Trivial Pursuit includes a DVD in which various Star Wars fans asks questions to the viewer."}, {"tag": "h3", "text": "Star Wars: A Musical Journey"}, {"tag": "p", "text": "Star Wars: A Musical Journey bonus DVD was included with the soundtrack album for John Williams's musical score for Revenge of the Sith, released May 3, 2005. The DVD runs for over an hour and contains a collection of music video clips from the Star Wars films, set to selected themes from Williams's scores. It also contains a preview trailer for the Revenge of the Sith video game. Each clip features an introduction by actor Ian McDiarmid. The DVD can be watched with or without this introduction."}, {"tag": "h3", "text": "Revenge of the Sith"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Star Wars: Episode III Revenge of the Sith was released on DVD on November 1, 2005 as a two-disc set that has picture and sound mastered from the original digital source material. The movie DVD includes an audio commentary by George Lucas, producer Rick McCallum, animation director Rob Coleman, and visual effects supervisors John Knoll and Roger Guyett. Unlike every other DVD release of a Star Wars film, Revenge of the Sith was released without any noticeable (upon first viewing) alterations by George Lucas from the film's digital theatrical cut. A closer inspection, however, revealed one change: there used to be a fade between the scene where Obi-Wan Kenobi leaves Mustafar, and the scene where Vader climbs away from the lava, which was removed from the DVD release. This was also the first DVD release not to contain a secret blooper reel of footage from filming as an easter egg. Instead it contains a rap video with a dancing Yoda and clone troopers."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The second DVD in the set contains various bonus features:"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The film was also available on VHS and Video CD, although the VHS copies were only manufactured in small numbers."}, {"tag": "h3", "text": "The Story of Star Wars"}, {"tag": "p", "text": "The Story of Star Wars was a Walmart-exclusive DVD included with initial copies of the Revenge of the Sith DVD. It included content from the first two discs of the 2004 VideoNow Color release of the same name."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars: Clone Wars Volume Two"}, {"tag": "p", "text": "The second volume of the Star Wars: Clone Wars animated television series was released on DVD on December 6, 2005. It comprises Season Three of the series, which is in turn made up of Chapters 21–25. The DVD also includes following features:"}, {"tag": "h3", "text": "Star Wars Trilogy 3-pack"}, {"tag": "p", "text": "Also on December 6, the original trilogy DVDs were repackaged as a three-pack without the bonus disc and featuring new box art. As with the 2004 release, the set was available in both widescreen and full screen."}, {"tag": "h2", "text": "2006"}, {"tag": "h3", "text": "Star Wars Trilogy - Unaltered"}, {"tag": "p", "text": "The original unaltered versions of the original trilogy were officially made available to fans on DVD on September 12, 2006. Each of the films in this release was presented on two DVDs, with the 2004 re-mastered versions present on the first DVD and the original versions, taken from the 1993 LaserDisc editions, available as \"bonuses\" on the second DVD. The second DVD presents each movie in what Lucasfilm claimed to be the original theatrical form. In reality, the films were essentially the 1993 LaserDisc masters (which had numerous visual and audio differences from the 1977 theatrical cuts) with the \"Episode IV\" subtitle removed and the updated star field replaced with the original one. Many sound and visual effects shots created for pre-1993 home video releases are still present in this version."}, {"tag": "h2", "text": "2008"}, {"tag": "h3", "text": "The Art of Star Wars Calendar DVD"}, {"tag": "p", "text": "This DVD was included with a 2008 calendar called The Art of Star Wars."}, {"tag": "h3", "text": "Prequel trilogy and original trilogy box sets"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "This re-packaged releases features the same versions of the movies as previously released two-disc editions of Star Wars: Episode I The Phantom Menace (2001), Star Wars: Episode II Attack of the Clones (2002), Star Wars: Episode III Revenge of the Sith (2005), and original unaltered trilogy (2006). No new material was included in these sets."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars: The Clone Wars film"}, {"tag": "p", "text": "Star Wars: The Clone Wars was released on home video on November 11, 2008, as a single-disc DVD, a two-disc Special Edition DVD, and a two-disc Blu-ray. Both DVD versions include the widescreen film with Dolby Digital 5.1 Surround EX sound, and the audio commentary by director Dave Filoni, producer Catherine Winder, writer Henry Gilroy, and editor Jason Tucker."}, {"tag": "p", "text": "The second disc of the two-DVD set contains the following bonus features:"}, {"tag": "p", "text": "The Blu-ray edition includes all the above features in 1080p high definition (deleted scenes and certain trailers are not in HD) on a single 50GB disc. Audio commentary is not present."}, {"tag": "h2", "text": "2009"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars: The Clone Wars: A Galaxy Divided"}, {"tag": "p", "text": "Star Wars: The Clone Wars: A Galaxy Divided is the first collection of four episodes in Season One of The Clone Wars 3D animated television series, released on March 24, 2009. It includes the episodes \"Ambush,\" \"Rising Malevolence,\" \"Shadow of Malevolence,\" and \"Destroy Malevolence,\" but no additional bonus or extra materials."}, {"tag": "h3", "text": "Star Wars: The Clone Wars: Clone Commandos"}, {"tag": "p", "text": "Star Wars: The Clone Wars: Clone Commandos is the second collection of four episodes in Season One of The Clone Wars 3D animated television series, released on September 15, 2009. It includes the episodes \"Rookies,\" \"Storm Over Ryloth,\" \"Innocents of Ryloth,\" and \"Liberty on Ryloth,\" but no additional bonus or extra materials."}, {"tag": "h3", "text": "Star Wars: The Clone Wars: Season One"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The complete first season of Star Wars: The Clone Wars was released as a four-disc DVD and a three-disc Blu-ray box set on November 3, 2009 in the US and on November 2, 2010 in the UK. The set includes:"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "2010"}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 1 Volume 1"}, {"tag": "p", "text": "The first 5 episodes of the first season of Star Wars: The Clone Wars was released on a single DVD on August 23, 2010."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 1 Volume 2"}, {"tag": "p", "text": "Episodes 6–10 of the first season of Star Wars: The Clone Wars was released on a single DVD on August 23, 2010."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 1 Volume 3"}, {"tag": "p", "text": "Episodes 11–16 of the first season of Star Wars: The Clone Wars was released on a single DVD on August 23, 2010."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 1 Volume 4"}, {"tag": "p", "text": "The final episodes: 17–22 of the first season of Star Wars: The Clone Wars was released on a single DVD on August 23, 2010."}, {"tag": "h3", "text": "Star Wars: The Clone Wars Walmart Exclusive DVDs"}, {"tag": "p", "text": "Three Walmart-exclusive action figure sets each contained a DVD featuring either \"Rising Malevolence,\" \"Shadow of Malevolence\" or \"Destroy Malevolence.\""}, {"tag": "h3", "text": "Star Wars: The Clone Wars: Bounty Hunters"}, {"tag": "p", "text": "Star Wars: The Clone Wars: \"Bounty Hunters\" was a Target-exclusive DVD included with select action figure sets."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season Two"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The complete second season of Star Wars: The Clone Wars was released as a four-disc DVD and a three-disc Blu-ray box set on October 26, 2010, October 25, 2010 (Region 2), and November 10, 2010 (Region 4). The set includes:"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 2 Volume 1"}, {"tag": "p", "text": "The first 4 episodes of the second season of Star Wars: The Clone Wars was released on a single DVD on December 6, 2010."}, {"tag": "h2", "text": "2011"}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 2 Volume 2"}, {"tag": "p", "text": "Episodes 5–10 of the second season of Star Wars: The Clone Wars was released on a single DVD on March 21, 2011."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 2 Volume 3"}, {"tag": "p", "text": "Episodes 11–16 of the second season of Star Wars: The Clone Wars was released on a single DVD on May 30, 2011."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season 2 Volume 4"}, {"tag": "p", "text": "Episodes 17–22 of the second season of Star Wars: The Clone Wars was released on a single DVD on August 22, 2011."}, {"tag": "h3", "text": "Star Wars: The Clone Wars Walmart Exclusive DVDs"}, {"tag": "p", "text": "Two Walmart-exclusive action figure sets each contained a DVD featuring either \"Landing at Point Rain\" or \"Weapons Factory.\""}, {"tag": "h3", "text": "The Complete Saga in Blu-ray"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The entire saga was released on Blu-ray in September 2011. Three different sets were for sale: a 9-disc set containing Episodes I to VI, and two 3-disc sets containing the prequel trilogy and the original trilogy. Three additional discs and more than 30 hours of extensive special features including never-before-seen deleted and alternate scenes, an exploration of the exclusive Star Wars archives included in the Complete Saga. The complete saga and trilogies were given a Region 2 release on September 12, 2011."}, {"tag": "p", "text": "On May 4, 2011, a promotional website revealed the covers and full contents of each of the Blu-ray sets."}, {"tag": "h3", "text": "LEGO Star Wars: The Padawan Menace"}, {"tag": "p", "text": "LEGO Star Wars: The Padawan Menace was released as a Blu-ray/DVD combo pack on September 16, 2011."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season Three"}, {"tag": "p", "text": "The complete third season of Star Wars: The Clone Wars was released as a DVD and Blu-ray box set on October 18, 2011."}, {"tag": "h2", "text": "2012"}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Darth Maul Returns"}, {"tag": "p", "text": "A feature-length compilation of the Darth Maul–centered episodes of Season Four was released on DVD exclusively at Target stores on September 11, 2012. It was released in other locations on January 8, 2013."}, {"tag": "h3", "text": "Star Wars: The Clone Wars Walmart Exclusive DVDs"}, {"tag": "p", "text": "Two limited-release action figure sets, which were originally manufactured for sale as Walmart exclusives, were released in discount stores in 2012. Each set contained a DVD featuring either \"Legacy of Terror\" or \"Brain Invaders.\""}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season Four"}, {"tag": "p", "text": "The complete fourth season of Star Wars: The Clone Wars was released as a DVD and Blu-ray box set on October 1, 2012 in Australia and in America on October 23, 2012."}, {"tag": "h2", "text": "2013"}, {"tag": "h3", "text": "LEGO Star Wars: The Empire Strikes Out"}, {"tag": "p", "text": "LEGO Star Wars: The Empire Strikes Out was released on DVD on March 26, 2013."}, {"tag": "h3", "text": "Star Wars: Prequel Trilogy (Limited Edition Steelbook)"}, {"tag": "p", "text": "This was the prequel trilogy on Blu-ray, packaged in a steelbook. It was released on August 4, 2013."}, {"tag": "h3", "text": "Star Wars: Original Trilogy (Limited Edition Steelbook)"}, {"tag": "p", "text": "This was the original trilogy on Blu-ray, packaged in a steelbook. It was released on August 4, 2013."}, {"tag": "h3", "text": "LEGO Star Wars: The Yoda Chronicles"}, {"tag": "p", "text": "This was the DVD release of the first two episodes of LEGO Star Wars: The Yoda Chronicles. It was released on September 11, 2013."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - Season Five"}, {"tag": "p", "text": "The complete fifth season of Star Wars: The Clone Wars was released as a DVD and Blu-ray box set on October 15, 2013 in America."}, {"tag": "h3", "text": "Star Wars: The Clone Wars Seasons 1-5 Collector's Edition"}, {"tag": "p", "text": "Also released on October 15 was the Star Wars: The Clone Wars Seasons 1-5 Collector's Edition, which included all five seasons of Star Wars: The Clone Wars and also includes a brand new 54-page Art of The Clone Wars booklet that showcases concept art from across all five seasons, with many pieces never before published."}, {"tag": "h3", "text": "Star Wars Trilogy Episodes I–III (Blu-ray + DVD)"}, {"tag": "p", "text": "A Blu-ray/DVD box set containing the prequel trilogy, along with the Blu-ray exclusive audio commentaries for each movie with George Lucas, cast and crew. It was released as a DVD and Blu-ray box set on October 8, 2013."}, {"tag": "h3", "text": "Star Wars Trilogy Episodes IV–VI (Blu-ray + DVD)"}, {"tag": "p", "text": "A Blu-ray/DVD box set containing the original trilogy, along with the Blu-ray exclusive audio commentaries for each movie with George Lucas, cast and crew. It was released as a DVD and Blu-ray box set on October 8, 2013."}, {"tag": "h3", "text": "Star Wars: The Clone Wars 3-Pack (DVD box)"}, {"tag": "p", "text": "This was a 3-volume box set of Star Wars: The Clone Wars DVDs. It was released on October 15, 2013, and included the previously released A Galaxy Divided, Clone Commandos, and Darth Maul Returns."}, {"tag": "h2", "text": "2014"}, {"tag": "h3", "text": "Star Wars Rebels: Spark of Rebellion"}, {"tag": "p", "text": "This is the DVD release of Star Wars Rebels: Spark of Rebellion, which is the first episode of the animated series Star Wars Rebels. It was released on October 14, 2014."}, {"tag": "h3", "text": "Star Wars: The Clone Wars - The Lost Missions"}, {"tag": "p", "text": "Star Wars: The Clone Wars – The Lost Missions was the release of the sixth season of Star Wars: The Clone Wars, containing 13 episodes. It was released on two-disc Blu-ray and three-disc DVD on November 11, 2014."}, {"tag": "h2", "text": "2015"}, {"tag": "h3", "text": "Star Wars Rebels: Complete Season One"}, {"tag": "p", "text": "The complete first season of Star Wars Rebels was released on DVD and Blu-ray on September 1, 2015 in America, and in Germany on September 8, 2015."}, {"tag": "h3", "text": "LEGO Star Wars: The New Yoda Chronicles"}, {"tag": "p", "text": "The final four episodes of LEGO Star Wars: The Yoda Chronicles were released together in September 2015."}, {"tag": "h3", "text": "Star Wars: The Complete Saga (steelbook editions)"}, {"tag": "p", "text": "Episodes I through VI were released individually in limited-edition steelbooks, on November 10, 2015. Each film's case features a prominent character from that film, and contains a Blu-ray and DVD disc of the film. The releases feature the 2011 versions of the films, with only the commentaries as special features."}, {"tag": "p", "text": "Additionally, the 9-disc Complete Saga set containing all 6 episodes and bonus features was re-released in a more conventional Blu-ray case featuring Darth Vader on the cover. Apart from the casing, the content is essentially identical to that of the 2011 release."}, {"tag": "h2", "text": "2016"}, {"tag": "h3", "text": "LEGO Star Wars: Droid Tales"}, {"tag": "p", "text": "The five-part series LEGO Star Wars: Droid Tales was released on DVD on March 1, 2016."}, {"tag": "h3", "text": "The Force Awakens"}, {"tag": "p", "text": "The first home video release of Star Wars: Episode VII The Force Awakens. It was released digitally on April 1, 2016, with physical media following on April 5. The collection includes deleted scenes and making-of documentaries such as Secrets of The Force Awakens: A Cinematic Journey. Different retailers had separate versions, such as a steelbook collection or additional extras."}, {"tag": "h3", "text": "Star Wars Rebels: Complete Season Two"}, {"tag": "p", "text": "The complete second season of Star Wars Rebels was released on Blu-ray and DVD on August 30, 2016."}, {"tag": "h3", "text": "The Force Awakens 3D Collector's Edition"}, {"tag": "p", "text": "A 3D Collector's Edition of The Force Awakens was released on November 15, 2016 in the US and Canada. It includes the bonus features from the original home video release of the film, as well as new content."}, {"tag": "h3", "text": "LEGO Star Wars: The Freemaker Adventures"}, {"tag": "p", "text": "The complete first season of LEGO Star Wars: The Freemaker Adventures was released on two-disc Blu-ray and DVD on December 6, 2016."}, {"tag": "h2", "text": "2017"}, {"tag": "h3", "text": "Rogue One: A Star Wars Story"}, {"tag": "p", "text": "Rogue One: A Star Wars Story was released in Digital HD on March 24, 2017 and in Blu-ray and DVD on April 4, 2017."}, {"tag": "h3", "text": "Star Wars Rebels: Complete Season Three"}, {"tag": "p", "text": "The complete third season of Star Wars Rebels was released on Blu-ray and DVD on August 29, 2017."}, {"tag": "h3", "text": "Star Wars: Forces of Destiny: Volume 1"}, {"tag": "p", "text": "A DVD of Star Wars: Forces of Destiny: Volume 1 was included as a Walmart holiday exclusive with repackaged Blu-ray and DVD sets of Rogue One, The Force Awakens, the prequel trilogy, the original trilogy and The Complete Saga."}, {"tag": "h2", "text": "2018"}, {"tag": "h3", "text": "LEGO Star Wars: The Freemaker Adventures: Complete Season Two"}, {"tag": "p", "text": "The complete second season of LEGO Star Wars: The Freemaker Adventures was released on DVD on March 13, 2018."}, {"tag": "h3", "text": "Star Wars: Episode VIII The Last Jedi"}, {"tag": "p", "text": "Star Wars: Episode VIII The Last Jedi was released on digital platforms on March 13, 2018 and on physical media on March 27, 2018."}, {"tag": "h3", "text": "Star Wars Rebels: Complete Season Four"}, {"tag": "p", "text": "Star Wars Rebels: Complete Season Four was released on Blu-ray and DVD on July 31, 2018. Both editions included the final season of Rebels Recon. Exclusive to Blu-ray were six audio commentaries and the featurettes \"Ghosts of Legend,\" \"Forces of Rebellion\" and \"Kevin Kiner: The Rebel Symphony.\""}, {"tag": "h3", "text": "Solo: A Star Wars Story"}, {"tag": "p", "text": "Solo: A Star Wars Story was released on digital HD, 4K Ultra HD and Movies Anywhere on September 14, 2018 and on Blu-ray 4K Ultra HD, Blu-ray, DVD and On-Demand on September 25, 2018."}, {"tag": "h2", "text": "2019"}, {"tag": "h3", "text": "Star Wars Resistance: Complete Season One"}, {"tag": "p", "text": "Star Wars Resistance: Complete Season One was released on DVD on August 20, 2019."}, {"tag": "h3", "text": "Star Wars film re-releases"}, {"tag": "p", "text": "Episodes I–VIII, Rogue One and Solo were re-released as individual Blu-ray and DVDs on September 22. These featured a new unifying design of cover art."}, {"tag": "h2", "text": "2020"}, {"tag": "h3", "text": "Star Wars: Episode IX The Rise of Skywalker"}, {"tag": "p", "text": "Star Wars: Episode IX The Rise of Skywalker was released on  March 17 on most digital platforms in digital HD and 4K Ultra HD. A number of physical releases followed on March 31, including a Multiscreen Edition (Blu Ray and Digital Code), an Ultimate Collector's Edition (4K, Blu Ray and Digital Code) and a DVD edition; Best Buy, Target and Wal Mart will offer exclusive versions of the sets."}, {"tag": "h3", "text": "Star Wars Episodes 1-8 4K Ultra HD disc releases"}, {"tag": "p", "text": "Star Wars Episodes 1-8 made their 4K disc debut on March 31."}, {"tag": "h3", "text": "Star Wars: The Skywalker Saga"}, {"tag": "p", "text": "Best Buy released an exclusive 27-disc \"Skywalker Saga\" set (4K, Blu Ray, Digital Code) on March 31."}, {"tag": "h2", "text": "Code names"}, {"tag": "p", "text": "For the releases of each of the theatrical films on DVD, the disc files were given code names in order to help prevent piracy. Most were named after female lead characters from 20th Century Fox properties being released on DVD around the time of the Star Wars film in question:"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}