{"url": "Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition", "categories": ["Category:Real-world articles", "Category:Future books", "Category:Real-world reference books"], "nodes": [{"tag": "h1", "text": "Star Wars Year By Year: A Visual History, New Edition"}, {"tag": "p", "text": "Star Wars Year By Year: A Visual History, New Edition is a forthcoming Star Wars reference book by Pablo Hidalgo and Kristin Baver. It is scheduled to be published by Dorling Kindersley on September 7, 2021. The title is a follow-up to Star Wars Year By Year: A Visual History, Updated and Expanded Edition."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Discover everything you've ever wanted to know about Star Wars in this complete history of the most famous franchise in movie history."}, {"tag": "p", "text": "Painstakingly researched and superbly illustrated, Star Wars™ Year By Year: A Visual History, New Edition presents a unique Star Wars timeline-the full history of the amazing Star Wars phenomenon as you've never seen it before."}, {"tag": "p", "text": "This stunning visual journey features trivia and cultural cornerstones from director George Lucas' early life through to the iconic movie stills, comic books, novels, toys, video games, and theme parks that have spawned from five decades of seminal film making."}, {"tag": "p", "text": "Fully updated and expanded, this edition encompasses all nine episodes of the original, prequel, and sequel trilogies, along with the standalone movies Rogue One and Solo, and the acclaimed television series, The Mandalorian."}, {"tag": "p", "text": "Produced in full collaboration with Lucasfilm and written by renowned Star Wars experts, Star Wars Year by Year: A Visual History, New Edition is ideal for Star Wars fanatics and newbies alike."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}