{"url": "Star_Wars_multimedia_projects", "categories": ["Category:Real-world articles", "Category:Multimedia projects", "Category:Real-world lists"], "nodes": [{"tag": "h1", "text": "Star Wars multimedia projects"}, {"tag": "p", "text": "The following list is of all Star Wars multimedia projects."}, {"tag": "h2", "text": "Angry Birds Star Wars"}, {"tag": "p", "text": "First released on November 8, 2012 as a video game, the series later expanded to young readers books."}, {"tag": "h3", "text": "Video games"}, {"tag": "h3", "text": "Books"}, {"tag": "h2", "text": "Clone Wars multimedia project"}, {"tag": "p", "text": "The Clone Wars multimedia project was a project created by Lucasfilm Ltd., in conjunction with Del Rey, Dark Horse Comics, Cartoon Network and LucasArts. After April 25, 2014, the contents of the project were declared part of the Star Wars Legends continuity."}, {"tag": "h2", "text": "Dark Forces"}, {"tag": "p", "text": "The Dark Forces saga first started with the Legends video game Star Wars: Dark Forces after the success of the game four sequels were released along novellas, audio adaptation of the novellas, and tie-in comics."}, {"tag": "h2", "text": "Journey to Star Wars: The Force Awakens"}, {"tag": "p", "text": "Journey to Star Wars: The Force Awakens is a canon project released in 2015 that consisted in books and comics that featured content related to the film Star Wars: Episode VII The Force Awakens."}, {"tag": "h2", "text": "Journey to Star Wars: The Last Jedi"}, {"tag": "p", "text": "Journey to Star Wars: The Last Jedi is a canon project released in 2017 that consisted in books and comics that featured content related to the film Star Wars: Episode VIII The Last Jedi."}, {"tag": "h2", "text": "Journey to Star Wars: The Rise of Skywalker"}, {"tag": "p", "text": "Journey to Star Wars: The Rise of Skywalker is a canon project released in 2019 that consisted in books and comics that featured content related to the film Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h2", "text": "LEGO"}, {"tag": "p", "text": "Lego is a toy brand of bricks that can be assembled. In 1999 became their first entertainment-related licensed product, since then several products have been released. Lego has also released several books, video games, short films and television series based on the Star Wars universe."}, {"tag": "h2", "text": "The New Jedi Order"}, {"tag": "p", "text": "The New Jedi Order is a Legends multi-author book series that was published by Del Rey, consisting of nineteen novels, three eBook novellas, and three short stories. Was a collaborative effort conceived by representatives of Del Rey, Lucasfilm Ltd., and Dark Horse Comics.\nA comic book series called Star Wars: Invasion was released by Dark Horse comics that included various ties to the novels."}, {"tag": "h2", "text": "Republic Commando"}, {"tag": "p", "text": "After the release of the Legends computer game Star Wars: Republic Commando, several spin-offs related directly to the game were published. Among them novels, video games, comics and short stories about Delta Squad and Omega Squad."}, {"tag": "h2", "text": "Star Wars: Droids"}, {"tag": "p", "text": "Star Wars: Droids: The Adventures of R2-D2 and C-3PO is a Legends animated television series that features the exploits of the droids C-3PO and R2-D2. Several books, comics, toys and trading cards based on the series were released."}, {"tag": "h2", "text": "Star Wars: Ewoks"}, {"tag": "p", "text": "Star Wars: Ewoks is a Legends animated television series that follows the adventures of the Ewoks of Bright Tree Village prior to the Battle of Endor. Several books were released along a comic series published by Marvel."}, {"tag": "h2", "text": "Star Wars: Forces of Destiny"}, {"tag": "p", "text": "Star Wars: Forces of Destiny is a canon animated micro-series that takes place around all eras of the Star Wars universe. The shorts were released first on the Disney's Youtube channel. Along with the animated shorts, some books, toys and apparel were released."}, {"tag": "h2", "text": "Star Wars Galaxies"}, {"tag": "p", "text": "Star Wars Galaxies was a Star Wars-themed MMORPG developed by Sony Online Entertainment and published by LucasArts. The game had an online trading card game that ended at the same time when the game was shut down. Along the card game a spin-off novel and short story were released."}, {"tag": "h2", "text": "Star Wars Rebels"}, {"tag": "p", "text": "Star Wars Rebels is a canon animated television series set two to five years before the events of the Star Wars original trilogy. Before the release of the series animated shorts and books were released as a tie-in to the series. The series have several material that includes partial adaptation books, junior novels, reference books, a magazine series, a novel, online games and a Marvel comic series."}, {"tag": "h2", "text": "Star Wars: Shadows of the Empire"}, {"tag": "p", "text": "Star Wars: Shadows of the Empire was a Legends multimedia project created by Lucasfilm Ltd. in 1996. The story was set between the films Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi. Several products were released, including a novel, a junior novelization, a six-issue comic series, a video game, trading cards, a soundtrack, a role-playing game, toy figurines, a series of MicroMachines toys, vinyl dolls and statuettes, model kits, and a line of action figures and more."}, {"tag": "h2", "text": "Star Wars: The Clone Wars"}, {"tag": "p", "text": "Star Wars: The Clone Wars is a canon animated television series set between the events of Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith.\nSeveral tie-in media was released but many of them is now part of the Legends continuity, that media included novels, junior novels, web comics, graphic novellas, reference books, video games and more. In the new canon continuity there's a novel and a comic series that have been released as part of the tie-in media."}, {"tag": "h2", "text": "Star Wars: The Force Unleashed"}, {"tag": "p", "text": "Star Wars: The Force Unleashed was a Legends multimedia project created by LucasArts, in collaboration with Dark Horse Comics, Del Rey, and more. It features products across different lines, all covering the same story. This includes a video game, a game guide, a novel, a graphic novel, a toy line, a reference book, a Miniatures set, and an RPG supplement."}, {"tag": "p", "text": "A sequel to the video game, Star Wars: The Force Unleashed II, was released two years after the first one, and it also included a novel and graphic novel."}, {"tag": "h2", "text": "Star Wars: The Old Republic"}, {"tag": "p", "text": "Star Wars: The Old Republic is a Legends massively multiplayer online role-playing game (MMORPG) that was produced and released by BioWare, a subsidiary of Electronic Arts. The game was accompanied by an expansive metaseries of Star Wars multimedia, including a four-book novel series, three comic series (Threat of Peace, Blood of the Empire, and The Lost Suns), and a number of short stories, cinematic trailers and more additional content."}, {"tag": "h2", "text": "Star Wars: The High Republic"}, {"tag": "p", "text": "Star Wars: The High Republic is a Canon publishing initiative set 200 years before Star Wars: Episode I The Phantom Menace. Announced in February 2020, the project consists of novels, comic books, young readers material and short stories. It was originally intended to begin in August 2020, but was delayed to January 2021."}]}