{"url": "Battle_in_the_Ilum_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Ilum"], "nodes": [{"tag": "h1", "text": "Battle in the Ilum system"}, {"tag": "p", "text": "In 1 BBY, a battle between the Galactic Empire and the Black Sun pirates in the Ilum system in an effort to discover the identity of an Imperial traitor who attempted to jeopardize the Empire's operations on Thyferra. After the location of the pirates was confirmed by a probe droid, the Empire hired the bounty hunter Boba Fett to scout out the pirate base and destroy their early warning systems. Fett succeeded in the task and an Imperial task force was brought in to attack the pirate asteroid base to root out the leader, who attempted to escape aboard an Interceptor-class frigate. Eventually, however, the pirate ship was neutralized and boarded, and the leader was taken away to be interrogated."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When the Galactic Empire invaded the Inner Rim planet Thyferra—controlled by the Alliance to Restore the Republic—the Sith Lord Darth Vader suspected that someone had warned the Rebels of their approach. Pirate insignias found on Rebel equipment led Vader to the conclusion that the Alliance was co-operating with the pirates, trading information on Imperial cargo routes in exchange for supplies. However, his investigation was interrupted by the news of a Rebel uprising on the starship-producing world of Fondor. Vader thus ordered his forces to eliminate the threat and recover any communications they discover. After the uprising was suppressed, the Empire intercepted coded transmissions that eventually led to the Unknown Regions planet Ilum."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The planet had heavy defenses installed, so Vader hired Boba Fett to use his stealth skills as the pilot of the Slave I to slip through their defenses and destroy the sensor pods, allowing the Imperial Navy to move in."}, {"tag": "p", "text": "With this done, the Imperial fleet was free to pursue the pirate leader, who tried to escape in his Pirate interceptor cruiser. Boba Fett hit a blow to the pirate's engines before he could jump to hyperspace, and the leader surrendered himself."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Their leader supplied the Galactic Empire with more information on Moff Kalast."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was the third mission of the Imperial campaign in the 2006 video game Star Wars: Empire at War."}, {"tag": "p", "text": "The strength and composition of the imperial force may vary at the player's wish, only the Probe droid and Slave I (Boba Fett's starship) are mandatory in this mission. Attaching Darth Vader (who pilots the TIE Advanced) to the imperial fleet is optional."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}