{"url": "Battle_in_the_Imperial_Security_Bureau", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Coruscant", "Category:Battles of the Great Jedi Purge", "Category:Duels", "Category:Jedi missions"], "nodes": [{"tag": "h1", "text": "Battle in the Imperial Security Bureau"}, {"tag": "p", "text": "This battle was a rescue mission that dissolved into an utterly chaotic encounter."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Jedi Knight Jax Pavan had arranged a plan with I-5YQ and the rest of his companions, first proposed by Tuden Sal, to assassinate the Emperor. The theory behind the plan was that as I-5YQ was a droid, his intentions would be unreadable in the Force, and he would be able to sneak up on Palpatine and kill him before the Emperor could react. After much infighting on whether or not to adopt the dangerous plan, Jax and his friends finally decided to try it."}, {"tag": "h3", "text": "Change of Plans"}, {"tag": "p", "text": "For a long time, Darth Vader had been hunting down Jax Pavan. A Zeltron named Dejah Duare had joined Jax's group of friends in the organization called Whiplash. The Zeltron enjoyed the affects of feeling the Force. Pavan, however, shut himself away from her. She experienced the opposite with an Imperial Inquisitor named Probus Tesla, and she betrayed Pavan."}, {"tag": "p", "text": "Laranth Tarak was taking Kajin Savaros to the Whiplash headquarters when they were ambushed and captured by Imperials. Darth Vader tortured Laranth and had Kajin's mind wiped. He then turned Kajin against the Jedi, making him believe that he was Sith."}, {"tag": "p", "text": "When Jax heard about Laranth and Kajin's capture, he declared that their assassination mission had turned into a rescue mission. Jax discovered that Laranth was being held in the ISB Central Office. After consulting with the Whiplash, Jax contacted Vader and proposed a trade. They would hand over I-5YQ, who was also a target of Vader's, in return for Laranth Tarak."}, {"tag": "h2", "text": "Confrontation"}, {"tag": "p", "text": "I-5YQ was escorted into the building by Dejah Duare and Haninum Tyk Rhinann. They were met by three Inquisitors who took them to the detention center where Laranth was being kept. Waiting for them there was Darth Vader, Kajin Savaros, and Emperor Palpatine himself. I-5, however, did not attempt to shoot the emperor, and Palpatine disappeared, as he was just a hologram. Vader then asked Dejah which one of them had the bota. She admitted that she did not know, but suggested that perhaps I-5 had given the vial to the Jedi. She turned to one of the Inquisitors, who was really Jax in disguise. Jax and his friends were shocked at her betrayal, and she revealed that she did not betray them because of politics or for personal reasons, but because she enjoyed feeling the Force, and that Inquisitor Probus Tesla did not have the same moral restrictions as Jax did, that kept them from truly touching each other."}, {"tag": "h3", "text": "Bota"}, {"tag": "p", "text": "Vader demanded the bota from Jax, but the Jedi Knight didn't have it. Vader told Jax to make I-5 give him the bota. I-5 replied that he didn't have it, and then shot his lasers at Vader. Vader, however, sensed the droid's intentions through the Force, proving that I-5 had become somewhat sentient, and was able to deflect the shots with his hand. When nobody would hand over the bota, Vader Force-slammed Jax against a nearby wall. Laranth finally gave in and revealed that she had the bota. Vader took it, and then made Jax hand over the pyronium nugget he had given him long ago. He then asked for Darth Ramage's holocron, the Sith holocron that had information on how to combine the effects of pyronium and bota. But Jax no longer had the holocron. Vader said that it did not matter, and decided to take the bota anyway, injecting the serum into himself via the receptacle on his chest plate, despite a last-second protest from Tesla."}, {"tag": "h3", "text": "Chaos"}, {"tag": "p", "text": "For a moment, the bota did not seem to affect Vader hardly at all. Then he suddenly lost control of himself. Jax decided that this was the time to attack Vader, and he activated his lightsaber. Vader, however, began hurling Force energy in all directions, completely out of control. One of his shots sent a durasteel frame down on I-5, trapping the droid. Another hit the EMP field that had been scrambling Laranth's Force-sense. Now free, she moved to protect Kaj. Everybody ran for cover except for Dejah, who loved experiencing the Force. Before long she was hit by one of Vader's blasts of Force energy and smashed against the wall, dead. Another blast hit the second inquisitor, killing him as well."}, {"tag": "p", "text": "Laranth attempted to use the Force to cloak Vader, but to no avail. I-5 began to use his lasers to to work his way free of the door. Jax moved cautiously towards the Sith Lord, but Probus Tesla blocked his way and engaged him in a duel. Tesla was then glanced by one of Vader's blasts and was knocked away. Jax then attacked Vader with his lightsaber, but the blow just ricocheted off the Force that cocooned the Dark Lord and the lightsaber flew out of Jax's hand as he was knocked to the ground."}, {"tag": "p", "text": "Just then a Whiplash strike team led by Thi Xon Yimmon came rushing in. Tuden Sal was one of the members, and he tried to get Kajin to safety, but the boy broke free and charged toward Vader. Vader roped him with the Force and sent him flying toward an open window. Jax moved to help the boy, but Vader lassoed him with the Force as well."}, {"tag": "p", "text": "Rhinann, who had been watching from cover, could not stand to see Vader use up the last of the bota. His last chance to touch the Force was disappearing before his eyes. He attacked the Dark Lord, jumping on him and trying to tear apart his breathing apparatus. Vader lost his hold on Jax and Kajin, and stumbled out the window with Rhinann in tow. They hit the ground after a long fall, and for a brief moment, Rhinann touched the Force, feeling it rush through him as he died."}, {"tag": "p", "text": "Back in the control room, Jax noticed that Tesla had disappeared. There was a burst of Force energy from the hangar and the building began to blow up. Jax quickly collected the pyronium and his lightsaber and rushed to safety."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the encounter, Jax and Laranth contemplated many things, and Jax wondered whether or not Vader was indeed Anakin Skywalker. Den Dhur, who was a member of the strike team that had come to their rescue, rejoined Jax and his friends, and the group went back to their work with Whiplash."}, {"tag": "p", "text": "Darth Vader and Probus Tesla both survived, though what became of Tesla afterward is unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was created by author Michael Reaves to be the final confrontation in the Star Wars: Coruscant Nights trilogy. Though the cover of Coruscant Nights III: Patterns of Force depicts Vader and Pavan facing off with lightsabers, the two never actually engage in a lightsaber duel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}