{"url": "Battle_in_the_Milagro_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Chaykin sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle in the Milagro system"}, {"tag": "p", "text": "The Second Battle of Milagro occurred in 5 ABY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Milagro had been the secret headquarters of the Alliance of Free Planets for several months."}, {"tag": "p", "text": "Following the liberation of the planet, Chief of State Mon Mothma went to Milagro in order to meet the victorious officers of the New Republic Fourth Battle Group. Imperial Admiral Uther Kermen who had lost the planet decided to attack them."}, {"tag": "p", "text": "The Mon Mothma's flagship, the Dreadnaught New Hope, was in orbit around the world. Six days before, a battle group had been dispatched from Milagro, leaving the planet nearly undefended; the only New Republic forces were the New Hope itself and its elite squadron of new X-wing starfighters and crack pilots."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The New Hope came under attack by wings of TIE/LN starfighters, TIE/IN interceptors, and TIE/sa bombers, without warning. General Han Solo, who had been visiting Mon Mothma with his girlfriend Leia Organa, took command of the New Hope's forces from his ship, the Millennium Falcon. He would be joined by two squadrons of mixed X-wings and Y-wings, flown by wounded pilots from the hospital ship Mercy, as well as two newly-delivered B-wings."}, {"tag": "p", "text": "As Solo's group attempted to search for the Star Destroyer that had delivered the TIEs, Luke Skywalker in his X-wing and Jan Ors and Kyle Katarn in the Moldy Crow dropped out of hyperspace, returning from their mission to Sulon that they had left for two weeks earlier. They immediately destroyed two TIE fighters and spotted the Imperial-class Star Destroyer that was housing them. It had sustained damage to its prow in an earlier battle and its captain, Purdy M. Trico, had withdrawn to Milagro for repairs, believing it to be abandoned."}, {"tag": "p", "text": "Trico executed his executive officer for suggesting a retreat or surrender, while Skywalker had the New Republic fighters fly between the destroyer and its surrounding support ships, thus reducing the Imperials' ability to use covering fire. At the same time, the New Hope was maneuvered closer to the destroyer to contribute its heavy weapons to the fight."}, {"tag": "p", "text": "After three hours of battle, the Imperial weapons control officer killed Trico, and the battle ended two minutes later. For his part in the battle, Skywalker was promoted to general, while the captured Star Destroyer was renamed the Crynyd and would later be a part of Solo's fleet in the campaign against Warlord Zsinj."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}