{"url": "Star_Wars_audio_dramas", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:NPR audio dramas", "Category:Multimedia projects"], "nodes": [{"tag": "h1", "text": "Star Wars audio dramas"}, {"tag": "p", "text": "An expanded radio dramatization of the original Star Wars trilogy was produced in 1981, 1983, and 1996. The first two radio series, based on Star Wars and The Empire Strikes Back, were produced and broadcast by National Public Radio as part of NPR Playhouse. A dramatization of Return of the Jedi was produced by most of the same team and also broadcast on NPR. Later all three dramatizations were published by HighBridge Audio."}, {"tag": "p", "text": "The radio serials were made with the full co-operation of George Lucas, who for one dollar each sold the rights to KUSC-FM, the public radio affiliate at his alma mater, the University of Southern California. Lucas also allowed the use of original sound effects and music from the films."}, {"tag": "p", "text": "The adaptations for radio are part of Star Wars canon within its Expanded Universe. National Public Radio has no plans to produce radio dramatizations of any other Star Wars films."}, {"tag": "h2", "text": "Star Wars"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Cast"}, {"tag": "p", "text": "Many of the actors involved in the movie were unavailable to reprise their roles: Harrison Ford, for instance, was committed to the first Indiana Jones movie. Two of the actors, Mark Hamill and Anthony Daniels, returned to reprise their roles as Luke Skywalker and C-3PO respectively."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The supporting cast included James Blendick, Clyde Burton, Bruce French, David Alan Grier, Jerry Hardin, John Harkins, Meshach Taylor, Marc Vahanian, John Welsh, and Kent Williams."}, {"tag": "h2", "text": "The Empire Strikes Back"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Cast"}, {"tag": "p", "text": "Billy Dee Williams reprised Lando Calrissian, and John Lithgow played Yoda; at the time Madden was directing Lithgow in the play Beyond Therapy."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The supporting cast again included David Alan Grier and also included Sam McMurray, Steven Markle, Stephen D. Newman, John Pielmeier, Geoffrey Pierson, Gary Tacon, and Jerry Zaks."}, {"tag": "h2", "text": "Return of the Jedi"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Cast"}, {"tag": "p", "text": "The adaptation used many of the original radio cast, though Joshua Fardon took over as Luke and Arye Gross replaced Billy Dee Williams as Lando. Ed Begley, Jr. was the voice of Boba Fett and Ed Asner, speaking only in grunts, guest-stars as Jabba the Hutt. The only actor who starred in both the feature films as well as previous radio dramas was Anthony Daniels."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The supporting cast included Rick Hall, Andrew Hawkes, Sherman Howard, Karl Johnson, John Kapelos, Ron Le Paz, Joe Liss, Paul Mercier, Steven Petrarca, Jonathan Penner, Gil Segel, Nia Vardalos and Ron West."}, {"tag": "h2", "text": "Other broadcasts and releases"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}