{"url": "Star_of_the_Tion", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:YT-1300 light freighters"], "nodes": [{"tag": "h1", "text": "Star of the Tion"}, {"tag": "p", "text": "The Star of the Tion was a modified YT-1300 freighter assigned to members of the Alliance tasked with delivering updates for Alliance cell networks during the oppressive rule of the Galactic Empire. The ship was white with green striped markings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Upon entering the system of the industrial world of Lianna, the crew of Star of the Tion encountered a sizable Imperial fleet congesting the space lanes leading to the planet. There was no combat at the time for a war fleet of that size to be displaying such a presence, which meant that the Empire was looking for something. The Rebel crew were able to use their ship's modified sensors to detect a small vessel about the size of a two-person escape pod \"flickering\" in and out of view as it went. The sensors were good enough to help the crew ascertain that the vessel was actually a probe droid that the Empire had outfitted with a small cloaking device. This led to the discovery of the Empire's secret cloaking shield project called NOVA, and their regular mission being diverted to retrieve and disable the plans from the Santhe/Sienar Technologies Corporate Headquarters located on Lianna."}, {"tag": "h3", "text": "Escape from Lianna"}, {"tag": "p", "text": "After disabling the NOVA project, the Star of the Tion was pursued by two Lianna-class picket corvettes—the Reliant and the Audacious—who attempted to cut off the Rebel's escape to hyperspace. Unlike most pursuits in space, where there is only emptiness between the pursuer and the pursued, the area surrounded Lianna was clogged with small freighters, pleasure yachts, cruise liners, bulk freight cruisers and many more kinds of ships."}, {"tag": "p", "text": "The Audacious tried to herd the Rebels toward the Reliant, and the picket ships nearly caught the Alliance craft between them. They were unsuccessful in trying to corral the Star of the Tion, however, and left it for the waiting Victory II-class Star Destroyer Warlord, an older class ship assigned to sector patrol. Though competently commanded, the Warlord had its best TIE squadron reassigned to a sector with more Rebel activity to be replaced with inexperienced pilots, thus allowing the Star of the Tion to maneuver and fight through the blockade to escape."}, {"tag": "p", "text": "After entering hyperspace, the Rebels checked the plans to see if they were still intact. However, the Liannan engineers were quite capable in programming copy-protection protocols into their work. Five hours after the plans were stolen from the computers, a virus hidden deep within the software was activated. The program code succeeded in wiping all data from the storage device it was downloaded onto, leaving no viable copy of the plans for the NOVA project to continue."}, {"tag": "h3", "text": "Weapons Upgrade"}, {"tag": "p", "text": "Among the modifications later made to the ship were the replacement of the standard laser cannons with a light-duty turbolaser upgrade. This may have been a discreet contribution made by Lady Santhe (who was secretly allied with the Rebels) of Santhe/Sienar Technologies Corporation as reward to the crew of the Star of the Tion for sabotaging the NOVA project, a most difficult Imperial entanglement for her on Lianna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the WizKids' game, Star Wars Pocketmodels TCG: Base Set, the ship appears as a game piece called Star of Tion featuring turbolasers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}