{"url": "Star_of_Iskin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:AA-9 Coruscant freighters"], "nodes": [{"tag": "h1", "text": "Star of Iskin"}, {"tag": "p", "text": "The Star of Iskin was a Botajef Shipyards AA-9 freighter operational during the Clone Wars. In 21 BBY, sixteen months after the beginning of the war, it was scheduled to depart the galactic capital of Coruscant with passengers and cargo bound for the Outer Rim. Political exile and former Supreme Chancellor Finis Valorum planned to use the tramp freighter as transportation to distance himself from the political intrigue of the Core."}, {"tag": "p", "text": "However, upon its departure from Coruscant on 14:9:19, the Star of Iskin exploded, destroyed as part of a successful plot carried out by Anzat assassin Sajé Tasha to murder Valorum. All aboard the freighter were killed in what the general public viewed as an act of terrorism engineered by the Separatists; thousands more lives were claimed when the wreckage crashed down upon the Coruscanti cityscape. The Star of Iskin's destruction was used to great effect by certain members of the Galactic Senate to pass the controversial Enhanced Security and Enforcement Act, a piece of legislation that delegated additional wartime powers to Supreme Chancellor Palpatine, Valorum's political opponent."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A 390-meter-long AA-9 Coruscant freighter manufactured by the Botajef Shipyards, the Star of Iskin was a tramp freighter that ferried cargo and passengers from the Republic capital world of Coruscant. It had three engines."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Final voyage"}, {"tag": "p", "text": "The transport Star of Iskin was in service by 20.65 BBY, sixteen months following the opening battle of the Clone Wars between the Republic and the Confederacy of Independent Systems. On 14:9:19, the freighter was scheduled to depart a spaceport on Coruscant with a mixture of passengers and cargo aboard. Among the travelers planning to use the Star of Iskin to journey Rimward was Finis Valorum, the former Republic Supreme Chancellor who had returned from a self-imposed exile to assist Senators Bail Organa and Mon Mothma in opposing current Supreme Chancellor Palpatine's increasing wartime powers."}, {"tag": "p", "text": "However, opponents of Valorum's had planned to kill the former leader of the Republic. Anzat assassin Sajé Tasha was hired by the corrupt Senator Viento and Separatist acolyte Sora Bulq to eliminate Valorum. After the disgraced politician boarded the Star of Iskin, Tasha killed Valorum and drank his \"soup,\" per Anzati tradition, before sabotaging and escaping the freighter. As a result of Tasha's actions, the Star of Iskin exploded shortly after takeoff. All aboard perished, and thousands more were killed when the freighter's wreckage fell back to Galactic City."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Star of Iskin's destruction was viewed as an act of terrorism, and the attack was ultimately attributed to the Separatists. Gran Senator Ask Aak cited the Republic's inability to prevent the freighter's destruction as proof that the Enhanced Security and Enforcement Act, a controversial piece of legislation that would grant Palpatine more authority at the expense of the Galactic Senate, was desperately needed. Despite Senator Organa's best efforts to block the bill, the Senate passed the act the day after the freighter exploded, giving the Chancellor greater wartime powers—that which Finis Valorum had fought against. Additional policies, such as the Core Worlds Security Act, were also passed in the wake of the disaster."}, {"tag": "p", "text": "Immediately after the Star of Iskin's destruction, a memorial for the late Valorum was planned for the Chancellery Walkway in Coruscant's Jrade District, although, amidst security concerns, the memorial was not opened to the public until weeks later. Jedi Master Quinlan Vos later tracked down Tasha. Using his psychometric abilities, the Kiffar Jedi was able to witness the Anzat's memories of Valorum's murder and the Star of Iskin's destruction. Organa became increasingly suspicious of Palpatine in the months following the Star of Iskin's destruction and, with Senator Mothma, began forming a political body opposed to the Chancellor's increasing influence. By 19 BBY, just prior to the Battle of Coruscant, Organa still viewed Valorum's assassination as one of many convenient incidences that had occurred during Palpatine's consolidation of power."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star of Iskin first appeared in Dead Ends, the sixty-first issue of the Star Wars: Republic series of comics, released in 2004. \"The Lost One,\" an episode of the sixth season of the Star Wars: The Clone Wars television series, shows Finis Valorum alive and well in 20 BBY, in the time period following the Star of Iskin's destruction in 21 BBY. Lucasfilm did not address this inconsistency before declaring Expanded Universe material non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}