{"url": "Starcrusher/Legends", "categories": ["Category:Legends articles", "Category:Battleships", "Category:Confederacy of Independent Systems starships", "Category:Flagships"], "nodes": [{"tag": "h1", "text": "Starcrusher/Legends"}, {"tag": "p", "text": "The Starcrusher was a large Separatist battleship active during the Clone Wars. It served as the flagship of the Human Separatist Admiral Kirst."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The vessel was armed with powerful turbolaser cannons that could destroy several shielded Venator-class Star Destroyers in a single salvo. The ship also had tractor beam projectors.\nIt carried multiple escape pods for emergency situations."}, {"tag": "p", "text": "The ship's internal workings, including its reactor core, could be reached by a starfighter-sized vessel entering through one of its hangars. For internal security, the ship carried B1-Series battle droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The ship became infamous when it destroyed all Republic ships that attempted to attack it. A Jedi strike force that included Obi-Wan Kenobi, Mace Windu, and Ki-Adi-Mundi was sent to destroy the vessel, but this turned out to be a trap specifically made to target the Jedi."}, {"tag": "p", "text": "The Separatists created a decoy Starcrusher to lure prominent Jedi Knights, anticipating they would infiltrate the ship to destroy it. The Republic sent several cruisers to stage an attack on the CIS fuel tanker Aurora. The Republic fleet retreated as the huge Separatist warship arrived, leaving a T-6 shuttle with a Jedi strike team to infiltrate the tanker and hijack an incoming shuttle sent from what they assumed to be the Starcrusher.\nThe decoy vessel was successfully infiltrated, but sent on a crash course with a nearby star and the skeleton crew abandoned the Jedi to their fate."}, {"tag": "p", "text": "The decoy ploy eventually turned against the Starcrusher, as the ship entered the same system to pick up the skeleton crew. Anakin Skywalker entered the ship in his interceptor and destroyed its reactor. The dead battleship was then pulled into the decoy vessel, which had become magnetized, and both fell into the gravity well of the star, destroying them and killing the Starcrusher's crew."}, {"tag": "h2", "text": "Appearances"}]}