{"url": "Starbird_(symbol)", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Starship aliases and nicknames", "Category:Symbols"], "nodes": [{"tag": "h1", "text": "Starbird  (symbol)"}, {"tag": "p", "text": "The starbird, also known as the Wren Phoenix crest, was a stylized depiction of a legendary bird rising up in the air, with its wings spread and its head turned to the right. The Mandalorian weapons expert and graffiti artist Sabine Wren used that symbol as her personal signature."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The design was based on the starbird of ancient legend. The legend stated that a starbird could never die and that if it seemed to be gone, it was actually renewing itself in the heart of a nova."}, {"tag": "p", "text": "At some point, the symbol was adopted by Sabine Wren, a Mandalorian warrior who put her own artistic spin on the design, drawing inspiration from Janyor's protest paintings on Bith. During her time with the rebels from the planet Lothal, led by former Jedi padawan Kanan Jarrus, she painted the symbol wherever the small band would strike. She also painted it on her breastplate. Eventually, it became her trademark, with the design also coming to be known as the Wren Phoenix crest."}, {"tag": "p", "text": "One such victory occurred on Lothal, when Wren sabotaged one of the planet's key air fields. She used the symbol again when she blew away a good part of the Lawbringer during the concurring skirmish. Again, on the rebels' mission to steal Imperial weapons, she painted her trademark on crates in a hangar bay on Garel, killing or distracting the pursuing stormtroopers as to allowing the Ghost, flown by rebel captain Hera Syndulla, to make its escape. Wren's sign, however, was not made using ordinary paint, but, instead, was a concoction of her own making that resulted in an explosion. She utilized her explosive symbol again at the Spire on Stygeon Prime."}, {"tag": "p", "text": "She also enjoyed vandalizing Imperial propaganda posters with the starbird symbol."}, {"tag": "p", "text": "Starbird was also one of many fake identities used by the Spectres to identify the Ghost."}, {"tag": "p", "text": "By the third year before the Battle of Yavin,[source?] the use of Wren's starbird had spread among the members of the larger rebellion. Notably, the rebel ship Evac One bore that symbol on its hull."}, {"tag": "p", "text": "The Lothal resistance group used the starbird symbol to mark escape routes through the sewers of multiple towns and cities, including Jhothal, which was used by the Spectres on their mission to Lothal in 1 BBY. Ezra, recognizing the symbol, deduced that it had to have been left by the Lothalian rebels as Sabine would not have had the opportunity to leave her signature there. Later, the starbirds in the Lothal City sewers were used by Chopper and Mart Mattin to escape after the failed Rebel attack on Lothal's Imperial Armory Complex."}, {"tag": "p", "text": "Eventually, Wren's starbird was combined with the three-pronged symbol used by Saw Gerrera to create the Rebel Alliance starbird."}, {"tag": "p", "text": "Around the time of the Battle of Scarif, the Rebel pilot Farns Monsbee had a modified version of Wren's Phoenix crest on his flight helmet."}, {"tag": "p", "text": "Late in the Cold War, Torra Doza had a poster with the full starbird symbol on the wall of her bedroom on the Colossus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star Wars Rebels phoenix logo was designed by Lucasfilm concept artist Chris Glenn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}