{"url": "Battle_in_the_Phindar_system", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Berch Teller campaign"], "nodes": [{"tag": "h1", "text": "Battle in the Phindar system"}, {"tag": "p", "text": "In 14 BBY, a battle took place in the Phindar system between Berch Teller's rebel cell and Imperial forces under Moff Wilhuff Tarkin and Darth Vader. The Imperials intercepted the stolen Carrion Spike as the corvette was docking with a tanker to refuel above Phindar. Vader and Tarkin's Yellow Squadron of V-wing starfighters attacked the Carrion Spike. The tanker dispatched Aggressive ReConnaissance-170 starfighters to intercept Tarkin's starfighters. Before the Imperials could fire at the Carrion Spike, the ship fled into hyperspace. The tanker was then destroyed by a rogue fuel cell, which destroyed several V-wings."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, a group of dissidents led by former Republic Intelligence agent Berch Teller embarked on an insurgency against the Galactic Empire. Sharing a special animus towards Moff Wilhuff Tarkin for his role in the Antar Atrocity, Teller and his dissidents stole Tarkin's personal corvette Carrion Spike, which was equipped with an advanced hyperdrive and stealth technology. Teller's dissidents attacked several Imperial facilities along the Perlemian Trade Route."}, {"tag": "p", "text": "They were secretly aided by Vice Admiral Dodd Rancit, a rival of Moff Tarkin. Rancit used his position as Director of the Naval Intelligence Agency to channel equipment, former Separatist weaponry and starships, and intelligence to Teller's cell. Following a raid on TaggeCo's mining facility on Lucazec, Teller brought the Carrion Spike to refuel with a tanker facility above the planet Phindar in the Mandalore sector. Teller posed as Commander Abel LaSal and managed to convince the tanker to let them dock and refuel."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "The Phindian tanker facility's administrator alerted Moff Tarkin to the Carrion Spike's presence. He informed them that the corvette had completed refueling and was preparing to detach. While the administrator offered to let his workers and stormtroopers take on the crew, Tarkin advised him to avoid raising any suspicion. Meanwhile, as a precaution, Teller placed an explosive device inside a spent fuel cell that was deposited in one of the tanker's starboard storage bins. After the dissidents had finished refueling, Imperial forces exited hyperspace."}, {"tag": "p", "text": "For the battle, Tarkin deployed the escort carrier Goliath, the V-wing Yellow Squadron, and Darth Vader's black Eta-2 Actis-class light interceptor. In response, Teller's Gotal pilot Salikk proposed doing a jump beyond Phindar and its principal moon. Teller then advised him to fly the ship as close as possible to the tanker and to protect the hyperdrive generator at all costs."}, {"tag": "p", "text": "As the Imperial fighters closed in on the stolen Carrion Spike, Tarkin briefed the pilots that their goal was to force the corvette to lower its deflector shields before they returned fire. Their next priority was to target the hyperdrive generator, which was aft of the main guns along the corvette's spine. Shielded by powerful deflector shields, the Carrion Spike tucked itself under the tanker and destroyed two V-wings with its lateral laser cannons. As the Carrion Spike continued its run, Vader and Tarkin strafed the corvette but failed to take it out."}, {"tag": "p", "text": "The remaining V-wings Yellows Three, Five, Ten, and Twelve fired at the corvette's command center as it did its third loop around the tanker but failed to penetrate its powerful shields. As the dogfight continued, the tanker deployed six Aggressive ReConnaissance-170 starfighter. Tarkin ordered the Phindian administrator to withdraw his fighters but the administrator insisted on defending his ship. Tarkin then ordered the Commander of the Goliath to fire its proton torpedoes at the corvette as it made a run for the crest of the tanker hull."}, {"tag": "p", "text": "Before the Goliath could open fire, the Carrion Spike hurtled away from the tanker and flew towards the support carrier, firing all its guns. The Carrion Spike also shot down the V-wings Yellows Five and Twelve. The Carrion Spike then activated its cloaking device, frustrating the Goliath gunners. The Carrion Spike then fled into hyperspace shortly before the tanker exploded, annihilating the six ARC-170 starfighters and singeing the tails of Yellow Squadron's starfighters. Tarkin and Vader survived but their forces were down to two starfighters and their escort carrier."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle in the Phindar system, Berch Teller and his dissidents discovered that Tarkin had been tracking them using the ship's paralight tracker. To throw the Imperials off-scent, Teller transmitted coordinates which led them to believe that the insurgents were heading to the Obroa-skai system in the Inner Rim. As a diversion, Teller's fellow dissident, the information broker Knotts, hired a Koorivar captain and his ship Reticent to travel to Obroa-skai as decoys; setting the stage for the events in the Obroa-skai system. The dissidents also transmitted a short holovid of the clash on the Imperial HoloNet, which was received by a couple of local systems."}, {"tag": "p", "text": "Meanwhile, Phindar's rescue and recovery operation determined that the tanker was destroyed by an explosive device concealed inside a spent fuel cell. With reports indicating that Teller's dissidents had fled to the Expansion Region, Vice Admiral Rancit convinced Emperor Palpatine that the dissidents were planning to attack targets in the Inner Rim. The Empire also deployed interdictor vessels leased from the Deep Core Security Zone to assist in the hunt for the Carrion Spike."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle in the Phindar system first appeared in James Luceno's 2014 novel Tarkin, the second in a line of new Canon adult novels published by Del Rey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}