{"url": "Star_of_Alderaan", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic awards"], "nodes": [{"tag": "h1", "text": "Star of Alderaan"}, {"tag": "p", "text": "The Star of Alderaan was the fifth highest decoration that was awarded by the Alliance High Command. It was created to honor the contributions of Alderaan and its leadership to the creation of the Alliance to Restore the Republic. It was issued for acts of bravery during combat. It was below the Mantooine Medallion."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview and requirements"}, {"tag": "p", "text": "The Star of Alderaan was the fifth highest decoration of the Alliance Military that was awarded by the Alliance High Command, and, although it remained prestigious, it was the most commonly awarded decoration. The Star of Alderaan was created to honor the contributions of Alderaan and its leadership to the foundation of the Alliance to Restore the Republic, and was awarded to Alliance Military personnel who exhibited actions of conspicuous bravery during combat operations that did not warrant a more prestigious honor, such as the Corellian Cross or the Illudium Star. Being awarded the Star of Alderaan was an impressive accomplishment, and spoke to the courage and professionalism of those who were awarded it, despite its prestige being detracted by its relative ubiquity. It was below the Mantooine Medallion."}, {"tag": "h3", "text": "Physical description"}, {"tag": "p", "text": "The Star of Alderaan was issued as a wearable medal and as a bar ribbon, and was a simple but aesthetically pleasing design. The medallion was a five-pointed gold star situated over a smaller disc with a center boss showing a stylized star with eight rays of light emanating from it. The backing disc was blue with a gold stripe located around its border. The ribbon from where the medallion was suspended from was a broad rectangle with a dark navy blue center stripe and two lighter blue stripes on its edges. At the center of the ribbon was a small fixed alloy that depicted Alderaan."}, {"tag": "p", "text": "The bar ribbon was horizontal and rectangular that was navy blue with two light blue stripes on the edges. Similarly to other decorations, the Star of Alderaan could be awarded numerous times, with each following award being represented by a small enamel starbird that was pinned to the the ribbon above the Alderaan pin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star of Alderaan was first mentioned in the new Star Wars canon in the 2016 Fantasy Flight Games sourcebook Lead by Example. It previously appeared in Star Wars Legends in Star Wars: X-Wing, a LucasArts computer game that was released in 1993."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}