{"url": "Battle_near_Athega", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Alchenaut sector", "Category:Battles of Rebel Alliance Operation: Quick Strike"], "nodes": [{"tag": "h1", "text": "Battle near Athega"}, {"tag": "p", "text": "The battle near Athega was a space battle between the Alliance to Restore the Republic and the Galactic Empire that took place in or near the Athega system."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Eleven Rebel blockade runners forming the convoy group Athega were being escorted through realspace by A-wing starfighters from Gold Squadron. With several minutes to go before the corvettes reached their hyperspace point, a force of long-range Imperial starfighters entered the system. TIE Avengers engaged Gold Squadron, which may have called in additional support from Red Squadron to assist, and Assault Gunboats began making torpedo runs against the Rebel convoy."}, {"tag": "p", "text": "Not quite four minutes into the fight, the Calamari Cruiser Defiance entered the system. It deployed Green Squadron, a force of X-wing superiority starfighters, from a safe distance. The Imperial Navy may have deployed the Victory-class Star Destroyer Aggressor into the system to counter the Rebel threat if its fighter groups called for reinforcements."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Attack on Rebel Convoy near Athega\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side—both sides have conflicting mission objectives—and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Rebel Alliance Operation: Quick Strike, using the default craft assigned to the player."}, {"tag": "p", "text": "The combat engagement is said to take place in a neutral system \"near Athega\". Whether Athega is intended to be a celestial body (which could place this battle in the Athega system) or the star system is unclear; the only certainty is that this combat engagement did not take place in deep space between star systems."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}