{"url": "Starhawk", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:New Republic starships", "Category:Starhawk-class battleships"], "nodes": [{"tag": "h1", "text": "Starhawk"}, {"tag": "p", "text": "The Starhawk was the prototype of the Starhawk-class battleship line and the product of the New Republic's Project Starhawk during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Starhawk was the prototype of the Starhawk-class battleship line, built in secret at the Nadiri Dockyards as part of the New Republic's Project Starhawk. It was assembled from the salvaged parts of Imperial-class Star Destroyers, including the Victorum. Being the prototype of the Starhawk line, it was the launching point for the New Republic to meet the larger capital ships of the Imperial Navy on equal terms."}, {"tag": "p", "text": "It had many landing bays across multiple levels of the vertical portion, accessible from the rear, that could accommodate multiple CR90 corvettes and GR-75 medium transports at the same time. It was outfitted with turbolaser batteries, deflector shields, heavy durasteel armor, and six Magnite Crystal Tractor Beam Arrays that produced a tractor beam ten times more powerful as the ones equipped on a Star Destroyer. This tractor beam was sufficiently strong enough to act as a weapon in its own right, capable of tearing sections of hull plating clean off a starship's superstructure."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Beginnings"}, {"tag": "p", "text": "After the Battle of Endor, the Galactic Empire learned of the secret project, and Admiral Rae Sloane tasked Captain Terisa Kerrill with hunting down the location of Project Starhawk. After gathering intelligence from various sources, such as Agent Thorn following her extraction on Hosnian Prime, and then later on from an attack on a New Republic convoy, the Empire learned the location of Project Starhawk."}, {"tag": "h3", "text": "Zavian Abyss"}, {"tag": "p", "text": "In an attempt to keep the Empire from finding Project Starhawk, Vanguard Squadron led an attack that lured the Imperial II-class Star Destroyer Overseer using droid-piloted transports. The Imperial ships were ambushed and the Starhawk revealed itself for the first time and used its powerful tractor beam to pull the Star Destroyer into the large asteroids, damaging it and causing Kerrill's forces to flee."}, {"tag": "h3", "text": "Nadiri Dockyards"}, {"tag": "p", "text": "Before launching an assault, Admiral Sloane came up with a plan to lure the Nadiri fleet away from the Nadiri Dockyards by launching a series of strikes on various New Republic outposts, such as Mon Cala. This left the Starhawk and the dockyards critically exposed for attack. It was at this time that the Overseer arrived and launched a daring assault, led by Titan Squadron. The dockyards' shield generators and hangars were targeted, and then the Imperials launched a baradium missile assault on the Starhawk causing huge amounts of damage, that included its hyperdrive. The Overseer fired a volley of missiles, but were intercepted by the MC75 Star Cruiser Temperance, which took all the hits and damaged its hyperdrive. The returning New Republic fleet forced the Imperials to retreat."}, {"tag": "h3", "text": "Sissubo debris field"}, {"tag": "p", "text": "General Hera Syndulla decided the next step was to get Project Starhawk to the safety of Chandrila, however without a hyperdrive on either the Starhawk or the Temperance, the fleet were going to limp their way through Sissubo's debris field. Titan Squadron attacked the smaller ships of the fleet, by targeting power cores from the salvaged Star Destroyers that were floating in the debris field. The explosions from the cores were enough to individually destroy eight CR90 corvettes and one EF76 Nebulon-B escort frigates. Too dangerous to continue on through the debris field, Syndulla's remaining ships were forced to change course and into the Ringali Nebula."}, {"tag": "h3", "text": "Galitan"}, {"tag": "p", "text": "With Syndulla's forces lost, weakened and in desperate need of reinforcements, Vanguard Squadron launched on a mission to get an old Rebel broadcast hub online, which was located over the nearby moon Galitan and to raise a distress call for New Republic reinforcements. Anvil Squadron arrived to help defend the crippled Starhawk. A major battle followed, with the Overseer accompanied by Imperial reinforcements from Admiral Sloane's fleet. Titan Squadron led the attack on the Starhawk, defeating Anvil Squadron and Lindon Javes in the process. One Titan TIE, piloted by an individual known only as \"Titan Three,\" managed to penetrate the hull, where a baradium missile was wedged unexploded from the previous assault at the dockyards, and fired into the tractor beam core, causing a catastrophic overload which would lead to its ultimate destruction. Victorious, Kerrill's forces left the battle, however some of Imperial fleet remained to continue the fight. Syndulla accepted the fate of the stricken Starhawk, but also acknowledged that there was still one last service it could perform."}, {"tag": "p", "text": "Syndulla hatched a plan to evacuate the crippled battleship of its crew and engineers, then send the Starhawk on a collision course with the exposed core of the nearby moon. This required corvettes to tow the Starhawk using a still functional tractor beam. Vanguard Squadron fought off waves of TIEs to protect the corvettes, and once it reached its optimum velocity, the Starhawk crashed into the moon's core and the unstable tractor beam mechanism detonated. This was in turn amplified by the energy of the moon's core and resulted in a colossal explosion of molten rock and subsequent shockwave that destroyed all nearby Imperial ships caught within it. Just before the explosion, Javes escaped from inside the hull of the Starhawk."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Despite the loss of the Starhawk, its sacrifice was not in vain, as its crew and engineers were safely transported to Chandrila to continue their work and construct more Starhawk-class battleships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}