{"url": "Starfighter_Corps_(Galactic_Empire)", "categories": ["Category:Legends articles", "Category:Imperial military units", "Category:Imperial Navy"], "nodes": [{"tag": "h1", "text": "Starfighter Corps  (Galactic Empire)"}, {"tag": "p", "text": "The  Starfighter Corps, also known simply as Imperial pilot corp, was a component of the Imperial Navy under the aegis of Flight Branch that controlled the Navy's starfighters and pilots."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "After the Declaration of a New Order in 19 BBY, the Republic Starfighter Corps lost its status as an independent arm of the military and was merged with the Imperial Navy. Unlike the Republic Navy, the Imperial Navy's doctrine focused on capital ship firepower rather than starfighter superiority and it subordinated the Starfighter Corps to this role. Consequently, the Empire turned away from snubfighter development, seeing it as a distasteful legacy of the great swarms of Vulture droid starfighters deployed by the Confederate Navy during the Clone Wars. The Empire instead focused on the creation of a new generation of space superiority fighters, culminating in Sienar Fleet Systems' TIE Series of starfighters."}, {"tag": "p", "text": "The TIE/LN Line Starfighter and the TIE/SA Bomber were barebones fighter designs built around a ball-shaped cockpit and Raith Sienar's revolutionary twin ion engine design. Seen as complements to Star Destroyers, they served as escorts, scouts, hit-and-fade raiders, and bombers supporting ground troops. As such, they lacked hyperdrives, deflector shields, or even life support systems, reducing their mass and giving them great speed and maneuverability, but also limiting their survivability and their range."}, {"tag": "p", "text": "TIE Fighters were deployed from the Victory-class Star Destroyer Strikefast as early as one week after the Declaration of a New Order, and they generally served the Starfighter Corps well during the Reconquest of the Rim and the campaigns against the last Separatist holdouts during the early Imperial Period, piloted by such Imperial aces as Shea Hublin. The Corps' doctrine went largely unchallenged until the Alliance to Restore the Republic emerged as a credible opponent to the Empire after 1 BBY. In time, the TIE Fighter came to be the most potent symbol of the Imperial Navy's control of space."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "The Alliance Starfighter Corps's doctrine during the Galactic Civil War was built around shielded, hyperspace-capable starfighters that were capable of long-range independent operations, were fast enough to counter TIE Fighters, and carried payloads powerful enough to bring down the shields of large capital ships. The Empire suffered an outright humiliation at the Fei Hu campaign in 1 BBY, where the Rebel Lightspeed Panthers, equipped with the T-65 X-wing starfighter, destroyed 265 Imperial fighters over the course of nine months with the loss of only four of their own."}, {"tag": "p", "text": "The subsequent Imperial defeat at the Battle of Yavin and the destruction of the First Death Star led the Starfighter Corps to begin mass production of the much faster, much more maneuverable TIE/IN interceptor, and to investigate development of its own snubfighters. However, both sheer cost and institutional opposition within the Navy meant that the TIE/AD \"Avenger\" and the TIE/D Defender would never see action outside of limited deployments. The Starfighter Corps attempted to redeem the humiliating defeat at Yavin with the victory at the Second Battle of Ord Biniir, which so happened to have occurred on the same day. The second squadron of the 181st Imperial Fighter Wing under the command of Captain Soontir Fel successfully engaged and destroyed numerous Rebel Y-wing starfighters and recaptured Ord Biniir. The victory was heavily propagandised by the Empire and Fel became an Imperial hero. Now considered an elite unit, the 181st was reduced in size to a group, and the 181st Imperial Fighter Group became one of the most glamorous Imperial units and attracted the Empire's finest pilots."}, {"tag": "p", "text": "By 4 ABY, the TIE Interceptor formed twenty percent of the Starfighter Corps and was the craft of choice for elite units like the 181st Imperial Fighter Group. It was deployed in force alongside traditional TIE Fighters at the Battle of Endor, but despite inflicting heavy losses upon the attacking Alliance Fleet, was ultimately unable to prevent the destruction of the Second Death Star and the death of Emperor Palpatine."}, {"tag": "h3", "text": "After Endor"}, {"tag": "p", "text": "The Imperial Military splintered among various rogue Moffs and Admirals that set themselves up as warlords in the aftermath of Endor, with only a Loyalist rump remaining to defend Sate Pestage's de jure successor government on Coruscant. Elite units like the 181st under Colonel Baron Soontir Fel remained loyal, fighting against the advancing New Republic at engagements like Brentaal IV, but were ultimately unable to prevent the New Republic's liberation of Coruscant in 6 ABY."}, {"tag": "p", "text": "The collapse of centralized Imperial authority led to numerous changes in starfighter doctrine: Warlord Zsinj deployed the shielded, missile-equipped TIE Raptor, a craft of his own design. Separated from the Imperial Academy and traditional sources of recruitment, officers like Grand Admiral Thrawn were forced to recognize that veteran TIE pilots could no longer be treated as expendable assets. TIE Interceptors were retrofitted with deflector shields, while poorly-armored TIE models were redesigned as support craft flown by droid brains, resulting in the development of the TIE/D automated starfighter."}, {"tag": "p", "text": "The Starfighter Corps and the rest of the Imperial Military was consolidated under a single command in 12 ABY after Admiral Natasi Daala and Admiral Gilad Pellaeon reunified the Empire, forming the Imperial Remnant. Starfighters were an integral element of the Orinda campaign, the Remnant's first military offensive against the New Republic, and elite groups like the 181st, led by General Turr Phennir, continued to skirmish with the Republic until the Bastion Accords of 19 ABY."}, {"tag": "p", "text": "Under the Fel Empire in 130 ABY, the Starfighter Corps remained skeptical of snubfighters and continued to prefer the ancient combination of interceptors and bombers, with the heavily shielded Predator-class fighter and the Neutralizer-class bomber filling its starfighter forces."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Administration"}, {"tag": "p", "text": "The Starfighter Corps was under the purview of Flight Branch, which was responsible for the flight operations of all the Empire's warships, as well as all of the Empire's starfighters, including the pilots and support personnel."}, {"tag": "h3", "text": "Tactical organization"}, {"tag": "p", "text": "The Starfighter Corps took most of its organization from the Clone Wars-era structure of the Republic Starfighter Corps, though the positions of fighter wings and fighter groups in the hierarchy were swapped:"}, {"tag": "p", "text": "The typical formation of an Imperial-class Star Destroyer's wing was four TIE Fighter squadrons (one squadron was often equipped to be a reconnaissance squadron with TIE/rc starfighters), one squadron of TIE Bombers (lower priority ships had to make do with older TIE/gt fighter-bombers), and one squadron of TIE Boarding Craft. Often one or two flights in a fighter squadron were TIE/FC fire control craft. Sometimes, well disciplined pilots flew in formations of five, including the leader who often operates in the center. Sometimes one of the fighter squadrons was used for training purposes. By the Battle of Endor, one squadron had been swapped out in favor of a squadron of TIE Interceptors. During typical operations, two TIE squadrons provided screening for their Star Destroyer and any escort vessels, two conducted forward recon, and two were held in reserve. In addition, various units also placed authority on the leader, with the unit splitting apart if their leader was shot down."}, {"tag": "p", "text": "TIE Fighters assigned to ground operations were Navy vessels, but their pilots reported to an Imperial Army garrison commander, organized into ground support wings. The Navy's insistence on retaining control of all starfighters meant that ground support wings were smaller than those assigned to Star Destroyers, and consisted of forty TIEs in ten flights of four fighters each. Three flights were TIE Bombers, six were sorted into two squadrons of TIE Fighters, and a single flight of TIE/FC fire control craft. Nonetheless, the ground support wings were considered a change from the pre-Clone Wars era Republic Military, where Army units generally were not allowed access to starfighters at all, in large part due to the Republic Navy having extremely strict control over its starfighters."}, {"tag": "h2", "text": "Personnel"}, {"tag": "h3", "text": "Specializations"}, {"tag": "p", "text": "The most visible members of the Starfighter Corps were the TIE pilots. Distinguished by all-black flight suits and bulky, fully-enclosed, vacuum-sealed helmets, the Empire at its height produced millions of TIE pilots, and generally considered them expendable assets. The TIE pilots formed the elite of the Flight Branch, and in fact regarded the lack of protection in TIE Fighters to be a testament to this, and to their abilities. Serving TIE pilots rarely supported the intermittent attempts by Imperial officers to champion the introduction of better-protected starfighters. The rivalry between ground- and space-based pilots was legendary, which could often lead to drunken cantina brawls between \"ground-hogs\" and \"vac-heads\"."}, {"tag": "p", "text": "Other specializations included ground crew, providing maintenance and technical support for squadrons. The Imperial gunners were a special sub-unit of the Corps. Even though they did not make it to becoming pilots, Imperial gunners nonetheless possessed keen eyes, superior reflexes, and a rapport with specialized equipment, and as such they were tasked to use their skills with weapons to handle the powerful turbolasers and ion cannons of Imperial vessels, such as Star Destroyers and World Devastators. They were trained on handling light, medium and heavy turbolasers, as well as ion cannons, missile launchers and tractor beams. The Cruisemissile troopers were a specialized variant of the TIE pilots that were specifically trained to operate the Cruisemissile assault crafts, acting as the spearheads for the Imperial Navy, and by extension, the Starfighter Corps. Unlike standard TIE pilots and the fighters they were assigned to, however, the cruisemissile troopers were affixed to their craft from the waist down."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Starfighter Corps training occurred after basic training at the Imperial Academy. Flight training was reserved for the top five percent of graduates of the Sector Naval Academies, and the top third of graduates from the Imperial Naval Academy on Prefsbelt IV. The Empire operated various flight schools on capital ships, planets or asteroid bases. The most prestigious was the Flight Academy housed aboard the Venator-class Star Destroyer Vensenor."}, {"tag": "p", "text": "At flight school, a trainee pilot would be assigned to a partner and learn to operate as a team in combat through hundreds of hours of flight drills. Attrition was high: at one point flight training had a ninety percent failure rate. Fatalities in training were common, especially after cadets were assigned to actual combat missions."}, {"tag": "p", "text": "In some cases, they also trained their pilots via simulations of past battles, with there being at least four training operations for each vehicle. Completing a certain number of training missions had them being presented with a special medallion signifying their completion of the required training, with three for each vehicle. The Bronze medallion was awarded to those who completed half of the necessary training requirements. Silver was likewise awarded to those who completed three quarters of the necessary training requirements. Gold, lastly was awarded to those who completed all the necessary training. Similarly, training patches for various Imperial craft were also issued to any pilots who did at least five laps in the training simulator."}, {"tag": "h3", "text": "Ranks"}, {"tag": "p", "text": "Flight Branch rank insignia plaques were similar to those of the Imperial Army. The branch's specialist ranks included General, Colonel, Major, Commander, Flight Captain, Flight Lieutenant, and Flight Officer, which were the equivalent of Rear Admiral, Senior Captain, Senior Commander, Junior Commander, Senior Lieutenant, Junior Lieutenant, and Ensign, respectively, in the Navy's Line Branch."}, {"tag": "p", "text": "For the junior ranks of Captain and lower, their titles were prefixed by \"Flight\". TIE pilots in command positions also used positional titles, including Squadron Leader, Group Captain and Wing Commander. The very few pilots promoted beyond General were promoted into the Line Branch at the rank of Vice Admiral, although they generally retained the honorific branch title of Air Marshal. Another honorable rank given to very few pilots was the rank of Flight Baron. Pilots who had this title wore red streaks on their black pilot uniforms. One notable figure who held this rank is Soontir Fel."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Uniforms"}, {"tag": "p", "text": "Outside of combat, the Starfighter Corps wore the same olive-grey military uniforms as the rest of the Imperial Navy. In some cases, veterans like Captain Yorr, Juno Eclipse, and ace clone pilots were honored with all-black dress uniforms similar to those of the non-commissioned officers of the Stormtrooper Corps. Pilots in action wore all-black flight suits and fully-enclosed, vacuum-sealed helmets displaying the Imperial crest. The helmets themselves bore a strong enough resemblance to Stormtrooper helmets that the official field manual for the Empire's military forces, Imperial Handbook: A Commander's Guide, had to specifically state that the pilots, despite the appearance of the helmets, belonged strictly to the Imperial Navy, and were not Stormtroopers."}, {"tag": "p", "text": "Elite units were permitted to customize their uniforms and craft: the aces of the 181st Imperial Fighter Group wore red piping along the arms and legs of their flight suits and uniforms, as well as the wings of their TIE Interceptors, signifying that they had achieved ten kills in combat."}, {"tag": "p", "text": "Owing to their being a specialized version of the TIE pilots, the cruisemissile troopers wore similar uniforms to the ones used by TIE pilots while in action, although the primary difference is that the colors of the uniforms are inverted (i.e., the main color is white, and the Imperial crests on their helmets are black)."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "Some TIE pilots carried blaster pistols as sidearms in the event that they were shot down. However, since the odds of a pilot surviving a crash were low, standard issue of personal weapons was rare."}, {"tag": "p", "text": "Ceremonial sabers were issued as part of the Corps' dress uniform: officers who had been dishonorably discharged would have their swords broken as a sign of their disgrace."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "The primary craft of the Starfighter Corps were the immense number of variants of the TIE Series. By far the most common were the TIE/LN starfighter, the TIE/IN interceptor, and the TIE/sa bomber. Less common were the older TIE/gt fighter-bomber, the TIE/fc fire control craft, and the TIE/rc reconnaissance starfighter."}, {"tag": "p", "text": "As the Galactic Civil War ground on, the Starfighter Corps developed a series of experimental TIE variants designed to combat Rebel snubfighters, including the shielded, hyperdrive-capable and torpedo-equipped TIE/D Defender, the TIE Hunter, and the TIE/ph phantom, an exceedingly rare variant developed by Grand Admiral Martio Batch, equipped with a cloaking device."}, {"tag": "p", "text": "Although their most well known starfighter ordnance was the TIE series, they also had access to other types of fighters as well. A notable example of starfighters outside the TIE series was the Alpha-class Xg-1 Star Wing and the Missile Boat. However, the latter ultimately was shelved until further notice, both due to a near-theft of one of the prototypes and events caused by a coup from one of the Grand Admirals."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}