{"url": "Starkiller", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Bounty hunter starships", "Category:Freighters", "Category:Ghost ships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Starkiller"}, {"tag": "p", "text": "The Starkiller was a freighter used by the bounty hunter Leshy Drobo prior to 20,000 BBY. Drobo and his partner, the assassin droid XT-8, captured the Jedi Knight Roni von Wasaki, on whom a bounty had been placed. The Jedi was carbon-frozen and transported in a secret compartment aboard the Starkiller to the crime boss who had originated the bounty. While the starship was still in hyperspace transit, however, Wasaki, while still imprisoned in carbonite, planted a telepathic suggestion in Drobo's mind so that the latter would release the former. When XT-8 learned of his partner's intention, the droid attacked and killed him but incidentally also damaged the Starkiller's hyperdrive. The ship reverted to realspace, and XT-8 simply resigned to carrying on the trip at sublight speed, which made the journey drag on for twenty millennia."}, {"tag": "p", "text": "During the Galactic Civil War, another starship emerged out of hyperspace due to the presence of the Starkiller, which by that time was rumored to be a ghost ship. One of the ship's crew-members informed the others about the ancient history of the Starkiller, and the group eventually boarded the vessel. Aboard the ship, the explorers faced XT-8, who attempted to eliminate the boarders, and eventually learned about the ship's fate and discovered and liberated Wasaki, who had gone mad due to the thousands of years spent imprisoned in carbonite. The group of individuals and Wasaki subsequently departed from the Starkiller aboard the other starship."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Design and transportation capabilities"}, {"tag": "p", "text": "The Starkiller was a Frommon longhaul all-purpose transport, one of the earliest hyperspace jump-capable freighter models of the early period of the Galactic Republic. The thirty-meter-long transport starship, designed for a crew of two, had a shape that narrowed toward its bow, and two engine pods, containing a single ion coil sublight engine each, were located at the ship's stern. The name of the starship was stenciled across the side of the vessel in red lettering, and the Starkiller was equipped with a deflector shield generator, a nav computer, and a life support system that provided the ship with a breathable atmosphere."}, {"tag": "p", "text": "The Starkiller's cargo hold, with a capacity of one hundred metric tons, was situated between the two engine pods. A lift at the aft section of the hold could be dropped in order to load and unload cargo, but such an action was prevented by a security lock while the ship was in space. Inside the cargo hold, four grav-nets allowed for the securing of crates. A hidden compartment was also installed under the hold's floor. The engine room containing the hyperdrive access panel was located amidships, forward of the cargo hold. The Starkiller was equipped with a Class 4 hyperdrive with no backup drive."}, {"tag": "h3", "text": "The bridge and the lounge"}, {"tag": "p", "text": "The bridge of the Starkiller was located at the foremost section of the ship's bow. It had a viewport as well as two chairs in front of the bridge control console. The firing computer of the Starkiller's laser cannon turret could be linked to the console. The ship's computer banks could also be accessed from the latter, although unsuccessful attempts at slicing into the computer system triggered a trap: a blast door sealed the bridge off from the rest of the ship and ventilation ducts began sucking oxygen out of the room. In the bridge, the Starkiller's autopilot could be engaged, and unsuccessful tampering with a computer terminal elsewhere aboard the ship, as well as indiscreet electronic bypassing of the security lock of the vessel's inner airlock hatch, sounded an alarm in the bridge."}, {"tag": "p", "text": "The Starkiller, although having no capacity for passengers, had a lounge that was situated abaft of the bridge. The room was furnished with a table and two com-form chairs. It also had a viewport, red emergency lighting, and a holoprojection disc that was located in the center of the room. The controls for the holoprojector were installed in the lounge's furnishing, and when activated, the device displayed a hologram of a black-colored creature with membranous wings and a mouth filled with fangs that were dripping venom. The hologram at first emitted a loud, screeching sound and then ascended from the floor, before suddenly spreading its wings and looming over whomever was watching the display."}, {"tag": "h3", "text": "Other rooms"}, {"tag": "p", "text": "Situated in the outer corner of the lounge that adjoined the bridge, the Starkiller's head was equipped with washing and crude waste-disposal facilities. It also had a toilet, opposite of which was a vidscreen and a medpack hanged next to it. The vidscreen was programmed with periodic-files for reading purposes. The starship's small airlock was located at the other outer corner of the lounge, and it consisted of an outer hatch, an inner hatch, and the airlock proper, which was bare save for a security lock next to the inner hatch. The interior aft corner of the lounge contained what appeared to be an ordinary storage locker. An emergency space suit was hanged in the back of the room, and on the floor there were two boxes containing various junk. A hidden hatch in the room's ceiling, however, concealed a retractable ladder leading up to the firing seat of the Starkiller's laser turret."}, {"tag": "p", "text": "Also adjacent to the lounge was the galley of the Starkiller, which was stocked with everything related to the storage and preparation of food, including an autochef. The starship held two months' worth of consumables. Situated abaft of the galley, the captain's quarters included a bed, a chair, and a desk. A computer terminal which allowed access to the ship's computer system was mounted on the top of the desk. Set into the aft wall of the room, a storage cubicle housed a suit of bounty hunter armor, a force pike, and a heavy blaster pistol."}, {"tag": "h3", "text": "Changes over time"}, {"tag": "p", "text": "At some point, the upper hull of the Starkiller was modified, and the starship was publicly listed as having an armament rating of zero, which meant that it carried no weapons at all, despite the laser cannon the ship was outfitted with in reality. During the starship's twenty millennia–long journey at sublight speed, it became heavily outmoded, with its ion coil engines being crude by the standards of the Galactic Civil War."}, {"tag": "p", "text": "During its journey, the Starkiller also became battered, with its name being barely legible by the time the vessel was encountered during the Galactic Civil War. At some point, a collision with a meteor dented and jammed shut the outer hatch of the ship's airlock. The air aboard the vessel had become stale, and a thick layer of dust covered everything in the lounge, to the extent that the holoprojector in the room's center was hidden by it. The emergency lighting in the lounge had also turned on, and the autochef in the ship's galley malfunctioned."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A Jedi captured"}, {"tag": "p", "text": "The Starkiller was owned by the bounty hunter Leshy Drobo, who lived prior to 20,000 BBY. At some point by that date, Drobo and his partner, the XT labor droid-turned-assassin droid XT-8, captured the Jedi Knight Roni von Wasaki, for whom a crime boss had posted a one hundred thousand credit-large bounty. The pair of bounty hunters subsequently froze the Jedi in a slab of carbonite to deliver him to the crime boss. Drobo confiscated Wasaki's pair of lightsabers and stashed them in the storage cubicle of the Starkiller's captain's quarters. Subsequently, the ship, with the frozen Jedi hidden in its secret compartment and its cargo hold containing fifty crates of what was marked and listed in the register as repulsorlift parts but was in reality useless junk, was on its way to deliver the bounty."}, {"tag": "p", "text": "Following Wasaki's capture, Drobo also noted that fact in an entry of his personal log that was stored in the computer system of the Starkiller. By that point, Wasaki, who had retained his mental faculties and use of the Force while frozen, had begun to telepathically influence Drobo to release him from the carbonite. Shortly after the Starkiller had jumped to hyperspace, Wasaki finally implanted a similar suggestion in Drobo's mind that the bounty hunter began to act upon. However, XT-8 learned of its partner's intentions and confronted Drobo in the ship's engine room. During the ensuing confrontation, the assassin droid opened fire at Drobo from its built-in submachinegun. As a result, Drobo was killed after being riddled with bullets, but the nearby hyperdrive access panel had also been perforated by XT-8's attack. The damage to the ship's superluminal drive led to the vessel reverting to realspace."}, {"tag": "h3", "text": "The long journey"}, {"tag": "p", "text": "Since repairing the Starkiller was beyond XT-8's programming, the droid simply continued its journey under sublight speed, turning a trip of what could have been mere thirty days into a journey that lasted for twenty thousand years. Over time, the assassin droid's mission—to deliver the Starkiller's cargo to its destination at any cost—became burned into its memory circuits, and by the Galactic Civil War, most of the ship's power had been rerouted into its sublight engines."}, {"tag": "p", "text": "Meanwhile, Wasaki, who was being kept alive by his carbonite imprisonment, continued reaching out via the Force in order to contact anyone who could liberate him. The perpetual loneliness, fearful dreams, and extreme sensory deprivation that the Jedi endured eventually drove him mad. Every so often over the subsequent millennia, failed Jedi and drunken spacers would claim that they had encountered the Starkiller, and eventually a rumor began to spread that it was a pirate vessel. According to the rumor, the Starkiller had depressurized during a raid, leading to the death of its crew, which nevertheless somehow remained connected to the material realm. However, at the same time, knowledge of the name and the model of the ship, as well as of the name and the actual occupation of the ship's real owner, was also preserved by history."}, {"tag": "h3", "text": "An encounter in deep space"}, {"tag": "p", "text": "At some point during the Galactic Civil War, another starship traveling through hyperspace, while still far from its destination, unexpectedly emerged in realspace close to the Starkiller. The latter ship, while not making any attempts at communication, was on a trajectory that intersected the flight path of the newly-arrived vessel, and the astrogator of the ship pointed the Starkiller out to the rest of the crew through the viewport of the cockpit."}, {"tag": "p", "text": "A crew-member familiar with ancient criminal history then identified the vessel and revealed a portion of its history to the rest of the crew, and one of the spacers also noticed the ship's modified upper hull. The sensors of the group's starship did not detect any life-forms aboard the Starkiller and informed that the vessel's power had been rerouted to its engines. Attempts by a Force-sensitive member of the group to discern the presence of any living beings aboard the unusual ship were similarly unsuccessful, although at that point Wasaki finally established telepathic contact, albeit vague and almost incoherent one, with one of the crew-members."}, {"tag": "h3", "text": "Exploring the Starkiller"}, {"tag": "p", "text": "When the starship finally approached the Starkiller for boarding, the latter opened fire and attempted to escape the former. After the chase led to the Starkiller suffering severe damage, its engines shut down, and the ancient vessel appeared to be dead in space. At that point, XT-8, who sat at the control console in the bridge at the time, began repeatedly striking the viewport in an attempt to shatter it and therefore expose the would-be boarders to the vacuum of space. The pilot of the other starship then pulled it alongside the Starkiller and attached the landing claw, after which the crew entered the drifting freighter through its airlock."}, {"tag": "p", "text": "Once aboard the Starkiller, the explorers accidentally activated the hologram in the ship's lounge, with one of the startled individuals firing a weapon at the insubstantial image and thereby damaging the room. The boarding party also discovered the concealed ladder that allowed access to the starship's laser turret, and upon entering the bridge were immediately attacked by XT-8, who then attempted to force the battle out into the lounge, thereby lessening the risk of accidentally damaging the functionality of the vessel. The group eventually defeated the droid and accessed via the bridge control console both Drobo's personal log entry and the publicly-available shipping manifest of the Starkiller from the ship's computer system, albeit triggering the built-in trap in the process, which it eventually escaped."}, {"tag": "p", "text": "During their exploration of the Starkiller, the group repaired the vessel's damaged hyperdrive and eventually discovered the secret compartment in the cargo hold where the frozen body of Wasaki was located. After de-carbonizing the twenty-thousand-year-old Jedi, both the explorers and the ancient Jedi left the Starkiller and departed aboard the starship the group had arrived on."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "The Starkiller was privately owned by the bounty hunter Leshy Drobo. In order to conceal his illegal activities, Drobo maintained a cover identity of a merchant who ran a freight-hauling business that eventually made him wealthy. Drobo partnered with the droid XT-8 and also with an individual named Gammid, but the latter was considered to be incompetent by Drobo and eventually died during the trio's capture of the Jedi Knight Roni von Wasaki. After XT-8 killed Drobo during a confrontation over the latter intending to release the captured Wasaki from his carbonite imprisonment, the assassin droid became the sole surviving crew-member of the Starkiller. The droid spent time in the starship's bridge, controlling its flight and weapons systems as well as monitoring the built-in alarm system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Starkiller served as the main setting for \"Disturbance in the Force,\" a roleplaying mini-adventure written by Chris Hind as a supplement for West End Games' Star Wars: The Roleplaying Game, illustrated by Paul Daly, and published in Challenge 66 in November 1992. Beside the starship's deckplan, \"Disturbance in the Force\" included another illustration that depicted two different vessels, but the adventure did not specify which one, if any, of them corresponded to the Starkiller."}, {"tag": "p", "text": "\"Disturbance in the Force\" suggests the airlock of the Starkiller as the most likely point of entry the player-characters can use to board the vessel, but it also notes that the characters can, using either explosives or a lightsaber or a fusion cutter for slicing, create an entrance at any other point of the ship's outer hull. Damaging the engine pods of the ship in such a manner, however, is characterized as potentially \"messy.\" Additionally, if the player-characters do not succeed in finding in the cargo hold the secret compartment containing the frozen Jedi, Roni von Wasaki, the adventure suggests that one of the characters may receive a telepathic suggestion from the prisoner that helps with the search."}, {"tag": "p", "text": "During the events of \"Disturbance in the Force,\" the player-characters disable the Starkiller. Furthermore, the adventure also notes that \"if\" that has occurred, XT-8 starts trying to shatter the bridge viewport in order to expose the approaching boarders to the vacuum of space. However, an apparent contradiction exists due to the adventure also stating that XT-8 abandons the bridge in search of the characters if they trigger an alarm through slicing into a computer terminal or the security lock of a hatch. This article assumes the scenario plays out as described."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}