{"url": "Battle_meditation", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Alter powers", "Category:Control powers", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Battle meditation"}, {"tag": "p", "text": "Battle meditation was a Force ability that considerably boosted the morale, stamina, and overall battle prowess of an individual's allies while simultaneously reducing the opposition's combat-effectiveness by eroding their will to fight."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Battle meditation was the ability to use the Force to coordinate allies and even entire fleets of ships, allowing them to perform at maximum efficiency, acting as a single entity with the ability to counter every enemy move quickly and effectively. Though ideal for meditating large-scale conflicts, battle meditation was also effective when employed for the benefit of one's comrades in small skirmishes, attacks, and duels. It could also be used to simultaneously demoralize the opponents, reducing their combat effectiveness. Battle meditation was used to influence armies and fleets to win battles and even wars."}, {"tag": "h2", "text": "Applications"}, {"tag": "h3", "text": "Light side users"}, {"tag": "p", "text": "This Force power was first made famous by the ancient Jedi Masters Odan-Urr, Arca Jeth, and Nomi Sunrider. Odan-Urr used it during the Unification Wars, while Arca Jeth used it with great success during the Beast Wars of Onderon. Being naturally adept, Nomi Sunrider applied battle meditation in nearly every conflict she participated in, such as the Freedon Nadd Uprising, and the Battle of Koros Major. It was also practiced by Bastila Shan during the Jedi Civil War and the Battle of Rakata Prime, with impressive results."}, {"tag": "p", "text": "During the New Sith Wars, the Ithorian Jedi Master Worror Dowmat used battle meditation to bolster the strength of Jedi Lord Valenthyne Farfalla and the Army of Light, as they fought against Lord Kaan's Brotherhood of Darkness. Dowmat also assisted his Jedi companions with his Battle meditation when they confronted Darths Bane and Zannah on the planet Tython, ten years after the war's end. Dowmat's meditation provided the invigoration necessary for Johun Othone, Sarro Xaj, Echani Jedi Raskta Lsu, and Farfalla to contend with Darth Bane, who was himself being fueled by his dark side rage."}, {"tag": "p", "text": "Grand Master Yoda was also quite skilled, having used battle meditation during his Mission to Vjun to empower the actor pretending to be him. With a mere touch, Yoda was able to saturate Palleus Chuff with feelings of hope and mission success, while simultaneously eliminating feelings of doubt and despair from the little man's spirit. Yoda also successfully meditated the conflict during the Battle of Kashyyyk. Both Yarael Poof and Oppo Rancisis used it in the Stark Hyperspace War and the Clone Wars respectively. During the Clone Wars, Etain Tur-Mukan was able to encourage and calm troopers during the conflicts she took part in, suggesting that she had the potential to use Battle Meditation or some lesser form of this ability."}, {"tag": "p", "text": "Luke Skywalker studied the use of battle meditation at some point after the Battle of Endor from a book he found. His sister Leia also studied battle meditation from books recovered on Ossus, and employed her new ability against the reborn Darth Sidious."}, {"tag": "p", "text": "Jedi Masters T'ra Saa and K'Kruhk each utilized battle meditation during the final battles of the Second Imperial Civil War, including the Jedi's loss at Taivas and its victory at Coruscant respectively."}, {"tag": "p", "text": "A focused version of battle meditation was known as Force meld. Unlike battle meditation, which could influence both the Force-sensitives and non-Force-sensitives of both sides, Force meld concentrated on coordinating and improving the Force-sensitives of the user's side."}, {"tag": "h3", "text": "Dark side users"}, {"tag": "p", "text": "Battle meditation was not merely a province of the light side; powerful dark side users could twist the wills of their commanded armies not through subtle influence, but with total domination. This perversion of battle meditation was called Sith Battle Coordination by the Dark Lady Lumiya. It was later identified by Darth Caedus as \"Sith Battle meditation\"."}, {"tag": "p", "text": "When Nomi Sunrider asked of her Master if those who use the dark side were able to command battle meditation, Odan-Urr replied that indeed they could, but it was very rare. Lord Skere Kaan also used Sith battle meditation during the New Sith Wars in opposition to the superior prowess of a female Cerean Jedi Master. One thousand years later, Grand Admiral Nial Declann was a master of Sith battle meditation, using it to great effect during the Battle of Endor. Following Emperor Palpatine's death, the shock of the sudden removal of this influence threw the Imperial Navy into chaos and allowed the Rebel fleet to defeat them. Joruus C'baoth, the insane clone guardian of Wayland's Mount Tantiss, increased the victory percentage of Grand Admiral Thrawn's armies by forty percent via dark battle meditation."}, {"tag": "p", "text": "When Darth Caedus ascended to Dark Lord of the Sith, he soon found out that within his mind he could coordinate and direct battle into whatever outcome he so desired. He would use a meditation chair on board his personal star destroyer to amplify his powers. Caedus' early uses of the art were poor, as his first attempts only resulted in him being able to see the battle unfolding in his mind, not being able to directly influence it. When he tried to dominate the wills of his subordinates via the Force he found that they were not so easily subjugated, and reacted with hostility to his psychic intrusion. His powers were greatly augmented by Alema Rar as he attempted to lay siege to Kashyyyk, and what seemed like a battle lost became a victory for the Alliance. Caedus practiced regularly (he had plenty of opportunity since his early time as a Sith was heavily engrossed in war), and his proficiency became much stronger. Caedus would Flow-walk into the immediate future to see the next battle, and then return to the present to directly influence the battle to bring about the ends he desired. He shortly thereafter gave up the use of his meditation chair upon its destruction by Luke Skywalker and meditated battle directly from the bridge of the Anakin Solo. During the Second Battle of Fondor, Darth Caedus used battle meditation to dominate the collective wills of Fondor's ground forces, causing them to doubt their chances of victory and drop the planet's defensive shielding."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The use and effect of battle meditation was first described in the Star Wars expanded universe by Timothy Zahn in Heir to the Empire, when Grand Admiral Thrawn explains to Joruus C'baoth and Gilad Pellaeon his own theory as to why the Battle of Endor was lost; he believed that Palpatine employed the power to an unwise degree, taking such close control of the Imperial forces as to make them puppets, almost incapable of fighting on their own when his influence was suddenly removed (the use of battle meditation at Endor was later attributed to Grand Admiral Nial Declann instead of Palpatine)."}, {"tag": "p", "text": "The term \"battle meditation\" is first used in the 2003 video game Knights of the Old Republic and the power is a plot element rather than an ability usable by any of the player characters. Because the character Bastila is one of the only Jedi in the galaxy who has mastered the ability, she is a vital weapon to be used by either the Republic or the Sith."}, {"tag": "p", "text": "In Knights of the Old Republic, the power can only be used when the user is in deep concentration, and not in the midst of combat. This contradicts earlier sources, where Nomi Sunrider is shown to use battle meditation while fighting."}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, battle meditation is a usable ability by any of the playable characters who are Force-sensitive. Using the power grants a bonus to attack rolls, damage, Will saves and increases Vitality Points Regeneration to the player's entire party. At higher levels, it can also impair enemies. If mastered, the power also has a story-based use, as it can be used by the Jedi Exile in order to turn the tide of the Onderon throne room battle to the favor of Queen Talia's or General Vaklu's forces, depending on who the player has allied with."}, {"tag": "p", "text": "In The Force Unleashed video game, battle meditation was an upgradeable Force Talent. It decreased the amount of time it takes to charge Force powers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}