{"url": "Starkiller%27s_Trial_of_the_Spirit", "categories": ["Category:Legends articles", "Category:Battles of the Jedi Temple", "Category:Duels", "Category:Missions of the Great Jedi Purge", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Starkiller's Trial of the Spirit"}, {"tag": "p", "text": "Starkiller's Trial of the Spirit occurred in 2 BBY during his final visit to the Jedi Temple on Coruscant. Shortly after Starkiller rescued General Rahm Kota on Cloud City, he felt as though the Force had urged him to return to the fallen headquarters of the Jedi Order. Hence, he traveled back to the capital world of the Galactic Empire once more in order to discover why he felt drawn to the Temple."}, {"tag": "p", "text": "Upon his return, however, Starkiller found the Jedi Temple guarded by many stormtroopers and several variations. Despite being overwhelmingly outnumbered, the apprentice single-handedly killed numerous Imperials as he infiltrated the ruins of the Temple. When he reached the chamber of the former Jedi High Council, he witnessed a Force-induced vision of his master, the Sith Lord Darth Vader, engaged in combat with a Jedi unknown to him. But just as Starkiller defeated the Jedi in defense of Vader, he realized that it was a vision of his dead father."}, {"tag": "p", "text": "Out of a desire to learn more about the father he had all but forgotten during his tutelage under Vader, Starkiller made his way to the Tower of First Knowledge where he hoped to discover more information about Kento Marek. After he fought his way past various Imperial soldiers that blocked his way, he came across a holocron that contained a gatekeeper in the person of his father. Starkiller then experienced a new vision, in which he was confronted by his own darkness; a manifest form of the Dark Lord he could become. After a lengthy and hard-fought duel, Starkiller ultimately passed his final trial when he slew the Sith specter. But just as he regained consciousness, the Sith apparition warned Starkiller that there was no escape from the dark side of the Force."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Return to the Jedi Temple"}, {"tag": "p", "text": "Like Starkiller's previous missions to the Jedi Temple on Coruscant, the secret apprentice encountered an Imperial security force of stormtroopers, scout troopers and several other variations, plus Imperial Senate Sentinels and Imperial Navy commandos. Although the garrison had been reinforced with more soldiers due to his prior visits, including attempting to kill Starkiller on the spot as soon as he arrived instead of simply attempting to detain him like before, the Imperials' efforts to execute the apprentice were ultimately ineffective; Starkiller made his way deep into the Temple while dispatching many troopers."}, {"tag": "p", "text": "After Starkiller discovered an elevator platform, he utilized it and ascended to the top of the High Council Tower. Upon entering the damaged room of what once served as the chamber of the Jedi Council, Starkiller witnessed a duel between a simulacrum of his master Darth Vader and Kento Marek, a former Jedi Knight who had long since been dead. At the time, Starkiller was unaware of the nature of the fight and the Jedi's identity. As Marek stood triumphant and prepared to strike Vader down, Starkiller immediately moved to his master's defense."}, {"tag": "h3", "text": "Father versus Son"}, {"tag": "p", "text": "The simulacrum of Kento Marek attempted to avoid a fight with Darth Vader's personal assassin and urged him to reconsider his allegiance to the dark side of the Force. Yet his efforts to reason with the young Sith were to no avail; Starkiller had no interest in relinquishing the dark side for he felt that it was all he ever had in his life. At first, Marek fought effectively through the use of his skills in lightsaber combat, as well as telekinesis."}, {"tag": "p", "text": "Ultimately, however, Marek failed to overcome the apprentice's raw power in the Force. Though Marek evasively moved from one corner to another throughout the chamber, he was eventually intercepted by Starkiller, who proceeded to telekinetically thrash the Jedi all over the room. As Marek attempted to regain his footing, Starkiller sprang forward and stabbed him through the abdomen. Marek fell to his knees in defeat and his simulacrum vanished, but not before he apologized for the life that had befallen Starkiller, whom he referred to as his \"son.\""}, {"tag": "p", "text": "Starkiller was shocked at the revelation that the simulacrum of the unknown Jedi had actually been his dead father. But as he reached out to his father, the simulacrum vanished, leaving him alone within the ruins of the High Council Chamber. The rediscovery of Kento Marek had a strong effect on Starkiller, who then chose to search the Temple in order to learn more about his father."}, {"tag": "h3", "text": "The Tower of First Knowledge"}, {"tag": "p", "text": "After the incident in the High Council Chamber, Starkiller returned to the Rogue Shadow, only to use it as a transport to reach the Tower of First Knowledge. The holodroid PROXY warned him that the tower possessed a large presence of Imperial soldiers, but Starkiller was too concerned with rediscovering his origins to be deterred at this point. Hence, he dropped from the Rogue Shadow and landed on the surface of a platform that connected to the tower."}, {"tag": "p", "text": "As several stormtroopers were thrown back in all directions due to the force of the impact, the apprentice ignited his lightsaber and steadily wiped out the remaining Imperials that challenged him. Even the stormtrooper commanders and their Shadow Troopers were incapable at subduing Starkiller. When the platform had been cleared, Starkiller proceeded into the tower while General Rahm Kota used his intimate knowledge of the Temple's inner workings to act as the apprentice's guide through a comm channel."}, {"tag": "p", "text": "Inside the atrium of the tower, Starkiller was attacked by a combination of shadow troopers and Imperial jumptroopers. As he overcame the numerous soldiers stationed throughout the tower, including several Jedi training droids that remained dormant but active since the fall of the Jedi Temple, the apprentice used the Force to adjust a shattered bridge that stretched across the central chasm and led to the Holocron Chamber."}, {"tag": "p", "text": "When he accessed one of the holocrons inside the chamber, a gatekeeper appeared in the form of his father. Although Kento Marek asserted that Starkiller was ultimately the only one who controlled his own fate, he did concede that the dark side of the Force had grown strong within his son. Nevertheless, he assured Starkiller that redemption could still be obtained. After the simulacrum of Marek reminded the apprentice of his inherent potential and blood relation to a Jedi, he implored Starkiller to complete the Jedi Trials. At that moment, Starkiller slipped into the state of another vision created by the Force."}, {"tag": "h3", "text": "Starkiller faces himself"}, {"tag": "p", "text": "Trapped within a labyrinth of his own mind, Starkiller was forced to navigate his way through the area. At the same time, he utilized his skills in telekinesis to overcome the obstacles of the trial. Once the tests of his Force abilities had been completed, Starkiller turned to find the final challenge behind him. Out of the shadows emerged the physical incarnation of the apprentice's inner darkness, clad in sinister armor painfully grafted to its wearer's body. Unknown to Starkiller, the dark specter's appearance was attributed to a possible future where he succeeded Darth Vader as Darth Sidious' apprentice."}, {"tag": "p", "text": "As Starkiller and his dark self fought each other in a vicious and brutal fight, during which both relied on lightsaber combat skills and dark side techniques, Starkiller managed to hit the Dark Lord, which caused his helmet to fall off. Before Starkiller could press his attack, however, he froze in shock of his opponent's face; it was his own, except pale skinned and twisted in features as a result of deep immersion within the dark side of the Force."}, {"tag": "p", "text": "While Starkiller paused at the sight of his own visage, his loss of focus was swiftly capitalized on by the Dark Lord, who drove the apprentice down to a lower level within the labyrinth. Starkiller regained his footing after a moment, just as his \"other self\" began hurling large pieces of debris at him through the Force. Starkiller managed to survive the attacks by evading and redirecting the objects back at the Dark Lord. They soon resumed their duel, which only grew in ferocity due to the renewed vigor on both sides, until Starkiller forced his opponent to the brink of the platform. However, the Dark Lord stopped his fall when he grabbed hold of Starkiller's ankle, whom he pulled down in order to haul himself back onto the platform."}, {"tag": "p", "text": "Having captured the high ground, the Dark Lord telekinetically took control of several massive columns and hurled them at Starkiller, who countered the attack by using them as stepping stones to climb back up. As he ascended to equal footing with the Dark Lord, Starkiller impaled him from behind with a lightsaber blade through the back. With his final challenge completed, the vision came to an end as the apprentice's \"darker half\" became consumed in a bright light of Force energy."}, {"tag": "p", "text": "However, as Starkiller regained consciousness inside the Holocron Chamber, the vision had not completely ended. Just as he regained his senses, Starkiller's attention turned to his left hand, which had taken on the clawed and emaciated appearance of the Dark Lord's arm. After a final warning about how Starkiller would never truly escape the darkness that resided within himself, the vision came to a complete end. Starkiller was shaken by the revelation of his \"other self,\" and when Rahm Kota inquired about the apprentice's discovery, he neglected to reveal any of the details of what transpired in his vision."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Starkiller's Trial of the Spirit was featured in the PS2/Wii version of Star Wars: The Force Unleashed video game. The level consisted of Starkiller's infiltration of the Jedi Temple and the High Council Chamber, where Starkiller faces the hologram of his father. In the Xbox 360/PS3 version, the apprentice fights Imperial troopers within the Tower of First Knowledge before fighting the Sith Stalker version of himself in a Force vision."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}