{"url": "Starkiller%27s_Trial_of_Skill", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles of the Jedi Temple", "Category:Duels", "Category:Missions of the Great Jedi Purge", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Starkiller's Trial of Skill"}, {"tag": "p", "text": "The First Mission to the Jedi Temple was an assignment carried out by Galen Marek, to complete his training in preparation of facing several Jedi."}, {"tag": "h2", "text": "Assignment"}, {"tag": "p", "text": "After Marek defeated Rahm Kota in the Battle of the TIE Fighter Construction Facility, Darth Vader sent his apprentice to the ruins of the Jedi Temple in order to prepare for his next mission, largely because Vader deduced that Starkiller lacked focus after an incident where Vader nearly killed Marek with Kota's lightsaber to test him."}, {"tag": "h3", "text": "Infiltrating the Temple"}, {"tag": "p", "text": "Upon the Rogue Shadow touching down on the Imperial landing pad that had been erected on the staircase of the entrance to the Temple, the Imperial Navy commandos stationed near the entrance attempted to order Marek to return to the Rogue Shadow immediately, as the Jedi Temple had been decreed strictly off-limits to outsiders. However, Marek defeated the Imperial Stormtroopers standing guard there. Entering through the damaged Main Hall, Marek fought his way through more Imperials, including members of the Imperial Senate Sentinels, a subdivision of the Imperial Senate Guard, to one of the upper level corridors. The entrance to the library being sealed, the Sith apprentice retreated into a hallway that was blocked by debris from the ceiling."}, {"tag": "h3", "text": "Trial of Skill"}, {"tag": "p", "text": "Walking down a corridor, Marek entered the largely intact Jedi Trials Chamber. Once within it, his presence activated the Jedi training program modeled after the long-dead Sith Lord, Darth Desolous. Leeching off Marek's fear, the Desolous program began his attack, wielding a cortosis shield and a red lightsaber."}, {"tag": "p", "text": "Marek successfully fended off the hologram's lightsaber blows and used Force lightning to send the program reeling. Though the Desolous program imitated the original Sith Lord's very powerful usage of the Force, it was no match for the raw power that Vader's apprentice possessed. Hurling pieces of the surrounding statues at his adversary, Marek eventually wore down the avatar's defenses."}, {"tag": "p", "text": "Near defeat, the Desolous program made a final attempt at destroying Marek, and failed. Marek then used the Force to hurl Desolous's hologram towards the main statue at the top of the hall, and up along the statue's surface. The program was then cast down from the statue's face and hurled into the stone floor. With a final pull of the Force, the main statue came crumbling down on the hologram of the ancient Sith Lord, defeating him and ending the Trials program."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Immediately after the training program had ended, PROXY, Marek's holodroid companion, entered the room. Marek was confused as to why PROXY was present, although after PROXY's holodroid functions turned him into Darth Vader, Marek proceeded to automatically fall down on one knee in homage to him. Vader then informed him that his spies have located the Jedi Master Kazdan Paratus, and that while he doubts due to Paratus' abilities that Starkiller will defeat him, he will come closer to reaching his destiny of killing Emperor Palpatine if he does succeed in doing so. Vowing not to fail his master, Marek then left the Temple to begin his hunt for Paratus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This mission is only available for the PlayStation 2, PlayStation Portable, and Wii versions of The Force Unleashed. On the Xbox 360 and PlayStation 3 versions, Starkiller will head straight to Raxus Prime after the TIE Fighter Construction Facility"}, {"tag": "h2", "text": "Appearances"}]}