{"url": "Starlight_Wanderer", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:CR90 corvettes", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Starlight Wanderer"}, {"tag": "p", "text": "The Starlight Wanderer was a CR90 corvette that was in the service of the New Republic and participated in the Battle of Jakku during the Galactic Civil War. During the battle, the ship was carrying secret information that was being coveted by both the Imperials and New Republic. It would become abandoned and then later discovered decades later, and became the focus of a group of scavengers to retrieve this information."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "The Starlight Wanderer was a CR90 corvette that was in service to the New Republic by 5 ABY. In that year, the Starlight Wanderer fought in the Battle of Jakku against the Galactic Empire that was situated there. During the battle, the Starlight Wanderer managed to intercept vital data from an Imperial warship. The data included locations of Imperial outposts, research stations, and shipyards in the edges of the galaxy and unknown to everyone except several members of the highest rank in the Imperial Military. As it attempted to retreat, however, the Starlight Wanderer was shot down and crashed on the desert of Jakku, joining countless other wrecked starships."}, {"tag": "h3", "text": "A hidden treasure"}, {"tag": "p", "text": "Sometime later, a roving band of nomads led by Misha Vontoba discovered the shipwreck of the Starlight Wanderer which was half-buried in the sand. Seizing the opportunity, the group of nomads scoured the vessel for salvageable parts and retrofit the portions of the hull that remained intact, so that the group could turn the corvette into a new home. However, after they continued to explore the starship, they uncovered evidence that the starship contained something valuable hidden somewhere within the vessel. The nomads discovered hidden logs that indicated that the Starlight Wanderer was equipped with a secret and secure vault that contained an item of great significance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}