{"url": "Starlight_Beacon", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Frontier", "Category:Galactic Republic space stations", "Category:Great Works", "Category:Outer Rim Territories space stations", "Category:Starlight Beacon locations"], "nodes": [{"tag": "h1", "text": "Starlight Beacon"}, {"tag": "p", "text": "The Starlight Beacon, also known as the Starlight Station and often referred to as simply \"Starlight,\" was a space station constructed on the Galactic Frontier during the High Republic Era, built in the Outer Rim Territories. Situated in the center of the region's unexplored dark zones, the station's large size caused its construction to cost a great effort and expense. As the region was difficult to navigate at the time, the station, launched in 232 BBY, acted as a beacon, sending out a signal that guided travelers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Starlight Beacon was one of Supreme Chancellor Lina Soh's Great Works and was officially opened in the aftermath of the Great Hyperspace Disaster, on the exact deadline that Chancellor Soh had set. Luminaries from across the galaxy arrived for the dedication. Multiple Jedi, including Bell Zettifar, Indeera Stokes, Porter Engle, Stellan Gios, Avar Kriss, Elzar Mann, Sskeer, Nib Assek, Burryaga Agaburry, Vernestra Rwoh, Imri Cantaros, Yarael Poof, and countless other prominent Jedi traveled there for the dedication. Despite rarely leaving Coruscant, Grand Master Yoda also made an appearance at the event."}, {"tag": "p", "text": "Starlight Beacon was intended to be run as a military station if need be and had a strong contingent of security provided by the Republic Defense Coalition. Starlight worked as a hospital, observatory, research station, market, and cultural center, providing visitors with a glimpse into the diverse culture of countless worlds in the Republic. The initial exhibits showed subsonic whisper-fiber concerts by Chadra-Fan masters, Mon Calamari ocean dancing, and modules showing flora and fauna from the planets Kashyyyk, Kooriva, and more. The exhibits would be constantly updated to ensure representation for many worlds. In addition, the station housed the largest number of Jedi outside of Coruscant, with a temple designed by Jedi architect Palo Hidalla. The Jedi stationed there were intended to be led by Jedi Master Jora Malli, but after her death at the Battle of Kur, Avar Kriss was assigned to take her place. The station itself was nineteen percent triazurite, a rare mineral that helped to boost transmission signals from the station."}, {"tag": "p", "text": "Shortly after the station became operational, Jedi Master Estala Maru was contacted by Padawan Keeve Trennis, who told him that the signals from the station were causing chaos on the planet Shuraden, making the ridadi, a species of star-locusts, be drawn to the station. Maru recalibrated the frequency to allow the ridadi to continue on their normal migration patterns and not be influenced by the signals."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "Many years later, in 3 ABY, Commander Grek of the Rebel Alliance used the station as inspiration for Operation Starlight, a plan to reassemble the Alliance Fleet following its fracture after the Battle of Hoth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Starlight Beacon was created for the Star Wars: The High Republic publishing project. The station was indirectly mentioned in the comic Star Wars 2, written by Charles Soule and published by Marvel Comics on January 29, 2020, and its name was given in the project's official reveal on February 24, 2020."}, {"tag": "p", "text": "An excerpt of The High Republic 1 published in The High Republic Free Digital Sampler placed the Starlight Beacon in a region called the Starless Expanse. This was removed from the final comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}