{"url": "Stars%27_End/Legends", "categories": ["Category:Legends articles", "Category:Corporate Sector Authority military bases", "Category:Prisons"], "nodes": [{"tag": "h1", "text": "Stars' End"}, {"tag": "p", "text": "Stars' End was a Corporate Sector Authority prison, located on Mytus VII, a desolate asteroid in the Mytus system. CSA Viceprex Mirkovig Hirken was in charge of the facility. Stars' End was notable for its advanced defense system, including a shell of molecularly bonded armor. In 2 BBY, the facility was crippled when Han Solo led a team of infiltrators on a rescue mission. However, reports indicate that the prison was restored to functionality shortly thereafter."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Layout and Design"}, {"tag": "p", "text": "The core of Stars' End was a 40-story tower which could hold thousands of criminals and political dissidents stored in stasis booths. The subterranean levels were taken up by an enormous power generator that provided energy for the whole installation. For it to power the stasis cells and the defensive systems, the overload shielding had to be reduced. The power output of the generator was to that of a fortress or a capital ship. The lower levels, on ground level and above, had administrative facilities, airlocks, and a service-center with light-wells at the center."}, {"tag": "p", "text": "Above came the main section of the tower with forty levels of detention cells. Each level had the height of three regular levels with industrial-grade energy power supply. The thousands of stasis tubes could easily be accessed by catwalks and walkways. Computer stations allowed quick access to system, maintenance, and repair parameters. The prisoner's life signs were constantly monitored from the administrative levels."}, {"tag": "p", "text": "This part also included additional docking facilities at the base and midpoint and numerous anticoncussion field generators. The top levels included medical facilities for the prisoners and interrogation rooms as well as an orbital skyhook for docking with larger Lictor-class dungeon ships. At the personal insistence of Viceprex Hirken, a luxurious residence was added to the top of the tower. This residence included an armored amphitheater for gladiator droid combat, a transparent armored dome, and landscaped gardens, which contained miniature sun-globes and flora and fauna from many different planets."}, {"tag": "p", "text": "Additional surface and underground facilities on the planet were planned, but were still under construction when the tower was destroyed. They included a full-service spaceport and landing fields. Maintenance facilities were located underground, connected with the starport via repulsor lifts. The hangars could handle ships of up to 300 meters length with short-range shuttles servicing larger ships. Other facilities were hydroponic farms along with housing and medical facilities for maintenance and technical personnel, Security Police enforcers, guards, and executives. Command stations for sensors and defense were also located underground, directly at the corresponding installations. All facilities of Stars' End were connected by a complete monorail network, which also allowed a direct and quick transfer of prisoners directly to the starport to the tower."}, {"tag": "p", "text": "Stars' End featured a custom sensor and communication array specifically built for this installation. An additional network of extra-system sensor satellites allowed detection of incoming starships almost a system's diameter away. The subspace transceiver included powerful booster to allow subspace radio communication for over 100 light-years. Long-range hyperchannel relays allowed instantaneous holographic communication with the rest of the galaxy and featured the most sophisticated encryption protocols available."}, {"tag": "p", "text": "While more permanent buildings were being built, temporary hangars, dormitories, and storage facilities, made from bi-state memory plastic, connected by mobile clear tunnel-tubes and docking bays, served as home for workers and personnel."}, {"tag": "h3", "text": "Capacities"}, {"tag": "p", "text": "Stars' End used a unique system to lock away its prisoners. Instead of normal cells, prisoners were locked in entropy field stasis booths. This would prevent riots, violence, and similar disturbances, like gangs, and cut down on food costs. That and large amounts of computerization and automation would also allow staff to be cut to a minimum—only a few dozen people were necessary to operate and maintain the facility. The prisoners could be reanimated and interrogated at any given time. The finished state of the main body of the tower could hold up to 24,000 prisoners."}, {"tag": "p", "text": "Hangar facilities on the ground could service ships up 300 meters in length. Also, it housed smaller and larger defensive craft, extra-system shuttles, and light freighters. Additional docking facilities were at the base and midpoint of the tower. An orbital skyhook allowed the docking of larger dungeon ships."}, {"tag": "h3", "text": "Defenses"}, {"tag": "p", "text": "Stars' End had formidable defenses, primarily a uniform layer of molecularly bonded armor that coated the entire tower. This dense metal armor was extremely expensive, but nearly indestructible; it could withstand sustained fire from a Star Destroyer's turbolasers. Additional strength was provided by an anticoncussion field, powered by a powerful Rampart-class anticoncussion generator. Numerous projectors, honeycombed into the entire interior of the prison, created a unified field that would absorb blasts and impacts."}, {"tag": "p", "text": "The facility's stationary defenses consisted of six Taim & Bak QuasarFire Turbolaser Turrets, as well as a Kuat Drive Yards v-180 Planet Defender ion cannon with its own power generator. Protection was provided by heavy-duty deflector shields. There was one deflector shield for the whole facility as well as one for each side of the tower."}, {"tag": "p", "text": "The hangar facilities supported defensive assault craft of smaller and larger sizes, including as least one Marauder-class corvette."}, {"tag": "p", "text": "The final defense of Stars' End was its isolation and secrecy. Construction personnel were placed in drug-induced comas before being taken to Stars' End. The base was going to be officially designated a small scientific outpost, dedicated to astronomical observation of the galaxy. Cleartext messages were sent to uphold the image of a regular outpost."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "In the early years of the Corporate Sector, criminals were mostly issued a fine, sent to a labor colony, or just executed on the spot. However, as these methods didn't cause a drop in crime rates, the Authority created the Detention Taskforce. After several years of study, the Taskforce came up with the concept of Stars' End. The studies found that conventional penal colonies were prone to breakouts, riots, and violence, which would increase costs. The study also found that the Galactic Empire would have an increasing demand of correctional facilities under its current policies. It was thus decided to construct a model facility with maximum of efficiency and minimum of cost. If successfully promoted to the Empire, the whole design would be immensely profitable."}, {"tag": "p", "text": "The final touches to the design were made in personal correspondence between Assistant-Deputy Viceprex of Security Ilm Vaz-Weplinn of the Corporate Sector Authority and Lady Chawkroft of the Imperial Corrections Service. The Corporate sector hoped to sell the concept to the Galactic Empire, and it was scheduled the the Emperor should inspect the installation after it had been operational for one standard year. It was during this time that the marketing department came up with the name “Stars' End” and that the whole project control was transferred over to Viceprex Mirkovig Hirken."}, {"tag": "p", "text": "After the plan had been approved by the Viceprex, scouts looked for a suitable location. They found it in the remote Mytus system near the edge of the galaxy. The planetoid Mytus VII was chosen as the final construction site."}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "One of the key aspects of the Stars' End project was its secrecy. To provide this, several extreme measure were taken. The Security Division Executive Viceprex went directly to the Prex to secure funding. To keep the interest of the Direx Board and the Auditor-General away, the money was taken from several different construction and correctional projects as well as illegally skimmed from other dealings through shady bookkeeping."}, {"tag": "p", "text": "The coordinates were among the most closely guarded secrets within the Corporate Sector. All construction efforts were overseen by Viceprex Hirken who had transferred to Stars' End. Construction droids had their memories regularly wiped and workers were placed in a drug-induced coma during their travel. Components were ordered from several different companies and facilities. The transports never traveled directly to the Mytus system, but made several jumps to prevent tracking. Most of the transport ships were automated drone barges and the few manned ships had their hyperdrives sealed, allowing the crew only control over the sublight drives."}, {"tag": "p", "text": "The main focus of the construction was the main spire and its power plant. With these pieces completed, efforts were moved to the subterranean facilities, but the general pace slowed down. For the time being, workers lived in a temporary sealed bi-state memory plastic building linked by tunnel-tubes and mobile junction stations. As Hirken saw Stars' End as his personal prestige project, he had the plans altered to include a private administration and living area on top of the spire, which also included an armored amphitheater for gladiator fights between droids. As soon as these quarters were completed, he and his wife Nerra moved in. Also, Hirken had a Master Command Unit installed with which he could control the entire facility. This small unit could be worn as a belt by the Viceprex."}, {"tag": "p", "text": "Once Stars' End was opened, it was officially recognized as a CSA base, but classified as a scientific outpost for extra-galactic observation. Since the staff numbers were small and the stasis-stored prisoners consumed hardly any supplies, the deception went unnoticed."}, {"tag": "h3", "text": "Operation and destruction"}, {"tag": "p", "text": "Hirken was so convinced that the project would be a success that he activated Stars' End months before completion. The first occupants came from a list compiled by Hirken and the Security Police, which included revolutionaries and criminals, as well as personal rivals. All were rounded up by Espos, interrogated, drugged, and shipped to Stars' End. As the Mytus system was not within the borders of the Corporate Sector, the authorities could truthfully claim the prisoner was not detained within the sector."}, {"tag": "p", "text": "With many persons disappearing, it did not take long before people started to ask questions. One of these persons was Rekkon, a docent at the University of Kalla on Kalla VII. His nephew Tchaka, who was a student at the university, began criticizing the politics of the Corporate Sector and began mobilizing other students. Naturally, he was arrested by the Security Police and was brought to Stars' End. His uncle began his own investigation and soon recognized the pattern of events. He carefully gathered a group of people around who had also lost relatives. These included Torm Dadeferron, Atuarre, her son Pakka, Engret, and two others."}, {"tag": "p", "text": "In 2 BBY, they were aided by outlaw tech Jessa Vandangante, whose father had also vanished. She provided the group with the means to infiltrate Authority Data Centers and search for clues. The last operation on the agriworld of Orron III included she, Bollux, and Blue Max; both modified BLX and B2-X droids respectively. She also sent Han Solo and Chewbacca to the group as a means of transportation, by hiding the Millennium Falcon inside a drone barge. Solo and Chewbacca had agreed to aid Jessa as part of a deal for new upgrades and transponder codes for their ship."}, {"tag": "p", "text": "Unknown to the group, Torm Dadeferron, Rekkon's second in command, worked undercover for the Security Police. He had already eliminated two members of the group and on Orron III, he delivered Engret beforehand and tried to set up a trap at the Data Center. However, due to the aid of Captain Solo, all of the group managed to escape except First Mate Chewbacca, and he was subsequently brought to Stars' End. With Rekkon on the verge of finding the location of Stars' End, Torm shot the old man during the escape on the Falcon. However, Rekkon managed to leave a message to Han Solo with his last breath which revealed the location of the prison: Mytus VII. With all the remaining members of the group trapped on the Falcon in hyperspace, Solo managed to identify Torm as the traitor and killed him shortly afterwards."}, {"tag": "p", "text": "The group arrived at the Mytus system and began observing Stars' End from a captured asteroid, waiting for the right moment. This moment arrived when they intercepted a message from the Imperial Entertainers' Guild, in which Secretary Hokkor Long informed Viceprex Hirken that his requested troupe could not make it to Stars' End. As the message also mentioned a non-specific replacement troupe, Solo decided that their group should take up this role."}, {"tag": "p", "text": "The ruse worked and allowed the “Madame Atuarre's Roving Performers\" to dock with the prison, where they were brought to the top of the tower to perform for Hirken and his wife. While Atuarre and Pakka distracted the Viceprex, Solo, together with Blue Max, infiltrated the levels below. Here they found out the secret of Stars' End in its method of locking up the prisoners. Additionally with the knowledge of Hirken's master control unit, Solo initiated a feedback by redirecting the energy flow from the upper deflector shield back into the main reactor."}, {"tag": "p", "text": "Meanwhile on the top levels, Hirken was tired of being stalled and finally expected to see his Mark X Executioner in battle against the group's own android, Bollux. Solo returned at the insistence of Blue Max, while Pakka and Atuarre returned to the Falcon. Despite the odds, Bollux and Blue Max defeated the Mark-X, which threw Hirken in a paranoid rage. Captured, Solo had to duel against Hirken's bodyguard, Uul-Rha-Shan, who had been suspicious of the group from the beginning. In the arena, Solo managed to dodge the gunslinger's shot, which instead hit one of the master control unit's support circuits in the wall. The resulting chain reaction caused the main generator to explode and launch the spire into the air."}, {"tag": "p", "text": "Auxiliary energy, artificial gravity, and the anti-concusion fields kept everyone alive, but the stasis booths began to shut down, releasing the prisoners in large groups. The prisoners quickly overwhelmed the few guards and began organizing under the leadership of Solo, who had been reunited with Chewbacca and Klaus Vandangante. However, the detonation had not been strong enough for the structure to reach a stable orbit and was now plummeting back to the surface of Mytus VII. Additionally, the escaped prisoners were slowly pushed back from Hirken and his guards from the upper levels and from Espos from the lower levels who had arrived from the guarding Marauder-class corvette, which had docked at the lower airlocks."}, {"tag": "p", "text": "Atuarre and Pakka, who had managed to reach the Falcon, had taken a tunnel-tube junction station with them, destroyed the remaining landed guardships, and docked at the opposing the lower airlock. Both of them reached the prisoners just in time before Solo was about to order a suicide charge. Using the docking tube, Chewbacca led a group of prisoners around the spire to the aft airlock of the corvette. By the orders of Hirken, almost the entire crew had left the ship on the rescue mission, leaving only a skeleton crew behind, which was quickly eliminated. Once the ship was commandeered, Chewbacca removed it from the airlock to prevent recapture."}, {"tag": "p", "text": "As energy circuits began to explode, Stars' End was in its final stage of descent. Most of the prisoners had been evacuated, but many had also been killed by the advancing guards. Retreating to the airlock, Solo once again faced Uul-Rha-Shann, but this time the Corellian killed the Non-Human, although Bollux was severely damaged by saving Solo's life. As Solo was about to enter the Falcon, Hirken approach the smuggler, alone, begging the smuggler to take him with him. But before the Viceprex could finish, he was shot in the back by his wife. Solo ignored the woman and the approaching Espos and escaped from the doomed facility, moments before it crashed into the surface of Mytus VII. The escaped prisoners soon found refuge on Urdur, where Jessa Vandangante had set up her outlaw tech shop."}, {"tag": "h3", "text": "Later years"}, {"tag": "p", "text": "The tower of Stars' End, however, had survived the fall. Ilm Waz-Welplinn, one of the original planners of the Stars' End project, succeeded Hirken in his post as Viceprex of Security and declared the whole incident a “freak accident”. Salvage crews began to search the impact area, but found no survivors; instead, whole levels still in one piece, protected by the armor and the anti-concussion fields. Waz-Welplinn also kept up contact with the Empire, seeing Stars' End as a project with future potential."}, {"tag": "p", "text": "Stars' End remained a prison facility, now housing not only Corporate Sector prisoners alone. Several Rebel prisoners, among them Samuel Raider and Toalagar, managed to escape from the prison mere months after its initial destruction aboard the BFF-1 bulk freighter Genue and head to Kashyyyk where they were retrieved by a Rebel team shortly before they could be recaptured by Imperial forces. The escapees had been hearing rumors for months of a new Imperial weapon but had been unable to get close to anybody who knew more. However, they were able to learn that Wookiee slaves were being sent to work on the project and, after their escape, helped the Rebels to rescue some of the slaves."}, {"tag": "p", "text": "Stars' End also was no longer a secret. The Ballad of Stars' End was a popular song in cantinas during the Galactic Civil War. The rumors that the CSA was able to restore Stars' End and put it back into operation soured relations between the CSA and the New Republic in later years."}, {"tag": "h2", "text": "Inmates, personnel and other"}, {"tag": "h3", "text": "Inmates"}, {"tag": "h3", "text": "Personnel and other"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An alternate image for Stars' End was shown in the comic adaptation of Han Solo at Stars' End."}, {"tag": "p", "text": "Stars' End is often incorrectly referred to as \"Star's End.\""}, {"tag": "p", "text": "In Isaac Asimov's Foundation Trilogy, \"Stars' End\" is the code-word for the location of the Second Foundation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}