{"url": "State_of_the_Republic_address_(19_BBY)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "State of the Republic address  (19 BBY)"}, {"tag": "p", "text": "In 19 BBY, Supreme Chancellor Palpatine issued his State of the Republic address before a special session of the Senate of the Galactic Republic. The address occurred in the third year of the pan-galactic Clone Wars between the Republic and the separatist Confederacy of Independent Systems, and thus focused heavily on the progress of the conflict and the Chancellor's vision for future warfare between the two belligerents. Palpatine outlined in his speech his reasons for continuing the war despite growing opposition from Loyalist senators, giving particular emphasis to the Outer Rim Sieges and the dangers posed by Confederate holdouts in the targeted regions. Nevertheless, the Supreme Chancellor made an effort to reassure the people of the Republic that there was clear reason for optimism in the war, as the Separatist Droid Army had been driven out of many Republic territories."}, {"tag": "p", "text": "The Chancellor's State of the Republic address was met with great praise from many of his colleagues in the Senate, a majority of whom supported a continuation of the war. Among the minority opposed to Palpatine's policies stood the Jedi High Council and members of Alderaanian Senator Bail Prestor Organa's anti-war coalition. In the aftermath of the address, the Republic's capital world of Coruscant came under attack by the Confederate General Grievous, who attempted to capitalize on the timing of the speech in order to strike at the planet when a large number of Republic dignitaries would be present. The address was the final of its kind, as it was given only days prior to the demise of the Republic and the rise of the Galactic Empire."}, {"tag": "h2", "text": "Historical context"}, {"tag": "p", "text": "Following the Separatist Crisis of 24 BBY to 22 BBY, the galaxy became engulfed in the brutal and far-reaching Clone Wars. The struggle between the dominant Galactic Republic and the breakaway Confederacy of Independent Systems carried on for three years and witnessed a number of shifts in the balance of power throughout countless battles across thousands of worlds. By around 19 BBY, the Republic enjoyed relative security, particularly in the Core Worlds. The Confederacy had largely been driven from the Core and the surrounding galactic regions, which allowed the Grand Army of the Republic to initiate the Outer Rim Sieges at the behest of Supreme Chancellor Palpatine, the leader of the democracy. Prior to that point, Palpatine had amassed increased political power within the Chancellery at an unprecedented rate via constitutional amendments and security enhancements, all of which were approved by his vast support bloc in the Galactic Senate."}, {"tag": "p", "text": "Because the war appeared to be nearing an end, a number of Palpatine's opponents on the Senate's Loyalist Committee proposed a cessation of hostilities between the Republic and Confederacy and an exhalation of power from the Chancellor's office. Palpatine, who was in fact a Dark Lord of the Sith, had been secretly manipulating both sides of the war since the conflict's beginning in a grand scheme to seize control of the galaxy. As his plans were not yet ready to come to fruition, he insisted to his opponents that the war was far from won and that the Confederacy still represented a very real threat to the Republic's democracy. Days later, the time came for the Chancellor to make his State of the Republic address, wherein he would enunciate his opinion on the Republic's condition and outline his administration's plans for the future. In anticipation of the event, numerous Republic delegates traveled to the capital planet of Coruscant to witness the speech firsthand and partake in the festivities that traditionally followed a State of the Republic address."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "Palpatine's 19 BBY State of the Republic address was made before a special session of the Senate, and was largely typical of the façade that the Chancellor had presented to the public during the war years—he appeared as a kindly and unassuming elected official, while he simultaneously acted as a great champion of democracy. His speech focused on a number of factors; first, the Chancellor announced that he would be committing two hundred thousand additional clone troopers to the Republic's sieges of the Outer Rim Territories. The number represented a full fifty percent of Coruscant's home defense fleet. The Chancellor asserted that the onus was on the Republic to press the attack against the Confederacy, particularly on the worlds he targeted as a \"Triad of Evil.\" Palpatine's Triad consisted of three planets: Mygeeto, Saleucami, and Felucia. All three worlds were bastions of the Confederacy, heavily defended by the Separatist Droid Army, and thus branded as threats to the body of the Republic by the Supreme Chancellor."}, {"tag": "p", "text": "Secondly—in stark contrast to what he had told the Loyalist Committee in their private meeting days prior—Palpatine attempted to reassure the populace that the war was close to an end, despite the continued fighting in the Outer Rim. He lauded the Republic's expulsion of Confederate forces from the Core Worlds, Inner Rim, Colonies, and Mid Rim, and asserted that the Separatists would pay dearly for the harm they had inflicted on the Republic over the course of the war. He tempered his statements with claims of his preference not to continue the war and that he would rather simply allow the Confederacy to suffer its own death alone in the Outer Rim, while Republic forces and their Jedi leaders returned to safety. However, Palpatine continued on, proclaiming that the choice did not rest solely with his wishes, and so he was required to continue the fighting so that the \"enemies of democracy\" would have no opportunity to rest and regroup for another strike at the Republic. In his statements, the Chancellor likened the Confederacy to a contagious disease that, if left untreated, would return to threaten future generations of the Republic."}, {"tag": "p", "text": "Finally, the Supreme Chancellor spoke of the post-war galaxy and the work that would be required from himself and the Senate in the new political climate. Palpatine alluded to the rebuilding and reordering of the Republic and made specific mention of a restructuring of the Galactic Constitution. Furthermore, he stated that it would be the responsibility of the Senate to offer advice on which Confederate worlds the Chancellor should welcome back into the government and which he should exile from the democracy altogether. Palpatine concluded his speech with a request that the Senate work to establish a new spirit throughout the Republic that might foster thousands of years of peace, similar to the Great Peace that the democracy enjoyed up until the onset of the Clone Wars. Throughout the duration of the address, Palpatine was accompanied by twenty-four Human officers of the Republic Navy, who stood at the first level below the summit of the Chancellor's Podium."}, {"tag": "h2", "text": "Reception and results"}, {"tag": "p", "text": "Palpatine's speech was extremely well-received by most of the Senate, who interrupted the Chancellor's address numerous times to applaud his propositions and policies. The phenomena—which had not been witnessed since the reign of Chancellor Eixes Valorum—caused the speech to last for a full four hours, as Palpatine had to repeatedly pause to allow the applause and cheers to die down. The State of the Republic was publicly broadcast by HoloNet News, whose cam droids in the Grand Convocation Chamber of the Senate Dome focused primarily on the Palpatine-loyal factions and widely ignored those senators who chose not to rejoice at the Chancellor's declarations. Following the event, opposition leader and Alderaanian Senator Bail Prestor Organa traveled to the Jedi Temple to meet with the High Council of the Jedi Order and discuss Palpatine's statements."}, {"tag": "p", "text": "While the Council watched the broadcast, Organa assured them that not every member of the Senate had been as enthusiastic as those shown. The Jedi expressed particular disapproval of Palpatine and the legislation that had granted him unprecedented power over the course of the war, and so were highly skeptical of his dedication to end the conflict and his devotion to democracy. Grand Master Yoda specifically took issue with the presence of the Naval officers and interpreted the move as a show of force. Mace Windu, who served the Republic as a High Jedi General, was taken aback by the Chancellor's mention of a Constitutional restructuring and did not agree with the decision to deploy half of Coruscant's home forces to the Outer Rim. Both Jedi Masters ridiculed the \"Triad of Evil\" proposed in the address and insinuated that the targeted worlds were too insignificant to represent any real threat to the Republic. Organa and his anti-war Senate colleagues held the same views, believing that the push against the worlds in question was part of a concerted effort to acquire worlds by force and achieve direct control over system governments for the Chancellor's office."}, {"tag": "p", "text": "The Grand Army of the Republic complied with Palpatine's decrees and dispersed from Coruscant to the targeted worlds of the \"Triad of Evil.\" As the violence escalated on Mygeeto, Saleucami, Felucia, and across the entirety of the Outer Rim, senators and Republic dignitaries reveled on the capital, enjoying numerous parties and celebratory balls held in honor of the Supreme Chancellor's address. Although outward appearances suggested that the populace had bought into Palpatine's claims that the war was nearly won, it was noted by Senator Padmé Amidala of Naboo that many of the visiting nobles arranged personal protection, wore armor, or arranged various modes of emergency escape from the Senate District for the duration of their stay on Coruscant. Indeed, while Palpatine's platitudes had convinced many that they were safe, the nature of security enforcement on the capital caused a concurrent sensation of underlying fear."}, {"tag": "p", "text": "It was during the days of celebration that Palpatine, in his Sith alter ego of Darth Sidious, arranged for an attack on Coruscant. The Chancellor was content with the thin spread of Jedi and Republic forces across the galaxy, and so ordered that the Confederacy of Independent Systems' Head of State, Count Dooku, and the Supreme Commander, General Grievous, invade the capital world and take Palpatine hostage. Grievous eagerly complied and invaded Coruscant while the world still entertained dignitaries who had not yet returned to their constituents. The General had just enough time to complete his mission before the dispersed Republic fleets returned to the capital to engage the Confederacy. Palpatine was rescued by Jedi Knight Anakin Skywalker, and Grievous was forced to retreat. The Republic victory on Coruscant served to earn the Chancellor even more political capital, which he used to institute the Sector Governance Decree and further enhance security measures in the Republic's core. Ultimately, just days after his State of the Republic address, Palpatine called an Extraordinary Session of Congress, wherein he issued the Declaration of a New Order, which allowed him to seize total control over the government and transform it into the authoritarian Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The State of the Republic address of 19 BBY was portrayed in Labyrinth of Evil, a 2005 novel by James Luceno that served as a prequel to Star Wars: Episode III Revenge of the Sith. The institution of the State of the Republic address has been likened to the State of the Union address issued annually by the President of the United States of America to the United States Congress by several reviewers of Labyrinth of Evil. These reviewers have also drawn comparisons between Palpatine's mentions of the \"Triad of Evil\" and President George W. Bush's mentions of an \"Axis of Evil\" in his 2002 State of the Union address."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}