{"url": "Battle_of_Aargonar_(Clone_Wars)/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles of Aargonar", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Aargonar  (Clone Wars)"}, {"tag": "p", "text": "The Battle of Aargonar was a loss for the Republic, but not a catastrophic one. Just days after the disastrous Battle of Jabiim, Ki-Adi-Mundi, Bultar Swan, A'Sharad Hett, Bhat Jul, and Anakin Skywalker were redeployed to Aargonar, an insignificant planet save for the fact it lay on the border of Galactic Republic and Separatist space."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Just like the Battle of Jabiim, the battle fared poorly for Republic forces, with Jedi Knight Jul killed in action, alongside many clone troopers from the Grand Army of the Republic. Jedi General Mundi, temporarily charged with Mastery of Anakin Skywalker following the supposed death of Obi-Wan Kenobi on Jabiim, gave the order to retreat from his gunship in the skies. Bultar Swan, telling Mundi that the sandstorm was ion-charged and that this battle could be worse than Jabiim, immediately attempted to destroy the Republic's camp to prevent their supplies from falling into Separatist hands, not knowing that Anakin and A'Sharad were still out in the deserts of Aargonar."}, {"tag": "p", "text": "Hiding in a cave, Anakin accidentally attacked Hett as a Tusken Raider due to a berserk rage he was undergoing, nearly killing him. Burdened, Anakin revealed the truth of his slaughter of Tuskens on Tatooine prior to the Battle of Geonosis to Hett. Hett agreed that it was a dragon Anakin would have to fight on his own—and kept his secret."}, {"tag": "p", "text": "The two Jedi managed to find a disabled Gunship Bomber Enhanced and used it to lure a native Gouka dragon into the Separatist army, giving the Republic time to retreat and rescue the two young Jedi. The Republic managed a successful retreat, and the surviving Jedi returned to New Holstice."}, {"tag": "p", "text": "An officer in the Separatist Droid Army, who was married to Senator Mina Bonteri, was establishing a base on Aargonar when it was attacked by clone troopers. Bonteri was subsequently killed."}, {"tag": "p", "text": "Word of a victory on Aargonar reached the Galactic Senate, as part of Chancellor Palpatine's plan to make the Republic seem more successful in the war than it actually was."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}