{"url": "Battle_near_the_Maw", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles in the Maw", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle near the Maw"}, {"tag": "p", "text": "Rogue Squadron was sent to patrol near The Maw for any signs of a rumored Imperial prison facility and became involved in a battle there."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the aftermath of the Battle of Hoth in 3 ABY, the Rebel Alliance was devastated, although the war continued. The Alliance leadership suspected that there was an Imperial installation hidden in an asteroid field near the Maw. Three Rogue Squadron members were sent into investigate, and as they approached the field, General Carlist Rieekan cautioned them to be attentive. Wedge Antilles, the Rogue Leader, used his craft's ion cannon to disable a mine in their path."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Space battle"}, {"tag": "p", "text": "In their Y-wings, Wedge Antilles and the other two pilots flew into the asteroid field. One of the pilots picked up a strange sensor reading, and Antilles cautioned them to stay alert, as the signals might have been Imperial. The Rogues then found a group of seven Imperial tankers and a Lambda-class shuttle, and their presence was revealed. TIE/LN starfighter squadrons approached to intercept the Rebel starfighters and an Imperial demanded their surrender. The Imperials received no response from the Rebel pilots, who continued on towards their target: a shield projected around the asteroid which housed the facility. Antilles disabled three of the projectors and opened a hole in the shield, the and the Rogues descended towards the base on the surface of the asteroid, avoiding the mines spread around the facility."}, {"tag": "h3", "text": "Engaging facility defense forces"}, {"tag": "p", "text": "Antilles reported their progress to Rieekan and then picked up a transmission from the surface. Rebel Karie Neth and a number of other prisoners captured after the Imperial assault on Hoth had managed to break out of the facility, but were desperate for support in order to escape safely. Neth sent out a message begging for someone to hear her. Neth identified herself to Antilles as the leader of the prisoners and asked Antilles and his wingmen to destroy the guard towers protecting the prison building. Neth transmitted targeting information to the Y-wings."}, {"tag": "h3", "text": "Rebel prison escape"}, {"tag": "p", "text": "Antilles ordered his wingmen to attack while he destroyed the five towers protecting the prison so the armored hovertrain the escapees had commandeered could move in. A Rebel then reported they needed weapons, and transmitted more targeting information about the weapons storage building so Antilles could bomb the guard towers. Neth then told them to take out the comm relay before the Star Destroyer patrol arrived. Antilles then flew to the other side of the base at the hangars and destroyed the five guns there so the prisoners could hijack an escape craft. He also bombed Imperial walkers, adding to the general mayhem. Flying over the prison command buildings, he bombed them as well, and was able to recover technology useful to the Rebellion in an atmospheric dome. The surviving prisoners reached the landing platform and escaped in a Sentinel-class landing craft. Antilles engaged TIE Interceptors attacking the shuttle until it could enter hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Antilles reported to General Rieekan that their mission was accomplished, and he and his wingmen hyperspaced out to the fleet in the Outer Rim Territories. As the Rogues left, the facility was exploding behind them. Karie Neth eventually joined Rogue Squadron, and would eventually participate in the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle near the Maw appears during a mission in the 2001 video game Star Wars: Rogue Squadron II: Rogue Leader. The mission is also included in the co-op campaign in Star Wars: Rogue Squadron III: Rebel Strike. Picking up the upgrade will fulfill the mission's bonus objective. The player may order their wingman to attack targets, and this article assumes the player did so, rather than ordering them to retreat. During the race to the landing platforms, the strategy guide suggests following the train or proceeding directly. The player does not have to take out all guns and AT-PTs, although the strategy guide suggests doing so."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}