{"url": "Statuary", "categories": ["Category:Legends articles", "Category:Stub", "Category:Art", "Category:Statues"], "nodes": [{"tag": "h1", "text": "Statuary"}, {"tag": "p", "text": "Statuary are works of art that took on a physical form, such as those created by Ineas Tikartine. Marn Hierogryph tried to sell makeshift pieces of statuary art on Ralltiir. Relatively small statues are often called Statuettes. Although most statues are made of stone, there were some instances where they were made of ice."}, {"tag": "p", "text": "Statuaries can be used as a means of honoring something, or someone for an event, with the latter requiring that said someone needed to do something of exceptional service, or as a form of propaganda. The latter was best demonstrated during the Battle of Endor (or, rather, a holosimulation by then-Emperor's Hand Mara Jade of what should have occurred rather than of what actually occurred), where Darth Vader told the Imperial officer in charge of taking down the Endor strike team and the Ewoks that, due to his success in the battle, a statue would be made and placed on Coruscant in his honor. Another example is a statue of the Galactic Emperor Palpatine that was placed at the steps to Theed Palace on Naboo during the holiday Empire Day, in honor of his founding of the Empire. Another example of this was a similar statue that Emperor Palpatine commissioned in the Jedi Trials Chamber of himself as a testament to his might as well as Sith superiority to the Jedi. On Coronet, a statue of the Grand Master of the Jedi Order and MIA Clone Wars veteran/hero Yoda was constructed in Coronet City on Corellia, owing to the planet's sympathetic views of the Rebel Alliance."}, {"tag": "p", "text": "The Sith Empire typically made statues of the Sith Emperor rendering him as an imposing, hooded figure, hiding his facial features. A similar concept would be used millennia later to create statues of Galactic Emperor Palpatine."}, {"tag": "p", "text": "The Statuary Park on Bakura and the Death Star's Statuary Park showcased statues in a space intended for visitors to stroll in."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}