{"url": "Steadfast_(Imperial-class_Star_Destroyer)/Legends", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Imperial-class Star Destroyers of the Galactic Empire", "Category:New Republic starships", "Category:Starships of the Crimson Empire"], "nodes": [{"tag": "h1", "text": "Steadfast (Imperial-class Star Destroyer)"}, {"tag": "p", "text": "The Steadfast was an Imperial-class Star Destroyer in the service of the Imperial Navy during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Grand Admiral Afsheen Makati commanded the Steadfast at some point during the Imperial Period, and it was his personal destroyer for a while. The ship served during an investigation to a Rebel base on Thila. Grand Admiral Makati was assisted by Supreme Prophet of the Dark side Kadann during the investigation, and Vivant was its executive officer. Kadann overheard Vivant mocking his extravagant attire and admonished Makati with Force lightning for his officer's insubordination."}, {"tag": "p", "text": "Sometime between the Battle of Endor and the return of Palpatine, the Imperial Ruling Council placed the Steadfast under Carnor Jax's command. Vivant had became its commander."}, {"tag": "p", "text": "The Steadfast was brought to Phaeda to take over an orbital bombardment from the Emperor's Revenge, allowing Jax to pursue Kir Kanos to Yinchorr. Vivant and the Steadfast were forced to surrender upon the arrival of Rogue Squadron and the Lusankya."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dan Wallace originally indicated in his article, Who's Who: Imperial Grand Admirals, that Grand Admiral Afsheen Makati's personal Imperial-class Star Destroyer was named Steadfast. However, the segment was cut. It was included the Star Wars Encyclopedia, and is therefore canonized. When the article was originally due to appear in Star Wars Gamer in an article entitled Dirty Dozen: The Imperial Grand Admirals, it was established that Makati's Steadfast was the same ship as the Steadfast appearing in Crimson Empire, and the article also made reference to Vivant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}