{"url": "Station_Theta_Black", "categories": ["Category:Canon articles", "Category:First Order space stations", "Category:Unknown Regions space stations"], "nodes": [{"tag": "h1", "text": "Station Theta Black"}, {"tag": "p", "text": "Station Theta Black was a space station in the Unknown Regions utilized by the First Order during the Cold War to mine and process dedlanite to make blasters. It was located in an asteroid field, attached to one of the asteroids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 34 ABY, Station Theta Black had been decommissioned and was scheduled for demolition. On the day of demolition, two Resistance pilots, Commander Poe Dameron and Kazuda Xiono, along with astromech droids BB-8 and CB-23, visited the station investigating coordinates the Resistance had acquired as a result of Xiono's spying mission on Castilon."}, {"tag": "p", "text": "Xiono was concerned about entering the station, but Dameron insisted. Inside the station, the two destroyed a sentry droid, causing an alarm to be sent back to Starkiller Base. This led Captain Phasma to decide to accompany the demolition crew personally, and she ordered Major Elrik Vonreg and his squadron along as well. After being alerted to the First Order's arrival by CB-23, who had taken the X-wings and hidden among the asteroids, Dameron, Xiono and BB-8 found their way to the control room, where they located and copied data about the station's mining operations before fighting their way to the catwalks in the main hangar, where CB-23 brought the fighters in to pick them up. While this was going on, Phasma's stormtroopers were placing the explosives for the demolition at all points in the station. After the Resistance fighters had left the station, Phasma and her troopers evacuated in their shuttle. Dameron and Xiono briefly fought with Vonreg and his squadron near the station, before Phasma ordered Vonreg to retreat as the explosives were about to go off. When the station was demolished, the First Order ships were already gone, and Xiono and Dameron were forced to outpace the blast wave while weaving through asteroids. Dameron managed to do so, while Xiono weathered it by shielding his fighter behind an asteroid. The two then returned to a Resistance corvette to report their findings to General Leia Organa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Station Theta Black first appeared in the Star Wars Resistance episode of the same name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}