{"url": "Battle_of_Adumar", "categories": ["Category:Legends articles", "Category:Battles of Adumar", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Adumar"}, {"tag": "p", "text": "The Battle of Adumar was a conflict between the New Republic and the Imperial Remnant, fought in defense of the New Republic's ally, the newly formed Adumari Union."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the defeat of Imperial-backed Cartann in the Adumari civil war, the Star Destroyer Agonizer left Adumar to summon an Imperial fleet to conquer the planet. This action was delayed when Admiral Teren Rogriss locked out the Agonizer's holocomm system with his command codes, prior to defecting to Adumar. As no one else on the ship, not even General Turr Phennir, had the authority to override Rogriss's codes, this gave General Wedge Antilles time to summon reinforcements and prepare for the coming battle."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "When the Agonizer returned, accompanied by the Star Destroyers Retaliator and Master Stroke and numerous smaller warships, the New Republic Star Destroyer Allegiance had been reinforced by the Mon Calamari Star Cruiser Mon Casima and its own array of cruisers and frigates. In addition, three \"flightknives\" of Adumari Blade-32 fighters had deployed in space to join the battle, and false news reports were broadcast to give the impression that Adumar was still fighting a civil war. As a result, the Imperial forces sent a large number of their fighters, including most of their TIE/sa bombers, down to the surface to crush the disorganized Adumari forces and install Cartann's perator as a puppet ruler of the planet. These fighters were taken by surprise by the united Adumari forces, and suffered severe losses."}, {"tag": "p", "text": "In space, the New Republic's X-wings, A-wings, and shield-equipped TIE/LN starfighters engaged the enemy starfighters, while the Y-wings and Blade-32s carried out coordinated concussion missile and proton torpedo attacks against the Agonizer. The B-wings split their duty between attacking the Agonizer and supporting the more agile but less powerful New Republic fighters against the enemy TIEs. The New Republic's capital ships focused their attention of the Master Stroke. While the fighters took fairly heavy losses, especially at the hands of a flight of four TIE/D Defenders, the Imperials lost even more fighters, and finally chose to withdraw after the Agonizer and Master Stroke lost their shields and began taking heavy damage. General Antilles shot down one TIE Defender during the battle, and severely damaged another during a one-on-one dogfight with General Turr Phennir."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Imperial fleet's fighter screen in disarray and with their Star Destroyers taking heavy damage from the New Republic reinforcements and Adumari flightknives, the order to withdraw was given. The Imperial ships attempted to recover fighters then made the jump to hyperspace, leaving the Adumari Union to formally join the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}