{"url": "Stealth_ship_(Galactic_Republic)", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Corvette classes", "Category:Galactic Republic starship classes", "Category:Stealth ship classes"], "nodes": [{"tag": "h1", "text": "Stealth ship  (Galactic Republic)"}, {"tag": "p", "text": "The stealth ship was a Galactic Republic prototype starship designed to help aid the war effort during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The stealth ship was an experimental corvette equipped with a cloaking device, which allowed the ship to become completely invisible to the naked eye, and almost completely invisible to every scanner. The ship featured a multi-segmented main fuselage, mid-section antenna array, upper and lower anti-aircraft dual laser cannon turrets, four proton torpedo launchers, and a large engine pod at the tail. It also had a two-man crewed countermeasures compartment, and the capacity to carry extra troops and cargo."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A prototype stealth ship was introduced by Obi-Wan Kenobi at the Battle of Christophsis. Although its objective was to continue the mercy mission to Bail Prestor Organa undetected, General Anakin Skywalker decided to attack the blockade. It was used against Separatist Admiral Trench during the breaking of the orbital blockade around the planet. Admiral Wullf Yularen, Commander Blackout, and CT-1284 were also present on the prototype ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Stealth ship was designed by 'Clone Wars' concept artist Russell Chong. It is actually based off of a pencil according to Dave Filoni.[source?] In the episode when Anakin Skywalker states that it is unusual for a smaller ship to have a cloaking device, which is a reference to a line from Star Wars: Episode V The Empire Strikes Back by Lorth Needa. The Stealth Ship concept, alongside the entire premise of their debut episode, Cat and Mouse, was based on Submarine Warfare from World War II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}