{"url": "Stealth_field_generator/Legends", "categories": ["Category:Legends articles", "Category:Stealth field generators"], "nodes": [{"tag": "h1", "text": "Stealth field generator"}, {"tag": "p", "text": "Stealth field generators, alternatively known as personal stealth fields and personal cloaking devices, were small devices worn at the belt that hid the wearer in a manner similar to the larger cloaking device."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "During the Old Republic era stealth field generators were typically small and unobtrusive devices worn on the belt, consisting of emitters and a standard power pack that could power the device for roughly five minutes. Using technology similar to personal energy shields, stealth field generators emitted a sound-dampening field as well as bent light around the wearer; this made the wearer incredibly difficult to detect aurally and visually, though didn't grant total invisibility."}, {"tag": "p", "text": "By the time of the Rebellion era, stealth field generators were a relic of an age long-past, and those that remained were considered antiques. Despite this, several contemporary efforts were made by various military organizations and stealth technology companies to recreate field generators with modern technology. These modern recreations had much longer battery life, and used a combination of optical camouflage, low-output electromagnetic dampers, electronic acoustic bafflers, and thermal shielding to make a user virtually invisible to the naked eye and most sensors and scanners. Despite their advances, however, these systems were not perfect, and did not offer total invisibility."}, {"tag": "h2", "text": "Limitations"}, {"tag": "p", "text": "Regardless of the era they were produced in, both antique and recreation stealth field generators were notoriously sensitive, with the camouflage fields prone to collapse under stress. This flaw was theorized by scientists to be an inherent limitation of the miniaturization of technology originally used in starships, among other design flaws."}, {"tag": "p", "text": "Ultimately this limited stealth fields in a variety of ways; quick movements tended to destabilize the field easily, and most users could only move at a fast walk for fear of the field collapsing, with it requiring skill and training to move anywhere close to a run. Actions involving sudden outward movement, such as engaging in combat, and weapons fire across a broad spectrum of energy types was disruptive to the stealth field - taking damage or delivering it was often enough to cause a collapse."}, {"tag": "p", "text": "Further, the camouflage that stealth fields offered wasn't perfect, with many field generators creating a visual distortion or phantasmal silhouette that, while very difficult to see, could still be detected if the user wasn't careful. Because of this, users of stealth fields could not move with impunity and had to be mindful of detection, often using shadows and cover to their advantage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Stealth fields became prominent during and after the Jedi Civil War, where they were a novel technology. During this time they were widely used by Sith Assassins and Mandalorian scouts, as well as criminal elements such as the GenoHaradan and the Exchange."}, {"tag": "p", "text": "By the time of the Rebellion, stealth field technology had become vanishingly rare - to the point that most governments didn't even bother to place restrictions on the technology's use. Certain governments and intelligence organizations still made use of the technology, however, most notably Bothans from the Bothan Spynet, Shadowtroopers from the Empire Reborn, and Imperial Saboteurs."}, {"tag": "p", "text": "Despite the decline in their use, several stealth technology companies, primarily Fabritech and Kerner Corp., attempted to recreate the technology through contemporary technology. These modern recreations were more advanced and power efficient than their antique counterparts, and were available for sale as restricted items."}, {"tag": "h2", "text": "Notable users"}, {"tag": "p", "text": "Stealth fields were used by Revan and Meetra Surik and her companions. Under Darth Malak's Sith Empire, a group of researchers on Korriban developed a special sound dampening stealth field generator, which was later found and used by Revan to enter Marka Ragnos' tomb while not corrupting the targeting protocols of the assassin droid guarding with excessive audio input."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The stealth field generator was specifically designed for the Knights of the Old Republic video game duology, although it made it first appearance in the 2002 game Jedi Knight II: Jedi Outcast, with stealth fields going on to appear in numerous Star Wars video games before being introduced into the wider canon. Within games they are typically portrayed by using a frame buffer effect to show the stealthed individual as a three-dimensional transparent distortion in the air."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}