{"url": "Steep", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Amphibians", "Category:Aquatic creatures", "Category:Carnivorous creatures", "Category:Creatures of the Core Worlds", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Steep"}, {"tag": "p", "text": "The steep were a species of non-sentient amphibians native to the planet Metellos. Possessing ten-centimeter-thick skin, they dwelt in the sewage-filled seas of the planet, bobbing on the surface of the waters. At night, the carnivorous steeps wandered the alleyways of Metellos' settlements, searching for children to eat."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Steeps stood on four spindly legs, each of which ended with a webbed foot, and were capable of walking on land. The carnivorous amphibians were protected by a tough, rubbery hide of ten-centimeter-thick, brownish-white skin. Although their heads were large, their brains were small. A steep's mouth stretched from one side of the head to the other, with two eyes located on purple stalks protruding from the tops of their heads. Similarly purple-colored growths extended down the backs of the species."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Designated as non-sentient, steeps were known for their lack of intelligence and, when fighting an adversary, would continue attacking relentlessly until they themselves had been killed. Steeps were named after their habit of \"steeping\" themselves in the sewage-filled waters of their homeworld Metellos' seas. The amphibians were frequently seen floating on the surface of the water. Steeps were known to roam down Metellean alleyways at night seeking children, whom they swallowed as food."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Steeps were native to the Core Worlds planet of Metellos, discovered prior to the formation of the Galactic Republic. The sewage that built up in the seas as the planet was urbanized gave steeps a suitable habitat, while the increasingly dense population provided an ample food source."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The steep was first mentioned in Wizards of the Coast's 2003 reference book, Coruscant and the Core Worlds; although it was shown first in a preview art gallery on Wizards.com in which the illustration of a steep, drawn by R. K. Post and used in the book, was shown. The steep was a creation of Daniel Wallace, one of the authors of Coruscant and the Core Worlds, who created its homeworld of Metellos for the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}