{"url": "Battle_of_Agomar", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Seswenna sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Agomar"}, {"tag": "p", "text": "The Battle of Agomar took place in the first year of the Clone Wars, when the Galactic Republic and the Confederacy of Independent Systems clashed on the planet Agomar. While Jedi General Adi Gallia and her clone trooper forces engaged a Separatist detachment on the Outer Rim world, the Republic was able to secure a victory thanks to a nanovirus that caused the Separatists' battle droids to turn on one another in the midst of the battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, the Jedi High Council took on a proactive role in the war as its members personally commanded several of the Galactic Republic's Outer Rim campaigns against the Confederacy of Independent Systems. One such engagement took place when Jedi General Adi Gallia encountered a Separatist detachment on the planet Agomar."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Gallia clashed with a Separatist contingent on Agomar, leading her groups of clone troopers against the enemy. During the fighting, she was contacted by Jedi Master Obi-Wan Kenobi, who was passing close by to Agomar while on a mission to the planet Zigoola with Senator Bail Prestor Organa. Kenobi had been trying to transmit a message to Grand Master Yoda on Coruscant but had been unable to do so due to the distance from the galactic capital, so Gallia promised to relay his message back to the Jedi Temple at the next opportunity. The Republic eventually unleashed a nanovirus on the Separatists' battle droids on Agomar, causing B2 super battle droids and droidekas to turn on each other, with numerous legions of B1-Series battle droids caught in the middle of the chaos, to the mirth of the clone troopers. Thanks to the Republic's sabotage, Gallia and the Republic emerged victorious on the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Agomar was created in supplementary material for the 2008 Star Wars: The Clone Wars television series and was first alluded to in the December 2008 novel The Clone Wars: Wild Space. Although the book only solidified Adi Gallia's participation in the conflict, the battle was later expanded upon in the October 2009 publication The Official Episode Guide: Season 1, which also provided the campaign with an official name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}