{"url": "Battle_of_Aiquin_4", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Airam sector", "Category:Battles of Spreading the Rebellion campaign", "Category:Battles of Task Force Vengeance", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Aiquin 4"}, {"tag": "p", "text": "The Battle of Aiquin 4 was a Rebel effort to capture Airam clan leader Ilay during a meeting with the Imperial-class Star Destroyer Rage."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Rogue and Green Squadrons performed a hyperspace jump into the Aiquin 4 system just in time to see the Dreadnaught-class cruiser Kala'din arrive. However, the Star Destroyer Rage was positioned between the Dreadnaught and the Rebel strike team, forcing Rogue Squadron to engage the Rage's fighter screen prematurely, while Green Squadron made a run for the Airam cruiser in its B-wing assault starfighters."}, {"tag": "p", "text": "Unloading a few proton torpedoes onto both Dreadnaught and Star Destroyer, the B-wings brought down the shields of Kala'din relatively quickly. Green Squadron proceeded to disable the ship, then turned its attention to the Rage. Rogue Squadron fought valiantly to fend off any attackers bothering the B-wings during their attack runs. The Rage absorbed a beating from the Slayn & Korpil starfighters, but was ultimately forced to withdraw from the system or risk suffering heavy damage."}, {"tag": "p", "text": "Meanwhile, the Rogues dueled both Imperial and Airam starfighters to protect the Rebel blockade runner Storm during its boarding operation. Alliance Special Forces succeeded in fighting their way through the disabled Kala'din and capturing Ilay, who was taken on board the Storm as a prisoner of the Alliance. After the successful capture of the Imperial-aligned Airam leader, the Storm proceeded to exit the system. Even the late arrival of the Super Star Destroyer Vengeance could not prevent the Rebel corvette from completing its mission. When the Storm finally entered hyperspace, Rogue and Green Squadrons withdrew, avoiding further losses in the face of rapidly mounting Imperial opposition."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ilay's capture provided a wealth of information for the Airam Clans under Tamaron as well for as the Rebel Alliance. One piece of information was that conscripts from Ilay's clan would be sent to the Vengeance soon, accompanied by fresh supplies. How desperate the supply situation of Task Force Vengeance had become was shown by Rage's deployment of TIE/sa bombers barren of concussion missiles against the Rebel starfighter force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name of the Aiquin system is somewhat in dispute. Star Wars: X-Wing vs. TIE Fighter, the computer game in which this battle takes place, calls it the Aiquin 4 system. This is somewhat unusual nomenclature for a star system, which may contain planets or stars numbered by orbit or otherwise, but generally contains no numerals; furthermore, most numbered planetary bodies in the Star Wars universe are done so using the Romanic number system (\"IV\" instead of \"4\"). The Essential Atlas names the system as simply the Aiquin system, and due to the confusing nomenclature, the Atlas version is the one used here to identify the system."}, {"tag": "h2", "text": "Appearances"}]}