{"url": "Stend_VI", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Factory worlds", "Category:Galactic Empire planets", "Category:Juris sector planets", "Category:Stend VI locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Stend VI"}, {"tag": "p", "text": "Stend VI was an Outer Rim planet located within the Stend system of the Juris sector. Lying on the Five Veils Route hyperlane, it was a terrestrial world with a temperate climate and a terrain dominated by mountains, plains, and urban areas. Stend VI's mostly Human population was governed democratically, although the planet also served as a manufacturing site for the Galactic Empire."}, {"tag": "p", "text": "At first glance an unordinary member world of the Empire, Stend VI came to be plagued by continuous violence as several swoop gangs rose to prominence on the planet. Among the first gangs, the Skulls gained an infamous reputation for terrorizing innocent people, while the Knights were dedicated to the principles of the Jedi Order and opposed the Skulls. The local police were outmatched by the gangs, and even Imperial Military intervention was ineffective at first, leading to the creation of the specialized Dark Riders unit of mounted Storm Commandos."}, {"tag": "p", "text": "A prominent location on Stend VI, the swoop pilot cantina known as The Pits was a vibrant establishment where arguments either flared up into brawls or were settled on the cantina's private Raptor Run racing course. The Pits' owner, famed racing champion Blizz Pinnix, occasionally competed at Raptor Run. Although owned by Pinnix, The Pits was run by the Herglic businessman Kaylo NaKuda, who also owned the adjacent vehicle repair garage and dealership Kuda's Compound, which was staffed by slaves. During the Empire's reign, a group of individuals worked together with Pinnix, the Knights, and the Sector Ranger Narra Mesyne to bring about the Herglic crime lord's downfall."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Stend VI was a terrestrial planet located within the Stend system, a part of the Outer Rim Territories' Juris sector. It occupied the sixth orbital position around its star and lay on the hyperlane known as the Five Veils Route, which connected it to the Ninzam and Vergesso systems. Stend VI orbited its star every 230 local days, each of which was twenty-three standard hours long, and had three moons, two of which loomed large in the planet's sky."}, {"tag": "p", "text": "The Outer Rim world had standard gravity, a breathable Type I atmosphere, and a temperate climate, with winters being relatively mild. The surface of Stend VI featured mountains, plains, urban areas, and a moderate hydrosphere. There were no predators that could pose a particular threat to the planet's populace."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins of a war"}, {"tag": "p", "text": "During the reign of the Galactic Empire, several swoop gangs arose on Stend VI, leading to daily skirmishes in the planet's skies. The group that was considered to be the first real gang was the Skulls. It was formed around the year 2 BBY, when the seventeen-year-old sociopath Jeng Seth grew bored of shaking down store owners for protection money and picking pockets. Discovering a love for speed and danger in the streets of the essentially lawless Stend VI, Seth gathered his street friends and formed the Skulls, which began to commit robberies and terrorize innocents."}, {"tag": "p", "text": "When the Skulls began to make a name for themselves in the local news by terrorizing the inhabitants of Stend VI, the twenty-year-old idealist and local swoop mechanic Finegan Flint started to gather his friends in order to stop the menace of Seth's gang. Fascinated by historical and fictional accounts of the Knights of the disbanded Jedi Order, Flint led his friends into confronting a member of the Skulls and telling him to surrender himself to the local police. This started a feud between the two groups that eventually turned into a gang war. Flint's group, which came to be known as the Knights, was dedicated to the ideals of the Jedi, but neither the local law enforcement agencies nor the subsequently deployed forces of the Empire viewed it as anything more than yet another criminal organization."}, {"tag": "h3", "text": "Legacy of the Skulls"}, {"tag": "p", "text": "By 2 BBY, the Skulls had relocated to the Hook Nebula. A new swoop gang known as the Razers emerged on Stend VI and resumed the Skulls' campaign of terror, at the same time specializing in stealing vehicles and parts. The Knights gang eventually refocused on combating the Razers. Maintaining only a handful of operatives on Stend VI in apprehension of inciting further conflict on the already violence-plagued world, the Rebel Alliance tried to recruit members of the Knights at some point between the years 0 ABY and 4 ABY."}, {"tag": "p", "text": "The Razers came to be hired by the local Herglic businessman Kaylo NaKuda, who purchased stolen merchandise from the gang only to sell it as supposedly legitimate goods at low prices. NaKuda's illegal activities, which also included slavery, eventually led the Sector Ranger Special Enforcement Officer Narra Mesyne to try and discover enough evidence against the Herglic to bring him to justice for his crimes. To that end, Mesyne posed as a new speeder bike racer called Miraj, who attempted to collect a prize for successfully completing the race course known as Raptor Run."}, {"tag": "p", "text": "The Corellian scoundrel Cohden K'Reye visited Stend VI at some point during the Empire's reign. He spent time in the cantina known as The Pits and later described the establishment in a treatise highlighting several recreation-related locations of the galaxy. The Pits was also once visited by the captain Nuendo Rash, who was overheard telling a companion that they had both been hired to transport medical gear to Fortress Keremark on the Tion Hegemony planet Risban. Rashh was arrested after making the comment."}, {"tag": "h3", "text": "Troubles for Blizz Pinnix"}, {"tag": "p", "text": "Blizz Pinnix, the owner of The Pits, was bidding at one point for Stend VI to host a qualifying race for the Triple Crown competition of the swoopchasing discipline. The Triple Crown races were held on the planets of Najiba, Neftali, Redcap, and Socorro. Up to that point, the qualifying races for the competition were traditionally held on Garos IV, Omman, and Tatooine."}, {"tag": "p", "text": "At some point during the swoop gang warfare on Stend VI, the Empire responded to the local police's requests for assistance and sent in a wing of repulsorlift sleds. At first, the sleds appeared to be an effective solution, but eventually they were overwhelmed by the large numbers of the swoop bikers, and many of the Imperial vehicles were lost."}, {"tag": "p", "text": "As a result, the Imperial commanders on Stend VI formed the Dark Riders, a specialized squad of elite Storm Commandos led by famed scout trooper Lieutenant Irlyn Resk and mounted on heavily modified speeder bikes. Resk secretly wanted to confiscate the Black Raptor, Pinnix's infamous swoop, for himself."}, {"tag": "p", "text": "When Pinnix discovered the Black Raptor had mysteriously disappeared, the famous racer put out a very large reward for the swoop's return, which attracted to Stend VI many individuals eager to look for the lost vehicle as well as bounty hunters and mercenaries. There were many suspects in the disappearance, including members of the swoop gangs, NaKuda, and Lieutenant Resk."}, {"tag": "p", "text": "Eventually, a group of individuals were successful in tracking down the swoop bike and received a large reward, although their fortune was subsequently threatened by the activities of Stend VI's swoop gangs."}, {"tag": "p", "text": "Around that time, NaKuda's use of slaves at Kuda's Compound was discovered by a group of individuals who were themselves captured and put to work in the Compound's garages. The group met the Twi'lek slave Sil Vaturha there. The individuals ultimately escaped and, after finding Pinnix, presented The Pits' owner with convincing evidence of NaKuda's criminal activities. With Pinnix's assistance as well as that of Miraj and the Knight swoop gang, the group defeated the Herglic crime lord and his henchmen."}, {"tag": "h3", "text": "Pirate activities"}, {"tag": "p", "text": "By the date 37:6:8, Stend VI had become a neutral meeting place favored by certain pirate groups. Defense Minister Grady Mannd of Stend VI unsuccessfully tried to use the local military forces to drive the pirates away from the planet."}, {"tag": "p", "text": "On that date, Sektor Newsline 242 broadcast a news report from Queo City on Stend VI. The report discussed the possible reasons for the inexplicably sudden decrease in the number of attacks by the Khuiumin Survivors pirate gang. It also quoted Mannd's belief that the Survivors had relocated to a different region of space to carry out their attacks, as evidenced by a lack of any reported members of the gang on Stend VI."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Stend VI had a population of 2.2 billion, most of which were Humans. The inhabitants of the Outer Rim world were governed by a representative democracy allied with the Galactic Empire, in which the planet served the role of a manufacturing and processing site. The society on Stend VI had access to space-level technology and maintained an Imperial-class starport. The planet exported consumer goods to other worlds while at the same time importing foodstuffs from elsewhere."}, {"tag": "p", "text": "Considered to be a mostly typical Imperial world, at first glance Stend VI appeared to be peaceful and even dull. These qualities, however, eventually led to the planet becoming home to some of the galaxy's most infamous swoop gangs, with the gangs of Stend VI being especially problematic to the Empire. The gangs were responsible for extensive damage to property on the planet and significant loss of life. The Stend VI Security Forces were determined to stop the swoop-mounted criminals, but they faced a severe shortage of trained personnel and equipment necessary to combat the growing threat of the gangs, with even Imperial repulsor sled patrols proving ineffective."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "The Pits"}, {"tag": "p", "text": "A prominent location on Stend VI was the swoop racer bar known as The Pits. Lying within an urban area of low buildings and trees, The Pits had a ground floor with a street-level entrance as well as an underground level. An unusual feature of the cantina was its main entrance. Since The Pits was built with the motto of swoop enthusiasts in mind—\"Why walk when you can fly?\"—most swoop pilots entered the establishment through the Hive, a tall, cylindrical tower on the cantina's roof."}, {"tag": "p", "text": "The Hive was honeycombed with hundreds of cubicles known as stalls, which allowed visitors of The Pits to dock their aerial vehicles. Docking in the stalls was regulated by the Hive Traffic Control, a structure made almost entirely of transparisteel and mounted on a thin support beam at the top of the large landing tower. The Hive also featured turbolifts leading to the ground level, which was set up as a museum dedicated to the history of repulsorlift vehicles and racing. The museum's collection also included the trophies of The Pits' owner, legendary swoop racer Blizz Pinnix."}, {"tag": "h4", "text": "The cantina proper"}, {"tag": "p", "text": "Another set of turbolifts led from the ground level to the underground floor, where the cantina proper was located. It was a lively and welcoming place full of both professional and amateur swoop and speeder bike pilots of several species, including members of swoop gangs. Due to always appearing in public wearing a signature racing helmet, no one knew what Pinnix looked like, so it was possible that the owner of The Pits was actually present in the cantina at any given moment without anyone recognizing the famous racer. The day-to-day operations of The Pits were overseen by the Herglic businessman Kaylo NaKuda, who kept secret from Pinnix his criminal activities."}, {"tag": "p", "text": "Since many of the bar's patrons were highly competitive in nature, disagreements were commonplace and were most often settled on the race course known as Raptor Run, although arguments occasionally erupted into brawls, which sometimes involved blasterfire. Such conflicts rarely got out of hand due to the presence of the Reigat racer-turned-bouncer Chugg. Droids were not welcome in The Pits, and there were rumors that any mechanical beings who did find their way inside the establishment ended up in a massive storeroom of spare parts."}, {"tag": "h3", "text": "Kuda's Compound"}, {"tag": "p", "text": "Kuda's Compound was a large, multistory building located next to The Pits. Owned by the Herglic Kaylo NaKuda, who also ran the adjacent cantina, the Compound offered the combined services of repulsorlift vehicle repairs and modifications, as well as dealership of new and used vehicles and parts. It was a profitable operation that offered competitive prices and full services of resident mechanics to its customers. When not fulfilling his duties as a bouncer at The Pits, Chugg, who was also NaKuda's bodyguard, could be encountered at the Compound. In truth, the commercial success of Kuda's Compound was due to NaKuda employing a pair of illegal methods."}, {"tag": "p", "text": "Firstly, almost all the vehicles and parts available at the Compound were stolen either by members of the local Razer swoop gang or imported from offworld by smugglers. The Herglic purchased these stolen goods at a low enough price to be able to offer the Compound's services at invitingly low costs to its clients."}, {"tag": "p", "text": "Secondly, the \"mechanics\" dealing with customers were just actors, while the real work was done in hidden, underground garages by a dozen slaves who were outfitted with subdermal implants that tracked their movements and prevented escape. One of the slaves was Sil Vaturha, a Twi'lek female orphan who possibly had some of the greatest technological skills of the inhabitants of the Juris and neighboring sectors."}, {"tag": "h3", "text": "Raptor Run"}, {"tag": "p", "text": "A zone of hundreds of square kilometers originally designated as an Imperial Ordinance Detonation Test Area, Raptor Run was filled with rocky cliffs, canyons, and serpentine valleys, as well as labyrinthine, jagged paths twisting through them. The area also had fields of craters and mazes of slagged buildings as a result of former testing of Imperial munitions."}, {"tag": "p", "text": "Blizz Pinnix bought the land for a low price and turned it into The Pits' private race course. The eighty-five-kilometer-long course was rumored to have resulted in career-ending injuries, most of which were fatal, for more than a thousand swoop racers. A testament to Raptor Run's difficulty was that only three competitors had ever completed the course in under twenty minutes—a young Tatooinian, the stunt racer Lev Xestra, and Pinnix himself, who held the record for the fastest run on the track. Pinnix occasionally entered the competitions held at Raptor Run, where he rode the Black Raptor, his renowned swoop and the namesake of the course."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Stend VI was first mentioned in Galaxy Guide 9: Fragments from the Rim, a 1993 sourcebook written by Simon Smith and Eric S. Trautmann for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Stend system, and therefore Stend VI, in grid square P-17."}, {"tag": "p", "text": "The 1997 sourcebook Wretched Hives of Scum & Villainy provides several adventure seeds set on the planet for use with Star Wars: The Roleplaying Game, and this article assumes as many of those scenarios as possible play out as described without contradicting each other. Alternate scenarios of how the player-characters may interact with the character Narra Mesyne are also presented in the adventure seeds. One of these options suggests that the characters are originally sent to Stend VI to assist Mesyne in her investigation. Another option is for the player-characters to be hired by the character Kaylo NaKuda to discover who is spying on him, resulting in the characters preventing Mesyne from succeeding at her mission or even capturing her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}