{"url": "Stennes_Shifter/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Expansion Region species", "Category:Force-sensitive species", "Category:Human and Near-Human species", "Category:Mammalian sentient species", "Category:Stennes Shifters", "Category:Telepathic species"], "nodes": [{"tag": "h1", "text": "Stennes Shifter"}, {"tag": "p", "text": "The Stennes Shifters were a sentient, Near-Human species native to the planet of Stennaros. They were biological offshoots of the Stennes and resembled their kin in appearance, with ashen-gray skin riddled with dark veins and small knobs, a slight body, heavy-lidded eyes, and gaunt cheeks that gave them a skull-like visage. Yet the Shifters had several unique abilities that set them apart from their mainline cousins, all of which were rooted in an innate sensitivity to the Force. Foremost was their ability to pass unseen using a form of telepathy. A Stennes Shifter could use this talent to disappear into a crowd. Shifters also were able to feed on the Force expended by beings around them. Such abilities earned the Stennes Shifters the alternate name of Force-eaters."}, {"tag": "p", "text": "Environmental pressures shunted the Stennes Shifters along a different developmental path from their baseline cousins; their extra capacities to hide and sap Force energy helped the Shifters as both hunters and prey in their homeworld's ecosystem. However, such abilities also made the Shifters seem frightening and suspicious to both the mainline Stennes and to outsiders. Thus, the Shifters constantly found themselves persecuted, hunted, and—when discovered—killed. As offworlders took to eradicating the Shifters—including the Jedi Order in one particularly bloody conflict circa 5000 BBY—the planet became pocked with artillery craters in attacks that killed Stennes Shifters and standard Stennes alike. The Stennes turned on their Shifter kin, forcing them to flee their own homeworld or to use their natural powers to escape detection and assimilate into society. Over time, the Shifter population fell; by the days of the Galactic Empire, they were numbered at no more than several million, and the Shifters were regarded as little more than legend by many in the galaxy. Coupled with their indistinguishable appearance from mainline Stennes, such anonymity allowed some Shifters to blend into galactic society. Those who capitalized on their powers of misperception found work in fringe occupations, such as thieves, spies, or informants."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Stennes Shifters were a species of sentient, mammalian Near-Humans native to the planet of Stennaros. They were closely related to the Stennes species, from whom they evolved. Like standard Stennes, Shifters were generally quite thin, with a humanoid body of two arms, two legs, a torso, and a head in the same general proportions as a Human. Their hands featured five digits apiece, each capped by a fingernail. Shifters stood between 1.3 and 1.7 meters tall."}, {"tag": "p", "text": "The Shifter visage was composed of two eyes, a nose, a mouth, and rounded ears on the sides of the head. Members of the species had no noticeable lips, and their black eyes were recessed into the skull and rimmed by dark circles. Coupled with their pale, gray skin, their features made Shifters appear to outsiders like morose ghosts with skull-like faces. In at least some Shifters, yellowish blotches and dark, purplish veins marbled the rough skin."}, {"tag": "p", "text": "Although their physiology gave no indication of special abilities, Stennes Shifters possessed a form of telepathy that allowed them to cloud the perceptions of others and thus allow the Shifter to go unnoticed. Those familiar with the ability often mistook it for shape-shifting, but it altered only the observer's perceptions, not the Shifter's physical form. The power only worked in situations when multiple entities were present; a Shifter could not pass unnoticed without a crowd in the area, and the ability was most potent in crowds of 100 beings or more. Members of the Hutt species and artificial optic devices, such as cameras and droid photoreceptors, could not be fooled by the Shifters' power."}, {"tag": "p", "text": "Scientists speculated that the Stennes Shifter's mind-clouding was a manifestation of the Force, and, indeed, all Shifters were Force-sensitive. Rumors made them \"Force vampires,\" able to sap others of the Force energy that flowed through them. Such stories had some basis in fact, as Shifters indeed could gain power from Force-users around them. However, the faculty only allowed a Shifter to absorb expended Force energy, that channeled within the vicinity of a Stennes Shifter. The Shifter then could absorb the exuded energy for his or her own use—but not tap into unused Force potential. Those conscious of a Shifter's attempt to absorb such Force power could willfully resist the Shifter's absorption. These abilities earned the Shifters an alternate name: Force-eaters."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Within the confines of their home star system, Stennes Shifters exhibited the same affable nature and cultural advancement as baseline Stennes. However, they suffered from two layers of persecution. For one, non-Stennes distrusted the Shifters, fearful of their capabilities to pass unnoticed and to sap away the strength of others. Such prejudices were mostly unwarranted; while some Shifters did live as hunters and killers, such persecution forced many others to keep constant watch for aggressors. Secondly, even baseline Stennes turned against the Shifters in their species' history, attempting to eradicate the Shifters from the population of their mutual homeworld, Stennaros. Thus most Shifters lived inconspicuous lives, attempting to escape undue attention by laying low, pretending to be regular Stennes, and using their natural gifts of camouflage. Shifters could wear standard humanoid clothing, such as shirts, trousers, boots, and belts. Some members of the species received cybernetic implants. Shifters could wield standard weapons, such as blasters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Stennes Shifters evolved on the planet of Stennaros, separating from the mainline Stennes during the ancient history of the Galactic Republic. Unlike their baseline counterparts, the Shifters evolved their capacity to alter the perceptions of others as a technique both to evade predators on their homeworld and to obtain prey of their own."}, {"tag": "p", "text": "As the Stennes sector was colonized from afar and new settlers spread throughout it, prejudices against the Shifters spread. Outsiders took to hunting Shifters for sport or from fear. Stennaros itself became the target of pogroms to wipe out the Shifters, and violent campaigns left its surface pocked with craters from artillery strikes. In one incident, approximately 5,000 years before the Battle of Yavin, the Shifters faced the Jedi Order in a conflict, which convinced the Jedi that the Shifters were a dangerous threat. Prejudices against the Shifters ran so deep that mainline Stennes suffered as well. Eventually, the non-Shifter Stennes turned on their kin. The Stennes adopted xenophobic programs to detect Shifters in the general population and then eradicate them. Thousands of persecuted Shifters considered themselves to have lost a homeworld."}, {"tag": "p", "text": "By the time of the Galactic Civil War, Stennaros had fallen within the bounds of the Har Worlds sector of the Expansion Region, but the Stennes Shifters nearly had been wiped out. Records of the species' early history were lost over the millennia so that, by the time of the Galactic Empire, the remaining data was difficult to understand. Imperial estimates suggested that as few as a thousand Shifters—and no more than several million—remained in the galaxy. Nevertheless, Imperial interest in the Shifters remained; the Imperial Liaison Officer of Sentientology Studies, Major Vontenn, ordered the Human sentientologist Obo Rin to research the Stennes Shifters and add an entry on them to the scientist's work-in-progress, the Catalog of Intelligent Life in the Galaxy."}, {"tag": "h2", "text": "Stennes Shifters in the galaxy"}, {"tag": "p", "text": "Although some Stennes Shifters attempted to pass as baseline Stennes on their home planet, other Shifters took the attitude that they had no homeworld of which to speak. Instead, these Shifters immigrated to other worlds, where they used their natural talents in careers as informants, spies, and thieves. Nevertheless, Shifters at large had to keep on their guard, since Humans and other species considered them untrustworthy at best, deadly at worst. While most non-Stennes dismissed the Shifters as legends with no basis in fact, those who encountered the so-called Force vampires reacted with occasional intrigue but, more often, terror."}, {"tag": "p", "text": "Trinto Duaba was a Stennes Shifter active during the Galactic Civil War. He enjoyed disappearing into crowds and observing others—without himself being observed. Duaba wore a hooded cloak to mask his features, and he sported cybernetic implants in his temples. He earned his living by identifying anyone wanted by the Galactic Empire and then informing the police or bringing the wanted person in himself. Duaba was present at Chalmun's Spaceport Cantina on the planet Tatooine in 0 BBY when the Human Jedi Master Obi-Wan Kenobi hired the services of the Human smuggler Han Solo and and his Wookiee first mate, Chewbacca. He patronized the cantina again later that year when the Empire declared a curfew on the planet. Duaba was forthright about his species with at least one individual: he talked at length with the Shi'ido Senior Anthropologist Vandolae about the Stennes Shifters. The information later reached the Imperial sentientologist Obo Rin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Special effects artist Rick Baker designed what would eventually become the Stennes Shifters as a Halloween mask. With its monstrous appearance and electrical terminals on its temples, Baker intended for the mask to represent Frankenstein's monster. When director George Lucas hired Baker to create creatures for use during additional photography for Star Wars: Episode IV A New Hope in Los Angeles, he and his team created several new alien masks to populate closeup shots for the Mos Eisley cantina sequence of the film. Baker added his Halloween mask in an effort to fill out the roster. The character went by the name \"Terminal Man\" during the film's production, both due to the terminally-ill look and the electric terminals on his head. Other nicknames included \"Veiny\" and \"Future Man.\" One of the other Los Angeles-based special effects artists made a copy of the Terminal Man mask, and added a mustache and hair for use as another cantina extra. The characters' scenes were shot on January 24 and 25, 1977. One of these two masks was reused for the cantina scene in the 1978 telefilm The Star Wars Holiday Special."}, {"tag": "p", "text": "In 1995, the game company Decipher, Inc., provided the first official name for the hairless Terminal Man on a card for their Star Wars Customizable Card Game. The company dubbed him Trinto Duaba and made him a Stennes Shifter. Decipher's use of the word Stennes was a misspelling, but it has since been accepted into canon. The card's lore was the first indication of the Shifters' Force-absorption ability. Author Pablo Hidalgo expanded on Decipher's work to provide the first detailed background information on Stennes Shifters in his article \"Shape-shifters,\" which was published in the Star Wars Adventure Journal 12 in 1997. The article provides rules to use Shifters in West End Games' Star Wars roleplaying game; while they are average in most respects, they can use game mechanics to absorb Force points expended by those around them. Finally, the toy company Hasbro released an action figure of Trinto Duaba in 2008, pairing him with Dice Ibegon, another cantina character from A New Hope. Hasbro's toy was the first source to show a Shifter's full body."}, {"tag": "p", "text": "The mustachioed version of Terminal Man went unnamed in official Star Wars lore for years until Tom Spina, an artist with extensive experience repairing and duplicating props used in the Star Wars films, made a replica of the mask as a prize for an attendee of 2012's Celebration VI fan convention. In a nod to the winner, Brandon Connors, the character was dubbed Braconnor Bakiska. Because Bakiska and the Holiday Special character only appear on screen briefly, the films do not make clear whether they are standard Stennes or Stennes Shifters. However, the article \"The Star Wars Holiday Special Cantina: Who's Who,\" by Tim Veekhoven and Kevin Beentjes, identifies the Holiday Special character as Duaba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}