{"url": "Stenax", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Enslaved species", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Stenax"}, {"tag": "p", "text": "The Stenax were a fierce, ill-tempered, brooding, and violent race from the planet of Stenos. They fanatically followed the dictates of their god, Vol. They were responsible for the Stenax Massacres, which killed countless millions. Despite their violence, the Stenax remained a very spiritual people."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Stenax homeworld, Stenos, was once known as Maldont and was part of Xim's empire. Stenaxes were among the empire's enslaved species. Stenos was a planet of pinnacles and plateaus, where the winged Stenax built most of their structures. Several hundred years before the Battle of Yavin, a series of earthquakes and volcanic disturbances shook the planet. One quake buried the stone idol believed by the Stenax to be the worldly avatar of their god, Vol, and the Stenax refused to fly until the idol was found."}, {"tag": "p", "text": "The Stenos capital city later became a crowded haven for criminals from various worlds. The Stenax lived among these people but all but ignored them. Shortly after the Battle of Yavin, the Vol statue was uncovered by Rebels, including Luke Skywalker. Rik Duel tricked them into finding it, only to reveal he had done so to hand it over to the planet's Imperial governor, Quorl Matrin. The Stenax, willing to fly again once Vol had been uncovered, believed Matrin had stolen the idol and attacked and killed the governor and his stormtroopers. For the next few years, the Stenax returned to flying to and from the old high structures of the planet, and virtually ignored any offworlders. Though, many Stenax did emigrate to a number of other planets, especially in the Gordian Reach."}, {"tag": "p", "text": "Ten months after the Battle of Endor, the native Stenax population massacred the Imperials garrisoned on Stenos, as well as all non-Stenaxes in what was only the beginning of what would be called the Stenax Massacres. On many planets throughout the Gordian Reach and beyond, the Stenaxes brutally killed non-Stenaxes and Imperials in a series of surprise attacks. The New Republic finally brought an end to the massacres and placed monitoring posts in orbit around Stenos to prevent any future campaigns by the Stenax."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The reptilian Stenaxes were considered a fearsome sight. Two to two and a half meters tall and thickly muscled, they had gargoyle-like faces and a row of bony spikes running across their shoulders. Three sharp claws punctuated each foot and five each hand, with additional spikes lining the backs of their calf muscles. Stenaxes had scaly, purple-gray skin and white eyes with minuscule pupils. Their ears and brows were up-swept at several angles, due to thick muscular cords lining their facial features. Two such cords hung down far below the mouth like stalactites. Completely hairless, they had a wide, spine-shaped protrusion running over the head, from their eyes to the top of their neck. This protrusion housed their Kleti gland, which allowed them to home in on objects on the ground when flying at extreme heights."}, {"tag": "p", "text": "Few offworlders know the details of their biology. However, according to hieroglyphs found in the ruins of the abandoned city of Farruz, they could live as long as 270 standard years, remaining in good health until 220. Whether such longevity was a result of their physiology or some other influence is a source of debate, for few winged species came close to such a lifespan."}, {"tag": "p", "text": "Stenax were known to occasionally visit Zeltros."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Stenax were created by Mary Jo Duffy, Kerry Gammill, and Tom Palmer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}