{"url": "Stend_IV", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Jungle planets", "Category:Juris sector planets"], "nodes": [{"tag": "h1", "text": "Stend IV"}, {"tag": "p", "text": "Stend IV was an Outer Rim planet that lay in the Juris sector. Located on the Five Veils Route hyperlane, it was a tropical world with both jungles and oceans on the surface. The Gran inhabitants of the planet Malastare settled Stend IV decades before the Galactic Civil War in an attempt to locate new sources of energy."}, {"tag": "p", "text": "Shortly after the Trade Federation invasion of the planet Naboo, Stend IV, which was also home to Elomin colonists, was targeted by the eco-terrorist group known as the Army of Life, which conspired with the Humanocentrist group called the Knights of the Core. Their plan was to smuggle eggs of clodhoppers, omnivorous creatures native to Naboo and infamous for causing the devastation of whole planetary ecosystems, to Stend IV."}, {"tag": "p", "text": "The Army of Life hired a group of individuals that transported the clodhopper eggs to a settlement on the Gran colony world. Despite an attack by a Jedi Guardian; a few Gran militiamen; and another, government-recruited group of individuals, the terrorist affiliates succeeded in releasing the clodhoppers into the environment of Stend IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Stend IV was a remote planet located within the Stend system, a part of the Outer Rim Territories' Juris sector. The planet occupied the fourth orbital position around its star and lay on the hyperlane known as the Five Veils Route, which connected it to the Ninzam and Vergesso systems."}, {"tag": "p", "text": "Stend IV had at least one continent on its surface, as well as several clear, blue oceans. Land was dominated by lush, green jungle. The climate was tropical, with white clouds in the atmosphere obscuring much of the planet's surface when viewed from space. The exact composition of Stend IV's atmosphere was different enough from the air on Naboo or aboard the freighter Majestic Gundark to render the use of chemically-bonded locks practical."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Decades before the Galactic Civil War, Stend IV was settled by Gran colonists from the fellow colony world of Malastare. The settlement was an attempt by Malastare to find new sources of energy for exploitation; that goal had not been reached, however, by the time of the Galactic Civil War. The Gran colonies, which also included Hok, Koensayr, and Silunes, were at first considered to be prestigious by the wider galaxy, but they eventually fell out of favor with the Gran homeworld of Kinyen due to rampant vice and violence on the colony worlds."}, {"tag": "p", "text": "Shortly after the Trade Federation invasion of the planet Naboo ended in 32 BBY, the eco-terrorist group known as the Army of Life formulated a plan to attack the settlers of Stend IV for political gain. To that end, the Army of Life, which had anti-technology goals and preached acts of violence against settlements on various worlds, conspired with the Knights of the Core, a Humanocentric terrorist group that wanted to target a continent on Stend IV inhabited by Gran and Elomin colonists."}, {"tag": "p", "text": "The Army of Life took advantage of the recently established peace between Naboo's Human and Gungan populations to steal 400 clodhopper eggs. An omnivorous pest native to Naboo and infamous for destroying whole planetary ecosystems due to a voracious appetite and rapid rate of reproduction, clodhoppers were even known to consume sentient inhabitants of the worlds they infested."}, {"tag": "p", "text": "The Army of Life subsequently hired a group of individuals to pilot the freighter Majestic Gundark with two cargo containers aboard from Naboo to Stend IV. The group was to deliver the \"bio-material\"—which, unbeknownst to the group, was the clodhopper eggs—inside the containers to the largest settlement on Stend IV and release it into the environment. The freighter successfully traveled to Stend IV, albeit pursued by a government-tasked group of individuals on a mission to stop the terrorist plot."}, {"tag": "p", "text": "By that time, the Jedi Order had also learned of the theft of the clodhoppers and thus dispatched the relatively inexperienced Gran Jedi Guardian Dree-Tekes to Stend IV in order to prevent the terrorist plan from succeeding. Just as the freighter carrying the clodhoppers landed outside the settlement of Gev-Toosa, Dree-Tekes led a small group of local Gran settlers she had armed in an attack on the transport. Although the government-recruited group also attacked the terrorist affiliates, the latter prevailed in the intense skirmish and successfully released the clodhopper eggs into the environment."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "By the time the Invasion of Naboo was repelled, Gran settlers had colonized Stend IV. The colony world was at a low level of technology and did not maintain a planetary defensive shield. The only military presence on the planet was a rag-tag colonial militia, with only four Gran members actually having military experience, albeit limited. One continent on Stend IV's surface was also home to Elomin colonists."}, {"tag": "p", "text": "During the clodhopper threat on Stend IV, the Gran Jedi Dree-Tekes gave the four Gran militiamen who had prior military experience primitive weapons, including blaster rifles, an antiquated heavy blaster cannon, and a grenade launcher. The militiamen fought zealously under the leadership of the Jedi to prevent the endangerment of their world, but in the end their adversaries were successful in releasing the clodhoppers into the planet's environment."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "There were only a few isolated settlements on Stend IV, of which the only one large enough to be considered a town was Gev-Toosa. Consisting of artificially constructed structures of refined metals, Gev-Toosa served as the planet's capital. It did not have a spaceport, instead relying on an automated signal that instructed new arrivals to land outside Gev-Toosa and walk to the settlement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Stend IV was first mentioned in Secrets of Naboo, a Star Wars Roleplaying Game sourcebook written by Steve Miller and J.D. Wiker, and published by Wizards of the Coast on February 8, 2001. The book mentioned the planet in an adventure seed named \"The Defoliation Agenda.\" The 2009 reference book The Essential Atlas placed the Stend system, and therefore Stend IV, in grid square P-17."}, {"tag": "p", "text": "In \"The Defoliation Agenda,\" which, like the rest of Secrets of Naboo, is set during the Trade Federation blockade of Naboo, the player-characters are called upon by a government official to stop a plan by the Knights of the Core terrorist group to release a cargo infested with clodhoppers on Stend IV. The characters confront the terrorists at a Naboo spaceport and pursue their freighter to Stend IV, where they have to convince the Elomin officials of the local starport of the impending threat. After being given permission to search the starport and impound the infested cargo containers, the characters face the terrorists and have to defeat them, as well as track down and stop a lone speeder that manages to leave the port with the dangerous cargo."}, {"tag": "p", "text": "The adventure seed also presented an alternate plot line in which the player-characters were, in fact, the group of individuals affiliated with the Knights of the Core. In this variation, the characters have to smuggle the clodhoppers off Naboo and onto Stend IV, thwarting the efforts of opposing parties on both planets."}, {"tag": "p", "text": "The first proper appearance of Stend IV was in \"Operation: Clodhopper,\" a Secrets of Naboo tie-in mini-adventure published on Wizards.com two weeks after the sourcebook. \"Operation: Clodhopper\" was an expanded and slightly modified version of the alternate variant of \"The Defoliation Agenda.\" This article assumes that as many events as possible of both \"Operation: Clodhopper\" and the original version of the Secrets of Naboo adventure seed play out as described, merging the plot lines of the two scenarios. Wherever contradictions arise, the online mini-adventure is assumed to take precedence due to its status as a more recent and fleshed-out source."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}