{"url": "Stenos/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Empire planets", "Category:Spadja sector planets", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Stenos"}, {"tag": "p", "text": "Stenos was a planet located in the Spadja sector of the Outer Rim Territories. It was homeworld of the Stenax race."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Stenos was originally named Maldont while it was a part of Xim's Empire, when the Stenax were enslaved by the despot. Stenos was a world of pinnacles and plateaus, where the winged Stenax built most of their structures. Several hundred years before the Battle of Yavin, a series of earthquakes and volcanic disturbances shook the planet. One quake buried the stone idol believed by the Stenax to be the worldly avatar of their god, Vol, and the Stenax refused to fly until the idol was found. Many of their ancient buildings became ruins due to centuries of neglect, including the city of Farruz. The Stenos capital city later became a crowded haven for criminals from various worlds."}, {"tag": "p", "text": "During the reign of the Galactic Empire, former Senator Quorl Matrin was appointed Imperial Governor of Stenos, but was killed by the Stenax for sacrilege once the idol of Vol was recovered, thanks to the Heroes of Yavin and Rik Duel's gang. When Duel made the Stenax believe Matrin had stolen the idol, the governor and many stormtroopers were killed by a swarm of Stenaxes. The Stenax again took to the air, and mostly ignored the non-Stenax population of the planet. Years later, Luke Skywalker, Lando Calrissian and Chewbacca met Duel's gang on Stenos and ran afoul of bounty hunters while searching for Han Solo."}, {"tag": "p", "text": "In 4 ABY, Barquin D'an built up an import/export business on the planet after leaving the Max Rebo Band. In that same era, former criminal Barpotomous Drebble became the benevolent leader of a large section of the planet's capital city. Ten months after the Battle of Endor, the native Stenax population massacred the Imperial garrison occupying Stenos, as well as all non-Stenaxes in what was only the beginning of the Stenax Massacres."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars 79, Lando Calrissian refers to this planet as Stenax, the name of its native species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}