{"url": "Sterling", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles to be expanded", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Sterling"}, {"tag": "p", "text": "\"Sterling\" was the nickname of a clone trooper of a division within the 501st Legion who took part in the Siege of Mandalore. During the siege, Sterling and his unit traveled to reinforce C-deck in the Undercity of Sundari but were ambushed by the renegade Sith Lord Maul. During the ambush, Sterling was wounded by a blaster hit to the torso, and his unit sustained heavy casualties. Sterling reported to Ahsoka Tano about the ambush and that Advanced Recon Commando CT-5597 \"Jesse\" had been taken hostage."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the final days of the Clone Wars, Sterling's division invaded the planet Mandalore under the leadership of the newly appointed Clone Commander CT-7567 \"Rex\"  alongside former Jedi Padawan Ahsoka Tano, who acted as an advisor. Sterling was among the clone troopers who successfully arrived at the capital city of Sundari, where he also participated in and survived the opening skirmishes."}, {"tag": "p", "text": "Sometime later, Sterling's unit was sent with Advanced Recon Commando Clone Lieutenant CT-5597 \"Jesse\" to reinforce C-deck in Sundari's Undercity, but were ambushed by renegade Sith Lord Maul, who brutally cut through the Republic forces. Sterling was wounded by a blaster shot to his chest, though he survived, unlike most of this unit, which sustained heavy casualties. Sterling also witnessed Maul capturing Jesse after determining through use of a Force mind probe that he was older than the rest of the unit."}, {"tag": "p", "text": "Shortly after, Ahsoka Tano was informed of Maul's attack and quickly made her way to the site of the skirmish alongside Commander Rex. Upon seeing her, Sterling, who sat against the wall in pain from his injuries, summoned Tano to him, respectfully addressing her as Commander despite her lack of military rank. He explained to her what had occurred, recounting Maul's ferocity and his abduction of Jesse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sterling appeared in \"The Phantom Apprentice\", the tenth episode of  Star Wars: The Clone Wars' seventh and final season, voiced by Dee Bradley Baker like all other clones in the episode. The episode streamed on April 24, 2020 on Disney+."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}