{"url": "Steven_Spielberg", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Star Wars production staff"], "nodes": [{"tag": "h1", "text": "Steven Spielberg"}, {"tag": "p", "text": "Steven Allan Spielberg KBE (born on December 18, 1946 in Cincinnati, Ohio) is an American film director and producer."}, {"tag": "p", "text": "In 1980, Spielberg directed Raiders of the Lost Ark (1981), which Lucas executive produced. The pair went on to work together to produce and create the stories for Indiana Jones and the Temple of Doom (1984), Indiana Jones and the Last Crusade (1989) and Indiana Jones and the Kingdom of the Crystal Skull (2008)."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Steven Spielberg and George Lucas met in 1967 and have maintained a social and professional relationship ever since. It was Spielberg who introduced Lucas to John Williams, who would go on to create the musical score for many of their films."}, {"tag": "p", "text": "Rumors persist that Spielberg was Lucas' first choice to direct Return of the Jedi, but was unable to do so due to Lucas' departure from the Directors Guild of America."}, {"tag": "p", "text": "During the animatic stage of of Revenge of the Sith, Lucas invited Spielberg to \"play with\" a bit of the Mustafar duel, and Yoda's duel with the Emperor, along with a couple of others,\" according to The Making of Star Wars Revenge of the Sith. According to the Star Wars Blu-ray release, Spielberg oversaw the animatic of an extended chase scene between Grievous and Obi-Wan on Utapau."}, {"tag": "p", "text": "Being friends for years, Spielberg and Lucas have often traded references to each other's previous works in their films. For example, Indiana Jones is seen fleeing a nightclub named \"Club Obi-Wan\" in Indiana Jones and the Temple of Doom.  In Spielberg's film E. T.: The Extra-Terrestrial, Elliot showed some action figures, including Lando Calrissian, to the alien of the film's title; later, E.T. met a child dressed as Yoda on the street during Halloween. In The Phantom Menace, several members of E.T.'s species were visible in one of the floating pods in the Senate room, and Senator Grebleips was named for Spielberg. Steven Spielberg made more films like E.T. the Extra-Terrestrial, Jurassic Park, Jaws, and The Adventures of Tintin."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}