{"url": "Sti_Groon", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Individuals of unidentified species", "Category:Information brokers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sti Groon"}, {"tag": "p", "text": "Sti Groon was a male of unknown species from the planet Dandrian. He was known as the foremost newsmonger of the galaxy on his home planet due to the fact that nothing went on in Lon Drasna without him knowing. Groon was rather lanky and sly looking, with a frog-like appearance complete with bulging eyes and green, wrinkled skin. He talked with a strong lisp and enjoyed all types of games, often betting on the illicit swoop races that occurred in Lon Drasna. Though he had no love for the Galactic Empire, he also did not want to side with the Rebellion and referred to it as a \"goody-goody organissssation\"."}, {"tag": "p", "text": "When a group of Rebels came to the planet Dandrian looking for Admiral Joser, they soon discovered that the only person who knew his location was Groon. The group managed to learn the directions to Groon's formex residence from an Imperial Gamorrean informant whom they captured after a swoop chase. When they arrived, Groon was sitting atop a pile of cushions in the back of a large, sparesely furnished room. He informed them that he was more than happy to tell them where Joser was being kept if they handed him 5,000 credits; after all, this was his job."}, {"tag": "p", "text": "He also let them know that, if they did not have the money, he would be willing to partake in one of two contests. The first was a simple game of vrax where one member of the group would simply have to win in a total of five rounds. The second contest he suggested was simply a fight to the death between one member of the group and his champion, which he failed to inform them was a Bonecrusher. The Rebel would be able to choose between a mace, spear, gaderffii, knife, axe, or sword to defeat the champion, but would not be able to use his or her own weapon."}, {"tag": "p", "text": "After he informed them that Joser was being held in the Alpha-Omega Prison in Dandrian's Ring, the group immediately left to rescue him."}, {"tag": "h2", "text": "Sources"}]}