{"url": "Stiltwalker", "categories": ["Category:Legends articles", "Category:Amphibians", "Category:Force-sensitive creatures", "Category:Insectivorous creatures", "Category:Species of undefined sentience", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Stiltwalker"}, {"tag": "p", "text": "Stiltwalkers were quadrupedal amphibious insectivores that inhabited the swamps of a large number of the galaxy's planets."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The stiltwalker was an amphibious creature with four long legs, standing at fifteen centimeters tall. Their lower bodies resembled a gnarled, four-fingered hand with talon-like nails, while the top half was given over to a pointed face and tail. It was believed that the entire galactic stiltwalker population was descended from a single genetic source, rather than being the product of parallel development, although their true origin point remained unknown."}, {"tag": "p", "text": "Females of the species were originally thought to be a different species entirely, as they had slender, boneless tentacles in place of the male's gnarled, claw-tipped legs. Further, females could breathe water, and spent most of their lives lying at the bottom of shallow, slow-moving streams, feeding by filtering the water through their mouths and capturing food particles with their waving tentacles. As mating season began, the females released brightly-colored inks into the water, which attracted males from the surrounding area. Potential mates would feed the female by regurgitating food into the water above her. Once fattened enough to carry eggs, the female released a second color of ink into the water, signaling the time for fertilization."}, {"tag": "p", "text": "Male stiltwalkers endeavored to protect and feed the females, and hunted for prey in their swampy habitats by chasing down insects on their long legs, and capturing them with their sticky tongues. Despite living in moist and semi-aquatic environs, the male was unable to swim, and instead emitted a chirping sound whenever they sensed danger, warning other males to combine their efforts to protect their females. Although unable to physically defend their mates, the males' sensitive eyesight was useful in providing early warnings. Their other sensory organs were simplistic, however, although stiltwalkers exhibited an affinity for the Force, and would congregate around an active Force-sensitive to chirp for anywhere up to ten minutes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Polymerase chain reaction hybridization experiments were undertaken by scientists in an attempt to discover the origin of the stiltwalkers. Although the experiments were able to prove that the species was not the result of parallel evolution, but developed from a single genetic code, galactic population migration theorists were unable to determine the star system in which the stiltwalkers first developed."}, {"tag": "p", "text": "Because of the male's keen danger sense and ability to warn others by chirping, some male stiltwalkers were either tricked or trained into serving as guardian creatures. These stiltwalkers were able to provide early warnings of danger, even if they were unable to physically defend anything."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}