{"url": "Stinger_Mantis", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Stinger Mantis"}, {"tag": "p", "text": "The Stinger Mantis, commonly known as the Mantis, was an S-161 \"Stinger\" XL luxury yacht piloted by Greez Dritus. Dritus transported the former Jedi Cere Junda and Cal Kestis on the vessel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ship had three separate sections of its outside exterior. The front and back were segmented by a rotating section that housed the main outrigger engine and large vertical fin. Inside, there were six separate parts of the interior. These were the cockpit, holotable room, galley, common area, main corridor, and engine room. While lightly armed, there were two laser cannons above the main cockpit."}, {"tag": "p", "text": "Starting at the cockpit, the floor was partly built with glass, and along with raised cockpit seats, created a large area of view for the pilot. Two seats acted as the pilot and co-pilot with a third seat to the right that acted as the comm station."}, {"tag": "p", "text": "Behind the cockpit was a holotable room. The table was positioned in the center, surrounded by a semi-circular sofa upholstered with Potolli-weave fabric. Behind this were the two boarding ramps found on either side of the ship, depending on its orientation upon landing."}, {"tag": "p", "text": "Further back, located in the common area, was a large seating area. Surrounding the seating arrangements were various decorative terrariums. Beside this was a set of stairs that led to a raised galley. Situated in the galley was a table aside various shelves of food storage, along another large terrarium. Through the opening in the back was the main corridor with three separate doors, that all led to the other various rooms inside the ship."}, {"tag": "p", "text": "Beyond this corridor was the engine room. It featured two levels that were connected by a ladder found in the left side. The upper level contained railing, diagnostic controls, and a workbench, as well as the quarters in which Cal Kestis slept. The hyperdrive was located behind the workbench. Accessed via the ladder, the lower level contained two escape pods and a darkly lit corridor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Stinger Mantis first appeared in the 2019 video game Star Wars Jedi: Fallen Order, developed by Respawn Entertainment. The ship's cockpit was made to feel like the characters aboard were surrounded by the environments they were visiting, and so the windows were made to be all around the room. Old submarines were used as inspiration as well as some elements from A New Hope to convey the feeling of heavy machinery and claustrophobic conditions. Concept art for the Stinger Mantis was done by artists Jean-Francois Rey, Wesley Griffith, and Prog Wang. Design support for the Mantis was provided by Doug Chiang and Ryan Church of the Lucasfilm Art Department."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}