{"url": "Battle_of_Anaxes_(21_BBY)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Azure sector", "Category:Battles of the Foerost campaign"], "nodes": [{"tag": "h1", "text": "Battle of Anaxes  (21 BBY)"}, {"tag": "p", "text": "The Battle of Anaxes of 20.1 BBY was the final confrontation between the Confederacy of Independent Systems' Bulwark Fleet and the Galactic Republic's Victory Fleet during the Clone Wars. After launching the Bulwark Fleet from the Foerost Shipyards, Confederate Admiral Dua Ningo initiated an intense campaign against the Core Worlds, coming close to seizing Coruscant itself. The Victory Fleet's commanders, Captains Jan Dodonna and Terrinald Screed, hunted down Ningo and engaged his Bulwark Mark I battlecruisers in a deciding clash over the planet Anaxes. Although Screed outmaneuvered and vaporized Ningo's flagship, killing the Separatist admiral, Screed's assault cost him damage to his own command ship, resulting in near-mortal injuries that forced him to undergo cybernetic reconstruction. Nevertheless, he and Dodonna both received the Holt Cross for their victorious actions over Anaxes."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the year 20.1 BBY (15:4), twenty-three months into the Clone Wars, the Confederacy of Independent Systems unveiled its new Bulwark Fleet of Bulwark Mark I battlecruisers. Confederate Navy Admiral Dua Ningo oversaw the fleet's breakout from the Foerost Shipyards and proceeded to obliterate Galactic Republic outposts throughout the Core Worlds, threatening the galactic capital of Coruscant itself. In response, two Republic officers—Captains Terrinald Screed and Jan Dodonna—were granted command of the latest addition to the Republic Navy: the Victory Fleet of Victory I-class Star Destroyers, designed by Rendili StarDrive engineer Walex Blissex."}, {"tag": "p", "text": "Screed and Dodonna chased Ningo away from Coruscant and pursued him throughout the Core Worlds. The Victory and Bulwark Fleets clashed at Ixtlar, Alsakan, and Basilisk before a deciding standoff ensued at the fortress world of Anaxes, home to the Republic Navy War College."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Victory Fleet engaged in a deception: Dodonna arrived first at Anaxes with his task force of Star Destroyers and assaulted Ningo's Bulwark cruisers in the upper atmosphere. Screed, meanwhile, sat a mere hyperspace jump away aboard his command ship, the Arlionne, waiting for the right moment to join the battle. Commanding the Bulwark Fleet from his flagship, the Unrepentant, Ningo decimated Dodonna's warships, plunging dead wreck after dead wreck toward the surface below. Despite the carnage, Dodonna held out against Ningo's ships long enough for Screed to execute his sneak attack. Emerging from hyperspace aboard the Arlionne, Screed maneuvered his Star Destroyer into position and ambushed the Unrepentant at point-blank range. His swift salvo of broadside cannonades annihilated Ningo's flagship, killing the Confederate admiral. However, the ensuing explosion of the Unrepentant tore into the Arlionne, ripping open its bridge and severely wounding Screed. Nevertheless, Ningo's death allowed Screed and Dodonna to emerge victorious over the late admiral's Bulwark Fleet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Screed needed cybernetic implants to survive his near-mortal injuries, but he began to recover and—within three weeks of the Battle of Anaxes, as it came to be known—laboriously returned to Anaxes to receive the Holt Cross medal alongside Dodonna, in recognition of their defeat of the Bulwark Fleet. Screed and Dodonna were lauded as heroes of the Republic, and both men continued their careers in the Republic Navy. Screed was thereafter appointed as the commander of the Coruscant Home Fleet, in part to grant him further recovery time to heal from his wounds."}, {"tag": "p", "text": "In 36 ABY, Galactic Alliance historian Voren Na'al included the Battle of Anaxes in his compendium of galactic history."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Anaxes was created by author Daniel Wallace for The New Essential Chronology, a book published in 2005 that also served as an in-universe narrative written by Voren Na'al. Among the research that he did for the book, Wallace drew upon the concept of the Victory I-class Star Destroyer from the 1979 novel Han Solo's Revenge, using the Battle of Anaxes and the surrounding events to chronicle the Star Destroyer's formal in-universe introduction. The battle has since been referenced and expanded by other authors, including Jason Fry, who co-authored 2012's The Essential Guide to Warfare and detailed the battle's events in a profile for Terrinald Screed."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}