{"url": "Stohl", "categories": ["Category:Legends articles", "Category:Creatures of the Mid Rim", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Species of undefined sentience", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Stohl"}, {"tag": "p", "text": "Stohls were furred, serpentine luxury pets from the planet of Ichtor 8. The rich wrapped themselves with live stohl, and they could be trained to bite their masters' assailants. They were naturally poisonous, but domesticated stohls had their poison removed."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "In its natural habitat, the stohl was a hideaway, living in crevasses and feeding on small rodent-like smarls. Its natural curiosity led the stohl from its den when new and interesting beings approached. Stohls averaged about a meter to a meter and a half in length; they traveled through the snow by undulating on their lightly-furred bellies. Their heavier top coats protected them from cold weather. Despite their propensity for thin caves and fissures, stohls did not dig their tunnels themselves; their pointed fangs were made for biting, not burrowing. They fed on small warm-blooded creatures when available, and attacked larger prey when their normal food was scarce. It is possible that settlers in some places disturbed or killed the stohls' natural prey, forcing the creatures to attack the settlers themselves. Stohls fed in the wild by injecting a virulent poison through their fangs, then feasting. Some small animals were too tiny even to bite; these were swallowed whole and digested later."}, {"tag": "p", "text": "Trained stohls often had their poison sacs removed; wearing a poisonous stohl was not only illegal, but stupid as well. An attack-trained stohl hissed loudly when its mistress was threatened, then uncoiled and reared up; beings who did not get the hint were then bitten repeatedly until either the target fled or the owner called a halt. Some especially vicious trainers taught their pets to wrap around a target, biting until he either fell unconscious or died. Stohls encountered in the wilderness rarely entrapped their prey; if a large target resisted, the stohl fled."}, {"tag": "p", "text": "Stohl eyes had transparent layered membranes to protect them against driving snow or crushed ice; they allowed the animals to see with relative clarity even in their dim burrows, magnifying whatever light was present. Their fangs were sharp and strong, with a small poison reservoir running down the inside of each large fang. The heavy mane of fur behind the creature's head allowed it to push through loose snow, while the more sparsely-furred body followed. The lower jaw hung on a drop-hinge, and the gullet expanded when necessary, allowing the stohl to swallow and digest large bits of meat. An effective digestive system broke down all components of the stohl's meal, fusing all indigestible bones and skin into a large ball, to be choked up later. Seasoned stohl-hunters could detect their quarry's lair by the lumps found outside or around the fissure; they could even tell how old the stohl may be and when it last fed."}, {"tag": "p", "text": "Training a captured stohl was a long process but not especially difficult. Unless the stohl had been abused in some way, it quickly bonded with whoever fed it by hand. Such bonds were hard to transfer, though a skilled trainer could do so. Stohls often enjoyed playing with shiny objects (much to their owners' amusement). Stohls purred contentedly when happy or well-fed and spit when annoyed. Their fur was luxuriously soft, and was prized by some black-market buyers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to accounts dating from the planet's first settling, dozens of stohls emerged from hiding to examine the settlers' crafts and dwellings. The creatures' initial reaction to spacefaring visitors was friendly; numerous accounts described stohls wrapping themselves around an explorer's arm and purring, or driving away the plague-ridden illorts (now be- lieved extinct) that threatened the first colonies with a contagious virus."}, {"tag": "p", "text": "Shantee Ren, a famous holovid star owned a specially-trained attack stohl named Needla, which bit an overzealous fan during an autograph session. The media portrayed the attack as an assault. Shantee responded that the attack stohl had been trained to protect her. The result of the media coverage was that attack stohls were hunted for fun and sport, until Shantee Ree launched a campaign to save the species. With a tremendous publicity push and numerous personal appearances, Shantee won the support of animal activists, politicians and fans and the stohl was saved from extinction. Following Shantee's iead, many celebrities demanded stohls of their own. The market for live stohls - and stohl trainers boomed. Within less than a standard year, stohl killing went from common to criminal. However, within five years, stohls learned to fear Human contact and stohls became hard to find."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}