{"url": "Stokhli_spray_stick", "categories": ["Category:Legends articles", "Category:Cultural weapons", "Category:Projectile rifles", "Category:Stun weaponry"], "nodes": [{"tag": "h1", "text": "Stokhli spray stick"}, {"tag": "p", "text": "Stokhli spray sticks, also known as simply stokhli sticks, were nonlethal ranged weapons used to stun and capture living beings. They were developed by the Stokhli nomads of the planet Manress."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Originally created by the nomadic Stokhli species on the planet Manress, Stokhli spray sticks served as effective long-range stun weapons, and were first employed for big game hunting. These weapons had enough power to knock out large animals like gundarks, making them very popular among big-game hunters."}, {"tag": "p", "text": "The sticks operated by shooting a mist to an optimum range of 100 meters and a maximum range of up to 200 meters. A thumb trigger adjusted the range finder to set how quickly the net formed, a dial set the width of the net, and a control button could alter the intensity of the stun charge. As the net wrapped around its target, it delivered a stun charge. The strength of the net combined with the powerful electrical stun were generally able to completely immobilize a person or an animal."}, {"tag": "p", "text": "Resembling a meter-long metal tube with a nozzle at one end, the sticks were usually fitted with stun pads to deliver additional shocks if the subject remained conscious. This allowed the weapon to be used as a close-range melee weapon as well. When fired, the weapon emitted a hissing sound, and the net sprayer caused significant recoil. The spraymist solution was resistant to most solvents, and it even exhibited considerable resistance to lightsabers since it continuously re-formed until hitting its target. For all its advantages however, the weapon was ineffective against Yuuzhan Vong as they were immune to the spray stick's stunning mist."}, {"tag": "p", "text": "Each stick weighted only four kilograms and held ten spraymist cartridges, with each cartridge producing 500 meters of netting. However, despite their effectiveness, they were rarely found off Manress since the spraymist solution was manufactured only by the Stokhli people, and the cost was considerably high at 14,000 credits per weapon. Despite this, most galactic governments (including the Galactic Empire and the New Republic) were able to procure these less-than-lethal weapons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Users of the Stokhli spray stick included bounty hunters like Boba Fett (who took his from a Stokhli nomad he encountered on Tatooine), and some security organizations like CorSec which used them to apprehend criminals."}, {"tag": "p", "text": "Gardulla the Hutt provided Stokhli spray sticks, nicknamed 'goo guns', to the professional Dug podracer Sebulba and his henchmen (the Sakiyan bounty hunter Djas Puhr, together with the hulking mercenaries Khiss, a Dug, and Gondry, an Abyssin cyclops), preparatory to their pursuit of unknown juvenile thieves: Anakin Skywalker, his rescuer-friends, and the beautifully fragile creatures they rescued, the Ghostling children. The chase ran its course through the Hutt's notoriously dangerous pleasure garden within her Tatooine palace. The garden was filled with all manner of exotic (and mostly predatory) flora and fauna—in truth, it was a savage jungle. The Bothan boy Dorn was grazed by the stun-fire of a spray stick shot by the Sakiyan slave tracker, while Khiss the mercenary spray-stick blasted a huge swamp slug back into the waters whence it surfaced to devour him. A hapless worrt was next blasted by the Sakiyan and set to snoring."}, {"tag": "p", "text": "During the Galactic Civil War, Imperial security agents occasionally used Stokhli stun sprays to capture criminals and Rebel Alliance agents."}, {"tag": "p", "text": "During the Thrawn campaign in 9 ABY, Noghri Death Commandos under Grand Admiral Thrawn used Stokhli spray sticks in a kidnapping attempt against Luke Skywalker and Leia Organa Solo on the planet Bimmisaari. However, the Noghri attack failed."}, {"tag": "p", "text": "Emperor's Hand Mara Jade once used a Stokhli spray stick as a tool, rather than a weapon, to create a bridge to reach an outside window on the twentieth floor of Moff Glovstoak's palace. The spray mist solidified enough for her to climb, and eventually evaporated to leave no trace of her private pathway."}, {"tag": "p", "text": "When the New Republic became the dominant galactic government, security officers used them to guard high-security prisoners. By 26 ABY, during the Yuuzhan Vong War, a short-range version of the Stokhli spray stick was available which was almost small enough to be concealed. However, the Yuuzhan Vong were found to be immune to the stunning power of either type of Stokhli spray stick."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}