{"url": "Stinger", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Black Sun spacecraft", "Category:Captured starships", "Category:Conqueror-class assault ships", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Stinger"}, {"tag": "p", "text": "The Stinger was a Surronian assault ship given to Prince Xizor of the Black Sun crime syndicate in exchange for his assistance to the hive craft guild that created it. Although basically a Conqueror-class assault ship, the vessel was uniquely customized by its creators. By the Clone Wars, the ship had come into the hands of Galactic Republic Admiral Tarnese Bleyd, but Xizor reacquired it after his death. Xizor eventually presented it to his bodyguard, the Human replica droid Guri, who had it redesigned to meet her needs, radically overhauling the ship's systems. Among the systems upgraded by Guri were the hyperdrive and weapons, making the ship both fast and deadly. It continued to serve as her personal transport even after the death of Xizor in 3 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ship that became known as the Stinger, like all Surronian vessels, was an individual creation. Though it fit into the general category of Conqueror-class assault ships, it was designed according to the tastes of the hive craft guild that created it, and featured a number of unusual extras that set it aside from similar ships. Even so, when the vessel came into the possession of the Human replica droid Guri, she was not satisfied with its performance and began to overhaul its systems, heavily modifying it to meet her exacting standards. The resulting vessel was fast, tough and truly unique. Although not available for sale, the ship was worth 150,000 credits used."}, {"tag": "p", "text": "The ship was roughly twenty-eight meters long, with a curved hull that had an almost sculpted appearance. It comprised fore and aft sections linked by a slender \"neck.\" The fore section housed the cockpit while the main cargo hold, reactor core and engines were located in the larger aft section to the rear of the neck. Retractable landing skids were located on the underside of the ship, under both the fore and aft sections. A retractable entry ramp under the neck allowed access to the ship, while a separate hatch provided access to the cargo hold. A further hatch, located on top of the vessel, allowed access to the main reactor core, while the core's exhaust valves were located at the rear of the vessel."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "The Stinger was powered by eight Surronian ion engines mounted around the rear section—two dorsal and two ventral A2-grade ion engines, along with two port and two starboard A2.50-grade ion engines. Together, these engines combined to produce a sublight speed greater than that of the T-65 X-wing starfighter and only slightly below that of the TIE Interceptor, then the fastest starfighter in the Imperial arsenal. Under atmospheric conditions, the Stinger was capable of reaching speeds of up to 1,150 kilometers per hour."}, {"tag": "p", "text": "Though the sublight engines were considered satisfactory by Guri and left largely untouched during her redesign, the droid had the original Class 1 Corellian Engineering Corporation H1.5 hyperdrive replaced with a modified Class 1 CRC H2-1 hyperdrive for even quicker hyperspace travel. In addition to the new hyperdrive, the ship also had a Class 10 backup hyperdrive in case the primary drive failed."}, {"tag": "p", "text": "The ship was already agile, but Guri had new systems installed to take advantage of the ability to adjust the engine exhaust nozzles. By allowing the pilot to individually adjust the nozzles using the onboard computer system, Guri eliminated the need for maneuvering jets and further increased the maneuverability of the ship. Guri also installed a set of four emergency braking jets at the front of the rear section to provide the ship with an advantage in firefights. Guri utilized the braking thrusters in a variety of combat maneuvers, such as causing the ship to stop suddenly while being pursued, often leading the pursuing ship to overshoot its target, leaving it vulnerable to the Stinger's weapon systems."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "The ship's weapons were also upgraded during Guri's redesign. Its most obvious weapons were a pair of fire-linked ion cannons and a double laser cannon turret. The ion cannons, which were part of the ship's original armament, were mounted to either side of the cockpit and could be used to disable targets for capture. The laser turret was mounted to the top of the rear section and allowed the pilot to use lethal force when required. While the ion cannons faced directly in front of the ship, the turret provided a greater arc of fire and could be controlled from a dedicated gunnery position or, using a redundant fire-control link, could be operated from the cockpit, albeit at reduced accuracy. Though it did not initially appear imposing, this was merely a deception, and the turret's power rating was equivalent to a double heavy-laser cannon. In an atmosphere, the ion cannons had an effective range of 3.6 kilometers, while the laser turret operated at a range of 2.5 kilometers."}, {"tag": "p", "text": "However, the ship's most dangerous weapon was less obvious. The Stinger carried a large arsenal of proton torpedoes, which could be fired backwards at unsuspecting pursuing craft. Furthermore, the torpedoes could be deployed as a spray to maximize the chances of hitting the target. The ship's shield generators were also enhanced to improve their performance."}, {"tag": "h3", "text": "Other systems"}, {"tag": "p", "text": "When Guri took possession of the Stinger, the droid decided that the crew quarters and cargo area took up an excessive amount of space aboard ship. She had the crew quarters removed completely, while much of the cargo hold was filled with new systems and controls, overflowing from the engineering crawl space located behind it, including shield generator capacitors, reactor core control systems and reserve drive modules. The remaining cargo space was limited to twenty-five metric tons—small by light freighter standards—and the ship could carry consumables for no more than a month. Though the ship was occasionally modified to provide basic accommodation for up to two passengers, there was little room for comfort, with only a small refresher unit and little in the way of food supplies. The forward compartment contained the cockpit, which had adequate seating for any passengers in addition to the pilot. A small emergency escape pod located at the rear of the cockpit, however, had room for only the pilot to vacate the vessel in the event of its destruction."}, {"tag": "p", "text": "Many of Guri's modifications were not apparent from outside the ship. Her droid reflexes allowed her to operate the ship without a crew, but she utilized an advanced MicroThrust Processors computer system to automatically monitor internal systems, redirecting power or activating reserve systems in the event of a major overload. This allowed her to focus on piloting and combat duties. The ship's computer could also be set to autopilot, allowing it to automatically adjust its vector to follow an incoming descent course for docking, and at least partially controlled using a remote control device. Other modifications included an upgraded communications package to better monitor comm channels, and an efficient sensor cluster, located in the fore section, to provide the pilot with data on the ship's surroundings. Guri also fitted security mechanisms, such as linking an auto-destruct system from the cockpit to the power core, which would be triggered in the event that somebody attempted to steal the vessel."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Surronian vessels were generally reserved for young Surronians as they prepared to join one of their world's craft guilds—only in exceptional cases were they presented to non-Surronians. Prince Xizor, who would become leader of the Black Sun crime syndicate, became one of the few such non-Surronians to possess a Surronian ship, awarded to him by a hive craft guild in gratitude for a favor the Dark Prince had performed."}, {"tag": "p", "text": "At some point prior to 20 BBY, the ship was being used in some pirate activity when it was captured by Galactic Republic forces. News of the ship reached Republic Admiral Tarnese Bleyd, who bargained to have it assigned as his personal transport. Bleyd used the vessel whenever he left his command ship, the medical ship MedStar Nineteen, bound for ground stations on the planet Drongar, finding it faster than other transports available. During the Clone Wars, Bleyd and the Hutt Filba struck a deal with Black Sun to provide the syndicate with bota supplies from Drongar. When Bleyd attempted to double-cross Black Sun, he was murdered by their operative Kaird."}, {"tag": "p", "text": "The ship fell into Black Sun's hands once more as Kaird stole the vessel following Bleyd's death, using it as his personal transport. By the time it came into Kaird's possession, it had acquired the name Stinger. Shortly after the Declaration of a New Order saw the Republic reborn as the Galactic Empire, Kaird became involved in a contest with Xizor for a vacant position as one of Black Sun's vigos. Seeing Xizor as a potential threat, Underlord Dal Perhi preferred Kaird for the position and instructed him to follow Xizor on a mission to Coruscant's Yaam Sector, where he was to assassinate the Dark Prince. Kaird took the Stinger to the Eastport landing field and set out to locate Xizor. However, when he finally attacked Xizor, his rival emerged victorious, taking the Nediji assassin captive. Xizor decided to take Kaird to his facility in Coruscant's Factory District to have him brainwashed to kill Perhi. However, with the unexpected arrival of a group led by Jedi Knight Jax Pavan, Xizor was forced to flee the facility aboard the Stinger."}, {"tag": "h3", "text": "Service to Guri"}, {"tag": "p", "text": "Xizor kept the ship stored in his hangar for several years until he acquired the assassin droid Guri to serve as his lieutenant and bodyguard. Deciding that a unique droid required a unique ship, Xizor gave Guri the Surronian vessel to serve as her personal transport. Guri, however, felt that the ship wasted space on amenities designed for an organic crew, along with unnecessary storage space. Xizor granted the droid permission to redesign it to suit her needs and Guri, aided by Black Sun's skilled outlaw techs, began upgrading the vessel to improve its performance."}, {"tag": "p", "text": "The redesigned ship's lack of comforts, coupled with its deadly firepower, made it an ideal choice for the Human replica droid. Guri used the vessel whenever she was off Coruscant, with it serving as both a transport and her mobile base of operations, from which she could command Black Sun's forces around the galaxy. She was also known to use the ship to smuggle precious cargo for the Falleen crime lord. Over time the ship came to be feared by criminals from Coruscant to the Outer Rim worlds."}, {"tag": "p", "text": "Guri used the Stinger while performing many missions for the Dark Prince, including journeying to Gelgelar to kill the Ubese bounty hunter Boushh after he attempted to charge Black Sun more than specified on a contract. She would later keep the bounty hunter's armor stored in a locker aboard the ship. In 3 ABY, Guri took the Stinger to Rodia to rendezvous with Leia Organa, who was seeking Black Sun's assistance in uncovering who was responsible for a recent attempt on Luke Skywalker's life. Guri hid the ship in a small clearing in the rain forest, before proceeding to the Next Chance casino for the meeting. She later used the ship to return to Coruscant, taking Organa and her Wookiee companion Chewbacca there to meet with her master."}, {"tag": "p", "text": "Shortly afterwards, Xizor was killed and his palace destroyed after he was revealed to be the threat to Skywalker. However, both Guri and the Stinger survived. By 4 ABY, Guri had decided to locate her creator, Massad Thrumble, in an effort to purge her assassination programming. To this end, she took the Stinger to Hurd's Moon, the last known location of the reclusive scientist. En route, the Stinger was confronted by an Imperial-class Star Destroyer and Guri was ordered to shut down the ship's engines. Guri, however, decided to flee and, when the Star Destroyer pursued, launched a spray of proton torpedoes from her rear launchers. The unsuspecting Imperials were surprised by the sudden show of firepower from the civilian vessel and the Star Destroyer was destroyed."}, {"tag": "p", "text": "Guri eventually arrived at Hurd's Moon, where Thrumble agreed to help if she retrieved his droid Doc, who had been stolen by the scientist Spinda Caveel. Guri proceeded in the Stinger to Caveel's base on Murninkam. As she entered orbit, Guri came under attack from three droid-controlled picket starfighters. The Stinger's firepower allowed her to eliminate the threat, but the ship was damaged in the fight and crashed into the Kajiin Swamp on the world below. Though the Stinger sank into the swamp, Guri was able to get out and proceed with her mission. She eventually returned after freeing Doc and utilized her remote control to raise the ship from the swamp. However, as Guri and Doc prepared to leave, the bounty hunter Kar Yang, who had followed Guri in an attempt to take her back to Xizor's niece, Savan, was able to place a homing beacon aboard the ship. Yang followed the Stinger back to Hurd's Moon, but was eventually killed by Guri, who was successfully reprogrammed by Thrumble."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "h3", "text": "Tarnese Bleyd"}, {"tag": "p", "text": "Tarnese Bleyd was a Sakiyan whose clan was ruined after his pride-father Tarnese Lyanne was double-crossed in a deal with the Black Sun vigo Shiltu the Hutt. He left Sakiya to find employment with the Galactic Republic and eventually became an admiral in the Republic Navy, commanding the medical ship MedStar. Bleyd considered his assignment a waste of his talents and decided to make a profit out of his position by working with the Hutt Filba to supply bota to Black Sun. When the Black Sun agent Mathal informed Bleyd that Black Sun wanted a larger supply, Bleyd murdered him, only to subsequently killed by Kaird, another Black Sun operative. Bleyd acquired the Stinger after specifically requesting it as his personal transport, following its seizure by Republic forces. Though it was an unusual ship for a Republic admiral, Bleyd found its speed advantageous and was pleased to have a ship that looked as good as it performed."}, {"tag": "h3", "text": "Kaird"}, {"tag": "p", "text": "Kaird was a Nediji who joined Black Sun after being banished from his flock and leaving his homeworld of Nedij. Kaird originally worked as an assassin for the crime syndicate but, after his assassination of Tarnese Bleyd, became a candidate for vigo in just over a year. However, Kaird simply wanted to retire to his homeworld. Knowing that nobody could simply leave Black Sun, Kaird hoped that, by becoming a vigo, he could make enough powerful allies within the organization to be allowed to leave. This brought him into conflict with Prince Xizor, who also sought the only vacant vigo position. The two sparred for some time before Xizor managed to capture him. Xizor planned to brainwash Kaird and turn him against Underlord Dal Perhi, but Kaird was freed by the intervention of a group led by Jax Pavan. Rather than return to Black Sun, Kaird decided to finally go back to Nedij. Kaird stole the Stinger from Bleyd after killing the admiral. The ship was one of his most prized possessions and he hated relinquishing control, even for automated docking. He lost the ship to Xizor, after the Dark Prince captured him. Kaird considered the loss of the ship to be among the worst indignities he suffered at Xizor's hands."}, {"tag": "h3", "text": "Xizor"}, {"tag": "p", "text": "Xizor was a Falleen, the only son of King Haxim and groomed to succeed his father as a provincial ruler on their homeworld. Instead, Xizor chose to leave his world and traveled the galaxy, establishing Xizor Transport Systems and becoming part of Black Sun. Xizor rose rapidly through the ranks of the organization, securing his place as its undisputed leader by 7 BBY. However, the death of most of his family on Darth Vader's orders, during an attempt to contain an out of control bioweapon, led him to develop a hatred for the Dark Lord of the Sith. When Xizor learned that Luke Skywalker was Vader's son, he decided to kill the young Rebel. Xizor's plan backfired and his palace on Coruscant was ultimately destroyed by the Rebels, while Xizor himself perished soon after when Vader learned of his treachery. Xizor received the Stinger in payment for his assistance to a Surronian hive craft guild and appreciated its sculpted shape. The ship spent many years stored in his hangar, largely forgotten, until he presented it to Guri. Following Guri's redesign, Xizor christened the ship the Stinger."}, {"tag": "h3", "text": "Guri"}, {"tag": "p", "text": "Guri was a Human replica droid created by the researchers Simonelle and Massad Thrumble to serve as an assassin droid. After being sold to Prince Xizor, she served as his lieutenant and chief enforcer until his death caused her to set out on a personal quest to locate Thrumble and get him to purge her assassin programming so she could start a new life, though Xizor's niece, Savan, attempted to stop her and to ensure the droid's continuing service to Black Sun. Guri was eventually able to defeat Savan and was successfully reprogrammed. Throughout her existence, Guri made use of the Stinger as her personal starship. It was Guri who was responsible for a major upgrade of the vessel, customizing it to meet her needs. However, Guri never developed an attachment to the ship, which she saw as only a piece of equipment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Stinger was created as part of the 1996 Shadows of the Empire multimedia project and first appeared in Steve Perry's Shadows of the Empire novel, followed shortly by the comic adaptation. Perry used the ship once more in the Shadows of the Empire: Evolution comic series. Kilian Plunkett produced early concept art of the Stinger for Shadows of the Empire, showing its size in comparison to a T-65 X-wing starfighter. An informational pack of drawings and descriptions for all new ships in the project, including the Stinger, was also produced by Sue Rostoni. In it, the Stinger's size was stated as similar to that of the Millennium Falcon."}, {"tag": "p", "text": "The Official Star Wars Fact File 139 incorrectly states that the Stinger was destroyed along with Xizor's Palace in Shadows of the Empire, even though it includes images of the ship taken from Shadows of the Empire: Evolution, which is set after the palace's destruction."}, {"tag": "p", "text": "The Shadows of the Empire Sourcebook established that the Stinger was given to Xizor in return for a favor performed for its creators, a fact that was later repeated by the Rebellion Era Sourcebook. Perry and Michael Reaves included a Conqueror-class assault ship in the Clone Wars novel MedStar I: Battle Surgeons and, though it was not named in the book, Reaves confirmed on the Jedi Council Forums that it was the same ship seen in Shadows of the Empire. MedStar depicts the ship in the ownership of Tarnese Bleyd, after being confiscated from a pirate. Since it was known to have been created for Xizor, this article assumes that the pirate had an affiliation to Black Sun, and that the ship eventually returned to Xizor's possession after Bleyd's death."}, {"tag": "p", "text": "The details of how Xizor finally took possession of the ship were revealed in Reaves's 2008 novel, Coruscant Nights I: Jedi Twilight. Although The Official Star Wars Fact File 137 stated that Xizor gave the ship the name Stinger only after Guri's redesign, Jedi Twilight calls it by that name while still in the possession of Kaird. As the most recent source, this version of events is used in this article."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}