{"url": "Stone_Prison", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Prisons"], "nodes": [{"tag": "h1", "text": "Stone Prison"}, {"tag": "p", "text": "The Stone Prison was a secret prison located deep underground beneath the Royal Manse on the planet Doan. It contained a several levels and a maze of corridors, making it nearly impossible to escape. It also had a control room from which a self-destruct order could be initiated, which then would detonate a series of explosives in a way that would collapse the entire prison. A code known only to the royal family could start the detonation sequence."}, {"tag": "p", "text": "By the time following the New Sith Wars, the Doan Royal Family had discontinued its use. However, Prince Gerran knew the code for the prison's self-destruction, and shared it with his wife, Princess Serra. Following the assassination of Gerran and the resulting massacre of several mining caste leaders and Jedi Knight Medd Tandar, Serra traveled to the Jedi Temple on Coruscant, where she learned that her father, Caleb, had been killed ten years previously by a Sith Lord. Mistakenly believing the Sith Lord to be Darth Bane, she hired the Huntress to capture Bane."}, {"tag": "p", "text": "Serra then secretly reopened the Stone Prison and put Bane inside, where she kept him incapacitated and tortured him through the use of various injections. She interrogated him there, but he insisted that he did not kill Caleb. Serra's bodyguard, Lucia—who had served under Bane as a member of the Gloom Walkers during the New Sith Wars—was shocked by Serra's vengefulness. Remembering the many times that Bane had saved the lives of the Gloom Walkers during the war, she decided to repay Bane by freeing him. However, after escaping, Bane began to hunt down Serra, with the intent of killing her. Lucia confronted him, but Bane's apprentice, Darth Zannah, arrived in the prison and attacked them, instantly killing Lucia."}, {"tag": "p", "text": "As Zannah and Bane engaged in a duel for the title of Dark Lord of the Sith, Serra found her dead friend and realized that her vengeance had been a mistake. The Princess finally decided to collapse the prison in an attempt to kill the two Sith. She then fled Doan, knowing that the prison's collapse would be felt in the Royal Manse. However, Bane, Zannah, and the Huntress all escaped before the prison's collapse, and the Huntress—taking the name Darth Cognus—submitted herself to Bane's teachings. In the Stalker, Cognus' shuttle, the two Sith tracked Serra to Ambria, where Cognus killed the Princess."}, {"tag": "h2", "text": "Appearances"}]}