{"url": "Stormtrooper_armor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Galactic Empire", "Category:Imperial Department of Military Research products", "Category:Stormtrooper armor", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Stormtrooper armor"}, {"tag": "p", "text": "Stormtrooper armor was the standard armor worn by the Imperial stormtrooper. A white plastoid composite worn over a black body glove, the armor represented some of the best in the Empire and was dreaded by rebel freedom fighters."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Developed by the Imperial Department of Military Research, stormtrooper armor was the standard issue armor of the Imperial Army's Stormtrooper Corps, and was manufactured on planets such as Gilvaanen. It was introduced sometime after the conclusion of the Clone Wars, and was intended to replace the Phase II clone trooper armor. It was made up of 18 individual, overlapping plastoid composite plates and synth-leather boots which allowed for mobility, while also dispersing energy, protecting the wearer from glancing blaster bolts. A reinforced alloy plate ridge assisted the user's upper thigh, and a sniper position knee protector plate over a wearer's left knee helped improve accuracy when crouching. While most armor was fitted for humans, other forms were manufactured to fit other body types. A soft click would inform the wearer of whether or not they had correctly attached the armor."}, {"tag": "p", "text": "Its reinforced combat helmet featured an integrated comlink, audio pick-up, two artificial air-supply hoses, and a broadband communications antenna powered by a single power cell. The helmet, affectionately known as \"buckets\" by Imperials but derisively known by that name by rebels, featured built-in filtration systems that extracted breathable atmosphere from polluted environments. The helmet's visual processor assisted the wearer in seeing in darkness, glare, and smoke, though it limited the wearer's field of vision. When firing a blaster, the helmet's visor polarized against the glare. A built-in heads-up display also provided targeting diagnostics, power levels and environmental readings at the corner of the wearer's eyesight, and one could access data on various military subjects and civilian organizations on the helmets display. In addition, motion sensors alerted the wearer to any enemy the soldier might have missed. Seeking to discourage nonessential chatter, which was strictly off-limits while on-duty, stormtrooper helmets recorded everything that was said by the user, sending it to monitors to review after downloading the data off of the armor's memory."}, {"tag": "p", "text": "Stormtrooper armor was capable of protecting its wearer in extreme environments, including deserts, forest, icy wastelands, and limited exposure to the vacuum of space. The armor's torso plating featured environmental controls on its midsection, its black body glove was vacuum-sealed and made of a smart material that could adjust to the wearers body heat and external temperature. Though a rebreather pack was required for extended use in environments that lacked a breathable atmosphere or to filter potent toxins. Troops in the field were allowed additional ammunition and comprehensive survival equipment, with backpacks that could feature field communicator sets, mortar launchers, and blaster components. It was a punishable offense to utilize the armor's internal cooling options in noncritical situations due to its power drain, however many Imperial cadets still attempted to do so. Stormtroopers were also expected to remain in uniform at all times, with the rule considered essential for maintaining the public trust and representing the Empire in a positive, professional manner. By wearing one's armor, one represented the Empire, not the individual."}, {"tag": "p", "text": "Utility belts were equipped with a variety of features including a compact toolkit, power packs, energy rations, and a holster for an E-11 blaster rifle. The belts may have also featured a backup C1 personal comlink, macro binoculars, and a grappling hook. One BlasTech N-20 Baradium-core thermal detonator was given to each trooper, and was placed on the back of their utility belt. The controls to the detonator were not labeled, to prevent enemy troops from using them. While detonators were not usually used within ships or bases, troopers carried a full complement of such field gear to be prepared for any situation."}, {"tag": "p", "text": "Higher ranks were signified with a color coded pauldron worn over the right shoulder. The rank of commander was represented with an orange pauldron, though one soldier who served under the Grand Inquisitor had his colored red. Black identified enlisted soldiers. Several black pauldroned stormtroopers accompanied Grand Moff Wilhuff Tarkin to the planet Lothal, and later came aboard his flagship, the Sovereign, to serve as reinforcements when it was infiltrated by a band of rebels. White pauldrons represented the rank of sergeant. Blue pauldrons were used to identify stormtrooper snipers."}, {"tag": "p", "text": "Despite small aesthetic variations in stormtrooper armor during the Age of the Empire, the changes were not large enough to denote a new phase of armor like the previous Galactic Republic's phase I clone trooper armor and phase II clone trooper armor. As a result, Imperial armor changes were largely due to production purposes."}, {"tag": "h2", "text": "Additions to the suit"}, {"tag": "p", "text": "Many different pieces of armor and cloth could be added on to the standard stormtrooper uniform. One such example was the wet-weather gear stormtrooper, that wore wet-weather capes and an additional armor plate on the forehead. Sandtroopers, magma troopers, and many other environmental variants carried backpacks, ammo packs, pauldrons, E-11 holsters, on top of regular stormtrooper armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}