{"url": "Stormtrooper_Corps", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Empire stubs", "Category:Incomplete lists", "Category:Imperial Army branches", "Category:Stormtrooper units", "Category:Stormtroopers"], "nodes": [{"tag": "h1", "text": "Stormtrooper Corps"}, {"tag": "p", "text": "The Stormtrooper Corps, also referred to as the Trooper Corps, was an independent military branch operating under the Imperial Army of the Galactic Empire. The Corps was best known for its near limitless supply of obedient stormtroopers trained at Imperial academies across the galaxy, as well as its near fanatical devotion to Galactic Emperor Darth Sidious. Regarded as the Empire's chief enforcers, the Corps served to remind the civilian populace of the Empire's military supremacy."}, {"tag": "p", "text": "The Stormtrooper Corps could trace its roots to the Grand Army of the Republic—clone troopers who fought for the Galactic Republic in the Clone Wars. Although Republic forces were absorbed by the Imperial Military, the original generation was eventually replaced by non-clone human recruits and conscripts. During the Imperial Era, the Corps suppressed Separatist holdouts, occupied worlds, and became embroiled in a galaxy-wide conflict with the Alliance to Restore the Republic."}, {"tag": "p", "text": "In the aftermath of the Galactic Civil War, the training of stormtroopers was prohibited and the Corps was disbanded by the Galactic Concordance, a formal peace treaty between the Empire and the victorious New Republic. However, a new generation of stormtroopers came to exist under the First Order, an Imperial-inspired military junta that recognized neither the treaty nor the Republic's sovereignty."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Inheriting the military forces of the Grand Army of the Republic, the Stormtrooper Corps would possess a large amount of highly trained infantry units to support military excursions against remaining Separatist holdouts. According to what she had been told, Thara Nyende believed the Corps was ultimately founded by a group of clone commandos. Due to the military buildup during the Clone Wars, the Corps continued to rely on Republic-era clone troopers for a few years after the Proclamation of the New Order. Nonetheless, the clone stormtroopers' fighting skills ultimately deteriorated due to their accelerated aging process. In response, the Corps began accepting non-clone recruits into its ranks, with most remaining clones being disbanded four years before the Battle of Yavin."}, {"tag": "p", "text": "During the earlier years of the Galactic Empire, the Imperial army also deployed Imperial Army troopers on many worlds instead of stormtroopers. As the Empire continued, however, the army upgraded as these soldiers were phased out in favor of more stormtroopers. By the time of the Mimban campaign Imperial army soldiers had not been completely phased out and fought alongside stormtroopers, but the army's upgrade to increase stormtroopers had begun."}, {"tag": "p", "text": "During the Galactic Civil War, the Corps underwent an accelerated training process to provide more soldiers at a faster rate in order to suit the Empire's needs. Members of the Stormtrooper Corps would see substantial military action on multiple against the Alliance to Restore the Republic and its successor state, the New Republic. Following the Battle of Jakku in 5 ABY, the defeated remnants of the Empire signed a peace treaty called the Galactic Concordance. One of the terms of the treaty prohibited the mobilization and training of stormtrooper forces."}, {"tag": "p", "text": "The Imperial remnants retreated to the Unknown Regions where they reconstituted themselves as the First Order. In violation of the Galactic Concordance, the First Order rebuilt the former Imperial military including a new generation of stormtroopers. In 34 ABY, these First Order stormtroopers saw action against the New Republic and the Resistance, a paramilitary organization led by General Leia Organa."}, {"tag": "h2", "text": "Training and equipment"}, {"tag": "p", "text": "Although their ranks were numerous and possessed some of the finest weaponry and armor, with much development spearheaded by the Imperial Department of Military Research, stormtroopers were generally less respected as soldiers—at least in comparison to their clone predecessors—by the Empire's adversaries and surviving veterans of the Clone Wars. Captain Rex noted the inferiority of the new stormtrooper ranks, believing poor training and equipment was partly to blame for the Corps' decrease in operational effectiveness. Nevertheless, stormtroopers were trained to be fiercely loyal to Emperor Sheev Palpatine and were reputedly incapable of betraying him. In addition to their allegiance to the Emperor, they loyally followed his apprentice and enforcer, the Sith Lord Darth Vader. According to Imperial records, the Corps never trained a trooper-turned-traitor."}, {"tag": "p", "text": "When they were not in armor, officers of the Stormtrooper Corps wore black dress tunics, caps, and boots. They also carried code cylinders, rank insignia plaques, and officer's disks that were conform to the standards of the Imperial Navy."}, {"tag": "h2", "text": "Organization and structure"}, {"tag": "p", "text": "In the Stormtrooper Corps, one of the smallest units was a squad, which consisted of ten stormtroopers. A platoon was made up of five squads, and a company was made up of four platoons. Higher up, a battalion consisted of four companies, and a regiment had four battalions in it. A legion was made up of four regiments, giving one a total of twelve-thousand eight-hundred stormtroopers."}, {"tag": "p", "text": "To outflank an enemy unit, stormtroopers could be organized in a strategy known as Sigma Four. This tactic was once used by Sergeant TX-828 against the bounty hunters of Captivator's crew."}, {"tag": "h3", "text": "Units"}, {"tag": "h2", "text": "Stormtrooper specializations"}, {"tag": "h3", "text": "Elite and experimental units"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}