{"url": "Battle_of_Anoth_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Battles of the Daala campaign"], "nodes": [{"tag": "h1", "text": "Battle of Anoth  (Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Anoth was a battle that took place on the remote, mountain world of Anoth in 11 ABY between the New Republic and a remnant of the Galactic Empire led by Furgan of Carida. This battle was one of the several Imperial campaigns centered at the capture of the children of Han Solo and Leia Organa Solo, in this case: Anakin Solo, the youngest child."}, {"tag": "h2", "text": "Pre-battle"}, {"tag": "p", "text": "When the New Republic started to squabble amongst itself in the absence of Admiral Gial Ackbar and Chief of State Mon Mothma's leadership, the Imperial Ambassador Furgan of Carida began the second phase of his plan: the capture of the Force-sensitive Anakin Solo."}, {"tag": "p", "text": "About the only Force-sensitive people he was aware of were Luke Skywalker, his students, Leia Organa Solo, and her children. He knew that it would be difficult to influence Skywalker, his students, or Organa Solo, because all of them were adults. So he decided to focus on kidnapping Organa Solo's children, with the bulk of his efforts focused on Anakin Solo, who was still an infant at the time."}, {"tag": "p", "text": "Unlike his siblings, who were living on Coruscant, Anakin was still living on the planet Anoth, under the watchful eye of Organa Solo's childhood friend and aide, Winter. While he didn't know the location of Anoth, Furgan knew what kind of terrain his forces would encounter once the location of the hidden planet was found and a mission was launched to kidnap Anakin Solo. He had the spidery MT-AT developed and manufactured on Carida specifically for Anoth's mountainous terrain."}, {"tag": "p", "text": "When Ackbar left from Coruscant for his watery homeworld of Mon Calamari, Furgan launched his plans into action by making a side trip to the hidden planet. Unknown to Ackbar, Furgan's agent Terpfen had hidden a tracking device aboard Ackbar's ship and upon receiving Anoth's coordinates, relayed them to Ambassador Furgan. Furgan immediately loaded Carida's only capital ship, the Dreadnaught-class heavy cruiser Vendetta with MT-ATs and stormtroopers who had graduated from the Imperial Military Academy. His departure aboard the Dreadnaught was made all the more urgent when Kyp Durron, in command of the Sun Crusher superweapon, and under the influence of the spirit of the long-dead Sith Lord Exar Kun, fired a resonance torpedo into Carida's sun. The Vendetta set course for Anoth and entered hyperspace well before Carida's sun exploded."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Upon the Vendetta's arrival in the orbit of Anoth, Furgan decided that he would personally oversee the kidnapping of Anakin Solo. He descended from orbit inside one of the MT-ATs, alongside a reluctant stormtrooper sergeant who silently suffered Furgan's screams of panic."}, {"tag": "p", "text": "Once on the ground, the eight MT-ATs emerged from their pods, searching for weak spots in the walls of the stronghold with their blaster cannons. They eventually found a pair of heavy blast doors and began making their way towards them. When they began to test the strength of the blast doors, one of the fortress's defense systems—the Foreign Intruder Defense Organism (FIDO)—destroyed four of the MT-ATs before succumbing to the fire of the rest of the spider walkers."}, {"tag": "p", "text": "The threat destroyed, the MT-ATs began a new assault upon the blast doors. A split eventually began to form and one of the MT-ATs used its front claws to rip open what remained of the blast doors. They walked into the indoor chamber. Several minutes and several stormtrooper deaths later, Furgan finally found Anakin Solo under the supervision of a modified TDL nanny droid that protested Furgan's decision to kidnap Anakin. Furgan scoffed at the droid and ordered the stormtrooper that accompanied him to fetch the baby for him. The stormtrooper was then summarily dispatched by the nanny droid's four hidden blaster cannons. Despite the fact that he was only an ambassador, Furgan's reflexes were good enough that he blasted the nanny droid before it could kill him. He then encountered a newly reinstated Ackbar, Organa Solo, and Terpfen, who had been freed from his mental slavery at the hands of Furgan. He held Anakin up in front of him, threatening to snap the baby's neck."}, {"tag": "p", "text": "Furgan eventually collided with a power droid, and then Terpfen himself, whom grabbed Anakin and returned him to Organa Solo. Furgan took this opportunity to make his escape and ran for the entrance where the MT-ATs were still sitting. Terpfen followed close behind, revenge on his mind. Furgan scrambled into one of the waiting MT-ATs and Terpfen took control of another as well. A running gunfight between the two MT-ATs ensued, and eventually turned into a physical fight between the two walkers, eventually ending with Furgan's walker taking a long dive over the cliff. This battle ended the life of Furgan, removing a threat to the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}