{"url": "Stormtrooper_commander/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire ranks", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Stormtrooper commander"}, {"tag": "p", "text": "Stormtrooper commanders were military officers within the Stormtrooper Corps of the Galactic Empire. Although Imperial stormtroopers were regarded as the Empire's best soldiers, the commanders were trained to be far superior to the more common infantry soldier. Their exceptional reputation afforded them more than just command over regular troopers. The elite Shadow Troopers answered to the authority of the commanders as well."}, {"tag": "p", "text": "The commanders were an aesthetic anomaly within the Stormtrooper Corps; the blue markings on their armor separated them from the rest of the plain white-armored soldiers. Hence, the commanders were permitted to follow an old tradition of the Grand Army of the Republic where soldiers distinguished their respective units by color. This tradition was abandoned after the Clone Wars ended with the rise of the Empire."}, {"tag": "p", "text": "By the year 2 BBY, stormtrooper commanders were responsible for enforcing Imperial law and order on the most hostile worlds that hadn't yet been fully subjugated to the will of Emperor Palpatine. As \"descendants\" of the Old Republic's legendary ARC troopers, the commanders were treated as a special forces unit and the most elite warriors in the military. Several stormtrooper commanders were also particularly brutal in enforcing the Empire's will compared to the stormtrooper foot soldiers, a particularly infamous example being the stormtrooper commander Kayn Somos. Yet despite their training and advanced technology, the commanders were ultimately ineffective against powerful Force wielders such as Starkiller, the secret apprentice of the Sith Lord Darth Vader."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The stormtrooper commanders patrolled hostile battlefields, leading Imperial forces into fierce combat on dangerous worlds that resisted the rule of the Galactic Empire. Highly intelligent and resolved to secure victory at any cost, the commanders were among Emperor Palpatine's finest and most elite soldiers. Much like the ARC troopers of the Galactic Republic, the commanders were an elite within the elite; regular stormtroopers were superior to almost every enemy soldier, yet they were ultimately inferior to the specially trained stormtrooper commanders."}, {"tag": "p", "text": "As soldiers of the Empire, the commanders were unquestioningly loyal to Emperor Palpatine and the ideals of his New Order, not unlike the entire Imperial Military that had sworn unconditional allegiance to the galactic sovereign. The most important aspect of the commanders was in their collective role as officers of the elite Shadow Troopers. In this capacity, they wielded the authority to command their forces as they saw fit. Freedom from the restrictive hierarchical system of the Imperial Military enabled the commanders to call in for reinforcements or trigger ambushes without clearance from Imperial High Command."}, {"tag": "p", "text": "In combat, the stormtrooper commanders led by example by fighting alongside their troops on the front lines. Their strategy normally consisted of maintaining a distance between themselves and the enemy. Once they found an opening, they would quickly stun their opponents and then allow them to be overwhelmed by the stealth-concealed shadow troopers. Overall, the commanders' commitment to the Empire was complete to the point that they were prepared to fight under any condition, even when faced with certain death."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Whereas the majority of soldiers within the Stormtrooper Corps were required to conform with Imperial uniformity by wearing stark-white battle armor, the stormtrooper commanders were aesthetically distinguished from their regular comrades by the blue markings that adorned their specialized armor. Although the commanders' protective covering was visually identical to the standard armor issued to all stormtroopers, there were certain differences besides color that separated their gear from those of the rank-and-file trooper."}, {"tag": "p", "text": "The most notable feature in their armor was a built-in shield generator. The shield on the armor of the stormtrooper commanders was capable of withstanding almost any attack, including certain Force-based attacks. As befitting their station, the commanders were armed with deadly handheld blaster cannons, equipped with a powerful stun setting. This was in stark contrast to the ordinary stormtroopers that were armed with E-11 blaster rifles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the year 2 BBY, nearly two decades since the formation of the Galactic Empire, the stormtrooper commanders had established themselves as the best and most skilled soldiers in service to Emperor Palpatine. Although regular stormtroopers were regarded as the backbone of the Imperial Military, the commanders superior training and specialized equipment earned them the right to consider themselves as an elite force within the elite Stormtrooper Corps. By this time, they were stationed on a number of hostile worlds, enforcing the Emperor's will and projecting Imperial power throughout dangerous environments such as Felucia and Raxus Prime—both of which were former Separatist strongholds."}, {"tag": "p", "text": "When the Sith Lord Darth Vader faked the death of his secret apprentice after his treachery was discovered by his master, Palpatine, Starkiller's near-fatal injuries were steadily healed on the Imperial starship Empirical. During the apprentice's recovery, the military personnel on the science vessel, including the stormtrooper commanders, only knew of Starkiller as \"Subject 1138.\" His identity and connection to Vader were a complete mystery to them. In their ignorance, they simply assumed that he was just another one of the Dark Lord's experiments."}, {"tag": "p", "text": "Their ignorance, as well as Vader's lack of concern for his own soldiers, led to the deaths of the commanders and their troops on the Empirical. After fully recovering, Starkiller was ordered by his master to create an alliance of rebels and dissidents, while also maintaining the secrecy of his clandestine mission. In order to conceal the evidence of his apprentice's survival, Vader ordered that the Empirical be destroyed and all of its occupants terminated. In the process of his escape, Starkiller annihilated every Imperial who stood in his path, including a few stormtrooper commanders that were located in the escape pod bay."}, {"tag": "p", "text": "Since the holodroid PROXY launched all of the pods in accordance with Vader's orders, the commanders and their soldiers were unable to escape as the Empirical was set on a course with a nearby sun. They attempted to stun Starkiller so that their shadow troopers could overwhelm and kill him, but ultimately they were no match against the apprentice's greater skills and his exceptional command of the Force. The remaining commanders were located on the bridge where former Captain Juno Eclipse was being held prisoner by a group of Imperial officers. After dispatching the last of the stormtrooper commanders and their comrades, Starkiller rescued Eclipse and escaped from the doomed starship on the Rogue Shadow."}, {"tag": "p", "text": "Starkiller's mission led him into more confrontations with the stormtrooper commanders in locations such as the fallen Jedi Temple on Coruscant, the jungle world of Felucia, the Wookiee homeworld of Kashyyyk and the junk world known as Raxus Prime. Most were killed by Vader's assassin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}