{"url": "Storm_Commando", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Storm Commando units", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Storm Commando"}, {"tag": "p", "text": "Storm Commandos were the special forces of the Galactic Empire's Stormtrooper Corps and trained to deal with extreme combat situations. They were equipped with silver scout trooper armor and carried E-11 blaster rifles. Some Storm Commandos were members of the elite 501st Legion, Darth Vader's personal stormtrooper legion. Storm Commandos could be organized into a company."}, {"tag": "p", "text": "General Weir wore Storm Commando armor. At one point, Colonel Sadao Emtri of the Imperial Security Bureau deployed an Imperial-class Star Destroyer and Storm Commandos during a fake combat tournament in the Nouane sector, actually a trap laid by the Empire to capture suspected Force-sensitives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Storm Commandos first appeared in the new Star Wars canon in Star Wars: Galactic Defense, a tower defense game developed by DeNA Co., Ltd. that was released on October 30, 2014 and shut down on April 28, 2016. They were originally created for Galaxy Guide 5: Return of the Jedi, a 1990 Star Wars Legends supplement written by Michael Stern for Star Wars: The Roleplaying Game."}, {"tag": "p", "text": "In Galactic Defense, Storm Commandos were a type of enemy unit in the \"Light Side\" missions, appearing in original trilogy–themed levels recreating the Battle of Tatooine. In these levels, players utilized defense towers and Rebel forces, such as Honor Guards, to defend against waves of Imperial units; successfully destroying a Storm Commando awarded the player with \"Scrap,\" a point standard used to upgrade or purchase towers. While Galactic Defense was canon, its actual gameplay was not; consequently, the presence of Storm Commandos on Tatooine is considered non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}