{"url": "Stormtrooper_Corps_(First_Order)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Incomplete lists", "Category:First Order army units"], "nodes": [{"tag": "h1", "text": "Stormtrooper Corps  (First Order)"}, {"tag": "p", "text": "The Stormtrooper Corps was a military service branch that operated under the First Order army. Modeled on the original Stormtrooper Corps of the Galactic Empire as well as the Grand Army of the Republic, First Order stormtroopers were the culmination of a military tradition dating back to the Clone Wars when white-armored soldiers represented the future of galactic warfare. High-ranking officers held authority over the Corps, such as General Armitage Hux and Captain Phasma, although the troopers' overall allegiance was to the Supreme Leader of the First Order."}, {"tag": "p", "text": "The Corps was formed and molded by the influence of Commandant Brendol Hux, an Imperial officer who believed that soldiers should be trained from birth like the clone troopers and Jedi Knights who served the Galactic Republic. The First Order conscripted a generation of human children whose obedience was programmed through indoctrination. With their exceptional training and live-fire exercises, First Order stormtroopers surpassed their Imperial precursors both in skill and loyalty. Lacking the Empire's military academies, members of the Corps were trained on the Resurgent-class Star Destroyers of the First Order Navy."}, {"tag": "p", "text": "Although the Corps' existence violated the terms of the Galactic Concordance, the Galactic Senate of the New Republic did not take action against the First Order, which claimed that their stormtroopers were a territorial defense force. In reality, the Corps was trained as an invasion army; the First Order was determined to reclaim the legacy of the Empire by conquering the galaxy. In the wake of the Hosnian Cataclysm of 34 ABY, the First Order moved to take control of the major star systems through military force. Despite facing opposition from the Resistance, the First Order had conquered large swathes of territory, with planets like Kijimi occupied by a garrison of stormtroopers in 35 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Structure"}, {"tag": "h4", "text": "Recruitment and specialized units"}, {"tag": "p", "text": "The Corps was made up of stormtroopers, the armored infantry units of the First Order. The Order mainly recruited stormtroopers by stealing infants away from their families, training them from that young age to create their legions of fanatically loyal and ruthless troopers. Nevertheless, the Order also allowed older citizens to join the corps, even creating a propaganda poster advertising enlistment."}, {"tag": "p", "text": "The corps that they served in was heavily diversified with various specialized troopers to give commanding officers more options when deploying their forces. These specialists included but were not limited to electroprod troopers, troops armed with electroprods; elite stormtroopers, trained to drive elite speeder bikes; and First Order jet troopers, who were trained and equipped for aerial combat."}, {"tag": "p", "text": "First Order stormtrooper executioners were the theatrical personification of First Order justice; it was their duty to publicly execute troopers who were found guilty of treason. Unlike other variant units, the role of an executioner could be given to any standard trooper depending on the day's assignment. Decapitation was their method of execution, which they carried out with a BL-155 Laser ax."}, {"tag": "p", "text": "First Order Raiders were a new class of elite stormtroopers. As highly skilled hunters, their primary objective was to locate and acquire Sith artifacts for Supreme Leader Kylo Ren."}, {"tag": "p", "text": "First Order SCUBA troopers were outfitted to operate in aquatic environments, while First Order stormtrooper gunners were trained to fire vehicle-mounted weapons. Flametroopers were specialized units strategically deployed to flush out entrenched enemies with fire. Megablaster heavy assault troopers were heavy weapons specialists trained to use the FWMB-10 repeating blaster."}, {"tag": "p", "text": "Mountain troopers were trained to operate in mountainous environments like Batuu. Riot control stormtroopers were trained in riot-control tactics and given non-lethal equipment, such as shields and batons for riot situations. Snowtroopers wore specialized armor designed to allow them to serve in arctic environments."}, {"tag": "h4", "text": "Corps structure"}, {"tag": "p", "text": "The Stormtrooper Corps was part of the First Order army, divided into legions of eight-thousand troopers stationed aboard First Order Resurgent-class Star Destroyers, such as the Finalizer and the Steadfast. The 709th Legion was one such unit; its members were personally chosen by Supreme Leader Kylo Ren."}, {"tag": "p", "text": "The Corps was further broken down into divisions and companies. Captain Phasma commanded her own division as did Ren prior to his accession as Supreme Leader. Company 77 was a mutinous unit that deserted the Corps after refusing to execute civilians."}, {"tag": "p", "text": "Other unit levels included the FL group and the FO group; the FN Corps consisted of stormtroopers whose training was personally supervised by Phasma, who regarded them as her finest cadets. The First Order consolidated its rule by establishing military garrisons across the galaxy. Occupation forces were therefore stationed on the Colossus as well as the occupied world of Kijimi."}, {"tag": "p", "text": "The Corps' standard operational unit was a ten-soldier stormtrooper squad, nine regular troopers in addition to a single weapons specialist. The type of specialist depended on their mission profiles. The troops of CS-Squad served under Commander Pyre and Sergeant CS-812."}, {"tag": "h3", "text": "Ranks"}, {"tag": "p", "text": "The Stormtrooper Corps had a system of officers who commanded the rank and file troops. The color of the pauldron that they wore with their armor indicated the officer's military rank. Squad leaders wore white pauldrons, whereas black signified stormtrooper sergeants, and officers such as Lieutenant KM-8713, Captain Bray and Captain Ruthford wore red pauldrons. Exceptions to this rule included CS-812, who, though a sergeant, wore a red-colored pauldron, and Commander Pyre, whose gold armor featured a black pauldron."}, {"tag": "p", "text": "A stormtrooper's advancement in military rank was decided at the discretion of their commanding officer. Captain Phasma gave KM-8713 a battlefield promotion to the rank of lieutenant after the trooper revealed her ambition to become an officer."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The First Order Stormtrooper Corps traced its origins to the Commandant's Cadets, a secret society of Imperial cadets that was formed within the Arkanis Academy by Commandant Brendol Hux. A former junior officer in the Grand Army of the Republic, Hux respected the combat prowess and dedication of clone troopers and Jedi Knights, who fought for the Galactic Republic during the Clone Wars, in contrast to Imperial stormtroopers whose skills he found wanting. Hux sought to reform the Imperial Stormtrooper Corps in order to create an army of super-soldiers comparable to its Republic ancestor. Due to the fact that both the clone army and the Jedi Order trained their members at a young age, Hux conceived the idea of training stormtrooper recruits from birth, believing that a combination of Republic and Imperial training methods would produce excellent soldiers and loyal servants of the Empire. Potential members were identified by their strong performance at the Imperial Academy on Arkanis, and further tested before being admitted into the ranks of the Commandant's Cadets."}, {"tag": "p", "text": "As the Galactic Civil War between the Empire and New Republic drew to a close in 5 ABY, Counselor to the Empire Gallius Rax employed Hux's training methods to turn a group of Jakku orphans into child soldiers. Rax then gave command of this group to Brendol's illegitimate son, Armitage Hux, who shared his father's vision of an army trained from birth. The soldiers, the Huxes, and other Imperial officers were sent to the Unknown Regions where they could build a new Empire under the leadership of Rax, but he was killed by Grand Admiral Rae Sloane, who took his place in the Contingency."}, {"tag": "p", "text": "In the aftermath of the Battle of Jakku, the Empire capitulated through the Galactic Concordance, a peace treaty signed by Grand Vizier Mas Amedda and Chancellor Mon Mothma. The treaty prohibited the mobilization and training of stormtrooper forces, and required the Empire to abandon its network of academies. Although fragments of the Empire remained active in the Outer Rim Territories, most of what remained of the Stormtrooper Corps became mercenaries for renegade warlords. Despite this, a new stormtrooper training program secretly commenced within the First Order by at least 14 ABY."}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Brendol Hux's vision of a Stormtrooper Corps modeled on his training methods was realized through a clandestine operation code-named Project Resurrection. During its early years, the First Order originally consisted of former Imperial personnel such as Gideon Hask. They were gradually supplemented by a new generation of zealous officers and soldiers, including the highly-trained First Order stormtroopers. The First Order scoured the galaxy's outlying star systems, such as the Jinata system, with the help of local contacts like the Jinata Security. They took human infants from their homeworlds to fill the ranks of the First Order army, and raised them to fight in the Supreme Leader's name. Members of this new generation of stormtroopers were programmed from birth for absolute loyalty and obedience, having been indoctrinated with the First Order's core values."}, {"tag": "p", "text": "Rising to the rank of general, Brendol Hux was involved in the First Order's efforts to grow an army through recruitment and conscription. One such mission nearly resulted in his death on Parnassos, a world devastated by nuclear destruction. General Hux's shuttle was shot down by Parnassos' automated defense system around 24 ABY. The general survived the crash and was saved by three stormtroopers who served as his bodyguards. They enlisted the aid of Phasma and her Scyre warriors in their efforts to return to the First Order."}, {"tag": "p", "text": "During their time together, the troopers adopted nicknames—LE-2003 \"Elli,\" PT-2445 \"Pete,\" and HF-0518 \"Huff\"—as their allies found it difficult to remember their alpha-numeric designations. Neither Elli nor Pete survived the ordeal; Phasma scavenged Elli's armor and ultimately accompanied Hux when he returned to the First Order. Impressed by Phasma's skill, he inducted her into the stormtrooper training program and instructed that she be trained by one of his first recruits, CD-0922 Captain \"Cardinal.\""}, {"tag": "p", "text": "Brendol Hux did not live to see his stormtroopers achieve their purpose of conquering the galaxy. With his death the Corps was taken over by Armitage, who continued his father's method of molding children into soldiers. Captain Phasma, by now a high-ranking officer in the First Order military, had gained command over the First Order's legions of stormtroopers, the training of which she personally supervised as head of the Stormtrooper Corps. The result was an army dedicated to serving the First Order and its ruler, Supreme Leader Snoke."}, {"tag": "p", "text": "By 29 ABY, the New Republic was aware of the Corps' existence. The First Order managed to sidestep its treaty obligations by claiming that the Corps was a territorial protection force."}, {"tag": "h3", "text": "Cold War"}, {"tag": "h4", "text": "Invasion of Demir"}, {"tag": "p", "text": "During the Cold War, the Stormtrooper Corps was actively involved in the First Order's conquest of the Unknown Regions. Under the direction of Supreme Leader Snoke, the Corps undertook a major offensive against various hermit kingdoms to seize their worlds and resources, fueling the First Order's rise to power as it expanded through conquest and colonization."}, {"tag": "p", "text": "With an unknown number of powerful war machines and legions of stormtroopers indoctrinated by First Order dogma, the First Order grew increasingly close to its goal of seizing control of the galaxy. By then, the Corps was under the command of Captain Phasma, a ruthless stormtrooper determined to lead the First Order's forces to total victory. During the First Order's attack on Demir, KM-8713 tried to save DB-7197 who was injured while the troopers were fighting against the native Demirians. Phasma ordered KM-8713 to leave the injured trooper to die, but when then used DB-7197 as a shield against an enemy's thermal detonator."}, {"tag": "p", "text": "Phasma reprimanded KM-8713 for trying to save an injured soldier, while also acknowledging her as a competent soldier. Although Phasma disapproved of compassion, believing it was a sign of weakness, she also took note of KM-8713's ambition to join to emulate her captain's leadership style. She gave the trooper a promotion to the rank of lieutenant along with a final warning to guard against her compassionate nature."}, {"tag": "p", "text": "Phasma placed the newly-minted Lieutenant KM-8713 in charge of leading a military strike against the Demirian stronghold that was strategically important to controlling the iron planet of Demir. Determined to prove her worth to her captain, KM-8713 led her forces in a direct attack on the enemy's position, this time ignoring the troopers who were killed or injured around her. Phasma did not participate in the fighting, however, causing KM-8713 to leave the battle moments before the area was bombed by a squadron of TIE/fo space superiority fighters, killing Demirians and stormtroopers alike. Realizing that Phasma intentionally sacrificed her soldiers while saving her own life, KM-8713 tried to execute the captain whom she denounced as a coward and a traitor to the First Order. KM-8713 was killed during the ensuing struggle."}, {"tag": "h4", "text": "Invasion of the Benathy homeworld"}, {"tag": "p", "text": "The Benathy, a warrior species native to the galaxy's Wild Space region, adopted an expansionist policy years after they were defeated by the Galactic Empire. They had exterminated all life on four planets by the time the First Order deployed the Stormtrooper Corps to the Benathy homeworld. The First Order wanted the Benathy to stop their expansion and was willing to use diplomacy to achieve this objective. However, the Stormtrooper Corps stood ready to force the Benathy's capitulation in the event that the negotiations failed. Their mission commander was Kylo Ren, the grandson of the Sith Lord Darth Vader. Knowing about his grandfather's history with the Benathy, Ren saw an opportunity to prove himself by finishing what Vader started—the subjugation of the Benathy race. He selected Captain Ruthford as his advisor due to the Imperial veteran's service under Vader during the Empire's campaign on the Benathy homeworld."}, {"tag": "p", "text": "The Stormtrooper Corps, accompanied by a contingent of ground vehicle walkers, stood by while negotiations commenced between Ren and King Kristoff. Ren found the king noncompliant with his terms; while Ren reminded Kristoff of the Sith Lord who killed one of his predecessors, the Benathy monarch was far less impressed by the young Knight of Ren; and though Vader defeated the Benathy, he did not destroy their deity. Kristoff shrugged off Ren's efforts to influence him by way of the Force and proceeded to mock the former Jedi Padawan, prompting Ruthford to warn the king against testing Ren's temper. Ultimately, the negotiations were short as Kristoff was slain when Kylo Ren's lightsaber ignited through his brain. Ruthford's next recommendation was to order a retreat; nevertheless, he fought beside Ren and his younger troopers as they attacked the Benathy who sought to avenge their king."}, {"tag": "p", "text": "Armed with his crossguard lightsaber, Ren fought beside his troops during the First Order's battle against the Benathy. Together they mirrored Vader and the Imperial soldiers who once battled the Benathy, and as before, a Zillo Beast appeared. It was the same creature that Ruthford first encountered when he served with Ren's grandfather; though Zillo Beasts were impervious to blaster fire, Ren ordered his forces to keep fighting while he devised a strategy to kill the creature. Despite the doubts of Ruthford, who believed the mission was a futile endeavor, Ren managed to infiltrate the beast in order to kill it from within, where it was most vulnerable. After Ren emerged from the Zillo Beast's corpse, the Benathy submitted to the warrior who defeated the creature that they worshipped as their god. Ren gained not only their allegiance, but also Ruthford's respect."}, {"tag": "h4", "text": "A traitor in the ranks"}, {"tag": "p", "text": "The First Order's methodical, systemized military training program produced highly trained stormtroopers; FN-2187 was one such trooper. Although he excelled in training simulations—and was noted for possessing agility, endurance, coordination and accuracy—FN-2187 lacked a sense of absolute commitment to the First Order, which was widespread in the ranks of the Stormtrooper Corps. For a time he managed to hide his doubts about the First Order, maintaining an exemplary record until his first mission. Assigned to a division led by Captain Phasma, FN-2187 and his squadmates accompanied Kylo Ren to the desert world of Jakku, where the dark warrior sought a clue to the location of Jedi Master Luke Skywalker. FN-2187 quickly discovered the reality of war when one of his squadmates, FN-2003, was killed during the raid on Tuanul. Ren personally executed Lor San Tekka, a member of the Church of the Force, and captured Captain Poe Dameron. He then ordered the mass execution of the village's remaining inhabitants, to be carried out by the stormtroopers at Phasma's command. None of FN-2187's combat simulations prepared him for the massacre that ensued, and he was ultimately  disillusioned upon witnessing the First Order's willingness to engage in the wholesale slaughter of unarmed civilians."}, {"tag": "p", "text": "Phasma had been monitoring FN-2187's performance closely, and decided to have the trooper evaluated and ultimately reconditioned upon returning to the Finalizer. However, FN-2187 resolved to abandon his service to the First Order, releasing the imprisoned Resistance pilot in order to steal a TIE/sf space superiority fighter. Despite the sentiment that FN-2187 felt towards his fellow troopers, whom he relied on and sought to protect, he killed many soldiers while attempting to escape from the First Order command ship. The stolen TIE fighter was shot down by the Finalizer's weapon batteries, but FN-2187 managed to survive by parachuting to safety on Jakku. Following the incident, Captain Phasma, General Hux and Kylo Ren sought to understand why one of their own soldiers betrayed the First Order in spite of a lifetime of psychological programming. FN-2187's actions caused Ren to denounce the entire Stormtrooper Corps as an army with the potential to commit treason, and wondered if the Supreme Leader would be better served by cloned soldiers. Hux rejected Ren's accusation that all First Order stormtroopers were compromised."}, {"tag": "h3", "text": "First Order/Resistance War"}, {"tag": "p", "text": "The Cold War ultimately gave way to the outbreak of the First Order/Resistance War, which the young soldiers of the Stormtrooper Corps saw as their moment in galactic history. After the Hosnian Cataclysm of 34 ABY, the stormtroopers abandoned all pretense of functioning as a defense force and fully embraced their true role as an invasion army. The reign of the New Republic was over, and the First Order no longer felt bound to honor the treaties of a defunct government."}, {"tag": "p", "text": "The Stormtrooper Corps and other services helped to establish the First Order as the dominant power in the galaxy, conquering large swathes of territory after the New Republic's collapse, despite facing continued opposition from the Resistance. Having escaped destruction in the Battle of Crait, the Resistance regrouped on Ajan Kloss where they gradually rebuilt their forces. Accordingly, its members fought the Stormtrooper Corps on a number of worlds, including Bracca, Corellia, Batuu, and Horizon Base's planet. Around the same time, Agent Tierny and Commander Pyre led the hunt for the Colossus supertanker fuel depot. In 35 ABY, the Sith Lord Darth Sidious announced his return to the galaxy, leading to a series of events where the Stormtrooper Corps fought the Resistance during the mission to Pasaana and aboard the Steadfast."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "While most stormtroopers were taken from birth and trained, the First Order also used recruits who received the same training as the \"conscripted-from-birth\" soldiers. Whereas the original stormtroopers were trained at Imperial academies, the new generation of  white-armored soldiers received their military instruction on the First Order's Star Destroyers. In addition, the First Order utilized a more standardized and higher quality training program than that of the Empire."}, {"tag": "p", "text": "Stormtrooper conscripts were divided into large classes known as batches. Upon completing their training, stormtroopers were commonly assigned to the same squads as their batchmates. Batch Eight was one such class; its graduates included troopers FN-2187 and 926, both of whom were noted for their marksmanship. KM-8713 and DB-7917 also started basic training together."}, {"tag": "p", "text": "Unlike the Empire, the First Order's training simulations and live-fire exercises emphasized combat improvisation, making their version of the Stormtrooper Corp more dangerous than its Imperial predecessor. Members of the Stormtrooper Corps received training in counter-insurgency, guerrilla warfare, and commando raids. They also received non-tactics related training like combat medicine."}, {"tag": "p", "text": "Captain Phasma sought to instill ruthlessness and total obedience in the stormtroopers under her command. She believed that their loyalty should be to the First Order instead of their comrades, in contrast to Captain Cardinal who fostered camaraderie among his trainees. While the treason committed by FN-2187 caused Kylo Ren to doubt the loyalty of the entire Stormtrooper Corps, General Armitage Hux was adamant that his methods were exceptional due to the emphasis he put on training stormtroopers from birth."}, {"tag": "p", "text": "With the exception of FN-2187, First Order stormtroopers embraced the purpose that they had trained a lifetime to serve—turning chaos into order through military strength. Captain Phasma regarded them as \"patriotic idiots\" and disposable assets for their leaders. Stormtroopers were told by their officers, such as the captains Bray and Phasma, that their lives were expendable."}, {"tag": "p", "text": "Most units in the Corps were identified only by serial numbers, as First Order protocol did not permit stormtroopers to have individual names. This rule did not apply to stormtrooper officers, such as Pyre, Ruthford, and Bray. Phasma kept her own name upon joining the Corps; CD-0922 was named \"Cardinal\" by Brendol Hux, who promoted the once nameless trooper to the rank of captain. KM-8713's desire to be known by a name instead of a designation motivated her to ascend the chain of command."}, {"tag": "h2", "text": "Vehicles and machinery"}, {"tag": "p", "text": "The Stormtrooper Corps' troop transports, the AAL-1971/9.1 Troop Transports, were developed by Sienar-Jaemus Army Systems. Each transport could accommodate two squads, twenty stormtroopers at maximum. To avoid anti-ship fire long enough to deploy its forces, the AAL-1971/9.1 was designed for the precise and rapid deployment of troops from an orbital carrier to a combat site for ground operations. It was guided by a single pilot from the vehicle's elevated cockpit, while a gunner protected the troop transport on its final approach to the drop zone."}, {"tag": "p", "text": "As part of the First Order army, the Stormtrooper Corps was supplemented by military walkers of various types, including the First Order All Terrain Armored Transports and the First Order All Terrain Scout Transports. Additionally, the Corps was supported by the All Terrain Heavy Hauler, the All Terrain MegaCaliber Six, and the All Terrain Mobile Artillery."}, {"tag": "h2", "text": "Weapons and equipment"}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "A subsidiary of BlasTech Industries and Merr-Sonn Munitions, Inc., Sonn-Blas Corporation operated in First Order Space and was responsible for manufacturing the majority of First Order weaponry. The company was founded in response to the Galactic Concordance, effectively circumventing the treaty's restrictions against selling arms to the First Order. Improving on classic designs dating back to the Clone Wars, Sonn-Blas provided the Stormtrooper Corps with state of the art weapons boasting precision manufacture and efficient energy cells, which, in turn, improved their accuracy, ammunition, and operational lifespans."}, {"tag": "p", "text": "The Stormtrooper Corps adopted the Sonn-Blas F-11D blaster rifle as their primary blaster rifle. The F-11D had an adjustable J19 electroscope, a removable stock assembly, a magnatomic adhesion grip with an integrated power feed indicator, a power cell, and a collapsible steadying grip. Additionally, members of the Corps carried the Son-Blas SE-44C blaster pistol as their sidearm. The SE-44C featured a heat dispersing barrel head, an integrated sight and mounting bracket, and a vibrating pulser that activated when the pistol's ammunition was low."}, {"tag": "p", "text": "Various specialists utilized weapons suited to their fields. For instance, a heavy weapons specialist was armed with the Sonn-Blas FWMB-10 repeating blaster, also known as a \"megablaster,\" which included extra ammunition packs worn in the trooper's web gear. The D-93 Incinerator flamethrower was the signature weapon of the First Order flametrooper. The flamethrower had a peizoelectrical ignition system and was connected to a backpack, housing twin outer conflagrine-14 fuel tanks and a central pressurized propellant tank, by a double-chambered reinforced hose."}, {"tag": "p", "text": "As soldiers of an authoritarian regime, First Order stormtroopers were trained to wield non-lethal weapons and equipment for riot-control purposes. The Z6 riot control baton had collapsible conductor contact vanes and an adhesion grip that magnatomically paired with a trooper's glove. It was designed to suppress unruly civilians by battering them into submission. The lightweight riot shield that was used in conjunction with the riot-control baton provided additional protection for the trooper. Riot-control troopers also carried F-11D blaster rifles as they were authorized to use lethal force when riot situations escalated beyond their ability to control through non-lethal methods."}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "The First Order Stormtrooper Corps was built upon a legacy of armored infantry units dating back to the final years of the Republic Era. As such, First Order stormtrooper armor was modeled on the older Imperial stormtrooper armor and the Republic clone trooper armor. The clone armor was the first generation in the heritage of stark white armor; during the Clone Wars, it was a symbol of honor and defense. This changed with the introduction of stormtrooper armor in the early Imperial Era, which saw the image of endless legions of white-armored troopers transformed from a symbol of galactic salvation into a \"faceless icon\" of fascism. Having appropriated the heritage that the Republic began and the Empire inherited, the First Order's armored soldiers were the latest evolution of the stormtrooper—one of the most recognizable symbols of military might in the galaxy."}, {"tag": "p", "text": "The First Order armor was a suit of composite betaplast armor, divided into multiple white armor plates that were worn over a black temperature-control body glove. The body glove was made from of a self-sealing combat mesh fabric. The standard trooper wore flexible weatherproof underboots, such as FN-2187. The standard infantry helmet was designed specifically to protect the head during combat; additionally, they were equipped with communications and targeting systems. The helmets' aesthetic design was intended to promote uniformity and conformity in the ranks of the First Order, which sought to suppress all sense of individuality in its troopers."}, {"tag": "p", "text": "The armor had a psychological effect on the stormtroopers that it was worn by. Captain Cardinal recalled his experience wearing stormtrooper armor and how it reinforced his sense of purpose as a soldier of the First Order. Additionally, the armor gave its wearer a sense of belonging and identity."}, {"tag": "h3", "text": "Other equipment"}, {"tag": "p", "text": "The majority of stormtrooper helmets lacked advanced imaging gear in order to keep their weight down; as such, stormtroopers had to use separate quadnoculars in the field. These devices were oversized image enhancers that offered increased multispectral imaging via quartet precision lenses."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}