{"url": "Storm_Commando_armor", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Light armor", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Storm Commando armor"}, {"tag": "p", "text": "Storm Commando armor was a special type of body armor worn by Storm commandos, the special forces of the Imperial Stormtrooper Corps. The design was created by Doctor Nashiak Llalik and based on the light armor worn by Scout troopers, albeit colored matte black, hence their nickname of \"shadow scouts.\""}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like scout trooper armor, Storm Commando armor was blast reinforced to provide protection against physical and energy attacks without being restrictive to wear. It also shared the climate-controlled sealed body glove and breath mask which allowed the wearer to operate in toxic and otherwise hostile environments. It's most notable feature however was it's special polymer coating known as reflec which bent light and sensor energy away from it. This made the wearer practically invisible to most sensor scans, although a determined attempt could detect them. The armor also had a layer of sound baffling built into it, enabling the Storm Commando to move more quietly. The radius of the sound dampener was able to reach up to a meter."}, {"tag": "p", "text": "The armor's helmet contained standard features like a tongue-activated comlink and Multi-Frequency Targeting and Acquisition System. In addition the helment's viewplate doubled as a macrobinocular with a range of one kilometer and ultraviolet night vision capability."}, {"tag": "p", "text": "The armor included a utility belt to carry the equipment necessary for the Storm Commando's mission. Standard gear included a high-tension wire, grappling hooks, spare blaster power packs, ion flares, food rations and water packs, a spare comlink, and two medi-packs, with additional pouches for carrying other supplies."}, {"tag": "p", "text": "Since Storm Commandos preferred to operate in darkness, their armor was normally painted black with no distinguishing markings such as unit insignias."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}