{"url": "Battle_of_Arah", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Dantus sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Arah"}, {"tag": "p", "text": "The Battle of Arah occurred in 3 ABY when the Alliance to Restore the Republic, investigating the TIE Phantom project."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A freighter pilot was aware of the existence of a mining facility and subsequently tried to inform the Rebel Alliance of this discovery. With a full record of the message in their hands Admiral Ackbar ordered a strike against the facility, forming temporary Rascal Squadron composed of three T-65 X-wing starfighters."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the battle, the three pilots had to pass through the Belt of Arah which was spread with derillium mines to fend off any intruders. Cleaning their way through the minefield and the asteroid belt, the pilots engaged a wave of TIE Interceptors who defended the facility. However they were not able to stop them from reaching the massive facility and fly into an external corridor."}, {"tag": "p", "text": "Once there, Rookie One shot some generators shielding and access tube. The three starfighters entered into the hollow center of the asteroid. The bulkheads holding up the reactor and escalators were littered with sentry guns meant for taking out falling debris, to avoid damage to the structure and the pilots had to clear them in order to reach the other end. The trio managed to overheat the reactor by destroying the cooling system. The facility and the asteroid it was built around exploded as the pilots flew off."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After briefly celebrating their success, and as they were preparing to jump into hyperspace, the trio were assaulted by ships that seemingly came from nowhere. Unable to shake them off, both Ace Merrick and Pilot Ina Rece were killed, by Phantom TIEs who were defending the vicinity. Rookie One was the only one who made the jump after the Phantom TIES tried to shot him down which they failed. also bringing footage of the rare appearance of the mysterious ships to the Alliance base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}