{"url": "Stormtrooper_lightsaber", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Stormtrooper lightsaber"}, {"tag": "p", "text": "Stormtrooper lightsabers were used exclusively by Cuis Clones. They were red-bladed and, unlike other sabers, had a predominantly white hilt which matched their armor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After more than a year of replicating the Cuis genome, Arkanian Microtechnologies had produced six prototype clones of Sa Cuis, fully grown and trained as Imperial stormtroopers. Although they wore the same standard armor as the clone infantry units of the Stormtrooper Corps, the Cuis clones were armed with unique red-bladed lightsabers, rather than the traditional E-11 blaster rifle. Under the tutelage of Sheyvan, utilising both melee combat and their inherited telekinetic Force powers, the clones demonstrated their lightsaber skills against each other, as well as Darth Vader, while the Emperor observed their performance. The final test in their training was a match that pitted each of the six Cuis clones against a clone of Lieutenant Erv Lekauf, one of Vader's most trusted officers. The Cuis clones were disarmed of their lightsabers given that the contest was a non-lethal exercise, although they quickly proved that their Force abilities were more than sufficient. The clones instructor Sheyvan however, ultimately felt that his loyalty had been repaid with deception. In his time as the personal trainer of the Cuis clones, the Hand had secretly co-opted their allegiance, ensuring that they would fight for the one who trained them, rather than the two Sith Lords that merely commissioned their creation. The Cuis clones, wielding their red-hued lightsabers, rose up in insurrection. Despite their demonstrated superior skills during training, none of the Cuis clones were able to defeat Vader in combat. The Dark Lord, with the aid of Lekauf's clone stormtroopers, engaged the Sheyvan and Cuis's clones in combat. Four Cuis clones were taken out by flamethrowers; the remaining two, Force choked by Vader. Sheyvan fought Vader alone in a brief duel and was ultimately killed as he was cut in half from shoulder to hip. With the Sa Cuis template decommissioned, the practical use and fate of the lightsabers themselves remains unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In early incarnations of the Star Wars storyline, lightsabers were not exclusive to the Jedi and other Force-users, but were in fact very mundane. Stormtroopers, as depicted in the early drafts of Star Wars, were envisioned by Ralph McQuarrie to wield lightsabers and hand-held shields while other early concept art depicts lightsabers being wielded by Rebel and Imperial soldiers alike. George Lucas later limited the lightsabers to exclusively the Jedi in order to make them feel more unique, and heighten the mystique of the Jedi."}, {"tag": "p", "text": "The \"Stormtrooper lightsaber\" appeared in artwork accompanying the Star Wars Insider 85 story A Two-Edged Sword, as well as the additional Insider #85 Online Supplement, and thus became canon. As drawn by Trevas, one stormtrooper in particular, strongly echos the pose adopted by McQuarrie in his concept art of a lightsaber-wielding stormtrooper. A prop by Trevas was also created."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}