{"url": "Battle_of_Anx_Minor", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battles in the Raioballo sector", "Category:Battles of the Imperial Skirmishes"], "nodes": [{"tag": "h1", "text": "Battle of Anx Minor"}, {"tag": "p", "text": "The Battle of Anx Minor was one of the last major battles of the Galactic Civil War between the Imperial Remnant and the New Republic, occurring during the Empire's final campaign in 17 ABY. After a series of engagements, an armada of Imperial Star Destroyers under the command of Remnant Admiral Gilad Pellaeon engaged the New Republic Third and Fifth Fleets above the Outer Rim world of Anx Minor, located deep within Imperial territory. Commanding from the New Republic Star Dreadnought Guardian, the Mon Calamari Admiral Gial Ackbar inflicted heavy damage upon Pellaeon's ships, forcing the Imperials to retreat. The defeat prompted Pellaeon and the Remnant to sue for peace two years later, an initiative that brought about an official end to the war."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 17 ABY, during the final stages of the Galactic Civil War, the Imperial Remnant under Admiral Gilad Pellaeon launched a series of offensives against the New Republic, fearing that the Republic was preparing to invade Imperial Space. Although initial skirmishes at Adumar, Taris, and Champala proved successful for the Remnant, the New Republic military quickly responded to the threat that Pellaeon's forces posed. The Mon Calamari Admiral Gial Ackbar, commanding from the Executor-class Star Dreadnought Guardian, led the Third and Fifth Fleets of the New Republic Navy into battle against the Imperial forces, routing them at Champala, Ketaris, and Tangrene. With Pellaeon pushed back into the heart of Imperial territory as a result of these defeats, the stage was set for a final encounter between the opposing commanders."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The armadas faced off in battle above Anx Minor, an Outer Rim planet located near the core of Imperial territory. Ackbar, commanding from the Super Star Destroyer Guardian, led the New Republic Third and Fifth Fleets into combat against Pellaeon's force of Star Destroyers, which included two Star Dreadnoughts—the Dominion and the Megador—and the Sorannan-class Star Destroyer Rakehell, a weapons testbed. The resulting engagement between the two fleets proved to be the decisive end of the Empire's campaign."}, {"tag": "p", "text": "Near the conclusion of the battle, Ackbar ordered his forces to concentrate their fire on the Rakehell. New Republic Intelligence had determined a way to take out the vessel—there was a weak spot near its antimatter reservoir. Ackbar ordered his forces to target the armor surrounding the reservoir; this barrage, coupled with attacks on the ship's engines, destroyed the weapons testbed and ignited its antimatter reservoir. The resulting explosion was powerful enough to obliterate six Star Destroyers in the vicinity and damage the Megador. Defeated, Pellaeon and the remaining Imperial ships fled the battle, retreating to the planet Bastion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the end, Pellaeon's gamble on a final, successful campaign against the New Republic failed, the combined forces of the New Republic Third and Fifth Fleet having destroyed a significant portion of the Imperial Navy. The Empire's territory was reduced to eight Outer Rim sectors, and the Raioballo sector, where Anx Minor was located, was not one of them. This defeat, coupled with the Republic's close watch over the Imperial Remnant in subsequent years, prompted Pellaeon to assume direct command of the Remnant. In 19 ABY, two years after the defeat at Anx Minor, Pellaeon and the Council of Moffs sued for peace; the Galactic Civil War was formally ended that year with the signing of the Pellaeon–Gavrisom Treaty."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Anx Minor was first mentioned in The New Essential Guide to Characters, written by Daniel Wallace and published in 2002. In the book, the battle is described as having occurred after the Corellian Insurrection, while later sources place the battle as happening before. The Battle of Anx Minor was later mentioned in The New Essential Chronology, The Complete Star Wars Encyclopedia, and The Essential Atlas, none of which expanded upon the details of the conflict. The Essential Guide to Warfare, released in 2012, provided some new details on the battle."}, {"tag": "p", "text": "Some confusion regarding the dating of the battle has existed: While The New Essential Guide to Characters originally supplied a date of 17 ABY (\"[t]hirteen years after Endor\"), The New Essential Chronology proposed a generalization of 17–18 ABY for the Empire's final campaign (of which the Battle of Anx Minor was the final engagement), and The Complete Star Wars Encyclopedia simply used 18 ABY for the date of the battle. The Essential Atlas and The Essential Guide to Warfare, the most recent sources to mention the engagement, both went with the original 17 ABY dating."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}