{"url": "Storm_IV_Twin-Pod_cloud_car/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bespin Motors products", "Category:Cloud cars"], "nodes": [{"tag": "h1", "text": "Storm IV Twin-Pod cloud car"}, {"tag": "p", "text": "The Storm IV Twin-Pod Cloud Car was an atmospheric vehicle known as a cloud car which was designed and manufactured by Bespin Motors on Bespin's Cloud City."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This high-atmospheric aircraft consisted of two armored pods connected by a strong engine block housing the small yet powerful Kyromaster dual ion engine system and the secondary repulsorlift systems. The ion engine operated as the cloud-car's main propulsion system and allowed it to attain speeds of up to 1,500 kph while the repulsorlift drive was used for difficult maneuvers and increased the car's speed. Much of the engine area was exposed to reduce engine heat and allow maximum air-cooling. As it was designed solely for atmospheric flight, the vehicle also had a system of flaps, jets, vanes, and rudders to improve control."}, {"tag": "p", "text": "Both of the cloud car's pods contained a cockpit. The pilot was seated in the left pod, while gunner manned the right pod. The pilot's pod was equipped with advanced navigational systems and a communications array, while the gunner manned a pair of twin blaster cannons. Although not outfitted for advanced life support, the vehicle had pressurized cockpits for high-altitude flight and it was able to achieve low orbit using its repulsorlift system."}, {"tag": "p", "text": "Though the weapons emplacements could hold a wide range of weapons, most of the original vehicles had a small power generator which limited it to supporting blaster cannons. Although inferior to the more powerful starfighters, the cloud car's cannons allowed it to take on starships such as the Millennium Falcon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Storm IV Twin-Pod Cloud Car was the first high-atmospheric aircraft to be categorized as a cloud car. It was designed and produced by Bespin Motors to patrol the skies surrounding the floating mining colony and gambling resort Cloud City. The Storm IV was originally employed by the Bespin Wing Guard, who were responsible for the security of Cloud City.\n The craft were originally designed to transport civilians, and were highly maneuverable."}, {"tag": "p", "text": "When the Galactic Empire occupied Cloud City in 3 ABY shortly after the Battle of Hoth, Bespin Motors began selling the vehicle to other markets. Eventually rival starship manufacturers adopted the cloud car design and began producing similar-looking vehicles.[source?] Thus, the Storm IV and other cloud car designs could be found across the galaxy on other worlds such as Taloraan as both civilian and military vehicles. The Storm IV was still in use on Cloud City as late as 36 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Storm IV cloud car first appeared with the release of Star Wars: Episode V The Empire Strikes Back. The 2004 video game Star Wars: Battlefront depicts the Storm IV as a Fighter-Bomber armed with rockets like the TIE Bomber and the Y-Wing, though this may be game mechanics."}, {"tag": "p", "text": "In the mission \"Raid on Bespin\" for the game Star Wars: Rogue Squadron II: Rogue Leader, the player has the option of switching their craft for a Storm IV Twin-Pod cloud car during the second objective."}, {"tag": "p", "text": "In the Battlefront series games, the Storm IV is known only by the vague name of \"Cloud Car\". It is depicted as having poor acceleration and long takeoff time, although being capable of attaining extremely fast speeds and incredible turning capability. It is also armed with rockets in the games, although no launching apparatus is visible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}