{"url": "Storm_Killer", "categories": ["Category:Legends articles", "Category:YT-1300 light freighters"], "nodes": [{"tag": "h1", "text": "Storm Killer"}, {"tag": "p", "text": "Storm Killer was a heavily modified CEC YT-1300 light freighter which was optimized for combat and put on sale by the Bith used space transport salesman Fiz Cor'gril."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Storm Killer was modified for maximum combat performance, with no regard to the consequences to other systems. The ventral turret housed an Arakyd Tomral Heavy Laser Cannon, with increased power output. The dorsal gun had been replaced with an Incom W-34t turbolaser turret, which was far too powerful for the ship's systems to be fired continuously. Additionally, the ship was equipped with an Arakyd Hi-fex proton torpedo launcher and two Taim & Bak Kd-3 light blaster cannons. The latter ones were meant for ground use only."}, {"tag": "p", "text": "To optimize combat performance, the Storm Killer's shields and lateral thrusters were improved. The most drastic change was perhaps the rearrangement of the cockpit, moving it from the side to the middle, between the two mandibles, similar to a YT-2000."}, {"tag": "p", "text": "All these modifications came at a cost: The weapon systems draw so much energy from the power core that space performance was reduced by around forty percent. A slight mishap with a weapon system could cause the entire weapon to break down. The added machinery and capacitors took up space usually reserved for passengers, consumables and cargo, making the ship only practical for small and extremely valuable cargos."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Storm Killer was originally owned by a person who was obsessed with weaponry. Over the time, he added more and more firepower to the ship, paying no attention to the consequences. The turbolaser alone was far too powerful and illegal for such a ship by Imperial restrictions."}, {"tag": "p", "text": "Eventually, the ship ended up in the hands of the Bith starship salesman Fiz Cor'gril. He offered the ship for sale for  95,000 and also offered black market proton torpedoes for those interested."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}