{"url": "Stormtrooper_(First_Order)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order stormtrooper variants", "Category:First Order stormtroopers", "Category:Sith Eternal military units"], "nodes": [{"tag": "h1", "text": "Stormtrooper  (First Order)"}, {"tag": "p", "text": "Stormtroopers, also known as First Order stormtroopers or \"bucketheads,\" were the infantry soldiers of the First Order that were deployed from within the Unknown Regions. As the latest evolution of one of galactic history's most distinctive symbols of military might, the First Order's infantry units were outfitted with stark white armor derived from that worn by the Galactic Republic's clone troopers and the Galactic Empire's identically named elite shock troops. To ensure absolute loyalty and conformity, First Order troopers were identified by alphanumeric designations instead of individual names and programmed from birth through regular exposure to state-controlled propaganda. Ultimately, members of this new generation of stormtroopers were trained to serve one purpose—conquering the galaxy in the name of the First Order."}, {"tag": "p", "text": "The First Order Stormtrooper Corps was formed during the New Republic Era, following the collapse of its Imperial-era predecessor in the aftermath of the Galactic Civil War. Though the Galactic Concordance banned the mobilization of stormtroopers, the First Order secretly began its own stormtrooper program under the supervision of General Brendol Hux and Captain Cardinal, and later General Armitage Hux and Captain Phasma. Throughout its time, the program was centered on training human conscripts from early childhood. During the Cold War between the First Order and the New Republic, stormtroopers were presented as a territorial protection force. After the destruction of the New Republic capital, their true nature as the First Order's invasion army was revealed, leading to open war against the Resistance."}, {"tag": "p", "text": "Having conquered large swathes of territory, stormtroopers became the enforcers of a new galactic order ruled by Supreme Leader Kylo Ren—the dark warrior who succeeded Snoke as absolute ruler of the First Order. By the final days of the conflict, stormtroopers were supplemented by the red armored Sith troopers, a secret army developed on the hidden world of Exegol by the Sith Eternal cult. Despite their combined power, the newly-formed Final Order was ultimately defeated by Resistance forces and their allies at the Battle of Exegol, after which the First Order military faced a series of uprisings across the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "The armored soldiers of the First Order evolved from one of the galaxy's most distinctive symbols of military might: the stormtroopers of the Galactic Empire. Representing a new generation of stormtroopers, First Order troopers could trace their origins even further back to the clone troopers who fought for the Galactic Republic during the Clone Wars. When the Empire fell, suffering catastrophic defeats at Endor and Jakku, the New Republic crafted a peace treaty that ended the Galactic Civil War, yet also reduced the Empire to a rump state through the enforcement of strict disarmament treaties and punishing war reparations. By then, several leading figures in the Empire were dead, including Emperor Palpatine, the Sith Lord Darth Vader, and Counselor Gallius Rax. Under the leadership of Grand Vizier Mas Amedda, the Empire was forced to disband the Stormtrooper Corps as part of the terms outlined in the Galactic Concordance, which forbade the recruitment and training of stormtroopers."}, {"tag": "h3", "text": "Rise of the First Order"}, {"tag": "p", "text": "Although the Empire officially capitulated to the Republic, a group of Imperial officers, nobles and technologists refused to accept the outcome of the war. Embarking on an exodus into the Unknown Regions, the Imperial remnant was ultimately reorganized into a hermetic state known as the First Order. By hiding in the unexplored regions of galactic space, the First Order was able to conduct a massive military buildup—forging new armies and fleets in secret—in violation of the Galactic Concordance. The presence of stormtroopers in the First Order's ranks was a well known fact to the New Republic, but the First Order convinced both the government and much of the galaxy that their soldiers were only for defense. Only the Resistance suspected the stormtroopers' true purpose. Drawing inspiration from the ideals of Brendol Hux, a former Republic officer and Imperial commandant who found the Empire's stormtroopers lacking, the First Order created Project Resurrection: the conscription and training of human children who, under the First Order's guidance, became soldiers in the new Stormtrooper Corps."}, {"tag": "p", "text": "As a result, a new generation of stormtroopers was born through the training and indoctrination of child conscripts. Unlike soldiers of the Empire, First Order stormtroopers began their training at birth, much like the Republic clone troopers or Jedi Knights who preceded them. The new stormtroopers were taken from their families and raised to be absolutely loyal to the First Order. By 34 ABY, approximately thirty years after the Empire's defeat at Endor, the stormtrooper legions were under the command of Captain Phasma as well as other notable leaders such as General Armitage Hux and Kylo Ren. Above all, their allegiance was with Supreme Leader Snoke, ruler of the First Order. Although all troopers were to display absolute loyalty and fight for the First Order, a Worker Of The Month award could be given to stormtroopers who particularly proved themselves; FN-0208 was one stormtrooper who won the award."}, {"tag": "h3", "text": "Treason in the ranks"}, {"tag": "p", "text": "During the Cold War, the First Order was opposed by the Resistance—a private military group founded and led by the Rebel hero Leia Organa, the Resistance fought to prevent the First Order from restoring Imperial rule to the galaxy. The Resistance cataloged that there were special stormtroopers equipped for crowd control, cold weather, and incendiary tasks. Still, intelligence analysts were convinced that there were many more special troopers yet to be discovered. Two Resistance agents, Iden Versio and Shriv Suurgav, discovered Project Resurrection. Versio accused the program of being exploitative, abducting children and brainwashing them to serve the First Order. Her former comrade, Gideon Hask, had a different view. To Hask, the First Order not only rescued children, but also gave them purpose as an army of unprecedented military might."}, {"tag": "p", "text": "In addition to the First Order's goals, which included the destruction of the New Republic and the Resistance, they supported Kylo Ren's quest to destroy the last Jedi, Luke Skywalker. To that end, Phasma and an armed force of stormtroopers conducted an assault on Tuanul, a village located on the planet Jakku where Ren hoped to gain information pertaining to Skywalker's hidden location. After executing the village leader, Lor San Tekka for refusing to cooperate, Ren directed Phasma and the stormtroopers to exterminate the village's entire population. With the exception of FN-2187, every trooper complied with Ren's order, firing into the crowd until the last villager was dead. The experience of witnessing the First Order's brutality and the deaths of his comrades influenced FN-2187's decision to commit desertion by abandoning his life as a stormtrooper."}, {"tag": "p", "text": "With the completion of the First Order superweapon, Starkiller Base, General Hux declared the end of the New Republic's reign to a large assembly of stormtroopers and other military personnel. Saluting their general, the stormtroopers witnessed the activation of the superweapon, resulting in the utter destruction of Hosnian Prime along with the Galactic Senate and a substantial portion of the New Republic Defense Fleet. Meanwhile, the hunt for Skywalker led Kylo Ren and an armed force of stormtroopers to the planet Takodana where the dark warrior attempted to capture BB-8, a Resistance astromech droid that contained part of the information regarding the last Jedi's location. The stormtroopers assaulted a castle belonging to Maz Kanata during their search for the BB unit, then pursued BB-8 and Rey into the forest where several troopers were killed before Ren apprehended the scavenger. During the battle, FN-2199 confronted the traitor FN-2187, who now referred to himself as \"Finn.\" After a brief duel FN-2199 defeated Finn in single combat, only to be shot by the smuggler Han Solo. The remaining stormtroopers ultimately withdrew from the battle on Ren's orders, the dark warrior having discovered that Rey already accessed the information he wanted from BB-8."}, {"tag": "p", "text": "At Starkiller Base, Kylo Ren interrogated Rey in an attempt to get the map out of her, but his efforts were in vain, as Rey resisted him and revealed herself to be Force-sensitive. Ren went to inform his Master, Supreme Leader Snoke, about his discovery and left FN-1824 to keep watch over Rey. After two failed attempts, Rey managed to perform a mind trick on the stormtrooper, forcing him to to free her. When Ren returned and found that Rey had escaped, he angrily called the guards and destroyed the interrogation chair with his lightsaber, prompting two passing stormtroopers to quickly turn and walk away to avoid confrontation."}, {"tag": "p", "text": "Shortly after, the Resistance attacked Starkiller Base, resulting in a large dogfight in the air as the First Order scrambled a defense force to protect the base. On the ground, Han Solo, Chewbacca, Finn, and Rey headed to the oscillator to destroy it, engaging multiple stormtroopers along the way. As Solo and Chewbacca planted the explosives, Ren and a squad of stormtroopers arrived at the oscillator to find them. The stormtroopers aimed their blasters at Solo when he confronted Ren out in the open, hoping to convince his son to abandon the First Order and return home. Ren was shot by Chewbacca after the First Order warlord struck down his father, causing the stormtroopers to open fire on the Wookiee warrior. Despite their efforts, the troopers failed to stop Chewbacca from detonating the explosives, killing the remaining soldiers and damaging the oscillator. As a result, the X-wing pilot Poe Dameron was able to fly in and destroy it. With the oscillator destroyed, Starkiller Base soon collapsed into a star, killing all remaining stormtroopers on the planet."}, {"tag": "h3", "text": "The new war"}, {"tag": "p", "text": "Despite the loss of Starkiller Base, the First Order moved to impose its rule over the galaxy through military force, having removed the New Republic as an obstacle. Simultaneously, the First Order endeavored to destroy the Resistance once and for all, forcing Organa and her followers to abandon their base on D'Qar. Hoping to disrupt the First Order's ability to track the Resistance fleet's movements through hyperspace, Finn and Rose Tico infiltrated the Supremacy—the flagship of Supreme Leader Snoke—but were ultimately captured by Phasma and her stormtroopers. After bringing the prisoners to a hangar containing a large gathering of stormtroopers, Phasma sentenced Finn and Tico both to summary execution. Just as the executioner troopers moved to carry out the death sentence, the Resistance flagship Raddus crashed into the Supremacy at lightspeed. The act served to split the Mega-class Star Dreadnought in half, leaving a huge gap open to space where many crew members and stormtroopers perished."}, {"tag": "p", "text": "By then, Snoke had been assassinated by his apprentice, Kylo Ren, who then defeated the slain leader's Elite Praetorian Guards with the help of Rey. Their alliance was short-lived, however. Rey rejected Ren's proposal that they rule the galaxy together, causing the dark side warrior to blame Snoke's death on the former scavenger. Seizing control of the First Order as the new Supreme Leader, his first act in power was to deploy the First Order's forces, including an army of snowtroopers, to the planet Crait where he intended to annihilate the remaining members of the Resistance. During the Battle of Crait, the First Order overwhelmed the Resistance's defenses and stormed the outpost where they hid, although a small group of survivors managed to escape aboard the Millennium Falcon due to Rey's intervention. Several days after the battle, Resistance forces encountered stormtroopers during their missions to Bracca and Corellia, which was a planet the First Order had occupied."}, {"tag": "p", "text": "After a lifetime of training to fulfill one purpose, the forces of the First Order deployed throughout the galaxy, with stormtroopers leading the charge. Large swathes of the galaxy fell to legions of white-armored troopers—an image that was once a symbol of galactic salvation during the Clone Wars, but now appropriated by the First Order. The fall of the New Republic allowed the stormtroopers to carry out their true mandate as an invasion army; the First Order saw no point in respecting the laws of a fallen government, and therefore, they discarded the façade of maintaining a territorial protection force. During the war, the 709th \"Red Fury\" Legion, an elite force made of stormtroopers chosen by Supreme Leader Kylo Ren himself, was deployed to the planet of Batuu."}, {"tag": "h3", "text": "Fall of the First Order"}, {"tag": "p", "text": "Despite occupying vast regions of the galaxy, the First Order's forces were smaller than the Imperial Military. When Darth Sidious announced his return, a contingent of stormtroopers accompanied Supreme Leader Ren during his excursion to Mustafar where they fought the Alazmec of Winsit on the castle grounds of Fortress Vader. Ren outpaced his stormtrooper escorts, cutting a swathe of destruction through the Alazmec cultists to acquire a Sith wayfinder that once belonged to his grandfather. With it, Ren found both the former Emperor as well as untapped military assets on the dark world of Exegol in the Unknown Regions. This discovery bolstered the Supreme Council's faith in their leader, for these additional forces would give Ren the means to rule over all the galaxy as the new Emperor, transforming the First Order into a true Empire."}, {"tag": "p", "text": "Before Ren could command of Exegol's forces, he was tasked by Sidious to kill the former scavenger Rey, and by doing so, eliminate the last remnant of the Jedi Order. Using his connection  with the Jedi apprentice to determine her location, Ren deployed a force of stormtroopers to the planet Pasaana where Rey and her companions were pursued by a team of First Order Treadspeeder Drivers and First Order jet troopers. As they chased the Resistance team through the Pasaana desert, the 125-Z treadspeeder bikes catapulted the jet troopers into the air, allowing the First Order to take to the sky much to the surprise of C-3PO, Finn and Poe Dameron. Though the Jedi and Resistance operatives defeated their pursuers, a group of stormtroopers captured Chewbacca with help from the Knights of Ren."}, {"tag": "p", "text": "Rey and her allies later made their way to Kijimi, a planet under military occupation by the First Order. A stormtrooper garrison patrolled the streets of Kijimi City, conducting mass raids to acquire more child conscripts for their growing army. Ren's forces also combed through the city searching for Rey, who managed to infiltrate the Supreme Leader's flagship—the Resurgent-class Star Destroyer Steadfast—along with her comrades. After killing the guards in the main hangar, the group was ambushed by a pair of stormtroopers who attempted to apprehend the infiltrators. However, Rey's connection to the Force allowed her to dominate their minds, forcing the troopers to help the Resistance operatives navigate their way through the warship. While Rey left to collect her belongings from Ren's private chambers, Finn and Dameron managed to rescue Chewbacca, and with the Wookiee's help, they stormed down a corridor of stormtroopers, gunning several troops down before being forced to surrender due to the overwhelming number of First Order units."}, {"tag": "p", "text": "A squad of stormtroopers escorted the Resistance prisoners to an area where they were to be summarily executed. Before they could complete their orders, General Hux took a blaster rifle from one of the troopers, ostensibly to carry out the deed himself. Instead, he saved the prisoners by killing his own soldiers, revealing himself as the spy who had been feeding information to the Resistance. As Rey's friends returned to the Millennium Falcon, Ren had returned to the Steadfast to confront the last Jedi in person. More stormtroopers arrived in the hangar, where they aimed their weapons at Rey but were held back by Ren, who revealed to Rey that she was in fact Sidious' granddaughter. He urged her to join him, believing they could destroy the Emperor with their combined power as a Force dyad. Rey refused Ren's entreaty, however, and escaped from the Steadfast with the help of her friends, who used the engines of the Millennium Falcon to hold the stormtroopers back."}, {"tag": "p", "text": "Ren would ultimately abandon his ambitions to rule the galaxy, renouncing his dark persona in the wake of his mother's death on Ajan Kloss. Without a Supreme Leader, command of the First Order and its forces defaulted to Allegiant General Enric Pryde, who executed General Hux with a stormtrooper's blaster rifle after deducing that his younger colleague was the spy in their ranks. Having served Sidious under the Old Empire, Pryde swore fealty to him once more, giving control of the entire First Order to the reborn Emperor."}, {"tag": "p", "text": "With the First Order's military forces under his command, Sidious issued an ultimatum to the entire galaxy: all worlds would submit to the combined might of the newly-formed Final Order or be annihilated outright. By merging with the Sith Eternal, the First Order gained access to a vast armada comprised of Xyston-class Star Destroyers—new warships outfitted with axial superlaser cannons capable of obliterating entire planets. In addition, the Sith Eternal provided the First Order with a new army of Sith troopers. Like their white-armored counterparts, these red-armored soldiers were elite units whose inception was inspired by Republic clone troopers and Imperial stormtroopers, as well as the Sith for whom they were named after. Unlike First Order stormtroopers, however, Sith troopers were even more obedient and machine-like due to their flash-imprinting and loyalty conditioning, both of which were built upon and advanced beyond Kaminoan procedures of earlier generations."}, {"tag": "p", "text": "As the Sith Eternal fleet prepared to depart from Exegol, Resistance forces attempted to halt their launch in a last-ditch effort to prevent Sidious' new Sith Empire from becoming reality. In the ensuing Battle of Exegol, a Sith trooper contingent defended the Steadfast while Pryde oversaw the launching of the Sith Star Destroyers. As such, the command ship was targeted by Resistance boarding parties, causing the Sith troopers to launch a counterattack in defense of the Steadfast. Though many Resistance fighters fell in battle against the crimson soldiers, the Sith troopers failed to prevent their enemies from destroying the command bridge along with Pryde. At least one First Order stormtrooper was aboard the bridge as the ship was destroyed as well. Without the Steadfast to guide the fleet to safe altitude, the remaining Sith Star Destroyers were destroyed by the Resistance and their allies before they could escape into hyperspace, and with the death of Sidious the Resistance claimed victory on Exegol in 35 ABY."}, {"tag": "p", "text": "Without the promise of reinforcements from Exegol, the First Order military was suddenly challenged by multiple uprisings across the galaxy. In the aftermath of Resistance victory, Resurgent-class Star Destroyers were attacked and destroyed in the skies above Cloud City on Bespin, the Forest Moon of Endor, and Rey's homeworld of Jakku."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "The First Order's stormtrooper training program was designed to produce an army of super-soldiers. As a result, members of the new generation of stormtroopers were trained from birth to become elite soldiers with a single purpose in life—to serve the First Order. This form of training drew inspiration from the ideals of Commandant Brendol Hux, who was inspired by the combat prowess and dedication of the Jedi Knights and Republic clone troopers, both of which were instructed from youth to become efficient combatants. According to Phasma, the ideology of the First Order stormtroopers did not allow for any emotional elements such as sympathy since they were to specifically act as an extension of the Supreme Leader's will, and by extension that of the First Order, alone, and that the troopers were just as strong as they were weak. Likewise, Finn admitted that First Order stormtroopers were considered by their superiors to be expendable; those that were inept in battle were expected to die and not be saved by their fellow allies. During the fall of the Empire, Counselor Gallius Rax conscripted roughly two dozen orphans from his home planet of Jakku and gave them to Hux, who turned them into a force of child soldiers and assassins loyal to Rax. Prior to his death, Rax placed Hux's illegitimate son, Armitage in command of the child soldiers. As an adult, Armitage incorporated his father's ideas into the training program for the First Order stormtroopers. Captain Grummart was also a figure involved in trooper training whose specialties included archery."}, {"tag": "p", "text": "The First Order employed Jinata Security to abduct infants for the stormtrooper program. The First Order processed their conscripts at induction camps where the trainees were separated into groups or \"batches.\" Prior to becoming fully-trained stormtroopers, FN-2187 and trooper 926 were members of Batch Eight. As children, stormtroopers were initially trained under the oversight of Captain Cardinal, a former child soldier who instructed his cadets in hand-to-hand and melee combat, marksmanship, and battle simulations on the Resurgent-class Star Destroyer Absolution. When deemed ready, Cardinal's trainees were transferred to the Finalizer where they would complete their training under the watch of Captain Phasma. As the commander of the stormtrooper legions, Phasma endeavored to mold the stormtroopers into the finest soldiers in the galaxy and maintained a constant vigil against any signs of weakness or disobedience. To this end, behavioral and personality conditioning was critical in the training of First Order stormtroopers. In an effort to control their psychological development, the First Order provided its trainees with a steady amount of subliminal sleep messages and First Order propaganda, resulting in the production of soldiers who were completely loyal to the First Order. In addition, rigorous combat exercises and psychological conditioning, the First Order strongly emphasized the values of uniformity and conformity. They were therefore given alphanumeric designations instead of names. As such, their emphasis of uniformity and conformity was strict enough that the stormtroopers weren't allowed to even remove their helmets unless specifically ordered to do so, with the penalty of doing so usually being mandated psychological counseling. A trooper that displayed \"erratic conditioning\" could be scheduled for a full mental wipe and reprogram, also known as a brainscrape. Likewise, stormtroopers were not allowed to initiate contact with First Order officers."}, {"tag": "p", "text": "It was possible to enlist as a stormtrooper and serve the First Order, as propaganda posters for new recruits could be found in different parts of the galaxy, such as on Castilon."}, {"tag": "p", "text": "Although modern stormtroopers were modeled largely on the stormtroopers of yesteryear, their combat training differed substantially from that of their Imperial predecessors. Unlike the Empire, which resorted to the use of numbing routine for its troopers, the First Order's training simulations, live-fire exercises, and sparring practices encouraged stormtroopers to embrace improvisation on the battlefield. They were, therefore, more effective in battle than the stormtroopers who served as their template. In addition to combat training, all First Order stormtroopers received medical training, albeit only for minor injuries such as non-fatal blaster shots. During training, stormtrooper cadets slapped the rears of other troopers to motivate each other."}, {"tag": "p", "text": "Despite General Hux's confidence in the stormtrooper programming, not every trooper was a successful product by the First Order's standards. Examples of defective soldiers included Company 77 and Finn. The stormtroopers of Company 77 refused to fire on unarmed prisoners and had a lack of zeal for the First Order's cause. Likewise, Finn had a lack of zeal for the First Order's cause; combined with his unwillingness to execute unarmed prisoners, it led him to doubt his loyalties before ultimately forsaking his allegiance to the First Order. Both Phasma and Kylo considered FN-2187 as a renegade, albeit the latter also saw him as a prime example of a stormtrooper training program which he viewed as flawed. He theorized that a clone army could serve the First Order in a better capacity. However, Hux remained confident in the collective reliability of the First Order stormtroopers, believing the rogue FN-2187 to be an anomaly in an army of loyal soldiers."}, {"tag": "p", "text": "The average First Order stormtrooper stood 1.83 meters tall and weighed 80 kilograms—the same standard requirements that once applied to the Grand Army of the Republic and the Imperial Military."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Members of the First Order's infantry forces wore white armor that was reminiscent of the Galactic Empire's stormtrooper armor, as well as the Galactic Republic's Phase I and Phase II clone trooper armors. Aside from several aesthetic differences, First Order stormtroopers bore a close resemblance to their Imperial predecessors. To denote rank, stormtrooper officers wore color-coded pauldron armor plates. White pauldrons were worn by stormtroopers who served as squad leaders, black pauldrons identified stormtroopers who held the rank of sergeant, and red pauldrons were worn by officers."}, {"tag": "p", "text": "First Order stormtrooper helmets could filter out smoke, but not toxins. To deal with toxins, a stormtrooper needed to engage one of several special filters, depending on the specific contaminant. Identification was the province of one or two squad leaders."}, {"tag": "p", "text": "In terms of armor strength, stormtrooper armor was held in high regard. Captain Phasma once claimed that not even a Wookiee was strong enough to break First Order armor. To keep weight down, most First Order stormtrooper helmets lacked advanced imaging gear, requiring stormtroopers to use separate quadnoculars in the field to provide them with enhanced imaging. However, standard stormtrooper helmets were still equipped with integral polarized lenses, night vision, communications and targeting systems."}, {"tag": "p", "text": "The F-11D blaster rifle was the primary weapon of standard stormtroopers. A successor to the Imperial stormtroopers' E-11 blaster rifle, the F-11D was mass produced and provided to the First Order's soldiers by Sonn-Blas Corporation. In addition to the F-11D, Sonn-Blas also designed the SE-44C blaster pistol as a sidearm for the First Order stormtroopers."}, {"tag": "h2", "text": "Specialized stormtroopers"}, {"tag": "p", "text": "In addition to standard units, the Stormtrooper Corps possessed a variety of specialized troopers like the Old Empire before it. Specialist units were trained and equipped to function in various fields. Additionally, they could also be deployed alongside infantry units, supporting regular troopers in an auxiliary capacity."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The stormtroopers of the First Order first appeared in Star Wars: Episode VII The Force Awakens."}, {"tag": "p", "text": "Their design, a sleeker version of the original armor, was partially inspired by headphones for Apple products. The stormtrooper armor depicted in Star Wars: Episode VIII The Last Jedi is slightly different than the armor seen in The Force Awakens."}, {"tag": "p", "text": "Daniel Craig makes a cameo appearance as the First Order stormtrooper who frees Rey from captivity on Starkiller Base after falling under the influence of her Jedi mind trick."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}