{"url": "Stranger_War", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Stranger War"], "nodes": [{"tag": "h1", "text": "Stranger War"}, {"tag": "p", "text": "The Stranger War was the final decisive conflict between the Ewoks of Bright Tree Village and the Wizards of the Night Spirit."}, {"tag": "h2", "text": "Preliminaries"}, {"tag": "p", "text": "Ages before the Battle of Endor, the Wizards of the Night Spirit had come into conflict with the Ewoks. With the use of the Sunstar, the Ewoks had forced the Wizards off the world and into a rip in space. On the otherworld, the Wizards planned for their revenge, waiting for the day when they would be able to escape their prison world and make it back to the Forest Moon of Endor."}, {"tag": "p", "text": "Years later, the opportunity presented itself. Two moons of Endor aligned above the forest moon, creating an unusual phenomenon. The rift in space opened, and one of the Wizards, the Stranger, was able to sneak through in a fast ship. The plan for revenge was finally in motion."}, {"tag": "h2", "text": "Build-up"}, {"tag": "p", "text": "After landing on the forest moon, the stranger abandoned his craft and made his way to the Dulok swamp. As the Stranger entered the swamp, the Dulok King, Gorneesh, confronted the Wizard. Using his powers to threaten the Dulok chief, the Stranger forced the Dulok tribe to follow him to Bright Tree Village. Taking up arms, the Duloks fell into ranks behind the Stranger and they left the swamp."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "As the Stranger and his soldiers entered the Ewok camp, the Wizard gave the call to attack. Swinging on vines, the Duloks began to raid the Ewoks' homes, dashing into the huts to steal food and assault the patrons. The commotion was soon heard by the Ewoks' Chief Chirpa who called the Ewok warriors together with a loud battle cry."}, {"tag": "p", "text": "The Duloks and the Ewoks clashed on the main bridge of the village, exchanging blows. While the village was in an uproar, the Stranger used the distraction to enter the hut of Logray to steal the Sunstar which had been left unattended during the battle. With the Sunstar in hand, the servant of the Night Spirit prepared to leave. However, he was spotted by the Ewok children, Wicket Wystri Warrick, Kneesaa a Jari Kintaka, Teebo, and Latara, who tried to raise the alarm."}, {"tag": "p", "text": "However, the Stranger used the powerful artifact to create a fire on the bridge that the children were standing on, trapping them between two opposing blazes. The Stranger then left the scene, abandoning his Dulok charges. Without the Stranger, Gorneesh saw that the battle was lost and the Duloks fled in full retreat back to their swamp. With the main threat neutralized, the Ewok warriors were able to save the Ewok children just in time by dousing the flames with a firehose."}, {"tag": "h2", "text": "Pursuit"}, {"tag": "p", "text": "As the heat of battle slowly quieted, the Ewok warrior, Weechee Warrick, noticed the missing Sunstar and informed Chirpa. Believing the Duloks to be the perpetrators of the theft, the Chief rallied his warriors and left the village for the swamps. Meanwhile, the Ewok children, who had been trying to inform Chirpa of the real thief to no avail, left the village to track the Stranger's path."}, {"tag": "p", "text": "With Teebo's skills to communicate with the Endor wildlife, the friends soon surmised that the Stranger was headed to the Thorn Forest, and the group quickly departed. As soon as the group arrived in the forest, they found the Stranger performing a dark ritual within the Stone Circle, with the Ewok Shaman Logray as his prisoner. Watching the ritual take place, the Ewoks witnessed as the Stranger used the Sunstar to open a portal to the otherworld, letting the rest of his species through."}, {"tag": "h2", "text": "Attack"}, {"tag": "p", "text": "Wicket realized what the Stranger was attempting, and he charged into the Stone Circle with Kneesaa, ready to pounce on the Stranger. However, the lunge only succeeded in stripping off the Stranger's cloak, revealing his fearsome visage. As the Wizards poured onto the forest moon, they swarmed the Ewok chidren, outmatching them in shear force of numbers."}, {"tag": "p", "text": "Luckily for the Ewoks, it seemed that Chirpa had realized that the Duloks were without the Sunstar, and his force left the swamps to enter the Thorn Forest. Seeing the Ewok children in trouble, the Ewoks charged into the Stone Circle, bringing the fight to the Wizards. While the Ewoks battered the Wizards with staffs and potions, Wicket and Kneesaa were engaged in a deadly struggle with the Stranger who was still manipulating the Sunstar. Wicket was eventually able to grab onto the Stranger's wings and hold him fast while Kneesaa freed herself and ran to the Sunstar. Using her grappling hook, Kneesaa was able to reverse the ritual that was drawing the Wizards onto the forest moon. Reversing the spell had the opposite effect, threatening to close the doorway in space, and creating a strong wind which began to push the Wizards back into space and through the portal."}, {"tag": "p", "text": "As the flying Wizards were caught by the powerful wind, Chirpa ordered his forces to stand down and cling to anything they could get their hands on. Meanwhile, the Stranger made one last attempt to hurt the Ewoks and tried to carry Wicket away with him. Luckily, Kneesaa was there to save the day again, rescuing Wicket from the Stranger by tying his hands with Wicket's belt of honor. With a final cry of frustration, the Stranger was cast far into space and through the portal just as it closed with a brilliant flash of light."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the battle won, the Ewoks triumphantly returned to the village. Chief Chirpa awarded the Ewok children with Beads of Bravery for their heroic service during the battle. Additionally, Wicket's Belt of Honor was lost during the battle, and he was forced to start a new belt to complete his path to becoming a full-fledged warrior."}, {"tag": "h2", "text": "Appearances"}]}