{"url": "Strategic_Command", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Republic Strategic Information Service", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Strategic Command"}, {"tag": "p", "text": "Strategic Command was a command center located in the Senate Building on the planet Coruscant during the Cold War between the Galactic Republic and the Sith Empire. Strategic Command was utilized by a branch of the Strategic Information Service, the Republic's primary intelligence agency, during the crisis involving the stolen Planet Prison superweapon in 3643 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Strategic Command was a large room located in the Senate Building on the planet Coruscant, the capital of the Galactic Republic. An operational headquarters of the branch of the Republic Strategic Information Service—the Republic's intelligence agency—under the command of Agent Galen, Strategic Command was equipped with two long tables and a large holocomm unit at the far end of the room. Like the rest of the Senate Building, Strategic Command featured white-and-tan flooring as well as burnt-orange walls decorated by auburn arches. Large Republic banners and potted plants were displayed in the room, and several databanks and computer terminals were arrayed along the walls."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Agent Galen's SIS branch utilized Strategic Command by the time of the Cold War between the Republic and the Sith Empire. In the year 3643 BBY, a team of criminals from the Migrant Merchants' Guild organization stole the design files for the Planet Prison superweapon, and Galen's unit was assigned to investigate with the help of the Coruscant Security Force. Upon identifying one of the thieves, a Rodian named Vistis Garn, Galen reported the unit's findings to General Var Suthra of the Republic Military. A young Jedi Knight was sent to retrieve the files from a Guild warehouse in the Old Galactic Market region, and Galen returned to Strategic Command with the Jedi Padawan Kira Carsen. When the two were alerted to the kidnapping of the Planet Prison's designer, Doctor Eli Tarnis, Carsen departed Strategic Command to pursue the kidnappers, and Galen ordered the Jedi Knight who had been sent after the files to bring the files back to him at Strategic Command."}, {"tag": "p", "text": "Galen handed off the files to Krand, one of his analysts, who used the room's computers to decrypt the files while the Knight helped Carsen defeat some of the kidnappers in the nearby Coruscant Spaceport. Upon discovering that the files contained information on the entire Republic superweapon initiative, Galen summoned General Suthra, the Jedi Masters Bela Kiwiiks and Orgus Din, the Knight, and Carsen to Strategic Command to give them the bad news. Galen, Kiwiiks, and Din departed Coruscant to secure the Republic's three offworld superweapon development facilities, but Suthra and Carsen remained behind in Strategic Command to monitor the Knight as the young Jedi embarked on a mission to rescue Doctor Tarnis from his kidnappers in the Black Sun criminal syndicate."}, {"tag": "p", "text": "Suthra and Carsen were using the room's communications systems to monitor the Jedi when the Knight discovered that Tarnis was, in fact, a Sith Lord, and Carsen and the analysts were able to track Tarnis's transmissions to the Coruscant territory of the paramilitary Justicars' Brigade. After Carsen and the Knight defeated Tarnis and stopped him from using the Planet Prison against Coruscant, Suthra met with the Jedi again in Strategic Command before sending the pair on a mission to the planet Ord Mantell to investigate the plans of Tarnis's father, Darth Angral."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Strategic Command first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, as a class-restricted phase that is involved in several missions for the Jedi Knight class on the planet Coruscant. It was also mentioned as a Jedi Knight phase in the Star Wars: The Old Republic Explorer's Guide, released by Prima Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}