{"url": "Strategic_Resources_of_the_Galaxy", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:In-universe guides and reference books"], "nodes": [{"tag": "h1", "text": "Strategic Resources of the Galaxy"}, {"tag": "p", "text": "Strategic Resources of the Galaxy was a piece of reference literature that dealt with a variety of minerals from across the galaxy. Authored by Pilas Manaitis sometime prior to the rise of the Galactic Empire, Strategic Resources of the Galaxy included an entry on the rare and durable Mandalorian beskar iron. In the entry, Manaitis discussed the many different properties of beskar iron, as well as the Mandalorian metalsmiths who crafted the beskar iron."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Written by Pilas Manaitis sometime by 19 BBY, Strategic Resources of the Galaxy was a piece of non-fiction reference literature that focused on a number of different minerals and ores from across the galaxy. In Strategic Resources of the Galaxy, Manaitis included an entry on the durable beskar iron, a rare ore found only on the planet Mandalore."}, {"tag": "p", "text": "In the entry, Manaitis noted that beskar had a number of different properties and colors, and that the iron could take a number of different forms, including plate, laminate, wire, foam, mesh, micronized particles, and a transparent film. The entry also mentioned the Mandalorians, the warrior culture native to Mandalore and the only beings with the knowledge of how to properly craft beskar iron. Because the Mandalorian metalsmiths refused to sell their beskar–working skills, and because any attempt to copy the Mandalorians' beskar iron outside of Mandalore ended in failure, Manaitis stated that the only way to get beskar iron was to seize Mandalore itself, a task Manaitis considered nearly impossible given the Mandalorians' mastery of warfare."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Strategic Resources of the Galaxy was first mentioned in Karen Traviss's 2009 novel Imperial Commando: 501st when the reference literature's entry on beskar iron was quoted at the start of the novel's sixth chapter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}