{"url": "Strand-Cast", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Biotechnology", "Category:Clones"], "nodes": [{"tag": "h1", "text": "Strand-Cast"}, {"tag": "p", "text": "A Strand-Cast, alternatively spelled strandcast, was a bioengineered organism. During the New Republic Era, the Sith Eternal—a cult that served the reborn Sith Lord Darth Sidious—engineered various strandcasts on the distant world of Exegol, including Supreme Leader Snoke and Rey's father. Whereas Snoke was a genetic strandcast who possessed a powerful connection to the Force, the father of Rey was an ordinary human despite being cloned from Sidious' template. His daughter was nonetheless Force-sensitive through her birth as a scion of the Palpatine bloodline."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A strandcast was an artificial life-form constructed through various scientific methods, such as bioengineering, cloning and genetic experimentation. The genetic structure of a strandcast could be significantly altered through genetic engineering, resulting in a non-identical clone of the original source. Despite their origins, strandcasts were still capable of exercising free will."}, {"tag": "p", "text": "The process of engineering a strandcast could result in various genetic flaws, producing defective and unhealthy specimens. One such flaw in the genetic technology was that using the base template of a Force-sensitive did not necessarily  or automatically ensure that the resulting strandcast would inherit its progenitor's connection to the Force. Nevertheless, it was possible to deliberately create a strandcast who possessed strong Force powers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Strandcasts were grown in gene farms. In 3 ABY,[source?] Darth Vader discovered several vats of strand-casts in Darth Sidious secret lab on Exegol, along with a severed hand."}, {"tag": "p", "text": "Around 9 ABY, the Mandalorian bounty hunter Din Djarin became the caretaker of Grogu, a mysterious alien foundling who was strong with the Force. Djarin believed that the child could possibly be a strandcast. Kuiil, an Ugnaught who worked in the gene farms, thought that Grogu looked evolved and \"too ugly\" to be a genetic construct."}, {"tag": "p", "text": "The death and resurrection of Galactic Emperor Darth Sidious led to a series of genetic experimentation that produced a myriad of strandcasts on Exegol, an ancient Sith planet located in the Unknown Regions of the galaxy. With Sidious' essence trapped in a flawed, decaying clone of his original form, the Sith Eternal cult tried to create a more stable host that could sustain their master's connection to the dark side of the Force. Rey's father was an offshoot of Sidious' genetic experiment that produced other strandcasts, none of which survived the procedure of their creation. The result of combining Sidious' cloned tissue samples with cells taken from other specimens, this particular strandcast was biologically human and regarded as the Emperor's son."}, {"tag": "p", "text": "Although he was made from Sidious' genetic code, the strandcast was not Force-sensitive like his progenitor. Sidious dismissed his creation as a failed experiment, and could not bear to look at a powerless ordinary being who shared his blood. However, he permitted the strandcast to remain alive long enough to ensure the continuation of the Palpatine bloodline through natural methods. The strandcast eventually produced a child, Rey, who inherited her grandfather's power. Sidious was determined to possess her before his cloned body fully deteriorated, but the strandcast escaped into hiding with his daughter and Rey's mother. The Sith assassin Ochi tracked the strandcast to the desert world of Jakku and killed him at Sidious' behest, but otherwise failed to locate Rey."}, {"tag": "p", "text": "Like the Emperor's son, Supreme Leader Snoke was an artificial genetic strandcast created by Sidious and his Sith Eternal acolytes. A towering humanoid, Snoke was physically frail but also strong with the Force, in particular the dark side. He was made to serve as a proxy for the Sith, although Snoke himself denied any lineage to the ancient order of dark-side wielders. Possibly unaware of his own origins, Snoke was capable of independent thought yet still influenced by his creator. In addition to taking control of the First Order, the training of Kylo Ren—grandson of the Sith Lord Darth Vader—was the purpose behind Snoke's existence, allowing Sidious to sidestep the tradition of a Sith apprentice ascending through the death of their Sith Master. By serving as Ren's master, Snoke groomed the young Force warrior to become an heir to the Sith legacy, molding Ren into a master of attack and cunning. When Snoke died by his apprentice's hand, he fulfilled his purpose as designed by the cultists who engineered him."}, {"tag": "p", "text": "Despite Snoke's death, genetic copies of him were stored within the Sith Citadel on Exegol. They were Snoke's clone \"brothers,\" kept in a hibernated state and sustained in a tank filled with nutrient fluid. Ren lost much respect for his former master after discovering the true origins of Snoke, and felt vindicated in his decision to usurp the title of Supreme Leader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}