{"url": "Stornvein", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Clerical workers and assistants", "Category:Individuals of unspecified species", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Stornvein"}, {"tag": "p", "text": "Stornvein was a male individual who served the New Republic as an aide to General Hera Syndulla. Some weeks after the Battle of Endor in 4 ABY, he delivered a report to Syndulla aboard the Acclamator-class transgalactic military assault ship Lodestar and informed the general when the New Republic Intelligence operative Caern Adan arrived to meet her. Stornvein later relayed messages to Syndulla after the general attended a briefing with the New Republic's Alphabet Squadron."}, {"tag": "p", "text": "Around 5 ABY, Stornvein assisted Syndulla at the Lodestar's tactical center during the invasion of the planet Troithe's capital district in the Cerberon system. Shortly after, the pair travelled to the Bormea sector to assist the New Republic's Vanguard Squadron in their special assignment. However, they returned to their own battle group in the Cerberon system aboard the MC75 Star Cruiser Temperance to assist against forces of the Galactic Empire. Stornvein and Syndulla discussed firing on enemy forces during the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Aide work"}, {"tag": "p", "text": "During the war against the Galactic Empire, Stornvein served in the New Republic's Barma Battle Group as an aide to General Hera Syndulla aboard her flagship the Acclamator-class transgalactic military assault ship Lodestar. Some weeks after the Battle of Endor in 4 ABY, he delivered an intelligence brief to Syndulla, which caused her to laugh. When Stornvein asked if something was the matter, Syndulla told him that if he ever became frustrated, he should look back upon how minor victories had been seen as great triumphs during the time of the New Republic's predecessor Rebel Alliance. Stornvein claimed he would as perspective was useful, then bowed his head and left her office."}, {"tag": "p", "text": "He returned shortly afterwards and stuck his head round the door apologetically to inform the general that New Republic Intelligence agent Caern Adan, her next appointment, had arrived early. Syndulla told Stornvein to allow the agent in, but to call security if he had not left within thirty minutes. The general allowed Adan and his working group, Alphabet Squadron, aboard the Lodestar as a base of operations for their hunt for the Empire's 204th Imperial Fighter Wing. Following a briefing with Alphabet Squadron regarding a planned attack on the 204th at the Pandem Nai system, Syndulla went to receive messages from Stornvein before going to the Krayt Hut bar aboard the Lodestar to have drinks with members of the squadron."}, {"tag": "h3", "text": "Invasion of the Cerberon system"}, {"tag": "p", "text": "Around 5 ABY, the Syndulla's battle group fought Imperial forces in the Cerberon system, seeking to lure the 204th into helping the local Imperial forces as part of a trap. During the campaign, the battle group's forces conducted an attack on the capital district of the planet Troithe, during which Stornvein and Syndulla observed the fighting from the Lodestar's tactical center. Stornvein reported that the Acclamator, which hovered above Troithe, was in position but had no room to descend further towards the surface and so could only pick off TIE line starfighters which got close."}, {"tag": "p", "text": "Syndulla inquired about a video feed from the ground, which Stornvein pulled up on a screen, but not before he made verbal note of jamming activity which may hinder the broadcast. The general analysed the progress of the battle, eventually questioning why multiple enemy dots on a tactical map were receding. Stornvein, who huddled with a comm officer, reported that Troithe's Governor Hastemoor had ordered a withdraw towards the capital's Tri-Central Complex. Syndulla questioned the logistics of the governor's decision, to which her aide added that the complex's Imperial secured throughways may make it easy to regroup there."}, {"tag": "h3", "text": "Battle above Troithe"}, {"tag": "p", "text": "Syndulla and Stornvein travelled to the Bormea sector to assist the New Republic's Vanguard Squadron, which was on a mission to help better the New Republic Defense Fleet starship supply. The pair witnessed the destruction of worlds and the deaths of comrades when the Empire's Titan Squadron attacked and pursued Syndulla's forces until their new prototype Starhark-class battleship, the Starhawk, was destroyed. before they returned to the Cerberon system with Vanguard Squadron and it's flagship, the MC75 Star Cruiser Temperance."}, {"tag": "p", "text": "The trap that had been set for the 204th had ended in the loss of Lodestar among other assets of Syndulla's battle group left at Cerberon. The Temperance arrived above the planet Troithe as dwindled forces of the battle group battled the 204th. As Syndulla tabled having the Temperance firing on enemy forces, Stornvein asked if the general was certain about it, worrying about hitting their own forces. Syndulla replied with her plan to use dispersed minimal power turbolaser fire to scatter the 204th's TIE fighters. Stornvein feared the entire fighter wing would go for the Temperance and Vanguard Squadron, which the general assured him that they would tackle one problem at a time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male individual, Stornvein was Hera Syndulla's favoured aide and at one point he questioned her when believing there was something troubling her. After Syndulla wished for the Temperance to fire on the Empire's ground forces, the aide expressed concern over hitting friendly forces or stoking the 204th into attacking the MC75 Cruiser altogether."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Stornvein first appeared in the 2019 novel Alphabet Squadron, which was written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}