{"url": "Battle_of_Artorias", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Myto sector", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of Artorias"}, {"tag": "p", "text": "A battle occurred early in the Yuuzhan Vong War and involved the invasion of the planet Artorias."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "For millennia, the extra-galactic race known as the Yuuzhan Vong had been preparing for a full scale war to claim the galaxy which they believed was their promised land that was given to them by their gods. Thus, they dispatched spies and saboteurs to prepare the way for their forces. This led to a Yuuzhan Vong agent using an Cloaker Masquers to disguise his features making him appear as a native of the planet. Working his way into the confidence of the ruling King of the world, the agent aided in the sabotage of space capable vessels as well as ensured that the Artorias communications center did not receive a distress signal from the Pythea which had encountered a Yuuzhan Vong fleet heading to Artorias."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Without a defense force protecting the planet as well as no warning of the approaching fleet emerging from hyperspace, the inhabitants of Artorias were completely unprepared for the invasion forces. Beforehand, the invaders had deployed ground teams to assault the primary settlements, and the warrior caste was successful in sowing terror amongst the natives. Many were wounded or killed in the initial attack until King Caled Galfridian realized that it was an invasion of his home. His initial counterattack involved throwing a thermal detonator at a group of Yuuzhan Vong, but this action did little to slow down the invaders."}, {"tag": "p", "text": "Understanding the magnitude of the attack, Galfridian signaled for his people to evacuate their world and retreat to the ships in the hangar bay. However, upon reaching it, they discovered that all the ships had been sabotaged, whereupon they learned that someone had betrayed them. The King decided to stall the invaders while his people repaired the ships but, upon exiting the hangar bay, he uncovered that the group of hostiles attacking them had been slain by Jedi Master Luke Skywalker, who had arrived to help the Artorian people."}, {"tag": "p", "text": "Despite the overwhelming attack, a small force from the New Republic, along with the New Jedi Order, managed to arrive on the planet in order to assist with the evacuation. Master Skywalker was able to arrive at the hangar bay of the besieged Artorian people and defeat the Yuuzhan Vong attacking the facility. After meeting with King Galfridian, Skywalker attempted to convince him to evacuate. While the King was willing to allow his people to leave, he himself decided to stay behind to fight for his home. The Yuuzhan Vong in the meantime had deployed heavy forces to the planet which included their feared Fire Breathers that ravaged the cities on Artorias."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As King Galfridian continued to fight the invaders, his loyal aide Dulac was wounded by an amphistaff attack that was aimed for Caled. Caled remained behind to form the Artorias resistance to combat the invaders rule of the planet. At the same time, his son Finn Galfridian was told to evacuate with his people who were protected by a team of New Republic troopers. However, Skywalker sensed that the boy had a presence in the Force and decided to take him to Yavin 4 so that he could be trained at the Jedi Praxeum in order for him to become a Jedi."}, {"tag": "p", "text": "Meanwhile, Nina and Kaye Galfridian were captured by the extragalactic invaders who had captured many members of the populace as well as herded them into a slave ship. With this action, the world of Artorias was one of many that had fallen to the Yuuzhan Vong."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}