{"url": "Storyteller_(comic)", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 19"], "nodes": [{"tag": "h1", "text": "Storyteller  (comic)"}, {"tag": "p", "text": "\"Storyteller\" is an 8-page comic featured in Star Wars Tales #19."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sometime long after the Battle of Yavin, the wicked Vindar have forced their neighboring race into slavery and rule them with an iron fist. The Vindar have tortured, burned, and killed many members of the other race, thus breaking the spirits of most of the race's people—but not that of Otalp. Since he was young, his den-mother told him of the mysterious \"Oracle\" she saw in one of her visions. The Oracle is said to tell tales of the past to give hope for the future. Otalp's den-brother, Remoh, disagrees with this, but only travels with Otalp to escape the misery of their eternal slavery."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "When they reach the cave where The Oracle is fabled to live, Remoh says \"I have a bad feeling about this.\" As they enter the cave, they come across a certain protocol droid sputtering about a tragedy that occurred when he was last deactivated. The droid says strange words, like \"Ar-Too\" and \"Master Luke\", which confuses the brothers. As soon he starts talking in a understandable language, Otalp requests a story from him. Though the droid admits to being not that good a storyteller, he decides, because Otalp and Remoh came so far, to tell them the best story he knows. The story of young boy from a desolate planet who redeemed a darkened soul and freed the galaxy from the clutches of the ultimate evil using a mythical tool known as a \"lightsaber\". As the droid tells this story, the two brothers imagine it all as though it were their own kind who were fighting the fights."}, {"tag": "p", "text": "Just after the storyteller has concluded his tale, the Vindar blasts his head off. While Remoh hides, Otalp claims that he came alone. The Vindar kills him and leave to attend other matters. As Remoh gazes over the petrified corpse of his brother, he notices an oddly shaped metal rod poking out of the storyteller's severed torso chest. Remoh notices it has a button and pushes it. A glowing, green blade appears from the rod. Realization dawning on him, he starts to think of a way to free his desolate planet from the clutches of their ultimate evil."}, {"tag": "p", "text": "A new era has begun..."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Remoh is Homer spelled backwards, and Otalp is a reverse spelling of Plato. The setting of a cave where the protagonists gain new insight is reminiscent of Plato's Allegory of the cave."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}