{"url": "Battle_of_Atollon", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Battles in the Lothal sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Atollon"}, {"tag": "p", "text": "The Battle of Atollon, also known as the Siege of Atollon or as the attack on Atollon, broke out in the year 2 BBY[source?] between the Alliance to Restore the Republic with the Galactic Empire and the Force-sensitive being known as Bendu on and above the planet Atollon during the Galactic Civil War. It started when Grand Admiral Thrawn discovered the location of Chopper Base, the headquarters of the Phoenix Cell. Thrawn's fleet blockaded Atollon, trapping both Phoenix Squadron and General Jan Dodonna's Massassi Group. Thrawn's fleet inflicted heavy casualties on the two rebel forces. However, Commander Jun Sato's decision to ram Admiral Kassius Konstantine's Interdictor vessel allowed the rebels Ezra Bridger and Chopper to escape and seek help."}, {"tag": "p", "text": "During the second phase, Thrawn's forces launched a ground assault, after an orbital bombardment, in an attempt to wipe out the remaining rebel forces. Meanwhile, Ezra succeeded in enlisting the help of Sabine Wren, Fenn Rau, and several members of Clan Wren in destroying Thrawn's second Interdictor cruiser. Despite Thrawn storming Chopper Base, Captain Hera Syndulla and General Dodonna managed to escape with the surviving rebel fleet into space."}, {"tag": "p", "text": "The rebels, and Imperials alike, were attacked by an angry Bendu, an enigmatic being, who used his Force powers to devastate Chopper Base before being subdued by Thrawn. The surviving rebel forces led by Syndulla and Dodonna fled to Yavin 4."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 BBY, the Phoenix Cell discovered the planet Atollon due to the efforts of the rebel C1-series astromech droid Chopper and the former Imperial inventory droid AP-5. The rebels built a base called Chopper Base in the Atollon Coral Mesa in Chopper's honor. By 2 BBY, the Imperial tactician Grand Admiral Thrawn had turned his attention to the rebel insurgents in the Lothal sector."}, {"tag": "p", "text": "During an undercover mission on Lothal, the rebels Ezra Bridger, Kanan Jarrus, and Chopper learned about Thrawn's plan to build a TIE Defender prototype fighter. The rebels were also aided by the rogue Imperial Security Bureau Agent Kallus, who had become a rebel spy known as Fulcrum. Kallus had become sympathetic to the rebellion after meeting the rebel Garazeb Orrelios on Bahryn."}, {"tag": "p", "text": "Thrawn also learned that the rebels had a spy within the Imperial ranks. His search for the rebel spy Fulcrum coincided with his search for Chopper Base, which involved the use of E-XD-series infiltrator droids and an IGV-55 surveillance vessel. However, the rebels frustrated the Empire's efforts at locating Chopper Base on both these occasions. Despite Kallus' efforts to escape detection by framing Lieutenant Yogar Lyste as Fulcrum, Thrawn realized that Kallus was the real spy but allowed him to continue operating in order to draw the rebels out of hiding."}, {"tag": "p", "text": "Thrawn's spies later discovered that the Phoenix Squadron and the Massassi Group were planning to launch a coordinated strike against the TIE Defender factory on Lothal. After learning that the two fleets were massing somewhere, Thrawn saw this as a chance to destroy the rebellion with one swift strike. Thrawn allowed Kallus to eavesdrop on the meeting and then caught him in the act of trying to transmit information to the rebels. After capturing Kallus, Thrawn used the trajectory of General Dodonna's fleet and the trajectory of Kallus' Fulcrum transmission to find the location of Atollon. Thrawn then dispatched Admiral Kassius Konstantine and the Seventh Fleet to Atollon's coordinates."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Trapped on Atollon"}, {"tag": "p", "text": "Thrawn's Seventh Fleet blockaded the Atollon system, trapping Phoenix Squadron and General Dodonna's forces. Dodonna's Massassi Group consisted of three Braha'tok-class gunships, three EF76 Nebulon-B escort frigates and three CR90 corvettes; as well as Phoenix Squadron's fleet which consisted of four CR90 corvettes, three Hammerhead corvettes, two GR-75 medium transports and a Quasar Fire-class cruiser-carrier .In addition, Konstantine jammed all long-range transmissions, preventing the rebels from calling for outside help. General Dodonna ordered his fleet to retreat to hyperspace but the Grand Admiral had dispatched two Interdictor vessels. Konstantine's Interdictor-class Star Destroyer activated its gravity well projectors, preventing the rebel fleet from jumping into hyperspace."}, {"tag": "p", "text": "Admiral Konstantine ordered the fleet to blast the first Nebulon-B frigate that had been pulled out of hyperspace. Shortly later, Grand Admiral Thrawn arrived on his command ship Chimaera with Governor Arihnda Pryce and the captive Kallus. Knowing General Dodonna, Thrawn deduced that the rebel commander had not been on the first frigate because he was a courageous man. Thrawn then issued a message via hologram vowing to rain down utter defeat on the rebel commanders Sato, Dodonna, and Syndulla and to end the rebellion today. All three rebel leaders refused to surrender and vowed to fight to the end."}, {"tag": "p", "text": "Knowing that the rebel fleet was unable to break through Thrawn's blockade, Captain Syndulla proposed launching a diversionary attack in order to allow one of their ships to flee into hyperspace with news of the siege of Atollon. Ezra Bridger and Chopper were picked for the mission and the two were assigned the late Maul's Gauntlet starfighter Nightbrother, which had been renamed Gauntlet. Meanwhile, Kanan traveled into the wilderness to seek the enigmatic being Bendu's help."}, {"tag": "h3", "text": "The space battle"}, {"tag": "p", "text": "Putting Hera's plan into action, Commander Sato ordered the rebel ships to assume spearhead formation and to deploy their starfighters. The rebel ships would protect Ezra's Gauntlet as they tried to force an opening through the Imperial formation. However, Thrawn anticipated Sato's move and ordered his fleet to reinforce the center and to deploy TIE fighters into the fray. Despite Konstatine's complaints, Thrawn refused to attack the rebels with overwhelming force since he was familiar with their unconventional and reckless tactics."}, {"tag": "p", "text": "Rebel Y-wings from Green Squadron managed to damage one of Thrawn's Star Destroyers, the Dark Omen, with proton bombs, but were soon overwhelmed by TIE fighters. Imperial firepower from the capital ships and TIE fighters led to the destruction of several rebel ships, including three CR90 corvettes, a second Nebulon-B frigate, the Braha'tok-class gunship Orion, and numerous starfighters."}, {"tag": "p", "text": "With the rebels unable to break through the Imperial lines, Commander Sato ordered his crew to abandon the Quasar Fire-class cruiser-carrier Phoenix Nest. He and two crew who volunteered to stay behind then flew towards the center of the Imperial formation. Seeking to gain glory for himself, Admiral Konstatine defied Thrawn's orders and brought his interdictor cruiser out to intercept Phoenix Nest. Sato then rammed his ship into the interdictor, destroying both ships and all hands aboard. Sato's sacrifice allowed Ezra and Chopper to flee on the Nightbrother into hyperspace."}, {"tag": "h3", "text": "Seeking help"}, {"tag": "p", "text": "Having escaped the Imperial blockade and jumped into hyperspace, Ezra tried to petition Mon Mothma for help. However, the rebel leader was unable to send reinforcements since she did not want to expose the Rebel Alliance's true strength to Thrawn. In desperation, Ezra and Chopper traveled to the planet Krownest to seek the help of their rebel comrade Sabine Wren and her family Clan Wren; who were locked in a civil war against the Imperial-backed Clan Saxon."}, {"tag": "p", "text": "At the Wren Stronghold, Countess Ursa Wren, Sabine's mother, were unable to provide assistance since they were bogged down against Clan Saxon's forces. After some discussion, Ursa agreed to allow her daughter Sabine, her son Tristan, as well as Fenn Rau to lead several Mandalorian volunteers and ships to accompany Ezra and Chopper back to Atollon. The Gauntlet and several Fang fighters traveled back to Atollon. Their plan was to destroy the second remaining interdictor cruiser so that the remaining rebels could escape offworld."}, {"tag": "p", "text": "Meanwhile, Kanan had much less success in convincing Bendu to aid the rebels. The enigmatic Force-wielder was ambivalent to the wars and problems of the mortal realm and was angered that Kanan had brought war to Atollon. After Kanan failed to reason with Bendu, he accused the creature of cowardice. This enraged Bendu and he vowed to destroy the Jedi in accordance with the will of the Force. Bendu disappeared and Kanan traveled back to Chopper Base on his speeder bike just as storm clouds began to gather."}, {"tag": "h3", "text": "The ground assault"}, {"tag": "p", "text": "Following the space battle, the remaining rebel forces retreated to Chopper Base to regroup and rest. The rebels Zeb and Rex managed to activate Sabine's prototype deflector shield generator. To test the mettle of the rebels, Thrawn ordered his fleet to bombard the shield. While the shield managed to protect the base and rebel ships, the generator was weakened by the assault. Thrawn then decided to deploy ground forces to finish off the surviving rebels."}, {"tag": "p", "text": "At the advice of General Dodonna, the rebels decided to ambush Thrawn's forces along a narrow canyon leading to the Atollon Coral Mesa. Zeb and Rex planted detonators along the road which they used to blow up several AT-DP walkers. However, Thrawn had sent the AT-DPs as decoys to draw out the rebel defenders. He then deployed his heavy battalions, which included several AT-AT walkers. Thrawn also ordered the walkers' gunners to mark the enemy mines in firing position. Stormtroopers accompanied the heavy walkers, as well as Imperial Troop Transports."}, {"tag": "p", "text": "Kanan managed to damage one of the walkers by slicing off two of its legs but failed to slow the Imperial advance. He along with Zeb and Rex fled into the caves which led back to the coral mesa that housed Chopper Base. Rebel starfighters including Wedge Antilles and Hobbie's A-wings tried to attack the walkers but were driven away by TIE fighters. Thrawn and a contingent of death troopers then disembarked from a Sentinel-class landing craft and led the Stormtrooper assault on Chopper Base. Meanwhile, Governor Pryce commanded the Imperial fleet above."}, {"tag": "p", "text": "With the base breached, General Dodonna and Captain Syndulla ordered the remaining rebel ships to evacuate. Two ships managed to escape but a GR-75 medium transport was shot down by one of Thrawn's AT-AT walkers. Thrawn then surrounded the Spectres, Rex, AP-5 and General Dodonna and demanded their surrender. However, the Bendu arrived in the form of a storm cloud and attacked the Imperials and rebels with lightning. Hera and the remaining rebels fled on the Ghost and other ships for space. In his wrath, Bendu struck down one of the fleeing A-wings as well as managing to destroy two AT-AT walkers and numerous other grounded rebel starfighters."}, {"tag": "h3", "text": "Escaping the blockade"}, {"tag": "p", "text": "In space, Ezra, Chopper and their Mandalorian allies launched an attack on the flanks of Thrawn's fleet. While Fenn Rau's Fang fighters harried the TIE fighters, Ezra and Sabine flew the Gauntlet to the second Imperial interdictor cruiser. While Chopper stayed aboard, Ezra and the Mandalorians landed on the interdictor's hull and proceeded to attack the gravity well projectors. In response, Governor Pryce dispatched Jumptroopers but these reinforcements failed to stop the Mandalorians from destroying the cruiser."}, {"tag": "p", "text": "The destruction of the interdictor cruiser coincided with Hera and the remaining rebel ships reaching the space around Atollon. The rebel convoy then fought their way a second time through the Imperial blockade. Without the interdictor, there was nothing to stop them from jumping into hyperspace. Hera and the crew of the Ghost managed to rescue the former ISB agent Kallus, who had escaped in an escape pod. After breaking through the blockade, the rebel ships jumped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The rebels had fled Chopper Base to orbit with two CR90 corvettes (including the Liberator), two Hammerhead corvettes (P1 and P3), a GR-75 medium transport, a Braha'tok-class gunship and the Ghost, but enemy fire from the blockade left only the Liberator, both Hammerheads and the Ghost, joined by two surviving Y-wings, four surviving A-wings, the Gauntlet and Mandalorian Fang fighters, able to escape into hyperspace."}, {"tag": "p", "text": "On the surface, after the rebels fled, Bendu demanded that Thrawn leave but the Grand Admiral was not intimidated by the Force entity. He directed his troops and AT-AT walkers to shoot down the \"eyes\" in the middle of the storm clouds. This tactic worked and the Imperials succeeded in shooting down Bendu despite losing several men and one AT-AT in the process. Thrawn and his men later confronted the fallen but still defiant Bendu. The Bendu prophesied that Thrawn would eventually meet defeat but the scientifically-minded Thrawn refused to take him seriously. Thrawn shot Bendu with his blaster but the creature warned that he was beyond the Grand Admiral's power to destroy, his body vanishing but his voice still heard."}, {"tag": "p", "text": "The Battle of Atollon was a serious defeat for the fledgling Rebel Alliance. Unknown to Thrawn, the Phoenix Squadron and Dodonna's Massassi Group were not the only rebel forces in the galaxy. Mon Mothma's decision not to send reinforcements concealed the true strength of the Alliance. However, Phoenix Squadron and Massassi Group sustained heavy casualties on Atollon. Chopper Base was lost and much of its facilities were damaged by the fighting and Bendu's rampage. Hera led the surviving rebel forces to Yavin 4. To hide their tracks, the rebels jumped into hyperspace three times."}, {"tag": "p", "text": "While the rebels were demoralized by the defeat, some like Jarrus were determined to continue the fight to free the galaxy from Imperial rule. Despite inflicting heavy casualties on the rebel fleet through his cunning strategies, Thrawn failed to fulfill Grand Moff Wilhuff Tarkin's orders to capture senior rebel officers. The Battle of Atollon was seen as a failure in the eyes of Emperor Palpatine and Darth Vader, due to the rebel's escape. Palpatine understood that the rebel's escape was beyond Thrawn's control and not his fault, but Vader had no patience for failure no matter the reasons."}, {"tag": "p", "text": "Bendu's prophecy about Thrawn's defeat ultimately came true during the liberation of Lothal. The Rebel Alliance would continue to pose a serious threat to the Empire over the next couple of years leading up to the Battle of Yavin. The growing threat of the Alliance led the Empire to deploy its new Death Star superweapon in an attempt to crush the rebellion."}, {"tag": "p", "text": "Ultimately, Jarrus's dream was realized with the deaths of both the Emperor and Darth Vader during the Battle of Endor in 4 ABY. The Alliance's successor, the New Republic, later inflicted a lasting defeat on the Empire during the Battle of Jakku in 5 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Atollon formed the basis of the March 2017 episodes \"Zero Hour,\" part of the third season of the animated television series Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}