{"url": "Strokill_Prime", "categories": ["Category:Canon articles", "Category:Galactic Empire planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Strokill Prime"}, {"tag": "p", "text": "Strokill Prime was a waterworld where the Galactic Empire operated an underwater base. The Mon Calamari king Lee-Char was kept prisoner in the base on Strokill Prime, but was killed by stormtroopers during a Rebel Alliance rescue attempt."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in a system with one star, Strokill Prime was covered in vast oceans, with icebergs floating in the water. The planet had a solid sea floor, which was made up of rock formations. Opee sea killers inhabited Strokill Prime's oceans."}, {"tag": "p", "text": "The planet was used as a prison world by the Galactic Empire, who operated from an Imperial base situated underneath the water. The planet was orbited by many atolls, defense platforms used to secure the Imperial prison."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Imperial occupation of the planet Mon Cala, Mon Calamari King Lee-Char was taken by the Galactic Empire and imprisoned in the base on Strokill Prime. At some point during his imprisonment, his condition deteriorated to a point where he needed to be hooked up to life support machines to be kept alive."}, {"tag": "p", "text": "As part of a mission to recruit the Mon Cala Mercantile Fleet to their cause, Princess Leia Organa and her team of rebels, consisting of Luke Skywalker, Han Solo and the Wookiee Chewbacca, went to Strokill Prime to rescue Lee-Char. To infiltrate the Imperial base, they captured Tan Hubi, Moff of the Calamari sector, in order to use his biosignature to enter the atmosphere without being shot by the atolls orbiting the planet."}, {"tag": "p", "text": "After evading an Opee sea killer, they successfully entered the base and located Lee-Char, discovering the machines that kept him alive. As Lee-Char recorded a speech to send to his people, Hubi secretly put the base onto alert, and stormtroopers entered the cell, firing at them. Both Lee-Char and Hubi were killed in the crossfire, while Organa and her team escaped with the recording, which was taken by Regent Urtya."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Galactic Empire operated a high-security prison on Strokill Prime, located within the planet's ocean. A security check was needed to both pass by the orbiting atoll defenses, and to enter the base itself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Strokill Prime first appeared in Star Wars 46, a canon comic written by Kieron Gillen, illustrated by Salvador Larroca, and published on April 4, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}