{"url": "Strill", "categories": ["Category:Legends articles", "Category:Carnivorous creatures", "Category:Creatures of Mandalore", "Category:Domesticated creatures", "Category:Flying creatures", "Category:Hermaphroditic creatures", "Category:Jungle and forest creatures", "Category:Mammals", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Strill"}, {"tag": "p", "text": "Strills were a species of highly intelligent, carnivorous mammals native to the planet of Mandalore in the Outer Rim. The one-meter-long, six-legged creatures, with their loose folds of leathery skin, were generally considered physically unattractive by many beings, and their uniquely pungent odor was off-putting to most male humanoids. However, a number of Mandalorians took to keeping strills—or striile in Mando'a—as pets, making use of their naturally ferocious predatory instincts as hunting animals, and the long-lived creatures often became life-long companions of their Mandalorian masters. One such strill by the name of Lord Mirdalan was the constant partner of the Mandalorian soldier Walon Vau, and the two were nearly inseparable until the time of Vau's death, whereupon the affectionately nicknamed \"Mird\" was entrusted to close friend Jaing Skirata for care. Both doted upon the creature, and in return, enjoyed fierce loyalty from the strill. Strills also behaved in a maternal fashion in the presence of a pregnant female or infant, a trait owed to their hermaphroditic characteristics, and one which manifested in an innate protectiveness toward the female or youngling, and an instinct to construct a nest."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Strills were a species of predatory animals indigenous to the Outer Rim world of Mandalore, measuring close to a meter in length, on average. Hermaphroditic mammals, strills were equally capable of both siring and bearing offspring with a second strill; young strills were commonly referred to as pups. Covered in thick fur of a gold or gray-tan color, strills possessed numerous folds of loose, leathery skin that stretched all the way to its thin, whip-like tail. These skin folds could be used to form wing membranes between their six strong legs, that allowed the creatures to glide from high places and even fly short distances by flapping their legs in unison. Furthermore, strills were capable of carrying substantial loads while flying, including the weight of a full-grown Human male. Strills could live up to three or four times the span of a natural human's lifetime, and it was common for Mandalorian owners to entrust their beloved pets to their clan kinsmen following their deaths."}, {"tag": "p", "text": "Strills had gold-colored eyes, gray tongues, and sharp claws. Their wide mouths were filled with sharp fangs, perfectly adapted for a carnivorous diet and powerful enough to bite through skull bone; they were also known for the abundant amount of saliva which they excreted. Strills could withstand significantly cold temperatures for extended periods of time, and their hearing was far more acute than a Human's. Aside from these features, one of the most identifiable traits of a strill was the strong, acrid stench they gave off. To male Humans, the smell was often considered repulsive, but an individual could become acclimated to the scent with continued exposure. Human females and non-humanoid species, though, did not find the strill's scent displeasing, contributing to its continued effectiveness as a hunter. Unfortunately, strills were susceptible to brain tumors which could, as a result of their presence, drive the animals to irrational acts of anger and aggression, even to the point of attacking their owner."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Strills were highly intelligent creatures, capable of understanding verbal commands and intuiting the feelings of those sentients around it. They made a variety of noises, including baying while hunting, whines and moans when under stress, and squeaks and low grumbles when pleased. Strills were territorial creatures, marking the areas they claimed as their own by rubbing their saliva-covered jowls and spraying from their strong scent glands around a chosen perimeter. Domesticated strills rarely left their owners, but occasionally did roam within the boundaries of their predefined territory independently. Their hermaphroditic nature gave strills a strong maternal instinct, and they could often sense when a nearby female was pregnant. Despite their predatory ferocity, strills were extremely protective of their young and the offspring of those within its social sphere. Human infants had no need to fear a nearby strill and, in fact, strills were known to construct nests for human children just as they would for their own pups, using clothing, blankets, or any other soft materials that were readily available."}, {"tag": "p", "text": "Strills were skilled trackers and fierce hunters, capable of taking down prey larger than themselves, such as shatuals, with whom they shared their forest habitat. Strills could carry the carcass of their downed prey a significant distance back to their abode. The set of sharp claws located on each paw allowed a strill to climb the sides of buildings and trees, where they would wait to ambush a potential target from overhead. Once the prospective prey was within range, the strill leaped from their high perch and, using their leathery wings formed from their loose folds of skin, glided through the air, swooping down for the kill. Strills were known to enjoy milk as well as meat, and preferred to eat their own kill after a hunt, though they were not opposed to sharing the spoils with its owner and associates. Strills also hunted to acquire food for its young or any offspring it felt solicitous toward. When domesticated, strills were extremely loyal and protective of their masters and their surrounding families."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Indigenous to the planet Mandalore, strills adapted to living and hunting in the Outer Rim world's veshok forests. During the course of Mandalore's long history, the Mandalorian people took to capturing strills, domesticating them, and keeping the creatures as pets. Their intelligence, hunting skills, and incredible loyalty were praised by their Mandalorian masters, and it was not uncommon for the long-lived animals to be passed down through a clan's generations. In the Mandalorian language of Mando'a, the word for strill was striil."}, {"tag": "p", "text": "One strill by the name of Lord Mirdalan—often known by the affectionate nickname of Mird, or Mird'ika—was the friend and pet of the Mandalorian soldier Walon Vau. Mird had been with Vau for the majority of his life leading up to the final years of the Galactic Republic, and was his near constant companion. The strill followed Vau to the aquatic world of Kamino when he was chosen by Jango Fett to be a member of the Cuy'val Dar, a group of training sergeants tasked with training the Grand Army of the Republic's special forces clone commandos, and it was on Kamino that Mird developed an enjoyment for stalking Kaminoans within Tipoca City. On one occasion, the strill even killed a Kaminoan who was a member of the blue-eyed lower caste. When the Clone Wars broke out between the Republic and the Confederacy of Independent Systems, Mird joined Vau and a number of clone commandos in helping to bring down a Jabiimi terrorist cell responsible for a number of bombing attacks on Coruscant. After Vau shot and killed the terrorist leader, Mird was responsible for recovering the body and the criminal files held with it."}, {"tag": "p", "text": "In the second year of the Clone Wars, Vau raided the Dressian Kiolsh Merchant Bank on the InterGalactic Banking Clan world of Mygeeto, in order to steal the inheritance his estranged mother and father had denied him when he left home to join the Mandalorians. During the course of his escape from the bank, Vau fell through the Mygeetan ice; Mird refused to abandon its master and attempted to keep Vau warm with its own body until rescue arrived in the form of fellow Cuy'val Dar member Kal Skirata, who extracted the strill and its master to safety. Etain Tur-Mukan, whom Skirata would later adopt, had her son Venku later that year, and Mird subsequently became very protective of the child. He also built nests for the baby on a number of occasions, collecting sheets and clothing from its human companions in order to do so. The strill later became a resident of Skirata's clan home on Mandalore, Kyrimorut, marking the land around the farm and homestead as its own, and preferred to spend its time hunting or simply laying about, basking in the attention of its master and the other residents of Kyrimorut."}, {"tag": "p", "text": "As of the year 40 ABY, strills had become a rare sight on Mandalore, to the point which they were thought to be nearly extinct. By that time, Lord Mirdalan had entered into the possession of Kal Skirata's adopted son, Jaing Skirata, entrusted to him upon the death of his former master, Vau. Mird continued to act as Skirata's partner in his exploits as a bounty hunter, and in 41 ABY, the two attended a feast in honor of the wedding of Ghes Orade and Mirta Gev held in Mandalore's capital city, Keldabe. During this time, the Oyu'baat hotel and tapcaf in Keldabe displayed a sign over the front door in which the words \"No Strills Inside\" was inscribed in both Mando'a and Basic. However, bar patron Baltan Carid jovially suggested on one occasion that a strill was, in fact, the resident of the Oyu'baat's executive suite, and would need to be kicked out before the room could be rented to anyone else."}, {"tag": "p", "text": "At some point in time, another strill had been kept by a friend of the former Jedi-turned-Mandalorian by the name of Gotab. The strill was beloved by its owner, but the creature eventually developed a malignant brain tumor that drove it to irrational acts of aggression. After the strill attacked several people—including both Gotab and it's owner—the decision was made to euthanize the animal in order to end its suffering and bring an end to the strill's unintended violence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The strill was first introduced to the Star Wars universe via a mention in the 2004 novel, Republic Commando: Hard Contact, by author Karen Traviss. The initial vague reference to an animal adept at hunting and tracking would later be fully realized in the novel's sequel, Triple Zero, where the strill known as Lord Mirdalan made its debut. Lord Mirdalan went on to become a recurring character in Traviss' Republic and Imperial Commando series, featuring in the subsequent True Colors, Order 66, and Imperial Commando: 501st novels."}, {"tag": "p", "text": "To date, Lord Mirdalan has been the most prominently featured strill in the Star Wars universe. The species received its first official visual depiction in the form of a sketch of Lord Mirdalan, created by artist Shea Standefer for the trading card set 2010 Topps Star Wars Galaxy Series 5. Another image of a strill was later included in the 2010 Star Wars RPG supplement book, The Unknown Regions, published by Wizards of the Coast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}