{"url": "Strilath_Farles", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Meatlumps"], "nodes": [{"tag": "h1", "text": "Strilath Farles"}, {"tag": "p", "text": "Strilath Farles was a Human male Meatlump criminal who lived in the Corellian system during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Strilath Farles was a lieutenant in the Meatlump gang, a Corellian band of anti-technology thugs. After the Battle of Yavin, he was leading a group of Meatlumps based on the planet Talus. Farles had relocated from Corellia to Talus since he was engaged in a violent conflict with a group of Ragtag criminals led by Gramo Murah."}, {"tag": "p", "text": "Around 1 ABY, the Meatlumps on Talus attacked Sul Prine's house near the city of Dearic and smashed several speeder bikes. When Vani Korr, a Corellia Times reporter who was investigating the Meatlumps, learned of this attack, she tasked a spacer to investigate. The spacer met Sul Prine and then used a map lost by one of the Meatlumps during the attack to localize their camp. The adventurer attacked the camp, killing some Meatlumps in the process, and forced the others to reveal the identity of their leader: Strilath Farles."}, {"tag": "p", "text": "In the meantime, Strilath Farles was on Corellia. The man had traveled to the city of Doaba Guerfel in order to search the Meatlump Hideout; as he did not manage to remember its location. Also looking for the Meatlump Hideout, the spacer confronted Strilath Farles in Doaba Guerfel. Defeated, the criminal accepted to exchange information with the spacer if the latter accepted to rid him of some Ragtags. The spacer thus attacked the Ragtag Base in the Nomad Mountains and killed Gramo Murah and his goons. When the spacer returned to Doaba Guerfel, Strilath Farles still ignored the location of the Meatlump Hideout and preferred to flee rather than suffering the wrath of the spacer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Strilath Farles appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Strilath Farles was added to the game with the update dubbed \"Chapter 10: The Search for the Meatlump King\", released on June 19, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}