{"url": "Strulka", "categories": ["Category:Canon articles", "Category:Articles with gameplay alternatives", "Category:Advozsec", "Category:Galactic Republic military officers", "Category:Imperial defectors", "Category:Males", "Category:Members of the Smuggler's crew", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Strulka"}, {"tag": "p", "text": "Strulka was a male Advozse who lived during the last decades of the Galactic Republic. At some point in his life, Strulka joined the Republic Military, where he went on to become a decorated soldier, who favored taking the offensive in battle. Possessed of notable leadership skills, Strulka eventually attained the rank of colonel. Following the Republic's transformation into the new Galactic Empire, Strulka continued to serve the new political regime, and was afforded a number of favorable opportunities by the Empire. However, the colonel ultimately realized that the Imperials did not suit his ideals, and turned away from the Empire."}, {"tag": "p", "text": "By the time of the second Death Star's destruction, the former colonel resided in the Anoat sector, where he became trapped following the enactment of the so-called Iron Blockade of the sector by Imperial Governor Ubrik Adelhard."}, {"tag": "p", "text": "Looking for a way to help others, Strulka joined the crew of a rebellious young smuggler, and carried out various missions on the smuggler's behalf throughout the Anoat sector."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Colonel Strulka first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Strulka acts as a potential crewmate for the player character, able to be tasked with carrying out timed quests to recover valuable experience points and loot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}