{"url": "Stu_Hemphawar", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Stu Hemphawar"}, {"tag": "p", "text": "Stu Hemphawar was a male Human smuggler working in the Core Worlds during the waning years of the Galactic Republic. After a bounty was placed on his head he and a large number of other death stick dealers he was associated with were captured by the bounty hunter Jango Fett in 32 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Stu Hempawar was a small time smuggler who worked in the Core Worlds during the final decades of the Galactic Republic and by the year 32 BBY he had begun doing some work out of the planet Coruscant, the galactic capital. On Coruscant he became affiliated with two accomplices, Oejoe Hitewa and Ruceba Ahid, who he took up residence with in a small apartment near the Uscru Entertainment District. The trio became implicated in a scheme to traffic a number of illicit goods through out the Core Worlds and for this the Senate Bureau of Intelligence placed a bounty on each of their heads. The bureau offered a reward of 3,000 for the capture of Hempawar alive but would pay nothing for his death. In 32 BBY the Mandalorian bounty hunter Jango Fett traveled to Coruscant while trying to track down information on the Bando Gora, a secretive cult believed to be involved in the Death stick trade and lead by the former Jedi Komari Vosa. He started his search by tracking down the Death stick dealer Jervis Gloom in the entertainment district due to his knowledge about the Death stick trade. Whilst in the Uscru district Fett encountered Hemphawar who attempted to flee from the bounty hunter unsuccessfully. Fett successfully captured him and also managed to subdue Hitewa and Ahid whilst in the district, claiming all three of the bounties on the smugglers from the bureau of Intelligence."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hempawar was a fair skinned Human male with black hair which he wore in a pony tail. He also grew a beard and had brown eyes. When he encountered Fett on Coruscant he attempted to flee from the bounty hunter instead of fighting him, but was unsuccessful."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}