{"url": "Strong_style", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Lightsaber combat", "Category:New Jedi Order"], "nodes": [{"tag": "h1", "text": "Strong style"}, {"tag": "p", "text": "The strong style of lightsaber combat was a style used by both Jedi and Dark Jedi during the New Republic era, including Kyle Katarn, Desann, and possibly Jaden Korr."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The strong style was based primarily on wide, powerful strikes to batter through an opponent's defenses, sacrificing speed for unrivaled power."}, {"tag": "p", "text": "It could inflict more damage than the other lightsaber forms of its time which, coupled with its range, made it especially effective against single opponents armed with melee weapons. This style was quite destructive, and if a practitioner was presented with an opening, they would almost always land a devastating blow."}, {"tag": "p", "text": "Utilizing the strong style often left one open to counterattacks, putting them at a disadvantage in terms of speed comparisons against faster opponents, although a sufficiently skilled practitioner could mitigate this. It was also not suited for deflecting blaster shots as the stance required that the user shift the blade quite a bit to cover his body. Thus, it was almost solely utilized in lightsaber combat."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Users of the strong style typically utilized an aggressive stance, the lightsaber held high and back, ready to deliver wide, powerful swings. Practitioners with remarkable physical strength such as Desann used a one-handed variant of this style to great effect."}, {"tag": "p", "text": "The strong style emphasized offense, as the stance and windup time for each swing left the user very open to attack. Defense was limited to the user swinging their blade to intercept and overpower their opponent's strike, or blocking and then disarming the opponent, usually with a sharp spin of the blade. Due to being powerful but slow, this style benefited considerably from the use of Force speed."}, {"tag": "p", "text": "The style shared some features with other aggressive styles associated with the Jedi Order—especially the strength-oriented Djem So. It also displayed similarities to the Juyo subset of Form VII, which likewise sacrificed defense for the sake of a more powerful offense, the wide sweeps of Shii-Cho, and Makashi for its precise attacks. Elements of Ataru also seemed to be incorporated, most notably its opening stance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}