{"url": "Battle_of_Bal%27demnic", "categories": ["Category:Legends articles", "Category:Articles with unconfirmed titles", "Category:Battles in the Auril sector", "Category:Battles of the Felucia theater"], "nodes": [{"tag": "h1", "text": "Battle of Bal'demnic"}, {"tag": "p", "text": "The Battle of Bal'demnic was a conflict that occurred during the third and final year of the Clone Wars, instigated by the Confederacy of Independent Systems' attempt to mine cortosis from Bal'demnic's crust. A Galactic Republic task force headed by Jedi Knights Halagad Ventor and Sha Koon was dispatched to prevent the mining."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 67 BBY, Subtext Mining provided Dark Lords of the Sith Darth Tenebrous and Darth Plagueis with secret intel revealing large deposits of cortosis ore within the planet's crust. While investigating this claim, Plagueis murdered his master on Bal'demnic, and glimpsed this battle in a vision of the future. Upon his return to Muunilinst, Plagueis entrusted Larsh Hill to purchase large amounts of Bal'demnic land and acquire mining rights for the cortosis-rich mainland. Many years later during the Outer Rim Sieges, the Confederacy moved in with their mining operations and military. This maneuver also facilitated the Confederacy's strategy to lure Republic forces away from the Core Worlds during the final stages of the war."}, {"tag": "p", "text": "In the face of the Confederate armed forces, the native Kon'me leaders were given little choice but to allow a major mining operation to proceed. Jedi intelligence managed to intercept leaked Confederacy communications, which alerted them to the situation on Bal'demnic. Mace Windu knew full well that if cortosis fell into the hands of Confederacy, the ramifications for the Jedi would be disastrous. The Jedi High Council appointed Halagad Ventor and Sha Koon to lead a battalion of clone troopers with several other Jedi in an important mission to sabotage the mining operation."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Although the native Kon'me leaders allowed the Confederacy mining operations to begin, the citizens were not so easy to persuade. An uprising ensued, and the Kon'me began attacking the Confederate forces with powerful weapons provided by war profiteers. The Confederacy responded, unleashing their B1-Series battle droids upon the rebellious Kon'me. OG-9 homing spider droids scaled the planet's cliffs and destroyed many of the natives' weapon emplacements. Despite their heavy losses, the Kon'me were able to hold their own against the mechanical intruders, and a full-fledged battle erupted."}, {"tag": "p", "text": "When Halagad Ventor's Republic task force arrived in the skies of Bal'demnic, his ARC-170 starfighters met immediate resistance in the form of Confederacy Droid tri-fighters. When the air skirmish was over, Halagad and his troops landed with the intent to assist the natives. With all these foreign forces on their planet, the natives were further enraged to the point of total frenzy. In their final bid to drive the outlanders off their precious world, the Kon'me did not differentiate between Republic and Confederate forces in their powerful counter-attack. With the Confederate forces now under fire from two sides, and also being hindered by the planet's difficult terrain, they made a full retreat. Ventor and Koon, who had no desire to return fire on the hostile natives, also ordered a retreat of their forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Republic left a small fleet in Bal'demnic's orbit, establishing a planetary defense blockade to prevent any further Confederacy intrusions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was first briefly glimpsed in Clone Wars Chapter 22. Arthur Papadam established the details of the battle in Bal'demnic's Databank entry, via the What's The Story? campaign. James Luceno further elaborated upon the battle's background in Darth Plagueis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}