{"url": "Subjugation_of_Naldar", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Phelleem sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Subjugation of Naldar"}, {"tag": "p", "text": "The subjugation of Naldar by the Galactic Empire occurred during the Galactic Civil War."}, {"tag": "h2", "text": "The campaign"}, {"tag": "h3", "text": "Initial assault"}, {"tag": "p", "text": "The initial assault of the Imperial forces on the planet Naldar took place in 2 ABY. Prince Denin was killed while defending the rest of the royal family. However, his sister – Princess Vila – decided to impersonate her deceased brother in order to continue the fight. In spite of the early Imperial successes, Naldar forces managed to resist the invasion and the capital city was heavily fortified."}, {"tag": "p", "text": "Following the invasion of Belderone, the Dark Jedi Flint joined the Empire and was placed in charge of the Naldar invasion force by Darth Vader. After the death of Vader, he would become the apprentice of the Dark Lady of the Sith Lumiya."}, {"tag": "h3", "text": "Final assault"}, {"tag": "p", "text": "After the Battle of Endor, Lumiya tasked Flint to conquer the entire Phelleem sector and kill Luke Skywalker while she prepared the Nagai invasion of the galaxy. Thus, the final Imperial assault on Naldar came soon after the Declaration of the Alliance of Free Planets. Hearing news about the Rebel victory, Princess Vila came to Endor in order to require assistance from the Alliance of Free Planets. Soon after her departure, the Imperial forces managed to take the capital city and slaughtered most of its inhabitants."}, {"tag": "p", "text": "Princess Vila, still impersonated her death brother Denin, was the only member of her starfighter squadron to arrive safe on Endor. However, Admiral Ackbar was unable to dispatch any forces, and the Heroes of Yavin decided to go to Naldar with the Princess. As soon as they arrived, the Millennium Falcon was shot down by a planetary energy cannon. In the ruins of the capital city, they finally discovered the true identity of Vila."}, {"tag": "p", "text": "The Rebels were then ambushed by Imperial stormtroopers and in the ensuing fight, Princess Vila was killed. Luke Skywalker duelled Flint but Flint was eventually redeemed by his old friend Barney. A stormtrooper attempted to execute the Sith Lord for treason but was unsuccessful. Once the Imperial troops were defeated, Flint destroyed the planetary cannon before it could target other planets."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After rejecting the Dark side of the Force, Flint returned to his homeworld Belderone where he lived for years. He was eventually assassinated by his former master Lumiya."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}