{"url": "Subjugation_of_Charis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Subjugation of Charis"}, {"tag": "p", "text": "The subjugation of Charis occurred in 4 ABY, during the Galactic Civil War. The planet Charis, located in the Kathol sector of the Outer Rim Territories, was under Imperial rule during the conflict between the Empire and the Rebel Alliance. In 4 ABY, the population of Charis rebelled and tried to overthrow their Imperial oppressors. Moff Kentor Sarne, ruler of the Kathol sector, ordered a brutal assault, which reduced the population of the planet from 1 billion inhabitants to 850 million and ruined several major cities."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The planet Charis, located in the Kathol sector of the Outer Rim Territories, was part of the territory ruled by the Imperial Moff Kentor Sarne. In 4 ABY, during the Galactic Civil War, the population staged a violent uprising against the Imperial forces on the planet."}, {"tag": "h2", "text": "The subjugation"}, {"tag": "p", "text": "Moff Sarne's reaction to the uprising was swift and violent. Ships from his military forces, including the CR90 corvette Renegade, attacked the planet. By the time the assault was finished and the uprising had been quelled, many of Charis's foremost cities had been devastated and reduced to bombed-out ruins. The death toll was massive—approximately 150 million beings had been killed in the subjugation, reducing the population of the planet from one billion to 850 million."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Four years later, the New Republic successfully liberated Moff Sarne's capital, Kal'Shebbol, forcing the warlord into retreat into the depths of the sector. With the New Republic beginning to spread its influence throughout the region, insurgents and New Republic sympathizers prepared to stage a second uprising to throw off their Imperial oppressors. However, mindful of the devastation that had been visited on them four years previously, they wanted support from the New Republic before acting."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The subjugation of Charis was mentioned in The DarkStryder Campaign, an RPG sourcebook published by West End Games in 1995 as background information regarding the history of the sector. The information on Charis appeared in the section \"Kathol Sector Overview,\" written by Bill Smith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}