{"url": "Subtram/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Trains and railways"], "nodes": [{"tag": "h1", "text": "Subtram"}, {"tag": "p", "text": "A subtram was a vehicle used by the Belugans on the planet Quarzite. It was similar to a hover-train, and was suspended by large rings which it passed through. However, unlike a hover-train, the subtram traveled inside huge crystal caverns because the surface of Quarzite was uninhabitable."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point during the Clone Wars, a subtram was used to transport an abducted Kage female, Pluma Sodi. The Belugan leader, Otua Blank, wanted her to be his bride. However, his forces had been in ineffective against the Kage warriors. Blank, concerned that the Kage would attempt and succeed in stealing Sodi back, hired six bounty hunters, Boba Fett, Bossk, Latts Razzi, C-21 Highsinger, Dengar, and Asajj Ventress, to protect the cargo along with his henchman, Major Rigosso."}, {"tag": "p", "text": "The Kage warriors did attack, and a fierce confrontation between them and the bounty hunters ensued. After quite a fight, Dengar, Bossk, Highsinger, and Razzi were thrown off the subtram. The leader of the Kage, Krismo Sodi, brother of Pluma, killed Rigosso and fought off Fett, knocking him unconscious. While doing this, Krismo opened the box that Pluma was being held in. Then Ventress barged in and defeated the Sodi twins. However, Pluma gained Ventress's sympathy when she told her that she had been ripped away from her home. Ventress too, had been ripped away from her home."}, {"tag": "p", "text": "Ventress bound and gagged Fett and put him in the box. She then delivered the box to Blank, but not before collecting a bounty. She then returned Pluma and Krismo to the Kage warriors, for a price. The subtram made its way back from Otua Blank's stronghold to the station at the entrance to the crystal caverns."}, {"tag": "p", "text": "Coruscant also had its own subtram system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}