{"url": "Battle_of_Belazura", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles in the Colonies", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Belazura"}, {"tag": "p", "text": "This battle on the planet Belazura occurred as a result of the machinations of the Galactic Empire Commander Rezi Soresh. His previous attempts to kill the Rebel Alliance pilot who destroyed the Death Star failed, so Soresh recalled his personal assassin, X-7. The Rebels tracked him to Belazura. Using the mercenary Div, the Rebels tried to turn X-7. X-7 was torn between his master and his new friends. In the battle to destroy the Imperial garrison on Belazura, Soresh ambushed the Rebels. The former Jedi Ferus Olin was forced to kill X-7, but the garrison was destroyed. Imperial leader Darth Vader demanded Soresh's arrest for his failure, but Soresh escaped into exile."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ambitious Imperial Commander Rezi Soresh, an important figure in the bureaucracy, used his personal assassin X-7 to hunt down the Rebel Alliance pilot who destroyed the Imperial superweapon, the Death Star. Previous attempts to kill the Rebel pilot failed, so Soresh recalled X-7 to Belazura for reconditioning."}, {"tag": "p", "text": "During the attempt, X-7 had hired mercenaries to assist him; one of them, Div, was captured by Skywalker. Div was subsequently sprung from the his prison by unknown forces. Skywalker and his companions tracked down Div to Belazura with the help of a former Jedi Padawan and Div's former mentor, Ferus Olin."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Rebels recaptured Div and used him in a plot to turn X-7 to their side; Div acted that X-7 was in reality Div\ns \"brother,\" Trever Flume. The Rebels also planned to destroy the Imperial Garrison on Belazura to liberate the planet. Soresh calculated the Rebel's plan and tried to ambush them."}, {"tag": "p", "text": "When the Rebels attacked the garrison and stymied the ambush, Soresh contacted X-7 to finish his mission. A confused X-7, who had come to accept his possible identity as Flume, shot Div in the shoulder to distract him, and raced to the garrison. To save Skywalker from X-7, Olin stabbed X-7 with his lightsaber, fatally wounding him. Div held X-7 in his arms and told him that he mattered to someone in the end. The Rebels succeeded in destroying the garrison."}, {"tag": "p", "text": "Angered that Soresh had interfered in his own search for Skywalker, Imperial leader Darth Vader ordered him detained, and posted a lieutenant outside Soresh's office. Soresh, rightfully fearing for his life, activated his escape protocol and left Belazura. Angered at the failure, Vader Force choked the Lieutenant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Commander Soresh had to escape Vader's wrath. He spent twenty-seven days on the run until he found sanctuary in the Outer Rim Sixela system. He then set about planning his revenge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in Alex Wheeler's 2010 book Rebel Force: Trapped. The repercussions would extend into the next book, Rebel Force: Uprising, the final in the series. Trever Flume was a character from the Star Wars: The Last of the Jedi series; Rebel Force: Trapped implies X-7 is actually Flume, but does not confirm it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}