{"url": "Sufar", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Qulok's Fist", "Category:Slavers", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Sufar"}, {"tag": "p", "text": "Sufar was a Human male from a Corellian colony world. An outlaw, he was exiled from his home in 2 BBY for committing several murders. On the run from Imperial bounty hunters, he was rescued by Qulok's Fist, a small band of criminals whose operations included bounty hunting, smuggling, slavery, and mercenary work. After killing the hunters who had pursued him, Sufar and Qulok's Fist operated throughout the Outer Rim Territories, the Minos Cluster, and the Kathol sector. The group worked occasionally for Moff Kentor Sarne, the Imperial warlord of the Kathol sector, and engaged the New Republic CR90 corvette FarStar in battle in the Shintel system at his request."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Sufar was born and raised on a Corellian colony world. He became an outlaw, believing that the only way he could continue living was to kill any potential threats to himself. Around 2 BBY, he was exiled from the planet following a string of murders he committed. A bounty was placed on Sufar, and Imperial bounty hunters attempted to collect on it. He was rescued by Qulok's Fist, a small group of criminals and bounty hunters that operated within the Outer Rim Territories, whose membership included Kolig, Padak, and Thanis Gul-Rah. Sufar joined them, and together they captured the hunters that were after him; the Corellian subsequently tortured them to death."}, {"tag": "p", "text": "Sufar and Qulok's Fist conducted operations throughout the Outer Rim Territories, eventually moving into the Minos Cluster and then the Kathol sector. In the Kathol sector, the group was employed by Imperial Moff Kentor Sarne, who had declared himself a warlord during the fragmentation of the Empire following the Battle of Endor. Sufar was also involved in a hunt on a backwater world that devolved into a massacre of the local population. This act caused Thanis Gul-Rah to retire from the gang and take up residence on Kal'Shebbol, the sector capital."}, {"tag": "p", "text": "In 8 ABY, Kal'Shebbol was liberated by New Republic forces. Although they managed to secure the planet, Sarne escaped with the majority of his fleet into the Kathol sector. Learning that the New Republic had tasked the CR90 corvette FarStar to hunt him down, Sarne contacted Qulok's Fist and employed their services in shadowing the vessel and reporting back to him on its activities."}, {"tag": "p", "text": "Several weeks into the assignment, Sarne again contacted Qulok's Fist and relayed a scheme he had devised to stage an assault on the FarStar in the Shintel system. The corvette's command crew had been fed false information regarding Sarne's whereabouts by Colonel Olaver Lansel, a deep-cover agent on the planet Gandle Ott. The information led them to Shintel, where Sarne had previously established a supply depot, which he had subsequently abandoned in his flight into the Kathol sector. There, another deep-cover agent. Lieutenant Palme, uploaded a virus into the corvette's computer systems. When the New Republic vessel attempted to jump to hyperspace, the virus caused the hyperdrive engines to overload. Sufar crewed the Steel Fist, Qulok Fist's main spacecraft, during a brief engagement with the FarStar before the gang withdrew from combat since Sarne only wished to harass the New Republic vessel. The warlord planned to use the FarStar as bait for a trap he was setting to lure a large New Republic force into a battle of his design that would have allowed him to ultimately destroy any opposition and allow him to retake control of the Kathol sector unopposed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sufar was a cold-blooded murderer, though he was subtle and sophisticated. He lacked a sense of honor, and had a savage air about him. Sufar lived to kill, believing it was the only way he could survive. He constantly evaluated anyone as a potential target, determining their strengths and weaknesses. To him, everyone was a potential threat to be eliminated. The other members of Qulok's Fist were the only individuals that Sufar remotely considered to be friends. He had blond hair that he kept cut short and light skin."}, {"tag": "p", "text": "Sufar employed a wide range of techniques to kill his victims. Preferring to act behind the scenes rather than expose himself to a direct confrontation, he used poisons and bombs to kill his targets, as well as high-tech solutions such as slicing computer systems to arrange various accidents. He was trained to use blasters, and was skilled in hand-to-hand and melee combat. Sufar could pilot repulsorlift vehicles, and operate weapons systems on smaller starships. He was also trained in first aid. Sufar armed himself with a blaster carbine, and carried a hold-out blaster and a knife for additional defense. He also used detonite with timer fuses, and employed a security override kit when necessary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sufar was created for The DarkStryder Campaign, a supplement for the Star Wars: The Roleplaying Game by West End Games. Sufar appeared in the \"Rogues Gallery\" section written by Peter M. Schweighofer, and was included so the Gamemaster could use him—and Qulok's Fist—in an original adventure. Qulok's Fist would go on to appear in the adventure Shintel Downtime, although they would only be encountered aboard their ship, the Steel Fist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}