{"url": "Sukarr", "categories": ["Category:Legends articles", "Category:Dark Acolytes", "Category:Fallen Jedi", "Category:Individuals of unspecified species", "Category:Jensaarai", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Sukarr"}, {"tag": "p", "text": "Sukarr was a male fallen Jedi Knight and one of the leaders of the Jensaarai cult."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sukarr was Force-sensitive and was trained in the ways of the Force by the Jedi Order. Ascending to the rank of Jedi Knight, he fell to the dark side alongside Nikkos Tyris traveling with the Anzati to Susevfi."}, {"tag": "p", "text": "Sukarr also fathered a daughter, Mei, and trained her in his practice."}, {"tag": "p", "text": "On Susevfi, Tyris led his followers down the path to the dark side, studying an ancient Sith manuscript to learn their dark techniques. The cult, which Tyris dubbed the Jensaarai, would grow into a large enough threat to cause the Jedi Council concern. As the Clone Wars progressed, the group was approached by Count Dooku, leader of the Confederacy and the alter ego of Sith Lord Darth Tyranus. Dooku gifted Tyris with a Sith holocron favored by former Anzati Jedi Volfe Karkko and convinced the cult leader to join the Separatist war effort. Granting the Jensaarai members the title of Dark Acolytes within the ranks of the Separatist Droid Army, Sukarr was stationed with Tyris on Susevfi during the final days of the war."}, {"tag": "p", "text": "A month before the war would end, the Jedi Order dispatched the Knights Nejaa Halcyon, Ylenic It'kla, and Desertwind to remove the Jensaari leadership. Attacking their fortress on Susevfi, the Jedi engaged Tyris, Sukarr, and Dustrose, in an attempt to remove the Jensaari from the war. Over the course of the fighting, all three Jensaarai fell, with the Jedi known as Desertwind delivering the fatal blow to this individual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}