{"url": "Sullust/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Rimma Trade Route", "Category:Sith Empire planets", "Category:Sullust locations", "Category:Sullust sector planets", "Category:Sullust system", "Category:Type I atmosphere planets", "Category:Type II atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Sullust"}, {"tag": "p", "text": "Sullust was the primary planet of the Sullust system, located in the Outer Rim Territories at the conjuncture of the Rimma Trade Route and the Silvestri Trace. It was the homeworld of the Sullustans."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sullust was a terrestrial planet that occupied the fourth orbit from the star Sullust in the Sullust system in the Brema sector of the Outer Rim Territories region of the galaxy. Situated on the Rimma Trade Route and within the area known as the Trailing Sectors, Sullust had standard gravity and possessed two moons: a large planetoid named Sulon and an unremarkable hunk of rock named Umnub. Sullust's day lasted 20 standard hours and its year lasted 263 standard days. The planet was 12,780 kilometers in diameter and featured terrain including mountains, volcanoes, rocky deserts, and caves; multicolored rock veined by channels of magma covered Sullust's entire surface."}, {"tag": "p", "text": "The atmosphere of Sullust was barely breathable, with hot and thick clouds of toxic gases released in volcanic eruptions rendering the planet's surface lethal for sustained habitation and uncomfortable for short visits. Atmospheric blackouts occurred on a regular basis due to large gouts of smoky ash. Its surface was also dangerously volatile; while Sullust's geology was poorly understood, the mantle between the planet's core and its thick crust appeared to be semipermeable, allowing eruptions to occur frequently. Most of the opaque substances ejected by the volcanoes remained in the upper atmosphere while heavier gases flowed back down, resulting in high surface visibility and noxious surface air."}, {"tag": "p", "text": "Sullust was popularly known as \"the volcano planet,\" but only certain portions of the world contained active volcanoes. Few of the volcanoes were reliably extinct, however. The Sullustan species evolved in the more hospitable underground of the planet, where a stable system of tunnels connected edible lichen gardens to pools of potable water. A hub of trade along the Rimma Trade Route, Sullust had a corporate system of government and exported starships, computers, droids, hyperdrive technology, and astrogation technology while importing foodstuffs and water. During the reign of the Galactic Empire there were many bases built on the planet, and several major cities were locked down by Imperials."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet joined the Galactic Republic when Sullustan merchants connected their planet to Tapani sector with the Rimma Trade Route in 5500 BBY."}, {"tag": "p", "text": "Sullust became a major hub of trade soon after it achieved contact with the rest of the galaxy, and the presence of corporations and manufacturing on the world increased as galactic commerce became more common there. The SoroSuub Corporation was already a part of Sullust's economy and government when the planet first gained access to interstellar travel, and over time, SoroSuub aided Sullust's government while becoming increasingly influential in the diplomacy of Sullust."}, {"tag": "p", "text": "Sullust was an honored member of the Galactic Senate. It was attacked by the Krath during the Great Sith War, but was successfully defended by the Galactic Republic."}, {"tag": "p", "text": "The world was volatile with hundreds of active volcanoes, producing a noxious, toxic atmosphere and intense electrical storms. These conditions, combined with the planet's rich mineral deposits, caused the native Sullustan inhabitants to live in underground caves. The underground caves were humid and cool, with a diverse biosphere supported by underground lakes. The planet was once known for its podraces. During the New Sith Wars, the Brotherhood of Darkness captured the planet."}, {"tag": "p", "text": "Sullust was the headquarters of the galaxy-spanning SoroSuub Corporation, a member of the Commerce Guild. Nearly one-half of the population was under its employment. As the Old Republic crumbled, the governing Sullustan Council became weak. Under President Beolars Bribbs who was also the Galactic Senator, the planet seceded from the Republic in 22 BBY and joined the Confederacy of Independent Systems. Less than a month later the Republic dispatched a task force to retake the planet, led by Jedi Knight Rees Alrix. The Republic took heavy casualties in the battle due to a treachery in their midst and the planet remained one of the Confederacy's most prized holdings until the end of the Clone Wars."}, {"tag": "p", "text": "With the expansion of Palpatine's New Order, SoroSuub assumed leadership of Sullust with Corporate Proclamation 137d and announced its full support of the Empire. In exchange for several lucrative contracts and the promise of guaranteed future business, SoroSuub took a hardline against the Rebel Alliance and its supporters."}, {"tag": "p", "text": "Angered at SoroSuub's illegal takeover and support of the Empire, Sullustans formed resistance cells under the leadership of Sian Tevv that became model rebel cells during the Galactic Civil War. Tevv's resistance fighters, combined with a coup to take over SoroSuub by pro-Alliance forces, garnered enough support to wrestle control of Sullust away from SoroSuub shortly before 0 ABY. Several months after the Battle of Yavin, Rogue Squadron launched a strike to destroy a Capacitor."}, {"tag": "p", "text": "The Sullustan resistance remained independent from the Alliance, although it allowed the Alliance Fleet to use Sullust as the staging point for planned destruction of the Death Star II, since Sullust was an endpoint of the Sanctuary Pipeline as well as due to a board chairman of SoroSuub being rescued from Imperial detention by Rebel force."}, {"tag": "p", "text": "The Alliance also launched a diversionary attack in the system, to draw the Imperial fleet away from Endor."}, {"tag": "p", "text": "After the Battle of Endor, Sullust was one of the first worlds to officially align itself with the Alliance of Free Planets, and subsequently the New Republic. It was represented on the New Republic Provisional Council by Sian Tevv and later in the New Republic Senate by Sien Siev and Niuk Niuv. Sullust went on to be a key member of the Galactic Alliance."}, {"tag": "p", "text": "In 5 ABY, Superior General Sander Delvardus of the neighboring Eriadu Authority tried to conquer Sullust but he was defeated by Sien Sovv who launched a counterattack campaign that liberated all the Authority."}, {"tag": "p", "text": "Darth Krayt's Galactic Empire took control over Sullust after the end of the Sith–Imperial War. SoroSuub was forced to keep at least 80% of its production facilities manufacturing Imperial vessels, most of which were not even of Sorosuub design. Forced into desperation, Sullustans began building secret underground facilities closer to the planet's core. Products created in those facilities were secretly smuggled offworld and sold in open market."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sullust was one of the first planet-names seen in the early drafts of A New Hope. It first appeared (slightly differently spelled) in the name of the Bomerwrights of Sullest, crafters of laser swords, in the second draft[source?]. In the third draft[source?] and all the versions up to the shooting script, Luke Skywalker still referenced Sullust, along with the planet Aquilae, but this line was eventually cut out of the final movie."}, {"tag": "p", "text": "Some pre-Prequel-era Expanded Universe sources mistakenly refer to Sullust as the place where Darth Vader was defeated by Obi-Wan Kenobi and suffered his injuries. One level of video game Star Wars: Rogue Squadron, referring to the raid on Sullust, shows a base similar to the one of Darth Vader's defeat, plus an environment similar to Mustafar, adding to the confusion."}, {"tag": "p", "text": "The PC game Star Wars: Rebellion and Star Wars: Rebellion: Prima's Official Strategy Guide mistakenly place Sullust in the Sluis sector of the Core Worlds. The Sluis sector is actually located in the Outer Rim. Moreover, Star Wars: Rebellion: Prima's Official Strategy Guide misspells the planet as \"Sulust.\""}, {"tag": "p", "text": "Additionally, Rebellion's in-game encyclopedia entry for Sullust mistakenly states that the Sullust system openly threw their support to the Rebel Alliance after the Battle of Yavin. Rather, the Sullustan resistance movement merely provided independent support and aid, while many others remained hesitant to become involved, or still remained pro-Imperial."}, {"tag": "p", "text": "In Star Wars Battlefront: Renegade Squadron the planet is seen much differently. It is shown as a green soiled planet with some geysers and some volcanic activity. It is unknown if this is just the inside or the outside as IG-88 jumps from a speeding troop transport."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}