{"url": "Sun_Crusher", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Captured starships", "Category:Imperial Department of Military Research products", "Category:New Republic starships", "Category:Sith starships", "Category:Starship superweapons", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Sun Crusher"}, {"tag": "p", "text": "The Sun Crusher was one of the most powerful superweapons ever devised. It was developed at the secret Maw Installation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Sun Crusher was a nearly indestructible craft that was no larger than a starfighter, but was capable of unleashing destruction on a magnitude that dwarfed even the Death Star's capabilities. Unlike the Death Star, which destroyed individual planets, the Sun Crusher could destroy an entire star system by causing its target star to turn into a supernova. The key to its near invincibility was layered Quantum-crystalline armor, a material so strong that it could perfectly repel even turbolaser shots. Han Solo once was able to ram the Sun Crusher straight through the bridge of the Imperial-class Star Destroyer Hydra without taking any damage, and during the skirmish in the Maw, it even survived a glancing blow from the Death Star prototype's Superlaser, which likely would have destroyed any other ship it touched. The Sun Crusher took some damage to the engines, but was able to continue to fight. The Sun Crusher was also equipped with a hyperdrive and was designed to slip unnoticed into a system, fire its weaponry, and then escape before its presence was detected."}, {"tag": "p", "text": "The Sun Crusher's primary weapon was a payload of 11 energy resonance torpedoes. Each torpedo resembled an oval-shaped plasma discharge and was activated when it passed through the Sun Crusher's resonance torpedo launcher. The resonance torpedo then traveled to the system's sun at near-lightspeed velocity."}, {"tag": "p", "text": "Upon impact, the torpedo burrowed into the star's core, releasing dense packets of energy that rendered the star's core unstable, initiating a chain-reaction that forced even low-mass stars to go supernova. The star would be ripped apart in the explosion, sending waves of energy and radiation out across the system that destroyed every planet and all life in its path. The Sun Crusher could obliterate an entire system in mere hours. Once launched into the star, it was impossible to stop the impending supernova.\nThe resonance torpedoes could also be launched at any starship, instantly destroying it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sun Crusher was built using funds diverted from the Death Star I project by the Maw Installation; that was secretly built by Grand Moff Wilhuff Tarkin for the development of experimental weapons technologies. He then assigned the Maw Installation to Admiral Natasi Daala, a female Imperial Navy officer. Unknown even to Emperor Palpatine, the Maw Installation was quickly forgotten after Tarkin's death at the Battle of Yavin. However, a team of Imperial scientists, led by researcher Qwi Xux, continued their work despite complete isolation from the rest of the galaxy."}, {"tag": "p", "text": "In 11 ABY, Han Solo, Chewbacca, and Kyp Durron stumbled upon the Maw Installation. By that time, the Empire had succumbed to civil war with warlords fighting both themselves and the New Republic. After they were captured by Admiral Daala's forces, Han Solo, Chewbacca, and Kyp Durron, along with Qwi Xux, escaped the Maw Installation with the Sun Crusher."}, {"tag": "p", "text": "The Sun Crusher was then placed deep inside the poisonous atmosphere of the gas giant Yavin, where it was thought that the incredible atmospheric pressures would render the craft inaccessible. However, the young Kyp Durron, now a Jedi adept at Luke Skywalker's Jedi academy at Yavin IV, yet unable to control his hatred of the Empire and influenced by the ancient Dark Lord Exar Kun, retrieved the Sun Crusher from the depths of Yavin. He then destroyed the Cauldron Nebula along with most of Admiral Daala's fleet."}, {"tag": "p", "text": "After Kyp Durron destroyed the Carida system, Han Solo and Lando Calrissian came looking for him and chased Kyp to the Core Systems, where they found that he had also destroyed a major starship construction yard and a weapons depot with it. Han then found Kyp and distracted him while Lando attempted to shut down the Sun Crusher. However, Kyp used the Force to restart it and threatened to destroy the Millennium Falcon with one of the supernova torpedoes. At this moment Exar Kun was destroyed by Kyp's fellow students and Kyp realized what he had done and surrendered to Han. To redeem himself, Kyp had to destroy the Sun Crusher. He destroyed it during the Battle of the Maw, where it was sucked into one of the Maw's black holes along with the Death Star prototype. Kyp survived by escaping in a message pod, though he suffered serious injuries in the process. Durron used the Force to slow himself almost to the point of suspended animation and crammed himself into the tiny message cylinder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It is believed that the spacecraft shown on the cover of Dark Apprentice is an alternative, non-canon version of the Sun Crusher. However, it has also been claimed to be the X-23 StarWorker space barge featured in the book."}, {"tag": "p", "text": "In the Jedi Search audiobook, narrator Anthony Heald at one point incorrectly calls the Sun Crusher \"Star Crusher\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}