{"url": "Sun_Guard", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Echani culture", "Category:Mercenary units", "Category:Sith military units", "Category:Special forces units", "Category:Sun Guards"], "nodes": [{"tag": "h1", "text": "Sun Guard"}, {"tag": "p", "text": "The Sun Guard was a Sith cult and mercenary group, and one of the most feared military units in the galaxy, centered on the planet Thyrsus in the Thyrsus system. Formed from the rebellious Thyrsian special forces sometime after 1154 BBY, the Sun Guard fought the Echani of the Echani Command in numerous skirmishes before the Pact of Almera in 899 BBY confirmed Thyrsus's independence. Earning fame as a mercenary unit, the Sun Guard became rivals of the Mandalorian warriors, though the group was ultimately subverted into a cult of the Sith under the influence of the Order of the Sith Lords. Many Sun Guards served the Sith Lords directly, led by their Supreme Sun Guardian Thull Wulain, and other Sun Guards were considered for the position of prime clone in the Grand Army of the Republic. The 2nd Regiment of the Sun Guard fought in the Clone Wars, but were crushed by Republic general Solomahal. When Sidious needed the Sun Guard no longer, his apprentice Dooku ordered his own minion Asajj Ventress to eliminate them. Some of the few surviving Sun Guards went on to join Supreme Chancellor Palpatine's Red Guard, Royal Guard, and for those few Force-sensitive individuals, the Shadow Guard. A new generation of Sun Guards arose during the Yuuzhan Vong War almost fifty years later, defending Thyrsus against the extragalactic Yuuzhan Vong and seeking to restore their group's traditions and reputations."}, {"tag": "p", "text": "Though most were not Force-sensitive, the Sun Guard were adept melee fighters, equipped with a variety of weapons built into their recognizable black armor. Greatly prizing hand-to-hand combat, the Sun Guard were skilled in personal gladiatorial fighting, urban warfare, and a variety of other techniques; they were unmatched by any opponents but the Mandalorians. The Sun Guards' chief weapon was the pike, a two-handed bladed instrument that could be built in a number of variations for specific tasks. Sun Guard armor proved to be an inspiration for many other armor designs in the Galactic Empire: the uniforms of the Imperial Royal Guard; the specialized stormtrooper armors designed by Doctor Nashiak Llalik; the outfit of Carnor Jax, son of a Sun Guard; and the Sun Guard replica armor of the bounty hunter Moxin Tark."}, {"tag": "h2", "text": "Organization and philosophy"}, {"tag": "p", "text": "Initially, the Sun Guard served as a special-forces unit of the Thyrsus military, incorporated into its rank structure. In opposition to their Echani forebears, the Thyrsians were male-dominated, with an emphasis on armor and bladed combat. A strongly religious group in its infancy, the Sun Guard drew spiritual significance from the sun. As they spread into the galaxy from Thyrsus, the unit used its near-unmatched skills in combat to its advantage, reorganizing itself into a mercenary group along the lines of the Mandalorians and forgoing religion as its primary motivation. The influence of religion returned to the forefront when the Sun Guard became a Sith cult, though this new allegiance did not prevent them from continuing their mercenary ways and demanding payment for their services. Fierce warriors, the Sun Guard were a devoted and fanatical group, with a reputation for ferocity that made even the appearance of their uniforms an object of fear. They charged high prices for their services, which included sabotage, kidnapping, rescue, warfare, and many other kinds of jobs; the one thing Sun Guard missions had in common was that others had tried to accomplish them and failed."}, {"tag": "p", "text": "As a military unit, the Guard was organized into regiments, legions, and other levels of hierarchy; they often operated in teams of four. The lowest rank, taken by initiates into the group, was Stellar Legionnaire. They served a provisional term of one year, during which time they could be expelled at any point for breaches of Sun Guard etiquette, such as cowardice or undisciplined drunkenness. Legionnaires who passed were promoted to Stellar Tribune and made responsible for a legion of the Sun Guard, consisting of twenty to forty soldiers. Officers were rarer among the Sun Guard, as only particularly heroic Tribunes could be granted admission to the officer corps; officer ranks ranged from Twisuns Legate, who commanded two to four legions, Twisuns Praetor, Thychani Commander, Thychani Dictator, and finally Supreme Sun Guardian, which was the supreme commander of the entire Sun Guard. Promotion was obtained through military heroism, while cowardice was cause for expulsion at any rank."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation and early history"}, {"tag": "p", "text": "The Sun Guard originated from the special forces of the planet Thyrsus, which was inhabited by the near-Human Echani species and was part of the Echani Command, a confederation of six worlds known as the Six Sisters that were ruled by a female council. While the Thyrsians shared the Echani's skill at reading the smallest cues of body language, their culture differed from typical Echani culture in a number of ways: Thyrsus was male-dominated, Thyrsians had dark hair and skin, they were spiritually focused on the sun instead of the moon, and they favored bladed weapons and heavy armor instead of hand-to-hand combat. Thyrsus seceded from the Echani Command along with the planet Bengali in the Bengali Uprising of 1154 BBY, but though Bengali renewed its allegiance to the planet Eshan less than a century later, Thyrsus remained fiercely independent, and their military units took on a sigil of Thyrsus' red suns. The planet's special forces became known as the Sun Guard as they evolved over the centuries, and they fought numerous battles with the Echani before the Pact of Almera confirmed Thyrsus's independence in 899 BBY."}, {"tag": "p", "text": "As centuries of peace among the Six Sisters passed, the Sun Guard became more independent, largely abandoning Thyrsus to adopt a semi-nomadic way of life as a famed mercenary unit. Many Sun Guards served as bounty hunters and gladiators, and also served in various conflicts throughout the galaxy. The Sun Guard soon became rivals of the Mandalorian warrior culture, whose expansion alarmed the Sun Guard, and members of both groups often fought in small duels to the death rather than military engagements. The Sun Guard developed new tactics to counter the Mandalorians' reliance on jetpacks in air combat, which the Sun Guards held in contempt. The Sun Guard's rivalry with the Mandalorians lasted for centuries, reaching its peak at the Battle of Sintheti in 402 BBY: both groups were hired by rival claimants to the Horned Throne, and they dueled and fought each other for more than three years amid the planet's crags and catacombs."}, {"tag": "p", "text": "The Sun Guard began with a strong focus on religion, and though they eventually turned to a mercenary outlook upon realizing that warfare led only to poverty, religion retained its influence on them. Over a century before the time of the Galactic Empire, the culture of Thyrsus developed a fixation on matters of the Force, especially a prophecy of a galactic savior known as \"the son of suns\". The Order of the Sith Lords, in hiding during this time, played up the Thyrsian belief that they were the ones spoken of in the prophecy, encouraging the spread of Sith interpretations of Jedi belief. The Sun Guards were transformed into a Sith cult."}, {"tag": "h3", "text": "In the service of Darth Plagueis"}, {"tag": "p", "text": "During the last century of the Republic, the Muun Dark Lord of the Sith Darth Plagueis employed a company of silver-armored Echani Sun Guards to provide security at his residence on the moon Sojourn, replacing the Iotran Brandsmen that had previously defended the world. A contingent of Echani also provided protection for members of the Muunilinst-based company Damask Holdings, a firm that Plagueis led in his public persona, \"Hego Damask.\" A powerful financier, Damask brokered a deal with Foreman Wat Tambor of the Techno Union to make the planet Hypori available to the Sun Guard as a training ground."}, {"tag": "p", "text": "In 67 BBY, several Sun Guards accompanied Damask's deputy Larsh Hill and other Damask Holdings members to High Port Space Center on Muunilinst, to rendezvous with Damask—who had just arrived from an off-world trip—at the port's customs control section. A short time later, Damask staged a Gathering, an annual meeting of influential beings on Sojourn, and his Sun Guards oversaw the event. During the conclave, Plagueis ordered the commander of the Sun Guard contingent to strand four Gossam senior managers of the firm Subtext Mining on a remote world in the Tingel Arm, after the managers' actions earned Plagueis' ire. The Guards also detected a perimeter breach when the Bith Darth Venamis, a rival Sith Lord who sought to challenge Plagueis, arrived on Sojourn during the Gathering. Plagueis defeated Venamis in a duel, and ordered the Sun Guard to locate Venamis' ship, then transport the vessel and the incapacitated Bith to Plagueis' residence on Muunilinst."}, {"tag": "p", "text": "Two years later, in 65 BBY, Plagueis dispatched his Sun Guards to recover the stranded Gossams from the Tingel Arm and execute them, then leave their bodies outside Subtext Mining's headquarters on the world Corellia, to act as a warning to the firm. Later that year, the Human Palpatine, an associate of Damask, murdered his family aboard their starship while traveling along the Hydian Way hyperlane. In desperation, Palpatine contacted Damask for help, and the Muun dispatched some Sun Guards and the droid 11-4D to take control of Palpatine's ship and cover up the young man's crime. In the aftermath of the massacre, Palpatine became Plagueis' Sith apprentice, under the name \"Darth Sidious.\""}, {"tag": "p", "text": "Around that time, the Sith engineered the rise of a Sun Guard named Thull Wulain to the position of Supreme Sun Guardian, and Wulain swore fealty to Darth Sidious upon achieving the position. The Sun Guard went on the provide security at another Gathering that Damask held on Sojourn in 52 BBY. Sometime afterward, Palpatine was captured by Santhe Security, allies of Plagueis' rival Senator Pax Teem, and he was taken to a deserted factory in The Works region of the planet Coruscant. At Plagueis' behest, a team of Sun Guards assaulted the facility and rescued Palpatine, then defeated the Santhe Security agents. The Guardsmen traced the source of a signal from Teem to the Panoply Orbital Facility above Coruscant, and Plagueis sent the entire team of Sun Guards, bar two, to attack the station. With the two reserve Sun Guards as his escort, Plagueis made his way to the lodge of the Order of the Canted Circle, an elite social order that Larsh Hill was to be initiated into. During Hill's inauguration ceremony, a detachment of Maladian assassins hired by Teem attacked the lodge, in an attempt on Damask's life. The two Sun Guards fell while defending their employer, but not before killing several of the Maladians, and Plagueis ultimately survived the raid."}, {"tag": "p", "text": "Two months after the failed assassination attempt, Plagueis summoned Palpatine to Muunilinst, and two Sun Guards escorted the Sith Lord to Plagueis' residence in an airspeeder. Damask became increasingly reclusive after the attack, and over the following years he retreated to Sojourn, where he continued to retain a small company of Sun Guards. The Guards' duties were limited to escorting Damask's few visitors and maintaining the moon's ground-based turbolasers, and Damask rarely communicated with the Guardsmen, only relaying orders to them through 11-4D. Plagueis left Palpatine, who was now a senator in the Galactic Senate, to progress on his own, and the Sun Guards informed the Human of his master's obsessive and erratic behavior."}, {"tag": "p", "text": "In 33 BBY, King Ars Veruna of Naboo staged a nuclear attack on Sojourn, in an attempt to eliminate Damask. The Sun Guards stationed on the moon perished during the bombardment, but Plagueis survived, and he considered the Guards to have deserved their fate, because they had failed to prevent the attack. The Muun contacted the Sun Guards on Thyrsus to hire some replacement Guardsmen and at least four Sun Guards protected Damask in his Coruscant penthouse, his new permanent residence."}, {"tag": "h3", "text": "Agents of Lord Sidious"}, {"tag": "p", "text": "Sidious used his influence as a Sith to consolidate the Sun Guard in the Thyrsus system under his command sometime before 32 BBY. Sidious assigned a number of them to guard his stronghold on Coruscant, where they would eliminate any underdweller who approached too closely. The Sun Guard proved essential in Sidious' plans regarding the Battle of Naboo, as he used them to assassinate reluctant businessmen, as well as several pivotal senators before his planned election to the position of Supreme Chancellor as Palpatine of Naboo. Sidious' apprentice Darth Maul used the Sun Guard as opponents in his practice duels. Shortly after the invasion of Naboo, a group of mercenaries led by a Sun Guard kidnapped Queen Padmé Amidala on Coruscant and imprisoned her in the Restricted Area of the Coruscant Underworld. The captain of her guard, Quarsh Panaka, rescued the Queen and killed the Sun Guard. Soon afterward, Palpatine's plans came to fruition, and he was nominated as a candidate to become the new Supreme Chancellor of the Republic. Plagueis gave his Sun Guards the night off on the day of Palpatine's election and, in their absence, Palpatine murdered his master and became the new reigning Sith Lord."}, {"tag": "p", "text": "During the Sith Lords' search for a prime clone for the Grand Army of the Republic, Sun Guards from the ranks of the Thychani Commanders and Thychani Dictators were among the candidates considered by the Kaminoans. In 29 BBY, the holocron of the ancient Sith king Adas was recovered by the student Norval, and Sidious dispatched a Sun Guard to retrieve it. The Guard intercepted Norval's vessel over the world of Ploo II. Jedi Anakin Skywalker and Obi-Wan Kenobi arrived in pursuit; the Guard opened fire on them and, when Kenobi left for Norval's vessel, turned his weapons on that ship. Though Norval was confident the Sun Guard would save him, the Jedi retrieved the holocron, and the Guard destroyed Norval when it became apparent he no longer had the prize, in a failed attempt to prevent the Jedi from escaping with it. Sidious later executed the man for his failure."}, {"tag": "p", "text": "The Sun Guard fought in the Clone Wars, where their 2nd Regiment was crushed by Republic General Solomahal. In the early stages of the war, two Sun Guards were deployed during a Trandoshan-led attack on the Republic-held world of Kashyyyk. There, the pair confronted two Jedi Padawans next to the YT-2400 light freighter Star Runner, and the Guardsmen were defeated and killed. During the conflict, rogue factions of the Sun Guard led a mercenary army in a campaign against the Mistryl Shadow Guard and carried out an orbital bombardment of the Shadow Guard's homeworld, Emberlene. Near the end of the war, when Sidious' plans for the Sun Guard were at last fulfilled, his apprentice Count Dooku ordered his own minion Asajj Ventress to execute most of the organization. Several of the more devoted Sun Guards, were placed in Palpatine's Red Guard, later to join his Royal Guard. Those who were Force-sensitive were selected as candidates for the Emperor's Shadow Guard, while others like Kenix Jir became cloning templates."}, {"tag": "p", "text": "Palpatine's rise to power and manipulations of the Sun Guard split Thyrsian society, with most Thyrsians supporting the Emperor and viewing the Royal Guard as the Sun Guard's successors. Many Thyrsians enlisted in the ranks of the Imperial Army and the Stormtrooper Corps, but some saw Palpatine's manipulations as detrimental to the Sun Guards and sought to restore their traditions. Thyrsus became an isolationist world after Palpatine's death in 4 ABY, but a new generation of Sun Guards appeared during the Yuuzhan Vong War of 25–29 ABY. Those Sun Guards defended Thyrsus against the extragalactic Yuuzhan Vong and sought to restore their organization's traditions, reputation, and honor."}, {"tag": "h2", "text": "Equipment and techniques"}, {"tag": "p", "text": "Members of the Sun Guard wore helmets similar to those of the Republic's Senate Guard, which were likely inspired by them. The visor of the Sun Guard helmet could image thermal data, as well as infrared and ultraviolet wavelengths. A macrobinocular scope in the helmet aided in surveillance and sniping. The Guard covered themselves with heavy, characteristically black armor, although other color variants such as yellow, silver, and red existed. While resistant to damage, Sun Guard armor did little to restrict movement. Sun Guards also donned belt-spats around their waists, which later inspired the kama worn by the Grand Army of the Republic."}, {"tag": "p", "text": "Worn by one of the most feared military organizations in history, the Sun Guard uniform was instantly recognizable and widely considered terrifying. Along with the uniform of the Mandalorian Death Watch, it was the inspiration for the Galactic Empire in designing the armor of its feared Imperial Royal Guard. Before his death, the Sun Guard who failed to retrieve Adas's holocron fathered a Royal Guard of his own, Carnor Jax; when Jax took up a leadership role in the Empire, he donned a black guardsman's uniform inspired by the coloration of his father's Sun Guard armor. The bounty hunter Moxin Tark was one of several hunters to obtain Sun Guard armor and weapons, and he outfitted himself in a replica version of their armor. Doctor Nashiak Llalik, an Imperial armor designer, found inspiration in the armor of the Sun Guard, spurring him when he grew up to design the suits of armor used by many of the Empire's specialized stormtrooper units. Luskin Exovar, a onetime scout, owned a pair of scarred Sun Guard battle helmets, part of his private collection amassed during his travels."}, {"tag": "p", "text": "Though Sith cultists, the Sun Guard generally lacked Force-sensitivity—although exceptions existed. They were trained in stealth and melee combat, and preferred to face their opponents at close range. The echani martial art was thought to have originated with their techniques, modified by Palpatine's experts to be more brutal and deadly. Sun Guard armor was designed to aid in up-close combat; vibroblades in the gauntlets and spikes in the boots and knee pads were common, and the forearm gauntlets and fist plates could be quickly heated to temperatures capable of burning flesh. Many Sun Guards augmented their array of offensive capabilities with flamethrowers and dart launchers under their arms."}, {"tag": "p", "text": "The common weapon of the Sun Guard was the pike, which they held in near-sacred reverence. Though this weapon had many variants, most were about a meter in length, wielded two-handed, and equipped with blades on either end. These blades tended to be double-edged vibroblades, often with cortosis ore in them to resist lightsabers. Ritual pikes known as solar pikes, which the Sun Guard inherited from the Echani, could be activated by a control in the grip to heat the tips to red-hot temperatures. Force pikes had stun modules in either end to shock the wielder's enemies into paralysis. In their battles against the Mandalorians, the Sun Guard developed ways to use pikes as anti-air weapons, disabling or overloading the jetpacks that their opponents relied on and they held in contempt. The Sun Guard used other weapons as well; at least one Guard armed himself with a vibro-ax."}, {"tag": "p", "text": "Sun Guard were almost unmatched in combat skills; only Mandalorians could stand against them. Like the Echani, they could read body language to predict the moves of their opponents. They could match any opponent in personal combat, and those who fought in gladiatorial pits sometimes got extra credits for their skills. Sun Guards had skill in urban warfare as well, trained in tactics of sweeping buildings and eliminating enemies block by block. Some Sun Guards participated in space combat too; for his mission to retrieve Adas' holocron, one of the Sun Guards piloted a sleek gray ship, in which he attempted to fight off a Jedi vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sun Guard were created as a brief mention in the first edition of the Imperial Sourcebook by Greg Gorden. There it was stated that they provided the inspiration for the design of Imperial Royal Guard armor, a fact that would later be used in illustrating Moxin Tark—and his Sun Guard lookalike armor—for Wanted by Cracken. Most of the Sun Guard's appearances in the canon were these sorts of brief mentions, until Abel G. Peña greatly expanded on their history in Evil Never Dies: The Sith Dynasties. In addition to tying the Sun Guard into various existing aspects of the Expanded Universe—including Carnor Jax of the Crimson Empire comic series—Evil Never Dies retconned the group into two previous works. The Star Wars: Episode I The Phantom Menace video game included a mercenary boss dressed like a black-colored Royal Guard, which Evil Never Dies made the first true appearance of a Sun Guard. Jedi Apprentice Special Edition: The Followers, meanwhile, included a scene where a mysterious servant of the Sith kills the antagonist Norval; this was revealed in Evil Never Dies to be a Sun Guard as well."}, {"tag": "p", "text": "Working alongside Peña, Daniel Wallace significantly expanded further on the Sun Guard in the 2009 roleplaying game sourcebook Galaxy at War. Having just written the entry on Mandalorian Protectors, and seeing a connection with the Sun Guards' focus on armor, Wallace decided to make the Sun Guards and Mandalorians enemies. He also built upon the Echani connection mentioned in earlier sources, creating a \"male-dominant, hot, and angry\" group to contrast with the Echani's \"female-dominant, cold, and controlled\" nature. For the ranks of the Sun Guard, Wallace used names reminiscent of the Roman Empire. Among his references to earlier works, Wallace called upon a line from the second draft of George Lucas' script for Star Wars, which told a prophecy of a savior known as \"the son of the suns\". Though a previous reference to the cut line in another work of Wallace's had been removed by Lucasfilm Ltd., the one in Galaxy at War passed editing, much to his surprise."}, {"tag": "p", "text": "In 2012, the Sun Guards featured in the novel Darth Plagueis, by James Luceno, which elaborated upon the Guards' relationship with the Sith. Later that year, the Guards received a further appearance in the game Kinect Star Wars, in which two Sun Guards were adversaries faced by the player in the game's \"Jedi Destiny\" mode. A Sun Guard also featured as a challengeable opponent in Kinect's \"Duel of the Fates\" mini-game. Jason Fry, author of the 2012 reference guide The Essential Guide to Warfare, originally intended to include a \"unit profile\" on the Sun Guards in the book, as they served his purposes of jumping around the galactic timeline and mixing familiar elements with more obscure continuity. The organization had already been covered in Galaxy at War, so the section was ultimately cut for space. On November 4, 2013, the second entry of the Star Wars: The Essential Guide to Warfare Author's Cut blog series included the cut section discussing the Sun Guard, introducing those elements into canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}