{"url": "Sunchoo", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Kashyyyk residents", "Category:Slaves", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Sunchoo"}, {"tag": "p", "text": "Sunchoo was a female Wookiee living on Kashyyyk during the Clone Wars. Stolen from her village by the bounty hunter Crovan Dane, she was sold into a life of slavery in the service of a Neimoidian Trade Federation official, Gama Bankor. In 21 BBY, she was about to be taken off the planet by the Neimoidian when she was freed by Jedi Master Bant Eerin's Padawan and the Jedi youngling Jaylen Kos. She proceeded to aid them in their search for Dane."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sunchoo was a female Wookiee born around 64 BBY who lived on the Mid Rim jungle planet Kashyyyk before and during the Clone Wars, the galaxy-wide conflict fought between the Galactic Republic and the Confederacy of Independent Systems. At some point, Sunchoo was kidnapped from her village by Crovan Dane, a bounty hunter. She was eventually sold as a slave to the diplomat Gama Bankor, a Neimoidian member of the Trade Federation. In 21 BBY, she was already in Bankor's possession, and the Neimoidian's IG-100 MagnaGuards attempted to force Sunchoo onto his starship."}, {"tag": "p", "text": "Also at the Kashyyyk Royal City spaceport while Sunchoo was being taken away were Jedi Master Bant Eerin's Padawan and his youngling friend Jaylen Kos. Noticing the captive Wookiee, they confronted Bankor about his prisoner, and he begrudgingly let Sunchoo go free. Sunchoo then aided the young Jedi pair with their search for Crovan Dane in order to pay off the life debt she now owed them for saving her."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sunchoo, while young, was seen by her elders as very mature for her age. She was courageous, roaring defiantly into the face of one of Gama Bankor's IG-100 MagnaGuards, despite the possibility that she might be attacked. She was also willing to turn herself in to bounty hunters if needed in order to free fellow Wookiees from captivity. Sunchoo was loyal to Wookiee customs, making sure her life debt to the Padawan and his friend was paid off properly, regardless of the danger associated with their mission. In addition, she knew the forests of Kashyyyk quite well and was able to navigate them successfully."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sunchoo's only appearance to date is in The Clone Wars: Decide Your Destiny: The Way of the Jedi, a 2008 Decide Your Destiny novel by Jake Forbes and Sue Behrent. Because the novel is a Decide Your Destiny book, there are several story strands in which Sunchoo appears, and the actions she takes in these strands are decided upon by the reader. This article assumes the strand in which she is featured most prominently, and any other possible ones are noted here."}, {"tag": "h3", "text": "Alternative outcomes"}, {"tag": "p", "text": "While Sunchoo is being taken from Kashyyyk by Gama Bankor, Bant Eerin's Padawan and Jaylen Kos, while searching for Crovan Dane, come across a Toydarian who has information on the elusive bounty hunter. At the same time, they notice Sunchoo being taken away by Bankor. The Jedi pair then has a choice to make: to confront Bankor about Sunchoo or stay with the Toydarian, who has threatened to leave if the Jedi don't pay him immediately for his information. If they decide to ignore Sunchoo and pay the Toydarian, he brings them to a cantina to meet a bounty hunter who is searching for Dane. If they decide to confront Bankor, he will eventually reluctantly release Sunchoo. Thankful for her rescue, she joins them on their mission."}, {"tag": "p", "text": "Together, the three of them travel to Kashyyyk's Shadowlands, where Crovan Dane and his Wookiee partner, Tahnchukka, are loading specimens of various species—including a terentatek and a family of Wookiees—for shipment to the Trandoshan moon Akoshissss on behalf of Muun cyberneticist Bitt Panith. However, Tahnchukka smells Sunchoo and begins to seek her out. Realizing this, Sunchoo offers to turn herself in to Tahnchukka, giving the Jedi time to release the captives and arrest Dane. The reader then has to make a decision as to whether to remain hidden and let Sunchoo make a distraction, or to directly confront Dane and Tahnchukka. If the reader decides to not let Sunchoo turn herself in, the Jedi will be discovered. The two Jedi try to disarm the bounty hunter duo using the Force, but the terentatek's power of repelling the Force makes this attempt fail. The Jedi, not wanting to engage the two bounty hunters without the Force, run, but Dane stuns them. Sunchoo and the two Jedi later come to an arena, on the cusp of being executed."}, {"tag": "p", "text": "If the reader chooses to listen to Sunchoo and let her turn herself in, she will be brought by Dane and Tahnchukka to their ship, giving the youngling and the Padawan time to release the captives. However, the bounty hunters return and begin to fire upon the two Jedi, and Dane is eaten whole by the released terentatek. While Tahnchukka tries to kill the dangerous animal, the Jedi go to Dane's ship and release Sunchoo along with the other Wookiee prisoners. Sunchoo and the Wookiee family then bring the Jedi back to their village, where both Jedi and Wookiees celebrate their success. After the party, the two Jedi leave Kashyyyk, though Sunchoo promises to give them aid whenever they call for it. Considering her life debt to be repaid, Bant Eerin's Padawan plans to return to Kashyyyk after the Clone Wars to introduce Sunchoo to his friend and fellow Padawan, Ahsoka Tano."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}