{"url": "SunGem", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Delaya-class couriers", "Category:Galactic Republic starships", "Category:Jedi starships", "Category:Praxeum ships"], "nodes": [{"tag": "h1", "text": "SunGem"}, {"tag": "p", "text": "The SunGem was the personal Delaya-class courier starship of the Arkanian Jedi Master Arca Jeth, who was active during the era of the Great Sith War. Jeth modified the swift but lightly-armed ship to serve as a makeshift Jedi academy, replete with lightsaber practice areas, a meditation chamber, and an extensive computer library of Jedi texts. In 4000 BBY, Jeth dispatched his three Jedi apprentices—the Human brothers Ulic and Cay Qel-Droma, and the Twi'lek Tott Doneeta—to peacefully resolve a long and bloody conflict between the monarchy of the planet Onderon and banished criminals known as the Beast Riders. The students soon discovered that the planet's rulers were dark side cultists and joined a Beast Rider army in a siege of the capital city, Iziz. Although the tide shifted to the monarchy's favor, Jeth arrived in the SunGem and used battle meditation, an exotic Force ability, aiding the Beast Riders on their way to victory."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Delaya-class courier ship owned by the Arkanian Jedi Master Arca Jeth, the SunGem was outfitted to serve as a training facility for his Jedi students. The ship featured several layers of maneuvering vanes and retractable airfoils, which served to make the SunGem distinctly aerodynamic. The airfoils were tied into a computer system that adjusted each one's angle for the best possible maneuverability. The SunGem had twenty-one Hoersch-Kessel ion engines arranged in blocks of three; each trio was mounted to a servo-controlled maneuvering adjuster. Although just seventy meters long, the ship had fantastic sublight speed, able to accelerate to 950 kilometers per hour in an atmosphere. Rather lightly armed, the SunGem featured a proton torpedo launcher located directly in front of the cockpit, which, although it had a limited range, utilized very dangerous high-yield torpedoes."}, {"tag": "p", "text": "The SunGem was also equipped with two rotating laser cannons, which could fire in opposite directions simultaneously, on the outside of the airfoils. The pilot and gunnery stations were in the cockpit, and the central living quarters could house up to eight beings. Most of the interior contained Jedi training facilities, including lightsaber practice areas complete with remotes, a variable gravity and atmosphere room to simulate hostile conditions, a meditation chamber, and an extensive computer library of Jedi texts. The ship had very little cargo room, just enough to contain a small scouting speeder. The SunGem was adorned with Jeth's personal Jedi sigil and was one of the most distinctive ships in the service of the Jedi. Equipped with advanced piloting computers, the ship could be operated solo if the need arose."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4000 BBY, Master Arca Jeth sent his three Jedi apprentices, including Ulic Qel-Droma, on a mission to bring peace to the war-torn planet of Onderon, which had been embroiled in a conflict between the planet's monarchy and exiled dissidents for generations. After the revelation that the Onderonian rulers were dark side cultists, Jeth's students allied with the Beast Riders, the aforementioned exiles, against Amanoa, Queen of Onderon. After a failed attempt to negotiate for peace, a large Beast Rider army attacked the planet's capital, Iziz. Due to Amanoa's use of the dark side, the Royal Armed Forces took the upper hand in the battle. However, Jeth soon arrived in the SunGem, using the Force power known as battle meditation to turn the tide back in favor of the Beast Riders. As the SunGem flew above Iziz, Ulic Qel-Droma recognized the ship, and Jeth landed the vessel on Iziz's ramparts to meet with his apprentices."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The SunGem was owned and operated by Jedi Master Arca Jeth. Jeth used his ship as a training center for his students and modified the ship so he could fly it by himself if need be."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The SunGem first appeared in Ulic Qel-Droma and the Beast Wars of Onderon, the first story arc of the Tales of the Jedi comic book series, written by Kevin J. Anderson, illustrated by Christian Gossett, and released in 1993. The SunGem was originally designed by Gossett. Thus far, Beast Wars of Onderon is the SunGem's only appearance in Star Wars canon, although further information on the ship was given in sources such as the Tales of the Jedi Companion and The Essential Guide to Vehicles and Vessels. In 2008, the SunGem was given an entry in The Complete Star Wars Encyclopedia. Although the ship was not given a name in its appearance in the Tales of the Jedi comics, it was dubbed the SunGem in The Essential Guide to Vehicles and Vessels, which nevertheless referred to it simply as \"Master Arca's ship\" in the entry title."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}