{"url": "Sundari", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Capital cities", "Category:Cities on Mandalore", "Category:Galactic Empire cities", "Category:Shadow Collective locations", "Category:Sundari locations"], "nodes": [{"tag": "h1", "text": "Sundari"}, {"tag": "p", "text": "Sundari was the domed capital city of the planet Mandalore. The city was situated in the deserts of Mandalore and was enclosed by a bio-dome that allowed the city to exist on the harsh planet, which had been rendered a desert after years of Mandalorian wars. During the reign of the pacifist New Mandalorian government, led by Duchess Satine Kryze, the city was the site of multiple attacks by the splinter faction known as Death Watch. They eventually took over the city during the Clone Wars in an effort to restore Mandalore to its warrior past. Shortly thereafter, it was the site of a civil war between different Death Watch factions, who were fighting as a result of the rogue Sith Lord Maul's takeover of Death Watch."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 21 BBY, during the Clone Wars, Jedi Master Obi-Wan Kenobi was sent to Sundari. He investigated rumors about the New Mandalorians' leader, Duchess Satine Kryze, leading Mandalore in joining the Confederacy of Independent Systems following an attack on a Republic cruiser. The Duchess informed Kenobi that a movement called the Death Watch was behind the attack and in collaboration with the Separatists. Death Watch then staged a bombing on the Peace Park's Memorial Shrine. Kenobi found the bomber, but the bomber chose to jump to his death."}, {"tag": "p", "text": "A parade was held to honor the arrival of Naboo's Senator, Padmé Amidala. During this time, several Moogan smugglers brought in Ardees Beverage tea. The smugglers inadvertently diluted and poisoned the tea with Slabin resulting in an outbreak of illness among schoolchildren across the planet. Fortunately, Amidala, Kryze and her bodyguards put an end to this smuggling ring. After it was discovered that Mandalore's prime minister, Almec and the secret service were behind the smuggling, he was arrested by Kryze, Jedi Padawan Ahsoka Tano, and Korkie Kryze's fellow cadets."}, {"tag": "p", "text": "Sundari was later chosen as a neutral location for negotiations between the Republic and the Confederacy. However, it came to an end when Tano rescued former Onderon Senator Lux Bonteri from Dooku's executioners. A firefight broke between the commando droids and Captain Taggart's Senate Guards."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, Imperial Governor Tiber Saxon had his command ship above Sundari during a civil war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}