{"url": "Sump/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Koradin sector planets", "Category:Slavery worlds", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Sump"}, {"tag": "p", "text": "Sump was the humid, impoverished homeworld of the Nuknog, located in the Koradin sector of the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sump was located in a star system in the Koradin sector of the Outer Rim Territories region of the galaxy, situated on the Lipsec Run between Keskin and Virgillia. It was a humid and dilapidated world with vast, toxic marshes incapable of supporting life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sump was within space that was considered well-explored by 1000 BBY, and shortly after that year, the Nuknogs, a sentient species native to Sump, sold the planet to a consortium of mining corporations in exchange for food, employment, and modest accommodations. The Nuknogs worked without pay in mines and processing factories, performing tasks deemed too hazardous for offworld personnel. Over time, the planet's ecosystem was contaminated by pollution and many Nuknogs were killed in mining accidents. All the while, the Nuknogs remained unaware that they were being exploited."}, {"tag": "p", "text": "For centuries, the Nuknogs remained the unwitting slaves of the various corporations as mining contracts changed hands. Their mistreatment finally came to the attention of the galactic community, however, when a pair of Jedi traveled to Sump in search of a wanted criminal. The Galactic Senate ordered the corporations to terminate all operations on Sump and repay the Nuknogs for several centuries of lost wages. The corporations dissolved amid the controversy, and with the Nuknogs deprived of their source of food, the Galactic Republic sent relief workers to deliver supplies to the planet and offered to rebuild its devastated agricultural industry. Sympathy for the Nuknogs quickly vanished when their leaders accepted the food, but, suspicious of the Republic's motives, demanded that it also provide them with food and supplies in perpetuity. During the Separatist Crisis, Sump lost the interest of the Senate and the galactic community. Sump and its inhabitants experienced little change after the Clone Wars, during which it was in unaligned space, and the fall of the Galactic Republic."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Sump was the homeworld of the Nuknogs, a sentient species of bipedal, reptilian humanoids. Few of them had the means to leave their homeworld, but those who did jumped at the chance, sometimes selling themselves into slavery just to gain the right to board the rare passing freighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}