{"url": "Sunrunner", "categories": ["Category:Legends articles", "Category:Aquatic vehicles", "Category:Lok Revenant craft", "Category:Mere vehicles", "Category:Repulsorcraft"], "nodes": [{"tag": "h1", "text": "Sunrunner"}, {"tag": "p", "text": "The Sunrunner was a fast, but unarmed, sea cutter provided for Nym by Loreli Ro. It was equipped with a Corellian navicomputer, Mitgard repulsorlift engines, and clean-burning ion drives. The ship was used by Nym to seek pirate forces lead by Sol Sixxa. Nym rammed it into the Revenant, sinking both vessels and destroying many B1-Series battle droids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Sunrunner was a grey aquatic vessil with an pattern of some kind. Equipped with Corellian navicomputer, Mitgard repulsorlift engines, and clean-burning ion drives."}, {"tag": "p", "text": "Inside the vessel had a couple of hatches and a medical room which had a bed some surgical equipment."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Afternoon"}, {"tag": "p", "text": "The Sunrunner was bought by Loreli Ro for Nym to locate Sol Sixxa so that he would end his piracy on innocent refugees. Nym was distraught on the fact the ship had no weapons, which Loreli explained that the Trade Federation placed restrictions on arming their vessels. Nym ordered Jannik and his Reeven Clan to bring every weapon they could carry and his Havoc's Bomblet generator to the ship, while Jinkins would helm the ship and Loreli would handle navigation."}, {"tag": "p", "text": "Afterwards, the Sunrunner was sent to the location of the Syren, a Trade Federation pleasure liner that was sunk by Sol Sixxa. Nym would retrieve the head of Lord Toat's Protocol droid, PL-37 when he was attacked by a Relix. Nym then tied his noose to a piece of debris and threw it into the Relix's maw, losing his cybernetic arm in the process and ordered Jinkins to go full throttle, forcing the Relix to surface and be blasted by the Reeven Clan."}, {"tag": "p", "text": "Nym returned to the ship with the head of PL-37 and got Jinkins to tap into the Droid's brain to learn that Sixxa had a prototype before it burnt out. This caused the Sunruner to be tracked by Trade Federation forces lead by Harro Ruuk. Meanwhile Kole would find the Refugee captain in a cantina Silver Cloud and was got him to join Nym before he would confront Sol Sixxa."}, {"tag": "h3", "text": "First and last battle"}, {"tag": "p", "text": "The Sunrunner was brought the Haunted Straits where Sixxa had set up base for his raids on his ship the Revenant. During the preparation the Bomblet Generator had been retrofitted as a turret and Jinkins had fitted Nym with a Hand cannon. Halfway through the Straits Sixxa attacked the vessel but Nym's Rodian warriors and Bomblet Generator turret decimating his speeders forced Sixxa to retreat onto his ship which had a prototype cloaking device. When Nym jumped onboard the Revenant, with Kole, Loreli and the Rodians right behind, he tackled Sixxa overboard. Kole managed to disable the prototype cloaking device giving Jinkins a visual and radar reading, but before he could engage Trade Federation Ostracoda-class gunboats arrived with B1-Series battle droids and captured both ships."}, {"tag": "p", "text": "Sol Sixxa would then return attacking the Trade Federation droids, while Nym would get back on his ship and tell Jinkins to overload the Bomblet Generator and get Jannik to a Mere life-pod. He then set the ship full speed to the Revenant and collided it while Kole, Loreli and the Rodians jumped overboard. The Sunrunner smashed through the Revenant and exploded taking many Battle Droids and the gunboats with it. Both ships would sink to the bottom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sunrunner was also the name of a server - or \"Galaxy\" - in Star Wars Galaxies. It appears in issues 2 and three of the comic series Starfighter: Crossbones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}