{"url": "Sunken_Sarlacc_cantina", "categories": ["Category:Legends articles", "Category:Cantinas", "Category:Sobrik locations"], "nodes": [{"tag": "h1", "text": "Sunken Sarlacc cantina"}, {"tag": "p", "text": "Sunken Sarlacc cantina was a public drinking and dining establishment in the city of Sobrik, Balmorra during the days of the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sunken Sarlacc Cantina was a large building located in the Balmorrian city of Sobrik, occupied by the reconstituted Sith Empire during the Cold War."}, {"tag": "p", "text": "Even after the Sith took over the town, some of its citizens still spent their time in the cantina even during the occupation. However while the patrons were enjoying their drinks, the streets were patrolled by the Imperial soldiers and droids, and several security cameras were installed around the building."}, {"tag": "p", "text": "Despite all the precautions taken by the Empire to keep the local citizens at bay, the Republic sent their agents in order to weaken the positions of the Sith at Sobrik. At one stage the Republic forces entered the cantina and activated the Republic hymn to inspire the remaining dwellers and freedom fighters to start a riot against the invaders."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The cantina consisted of several corridors and medium rooms, as well as a large hall, where people gathered to have drinks and relax. Several holographic dancers were used for entertainment of the patrons."}, {"tag": "p", "text": "The interior design of the bar was based upon the Imperial style, though it is unknown, whether this was due to Imperial renovations made in the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cantina is one of the locations to be visited by the players of the MMORPG Star Wars: The Old Republic during the quest given by the Republic characters. Activating the speaker with the \"Republic Marsh\", originally from the previous video game by BioWare - Knights of the Old Republic - is part of a larger mission to infiltrate the city of Sobrik."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}