{"url": "Sunnar_Jan-lo", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Agamar Resistance members", "Category:Agamari", "Category:Alliance Intelligence members", "Category:Females", "Category:Individuals of unspecified species", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "Sunnar Jan-lo"}, {"tag": "p", "text": "Sunnar Jan-lo was a native of Agamar and a member of the Agamar Resistance who joined the Alliance to Restore the Republic after attending a recruitment speech by the Rebel Chief of State Mon Mothma. Solidly built, decisive, and energetic, Jan-lo had been a leader on her homeworld prior to joining the Alliance. Although she wanted to pursue a career in intelligence, she initially served as a starfighter pilot, seeing action fighting against forces of the Galactic Empire during and after the Imperial offensive Operation Strike Fear."}, {"tag": "p", "text": "Jan-lo flew as pilot Keyan Farlander's wingmate in an attack on the Imperial-class Star Destroyer Intrepid after it became stranded and defenseless in the Circarpous system. Her X-wing fighter was hit by a missile during the mission, and, although she managed to eject, she suffered burns and cuts over her face, arms, and legs. She spent the following days in a bacta tank and was grounded afterward. Being unable to fly gave her the opportunity to enter intelligence training. She eventually transferred to Alliance Intelligence shortly before the Battle of Yavin."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Alliance"}, {"tag": "p", "text": "A native of the Outer Rim world of Agamar during the Imperial era, the female Sunnar Jan-lo joined the local anti-Imperial resistance movement and quickly became a natural leader within the organization. After the Galactic Empire destroyed the Agamarian town of Tondatha in 1 BBY, Rebel Alliance Chief of State Mon Mothma visited Agamar to negotiate bringing the resistance into the wider Rebellion. Mothma gave a speech to members of the resistance at a rally in the Agamarian capital of Calna Muun prior to negotiations with the resistance leaders, but Jan-lo took little convincing and was one of four Agamarians who decided to enlist immediately with the Alliance."}, {"tag": "p", "text": "Following the rally, Jan-lo boarded a shuttle along with the other new recruits—Keyan Farlander, Breth Gart, and 'Ndranth Poussan—and traveled to the waiting Mon Calamari Star Cruiser Independence. The shuttle landed in a hangar toward the rear of the Mon Calamari vessel, and the recruits were taken to a waiting room, before being shown to their quarters and assigned liaison officers for the duration of their training. Though Jan-lo wanted to work in Alliance Intelligence, senior Alliance personnel felt that there was a greater need for starfighter pilots at that time, and she was assigned to the Alliance Starfighter Corps along with the other new recruits. Her basic training began with flight maneuvers in the pilot proving grounds, before she moved on to simulated combat scenarios under Commander Wex \"TIE-Die\" Dafid."}, {"tag": "h3", "text": "First mission"}, {"tag": "p", "text": "Jan-lo proved to be a competent pilot, performing better than Poussan in training. Before long, Farlander was selected for active duty and was soon followed by Poussan, who was selected for the evacuation of the Rebel base on Brigia, despite his lack of experience, due to a shortage of available pilots. Jan-lo herself went on to active duty shortly after the evacuation and was assigned to Red Squadron aboard the Independence. She was reunited with Farlander, also a member of Red Squadron, during her first mission briefing and delivered the news that Poussan had been killed at Brigia and that Gart had washed out of training with disorientation syndrome."}, {"tag": "p", "text": "The Alliance had learned that the Imperial-class Star Destroyer Invincible, the command vessel of the Imperial offensive known as Operation Strike Fear, was low on supplies following the attack on Brigia and was looking to resupply before a planned attack on Rudrig. Jan-lo's first mission, in which she flew alongside Farlander and two pilots from Blue Squadron, was to ambush a supply convoy heading for the Invincible, setting back the Imperial campaign by several weeks. Upon exiting hyperspace near the Invincible, Farlander sent Jan-lo to intercept the convoy's TIE fighter and TIE interceptor escorts in her X-wing, joining her after firing his full proton torpedo load at the escorting CR90 corvette Ranger. The two continued to dogfight the Imperial fighters while Blue Squadron's Y-wings engaged the BFF-1 bulk freighters of Juno group. When the fighters were destroyed, the X-wing pilots helped to finish off the freighters before the Rebel forces returned to the Independence."}, {"tag": "h3", "text": "Operation Strike Fear"}, {"tag": "p", "text": "Around this time, Ordnance and Supply Command alerted all Alliance forces that their supplies of astromech droids—which provided pilot support and computer functions in starfighters—were running low. When the Alliance learned of a shipment of Imperial R2-series astromech droids aboard the freighter Ars Opus, forces from the Independence were dispatched to capture the droids. The new droids were quickly put to use in a three-ship X-wing patrol. Though Jan-lo was not assigned to the patrol, she was working in the ship's Operations Section when they received a message indicating that the X-wings were out of control. Knowing that Farlander's friend, Captain Hamo Blastwell, was one of the pilots involved, Jan-lo contacted her fellow Agamarian to warn him. It soon emerged that the droids had been sabotaged with hidden programming that would cause them to take over the X-wings they were put in and deliver them to the Empire, but the Rebels were able to safely retrieve the ships before they could fall into Imperial hands."}, {"tag": "p", "text": "The Rebels later conducted a series of operations to bring the Sullustans into the Alliance. For his part in these missions, Farlander was promoted to captain and Jan-lo helped organize a party to celebrate her friend's promotion. The Sullustans worked with General Crix Madine of Alliance Special Forces to devise a plan to end Operation Strike Fear by destroying the Invincible. The first part of the plan called for the capture of members of the Cygnus Spaceworks design staff to make special modifications to one of their Lambda-class shuttles. Jan-lo was assigned as Farlander's wingmate in a two-ship A-wing group charged with escorting the Delta-class transport Lightning as it captured the Cygnus staff while they conducted starfighter performance trials. The two Rebel pilots emerged from hyperspace to find several inactive TIE Series fighters in the area, along with one heavily shielded fighter of an unfamiliar design, which Jan-lo dubbed a \"Gunboat.\" Jan-lo quickly targeted the TIEs before they could power up, while Farlander scanned the nearby transports to locate the design staff—the Gunboat retreated to hyperspace when confronted. By the time the Lightning entered the area and moved to board the designers' transport, TIE fighters were beginning to scramble in response to the attack. However, Jan-lo and Farlander kept them from the Lightning until it completed its mission, and the Rebels jumped back into hyperspace, reporting the unusual sighting upon their return to the Independence."}, {"tag": "h3", "text": "A new threat"}, {"tag": "p", "text": "The Rebels were ultimately successful in destroying the Invincible and putting an end to Operation Strike Fear, but news of a greater threat soon emerged. Following the rescue of a group of Rebel pilots from Stars' End prison, the escapees brought news of a shipment of Wookiee slaves to an Imperial construction project. One of the escaped pilots, Captain Samuel Raider, outlined a plan to rescue the Wookiees during a briefing led by the Independence's planning officer, Commander S'man, and selected Jan-lo and Farlander to accompany him on the mission. However, when Raider's fellow escapee Toalagar asked to get straight back into active duty, Raider decided to take him instead of Jan-lo. Toalagar was killed during the mission."}, {"tag": "p", "text": "Jan-lo continued to serve with Red Squadron while the Rebels attempted to learn more about the Imperial construction project. After veteran pilot Captain Puck Naeco was transferred to the squadron, he started a series of practical jokes aimed at his wingmates. Knowing that Naeco was attracted to Jan-lo, the other pilots recruited her help in gaining their revenge. Jan-lo struck up a conversation with Naeco and told him to meet her privately in a storage shed in the Quarren section of the ship. When Naeco entered the dark room, Jan-lo called him over and told him to kiss her. Only when he did so did the hidden pilots turn the lights on to reveal that he was kissing a Quarren kitchen worker who was in on the joke."}, {"tag": "h3", "text": "Battle in the Circarpous system"}, {"tag": "p", "text": "Following the capture of the plans to the Empire's new Death Star battlestation—the Imperial construction project of which the Alliance had previously learned—shortly before the Battle of Yavin, the Alliance learned that the Star Destroyer Intrepid had been damaged in a collision with a frigate and was awaiting repairs to its hyperdrive. The Independence launched a series of raids that prevented these repairs and left the Intrepid stranded in the Circarpous system. The Rebels soon launched a direct starfighter assault on the Intrepid. The battle plan combined X-wings from Red Squadron, Y-wings from Blue Squadron, and A-wings from Gold Squadron, with Jan-lo assigned to an X-wing as Farlander's wing."}, {"tag": "p", "text": "Upon entering the Circarpous system, Farlander instructed Jan-lo to target the TIE fighters launching from the Intrepid while the Y-wings began their run on the Star Destroyer. Once the first wave of TIE fighters was eliminated, Jan-lo and Farlander turned toward an oncoming wave of TIE bombers. Farlander's target survived his first pass, but Jan-lo was able to pick it off. However, another bomber was able to lock a concussion missile on her X-wing. Jan-lo managed to eject as the missile struck and destroyed her starfighter, but she was left with burns to her face and seared patches and deep gouges in her arms and legs. Despite their losses, the Rebels were successful in destroying the Intrepid. Following the battle, Jan-lo was picked up and taken back to the Independence, where she spent the next few days receiving medical treatment in one of the ship's bacta tanks. Her recovery went well, and she was soon looking forward to making her return to active duty. Farlander and Naeco were among the pilots who visited her during her convalescence."}, {"tag": "p", "text": "By the time Rebel leader Leia Organa was captured over Tatooine while delivering the Death Star plans to the Rebel base on Yavin 4 in 0 BBY, Jan-lo had recovered from her injuries but was not cleared for active flight duty. Jan-lo's grounding allowed the pilot to pursue her intelligence training; she was transferred to Alliance Intelligence and was sent on a classified assignment that would take her away from the Independence for some time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jan-lo was solidly built, decisive, and energetic. A committed member of the Agamar Resistance, she did not hesitate to join the Rebel Alliance following Mon Mothma's rally. Her determination was shown in the speed with which she recovered from the injuries sustained against the Intrepid and her desire to get back into a cockpit. She was calm and often quiet—even sitting in silence on her first trip to the Independence—typically keeping her comments short and to the point. While getting revenge on Naeco for his practical jokes, the atypically seductive tone in Jan-lo's voice took Keyan Farlander by surprise."}, {"tag": "p", "text": "Despite her quiet nature, Jan-lo was always a leader on her homeworld, and this trait continued after joining the Alliance. Upon first arriving aboard the Independence, Jan-lo helped to reassure 'Ndranth Poussan and Breth Gart when they were nervous, and the typically insular Gart confided in her about his desire to try again after failing his initial flight training. Jan-lo had a good relationship with her wingmates, particularly her fellow Agamarian Keyan Farlander and Naeco, who was noticeably attracted to her. She helped to organize a party to celebrate Farlander's promotion to captain and made sure to seek him out to let him know about her transfer to Alliance Intelligence. When she was recovering from her injuries, both Farlander and Naeco visited her."}, {"tag": "p", "text": "Though Jan-lo decided she wanted to work in intelligence soon after joining the Alliance, she undertook flight training to help fill a shortage of pilots and became a competent pilot in her own right. She particularly liked fighting against standard TIE fighters, as she found them to be easy targets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sunnar Jan-lo was created by Rusel DeMaria for the 1993 book X-Wing: The Official Strategy Guide, which presented the story of Keyan Farlander, the player-character in the game Star Wars: X-Wing. In the book, Jan-lo is established as one of the previously unidentified pilots aboard the Independence from the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}