{"url": "Sunfruit", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fruits and vegetables"], "nodes": [{"tag": "h1", "text": "Sunfruit"}, {"tag": "p", "text": "Sunfruit was a wild and sweet tropical fruit that was found on the planet Corellia. It was used to garnish or enhance dessert dishes, such as Corellian Fried Ice Cream, and could also be converted into a liqueur or marinade. During the Galactic Civil War, the prisoner population of the Imperial penal world of Despayre regarded sunfruit as a commodity. Imperial Governor Carmal of the planet Lavisar also enjoyed sunfruit liqueur."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sunfruit were tropical fruit that grew wildly on the Core World planet Corellia. Roughly spherical in shape, the fruit's outer skin coloration varied from light-to-dark orange, and a sunfruit was such a size as to be able to be balanced atop a humanoid's head."}, {"tag": "p", "text": "The sunfruit lent its sweet taste to multiple culinary recipes, particularly as a garnish or texture enhancement in dessert dishes, including Corellian Fried Ice Cream. Sunfruit could be adapted as a marinade and served pleasingly with fowl, while sunfruit liqueur was an alcoholic derivative. One peeled a sunfruit when eating it naturally."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sunfruit was one of several fruits that grew naturally on the planet Corellia during the Galactic Civil War. By 2 BBY, sunfruit was a common commodity among the prisoner population of the jungle planet Despayre, an Imperial penal world and the final construction site of the first Death Star battlestation. Zelosian thief Celot Ratua Dil, a gifted scrounger and one-time inhabitant of Despayre's Slashtown prison colony, once hoped to acquire a few spare sunfruits for breakfast from among his fellow prisoners."}, {"tag": "p", "text": "In 7 ABY, New Republic Wraith Squadron pilot Garik \"Face\" Loran masqueraded as a pirate in order to infiltrate the forces of rogue Imperial Warlord Zsinj. While meeting with Zsinj aboard the Super Star Destroyer Iron Fist, Loran dined on fowl served in a sunfruit marinade, which he enjoyed but secretly hoped had not been poisoned. Imperial Governor Carmal of the planet Lavisar was partial to sunfruit liqueur, a propensity that the New Republic planned to exploit in its continuing campaign against Zsinj. By presenting Carmal with sunfruit liqueur as a gift in addition to military subterfuge, the New Republic hoped to convince him to abandon his allegiance to the warlord. That same year, a lounge called the Sunfruit Promenade served customers on the planet Storinal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sunfruit was first mentioned in the May 1996 novel Shadows of the Empire, written by Steve Perry, as a device for illustrating the physical prowess of Prince Xizor, Underlord of the Black Sun crime syndicate. Shadows of the Empire describes Xizor as being able to kick a sunfruit off the top of a tall humanoid's head without a warm-up stretch. X-Wing: Iron Fist, the 1998 sixth installment of the X-Wing novel series, by author Aaron Allston, was the first story to feature sunfruit, establishing its culinary diversity as both a liqueur and marinade."}, {"tag": "p", "text": "For the MMORPG Star Wars Galaxies, sunfruit was one of several components that the player could forage on the planet Corellia. It was also a possible ingredient in making Corellian Fried Ice Cream, which the player could create as part of a quest that involved acquiring a Portable Deep Fryer. Star Wars Galaxies was the first source to illustrate sunfruit, an image also used in the game to depict Bloom Fruit, GoldFruit, and Honey Melon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}