{"url": "Sunesi", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Sentient species", "Category:Amphibian sentient species", "Category:Aquatic sentient species", "Category:Mid Rim species", "Category:Sunesi"], "nodes": [{"tag": "h1", "text": "Sunesi"}, {"tag": "p", "text": "The Sunesi were a species of sentient amphibian humanoids native to the planet Monor II. Capable of breathing their world's toxic air, the species was noted for their early metamorphosis they underwent during adolescence."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A species of sentient amphibians, the Sunesi had pink blood, a diffuse nervous system, and lungs capable of processing the dense cirrifog which filled the atmosphere. When born, all Sunesi entered life as hairy, senseless creatures with no sentience until the age of 15 when they entered into a hibernation-like state. Their sweat, when mixed with the cirrifog's natural crystal-like make-up, formed a cocoon around their bodies and allowed them to pupate. When fully formed within the cocoon, the Sunesi was forced to attempt to escape the hardened prison in order to survive. While many did not survive to escape their cocoon, those who did emerged fully sentient and hairless with bright turquoise skin. While the Sunesi spoke through their mouths, they had an additional form of ultrasonic communication involving their large cranium."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Despite evolving sentience late in their life-cycle, the Sunesi were capable of forming a strong society on their homeworld. Developing a monotheistic religion established around the belief in the Maker, the Sunesi also believed in reincarnation, a belief stemming from their hibernation-phase of life. Forming their own language using both verbal and ultrasonic vocalizations, their name meant \"pilgrim\" in their own tongue. Capable of drowning out electronic listening devices with their ultrasonic voices, the agents of the Galactic Empire referred to the species as \"lumpheads\". The government of the Sunesi was led by a Priest-Prince believed to have a connection with the Maker. The Priest-Prince was hereditary and leaders served at their pleasure until they died or stepped down."}, {"tag": "h2", "text": "History"}, {"tag": "h2", "text": "Sunesi in the galaxy"}, {"tag": "p", "text": "While not prevalent across the galaxy, some Sunesi did see prominence during the later days of the Galactic Republic and throughout the Galactic Empire's reign. A Force-sensitive named Aqinos was discovered by the Jedi Order during the final decades of the Republic, achieving the rank of Jedi Master before being banished from the Order for heresy. Along with his so-called Iron Knights, Aqinos found refuge with the Altisian Jedi and eventually allied himself with the reformed Jedi Order after the death of Emperor Palpatine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}