{"url": "Battle_of_Borleias_(Yuuzhan_Vong_War;_Second)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battles of Borleias", "Category:Battles of the Yuuzhan Vong War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Borleias  (Yuuzhan Vong War; Second)"}, {"tag": "p", "text": "The Battle of Borleias consisted of a series of last-stand actions by the remnants of the New Republic during the Yuuzhan Vong War after the Fall of Coruscant. It commenced with the New Republic's Fleet Group Three retaking the planet Borleias from a Yuuzhan Vong occupation force following their retreat from Coruscant, the galactic capital. Senator Pwoe and his advisors later arrived on the planet and ordered the commander of Fleet Group Three, General Wedge Antilles, to hold Borleias in a delaying action. Antilles complied, but only under the condition that there would be no more political influence in his defensive actions and requisitioned additional military forces for his command."}, {"tag": "p", "text": "As expected, the Yuuzhan Vong sent a fleet to retake Borleias under Wyrpuuk Cha. While Antilles had planned to whittle away at Cha's forces in a war of attrition, the sudden arrival of the Star Dreadnought Lusankya as part of Antilles' reinforcements inflicted severe damage on Cha's fleet. In response, the Yuuzhan Vong sent a much larger force to seize the planet under noted strategist Czulkang Lah. Lah's goals were to seize the planet, destroy a supposed New Republic superweapon called the Starlancer Project, and capture Jedi Knight Jaina Solo. The Yuuzhan Vong's goals were thwarted early by Antilles' use of orbital bombardment to stall a ground advance, but Lah was soon reinforced and began slowly overwhelming the garrison."}, {"tag": "p", "text": "However, Antilles deceived Lah, as Project Starlancer was a fake designed only to dictate Lah's responses. While the Yuuzhan Vong successfully retook Borleias from the New Republic garrison, they suffered heavy losses, including the death of Czulkang Lah and the loss of a Koros-Strohna worldship thanks to the use of Lusankya as a ramship. Antilles and his forces evacuated the planet after a sustained defense that cost the Yuuzhan Vong heavily. As a result of New Republic personnel, volunteers and Jedi such as Wedge Antilles, Tycho Celchu, Lando Calrissian, Luke Skywalker, Jaina Solo, Kyp Durron, and Jagged Fel, the New Republic was able to buy some breathing room from the Yuuzhan Vong invasion, which eventually allowed the election of Cal Omas and the formation of the Galactic Alliance. Also, the battle helped inflate Solo's reputation as an avatar of Yun-Harla, a Yuuzhan Vong deity."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The extra-galactic Yuuzhan Vong invaded the galaxy in 25 ABY and immediately began a campaign marked by atrocities, such as the destruction of the planet Ithor. The alien species carved a path through the galaxy, taking numerous worlds and devastating others. The New Republic engaged the Yuuzhan Vong, but were unable to prevent the invaders from breaching the Core Worlds. One of the worlds that the Yuuzhan Vong seized as the staging point for their eventual assault on the galactic capital of Coruscant was Borleias, which sat on a hyperlane crossroads in the Pyria system of the Colonies and was close to Coruscant. The planet was awarded to Domain Kraal, which set about demolishing the remains of the New Republic installation there and grew living grashal buildings over top of the ruins."}, {"tag": "p", "text": "In 27 ABY, the Yuuzhan Vong attacked Coruscant despite opposition from New Republic Fleet Groups One, Two, and Fleet Group Three in a sizable engagement. The fleets clashed in space, but Coruscant's defenses were breached and the planet fell to the invaders. The New Republic's Chief of State, Borsk Fey'lya, perished in the battle, leaving it leaderless. Surviving New Republic forces as well as Jedi Master Luke Skywalker and a large contingent of Jedi who had been on Coruscant when it fell, abandoned the capital to the Yuuzhan Vong and withdrew. As they took control of the planet, the Yuuzhan Vong began terraforming the galactic capital to resemble their original homeworld of Yuuzhan'tar."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "New Republic capture of Borleias"}, {"tag": "p", "text": "Having been driven from the galactic capital of Coruscant, elements of the New Republic's Fleet Group Three, without orders, attacked Borleias. Knowing that refugees from Coruscant would head to Borleias, Fleet Group Three's leader, General Wedge Antilles, intended to use Borleias as a temporary waystation for those civilians as well as divert Yuuzhan Vong attention. Two Yuuzhan Vong coralskipper starfighters on patrol spotted the vanguard ship of Antilles' force, Mon Mothma, and attempted to engage it, but Twin Suns Squadron under Master Skywalker destroyed one and forced the other away. Other coralskippers launched from Borleias were quickly defeated and Antilles ordered Twin Suns to escort three transports down to the surface for an assault on the Domain Kraal installation."}, {"tag": "p", "text": "Flying in the armed freighter Record Time down to the surface, Lando Calrissian unloaded twenty of his new YVH 1 battle droids. The Yuuzhan Vong initially used the foliage to provide themselves cover, so as to launch thud bugs and razor bugs at their opponents. However, Calrissian had programmed his droids with a unique battle cry: \"We are machines! We are greater than the Yuuzhan Vong!\" The warriors, whipped into a frenzy, immediately broke cover and assaulted the droids face to face, but the YVH 1s were able to easily defeat them. However, the Yuuzhan Vong had summoned a rakamat creature to assist with their defense. Calrissian, with a team of engineers, buried a load of explosives in the rakamat's path and detonated them once the creature was above them while the rakamat was distracted by X-wings of Twin Suns Squadron flying close air support. The rest of the battle was mostly a mopping up action, as the Kraal survivors were forced to retreat and regroup. Their facility was overrun swiftly by the New Republic, but Antilles elected not to use it as his base of operations on Borleias. He also rejected the remains of the previous New Republic outpost, which the Yuuzhan Vong had destroyed and grown their buildings over. Instead, he opted to refurbish the abandoned Alderaan Biotics facility that had been used years before by Imperial General Evir Derricote. The Yuuzhan Vong installation was stripped of gear for study and then destroyed while New Republic forces cleared a kill zone around the biotics facility and set up starship repair operations, living quarters, and command facilities inside the building."}, {"tag": "h3", "text": "Holding the line"}, {"tag": "p", "text": "In the chaos that followed the hasty retreat from Coruscant, several remaining members of the Advisory Council and a large segment of the New Republic military forces reconvened at Borleias. The newly self-appointed Chief of State Pwoe ordered Antilles to sacrifice Borleias in a holding action long enough for the Advisory Council to flee to heavily defended Kuat. Unaware of the surviving Senate members gathering at Mon Calamari, Antilles grudgingly accepted the order, but followed its letter, not its intent, using it as permission to strike against the centralized Yuuzhan Vong forces. Antilles also ensured he received the material he needed to complete his mission by stipulating to Pwoe that any volunteers from the scattered New Republic Defense Force who wished to join would be allowed to, that no politicians would return to oversee his efforts, and the Executor-class Star Dreadnought Lusankya would be assigned to Antilles. In return, Antilles agreed to hold Borleias and relinquish command of Fleet Group Three."}, {"tag": "p", "text": "In a meeting on Borleias, Antilles, Calrissian, Colonel Tycho Celchu, and other noted veterans from the Galactic Civil War, eventually including Han Solo and Leia Organa Solo, agreed to set up a network of Rebellion-style cells on worlds to allow the ideals of the Alliance/New Republic to survive both the devastation of the Yuuzhan Vong and the faltering New Republic government. As part of his planning, Antilles also arranged to role-play the Yuuzhan Vong commander while Celchu in turn took on the role of Antilles in order to facilitate a strategy of a punishing defense of Borleias against the inevitable Yuuzhan Vong response. Upon request from Antilles, Skywalker took it upon himself to involve the Jedi present heavily in the defense of Borleias as well as in the establishment of the resistance network. However, the Jedi Master began to experience visions of darkness on Coruscant, which troubled him."}, {"tag": "p", "text": "During the fifth day of the New Republic re-occupation of Borleias, holodocumentarian Wolam Tser and his aide, Tam Elgrin, arrived on Borleias from Coruscant. They updated Antilles on the state of the Vongforming occurring on Coruscant and decided to stay on Borleias to document the defense. Little did Tser or any of the New Republic officers know that Elgrin had been captured by the Yuuzhan Vong while on Coruscant and pressed into service as a spy via mental conditioning that gave him severe headaches for not carrying out their wishes."}, {"tag": "p", "text": "Another arrival to Borleias following its occupation was the New Republic Intelligence unit Wraith Squadron that Antilles had founded years earlier. The Wraiths under Garik Loran also conveyed Antilles' wife and two children to Borleias. Their arrival eased Antilles' state of mind and allowed him to transfer command of intelligence operations to her, knowing that she had considerable experience in that area."}, {"tag": "h3", "text": "An unexpected victory"}, {"tag": "p", "text": "In response to the New Republic seizure of Borleias, Yuuzhan Vong Warmaster Tsavong Lah and his analysts determined that Borleias had some significance to the New Republic. In a slight against Domain Kraal that had lost the world, the warmaster dispatched a fleet under Wyrpuuk Cha, a member of a rival domain, to reclaim the planet. Cha arrived in the Pyria system and was advised by his spies that Antilles was defending two locations, the biotics facility on Borleias and a sensor station on one of its moons. Cha dispatched coralskippers in an aggressive assault on both locations and while his forces sent against the biotics facility were repelled with heavy casualties, the sensor station's defense was far more susceptible to his onslaught. Little did Cha know that the weak defense of the sensor station was a ploy concocted by Antilles to lull Cha into a false sense of security and reinforce the impression that the biotics facility was the only location of importance."}, {"tag": "p", "text": "However, while Antilles had planned for an indecisive engagement to string along Cha in a war of attrition, he did not anticipate the arrival of Lusankya in the midst of Cha's fleet. The massive warship, under the flag of Commander Eldo Davip, immediately crippled Cha's flagship and killed the Yuuzhan Vong leader. Accompanying Lusankya was the Millennium Falcon, newly arrived from Hapes, and both ships came under immediate Yuuzhan Vong assault. Antilles dispatched two Star Destroyers, Mon Mothma and Rebel Dream, along with starfighter units including Twin Suns and Rogue Squadrons to clear a path for the new arrivals. Lusankya and her escort inflicted severe damage on the Yuuzhan Vong fleet until its remnants retreated. Meanwhile the Millennium Falcon and its passengers, Jedi from the Mission to Myrkr, outflew coralskipper pursuit to escape unscathed. The Jedi aboard the Millennium Falcon remained on Borleias, adding to its complement of Jedi at the garrison."}, {"tag": "p", "text": "Antilles and his defense had defeated the first Yuuzhan Vong response to the seizure of Borleias, but he was not pleased, knowing that the Yuuzhan Vong would return and in greater force. Additionally, while Pwoe had delivered the Star Dreadnought as promised, he had crewed it with an ill-trained and under-qualified skeleton crew. The commanding officer, Eldo Davip, was a mere commander on a ship that merited a full admiral as its commander."}, {"tag": "p", "text": "While much of the remainder of Wyrpuuk Cha's fleet had withdrawn, some of it had been commandeered by a rogue pilot of the original Domain Kraal occupiers, Charat Kraal, in a harassment and intelligence gathering campaign against the New Republic. Kraal's intelligence would later be put to use in further Yuuzhan Vong responses against the garrison."}, {"tag": "p", "text": "In the lull after the destruction of Cha, Tam Elgrin was employed as a spy by the Yuuzhan Vong. He was given orders remotely by the traitorous New Republic senator Viqi Shesh, who instructed him to get close to scientist Danni Quee, who was a lead developer of anti-Yuuzhan Vong technology. Shesh also had Elgrin plant listening devices that insinuated that high-ranking members of the garrison were spying on each other in an effort to sow distrust. Antilles and his wife were confused by the appearance of the devices, but countered them by scripting conversations for people to say around them. Eventually, Danni Quee deduced from a recording Elgrin had made on Coruscant that he had been captured by the Yuuzhan Vong. She reported this finding to Iella Antilles, who began monitoring Elgrin."}, {"tag": "p", "text": "To distract members of the garrison, lingering Yuuzhan Vong forces under Charat Kraal that were based out of the captured lunar station harassed the Borleias garrison to test its weaknesses. Their assaults were directed both against the ships in orbit and the biotics facility, but were fended off by the garrison. Kraal's intent was not to inflict harm, but rather to obtain information to deliver to the next Yuuzhan Vong commander sent to reclaim Borleias."}, {"tag": "h3", "text": "Crafting a goddess"}, {"tag": "p", "text": "Shortly thereafter, Jedi Knight Jaina Solo, accompanied by fellow Jedi Kyp Durron and starfighter pilot Jagged Fel arrived on Borleias from the Hapes Cluster. Meeting with Antilles and her parents, Solo stated her intention to assist on Borleias. She also wanted to form a new starfighter squadron to experiment with tactics using Force-based coordination. As Luke Skywalker desired to visit Coruscant to investigate his visions of darkness, he turned over command of Twin Suns Squadron to Solo, and Durron and Fel joined the unit as well. Another idea Solo brought was cultivating the notion to the Yuuzhan Vong that she was the personification of Yun-Harla, the Yuuzhan Vong goddess of deception. During actions at Hapes, Solo had used trickery to thwart the Yuuzhan Vong and implied that she was associated with Yun-Harla. With the help of Wraith Squadron's psychological warfare experts, Solo decided to intensify her efforts. To facilitate this deception, she was given top priority in weapons and repairs for her unit, as well as special command privileges, even a porter."}, {"tag": "p", "text": "To prepare for the arrival of more Yuuzhan Vong, Antilles deployed a wide sensor net to augment his ground patrols, enlisting the help of the Jedi to do so. Luke Skywalker, his wife Mara Jade Skywalker, and newly-arrived Tahiri Veila roamed the jungle planting stakes containing gravitic sensors, knowing they were being observed by the Yuuzhan Vong. While the Yuuzhan Vong dug up the stakes, they didn't notice that the three Jedi were also deploying portable burrowing droids which contained the same sensors. Attempts to engage the Jedi were unsuccessful and resulted in several Yuuzhan Vong warriors being slain. In order to manipulate the next Yuuzhan Vong commander, Antilles developed a scheme that would dictate the Yuuzhan Vong to react when he wanted them to. The \"Starlancer Project\" was a fake long-range weapons system supposedly formed by the merging of Yuuzhan Vong lambent crystals and superlaser technology. The project allegedly was facilitated by crudely-constructed spacecraft dubbed pipefighters. Their test flights were closely observed by the Yuuzhan Vong."}, {"tag": "h3", "text": "Arrival of Czulkang Lah"}, {"tag": "p", "text": "The Yuuzhan Vong did respond, and in force. Advised by one his aides, Maal Lah, that Garm Bel Iblis, the tactician most respected by the Yuuzhan Vong, was likely in collusion at the garrison on Borleias, Tsavong Lah felt he needed a mind of equal strategic prowess to command the counter-attack, and did not have the time to attend to the conquest himself. Lah personally went to visit his father and retired warmaster Czulkang Lah to enlist his help. The elder Lah, a warrior considered among the greatest strategists of the Yuuzhan Vong but relegated to training duties due to age, agreed to take command as long as he was allowed to remain on the front lines after the recapture of Borleias. The warmaster agreed and Czulkang Lah left to retake Borleias with the entire force of Domain Hul."}, {"tag": "p", "text": "Upon arrival, Lah released a number of civilian prisoners into space in ooglith cloakers from a Yuuzhan Vong vessel, dooming them to a fiery re-entry into Borleias's atmosphere. At the time of his arrival, Solo, Fel, and Durron were in space practicing Force-based coordination of their starfighters' weapons to fire synchronized laser blasts. Several coralskippers were sent to distract Solo and her flight from assaulting the larger ship. They were successful in doing so, but all the Yuuzhan Vong starfighter analogs were destroyed. As the hostages floated towards Borleias on a trajectory that would cause them to burn up during re-entry, Fel innovated a tactic to save them. With precise, low-powered maneuvering, he used his starfighter to change their momentum away from Borleias, buying time for shuttles to arrive and save most of the hostages. While his actions were applauded, Antilles and Celchu took this as a sign that the Yuuzhan Vong had returned with a more impressive fleet and commander."}, {"tag": "p", "text": "Upon arrival, Lah was briefed by Charat Kraal on the disposition of the New Republic garrison, including the pipefighters. Rather than executing him for suborning elements of Cha's fleet, Lah promoted Kraal for his initiative and assigned him to helping capture Jaina Solo. As her twin brother, Jacen Solo, was in Yuuzhan Vong custody and twins were held in special significance by the Yuuzhan Vong, her capture was deemed an important war objective to facilitate a twin sacrifice."}, {"tag": "p", "text": "During a test-firing mission, the pipefighters were escorted into space by Rogue, Twin Suns, Blackmoon and the Wild Knights squadrons while the Millennium Falcon conveyed a number of Jedi trainees to a hidden Jedi base in the Maw Cluster. Two squadrons of coralskippers were sent after each pipefighter and were engaged by the New Republic defenders, with Twin Suns engaged last. The New Republic defenders were able to fend off the assaults with ease, but the lack of intensity in the engagement prompted Wraith Squadron tactics expert, Voort saBinring, who was flying with Twin Suns, to suspect a trap. He was correct, as two Yuuzhan Vong interdictors and coralskipper reinforcements arrived to trap Solo. Her X-wing had been identified by a creature flung onto it by Elgrin."}, {"tag": "p", "text": "Cut off from reinforcements, a desperate unorthodox combat maneuver by Jagged Fel which involved him flying interference for a pair of shadow bombs controlled by Solo and Fel destroyed one of the interdictors and drew off the Vong forces to allow the rest of the squadron to escape. However, the maneuver left Fel himself surrounded, and Jaina refused to abandon him, disobeying direct orders. To save Fel, Kyp Durron manipulated the dovin basal on an interdictor ship until it destroyed itself and the three pilots escaped as New Republic reinforcements arrived. Though Antilles had originally planned on disciplining Solo on her return to Borleias for insubordination, Fel interceded on her behalf after learning she had affections for him, allowing her action to go unpunished."}, {"tag": "p", "text": "However, the engagement had another purpose crafted by Antilles. During the test flight, the pipefighters involved \"fired\" a blast that was aimed at the Yuuzhan Vong worldship over Coruscant. Actually, the damaging blast fired at the Yuuzhan Vong vessel was a long range turbolaser burst from a New Republic warship, but Tsavong Lah was deceived into believing his worldship had come under assault from a new superweapon. The Yuuzhan Vong were even more convinced after Tam Elgrin spotted Danni Quee working on the plans for the large lambent crystals needed in the pipefighter. Elgrin was prompted to kill Quee, but could not bring himself to do so. His compelled espionage was a source of guilt for him, but he felt unable to escape his pain-inducing conditioning."}, {"tag": "h3", "text": "Emperor's Hammer"}, {"tag": "p", "text": "In response to the attack on his worldship, Tsavong Lah ordered his father to destroy the garrison in a swift, all-out assault. Reluctantly, Czulkang Lah complied, though he disagreed with the hastiness of the warmaster's orders. Thanks to both manned patrols and the sensor net Antilles had constructed, the New Republic garrison was aware of that Lah was commencing his push, but chose not to engage the landing forces as he preferred the Yuuzhan Vong to come to him."}, {"tag": "p", "text": "As the two forces prepared for battle, Tam Elgrin summoned the will to confess his role as a spy to Jaina Solo even as his conditioning caused cranial hemorrhaging due to his disobedience, and he was taken for medical treatment. Also, Luke and Mara Skywalker, accompanied by members of Wraith Squadron and Tahiri Veila, set out for Coruscant on an intelligence-gathering mission, using the confusion of the assault to slip through the defenses. They were flown out on the Record Time by Lando Calrissian and covertly inserted into orbit before Record Time was destroyed and Calrissian returned to Borleias in a B-wing starfighter."}, {"tag": "p", "text": "On the forty-eighth day of the New Republic occupation of Borleias, Lah launched a combined ground and space assault on the Borleias garrison, landing troops in multiple locations to encircle the biotics facility. Lah's initial plan had involved distracting the garrison with a space assault while his troops advanced on the biotics garrison relatively unnoticed, but he failed to achieve the element of surprise. Antilles deployed his ground and some starfighter forces to defend the garrison, including Twin Suns. Under Solo's leadership, the squadron was able to slip through the tree canopy and slip a pair of shadow bombs under two rakamats, destroying them. Their success was reined in, though, as Antilles ordered a retreat to match the rest of the defensive perimeter. The sheer number of troops and rakamats overwhelmed the beleaguered defenders and their accompanying dozen starfighter squadrons."}, {"tag": "p", "text": "Antilles continued to withdraw his forces until they were concentrated in a tight perimeter around the old Alderaanian Biotics facility, which was slowly being surrounded by concentrated Yuuzhan Vong ground troops. Many of his pilots chafed under the constant retreating until the Yuuzhan Vong were near the biotics facility. At that point, over the misgivings of Eldo Davip, Antilles initiated Operation Emperor's Hammer—the use of Lusankya to deliver an orbital bombardment to the massed Yuuzhan Vong ground troops, a tactic which they had never encountered. After the loss of so many ground troops, the Yuuzhan Vong temporarily withdrew."}, {"tag": "h3", "text": "Reinforcements"}, {"tag": "p", "text": "Both sides, having been depleted by the major clash on Borleias, soon received reinforcements. The volunteer starfighter unit Taanab Yellow Aces under Wes Janson arrived, along with the supply transport Reckless Abandon, and were escorted through a wave of coralskippers by Rebel Dream and Twins Suns Squadron. Janson had flown with Antilles years before in Rogue Squadron and Antilles was pleased to have the veteran pilot's assistance."}, {"tag": "p", "text": "Czulkang Lah was also reinforced by a sizable Yuuzhan Vong force sent to him by his son. Tsavong Lah also sent a priest devoted to Yun-Harla, Harrar, to help with the capture of Jaina Solo. Upon Harrar's arrival, the elder Lah placed Charat Kraal under Harrar's command. With his forces bolstered, Lah was ready to launch his next sortie, which would both test the defenders as well as introduce a new intelligence asset since the neutralization of Tam Elgrin."}, {"tag": "p", "text": "Two matalok capital ships were dispatched to assault the biotics facility from low atmosphere and were engaged by New Republic starfighters, including Twin Suns and Rogue Squadrons. Several coralskippers rammed the protective shield around the biotics facility, allowing for one to crash-land and deposit a disguised Yuuzhan Vong agent onto the biotics facility grounds. However, Solo employed her newest weapon, a missile that fired dozens of decoy projectiles designed to emulate proton torpedoes and distract the Yuuzhan Vong defensive dovin basals. With the defenses confused, the real torpedoes fired by her squadron were able to mortally wound the matalok, destroying the vessel. The Yuuzhan Vong, disheartened by the loss of the warship, withdrew, as they had successfully inserted their operative."}, {"tag": "p", "text": "The Yuuzhan Vong operative, tasked with finding and destroying Project Starlancer, was able to infiltrate the biotics facility and even captured a Bothan mechanic who had been working on the pipefighter. However, he was discovered by a newly-freed Elgrin, who recognized the Yuuzhan Vong biots that the operative was using in his espionage. Elgrin followed the agent down a tunnel where the Yuuzhan Vong was torturing the mechanic for information. Elgrin distracted the warrior and freed the mechanic, but was unable to subdue the Yuuzhan Vong. However, security forces arrived and killed the infiltrator before he could kill Elgrin or escape."}, {"tag": "p", "text": "Solo continued devising new methods of confusing and deceiving the Yuuzhan Vong. Having been given a B-wing starfighter by Antilles, she recruited a shuttle pilot named Beelyath to fly it as an assault starfighter. However, the special privileges and resources afforded to Solo and her unit rankled with some of the other pilots. Furthermore, Jagged Fel was encouraged to return to Chiss space from whence he and his subordinate Shawnkyr Nuruodo had come by Nuruodo, who felt that their mission to report on the threat of the Yuuzhan Vong was complete. Though he decided to remain on Borleias and aid the defense, Nuruodo made him promise that if she died, he would return in her place."}, {"tag": "p", "text": "While Solo had been busy aiding the defense of Borleias, her parents had been establishing resistance cells on other worlds. Upon their return to Borleias, they found the planet besieged by the Yuuzhan Vong. Dovin basal minefields and coralskipper patrols were layered around the world. They also reported to Antilles that the dovin basals were now capable of pursuing specific spacecraft that were considered valuable to the Yuuzhan Vong, such as the Millennium Falcon."}, {"tag": "p", "text": "Despite his success in defending the besieged Pyria system against Lah's first major attack, Antilles knew he would not be able to resist a full scale assault by the Yuuzhan Vong forces. In the ensuing skirmishes, the Yuuzhan Vong targeted the space fleet, slowly whittling away at the numerically inferior New Republic forces. Lusankya was heavily targeted, sustaining severe damage and Antilles opted to instead co-opt the Star Dreadnought for another purpose than fleet engagement rather than continue repairing it. The return of Luke Skywalker and his party from Coruscant witnessed the near-constant bombardment of the biotics facility and ships in orbit. Due to casualties in Blackmoon Squadron, Skywalker and his wife were installed as the replacement commander and executive officer respectively."}, {"tag": "p", "text": "As Antilles prepared for the final clash with Lah, he had his wounded covertly ferried up to ships in orbit in preparation for an escape. The general also revealed his battle plan and the true nature of Project Starlancer to his staff. While Pwoe had demanded that Borleias be held to the end, Antilles had chosen to inflict severe losses on the Yuuzhan Vong and then retreat with as much of his command as possible."}, {"tag": "h3", "text": "Final engagement"}, {"tag": "p", "text": "The Yuuzhan Vong had slowly drawn the noose around the Borleias garrison, but it was Antilles who dictated the timing of the final assault by launching his pipefighters and evacuating the installation. Convinced of the veracity of the threat posed by Project Starlancer, Czulkang Lah dispatched his forces to destroy the pipefighters before they could fire. Charat Kraal and a sizable force of specially-trained coralskipper pilots were sent to assault the elite squadrons protecting the pipefighters and specifically attempt to capture Jaina Solo. As the pipefighters reached orbit, Antilles also ordered Lusankya to break orbit as well and head for space. While the Yuuzhan Vong were focused on the pipefighters, Antilles had different objectives for the battle."}, {"tag": "p", "text": "The escort starfighters protecting the pipefighters jumped to hyperspace to rendezvous with Lusankya, which had been pulled from hyperspace near a dovin basal mine and close to the Domain Hul worldship. While the Yuuzhan Vong destroyed the pipefighters with ease, they were unprepared for Lusankya to appear so close to the worldship. Another surprise for the Yuuzhan Vong occurred when the Star Destroyer Errant Venture, which had been reinforced with defensive batteries removed from Lusankya, destroyed two mataloks before escaping to hyperspace. In fact, Lusankya was only lightly armed and crewed by a single individual. The entire final engagement was a massive trap by Antilles, who had converted Lusankya into an explosive-filled ramming ship designed to destroy the worldship in a plan he dubbed \"Operation Emperor's Spear.\" Using technology developed by Danni Quee, Han Solo launched four missiles that mimicked the gravitic signature of the Millennium Falcon, which caused dovin basals to enter the system in an attempt to capture the Falcon. This prevented the withdrawal of Yuuzhan Vong worldship."}, {"tag": "p", "text": "Coralskippers from the Yuuzhan Vong worldship, soon reinforced by Charat Kraal's force, engaged the six squadrons protecting Lusankya, but sustained severe casualties. While Lusankya was heavily damaged, its engines remained intact, propelling it towards the worldship, which was hampered from jumping to hyperspace by the dovin basal mines. While the Yuuzhan Vong attempted to capture Solo, members of Twin Suns Squadron emulated her behavior and ship's gravitic signal so she could escape Yuuzhan Vong attacks. In another deception designed to exploit the Yuuzhan Vong fixation with Solo, she developed a weapon dubbed the goddess missile, which had the same gravitic signal as her X-wing. Wraith Squadron pilot Sharr Latt controlled the missile from the B-wing flown by Beelyath and used it to lure numerous Yuuzhan Vong pilots, including Charat Kraal, to their doom in a dovin basal minefield."}, {"tag": "p", "text": "The battle came to a head when Luke Skywalker signaled for reinforcements to assist Lusankya as the Star Dreadnought approached the worldship. Mon Mothma arrived, powering up its gravity well projectors to further hamper the worldship's motion. Quee's advances also allowed Mon Mothma to jam the yammosk war coordinators, disrupting Yuuzhan Vong synchronization. The New Republic forces pinned the worldship in place and defended Lusankya while Eldo Davip drove the massive Lusankya deep into the heart of the worldship where it detonated. Lah had realized that his vessel was doomed and contacted his son in his last moments, informing the warmaster of the Yuuzhan Vong success at re-taking the planet and his imminent death. Having locked Lusankya into a collision course, Davip escaped from the massive suicide vessel in a BTL Y-wing starfighter that had been concealed in Lusankya for his escape just as the prow of Lusankya rammed into the worldship and destroyed it. For his efforts, Davip was promoted to major general."}, {"tag": "p", "text": "Meanwhile, having coordinated the evacuation from the biotics facility, Wedge Antilles found himself as the last man remaining on the planet's surface. With Yuuzhan Vong forces approaching, he took off in a remaining X-wing and set off to join the fleet when he came across a stranded transport undergoing repairs. Risking his life to defend the evacuees, Antilles singlehandedly held off Yuuzhan Vong ground forces and coralskippers. The pilot was able to add over a dozen coralskipper kills to his name and saw the transport to safety before his ship succumbed to battle damage. As his fighter was about to be destroyed, Rogue and Blackmoon Squadrons returned and drove off his attackers."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Yuuzhan Vong were thrown into confusion by these losses and the surviving New Republic forces withdrew without any further major engagement. While they were successful in retaking Borleias, the Vong suffered heavily in terms of ships and personnel, including the legendary Czulkang Lah. This blow was enough to shake the confidence of Warmaster Tsavong Lah and blunted the Yuuzhan Vong offensive. Left in command of the remains of Charat Kraal's group, Harrar opted not to pursue, preferring to withdraw to Coruscant."}, {"tag": "p", "text": "Antilles and his fleet withdrew and continued to see service throughout the Yuuzhan Vong War. Jaina Solo's status among both the New Republic and the Yuuzhan Vong grew substantially as a result of the engagement. The Yuuzhan Vong came to regard her as an avatar of Yun-Harla, a notion which she exploited. The resistance network laid by the Solos and other defenders of Borleias would also prove to aid in the war effort."}, {"tag": "p", "text": "Both Wolam Tser and Tam Elgrin escaped Borleias after having stayed for most of the siege to record holo footage of the battle and the defenders. This footage was later turned into a holodocumentary dubbed Battle of Borleias. This documentary portrayed the defenders of Borleias as heroic and boosted both morale and recruitment for the New Republic's defense forces."}, {"tag": "p", "text": "The time it took the Yuuzhan Vong to recover allowed the New Republic to recoup, recover, and reorganize itself into the Galactic Alliance while planning new engagements against the invaders. The election of Cal Omas as Chief of State over other rivals such as Pwoe meant that the galaxy was able to be unified against the Yuuzhan Vong and the respite gained from the hitherto relentless Yuuzhan Vong offensive allowed the New Republic to implement a strategy of harassment and training until the Yuuzhan Vong ready fleet could be smashed at the Battle of Ebaq 9, which would also see the death of Tsavong Lah."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Borleias was created for the Enemy Lines Duology by Aaron Allston as part of the New Jedi Order novel series. According to Allston's website, the first book, Rebel Dream begins a few days after Luke and Mara Skywalker's departure from Hapes as recorded in The New Jedi Order: Dark Journey, while the end of Rebel Stand overlaps the beginning of the next book in the series, The New Jedi Order: Traitor. Despite the backdrop of war and in particular the Battle of Borleias throughout the duology, Allston said that both novels are about families."}, {"tag": "p", "text": "Allston also said on his website that he didn't specifically name Operation Emperor's Hammer, which was featured in the Battle of Borleias, after the Emperor's Hammer fan group, but said it was possible there was a connection. Allston also described some of the backstory for the Yuuzhan Vong military commander in charge for most of the Battle of Borleias, Czulkang Lah. Lah was established as having earned his military reputation during internecine clashes within the Yuuzhan Vong, wargames, and against any other enemies that the Vong encountered during their flight to the galaxy."}, {"tag": "p", "text": "The Battle of Borleias was mentioned several times in later New Jedi Order books and also in several subsequent reference works, including The New Essential Chronology, The New Essential Guide to Droids, and the The Essential Atlas. References in other works have also been made to Battle of Borleias, an in-universe documentary produced by Wolam Tser about the course of the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}