{"url": "Supernova_(Sith_magic)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Supernova  (Sith magic)"}, {"tag": "p", "text": "Causing supernovas through Sith magic was a dark side ability that allowed the conjurer, his or her power amplified by Sith crystals, to purge the core from a star, thereby causing a stellar explosion. This ability had the potential to backfire on the conjurer."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "With the use of ancient Sith crystals, a Sith sorcerer could channel the dark side of the Force into a weapon so strong it could rip the core right out of a star. The sorcerer could then manipulate the core through the Force, and throw it as a projectile at potential targets, vaporizing them instantly. Only the strongest masters of the dark side could fully maintain control of the supernova. Less adept maneuvers used this technique at their own peril, for without the necessary strength in the Force the liberated core would very likely consume the caster, or set off a chain reaction of supernovae, much like what happened in the Cron Cluster. A variation of this was to use the Force and directly control star power."}, {"tag": "h3", "text": "History"}, {"tag": "p", "text": "The ancient Dark Lord of the Sith Naga Sadow was a master of this ability. The Sith crystals he used to power the Corsair were in reality a superweapon, imbued with the power manipulate solar energy. In 5000 BBY, the Dark Lord flew his damaged Corsair warship between the Denarii binary stars, with Galactic Republic forces in pursuit. Using his knowledge of Sith magic, Sadow manipulated the Denarii's solar flares and used them to delay Empress Teta and the ensuing Republic Fleet as a last desperate measure."}, {"tag": "p", "text": "The only other user of this ability was the sorceress Aleema Keto, who harnessed the same power from exactly the same power source, the Corsair. During the Battle of Kemplex IX, Keto unwittingly used the crystals to wrench a solar core free and hurl it at the advancing Republic fleet. Keto was nowhere near as powerful as Naga Sadow, and when she tried to use the power it backfired on her; the freed solar core ignited nine other stars and consumed her, creating the Cron Drift."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}