{"url": "Super_Star_Wars", "categories": ["Category:Real-world articles", "Category:1992 computer and video games", "Category:Legends console video games", "Category:Super Nintendo Entertainment System games"], "nodes": [{"tag": "h1", "text": "Super Star Wars"}, {"tag": "p", "text": "Super Star Wars is the first of a series of three Super Nintendo games based on the original three films of the Star Wars series, released in November 1992. In 2009 the game was released on the Wii's Virtual Console and on November 17, 2015, it was ported to PlayStation 4 and Vita. The term Super Star Wars can refer to the first game or the entire series. All are essentially platform games, although they all have stages which feature other challenges, such as driving a landspeeder or piloting an X-wing fighter. All three also feature multiple playable characters with different abilities."}, {"tag": "p", "text": "The game's manual added a number of names and details not spelled out in the game itself."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot and gameplay"}, {"tag": "p", "text": "Super Star Wars generally follows the Star Wars: Episode IV A New Hope plot closely, with some changes made to suit a platform action game. Characters have to fight their way from scene to scene. Instead of simply buying the droids from the Jawas, Luke Skywalker meets C-3PO in the desert, then fights his way into and through the Jawa Sandcrawler to rescue R2-D2. The player characters, not Obi-Wan Kenobi, shut down the tractor beam after fighting a number of enemies."}, {"tag": "p", "text": "The player is able to initially control Luke Skywalker, then can choose Han Solo or Chewbacca as the game progresses. Other levels have players control Luke's landspeeder and an X-wing fighter."}, {"tag": "p", "text": "At one point, the game was to include a garbage compactor level, where the Dianoga would likely be the boss. Early press images included a screenshot from that scene."}, {"tag": "h3", "text": "Levels"}, {"tag": "h3", "text": "Weapons"}, {"tag": "h3", "text": "Power-Ups"}, {"tag": "h3", "text": "Enemies"}, {"tag": "p", "text": "The game's manual refers to many Cantina aliens by their individual names, but since multiple versions appear fighting in one scene this list assumes there are also other, multiple members of those species present."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Screenshot gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Critical reaction"}, {"tag": "p", "text": "The entire Super Star Wars series earned mostly acclaim from both critics and fans. Its graphics were considered cutting-edge for their time, with the driving stages employing Mode 7 graphics, a primitive form of 3D of which the Super Nintendo hardware was capable. Particularly well-received was the game's lush sound, with its accurate representation of the film's famous John Williams soundtrack. On the negative side, the entire series would develop a notoriety for its unforgiving difficulty, which would often frustrate even skilled players."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "External links"}]}