{"url": "Superlaser/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Superlasers"], "nodes": [{"tag": "h1", "text": "Superlaser"}, {"tag": "p", "text": "A superlaser was a device which merged several separate \"super laser beams\" into a single exceedingly powerful beam. The largest superlasers ever designed, such as those in the Death Star and Death Star II, were superweapons capable of obliterating an entire planet with one shot at full power. There were also smaller-scale yet still immense superlasers designed for use by and against capital ships; these could destroy even the largest vessels at a single shot—and while they would not destroy a planet, they could nonetheless quickly devastate one's surface. Much more prosaically, compact superlasers were also used in industry; the Geonosians, for example, employed compact superlasers to melt iron ore in their droid factories."}, {"tag": "h2", "text": "Operation"}, {"tag": "p", "text": "The superlaser was composed of several exotic matter beams accelerated and amplified by gigantic focusing magnetic lenses and coils, producing a single powerful beam. Unlike turbolasers, it pulled energy from a massive hypermatter core, converting the energy present in hyperspace into highly unstable particles that were tremendously destructive in normal space. The energy delivered into a target was so great that it could cause the target's atoms to split into matter/antimatter pairs and annihilate themselves, creating hundreds of miniature singularities while generating a powerful surge capable of rupturing the barrier between normal space and hyperspace."}, {"tag": "p", "text": "As any powered weapon, it drained the amount of energy required to use, resulting in different energy outputs. The Death Star's superlaser, for example, could destroy any capital ship with less than 10 percent power, crack a planet open to the core with two 30 percent shots and blow it to pieces with a full-charged fire. In such cases, the amount of energy involved was so great it would generate minuscule space-time singularities, sending part of the target's mass into hyperspace and generating a massive shock wave from high-energy tachyons from hyperspace. Due to its focusing lenses and beam intensity, the energy wasted was extremely low, leading to a very long shooting range, up to 2,000,000 kilometers (over six light-seconds)."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The power of the first Death Star's superlaser was estimated to have been more than 2.4×1032 watts,[source?] with an optimum range of 2,000,000 kilometers and a working range of 420,000,000 kilometers. Powerful enough to destroy a terrestrial planet, it was the most powerful energy weapon ever built at the time."}, {"tag": "p", "text": "Powered by the Death Star's colossal hypermatter reactor, 64 tributary shafts generated eight beams that united to form the primary beam over the central lens of the weapon. These tributary beams were arranged around an invisible, central focusing field, firing in an alternate sequence to build the power necessary to destroy a planet. A crew of one hundred and thirty-two gunners—fourteen per amplification crystal—were required to manage this sobering power."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The birth of the superlaser"}, {"tag": "p", "text": "The concept of the superlaser, Emperor Palpatine's most frightening weapon, was born in the mind of Grand Moff Wilhuff Tarkin. The use of such massive and terrifying weapons to inspire terror on the citizens of the Empire became the core of his Tarkin Doctrine. The idea was later realized by Bevel Lemelisk, as well as by Geonosian weapons engineers. As early as in 19 BBY, shortly before the foundation of the Galactic Empire, Supreme Chancellor Palpatine sent the 501st Legion to retrieve a Mygeetan energy crystal that was later utilized as a power source of the Death Star superlaser in Project Hammertong, a top secret research program to develop a fully operational superlaser. During development, the Composite Beam Superlaser was developed after initial plans regarding the Concave Dish Composite Beam Superlaser ran into development problems, although the problems in the latter weapon ended up fixed, thus rendering the former weapon unnecessary."}, {"tag": "p", "text": "The proof-of-concept model of the superlaser was built at the Maw Installation in the Kessel system. This model became known as the Death Star prototype. Finally, the first full-scale superlaser was installed in the first Death Star battlestation, becoming its primary weapon. In 2 BBY, Galen Marek traveled through one of the firing tubes in the superlaser dish during the Battle on Death Star I, causing structural damage in the process."}, {"tag": "h3", "text": "Use and deployment"}, {"tag": "p", "text": "The full-scale superlaser was built in the Death Star and was used six times—it was first used during a Rebel raid on the Death Star, when Rebel agent X2 used the yet-unfinished superlaser to destroy one of the escorting Star Destroyers, then it was fired once with four percent power to destroy the Fortressa, a Lucrehulk-class battleship under Rebel control, three shots were fired as a secret test shortly after, to destroy the prison planet Despayre, and another shot with full power to destroy Alderaan and demonstrate the Galactic Empire's strength, with the superlaser shot being powerful enough to completely overwhelm the planetary shield of Alderaan. This immense power made the Death Star one of the most powerful weapons in the history of the galaxy. However, before it could fire a seventh time at the Rebel Alliance base on Yavin 4, it was destroyed at the Battle of Yavin."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, an experimental Star Destroyer equipped with a superlaser, the Conqueror, was commissioned under the command of Admiral Victor Strang, a former Storm Commando, to hunt down Rebel bases."}, {"tag": "p", "text": "A smaller version of the first Death Star's superlaser was also installed on the Tarkin battlestation. This weapon was used by Grand Admiral Martio Batch to crack the planet Aeten II and acquire its deeply buried supply of remaining stygium crystals. It too would be destroyed by Rebel forces, who infiltrated the station while it was under construction and sabotaged the superlaser. When the superlaser was fired, it overloaded, destroying the station."}, {"tag": "p", "text": "In the years leading up to the Battle of Endor, at least two habitation spheres were being built around Coruscant. They were claimed to be for peaceful purposes only, but had indentation marks identical to the focusing lenses on other superlasers. They were presumably destroyed following the partial collapse of the Empire in 4 ABY."}, {"tag": "p", "text": "A superlaser was also built in a testing facility on the planet Dubrillion. It was used against a small Rebel fleet, but ultimately destroyed in the Battle of Dubrillion in 3 ABY."}, {"tag": "p", "text": "While working of the second Death Star, Lemelisk delved into the operational capability of the superlaser systems, fixing several flaws on the primary weapon of the first Death Star. He also devised several innovations, planning to convert the superlaser into an even more powerful weapon. Numerous upgrades were performed on the superlaser design when it was reincorporated into the Death Star II. Whereas the original superlaser took a full 24 hours to recharge, the new one possessed a rate of fire separated by minutes, not days. The new superlaser also had more individual beams—nine in total—with one in the center facilitating greater accuracy. The new targeting system allowed it to fire at smaller targets, such as capital ships, as opposed to only planets. Though these modifications allowed the Imperial forces to inflict significant casualties on the Rebel fleet during the Battle of Endor, this station was also destroyed."}, {"tag": "p", "text": "In the months following the Battle of Yavin, Eclipse, the first ship and prototype for the Eclipse-class dreadnoughts, had been undergoing construction for some time. Shortly after the Battle of Endor, the Eclipse was stolen by Tyber Zann's Zann Consortium. Though incomplete, its superlaser was operational and was used against the fleets of the Galactic Empire and the Rebel Alliance during the Battle for the Eclipse. However, the powerful Star Destroyer was abandoned by the Consortium on the orders of Zann himself, since he believed that it would be too big of a target for the Rebels and the Empire to ignore. In the years after Endor, Eclipse was still undergoing construction, eventually becoming fully operational for Operation Shadow Hand in 10 ABY. It was armed with a superlaser that could slash through planetary shields, sear the crust and blow apart entire continents. This fact made Eclipse and its successor, Eclipse II, the most powerful capital ships ever built. However, Eclipse was destroyed in the Battle of Pinnacle Base, and Eclipse II was destroyed after the Battle of Onderon, along with the Galaxy Gun."}, {"tag": "p", "text": "A few months after Endor, a third Death Star was eventually discovered to have been developed. The newly formed New Republic later partook in a mission to destroy it, and succeeded. Similar to its predecessors, it was also outfitted with a superlaser, although it never got a chance to use it before its destruction."}, {"tag": "p", "text": "In 11 ABY, Tol Sivron used the Death Star prototype to destroy Kessel's Garrison Moon. Sivron planned to test the effectiveness of the superlaser by obliterating Kessel, but due to a malfunctioning targeting mechanism, the Death Star prototype accidentally hit the wrong target. Shortly afterwards, the Death Star prototype was destroyed when Kyp Durron lured it into one of the Maw's black holes during the Battle of the Maw Installation."}, {"tag": "p", "text": "The last known superlaser was built by Durga the Hutt for the Darksaber battle station. However, due to design problems and flawed construction, it never functioned properly. The forces of the New Republic attacked it before it was completed, and it was destroyed in the Hoth asteroid field. Rumors abound, however, that notorious smuggler Booster Terrik acquired Darksaber schematics from the Hutts, and installed a fully operational superlaser on his ship, the Imperial II-class Star Destroyer Errant Venture."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars 51 called the Death Star's main weapon an ionic cannon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}