{"url": "Battle_of_Borosk_(137_ABY)", "categories": ["Category:Legends articles", "Category:Battles in the Prefsbelt sector", "Category:Battles of the Second Imperial Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Borosk  (137 ABY)"}, {"tag": "p", "text": "The Battle of Borosk was fought between stormtrooper forces loyal to Roan Fel and those loyal to the New Empire under Darth Krayt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As a precursor to the main assault on the 908th's fortress, Lord Maleval and units of the 407th, including Joker Squad, Company C, Battalion 9, captured and secured the gun emplacements along the perimeter wall of the 908th's HQ in heavy fighting."}, {"tag": "p", "text": "The next day, Joker Squad led the assault into the 908th's main fortress. Its defenses were breached around midday, and combat resorted to hand-to-hand in the tight corridors. The 908th's final resistance was centered in what used to be their main mess hall. Gun emplacements had been positioned by the 908th on the upper level walkways, and mines had been placed on the floor. Despite this, the 407th and Lord Maleval destroyed the remaining elements of the 908th to the last man."}, {"tag": "p", "text": "After the battle, Sith Lord Maleval brought Lieutenant Gil Cassel's brother (a member of the 908th Division) to him and ordered him to kill him to prove his loyalty. Gil refused, and Maleval killed both of them as traitors. Hondo Karr, one of the 407th's stormtroopers, attacked Maleval with a vibro-sword in retaliation. Maleval used his electro-whip to attack Karr, but before Karr could be killed, Anson Trask shot the Sith Lord in the back, killing him. The event covered up in the unit's official report to its superiors."}, {"tag": "p", "text": "Following the battle, the control of Borosk and its system would go back and forth between Fel and the Sith Empire. In 138 ABY, however, the Sith would retake control of the planet in another battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}