{"url": "Supreme_Commander_(Empire)/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire ranks", "Category:Imperial Supreme Commanders", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Supreme Commander  (Empire)"}, {"tag": "p", "text": "The title of Supreme Commander, also Supreme Commander of the Imperial Forces, Supreme Commander of the Imperial Fleet, Supreme Fleet Commander, or Supreme Commander of the Imperial Military, was borne in succession by several of the most senior officers in the Imperial Military of the Galactic Empire, including Darth Vader before the Battle of Endor, Luke Skywalker during the resurrection of Emperor Palpatine, and later by Grand Admiral Gilad Pellaeon. Although technically the Emperor, as the Head of State, Head of Government and the Commander in Chief, held absolute authority over the Imperial forces, the Supreme Commander held direct command over the segments of the Imperial Military."}, {"tag": "p", "text": "In fact, specific references had Vader and Skywalker as \"Supreme Commander of the Imperial Forces\" and Admiral Pellaeon rather as \"Supreme Commander of the Imperial Fleet\" or \"Supreme Fleet Commander\"; but all three men's ranks were sometimes abbreviated to \"Supreme Commander\"."}, {"tag": "p", "text": "Lord Vader occupied a personal role as Palpatine's lieutenant, with several titles and offices including Dark Lord of the Sith and warlord; the specific title of Supreme Commander became more prominent in the post-Endor Empire as a position of great power, until in the era of the Imperial Remnant some nineteen years after the Battle of Yavin, the Supreme Fleet Commander assumed the duties and responsibilities of head of state of Imperial Space. During the Imperial Civil War, warlords claimed the title of Supreme Commander."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Before Endor"}, {"tag": "p", "text": "Lord Vader held several different military and paramilitary titles within the Imperial hierarchy, including that of Supreme Commander. It was as Supreme Commander of the Imperial Forces that Luke Skywalker took up his father's place at the side of a reborn Palpatine, hoping to destroy the Empire from within, and for this reason, Vader can be seen as the prototype of later Supreme Commanders."}, {"tag": "p", "text": "During the Battle of Yavin, Lord Vader was apparently only Palpatine's observer aboard the Death Star, with operational control in the hands of Grand Moff Wilhuff Tarkin, even though Vader technically outranked him; soon after, however, he was given command of the forces charged with prosecuting the war against the Rebel Alliance, and perhaps a wider commission to maintain order throughout Imperial space. His powers may be presumed to have been conferred by the time he returned to destroy the Rebel base: by this point he had taken charge of Executor, the largest warship in the galaxy, as his command ship; and Admiral Griff and the Sector Group of the Bright Jewel Oversector—one of the most important Navy commands in the Empire—were subordinated to his command."}, {"tag": "p", "text": "Vader would remain in a similar role for the next three years and more, hunting the Rebels—and in particular, his son Luke Skywalker—all across the known galaxy, leading Executor and her attached armada of Star Destroyers through the battles of Derra IV and Hoth, and the preparations for the Battle of Endor. Although Vader did not command directly at Endor, it appears that the fleet believed that he was in charge, and it was his second-in-command, Firmus Piett, who directed the naval aspect of the battle from the bridge of Executor."}, {"tag": "h3", "text": "After Endor"}, {"tag": "p", "text": "Vader's death, along with that of Palpatine, threw the Empire into turmoil. After Endor, it is unclear whether any new Supreme Commander was appointed by any of the factions claiming to rule the Empire, and no obvious leader emerged until Grand Admiral Thrawn returned from the Unknown Regions. Thrawn was endorsed by the advisors and the Moffs and Grand Moffs, although with the rank of Grand Admiral and the title of warlord, he was already de jure the senior officer in the attrited military, and by virtue of the legatine powers these ranks conferred, de facto commander-in-chief. If Thrawn was not formally constituted as Supreme Commander—and he may have been—he certainly exercised the powers of the office in all but name."}, {"tag": "p", "text": "After Thrawn's death at Bilbringi, the military hoped to appoint a new Grand Admiral, but the struggle for power between fractious Imperial factions precipitated a civil war, out of which emerged the \"reborn\" Palpatine in a series of clone bodies, ruling from the Deep Core world of Byss. Against this background, Rebel hero Luke Skywalker took up his father's old post of Supreme Commander, part of a remarkable battle of wills between Palpatine and the Jedi Master. Palpatine knew that Luke was attempting to bring down the Empire from the inside, and Luke knew that Palpatine was hoping to seduce him to the dark side of the Force. As Supreme Commander, Luke deliberately fought a wasteful and destructive campaign designed to cripple the Imperial war machine, and ensured the destruction of the World Devastators; although it seemed for a time that Palpatine's machinations had nevertheless eclipsed the good man that he was, threatening to plunge the galaxy into a new dark age. Utlimately, the son of Anakin Skywalker returned to the light, and joined with his sister Leia Organa Solo and his unborn nephew Anakin Solo to destroy the tyrant."}, {"tag": "p", "text": "The demise of Palpatine's clone and Skywalker's return to the New Republic did not, however, prompt a crisis to compare with that which had ensued after Endor; command passed smoothly to Sedriss QL, a Force-adept Imperial, as well as a distant descendant of the Sith Lord Ulic Qel-Droma, with the rank of Military Executor. It is possible that, as in other aspects of Imperial government, Palpatine deliberately created overlapping spheres of responsibility, with the Executor being formally a proxy of the crown and the Supreme Commander the official head of the military chain of command; alternatively, it may be that \"Military Executor\" and \"Supreme Commander of the Imperial Forces\" are in fact two styles for the same position—perhaps Palpatine, confident that Luke was now his creature, had removed him from military command to further mould him to his will, and placed Sedriss in his stead as Supreme Commander."}, {"tag": "p", "text": "Be that as it may, Executor Sedriss took over Supreme Commander Skywalker's role in charge of the galaxywide campaign code-named Operation Shadow Hand, and continued in this capacity when another, final clone of Palpatine awoke on Byss. After Sedriss's death, another Dark Jedi, Xecr Nist, was appointed his successor, but defeated by Skywalker and Kam Solusar, he became a prisoner of war, and died in captivity soon after the destruction of Palpatine's final clone."}, {"tag": "h3", "text": "Reorganization after the final death of Palpatine"}, {"tag": "p", "text": "The final death of Palpatine, and the subsequent implosion of the Interim Ruling Council removed any illusion of order from the remnants of the Imperial government and military; during 11 ABY, it seemed that the Empire had ceased to exist, but by 12 ABY, legitimate authority rested with an enfeebled Council of Moffs on a secret capital code-named Bastion, while most of the Empire's military resources were in the hands of warlords who recognized no authority but their own. It is not known whether the Moff Council appointed a Supreme Commander immediately, but an attempt by the Ancient Houses and the major Imperial-aligned corporations to forge a new focus of legitimate authority around Palpatine's putative son Irek Ismaren seems to have enjoyed tacit support from Admiral Blitzer Harrsk, the most powerful of the warlords: given his status, Harrsk may have been offered overall military command by the new regime, but in the end, this scheme proved unsuccessful."}, {"tag": "h3", "text": "Imperial reunification"}, {"tag": "p", "text": "It was instead Admiral Daala who next emerged to lead the Imperial war machine. After Imperial authorities decommissioned her crippled flagship, she appointed herself to a roving ambassadorial commission, uniting the rival warlords' forces by assassinating their leaders and combining their fleets under her command, with all the powers of a Supreme Commander or Military Executor and, to an extent, the trappings of an \"Empress\", such as a cadre of Royal Guards. This notion is not unusual and is similar to how Ysanne Isard was the effective stewardess of the Galactic Empire in the years before the Seizure of Coruscant despite the fact her official title remained Director of Imperial Intelligence."}, {"tag": "p", "text": "Following the debacle at Yavin, Daala surrendered her command to Vice Admiral Gilad Pellaeon, who was soon after found serving the Moff Council as the titular \"Supreme Commander of the Imperial Fleet\". It is unclear precisely what relationship this title has with previous Supreme Commanders; what is clear is that though he carried a Fleet-specific title, Pellaeon's powers as commander-in-chief extended to all Imperial forces, as evidenced by his use of the term \"Supreme Commander of Imperial forces\" (purposefully lower-case). This makes it clear that his military powers are certainly the comparable, if not identical to that of supreme commanders during the height of the New Order. Under the Imperial Remnant, this position also served as a sort of chairman and president of the Moff Council, though Pellaeon was not a Moff himself. Additionally, in this capacity Pellaeon would be promoted to the much-venerated rank of Grand Admiral. This combination of powers and titles would eventually lead to the merger of civil and military powers under the Fel Empire wherein the Supreme Commander by apparent writ would hold the rank of Grand Admiral, carry the title and powers of Supreme Commander, and additionally be styled \"High Moff\" for his or her role as chair of the Moff Council."}, {"tag": "p", "text": "Pellaeon's evolving powers in this capacity are best demonstrated by his otherwise cautious proposal to the Moff Council in favor of peace with the New Republic in 19 ABY as compared to his far sterner approach to politics during the Yuuzhan Vong War, particularly following the fall of Bastion. His place as Imperial hegemon remained firm even after his \"official\" retirement following the war as he reverted to his previous role at the head of the Empire, though it is unclear whether he ever resigned his Imperial postings during his tenure as Galactic Alliance Supreme Commander. Even with these consolidated powers, animosity between the military and civil sectors of Imperial politics would remain high, as evidenced by an attempted coup and Pellaeon's eventual assassination, both machinations of Moffs."}, {"tag": "h3", "text": "Imperial Space after the Pellaeon–Gavrisom Treaty"}, {"tag": "p", "text": "After peace was secured between the New Republic and Imperial Space in the form of the Pellaeon–Gavrisom Treaty, the position of Supreme Commander of the Imperial Fleet became one of the most important posts in the Imperial government. Pellaeon was the chief Imperial negotiator and signatory to the peace treaty, and by some means whose details are, as yet, unknown, he came to assume the rank of Grand Admiral and also the chairmanship of the Council of Moffs, thus making him effectively both the commander-in-chief of Imperial forces and Imperial head-of-state. The powers of this position included the ability to override military decisions made by individual Moffs, most especially concerning the use of the Starfleet, and the power to federate the individual Sector fleets. His powers could be checked by the Council, however, including the ability to recall the Supreme Commander from expeditions outside the territory of the Imperial Remnant."}, {"tag": "p", "text": "As Grand Admiral Pellaeon had been the only Imperial Supreme Commander in the post-treaty era, it is unknown whether he wielded his authority as a constitutionally-appointed magistrate, or through personal prestige and precedent. With the Imperial Remnant later a part of the Galactic Alliance, it was also unknown what political powers the Supreme Commander still retained; however, because of the Galactic Alliance's confederate-style of government, he most likely retained power in Imperial Space as head of state and military commander-in-chief answering to the government of the Galactic Alliance, much as Queen Mother Tenel Ka did in Hapes. It seems that at least the name of the posting had become synonymous with Pellaeon's rank; by 28 ABY, Pellaeon was already known specifically as Grand Admiral of the Imperial Fleet, a trend that extended into the new Galactic Empire."}, {"tag": "h2", "text": "Ascension to the post"}, {"tag": "p", "text": "The several Supreme Commanders who led the Imperial war machine came to power in a variety of different ways. Vader was apparently made Supreme Commander by a direct appointment from Emperor Palpatine, as was his son when Palpatine was reborn in a clone body. Xecr Nist and probably Sedriss before him were likewise appointed as Executors by Palpatine. Thrawn was ranking officer in the military, and Daala assumed command by killing off the thirteen most powerful warlords and taking control of their fleets. Daala later relinquished command to Pellaeon, but it is unknown how and when he became officially Supreme Fleet Commander."}, {"tag": "h2", "text": "Evolution of powers"}, {"tag": "p", "text": "At its inception, the title and position was granted to Darth Vader. It seems that in this capacity, Vader's powers were those of Commander-in-Chief of all Imperial forces, answering only to Emperor Palpatine. When Vader died at the Battle of Endor, the position officially seems to have disappeared as a successor or second-in-command was never made apparent. Indeed, the separation of the military from the state's civil government is made most apparent by the fact that those who immediately thereafter claimed the throne seemed to not claim or appoint anyone to this post."}, {"tag": "p", "text": "When Grand Admiral Thrawn began his campaign against the New Republic some five years after the Battle of Endor, it seems likely that he assumed this title as a form of respect for the crumbling military hierarchy, but mostly because he was the highest ranking military officer. Out of necessity, it seems, the title in this capacity seems to have been used hand-in-hand with the de facto powers of the Emperor, though no sources have ever stated Thrawn as having assumed this title. This seems to be the first time anyone using the title Supreme Commander ever used it as a means to legitimatize his or her rule. It should be noted that Thrawn is never confirmed as actually having assumed the title itself, but that he was the de facto commander in chief of the Imperial military. Following Thrawn's death at the Battle of Bilbringi, the post seems to have once more disappeared."}, {"tag": "p", "text": "The next confirmed usage of the title came in 10 ABY during the reign of Palpatine's clones. This time, though, it would be Vader's son, Luke Skywalker, who would assume the title—Supreme Commander of Imperial Forces. It's interesting to note that unlike Vader, though, Skywalker seems to not have also held the title of Military Executor. The fact that the next two subsequent Imperial commanders in chief (Sedriss and Xecr Nist, respectively) were titled Military Executor raises some questions as to the official relationship between the two positions. In this case, it seems that the titles were separated, though held the same powers as they had under its original bearer. Following the death of Xecr Nist, the title Military Executor seems to have disappeared from usage completely."}, {"tag": "p", "text": "By 12 ABY, the Empire was divided into independent, though rival fiefdoms controlled by Imperial breakaway warlords. When Admiral Daala reunified them under her command, she seems to have once more taken on the powers of commander in chief, though, like Thrawn, also those of head of state, probably out of necessity. The fact her successor's title was Supreme Commander of the Imperial Fleet seems to imply that this was Daala's one title, but her powers were very close to those of an Empress, though her own comments during that time make it quite clear she only desired military command, not governmental command. This fact also seems to point to the likelihood that Daala would have assumed a military title associated with her branch of service rather than one of sovereign control."}, {"tag": "p", "text": "Shortly after assuming the title, Daala relinquished command to her successor, then-Vice Admiral Gilad Pellaeon. It seems likely that without a stable civil government, Pellaeon continued to use the title with those powers of a de facto Emperor, controlling all aspects of the fledgling, though reunified, Empire. It would be this military dictatorship which would, ironically, lead to the establishment of the civilian government of the Council of Moffs in which the Supreme Commander's powers were greatly reduced from total control to that of chief executive (both head of government and head of state) and commander in chief. This level of power was not as great as the power wielded by Thrawn or Daala, but, at least officially, more than those powers wielded by either Vader or Skywalker. In this situation, the post's military powers were also much more formalized in that control of the military remained, but was stratified so that it was confederated among the remaining Imperial sectors under the command of the respective Moffs. As shown in the Yuuzhan Vong War, powers also included the ability to federate this individual sector fleets, though with the approval and oversight of the Council. The fact that Pellaeon later mutinied against the Council and threatened to defect with the military to assist the New Republic in the war seems to imply that military loyalty still remained heavily invested in the Supreme Commander rather than the civilian government."}, {"tag": "h2", "text": "List of known Supreme Commanders"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title and its position and powers within the Imperial government have been an area of controversy and confusion. For the purposes of this article, the various titles are treated as one, but their powers over time have changed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}