{"url": "Support_Services/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic"], "nodes": [{"tag": "h1", "text": "Support Services"}, {"tag": "p", "text": "Support Services was a department of the Alliance to Restore the Republic, established to give support to the rest of the Alliance. While not the most glamorous branch of the Rebel Alliance, it was crucial to their success in the Galactic Civil War. As a branch of the Alliance Military, Support Services was headed by one of the Supreme Allied Commanders, the Chief of Support Services. It worked closely with Ordnance and Supply; while Ordnance and Supply was responsible for procuring weapons, supplies, and equipment, Support Services was responsible for the physical transport of the items. The Ministry of Supply within the Alliance Civil Government also worked closely with Support Services."}, {"tag": "p", "text": "The individual Sector Forces which made up the bulk of the Alliance's military forces also needed a support network. The Atrivis Sector Forces, for example, had an \"Ordnance and Support\" division which combined the functions of Ordnance and Supply and Support Services."}, {"tag": "h2", "text": "Supply fleet"}, {"tag": "p", "text": "Support Services was responsible for the Rebel supply fleet, a collection of transports ranging from light freighters to bulk freighters. Most of these ships were slow, poorly armed, and outdated, making them vulnerable to Imperial attack. Larger ships were relatively rare. Though the Alliance was actually well supplied from friendly agriworlds and Rebel safe worlds, their overstretched fleet made it difficult to keep the fleet and the troops in the field properly supplied. After the Evacuation of Yavin, this situation was aggravated."}, {"tag": "p", "text": "Modified light freighters, such as YT-1300 light freighters with additional external cargo pods, were the most common ships in Support Services. These vessels were usually purchased secondhand, stolen, or salvaged from junkyards, and required skilled (or lucky) mechanics to remain spaceworthy. Their small size made them useful when supplying ships or bases behind Imperial lines. With forged documentation making them appear to be legitimate tramp freighters, these Rebel freighters could sometimes land openly at Imperial spaceports."}, {"tag": "p", "text": "Medium transports were used by Support Services for fleet replenishment missions which could not be handled by light freighters. Though they were still too small for efficient transport of bulk items such as fuel and food, and were slow and vulnerable in battle, they were versatile enough. The Rebellion's main source of medium transports was Gallofree Yards, Inc., which sold its entire stock at a steep discount after its bankruptcy. Many of these ships were purchased by the Rebellion through intermediaries."}, {"tag": "p", "text": "Support Services had very few Action VI transports or comparable bulk freighters. Most of these were captured from the Empire, though this was a difficult operation which usually required that the ship's captain and crew elected to surrender to Rebel forces rather than fight."}, {"tag": "p", "text": "The officers and crew in the support fleet were a varied group. Some were lifelong professional spacers and merchants, some of whom were upholding a generations-long family tradition flying the spacelanes. Others were former starfighter pilots either too old or too badly injured for combat missions. Some were recent recruits trained at facilities on Mon Calamari."}, {"tag": "h2", "text": "Safe worlds"}, {"tag": "p", "text": "Support Services personnel helped to establish safe worlds such as New Alderaan, Flitter, and Stronghold for the Alliance. Scouts searched the Outer Rim Territories, and even beyond, searching for habitable planets and moons which the Rebellion could use as safe havens. Rebel scientists would investigate these newly discovered worlds, confirming that no hidden dangers would prevent successful colonization. Some of these safe worlds, such as Sanctuary, were previously inhabited remote settlements which elected to support the Rebellion."}, {"tag": "p", "text": "Support Services was also responsible for taking care of the infrastructure on safe worlds. In time, some of these safe worlds were stable enough to begin exporting raw material for the Alliance to use in its war effort."}, {"tag": "h2", "text": "Medical services"}, {"tag": "p", "text": "The doctors, medical droids, and other medical personnel in the Alliance Military were also part of Support Services. The medical services of the Alliance ranged from front-line medics attached to ground units, Rebel bases, or capital ships, to hidden hospitals and roving hospital ships. The best-known of these medical frigates was the modified EF76 Nebulon-B escort frigate Redemption, but other ships, such as medium transports, were also modified for these purposes."}, {"tag": "h2", "text": "Notable personnel"}, {"tag": "p", "text": "Support Services supplied non-combat personnel throughout the Alliance, including cooks, doctors and other medical professionals, and mechanics."}, {"tag": "p", "text": "In addition to the personnel serving in Rebel bases, on board ships in the Alliance Fleet, or on the vessels of the supply fleet, many independent operatives were considered part of the Support Services network. Smugglers such as Tru'eb Cholakk and Sapphire helped bring supplies to the Rebellion, while the shipjacker Pike Angeles stole Imperial vessels for the Alliance. Some of these agents worked undercover to carry information and important personnel rather than supplies, such as the stage magician Leger Demain and the starship racer Siro Simito. Others, including Resik and Ytavarg Aleema, operated safe houses for the Rebellion. The responsibilities of these solo operatives often overlapped with those of General Airen Cracken's Alliance Intelligence."}, {"tag": "p", "text": "Some prominent Support Services personnel were best known for their work with other branches of the Alliance. Lieutenant Deeve, a scout who worked with Support Services to establish safe worlds such as Apliria and New Alderaan, was a member of the Task Force on Alliance Security. The Rebel pilot Grizz Frix spent most of his career in the Alliance flying transports for Support Services, but was recruited to fly an X-wing with Red Squadron just before the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}