{"url": "Supreme_Chancellor/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Galactic Republic titles", "Category:Political titles", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Supreme Chancellor"}, {"tag": "p", "text": "Supreme Chancellor was the title of the Head of State and Government as well as Senate President and Senate Chair of the Galactic Republic. The title President of the Republic was sometimes used in place of Supreme Chancellor. The Office of the Supreme Chancellor was the central name for the advisors who were important for the Chancellor, such as the Vice Chair and the financial advisors, although the \"office\" existed it was not very powerful."}, {"tag": "h2", "text": "Appointment of the Chancellor"}, {"tag": "p", "text": "The Chancellor was elected by and from the senators and representatives of the Galactic Senate for four year terms. The Chancellor could be removed from office at any time by the Senate with a Vote of No Confidence. All of the Chancellors elected between 1400 BBY and 1000 BBY were Jedi, a trend finally broken with the 1000 BBY election of Tarsus Valorum."}, {"tag": "h3", "text": "Elections for Chancellor"}, {"tag": "h2", "text": "Powers and functions of the Chancellorship"}, {"tag": "p", "text": "The Chancellorship was largely a powerless position in the last years of the Republic, especially after the Ruusan Reformations, and the Chancellor served mainly as an officiator of parliamentary procedure and the first among equals in the Senate. However, it had the authority to call an Extraordinary Session of the Senate, could invoke \"Chancellor's prerogative\" in circumventing minor aspects of the Senate's parliamentary procedure and held absolute control of the Right of Speech within the Senate, in extreme cases having the right to banish a Senator from the chamber of speech until further notice (or the next session of Senate). The Chancellor also served as the head of the Senatorial Council."}, {"tag": "p", "text": "It was still a very prestigious position, however, and the Chancellor had a grand office in both the Senate Rotunda's Chancellery and in the dome-like Senate Office Building in Galactic City. The Chancellor was properly addressed as \"Your Excellency\". The symbol of the office of the Chancellor, as well as the Galactic Senate as a whole, was a fanned spear. This sigil was also emblazoned prominently on the Chancellor's podium in the center of the Senate Rotunda's Main Chamber. When in the Main Chamber, the Chancellor usually wore a Veda cloth robe. They were outwardly identified by a azure blue sash around the waist in the case of humanoids, the same color as the Senate Guards, called the \"Blue Band of Chancery\", and thus, this particular color was forbidden to be worn by anyone else. Any Senator who still chose to add blue to parts of their wardrobe, such as Senator Palpatine choosing a blue collar, was thus declaring their interest in becoming chancellor themselves. The Chancellor was elected from among the Senators who made up the Galactic Senate and served a term of office that lasted for four standard years. A Chancellor could legally serve only two consecutive four-year terms before he or she had to step down due to term limits."}, {"tag": "p", "text": "Chancellor Finis Valorum was seen during the Blockade of Naboo and presided over the dispute between Naboo and the Trade Federation. He was ousted when Queen Amidala, on Senator Palpatine's urging, moved for a vote of no confidence."}, {"tag": "p", "text": "The office became much more powerful during the term of Chancellor Palpatine, who was able to convince the Senate to grant him a range of \"emergency\" powers due to the Separatist Crisis and then the Clone Wars, including an unconstitutional extension of his term of office after 24 BBY for the duration of the Separatist Crisis and authority as Commander-in-Chief of their new military during the Clone Wars. The Chancellor was given more direct power over administrative concerns, and he was allowed to overrule local planetary and sectorial governments. The Sector Governance Decree allowed him to appoint military governors to every planet in the Republic, and the Security Act amendment gave him complete control over the Jedi Order and Republic military, stripping both the Jedi and the Senate of their previous oversight."}, {"tag": "p", "text": "Eventually, Palpatine became a dictator and proclaimed himself Emperor of the galaxy, thus abolishing the office of Chancellor and transforming the Galactic Republic into the Galactic Empire. The position was not revived by the New Republic, which chose instead to call its Head of State and Government the Chief of State. Although the office of Chancellor had existed as a symbol of good for thousands of years since the dawn of the Galactic Republic, Palpatine's thirteen years in the Chancellorship, added to his reign as Galactic Emperor, forever tainted the once noble and prestigious position to the point where it was far too controversial to be revived in the New Republic."}, {"tag": "h2", "text": "Style of office"}, {"tag": "p", "text": "The Chancellor of the Republic used the style of \"Your Excellency\" (this was in contrast to the style of \"Your Imperial Majesty\" used during the later Galactic Empire), for example when conversing with Grand Army of the Republic officers such as Admiral Wilhuff Tarkin. When in the senate, the Chancellor traditionally referred to him/herself in the third person as \"The Chair\"/\"The Chair(wo)man\" to highlight his/her position as primus/a inter pares (first among equals); however, Palpatine notably never used this style of speech."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Chancellorship may not be the original name for the Republic's leader. The leader of the Republic had previously been styled President of the Republic or President of the Senate in works as early as 1976's Star Wars Episode IV: A New Hope novelization, though this may also have simply been one of the Chancellor's many titles. There is further confusion in that The Essential Chronology and The New Essential Chronology use both titles to describe the Republic's leader during the Great Sith War. It is possible that the offices of President and Chancellor existed independently of each other at first, but were at some point merged (possibly as part of the Ruusan Reformation). In addition, in Star Wars: The Visual Dictionary, Palpatine was mentioned to be the President of the Galactic Senate, although Star Wars: The Complete Visual Dictionary updated it to being the Supreme Chancellor of the Galactic Senate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}