{"url": "Suprema", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Bureaucrats of the Galactic Empire", "Category:Males", "Category:Officers of the Galactic Empire", "Category:Planetary leaders", "Category:Shimholts", "Category:Slavers"], "nodes": [{"tag": "h1", "text": "Suprema"}, {"tag": "p", "text": "The Suprema, born Ampotem Za, was a tall, reptilian alien of the Shimholt species. A leader on his homeworld of Kar'a'katok, he was captured by Major Stafuv Rahz during an Imperial raid, a dishonor that caused his radically isolationist species to ostracize him. Rejected from his own planet, he took his previous title of Suprema as his new name and submitted himself to the Empire. The Emperor saw value in the alien, and sent him to the planet Mandalore to enslave the populace. The Suprema proved successful in this endeavor, enslaving the vast majority of the planet in only a few short months, even capturing the Mandalorian Protector Tobbi Dala when he tried to infiltrate the Suprema's headquarters in the City of Bone. Many of the captured Mandalorians were forced into hard labor in the large structure, which slowly sapped their will to fight."}, {"tag": "p", "text": "Around 3 ABY, Princess Leia Organa and C-3PO came to Mandalore in search of the bounty hunter Dengar because of a rumor that he had worked with Boba Fett in capturing Han Solo. Organa met up with the leader of the resistance to the Suprema, Mandalore Fenn Shysa, but the princess was eventually captured by Imperials and brought to the Suprema. The Shimholt slaver sent the Rebel leader to be imprisoned in one of the city's detention cells, but she was rescued by Shysa, who also freed Tobbi Dala in the process. The group then rallied the Mandalorian slaves to rise up against their oppressors, triggering a battle in the city. The Suprema attempted to stop the uprising and mortally wounded Tobbi Dala during a shoot-out in his office. However, before his death, Dala gained control of the blast doors to the city. After opening them to allow his comrades to escape, he closed the gates on the pursuing Imperial ships. The resulting explosion filled the entire city with flames, killing both Dala and the Suprema in the process."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The Suprema was born on the planet Kar'a'katok during the twilight of the Old Republic, with the name Ampotem Za. The Suprema's people, the Shimholt, were a long-lived species with a history dating back to before the Great Sith War. Due to a conflict with the Nelori Marauders, the species became fiercely isolationist, making it a capital crime for any Shimholt to leave the world. By Ampotem Za's time, the planet had been nearly forgotten. At some point, Za was given the title of Suprema, a position of power on the world."}, {"tag": "p", "text": "During the height of the Galactic Empire, Kar'a'katok was invaded by an Imperial party led by Major Stafuv Rahz, breaking their millennia-long isolation. Following the attack, Za was captured after being injured by the Imperials. By being removed from his homeworld, the Shimholt leader was subjected to a grave dishonor, causing him to struggle against his Imperial captors. During the struggle, Za escaped from the Imperials and made his way back to Kar'a'katok. However, upon his arrival, he was scorned by his own people for breaking their traditional isolationist stance. Za was exiled from his planet, abandoned and ostracized from his fellow Shimholt."}, {"tag": "p", "text": "With no one to turn to, Za decided to go back to the Imperials who had captured him. After surrendering himself to Major Rahz, Za was taken by the Gektl commander before the Emperor himself. Palpatine saw the Shimholt as someone who could be easily susceptible to his will and decided to train him for use in Imperial operations. Za was indoctrinated with Trandoshan slaving techniques for over a year, preparing him for a career as a slaver. Following his training, Za was made an Imperial advisor, an individual with a semblance of authority in Imperial circles. To mark his transition into a servant for the Empire, Za changed his name to \"Suprema\", the title that he had held on his homeworld."}, {"tag": "h3", "text": "Mandalore operation"}, {"tag": "p", "text": "Among the Imperials, the Suprema became a mysterious figure. Rumors claimed that the Imperial adviser was in fact a biological experiment, the result of splicing the genes of a gundark, a wild durkii, and several other species. Another rumor claimed that the Suprema was from a race of saurians in the Unknown Regions. The Suprema fostered such rumors, as he believed that the mystery helped instill fear in those that might oppose him."}, {"tag": "p", "text": "At some point, the Suprema was installed as the overlord of the planet Mandalore, using his skills to take control of a slaving operation on the planet. Alongside the Suprema, a group of advisers took control of the premier company on the world, MandalMotors. Such control helped the Imperials gain great power on the planet, and many of the locals looked to them in hopes that they would rebuild the planet's shattered economy that had come on as a result of the Clone Wars. Upon taking control of the slaving operation, the Suprema set up shop in the 400-meter long City of Bone. The Suprema's task on Mandalore was to round up the populace for conscription and assign the slaves to hard labor in Imperial factories, farms, and mines, to help fund the costs of Imperial weaponry."}, {"tag": "p", "text": "The Suprema proved incredibly successful in this endeavor. After only a few months, the Suprema had succeeded in capturing nearly the entire populace, who were restricted by energy link restraints. Many of these slaves were put to work in the City of Bone, constrained to hard labor, which served to crush their spirits."}, {"tag": "h3", "text": "Resistance"}, {"tag": "p", "text": "However, the Suprema was not without opposition to his operation. The Mandalorian Protectors Fenn Shysa and Tobbi Dala began a grassroots campaign to expel the Imperial slavers from their world with undercover help from members of the Mandalorian government. The resistance quickly became a annoyance to the Imperial slavers as they began to raid slaving convoys, releasing their fellow Mandalorians from bondage. Hoping to make a bigger dent in the Imperial slaving operation, Tobbi Dala personally infiltrated the City of Bone to capture the Suprema. The effort proved unsuccessful, however, and Dala was captured and placed in a detention cell within the city. Dala's Mandalorian armor was taken away from him, and the Suprema displayed the armor in his trophy case as a symbol of his triumph over the Mandalorian."}, {"tag": "p", "text": "The resistance began to run solely under the guidance of Shysa, who continued to organize raids against the Imperials. In an effort to stop the Mandalorian, the Suprema hired the bounty hunter Dengar to capture Shysa. However, the hunter was himself captured by Shysa, who used the man to leverage his position with the Empire. Shysa struck a deal with the Imperials to exchange Dengar for Dala. However, before the deal could take place, Princess Leia Organa arrived on Mandalore in search for Dengar, who had been rumored to have worked with Boba Fett during the search for the Millennium Falcon following the Battle of Hoth, and so might have known where Fett had taken the carbonite slab holding Han Solo. Hoping to interrogate Dengar herself back at the Alliance base on Arbra, Organa disrupted the exchange by freeing Dengar from the Mandalorians and leading him back to her ship. However, Dengar double-crossed the Princess, transmitting a signal to the Imperials who descended on her location, capturing her and her droid, C-3PO."}, {"tag": "h3", "text": "Capture of Princess Leia"}, {"tag": "p", "text": "Following Organa's capture, the Rebel leader was brought back to the City of Bone to be interviewed by the Suprema. Three stormtroopers escorted Organa into the Suprema's office, where she immediately noticed a life-sized hologram of Darth Vader that the Imperial overlord had installed to show his appreciation for the Dark Lord of the Sith. After revealing himself to the Princess, the Suprema became subject to a series of insults by the Rebel leader as she attempted to get a rise out of him. However, the Shimholt was only amused by her antics and refused to respond. During the interrogation, they were interrupted by Dengar who was going back into the field to attempt to capture Shysa once again, and the Suprema returned to his prisoner."}, {"tag": "p", "text": "After assuring the Princess that he would soon defeat the Mandalorian resistance and showing Tobbi Dala's removed armor as proof, the Suprema ordered her and C-3PO to be taken to the detention cells. However, unknown to the Suprema, one of the stormtroopers was actually Fenn Shysa in disguise. After leading Organa away, Shysa defeated the other stormtrooper escort and released the Princess. Following this, the Rebels also managed to release Tobbi Dala, and the group began to make their way out of the city."}, {"tag": "h3", "text": "Uprising"}, {"tag": "p", "text": "However, as the Rebels made their way out of the City of Bone, they decided to attempt to free the remaining Mandalorian prisoners. Inside the hangar bay of the city, Shysa fired a flare out of one of the windows of the city, triggering an assault by Mandalorian forces waiting outside. As the Mandalorians began to attack the perimeter of the city and the Imperial forces stationed there, the Suprema was immediately alerted. However, he was suspicious of the timing of the attack, correctly predicting that there was an ulterior motive behind the assault. To prevent any of the prisoners from escaping during the attack, the Suprema ordered that the blast doors to the city be sealed, throwing a hitch into the Rebels' plans for escape."}, {"tag": "p", "text": "Trapped within the confines of the city, the Rebels took control of an Imperial airspeeder, taking the fight to the Imperials stationed inside. Hoping to destroy the power to the energy links being used to imprison the Mandalorian slaves, Dala and Organa destroyed the power box to the Imperial shackles. Suddenly freed from their bonds, the Mandalorian slaves began to rise up against their oppressors, throwing the city into disarray. The Rebels used the distraction to make their way to the Suprema's office, but found the office door locked. Organa was able to force her way into the room by blasting down the door but was immediately confronted by the Suprema who was prepared for their attack with a hold-out blaster in his clutches."}, {"tag": "p", "text": "As Tobbi Dala surged forward to eliminate the slavelord, the Suprema hit the Mandalorian Protector with a blaster shot to the chest. However, as Dala began to collapse from his wound, he was able to reach out and grab the Suprema's blaster, preventing him from firing on the rest of the attack force. While the Suprema continued to struggle with Dala, Shysa took the opportunity to vault himself over the Suprema's desk and kick him full on in the chest, knocking the blaster out of his hand. As the Suprema fell to the ground, Shysa began to beat the Shimholt mercilessly with the butt of his blaster, trying to avenge his fallen friend. However, Organa was able to keep Shysa from killing the alien, claiming that they might eventually have use for him. Shysa reluctantly relented and went to tend Dala's wounds. The wound that Dala had sustained was near-fatal, and he directed his friend to leave him, claiming that he would open the blast doors to the city."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "As the Suprema hauled himself to his feet, he witnessed Dala removing his armor from the trophy case. While massaging the bruises that he had sustained at Shysa's hands, the Suprema taunted the Mandalorian, claiming that putting on his armor would not prevent his eventual death. As Dala ignored the insults, he kept his word to Shysa, opening the blast doors to the city. Shysa, Organa, C-3PO, and a captured Dengar flew out of the city in their captured airspeeder, making their way towards Shysa's Mandalorian forces."}, {"tag": "p", "text": "Close behind the Rebels was Shrike Squadron, an Imperial force of airspeeders, who were attempting to shoot down the fleeing craft. As soon as the Rebels had exited the city, however, Dala closed the blast doors behind them. The Suprema was shocked at this action, realizing that his men would crash headlong into the city walls, most likely igniting the fuel and ammunition near the blast doors. Unfortunately for the Suprema, Dala was perfectly aware of the consequences and ready to face death. True to the Suprema's predictions, Shrike Squadron crashed headlong into the blast door, creating a massive explosion that consumed the entire city in flames, killing all the Imperials, Dala, and the Suprema himself."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the death of the Suprema, the Mandalorians returned to their forest base, where they celebrated their victory. Many of the slaves that had been rescued during the attack decided to join the Mandalorians, increasing their ranks. The battle at the City of Bone proved to be the decisive conflict in expelling the Imperials from the world, liberating Mandalore from the Empire's grip. Following the battle, Shysa took up the title of Mandalore and began to rebuild the Mandalorian Protectors. With the Suprema dead, the Mandalorians began a campaign against Grand Admiral Miltin Takel, who controlled the Mandalore sector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Suprema was a cruel and arrogant individual who delighted in his profession as a slaver. The Shimholt admired other individuals who represented brutality, such as the Dark Lord of the Sith Darth Vader. The Suprema kept a life-sized hologram of Vader in his office in the City of Bone, a statement that went above and beyond the normal trappings of Imperial underlings. The Suprema was quite cultured and refined, using polite wording even when dealing with his own prisoners. During Leia Organa's capture, the Suprema responded to the Princess' taunts and insults with an air of superiority, keeping his anger in check. However, the Suprema proved somewhat excitable, even drooling at one point during his interrogation of Organa. The Suprema enjoyed instilling fear in others, cultivating bizarre rumors about himself to aid in the mystery surrounding him."}, {"tag": "p", "text": "The Suprema had a formidable appearance, however, he was not much of a brawler, instead relying on a hold-out blaster pistol for defense. During the attack on his office in the Mandalorian uprising, the Suprema relied solely on his weapon, becoming distraught when the blaster was wrested from his grip. He was unable to fend off the attacks of Fenn Shysa, who beat the Shimholt officer mercilessly with the butt of his weapon, proving that hand-to-hand combat may not have been his forte."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Suprema was created by David Michelinie, Gene Day and Tom Palmer for use in Star Wars 69. He died in that same issue, which marked his last appearance in the Marvel Star Wars comic book series. The Suprema went unreferenced until the 2005 article, The History of the Mandalorians, by Abel G. Peña. The article reiterated some of the Suprema's actions that occurred in the Marvel comics, but also stated that the character was an Imperial adviser. The Suprema was mentioned once again in 2007's Aliens in the Empire, which was written by Abel G. Peña and Rich Handley. Among other things, the article gave information on the Suprema's backstory, including his origins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}