{"url": "Battle_of_Boz_Pity_(Clone_Wars)", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Battles in the Halla sector", "Category:Battles of the Felucia theater"], "nodes": [{"tag": "h1", "text": "Battle of Boz Pity  (Clone Wars)"}, {"tag": "p", "text": "The Battle of Boz Pity was a major battle in the final year of the Clone Wars. Major Separatist activity on Boz Pity was discovered by Obi-Wan Kenobi during his search for Asajj Ventress. The Jedi Order supported a mission to investigate, which led to a full scale battle with some of the greatest heroes from both sides of the war."}, {"tag": "h2", "text": "Running the blockade"}, {"tag": "p", "text": "The Separatists had blockaded the graveyard planet Boz Pity with over one hundred warships. The Jedi plan was for the Star Destroyer Intervention to come out of hyperspace between the blockade and the planet. Anakin Skywalker, perhaps the most gifted pilot in the Order, attempted to accomplish this, but brought the ship out of hyperspace too close to the planet's gravitational pull. The Intervention crashed on the surface of Boz Pity after launching all fighters and escape pods, damaged beyond repair. In the space battle above, Commander Denn Wessex commanded the Venator-class Star Destroyer Redoubt."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Clone trooper forces landing from the escape pods jettisoned from the Intervention were quickly engaged and sustained many casualties to the point of falling back when the Jedi Generals arrived with reinforcements and then proceeded to quickly cut through the droid ranks. The forces of the Republic now fully engaged with the Confederacy of Independent Systems on the planet's surface, led by the Jedi Generals, were quick to engage in primarily targeting the CIS medical facility. Master Soon Bayts attempted to secure the entrance, quickly disposing of the cordon of droid guards with the first wave of troops. Soon after, General Grievous appeared, and crushed Bayts' head with his hand, then proceeding to massacre their clone forces. Meanwhile, Obi-Wan Kenobi infiltrated the CIS medical center. He discovered Asajj Ventress in a bacta tank and Count Dooku observing her. After a short conversation with Dooku, Asajj destroyed her bacta tank and engaged Obi-Wan."}, {"tag": "p", "text": "Back on the battlefield Alpha, and the remainder of Squad Seven, continued to repel the massive waves of droid forces. Grievous soon re-appeared in the heat of the battle, quickly taking care of several clones before proceeding to impale Alpha, Mace Windu then proceeded to drop a STAP on the General, disabling him for the remainder of the battle."}, {"tag": "p", "text": "Across the landscape, Kit Fisto and Anakin attempted to aid Alpha, before Obi-Wan was sent crashing through the wall of the Separatist base by Ventress. Their battle brought them back onto the battlefield, where Anakin joined in. Obi-Wan sabotaged Anakin's attempts to kill Asajj, though, believing she could still be redeemed. Dooku also left the medical center, but was soon after attacked by Mace Windu. The two of them engaged in a brief, inconclusive duel before Dooku had his MagnaGuards grapple the Jedi, disarming him and dragging him into a pit to facilitate Dooku's escape. With Windu occupied, Dooku headed for the evacuation point, taking Grievous's mangled body along with him. In the process of fleeing, Dooku allowed Mace Windu, a long-time rival and former good friend to involuntarily beat him."}, {"tag": "p", "text": "Meanwhile, Asajj disengaged from Obi-Wan and Anakin, and headed for the Separatist shuttles away from the main battle. However, Dooku, not wishing her to delay his escape, ordered her shot, and left her behind as a distraction. Asajj attempted to kill Obi-Wan with a jagged steel fragment, but was thwarted by Anakin as the two Jedi approached her. She then expressed some measure of repentance, saying that perhaps Obi-Wan had been correct about her all along and appeared to die. Obi-Wan had her body transported to Coruscant. The blockade apparently retreated or was dispersed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Asajj Ventress had used Sith meditation to feign her death. She woke up in the\nmedical transport and ordered the pilots to take her away from the Jedi, the war, and Count Dooku. Commander Wessex's actions during the Battle of Boz Pity made him a hero and convinced Palpatine to make him a Moff shortly afterwards."}, {"tag": "p", "text": "Following the battle, Boz Pity was made into a staging area for Grand Army units under Jedi General Quinlan Vos fighting in the Outer Rim Sieges. In addition, Vos was deployed to the area shortly after the events of the Battle of Coruscant and the events of the Siege of Saleucami."}, {"tag": "p", "text": "The 22nd Air Combat Wing, and its unit of clone commandos Ion Team, were stationed on Boz Pity before being dispatched to the Battle of Murkhana."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}