{"url": "Suraz_engagement", "categories": ["Category:Canon articles", "Category:Battles of the Cold War"], "nodes": [{"tag": "h1", "text": "Suraz engagement"}, {"tag": "p", "text": "The Suraz engagement occurred sometime after the battle of Endor when Rapier Squadron of the New Republic responded to a distress signal from the Yissira Zyde, a freighter that was being hijacked by the First Order, and engaged their forces above Suraz 4 in the Mirrin sector of New Republic space. Rapier Squadron, a four-member T-85 X-wing squadron led by Commander Poe Dameron, quickly destroyed a shuttle and all eight of the enemy's TIE fighters, but the remaining shuttle and the commandeered Yissira Zyde managed to jump to lightspeed. When the freighter entered hyperspace, its wake destroyed the X-wing belonging to Rapier Four, Muran, before he was able to eject."}, {"tag": "p", "text": "Despite the First Order crossing the Trans-Hydian Borderlands and violating the Galactic Concordance, New Republic Major Lonno Deso believed the First Order wasn't a threat and that no follow-up actions were necessary. Nonetheless, Commander Dameron underwent an unsanctioned mission to locate the stolen freighter."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Battle of Jakku, the New Republic and the defeated remnants of the Galactic Empire signed the Galactic Concordance which formally ended the Galactic Civil War. The Galactic Concordance imposed war reparations and restricted the Imperials remnants' ability to wage war and acquire advanced weaponry. Over the following years, the Old Empire gradually withered away and eventually broke away from the Republic to form the First Order in the Unknown Regions. By then, the Republic and the First Order territories were separated by a narrow band of space known as the Trans-Hydian Borderlands."}, {"tag": "p", "text": "While an uneasy peace existed between the New Republic and the First Order, the latter never abandoned its goal to restore Imperial rule throughout the galaxy. In defiance of the Galactic Concordance, the First Order mobilized stormtrooper forces and developed advanced military hardware within the Unknown Regions. The First Order frequently violated Republic sovereignty by launching raids into Republic space. Despite these fragrant acts of aggression, the Galactic Senate refused to be drawn into a war with the First Order and limited its response to formal diplomatic protests. The New Republic Defense Fleet was also ordered to avoid confrontation with First Order forces and to limit its activities to patrolling Republic territory."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Sometime after the Battle of Endor, the NK-Witell-class freighter Yissira Zyde was traveling past the planet Suraz 4 when it was intercepted by two First Order attack shuttles and TIE/fo space superiority fighters. The freighter was carrying a cargo of 46 high-capacity charging arrays, which could be used for energy discharge augmentation and easily adapted for military use. The Yissira Zyde was outmaneuvered by the First Order starships but managed to send a distress signal that was picked up by Rapier Squadron, a four—member New Republic T-85 X-wing squadron commanded by Commander Poe Dameron."}, {"tag": "p", "text": "Rapier Squadron was patrolling the Mirrin sector and were able to exit hyperspace above Suraz 5 within a few minutes. The X-wings then headed towards Suraz 4 to aid the freighter. Upon arriving at the scene, they found that the Yissira was being boarded by stormtroopers equipped with repulsor–powered jetpacks. Shortly later, Rapier Squadron was attacked by eight TIE fighters. During the ensuing dogfight, Poe and Lieutenant Karé Kun managed to shoot down six of the TIEs. The other pilots Lieutenants Iolo Arana and Muran attacked the two shuttles and managed to destroy one of them along with two of the remaining TIE fighters. However, they were unable to stop the remaining First Order shuttle and the hijacked Yissira Zyde from escaping into hyperspace. Muran's X-wing was caught in the wake of the freighter's jump into hyperspace and was ripped to shreds. Muran was killed before he could eject from his starfighter."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Suraz engagement, Commander Poe and the surviving Rapier pilots returned to the Mirrin Prime Republic base. There, Poe reported his account of the skirmish to Major Lonno Deso. While sympathetic to Poe's grief, he disagreed with Poe's assessment that the First Order was a threat to the New Republic. Poe rejected Deso's view that the Suraz engagement was an isolated incident and that the First Order was a fanatical but poorly-equipped Imperial remnant that inflated its strength. Poe added that the First Order forces were using advanced weapons and starships in violation of the Galactic Concordance."}, {"tag": "p", "text": "Poe then asked Major Deso for permission to investigate the Yissira Zyde's cargo and to track down the ship. Major Deso denied Poe's request and reminded the starfighter squadron commander that his duties were strictly limited to patrolling the Mirrin sector. Frustrated with Republic Command's unwillingness to respond forcefully to the threat of the First Order, Poe embarked on an unsanctioned solo mission to track down the trajectory of the freighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Suraz engagement first appeared in Before the Awakening, a junior novel written by Greg Rucka and published in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}