{"url": "Suri", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Children of the Emperor", "Category:Females", "Category:Force ghosts", "Category:Humans", "Category:Sith acolytes and apprentices of the Sith Empire", "Category:Sith rejects"], "nodes": [{"tag": "h1", "text": "Suri"}, {"tag": "p", "text": "Suri was a Human female Sith Inquisitor who served the reconstituted Sith Empire during the Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Child of the Emperor"}, {"tag": "p", "text": "Early in her life, the Empire learned that Suri had a strong connection to the Force and was sent to the Sith Academy on the ancient Sith world of Korriban. During her training, she became friends with Kira Carsen, and like her, she would become a child to the Sith Emperor Vitiate, the ruling founder of the True Sith Empire."}, {"tag": "h3", "text": "Reunion with Kira"}, {"tag": "p", "text": "After the Emperor's defeat, Suri summoned her friend on Voss, asking Kira to free her from the voice of the Emperor that she continued to hear in her head. Kira and her Master spoke with her and tried to convince her to follow them on Tython, but in that moment, a couple of Children of the Emperor appeared. One of them, Tannac, explained that only he and his brethren were able to help Suri. After some thinking Kira and the Hero let her go with Tannac. Later, Kira and the Hero wondered how was it possible that Suri heard the Voice of the Emperor, if they already killed him."}, {"tag": "h3", "text": "Confrontation with the Sith Emperor"}, {"tag": "p", "text": "At some point, Suri had somehow perished. During the final confrontation with Tenebrae, Suri was among the spirits that were summoned to help the Outlander to defeat the former Sith Emperor, thus witnessing his final defeat. With Tenebrae gone, Suri found peace and became one with the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hero has the option to fight with Tannac. Suri joins the fight and the Hero is forced to defeat her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}