{"url": "Surgeon", "categories": ["Category:Canon articles", "Category:Droids of unspecified degree"], "nodes": [{"tag": "h1", "text": "Surgeon"}, {"tag": "p", "text": "The Surgeon was a droid that resided in the former Galactic Empire outpost of DN-949A on the planet Netalych. The droid occupied a workshop within a secure bunker, where it kept itself mostly hidden behind a curtain of wires. It possessed at least one head and a number of limbs and tools, which it would extend through the curtain. The Surgeon claimed to only have a passing interest in droid solidarity, believing that droids could not truly see organics as friends."}, {"tag": "p", "text": "In order to learn how the Messenger droids of the late Emperor Palpatine selected participants for the Empire's Operation: Cinder campaign, former Imperial pilot Yrica Quell led a strike team to Netalych so that she could visit the Surgeon and have the droid analyze a Messenger's remains. The Surgeon, impressed by the Messenger's workings, ultimately provided Quell with the information she was seeking. Quell insisted that the Surgeon was to keep what it had learned a secret, and the droid claimed to have deleted it from its memory."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Operation on Netalych"}, {"tag": "p", "text": "By the year 5 ABY, the droid known as the Surgeon resided on the planet Netalych, within the outpost of DN-949A—a former fueling post and chemical processing facility of the Galactic Empire that was overthrown by its droid population following the Imperial loss and the death of Emperor Palpatine at the Battle of Endor. From a secure bunker within DN-949A, the Surgeon performed various operations for the outpost's residents, including droid repairs and fitting human servants with restraining bolts, as well as neural implants and total conversion for travelers. The Surgeon was a contact of \"the Harch,\" who ran a crew on the space station Whitedrift Exchange."}, {"tag": "h3", "text": "Data recovery"}, {"tag": "p", "text": "In that year, Colonel Soran Keize of the 204th Imperial Fighter Wing dispatched Yrica Quell—former pilot of the 204th and previous defector to the New Republic—and a strike team consisting of personnel from the fighter wing to DN-949A, having heard of the Surgeon through his time briefly working under the Harch. Though her strike team was unaware of the objective, Quell was to meet with the Surgeon and have the droid analyze the remains of one of the late Emperor's Messenger droids in order to determine how the droids chose the participants for the devastating Operation: Cinder campaign. Upon the arrival of Quell and two associates, Nord Kandende and Agias Rikton, the Surgeon questioned their purpose, guessing that they were travelers who required an operation. Quell told the Surgeon that the job was data reclamation and offered credits, but the droid deduced their need before she finished speaking. The Surgeon opened the door to its inner workshop, but insisted that only Quell needed to enter."}, {"tag": "p", "text": "Once Quell was inside and the door had closed behind her, the Surgeon emerged its head from behind its curtain. After determining her Imperial allegiance, the droid was surprised that Quell trusted it given most of her kind's opinion of droids. The Surgeon asked whether Quell wished for a repair, and she firmly refused, informing the Surgeon that she only wished for the recovery of data and that the Messenger's remains should be destroyed at any indication that it would activate. The droid extended its arms to collect the components of the Messenger, arranging them on the floor to study them. As it worked, the Surgeon told Quell that none of her droid companions could have truly been her friends due to their nature. Ten minutes later, the Surgeon concluded that it could do as Quell had asked; though Quell questioned about payment before leaving, the Surgeon had already arranged to take Kandende as a servant for one year."}, {"tag": "h3", "text": "Secrets of the Messenger"}, {"tag": "p", "text": "The Surgeon managed to break through the Messenger's encryption, extracting the data that Quell required and determining the process that the droids used to select Imperials to participate in Cinder—the Messengers assessed a number of qualities in order to identify individuals that could be corrupt enough to execute the operation, drawing from a massive databank in the Verity District of the capital world Coruscant. When Quell returned the following day, the Surgeon expressed its awe about the Messenger and its processes, suggesting that it was closer to a computer that could render emotions. Quell told the Surgeon that it could not keep or activate the Messenger, to the droid's irritation, before crushing the array of components beneath her feet."}, {"tag": "p", "text": "When Quell questioned how the droid chose its targets, the Surgeon threw a datachip containing the information at her, promising the Messenger's instructions, algorithms, and databases with a laugh. Quell asked the Surgeon whether it could keep its findings secret, and the Surgeon responded by questioning whether she would attempt to shoot it if it answered negatively. Upon Quell's insistence to answer, the droid informed her that it did not care for the secrets that the Messenger had held, believing that it was solely organic business. The Surgeon promised to keep the secret, claiming to delete the details from its memory. Though Quell briefly considered destroying the Surgeon, she decided such an attempt would be futile. As Quell left, the Surgeon told her to greet Kandende on her way out."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid known as the Surgeon kept itself concealed within its inner workshop behind a curtain of wires. It possessed at least one head that had chrome plating and two mismatched photoreceptors that rotated asynchronously; upon meeting the Surgeon for the second time, Quell was certain that the head that emerged from the curtain was different, possessing duller chrome and with one askew eye. The Surgeon also had numerous appendages, including three triple-jointed arms and an appendage that ended in a telescoping lens, as well as other arms equipped with tools that included laser scalpels and scanners."}, {"tag": "p", "text": "The Surgeon only had a passing interest in droid solidarity, and took no issue in the idea of destroying fellow droids. It believed that droids were not able to be friends with organics, perceiving even droids that had been designed to mimic organic thought patterns as far removed from them, and instead held the belief that droids saw organics as interests rather than companions. The Surgeon was indeed surprised that Quell trusted it with investigating the Messenger, believing most of her kind would not have. It also was not concerned by what it found in the droid's programming, having no interest in the business of organics. Upon meeting Quell, the droid quickly deduced both the purpose of her visit and that she was an Imperial. The Surgeon was impressed by the inner workings of the Messenger; it posed that it was more of a computer than a droid, comparing it to a device whose core directive was to express an emotion, constructed by a culture that did not develop higher mathematics but could render feeling and motivation. Nevertheless, the Surgeon was unable to express such an emotion, guessing it to be loathing or spite."}, {"tag": "p", "text": "The Surgeon talked extensively and jumped from one idea to another rapidly in a manner that was disorienting to Quell. When first addressing Quell and her associates, the Surgeon spoke with electronic disdain. The droid would also emulate laughter, both by a rustling of its wire curtain or by emitting a garbled soumd. When told that it could not keep the remains of the Messenger, the Surgeon expressed irritation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Surgeon appeared in the 2021 novel Victory's Price, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}