{"url": "Survivor%27s_Quest", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Survivor's Quest"}, {"tag": "p", "text": "Survivor's Quest is a novel written by Timothy Zahn, published in 2004 by Del Rey. The paperback version of this book includes the short story Fool's Bargain also by Timothy Zahn, that was previously available only in eBook format. Narration for the audio version of Survivor's Quest was performed by Jonathan Davis, though it was abridged."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "p", "text": "A dangerous mission to salvage a piece of Jedi past threatens to make Luke and Mara Jade Skywalker history…."}, {"tag": "p", "text": "Sometimes it seems a Jedi's work is never done, and Luke and Mara Jade Skywalker know this only too well. Despite the bond they share in the Force, after three years of marriage the Jedi Master and his wife are still learning the ropes of being a couple—and struggling to find time together between the constant demands of duty. But all that will change when they're united on an unexpected mission—and must pool their exceptional skills to combat an insidious enemy…and salvage a part of Jedi history."}, {"tag": "p", "text": "It begins with a message from a surprising source: Nirauan, the planet where Thrawn, dangerous disciple of Emperor Palpatine, once held sway…and from which Luke and Mara barely escaped with their lives. The message itself is shocking. After fifty years, the remains of Outbound Flight—a pioneering Jedi expedition viciously destroyed by Thrawn—have been found on Nirauan. Now, the fiercely honor-bound aliens who reside there wish to turn over the remnants of the doomed mission to the New Republic. Accepting the gesture will mean a long voyage into the treacherous cluster of stars where the thousands of souls aboard the Outbound Flight vessel met their grim fate. But it may also mean something more…something that has stirred an inexplicable sense of foreboding in Mara."}, {"tag": "p", "text": "Whatever may await, the Skywalkers will not face it alone. Joining them on the strange and solemn journey are an officer of the post-Palpatine Empire, escorted by a detachment of Imperial stormtroopers; a party of diplomats from a gentle alien species that reveres the fallen Jedi for saving them from bloodthirsty conquerors; and a New Republic ambassador who harbors his own mysterious agenda."}, {"tag": "p", "text": "Soon enough, suspicion, secrecy, and an unknown saboteur run rampant aboard the isolated ship. But it is within the derelict walls of Outbound Flight itself, buried for half a century on a desolate planetoid, where the gravest danger lies. As the marooned hulk yields up stunning revelations and unexpected terrors to its visitors, Luke and Mara find all they stand for—and their very existence—brutally challenged. And the ultimate test will be surviving the deathtrap carefully laid by foes who are legendary for their ruthlessness…and determined to complete the job Thrawn began: exterminating the Jedi."}, {"tag": "h3", "text": "Paperback"}, {"tag": "p", "text": "After fifty years, the remains of Outbound Flight—a pioneering Jedi expedition viciously destroyed by the alien warlord Grand Admiral Thrawn—have been found on the planet Nirauan. The beings who reside there wish to turn over to the New Republic the remnants of the doomed mission. Accepting the gesture will mean a long voyage into the treacherous cluster of stars where the thousands of souls aboard the Outbound Flight vessel met their grim fate."}, {"tag": "p", "text": "Embarking on the strange and solemn journey, Luke and Mara Jade Skywalker are unaware that the gravest danger lies within the derelict walls of Outbound Flight itself. As the marooned hulk yields up stunning revelations and unexpected terrors, Luke and Mara find all they stand for—and their very existence—brutally challenged. The ultimate test will be surviving the deathtrap carefully laid by foes who are legendary for their ruthlessness…and determined to complete the job Thrawn began: exterminating the Jedi."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel opens with a meeting between Talon Karrde and Luke and Mara Jade Skywalker. Karrde's people had earlier picked up an urgent transmission, addressed to Luke, coming from Admiral Voss Parck on the planet Nirauan. Before the message could be passed on, however, it had been stolen by a member of Karrde's own organization, one Dean Jinzler. Fearing that the message might be somehow connected with the unknown menace Parck and Baron Soontir Fel had warned them about two years previous. Luke and Mara decide to head out to Nirauan."}, {"tag": "p", "text": "There, they learn that the message had in fact come from Chiss Aristocra Chaf'orm'bintrano (or \"Formbi\"). The Chiss have found the remains of the pioneering Jedi expedition, Outbound Flight project, which had been mercilessly destroyed by Grand Admiral Thrawn many years previously. Now the Chiss wish to hand over their find to the New Republic, and Luke and Mara join the odd group, which includes a squad of stormtroopers from the 501st, a remnant of an alien people, the Geroons, who owe a strange debt to the people of Outbound Flight, and a false New Republic Ambassador, all of whom will visit the site of the tragedy."}, {"tag": "p", "text": "As they voyage on the Chaf Envoy deeper into Chiss space, through a treacherous cluster of stars known as the Redoubt, Luke and Mara grow more uneasy. Occurrences of sabotage and theft only serve to deepen their suspicions. On top of that, Mara begins to feel torn between her duty to the New Republic and her troubled respect for the Imperial Remnant."}, {"tag": "p", "text": "The expedition reaches its destination: the remains of the Dreadnaughts that made up the Outbound Flight project. Not only are the ships fairly intact, but Mara can sense life. There are survivors, possibly hundreds of them. Suddenly, everything comes together in a whirlwind of events. The supposedly peace-loving Geroons are revealed to be the bloodthirsty Vagaari, who desire revenge against the Chiss and Outbound Flight for their defeat at the hand of Grand Admiral Thrawn years before. Luke, Mara, the Chiss, the Imperials, and the embittered survivors must now work together against the Vagaari if any of them are to come out alive."}, {"tag": "p", "text": "They manage to defeat the Vagaari, who in turn sabotage the Chaf Envoy and commandeer one of the Dreadnaughts. The Vagaari then head back through the Redoubt to attack the Chiss command center, leaving Luke, Mara, and the others practically stranded. Following the welcome discovery of a Delta-Twelve Skysprite, however, Luke and Mara are soon pursuing the rogue Dreadnaught. They catch up to it and make their way aboard. They find out that the main Vagaari \"colony ship\" is actually a starfighter carrier that is beginning to overwhelm Chiss defenses. Using a fake signal, Luke and Mara trick the Vagaari into believing the Dreadnaught to be a friendly ship. However, Luke and Mara use the Dreadnaught under their control after a showdown with a droideka and the fanatical Vagaari Estosh, to aid the Chiss fighters and to defeat the other Vagaari forces."}, {"tag": "p", "text": "The survivors are entrusted into the care of the Empire of the Hand, and Luke and Mara finally have time to settle down and enjoy their marriage. But one disquieting thought occurs to Mara: the whole affair, resulting in a resounding victory for the Chiss, feels too much like something orchestrated by Thrawn, a master at manipulating his allies and enemies alike. When Luke objects that they (inadvertently) killed the clone of Thrawn beneath his base on Nirauan, Mara counters that it was possible, even likely, for Thrawn to have prepared other clones and scattered them around the Unknown Regions."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The book was intended to be a counterpart to Tatooine Ghost, featuring Mara Jade and Luke instead of Han and Leia. Zahn also intended Survivor's Quest and the semi-prequel Outbound Flight to resemble the original trilogy and the prequel trilogy in format (with the former being made first)."}, {"tag": "p", "text": "Zahn named the 501st Legion after a worldwide organization of fans, and the book was dedicated to them.[source?]"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "Foreign"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}