{"url": "Battle_of_Bright_Tree_Village_(Stranglethorn_crisis)", "categories": ["Category:Legends articles", "Category:Battles of the Stranglethorn crisis"], "nodes": [{"tag": "h1", "text": "Battle of Bright Tree Village  (Stranglethorn crisis)"}, {"tag": "p", "text": "The Battle of Bright Tree Village was the defining battle of the Stranglethorn crisis between the Ewoks of Bright Tree Village and an out of control stranglethorn."}, {"tag": "h2", "text": "Build-up"}, {"tag": "p", "text": "During an accident in the hut of the Shaman Logray, a bottle of plant growth formula was accidentally spilled on top of an infant stranglethorn by the Ewok Princess Kneesaa a Jari Kintaka. This action caused the plant to grow at a rapid rate, eventually enveloping the entire village. Several additional heads began to sprout from the stranglethorn, and the plant began to chase after the Ewoks. Soon almost all the main buildings of the village had been surrounded by the stranglethorn, and the Ewoks were trapped in a fight against the still growing vines."}, {"tag": "p", "text": "Additionally, the stranglethorn was trying to reach the forest floor below the village in order to take root there. The increased soil for the stranglethorn would allow it to grow at an unstoppable rate, and the Ewoks were thrown into a frenzy trying to stop the carnivorous plant from reaching the base of the village."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "After realizing how dire the situation had become, Chief Chirpa rounded up the warriors of the village to take the fight to the stranglethorn, but they were no match for its size and power. The stranglethorn was easily able to ensnare the Ewoks with its vine tendrils, and soon even the mighty Ewok warrior Paploo was a victim of the huge plant. Unopposed, the stranglethorn began to capture the woklings of the tribe, isolating them in the highest part of the village, likely as a storehouse for future food. With control over the village, the plant began to struggle to reach the ground but was headed off by Chief Chirpa, Logray, and the Ewok warriors who fought ferociously to keep it from reaching the ground."}, {"tag": "p", "text": "At the same time, the plant's efforts had made it hungry, and it began to devour the contents of the Ewok bakery. The Ewok warrior, Willy Warrick put up a valiant defense of the bakery and removed a majority of the remaining food from the plant's grip. However, the plants superior strength and size eventually overwhelmed the Ewok, and he was forced to retreat. As the Ewoks continued to fight, the two Ewoks, Wicket W. Warrick and Kneesaa a Jari Kintaka, who had been on a quest to find the ingredients to an antidote to plant growth formula, returned. Although the Ewoks had failed to obtain all the ingredients to the antidote, they had come up with a plan to grab the antidote that resided in Logray's hut."}, {"tag": "p", "text": "Using the Tromes, a group of small humanoids that they had found on their quest, Wicket was able to distract the plant and sneak inside. Wicket grabbed the antidote and returned to the ground where the stranglethorn had come within mere feet of the forest floor. Although Chirpa continued the fight, Logray had become hopelessly ensnared by a stranglethorn, and it seemed only a matter of time before the stranglethorn would overpower them. To distribute the antidote, Wicket and the Tromes gathered a crop of acorns and spread the antidote on top of them. The group then distributed one acorn to each stranglethorn head, causing them to shrink immediately. As the antidote continued to be distributed, more and more of the Ewok warriors were freed from their struggles with the vine and began to help in giving the acorns out to the stranglethorn. A short time later, the stranglethorn had been completely neutralized, and it was back to its small size. As Wicket hoisted the defeated plant above his head, the Ewoks gave a great cheer, triumphant over the murderous plant."}, {"tag": "p", "text": "At the same time, Kneesaa had climbed to the top of the village to rescue the captive woklings. Although attacked by a remaining stranglethorn, the Ewok Princess was able to seal its mouth shut by feeding it a sticky concoction from her bag. As the celebrations of their victory subsided, Kneesaa arrived with the rescued woklings, signaling the end of the battle."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the plant defeated, Kneesaa was forced to give an apology to the tribe for her carelessness in starting the crisis. However, the Princess was forgiven when it was shown that her actions during the battle and the entire crisis had allowed her to learn the Three Lessons, a code that needed to be learned by every upcoming Ewok leader. The news delighted Chirpa, who declared that Kneesaa would make a fine Chieftess after he was gone."}, {"tag": "h2", "text": "Appearances"}]}