{"url": "Battle_of_Byllura", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Battle of Byllura"}, {"tag": "p", "text": "The Battle of Byllura took place in 1032 BBY when Rusher's Brigade, carrying thousands of student refugees seeking refuge from the Battle of Gazzari, landed on the planet Byllura in the Dyarchy. While aware that Byllura was controlled by children, Jedi Knight Kerra Holt and Brigadier Jarrow Rusher did not realize that the children, Quillan and Dromika, were actually Sith Lords. Upon landing near Hestobyll, Holt attempted to reach the Loft in order to verify the safety of the planet. However, she soon realized that the planet's entire population was being manipulated using Force persuasion imposed by the twins Quillan and Dromika and communicated over the entire planet by Celegians."}, {"tag": "p", "text": "Holt initiated a fight with the Unifiers in the city, eventually engaging the Krevaaki Saaj Calician in a duel. Calician led Holt to the Loft, where the twins were nearly able to break Holt's mind. However, Holt was able to resist their mental persuasion long enough to be rescued by Rusher and the Diligence. Taking Quillan captive and fleeing the planet, the Diligence encountered the Dyarchy Fleet, which was preparing an assault on the Daimanate. However, before the assault could begin, the forces of the Arkadianate, under command of the Sith Lord Arkadia Calimondra, arrived and opened fire on the Dyarchy Fleet. In short order, the planet fell to the Arkadianate, and the Diligence and its passengers, including Quillan, were taken to the Arkadianate capital of Syned. Seese served as a tactical officer aboard the New Crucible during this battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Sith Enthrallment"}, {"tag": "p", "text": "During the Republic Dark Age, the planet Byllura was one of the many territories ruled by the human Sith Lord Chagras, ruler of an empire in the Grumani sector known as the Chagras Hegemony. Chagras was part of a large Sith family clan known as the Calimondra family headed by the matriarch Vilia Calimondra. At some point prior to his death in 1040 BBY, Chagras produced two twin children: a son named Quillan and a daughter named Dromika. In 1041 BBY, Chagras appointed the Krevaaki Sith Lord Saaj Calician as regent to the twins who had turned five-years old by that stage. As Force-sensitive Sith offspring, the twins had strong powers with Quillan having a powerful ability to predict the future while Dromika being able to use the Force to hypnotize others to do her bidding. Following Chagras' death in 1040 BBY, Calician became the custodian of the twins and they established a Sith principality based on Byllura, known as the Dyarchy, with Calician serving as their \"regent-aspect\" and main link to the outside world."}, {"tag": "p", "text": "Throughout their childhood, the twins never left The Loft, their private residence in the city Hestobyll, and they perceived the wider universe entirely through the Force, referring to individuals and objects external to themselves as \"aspects.\" Quillan lived entirely in his expansive mind and was able to use his Force abilities to control every aspect of the lives of the inhabitants of Byllura including daily activities like eating, working, and sleeping. The Sith twins created a highly-centralized system of governance on Byllura where they would use mental suggestions to enthrall the entire population into operating like a single cell organism. These mental suggestions were transmitted throughout the planet by a network of enslaved Celegians, effectively creating a non-electronic centered around the will of a single Sith Lord: Quillan."}, {"tag": "p", "text": "Due to this Force network, Quillan and Dromika were aware of every single activity occurring within Byllura. Their regent Calician also employed a force of red-clad Force-sensitive darksiders known as Unifiers to enforce compliance among the population by using Force persuasion. As a result of Quillan integrating all visitors to Byllura into his mind control network, Byllura's population, manufacturing output, and military strength had grown steadily over an eight-year period leading up to its collapse in 1032 BBY. All sentient beings visiting the Dyarchy stayed whether they intended to or not. Calician likened this period in Byllura's history to a planetary equivalent of a Whinndorian gorsk-plant, a flower with a paralyzing sting."}, {"tag": "p", "text": "Since Chagras' demise left the twin's grandmother Vilia Calimondra without an heir to her extensive holdings, and she initiated a second competition among her grandchildren to find a worthy successor, which soon degenerated into an all-out conflict between her descendants. The Dyarchy was pitted against competing Sith states and Calician planned to strengthen the twin's empire, to make it powerful enough to wage war against their rivals. Calician also contacted the Sith Lord Daiman, the rule of the Sith state known as the Daimanate, via hologram with the hope of forming a military alliance. However, the narcissistic Daiman was neither interested in allying with Dyarchy nor invading it. For years, the Dyarchy remained isolated from the galaxy."}, {"tag": "p", "text": "In 1037 BBY, Calician commissioned the creation of a fleet of fourteen large battlecruisers with a single Force-sensitive Celegian onboard each one that would receive orders directly from Byllura itself. These battleships were constructed within hidden hangars beneath the capital Hestobyll's large reflection pools. By 1032 BBY, this fleet was ready for battle operations and Calician intended to use them to invade the Daimanate's rearward systems as his first step towards galactic domination. Using the Dromika and Quillan, Calician also planned to rule the Galaxy by making all inhabitants mentally-bonded to the Sith twins themselves."}, {"tag": "h3", "text": "The Jedi Intruder"}, {"tag": "p", "text": "Following the Battle of Gazzari, the Jedi Knight Kerra Holt escaped Gazzari with a thousand of students she had rescued from the war arxeum, a mobile university created by Industrial Heuristics to study war sciences. In 1032 BBY, the Quermian Sith Lord Ayanos Bactra had planned to sell one such arxeum to Lord Daiman near Gazzari. However, the facility was attacked and destroyed by the Sith Lord Odion. The battle ended when Daiman and Odion joined forces under orders from the family matriarch Vilia Calimondra and then turned on Bactra's forces. Kerra managed to evacuate these students aboard the mercenary Jarrow Rusher's troop transport Diligence."}, {"tag": "p", "text": "Rusher was the commander of a group of mercenaries known as Rusher's Brigade, which had worked for various factions including different Sith warlords. Forced to take the children with them, Rusher and his crew flew their ship to the planet Byllura, hoping to drop the children off there. While there were rumors that Byllura had fallen under the thralldom of two Sith children, there was little hard evidence to confirm any changes in the planet's political situation. Rusher was also unwilling to risk making a jump into hyperspace due to the lack of reliable information about safe hyperspace routes into Republic space."}, {"tag": "p", "text": "Compared to the highly industrialized and polluted subject worlds of the Daimanate like Chelloa, Byllura had a reputation for its natural beauty and idyllic tropical landscapes, at least by the standards of Sith space. Since the refugees created a strain on supplies and space aboard the Diligence, Rusher was eager to drop the passengers on Byllura. However, Kerra was still uneasy about the plan and made Rusher promise to give her an hour to check the place out before allowing the refugees to disembark. Quillan and Dromika sensed the vessel's approach through the Force and summoned Calician to them, ordering him to contact Byllura's defensive stations and inform them of any reports of foreign vessels in the vicinity of the world."}, {"tag": "p", "text": "A short time later, Diligence arrived in the system, and Calician permitted the vessel to land and allowed its occupants to disembark at the capital city Hestobyll. The Regent himself was excited by the ship's arrival and viewed the vessel as an omen that to time was right to strike against Daiman, because the Daimanite forces would not have permitted a ship to leave their domain if they had had sufficient military forces in the vicinity of their border. With approval from Dromika and Quillan, Calician ordered the Dyarchy Fleet to launch into space for an invasion of the Daimanate's rear systems."}, {"tag": "h3", "text": "The Arkadianate Threat"}, {"tag": "p", "text": "Unknown to the other two parties, the Sith Lord Arkadia Calimondra had plans to invade and annex the Dyarchy. Arkadia was the elder sister of Dromika and Quillan, and regarded Regent Calician as an outsider and rival to her own ambitions. As part of her invasion plan, she contracted the services of the Bothan spy Narsk Ka'hane, an independent operator who worked for several different Sith employers including the Calimondra family matriarch Vilia Calimondra, the twins' grandmother. Narsk had recently been hired by the Sith Lord Odion to gather intelligence and to destroy a Daimanate military project. After being captured by the Daimanate authorities, Narsk had narrowly escaped captivity with the assistance of his nominal enemy Kerra Holt."}, {"tag": "p", "text": "Prior to the battle, the Bothan spy infiltrated Byllura in a specially modified stealth starfighter and attached a transmitter device onto the Loft's video surveillance system. This allowed Arkadia to spy on the Dyarchy's rulers who resided in a penthouse at the top of the Loft, a massive seaside palace on top of a rock overlooking Hestobyll's harbor. Narsk then retreated to a cave in higher ground which he would use to observe developments on Byllura. Since Kerra had acquired Narsk's stolen Cyricept Mark VI stealth suit on Darkknell, Vilia was able to use its electronic systems to spy on the Jedi woman and learnt that the Diligence was heading to Byllura. She subsequently informed her granddaughter Arkadia about the Jedi woman's presence."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Calm before the Storm"}, {"tag": "p", "text": "As the Diligence entered into the atmosphere above Hestobyll, Kerra and Jarrow were relieved to encounter no resistance. Jarrow was granted permission to land via commset by an unidentified individual dubbed \"Deep Voice\", who was actually the Celegian \"One\". Upon arriving at their allocated hangar platform, they were surprised to find that there was no welcoming party. Believing Byllura to be a safe destination free of any Sith presence, an optimistic Jarrow ordered the crew to deploy its cargo ramps to allow the refugees to disembark. Jarrow attempted to lead the refugees out but was stopped by Kerra, who reiterated that she needed to check out the place first, adding that it had to be a proper reconnaissance probe of the surrounding city rather than simply observing the surrounding platform area."}, {"tag": "p", "text": "This sparked an argument between the young Jedi Knight and the mercenary leader. Citing a datapad entry on Byllura, Jarrow tried to argue that there was adequate shelter for the refugees in Hestobyll city and that there was no sign of danger. Kerra responded by arguing that they had little intelligence on who actually controlled Byllura, and angrily accused Jarrow of not caring for the refugees. In return, Jarrow argued that the refugees were an inconvenient dead weight. In the end, the two reached a compromise when Kerra managed to get Jarrow to give her one hour to do a proper recon probe of Hestobyll in return for returning the refugees onboard the Diligence."}, {"tag": "p", "text": "However, these developments were being sensed by the enslaved Celegian \"One\" who had transmitted the information back to Calician. While Calician was aware that the ship's captain had indicated a readiness to off-load his passengers on Byllura, he became suspicious about a potential threat to the Dyarchy when an unidentified person (later revealed to be Kerra) got the student refugees to reboard the ship. Calician suspected that this was a Daimanate trick and quickly dispatched a contingent of Unifiers to investigate the Diligence under direct orders from Dromika, who was in turn being telepathically controlled by her twin brother Quillan."}, {"tag": "p", "text": "During her reconnaissance probe of Hestobyll, Kerra encountered individuals of various species including Duros, Caamasi, Ithorians, and Sullustans who all ignored her. When Kerra tried to make contact with an Ithorian man and an elderly Duros couple, they only responded with mute indifference. At that point, Jarrow contacted her via comlink to inform her that they had received another transmission from \"Deep Voice\" on the commset that the Byllurans had seen the refugees on the platform and were sending people to help with their situation. The refugees would supposedly be \"directed to a center for assigning quarters.\" Being aware about Sith relocation practices, Kerra expressed surprised that the local authorities had gotten wind to their predicament and warned Jarrow to be careful since they were in an unfamiliar place."}, {"tag": "p", "text": "Kerra's situation was further complicated when she found out that she was being tailed by the teenaged Sullustan refugee Tan Tengo, who in turn was being followed by the Duros soldier Beadle Lubboon. Tan had broken out of the Diligence to follow her mentor and \"big sister\" Kerra while Beadle had been dispatched by Jarrow to find Tan. The three then headed towards a nearby crowd heading for a massive hexagonal silo. Kerra encountered a Duros man and quickly discerned that Byllura was being controlled by Sith who were directly imposing their will on all its inhabitants. Before she could contact Rusher by comlink, she sensed an alien entity ordering the crowd of Dyarchy Fleet workers to commence loading operation and to deliver the Celegians to their assigned vessels."}, {"tag": "p", "text": "Immediately, Kerra witnessed the crowd surging towards the hexagonal complex. In the unfolding confusion, Tan and Beadle became separated from her within the crowd. At that moment, several red-clad Force-sensitive enforcers known as Unifiers, which she dubbed \"Scarlet Riders\", arrived at the scene. When Kerra witnessed the same Ithorian she had encountered earlier echoing the same commandments uttered by the Unifiers, she quickly realized that the planet was being controlled through mental manipulations by unidentified Force-users. The Celegians formed a mental telepathic network which relayed these commands while the scarlet Unifiers were enforcing their rules by using Force persuasion. Meanwhile, Beadle and Tan were quickly captured by the Unifiers who proceeded to load them onboard one of their airspeeders."}, {"tag": "h3", "text": "Resisting Integration"}, {"tag": "p", "text": "Attempting to save her charges from Sith captivity, Kerra ignited her lightsaber and fought the Unifiers, killing several of them in the ensuing melee. She then pursued the scarlet Unifiers through the streets of Hestobyll, commandeering an airspeeder. Kerra also managed to warn Rusher in time to bring most of the refugees back aboard the Diligence, minutes ahead of the arrival of another party of Unifiers dispatched to the spaceport. These Unifiers were led by a Trandoshan who ordered Jarrow to open the vessel and report for assignment. They had captured several of the crew including shipmaster Ryland Dackett and Prenda Novallo who had been outside on the landing platform making repairs to the Diligence."}, {"tag": "p", "text": "Rejecting the Dyarchy's demands that they submit, Jarrow dropped an anchor on the Trandoshan, sparking a vicious battle in the spaceport. When Rusher tried to have the Diligence lift off, the Unifiers attacked by trying to jump onto the vessel and slash at its hull with their lightsaber-batons. In response, Rusher ordered his Khil helmswoman Zussh to lift the ship into the air and give it a spin to shake of the Sith climbers. Rusher then ordered Zussh to switch off the thrusters, causing the ship to slam into the platform, before reactivating them. The scarlet Unifiers then launched a second attack by ramming their airspeeders against the upper decks to rupture the windows."}, {"tag": "p", "text": "Though the Diligence had little operational armament to bear on these attackers, Rusher came up with the clever tactic of slamming the non-working gun emplacements on the Diligence into the swarming speeders, easily destroying their attackers. After eliminating the Sith opposition, Rusher succeeded in evacuating all the crew and passengers at the landing platform including Dackett, Novallo, and the thirty other stranded crew who had been on the landing deck. The Trandoshan Unifier commander was also killed by Dackett who personally beat him to death with his regenerated arm. With the Dyarchy's fleet lifting into space from their underwater hangar bays beneath Hestobyll's reflection pools, Rusher ordered the Diligence out to sea and away from the chaos."}, {"tag": "h3", "text": "In the Lair of the Twins"}, {"tag": "p", "text": "Meanwhile, Kerra pursued the scarlet Unifiers through the streets of Hestobyll. During an aerial dogfight, she rammed into an airspeeder piloted by a Rodian Unifier, which led to a fist-fight where the latter was thrown to his death in the streets below. During this melee, Kerra sensed that Rodian did not know actually know how to operate an airspeeder but was being directed and controlled by a higher force. Her pursuit eventually took to The Loft, a mushroom-shaped retreat situated at the top of a mesa opposite the harbor. During the flight, Kerra noticed that a network of Celegians were situated at strategic junctures stretching from the Loft to the city, forming an unbroken telepathic communication network that was used to mentally subjugate the Bylluran population through Force suggestions."}, {"tag": "p", "text": "Meanwhile, Calician learnt of Kerra's presence through his telepathic network. The twins viewed Holt as a threat and they ordered the Krevaaki to protect them, then took direct control of his mind via the Force. Holt infiltrated The Loft's airspeeder hangar bay and made her way to chamber in which One was held, where she persuaded the aged Celegian to stop sending messages on behalf of the Dyarchy, placing the communications network into disarray. She also ordered One to send Tan and Beadle to the hangar so that they could be picked up later. Under the influence of the twins, Calician headed to One's chamber and attacked Holt, with six lightsaber-batons, which he twirled from his tentacles. He threw himself at her in a nihilistic fury, driven by the influence of the twins, and he came close to rupturing One's tank, which would have released a poisonous gas and killed both him and Holt."}, {"tag": "p", "text": "He regained some control over his body, but Holt was able to outwit him and singe his facial tentacles, then slice off one of his limbs from his middle carapace. He felt no pain, due to the influence of the twins, and realized that Holt was too strong for him to defeat, because his withered mind could not access his memories of how to fight Jedi while it was being dulled by Dromika's mental manipulations. He therefore stopped fighting and offered to take Holt to the twins who were housed in a pent house at the top of the Loft, and she accepted his proposal. On their arrival in the twin's quarters, several nanny droids hurled themselves at Calician and Holt, in an attempt to defend the twins."}, {"tag": "p", "text": "However, Holt swept them away, and Calician introduced her to the twins. Using the Force, Dromika pinned Holt down and compelled Calician to bring his blade to bear against the Jedi. Calician resisted, because he wanted to be given the chance to fight Holt by himself, free of the twins' mental influences, and while he and Dromika were briefly distracted, Holt broke free and severed one of Calician's leg tentacles.She then engaged the twins in a mental battle of using telepathy to hurl objects across the room. During the fighting, Kerra quickly realized that Quillan was using his sister Dromika as a puppet to carry out his bidding."}, {"tag": "p", "text": "The ensuing duel was interrupted by the arrival of the Diligence which used its heavy frontal gun emplacement to breach the penthouse's windows. Rusher had already picked up Tan and Beadle who had escaped on an airspeeder from the palace's hangar bay. In the ensuing chaos, Kerra kidnapped Quillan and brought him onboard the Diligence, fleeing an enraged Dromika who had by then picked up one of Calician's lightsabers. Once aboard the Diligence, Quillan descended into an infantile tantrum since he was unable to sense his sister through the Force. Meanwhile, a distraught Dromika fell into a comatose state since she could not discern between a physical presence and a Force emanation."}, {"tag": "h3", "text": "Enter the Bothan"}, {"tag": "p", "text": "From his safe position in the mountains above Hestobyll, Narsk Ka'hane was able to monitor the fighting. He also intercepted communications signals from the Diligence and subsequently confirmed that Kerra was indeed present on Byllura. Narsk also observed Kerra's wild pursuit through the streets of Hestobyll which ended at the Loft. After ascertaining that Kerra was within the Dyarchy's sanctum, the Bothan spy contacted his employer Arkadia and told her to be ready to strike Byllura. Narsk also observed the movements of the Dyarchy Fleet into Byllura's upper atmosphere. At one point, Narsk contacted Kerra via comlink and demanded that the Jedi return his stolen stealth suit.Having confirmed Kerra's presence, Narsk left Byllura on his stealth fighter and headed to space where he was picked up by Arkadia's flagship New Crucible."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The capture of Quillan and the incapacitation of Dromika would have enormous ramifications for the Dyarchy on Byllura. Bereft of its twin rulers, the highly-centralized fiefdom rapidly disintegrated into anarchy. Meanwhile, the other Celegians on Byllura followed One's example and refused to send telepathic messages, leading to a breakdown of the entire telepathic network. Their rebellion made it impossible to co-ordinate the Dyarchy's manufacturing efforts and led to explosions in all of the world's major construction facilities, destroying the bulk of the Dyarchy Fleet. With the end of the Dyarchy's telepathic network, the population emerged from their mentally-induced thralldom and quickly reclaimed their former cognizance and autonomy. Riots quickly broke out across Byllura's major centers including Hestobyll as the inhabitants vented out their fury against the old order."}, {"tag": "p", "text": "The breakdown of the Dyarchy's telepathic network also caused a series of explosions in several shipyards and munitions factories throughout Hestobyll. Prior to the collapse, all instructions and knowledge that enabled these installations to operate were transmitted through this telepathic network. The Celegians carried these instructions to these industrial installations which were all supervised by Unifiers. With the kidnapping of Quillan and the Celegian revolt, the Regent Calician lacked any means of communicating with his realm. Following the arrival of the Diligence, Calician had ordered his shipyards to produce more battleships. However, those workers assigned to the shipyards had no knowledge of metal casting procedures since the experts were based at the Loft's lower levels."}, {"tag": "p", "text": "The Dyarchy's collapse coincided at a stage in the manufacturing process when the warships' molds were being filled. Not knowing what to do next, the workers allowed the molds to overfill with molten durasteel which unleashed a chain reaction of explosions that destroyed the shipyards and damaged large areas of Hestobyll's infrastructure. Meanwhile, the Dyarchy's orbital defense stations detected the arrival of a fleet of enemy warships from the Arkadianate, the neighboring Sith domain that was ruled by the twins' older sister and Sith Lord Arkadia Calimondra. Following the assault on the Loft's penthouse, Regent Calician had retreated to the palace's underground command center with the unconscious Dromika."}, {"tag": "p", "text": "Freed from the control of the Sith twins, Calician contacted his former enemies via hologram to inquire if Quillan was still alive. With Dromika still in a coma, Calician tried to convince Kerra to kill Quillan in revenge for the slavery he had endured under the latter. In return, Kerra also got Calician to free the remaining Celegians. As the Diligence exited Byllura's upper atmosphere, the Dyarchy was invaded by the Arkadianate's war fleet. Arkadia's warfleet quickly disabled the Dyarchy's battleships but took care not to destroy them since they wanted to salvage the wrecked enemy ships. Arkadia's flagship New Crucible also captured the Diligence in their tractor beam projector."}, {"tag": "p", "text": "During the subsequent occupation, Arkadinate forces also freed the remaining imprisoned Celegians and dismantled the Dyarchy's mental telepathic network. While the planet's citizens were liberated from Dyarchy rule, they now became subjects of yet another Sith dynasty, this time the Arkadianate. Arkadianite forces also found Calician and executed him due to his role as the mastermind behind the Dyarchy, and according to a report received by the Bothan spy Narsk Ka'hane, Calician met his end quietly. With the collapse of the Dyarchy and the neutralization of its military fleet, Byllura fell and was subsumed into Arkadia's territories."}, {"tag": "p", "text": "In the aftermath of the battle, both Quillan and Dromika were taken into the custody of their older sister Arkadia. Kerra and Jarrow brought a captive Quillan to the Arkadianate capital of Syned. Throughout both the journey and their meeting with Arkadia, the teenaged boy remained in an infantile and almost catatonic state, refusing to interact with his captors. Meanwhile, Arkadiante forces also took control of the Loft and placed his twin sister Dromika in their custody. Due to her previous mental enthrallment by her brother, their elder sister Arkadia decreed that the twins should be separated from each other. Dromika was to remain in her mountain top home but would be regularly tended and supervised by her new Arkadinate guardians. During a meeting with Kerra and Jarrow, Arkadia commented that she hoped that this separation would eventually improve Dromika's quality of life, and promised to vist her in the future. Ultimately, custody of the twins would pass to their grandmother Vilia Calimondra."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Byllura was created as part of the plot of John Jackson Miller's first professional novel Knight Errant, which was released in January 2011. Much of the battle was told from the perspectives of the main protagonist Kerra Holt, a supporting character Jarrow Rusher, and a minor antagonist Sith Lord Saaj Calician. It also served as a cliffhanger to the introduction of another antagonistic figure in the novel: Lord Arkadia Calimondra."}, {"tag": "p", "text": "The battle later received its first visual depiction in the 2012 guide book The Essential Reader's Companion, and was illustrated by the artist Jeffery Carlisle. This image depicted Kerra engaged in a lightsaber duel against Calician, while the Celegian \"One\" was shown in a cylindrical container in the background."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}