{"url": "Suurja_system", "categories": ["Category:Legends articles", "Category:Ojoster sector star systems"], "nodes": [{"tag": "h1", "text": "Suurja system"}, {"tag": "p", "text": "The Suurja system was a star system that was located within the Ojoster sector of the galaxy's Outer Rim Territories region and contained Suurja—an agrarian planet with a breathable atmosphere that harbored both a native species called Suurjans and a colonist population of 16 million. By the year 3966 BBY, Suurja—the primary world of its star system—served as a resource world for the nearby city-covered planet of Taris. During the early phase of the conflict between the Mandalorian Neo-Crusaders and the Galactic Republic, both sides engaged in four devastating yet inconclusive battles on Suurja. In 3964 BBY, a large group of Jedi crusaders was captured by the Mandalorians on Suurja. Millennia later, the region of space surrounding the Suurja system changed ownership between various governments such as the Galactic Empire's successor states and the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Suurja system was a star system that was located within the Ojoster sector of the galaxy's Outer Rim Territories region. The star system's primary world was Suurja—an agrarian planet with a Type I atmosphere that was breathable for members of the Human species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The region of space surrounding the Suurja system was explored between the years 5000 BBY and 3996 BBY. By 3966 BBY, Suurja, the star system's primary world, served as a resource world for Taris, a nearby city-covered planet. That year, the Mandalorian Neo-Crusaders, who had been conquering independent planets beyond Galactic Republic–controlled space for a decade, began to threaten Suurja and other Tarisian resource worlds, causing the Republic to grant Taris membership and military protection. As a result, a Republic security cordon called the Jebble-Vanquo-Tarnith line was created, and the Suurja system was one of the systems that was located on the frontline."}, {"tag": "p", "text": "The following year, the Mandalorian forces engaged the Republic Military in four inconclusive battles on Suurja in the span of six weeks. Following the fourth skirmish, the Mandalorian forces departed from the Suurja system. In 3964 BBY, a large group of Jedi Knights affiliated with the Revanchist faction of the Jedi Order were ambushed and captured by Mandalorian forces on Suurja."}, {"tag": "p", "text": "During the Clone Wars that erupted millennia later, the Suurja system was located within Republic space. Following the fragmentation of the Galactic Empire in 4 ABY, the region of space containing the star system fell within the warlord Zsinj's domain. After Zsinj's death, the territory surrounding the Suurja system became a part of the Imperial Space, and it remained within that region until the Imperial Grand Admiral Thrawn's defeat. During the Imperial Remnant's campaigns against the New Republic, the star system containing Suurja was located within the area controlled by the latter government, while by the year 137 ABY, the Suurja system fell within the borders of the Dark Lord of the Sith Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Suurja, the primary world of the Suurja system, was home to Suurjans—a species that lacked ears. The agrarian world also had a colonist population of 16 milllion. Many inhabitants of Suurja where forced to become refugees following the battles between the Republic and the Mandalorians that took place on the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Suurja system was first mentioned in The Taris Holofeed: Prime Edition—an article that was written by John Jackson Miller and published within the Star Wars: Knights of the Old Republic/Rebellion flip-book on March 1, 2006. In 2008, the star system was mentioned in Suurja's entry in The Complete Star Wars Encyclopedia. The Essential Atlas—a reference book co-authored by Jason Fry and Daniel Wallace and published on 2009—provided a map placement for Suurja and its star system, while the Atlas's Online Companion that was subsequently published on the the official Star Wars website placed the Suurja system in the Ojoster sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}