{"url": "Svekk_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with elements from unlicensed sources", "Category:Wild Space star systems"], "nodes": [{"tag": "h1", "text": "Svekk system"}, {"tag": "p", "text": "The Svekk system was located in Wild Space and contained the planet Bormter, home to the sentient Bormterran species. Shortly after the Battle of Endor, Imperial Moff Delurin established a power base on Bormter for his own empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Svekk system was a star system located in Wild Space."}, {"tag": "p", "text": "It lay within one of the frontier areas of the region. The system contained at least five planets, with Bormter occupying the fifth orbital position."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the death of Galactic Emperor Palpatine during the Battle of Endor in 4 ABY, Imperial Moff Delurin declared himself Warlord of Wild Space and used the prototype Dragon-class Heavy Cruiser Galaxy Dragon to conquer Bormter. Delurin subsequently established a power base on the planet for an empire that he carved out in Wild Space."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Svekk system contained Bormter, the homeworld of the Bormterrans, a species of reptiloid sentients. Although the Bormterrans were technologically primitive, they were also fierce melee fighters and eventually came to serve the warlord Delurin as the elite military unit known as the dragon troopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Svekk system was first mentioned in \"The Galaxy Dragon and crew,\" an article written by Bill Slavicsek as a supplement for West End Games' Star Wars: The Roleplaying Game and published in Dragon Magazine 200 in December 1993. Since the article was released outside of the Lucas Licensing process, its canonicity within the Star Wars Legends continuity was never confirmed."}, {"tag": "p", "text": "The 2009 reference book The Essential Atlas placed a \"Bormter system\" in grid square H-14. As The Essential Atlas co-author Jason Fry has stated that the listing of star systems in the Appendix section of the Atlas was not intended to create new system names or override previously established continuity, this article treats the \"Bormter system\" as conjecturally synonymous to the Svekk system."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}