{"url": "Svivreni", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Equine sentient species", "Category:Outer Rim Territories species", "Category:Svivreni"], "nodes": [{"tag": "h1", "text": "Svivreni"}, {"tag": "p", "text": "Svivreni were short, furry, equinoid sentients native to the planet Svivren. Due to the rocky environment of their homeworld, they developed into a stout species, and created a civilization of hard-working people with a natural talent for geology. Svivreni were particularly known for their skill in mineralogy and for their stubbornness. The Svivreni had elaborate greetings and farewells, never using the word \"goodbye,\" which they considered to be bad luck."}, {"tag": "p", "text": "Initially members of the Galactic Republic, the Svivreni forbade weapons on their planet and exacted strict punishment for outlaws, including execution, which reduced crime and was one of the factors that turned Svivren into an important trade world. The species avoided involvement in the Clone Wars and tried to remain neutral during the Galactic Civil War. In the days of the New Republic, the Galactic Empire attempted to conquer Svivren, but the Svivreni resisted Grand Admiral Thrawn's attacks through sheer obstinacy. The species later associated with the Galactic Federation of Free Alliances and the Galactic Alliance Remnant."}, {"tag": "p", "text": "Many Svivreni achieved prestige as some of the best and hardest-working miners, including Saqc'or and Kitalic Nirasik. Another Svivreni, Mihalik, abandoned his job to illegally track the people who had injured his co-workers. Svivreni working in other areas included the crime lord Torsteen and two senatorial aides—Tyro Caladian, who aided Jedi Obi-Wan Kenobi, and Tyro's cousin, Curran Caladian, who became a political fugitive under the Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Svivreni were an equinoid sentient species whose bodies were mostly humanoid in structure. Adult Svivreni ranged in height from 60 to 90 centimeters, very rarely surpassing a meter. However, due to their stout physique and resilience, they were as strong as any Human-sized species. Unlike many other beings their size, the Svivreni had long arms, which allowed them to handle full-sized technological items, such as blaster rifles, with ease. While their shorter legs prevented Svivreni from achieving the racing speed of a Human, they could still outpace some taller species, such as the Noghri. This was partially due to the cloven hooves that served the Svivreni as feet."}, {"tag": "p", "text": "Each Svivreni had a large, stout head with big eyes and a wide, projecting snout which they could use to snort. They also had upright, equine ears that convulsed in moments of stress. Each Svivreni hand had four triple-jointed fingers that gradually narrowed from the hand to the nail."}, {"tag": "p", "text": "The body of a Svivreni was almost completely covered by short, coarse fur, except for the snout, the eyes, the hooves, and the ears. The Svivreni also had a mane of longer hair at the top of their heads—that could be orange or copper in color—and further growths on their arms. Svivreni customarily let this hair grow uncut, tying it into a ponytail instead. The mane reached from the head to below the waist in older Svivreni, who could easily reach 125 years of age. However, this was not a trait exclusive to the elders. Younger Svivreni including Tyro Caladian, a young adult, achieved a mane of that length, and his cousin Curran Caladian, who was considered young, had a braid reaching his knees. Other Svivreni, such as the miner Mihalik, tied their mane in several rear braids, to keep it from being a nuisance while performing manual activities."}, {"tag": "p", "text": "Svivreni could easily outlive Humans, as the equinoids only considered retirement at ninety standard years of age. They began to suffer ill effects of age at fifty-five, to a level comparable to a forty-one-year old Human. However, the Svivreni matured to adulthood at sixteen, exactly the same as Humans, and they reached adolescency at eleven, while Humans took one more year to do so."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Svivreni were known galaxywide for their obstinacy. Once a Svivreni had reached a decision, he or she would very rarely reconsider. This gave them the willpower to resist shrewd merchants and even the mind-influencing powers of the Force. As a species, the Svivreni disliked and strongly opposed efforts to convince them to do something of which they did not approve. They were also opposed to the mere idea of external forces conquering their home. Although stubbornness was not a universal trait, most Svivreni did share this feature to a great extent. Several Svivreni mineralogists working outside their native planet Svivren were headstrong enough to defend their ideas in a brawl if needed. When they grew older and more experienced, they fought less, but became even more adamant."}, {"tag": "p", "text": "Svivreni were skilled miners and mineralogists, and they had a well-deserved reputation for this work. This penchant led some of them to become scouts. Important extraplanetary businesses often hired Svivreni professionals to manage and supervise mining projects on either planets or asteroids. The species appeared to have a natural talent to appraise the value of any mined material, from gems to more mundane minerals, although this gift was honed by studying. The Svivren Xenomineralogy Institute was considered to be one of the best academic institutions studying this science due to the skill of its graduated students. The exploits of qualified Svivreni in mining and metallurgics, particularly in the private sector, were as renowned as their resolution. As Svivreni miners commonly had to use many tools, they favored wearing trousers with copious pockets and pouches. To improve the mobility of their arms, they preferred sleeveless robes. For the Svivreni mineralogist, recognition from their peers was important, even though the species could not agree on who was the best mineralogist in history. They nevertheless recognized Saqc'or as one of the toughest mineralogists, Svivreni or not, ever."}, {"tag": "p", "text": "Certain historians compared the Svivreni with the similarly stubborn Human settlers of Poderis but, although the Poderisans tried their best to improve the status of their marginal world, they never achieved the success of their counterparts. The Svivreni managed, through sheer effort and dedication, to transform their harsh planet into an important trade world with no less than seven spaceports, including one with state-of-the-art technology, complete with repair ports and storage areas comparable to Coruscant's port facilities. They imported food and pharmaceuticals from other worlds while exporting computers, droids and other high- and middle-level technology. With this, Svivren achieved a population of 8.5 billion sentients, including native Svivreni, Humans, Sullustans, and a significant population of Ewoks in the times of the New Republic. Having become an important trade world, the Svivreni developed traditional clothing for their traders, including robes and turbans. The Farrimmer Cafe bar and grill, aboard the Mynock 7 Space Station, served a scented and popular dish of seasoned enyak bobs over teerlop-zikody that was called Svivreni treat."}, {"tag": "h3", "text": "Social behavior"}, {"tag": "p", "text": "As their planet received constant traffic from offworlders, Svivreni enforced strict laws forbidding any personal weapons for citizens and visitors anywhere on the planet, except for the regulation gear carried by the well-armed Svivreni security force. However, circa 4 ABY, several smugglers managed to hide important cachés of blasters in the area of Wrils. Violent action on Svivren was punished with an immediate and public execution, something that, combined with the aforementioned measure, helped keep crime to a minimum, as well as deterring scoundrels from visiting the world due to the dangers it presented to them. Other galactic groups criticized the harsh laws of Svivren, despite their effectiveness."}, {"tag": "p", "text": "Svivreni valued both the fur covering their bodies and the manes on their heads. Some Svivreni were known to smooth their facial pelage with their hands when nervous or focused. The hair on the head was considered most important and was customarily allowed to grow without cutting—the Svivreni considered its thickness a reflection of the bearer's intelligence and fertility. The elders, who could be recognized by their manes reaching below their waists, were particularly respected in their culture. However, younger Svivreni sometimes had unusually long hair. Many Svivreni tied their hair with leaves of Nalvar grass from Svivren as a gesture of homage to their homeworld; others used metal rings."}, {"tag": "h3", "text": "Linguistic traits"}, {"tag": "p", "text": "Svivreni had several traditional greetings and farewells, depending on the filial relationship between the Svivreni and the sentient the Svivreni was talking to. The most affectionate greeting included opening a hand, closing it again, and then placing it on the heart. Svivreni considered it bad luck to say \"goodbye\" in any language, so they preferred to part from a loved one with a phrase such as \"The journey begins. So go.\" When parting from a close friend, a Svivreni raised a hand with spread fingers. The friend then mimicked the gesture so that the Svivreni could press his palm with the friend's."}, {"tag": "p", "text": "The species' native language could not be reproduced by Humans because it relied on the Svivreni vocal range. Not all the Svivreni learned Galactic Basic Standard, but some did. Naming conventions for Svivreni favored one-word names—such as Mihalik or Saqc'or—and two part names, such as Casin Mak or Kitalic Nirasik. Relatives shared the second name, as exemplified by the cousins Curran Caladian and Tyro Caladian."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Evolution and the Old Republic"}, {"tag": "p", "text": "The Svivreni came from the harsh, mountainous planet Svivren in the Svivreni sector of the Outer Rim. It was a world with extreme seasons in its various climatic zones. Several areas, including the mines of Nalvar, were relentless on their inhabitants. Due to the planet's severity, the Svivreni evolved into a muscular species, far stouter than many other sentients. The same conditions led to their natural suppleness."}, {"tag": "p", "text": "They became resolute miners by fighting the harshness of Svivren. Historians agreed that the Svivreni penchant for stubbornness was developed because of significant natural hazards on the planet Svivren during the biological and cultural evolution of the species. The planet Svivren was scouted by the Galactic Republic during the last millennia before the Battle of Yavin, and at some point before 19 BBY, the species joined the galactic government. The planet achieved importance due to its rich mines. The Svivreni ability in geology became famous and many of the equinoids left their world to work in that field. Others became Jedi Seers and began roaming both the Outer Rim and the Unknown Regions."}, {"tag": "p", "text": "The natives who remained on Svivren worked hard until the planet thrived as a trading post. As offworlders became common on the planet, Svivreni grew intolerant of outlaw offworlders. The species forbade all violent crime and the possession of weapons. Smugglers avoided Svivren, considering it too dangerous for their kind."}, {"tag": "p", "text": "During the years leading up to the Separatist Crisis of 24 BBY, the Svivreni considered themselves a peaceful species and some of them grew concerned about the growing disorder in the galaxy. Senator Sano Sauro of Eeropha—a Core Worlds planet—made secret dealings to take over control of the mines of Svivren and use them in a project to develop weapons. However, his deal was uncovered and the takeover prevented. Despite their best efforts, the local Svivreni were unable to prosecute Sauro due to insufficient evidence, and the Senator avoided any negative repercussions from the scheme."}, {"tag": "p", "text": "Svivren was not directly affected by the galaxy-wide conflict known as the Clone Wars (22 BBY–19 BBY). After the hostilities ceased, the planet Berchest tried to promote itself as a trading center, but it never became as important as Svivren."}, {"tag": "h3", "text": "The Galactic Empire and the Civil War"}, {"tag": "p", "text": "During the time of the Galactic Empire, Svivren remained a galactically important commerce center, with Imperials present on the world, although the Svivreni Trade Alliance retained control over the government. The emergence of the Alliance to Restore the Republic in 2 BBY marked the beginning of the Galactic Civil War. The Svivreni people dismissed the conflict, calling it \"political infighting\" and refused to take sides. Nevertheless, many individual Svivreni helped the Alliance in their fight against the Empire, even if they would rather have been working for private interests."}, {"tag": "h3", "text": "After the Battle of Endor"}, {"tag": "p", "text": "In 9 ABY, during the Thrawn campaign, Imperial Grand Admiral Thrawn placed Svivren on the list of planets he intended to conquer specifically. Thrawn sent the Imperial Navy from Farstine, arriving at the Svivren system on 44:7:24 to besiege the planet. The traditional Svivreni stubbornness gave the natives strength to organize a strong resistance. The Empire was unprepared for this and the first strikes at Svivreni were unsuccessful. The Empire retreated, but then sent more forces to occupy Svivren. The planet became an important problem for the surprised Imperials, as the invaders achieved little more than losing their own tempers. This inability to secure a victory was soon well-known. Smuggler Samuel Tomas Gillespee mentioned the problems the Empire was having at Svivren and compared the situation with their easy victory at the Battle of Ukio."}, {"tag": "p", "text": "That same year, even with the Imperial blockade, Svivreni traders visited the trading city of Calius saj Leeloo in Berchest, apparently for business reasons. They crossed paths with Jedi Master Luke Skywalker, who was looking for clones working for Thrawn. Initially believing that the Svivreni could be Imperial clones, Skywalker used the Force to scan them. Thrawn's death soon afterward in the Battle of Bilbringi meant an important breakdown in the control of the Empire. The Navy retired from Svivren, never having been able to conquer it. The Svivreni believed that their resolution had helped them resist conquest and become even more determined to repel any would-be conquerors."}, {"tag": "p", "text": "As the Svivreni were clearly opposed to Imperial occupation, pilots from the New Republic found the planet compelling. Unlike other planets near Imperial Space such as Morishim, Svivren was a place they could comfortably visit, enjoying an amount of freedom rarely achievable on other planets."}, {"tag": "p", "text": "Later, when the Galactic Federation of Free Alliances was created, several Svivreni helped this new government, although they still preferred jobs in the private sector."}, {"tag": "h2", "text": "Svivreni in the galaxy"}, {"tag": "p", "text": "Svivreni commonly left their native world to work in mineralogy, geology or related fields. They were often employed by large corporations to manage and supervise mining projects on asteroids and planets. Several Svivreni considered this to be \"fieldwork\" to improve their education, and when they had gotten enough experience, they left these posts for self-employment. Notable Svivreni in this situation included Saqc'or, a veteran miner who worked in the Moddell sector and whom the Empire tried to forcefully recruit to work on its Death Star project before 4 ABY. Another important miner was Kitalic Nirasik, who had worked in virtually every level of the mining industry before serving as the chief executive of Southern Bandomeer Consolidated. Nirasik's company threatened the planetary monopoly of the Offworld Mining Corporation, partly because Nirasik offered his miners good working conditions and a greater hope of survival than Offworld did. At the same time, foreman Nirasik knew how to profit from his good deeds."}, {"tag": "p", "text": "Several Svivreni mineralogists who were working for big companies severed their professional links during the first years of the New Republic to continue their career as freelancers. They considered themselves good enough to choose their employers and even their prices, and they wanted to be recognized by others. One such mineralogist worked for Executive D'gaat, analyzing D'gaat's mine of Vendusii Crystals."}, {"tag": "p", "text": "From the moment Svivren became a trading post, Svivreni traders were a common sight around the galaxy, easily recognizable by their robes and turbans. In 9 ABY, a population of Svivreni settlers shared the barely habitable planet Corjain, in the Kathol sector, with Twi'leks and Jarells. Svivreni who worked in shadier businesses sometimes became criminals. For example, the smuggler Torsteen, led a group of pirates and used his scavenger droid Bruthus to collect space junk on the borders of the Corporate Sector. Some other Svivreni found their vocation as Jedi, leaving Svivren in the line of duty."}, {"tag": "p", "text": "Svivreni were less permissive with alien outlaws on their own planet. Violent crime and possession of weapons were strictly forbidden. Smugglers avoided Svivren, considering it too dangerous for them. However, members of the New Republic who needed to avoid the Imperial Remnant commonly enjoyed an amount of freedom on Svivren rarely achievable on other planets."}, {"tag": "p", "text": "During the later years of the Galactic Republic, cousins Tyro and Curran Caladian both had promising careers as aides in the Galactic Senate of Coruscant. Providing specialized counsel about bureaucracy and investigation, Tyro befriended, and helped, the Jedi Obi-Wan Kenobi in several missions Kenobi undertook to topple enemies of the Jedi such as Granta Omega, Sano Sauro, and Jenna Zan Arbor. Tyro's snooping eventually led him to undercover a conspiracy, and the Svivreni was assassinated by a politician wanting to keep his secrets. His cousin Curran later became a political fugitive under the Galactic Empire, but he continued fighting for what he believed to be a good cause. Following this goal, Curran Caladian joined a collective of outlaws called the Erased and worked alongside the Jedi Fy-Tor-Ana and Ferus Olin."}, {"tag": "p", "text": "During the times of the New Republic, a Svivreni miner and constable by the name of Mihalik felt so outraged by the damages caused by some criminals during the meleenium heist on Qua'Tahc that he left his work and began an amateur chase of the wrongdoers through the galaxy onboard his personal starship. General Airen Cracken of the New Republic was forced to post a warrant on Mihalik on charges of unsanctioned military and police activity, but neither Mihalik or his intended prey were seen again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Svivren and the Svivreni were first mentioned in The Last Command (1993), written by Timothy Zahn. The first named Svivreni to appear in a published story was Tyro Caladian in Jedi Quest: The School of Fear, by Jude Watson, a book published ten years after The Last Command."}, {"tag": "p", "text": "However, before that, West End Games had already expanded the background of the species in The Last Command Sourcebook (1994), by Eric S. Trautmann. Both Svivren and the Svivreni have descriptive entries and statistics in that book, and the Svivreni are also mentioned in passing in the entry about the planet Poderis. This book also included the first published image of a Svivreni, drawn by David Plunkett. The species' description is repeated almost entirely in The Thrawn Trilogy Sourcebook (1996) and then again in Alien Encounters (1998). The latter source lacked a paragraph describing Thrawn's attempted invasion and a roleplaying rule about their stubbornness. That rule is also missing from the Svivreni stats in Heroes & Rogues (1995)."}, {"tag": "p", "text": "Wizards of the Coast's roleplaying game provides different statistics for the Svivreni in Star Wars Gamer #9 (2002) and in Geonosis and the Outer Rim Worlds (2004), disagreeing about the size of the Svivreni for the purposes of the rules. Both sources describe Svivreni as one-meter sentients, but Gamer specifies that their size as \"Small,\" meaning that Svivreni characters suffer restrictions on the amount of weight they can carry and the length of the weapons they can use, while at the same time being a more difficult target for enemies. Geonosis, on the other hand, considers the Svivreni to be \"Medium-sized,\" thus lacking these special rules. A player asked a question in Jedi Counseling #69, a section of the webpage of Wizards, about the possible typo in Geonosis. Wizards responded by creating a specific trait for the Svivreni, as the Svivreni are too heavily muscled to apply the rules used for the Jawas and other \"Small\" species. Instead, Svivreni are considered medium-sized characters for most purposes except for dodging and targeting, in which case they are considered small, and thus more difficult to hit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}