{"url": "Battle_of_Cadinth", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battles in the Allied Tion sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Cadinth"}, {"tag": "p", "text": "The Battle of Cadinth was a battle fought in 6 ABY between the New Republic and the Galactic Empire. A Republic task force, returning from the galactic frontier, had decided to take on supplies at the planet of Cadinth in the Allied Tion sector of the Outer Rim Territories, but as the process of sending shuttles up to the orbiting cruisers was initiated, the Republic landing pads fell under attack from pirates. The raids were successfully repelled, but shortly thereafter the Galactic Empire decided to attack with a substantial force, largely made up of attack droids and walkers. The Empire moved against Republic Observation Post W-16, and were able to inflict significant damage there before the Republic could even begin to retaliate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 6 ABY, a New Republic task force, returning from the galactic frontier, and heading through Makem Te down the Perlemian Trade Route and into the Tion Cluster, stopped at the starport world of Cadinth in the Allied Tion sector of the Outer Rim Territories in order to replenish its supplies. The supplies were shuttled to the orbiting Republic cruisers from a landing pad. Pirate raids had been launched against the landing pad from the western flank, but were fended off by Observation Post W-16. There, the Republic had arrayed a turret, Defender starfighters, as well as Scout and Retrieval Vehicles, in order to repel any further pirate raids."}, {"tag": "p", "text": "The Galactic Empire decided to mount an attack on the landing pad, attacking the western flank, much like the pirates had done. Their force included All Terrain Armored Transports, AP-1-C attack droids, AP-2 attack droids, AP-3 attack droids, and Sniper airspeeders. As the Imperials approached Observation Post W-16, their Sniper airspeeders were spotted by New Republic Lieutenant Brin Stiels. Stiels contacted the Republic Core Base, requesting verification, as he did not know what the airspeeders were, or what their intent or allegiance was. His communication was cut off when the Imperials opened fire on his turret, effortlessly penetrating its armor."}, {"tag": "p", "text": "Stiels quickly realized that the attacking force was not pirates. The Imperial droids came into range, and began opening fire on the Republic vehicles. In response, the Republic pilots scrambled, racing toward their parked Defender starfighters. As they neared their ships, Sniper airspeeders closed in, firing concussion missiles at the parked fighters. The pilots, however, were able to make it into their ships just in time, and evaded the incoming warheads. They moved to engage the airspeeders, but the Imperial craft proved to be too agile. As the Imperial droids continued their relentless assault, Stiels attempted to contact the Republic Core Base once more. He collapsed after making contact, overwhelmed by the heavy amount of dense smoke in the area. At that moment, the All Terrain Armored Transports began targeting the turret he was in."}, {"tag": "p", "text": "Following the battle, New Republic analysts were able to positively identify the Sniper airspeeders, as the soldiers involved in the battle had not known what the vehicles were."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Cadinth first appeared in the short story of the same name, published in Star Wars Galaxy Magazine 2 as a role-playing scenario. It was written by Bill Smith and illustrated by Chris Moeller. The story featured many of the droid models and vehicle prototypes that were developed for Kenner's The Epic Continues, a planned 1986 extension of the Star Wars toy lines and story. The short story brought these previously non-canon elements into continuity."}, {"tag": "p", "text": "The story was left open-ended, with no resolution as to which side won the battle. The battle was later mentioned in Cadinth's entry in The Complete Star Wars Encyclopedia, published in 2008, and The Essential Atlas, published in 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}