{"url": "Suudaa_Nem%27ro%27s_disease", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Diseases and maladies"], "nodes": [{"tag": "h1", "text": "Suudaa Nem'ro's disease"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, the Hutt Suudaa Nem'ro became infected with a disease that slowly dissolved his biological tissue. Nem'ro was cured by the xenopathologist Archiban Kimble, who had studied the disease while in medical school and was able to develop a treatment using the chemicals ardanium, accellerite, and cyanogen silicate. However, the Houk bounty hunter Skadge killed Nem'ro before reporters from the Journal of Xenomedicine could verify Doc's achievement."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A disease gradually dissolved the victim's biological tissue over time, and the Hutt species was susceptible to infection by it. While it was considered incurable by the time of the Cold War between the Galactic Republic and the Sith Empire, the xenopathologist Archiban Kimble, better known as Doc, was able to formulate an experimental cure for the disease using the primary ingredients of cyanogen silicate, ardanium, and accellerite."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 3640 BBY, the Hutt Suudaa Nem'ro was infected with the disease on the planet Nal Hutta. A powerful crime lord, Nem'ro offered a significant sum of credits to any doctor who could save his life. While traveling with the Jedi Knight known as the Hero of Tython, Doc was alerted to Nem'ro's affliction by a former acquaintance named Kaliyo Djannis, a Rattataki who had formerly worked as Nem'ro's enforcer. Remembering that he had studied the disease during his time attending the First Republic Medical Academy of Coruscant, Doc began to work on an experimental cure that had been proposed but never utilized in an effort to develop a cure and thereby gain himself both Nem'ro's credits and galactic fame."}, {"tag": "p", "text": "After successfully developing a cure, Doc offered his treatment to Nem'ro, who had lost almost half of his biological mass by that time. However, in order to ensure that Nem'ro did not try and force him into the Hutt's employment, Doc arranged for Djannis to pose as a hostage on the Hero of Tython's Defender-class light corvette, as Nem'ro had a soft spot for his former enforcer. Doc traveled to Nem'ro's Palace on Nal Hutta and successfully cured Nem'ro of his disease, halting the Hutt's dissolution and earning Nem'ro's gratitude. However, Doc's attempt to gain fame by having his achievement recorded in the Journal of Xenomedicine failed when Nem'ro was killed by a Houk bounty hunter named Skadge, whom Nem'ro had crossed several years earlier. The Journal's reporters were unable to verify Doc's treatment, as Skadge's assault had left very little of Nem'ro's body behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nem'ro's disease was first mentioned in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011. Featured in a number of conversations with the Jedi Knight class's companion character Doc, the disease is the focus of a crossover between the Jedi Knight, Bounty Hunter, and Imperial Agent classes, as Kaliyo Djannis and Skadge are companion characters for the Agent and Bounty Hunter classes respectively. The conversation \"Slugfest\" with Skadge takes place between the conversations \"Healing a Hutt\" and \"So Near, Yet So Far\" with Doc, as it features the Houk departing the player's ship to gain revenge on Nem'ro for attempting to kill him several years before the game."}, {"tag": "p", "text": "According to the text files of The Old Republic, the conversations involving the disease were originally full-fledged missions during which the player would have to retrieve ingredients from several planets. These would have included a mushroom from the planet Taris and the fruit of a venom cattail on the planet Quesh, and the player would have then met with a contact on the moon Nar Shaddaa. However, these missions were removed before the game's release. The disease is also mentioned, albeit indirectly, in the 2012 reference guide Star Wars: The Old Republic Encyclopedia in the entry for Nem'ro."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}