{"url": "Suvam_Tan", "categories": ["Category:Legends articles", "Category:Males", "Category:Mechanics", "Category:Merchants", "Category:Rodians", "Category:Sith minions", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Suvam Tan"}, {"tag": "p", "text": "Suvam Tan was a Rodian merchant who operated an abandoned Republic space station around Yavin around the time of the Jedi Civil War. After Revan's redemption, he and Tan became friends. Revan would visit his station to trade and play pazaak, and during his quest for the Star Forge, helped him drive off a few Trandoshan thugs. At first, they left, but later, they equipped themselves with Stealth field generators and attacked Tan. Luckily, Revan and his companions killed the Trandoshans, and in thanks, Suvam showed Revan his most private stock of merchandise, including Mantle of the Force and Heart of the Guardian."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A former slave for the Sith on Yavin 4 during the Great Sith War, Suvam was an accomplished inventor, having been apprenticed to a Baragwin weaponsmith."}, {"tag": "p", "text": "At the end of the Exar Kun War, the Republic bombarded the surface of Yavin 4, killing Suvam's Baragwin friends. His masters having been killed, Tan was free. He then searched several of the moons of Yavin for salvageable parts, having memorized several bountiful locations during his slave days."}, {"tag": "p", "text": "Tan took up residence on Yavin Station, a supply depot abandoned by the Republic following the war's end. There he set up a trading post and workshop. He became known as a skilled mechanic and inventor, even attracting the attention of the Exchange. His inventions were sought after by many, especially smugglers. He even constructed a cortosis-resistant lightsaber."}, {"tag": "p", "text": "During this time, Suvam scavenged a number of valuable objects, most notably the legendary crystal artifacts Heart of the Guardian and Mantle of the Force, which may have been later used by the reformed Revan in his hunt to find the Star Forge."}, {"tag": "p", "text": "Years later, as the low-quality Yavin Station began to crumble, Suvam hid several of his most prized possessions on locations on the three habitable moons of Yavin. He intended to send a data crystal containing information of where to find these to his only son on Rodia. However, just as the freighter carrying the data crystal undocked, Yavin Station exploded. The blast propelled it into the asteroid moon Yavin 22, where Suvam's remains were found millennia later by a descendant of his named Suz Tanwa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}