{"url": "Svivren/Legends", "categories": ["Category:Legends articles", "Category:Galactic Alliance Remnant planets", "Category:Svivren locations", "Category:Svivreni sector planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Svivren"}, {"tag": "p", "text": "Svivren was a mountainous Outer Rim Territories planet not far from Andasala. It was at the terminus of the Five Veils Route, which connected it to Suarbi. Despite the harsh climate of the world and its severe seasonal variation, the native Svivreni thrived and made it an important regional trading port. Its population of more than eight billion included large colonies of Humans, Sullustans and Ewoks. The source of Svivren's Ewok population was unknown. The importance of trade was reflected in the planet's Festival of Great Trade."}, {"tag": "p", "text": "Svivreni law forbid the presence of personal weapons, and any violent acts resulted in an immediate public execution. Well-armed security forces enforced these harsh codes effectively. The planet had a low crime rate and was avoided by smugglers."}, {"tag": "p", "text": "The planet was divided into a northern and a southern district. The northern district was experiencing an anti-Imperial rebellion as of 4 ABY. The southern district as a result had fewer troops and of less quality. The southern garrison was commanded by High General Touno, who resided in the southern district's capital of Wrils."}, {"tag": "p", "text": "The planet was directly represented in the Galactic Senate."}, {"tag": "p", "text": "Svivren remained completely neutral during the Galactic Civil War and resisted any Imperial attempts to occupy the planet. During the Thrawn campaign, Imperial forces attacked Svivren but were repelled."}, {"tag": "p", "text": "The planet was home to the Svivren Xenomineralogy Institute, which graduated fine mining foremen and metallurgists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}