{"url": "Suu_Lawquane/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Suu Lawquane"}, {"tag": "p", "text": "Suu Lawquane was a female Twi'lek who lived during the waning years of the Galactic Republic. Prior to the Clone Wars, Suu gave birth to two children, a girl named Shaeeah and a boy named Jek. By the second year of the galactic conflict, Suu married Cut Lawquane, a clone trooper who had deserted the Grand Army of the Republic. Cut adopted Suu's children, and together the four of them lived on and maintained a farm on the Outer Rim world of Saleucami. The war eventually turned Saleucami into a battlefield, and during a hunt for the Confederacy of Independent Systems General Grievous on the planet's surface, several clone troopers requested that they be allowed to use Suu's home to tend to their wounded captain, CT-7567, known as \"Rex\"."}, {"tag": "p", "text": "Suu agreed and allowed for the captain to bunk in the farm's barn. Upon discovering that Suu's husband was a deserter, the captain stated his intentions to report Cut to Republic officials. Despite the tension between the two men, CT-7567 spent time with the family and came to respect Lawquane for his devotion to his wife and children. The two clones later worked together to defend Suu, Jek, and Shaeeah when the farm's homestead came under attack from BX-series droid commandos. After the incident, the captain told Suu that he did not plan to report Cut's desertion to the Army, and left the Twi'lek and her family in peace."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Family life"}, {"tag": "p", "text": "Suu Lawquane was a female Twi'lek native of the Outer Rim world Saleucami who lived during the latter years of the Old Republic. Around the time of the Separatist Crisis, Suu conceived two children with a Human male. She first gave birth to a daughter, Shaeeah, and a year later, a son named Jek. Their father eventually moved out of Suu's life, leaving her with the challenge of raising two children alone. Following the onset of the galaxy-wide Clone Wars between the Republic and the Confederacy of Independent Systems, Suu met the Human Cut Lawquane, a clone trooper who had deserted the Grand Army of the Republic shortly after the Battle of Geonosis and had been avoiding detection by Republic officials ever since. Seeing that he was a kind man searching for a family to protect, Suu fell in love with and married the deserter, allowing him to become Jek and Shaeeah's adoptive father. The new family lived together on Saleucami, where Suu and Cut owned and operated a farm."}, {"tag": "p", "text": "Located on one of the few wetlands found on the otherwise arid desert world, the farm homestead was a ramshackle cobbled together from wood, scavenged starship parts, and other materials, but nevertheless served as the Lawquane family home. Together with her husband, Suu skillfully tended to the farm and watched over her children, all while enjoying the quiet peace offered by Saleucami's relative isolation from the war. Following their first harvest in 21 BBY, Cut left the family homestead to deliver the season's yield. While he was away, the war came to Saleucami, as the Republic's hunt for the Supreme Commander of the Confederacy of Independent Systems, General Grievous, had led them to the planet. Following an engagement in orbit, Grievous and his battle droids landed on Saleucami in scattered escape pods, with the Grand Army of the Republic in pursuit."}, {"tag": "h3", "text": "The captain's visit"}, {"tag": "p", "text": "During the Republic's search for the Confederate General, Suu observed a squad of three clone troopers approaching her homestead on BARC speeders. Wary of their intentions, the Twi'lek emerged from her house with her antique Twi'lek hunting rifle trained on the soldiers. One of the troopers, nicknamed \"Jesse,\" explained to Suu that their captain had been severely injured during their pursuit of Grievous and required a place to rest and mend overnight. She initially refused the men aid, but after learning they had their own medic, she allowed for them to take their captain to her eopie barn. Before the squad took their leave for the barn, Suu was interrupted by Jek and Shaeeah, who were curious about the troopers. Ushering her children back inside, Suu asked them to stay within the house while she took food to the troopers. She walked in on the three men arguing with their revived captain, CT-7567, nicknamed \"Rex,\" over their next course of action. The clones broke off from their conversation as Jesse gratefully accepted Suu's offering of food. As the Twi'lek inquired as to whether the soldiers would require anything more, she was again interrupted by Shaeeah, who had chased a hovering play ball into the barn. Suu reprimanded Shaeeah for leaving the house, but her daughter stayed long enough to comment on the similarities in appearance between Rex and her father."}, {"tag": "p", "text": "Suu returned to her house with her children, and the three troopers left their captain in the barn to rest while they continued the search for Grievous. After night fell on Saleucami, Cut returned home from his delivery of the harvest. Before stopping in the house to greet his wife and kids, Lawquane confronted Rex in the barn, and the two men exchanged harsh words regarding the farmer's defection from the Grand Army. Noticing the commotion in the barn, Suu, Jek, and Shaeeah rushed outside to greet Lawquane. Suu explained to her husband why she offered the captain assistance, and her decision was agreed upon by Cut, who firmly believed that his family should always help those in need. With a bit of encouragement from Jek and Shaeeah, Rex agreed to have dinner with Suu and her family. Over their meal of roast nuna, Suu watched as Rex and Cut argued over the war and the meaning of individualism in an army of clones. Despite the debate, Rex still intended to fulfill his standing orders to report any deserters from the Army, pursuant to Republic protocol."}, {"tag": "p", "text": "After dinner, Suu read a datapad with her children while the captain and her husband played dejarik and discussed Cut's desertion. With their parent's permission, Jek and Shaeeah left the house to play in the fields, and while there, the two discovered and inadvertently activated an escape pod that had fallen onto the Lawquane farm during the battle in orbit. The pod's activation powered up a platoon of Confederate battle droids that had been stored within the vessel. Hearing her children's screams, Suu rushed out of her house to ensure that they were safe. The two informed Suu and Cut that they were being chased by \"monsters,\" which the clone deserter identified as BX-series droid commandos. Understanding the danger that his family was in, Cut ordered that Suu take Jek and Shaeeah to the upper floor of their home while he and Rex prepared to defend the homestead from the approaching droids. At the farmer's request, the injured Rex joined Suu and the children upstairs to act as their last line of defense. On the floor below, Suu's husband destroyed many battle droids before being overwhelmed by their greater numbers. With Cut temporarily incapacitated, the droids made their way upstairs, where Suu and the children hid with Rex. The captain destroyed the advancing droids, saving Suu and the children. Despite sustaining several injuries during the incident, both Suu's husband and Rex survived."}, {"tag": "p", "text": "The following morning, Rex prepared to leave the farm and rejoin his forces. The family provided him with an eopie for transport and watched as he loaded his gear onto his mount. Before the clone departed, Suu asked him if he was still planning on reporting her husband to Republic authorities. Although Rex admitted it was his duty to do so, he suggested that his injuries would cause him to forget the whole encounter. Suu thanked Rex for his discretion and embraced her husband as she and her family watched the soldier ride away from the farm."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Suu was a blue-eyed, pink-skinned Twi'lek with graphic designs tattooed on her upper arms and lekku. She was a strong-willed and aggressive woman, although she was greatly compassionate toward those in need. Ready and willing to defend herself and her home from would-be trespassers, Suu took up arms when confronting the clones in search of shelter. Despite the clones' assurances that their intentions were entirely peaceful, the Twi'lek was still cautious of the men and initially refused them assistance. Her aggression was eventually overcome by her compassion for those in need of aid, a trait she shared with her husband. During their stay in the barn, the soldiers found Suu to be a gracious host, as she provided them with food without being asked and offered any further assistance that they may have required."}, {"tag": "p", "text": "Because their father had moved out of their life, Suu was forced to raise Jek and Shaeeah without any assistance during their early childhood. She did her best to protect and teach her children, but was nevertheless grateful for the help offered by Cut Lawquane. Despite becoming visibly frustrated by them from time to time, Suu cared very deeply for the well-being of her son and daughter. Suu was reading with her children before the attack on the homestead, during which she rushed out of the house to make sure that Jek and Shaeeah were safe. While her husband was engaged in battle with the droids, Suu remained with the younglings, keeping them safe in hiding upstairs."}, {"tag": "p", "text": "Suu's attraction to Cut was based in the fact that she believed he would do anything to protect his adoptive children. She answered his search for a family by welcoming the clone into her own, and together the two intended to live a peaceful life away from the Clone Wars. When she married Cut, she knew that the man had once been a soldier in the Republic's Grand Army but hoped that the roles he had played in the past would be left there, and that she and her family could live in peace away from the war. Thus, she was deeply concerned for her husband while Rex was on the farm, worrying that the clone captain would follow his duty and report Cut to Republic authorities. Suu was relieved when Rex ultimately indicated that he would keep the family's secret."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Suu Lawquane's first and only canonical appearance to date is in the tenth episode of the second season of the Star Wars: The Clone Wars television series. The episode, titled \"The Deserter,\" featured Canadian voice actress Cara Pifko as the voice of Suu. Like most Twi'leks in The Clone Wars, Suu was fitted with a French accent that Pifko accomplished by using the French-Canadian accent she developed while in theater school."}, {"tag": "p", "text": "Suu was initially identified by only her first name—both the \"The Deserter\" and the online episode guide only assigned the surname \"Lawquane\" to Cut. It wasn't until the release of Star Wars: The Clone Wars Character Encyclopedia that the name was also applied to Suu, Jek, and Shaeeah."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}