{"url": "Suubatar", "categories": ["Category:Legends articles", "Category:Creatures of Ansion", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Mammals", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Suubatar"}, {"tag": "p", "text": "Suubatars were majestic riding beasts native to the rolling plains of Ansion. They were six meters tall, with protruding lavender eyes speckled with silver. The suubatar's smooth, tapered skull hinted that it was a creature of impressive speed. Suubatars pumped their six muscular legs when in full gait, gripping the grasslands with their long splayed toes, and launching themselves across the prairies in a speedy, yet smooth, run. At the command \"Elup!\" they arose to launch into their gallop, raising one set of legs at a time: the front, middle, and finally rear. Each of their six feet had six toes, and they were exceptional swimmers."}, {"tag": "p", "text": "The suubatar body was long and narrow, ending in a lean, leg-length tail. They were covered in a coat of short, soft, and dense bronze-colored fur striped with distinctive patterns of green, providing excellent camouflage on the Ansonian plains. They had a single nostril, no mane, and their ears lay flat along their head. Suubatars had a superb 25kz range of sound."}, {"tag": "p", "text": "Suubatars were omnivores, with their massive jaws hinged to allow the swallowing of large fruit and small prey whole. Four canine teeth protruded above and below the jaw, giving them a fearsome appearance—which was a deceptive illusion, for the domesticated suubatar was ever gentle and patient when treated in kind. Suubatar riders sat in leather viann supports that elevated the driver above the suubatar's spinal ridge."}, {"tag": "p", "text": "Suubatars had long been domesticated and were typically reserved for the Alwari Highborn. To ride a suubatar was to mark oneself as being important and with good taste among the Alwari. These handsome, magnificent beasts were thus highly valued and expensive to purchase."}, {"tag": "p", "text": "In 22 BBY, a Jedi team consisting of Masters Luminara Unduli and Obi-Wan Kenobi, and their Padawans Barriss Offee and Anakin Skywalker, secured six purebred suubatars for themselves and their Alwari guides while on their mission to settle a planetary border dispute and to convince all parties involved to resist all efforts at secession and to vote to remain within the Galactic Republic. The Jedi, who had bartered for the beasts, that they might carry them overland across the prairies in their search for the ruling tribal overclans, were astonished at the speed, beauty, and smooth gait of their splendid, towering mounts."}, {"tag": "p", "text": "Though it was said that no suubatar could outrun an airtruck, the agile creatures could certainly outmaneuver one: attempting to corner an Alwari mounted on a good suubatar, went the saying, was a good way to die."}, {"tag": "p", "text": "Wild, undomesticated suubatars were known to attack and destroy entire caravans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}