{"url": "Swamptrooper_armor", "categories": ["Category:Legends articles", "Category:Stormtrooper armor"], "nodes": [{"tag": "h1", "text": "Swamptrooper armor"}, {"tag": "p", "text": "Swamptrooper armor was a modified variant of stormtrooper armor used by swamp troopers. It was adapted with additional sealants and environmental units for use on wetland environments."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The armor came in two models."}, {"tag": "p", "text": "The first model bore several similarities to the Scout trooper armor, or more commonly the Scout trooper variant of the Imperial Forest Camouflage Armor, save for it being primarily colored green instead of white, as well as possessing gray knee armor. This type was used during a battle against several Gungans on Naboo."}, {"tag": "p", "text": "The second model had several similarities to the first model, although it was more streamlined, with the line visor being replaced with goggle-shaped visors, a black utility belt, pelvis armor, as well as possessing leg and arm armor. They also bore some red stripes. The helmet also has a mouthpiece similar to the second model. This armor saw use during the assault on the Jedi praxium on Yavin 4."}, {"tag": "p", "text": "Regardless of the model, all the armors were tinted green in order to aid in camouflage in forested wetlands and various battle theaters located in swamps, lakes, rivers, and other waterways where settlements cluster on habitable planets. The armor was also modified to incorporate environmental sealants to keep out various biological perils thriving in swamp environments (such as colonies of toxic bacteria, swarms of stinging insects, amphibious carnivores, and others). The helmets of the various models are also fitted with rebreathers to filter in breathable oxygen and allow them to operate for a limited time underwater. The hemlets' lenses featured multi-pectrum view-finders and terrain-mapping software."}, {"tag": "p", "text": "Weaponry included Golan Arms FC-1 flechette launchers for the standard troops, Imperial Heavy Repeaters for squad leaders, and equipment included a survival kit packed with an emergency float and a serrated vibroknife."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}