{"url": "Swamp_pickle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fruits and vegetables", "Category:Plants of Endor"], "nodes": [{"tag": "h1", "text": "Swamp pickle"}, {"tag": "p", "text": "Swamp pickles were plants native to the Forest Moon of Endor. While creatures like the moon's native Ewoks found the pickles repulsive, they were adored by the Kagles, who purchased several of them from the trader Mooth in 3 ABY after receiving some from the Ewoks Wicket W. Warrick and Teebo, who were trading them for Mooth."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Curving and cylindrical, the Endor moon's swamp pickle was pink in color, and had a green stem on one end and long, brown protrusions on the other. They also had a distinctive taste and a strong odor, which was strong enough to kill insects. The pickles were despised by the moon's native Ewoks, but relished by the Kagles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kagles of Endor enjoyed eating swamp pickles and frequently purchased them from the trader Mooth. In 3 ABY, when Mooth fell ill with a cold, he tasked the Ewoks Wicket W. Warrick, Teebo, Latara, and Kneesaa with trading his belongings until he felt well enough to do so himself. In return, Mooth would grant the Ewok who could trade the most a pair of Eodon tusks. Warrick and Teebo journeyed to the home of the Kagles and offered to sell them some swamp pickles. In order to demonstrate their quality, Warrick ordered Teebo to consume one of them; Teebo, holding his nose to avoid the pickle's terrible smell, begrudgingly acquiesced, and subsequently fainted from the plant's taste. However, the Kagles assured Warrick that no convincing was in order, as they had a strong fondness for the pickles. The Kagles took several jars of them but informed Warrick that they had nothing to trade at the time. Later, however, the Kagles went to Mooth's trading post and offered the trader their family cold cure in exchange for more of the pickles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The swamp pickle makes its first appearance in \"Hard Sell,\" the eleventh episode of the second season of the Ewoks television series. \"Hard Sell,\" written by Michael Reaves and directed by Raymond Jafelice, originally aired on October 25, 1986.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}