{"url": "Battle_of_Cathar", "categories": ["Category:Legends articles", "Category:Battles in the Quelii sector", "Category:Battles of the Mandalorian Wars", "Category:Cathar culture", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Battle of Cathar"}, {"tag": "p", "text": "The Battle of Cathar was the second battle of the Mandalorian Wars before the Mandalorians invaded the Galactic Republic, as the Mandalorian Neo-Crusaders under the leadership of Mandalore the Ultimate conquered worlds just outside of the Republic space. It resulted in the virtual extinction of the Cathar species. It would later be the event that resulted in Revan's Jedi faction joining the war."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "During the Great Sith War, the Mandalorians, led by Mandalore the Indomitable, sided with the Sith, led by Exar Kun and Ulic Qel-Droma. The Mandalorians ravaged many worlds under Qel-Droma's command. But the Cathar species were able to stand against the Mandalorians, and aided the Republic and Jedi in repulsing the Sith and Mandalorians. By the war's end, the Mandalorian numbers had been severely reduced."}, {"tag": "p", "text": "Mandalore the Ultimate, Mandalore the Indomitable's successor, rebuilt the Mandalorians by not just reuniting the surviving Taungs, but opening membership to other species. Under his leadership, the Mandalorians became stronger. When the Sith suggested they invade the Republic, saying it would be a battle that would be remembered forever, the Mandalorians eagerly agreed."}, {"tag": "p", "text": "To prepare for their invasion of the Republic, the Mandalorians began conquering planets outside Republic space. Meanwhile, the Mandalorians remembered the dishonor they had suffered at the hands of the Cathar during the war with Exar Kun. Because of this grudge, Cathar became one of their earliest targets. Cassus Fett, Mandalore's prime strategist, was assigned to lead the attack."}, {"tag": "h3", "text": "Battle"}, {"tag": "p", "text": "The Mandalorians' attack caught the Cathar people completely off guard. Their military forces converged from space, bombarding the surface, first destroying all interstellar communications relays and orbital spacedock facilities, and then descending to the surface and slaughtering most of the planetary population while they slept or as they fled. Cassus Fett's Basilisk war-mounts decimated the more primitive Cathar settlements."}, {"tag": "p", "text": "However, because they had stood against the Mandalorians in the past, the Cathar realized why they'd truly been targeted, and that there would be no mercy for their species or their world in the end. And because the Cathar were not members of the Galactic Republic, they were left to fend completely for themselves. Near the end of the battle, Cassus herded the surviving Cathar into the ocean and ordered that they be killed. One Mandalorian objected, saying the Cathar had already been defeated. But Cassus said the battle was about revenge, and he intended to kill all Cathar on the planet. He then gave the order to have the remaining Cathar killed, and the Mandalorian who objected died with them."}, {"tag": "p", "text": "The final act of the Cathar race was to pack the last able-bodied survivors who were able to withstand spaceflight into what few ships remained, sending them off into the void as quickly as possible. Juhani's family escaped aboard one of these refugee flights, and landed on Taris. The Cathar species itself, though, was nearly rendered extinct as a consequence of the genocide of Cathar."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Mandalorians didn't stop their conquest with Cathar. They continued to conquer systems outside Republic space and eventually invaded the Republic itself. The Mandalorian's smashed the Republic military in numerous battles and were on the verge of completely conquering the Republic. The Jedi Order, however, refused to enter the war because the Jedi Council thought there was an unseen threat that was more dangerous than the Mandalorians."}, {"tag": "p", "text": "This changed in 3963 BBY. The Revanchists, a group of Jedi who wanted to defend the Republic in the war, came to Cathar to find proof of the Mandalorians' atrocities. The Jedi Council, which had recently dealt with another rogue Jedi faction, sent a team of loyal Jedi, led by Council member Vrook Lamar, to confront them and order them to disband. Soon after that, the Revanchists' leader found a discarded Mandalorian mask. After this discovery, all the Jedi present then received a vision of the battle, proving the Mandalorians had virtually wiped out the Cathar. Outraged at what he had seen, the Revanchists' leader, who took the name Revan, swore he wouldn't rest until the Mandalorians had been defeated. The knowledge of the battle proved to be the catalyst that convinced many Jedi to join Revan. The Council, meanwhile, sanctioned the Revanchists' actions, but still discouraged other Jedi from joining them."}, {"tag": "p", "text": "After the end of the Mandalorian Wars, Cathar began to resettle their world and by the time of the Galactic Civil War, it had fully recovered from the damage the Mandalorians had done."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}