{"url": "Swarm-class_battle_droid", "categories": ["Category:Legends articles", "Category:Droid starfighter classes", "Category:Ssi-ruuvi starship classes"], "nodes": [{"tag": "h1", "text": "Swarm-class battle droid"}, {"tag": "p", "text": "The Swarm-class battle droid was the Ssi-Ruuk equivalent to a starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Swarm-class droids were about two meters long, making them some of the smallest known starfighters. Because of their size and low production costs, Ssi-Ruuk vessels could carry hundreds of them into battle—at least 1,500 were present at the first Ssi-Ruuvi invasion of Bakura in 4 ABY."}, {"tag": "p", "text": "They were tetrahedral and armed with four laser cannons, one at each vertex. These laser cannons could be turned through 360 degrees, giving the droid a wide field of fire, including the ability to fire backwards when chased."}, {"tag": "p", "text": "Powered by entechment—which utilized the drained life sources of sentient beings usually P'w'ecks and occasionally even Humans—each droid used two life-forces. One operated the shields while the other piloted the fighter and operated the laser cannons and sensors. The life-forces in the battle droids received their commands from the Ssi-Ruuk command vessels via sensor arrays located on thrusters on each side of the vehicle."}, {"tag": "p", "text": "Though they had fairly fragile hulls, the shield system had a unique ability to absorb and redirect incoming energy, similar to the Vangaard Pathfinder. The fusion thrust technology they employed was somewhat less advanced than equivalent Imperial systems and was more easily detected on sensors than many other fighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The biological origin of the life-forces employed in the power and control systems meant that the droids could be considered a type of cyborg rather than a true battle droid. Their strange marriage of technology with biology was believed to have inspired the later Shadow Droids designed by Umak Leth and the reborn Emperor Palpatine."}, {"tag": "p", "text": "During the Invasion of Bakura in 4 ABY, the fighter type was first encountered by both Imperial and Rebel Alliance forces. In large numbers against inferior numbers of foes, the fighters proved devastating. However, they were easily destroyed individually as Imperial, Alliance and Chiss Ascendancy pilots would discover."}, {"tag": "p", "text": "Swarm-class battle droids remained in use as late as the Yuuzhan Vong War. By that time, the entechment process had been enhanced to even sustain the life forces and the basic technological systems had been improved with reverse-engineered technology from other galactic civilizations, but the droids were still operated by captured life-forces."}, {"tag": "p", "text": "Swarms of P'w'eck-piloted battle droids were used during a second attempted invasion of Bakura in 28 ABY. During the battle, the fighters were equipped with tractor beam projectors which were used to capture Alliance and Bakuran pilots. However, the battle droids later revolted against their Ssi-ruuvi masters and joined forces with the Alliance and Bakurans following the death of the Keeramak at the hands of P'w'eck Emancipation Movement leader Lwothin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}