{"url": "Battle_of_Cato_Neimoidia_(Order_66)", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battles of Cato Neimoidia", "Category:Battles of the Clone Wars", "Category:Battles of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "Battle of Cato Neimoidia  (Order 66)"}, {"tag": "p", "text": "A battle took place on Cato Neimoidia during the end of the Clone Wars, in 19 BBY."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Despite the efforts of Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, the CIS forces on Cato Neimoidia were not defeated."}, {"tag": "p", "text": "Jedi Master Plo Koon, along with his clone pilots, was tasked with the mission to patrol the skies of the Neimoidian purse-world in his Delta-7 Aethersprite starfighter. The Kel Dor Jedi patrolled the skies of the Separatist stronghold, on the lookout for any enemy fighters."}, {"tag": "p", "text": "On the bridges of the planet, the Republic UT-ATs, AT-APs and clone troopers fought against the Separatist droid forces to find a way into the cities."}, {"tag": "p", "text": "Meanwhile, a fleet of Venator-class Star Destroyers arrived at the planet. One of the ships was boarded by battle droids. X2, one of the clone troopers aboard the ship, was deployed with a contingent to clear the hangar bays of the battle droids, and then to man an orbital strike cannon to bombard the Separatist defenses on the planet. Afterwards, he boarded an ARC-170 starfighter and then participated on the ground assault on the planet."}, {"tag": "p", "text": "Upon clearing the ground of tank droids for landing, X2 was supplied with a sniper rifle by Jedi Master Ferroda so he could supply cover fire for the troopers led by X1 as they advanced on the citadel of Trade Federation Viceroy Nute Gunray. He also destroyed an ion cannon's controls to prevent it from being used against the clone forces. This action also caused Ferroda to sense his Force potential and promised to allow the Jedi High Council to see him regarding it after the war was over. X2 then infiltrated the palace and, under his brother X1's orders, shut down the droid control terminal, thus shutting down all CIS droids on the planet."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "Flying near one of these bridges, Koon was unaware what happened in the ARC-170 starfighter behind him. The Clone Captain Jag was contacted by Supreme Chancellor Palpatine who ordered him to execute Order 66. Without hesitating, Jag pulled back a little in his fighter from the Jedi General and he fired his laser cannons. The Jedi Master' starfighter was hit and it exploded in mid-air, killing him. What remained of the fighter crashed into a building on the bridge-city, the explosion killing troops at a clone staging area."}, {"tag": "p", "text": "Newly arrived from Coruscant, X1 and X2 were under the command of Master Ferroda. Once Order 66 was issued, X1 convinced X2 to strike down Ferroda. Horrified by what he had done, X2 turned his back on the newly formed Galactic Empire and fled to Dantooine."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Republic-turned-Empire had won the planet after the battle droids of the Confederacy were deactivated. The Emperor himself made law that surviving Neimoidian outcasts on the planet would be taken prisoner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle is covered in the game Star Wars Battlefront: Elite Squadron. The events concerning X1 and X2 use the PSP version as the basis. In the DS version, the game claims that months passed between the Battle of Coruscant when in fact far less time had passed. The DS version has X2 also destroying three power supplies for a force field around the planet prior to joining the ground battle."}, {"tag": "p", "text": "Originally, Star Wars: The Official Starships & Vehicles Collection 66 named the event as the Second Battle of Cato Neimoidia. However, the Star Wars: The Clone Wars television series episode \"Sabotage\" depicted another battle prior to the first two that had been previously depicted in Labyrinth of Evil and Revenge of the Sith, respectively. Until official word is provided to resolve the discrepancy regarding the \"Second Battle of Cato Neimoidia,\" this article assumes that the Revenge of the Sith battle's name is currently conjecture."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}