{"url": "Battle_of_Cato_Neimoidia", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of Cato Neimoidia", "Category:Battles of the Outer Rim Sieges"], "nodes": [{"tag": "h1", "text": "Battle of Cato Neimoidia"}, {"tag": "p", "text": "The Battle of Cato Neimoidia, also known as the capture of Cato Neimoidia, was one of the final battles of the Clone Wars, in which Jedi General Plo Koon led the Grand Army of the Republic's 442nd Siege Battalion against the Confederacy of Independent Systems for control of the Neimoidian purse-world of Cato Neimoidia, headquarters of the Trade Federation. The Galactic Republic captured the planet in the final hours of the conflict. While conducting a post-battle patrol flight over a bridge city, Koon was killed by his clone wingmen when Supreme Chancellor Sheev Palpatine enacted Order 66."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the final year of the Clone Wars, the Neimoidian purse-world of Cato Neimoidia, homeworld of Separatist Council member Nute Gunray and headquarters of the Trade Federation, was invaded by the Confederacy of Independent Systems. Though Jedi General Anakin Skywalker and Commander Ahsoka Tano led the Grand Army of the Republic's 501st Legion into battle against the Separatist, they were recalled to Coruscant after the Jedi Temple was bombed, but the battle still ended with a Confederate defeat. Nevertheless, Cato Neimoidia would later fall under Separatist control."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the Outer Rim Sieges in the final days of the Clone Wars, the capitulation of Cato Neimoidia was identified as a prime strategic goal that would help to end the conflict. The Jedi Council dispatched Jedi Master Plo Koon to Cato Neimoidia to lead the 442nd Siege Battalion, proficient in besieging enemy fortifications, against the Trade Federation stronghold. At one point, CC-2237 \"Odd Ball\" flew alongside Koon on Cato Neimoidia. Around the time of the Battle of Yerbana, Koon led starfighters against a trio of Separatist Providence-class Dreadnoughts and droid tri-fighters. Additionally, Clone Flight Squad Seven participated in the battle. The Republic eventually captured Cato Neimoidia in the final hours of the Clone Wars."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Not long after the Republic victory, while flying near a bridge city on a patrol flight, Koon was unaware what was happening in the ARC-170 starfighter behind him, piloted by Captain CT-55/11-9009 \"Jag.\" The clone trooper pilot was contacted by Supreme Chancellor Sheev Palpatine, who ordered him to execute Order 66. Without hesitation, Jag adjusted his fighter and opened fire on Koon. The Jedi Master's Delta-7 Aethersprite-class light interceptor was hit and exploded in mid-air, killing him immediately. What remained of the fighter crashed into a building on the bridge city."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}