{"url": "Swoop/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Culture of Tatooine", "Category:Swoops", "Category:Tarisian culture"], "nodes": [{"tag": "h1", "text": "Swoop"}, {"tag": "p", "text": "A swoop, also known as a swoop bike, was a type of repulsorlift vehicle similar to a speeder bike; in fact, it was in essence simply an overpowered version and described as \"an engine with a seat.\" Swoops were to speeder bikes what airspeeders were to landspeeders. Swoops were often used by gangs and criminals, and such organizations bore the mantle of swoop gang. After the Galactic Empire outlawed podracing, swoop racing became the favored alternative. Swoop racing was popular on many planets, including Coruscant, Manaan, Onderon, Tatooine, Nar Shaddaa, Telos (on Citadel Station), and Taris. There were, in fact, grand tournaments held on the Taris tracks before the Sith bombardment. Some of the best-known swoop racers of their time were lost in the planet's destruction."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Swoops were capable of traveling at over six hundred kilometers per hour. While some could travel several hundred kilometers above a planet's surface, they generally kept a low altitude. Due to their power and difficult controls, they had many flaps and control vanes to aid in controlling the vehicle, but due to the unpredictable nature of swoops, few used them. Turbothrusters could also be used on them to improve their top speeds."}, {"tag": "p", "text": "Prior to and during the Mandalorian Wars and Jedi Civil War, some of the earliest swoop bikes could be found on Taris. Archaeologists theorize that swoop racing originated on Taris, though given the near-total destruction of the planet's surface, this is difficult to prove. Lhosan Industries, which conducted business on Taris during this time, was referred to as \"the birthplace of the swoop bike.\" In any case, Taris was the hub of swoop racing during the time of the Jedi Civil War, and its destruction was a severe blow to the circuit. Nevertheless, swoop-bike racing survived on such planets as Tatooine, Manaan, Telos IV, Onderon, and the moon Nar Shaddaa."}, {"tag": "p", "text": "During the Clone Wars, the Grand Army of the Republic used the CK-6 swoop bike in combat during the Battle of Orto Plutonia and for transportation during the Battle of Khorm. The Separatist Droid Army also utilized swoops in the Clone Wars, deploying swoop-mounted IG lancer combat droids in the Battle of Muunilinst."}, {"tag": "p", "text": "The planet Zonju V was once plagued by swoop mercenaries. In 14 ABY, when Jaden Korr went there to meet up with a spaceport worker, he had to be faster than the local mercenary gangsters to get to a safe outpost and get out alive."}, {"tag": "p", "text": "Many racing swoop bikes had their brakes removed to reduce weight, thus making the swoop bike faster. They also had deflector shields to protect them against impact. However, due to high speeds, many riders were thrown off and killed upon crashing into an object. Swoops are not to be mistaken for speeder bikes."}, {"tag": "p", "text": "Swoops were widely used to travel by land in the area of Bartyn's Landing, on the planet Lamaredd, in the five centuries after its initial settlement. A prosperous local business was Ackrahbala's Swoops & Speeders, and illegal swoop Cargo Track races were regularly held. The police used swoops to travel through the coastline."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}