{"url": "Swoop_Racers", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Swoop Racers"}, {"tag": "p", "text": "\"Swoop Racers\" is a comic story that was published as the lead story of Star Wars Adventures 21 on May 8, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Solo's idea"}, {"tag": "p", "text": "Over the planet Rion, Han Solo, Chewbacca, and Luke Skywalker were preparing for a mission to the planet. Over a hologram Princess Leia Organa told them to find the supplies that the Alliance to Restore the Republic needed to with the war with the Galactic Empire. She put Skywalker incharge of the mission, not trusting Solo."}, {"tag": "p", "text": "When they landed on the planet, Solo noticed an advertisement for a swoop race that he wanted to participate in. There was a large sum of prize money and Solo believed that it was just as important as the supplies they were getting. But Skywalker would not allow him to enter the race so Solo decided to stay back on the Millennium Falcon. On the Falcon, Solo told Chewbacca about his intent to borrow credits and enter the swoop race."}, {"tag": "p", "text": "Shortly after, Solo got his hands on a swoop and started to trash talk the other racers. One of the individuals he trash talked, Kuru was a bounty hunter. Kuru went over to his partner, Glunge who discovered that the Empire has a bounty for Solo."}, {"tag": "h3", "text": "The race"}, {"tag": "p", "text": "Meanwhile, Skywalker secured a deal with Razian for supplies. But when Razian went to the Falcon to collect his credits, half of them were gone. Skywalker contacted Solo to ask where the credits where. Solo had used them to enter the swoop race which was about to begin."}, {"tag": "p", "text": "The racers lined up at the starting line. Kuru wished Solo good luck but Solo asked how he knew who he was. The announcer told the racers to start their engines. The announcer started to countdown and on \"go\" the racers soared off. Skywalker, who was in the audience, was livid that Solo entered the race. But he stopped when he overheard the bounty hunter, Takvax start his plan to capture Solo. Through his comlink he told Kuru, who was racing, to get Solo to the medicenter where they will capture him."}, {"tag": "p", "text": "Kuru intentionally knocked into Solo with his swoop but he repelled it. But then another swoop racer, Makta slammed into Solo's swoop bike but Solo dispatched of her. Chewbacca then picked up Takvax and Skywalker wanted to know what was going on. At the race, Kuru used a Turbo-booster to race in front of Solo which was cheating."}, {"tag": "h3", "text": "The winner"}, {"tag": "p", "text": "On a roof nearby, Glunge his sniper rifle at Solo but Skywalker stopped him by destroying the rifle with his lightsaber. Skywalker then cheered on Solo as he and Kuru neared the finish line. Kuru fired his Thermite micro-missiles at Solo. Skywalker quickly moved into action. He stole Glunge's swoop bike and raced onto the track. He launched the swoop bike at the missiles while he leaped onto Solo's swoop bike. Solo and Skywalker raced towards the finish and barely beat Kuru."}, {"tag": "p", "text": "Solo won the trophy but before Solo could grab it, Luke used The Force to give it to Razian instead. The trophy would compensate for the lost credits and they promised to not tell Princess Organa of their mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}