{"url": "Swilla_Corey", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Farmers", "Category:Females", "Category:Humans", "Category:Slaves", "Category:Tatooinians", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Swilla Corey"}, {"tag": "p", "text": "Swilla Corey was a female Human jerba tender and pickpocket who lived on the planet of Tatooine. Born a slave, she was liberated by raiding Karazak slavers while her master was visiting Tatooine. She decided to make a new life for herself on the desert planet, and continued doing what she had done as a slave: tended to animals. She found limited amounts of work at local ranches, and was able to make ends meet."}, {"tag": "p", "text": "Her success came to an end, however, when her jerba herd was scattered by a sandstorm. Financially ruined, Corey moved to Mos Eisley, and became a pickpocket. Eventually, she passed on her skills to initiates in the art of thievery. One day, she spotted one of her jerbas outside Chalmun's Cantina, and investigated. She discovered that the alien Ketwol had chanced upon it, as it had wandered out of the desert. The Pacithhip helped her rebuild her jerba herd, allowing Corey to return to her former home."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born into a life of slavery, the Human female Swilla Corey worked as an animal hand under a Tarnab merchant, gaining experience and knowledge. While in orbit above Tatooine, the merchant was attacked by Karazak slavers. Corey was able to escape to the planet surface unharmed, and, with her newfound freedom, she decided to use her skills with animals to forge a new life for herself."}, {"tag": "p", "text": "Working on a jerba ranch near the Motesta Oasis, Corey set up residence in an abandoned hut nearby. She would travel the countryside, through farming communities, trading jerba leather, milk, and meat. Though she was never financially secure, Corey was satisfied with just reveling in her freedom—a stark contrast from her upbringing in slavery."}, {"tag": "h3", "text": "Disaster strikes"}, {"tag": "p", "text": "Corey's entire jerba herd was scattered during a sandstorm, and the added antagonism of a wild anooba pack did not help. With no assets whatsoever, Corey abandoned her hut, and moved to Mos Eisley. There, she was forced to resort to petty thievery and begging. Eventually, she began passing on her robbery skills to other initiates in the craft. One day, she saw her brand on a jerba outside Chalmun's Cantina, and she entered to investigate. Consulting one of her colleagues, the Yam'rii Kitik Keed'kak, she was told that the jerba belonged to a Pacithhip named Ketwol. Seeking answers, she hurried outside in order to wait for Ketwol, just as the Jedi Knight Obi-Wan Kenobi stirred up trouble in the cantina by attacking Ponda Baba and Cornelius Evazan."}, {"tag": "h3", "text": "Meeting Ketwol"}, {"tag": "p", "text": "Tailing the Pacithhip to his starship, the Herd Mother, Corey discovered that Ketwol was using the battered ship as a home. Seeking the right moment, she attempted to steal the jerba, but Ketwol detected the thievery, and stopped her. He explained that the animals had wandered out of the desert towards his ship, and as some of them had been exhausted or wounded, he had cared for them. In turn, Corey told her tale of misfortune, and Ketwol decided to give her shelter. Eventually, Swilla gathered her jerbas and returned to the desert, with the knowledge that she could always return to the hospitality and companionship of Ketwol."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bereft of lofty ambitions, Swilla Corey, upon being freed, was content with just making ends meet. Instead of making her new life a bountiful one, she preferred a simple existence with her jerba herd, as it was probably the only thing she knew how to do well. However, her lack of credits drove her to thievery when she lost her herd. Corey eventually grew proficient in this craft, and was adept at passing her skills onto others. She was also particularly curious, and did not give up the hope of finding her herd after the sandstorm that had scattered it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally appearing in George Lucas' A New Hope and played by an uncredited Mandy Morton, the character that would eventually become \"Swilla Corey\" was simply known as \"Local girl\". Eventually, the character was given the name of \"Swilla Corey\" in the Star Wars Customizable Card Game set, A New Hope Limited, which also established the fact that she was a thief. Close-ups of the character taken from the film were too grainy to be usable on a game card, so artists at Decipher, Inc., makers of the game, scanned and colorized a black and white photograph of the actress found in Lucasfilm Ltd.'s archives. The artists further added lighting effects and details, and then integrated the character image back into the scene. \"Swilla Corey\" is in fact an anagram of Carol Wisely, a Decipher employee. In 2005, Corey's backstory was elaborated on by Tim Veekhoven through the first round of the Hyperspace feature, \"What's The Story?\". Veekhoven initially meant to have Momaw Nadon as the character who aids Corey, but changed it to Ketwol after reading in The Wildlife of Star Wars: A Field Guide that Pacithhip often herded jerbas. The change was made due to the fact that Veekhoven believed that Nadon had already appeared in a plethora of Expanded Universe material, and as jerbas had already been written into his entry, this change seemed natural. Swilla Corey was later given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}