{"url": "Sy_Snootles/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Max Rebo Band members", "Category:Pa'lowicks"], "nodes": [{"tag": "h1", "text": "Sy Snootles"}, {"tag": "p", "text": "Sy Snootles was a female Pa'lowick singer, and was also the lead vocalist for the Max Rebo Band during the time of the Galactic Civil War. Snootles and her associated acts were favorites of the Hutt crime families; during the Clone Wars, in her solo career days, Snootles also acted as a part-time bounty hunter, being responsible for the assassination of Ziro the Hutt, her former lover, on Teth after being hired by Jabba."}, {"tag": "p", "text": "She was a very close friend with dancer Greeata Jendowanian, and did not sign to sing for Max until Greeata's position was secured as well. Snootles also had a great relationship with fellow band member Droopy McCool. One of Snootles' most famous songs was \"Lapti Nek,\" also a favorite of Jabba."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Femme fatale"}, {"tag": "p", "text": "Sy Snootles was a successful singer and performing artist. At one point during the timeframe surrounding the Clone Wars, Sy Snootles had dated and fallen in love with Ziro Desilijic Tiure, a prominent Hutt crime lord. Ziro was imprisoned by the Galactic Republic after a kidnapping plot involving his nephew Jabba's son Rotta; when Ziro was freed from prison, Jabba hired Snootles to steal the Hutt's holopad, as it contained potentially damaging information pertaining to the Hutt crime families."}, {"tag": "p", "text": "Her former lover was being kept in a cell on the Hutt homeworld Nal Hutta. To make her cover convincing, Sy danced for the Hutt Grand Council on Nal Hutta, where she freed Ziro from the captive Hutts by tricking two Gamorrean guards into fighting each other, distracting the others."}, {"tag": "p", "text": "Snootles wanted to have Ziro lead her to the holopad, which was hidden on Teth. Borrowing Ziro's mother's starship, they traveled to Teth, where she found the hidden diary at Ziro's father's gravesite. Snootles felt her job was done and pointed a blaster at Ziro; Ziro pled for his life, but to no avail: Snootles shot and killed the Hutt. She then delivered the diary to Jabba's Palace on Tatooine, where she was paid by Jabba."}, {"tag": "h3", "text": "Musical success"}, {"tag": "p", "text": "Sy Snootles had big dreams of being a successful musician and was determined to see those aspirations realized at all costs. Teaming up with a Letaki singer, multi-instrumentalist and musical impresario named Evar Orbus, she became a singer in his Evar Orbus and His Galactic Jizz-Wailers band. After Orbus's death during an altercation with Figrin D'an and the Modal Nodes on Tatooine, Snootles saw her chance. Renaming the group the Max Rebo Band and persuading the group' amiable keyboardist Max Rebo take over as bandleader (thus providing an obvious target for bounty hunters and rival musicians), Sy planned to control the band safely from behind the scenes. At this time, she also convinced the Kitonak woodwind player Snit to adopt the more striking stage name \"Droopy McCool\" and hired a number of other musicians to fill out the band. Unfortunately for Sy, her ambitions were upset when a booking agent working for Jabba the Hutt approached the more pliable Rebo, who signed the band on to an exclusive contract at Jabba's Palace in exchange for a lifetime supply of free food."}, {"tag": "p", "text": "Always pragmatic, Sy was outraged at the Ortolan's deal and often worked behind the Hutt's back, trying to revoke their arrangement with Jabba. She also worked as a spy amongst Jabba's varied enemies, giving information in exchange for extra credits besides her share of the Band's profits. In truth, Sy was acting as a double agent, as the information she shared with Jabba's enemies were, in truth, falsehoods provided to her by Bib Fortuna, the Hutt's majordomo."}, {"tag": "p", "text": "After Jabba's death, the Max Rebo Band broke up and went their separate ways. Sy continued to pursue a solo career but found little success, due to the fact that most beings found her singing to be \"weird.\" She was seen as a rival of fellow Pa'lowick singing sensation, Larisselle Chatrunis, a former Miss Coruscant winner. Despite the publicity, the rumored backstage drama did little for Sy's dwindling career, however, and the best she could muster were tours of the Outer Rim Territories under a variety of stage names."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sy Snootles was originally portrayed as an elaborate puppet, but for the extended musical number in the Special Edition of Return of the Jedi, she was a CG character. In the Special Edition a frog-like mouth below the long, skinny one with tusks was removed, so that the CG character only had one mouth."}, {"tag": "p", "text": "The puppet can still be seen in the Special Edition, in the first shot of the band sequence."}, {"tag": "p", "text": "During the production of Return of the Jedi, Sy Snootles was referred to as Mrs. Snooty."}, {"tag": "p", "text": "In \"Hunt for Ziro\", Sy Snootles was voiced by Nika Futterman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}