{"url": "Battle_of_Chabosh_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Lahara sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Chabosh  (Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Chabosh was fought between the Galactic Empire and the Rebel Alliance during the Galactic Civil War around 2 BBY. After a Rebel cell on the planet Chabosh overthrew the local governor, Captain Harsh of the Imperial Star Destroyer Cauldron personally led a stormtrooper company in crushing the uprising, but he was severely wounded during the battle. Harsh's victory and subsequent recovery without the aid of surgical cybernetics made him a legend and enabled his swift rise through the Imperial ranks."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Chabosh, a planet in the Outer Rim Territories, became the site of a Rebel Alliance cell about two years before the Battle of Yavin, during the Galactic Civil War. The Rebels succeeded in overthrowing the governor in an uprising and established themselves in a stronghold protected by powerful shields. In response, the Galactic Empire dispatched Captain Harsh, commander of the Imperial-class Star Destroyer Cauldron, to eliminate the Rebel threat on Chabosh."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Cauldron joined an Imperial fleet in forming a blockade of the planet. In the battle's final assault, Harsh personally led a company of stormtroopers against the Rebel Alliance forces. Although he suffered terrible injuries to his legs in the fighting, Harsh wiped out the Rebel cell."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "According to a medical droid's diagnosis back aboard the Cauldron, Harsh's severe injuries required cybernetic replacements, but he aggressively refused. Instead, Harsh willed his legs to heal without surgical assistance, and his legend was born. Promotions came his way at a storied pace over dozens of more senior officers. Less than a year after the Battle of Chabosh, in a private ceremony, Emperor Palpatine personally named Harsh Moff of the Bosph sector."}, {"tag": "p", "text": "The Republic Journal of Law-Enforcement and Low-Intensity Conflict, an underground scholarly forum dedicated to analyzing non-warfare conflict, later detailed Harsh's role in the Battle of Chabosh and his resultant rise to power in its \"Threat Dossier\" newsletter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Chabosh was created as part of the character backstory for Imperial Moff Harsh in the Star Wars Roleplaying Game article \"Unusual Suspects,\" written by Andrew Hind for the sixth issue of Star Wars Gamer magazine, which was published by Wizards of the Coast on September 4, 2001."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}