{"url": "Syirlabradawk", "categories": ["Category:Legends articles", "Category:Freedom fighters", "Category:Healers and doctors", "Category:Males", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Syirlabradawk"}, {"tag": "p", "text": "Syirlabradawk, nicknamed Syir, was a male Wookiee medical officer who lived on Talus during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Syirlabradawk was a Wookiee medical officer and a member of the Aggregate Civil Liberties Organization, a pro-Rebel organization during the Galactic Civil War between the Rebel Alliance and the Galactic Empire. By the time following the Battle of Yavin, the Wookiee was running an A.C.L.O. clinic."}, {"tag": "p", "text": "After the Battle of Yavin, the A.C.L.O. was in conflict with the Nightstrike Soldier Hegemony, a Talusian mercenary organization affiliated with the Empire. Circa 1 ABY, N.S.H. troops shut down Syirlabradawk's clinic and imprisoned the Wookiee. Rebel Captain Vayde Quellium and A.C.L.O. representative Trezya Nenei then sent a spacer to the N.S.H. base in order to retrieve a confiscated medical shipment and rescue Syirlabradawk before his transfer to an Imperial prison. The spacer sliced the N.S.H. mainframe in the base and managed to localize the Wookiee. The spacer then found a number of prisoners held and tortured in holding cells within the underground bunker, including Syirlabradawk. However, the Wookiee refused to escape and abandon the other prisoners. The spacer thus accepted to help the Wookiee in retrieving his medical equipment in the base so he could treat the injured prisoners before leaving. Syirlabradawk eventually stabilized the prisoners and stayed with them until an A.C.L.O transport arrived to evacuate all of them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Syirlabradawk was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Syirlabradawk was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}