{"url": "Sy_Myrthian_Insurrection", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battles of the Sy Myrthian Insurrection", "Category:Early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Sy Myrthian Insurrection"}, {"tag": "p", "text": "The Sy Myrthian Insurrection was fought in 19 BBY, during the Imperial Reconquest of the Rim, when the Galactic Empire attempted to drive out the holdout forces of the Confederacy of Independent Systems led by Sy Myrthian ex-Senator Toonbuck Toora from the region around the planet Sy Myrth. The Confederacy had been defeated by the Galactic Republic, the Empire's predecessor, previously that year at the end of the Clone Wars. During the campaign, the Imperial Twelfth Army, under the command of Admiral Adar Tallon and General Jan Dodonna, won battles at Diado and Metalorn, and besieged Sy Myrth itself, before defeating the Separatist holdout forces under Toora in the Trasemene system, a battle in which Toora herself was killed, ending the insurrection."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The galactic conflict known as the Clone Wars ended during 19 BBY, with the Galactic Republic vanquishing the Confederacy of Independent Systems. However, some Confederates continued to fight on as the Separatist holdouts at the beginning of the Imperial Period, including one of the Confederacy's founders, Sy Myrthian ex-Senator Toonbuck Toora."}, {"tag": "p", "text": "Toora managed to reactivate Separatist ground and naval forces, as well as restart production in Confederate factory worlds in the vicinity of her homeworld of Sy Myrth, a stretch of space around the Perlemian Trade Route known as the \"Foundry of the Confederacy\". Uprisings like Toora's forced the Galactic Empire, the successor of the Republic, to begin a large campaign known as the Reconquest of the Rim. The Imperials relocated the Twelfth Army to the world of Charros IV in response to Toora's uprising."}, {"tag": "h2", "text": "The insurrection"}, {"tag": "p", "text": "After several months of fighting during 19 BBY, in which they reduced Toora's forces in an attritional campaign, the 12th Sector Army under the command of Admiral Adar Tallon and General Jan Dodonna emerged victorious at the world of Diado. It subsequently won another victory at Metalorn."}, {"tag": "p", "text": "Following those victories, the Imperials besieged Sy Myrth itself under Dodonna's expert guidance, eventually defeating the forces there. Tallon and Dodonna then chased down Toora's flagship, Defiance's Banner, with a task force led by the Praetor-class Star Battlecruiser Battalion. The end of the campaign came in the Trasemene system, after the Imperial task force cornered Toora's fleet there. In the ensuing battle, the Battalion ripped apart Toora's fleet with its turbolaser batteries, killing Toora and ending the insurrection."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though the Sy Myrthian Insurrection had ended, some Confederate followers continued to harass the Empire from the Kreetan Narrows region in Hutt Space, close to Sy Myrth. As a result of the activities in the Kreetan Narrows, the Empire later annexed the Hutts' northern territories, which included the Narrows and the worlds of Vaathkree, Kessel, and Honoghr."}, {"tag": "p", "text": "Dodonna later received honors for his role in the pursuit and elimination of Toora, while his and Tallon's exploits were celebrated on the Core Worlds of the galaxy. Both men later became disillusioned with the Empire, however, after it became increasingly brutal and oppressive in its conduct, and after the Declaration of Rebellion in 2 BBY, Dodonna and Tallon would defect to the newly-formed Alliance to Restore the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The insurrection was first mentioned in The Essential Guide to Warfare, an extensive guide dedicated to the conflicts in the galaxy, written by Jason Fry and Paul R. Urquhart, and released in 2012."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}