{"url": "Syndic_Mitth%27raw%27nuruodo_training_academy", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles that are known by a nickname", "Category:Academies", "Category:Chiss military units"], "nodes": [{"tag": "h1", "text": "Syndic Mitth'raw'nuruodo training academy"}, {"tag": "p", "text": "The Syndic Mitth'raw'nuruodo training academy was a Chiss military school, located on the ice-locked planet Rhigar in the Rata Nebula, which was itself located in the Unknown Regions, specifically within the volume of space controlled by the Chiss Ascendancy. It consisted of a single massive dome, hidden in the planet's frozen terrain, containing facilities like a communal refectory and hangars for Clawcraft starfighters, organized around a large central space containing an indoor forest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The academy was for known for teaching its cadets the controversial ideas of the exiled Syndic Mitth'raw'nuruodo—better known as Thrawn, Grand Admiral and Warlord of the Galactic Empire. However, the academy does not seem to have been part of Thrawn's personal Household Phalanx, which operated outside Chiss space in alliance with the Empire of the Hand, as the academy commandant outranked the commanding officer of the Household Phalanx."}, {"tag": "p", "text": "Instead, it seems that the academy was officially just one of a number of military schools within the Chiss Ascendancy. Its loyalty to Thrawn was covert, with the aim of creating a \"hidden phalanx\" of sympathizers within Chiss space, who would support military and political moves to further Thrawn's agenda—many of whom would not realize that they had been deliberately conditioned to support the coup."}, {"tag": "p", "text": "It is not certain whether the academy was attached to the Chiss Expansionary Defense Force, or to a specific Colonial Phalanx or Ruling Family, but in spite of its secret role in promoting Thrawn's agenda, senior figures within the Ascendancy clearly retained some control over the institution, or at least believed that they did. When Imperial General Baron Soontir Fel entered diplomatic negotiations with the Chiss leadership, some time before 19 ABY, his son Davin was sent to the academy as a surety for his father's loyalty. Davin went on to die a hero's death in combat, and he was replaced at the academy by his younger brother Jag."}, {"tag": "p", "text": "By 19 ABY, the academy commandant was a male Chiss named Gimald Nuruodo, and the cadet commander was Lieutenant Shawnkyr Nuruodo. In that year, the academy was attacked, apparently by the Cavrilhu Pirates, leading to the deaths of Commandant Gimald and seemingly also Phalanx Commander Kres'ten'tarthi. Jag and Shawnkyr rallied the cadets, and drove off the pirates—an event which led to Jag being appointed as cadet commander in Shawnkyr's place."}, {"tag": "p", "text": "After his academy training, Jag joined a Colonial Phalanx within the Ascendancy, before defecting to the Household Phalanx along with Shawnkyr. It is not known whether the academy continued to function after the raid and the betrayal of its location, but by 28 ABY, Jag could refer to multiple \"academies\" loyal to the Household Phalanx."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"Syndic Mitth'raw'nuruodo training academy\" is given in the novel The New Jedi Order: Dark Journey. It is unlikely to be the formal name of the academy, but it is the only specific designation by which the facility has been referred to in Star Wars canon."}, {"tag": "p", "text": "There is some uncertainty about whether the attack on the academy occurred in 19 ABY or 22 ABY. The main problems with the earlier date are the assumption that Jag was born in approximately 8 ABY, which would make him just eleven at the time, rather than the fourteen that he is said to be, and the fact that Stent appears alive (albeit in a holoprojector transmission) in Survivor's Quest, in 22 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}