{"url": "Syndor", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Males", "Category:Sith in the Lost Tribe of Sith"], "nodes": [{"tag": "h1", "text": "Syndor"}, {"tag": "p", "text": "Syndor was a male Sith who served as the captain of the frigate Winged Dagger in the Lost Tribe of Sith's armada. In 44 ABY he was under the command of High Lord Sarasu Taalon, who had allied with Jedi Grand Master Luke Skywalker for a mission to defeat the dark side being Abeloth—although the Sith actually intended to betray Skywalker and force Abeloth to serve them. During the mission, Syndor's command of the ship was transferred by Taalon to the Sith Leeha Faal, whom he gave orders to raid a sacred fountain on Klatooine—orders which Faal relayed to the frigate Starstalker to carry out."}, {"tag": "p", "text": "The raid was successful, but both vessels were captured by the Hutts, who were bound to protect the fountain. Because the Winged Dagger had not actually assisted in the assault, however, Syndor, Faal, and the rest of the ship's crew were allowed to go free. The fleet eventually proceeded to Abeloth's planet in the Maw, where Skywalker, Faal, Taalon, and Saber Gavar Khai separated their minds from their bodies to travel beyond shadows in hopes of locating Abeloth. Faal died there, however, and aboard the Winged Dagger, her brain activity ceased. Sumar reported the turn of events to Syndor, who was then reinstated by default as commander of the vessel. He ordered the crew to remove Faal from life support and await further orders from Taalon. The Sith and Jedi eventually found Abeloth, but the Sith's betrayal failed and Skywalker defeated the dark side entity. The Sith fleet was then ordered to leave the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Syndor was a male Force-sensitive born on the Wild Space world of Kesh. A member of the Lost Tribe of Sith, descendants of a group of Sith that had been isolated on Kesh for 5,000 years, Syndor joined the Tribe's Sith armada sometime after its formation in 41 ABY, becoming captain of the ChaseMaster frigate Winged Dagger by 44 ABY. In that year, he was chosen to accompany a task force of eleven ChaseMasters under the command of Keshiri High Lord Sarasu Taalon for a mission to form a feigned alliance with exiled Jedi Grand Master Luke Skywalker to find the dark side entity Abeloth, who had been causing a psychosis among the Knights of the Jedi Order. In actuality, the Sith intended to betray the Jedi and force Abeloth to serve the Tribe. Syndor and the armada intercepted Skywalker over Dathomir and convinced him to ally with them for the mission, which they claimed was to defeat Abeloth so as to prevent her from continuing to spread the psychosis."}, {"tag": "p", "text": "The fleet stopped first at the planet Klatooine in the Si'Klaata Cluster to await Skywalker's friend, Lando Calrissian, who was to join them with a Colossus I Beta Series asteroid tug, the Rockhound, for assistance in navigating the Maw, where Abeloth lived. Eventually, the allies decided to leave Klatooine and await Calrissian just outside the Maw; however, Taalon convinced Skywalker to allow him to leave two frigates behind in case something went wrong. The Winged Dagger was one of the two frigates, but the High Lord gave command of the ship over to his close friend, the Keshiri Sith Leeha Faal, and made Syndor her second in command. Syndor pretended to take his demotion lightly when Faal took her station aboard the Winged Dagger, but she still suspected that he planned to betray her. Following the rest of the allied fleet's departure from Klatooine, Faal relayed Taalon's orders to raid the planet's sacred Fountain of the Ancients to the Starstalker, the second ChaseMaster that had been chosen to remain behind."}, {"tag": "p", "text": "The raid proved successful, as samples of wintrium—the glass-like substance that made up the Fountain—were taken, but both the Winged Dagger and the Starstalker were apprehended by a task force of Hutts, who were bound by the Treaty of Vontor to protect the Fountain. Syndor, Faal, and the crews of both Sith ships were then brought to trial before Calrissian and Jedi Knight Jaina Solo, both of whom had just arrived in-system. According to the Treaty of Vontor, two or more offworlders had to serve as judges during a trial regarding a possible violation of the Treaty, because both the Klatooinians and the Hutts had vested interests in the conclusion of such a case. During the trial, Faal claimed that the crew of the Starstalker had acted completely of their own accord when they attacked the Fountain. Even though Solo and Calrissian realized that she was lying, they had no proof and were thus only able to convict the Starstalker's crew of the crime of damaging the sacred Fountain."}, {"tag": "p", "text": "Calrissian, Solo, and the crew of the Winged Dagger then left Klatooine and met up with the rest of the allied fleet just outside of the Maw. After stopping briefly at Sinkhole Station—the space station where Skywalker had first encountered Abeloth—only to find it destroyed, they traveled to Abeloth's planet. There, Skywalker, Taalon, Faal, and the Sith Saber Gavar Khai separated their minds from their bodies in order to walk beyond shadows—a realm of the Force that consisted of locations corresponding to real places on Abeloth's world—in the hopes of locating Abeloth. Syndor, meanwhile, remained aboard the Winged Dagger, where Faal's body was being monitored. While beyond shadows, Faal was dragged down into the Depths of Eternity, from which no one could be retrieved or saved. Back on the ship, her brain activity ceased."}, {"tag": "p", "text": "Syndor was informed by the female Sith Sumar, who had been attending Faal, of the development and affirmed his resumed command of the vessel. Syndor then ordered that Faal be taken off life support and commanded the ship's crew to await further orders from Taalon. Although they failed to locate Abeloth while beyond shadows, the Sith and Jedi eventually found the dark side entity and battled with her. In spite of the Sith's attempted betrayal of the Jedi, Skywalker defeated Abeloth. Afterward, Taalon and Skywalker agreed to send Calrissian, Solo, and the entirety of the Sith fleet—including Syndor and the Winged Dagger—offworld while they continued investigating Abeloth."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Following his placement as second in command beneath Leeha Faal, Syndor acted as though he was unbothered by his demotion, and dutifully carried out his orders. Faal, however, assumed that he was plotting to remove her from power. On Abeloth's planet, after Faal's sudden cessation of brain activity, Syndor ordered his crew to terminate her life support and return to their stations to wait for further orders from Taalon. Syndor was pleased by Faal's death, and did not hide his delight from his crew."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a member of the Lost Tribe from Kesh, Syndor was Force-sensitive and trained in the ways of the Sith. He was entrusted with the command of the ChaseMaster frigate Winged Dagger. Syndor was also considered to be exceptionally powerful, as only the strongest Sith in the Tribe had been chosen to accompany High Lord Sarasu Taalon on his mission. Despite this, Syndor was demoted by Taalon and replaced by the High Lord's close friend Leeha Faal, so that she could personally oversee the carrying out of his orders to raid the Fountain."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Syndor first appeared in the fifth novel of the Fate of the Jedi series, Fate of the Jedi: Allies, written by Christie Golden and released on May 25, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}