{"url": "Symponik_Nabooalla", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gungan music", "Category:Patriotic and military songs"], "nodes": [{"tag": "h1", "text": "Symponik Nabooalla"}, {"tag": "p", "text": "\"Symponik Nabooalla\" was a symponik composed by the Gungan female Augara Jowil in the year 32 BBY. It commemorated the meeting of Gungan Boss Rugor Nass and Naboo Queen Padmé Amidala under the circumstances of the Trade Federation invasion of their homeworld of Naboo. The first movement of the piece was performed by the Great Municipal Band during the victory parade in the capital city of Theed after the planet was freed from the Federation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The \"Symponik Nabooalla\" was a symponik, a musical epic meant to retell a significant event in Gungan history. The symponik was written to record the story of the Human inhabitants of the planet Naboo coming before the Gungan Boss Rugor Nass to ask for assistance in freeing their world from the invading Trade Federation. The composition included parts for bawoonkas, drums, and vocalists. The first movement of the piece contained melodies utilizing five different pitches, and it ended with a large crescendo as the horns played phrases that grew higher and higher."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The piece was composed by Gungan female musikagung Augara \"Augie\" Jowil, leader of the Gungan Great Municipal Band, on the planet Naboo in the year 32 BBY. Jowil composed the entire piece in her head in order to commemorate the combined efforts of Humans and Gungans to restore freedom to their planet from the invading Trade Federation, as she saw that as a turning point in Gungan history. It more specifically celebrated the meeting of Gungan Boss Rugor Nass and Naboo Queen Padmé Amidala when the Human Naboo people, as part of a plan to end the global invasion by the Federation, humbly beseeched the Gungans for aid."}, {"tag": "p", "text": "The first movement of the musical piece debuted in the capital city of Theed during a Great Municipal Band performance in the victory parade after the defeat of the Trade Federation. The movement was performed on bawoonkas and drums and was sung by a choir. It was played before a crowd of Humans, Gungans, and representatives of the Galactic Republic, including Supreme Chancellor Palpatine and the Jedi Council. The composition concreted Jowil's place in Gungan history as one of the greatest conductors of the Municipal Band of all time."}, {"tag": "h2", "text": "Excerpt"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"Symponik Nabooalla\" made its first appearance in the final scene of Star Wars: Episode I The Phantom Menace during the victory parade in Theed. The piece was included on the original release of the Star Wars Episode I: The Phantom Menace soundtrack as track seventeen, which is titled \"Augie's Great Municipal Band and End Credits,\" and in the thirty-first track of the Ultimate Edition soundtrack, which is titled \"The Parade.\" It was composed by John Williams, performed by the London Symphony Orchestra and the New London Children's Choir and recorded in England. Synthesizers were used for most of the recording. The vocals and brass were live, though certain brass phrases were performed at half-tempo and sped up in order to reach notes an octave out of a trumpet's range. It was written in the key of A, is polyphonic, has a tempo of 124 bpm, and has a duple meter with a time signature of 4/4. A Databank entry about Jowil was also written by Hyperspace member Chad Finke through the What's The Story? feature on StarWars.com, detailing much about the piece and its origins and naming the in-universe piece for the first time."}, {"tag": "p", "text": "It was originally rumored that the track \"Augie's Great Municipal Band\" was an intentional reworking of \"The Emperor's Theme,\" having been sped up and switched to a major key in order to evoke a happy emotion rather than a sinister one. Ken Wannberg, music editor for The Phantom Menace, stated in a Soundtrackmag.com interview that the correlation was in no way intentional, and he went on to say the two pieces didn't even sound alike. This, however, was conflicted in the Star Wars Insider 109 article \"Menace Revisited,\" where it was stated that \"Augie's Great Municipal Band\" was intentionally reworked from \"The Emperor's Theme\" to symbolize Palpatine's first step to galactic dominion. This position was later backed by former LucasArts lead sound designer David W. Collins and author Timothy Zahn in Star Wars Insider 147."}, {"tag": "p", "text": "The game Star Wars: Episode I The Phantom Menace video game contains the victory parade scene at the end of the last mission, but it utilizes the track \"Hail to the Winner, Anakin Skywalker\" instead of \"Augie's Great Municipal Band.\" The piece was also used during the credits for the first two installments of the 2001 mockumentary R2-D2: Beneath the Dome, which began airing following that year's Thanksgiving showing of The Phantom Menace on FOX."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}