{"url": "Systems_Army/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic military units", "Category:Imperial military units", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Systems Army"}, {"tag": "p", "text": "A Systems Army was a type of military formation used by both the Grand Army of the Republic and the Imperial Army, although the meaning of the term changed completely between the Clone Wars and the Galactic Civil War."}, {"tag": "h2", "text": "Systems Armies in the Clone Wars"}, {"tag": "p", "text": "In the Clone Wars, the ten Systems Armies were major combat formations of the GAR, with an establishment strength of 294,912 clone troopers; they were each composed of two Sector Armies, and each commanded by a High Jedi General, often a member of the Jedi High Council."}, {"tag": "h2", "text": "Systems Armies under the Empire"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Under the Empire, the number of Systems Armies increased massively, so that by the time of the Galactic Civil War, formations so designated were subordinated to the Surface Marshal in charge of Army operations in a single Sector. However, these Systems Armies would have been unrecognizable to veterans of the Clone Wars."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Systems Armies were still commanded by High Generals, but these were now line officers rather than Jedi Knights, and their primary responsibility was now to keep track of units and resources throughout the sector, and liaise this information between the front-line Generals. They were organizationally separated from the surface Armies and autonomous Corps HQs over which they had oversight, and whereas a surface Army boasted 193,644 combat troops and even a standard garrison had several battalions of front-line soldiers, the only force directly attached to a High General's command consisted of a headquarters unit. This was just 1,855 men strong, and identical to those deployed with the subordinate surface armies, consisting of 784 support personnel, coupled with 200 ISB agents and three companies of COMPNOR observers, and protected by one security company and six perimeter patrol platoons—these last being the only combat troops under the High General's direct command. The same program of military buildup that had seen Systems Armies proliferate a hundredfold in twenty years had swollen their component elements to the point that they had superseded them as field formations."}, {"tag": "p", "text": "Systems Armies were now parent formations whose front-line children had emphatically flown the nest, their only real use being to make them presents of reinforcements or Navy support when required. Once the premier combat groupings of the Grand Army of the Republic, they had effectively ceased to exist as fighting forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Systems Armies were introduced as elements of the Imperial Army in the Imperial Sourcebook, and retrospectively given their Clone Wars back-story only in the Guide to the Grand Army of the Republic. The authors of The Imperial Sourcebook may have intended for each Systems Army under the New Order to be a grouping of two surface Armies plus autonomous Corps HQs, with two Systems Armies together forming an Imperial Sector Army; but the text does not completely exclude other possibilities - for instance, a single nominal Systems Army may have formed the administrative interface between the Sector Army high command and a varying number of Army or Corps-level units deployed across the sector."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}