{"url": "Sysco", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Imperial Navy officers of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Jerec's personnel", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sysco"}, {"tag": "p", "text": "Captain Sysco was a male officer of the Imperial Starfleet who served aboard the Super Star Destroyer Vengeance, the personal flagship of the Dark Jedi Jerec, during the year 5 ABY. Sysco was present on the Vengeance when Jerec's Dark Jedi followers captured and systematically executed a band of rebels led by the Jedi Qu Rahn. Shortly after their deaths, Jerec ordered Sysco to turn the Vengeance toward the moon Sulon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sysco was a male officer in the starfleet of the Galactic Empire. By the year 5 ABY, Sysco, who held the rank of captain, served aboard the Super Star Destroyer Vengeance, the dreadnought that acted as the personal flagship of the Imperial Dark Jedi Jerec."}, {"tag": "p", "text": "That year, the Vengeance captured a fleeing CR90 corvette over the planet Dorlo. The corvette's crew, led by the Jedi Master Qu Rahn, was subsequently captured by the Dark Jedi Boc Aseca and brought before Sysco on the Star Destroyer's bridge. After an orderly informed the prisoners of the ship's military protocol, Sysco told Jerec that the prisoners were ready to be interrogated. Jerec approached them and demanded information on the whereabouts of the mythical Valley of the Jedi. However, the prisoners refused to answer any questions and all, save for Rahn, were subsequently executed by one of Jerec's Dark Jedi followers. Jerec used the Force to rip the information he sought from Rahn and then left the Jedi where he stood."}, {"tag": "p", "text": "As a last stand, Rahn telekinetically grabbed the lightsaber of the Dark Jedi Yun. After Rahn severed one of Aseca's tendons, Sysco drew his sidearm and attempted to shoot Rahn but was stopped by Jerec, who insisted that his followers needed the practice. Sysco holstered his weapon, only for Rahn to sever Jerec's minion Maw at the waist. Rahn's rampage was finally ended by Jerec himself, who beheaded the Jedi Master. As the crew looked on, Jerec ordered Sysco to clean up the bodies, set a course for the moon Sulon, and arrange a special dinner. Sysco agreed but first walked straight to his quarters—carefully stepping over Maw's severed legs in the process—to open a bottle of Bonadan booze, which he kept in the bottom drawer of his desk."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When Qu Rahn attacked Jerec's Dark Jedi, Sysco frowned at the Jedi's decision and attempted to attack on the behalf of the injured Boc Aseca. After Jerec intervened, claiming that his Dark Jedi needed the practice, Sysco wondered if Aseca would feel the same way. However, Sysco obediently lowered his weapon. Once Jerec left the bridge, Sysco briefly put his master's orders on hold in order to grab a bottle of alcohol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Sysco was created for the 1998 novella Dark Forces: Rebel Agent, which was written by William C. Dietz. Sysco appeared in the novella's second chapter, acting as Jerec's captain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}