{"url": "Syren_spice", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with conflicting sources", "Category:Articles with gameplay alternatives", "Category:Spice variants"], "nodes": [{"tag": "h1", "text": "Syren spice"}, {"tag": "p", "text": "A rare and unique spice variant was discovered during the Galactic Civil War. This kind of spice appeared organic and medicinal in nature."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The spice was originally discovered by people affiliated with the Rebel Alliance so that only the Alliance knew its exact origin by the time of the Battle of Yavin. At some point, Doctor Edvar Vang and Moxxar Krieg discovered the existence of the spice. After they were threatened, the former accepted to stop investigate the spice while the latter insisted and searched for the source of the spice. He was later assassinated."}, {"tag": "p", "text": "The existence of the spice was publicly revealed when a transport carrying some spice for the Rebels in the Naboo system crash-landed on Naboo's moon of Rori, around 1 ABY, The smuggler Cal Handro who piloted the ship survived the crash but he soon vanished in the wilderness of Rori. Henchmen of the Black Sun criminal syndicate were the first to localize the crashed ship. They collected a spice sample that was later analyzed by the chemist Tover Blackmoor. The result of the analysis convinced the Black Sun leaders to track the missing pilot to determine the source of the spice."}, {"tag": "p", "text": "In the meantime, Cal Handro was sought by several group of spacers recruited by Imperial Lieutenant Jevan Monsul, Alliance Officer Veega Madish, and by a friend of Handro named Tyla Jinn. Some of them collected spice samples at the crash site and started to investigate this new spice. They first encountered Doctor Vang who refused to reveal anything about the spice, and then they found the corpse of his friend Moxxar Krieg who was already dead. They then escaped a Black Sun ambush and discovered the location of the Black Sun bunker. There, they discussed with the chemist Tover Blackmoor and forced him to reveal everything he knew about the pilot and the new spice."}, {"tag": "p", "text": "Later, most Black Sun criminals involved in the hunt for the spice and the missing pilot were killed in a fight with the spacers at Tierce Martano's estate. Rebel forces eventually captured Cal Handro but the latter escaped with the help of the Empire. The pilot wanted to avoid to be judged by the Rebel Alliance that had discovered he used to smuggle slaves. Rebel agents eventually attacked and destroyed Cal Handro's ship in the Naboo system, killing the pilot before he could reveal the origin of the spice to the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The spice appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "The spice was one of the central elements of the \"Secrets of the Syren\" story arc and was added to the game upon the release of its first chapter, introduced with the \"Publish 14\", on March 9, 2005. The spice appeared or was mentioned in the four chapters of the questline but it was never named. The name of the spice and background information were intended to be revealed with the fifth, and final, chapter of the story arc. The spice should have been named Syren because it was extracted from Syren plant roots from Kashyyyk. The fifth chapter was achieving its development in October 2005 but was delayed and planned to be introduced in April 2006 with the \"Publish 28\". However, the final chapter of \"Secrets of the Syren\" was never released. Although the name of the spice was never revealed to the players, the questline itself was named after the spice."}, {"tag": "p", "text": "The \"Secrets of the Syren\" story arc was eventually removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}