{"url": "Syo_Bakarn", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Bakarn family", "Category:Children of the Emperor", "Category:Corellian Jedi", "Category:Force ghosts", "Category:Humans", "Category:Jedi healers", "Category:Jedi High Council members", "Category:Males", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Syo Bakarn"}, {"tag": "p", "text": "Syo Bakarn was a Human male Corellian Jedi Master who served the Jedi Order and the Galactic Republic as a healer during the Great Galactic War against the resurgent Sith Empire. Following the Treaty of Coruscant, Master Bakarn relocated to Tython where he served as a member of the Jedi High Council during the Cold War. However, Bakarn himself was unaware that he was host to a second personality, the First Son of the Sith Emperor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Seeds planted"}, {"tag": "p", "text": "Syo Bakarn was a Force-sensitive Human male native of the Core World of Corellia. Born around 3678 BBY, he was a member of the Bakarn family, which had once carried the name Bakvalen. The Bakvalens had at one point been a well-known Corellian noble lineage, living in Bakvalen Hall, their own manor in the capital city of Coronet. Bakarn was born during a time of turmoil, as the Galactic Republic was engaged in the Great Galactic War with the resurgent Sith Empire, led by the enigmatic Sith Emperor. Seeking to further his power base, the Sith Emperor decided to create a group of personal sleeper agents called \"Children of the Emperor.\" The Emperor's agents, Servants of the clandestine organization Emperor's Hand, scoured the galaxy for Force-sensitive beings suited for their Master's needs. Like many infants from many different species, Bakarn was spirited away from his family on Corellia and he was taken to the Sith Academy on the planet Korriban to undergo training in a specialized group. For weeks, Bakarn and the other children underwent various rituals and processes inside the Academy, until eventually Bakarn was chosen to be the first individual to be inducted into the ranks of the Children of the Emperor. The young Bakarn was granted a personal audience with the Sith Emperor, whereupon he was infused with the Emperor's strength and was bound to his mind and will, becoming the Emperor's First Son. The First Son was essentially another persona created inside Bakarn's mind, who was unaware of its existence. A master strategist, the First Son would lay dormant inside the labyrinths of Bakarn's mind, waiting for the Emperor's command to awaken and do his Master's bidding."}, {"tag": "p", "text": "After his initiation, Bakarn was returned by the Emperor's Hand to his parents, as eventually were the other Children. Thus, a network of sleeper agents was spread by the Sith Emperor throughout both the Republic and his own Sith Empire. The First Son, bound through the Force to the other Children, continued to sleep inside Bakarn. However, he constantly projected a mental shield, hiding himself and the other Children of the Emperor from being detected by other Force-sensitives. As long as the First Son lived, the Children were undetectable by the galaxy at large. Having no memories of his experiences at the Sith Academy and unaware of the second personality inside him, Bakarn continued to live with his parents on Corellia. He and his father at one point took a walk in Axial Park, when his father told him about their family's proud past. Eventually, Bakarn's Force-sensitivity was discovered by the Jedi Order. He was taken from his homeworld and trained in the ways of the Force, becoming a Padawan to a Jedi Master. During his time as a Padawan, Bakarn gained recognition after he saved his Master from an attack by a Mandalorian Jedi hunter. Eventually attaining the rank of Jedi Knight and studying as a Consular, Bakarn focused his studies on his healing skills, eventually becoming a noted healer."}, {"tag": "h3", "text": "Helping rebuild"}, {"tag": "p", "text": "As a Jedi Knight, Bakarn joined the war effort and fought on the front lines of the Great Galactic War. Although he displayed great combat prowess on the battlefields, Bakarn found no enjoyment in fighting and preferred to channel his talents on healing and rebuilding. As such, Bakarn made it his priority to tend to wounded Republic soldiers after each battle. At one point in his life, he distributed ancient medicine across the alleways of his native Coronet City. Such actions earned him the nicknames \"the Wise Son of Corellia\" and \"the Quiet Healer.\" Near the end of the war, around 3653 BBY, Bakarn joined fellow Knights Satele Shan, Bela Kiwiiks and Jaric Kaedan during the battle on the icy Outer Rim world of Rhen Var. Rhen Var had been captured earlier by the Dark Council member and Dark Lord of the Sith, Darth Mekhis, a Sith scientist and alchemist, who intended to use the world to test her new creations. The Jedi and the Republic army landed on the surface of Rhen Var and embarked on a march toward Darth Mekhis's fortress. The Republic's Forty-fifth Battalion was dispatched ahead to the forests of Rhen Var as a scout force for the Jedi and the main army, but while on the scouting mission, they were attacked by the Empire's weaponized poison gas. By the time, the rest of the Republic forces reached them, all of the scouts were either killed or close to dying. True to his duties as a Jedi healer, Bakarn attempted to ease the suffering of the dying scout Maxin Davers, while Shan rallied Republic forces for a final push forward toward Darth Mekhis's fortress. Bakarn and the Republic army soon encountered and engeged a large detachment of the Empire's troops and Sith but were able to defeat them. As the Republic laid siege to Mekhis's fortress, Shan personally infiltrated the compound and captured the Sith, ending the battle in a Republic victory."}, {"tag": "p", "text": "Shortly after that battle, a surprise peace offering came from the Empire, and negotiations were scheduled to take place on the planet Alderaan, where a peace treaty was to b discussed. The Republic sent a delegation of Senators and Jedi, including Bakarn, to Alderaan. Bakarn, remained excluded from the direct negotiations, so he waited for Jedi Knight Aryn Leneer before the hearing room in the building of the High Council. Bakarn felt there that Leneer became increasingly restless and learned that she felt strange, which troubled him, although he did not trouble her as a threat. Shortly afterwards he felt a disturbance when he sensed Leneer's betrayal of the Sith denounced and attacked the two Sith warriors in their vicinity. Bakarn couldn't jeopardize the negotiations and tried to call her back but she did not hear him before Dar'Nala ordered them to stand down in which they obeyed. Eventually, Bakarn and Leneer were informed that the Sith had conquered Coruscant in order to force the Republic to make concessions in the negotiations. Leneer was extremely angry at this decision, and at the death of her master, and Syo attempted to comfort her after the incident. He offered her his help with anything she needed, but she declined to speak to him and later left the planet to search for her master's killer."}, {"tag": "p", "text": "After the end of the war, Bakarn relocated with the rest of the Order to their ancestral homeworld Tython, where he was responsible for many of the technical aspects of the new Temple, including the construction of the new Archives. During that time, he also founded the Jedi Restoration Concord, a group of Jedi tasked with providing agricultural, engineering and constructional aid to Republic worlds devastated by the war with the Empire. One of the Concord's big achievement was made on the planet Uphrades, where young Jedi serving the Concord quadrupled the planet's food production in just two years. Bakarn's selfless efforts in healing the scars of war did not go unnoticed and earned him the rank of Jedi Master and a seat on the Jedi High Council. Bakarn was especially close with a fellow Jedi named Duras Fain. On one occasion, the two of them pursued an Imperial fugitive to the moon of Nar Shaddaa. There, the Jedi met an aspiring technologist named Tharan Cedrax, who helped them track the Imperial by building a tracking device. After that encounter, Bakarn, Fain and Cedrax became close friends. Although Bakarn did not approve of Cedrax's lifestyle, he continued to enlist his services in building technological advances for the Jedi Order."}, {"tag": "h3", "text": "A promising student"}, {"tag": "h3", "text": "The First Son"}, {"tag": "p", "text": "Unbeknownst to most, including even Syo himself, the Emperor had created an alternate personality and implanted it into Syo's mind. This personality would be known as the First Son and leader of the Children of the Emperor. The First Son shielded the rest of the children from detection. Eventually, the Barsen'thor defeated him, redeemed him, expelled the Emperor's influence in him as well as his identity as the First Son, and ultimately exposed the Emperor's Children to detection. The Barsen'thor eventually gained Syo Bakarn's seat on the Jedi Council."}, {"tag": "h3", "text": "Confronting Tenebrae"}, {"tag": "p", "text": "It is presumed that Jedi Master Bakarn had perished sometime after the Battle of Corellia. During the Alliance Commander's confrontation with Tenebrae within the mind of Satele Shan, Master Bakarn was among the spirits that were summoned to help defeat the former Sith Emperor, thus ending his reign of terror once and for all. With the Emperor gone, Bakarn presumably became one with the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Defeating Syo Bakarn, as the First Son of the Emperor, is the finale of the Jedi Consular's storyline. As the fate of Syo is player determined, Syo can be killed, even when the Barsen'thor tries to redeem him. The First Son takes over and viciously hammers away at the Jedi Master, forcing them to blast Bakarn into a cave wall which collapses on him."}, {"tag": "p", "text": "Despite being a major character in the consular story, Syo Bakarn also makes an appearance in the Jedi Knight storyline by attending Kira Carsen's hearing and agreeing with Tol Braga that no one was beyond redemption."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}