{"url": "Syren_plant/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Botanical sentient species", "Category:Carnivorous plants", "Category:Plants of Kashyyyk", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Syren plant"}, {"tag": "p", "text": "The carnivorous syren plants were native to the planet Kashyyyk. They could be found in the dangerous jungles of the planet's surface, far below the canopy level where the Wookiees dwelled."}, {"tag": "p", "text": "A syren plant could be identified by its two ovular, bright yellow petals that were divided in half. The petals were mounted on an extremely thick, mottled, blood-red stalk. In the middle of the petals was a tuft of glossy white fibers. To many casual observers, the plant might have seemed little more than a giant, beautiful, oversized flower."}, {"tag": "p", "text": "The tuft of syren fibers within the plant emitted a large number of pheromones, which could lure unsuspecting prey. If a creature was lured within proximity of the yellow petals, it was unlikely to survive. Touching the blood-red inner flesh of a syren plant's petals would cause it to reflexively close in one swift powerful movement. The prey, now trapped by the plant's powerful and sticky petals, would be painfully digested alive."}, {"tag": "p", "text": "As a rite of passage, many young Wookiees would attempt to harvest the plant's syren fibers at the Well of the Dead. A young Wookiee would bring a few stronger friends to hold the powerful petals in place while he attempted to harvest the fibers as quickly as possible. Thereafter, he would wear the syren fibers as a symbol of virility and bravery. Despite the help from comrades, some young Wookiees lost limbs to the plant. Before he attended Luke Skywalker's Jedi Praxeum, Lowbacca managed to harvest the syren fibers by himself. While the plant's reflexes were unwittingly triggered, Lowbacca sensed it immediately and managed to clear himself from the flower's range before it closed. Returning home, he wove the fibers into a belt."}, {"tag": "p", "text": "The Besadii Hutt crime lord Gardulla kept syren plants in her luxurious and notorious pleasure garden within her Tatooine palace near the Dune Sea."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An unidentified spice appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. This spice was one of the central elements of the \"Secrets of the Syren\" story arc, introduced upon the release of the \"Publish 14\", on March 9, 2005. In the cut fifth chapter of \"Secrets of the Syren\", it should have been revealed that the spice was extracted from the roots of syren plants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}