{"url": "Synthetic_kyber_crystal", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Crystals"], "nodes": [{"tag": "h1", "text": "Synthetic kyber crystal"}, {"tag": "p", "text": "Synthetic kyber crystals, also known as synthcrystals, were artificial kyber crystals whose synthetic nature made them highly unstable and explosive."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Synthetic kyber crystals were artificial kyber crystals, Force-attuned crystals that were used by the Jedi and Sith in the construction of their lightsabers, that glowed with a green hue. Due to their synthetic nature, they were highly unstable and explosive, and possession of them was made illegal by the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 4 ABY, a young smuggler was hired by the gangster \"Happy\" Dapp to deliver a shipment of synthetic kyber crystals, but was caught in a contraband sweep being conducted by an Imperial Security Officer in Longstar Marketplace on the planet Burnin Konn. Rather than be arrested, they stunned the officer and fled into a nearby mine shaft, where the smuggler detonated the crystals to collapse its entrance to block off a pair of pursuing Imperial stormtroopers. Dapp, angered over the loss of the crystals, sent his bodyguard, Tryken, to confront the smuggler for failing to deliver them, though the aging Zabrak was ultimately defeated. Down a man, the gangster allowed the smuggler and their sibling, Riley, to pay off the destroyed shipment of crystals by working for him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Synthetic kyber crystals first appeared in the new Star Wars canon in the mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms and released in 2015. The concept of synthetic lightsaber crystals originated in Shadows of the Empire, a Star Wars Legends novel written by Steve Perry and released on April 1, 1996 as part of the Shadows of the Empire multimedia project."}, {"tag": "p", "text": "Fightsaber: Jedi Lightsaber Combat, a Legends reference article written by David West Reynolds included in Star Wars Insider 62, which was released on September 13, 2002, established that the red blades of Sith lightsabers were generated by synthetic crystals. Even though they canonically used natural kyber crystals in their lightsabers, the Sith were mistakenly said to use synthetic crystals in Ultimate Star Wars, a canon reference book cowritten by Patricia Barr, Adam Bray, Daniel Wallace, and Ryder Windham that was released on April 28, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}