{"url": "T%27chooka_D%27oon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Jedi Generals", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "T'chooka D'oon"}, {"tag": "p", "text": "T'chooka D'oon was a Human male Jedi Master from the planet Nubia. Prior to the Clone Wars, the Jedi High Council dispatched D'oon to the planet Kalee to put an end to the Huk War. D'oon favored the Yam'rii, also known as the Huk, and supported them during his time on Kalee. The Kaleesh, who fought against the Huk on their homeworld, began to hate the Jedi Master, calling him \"the Executioner of Kalee.\" In 20 BBY, during the Clone Wars, D'oon, now a Jedi General, was sent to the planet Vandos. Accompanied by his Padawan, Flynn Kybo, and a group of clone troopers, D'oon was assigned to rescue Anx Ambassador Quiyyen from Confederate forces. The Confederate General Grievous, who was leading a group of B2 super battle droids, attacked D'oon's group and killed the Jedi with his lightsabers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "T'chooka D'oon, a Human male, was an Nubian Jedi Master. Before the Clone Wars began, the Jedi High Council dispatched D'oon to the planet Kalee. The Jedi Master had to peacefully bring an end to the war that was fought between the Yam'rii, also known as the Huk, and the Kaleesh. D'oon supported the Huk, which angered the native Kaleesh, who nicknamed D'oon \"the Executioner of Kalee.\" During the Clone Wars, D'oon became a Jedi General, and received a Padawan, a Human male named Flynn Kybo. In 20 BBY, D'oon and Kybo were sent to the planet Vandos. During the mission, D'oon and Kybo—accompanied by a group of clone troopers—were tasked with rescuing Anx Ambassador Quiyyen from Confederate forces."}, {"tag": "p", "text": "After landing their LAAT/i gunship near a cliff, D'oon's group found Quiyyen, but were soon ambushed by B2 super battle droids. Leading the droids was the Confederate General Grievous, who ordered the droids to leave no survivors. However, D'oon's group began to retreat back to their gunship. To give his team more time to enter the gunship, D'oon engaged Grievous in a lightsaber duel. The cyborg general overwhelmed the Jedi Master and sliced him in half. Kybo later told the Jedi Council of his Master's death. The Padawan, however, wanted to avenge D'oon's death and began to search for Grievous. On the planet Belsus, Kybo engaged Grievous in a lightsaber duel, although a nearby explosion killed Kybo."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "T'chooka D'oon's Padawan, Flynn Kybo, described D'oon as a skilled and courageous Jedi who often helped others. During the Vandos mission, D'oon wanted to give his group more time to retreat back to their gunship. He risked his life to save his group by engaging Grievous in a lightsaber duel, though the Jedi Master was unable to defeat him. After the Jedi Council sent D'oon to Kalee to bring an end to the Huk War, D'oon sided with the Huk, which angered the native Kaleesh."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T'chooka D'oon first appeared in the 2005 comic, General Grievous 1, and was later mentioned in the fourth and final issue of the series. D'oon was later briefly mentioned in The New Essential Chronology and in author Abel G. Peña's story, Unknown Soldier: The Story of General Grievous. In 2008, D'oon received a short entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}