{"url": "T%27surr", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Desert planets", "Category:High-gravity planets", "Category:Nuon e Safyd sector planets"], "nodes": [{"tag": "h1", "text": "T'surr"}, {"tag": "p", "text": "T'surr was a cold and windswept high-gravity planet in the Expansion Region's Nuon e Safyd sector. Most of the planet's lifeforms had excellent low-light vision, and the harsh conditions of the world gave rise to a predatory sentient species also known as the T'surr. T'surr males often left their homeworld for the wider galaxy, but their planet was never represented in the Galactic Republic or the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "T'surr was a planet located in the T'surr system, a part of the Nuon e Safyd sector in the Slice portion of the Expansion Region. Located far from its weak sun that provided little light, T'surr was a cold and windswept high-gravity desert world. Most of the creatures that evolved on T'surr had excellent vision in low-light conditions. Species not native to T'surr found the planet's high gravity daunting and oppressive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although T'surr's native species of the same name could already be found off-world by 1032 BBY, T'surr had no representation in either the Senate of the Galactic Republic or in that of the New Republic due to the perceived nature of the T'surr as aggressive killers."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "T'surr was the homeworld of the sentient, predatory T'surr species. The harsh living conditions of their homeworld made the T'surr into hardy survivors who cared little for other people and adopted slavery as a cultural norm. Although the males were the dominant T'surr gender on their homeworld, the females had the ultimate authority in T'surr homes, making many of the males anxious to leave their home planet for the wider galaxy. The T'surr spoke the T'surrese language."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet T'surr was created for Ultimate Alien Anthology, a Wizards of the Coast sourcebook for use with the Star Wars Roleplaying Game. Prior to the book's release in April 2003, the planet was mentioned in a March 27, 2003 Wizards.com preview of a section of the book detailing the T'surr species. The 2009 reference book The Essential Atlas placed the T'surr system, and therefore the planet itself, in grid square P-12."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}