{"url": "Szajin", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Crime lords", "Category:Hutt Cartel individuals", "Category:Hutts", "Category:Males"], "nodes": [{"tag": "h1", "text": "Szajin"}, {"tag": "p", "text": "Szajin was a Hutt leader who held the title of Archon during the Hutt Cartel's occupation of Makeb in 3638 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The title of Archon dated back to the ancient Hutt Empire - part judge, part cultist, sworn to uphold ancient Hutt traditions and defend their empire against any threat. Though the title faded with the fall of the Hutt Empire, Szajin brought back the title when Toborro led the Hutt Cartel in its conquest of Makeb, serving as a secret advisor to the Cartel leadership. He sought to restore the greatness of the Hutt Empire, making the Hutts a proud race in the galaxy once again. Makeb and its supply of the rare substance isotope-5 would give the Hutts a tremendous source of power, one that could rival both the Galactic Republic and the Sith Empire."}, {"tag": "p", "text": "At some point, Szajin told fellow Hutts Khobisho, Prodoranya, and Manju to stay at Solida Hesk's palace, where it would be safe."}, {"tag": "p", "text": "While the Republic forces battled against Toborro and began evacuating the planet, the Empire contended with the Archon in a shadow war as they sought to claim the power of isotope-5 for themselves, in order to stave off the Empire's impending collapse during its Galactic War with the Republic. An Imperial strike team stormed Stronghold One in an effort to seize the Hutts' stockpile of isotope-5, only to discover that Szajin had used all but one sample to create an army of war droids. The strike team managed to escape the fortress with their lives, burying the droids in lava."}, {"tag": "p", "text": "Szajin later became suspicious when the Imperials invaded the abandoned mining mesa where isotope-5 was first discovered and dispatched an Regulators Squad 79 to capture or kill any Imperial they find. When the squad failed to return, Szajin presumed that the Imperials were desperately attempting to mine what isotope-5 they could before Makeb's imminent destruction and dispatched Phobium Squad to round up Makebian engineers skilled in the use of the deep-core laser drills. This prompted the Imperials to rescue the engineers and recruit them to operate the mining lasers to stabilize the core before it ripped the planet apart."}, {"tag": "p", "text": "However, Szajin eventually learned the Empire's true plan when he captured Katha Niar, a former Ministry of Logistics bureaucrat running the support team for the strike force, and tortured her. Laying siege to the Archon's palace, using its own defense turrets to bring down its shields, the Imperial strike force entered the Archon's throne room and confronted him while he was in conference with Regulator commanders. The Archon mounted a massive battlemech, fueled by isotope-5 and armed with missiles and a powerful laser beam, to engage his opponents. The Imperial forces managed to defeat the machine, leaving the Archon at their mercy. Despite this, Szajin boasted that the secret would soon be out that the Empire had prevented Makeb's destruction, and that once the atmospheric interference had cleared, he would inform the Cartel fleet."}, {"tag": "p", "text": "The Imperial forces, however, chose to put an end to such issues by retargeting the laser drills to cause groundquakes at all the mercenary bases, causing the mesas to collapse and drowning the mercenary bases in magma. With the secret safe, the Imperials then killed the Archon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The outcome of the battle with the Archon in the final Imperial mission, \"Revenge of the Archon\", is determined by the player's conversation choices. Destroying the mercenary bases is the dark side option, and automatically ends with the player slaying the Archon. The light side choices are to negotiate with the mercenary forces, allowing them to leave Makeb if they told no one of the Empire's presence; once that is done, all that remains is the Archon's fate. The light side option is to have the mercenaries take the Archon into custody for imprisonment on Dromund Kaas; the dark side option is to kill him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}