{"url": "T%27achak_T%27andar", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Chadra-Fan", "Category:Engineers", "Category:FarStar crewmembers and personnel", "Category:Katarn Commandos personnel", "Category:Males", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "T'achak T'andar"}, {"tag": "p", "text": "T'achak T'andar was a male Chadra-Fan with a passion for speed and racing. Originally a design engineer, T'andar found the work boring and became a test pilot for prototype airspeeders and landspeeders. He was known to push vehicles to their very limits in order to test them thoroughly, but his penchant for joyriding and racing the prototypes—along with gambling on the result—meant that he could not keep in steady employment. T'andar joined the New Republic, and despite their best efforts to place him in a role where he could not get into trouble, he was eventually transferred to Page's Commandos as a support operative. Following the liberation of Kal'Shebbol in 8 ABY, T'andar was transferred to the CR90 corvette FarStar to serve as its repulsorlift chief. The ship had been assigned to track down the rogue Imperial warlord Moff Kentor Sarne, who had fled from Kal'Shebbol with the majority of his forces in the wake of the New Republic's assault on the planet. T'andar spent the majority of the mission looking after the corvette's small detachment of ground vehicles."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "T'achak T'andar, a male Chadra-Fan, was a vehicle designer and engineer, and was part of a team of Chadra-Fans hired by the Incom Corporation to design new airspeeders and landspeeders for the company. He soon got bored of designing new creations, and transferred from the design team to the prototype testing team where he discovered a love of piloting vehicles at high speeds. T'andar developed a reputation for pushing the prototypes beyond their redline limit, proving that his colleagues' designs worked. However, T'andar also had a habit of taking the new designs for joyrides, and racing against other drivers, which resulted in both large wagers and crashed vehicles."}, {"tag": "p", "text": "T'andar eventually left Incom, and worked for several other companies, including Ubrikkian Industries, Aratech Repulsor Company, Ikas-Adno, and Mobquet Swoops and Speeders. Each time, T'andar would push the company's new prototypes as far as they would go, but would eventually take a new design for a joyride or race, and bet heavily on it. A crash would usually follow, along with the end of T'andar's employment. Despite crashing his vehicles on numerous occasions, T'andar always managed to jump clear and suffer only minor injuries. He claimed his continued survival was due to two factors. Firstly, he always wore a crash helmet. Secondly, he always modified any craft he was driving with a device he called a \"redbutton sissy strap.\" That modification was a seat belt or restraint designed to keep the rider aboard the vehicle. In times of emergency, the pilot could release it with a small explosive charge to throw themselves clear."}, {"tag": "p", "text": "After running out of design companies to work for, T'andar worked for a few planet-bound smuggling groups and a swoop gang before he eventually enlisted as a repulsorlift engineer for the New Republic. The New Republic tried to put him and his talents to good use, while at the same time trying to keep him from doing too much damage. As a result, he was assigned to single patrol duties on remote planetary outposts. In 8 ABY, shortly before the Battle of Kal'Shebbol, T'andar was transferred to support operations for Page's Commandos, although he did not make a good impression on the unit commander, Lieutenant Judder Page."}, {"tag": "p", "text": "T'andar served with the task force assigned to liberate Kal'Shebbol, located in the Kathol sector of the Outer Rim Territories, from the Galactic Empire. Elements of Page's Commandos infiltrated the Imperial headquarters and deactivated the planetary shields, allowing the New Republic to liberate the planet. In the wake of the New Republic's victory, a mission was authorized to track down the local Imperial warlord, Moff Kentor Sarne. Sarne had ruled Kal'Shebbol, and had managed to flee the planet during the battle with a large portion of his forces. As Sarne was believed to still be able to pose a danger to the security of the region, the CR90 corvette FarStar was tasked with a mission to search for him and neutralize any threat he presented. While much of the crew of the corvette was drawn from the civilian population of Kal'Shebbol due to a manpower shortage, T'andar was one of the few New Republic personnel to find himself transferred to the vessel at Lieutenant Page's instruction. T'andar was assigned as the ship's repulsorlift chief, and spent much of his time in the vessel's maintenance and repair bay performing unauthorized \"improvements\" on the FarStar's small fleet of ground vehicles to enhance their performance in his eyes."}, {"tag": "p", "text": "Several months into the voyage, the FarStar stopped at Yvara on the edge of the Kathol Rift. The planet was the homeworld of the Yvarema species, a hive-minded race to which one of T'andar's crewmates, Gunthar, belonged. Captain Kaiya Adrimetrum, the commanding officer of the FarStar, ordered the ship to land so that routine maintenance could be performed, and authorized teams to scour the surrounding area for food supplies. T'andar was grateful for the chance to take the ground vehicles out for a spin, relishing the opportunity to race over open ground. After leaving Yvara, the FarStar eventually tracked Sarne down in the Kathol system, engaging the Moff's forces in combat. The FarStar crew successfully defeated Sarne, ending the threat he posed to the stability of the sector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "T'achak T'andar was covered in brown hair and had black eyes. He was a cheery, happy-go-lucky individual whose main love was the thrill of flying fast vehicles. He was also willing to push a craft further than its design limits to test just how fast it could go, or just how well it could corner. T'andar cared about the maintenance of his craft, making sure they were working properly and modifying them to get that little bit extra out of them. T'andar would often talk with other technicians about modifying their own craft by bypassing safety procedures. Despite his love of fast moving vehicles, he did not risk his own safety, and often built mechanisms into the craft to allow him to escape from an accident without harm."}, {"tag": "p", "text": "T'andar also liked to gamble, usually on whatever vehicle he was piloting and how fast he could fly it. However, he was not adverse to placing bets on anything that moved fast. That was one of the traits that usually led to the eventual termination of his employment. T'andar was capable of piloting ground, hover, and repulsorlift vehicles, and could perform repairs on the latter. He was also able to determine the value of any repulsolift vehicle he encountered. On duty, T'andar typically wore a pilot uniform and crash helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T'achak T'andar was created as a member of the FarStar's support crew in the first book of The DarkStryder Campaign, published by West End Games in 1995. Initially, his character was not to be mentioned in any other supplement, giving the gamemaster or any player who portrayed his character control over his fate. However, T'andar did receive a mention in the third book of the campaign, The Kathol Rift, in the adventure Home when the players were given the opportunity to deploy the FarStar's ground vehicles to search for food supplies."}, {"tag": "p", "text": "T'andar was later namechecked in 2010's The Unknown Regions, a sourcebook for Wizards of the Coast's Star Wars Roleplaying Game, as an example name for Chadra-Fan characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}