{"url": "Systems_force", "categories": ["Category:Legends articles", "Category:Imperial Navy systems forces"], "nodes": [{"tag": "h1", "text": "Systems force"}, {"tag": "p", "text": "A systems force was an important subdivision of a Sector Group in the Imperial Navy, encompassing ships and squadrons spread across a number of different systems within a sector of the Galactic Empire."}, {"tag": "h2", "text": "Organization and Deployment"}, {"tag": "p", "text": "Commanded by systems admirals, systems forces were the main intermediary formations between Sector-level Fleet commands and the ships and squadrons assigned to individual star systems. Ships from any one systems force would thus be scattered across vast interstellar distances, deployed around numerous different worlds; but rather than being organized territorially in distinct volumes of space within their sector, each systems forces consisted primarily of a grouping of ships and other assets suitable for a particular type of operation: force superiority and force escort were types of space-combat battlegroup; transport force and systems bombard were planetary assault taskforces, and force technical services and force support were non-combat logistical fleets."}, {"tag": "p", "text": "The internal structure of these force pools was designed to be highly flexible, so that they could be reorganized into optimized taskforces to perform specific missions, but overall, every systems force was designed for a reasonably narrow range of operations, and within their assigned Sector, the ships and personnel of a single Systems Force could thus be deployed anywhere that their particular equipment and expertise were required."}, {"tag": "p", "text": "While it required authorization from the Moff to concentrate more than one squadron of front-line warships in a single star system, ships from different systems forces could thus find themselves fighting in adjacent systems as needs required, and in any given system, ships from one systems force might be replaced by ships from another as an operation progressed through different stages - for example, once ships from a Force Superiority group had destroyed a hostile planet's naval forces and orbital defenses, elements of a transport force or systems bombard might move in for siege or assault operations. Nor is it unreasonable to imagine that busy systems might have individual ships or small flotillas from several separate systems forces present in them simultaneously."}, {"tag": "p", "text": "It was, inevitably, a highly complex task for the systems admiral and his aides to reassign ships as required to an ever-shifting array of missions throughout a vast area of space, especially when several other systems forces would be operating in the same sector simultaneously, some with overlapping mission briefs, others with interlocking capabilities that would have to be called on at different stages in an operation. Above and beyond this, the coordination of a systems force was made more complex because many ships still did not carry long-range communications equipment, and the star systems they were assigned to also lacked HoloNet transceivers: in such circumstances, courier vessels were frequently the fastest means of communication between the scattered units under a systems admiral's command."}, {"tag": "h2", "text": "Order of Battle"}, {"tag": "h2", "text": "Sources"}]}