{"url": "T%27less", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Jeedai Heretics", "Category:Shamed Ones"], "nodes": [{"tag": "h1", "text": "T'less"}, {"tag": "p", "text": "T'less was a female member of the Yuuzhan Vong species who belonged to the Shamed Ones. Alive during the Yuuzhan Vong War, T'less worked on the captured planet of Yuuzhan'tar and secretly practiced the Jeedai heresy, a belief that members of the Jedi would save lowly Yuuzhan Vong. In 28 ABY, she, alongside Shamed Ones Shoon-mi Esh and Aarn, met briefly with the rogue Shamed One Vuurok I'pan, who had brought fellow Yuuzhan Vong Ammorn to learn new knowledge about the Jeedai heresy from the three. However, T'less left before Aarn and Esh did to provide an excuse for their absence."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "T'less, a female of the Yuuzhan Vong species, belonged to the Shamed Ones, a caste of those deemed imperfect by other Yuuzhan Vong. She lived during the Yuuzhan Vong War, when her species invaded the New Republic galaxy. In the year 28 ABY, T'less worked on the planet of Yuuzhan'tar, which had been captured from the New Republic earlier in the war. A secret member of the Jeedai heresy—a belief among lowly Yuuzhan Vong, such as the Shamed Ones, that the members of the New Jedi Order would save them—T'less operated under the cover of legitimate work. T'less, alongside fellow Shamed Ones and Jeedai heresy believers Shoon-mi Esh and Aarn, traveled to meet the rogue Shamed One Vuurok I'pan, who was bringing another Yuuzhan Vong who wished to know more about the heresy."}, {"tag": "p", "text": "T'less and the others traveled to a subbasement on Yuuzhan'tar, where they found I'pan and his companion, Ammorn, who was, unbeknownst to the three, the disgraced Executor Nom Anor. However, when Esh and Ammorn started to discuss the heresy, T'less grew nervous. Believing that they would be discovered by Yuuzhan Vong authorities who forbade the practice of the heresy and that they would be late for another engagement, she voiced her concerns. Esh then ordered T'less to go inform Sh'simm that he and Aarn had been held up in the yorik coral nursery to explain their absence, and T'less left the meeting to go do so."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Shamed One, T'less was considered untouchable by the rest of the Yuuzhan Vong castes. She embraced the Jeedai heresy and was willing to operate undercover while working. However, T'less grew nervous and became concerned that she and her companions would be caught during their underground meeting on Yuuzhan'tar, prompting Esh to send her away, as he and Aarn were more devoted to the heresy than she was and more willing to risk exposure. Amorrn found that T'less carried around with her an air of toil."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T'less appeared only in Force Heretic I: Remnant, a New Jedi Order installment released in 2003 and written by Sean Williams and Shane Dix."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}