{"url": "Battle_of_Corellia_(1_ABY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Corellia", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Corellia  (1 ABY)"}, {"tag": "p", "text": "This battle took place on Corellia in 1 ABY. It occurred when the Imperial officer Crix Madine, who was interested in joining the Alliance to Restore the Republic, requested a proper meeting with the Alliance general Carlist Rieekan to discuss the terms of his defection. Three members of the elite Alliance flight Rogue Squadron manning T-47 airspeeders, commanded by Luke Skywalker, accompanied Rieekan to Coronet City, capital of Corellia, to patrol the city for any signs of Imperial presence while the meeting took place."}, {"tag": "p", "text": "An Imperial strike team interrupted the meeting and attempted to kill both Rieekan and the Imperial turncoat by destroying the Technology Center and the Coronet Capitol Tower while they were still inside. The timely intervention of Han Solo and Chewbacca in the Millennium Falcon, as well as the arrival of evacuation shuttles, allowed for the Alliance to extract both Rieekan and Madine just before the Capitol Tower collapsed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Galactic Empire lost the search for the Rebel Alliance starship Nonnah, internal security in the Empire was tightened, and any hint of treason was dealt with swiftly. Imperial Commander Crix Madine had attempted to defect to the Alliance prior to the Battle of Yavin, and, to prove his loyalty, Madine provided essential guidance for the sabotage of Operation Strike Fear and the destruction of the Star Destroyer Invincible. However, it was the order to release the Candorian plague on Dentaal that convinced Madine it was time to leave for good."}, {"tag": "p", "text": "Wracked with guilt over his role in the death of the entire Dentaalian population, Madine left his unit while performing a training mission in 1.8 ABY. Madine erased himself from Imperial records, although his disappearance was covered by some HoloNet news channels. He did not even tell his fiancée where he was going, not wanting to place her in a dangerous situation."}, {"tag": "p", "text": "During this period, Madine provided clues to the Rebellion about the Dark Trooper Project; eventually he was captured by General Rom Mohc and imprisoned in Orinackra, where he awaited execution. Upon learning of his capture, Mon Mothma dispatched Kyle Katarn to rescue Madine, who revealed Mohc's role in the project. He also provided the Alliance with intelligence on two subsequent targets to sabotage the Dark Trooper project."}, {"tag": "p", "text": "Following his escape from Orinackra, Madine fled to his safehouse on Corellia. From there, he requested a meeting with General Carlist Rieekan of the Rebel Alliance to discuss his defection. Rieekan accepted his request and was escorted to Coronet City by Rogue Squadron, under the command of Luke Skywalker. Before meeting with Madine, Rieekan was to attend a conference with Coronet City officials in the Coronet Capitol Tower."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Commander Luke Skywalker and a detachment of Rogue Squadron were assigned to patrol the city in their airspeeders for any signs of Imperial activity. After Wedge Antilles picked up strange transmissions, they flew to the outskirts of the city and found a squad of 5 probe droids. It turned out to be a diversion, however, in which squadrons of TIE bombers attacked the Capitol Tower during the Rogues' absence."}, {"tag": "p", "text": "Rogue Squadron rushed back to defend the city, while another squadron of 4 TIE bombers moved in on the Technology Center in which Madine was hiding. The Rogues had routed most of the bombers attacking the Tower before they received a transmission from Madine, stating that the Imperials had begun attacking the Center. Skywalker left to protect him, as the rest of Rogue Squadron, along with the new arrival of Han Solo and Chewbacca in the Millennium Falcon, took care of the remaining bombers at the Capitol Tower."}, {"tag": "p", "text": "By the time the Technology Center was safe, the Imperials had deployed an AT-AT walker, which moved to attack the Tower. It was then that Luke used Imperial defector Davin Felth's advice, and tripped up the walker with his tow cable. After the remaining bombers were destroyed, the Falcon and a Rebel Lambda-class T-4a shuttle began evacuating the Capitol Tower. At the same time, stormtroopers invaded the beaches in Amphibions, but the Rebel defense batteries managed to keep most of the troops out of the city."}, {"tag": "p", "text": "The Imperials resumed their attack on Madine with a pair of AT-ST walkers leading another AT-AT, while a squad of Stormtroopers attempted to break into the Technology Center. Luke drove the Imperials off, while a second evacuation shuttle arrived to pick up Madine. With Madine's successful defection, and the evacuation of the Capitol Tower, Rogue Squadron withdrew from the planet. The Capitol Tower was destroyed as soon as the Rebel force departed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Madine would go on to be a successful Rebel Alliance general, serving in battles such as the Battle of Endor, and would go on to be a general of the New Republic. One of his first missions with the Alliance was commanding Gold Squadron during the Liberation of Gerrard V, during which he would once again be involved with the actions of Rogue Squadron. In 12 ABY, while leading a commando team to sabotage the Darksaber superweapon, Madine was captured and killed by Durga Besadii Tai the Hutt. In his honor, the General Crix Madine Military Reserve was constructed over Coruscant during the reformation of the New Republic into the Galactic Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rogue Squadron's mission to rescue General Rieekan and Crix Madine first appeared in the Nintendo 64 video game Star Wars: Rogue Squadron, as the game's fourth mission, \"Defection at Corellia\". In this level, the player for the first time is required to use the harpoon and tow cable of a T-47 airspeeder against an AT-AT in order to complete the mission successfully. As the Battle of Corellia takes place in the timeline prior to the Battle of Hoth, during which Luke Skywalker supposedly devised the strategy for downing the four-legged walkers, this element of the mission may be non-canon and chalked up to game mechanics."}, {"tag": "p", "text": "Han Solo's entrance into the battle, in which he saves a Rebel pilot by swooping down from above, and then shooting down the TIE bombers chasing him, all while shouting \"Yee-haw!\", is similar to how he saves Luke Skywalker at the Battle of Yavin."}, {"tag": "p", "text": "If the Nintendo 64 version of Rogue Squadron is played with the default Jumper Pak installed in the console, all TIE fighters that are present in this level are replaced with TIE bombers due to technical limitations in the game's memory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}