{"url": "T-65BR_X-wing_reconnaissance_starfighter", "categories": ["Category:Legends articles", "Category:New Republic starfighter classes", "Category:Scout starship classes", "Category:T-65BR X-wing reconnaissance starfighters", "Category:X-wing models"], "nodes": [{"tag": "h1", "text": "T-65BR X-wing reconnaissance starfighter"}, {"tag": "p", "text": "The T-65BR X-wing reconnaissance starfighter, commonly called the Recon-X or Snoopscoot, was a variant of the Incom T-65 X-wing starfighter modified for reconnaissance missions."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A vast improvement over the aged and slow Longprobe Y-wings, the T-65BR featured an advanced, high-gain, long-range sensor package with high-speed hypertransceivers in place of the standard X-wing's proton torpedo launchers. Sensor packages were mounted on probes that were launched from the craft and tethered to it by cables. Six additional reconnaissance imaging systems were contained within the starfighter's nose. The sensor suites were coordinated by the on-board R2-R-series astromech droid to provide maximum efficiency, a requirement when jumping into potentially dangerous zones. The astromech droid was of eminent importance in guiding the Recon-X through its scouting runs and collecting data, and some New Republic pilots facetiously noted that the pilot was only there to provide company to the astromech. During reconnaissance runs, when enemy ships were detected, the astromech would begin automatically updating the pilot on their various classifications. Many pilots called the Recon-X the \"Snoopscoot\"."}, {"tag": "p", "text": "The Recon-X was also equipped with a HoloNet communicator, or alternatively, a hypercomm data relay that enabled it to relay its findings instantaneously to allied command centers. The hypercomm transmitters were intimately linked with the Recon-X's hyperdrive system — they were programmed to immediately begin transmitting the fighter's collected reconnaissance data immediately upon realspace reversion in the target area."}, {"tag": "p", "text": "The Recon-X used updated engines and etheric rudder prototypes to eliminate the need for thrusters. In the event that a Recon-X was captured, the fighter was equipped with several distinct countermeasures. The pilot carried a purge stick that, if inserted into the cockpit's control panel, triggered a purge charge that would erase the fighter's onboard data and also destroy the R2-R astromech unit with an explosion. Once the purge charge was initiated, a second fail-safe was now accessible within the purge stick: a suicide needle, that once jabbed into the pilot's palm would swiftly kill the pilot. There was also a pressure-loaded \"dead man's\" spring plate mechanism that would self-destruct the Recon-X fighter with baradium charge once the pilot was killed. The self-destruct explosion was of considerable force, capable of crippling a Yevethan corvette."}, {"tag": "p", "text": "A Recon-X lacked weaponry other than its laser cannons, as the space and energy was used for its sensor package. Some even had the laser cannons removed as the energy output of the cannons interfered with the advanced sensors. Nonetheless, the Recon-X had the smallest rear blind spot of any New Republic fighter."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "Xarcce Huwla flew Rogue Squadron's T-65BR during the Galactic Civil War. Later, Nrin Vakil flew a T-65R with Rogue Squadron during the search for the Pulsar Station. Recon-Xs from the 21st Recon Group were also active during the Thrawn campaign, when the unit's second-in-command, \"Sleepy\" Nagelson, notably fell asleep during a reconnaissance mission."}, {"tag": "p", "text": "During the Black Fleet Crisis, these fighters were sent on a deep-penetration reconnaissance operation in the Koornacht Cluster. After Admiral Hiram Drayson's reconnaissance assets within the Koornacht were lost, this left a dearth in military intelligence that General Etahn A'baht proposed to fill by inserting Recon-Xs into the cluster. In a plan authorized by President Leia Organa Solo, nineteen Recon-Xs and five unmanned drones from the 21st Recon Group were deployed in a large-scale operation to survey Yevethan worlds and their defenses in order to provide intelligence for the New Republic Defense Fleet — their target worlds included Wakiza, Zhina, New Brigia, Doornik-881, Morning Bell, Polneye, Kojash, Tizon, Z'fell, Faz, and the Yevethan capital N'zoth. Given the high risk, A'baht initially estimated a forty percent mission survival rate."}, {"tag": "p", "text": "These fighters inserted into their target systems by means of hyperspace and then were sent on five-minute scouting runs within a thousand kilometers of their target world in order to collect orbital intelligence. However, the scouting mission was anticipated by Tal Fraan, and the Recon-Xs were detected by Yevethan defenses. All nineteen fighters were ultimately destroyed within several minutes of entering their target systems, with none managing to collect their full intended data set. N'zoth was surveilled by the T-65BR Jennie Lee, piloted by Lieutenant Rone Taggar, but ultimately was disabled by an ion cannon shot from the Beauty of Yevetha. However, when the Yevethan corvette tractored the Jennie Lee into its hangar, the Recon-X self-destructed, destroying both vessels. Nonetheless, the intelligence data provided from the abortive reconnaissance runs revealed the number and disposition of Yevethan Star Destroyers and Aramadia-class thrustships defending key Yevethan worlds. In the aftermath, Commodore Brand speculated that the Recon-Xs destroyed during the reconnaissance mission were likely detected because they made constant-velocity passes, thus leading to their detection by Yevethan sensors. Later, the Recon-X scouting data of the Duskhan League world Wakiza was passed from Admiral Drayson to Chewbacca via the information broker Formayj."}, {"tag": "p", "text": "Shortly after the large-scale reconnaissance mission, ten Recon-Xs from escort squadron Bravo Flight were dispatched to escort Commodore Han Solo's shuttle, Tampion, from Coruscant to the New Republic Fifth Battle Group's Intrepid. However, their mission was betrayed by Senator Tig Peramis to Nil Spaar. Ninety-one light-years from the Koornacht Cluster, the ships were intercepted by six Yevethan warships, including an Interdictor that drew them out of hyperspace. After being disabled by ion cannon fire within the first several seconds of the engraftment, Tampion was captured along with its crew, with the ten disabled Recon-Xs powerless to resist as the Yevethans departed. Later, the Recon-Xs of Bravo Flight were recovered by the fleet carrier Venture, where the ferry pilots were relieved of command of their fighters and debriefed by New Republic Intelligence to ascertain whether they were responsible for betraying Tampion's mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}