{"url": "T-47_airspeeder/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic repulsorcraft", "Category:New Republic vehicles", "Category:T-47 airspeeders"], "nodes": [{"tag": "h1", "text": "T-47 airspeeder"}, {"tag": "p", "text": "The Incom Corporation T-47 airspeeder was an airspeeder that became famous during the Galactic Civil War for its use by the Alliance to Restore the Republic as a military fighter known as the snowspeeder."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Incom Corporation's T-47 was an atmospheric vehicle designed for industrial cargo handling. Its cockpit featured positions for a forward-facing pilot and a rear-facing cargo manager. The cargo manager used the airspeeder's magnetic harpoon and tow cable to control repulsorlift cargo modules. Mechanical braking flaps, along with the high-powered thrust nozzles, allowed for precise maneuvering. The military version of the airspeeder was piloted by one individual and featured a gunner."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The T-47 was modified by the Rebel Alliance technicians into a patrol and combat craft, becoming commonly known as the snowspeeder, especially after its extensive use at Echo Base on Hoth."}, {"tag": "p", "text": "The Rebel Alliance had used the T-47 airspeeder for reconnaissance on Dantooine and other planets. When the Rebels moved to Hoth, the airspeeder required modifications to function for extended periods in the extremely cold climate. One of the technicians involved in the modifications was Deen Voorson. Heaters were added near the drive units, and de-icing nozzles were added to prevent icing on control surfaces. Rebel technicians also scavenged Y-wing parts, including armor plates, control surfaces, and refitted cockpit modules for the snowspeeder."}, {"tag": "p", "text": "The Rebels armed the craft with AP/11 dual laser cannons and converted the cargo manager into a gunner. Computerized targeting systems and displays were used by the gunner to control the lasers and harpoon gun. However, the pilot could take control of weapons if needed. Since the speeder lacked shields, armor plating was added to the hull. An advanced power plant and repulsorlift engines were installed to compensate for the added weight of armor and weapons. Its small size, maneuverability and speed allowed the ship to dodge weapons fire."}, {"tag": "p", "text": "In addition to cold environments, T-47s were modified by Alliance forces for use in several different climates. The aquaspeeder had water-based modifications, the swampspeeder included flotation gear and water-tight seals, the Sandspeeder was equipped with advanced filters to keep out sand, engine cooling units, and long-range radar for navigating sandstorms, and the skyspeeder had a pressurized cockpit and more powerful repulsorlifts for higher altitudes, and was used in patrolling the Rebel's base on Arbra. They also created the Armored Airspeeder to increase the vehicle's survivability."}, {"tag": "p", "text": "T-47s were used by the Rebel Alliance in hit-and-run missions during the Galactic Civil War. The T-47 was also vital to Alliance tactics such as Attack Pattern Beta and Attack Pattern Delta."}, {"tag": "p", "text": "During the Battle of Hoth in 3 ABY, snowspeeders delayed the advancing Imperial forces, providing extra time to evacuate Rebels from Echo Base. After finding the snowspeeders' blasters to be ineffective against the armored AT-AT walkers, Rebel pilots used tow cables to tie up the legs of AT-ATs, causing at least one to crash to the ground. Regardless of this partial success, many—if not most—of the snowspeeders that participated in the battle were either damaged or destroyed. Those not lost in combat were demolished by the Rebels."}, {"tag": "p", "text": "Following the Battle of Hoth, the T-47 continued to be used by the Rebel Alliance and the harpoon-and-tow cable tactic was employed in other battles, including the Battle of Kothlis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hasbro released a T-47 airspeeder vehicle based on the one Luke Skywalker pilots in The Empire Strikes Back.[source?]"}, {"tag": "p", "text": "Kenner had planned to make a desert-based version of the T-47 airspeeder called the Sandspeeder, colored orange and red, although the toy's production had been cancelled."}, {"tag": "p", "text": "Early concept art from The Empire Strikes Back played with the idea of snowspeeders being built from X-Wing and Y-Wing parts."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack, snowspeeders were the Rebel Alliance's special unit, built at Fortresses for a cost of 55 units of food and 66 units of nova crystals. They were upgradeable to armored airspeeders. They are provided to the player during Rebel Alliance The Battle of Hoth mission and may be built at other times during the campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}