{"url": "T-65XJ3_X-wing_starfighter", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Galactic Alliance starfighter classes", "Category:Incom Corporation products", "Category:New Republic starfighter classes", "Category:X-wing models"], "nodes": [{"tag": "h1", "text": "T-65XJ3 X-wing starfighter"}, {"tag": "p", "text": "The T-65XJ3 X-wing starfighter was a starfighter used by the New Republic and the Galactic Federation of Free Alliances."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This version of the venerable starfighter retains the third proton torpedo launcher from that standard XJ X-wing while increasing the number of torpedoes carried to twelve. It also incorporated backup shield generators that proved useful against the Yuuzhan Vong \"shield grab\" attack. Additionally it boasts improved targeting systems, maneuverability, avionics, and laser cannons, which fired blue rather than red lasers. It could also use the R7-series astromech droid.[source?] Compared to the earlier series of X-wing starfighters, the XJ was a great improvement."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly before the invasion of the Yuuzhan Vong, the New Republic deployed the first of the XJ-series X-wing. Originally, it was issued to elite squadrons aboard Star Destroyers and the New Jedi Order, which resulted in the craft being one of the first to face the deadly coralskippers."}, {"tag": "p", "text": "In 27 ABY, the XJ3 X-wing was introduced. Among the improvements it introduced was a mechanism to bring the shields down, then back up to keep them from being overloaded by dovin basals, a launcher (on Jedi craft) for their shadow bombs, and Stutter-fire lasers that helped to get past the dovin basal shields of the Yuuzhan Vong ships. It was deployed primarily to Admiral Traest Kre'fey's ships and to the Jedi, who used them quite effectively.[source?]"}, {"tag": "p", "text": "By the time of the Killik/Chiss conflict, the XJ3 X-wing, along with the StealthX, was the primary fighters used by the New Jedi Order.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}