{"url": "T-36_Skyfighter", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:Incom Corporation products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "T-36 Skyfighter"}, {"tag": "p", "text": "The T-36 Skyfighter was originally built by Incom to fill the near-orbit planetary defense niche, and later upgraded to compete against new mass produced and expendable Sienar TIE designs. As it was originally designed as an advanced skyhopper capable of orbital operations, life support systems were added although the T-36 Skyfighter possessed a poor design that sacrificed everything else redundant to a limited fighter role, consequently neither hyperdrive engines were added nor deflector shields, but even the final frame lacked inertial dampers and landing gears. Its sublight speed relayed on two modest ion fission engines fitted at the back and atop of the main fuselage, the hull structure was strictly basic to maintain its main systems, its cockpit, the engine and its two wings together to form the simplest starfighter spaceframe possible. The T-36 was usually compared with the TIE/LN starfighter, but it became quickly evident that the comparison was just nominal as the Sienar design outperformed Incom's Skyfighter in every aspect."}, {"tag": "p", "text": "Unfortunately for Incom, the lack of inertial dampers meant that, in atmosphere, even the unwieldy TIE Fighter was far superior. The T-36 couldn't land without special platforms, making it useless for anything but light reconnaissance. Production stopped on the cheap Skyfighter almost as soon as it began. Shortly, only the novice, ignorant or truly desperate purchase them, and even then, they got significant discounts from the factory price."}, {"tag": "p", "text": "But its major problem was with the simple wing shape that did not handle wind shear very well, and on unstable atmospheres or storm weather could make the craft tend to spin in turns or other tight maneuvers. Without inertial dampers, the pilot almost always became badly disoriented. And if the ship was already near the ground, the margin of error for pulling out of uncontrolled spins was slim to catastrophic. Sensible pilots simply refused to fly the things. On the other hand between young and novice pilots wannabes somehow became clear that the natural and easiest transition from Incom airspeeders, like the T-16 skyhopper, to a real near-orbit space starfighter, was acquiring this reachable simple and easily modifiable T-36 Skyfighter."}, {"tag": "p", "text": "The weaponry of the standard T-36 included only two fire-linked laser cannons at the end of each side wing, with a fixed front arc. Ranon Djlkh was known to own a handful of modified T-36s."}, {"tag": "h2", "text": "Sources"}]}