{"url": "T-1_shuttle_(Jedi_Order)", "categories": ["Category:Canon articles", "Category:Jedi Order starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "T-1 shuttle  (Jedi Order)"}, {"tag": "p", "text": "The T-1 shuttle was a model of shuttle utilized by the Jedi Order during the High Republic Era. When the Jedi responded to the the Eiram–E'ronoh crisis, the Jedi Masters Laret Soveral and Simmix and their Padawans, Orla Jareni and Cohmac Vitus, took a T-1 shuttle to the star system of Eiram and E'ronoh. Upon arriving at the lost moon, where the rulers of the two planets had been kidnapped by the Directorate, their vessel crashed, leaving Simmix dead."}, {"tag": "p", "text": "Jedi Master Sskeer and his Padawan, Keeve Trennis, utilized a T-1 shuttle when traveling from Shuraden to the Starlight Beacon space station. Shortly afterward, Sskeer and Trennis were accompanied by the Jedi bond-twins Ceret and Terec aboard a T-1 shuttle while investigating a craft that had been attacked by Nihil marauders in the Kazlin system. Sskeer and Ceret later took the T-1 to the planet Sedri Minor after learning that the derelict craft had departed from there with a cargo of Vratixian barley."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A model of shuttle, the T-1 had a bridge with an angular viewport and two flat, triangular wings on either side. The starship was equipped with two engines and a hyperdrive. The T-1 shuttle's plating was colored white, with red accents on its wings and body. Its bridge was open to its central interior, which was lit by white and golden lights. When the shuttle landed, an entry ramp opened from the base of the shuttle's body, while a boarding tube could also extend from its side."}, {"tag": "p", "text": "Able to be steered by either one or two pilots, the T-1 shuttle had four seats on its bridge. The safety harnesses aboard the shuttle were by default not configured for limbless species, such as the Fillithar. The T-1 shuttle was sturdy, able to remain mostly intact in the event of a crash. The shuttle was also equipped with communications, as well as systems to control its temperature."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Jedi Order used the T-1 shuttle as transportation on missions that involved multiple Jedi."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Eiram–E'ronoh crisis"}, {"tag": "p", "text": "The T-1 shuttle was utilized by the Jedi Order during the time of the High Republic Era, in use by the year 257 BBY. One T-1 shuttle was utilized when the Jedi responded to the Eiram–E'ronoh crisis, in which the monarchs of the twin planets Eiram and E'ronoh were kidnapped by the Directorate and held on the lost moon. The Jedi Masters Laret Soveral and Simmix, along with their Padawans, Orla Jareni and Cohmac Vitus, responded to the planets' call for help. While Simmix, a limbless Fillithar, was aware of the safety harnesses not being configured for his species, he laughed the issue off, saying he would take his chances. The Jedi took the T-1 shuttle to the star system of Eiram and E'ronoh, with the two Padawans steering the vessel."}, {"tag": "p", "text": "Upon their arrival, their shuttle received a distress signal from the wrecked vessel of Monarch Cassel of E'ronoh; however, the signal had been sent by Lord Isamer of the Directorate to lure the Jedi into a trap. The Padawans did not double-check the signal, steering the shuttle in its direction. As they headed towards the moon, Master Soveral, having been roused from her meditative trance, entered the bridge and pointed out that the signal was only confirmed to be from Cassel's ship rather than the monarch himself."}, {"tag": "p", "text": "As a result of the Directorate's trap, the T-1 shuttle crashed onto the lost moon. While the vessel remained more or less intact, Master Simmix was killed in the crash. The other three Jedi exited the wreckage to search for the hostages, but were forced to leave Simmix's body behind, with Soveral hoping that the kidnappers might believe he had traveled alone. Isamer sent his guards to search the wreckage, and while they only discovered the body of Simmix, Isamer knew that there had been other passengers who had survived."}, {"tag": "h3", "text": "Dark encounters"}, {"tag": "p", "text": "Twenty-five years after the Eiram—E'ronoh crisis, following the Great Hyperspace Disaster and the Battle of Kur against the marauder group known as the Nihil, the Jedi Master Sskeer and his Padawan, Keeve Trennis, utilized the shuttle to travel from the planet Shuraden to the Starlight Beacon space station. On their way from Shuraden, they located a group led by Jedi Knight Vernestra Rwoh who had been stranded on the moon Wevo after a skirmish with the Nihil. The two Jedi landed on the moon, followed by Galactic Republic forces and other Jedi, who rescued the group on the starship Radiant Blessing. Sskeer and Trennis disembarked from their shuttle after arriving on the Starlight Beacon, with Trennis subsequently being granted the rank of Jedi Knight. Shortly after their arrival, the Starlight Beacon was officially launched with a dedication ceremony."}, {"tag": "p", "text": "Following the dedication, Sskeer and Trennis were dispatched on a mission to respond to a distress call in the Kazlin system. The two were accompanied aboard a T-1 shuttle, piloted by Trennis, by the Jedi bond-twins Ceret and Terec, who practiced lightsaber dueling while in transit. They arrived in the system to find a derelict vessel and docked their T-1 shuttle alongside it to board the craft, discovering that it was a Hutt Clan ship that had been attacked by the Nihil. After the Jedi learned that the ship had been carrying Vratixian barley, a component of the medical substance bacta, from the planet Sedri Minor, Jedi Master Avar Kriss sent Sskeer and Ceret to the Sedri system on the T-1 to investigate the colony there. Upon their arrival on Sedri Minor, Sskeer and Ceret were met by resident Kalo Sulman, who informed the Jedi that the colony was independent from the Republic and that they were not welcome."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Created for the Star Wars: The High Republic multimedia project, the T-1 shuttle first appeared in the comic The High Republic 1, written by Cavan Scott, penciled by Ario Anindito, and published by Marvel Comics on January 6, 2021. The name of the model was first provided in the novel The High Republic: Into the Dark, written by Claudia Gray and released on February 2, 2021, but the name was not connected to the ship that had appeared in The High Republic 1 until the second issue of the comic, also written by Scott, illustrated by Anindito, and published on February 3."}, {"tag": "p", "text": "The T-1 shuttle's appearance in The High Republic 1 was designed to be an older version of the T-6 shuttle utilized by the Jedi during the Clone Wars. The design was extrapolated by Anindito after Scott introduced him to the philosophy of the High Republic and the design choices that had been made up to that point."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}