{"url": "T-5_Deliverance", "categories": ["Category:Canon articles", "Category:Galactic Empire starship classes", "Category:Medical starship classes", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "T-5 Deliverance"}, {"tag": "p", "text": "The T-5 Deliverance was a repurposed Lambda-class T-4a shuttle that was used by the Galactic Empire to dispatch medical and repair payloads directly into the battle. Its hull bore the red sigil, a symbol used to identify military medical services."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Being a variant of the Lambda-class T-4a shuttle, the T-5 Deliverance had a trihedral foil design, with a stationary center foil and two articulated flanking wings. When in flight, the side wings folded out for greater stabilization. When landing, the wings folded in. It measured 20 meters in length, was equipped with a hyperdrive, and mounted with two forward-facing double laser cannons, two wing-mounted double cannons, and a rear-facing double laser cannon."}, {"tag": "p", "text": "Under its belly, the Deliverance variant featured a boxy container that was absent from the regular Lambda-class. On both sides of its stationary foil, the Deliverance bore the cross-like red sigil, a universal symbol that identified medical vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The T-5 Deliverance was a variant of the Lambda-class T-4a shuttle, a multi-purpose transport manufactured by Sienar Fleet Systems for the Galactic Empire as part of the Abecederian line. During the Galactic Civil War, the Empire used Deliverance craft as ambulance ships, dispatching medical and repair payloads directly in the battlefield."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The T-5 Deliverance was created for Star Wars: Commander, a mobile strategy game by Disney Interactive featuring characters, locations, and technology from the Star Wars Saga. Although the game was released on August 21, 2014, the medical ship itself was only introduced in a December 2015 expansion inspired by Star Wars: Episode VII The Force Awakens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}