{"url": "T3-M4", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Droids of the Jedi Order", "Category:Duwani Mechanical Products products", "Category:Lost Jedi (Meetra Surik)", "Category:Masculine programming", "Category:Slicers", "Category:T3-series utility droids", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "T3-M4"}, {"tag": "p", "text": "T3-M4 (also called Teethree for short) was a T3-series utility droid built as a master slicer for crime lord Davik Kang. His life of crime was short-lived, however, after Taris was bombarded by the Sith and Davik was killed. He then accompanied Revan on his search for the Star Forge."}, {"tag": "p", "text": "Two years after defeating Darth Malak, Revan left for the Unknown Regions in search of answers to why the Mandalorians took to war in the first place, taking T3-M4 with him. Eventually, their quest led them to Nathema, where the Ebon Hawk was shot down by Darth Nyriss and the Lord Scourge, and Revan was captured."}, {"tag": "p", "text": "The droid then wandered the planet alone until he gathered the parts necessary to repair the Ebon Hawk, and eventually the droid rescued Meetra Surik from Darth Sion, and helped her in her quest to stop the Sith Triumvirate."}, {"tag": "p", "text": "After this, T3-M4 joined Surik in going after Revan in the Unknown Regions, their quest eventually taking them to Dromund Kaas. There, after rescuing Revan, T3, Surik and a Sith ally named Scourge confronted the Sith Emperor, where T3 met his end at the Emperor's hand."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Travels with Revan"}, {"tag": "p", "text": "T3-M4 was a late-prototype model of the T3-series utility droid, built on Taris by Janice Nall for the local crime lord Davik Kang in 3956 BBY. The droid was top-of-the-range for its time, and featured exceptional code-breaking and computer slicing skills, in addition to being able to mount armor and weapon upgrades. T3-M4's original purpose was to aid Canderous Ordo in breaking into a Sith military base on Taris for Davik Kang. The amnesiac Revan, under the advice of Canderous, assisted in stealing the launch codes from the base. The group then stole Davik's ship, the Ebon Hawk, and escaped the destruction of Taris ordered by Darth Malak. Following their narrow escape, the group embarked on a quest to find and destroy the Star Forge. During this quest, Revan learned his true identity, but T3-M4, being a droid, continued to faithfully serve him."}, {"tag": "p", "text": "T3-M4 continued to accompany Revan in the years following the destruction of the Star Forge. Revan slowly regained the memories of his past life, and set out with Canderous and T3-M4 to investigate the mysterious True Sith that he had encountered in the Unknown Regions. Before this, however, T3 was given special instructions by Revan's wife Bastila Shan. Under this programming, if T3 lost contact with Revan, he would return to Republic space and contact her or any other that could help, such as the Republic or other Jedi."}, {"tag": "p", "text": "Revan, Canderous, and T3-M4 first went to Rekkiad, where the Mandalorians, Canderous's people, were searching for Mandalore's Mask. Finding the mask, which Revan had hid there years earlier in the aftermath of the Battle of Malachor V, unlocked more of Revan's past memories. While Canderous remained in the known galaxy to rebuild the Mandalorians as Mandalore the Preserver, Revan and T3-M4 continued to follow Revan's memories, which led them to the devastated planet of Nathema. Revan lost control of the Ebon Hawk due to the emptiness in the Force around Nathema, and they were shot down by Darth Nyriss and Lord Scourge, two Sith from the very Empire that Revan sought, who were coincidentally visiting the planet for their own purposes. The Sith captured Revan, but did not notice T3-M4, who was left alone as the only animate being on the entire planet, and slowly repaired the Ebon Hawk. After years he found all the necessary parts, and returned to known space, following Bastila's instructions."}, {"tag": "h3", "text": "Travels with Meetra Surik"}, {"tag": "p", "text": "Unable to find Bastila, he instead sought the Jedi Exile, Meetra Surik because of her history with Revan. Surik was travelling aboard the Republic vessel Harbinger. However, the ship was attacked by the Sith Lord Darth Sion. The mysterious Jedi Master Kreia helped Surik escape on the Ebon Hawk along with T3-M4 and another droid, 3C-FD. The ship was heavily damaged in the escape, and both droids were instrumental in repairing and getting the ship to the Peragus Mining Facility while all the other crew members on board were incapacitated. However, immediately upon docking, an HK-50 droid broke out of a sealed section of the ship and blasted the two utility droids. T3-M4 barely escaped with little damage but 3C-FD was damaged beyond recovery."}, {"tag": "p", "text": "When Surik awakened in the medical bay of the mining facility, T3-M4 helped her gain access to the Peragus fuel depot before being found and disabled by the HK-50 droid and dumped in a fuel line, only to be discovered by Surik and Atton Rand as they made their escape from the facility."}, {"tag": "p", "text": "After Surik and the others escaped from the Peragus system on the Ebon Hawk, they were forced to escape to Telos IV, where they were detained at Citadel Station. Atris had the impounded Ebon Hawk stolen from Citadel Station and moved to her Jedi academy in the polar region of Telos. T3-M4 was detained with the ship, and was thus also taken by Atris. At Atris' academy, his memory banks were downloaded by Atris's Handmaidens. The link between the academy's computer and T3-M4 worked both ways, however, and the droid was able to download a holorecording of Surik's trial before the Jedi Council and a list of the locations of the remaining Jedi Masters."}, {"tag": "p", "text": "When Surik was captured on Nar Shaddaa by Exchange thugs in the employ of G0-T0, T3-M4 once again came to the rescue. With the aid of The Champ, a Chadra-Fan pazaak player, the droid was \"sold\" to Vogga the Hutt and sent to work in his shipping warehouse. Goto had been intercepting all of Vogga's shipping by following his transports transponder codes. The freighters would be captured by Goto's droid yacht, which was cloaked in orbit. To find and infiltrate the yacht, T3-M4 stole the transponder codes for one of Vogga's freighters and fought his way out of the warehouse when three HK-50 assassin droids tried to stop him. The Ebon Hawk's codes were then changed to match the freighter, and Goto's yacht intercepted the ship as planned, allowing for the rescue of Surik and the destruction of the cloaked yacht."}, {"tag": "p", "text": "During Surik's journeys, T3-M4 was responsible for the Ebon Hawk's navigation, as he alone could access the navigation records of the ship due to a voice-printed lockout. Presumably, they had been locked by Revan to hide his destination. Surik, with the help of T3-M4 and her other companions, confronted the Sith at the Trayus Academy on Malachor V. The Sith Order founded by Darth Revan was destroyed along with the planet."}, {"tag": "h3", "text": "Search for Revan"}, {"tag": "p", "text": "Meetra Surik and T3 returned to Coruscant, where Bastila Shan, now with a three year old son, Vaner, discussed Revan, and what happened to him. Bastila gave T3 a holo-video of her and Vaner for Revan to watch when T3 and Meetra found him."}, {"tag": "p", "text": "T3-M4 brought Surik to Nathema, where Revan had been captured. The two found clues pointing to the planet of Dromund Kaas, the capital of the Sith Empire Revan had encountered a decade earlier. Meetra and T3 joined forces with Scourge, who was part of a conspiracy to overthrow the Emperor. Together, they successfully freed Revan from Darth Nyriss' estate. They hid in a cave in the jungle, where Revan watched the holo-vid of Bastila and their son numerous times."}, {"tag": "p", "text": "The four planned to destroy the Sith Emperor. Scourge got them into the Sith Citadel, but the Emperor's guards soon realized they were deceived. Revan and T3 rushed into the Emperor's throne room, and T3 sealed the doors to prevent the guards from interfering. However, the Emperor was more powerful than previously anticipated. He overwhelmed Revan with Force lightning, which almost killed him. T3, however, saved him by unleashing his flamethrower at the Emperor, making him lose concentration. It was then that the Emperor disintegrated T3 with the full power of the Force, making the loyal companion explode into countless pieces."}, {"tag": "h2", "text": "Abilities"}, {"tag": "p", "text": "T3-M4 had many abilities and was fully deserving of the moniker of \"utility droid\". Having never had a memory wipe, he developed a personality and quirks. There is evidence that he was even resistant to memory wipes; if another droid attempted to erase T3-M4's memory, T3 could replicate the other droid's numeric matrices, slice into its system, and short-circuit that droid instead. T3 was capable of playing the card game pazaak. He was programmed to force his opponent to go first, which Atton Rand believed to be cheating."}, {"tag": "p", "text": "T3-M4 could make security and computer spikes and could turn himself into a makeshift workbench which Meetra Surik used to upgrade or take apart objects in the field. He utilized weapons, such as blasters and disruptors, as well as one of many types of flame-throwers, scramblers, shock arms, and other droid-only weapons. He could be easily fitted with many types of droid armor and other miscellaneous upgrades. The droid was also a master of computer and security slicing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T3 is likely based on R2-D2, a utility droid from the Star Wars movies, who was also made famous by his limited vocabulary, quirky personality, and comical antics. It is also stated that T3 is an astromech droid, the same classification as R2-D2. T3-M4's relationship with HK-47 was different than that of C-3PO and R2-D2. T3-M4 and HK-47 did not get along, as seen in some dialogue with the two of them. T3-M4 actually attacks and disables HK-47 at a couple of points in Knights of the Old Republic II."}, {"tag": "p", "text": "T3's voice changes significantly from the first game to the second. In KOTOR, his speech is comprised mainly of whistles and musical notes, whereas in KOTOR II, he sounds more like R2-D2. His personality also changes, while he is loyal to his owners in both titles, he is more stoic in the original but somewhat more noble, more assertive, yet slightly more fond of making mischief in the sequel. The personality change is probably due to the addition of more memories, furthering his \"eccentricity.\""}, {"tag": "h3", "text": "Knights of the Old Republic"}, {"tag": "p", "text": "During the development of KotOR I, T3-M4 was known as T3-M3. A trace of this designation can be found in script files."}, {"tag": "p", "text": "T3-M4 cannot be purchased until after Revan agrees to the deal made by Canderous Ordo. This is due to T3-M4's previous purchase by Canderous for the Exchange. After Revan met Canderous, though, T3-M4 was given to Revan, to aid him in his quest to break into the Sith Base on Taris."}, {"tag": "p", "text": "Before purchasing T3-M4 from Janice Nall's store, it is also possible to buy another droid for a \"good price\". However, the droid will soon break apart. After returning the defunct droid, Nall will offer Revan back his credits. The fact that T3-H8 broke apart just after being bought is notably similar to A New Hope when Owen Lars buys a red astromech droid only for it to be discovered that it has a 'bad motivator.'"}, {"tag": "p", "text": "The initial price of T3 is 2,000 credits, but the player can use several methods of persuasion to lower the price. A calmer approach with Nall would lower the price to 1,500 while a darker one would make T3-M4 free."}, {"tag": "h3", "text": "Knights of the Old Republic II: The Sith Lords"}, {"tag": "p", "text": "Like most Knights of the Old Republic II: The Sith Lords companions, he was written by Chris Avellone."}, {"tag": "p", "text": "In an early game demo shown at the Electronic Entertainment Expo, T3 was cast as belonging to Bastila Shan."}, {"tag": "p", "text": "On the moon Nar Shaddaa the player has the option of selling T3-M4 to a droid dealer. Even if sold, T3-M4 will still come to Meetra Surik's aid after she is kidnapped and taken aboard Goto's droid yacht. This loyalty is no doubt due to the fact that T3 has not had a memory wipe in his lifetime."}, {"tag": "p", "text": "With a high skill rank in Repair and Computer Use, the Exile can improve T3's Constitution, Dexterity and Intelligence as well as learn a Moving Meditation that helps recover Force energy. A high skill rank in Computer Use also gives Surik the means of unlocking a message hidden in T3's memory core. The message shows Bastila Shan or Carth Onasi depending on Revan's gender and alignment, which can be chosen in the first dialogue with Atton Rand, early in the game."}, {"tag": "p", "text": "In cut content, Surik could ask T3 if he knew Mandalore. It would be here that T3 would display a hologram of Revan leaving Canderous on the edge of the galaxy although the hologram would not be seen by the player."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}