{"url": "T-70_X-wing_starfighter", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:New Republic starfighter classes", "Category:Resistance starfighter classes", "Category:T-70 X-wing fighters", "Category:X-wing models"], "nodes": [{"tag": "h1", "text": "T-70 X-wing starfighter"}, {"tag": "p", "text": "The T-70 X-wing starfighter, also known as the T-70 X-wing fighter, was the successor to the T-65B X-wing starfighter, manufactured by Incom-FreiTek Corporation for use by the New Republic Defense Fleet."}, {"tag": "p", "text": "Faster and more expensive and complex than the former T-65B, the T-70 featured advanced weaponry and proved more versatile than its predecessor, and was essential in both dogfights and capital-ship scale combat operations. Appropriated S-foils designs allowed a greater range of fire, while four KX12 laser cannons offered single, dual, and quad firing modes. A built in dual proton torpedo launcher with quick-change magazines permitted the utilization of alternative armaments. New Republic demilitarization efforts and corruption would ultimately see production of the vessel shifted to several well-connected manufacturers. The T-70 would be eventually replaced by the newer T-85 X-wing."}, {"tag": "p", "text": "Following its retirement from service in the New Republic Starfleet, the T-70 became the frontline starfighter of the Resistance in its fight against the First Order approximately thirty years after the Battle of Endor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The T-70 X-wing starfighter was a cruciform starfighter measuring 12.49 meters in length with a maximum capacity of a single pilot and bottom-loaded astromech droid, which fit into a socket that could be variably configured for different models. If needed, the droid could fly the starfighter without the aid of a pilot, and could even do so remotely."}, {"tag": "p", "text": "The vessel's targeting computer, flight controls and other essential piloting instruments were located inside an armored cockpit module, under which a removable liquid-cooled flight computer further aided the pilot in ship-based operations. Access panels for computer access and storage existed inside the 'nose' of the vessel, along with an auxiliary generator and storage area typically used for stashing survival gear. A small sensor window marked the location of the ships primary sensor array at the very tip of the nosecone, located behind an emergency beacon. Behind the pilot, a built-in life support system allowed the occupant to breathe in an oxygenated atmosphere. The sensors were superior to older models."}, {"tag": "p", "text": "Four Incom-FreiTek 5L5 fusial thrust Split-engines allowed the ship its noteworthy atmospheric and realspace maneuverability largely in part to the presence of calibrated retro thrusters with built-in electromagnetic gyros; a result of advances in miniaturization since the Galactic Civil War. Its smaller size compared to the T-65 model contributed to greater maneuverability. A centrifugal reactant fusion and ionization chamber and reactant injector aided the ships mechanical processes, along with a turbo impeller within the ships four engines which allowed the ship to quickly attain high speeds. Coolant feeds helped keep the temperature of the engines to a tolerable level, while the ship's S-foils also helped to shed waste heat. Four retro thrusters were placed in the ships 'forward' position, directly mirroring the 5L5 fusial thrust engines in the rear, along with ion accelerators. A single acceleration compensator was located underneath the front-section of the cockpit, and a single hyperdrive was located between the ships engines, allowing the vessel entrance into the pan-dimensional fabric of hyperspace. The engines used four GBn-682 motivators for hyperspace travel. The use of miniaturized components allowed for the addition of additional storage spaces."}, {"tag": "p", "text": "The T-70 featured a variety of offensive and defensive capabilities, the most prevalent being the presence of four wing-mounted Taim & Bak KX12 laser cannons. In a single wing, power couplings allowed an electrical current to power laser canon charge cells to accumulate enough energy for a laser bolt. From there, a laser generator would convert the energy-rich gas into a particle beam, with an installed static discharge coupling located behind the generator and a laser generator heat sink placed around the device. The beam would then travel down the 'barrel,' entering a plasma combination injector from where it would enter a laser cooling sleeve and would be focused through a long laser blast condensing channel, from where a laser-blaster converter at the end of the 'barrel' would fire a fully-charged energy blast. The long barrel would additionally help increase the stability and range of the energy bolt. Furthermore, a single externally mounted half-circle magnetic flashback suppressor helped protect the 'barrel' from feedback damage."}, {"tag": "p", "text": "To improve the KX12 laser cannons field of fire, an integrated S-foil system would allow the craft to enter two distinct flying profiles; one, a \"cruise mode\" where all four wings would be retracted, and an \"attack mode,\" where all four wings would scissor open, giving the X-wing starfighter both its signature shape and name. An S-foil actuator located in the rear of the ship next to the hyperdrive would help control S-foil mounted maneuvering repulsors and S-foil rear repulsor arrays within the T-70's wings."}, {"tag": "p", "text": "The T-70 also featured the ability to fire physical ordnance in the shape of a standard configuration of eight miniaturized Krupx MG7-A proton torpedoes, concussion missiles, or mag-pulse launchers owing to the presence of a quick-change magazine; which allowed the pilot to swap their torpedoes with other payloads. A proton-torpedo firing rack held such ordnance underneath the armored cockpit, where the spent torpedo casings would also be stored alongside the live ammunition. Incom-FreiTek included provisions for a rotating underslung blaster cannon, automated Ax-190-B model, which could offer greater rearward defense than a deflector shield generator alone. This shield generator was mounted in the rear of the vessel opposite the hyperdrive, and helped protect the ship from both superficial and severe weapons damage. Sensor-scattering ferrosphere paint also aided the ship in avoiding enemy detection. For targeting systems, the craft was equipped with a Fabritech ANq 5.8 tracking computer with IN-622-A \"Sightline\" holographic imaging system"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Incom-FreiTek T-70 X-wing starfighter was a model of starfighter developed for the New Republic based off of the classic T-65B X-wing starfighter design of the Galactic Civil War. At least one prototype had been constructed prior to the Battle of Jakku in 5 ABY. A prototype was used by Yrica Quell on her mission to Coruscant concurrent with the Battle of Jakku. Taking advantage of new advances in miniaturization and providing a more heavily armored fighter, the T-70 would see mass production for use in the growing New Republic. However, owing to the Military Disarmament Act and rampant corruption, continued production of the craft would fall into the hands of a few well-connected starship manufacturers. They were sold to Republic-allied planetary defense forces. In time, it would be replaced by the T-85 X-wing."}, {"tag": "p", "text": "Owing to its prevalent use in local planetary defense forces and cheaper cost of appropriation, it would see extensive use within General Leia Organa's Resistance against the First Order. Additional craft were donated by sympathizing Senators within the Galactic Senate. Poe Dameron would become famous for his own T-70 X-wing fighter codenamed Black One, from which he led both Blue and Red Squadrons from the Resistance base on D'Qar. The vessels would also see the destruction of Starkiller Base in the Battle of Starkiller Base thirty years after the Battle of Endor. X-wings also fought in the Battle of D'Qar, protecting the bomber squadron. For the battle, Black One was equipped with an experimental thruster booster pod. Afterward, the X-wings continued to be a mainstay of the Resistance. Their pilots scrambled into action before the Battle of Exegol."}, {"tag": "p", "text": "Compared to the new generation of First Order TIE fighters, the T-70s were faster and more expensive and complex, but also more versatile and able to fight both starfighters and capital ships."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The T-70 X-wing fighter model was on display at 2015's Star Wars Celebration Anaheim, which gave its model name and that it was used by the Resistance. The fighter has appeared in both Star Wars: Episode VII The Force Awakens teaser trailers. The X-wing was one of the exclusive blueprints in Star Wars: Ships of the Galaxy, released on Force Friday on September 4, 2015."}, {"tag": "p", "text": "For Episode VII, at least one full-size mockup was built. The design of the T-70 X-wing fighter strongly resembles the early design of the first X-wing seen in the original concept art done by Ralph McQuarrie for A New Hope, although the resemblance was only discovered after the design was finalized. At one point, the concept artist \"Visualists\" were thinking about a two-person craft."}, {"tag": "p", "text": "Star Wars: The Visual Encyclopedia suggests KX9 laser cannons instead of KX12s."}, {"tag": "p", "text": "Star Wars Encyclopedia of Starfighters and Other Vehicles only gives a speed of 1,050 kph (652 mph) and a class 2 hyperdrive."}, {"tag": "p", "text": "Concept art for the Disney+ television series, The Mandalorian, featured a T-70 leading a squadron of T-65s in \"Chapter 6: The Prisoner,\" which aired on December 13, 2019. However, the T-70 did not appear in the episode itself, and only T-65s were featured exclusively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}