{"url": "T-65_X-wing_starfighter/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starfighter classes", "Category:Confederation starfighter classes", "Category:Galactic Alliance starfighter classes", "Category:Hapan starfighter classes", "Category:New Republic starfighter classes", "Category:T-65 X-wing starfighters", "Category:X-wing models"], "nodes": [{"tag": "h1", "text": "T-65 X-wing starfighter"}, {"tag": "p", "text": "The Incom T-65 X-wing starfighter was the primary all-purpose starfighter of the Rebel Alliance and its successor governments. Known for its versatility and exceptional combat performance, it was a favorite with Rebel and New Republic pilots. Possessing deflector shields, a hyperdrive, an R2 astromech for repairs and navigation, and a complement of proton torpedoes, the X-wing allowed the Rebellion to launch raids in Imperial space with improved odds of a successful mission."}, {"tag": "p", "text": "The X-wing played a major role in the Galactic Civil War following its capture on Fresia and the defection of its designers to the Alliance. It was most heralded as the fighter that destroyed the Death Star at the hands of Luke Skywalker. Later in the war, it would form the backbone of the Alliance Starfighter Corps, defending Alliance ships and leading attacks on Imperial vessels and installations. Most importantly, it could perform on near equal terms with the Empire's high-performance TIE fighters when handled by an experienced pilot."}, {"tag": "p", "text": "Pilots of Rogue Squadron favored using the multi-role X-wing fighter, flying it as often as they could on most missions; they only employed other craft for highly specialized missions, such as missions that required ion cannons. The X-wing was so predominantly flown by Rebel and New Republic forces that it became a symbol of their faction, much like the TIE fighter and Star Destroyer were symbols of the Galactic Empire."}, {"tag": "p", "text": "Thanks to continued upgrades to the basic design and improved tactics, the X-wing series remained one of the galaxy's predominant multi-role starfighters for over 40 years."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Airframe"}, {"tag": "p", "text": "X-wings were reasonably maneuverable starfighters. They had two pairs of wing-like strike-foils, or S-foils, mounted at the rear of the craft on opposite sides. The foils on each side locked in place flush against each other; during combat, however, the foils were folded out to increase the spread coverage of the laser cannons mounted at the tips of the foils. This gave the craft its distinctive X-like appearance when viewed from the front or rear. The cannons on some earlier models could not be fired with the S-foils in locked position, perhaps as a safety feature. During hyperspace travel, the S-foils remained locked to conserve energy."}, {"tag": "p", "text": "In some models, its already impressive velocity was tweaked to allow short microbursts of speed. However, in order to utilize this feature, the weapons systems had to be switched off and the S-foils locked flush against each other. Other models utilized the locked foils while maintaining weapons, albeit at reduced power and accuracy."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "The X-wing carried four Taim & Bak KX9 laser cannons (listen (help·info)), along with dual launch tubes for proton torpedoes. Other warheads, such as concussion missiles, could be fitted as an alternative secondary weapon. However, this required considerable time and effort on the part of the technical crews, and the overall versatility of the proton torpedo was ideally suited to the X-wing's varied mission profile and was therefore the weapon of choice. During the early years of the Galactic Civil War, the Rebellion had a small supply of such weapons, due to their high price. During the Battle of Yavin, for example, most X-wings carried only one set of such warheads, including Luke Skywalker's ship. To aid in the firing of these weapons, an ANq 3.6 tracking computer was installed, giving pilots advanced tactical imagery to target, aim, and launch the torpedoes. This tracking computer had a success rate of 98.7 percent."}, {"tag": "p", "text": "The X-wing's laser cannons had various settings:"}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "Sublight propulsion was generated by four Incom 4L4 fusial thrust engines, which gave the starfighter relatively fast space and atmospheric speed. The X-wing, unlike most fighters of the TIE Series, was equipped with a hyperdrive. This made it capable of entering hyperspace, and allowed it to operate independent from large support ships. Fighter squadrons could strike out on their own, without the need for a carrier; this autonomy suited the Rebellion, as it served their hit-and-run tactics perfectly."}, {"tag": "h3", "text": "Flight systems"}, {"tag": "p", "text": "The fighter had space for one pilot, assisted by a droid (such as an R2-series astromech droid unit) in an external socket, which monitored the status of the craft and could make emergency repairs. The onboard droid also managed hyperspace calculations—storing pre-calculated coordinates—operated individual systems, and could even fly the craft without the aid of a pilot. This would allow the pilot to rest during missions, or save labor as the X-wing was routinely moved around inside hangar bays. Likewise, its targeting sensors could track up to 1,000 moving sublight objects, and also acquire 20 \"bogeys\" simultaneously, the latter function considered especially useful for shifting targets rapidly during starfighter combat."}, {"tag": "p", "text": "The X-wing's flight controls were similar to those of the T-16 skyhopper, an airspeeder also produced by Incom Corporation. This meant pilots were able to adapt with minimal training. A skilled recruit with enough hours on a T-16 could pilot an X-wing within hours of first entering the craft. Rebel technicians used this fact to train new pilots without using any of the expensive X-wings. This also allowed future X-wing pilots to be trained undercover on Empire-controlled worlds. The cockpit itself was fitted with a mixture of miniaturization and functionality, including a compact yet efficient life support system that provided a rich enough atmosphere to eliminate the need for bulky in-flight suits, and also contained hyper-receptive sensors and long-range communications gear that allowed the X-wings to operate independently from a home base at extreme distances."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Alliance service"}, {"tag": "p", "text": "The X-wing was originally designed by Incom Corporation for the Empire by Vors Voorhorian. It was directly descended from the old Z-95 Headhunter, built by Incom and Subpro, with lessons learned from the ARC-170 starfighter of the Clone Wars. The fighter was advertised by the Galactic Defense Review prior to 1 BBY. After the Galactic Empire planned to nationalize the Incom Corporation, the entire engineering team defected to the Rebel Alliance with the prototypes hidden on Fresia."}, {"tag": "p", "text": "After four prototypes were extracted from Fresia during the Battle of Fresia, it first encountered Imperial forces in the Battle of Turkana. Many more of the ships were liberated from an Incom assembly facility prior to the Battle of Yavin. The Rebel Alliance soon began building its own X-wings in clandestine drydocks and factories scattered throughout the Outer Rim Territories, though decentralized production and the scarcity of various high-grade alloys used in the X-wing's construction meant that squadrons sometimes had to endure agonizing delays before new fighters arrived. Besides its usage by the Rebel Alliance, a Starfighter volunteer squadron by the name of the Lightspeed Panthers utilized several customized T-65 X-wing starfighters against several TIE/LN starfighters during the Fei Hu campaign, and demonstrated the fighter's superiority by taking down 286 TIEs within 9 months while only losing 4 of their own X-wings. This eventually led to the Empire's development of the TIE/IN interceptor and, later, the TIE Hunters, a direct counter to the X-wing that possessed S-foils, proton torpedo launchers, and ion cannons."}, {"tag": "p", "text": "The X-wing was continually updated throughout its design lifetime. The T-65B was the primary X-wing fighter used by the Rebellion in the Galactic Civil War. The B model is the version Luke Skywalker used at the first Death Star during the Battle of Yavin. There was also the enhanced T-65C-A2 developed by the Alliance. These versions were rare during the Galactic Civil War due to limited production capabilities. The T-65AC4 was another variant produced during the New Republic. Its engines allowed it to fly at speeds comparable to an A-wing. One notable design, the T-65D-A1, replaced the astromech droid with an internal computer core for hyperdrive jump calculations but was considered a failure (partially due to ease of sabotage). The TX-65 was the X-wing trainer variant."}, {"tag": "p", "text": "Famous uses included the Battle of Yavin, where an X-wing piloted by Luke Skywalker destroyed the Empire's first Death Star, although nearly all the other X-wings that participated in the battle were destroyed. An X-wing piloted by Wedge Antilles also helped destroy the second Death Star's reactor at the Battle of Endor, in concert with the Millennium Falcon, starting a chain reaction that completely destroyed the battlestation. Despite the legendary combat prowess of the X-wing, however, 70 percent of X-wing sorties throughout the Galactic Civil War were reconnaissance missions, and Wing Commanders were taught to attack in strength \"only when the results will be spectacularly successful.\""}, {"tag": "p", "text": "The Galactic Empire also had access to X-wings, which they used in false-flag attacks during the Galactic Civil War. This includes the action at Delrakkin, and after the Battle of Endor, Kirtan Loor created a false Rogue Squadron."}, {"tag": "p", "text": "The X-wings were also used by outlaw forces, including guarding the freeport on Shador."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "It had been intended that the X-wing series would be replaced by the E-wing approximately six years after the Battle of Endor, but initial design issues relating to the weapons placement delayed wide-spread introduction into the New Republic military. Wide-scale deployment of the E-wing did occur (most notably in Fifth Fleet), but X-wing production continued on and may have equipped fighter squadrons not \"at the tip of the spear.\" One notable exception was Rogue Squadron, the Republic's most elite fighter squadron, which was known for its almost exclusive use of the X-wing."}, {"tag": "p", "text": "Shortly before the Yuuzhan Vong War, the New Republic fielded the J-series of X-wing, supplementing the more advanced and more expensive Series III E-wing. The XJ added a third torpedo bay where a cargo bay was previously, increasing the proton torpedo load up to nine. Engines, lasers, and avionics were also improved. The XJ was greatly improved in all respects over the earlier designs and was initially issued to starfighter squadrons with Jedi pilots."}, {"tag": "p", "text": "Three variants were developed, culminating with the T-65J3: the ultimate evolution of the X-wing. The X-wing's stutter fire capability was added in the invasion of the Yuuzhan Vong to overwhelm their singularity defenses. Some paramilitary groups were also equipped with earlier J-series fighters (probably the T-65J or the T-65J2); system-defense forces and poorer paramilitary groups may have had X-wings of varying age and capability. Many older X-wings were rebuilt into the T-65BR reconnaissance variant."}, {"tag": "h3", "text": "Galactic Alliance service"}, {"tag": "p", "text": "By the time of the Killik/Chiss conflict, two new variants of the X-wing were introduced. The first was the XJ5 series, also referred to as the ChaseX. The second variant was the StealthX. The XJ5s were mainly used by the Reconstruction Authority Space Patrol. The Jedi tended to use StealthX or earlier XJ3 series. The StealthX was a covert strike craft, equipped with features that reduced its visibility both visually and to sensors, though it could be located if it was silhouetted or launching proton torpedoes. The StealthX was described as being smaller than the XJ model, which was already half a meter shorter than the T-65C. The StealthX was also described as being a derivative of the XJ3, and likely classified as the XJ4."}, {"tag": "p", "text": "By the time of the Second Galactic Civil War, the Galactic Alliance was fielding XJ6s, and Luke Skywalker's Jedi-filled Hardpoint Squadron used these exclusively. The XJ7 would soon follow, being used at least by Rogue Squadron."}, {"tag": "p", "text": "There were two conflicting systems of identification for the X-wing. The basic designation \"T-65\" was constant, but the version modifier was inconsistent. In one of them, a letter was appended to the end in increasing value (T-65A, T-65B, T-65C, T-65D, etc.). A second system, the suffix \"AC4\" was used."}, {"tag": "h3", "text": "Cultural influence"}, {"tag": "p", "text": "During the Galactic Civil War, toy X-wings were apparently popular among children who wished to re-enact the adventures of the heroes of the Alliance. This was reminiscent of the Clone Wars, in which children would often play with action figures and vehicles to create their own version of the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In addition to miniature X-wings, the production crew of A New Hope constructed a full-sized X-wing for the Yavin 4 hangar sequence. Judicious editing and flat cardboard mock-ups made it appear as if there were dozens of full-sized craft."}, {"tag": "p", "text": "The X-wing is one of the few ships that is mentioned by name in the original trilogy. Even then, \"X-wing\" is only mentioned once, in Star Wars: Episode V The Empire Strikes Back. However in the 2004 edition of A New Hope, Garven Dreis mentions \"T-65\" to Luke Skywalker in an added scene."}, {"tag": "p", "text": "Originally, based on the Topps trading cards, the X-wing was said to be in use by the Rebels for decades, instead of a new craft. The inconsistency comes from the fact that Lucasfilm had not finalized all the details for the Star Wars features."}, {"tag": "p", "text": "The sound for its engines was generated by a passing artillery shell."}, {"tag": "p", "text": "The concept art for the X-wing shows the two engines split into four smaller engines on each wing when S-foils are open. This design was later used for the Z-95 Headhunter."}, {"tag": "p", "text": "An X-wing, alongside a TIE/ln starfighter, make a very brief cameo as an inside joke in Star Wars: Episode II Attack of the Clones during Anakin and Obi-Wan's chase of Zam Wesell, where the former vessel was chasing the latter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}