{"url": "T._Alvak", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire science and engineering personnel", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "T. Alvak"}, {"tag": "p", "text": "T. Alvak was a male Imperial pilot and astrogator. Raised in a naval family, Alvak desired to be a pilot from an early age. Enrolling in the Imperial Naval Academy, Alvak graduated as a navigator and served with the 98th \"Laser Storm\" Forward Observer Shuttle Wing for several years before attending the Tir training school based on the Imperial-class Star Destroyer Inflexible. Qualifying as a TIE starfighter pilot, he fought during the Solaest Uprising, earning a promotion to Flight Captain and the Distinguished Flight Medal. Alvak later served with the Solaest Fleet's Long Range Patrol Wing."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "T. Alvak was raised in a Naval family; his father was a career officer who had served in a variety of postings, including tours as a sub-navigator on starships, a harbor controller, and as the senior portmaster for the Imperial base on the planet Tieos in the Abrion sector of the Outer Rim Territories. From an early age, Alvak wanted to fly starfighters and was educated as a general engineer. He enlisted in the Imperial Naval Academy on Prefsbelt IV and qualified as a navigator. Graduating with honors in the top third of his class, Alvak was assigned to the 98th \"Laser Storm\" Forward Observer Shuttle Wing, serving as both an astrogator and emergency pilot. Two years later, he was advanced to Flight Leader upon completion of his solo astrogation trials by the promotion board."}, {"tag": "p", "text": "After serving with the 98th for a further two years, Alvak was transferred to the Tir training school based on the Imperial-class Star Destroyer Inflexible. Qualifying in a TIE/LN starfighter, Alvak was part of the Imperial response to the Solaest Uprising and was awarded the Distinguished Flight Medal for his actions during the campaign, along with a promotion to Flight Captain. He continued his career with the Solaest Fleet's Long Range Patrol Wing."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Alvak was considered to be a model Imperial officer, dedicated to the Imperial Navy and proud of his role within the institution. Upon graduation, Alvak swore an oath to defend the Empire and obey the Galactic Emperor, and he upheld that vow with great seriousness. His superior officers found Alvak to be competent and reliable, although they occasionally felt that he was a little disrespectful of their authority. Alvak's peers considered him to be intelligent and quick-witted with the uncanny ability to be able to locate a store of alcohol anywhere. His subordinates found him to be a thoughtful yet remote and demanding commander."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Alvak wore a TIE pilot's flight suit and carried a blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T. Alvak was first mentioned in The Star Wars Sourcebook, published by West End Games in 1987. His RPG statistics were used as an example of a typical Imperial TIE fighter pilot. In 1994, an updated edition of the sourcebook was released. Alvak's biography was still present in the new edition, but one change had been made. In the original entry, Alvak was noted as attending the \"TIE training school\" aboard the Star Destroyer Inflexible. In the 1994 entry, this was changed to \"Tir training school\". This article assumes that the later information is correct."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}