{"url": "T4-B_heavy_tank", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic vehicles", "Category:Crawlers", "Category:Tanks", "Category:Yutrane-Trackata products"], "nodes": [{"tag": "h1", "text": "T4-B heavy tank"}, {"tag": "p", "text": "The T4-B heavy tank was an all-purpose battle tank used by the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An updated version of the T3-B heavy attack tank, the T4-B was armed with two fire linked laser cannons, with three concussion missile tubes placed between them, the firepower of which was devastating against infantry units. Typically, missiles were used at long range, against any target, then the tanks would close in and engage the enemy with their powerful anti-armor laser cannons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The vehicle, along with the T2-B repulsor tank, was one of many new designs acquired by the Alliance during a raid on an Aridus manufacturing plant, and was among the heaviest armored units used by the Rebels during the course of the Galactic Civil War. It was a modified version of the T3-B heavy attack tank used previously by the Alliance."}, {"tag": "p", "text": "The T4-B provided the Rebels enough of a punch in ground conflicts to withstand significant Imperial ground forces. They were capable of defeating most Imperial ground vehicles of the time, including AT-STs, 2-M repulsor tanks, and TIE Maulers, as well as being capable of battling AT-ATs more effectively than lighter vehicles."}, {"tag": "p", "text": "Although powerful, the unit did have significant drawbacks. Its tracked design limited its mobility (though its mass and power more than offset this flaw) and was expensive to produce, leading the Alliance to limit its use."}, {"tag": "p", "text": "A T4-B was present inside the Rebel's Main Base during the Evacuation of Yavin. It was used by the operative X2."}, {"tag": "p", "text": "Soon after, Renegade Squadron used one during a skirmish on Ord Mantell. The Squadron also used one to defend a base on Boz Pity."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Battlefront: Renegade Squadron, the T4-B's missiles are fired from above the laser cannons and on top of the tank there is a mortar launcher."}, {"tag": "p", "text": "In Star Wars Battlefront: Elite Squadron, the T4-Bs are armed with two smaller anti-personnel/anti-armor blaster cannons above its tracks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}