{"url": "T-series_military_strategic_analysis_and_tactics_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Separatist battle droid models", "Category:T-series tactical droids", "Category:Tactical droid models"], "nodes": [{"tag": "h1", "text": "T-series military strategic analysis and tactics droid"}, {"tag": "p", "text": "The T-series military strategic analysis and tactics droid, also known as the T-series tactical droid, T-1, or standard tactical droid and initially designated the CDE-T, was a model of tactical droid manufactured by Baktoid Combat Automata. Used by the Confederacy of Independent Systems during the Clone Wars, T-1s aided in the coordination of their military, acting as advisors and often generals for their superior officers. The droids were deployed across the galaxy in many key battles of the war such as those at Christophsis and Ryloth, as well as the Second Battle of Geonosis."}, {"tag": "p", "text": "Ruthlessly intelligent, T-1s mostly steered clear of the war's front lines and instead commanded their troops from various Separatist headquarters. They exhibited independence larger than that of their B1-series battle droid comrades and, although they were loyal to the Separatist cause, they were not afraid to abandon their superiors to guarantee their own survival."}, {"tag": "p", "text": "Later on in the Clone Wars, the more advanced ST-series military strategic analysis and tactics droid was introduced but its predecessor still saw continued use up until at least 19 BBY. Despite the galaxy-wide deactivation of the droid army at the end of the war, remnants of the T-series could still be found well into the Imperial Era. During the Galactic Civil War, former Jedi Padawan Ahsoka Tano provided the crew of the Ghost with the head of a T-1, to aid them in their search for former Clone Captain Rex on Seelos."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "T-series tactical droids, also referred to as T-1s, were humanoid fourth class tactical droids standing at a height of 1.93 meters tall. They were manufactured by Baktoid Combat Automata, the company that also developed the B1-series battle droid, among a host of other droids specialized in warfare. Compared to the standard B1s who served under them, they were boxier in appearance and often sported varying color schemes."}, {"tag": "p", "text": "T-1s were designed to avoid the front lines and calculate battle strategies from the safety of flagships or other fortified locations. They were prone to expressing their superiority over all other droid models, due to their often high positions in military hierarchy. They were even known to sacrifice a large number of their own troops if they got in the way and leave behind their superior officers to survive if ordered. Additionally, their reliance on precise calculations meant they lacked imagination when dealing with unexpected situations, and soon enough the Galactic Republic began to exploit this in the Clone Wars. Although they were rarely seen engaged in combat, some T-series were observed wielding E-5 blaster rifles."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "T-series tactical droids served an important advisory role among the forces of the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. Highly intelligent, they were often given full authority over Separatist military elements by their commanding officers. The droids were utilized in many early battles of the war including the Battle of Christophsis and acted as both commanders of the Separatist Droid Army and the Confederacy navy. In 22 BBY, at least three T-series tactical droids were used by the Separatists during the Christophsis campaign. TI-99 served Harch Admiral Trench aboard his flagship, the Invincible, and fortified the Separatist blockade above the planet. Additionally, TJ-55 and his battalion of droids thwarted a Republic ambush in the capital city of Chaleydonia and another T-1 served under the command of Supreme Leader Asajj Ventress."}, {"tag": "p", "text": "During the Battle of Ryloth, TX-20 demonstrated the T-series' capacity for ruthlessness, in the Separatist defense of the city of Nabat. Using the city's population as living shields against the Republic's clone troopers, he forced the Republic forces to enter Nabat without explosive devices. Ultimately however, TX-20's arrogance blinded him and he underestimated Jedi General Obi-Wan Kenobi and his own Twi'lek prisoners, which consequently cost him his life. TA-175 also served the Separatists during the Ryloth campaign and acted as Emir Wat Tambor's adviser after TX-20's destruction. From his headquarters in Ryloth's capital city of Lessu, he recognized the threat of the Republic presence on the planet. When Count Dooku ordered Tambor to withdraw from Ryloth, TA-175 was eager to obey the Sith Lord. He eventually subverted Tambor's command when forces led by Mace Windu and Cham Syndulla attacked the capital, and left the emir to be captured by the Republic. Eventually, a T-series tactical droid was a prisoner in the Republic Center for Military Operations."}, {"tag": "p", "text": "In response to their inflexibility, the new ST-series military strategic analysis and tactics droid model was introduced as an improved successor to the T-1s during the war's later stages. These new droids were larger, more resistant to damage and even considered themselves superior to their organic counterparts. The T-series continued to see use in the war despite the super tactical droid's introduction, as several served during the Battle of Anaxes in 19 BBY. One such droid reported directly to Admiral Trench, who led the Separatists' campaign there."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "In the final hours of the Clone Wars, the newly christened Sith Lord Darth Vader sent a message to the Trade Federation on behalf of Darth Sidious, which called for the deactivation of the Separatist Droid Army and consequently all T-series models. With the rise of the Galactic Empire, the tactical intel accumulated by T-series droids became highly valuable to many factions attempting to combat the clone troopers who constituted much of the newly-formed Imperial Military. Trace and Rafa Martez were part of one such group and were sent to retrieve a T-series tactical droid from a decommissioning facility in Coronet City on Corellia. Clone Force 99 was also hired to accomplish the same feat for a monetary reward by the Trandoshan Cid, a former Jedi informant during the Clone Wars. The two groups confronted one another at the facility, when the Martez sisters acquired the head of the last remaining T1 before the Bad Batch could retrieve it. Encircled by Imperial Police Droids, the competing factions were forced to work together to survive. The Bad Batch's technician, Tech, was able to access the T1's program via a data rod, transmitting an activation signal to other battle droids in the facility in order to utilise them as reinforcements. During the group's ensuing escape, the tactical droid's head was destroyed, however Tech had copied its intel onto the data rod while accessing its program. The squad's sergeant, Hunter, decided to give the intel to the Martez sisters, as he believed it would serve a better purpose with them."}, {"tag": "p", "text": "Former Jedi Padawan Ahsoka Tano obtained the head of a T-1 at some point in time. During the Imperial Era, Tano became an integral part of the Phoenix rebel cell. In 4 BBY, she gave the T-series head to the Spectres to aid them in their search for her friend, former Clone Captain Rex, on the planet Seelos. The Spectres were able to feed the head power, at which point it scanned for a signal while simultaneously listing a set of numbers over and over again: 7567. Unbeknownst to the Spectres, the numbers were a reference to Captain Rex's former clone trooper designation and shortly thereafter, the Spectres homed in on a modified AT-TE, the source of the signal and Rex's new home."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "T-series tactical droids first appeared in Jedi Crash, the thirteenth episode of the animated series Star Wars: The Clone Wars' first season. Production-wise, they first appeared in Innocents of Ryloth, the first season's twentieth episode. Throughout the show, the droids were voiced by various actors including Matt Lanter, James Arnold Taylor, Ashley Eckstein, and Matthew Wood."}, {"tag": "p", "text": "The droids were created to regularly showcase a more capable villain without having to introduce a unique organic commander that would then need to be eliminated. The modulated voice pattern that they possess was partly inspired by the voice of the Cylons in the original Battlestar Galactica series. The word \"tactical\" was also written along the side of at least one tactical droid's head in Aurebesh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}