{"url": "TC-14", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Feminine programming", "Category:TC-series protocol droids", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "TC-14"}, {"tag": "p", "text": "TC-14 was a silver-plated TC-series protocol droid with feminine programming who was manufactured by Cybot Galactica. She served aboard the Trade Federation flagship, Saak'ak, where she frequently received memory wipes that left her permanently confused and with no personality. In 32 BBY, she was aboard the Saak'ak when it was part of the Federation's blockade of the planet Naboo."}, {"tag": "p", "text": "The droid greeted the Jedi Qui-Gon Jinn and Obi-Wan Kenobi when they arrived aboard the vessel to negotiate an end to the blockade and reported that the visitors were Jedi to the Neimoidians in charge of the starship. They sent her back to distract the Jedi and then attempted to assassinate the pair while TC-14 was serving the Jedi drinks. The Jedi allowed TC-14 to leave unharmed, but she was later destroyed during the Battle of Naboo after being transfered to the Lucrehulk-class Battleship Vuutun Palaa."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Greeting the Jedi"}, {"tag": "p", "text": "Manufactured by Cybot Galactica, TC-14 was a TC-series protocol droid with feminine programming who served the Trade Federation as the personal assistant of Viceroy Nute Gunray. During a trade dispute in 32 BBY, she was stationed on board the Federation's flagship, Saak'ak, when the group blockaded the planet Naboo in the Naboo system under the orders of the Sith Lord Darth Sidious. The Galactic Republic sent the Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to negotiate an end to the blockade, and after the Republic's cruiser landed in one of the Saak'ak's hangars, it was TC-14 who greeted the two Jedi at the hangar's entrance. She then led them to one of the flagship's conference rooms, where she left them to report back to the bridge."}, {"tag": "p", "text": "On the bridge, she informed the viceroy and Captain Daultay Dofine as quickly as possible that the ambassadors were Jedi, which horrified the Neimoidians. Gunray ordered Dofine to distract the Jedi while he contacted Sidious, but the captain refused and ordered TC-14 to keep the ambassadors occupied instead."}, {"tag": "h3", "text": "Disposable distraction"}, {"tag": "p", "text": "TC-14 returned to the conference room with a tray of drinks for the two Jedi, who were growing restless. After they had both taken a cup from the tray, the pair leapt up and drew their lightsabers, having sensed the destruction of their cruiser in the hangar. TC-14 dropped the tray of drinks in shock and apologized as poisonous dioxis gas began pouring into the room through its vents."}, {"tag": "p", "text": "After some time, Gunray—who had ordered the death of the Jedi after hearing from Sidious—sent a squad of battle droids to check if the pair had perished. They opened the door to the conference room, which had been sealed, and readied their blasters; however, only TC-14 emerged, once again carrying the tray. The protocol droid quickly moved out of the squad's way, after which the two Jedi emerged from the gas and struck down the battle droids. The Jedi ultimately escaped from the flagship and the Federation, which then invaded Naboo. During the invasion, TC-14 was transferred along with Dofine to the Lucrehulk-class Battleship Vuutun Palaa, where she perished when the ship was destroyed at the culmination of the Battle of Naboo. The B1-series battle droid R0-GR later wrote about TC-14 in his Droidography book, musing that if she had not followed her programming quite so precisely when dealing with the Jedi ambassadors then the Clone Wars might never have occurred."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "TC-14 had silver plating, yellow photoreceptors, and stood 1.67 meters tall. Her duties included carrying out the basic roles of a droid in her position, such as welcoming guests and serving refreshments. TC-14 received frequent memory wipes from the Trade Federation, far beyond what was recommended for a droid, and as a result had no personality, conscience, or memory of any secrets she may have been privy to. The constant memory tampering also resulted in the droid having no life experience to compare to, meaning that she found everything slightly confusing and had a permanently baffled demeanor. As such, she found life aboard the Neimoidian vessels constantly bewildering as her owners began preparing for war, and she was confounded by the assassination attempted on the Jedi as she served them drinks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TC-14 was physically portrayed by John Fensom and voiced by Lindsay Duncan in the prequel trilogy film Star Wars: Episode I The Phantom Menace, which was released on May 19, 1999. Casting director Robin Gurland offered Duncan the role after the actress auditioned for the role of Shmi Skywalker. She was sent an artist's rendition of the character and then recorded her dialogue over a fairly short amount of time in a London recording studio. Director George Lucas and Gurland were present for the recording and played a rough cut of the film for Duncan. She claimed that the film was the only work she had ever done that impressed her young son."}, {"tag": "p", "text": "TC-14 was built from the same costume template as C-3PO. An alternate version of the scene where TC-14 greets the Jedi was animated and included two computer generated droids discussing the arrival of the Republic cruiser, with one stating that it must be important if Gunray sent a \"useless protocol gearhead\" to greet them. This scene was included in a revised fourth draft of the script dated to June 23, 1997, which also uses the name \"TC-3\" for TC-14 and refers to the character with male pronouns. In the Star Wars Legends continuity, TC-14 appeared prior to the release of The Phantom Menace in the film's novelization, which was written by Terry Brooks and released on April 21, 1999."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}