{"url": "Battle_of_Coruscant_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Battles of Coruscant", "Category:Battles of the Yuuzhan Vong War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Coruscant  (Yuuzhan Vong War)"}, {"tag": "p", "text": "The Battle of Coruscant, also known as the Fall of Coruscant or as the First Battle of Coruscant, was a titanic battle which resulted in Coruscant, the capital of the New Republic, falling into the hands of the invading extragalactic Yuuzhan Vong. It was one of the most ferocious battles of the Yuuzhan Vong War and perhaps the most destructive conflict witnessed on Coruscant during its long history."}, {"tag": "h2", "text": "The Battle for Coruscant"}, {"tag": "h3", "text": "Preparations"}, {"tag": "p", "text": "Warmaster Tsavong Lah's strategy called for an eventual invasion of the galactic capital of Coruscant. His initial plan revolved around gathering several large fleets and combining them with his own. The plan, which was called Battle Plan Coruscant, also hinged on the Yuuzhan Vong conquering the world of Reecee, which they planned to use as a staging area. The Yuuzhan Vong took Reecee and managed to almost completely destroy the New Republic fleet which had been based there. However, following the Yuuzhan Vong capture of Reecee, Han and Leia Solo scouted a nebula which was known as the Black Bantha."}, {"tag": "h3", "text": "The Yuuzhan Vong attack"}, {"tag": "p", "text": "As foreseen by Mace Windu nearly five decades before the start of the Yuuzhan Vong War, an enormous Yuuzhan Vong warfleet attacked Coruscant from the OboRin Comet Cluster, having first assembled at Borleias. They used refugee ships containing prisoners from earlier battles to shield their forward elements. Even with the efforts of a number of influential leaders, the New Yuuzhan Vong invasion fleet was simply too immense to repel: commanders such as Garm Bel Iblis, who commanded the Second Fleet Group, attempted to confront the Yuuzhan Vong fleet head on; Admiral Traest Kre'fey, commander of the First Fleet Group, who chose to harass the invaders through long range combat and bombardment; Wedge Antilles, commander of the Third Fleet Group, who throughout the battle ran a running assault against the rear of the Yuuzhan Vong fleet; and Carlist Rieekan, who commanded the Coruscant Planetary Defense Force, organized and led the ground defense of Coruscant. It was said that the Yuuzhan Vong fleet numbered \"tens of thousands\" of ships, and that half of the New Republic Defense Fleet was present."}, {"tag": "p", "text": "For the battle, Borsk Fey'lya gave Admiral Sien Sovv, Supreme Commander of the New Republic Navy, full command of the fleet. Sovv's unwillingness to risk the refugee ships in order to stop the Yuuzhan Vong advance led to disciplinary breakdowns and caused Bel Iblis to eventually take full command of his fleet—leaving Kre'fey with only a few thousand ships while others joined Bel Iblis. In front of the Senate, and broadcasted across Coruscant, Fey'lya then attempted to relieve Sovv of command over the defense of Coruscant, leading to protests from the Senate and a number of military officers (several who owed their ranks to Sovv) - including Admirals Rabb and Kre'fey, Generals Muun, Yeel and Rieekan, Commander Godt and Commodore Brand. A distress signal was sent out to the various other New Republic fleets stationed at Corellia, Kuat, Balmorra and Kashyyyk, but no reinforcements were able to arrive in time to affect the outcome of the battle."}, {"tag": "p", "text": "The refugee ships, which had been taken from captured refugee convoys from worlds including Ralltiir and Rhinnal and had been commandeered by the Yuuzhan Vong, were then deliberately piloted into Coruscant's shields to weaken them. This tactic eventually worked, as whole shield-grids began to fail, and the surface-based shield generators were gradually destroyed. To combat the suicidal refugee ships, Coruscant's orbital defense platforms were put into intense service, but even these were not enough to stop the advance of the Yuuzhan Vong. Eventually, Coruscant's skyline was sodden with crashing vessels, and plasma fire rained down from the battle above the planet. Even the New Republic's Orbital Defense Headquarters facility was crippled, and fell out of orbit, crashing to the surface of Coruscant."}, {"tag": "p", "text": "As the space battle continued, the Jedi discovered that the Yuuzhan Vong had learned from earlier defeats and had brought into service several yammosk war coordinators, instead of the traditional 'one'. This effectively worked in the Yuuzhan Vong's favor, as the Jedi were now unable to destroy a single yammosk and thus send enemy forces into disarray. Nonetheless, in an effort to influence the battle, and cause as much confusion for the enemy as possible, Luke Skywalker and a number of other Jedi from Eclipse Station targeted the war-coordinating yammosks, and managed to destroy four of them."}, {"tag": "h3", "text": "A desperate rescue"}, {"tag": "p", "text": "Meanwhile, Han Solo and Leia Organa, on board the Millennium Falcon, attempted to evacuate Chief of State Borsk Fey'lya from the planet, but were tasked with rescuing Luke Skywalker and Mara Jade Skywalker at the Western Sea."}, {"tag": "p", "text": "The second assault wave consisted of thousands of Yorik-trema dropships, Tsik-Seru airskimmers, swarms of Yorik-vec assault cruisers and coralskippers, legions of Yuuzhan Vong warriors, and Chazrach support troops. In desperation, Bel Iblis' fleet was firing on the refugee ships in an attempt to halt the enemy advancement, but this tactic fell foul of Admirals Sovv and Kre'fey, who did not agree with the killing of innocent refugees. Coruscant did have extensive mine fields, but these didn't have quite as large an impact as desired."}, {"tag": "p", "text": "With forces closing in on him at the Imperial Palace, Borsk Fey'lya declined the Solos' offer of transport, deciding to remain rather than be branded a coward. Before their departure, Fey'lya asked Organa Solo to make one final address to the people of Coruscant. She implored the people of the galaxy to never give up in the fight against the Yuuzhan Vong."}, {"tag": "p", "text": "Following the Solos' departure, Tsavong Lah's aide Romm Zqar tried to force Borsk Fey'lya to surrender. When Fey'lya refused, he was killed. Before the Chief of State died, however, he had planted a proton bomb in the Imperial Palace that would be triggered by the cessation of his heartbeat. The inevitable detonation of this proton bomb resulted in the deaths of Romm Zqar, 25,000 Yuuzhan Vong warriors, the destruction of a portion of the Imperial Palace along with its data towers, many surrounding buildings, and several Yuuzhan Vong vessels. Prior to his death, Fey'lya had ordered the data towers to be destroyed, to prevent valuable information getting into the hands of the Yuuzhan Vong. Through his suicide tactic, he had achieved this task himself."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The battle lasted for several days, with heavy casualties on both sides. The Chazrach slave soldiers would perform most of the hard fighting deep down in the lower levels of Coruscant. Many of the planet's citizens were forced to flee the capital world during the battle, while those who did not manage to escape were forced to retreat into the city planet's lower levels. Potentially one hundred billion of the planet's trillion inhabitants were killed or enslaved by the Yuuzhan Vong as a result of the battle, and hundreds of millions of the survivors were sent into space on camp ships to further reduce the resources of the New Republic."}, {"tag": "p", "text": "Many Senators, fearing for their lives, commandeered bits of the fleet and escaped to their sectors as the battle progressed. The New Republic Defense Fleet was somewhat diminished as a result. The third wave was a biotoxin in the form of green algae released by the Yuuzhan Vong which devoured many of the buildings including dead bodies and left behind black spots. Coralskipper and Yorik-Vec squadrons bombed the already-devastated city world, causing damage to the defenders. The Yuuzhan Vong eventually captured Coruscant and had it terraformed and renamed Yuuzhan'tar, after their lost homeworld."}, {"tag": "h3", "text": "Yuuzhan Vong losses"}, {"tag": "p", "text": "Despite scoring a massive symbolic and strategic victory against the New Republic, Tsavong Lah had also made a huge military mistake. By simply sending the Warriors in waves, and by ordering some of his own vessels to collide with the planet's shields, he caused massive casualties among his own soldiers. The first two waves he sent into the teeth of the New Republic fleets and orbital defenses were wiped out; the third wave, although successful, paid an exorbitant price with severe losses."}, {"tag": "p", "text": "Supreme Overlord Shimrra would later comment that, following the costly losses of 'Battle Plan Coruscant', a full third of the Warrior caste had died during the course of their invasion of the galaxy. The Yuuzhan Vong now had a massive empire to control, and Yuuzhan Vong Domains once again began competing for resources. Shortly after this battle, the Yuuzhan Vong's single strategic reserve was destroyed in a New Republic ambush and, combined with the horrific losses, as well as the destruction of several other Vong fleets in other places, it meant from this point on if the Yuuzhan Vong moved forces to any part of the galaxy, it would be at the price of somewhere else being left undefended."}, {"tag": "h3", "text": "Disintegration and despair"}, {"tag": "p", "text": "New Republic Army Colonel Stavin Thaal was one of the few New Republic officers who elected to remain behind rather than evacuate. He and his soldiers under him relocated to Vandor-3, the next inner planet of the Coruscant system, where they formed a guerrilla unit called the Pop-Dogs. Thaal and his Pop-Dogs harassed the Yuuzhan Vong until the system was liberated at the end of the war."}, {"tag": "p", "text": "The New Republic all but disintegrated after the battle. Though the Senate had been withdrawing fleets to the Core Worlds since the war began, many of these fleets lost coordination. Several planets immediately capitulated outright, receiving little better treatment."}, {"tag": "p", "text": "In the initial aftermath, Councilor Pwoe, the Quarren Senator for Mon Calamari, declared himself Chief of State, intending to sacrifice the New Republic in his hopes for securing his own survival. The Senate denounced Pwoe, but the Republic did not regain any sort of cohesion until the election of Cal Omas as President of the Senate."}, {"tag": "p", "text": "Cal Omas, a former Rebel soldier, had come to the conclusion that the Senate and the Advisory Council were grossly unqualified to conduct the War in any competent fashion, an opinion the New Republic populace also soon held. There was also the realization that the Yuuzhan Vong had broken their word too many times to be trusted with future negotiations."}, {"tag": "p", "text": "Perhaps most importantly, however, was that the actions of the Jedi at Coruscant had placed them on the populace's better side. Using this political clout, Omas reorganized the New Republic into the Galactic Federation of Free Alliances, stripping the Senate of much executive power, and confining it to legislative duties. He also formed the High Council, which finally gave the Jedi a role in the war effort."}, {"tag": "p", "text": "While it may have killed the New Republic, the Fall of Coruscant also decided the eventual outcome of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}