{"url": "TB-73/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic starships", "Category:Pelta-class frigates"], "nodes": [{"tag": "h1", "text": "TB-73"}, {"tag": "p", "text": "TB-73 was a Pelta-class frigate used during the aftermath of the Second Battle of Geonosis, when it was tasked with a supply mission to Ord Cestus during the Clone Wars. The clone troopers aboard were infected with Geonosian brain worms and killed the crew. Jedi Padawans Ahsoka Tano and Barriss Offee, the latter being infected and the former saving the ship, were also on board during the crisis. TB-73 reached its destination, and the brain worms were captured and analyzed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "TB-73 was a standard Pelta-class frigate fitted for supply runs. It had a base color of white with red markings on the top of the bow. It had one primary engine and a Class 2 hyperdrive. TB-73 also contained shields inside the ship, blocking off certain areas of the ship such as the bridge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "TB-73 was used by the Republic Navy around 22 BBY."}, {"tag": "p", "text": "It was sent to Geonosis following the previous conflict. There, Padawans Ahsoka Tano and Barriss Offee, along with Tango Company, were stationed aboard the ship during a medical supply run to a station near the planet Ord Cestus. Unbeknownst to the Jedi, company member CT-9544 had been infected with a brain worm and was carrying eggs to infect all aboard. TB-73 took off from Geonosis and went into hyperspace. While in hyperspace, trooper Scythe planted the eggs and infected some troopers in their quarters while they lay asleep. The brain worms quickly gained control, and soon all troopers were infected. The infected clones began to take over the ship, killing the pilots and attempting to kill the two Jedi, who were eating in the mess hall. The troopers in the bridge set the ship to autopilot and raised all the shields, preventing Ahsoka and Barriss from reaching the bridge."}, {"tag": "p", "text": "The two Jedi moved through the vent system of the ship and decided to split up to reach the reactor room and the communications station. Barriss was caught by an electric trap just short of the reactors and also got infected by the clones. Ahsoka reached the comms station and contacted Jedi Master Kit Fisto, sharing the horrifying news with him. She then turned to find an infected Barriss Offee waiting for her. The two began a duel the young Padawan escaped from through the air ducts. After contacting Anakin Skywalker and finding out that the brain worms die in cold, Ahsoka went to TB-73's cooling units and ruptured them, opening up a freezing fog."}, {"tag": "p", "text": "The brain worms began to die within the troopers, and Ahsoka found her way to the bridge just as TB-73 left hyperspace. She began to take control of the ship when Barriss attacked her again. They cut open one of the coolant tubes, which Ahsoka blasted into Barriss's face. The worm began flailing around in Barriss's mouth as she slowly came out of the trance. Meanwhile, two tugboats were attempting to dock TB-73 into the space station and finally succeeded. Kit Fisto and his team quickly boarded the ship and found Barriss and Ahsoka covered in frost on the cockpit floor. The two were taken to the infirmary in the Ord Cestus medical station, where they were met by Master Fisto and Skywalker."}, {"tag": "h2", "text": "Command and crew"}, {"tag": "p", "text": "TB-73 had two clone pilots at its helm and was under the command of Jedi Padawans Ahsoka Tano and Barriss Offee. Tango Company was stationed aboard TB-73 during its ill-fated supply mission to the Ord Cestus medical station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TB-73 docks into the medical station horizontally, not vertically like the ships in \"Shadow of Malevolence.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}