{"url": "TC-326", "categories": ["Category:Canon articles", "Category:Galactic Republic droids", "Category:Masculine programming", "Category:Republic Navy personnel", "Category:TC-series protocol droids"], "nodes": [{"tag": "h1", "text": "TC-326"}, {"tag": "p", "text": "TC-326 was a masculine TC-series protocol droid manufactured by Cybot Galactica that served in the Republic Navy's Open Circle Fleet during the Clone Wars. He was temporarily assigned as Archduke Poggle the Lesser's translator following his capture during the Second Battle of Geonosis. TC-326 was present for Anakin Skywalker's interrogation of the Geonosian leader, calmly carrying out his translation duties even as the Jedi Knight tortured Poggle for information."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A masculine TC-series protocol droid manufactured by Cybot Galactica, TC-326 was co-opted into military service upon the outbreak of the Clone Wars, a conflict fought between the Galactic Republic and Confederacy of Independent Systems. He was typical of the many 3PO and TC-series protocol droids that served in the Grand Army of the Republic,  translating for troops when they encountered species whose language and cultures they had not studied. In the year 21 BBY, TC-326 was temporarily assigned as translator for Separatist leader Archduke Poggle the Lesser after his captured during the Second Battle of Geonosis. On the planet Geonosis, the droid walked past the Nu-class attack/transport shuttle that was transporting Poggle to an orbiting Venator-class Star Destroyer. He accompanied the Geonosian leader to the Star Destroyer and translated for him during his interrogation by Jedi Knight Anakin Skywalker, who wanted to discover the parasitic Geonosian brain worms' weakness. Upon discovering that Poggle could resist mind tricks, Skywalker physically struck the Geonosian and throttled him with the Force until he surrendered the information that the Jedi Knight sought, revealing that the brain worms were susceptible to extremely low temperatures."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "1.67 meters in height, TC-326 had light blue photoreceptors and matte gray plating. When he was co-opted by the military, he was painted with the Republic fleet markings to indicate his assignment. TC-326 was covered in yellow markings, while the symbol of the Grand Army of the Republic adorned the left side of his chest plating. He was able to calmly carry out his duties when Anakin Skywalker tortured Poggle for information."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TC-326 first appeared, albeit unidentified, in \"Brain Invaders,\" the eighth episode of the animated series Star Wars: The Clone Wars' second season, which originally aired on December 4, 2009, where he was voiced by James Arnold Taylor. He was later identified as TC-326 in Star Wars: The Clone Wars: The Complete Season Two, a box set available on Blu-ray or DVD that included the entirety of the second season of The Clone Wars that was released on October 26, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}