{"url": "TD-H4", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Droid Gotra", "Category:Individual droids"], "nodes": [{"tag": "h1", "text": "TD-H4"}, {"tag": "p", "text": "TD-H4, nicknamed \"Tool\" or \"Die,\" was a droid believed to be centuries old. He was part of the Droid Gotra and befriended a young Han Solo on Corellia."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As of 13 BBY, TD-H4 was believed to be centuries old, being one of the only droids to still possess a fusion power core. Tool was always trying to modify himself so that he would be better equipped for any situation."}, {"tag": "p", "text": "During the waning days in which the Galactic Empire was in power over the galaxy, he befriended a young Han Solo, at the time a scrumrat for a Corellian gang called the White Worms. Tool did work for the Foundry, trying to stay as relevant as possible lest he be shut down."}, {"tag": "p", "text": "Around the year 13 BBY, a defector from the Empire, who called herself The Engineer, set up a secret deal on Corellia to sell her data cube to the highest-bidding crime syndicate. Tool, who had just joined the Droid Gotra, represented his gang, while young Han came to the auction to represent the White Worms. The other bidding syndicate was the Kaldana Syndicate. The Droid Gotra won the bid with one billion credits, though the Kaldana became hostile and ambushed the other representatives. Tool allowed himself to take heavy blaster fire so that Han could escape with the data cube."}, {"tag": "p", "text": "Han returned later with his friends from the White Worms, Qi'ra and a Rodian named Tsuulo. Tsuulo used his datapad to help repair the droid so that he could provide them with information on the cube. He told them about The Engineer, and they decided they wanted to give it back to her for a second bidding. The Droid Gotra bid the same amount, but this time, the Kaldana outbid them, having to sell their flagship in order to do it. Although they lost, the Droid Gotra offered The Engineer three hundred thousand credits to destroy the Kaldana ship after the transaction was complete, and she complied."}, {"tag": "p", "text": "Once she did so, the droids got to work with hunting down whatever Kaldana remained, wiping them all off the face of the galaxy. A few days later, Tool met with Han and Qi'ra, explaining what had been done, and said he wanted to thank Tsuulo for putting him back together with his own speeder. They informed him that Tsuulo had been killed by the Kaldana, and that he had a brother named Reezo, who was a Corellian street racer in desperate need of a new speeder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}