{"url": "TIE_Advanced_x1", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:TIE Advanced x1", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE Advanced x1"}, {"tag": "p", "text": "The TIE Advanced x1, or TIE/ad, was an advanced prototype starfighter that was part of the TIE line manufactured by Sienar Fleet Systems. Darth Vader notably flew a TIE Advanced x1 during the Battle of Yavin."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In designing the starfighters of its TIE line, Sienar Fleet Systems drew heavily on the designs of Kuat Systems Engineering ships such as the V-wing and Eta-2 interceptor. Sienar also experimented with advanced models featuring localized improvements and secret technological breakthroughs, including the TIE Advanced v1 prototype, based on Sienar's Scimitar Star Courier. This prototype led to the TIE Advanced x1, which boasted a hyperdrive and deflector shield generator. A modified early prototype of the Advanced x1 line was flown by Darth Vader himself. Vader's fighter boasted greater speed and heavier firepower, featuring fixed-mounted twin blaster cannons and a cluster missile launcher. Vader specified a custom cockpit to accommodate his armored suit, and high-performance solar cells were fitted into the fighter's curved wings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of 4 BBY, the Sith Lord Darth Vader owned and operated an experimental modified early prototype of the TIE Advanced x1, which he piloted into the midst of a rebel fleet in a daring attack that resulted in the destruction of the rebels' flagship, Phoenix Home. He later used it to travel to Malachor to fight his former Padawan, Ahsoka Tano."}, {"tag": "p", "text": "During 0 BBY, during the Battle of Yavin, Vader again piloted his TIE Advanced x1 to pursue and eliminate the Rebel fighters attacking the first Death Star. He shot down several starfighters until his fighter was unexpectedly knocked out of the battle when a TIE/ln space superiority starfighter collided with it after a surprise attack by the Millennium Falcon. After the collision, Vader spun out of control into space, thereby escaping the destruction of the Death Star. The ship was disabled and left to float in the battle station's debris field, though Vader and his ship were later picked up by a Gozanti-class cruiser piloted by Ciena Ree and Berisse Sai."}, {"tag": "p", "text": "Following the Battle of Yavin, the Alliance to Restore the Republic provided stolen examples of the craft to Saponza's Gang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}