{"url": "TIE_Experimental_M2", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE Experimental M2"}, {"tag": "p", "text": "The TIE Experimental M2, also known as the TIE BigGun, was an experimental member of the TIE Series and a part of the TIE Experimental Project."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "One of the starfighters built by an Imperial research project led by Director Lenzer under the command of Grand Admiral Demetrius Zaarin, the M2 was essentially a standard TIE/LN starfighter but with the original chin-mounted laser cannons removed and a pair of turbolaser turrets mounted on the outer wing hubs."}, {"tag": "p", "text": "The fighter was roughly as fast as the standard TIE/LN, but its maneuverability was slightly lower. Like the other TIE Experimentals, the M2 was remotely controlled by a modified Beta-class ETR-3 escort transport."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alliance initially encountered the M2 when a B-wing starfighter group patrolled too close to one of their bases. Little is known about this incident, which may indicate the total destruction of the B-wing group. In order to gain more intelligence on the remote-controlled TIE project, Admiral Yamarus ordered a decoy convoy of MB-C1 medium transports and Z-95 Headhunters to draw out the Experimentals and their control craft."}, {"tag": "p", "text": "The lure was successful, and the Z-95's, armed with experimental ion pulse warheads, managed to disable or destroy the entire Imperial attack force. The TIEs were examined in detail, but the life-support systems on the control craft were rigged to malfunction as soon as the transports were disabled."}, {"tag": "p", "text": "Shortly thereafter, the Alliance gained intelligence that led them to the main TIE Experimental production facility, and the M2s were among the fighter screen defending the hangar ship Sardis and space station Obsidian."}, {"tag": "p", "text": "After the destruction of space platform Obsidian, no TIE Experimental fighters were seen again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}