{"url": "TIE/HU_Hunter_multi-role_starfighter", "categories": ["Category:Legends articles", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/HU Hunter multi-role starfighter"}, {"tag": "p", "text": "The TIE/HU Hunter multi-role starfighter was a starfighter from the TIE Series used during the Galactic Civil War by the Galactic Empire. Developed by the Empire as a means of countering the Rebel Alliance's T-65 X-wing starfighter, the TIE Hunter was used exclusively by storm commandos."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Twin ion engine Hunter was an Imperial starfighter which had a wing configuration roughly the reverse of a TIE/IN interceptor. Similar to the T-65 X-wing starfighter, the TIE Hunter possessed S-foils, which meant that they would open in attack mode and close in normal flight. This was largely because the TIE Hunters were created by the Galactic Empire specifically as a means to counter the T-65 X-wing starfighter. Unlike most other contemporary TIEs of the time, TIE Hunters were equipped with a hyperdrive and shields, making them more valuable than most starfighters the Empire utilized. Because of these characteristics, it was also considered to be the fastest TIE variant among the Imperial fleet. When the S-foils were closed, the craft could not fire its weapons."}, {"tag": "p", "text": "TIE Hunters were piloted by one individual. They were equipped with a weapon load-out identical to that of the BTL Y-wing starfighter; two laser cannons, two ion cannons, and a proton torpedo launcher with twelve proton torpedos."}, {"tag": "p", "text": "The craft carried a Class 1 hyperdrive, 2 days worth of supplies, and cost 100,000 credits, although in some cases they carried a Class 2 hyperdrive, a week's worth of supplies, and cost 275,000 credits."}, {"tag": "p", "text": "They also were waterproof, being capable of staying submerged in reservoirs for a week and lifting off no worse for wear."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point after the Fresian campaign in 1 BBY but before the Battle of Yavin, the Imperials developed the TIE Hunters, as a means to counter the Rebel Alliance's X-wing starfighters. Development was made even more urgent after the Battle of Yavin, after the Alliance established itself as an organized threat to the Empire. Sienar Fleet Systems did so via data from countless encounters with Alliance starfighters, with the Admiralty deciding after the promising results to issue the TIE Hunters to be under the exclusive ownership of the Imperial storm commandos, although they had been field-tested by TIE pilots such as then-Captain Soontir Fel. During one instance, then-Storm Commando leader Crix Madine and the other Storm Commandos during a mission hid their TIE Hunters in a reservoir to avoid detection, and retrieved them within a week. However, production ultimately took longer than the Imperial Navy brass desired."}, {"tag": "p", "text": "Imperial ace pilot Tam Blackstar led Dark Blade Squadron flying a TIE Hunter, while the rest of the squadron flew TIE Interceptors. Shortly after the Battle of Yavin, they participated in the attack on the Rebel base on Arda I, engaging the fleeing Rebel Alliance forces. During the battle, Blackstar pursued a lone RZ-1 A-wing interceptor through the narrow canyon known as the Gauntlet and fired a pair of proton torpedoes at the fleeing ship."}, {"tag": "p", "text": "A squadron of TIE Hunters was encountered by Wedge Antilles during his mission to Destrillion, although they were destroyed by the Rebel fighter ace. Several TIE Hunters were captured by the Rebel Alliance, and three of them were used in a successful raid on Fondor by Rogue Squadron shortly before the Battle of Endor. Rogue Squadron successfully made it past the shields and destroyed the unfinished Executor-class Super Star Destroyer being built there."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE Hunters appear in the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike. Players can fly the TIE Hunter in any completed mission after achieving all gold medals for the missions or by entering a cheat code, and it is stored in a room in the back of the hangar. Its history was further expanded in the 2014 Age of Rebellion roleplaying game sourcebook Stay on Target, as well as in the guidebook Star Wars: Imperial Handbook: A Commander's Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}