{"url": "TIE/D_Defender_Elite", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Ship stubs", "Category:Imperial projects and operations", "Category:TIE/D Defenders", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/D Defender Elite"}, {"tag": "p", "text": "The TIE/D Defender Elite was a specialized type of TIE/d \"Defender\" Multi-Role Starfighter. It was developed in 1 BBY, at the Galactic Empire's facilities on Lothal. Like normal Defenders, the Elite had three wings, heavy cannons, and a hyperdrive. However, it was much faster and had even more durable shielding. Sabine Wren speculated that it could outclass the Spectres' ship, the Ghost, in terms of speed. It was also equipped with a kill switch, as a security measure."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the battle against Grysk forces, in which Darth Vader operated a TIE/D Defender, the Dark Lord conveyed to Grand Admiral Thrawn his support of the ship. Vader went as far as telling the Chiss that he would put in a good word about the project with the Emperor. Vader also gave input on improvements that Thrawn that could implement in the fighter, which included that it needed to be faster, more heavily armed, and that controls should be made simpler. The grand admiral transmitted the instructions to the Lothal facility in charge of the project."}, {"tag": "p", "text": "A TIE/d Defender Elite was stolen by Ezra Bridger and Sabine Wren when they were caught attempting to steal the flight data recorder of the prototype while it was at the Lothal Imperial airfield for a planned test flight. Wren used the Elite to destroy most of the other ships at the airfield before she and Bridger escaped. Unbeknownst to Wren, who thought of using the Elite's hyperdrive to get the stolen data recorder to Yavin 4, the drive had been deactivated. Grand Admiral Thrawn decided to use the theft as an opportunity to test the prototype's flight capabilities, and had Vult Skerris send three of his TIE Interceptors after the stolen fighter. Bridger, flying the prototype, managed to shoot down all three pursuers, which Thrawn saw as a validation of the fighter's capabilities, given that Bridger was a relatively unskilled pilot, in the Grand Admiral's opinion. Thrawn then allowed Governor Arihnda Pryce to activate the kill switch, causing the fighter to crash. However, Wren had discovered the switch while she was deactivating the Elite's homing beacon, and immediately told Bridger to land. The Elite lost two of its wings, but Wren managed to prevent the third one from detaching, and the fighter crashed on it. Bridger and Wren escaped into the wilderness with the flight recorder and the Elite's hyperdrive, which they intended to install on Ryder Azadi's UT-60D U-wing starfighter/support craft as a replacement for the ship's non-functional one."}, {"tag": "p", "text": "Skerris was given a new Defender Elite, painted with yellow highlights, to fly in battle. He did so during the Rebel Alliance's attack on Lothal. Skerris shot down two pilots, Cleat and Duke, but was outmaneuvered by Hera Syndulla, who was leading the attack. She lured Skerris into the line of fire of Thrawn's flagship, the Chimaera. The Star Destroyer's fire took out both of their shields, and Hera then fired upon the Chimaera's sensor array before flying through the resulting smoke cloud. Skerris was forced to fly around the array, due to the Defender Elite having a far wider profile than Hera's T-65B X-wing starfighter. When he arrived, Hera was waiting and fired on his momentarily unshielded fighter, blowing off two of its wings and sending Skerris spiraling out of control. He crashed into an Arquitens-class command cruiser, which then in turn, crashed into a Star Destroyer, shearing off the capital ship's bridge superstructure."}, {"tag": "p", "text": "The project was placed on indefinite hold when Governor Pryce destroyed the fuel reserves to kill Kanan Jarrus, angering Thrawn."}, {"tag": "p", "text": "The Defender Elite had six more missiles than the regular Defender as well as red markings on the wings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}