{"url": "Battle_of_D%27Qar", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles in the Outer Rim", "Category:Battles of the First Order–Resistance war", "Category:Evacuations"], "nodes": [{"tag": "h1", "text": "Battle of D'Qar"}, {"tag": "p", "text": "The Battle of D'Qar, also known as the defense of D'Qar, the evacuation of D'Qar, the siege of D'Qar, or the attack on D'Qar, took place in 34 ABY, in the days that followed the Battle of Starkiller Base during their war with the First Order. Having destroyed the First Order's newest superweapon, Starkiller Base, the Resistance feared reprisal attacks now that their position had been revealed. Therefore, they were forced to abandon their base on D'Qar in order to find a new base of operations."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 34 ABY, the First Order superweapon known as Starkiller Base destroyed Hosnian Prime, capital planet of the New Republic, and the other worlds of the Hosnian system. The Resistance, led by General Leia Organa, sent a reconnaissance team to discover the location of the superweapon and report back to the Resistance at their base on D'Qar. The First Order tracked the reconnaissance ships back to D'Qar, thus discovering the location of their enemy forces. On the orders of Supreme Leader Snoke, who wanted to prevent the Resistance from finding Jedi Master Luke Skywalker and enlisting him in their fight against the First Order, General Armitage Hux prepared the weapon to destroy the Resistance. Without the New Republic Defense Fleet, however, the Resistance seemed doomed to destruction."}, {"tag": "p", "text": "Before the First Order could unleash the weapon, the Resistance sent a small strike force—ex-General Han Solo, his first mate Chewbacca, and former stormtrooper and Starkiller Base worker Finn—to Starkiller Base to disable the shields preventing the destruction of the base. Meanwhile, Commander Poe Dameron led a starfighter force to Starkiller Base to destroy it. The ground forces succeeded, though Solo was killed in battle, and the Resistance fighters destroyed the base."}, {"tag": "p", "text": "The Resistance fighters returned to D'Qar, celebrated their victory, and prepared a mission to discover Skywalker's whereabouts. The First Order, while reeling from the destruction of their weapon, still nonetheless had the location of the Resistance base."}, {"tag": "h2", "text": "The evacuation"}, {"tag": "p", "text": "Shortly after Starkiller Base was destroyed, the Resistance began evacuating their base on D'Qar, and in the early hours of the evacuation, Organa held a funeral for her fallen husband Han Solo. In orbit around the planet, General Organa commanded the Resistance fleet from the cruiser Raddus."}, {"tag": "p", "text": "At the same time as the battle of Starkiller Base, Inferno Squad members Zay Versio and Shriv Suurgav recovered schematics for the First Order Dreadnought and intel on Project Resurrection from the Retribution. As they arrived amid the evacuation, General Organa sent Inferno to rally their allies from the Outer Rim, while passing on the schematics to Commander Dameron. From this, Poe was able to formulate an attack plan."}, {"tag": "p", "text": "The escape was interrupted by the arrival of a First Order fleet consisting of three Resurgent-class Star Destroyers and one Mandator IV-class Siege Dreadnought, the Fulminatrix. The dreadnought opened fire on the Resistance base almost immediately, but the base had been fully evacuated just in time. To buy time for the Resistance transports to escape, Dameron attacked the dreadnought in his X-wing despite Organa ordering him not to attack the dreadnought, eliminating its surface cannons and clearing the way for a squadron of Resistance bombers to attack despite counterattacks from the dreadnought and its TIE squadrons."}, {"tag": "p", "text": "As the Fulminatrix began to aim its orbital autocannons at the Raddus, Resistance bombers began to approach the dreadnought, defended by starfighters to block TIE fighter attacks. The resultant assault successfully obliterated the Fulminatrix, but at a high cost. All bombers were lost along with four of their escorting starfighters, and after the first attack on the fleet, the Resistance was reduced to just 400 personnel aboard four ships. However, Dameron's attack bought enough time for their fleet to jump to hyperspace. At the same time they made their escape, the Supremacy and thirty more Star Destroyers arrived at D'Qar."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The battle's high cost led to General Organa demoting Commander Dameron to Captain, as he had disobeyed her direct order not to press the dreadnought assault after neutralizing its defenses. The Resistance was unable to fully escape the First Order due to the latter's new technology that could track ships through hyperspace. Eventually, after a nearly 18-hour long pursuit and with fuel supplies critically low, the Resistance slipped away and headquartered themselves in an old Rebel outpost on the mineral planet Crait. This escape was detected by the First Order, however, and led to the subsequent Battle of Crait. Following the departure of both the First Order and the Resistance, Team Colossus aboard the Colossus arrived and saw debris from the battle. Captain Imanuel Doza authorized a salvage mission to retrieve fuel from Fulminatrix's wreckage."}, {"tag": "p", "text": "Even though the Resistance managed to escape, First Order officers who were not present for the battle were told that the Resistance had been destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first footage of the battle of was shown in the Star Wars: Episode VIII The Last Jedi teaser trailer on April 14, 2017. The evacuation of D'Qar was first referenced as part of the story of Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017, at San Diego Comic-Con 2017. The opening bombing-run sequence of the Evacuation of D'Qar was inspired by the World War II book Vertical Warfare, which director Rian Johnson found while researching the library of Skywalker Ranch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}