{"url": "TIE/es_assault_shuttle", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Assault shuttle classes", "Category:First Order starship classes", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/es assault shuttle"}, {"tag": "p", "text": "The TIE/es assault shuttle, or TIE Echelon, was a transport of the TIE line used by the First Order. It possessed four heavy laser cannons as well as a dual light laser cannon turret, was capable of delivering 12 crew members plus additional cargo, had two clusters composed of three ion engines each (one for each side), as well as advanced sensors capable of monitoring and scanning enemy communications to allow them to avoid hostile encounters."}, {"tag": "p", "text": "A TIE echelon was also used to deliver First Order stormtroopers of the 709th Legion to Batuu in order to clear out the Resistance presence. A local named Remex Io witnessed its arrival and attempted to inform his fellow comrades in the Kendoh Gang about their arrival, although he couldn't do so as they needed to negotiate with Dok-Ondar at his shop to form an alliance with him."}, {"tag": "p", "text": "The same echelon later returned to the planet with the sergeant onboard as well as a 125-Z treadspeeder bike after a squad within the 709th fought with two people suspected to be Resistance agents. One TIE Echelon was present in Black Spire Outpost on Batuu, where it marked the entrance to First Order Cargo. The TIE Echelon in question was responsible for bringing over Kylo Ren to Batuu in order to track down Rey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE Echelon was created for Star Wars: Galaxy's Edge, developed by Colin Trevorrow when he was working on Star Wars: Episode IX The Rise of Skywalker. On March 1, 2018, three days after the fighter's name was announced, a leaked photograph of the then-under-construction Star Wars: Galaxy's Edge showed a fighter that was speculated to be the TIE Echelon, and was ultimately confirmed in Galaxy's Edge 1. In addition, ABC newscaster Clayton Sandell, who did a sneak peek at the park, implied in an interview with The Resistance Podcast that the TIE Echelon might appear in The Rise of Skywalker. The original model of Galaxy's Edge unveiled by Disney showed a First Order TIE fighter in the place that would house the TIE Echelon in the real world. The TIE Echelon near Docking Bay 9 was revealed in a live show to have belonged to Kylo Ren, and that he used it to arrive at Batuu in order to track down Rey, whom he believed was at the outpost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}