{"url": "TIE/IT_Interdictor_starfighter", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/IT Interdictor starfighter"}, {"tag": "p", "text": "The TIE/IT Interdictor starfighter, also known as the Advanced TIE Bomber, the TIE/ca Punisher, the TIE Punisher, and simply the TIE Interdictor, was a heavy bomber in service to the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Galactic Empire's TIE Interdictor bomber had wings and a command module which were nearly identical to those found on a TIE/sa bomber and TIE Heavy Bomber. However, the command module was flanked on both sides by a pair of ordnance pods, for a total of four. They could also include enhanced sensors."}, {"tag": "p", "text": "The ship was piloted by one individual, and was equipped with shields, largely to ensure that their payload arrived at their destination. The armor was stronger than other TIE models, but the craft did not include a hyperdrive. The TIE Interdictor was armed with linked laser cannons and ordnance pods, able to carry 12 concussion missiles, homing missiles or proton torpedos. The ship also had twin linked versions of the TIE/sa bomber's proton bomb bays. Their ordnance could also be expanded to include plasma torpedoes, flechette torpedoes, advanced homing missiles, cluster mines, and ion bombs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIE Interdictor was used by the Empire during the Galactic Civil War. The Interdictor was developed as an advanced TIE model following the Battle of Yavin. The craft was to be used in assault missions where Star Destroyers could not venture, and earned an effective reputation as they hunted Rebel bases. \"Redline\" and \"Deathrain\" both piloted TIE Interdictors at least once, and the Interdictor was also used for Cutlass Squadron."}, {"tag": "p", "text": "Three of them attacked the Rebel's Massassi Station during the evacuation of Yavin, although they were destroyed by concussive charges placed by General Jan Dodonna."}, {"tag": "p", "text": "During the attack on Cloud City in 3 ABY, eight bombers were sent in as support units to occupy the city."}, {"tag": "p", "text": "Several months later, at least one TIE Interdictor was still present along with other Imperial forces at a Kessel Detention Center. The Detention Centers were subsequently liberated by Wookiee forces."}, {"tag": "p", "text": "The TIE Interdictors continued to see use after at least 5.5 ABY, with the name \"TIE Punisher\", and included weaponry such as Flechette torpedoes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Few technical details are provided for this craft in its debut appearance, the 2001 video game Star Wars: Galactic Battlegrounds. Most of what was known about it at the time is based on extrapolation from its physical structure and similarity to the TIE Bomber."}, {"tag": "p", "text": "Three of them are provided to the player at the beginning of the Galactic Empire's non-canonical Battle of Endor mission."}, {"tag": "p", "text": "The model's history was expanded upon in Fantasy Flight Games 2014 Roleplaying game sourcebook Stay on Target."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}