{"url": "TIE/LN_starfighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Alliance to Restore the Republic starfighter classes", "Category:Confederation starfighter classes", "Category:Galactic Alliance starfighter classes", "Category:Imperial starfighter classes", "Category:New Republic starfighter classes", "Category:TIE/LN starfighters", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/LN starfighter"}, {"tag": "p", "text": "The TIE/LN starfighter, or TIE/line starfighter, simply known as the TIE Fighter or T/F, was the standard Imperial starfighter seen in massive numbers throughout most of the Galactic Civil War and onward. Colloquially, Rebel and New Republic pilots referred to the craft as \"eyeballs.\""}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE Fighter is the original design for later upgraded TIE models such as TIE/sa bomber, TIE/IN interceptor, TIE/D Defender, TIE/D automated starfighter, and many more. The TIE Fighter was a descendant of the T.I.E. starfighter and the V-wing starfighter, both developed for the Galactic Republic, and was manufactured by Sienar Fleet Systems. In addition to the T.I.E. and V-wing, it was also descended from the TIE starfighter, the first TIE model developed for the Galactic Empire. The namesake for the fighter and line was the Sienar Fleet Systems P-s4 twin ion engines that acted as its engines. However, it also to some degree was named after an item of clothing due to its overall shape resembling a bow-tie."}, {"tag": "p", "text": "The TIE/Ln's engine was one of the most precisely manufactured propulsion systems in the galaxy and, with no moving parts, was low-maintenance. Unlike the TIE before it, the TIE/Ln sported independent generators for the engine and the weapons. The lack of combat shields, hyperdrive, and life-support systems, in concert with the advanced engine design, reduced the mass of the fighter and conferred exceptional maneuverability. This also made them both inexpensive and quick to replace."}, {"tag": "p", "text": "Primary armament was a pair of L-s1 laser cannons, coupled with a powerful sensor suite. The cannons were relatively powerful, and a well-placed hit on a starfighter or medium transport could damage or destroy it. It did not carry missile tubes, but such weapons could be added if necessary."}, {"tag": "p", "text": "Due to the lack of life-support systems, each TIE pilot had a fully sealed flight suit superior to their Rebel counterparts. The absence of a hyperdrive also rendered the fighter totally dependent on carrier ships when deployed in enemy systems. TIE/Lns also lacked landing gear, another mass-reducing measure. While the ships were structurally capable of \"sitting\" on their wings, they were not designed to land or disembark their pilots without special support. On Imperial ships, TIEs were launched from racks in the hangar bays."}, {"tag": "p", "text": "Power conduits were attached between the engine system and the solar arrays."}, {"tag": "p", "text": "TIEs were designed to attack in large numbers, overwhelming the enemy craft. Standard attack squadrons consisted of 12 fighters while full attack wings were made up of six squadrons. The Imperials used so many that they came to be considered symbols of the Empire and its might. They were also very cheap to produce, reflecting the Imperial philosophy of quantity over quality."}, {"tag": "p", "text": "Contrary to popular belief, the ships did possess ejection seats, but the nature of space warfare often resulted in pilots riding their craft down to a swift end rather than ejecting and risking slow death by heat loss and oxygen starvation in the vacuum of space. The ejection system was more a formality than anything else - given the delicacy of the craft, by the time enough damage was done to require the pilot ejecting, it would likely have already destroyed itself.[source?]"}, {"tag": "p", "text": "The design choices of the TIE/Ln could arguably be explained by Imperial military philosophy, which viewed the starfighters and their pilots as an expendable asset. Though Imperial pilots were of an elite stock, they were also expected to consider themselves expendable, in accordance with their ideological training."}, {"tag": "p", "text": "Other Imperial pilots considered TIE Fighter pilots to be suicidal due to how expendable the starfighters were."}, {"tag": "p", "text": "Like stormtroopers, TIE pilots had their own identification, such as DS-61-2 (the first two letters indicated the posting, the next two or three digits indicated the squadron number, and the last number indicated the pilot's ranking in the squadron). This procedure reduced them to being no more than anonymous and standardized operatives of the Imperial war machine. This attitude was further reflected by the lack of any sentimental attachment to particular TIEs by TIE pilots, unlike Rebel pilots who often grew attached to their craft. As far as they were concerned, every fighter, whether reconditioned or factory-fresh, was identical. They were considered as nothing more than tools, much in the same way the pilots were."}, {"tag": "p", "text": "A disadvantage of the fighter was its lack of deflector shields. In combat, pilots had to rely on the TIE/Ln's maneuverability to avoid damage. The cockpit did incorporate crash webbing, a repulsorlift antigravity field, and a high-g shock seat to help protect the pilot, however these did next to nothing to help protect against enemy blaster fire. However, despite this lack of protection, the fighter was at least able to survive glancing hits, such as when the quad laser cannons on the Millennium Falcon were able to hit a TIE fighter without actually destroying it."}, {"tag": "p", "text": "The TIE/Ln starfighter's eponymous twin ion engines are also notoriously easy to sabotage; all it takes is moving an energizer out of alignment for a TIE's recharge systems for them to become time bombs."}, {"tag": "p", "text": "The side view of a TIE/Ln's radiator panels curiously resembles the emblem of the Confederacy of Independent Systems, but it is not clear if the similarity was intentional. The front/rear cross-section of the fighter was designed to be small to make it difficult to hit with blasters, but these side panels proved easy targets for flanking enemy pilots. They also hampered the fighter's ability to maneuver while in the atmosphere. Due to their distinct shape, TIE/Ln came to be referred to occasionally as \"eyeballs\" by enemy pilots."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The basic TIE starfighter was designed at some point before 22 BBY and inspired a number of other Imperial starfighters manufactured by Sienar Fleet Systems, which became collectively known as the TIE series. The TIE Line fighter was one of them, and replaced the original model as the standard fleet fighter in the Empire. While the original TIE had performance parity with heavier-built X-wings, the newer TIE/Ln boasted improved engines and more powerful weapons, surpassing contemporary Rebel fighters."}, {"tag": "p", "text": "TIEs would be used in massive numbers throughout the Galactic Civil War and would be regarded by many as a symbol of the Empire. Some TIEs fell into the hands of the Rebellion, who would sometimes use them to infiltrate Imperial facilities."}, {"tag": "p", "text": "It had been intended that the TIE/Ln would be replaced by the TIE Interceptor, as a direct result of the T65 X-wing starfighter owned by the Lightspeed Panthers outperforming them in the Fei Hu campaign, resulting in 286 destroyed TIEs. Indeed, Interceptors began to see greater use around the time of the Battle of Endor, but the collapse of the Imperial government into sectionalism precluded this. As the Galactic Empire retreated, more and more factories found themselves behind New Republic lines and ceased production. The New Republic made limited use of captured TIEs, equipping them with shields and assigning them to sectors where they weren't considered a symbol of the Empire. Their most notable use in New Republic service was at the Battle of Adumar. Captured TIE fighters were also used for deceptive purposes, such as during the Mission to Prefsbelt IV."}, {"tag": "p", "text": "By the time the peace treaty was signed, the Empire (now known as the Imperial Remnant) began to use export starfighters manufactured by other races (such as the Sullustan SoroSuub Corporation Preybird-class starfighter) because they lacked the manufacturing facilities to build new TIE Fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally meant to have a blue hull, this was abandoned when blue-screen filming made the fighters transparent. The original TIE/Ln fighters seen in A New Hope were relatively white; the TIEs of The Empire Strikes Back and Return of the Jedi were grayer, with a bluish hue added during post-production."}, {"tag": "p", "text": "The sound for TIE Fighters was created by combining an elephant's scream with the noise of a car driving on a wet road."}, {"tag": "p", "text": "Rob Coleman originally considered putting TIEs into the end of Revenge of the Sith, but George Lucas decided to show Alpha-3 Nimbus-class V-wing starfighters instead, pointing out that the Empire would have nineteen years to build TIEs.[source?]"}, {"tag": "p", "text": "Although Expanded Universe material and a speed chart used by the film crew of Return of the Jedi shows the speed of the TIE fighter to be equal to that of an X-wing, A New Hope shows them overtaking X-wings despite the latter going \"full throttle\"."}, {"tag": "p", "text": "In the Rogue Squadron series of video games, a TIE fighter is used as the basis for the game's sound test to test the input of the stereo surround sound. It first flies toward the player and then flies around the screen."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Galactic Battlegrounds, TIE fighters serve as the Galactic Empire's fighter unit and may be built at airbases in single player or multiplayer. The 2005 video game Star Wars: Battlefront II depicts TIE Fighters as having a proton-torpedo launcher in addition to two laser cannons. However this was most likely a game mechanic, used to balance teams and gameplay."}, {"tag": "p", "text": "The first edition of Star Wars: The Roleplaying Game (1987) states that the cargo capacity is 110 kg and the consumables last one day, but later sources retconned these numbers. A TIE fighter, alongside a T-65 X-wing starfighter, made a very brief cameo in Star Wars: Episode II Attack of the Clones during Anakin and Obi-Wan's chase against Zam Wesell, where the latter vessel was chasing the former.[source?]"}, {"tag": "p", "text": "The Star Wars: Rogue Squadron III: Rebel Strike game gave the following description concerning the TIE fighter:"}, {"tag": "p", "text": "In 2012 eFX Collectibles released a limited edition of 657 studio-scale TIE Fighter models."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}