{"url": "TIE/fo_space_superiority_fighter", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order starfighter classes", "Category:Sienar-Jaemus Fleet Systems products", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/fo space superiority fighter"}, {"tag": "p", "text": "The TIE/fo space superiority fighter, commonly known as the First Order TIE fighter, was a starfighter used by the First Order. A product of Sienar-Jaemus Fleet Systems, the TIE/fo carried the appearance of its predecessor, the TIE/ln space superiority starfighter, though it featured internal advancements that provided it with greater defensive capabilities."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As the First Order was a junta inspired by the Galactic Empire, it also kept the iconic TIE/ln space superiority starfighter design for their fighters, but upgraded the ship to modern combat standards. As First Order engineers operated under a less bureaucratic regime, technological innovations were easier to produce. Advancements from the Empire's TIE/ln included on-board deflector shields that provided better protection and offensive capabilities, improved solar cells, and higher-capacity converters. These upgrades were a side effect of the First Order's change of mentality towards its pilots, seeing them as critical assets rather than cannon fodder. However, like its Imperial predecessor, the TIE/fo lacked a hyperdrive, making it dependent on carrier vessels for transport and limiting it to short range missions."}, {"tag": "p", "text": "The TIE/fo was expensive and complex, although still less versatile than the T-70 X-wing starfighter. It was powered by vertical P-s6 twin ion engines, and had its rear external thrusters rotated 90 degrees compared to old TIE models for improved maneuverability. These engines were powered by a SJFS I-a4b solar ionization reactor held in a high-pressure radioactive gas fuel tank at the bottom of the ship. Ultra-high efficiency girondium-colium solar cells protected by a thin, armor cover along the TIE's wings gathered light energy and channeled it through phase one and phase two converter coils. The coils transferred the energy into the reactor, where the energy triggered emissions from the high-pressure radioactive fuel. The improved solar cells and higher-capacity converters were products of Imperial research conducted for the TIE Advanced program."}, {"tag": "p", "text": "The TIE/fo was designed to house a single TIE pilot aided by a Torplex flight computer, T-sj1a targeting computer, subspace communications antenna, sensor array, and even a shield generator to create an onboard deflector shield. The pilot was encased at the center of the ship where they were protected by a transparisteel main viewport and top transparisteel viewport, which also served as their access hatch."}, {"tag": "p", "text": "Offensively, the TIE/fo featured two SJFS L-s9.6 laser cannons underneath the vessel, with the two red \"dots\" next to the laser cannon assembly being used for its targeting sensor optics. A flight of TIE/fo fighters was known as a TIE Flight."}, {"tag": "p", "text": "The TIE/fo inspired the TIE/sf space superiority fighter, which was a two-seated variant of the TIE/fo upgraded with advanced weaponry reserved exclusively for special forces personnel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Decades after the introduction of the TIE line, the distinctive starfighter remained a symbol of power and prestige for the First Order, which utilized its space superiority fighters primarily as attack craft to hunt down and swarm enemies in short-range combat missions. TIE fighters were also used to escort the command shuttles of top officers and dignitaries, and Resurgent-class Star Destroyers such as the Finalizer carried two full wings of TIE fighters. Unlike the Galactic Empire, the First Order treated its pilots as critical military assets, and established secret flight schools to extensively train its TIE cadets."}, {"tag": "p", "text": "TIE/fo fighters were deployed on Jakku in an attempt to retrieve the Resistance astromech droid BB-8, which was carrying the map to Luke Skywalker sought by Kylo Ren. TIEs attacked Niima Outpost, driving BB-8's protectors Rey and Finn into the Millennium Falcon, and engaged the freighter in a tense chase through the Starship Graveyard. The Falcon was able to evade and destroy the pursuing fighters, and fled into space."}, {"tag": "p", "text": "Having tracked the droid to Takodana, the First Order launched a siege on the castle of Maz Kanata. TIE fighters assisted in leveling the castle and killing many of its inhabitants, and engaged Resistance T-70 X-wing starfighters in combat above the ruins. Although the TIE fighters were successful on attacking the castle and supporting infantry, they proved to be no match to Resistance fighter forces, ending up losing many TIEs against the versatility of X-wings and Poe Dameron's superb skills. The First Order's forces pulled out once Kylo Ren captured Rey, who was transported to Starkiller Base."}, {"tag": "p", "text": "When the Resistance launched an Battle of Starkiller Base, TIE/fo fighters were dispatched by General Armitage Hux to engage the X-wing starfighters of Blue and Red Squadrons. However, they were unable to prevent Black One from entering the thermal oscillator and firing critical proton torpedo volleys which destroyed the oscillator. This caused a chain reaction that ruptured Starkiller Base, destroying many TIEs in the process, and destroyed the entire planet as surviving Resistance forces escaped the blast."}, {"tag": "p", "text": "Later, First Order TIEs attempted to thwart the Resistance's Evacuation of D'Qar, destroying their entire fleet of MG-100 StarFortress SF-17 strategic bombers. During the Battle of Crait, First Order TIEs destroyed most of \"Reb\" Squadron and pursued the Millennium Falcon through the planets interior."}, {"tag": "p", "text": "By 35 ABY, 3 TIE/fo fighters carried the Millennium Falcon to the Resurgent-class Star Destroyer Steadfast."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the early days of brainstorming for Star Wars: Episode VII The Force Awakens, concept artist Doug Chiang suggested including TIE fighters with headlights, as he thought that it was very cool when the Millennium Falcon showed its headlights in Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}