{"url": "TIE/rc_starfighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Scout starship classes", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/rc starfighter"}, {"tag": "p", "text": "The TIE/rc starfighter was a variant of the standard TIE/LN starfighter that was specialized for reconnaissance, used for scouting in both fleet and starfighter wing operations."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "One of the two laser cannons found on the TIE/LN was replaced with additional sensor and communications gear in the TIE/rc. Although the TIE/rc was not as well armed, it had upgraded thrusters which made it more maneuverable than the TIE/LN."}, {"tag": "p", "text": "The TIE/rc lacked a hyperdrive, but it could still move beyond the detection area of capital ships; it carried enhanced sensors that allowed it to range ahead of the main force and relay pre-engagement reconnaissance data back with its improved communication equipment. These small ships were often deployed in crowded areas where larger vessels could not operate (e.g. asteroid fields), or were sent to scout ahead for starfighter forces."}, {"tag": "p", "text": "There was an upgraded variant of the TIE/rc known as the TIE Vanguard. The Vanguard was equipped with shields, and its solar collectors were bent in order to increase sensor visibility."}, {"tag": "p", "text": "Standard procedure for long-range TIE reconnaissance missions involved the carrying vessel dropping a TIE/rc squadron into a system, then jumping to hyperspace, ensuring its safety. The TIEs would race through the system, gathering data, before meeting the carrier at a rendezvous point elsewhere in the system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "TIE/rcs were used by the Galactic Empire during the New Order."}, {"tag": "p", "text": "The Empire deployed a TIE/rc during the strike at Ort Hoogra-D'En's base, although it was shot down by the laser cannons."}, {"tag": "p", "text": "A flight of the fighters patrolled the prison planet Captivity, and several were destroyed as the Millennium Falcon extracted the rebel infiltrators and prisoners."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE/rc starfighter was created by West End Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}