{"url": "TIE/sa_bomber", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:TIE line", "Category:TIE/sa bombers"], "nodes": [{"tag": "h1", "text": "TIE/sa bomber"}, {"tag": "p", "text": "The TIE/sa bomber, formally known as the TIE Surface Assault Bomber and also known as the TIE/sa tactical bomber and TIE bomber, was a bombing variant of the TIE line used by the Galactic Empire, and was their main source of anti-emplacement air-support. They were nicknamed \"dupes\" by the New Republic pilot Wyl Lark."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE/sa bomber was specifically designed by Sienar Fleet Systems for use in the military of the Galactic Empire. A model of light bomber, it was part of the TIE line of starfighters, distinguished by their twin ion engines and solar collector panels. The bomber measured 7.9 meters long, 10.6 meters wide, and 5.4 meters high. In keeping with the Empire's preference for muted colors, it was painted a bluish gray."}, {"tag": "p", "text": "Like the TIE Advanced x1 prototype, the TIE/sa bomber had inclined wings, which maximized its speed and maneuverability while carrying mass of heavy ordnance. Unlike the other models in the TIE line, the bomber had not one but two central pods: a starboard cockpit for the pilot and a portside ordnance bay for the munitions. The cockpit featured two forward-mounted laser cannons, the standard transparisteel viewport, and an ejector seat in case a pilot on a distant bombing run needed to abandon ship."}, {"tag": "p", "text": "The ordnance bay was divided into two sections. The forward ordnance bay carried either eight concussion missiles or four proton torpedoes. The main ordnance bay carried either four proton torpedoes and eight concussion missiles, or eight proton bombs and sixty-four thermal detonators, or six orbital mines, or even stormtroopers. Located underneath the ordnance pod was a bomb chute connected to the ship's targeting systems, a T-s7b targeting computer and a 398X bomb sight. The pod also featured a missile port that allowed for front-launching and torpedoes. The ordnance bay could also be swapped for a passenger cabin with room for six."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "TIE bombers were a main source of anti-emplacement, anti-trap air support for the Empire. They often served in the first line of attack, and Star Destroyer captains liked to send them out to carpet bomb and weaken large targets like capital ships in space or buildings on the ground."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A decade after the rise of the Empire, one was deployed by the Imperial-class Star Destroyer Ultimatum in order to attack the mobile refinery Forager used by the corrupt Count Denetrius Vidian."}, {"tag": "p", "text": "Three years before the Battle of Yavin, TIE/sa bombers were being launched from a Quasar Fire-class cruiser-carrier above Ryloth to attack Cham Syndulla's rebel cell. When the Lothal rebel cell attacked, trying to capture the carrier, most of the TIE bombers were shot down by the rebels, who were manning gun stations on the carrier."}, {"tag": "p", "text": "At least one was present aboard the Death Star during the Battle of Yavin. After the Battle of Hoth, they were sent to flush the Millennium Falcon out from the asteroid field it was hidden in."}, {"tag": "p", "text": "The bombers also played a role during Operation: Cinder after the Battle of Endor, serving at the Battle of Cawa City."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}