{"url": "TIE/ad_starfighter", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/ad starfighter"}, {"tag": "p", "text": "The TIE/ad starfighter, simply known as the TIE Advanced, TIE/Ad or T/A, was the culmination of a series of starfighter designs first explored with Darth Vader's TIE Advanced x1. To avoid confusion with Lord Vader's personal craft, it was known better by its nickname TIE Avenger."}, {"tag": "p", "text": "Incorporating the previous successes of the TIE Series starfighters, along with those of the Rebel Alliance, the TIE Avenger was one of the first production starfighters to break away from the Imperial doctrine of quantity over quality with the inclusion of deflector shields, a hyperdrive, and warhead launchers. It was also significantly faster and more maneuverable than any existing Imperial or Rebel starfighter, resulting in enemy pilots nicknaming them \"brights\"."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE Avenger was a descendant of the TIE/Advanced series, which were designed as the next generation to succeed the TIE Fighter. Avengers shared many commonalities with the TIE Advanced x1; notably bent-wing solar arrays, flattened and extended fuselage, and non-standard wing pylons in contrast to other TIE series fighters."}, {"tag": "p", "text": "Similar to its older cousin, the TIE Interceptor, the Avenger featured the intimidating pointed dagger solar arrays, not only in front but also in the rear. The Avenger's sleek design was credited with significantly reducing its profile, compared to other Advanced prototypes, while still retaining a comparable surface area for gathering more light from a nearby star for power and propulsion."}, {"tag": "p", "text": "At least one model run of the Avengers, such as those deployed to the Imperial-class Star Destroyer Dauntless in the Gaerboud system, featured hull assemblies elliptical in shape, coinciding with the craft's overall smoother bodylines, in contrast with those of its spherical TIE relatives. Several other models of the Avenger, as well as the succeeding TIE Defender and the similarly elite TIE Hunter and TIE Aggressor, returned to the traditional spherical cockpit."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "The TIE Avenger's primary weapon system were four Sienar Fleet Systems L-s9.3 laser cannons mounted on the front tips of the solar arrays. These laser cannons were initially deployed on the TIE Interceptor, and later incorporated into the TIE/D Defender. These cannons were also more powerful than those of the standard TIE Fighter, capable of destroying an asteroid in a single burst. The Avenger's cannons could be fired in single, dual, or linked modes depending on the pilot's preference."}, {"tag": "p", "text": "Warhead launchers were another weapon system that TIE Avengers took to the battlefield. SFS M-g-2 general-purpose warhead launchers formed the Avenger's secondary weapon system, possessing a magazine capacity of four concussion missiles each; however, they could also be loaded with three proton torpedoes, two heavy rockets, or one space bomb. The Avenger could carry a double load of sixteen missiles or twelve torpedoes, however this was extremely rare compared to the TIE Bomber and TIE Defender. This standard feature was yet another advancement against the older TIE fighters, and the beginning of a major shift in Imperial doctrine leaning towards quality over quantity."}, {"tag": "p", "text": "A tractor beam, often known as the beam weapon, was an optional system developed first for the TIE Avenger, and later used on the TIE Defender, Missile Boat, and occasionally the Assault Gunboat. During dogfights, Imperial pilots would use the beam weapon to snare enemy fighters in front of them and prevent them from escaping the Avenger's firing arc. The tractor beam was only effective in close range and could only be used for a short period of time, as its energy reserve was quickly exhausted and required frequent recharging. That was enough for the Avenger pilot to blast an enemy at point blank with either a quad-linked laser burst or warhead (without acquiring a full missile lock). Elite pilots such as Maarek Stele even took advantage of the tractor beam to successfully hit enemy fighters with advanced proton torpedoes (bearing in mind that torpedoes were more than twice as powerful as missiles but were too slow to track fighters on their own). The tractor beam paired with the Avenger's exceptional maneuverability gave it the upper hand in space superiority."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "The TIE Avenger was powered by the SFS I-s3a solar ionization reactor and featured the new SFS P-sx7.4 ion engines. This new propulsion system, rated at 133 MGLT, pushed the Avenger faster than any previous TIE starfighter. The Avenger was also more nimble than the TIE/IN interceptor and the RZ-1 A-wing interceptor, with a maneuverability rating of 104 DPF. These factors were a major contributor in TIE Avenger's success over the Rebel Alliance's fighters."}, {"tag": "p", "text": "The TIE Advanced x1 pioneered the inclusion of a hyperdrive but it suffered from reduced maneuverability compared to the standard TIE Fighter. For the succeeding TIE Avenger, a major obstacle was overcome when Admiral Zaarin discovered a partner in the Habeen, who achieved a breakthrough in making a new hyperdrive model that could be small and reliable enough, eliminating the disadvantages of hyperdrive inclusion. The final TIE Advanced prototype far exceeded expectations by including a hyperdrive, shields, and a general purpose warhead launcher, all while surpassing the TIE Fighter's trademark speed and agility."}, {"tag": "p", "text": "As impressive as its speed and agility is, the Avenger was still a small craft in the mold of the TIE/LN starfighter and TIE/IN interceptor, and emphasized space superiority due to its small warhead load and lack of ion cannons. The Avenger lost the performance crown by a small margin to the TIE/D Defender. While the difference was minor, it was significant considering the Defender's triple wing design and larger hull, and numerous advances over the Avenger, such as ion cannons. This made the Defender larger and heavier than any of its predecessors—a fact which made its speed and maneuverability all the more impressive."}, {"tag": "h3", "text": "Defenses"}, {"tag": "p", "text": "Coinciding with the trend of improved quality in Imperial starfighters, the Avenger was equipped with deflector shields."}, {"tag": "p", "text": "Like earlier TIE series fighters, the Avenger's great speed and agility coupled with its small size made it a difficult target. In a similar precedent, the Avenger's armor plating was marginal, affording only as much protection as the TIE Interceptor. However, the inclusion of deflector shields meant that the Avenger would not fall prey to stray debris or laser fire that claimed unshielded TIEs, and with its shields at full power the Avenger was exceptionally difficult to destroy. The succeeding Defender, while still remarkably fast and agile as the Avenger, relied more heavily on shields because its triple wing design gave opponents a larger profile."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The TIE Avenger's primary role was space superiority or starfighter interception. The Avenger excelled in this role: during the Galactic Civil War, no Rebel Alliance fighter could out-run or outmaneuver the Avenger. In the right hands, it could outmatch its intended replacement, the TIE Defender, as the Avenger's small size made it a more difficult target and afforded it better maneuverability, and as the Defender's large tri-wing design introduced several blind spots. When coupled with the tractor beam weapon, the Avenger was even more deadly."}, {"tag": "p", "text": "As the TIE Bomber aged, the TIE Avenger was called on to perform assault or bombing roles. With its nimble frame, the Avenger was easily able to dodge defensive fire, even more so than its successor, the Defender. The Avenger was often utilized to carry heavy rockets and heavy space bombs, two very powerful but slow projectile weapons, as its high speed could offset the warhead's disadvantages. The Avenger afforded expert pilots such as Maarek Stele the chance to use rockets in hit-and-run attacks against smaller craft such as transports and shuttles. While difficult to aim, rockets were far more powerful than proton torpedoes."}, {"tag": "p", "text": "The Avenger's small hull lacked the large capacity warhead magazines necessary to destroy larger capital ships. Because it lacked ion cannons, the TIE Avenger was also reliant on assault starfighters to disable mission critical craft."}, {"tag": "p", "text": "The TIE Avenger was the perfect complement for the Alpha-class Xg-1 Star Wing Assault Gunboat. Because of the hyperspace capability of both classes, they could arrive in a system at the same time, catching Rebel patrols by surprise. While the Avengers handled enemy fighters, the Gunboats could concentrate on their intended roles, whether that be capturing craft or assaulting capital ships. Successful Avenger-Gunboat partnerships included the capture of Admiral Harkov and the seizure of Galactic Electronics' mag pulse weapons. Later, the TIE Defender would largely supplant the Avenger and Gunboat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The high success rate of more advanced Rebel starfighters against standard Imperial TIE/LN starfighters resulted in a mounting cost of replacing pilots and craft. This, combined with the realization that the inclusion of a hyperdrive would allow the fleet to be more flexible, caused the Imperial Navy to rethink its doctrine of using swarms of cheap craft instead of fewer high-quality ones."}, {"tag": "p", "text": "The Imperial Navy, under the direction of Admiral Demetrius Zaarin, began exploring this concept with several prototypes that were usually referred to as TIE Advanced, starting with the TIE Advanced x1. The x1, despite pioneering the inclusion of a hyperdrive and deflector shields, was more expensive and suffered from reduced maneuverability compared to the standard TIE Fighter. While it did become Darth Vader's personal craft, it never went into full-scale production."}, {"tag": "p", "text": "Nonetheless, TIE Advanced development and production continued. At first, production of the TIE Advanced was without a hyperdrive engine, as adding one at the time would reduce performance. This major obstacle was soon overcome when Admiral Zaarin discovered Habeen and the Nharwaak scientists who had created a revolutionary new hyperdrive model that could be small and reliable enough to eliminate the disadvantages of including a hyperdrive."}, {"tag": "p", "text": "The result of this was the final TIE Advanced, a starfighter that not only incorporated a hyperdrive, shields, and a warhead launcher, but did so without sacrificing the TIE's trademark speed and agility. When Zaarin gave a successful demonstration of the new Advanced's capabilities, Darth Vader was so impressed that he authorized its production."}, {"tag": "p", "text": "While \"TIE Advanced\" is technically correct, as it was the only prototype to make it into production, Imperial pilots nicknamed it the \"TIE Avenger\". Soon, the craft was commonly referred to by its nickname to avoid confusion with Vader's personal Advanced x1."}, {"tag": "p", "text": "At least three TIE Avengers were involved in an Imperial fleet exercise alongside a Lambda-class T-4a shuttle, a Praetor Mark II-class battlecruiser, a Bellator-class dreadnought, two Imperial-class Star Destroyers, an Assertor-class Star Dreadnought, and an Allegiance-class battlecruiser, the latter two also being refueled by an Altor-class replenishment ship."}, {"tag": "h3", "text": "Adoption"}, {"tag": "p", "text": "The Avenger's costs did not endear it to the Empire's complex bureaucracy, so its production and deployment was limited. From the earlier TIE Advanced x1, SFS design teams adopted its bent-wing innovation for the TIE/IN interceptor and TIE/sa bomber. These fighters discarded the hyperdrive and shields in the interests of saving costs and increasing agility. The Imperial Navy was impressed and ordered large numbers of these, planning to gradually replace the standard TIE fighter with the Interceptor. Those orders made it unlikely that the Avenger would become the mainstay Imperial fighter. However, Admiral Harkov was one of the few willing to experiment with the Avenger to replenish his TIE losses in the Sepan Civil War."}, {"tag": "p", "text": "The Avenger was also overshadowed by its successor, the TIE Defender. While the Avenger had made significant improvements in propulsion, and had a standard hyperdrive, warhead launcher, and shields, it was still a small craft and space superiority fighter in the mold of the TIE Fighter and TIE Interceptor. The TIE Defender was a far more flexible craft than the Avenger, with comparable shields and hull armor, and additional pair of ion cannons. The Defender retained or improved on the Avenger's agility and speed. Its only disadvantage was its large size relative to the Avenger and older TIEs."}, {"tag": "p", "text": "When Grand Admiral Demetrius Zaarin turned traitor, one of his first acts was to launch a campaign to destroy the TIE Avenger production plants, denying the Empire a means to produce starfighters that could match his own TIE Avenger and TIE Defender squadrons. The campaign was largely successful, further reducing the role that the Avenger would play in Imperial history. By the time Zaarin was finally killed and his forces destroyed, Imperial Command chose to focus on less costly starfighters, largely abandoning TIE Avenger production. Any hope of restarting TIE Avenger production was lost as the Empire shortly afterwards suffered a heavy defeat at the Battle of Endor."}, {"tag": "p", "text": "Where the TIE Interceptor was more numerous than the Avenger, so too was the more capable TIE Defender. Consequently, the TIE Avenger became the middle child of Imperial starfighter development, never achieving the notoriety of either of its closest relatives. Interestingly, as it had major roles in the attempted defection of two high-profile Imperial officers, it was used nearly as much by non-Imperials as it was by the Empire itself."}, {"tag": "h3", "text": "Sepan Civil War"}, {"tag": "p", "text": "The TIE Avenger's first recorded major deployment was under the infamous Admiral Harkov. When subduing the Sepan Civil War, Harkov's fleet took heavy losses to its starfighter contingent. As such, a shipment of several squadrons of TIE Avengers was delivered to Admiral Harkov's flagship the Victory-class Star Destroyer Protector to replace his losses. These TIE Avengers had to be ferried since they lacked hyperdrive modules (these were not yet developed for the Avenger). The shipment came under attack by Dimok and Ripoblus forces seeking to deny Harkov his reinforcements. The attack was staved off by Imperial escort starfighters, including one flown by the legendary pilot Maarek Stele. Ironically, in the same mission, Stele uncovered perhaps the most damning piece of evidence pointing to Harkov's treachery as he inspected a shuttle bound for Harkov's ship and discovered it contained a high-ranking Rebel officer who was attempting to rendezvous with Harkov to discuss the terms of his defection. With the new starfighters under Harkov's control, the Sepan Civil War ended shortly thereafter."}, {"tag": "h3", "text": "The New Hyperdrive model"}, {"tag": "p", "text": "Until 3 ABY, the idea of using Imperial starfighters for hit-and-fade attacks like the Rebellion was not a viable option because Imperial fighters lacked hyperdrive engines. This major obstacle was soon overcome when Admiral Zaarin discovered a group of Habeen and the Nharwaak scientists who had created a new hyperdrive model that could be small and reliable enough to eliminate the disadvantages of hyperdrive inclusion. Acquiring the new hyperdrive was not without difficulty. While the Habeen were eager to sell the design to the Empire, the Nharwaak planned to sell the technology to the Rebellion and decided to intervene in the deal. Imperial pilot Maarek Stele was instrumental in ensuring that Zaarin and the Habeen could reach an accord despite Nharwaak intervention as well as denying it to the Rebels by destroying the rebel frigate Xerxes."}, {"tag": "h3", "text": "Harkov defection"}, {"tag": "p", "text": "Later, while Stele was in the process of destroying the mines as an instructional lesson, Harkov ordered Stele's wingmen to destroy his TIE Interceptor. Acting quickly, Stele called for backup from the Secret Order, who sent the loyalist Nebulon-B2 frigate Osprey to assist. Harkov then unleashed his new TIE Avengers to take out Stele, marking it the first time the Avenger was deployed in combat, and also infamously as their maiden mission was against the Empire. Stele, despite being in the slower and unshielded TIE Interceptor, used some unorthodox tactics to shoot down several Avengers. Avoiding a straight dogfight, Stele lured them towards the Osprey and the relative safety of the frigate's defensive fire. Then he dumped his laser energy into his engines, giving the Interceptor a crucial speed boost for a short time, enabling him to pounce on the traitor starfighters as they took hits and ran from the Osprey's laser cannons."}, {"tag": "p", "text": "Their treachery exposed, Harkov and his fleet turned traitor. The fact that his fleet was outfitted with several squadrons of the most advanced Imperial starfighters to date made taking down Harkov a very dangerous proposition for the Empire. However, the Empire knew that letting such a large number of advanced starfighters fall into rebel hands would be disastrous, so the decision was made to destroy Harkov before he could flee to the Rebellion."}, {"tag": "p", "text": "Several missions needed to be undertaken to whittle away Harkov's supplies before an open assault could be made. Maarek Stele, after discovering Harkov was behind the death of his mentor, Admiral Mordon, volunteered to spearhead the mission specifically aimed at destroying Harkov's advanced starfighters. Stele piloted one of the few loyalist TIE Avengers available, which was also the first time he flew one of these craft. He and three wingmen made a hyperspace jump into Harkov's domain, and shot down a large number of enemy Avengers."}, {"tag": "p", "text": "This forced a change in Harkov's plans. With his starfighter forces in tatters, he needed some way to throw off the Empire's pursuit. Harkov fled to a rebel space installation, hoping the Empire would not notice a single shuttle and instead continue pursuing his Victory Star Destroyer Protector, which shortly thereafter jumped into hyperspace. Others have suggested that the men of Harkov's flagship were so stunned by the unexpected loss of TIE Avengers that they mutinied against their leader and fled."}, {"tag": "p", "text": "Unfortunately for Harkov, Maarek Stele proved once again to be his undoing as he spotted the Lambda shuttle Toten. Stele was able to use the speed of the Avenger to inspect the shuttle and discover that Harkov was onboard. The traitor was captured and executed a short time later by a combined loyalist force composed of TIE Avengers, Gamma-class ATR-6 assault transports, and Alpha-class Xg-1 Star Wings launched from Darth Vader's Imperial Star Destroyer Garrett. Harkov's fleet, along with the few remaining TIE Avengers in it, remained at large for some time afterwards but they were eventually eliminated by loyalist Avengers led by Stele."}, {"tag": "p", "text": "Harkov was never able to use his TIE Avengers to their full potential. Due to being unexpectedly exposed as a defector, he was hampered by crucial supply shortages, particularly lacking the new advanced concussion missiles that would have been effective against loyalist Assault Gunboats and Avengers. He also lacked skilled pilots, as he could not quickly replace the veterans lost during the Sepan Civil War. Consequently, Harkov held back his squadrons, never conducting any hyperspace raids in loyalist domains (unlike Admiral Zaarin, see below). Even in Rebel territories, he kept his Avengers in reserve, relying on the scarce Rebel fighters to protect his supplies. This made it easier for the loyalists to attack his relief convoys and escape unscathed, as Harkov's Avengers joined the pursuit too late. Lastly, Harkov never anticipated the loyalists' preemptive strike against his Avengers, using the same craft but with the best pilots and advanced missiles. He further played into their hands by sending unit after unit, instead of using his initial superior numbers to overwhelm them, so Stele's fighter group could engage them piecemeal."}, {"tag": "p", "text": "After the traitor's capture and execution, Vader sent the Interdictor Cruiser Harpax to trap Harkov's Victory Star Destroyer Protector. For the first time, the Avenger was deployed in significant numbers by the loyalists, led by Maarek Stele as they defended the Harpax from numerous Rebel and traitor sorties. The Avengers easily dealt with Harkov's TIEs and Rebel starfighters and went on to destroy the frigate Akaga, the Rebel MC40a light cruiser Warhawk, and the Protector, wiping out Harkov's forces."}, {"tag": "p", "text": "During the same battle, Admiral Zaarin's Modified Corvettes and gunboats were initially planned to assist Vader in finishing Harkov off, but they unexpectedly attacked the loyalist Imperial Star Destroyer Garrett instead. While Stele's Avengers were low on ordnance, having expended them mostly against the Rebel and Harkov's capital ships, they nonetheless successfully dealt heavy losses to Zaarin's forces, saving the Garrett from destruction."}, {"tag": "h3", "text": "Zaarin's TIEs"}, {"tag": "p", "text": "The most notable use of the Avenger occurred when loyalist Imperial forces made heavy use of the Avengers against the traitorous Zaarin's TIE Defender-equipped forces. Zaarin controlled an unparalleled number of advanced starfighters in the form of several wings of TIE Avengers and TIE Defenders. Further compounding the problem was Zaarin's intricate knowledge of Imperial production lines, which he used to wreak havoc on loyalist starfighter production. He started destroying TIE Avenger production facilities in the Omar system, starting with Omar factories. Imperial forces soon started converting remaining factories, such as ZA-13, to upgrade them to produce more TIE Avengers. Unfortunately, Zaarin still continued to destroy the production facilities and soon ZA-13 was lost as well. This led to the Imperial Navy being forced to use inferior fighters to combat Zaarin's TIE Avengers and TIE Defenders. Even though the TIE Defender was superior in performance, the loyalist Imperial forces had more capable leadership and more numerous forces at their disposal. These factors, combined with new strategies employed against the traitorous forces, resulted in the eventual loyalist victory."}, {"tag": "h3", "text": "Maarek Stele"}, {"tag": "p", "text": "Among the pilots that flew the Avenger was General Maarek Stele, one of the Empire's legendary top aces, as well as an Emperor's Hand. The TIE Avenger was Stele's fighter of choice, even while flying against superior TIE Defenders. Having flown a Defender non-stop for months in the aftermath of Zaarin's attempted coup d'état, General Stele was quite familiar with the Defender's capabilities. The Defender's main weakness was its large size and blind spots from its tri-wing design, something that an Avenger pilot could exploit as it was capable of matching the Defender turn for turn in a dogfight. Stele proved that an inferior fighter in the right hands was more than a match for the more technologically advanced TIE Defender."}, {"tag": "p", "text": "Stele was eventually transferred to the elite 181st Imperial Fighter Wing, and was last reported to have been patrolling the borders of the Imperial Remnant just prior to the war with the Yuuzhan Vong. While the Imperial 181st was equipped with TIE Defenders, it is rumored General Stele retained his TIE Avenger."}, {"tag": "h3", "text": "Others"}, {"tag": "p", "text": "Another notorious unit that flew the TIE Avenger early on, and was eventually upgraded to fly this craft exclusively, was Avenger Squadron, which was part of Admiral Wooyou Senn's Task Force Vengeance during their campaign into the Airam sector. The squadron participated in the successful destruction of the Rebel shipyard Calenz at the Battle of Nocto. However, this was likely at the cost of the Vengeance, and it is unknown whether any of Senn's Avengers escaped the Nocto system. One notable pilot was Commander E.C. Nerwal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE Advanced x1 featured in Star Wars: X-Wing while the Avenger featured in Star Wars: TIE Fighter, Star Wars: X-Wing vs. TIE Fighter, and Star Wars: X-Wing Alliance. Both craft were referred to as \"TIE Advanced\"."}, {"tag": "p", "text": "In TIE Fighter, the starfighter is described as the production model of TIE Advanced x1 (also known as Darth Vader's TIE Fighter) and nicknamed \"Avenger\". The Avenger was actually the culmination of several development stages and prototypes that were usually referred to as TIE Advanced. The Avenger was the only prototype that saw full scale production, while the preceding TIE Advanced x1 did not, so \"TIE Advanced\" is technically correct. Regardless, the craft is commonly referred to as \"TIE Avenger\" to avoid confusion with Vader's ship."}, {"tag": "p", "text": "It is generally established that the TIE Avenger came after the TIE Interceptor. In TIE Fighter, Interceptors were used in the battles to acquire the Avenger's hyperdrive technology. This is also consistent with The Star Wars Sourcebook and other references that state that the Interceptor was deployed around the Battle of Yavin, while in TIE Fighter the Avenger was not developed until after the Battle of Hoth. However, the Avenger prototype is numbered as TIE Advanced x2 while the Interceptor's is x3. (Darth Vader's craft is x1 while the TIE Defender was based on x7.) The official Star Wars site states that \"the costly TIE avenger was eventually phased out with the increasing popularity of the more economical TIE interceptor\". This is also seemingly contradictory with other sources, notably TIE Fighter, where Interceptors were already in widespread use before the Avenger was deployed. However, the contradiction could be explained by an upsurge in Interceptor usage around the time of the Battle of Hoth, shortly before or concurrent with the decimation of Avenger production facilities by the rogue forces of the Zaarin splinter government."}, {"tag": "p", "text": "In Star Wars: X-Wing vs. TIE Fighter, the Avenger is the best all-around Imperial starfighter, as the TIE Defender and Missile Boat were not present for balance reasons."}, {"tag": "p", "text": "In X-wing Alliance, the Avenger's speed is significantly toned down. Its maximum shield level is reduced to below that of an X-wing, though it regenerates faster. The TIE Defender's attributes were also similarly toned down for balance issues."}, {"tag": "p", "text": "This article uses the statistics from Star Wars: X-Wing Alliance, since that is the later source."}, {"tag": "p", "text": "The databank archive and The Complete Star Wars Encyclopedia give the TIE avenger only two laser cannons, as The Far Orbit Project does, too, and state that the warhead launchers are optional."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}