{"url": "TIE/ag_%22Aggressor%22_Starfighter", "categories": ["Category:Canon articles", "Category:Imperial starfighter classes", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/ag \"Aggressor\" Starfighter"}, {"tag": "p", "text": "The TIE/ag \"Aggressor\" Starfighter, also referred to simply as the TIE aggressor or Aggressor, was a class of starfighter that was used by the Galactic Empire during the early rebellion against it and the subsequent Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE/ag \"Aggressor\" Starfighter, also known as the TIE aggressor or simply the Aggressor, was a class of TIE line starfighter that was manufactured by Sienar Fleet Systems and cost 75,000 credits. It was armed with forward-mounted medium laser cannons beneath the wings and a turret-mounted twin light laser cannon, and could be outfitted with Barrage Rockets. Similarly to other TIE line starships, the TIE aggressor had no deflector shields, no hyperdrive, no navigation computer, a twin ion engine, and two solar collectors that were also wings attached to a central cockpit. Unlike the other models, however, was that the hull was elongated for a dedicated gunner that operated the turret, while the pilot focused on operating the starfighter."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "As a fast attack and medium strike fighter, the TIE aggressor was used against shipping and smuggling, and also acted as a patrol craft."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIE aggressor was introduced into the Imperial Navy shortly prior to the Rebel Alliance victory against the Galactic Empire at the Battle of Yavin, and was developed in response to an increase in Rebel Alliance-backed smuggling and shipping. It saw action throughout the Galactic Civil War, and the starfighter was used by an elite squadron. At one point, a TIE aggressor flew near another TIE starship and fired a Barrage Rocket."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE/ag appears in canon in Fantasy Flight Games' 2020 roleplaying game sourcebook Starships and Speeders. It originated in the Star Wars Legends continuity video game Star Wars Galaxies: Jump to Lightspeed."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}