{"url": "TIE/vn_space_superiority_fighter", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:First Order starfighter classes", "Category:Sienar-Jaemus Fleet Systems products", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/vn space superiority fighter"}, {"tag": "p", "text": "The TIE/vn space superiority fighter, formally known as the TIE vendetta space superiority fighter and also known as the TIE silencer, was an angular variant of the TIE line starfighters used by the First Order. A product of Sienar-Jaemus Fleet Systems, its aggressive design and equally impressive firepower was specifically crafted for use among the most elite members of the First Order. As such, the fighter was engineered for speed and handling, though lesser pilots were still often overwhelmed and unable to maintain control of the nimble ship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As an advanced prototype starfighter, the TIE/vn incorporated the latest First Order military innovations, including experimental stealth gear meant to foil sensors and tracking. It featured a hyperdrive, a deflector shield generator and projector, and was powered by a starboard reactor. Twin ion thrust arrays at the rear of the ship acted as its engines. Along its wings were solar collector arrays, which featured a corrugated surface to maximize energy absorption. The ship itself featured a flight computer and could be modified to include customized flight controls for a single pilot, who entered the ship through a cabin access hatch at the top of the vessel."}, {"tag": "p", "text": "Working at hidden Sienar-Jaemus facilities, First Order designers reconfigured the weapons package of the TIE/sf to incorporate advances in power storage and energy conversion. For the TIE/vn, the TIE/sf's power cell spokes were replaced by a next-generation array protected beneath the hull, with shorter runs for trunk lines and converter coils. Rather than replicate the TIE/sf's ventral turret, the silencer relocated its missiles and heavy cannons to the wing apertures, giving the pilot superior targeting and a wider field of fire. Targeting sensors were also located in the wing aperture. Laser bolts were contained in a magnetic field bubble."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The pedigree of the TIE silencer traced back to the Galactic Empire's TIE/d \"Defender\" Multi-Role Starfighter, a hybrid fighter-bomber that never saw widespread use in the Galactic Civil War. The ship was revived by First Order technicians who saw it as a versatile attack craft to throw at New Republic forces. The TIE/sf space superiority fighter was an early attempt to bring heavier weapons to the battlefield along with the next-generation power capabilities needed to support them—improvements later incorporated into the silencer. It featured other design similarities to the Empire's TIE/IN interceptor and TIE Advanced x1."}, {"tag": "p", "text": "Kylo Ren utilized his own TIE silencer. His detailed post-flight reports allowed Sienar-Jaemus techs to refine the onboard systems, with an eye towards the day when shipyards were to begin mass-producing silencers for the regime's frontline units."}, {"tag": "p", "text": "Another test pilot by the name of Blackout also flew the TIE silencer. Although instead of battle-field-testing, the pilot flew over a classified planet where the environment was the true enemy."}, {"tag": "p", "text": "Klimo, a Resistance pilot who was a member of J-Squadron, hijacked a TIE Silencer just as it was getting primed for refueling. It was then used to aid J-Squadron in getting into Starkiller Base, where it was left and possibly destroyed along with the rest of the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE/vn space superiority fighter was created and developed for Star Wars: Episode VIII The Last Jedi, the eighth film in the Star Wars saga, which was released on December 15, 2017. The ship was officially revealed on The Star Wars Show on July 19, 2017. The TIE silencer was named by the Lucasfilm Story Group's Pablo Hidalgo. Although Hidalgo considered the name \"TIE vendetta,\" he eventually decided on \"TIE silencer,\" but hinted at the old name (\"/vn\") in the full technical name."}, {"tag": "p", "text": "The TIE silencer first appeared in the video game Star Wars: Galaxy of Heroes on November 9, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}