{"url": "TIE_Experimental_M1", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE Experimental M1"}, {"tag": "p", "text": "The TIE Experimental M1, also known as the TIE Bizarro, was an experimental member of the TIE Series and a part of the TIE Experimental Project."}, {"tag": "p", "text": "One of the starfighters built by an Imperial research project led by Director Lenzer under the command of Grand Admiral Demetrius Zaarin, the M1 consisted of a single standard TIE/LN starfighter wing panel with two wing braces connected to a pair of standard TIE series cockpit pods. The port pod held the control systems, and the starboard pod held a turbolaser much heavier than the laser cannons equipped on any previous TIE."}, {"tag": "p", "text": "Both pods had the trademark twin ion engines of the TIE series, and the fighter was actually slightly faster than the standard TIE/LN. The fighter was equipped with a hyperdrive, which was slaved to remote systems in a controller ship."}, {"tag": "p", "text": "Rebel forces first encountered the M1 when they responded to a distress signal from a civilian convoy near the Belat system. A pair of A-wings escorting a staff transfer from Defiance to Liberty picked up the distress call during a course change between hyperspace jumps and responded to the attack. They found a squadron of TIE Experimental M1 fighters attacking a Cloburi Freight convoy, while a Beta-class ETR-3 escort transport stood by. The A-wings defeated the TIE M1s with minimal Rebel or civilian losses."}, {"tag": "p", "text": "Later, when the Alliance ordered an intelligence-gathering strike on a TIE Experimental production facility, several waves of M1 fighters were found in the station's defense screen. They were also present at the main research facility, defending the hangar ship Sardis and space station Obsidian."}, {"tag": "p", "text": "After the destruction of space platform Obsidian, no TIE Experimental fighters were seen again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}