{"url": "TIE/gt_starfighter", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/gt starfighter"}, {"tag": "p", "text": "The TIE/gt (ground-targeting) starfighter was a ground-targeting bomber manufactured by Sienar Fleet Systems."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE/gt (ground-targeting) starfighter was part of the TIE Series of starfighters manufactured by Sienar Fleet Systems. Physically similar to the standard TIE/LN starfighter with a ball cockpit and hexagonal solar power panels, the TIE/gt had an enlarged and reinforced hull, as well as an elongated cockpit to accommodate the starfighter's ordnance bay."}, {"tag": "p", "text": "The TIE/gt was armed with a single laser cannon, and a concussion missile launcher which was designed to be modular to handle variable mission payloads. Standard TIE/gt fighter payloads consisted of twelve concussion missiles, but the launcher could handle other speciality payloads, including six proton torpedoes, eighteen air-deployed mines, two cluster bombs, or 20,000 plastic leaflets for use during propaganda campaigns."}, {"tag": "p", "text": "TIE/gt fighters achieved precise targeting by operating alongside TIE/fc starfighters, which provided the bombers with pinpoint target information. Larger targets, such as buildings or capital ships could be hit without external assistance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIE/gt fighter was a ground support bomber used by the Galactic Empire during its early years; its two-letter identification suffix came from its primary role as a ground-targeting starfighter/bomber. Originally, TIE bomber squadrons were comprised of TIE/gt models, but following the introduction of the TIE/sa bomber, mixed model squadrons became common. The Imperial Navy began a program of transferring TIE/gts out of naval squadrons, and relegating them either to remote outposts, or to Imperial Army controlled ground support squadrons. However, the Imperial Army resisted the Navy's overtures due to the fighter's undesirability and the lack of genuine demand."}, {"tag": "p", "text": "Squadrons assigned to Star Destroyers largely purged TIE/gts from their flightlines, although low-priority vessels still retained their TIE/gts."}, {"tag": "p", "text": "TIE/gts were deployed in the Nishr Suppression by Governor-General Vin Kollis, where they bombed three major cities on the continent of Feldt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}