{"url": "TIE_Advanced_x1/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:TIE Advanced x1", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE Advanced x1"}, {"tag": "p", "text": "The TIE Advanced x1, also known as \"TIE/x1\" or \"TIE Interceptor prototype\", was an advanced prototype starfighter touted as a replacement for the standard TIE Fighter tested by Darth Vader and X1 at the battles of Yavin and Mustafar respectively.\nWhile it never made it into production, many of its best design features were later incorporated into the TIE/sa bomber and TIE/IN interceptor. Further development of the Advanced continued, eventually leading to the TIE Avenger and TIE Defender."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE Advanced x1 featured a Sienar Fleet Systems I-s3a solar ionization reactor and paired P-s5.6 twin ion engines like the original TIE Fighter. However, the x1 had an original spaceframe, with an elongated rear deck and reinforced durasteel-alloy hull. The x1's most important innovation was the use of \"bent-wing\" solar array wings, like those used on the TIE/sa bomber, which had the advantages of increased surface area for more power while also reducing the craft's profile, compared to the TIE/LN starfighter's hexagonal panel wings."}, {"tag": "p", "text": "Speed was only slightly improved due to the added mass of the vessel; a good deal of the extra power was bled off to the deflector shield generators. While less maneuverable than standard TIE fighters, it was more resilient in battle."}, {"tag": "p", "text": "The 9.2 meter-long craft had twin heavy L-s9.3 laser cannons in a gimballed, front-mounted position, as well as a cluster missile launcher. In addition to its shields, it had a modest Class 4.0 hyperdrive but no life support systems. The target tracking system was also more sophisticated than the already formidable advanced targeting system on standard TIE craft, used to overcome the extremely powerful electronic jamming used by all combat craft to defeat target lock in battle. For best performance, the targeting system of the x1 required frequent adjustment in combat."}, {"tag": "p", "text": "Only the most elite Imperial pilots flew the TIE Advanced, and the starfighter was capable of fighting a T-65 X-wing starfighter to a draw."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Wishing to cut all ties with his Jedi past after his fateful duel, Darth Vader contacted Raith Sienar with a set of specifications for a new starfighter. Sienar and his team rose to the challenge and, after producing an early prototype, eventually presented Vader with the TIE Advanced x1 model. At least one ended up piloted by Juno Eclipse, back when she was still part of the Imperial forces as a member of the Black Eight Squadron. Because of Vader's positive reception to the X1's design, there was hope among the Imperial Naval hierarchy that it would be mass-produced in massive numbers. In 1 BBY, several months after the start of the Galactic Civil War, a renegade clone of the late Galen Marek stole Vader's TIE Advanced to escape Kamino and travel to Cato Neimoidia. Vader continued to fly it often afterwards, and even went to some lengths to have it recovered and repaired when damaged during the trench run at the Battle of Yavin 4."}, {"tag": "p", "text": "Armed with the references of a pleased Darth Vader, Sienar then presented his x1 to the Imperial Navy for mass distribution. The Empire, however, decided not to order the TIE Advanced x1 in large quantities, citing their excessive cost. Privately, some Imperial Navy strategists admitted that the Navy was afraid to purchase a fighter with a hyperdrive, fearing that it would give bureaucrats an excuse to slash orders for new capital starships. Some also feared that hyperdrive-equipped starfighters would facilitate defections. In the end, only a few squadrons were equipped with x1's. Nonetheless, Vader improved on the x1 design, eventually creating a modified version of the design that was also rumored to possess solar strakes to the panels."}, {"tag": "p", "text": "The few ships built were carried aboard Star Destroyers and other Imperial vessels. TIE Advanced x1s were deployed from Commander Strom's Pursuit-class light cruiser to stage an attack on the Wheel, which the Empire blamed on the Rebellion, excusing the Imperial takeover of the station. TIE Advanced were also utilized during the events at Constancia, with two being dispatched alongside boarding craft 356 to retrieve a life pod believed to contain a badly injured Luke Skywalker and Gamine (although in actuality it contained Han Solo and Sharlee in battle armor. Storm Squadron was known to use x1s extensively. Several x1 starfighters were also in a fleet gathering observed by Admiral Kendal Ozzel and Captain Firmus Piett at some point between the former's promotion to Admiral and the latter's promotion to Admiral."}, {"tag": "p", "text": "The Empire instead opted for the TIE/IN interceptor, which featured the TIE Advanced x1's drive system in a more compact ship. Although the TIE interceptor lacked a hyperdrive and shields, it was blindingly fast, incredibly maneuverable, and significantly cheaper than the TIE Advanced x1. By the Battle of Endor, the large increase in TIE Interceptor production meant the end of production for the TIE Advanced x1. The Advanced x1's bent-wing solar array wings were the same as the wings used on the similar but twin-hulled TIE/sa bomber.[source?]"}, {"tag": "p", "text": "The fighter flown by Vader at Yavin was repaired when he reached Imperial Relay Outpost V-798. Vader had it with him on the Terror, while overseeing the TIE Phantom project. When the Terror was destroyed by Rebel operatives, Vader escaped in his fighter. Vader again utilized his TIE Advanced x1 during the Battle of Hoth. However, his ship was damaged and rendered inoperative by Rebel starfighters piloted by members of Renegade Squadron"}, {"tag": "p", "text": "It was later stowed aboard the Executor and was apparently vaporized when the ship collided with the second Death Star during the Battle of Endor, though at least one TIE Advanced x1 was involved in the space battle over the sanctuary moon. One of Vader's other TIE Advanced x1 models was discovered by Jaden Korr in a hangar at Darth Vader's former stronghold on Vjun. Also, the Sith Lord X1 flew such a ship during the Battle of Mustafar. During the liberation of Coruscant, at least two TIE Advanced x1s, utilized by Elite Force, were tasked with guarding the Imperial Palace, although they ultimately failed."}, {"tag": "p", "text": "By the beginning of the Yuuzhan Vong War, enough of these ships had been made that some ended up in the hands of private parties such as Lando Calrissian, who used a modified TIE Advanced x1 for entertainment purposes in the asteroid belt at Dubrillion. During the Battle of Dubrillion, Jacen, Jaina, and Anakin Solo—Vader's grandchildren—flew three of these fighters against Yuuzhan Vong coralskippers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Geoffrey Mandel's 1978 blueprints for the Imperial I-class Star Destroyers, fighters known as \"TIE Assault Craft\" could be seen as part of the fighter complement. These bent-wing craft might have been TIE Advanced x1s with a different name or possibly a sister craft of the x1."}, {"tag": "p", "text": "The size comparison chart found in the 2011 reference book Millennium Falcon Owner's Workshop Manual seems to suggest a different length for the x1. By using the well documented sizes of the Millennium Falcon and the X-wing as a scale, the resulting size is roughly 7.6 meters."}, {"tag": "p", "text": "The x1 is armed with a supply of cluster missiles in its appearance in the game Star Wars: Rogue Squadron II: Rogue Leader."}, {"tag": "p", "text": "The x1 appears to have navigation lights that are like fog lights."}, {"tag": "p", "text": "Various x1 starfighters were seen in the background of an artwork by Tommy Lee Edwards depicting Admiral Ozzel and Captain Piett observing a fleet gathering in the 2012 guidebook The Essential Guide to Warfare. The background itself uses a picture from Ansel Hsiao's personal gallery as a background, originally titled \"Strategic Reserve.\" According to Ansel Hsiao in an email dated July 18, 2012, when he was creating the artwork, he chose the X1 starfighters to be among the fleet for a few reasons: He hadn't completed any TIEs that utilized a hyperdrive outside of the x1 at the time the artwork was made, and he envisioned the fleet in question as being a high mobility fleet, which required fighters that possessed a functioning hyperdrive. He reasoned that with those needs, units such as the fleet in the image were important enough to have access to limited-production fighters, and that limited-production fighters in a galaxy-spanning empire would still mean a lot of fighters in a relative sense."}, {"tag": "p", "text": "The Star Wars: Rogue Squadron III: Rebel Strike game gives the following description of the craft:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}