{"url": "TIE/IN_interceptor", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:TIE/IN interceptors", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/IN interceptor"}, {"tag": "p", "text": "The TIE/IN interceptor, also known as the TIE Interceptor, was a type of TIE fighter used by the Galactic Empire, most notably during the Battle of Endor. The interceptor was identifiable by the addition of four arrow-shaped panels tipped with laser cannons."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE/IN interceptor was a far deadlier opponent than the standard TIE/ln space superiority starfighter and featured four very recognizable pointed solar panels. These panels, based on the \"bent-wing\" configuration used on the prototype TIE Advanced flown by Darth Vader, were given a dagger like design, which gave a TIE fighter pilot a wider field of vision."}, {"tag": "p", "text": "Lacking both shields and a hyperdrive, it made up for its lack of defensive capabilities with a top speed of 1,250 kph owing to upgraded engines providing considerably improved maneuverability and speed. In addition, four laser cannons on its wingtips allowed for far more firepower to overload the shields on an enemy craft. With the Empire placing its elite pilots into Interceptor cockpits to maximize the craft's effectiveness, Interceptors were ideally suited for their main function: chasing down and eliminating rebel starfighters."}, {"tag": "p", "text": "Veteran rebel pilots understood that they should not underestimate the TIE interceptor's maneuverability and speed. In fact, to maximize the craft's speed, designers enlarged the standard twin ion engines, and added an autothruster. The TIE interceptor's large solar panels were included to give the needed power. Some interceptors belonging to elite pilots featured additional red and dark grey markings. In 2 BBY, Vult Skerris flew one of these starfighters, when he was based at Skystrike Academy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIE Interceptor was created by Sienar Fleet Systems upon realization that the TIE Advanced x1 would be too costly to mass-produce, and was also the Empire's direct response to the Rebel Alliance's introduction of faster starships. Despite this, it was not as fast as the RZ-1 A-wing interceptor, being 50 kph slower."}, {"tag": "p", "text": "The first confrontations between the Rebellion's X-wing fighters and the Empire's TIE interceptors came with the Battle of Turkana. General Weir flew a TIE interceptor. By the time of the Battle of Endor, the TIE Interceptor made up one-fifth of the Empire's starfighter fleet."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "By the time of the Cold War, the First Order used the TIE/ba Baron Space Superiority Interceptor, their own version of a TIE Interceptor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Databank entry for the TIE interceptor on StarWars.com states that it was first deployed sixteen years after the fall of the Galactic Republic in 3 BBY. Star Wars Jedi: Fallen Order later showed the TIE interceptor being used by the Second Sister, and one being used on Kashyyyk, in 14 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}