{"url": "TIE/mg_Mining_Guild_starfighter", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ship stubs", "Category:Sienar Fleet Systems products", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE/mg Mining Guild starfighter"}, {"tag": "p", "text": "TIE/mg Mining Guild starfighters, also known as Mining Guild TIE fighters, were modified TIE/ln space superiority starfighters that the Mining Guild was allowed to use due to its association with the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In order to make the fighters clearly distinct from the ones in direct service of the Galactic Empire, they had a yellow color scheme. They also had a notch cut in their stabilizers, giving them only eight solar collectors instead of twelve, which gave them improved visibility, but greatly diminished their combat capabilities and maneuverability. They were equipped with basic shielding to protect the investment in the equipment and training of the pilots. The Mining Guild also retrofitted the starfighter with specialized sensors to detect and analyze valuable resources."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Mining Guild used TIE/mg starfighters to patrol their territory to prevent theft of valuable materials and gasses, and were also used to locate such materials and gasses."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIEs were used at the Mining Guild's Asteroid Belt Gas Refinery, and saw use as defense during a heist of the refinery undertaken by the crew of the Ghost. In the encounter with the TIE/mg, Jedi Padawan Ezra Bridger riding a purrgil—a spacefaring species capable of traveling through hyperspace, and were said to have been what inspired the early development of the hyperdrive— used his lightsaber to sever one of the wings of a Mining Guild TIE fighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}