{"url": "TIE_Advanced_v1", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:TIE Advanced v1", "Category:TIE line"], "nodes": [{"tag": "h1", "text": "TIE Advanced v1"}, {"tag": "p", "text": "The TIE Advanced v1, or TIE/ad v1, was an experimental TIE fighter model of the Imperial Navy. It was heavily based off Republic Sienar Systems' own Scimitar. The starfighter was fitted with basic shields, and unlike the TIE Advanced x1, the v1's S-foils could fold in around the cockpit when not in flight, conserving hangar space. Unusual for a TIE model, it had solar panels only on the inside surface of the wings with armor on the outside surfaces in order to make it more resistant to lateral enemy fire. This resulted in low power output from the panels, requiring the engines to run on fuel instead of the solar reactor, which only powered weapons, sensors, and auxiliary systems. The TIE Advanced v1 was armed with dual chin mounted laser cannons, stronger than those of the TIE/ln space superiority starfighter, and a projectile launcher, used to fire tracking devices like the XX-23 S-thread tracker. Unlike most other TIE models, the v1 was outfitted with a hyperdrive and basic shields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TIE Advanced v1 was unveiled on Empire Day, on the planet Lothal, fifteen years after the formation of the Galactic Empire. During the unveiling, it was announced that the TIE Advanced v1 would be produced on Lothal by Sienar Fleet Systems. It was to be flown by Baron Valen Rudor. Immediately after the unveiling, the TIE Advanced v1 was destroyed by Kanan Jarrus."}, {"tag": "p", "text": "The Grand Inquisitor was entrusted with a TIE Advanced v1 of his own due to the sensitive nature of his top-secret missions in hunting down Jedi. This particular TIE was stolen by Kanan Jarrus and his Padawan, Ezra Bridger, when fleeing the Mustafar system. Afterward, it was given to the rebellion, where Major Capin Harinar's unit analyzed it."}, {"tag": "p", "text": "Later on, both the Fifth Brother and the Seventh Sister were also seen using TIE Advanced v1s during a mission to the planet Takobo to recover a Force sensitive Ithorian baby. These were destroyed by Garazeb Orrelios and Chopper when they found them in their hangar. They received replacements soon after, and used them to pursue the Phoenix Cell Jedi to the temple on Lothal."}, {"tag": "p", "text": "The Eighth Brother also used a TIE Advanced v1 to travel to Malachor and find Darth Maul. It was later hijacked by Chopper, and then used by Maul to escape the planet."}, {"tag": "p", "text": "After the Battle of Yavin, Lindon Javes flew one as the flight lead of Helix Squadron. During the Battle at Fostar Haven, he used the ion torpedoes to disable his wingmates in order to save a convoy of refugees from Alderaan. He then defected to the rebellion when Echo Squadron arrived."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars Rebels: Head to Head gives the length of a TIE Advanced v1 as 3.57 meters, but Star Wars Rebels: Beware the Inquisitor! states that the Inquisitor's TIE measures 9.2 meters in length. This article assumes the former source is correct. The Star Wars: Imperial Handbook: A Commander's Guide, which was developed prior to the reclassification of the Expanded Universe as Star Wars Legends and is based almost entirely in that material, includes a mention of the v1 model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}