{"url": "TIE/D_Defender", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:TIE/D Defenders", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE/D Defender"}, {"tag": "p", "text": "The TIE/D Defender, commonly known as the TIE Defender or T/D, was a high-performance TIE Series starfighter developed for the Imperial Navy by Sienar Fleet Systems in a project overseen by Grand Admiral Demetrius Zaarin shortly before the Battle of Endor. Representing a shift in starfighter design from previous TIE models, the ship featured a hyperdrive as well as deflector shields to allow it to operate independently of Imperial capital ships. The ship's speed and agility, combined with its arsenal of four laser cannons, two ion cannons, two warhead launchers and an optional tractor beam projector made it arguably the most advanced starfighter available at the time."}, {"tag": "p", "text": "After Zaarin's failed coup against Emperor Palpatine, the renegade admiral attempted to gain control of the TIE Defender technology to give his forces a technological advantage over the Empire. The advanced starfighter also attracted the attention of other factions, including the Rebel Alliance and pirate groups. Imperial forces under the command of Grand Admiral Thrawn were ultimately able to prevent the spread of the technology and the starfighter played a major role in Thrawn's successful campaign against Zaarin."}, {"tag": "p", "text": "Beyond the Zaarin campaign, the TIE Defender's high cost, together with political factors, kept it from achieving widespread use in the Empire and units were assigned only to the most elite pilots. The fighters participated in several other engagements during the Imperial era, including the Battle of Mygeeto and the Battle of Endor. Following the death of Emperor Palpatine at Endor, the TIE Defender continued to see limited use by Imperial forces. TIE Defenders saw action during Shadowspawn's campaign against the New Republic in 5 ABY and were used by the Republic's Rogue Squadron during a brief alliance with former Director of Imperial Intelligence Ysanne Isard against Prince-Admiral Delak Krennel's Ciutric Hegemony in 9 ABY. The fighters participated in multiple battles during the Yuuzhan Vong War and continued to be used by the Imperial Remnant until at least 44 ABY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The high success rate of more advanced Rebel starfighters against standard Imperial TIE Fighters resulted in a mounting cost of replacing destroyed fighters. That, combined with the realization that the inclusion of a hyperdrive would allow the fleet to be more flexible, caused the Imperial Navy to rethink its doctrine of using swarms of cheap craft instead of fewer high-quality ones, leading to the introduction of the TIE Advanced x1 and its successor, the TIE Avenger. The TIE/D Defender, commonly known as the TIE Defender or T/D, was touted as the next \"logical advance\" of the TIE Series—a starfighter that was fast, well armed and capable of hyperspace travel."}, {"tag": "p", "text": "Sienar Fleet Systems followed specific Imperial instruction in developing the TIE Defender, among them the requirement that the fighter would exceed the mission capability of a flight group of four standard TIE Fighters. As such, it was equipped with a series of innovations over previous models. The practice of designing craft to explicit consumer specifications was one that Sienar would continue with the later Scimitar assault bomber and Aleph-class starfighter. The TIE Defender was 9.2 meters long."}, {"tag": "h3", "text": "Pilot module"}, {"tag": "p", "text": "The pilot module was similar to those found in other TIE series fighters, with a ball cockpit and a hatch on the top for entry and egress. The module had room for a single pilot, 65 kilograms of cargo and consumables for up to one week. Like previous TIE models, the TIE Defender lacked life support systems and pilots were required to wear the standard sealed TIE pilot flight suit."}, {"tag": "p", "text": "In a departure from the design of previous TIE models, which typically had two parallel wings to either side of the pilot module, the TIE Defender had three quadanium steel solar array wings mounted around an aft section. The rear superstructure contained an I-s4d solar ionization reactor to store and convert solar energy collected from the wing panels. The distinctive triple-wing shape of the TIE Defender led Corran Horn to dub them \"trips,\" and the nickname was also adopted by other Rebel pilots. The wings themselves appeared similar to those found on the TIE Interceptor and TIE Avenger; unlike on its predecessors, the wings on the TIE Defender were angled out instead of in. The inclusion of a third wing provided additional solar power to increase the ship's range and the ship's energy management system was designed to allow weapons and shields to be charged with minimum loss of power to the propulsion system."}, {"tag": "p", "text": "One disadvantage of the design was an aft blind spot which could potentially be exploited by enemy fighters maneuverable enough to get behind the Defender and which was the cause of some frustration among pilots."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "The TIE Defender was one of the fastest starfighters in use during the Galactic Civil War. Although it was based on the standard twin ion engine design, it was upgraded to the entirely new P-sz9.7 twin ion engine, which was rated at 230 KTU and allowed it a maximum acceleration of 4,220 G or 21 MGLT/s and a top speed of 144 MGLT or 1,680 km/h in an atmosphere—almost 40 percent faster than a standard TIE Fighter. With tractor beam recharge power redirected to the engines, the top speed could be increased to 180 MGLT. In addition to the main thrusters located in the aft section, the Defender's triple wing design allowed for three arrays of maneuvering jets—which gave it a maneuverability rating of 110 DPF—and it featured an advanced F-s5x flight avionics system to process the pilot's instructions. When combined, these systems made the ship not only faster, but more agile than any other starfighter in Imperial service and capable of matching the fastest starfighters in the Alliance Fleet."}, {"tag": "p", "text": "The TIE Defender also featured a hyperdrive which allowed it to operate independently of capital ships. Testing of the original prototype indicated the need for a more powerful hyperdrive and production models included a class 2, ND9 hyperdrive motivator modified from the version developed for the TIE Avenger. The ship had a Sienar N-s6 Navcon navigation computer with a ten-jump memory."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "The TIE Defender's weapons systems were designed to allow it to engage multiple enemy fighters as well as the armed freighters frequently used by the Alliance. It carried a formidable array of weaponry; in standard configuration it had four L-s9.3 laser cannons mounted on the two lower wings and two NK-3 ion cannons mounted on the upper wing. The laser and ion cannons could be set to fire separately or, if concentrated power was required, to fire-linked in either pairs or quartets. The ion cannons could even be fired simultaneously with the laser cannons. Two targeting sensors were located between each pair of cannons to provide the pilot with a constant stream of targeting information."}, {"tag": "p", "text": "The ship also featured two M-g-2 general-purpose warhead launchers on the bottom of the pilot module, each of which could be equipped with a standard load of three proton torpedoes or four concussion missiles. Depending on the mission profile, the ship could be fitted with alternative warheads such as proton rockets, proton bombs, or magnetic pulse warheads. The inclusion of warhead launchers in the design was considered audacious by some members of the design team."}, {"tag": "p", "text": "The small tractor beam projector developed for the TIE Avenger could be easily fitted to the Defender. The tractor beam had limited range and could only be used for a short time before stopping to recharge, but it allowed the pilot to temporarily inhibit the mobility of enemy fighters, making it easier to target them with the ship's other weapon systems. Models produced by Ysanne Isard's Defender production facility regularly carried such tractor beams and the technology found other uses, such as allowing TIE Defenders to tow damaged starfighters until they could achieve the required velocity to enter hyperspace. Corran Horn discovered that by using the beam to target a large object, he could effectively use it as an anchor, allowing the TIE Defender to achieve a tighter turning circle."}, {"tag": "p", "text": "The ship's defenses were provided by a pair of forward and rear projecting Novaldex deflector shield generators—another advantage over standard TIE models. The shields were designed to recharge more rapidly than in previous Imperial fighters and were nearly as powerful as those found on capital ships, with a total rating of 100 SBD. The fighters were not equipped with particle shields, relying on the reinforced titanium hull to absorb impacts from matter. Its hull and wings were the strongest of any TIE series starfighter and were rated at 14 RU."}, {"tag": "h3", "text": "Systems"}, {"tag": "p", "text": "As with other TIE series fighters, the TIE Defender used a wheel and yoke control system. Pulling back would cause the ship to climb, pushing forward would cause it to dive and the ship could be made to bank and turn by twisting the controls. Grips on either side had the weapons trigger switches while an array of buttons and switches in the middle controlled other functions, including throttle, weapons selection and target acquisition. Manipulating rudder pedals caused maneuvering planes to expand or contract to angle engine thrust and quickly alter the ship's trajectory. The ship featured an auto-landing function to plot entry vector and landing speed, although the pilot could retain manual control if they preferred. When not in use, the ship could be left in a password controlled standby mode to prevent unauthorized use."}, {"tag": "p", "text": "Various display panels inside the cockpit allowed the pilot to monitor ship's systems and the surrounding area. The main Combat Multi-view Display displayed sensor data on targeted ships while additional monitors displayed short range sensor contacts. Additional panels displayed the remaining charge of weapons, shields and tractor beam systems, current warhead load and power usage. A chronometer was used to display the mission time, or during hyperspace travel to countdown to reversion to realspace. A heads-up display assisted the pilot in aiming the ship's weapons and displayed data from the ship's threat warning system. Like other TIE series starfighters, TIE Defenders were mounted on racks in the hangar when carried aboard a capital ship."}, {"tag": "h3", "text": "Cost"}, {"tag": "p", "text": "The TIE Defender was in many ways far superior to any other starfighter of the time, capable of outperforming the majority of Rebel starfighters with its combination of firepower, speed, and maneuverability. The sophisticated features of the TIE Defender had two major implications: firstly the inclusion of the hyperdrive, shields, and reinforced armor made the ship heavier than any of its predecessors—a fact which made its speed and maneuverability all the more impressive. Secondly and more importantly, the ship was very expensive, with each unit costing 300,000 credits—more than five times the cost of a standard TIE fighter—or 80,000 credits used. High maintenance and training costs added further to the expense of the fighters."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The TIE Defender was designed to serve as a multi-role starfighter, capable and durable enough to take on a variety of missions. Standard Imperial doctrine recommended that TIE Defenders operate in flight groups of four; however, Imperial commanders took advantage of the starfighter's superior abilities to customize mission forces on a case-by-case basis. Defender pilots often found themselves occupying mission roles previously held by older fighters such as TIE Interceptors and Assault Gunboats."}, {"tag": "p", "text": "The TIE Defender's weaponry and deflector shields made it an ideal space superiority fighter, capable of engaging multiple enemies at once. The craft possessed impressive speed promoting its function as a superior interceptor, capable of eliminating incoming starfighters before they posed a threat to Imperial capital ships. Pound for pound each TIE Defender matched or exceeded all Rebel starfighters in speed, armament, defenses, and maneuverability, proving a worthy adversary against even Imperial forces. Their effectiveness against Rebel forces earned them the nickname \"X-wing Killers\" among TIE Defender pilots and crew."}, {"tag": "p", "text": "Their hyperdrives allowed TIE Defenders to conduct patrols across large areas of space without support from capital ships. The versatility of the TIE Defender allowed a large degree of flexibility in its use, as even a single craft could prove formidable, able to outrun or outgun enemy fighters. While on recon missions, Defenders could also bring heavy ordnance to bear on enemy capital ships. Upon the discovery of Grand Admiral Zaarin's plot against Emperor Palpatine, the Sith Lord Darth Vader employed the TIE Defender's abilities in that role, breaking through Zaarin's lines to reach the planet Coruscant. Lord Vader's flight group destroyed the Immobilizer 418 cruiser Harpago, which was attempting to block his imperative voyage."}, {"tag": "p", "text": "The TIE Defender's ion cannons paired with the ability to carry multiple warhead types allowed it to function as an effective light bomber or assault fighter. TIE Defenders often assumed missions to disable or destroy enemy installations or capital ships, at times by a single flight group or with only Gamma-class ATR-6 assault transports as support. Defender squadrons could combine their firepower to eliminate a target as large as Alliance Space Stations, while still covering the starfighter interception role."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "Opportunities to train on the TIE Defender were limited, only high-ranking ace TIE Interceptor pilots who had survived at least twenty combat missions, and whose loyalty to the Empire was undisputed, were selected, ensuring that only the best pilots flew the advanced starfighter. During the Galactic Civil War, Imperial pilots were required to gain a training certificate by flying the TIE Defender through an enclosed training course before proceeding to simulated combat missions. The training course consisted of a cylindrical loop containing targets and obstacles for pilots to traverse. Defender pilots raced against the clock to navigate the course, destroying targets when at all possible to gain bonus time. Having received a training certificate, Defender pilots could move onto the combat scenarios, some of which were based on historical sorties, designed to familiarize the pilot with the controls and handling of the starfighter before they entered actual combat. If the pilot successfully completed all four training missions, they received the gold TIE Defender combat medallion."}, {"tag": "p", "text": "By the later years of the Empire, less rigid training regimes were in use. When Rogue Squadron trained on the TIE Defender against Imperial forces commanded by Ysanne Isard, they engaged the Imperials in a series of mock battles including a recreation of an Imperial attack on Rogue Squadron's former base at Yag-prime."}, {"tag": "h3", "text": "Combat scenarios"}, {"tag": "p", "text": "The first combat training exercise tested the pilot's ability to dogfight against a variety of Rebel starfighters and allowed them to customize the difficulty of the mission by controlling the number and skill of opponents, to a maximum of 250 potential kills. For a greater challenge, the pilot could choose to face enemy TIE Defenders. Defender pilots began the simulation stationary, surrounded by five cargo containers. Upon inspection of named containers, for example \"Y-wing,\" individual starfighters entered the system at increasing difficulties, five in all. Defender pilots could increase the challenge by attacking the container, sending in all difficulty levels at one time. In the event that the pilot could not handle the increased demands of the mission, destroying the container resulted in the spacecraft derived from the inspection entering hyperspace. Another control level installed consisted of enemy fighters responding to the trainee's orders; pilots could instruct enemy fighters to wait or head for home in the event the challenge grew too great."}, {"tag": "p", "text": "In order to test the pilot's ability to make effective use of a tractor beam, the second combat exercise challenged them to prevent the escape of Rebel spy from a salvage yard near Venzeiia 2 Prime. In a recreation of a mission led by the Imperial-class Star Destroyer Glory, the pilot had to snare a spy's YT-1300 light freighter in order to disable it for capture by Imperial forces, and then assist in the capture of the yard itself. The pilot arrived in the system to find three Corellian transports aboard the station. With multiple transports, some fleeing from the arrival of Imperial forces, pilots had to move quickly to disable all transports and locate the spy. Rebel A-wings added to trainee frustration by acquiring missile locks as trainees scrambled to stop fleeing transports. After disabling all three transports, trainees had completed the primary objective, but could continue to aid in the capture of the platform, protect Imperial boarding craft, disable a Rebel B-wing, and destroy any other Rebel sympathizer craft in the area."}, {"tag": "p", "text": "The third combat exercise demonstrated the ship's ability to operate independent of capital ships by inspecting vessels passing through a hyperspace jump point and disabling any vessels carrying contraband for capture by Imperial forces. After entering the system, pilots waited as cargo craft began passing through the sector, starting with Modular conveyors. Cargo ferries soon followed, one of which contained Rebels. Pilots could disable the craft for capture immediately upon the discovery, or wait until after inspecting the remaining transports, completing the primary objective. After disabling the contraband-carrying cargo ferry, trainees fended off multiple series of Rebel starfighters, protecting their command ship and boarding craft. All secondary and bonus objectives could be completed by eliminating all non-Imperial craft in the system, and successfully capturing the contraband."}, {"tag": "p", "text": "As a final test of the trainee's abilities, the pilot learned to use the TIE Defender as a light bomber to attack capital ships, using warheads to quickly eliminate their shields and ion cannons to disable them for capture. Armed with proton bombs, trainees arrived in system to discover two Rebel Ton-Falk-class escort carriers loaded with starfighters, however the primary objective only dictated the necessity of capturing one carrier. Despite the heavy payload, pilots used their wing mates to strategically assault at least one carrier by eliminating its weapon emplacements, being unable to completely lower the carrier's shields with projectile ordnance. Once the carrier was disabled, trainees had completed their primary objective, and were able to continue with secondary and bonus goals of destroying an enemy frigate, corvettes, and various Rebel starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early development"}, {"tag": "p", "text": "The Empire's loss at the Battle of Yavin forced it to reconsider its tactics in fighting the Rebellion. Several new weapons projects were initiated as a result, among them the TIE Defender. Such was the importance of the TIE Defender that the top secret development project was conducted under the supervision of top naval commanders, including Grand Admiral Demetrius Zaarin, then head of research and development for starfighter technology, and the project would see several prototype stages before its completion shortly before the Battle of Endor in 4 ABY."}, {"tag": "p", "text": "The initial prototype for the TIE Defender was the TIE/Ad x7, developed at the Sienar Advanced Research Division on Corulag with input from Zaarin. Although the tri-wing design of the ship was in place for the initial prototype, the ship was intended only as a test bed for the drive and targeting systems; it did not have the final ion engines and lacked the hyperdrive, ion cannons, and missile launchers which were incorporated into later prototypes and the final design."}, {"tag": "p", "text": "In early 3 ABY, the Empire launched a massive assault on the Rebel base on Hoth. As the main Rebel forces struggled to delay the Imperials, the Alliance's Renegade Squadron destroyed the weaponry on two Victory II-class frigates as they attempted to escape. The Imperials decided to test out the TIE Advanced x7 prototypes and dispatched a unit of the vessels to join the fight. However, the early models lacked the speed of the final version and, although they now included missile launchers, the ion cannons were still absent. Six of the TIE Advanced x7 prototypes were destroyed by Renegade Squadron who also managed to board a Star Destroyer and steal one of the fighters to be studied by Alliance High Command. The Empire dismissed the theft as unimportant since the prototype lacked most of the systems planned for later models and, despite the prototypes' failure against the Rebels, the data collected during the battle proved useful to Sienar Fleet System's technicians in further developing the fighter."}, {"tag": "h3", "text": "Final development and testing"}, {"tag": "p", "text": "Following the Battle of Hoth, Emperor Palpatine charged Grand Admiral Zaarin with the continuing development of the TIE series. Zaarin had all ongoing projects transferred to the XQ6 Platform Research in the Parmel system, including the TIE Defender and TIE Avenger, an evolution of Darth Vader's TIE Advanced x1 which Zaarin saw as merely a step towards completion of the TIE Defender. Both projects relied heavily upon the development of a hyperdrive which could be mass produced and which would be small enough to fit inside the fuselage of a TIE fighter. When that proved problematic to Zaarin's team, the Grand Admiral managed to acquire the technology from the Habeen through a combination of diplomacy and military action against their rivals, the Nharwaak. By the time that the TIE Avenger, modified by Zaarin to use the Habeen hyperdrive technology, entered service, the TIE Defender project had reached the final prototype stage and the Empire was planning to roll the finished product out as a replacement for the Assault Gunboat."}, {"tag": "p", "text": "When the final prototypes were ready for inspection, Darth Vader instructed Zaarin to have six of the new fighters delivered to Emperor Palpatine on Coruscant for his personal review. Three cargo ferries from Sela group were sent to Zaarin's research facility to collect the prototypes, loaded into containers for transport. The Rebel Alliance attempted to disrupt the loading operation but their raiding party was defeated by Imperial fighters."}, {"tag": "p", "text": "The Empire soon learned that the Rebels were planning an ambush at Vinzen Neela 5, where the prototypes were to be transferred to the Imperial escort carrier Hininbirg. That time, Rebel fighters were joined by the CR90 corvettes Mar Duun and Vop Hui, which were attempting to plant a minefield around the rendezvous point. Responding quickly to the threat, Maarek Stele led a group of TIE Avengers to the rendezvous point, arriving before the Imperial ships to prevent the ambush and cover the transfer operation, allowing the Hininbirg to complete the delivery of the prototypes to Coruscant."}, {"tag": "h3", "text": "Deployment"}, {"tag": "p", "text": "After initial testing of the prototypes, the fighter entered service, deployed to a limited number of elite squadrons for full field testing. The ship received an icy reception from those in the Imperial hierarchy. Many in the Imperial Navy who had not been privy to the starfighter's development were surprised by its sudden introduction. Some resented the ship due to a feeling that Zaarin had gathered too much power and prestige, while others saw the fact that the ship did not fit in with the traditional tactics of the Imperial Navy as an admission of failure, leading to some resentment towards the ship, and the commanders that used them in battle. Such was the level of resentment toward the ship that, had certain elements of the Imperial Navy known of its secret development, it is likely the project would have been abandoned before completion. In the end, the field tests were never extensive and this, together with the prohibitive cost, meant that even an organization as wealthy as the Imperial Navy chose not to mass-deploy such a fighter."}, {"tag": "p", "text": "Some of the fighters were used to protect the TIE Experimental Project, another starfighter development project with which Zaarin was heavily involved. A handful of TIE Defenders from Shadow Squadron responded to the Rebel attack on the Bretie Facility but were too late to prevent the loss of the facility. Members of Shadow Squadron were again involved in action against Rebel forces when the Alliance attacked the Obsidian research platform but were destroyed along with the facility."}, {"tag": "h3", "text": "Zaarin's betrayal"}, {"tag": "p", "text": "The TIE Defender's most extensive use during the Galactic Civil War occurred when Zaarin attempted a coup against Emperor Palpatine. While Darth Vader led the search for the forces of the treacherous Admiral Harkov, Zaarin's forces attacked Vader's ship, the Star Destroyer Garrett. Though the Garrett survived, it had sustained damage that would prevent Vader from reaching Coruscant in time to warn the Emperor. However, the Garrett was one of the few ships to be carrying TIE Defenders, the Dark Lord of the Sith having brought them aboard in the hope of conducting operational trials. Vader selected five ace pilots, including Maarek Stele, to accompany him to Coruscant in the new starfighter."}, {"tag": "p", "text": "After escaping a trap set by Zaarin's Immobilizer 418 cruiser Harpago—destroying the ship with the help of the Nebulon-B2 frigate Osprey—they arrived at Coruscant to find the Emperor's Star Destroyer, the Majestic, badly damaged and the Emperor being taken to Zaarin's flagship, the Star Destroyer Glory. The TIE Defenders disabled the Emperor's shuttle and protected it while the Emperor was rescued by loyal forces."}, {"tag": "p", "text": "The Empire soon came to suspect that Zaarin had been planning his coup during the development of the TIE Defender, using its advanced technology to give him an advantage over loyalist forces. Indeed, Zaarin quickly attempted to ensure a technological advantage by eliminating TIE Avenger production facilities throughout the Empire. Although the Empire was unable to prevent the destruction of the facilities, Zaarin's own starfighters were used against him as TIE Defenders held his forces off long enough for Imperial personnel to evacuate and to prevent Zaarin from looting technology which could be used to produce his own TIE Avengers and TIE Defenders. They also proved instrumental in capturing magnetic pulse warhead technology from the Rebel station RS-32."}, {"tag": "h3", "text": "Technological advantage"}, {"tag": "p", "text": "With the Empire's ability to manufacture TIE Avengers severely reduced, Zaarin continued to pursue a technological advantage over the Empire by targeting the research facility where he had overseen development of the TIE Defender. As Zaarin's forces attempted to escape with several TIE Defender prototypes, an Imperial strike force, consisting of TIE Defenders and assault transports, arrived to prevent the loss of the prototypes and to recapture the base itself. The Empire succeeded in preventing Zaarin from acquiring most of the remaining TIE Defender prototypes and, after the facility was secured, the Star Destroyer Adarga arrived to defend it."}, {"tag": "p", "text": "Zaarin soon sent his own TIE Defenders and assault transports to retake the base. With the Adarga's supply of fighters insufficient to repel the attack and the shields on the research facility not yet at full strength, the Empire was forced to call for reinforcements and deploy one of their few remaining TIE Defenders. Since TIE Defenders were considered too valuable to destroy, Maarek Stele, piloting the Empire's TIE Defender, was given instructions to disable Zaarin's own TIE Defenders. Although the Empire succeeded in eliminating Zaarin's forces, even managing to capture some of his valuable TIE Defenders in the process, the Adarga took heavy damage and was forced to withdraw, leaving the base undefended."}, {"tag": "p", "text": "Zaarin had no intention of letting the Empire control the TIE Defender technology and led an assault to destroy the facility from the Glory. With the Adarga gone, the Empire was forced to evacuate the two remaining prototypes on the BFF-1 bulk freighter Mharsup, while the chief engineer fled with his team and the project data on the Lambda-class T-4a shuttle G'nabgib. A third TIE Defender, flown by Stele, assisted Delta-class JV-7 escort shuttles against Zaarin's fighters."}, {"tag": "h3", "text": "In enemy hands"}, {"tag": "p", "text": "From early in the ship's operational history, the TIE Defender attracted the attention of several other groups who attempted to acquire its technology. As Zaarin launched his coup, Hamo Blastwell, a Rebel agent posing as an Imperial officer, attempted to steal the plans to the starfighter from the Glory. Blastwell managed to escape, though Zaarin's crew prevented him from taking the plans."}, {"tag": "p", "text": "The Rebels again came close to acquiring the technology as the Mharsup rendezvoused with Assassin-class corvette group Hashim, near navigation buoy B-0F9, to transfer the prototypes to the safer ships for delivery to Admiral Thrawn, who was under orders to deliver them to a safe location. Shortly after the Imperials arrived at the rendezvous point, they came under attack from a Rebel strike team which attempted to capture the convoy. However, Imperial forces were able to hold off the Rebels until the transfer was complete and Hashim group fled to hyperspace."}, {"tag": "p", "text": "The Imperials' escape was short-lived as they came out of hyperspace into an ion cannon minefield set by Rneekii pirates. All three corvettes, as well as the G'nabgib were quickly disabled. With the arrival of Assault Gunboat reinforcements, the Imperials were able to prevent the capture of the corvettes by pirate transports. The corvettes were still disabled and vulnerable, and the G'nabgib had been captured, giving the pirates access to the TIE Defender scientists. Though the Imperials suspected it would take some time for the pirates to replicate the technology, they knew that a program to create a counter to the fighter would need to be implemented immediately."}, {"tag": "p", "text": "The Empire quickly dispatched three cargo ferries from Mssan group to rescue the prototypes from the stranded corvettes. The transfer came under attack from Rebel starfighters and Zaarin's own TIE Defenders. While the Imperial forces battled the Rebels and Zaarin's forces, Nami pirates came out of hyperspace and used the distraction to capture the disabled Hashim 1 and escape with its TIE Defender. Though the Empire was able to finally take the remaining TIE Defenders to Thrawn who saw them safely to Coruscant, the news that the technology had fallen into pirate hands presented a major threat."}, {"tag": "p", "text": "With the Empire's remaining TIE Defenders finally secured, they began a campaign to prevent the spread of the technology. The Rneekii pirates offered to ransom the lead scientist to the highest bidder. Although Zaarin negotiated with them, it was the Empire who made the highest bid and sent a shuttle to rendezvous with the pirates and conduct the exchange. Once the scientist was safely aboard, the Interdictor Red Claw arrived to trap the pirates while Imperial forces disabled and captured the transport carrying the ransom. The Nami pirates struck during the operation in an attempt to capture the scientist themselves—their leader, Ali Tarrak, was hoping to use the captured prototype as a model for producing their own TIE Defenders and sought the scientist's expertise. Though the Imperial forces succeeded in stopping the Nami from capturing the scientist, the Nami were able to inflict damage on the Red Claw's hyperdrive, leaving it stranded in the system. The Assassin-class corvette group Chemeti was sent to deliver supplies to the Red Claw and retrieve the rescued scientist. Zaarin sent his forces, including several TIE Defenders, to distract the Imperial forces, while his own corvette, using Chemeti 1's transponder code, collected the scientist."}, {"tag": "h3", "text": "Missile Boat diplomacy"}, {"tag": "p", "text": "Of even greater concern than the loss of the lead scientist was the news of a Nami attack on an Imperial cargo transfer area in the Yrrna system using TIE Defenders. Not only did this indicate that the Nami had begun production of their own TIE Defenders, but the presence of the Rebel Carrack-class cruiser Jester to observe the attack indicated that the Nami may be negotiating to sell the technology to the Rebel Alliance."}, {"tag": "p", "text": "Both the Emperor and Admiral Thrawn were concerned about the possible spread of the technology and the Empire resolved to eliminate all TIE Defenders in enemy hands. To that end, Admiral Thrawn had been secretly working with Cygnus Spaceworks to develop the Missile Boat—a starfighter specifically designed to counter to the TIE Defender."}, {"tag": "p", "text": "The Missile Boat soon made its debut—Imperial spies learned that the Nami arms merchant cruiser Nuance was carrying TIE Defenders for sale to the Rebel cruiser Prism, and Thrawn ordered the capture of the fighters. Missile Boats engaged enemy forces while Thrawn, aboard the Star Destroyer Grey Wolf, oversaw the capture of the Nuance. The raid recovered eight TIE Defenders which the Empire was able to retain despite a subsequent Rebel attack on the Grey Wolf. The Empire also acquired many prisoners who, under interrogation, revealed the location of the manufacturing plant where Tarrak was producing the fighters."}, {"tag": "p", "text": "With Tarrak's Deep Space Manufacturing Facility located, Thrawn led the Grey Wolf's forces in a major attack on the facility, aimed at eliminating any further threat from the proliferation of TIE Defender technology. With her TIE Defenders caught unprepared, Tarrak's starfighters were quickly eliminated and her factory soon fell to a combined Missile Boat and TIE/sa bomber attack, while Tarrak herself was captured as her ship attempted to flee."}, {"tag": "p", "text": "Although the Empire had prevented TIE Defender technology from spreading further, Zaarin still possessed a number of the starfighters and continued to use them in his campaign against Thrawn's forces. The Missile Boat proved an effective foil to Zaarin's TIE Defenders and enabled the Empire to greatly diminish his supply of the fighters. By the time that Thrawn finally trapped Zaarin in the Unknown Regions, only a handful of the starfighters remained in the rogue Imperial's control."}, {"tag": "h3", "text": "Other Imperial use"}, {"tag": "p", "text": "Some TIE Defenders were stationed aboard Darth Vader's flagship, the Executor. During the Battle of Mygeeto—as the Executor led Imperial forces in the invasion of the Rebel base on Mygeeto—the Imperial fleet came under attack from several Rebel capital ships, and Admiral Firmus Piett ordered use of TIE Defenders in the defense of the fleet. Flown by elite pilots, TIE Defenders aided in the destruction of the Rebel ships and the Empire went on to capture the Rebel base."}, {"tag": "p", "text": "A mixed squadron of TIE Defenders from the 29th Fast Attack Squadron and TIE interceptors from the 92nd Interceptor Squadron were stationed aboard the Nebulon-B frigate Mephitis while it was on assignment near Polis Massa. The TIE Defenders were tasked with defending the frigate as it conducted tests of the TIE/ph phantom, an Imperial starfighter fitted with an experimental cloaking device. At some point, TIE Defenders participated in a Base Delta Zero orbital bombardment operation led by the Assertor-class Star Dreadnought Wrath. Similarly, TIE Defenders also operated around the Naval Station Validusia. At one point, the Zann Consortium had the opportunity to acquire the ability to construct TIE Defenders by attacking Imperial assets in orbit of Corulag."}, {"tag": "p", "text": "In 4 ABY, the Empire lured the Rebel Alliance into attacking the second Death Star battlestation in orbit of Endor, where the Imperial Navy would be waiting to spring a trap. At least one element of TIE Defenders, as part of Onyx Squadron, saw action at the Battle of Endor, but they were a very small minority of craft at the battle. The lack of TIE Defender involvement in the ambush was of only minor concern within the Empire due to the significant number of TIE interceptors taking part. The battle ultimately turned against the Empire and the small number of TIE Defenders were unable to make a significant impact."}, {"tag": "p", "text": "As the Empire began to crumble following the Battle of Endor and the death of Emperor Palpatine, the cost of the TIE Defender became an even greater factor and the model was decommissioned. Though information obtained by the New Republic on Spirana in the year following the Battle of Endor indicated that there were over ten thousand production TIE Defenders unaccounted for, the cessation of production prevented it from ever achieving widespread use. Nonetheless, any TIE/D Defenders that were already created prior to being decommissioned were placed into groups such as Elite Force, at least two of which would later be used during the New Republic's Liberation of Coruscant to defend the Imperial Palace."}, {"tag": "h3", "text": "Post-Endor"}, {"tag": "p", "text": "The TIE Defender received some support from Countess Iran Ryad, an Imperial politician who trained as a starfighter pilot in her spare time. After the Battle of Endor, Ryad requisitioned a TIE Defender and quit her political role to take command of a group of four TIE Defenders charged with patrolling the coreward borders of the Empire. Ryad had her TIE Defender, the Red Star 1, heavily modified to enhance its shields, provide increased maneuverability through an upgraded engine, and allow increased firepower by tuning the fire control system. However, the modifications came at a high cost of 62,500 credits. After several successful patrols, Ryad took command of Red Star Squadron and began attacking any ships entering Imperial space without permission. Her actions brought her into conflict with her commanders and, after being charged with treason, she was eventually defeated by Baron Soontir Fel."}, {"tag": "p", "text": "Following Palpatine's death, the former Director of Imperial Intelligence and Prophet of the Dark Side Shadowspawn acquired many of the remaining TIE Defenders. Establishing a base on Mindor in the Taspan system, Shadowspawn used the vessels to launch a series of raids in the Inner Rim, Expansion Region and Mid Rim aimed at capturing prisoners to serve as his Pawns. Over the course of two months during 5 ABY, the TIE Defenders were involved in dozens of raids on shipping. Despite the New Republic's efforts to capture a TIE Defender pilot in the hopes of learning Shadowspawn's location, a deadman interlock fitted to the fighters ensured that they were destroyed if the pilot was killed or lost consciousness. Rogue Leader Wedge Antilles eventually devised a plan to locate the base by attaching tracking devices to the hulls of TIE Defenders. The New Republic developed flechette torpedoes specifically to engage TIE Defenders—taking advantage of the TIE Defender's lack of particle shields, the torpedoes detonated into a cloud of durasteel shrapnel which would pierce the hulls of fighters that passed through. Within the cloud were hidden thousands of miniature tracking devices which would attach to the hulls of surviving fighters."}, {"tag": "p", "text": "Putting Antilles's plan into action, Rogue Squadron hid within a facsimile of the luxury liner Corellian Queen, while New Republic Intelligence leaked information that lured a TIE Defender squadron commanded by Captain Klick into an attack. The flechette torpedoes proved effective, allowing Rogue Squadron to destroy almost thirty percent of the enemy fighters, before the surviving TIE Defenders retreated, carrying the tracking devices with them. Though the devices were soon discovered, Shadowspawn, hoping to lure Jedi Knight Luke Skywalker to Mindor, allowed the New Republic to receive a signal from the devices, leading them to his base. TIE Defenders were heavily involved in the subsequent Battle of Mindor, engaging New Republic starfighters as they arrived in orbit of Mindor, and subsequently ambushing New Republic reinforcements, including the Millennium Falcon, as they approached the system."}, {"tag": "p", "text": "At some point following the Battle of Endor, the Force-sensitive Imperial clone X1 came into possession of several TIE Defenders, which were stationed aboard a Star Destroyer under his command when he traveled to Mustafar in order to create a clone army. X1's twin clone, X2, leader of the Rebellion's Grey Squadron, followed his brother to Mustafar in an effort to stop him. Landing aboard X1's orbiting Star Destroyer, Grey Squadron sabotaged the ship before escaping in X-wings. After defeating X1 in his personal TIE, the group were pursued by X1's TIE Defenders, but were able to destroy them before heading to the planet's surface."}, {"tag": "p", "text": "The ship resurfaced during the return of Grand Admiral Thrawn, though they were still deemed too difficult to produce and maintain, and remained both a minority within the Imperial fleet and politically unpopular. The few squadrons that remained in service were largely used to patrol the boundaries of what would become the Imperial Remnant."}, {"tag": "h3", "text": "Isard's revenge"}, {"tag": "p", "text": "During the New Republic's campaign against Prince-Admiral Delak Krennel's Ciutric Hegemony, Rogue Squadron was sent in search of an Imperial superweapon near Distna. The superweapon rumors were bait to lure them into a trap, and they were quickly ambushed by six squadrons of TIE series starfighters. The Rogues were rescued from the trap by the arrival of two squadrons of TIE Defenders, Interloper and Stranger Squadrons, under the command of Colonel Broak Vessery. The Defenders hit Krennel's forces hard, using a combination of lasers and torpedoes to eliminate Krennel's remaining forces within five minutes of their arrival. Despite the Rogues' reluctance to trust the Imperials, they agreed to follow them back to their base before Krennel sent reinforcements."}, {"tag": "p", "text": "The Imperials were stationed at one of several secret Imperial bases throughout the galaxy. The base was one of the few facilities capable of producing TIE Defenders. It was an indication of the rarity of the TIE Defender that the three full squadrons of the fighters located at the base were more than Rogue Squadron's commander, General Wedge Antilles, thought had ever been built. The base was formerly under the command of General Arnothian, who had intended to use the TIE Defenders to establish himself as a warlord before Director of Imperial Intelligence Ysanne Isard disposed of him and took control of the facility."}, {"tag": "p", "text": "Isard claimed that she wanted peace with the New Republic. To that end, she had dispatched Vessery to aid the Rogues and then proposed to prove her intentions by helping them eliminate Krennel and rescue prisoners from her Lusankya, including famed Rebel Jan Dodonna. Isard would provide Rogue Squadron with TIE Defenders and cover identities to aid them in infiltrating Krennel's capital on Ciutric IV, posing as Imperial defectors. They would then eliminate the shield generators and defensive positions, allowing her forces to storm the prison. Meanwhile, a New Republic fleet would engage Krennel's forces."}, {"tag": "p", "text": "The Rogues quickly began training on the TIE Defender. Over the coming weeks, they engaged in frequent simulated battles against Interloper and Stranger Squadrons before departing for Ciutric. Although Isard betrayed both sides, using the Defenders, Rogue Squadron pilots successfully brought down the planetary shield of Krennel's capital, rescued the prisoners, and eliminated a clone of Isard herself. After the real Isard was killed in an attempt to retake the Lusankya, Vessery disappeared along with his two squadrons of TIE Defenders."}, {"tag": "p", "text": "Defenders remained in limited use under the Imperial Remnant, deployed in small numbers to the best pilots, rather than to whole squadrons. Shortly after the end of the Adumari Civil War, the Empire launched an assault on New Republic forces in orbit of Adumar. Among the Imperial fighters were four TIE Defenders in the service of the 181st Imperial Fighter Wing under Turr Phennir, deployed in two pairs. These fighters acquitted themselves well and destroyed or disabled many New Republic starfighters. The Imperial forces were ultimately defeated and at least one of the TIE Defenders was destroyed in combat with members of Rogue Squadron, with Phennir's damaged and forced to withdraw."}, {"tag": "h3", "text": "Yuuzhan Vong War and later use"}, {"tag": "p", "text": "Despite the Empire's long held resistance to the TIE Defender, they would continue to be used by the Imperial Remnant until at least the end of the Yuuzhan Vong War, with the starfighters stationed on many Imperial capital ships including Grand Admiral Gilad Pellaeon's flagship, the Right to Rule."}, {"tag": "p", "text": "During Operation Trinity, Captain Mynar Devis of the Immobilizer 418 cruiser Wrack personally flew one of three TIE Defenders escorting the Millennium Falcon to meet with Wedge Antilles's Alpha Fleet at Bilbringi, after the Yuuzhan Vong crippled several HoloNet relay stations, cutting off communication between Galactic Alliance forces. The group emerged from hyperspace to find Alpha Fleet embattled with Yuuzhan Vong forces and prevented from escaping by a Vua'spar interdictor. Devis sent one of his wingmates to inform Grand Admiral Pellaeon of the Yuuzhan Vong trap, while the others assisted the Galactic Alliance forces attacking the Vua'spar. Though they eliminated several enemy ships, both TIE Defenders were destroyed helping destroy the Vua'spar to allow Alpha Fleet to escape."}, {"tag": "p", "text": "As the war entered its final stages, the Yuuzhan Vong mounted a major attack on the Galactic Alliance capital of Mon Calamari. At the Battle of Mon Calamari, many TIE Defenders were deployed into combat as part of an elite strike team, with other notable squadrons such as Rogue, Twin Suns, and Vanguard Squadrons. Almost an entire squadron of TIE Defenders was incinerated when capital ships at the heart of the Yuuzhan Vong fleet fired Yaret-Kor plasma cannons en masse at the attacking starfighters."}, {"tag": "p", "text": "In 44 ABY, former Imperial admiral and Galactic Alliance Chief of State Natasi Daala plotted to overthrow the Imperial Head of State, Jagged Fel. Daala gathered her forces—comprising her Maw Irregular Fleet and the fleets of Moffs Drikl Lecersen, Porrak Vansyn, and Trevin—over Exodo II in the Meridian sector, but news of the rendezvous had reached Fel, who was waiting to spring a trap. As the loyalist Imperial fleet engaged Daala's forces, Lecersen launched baradium missiles at key points on Fel's flagship, the Star Destroyer Gilad Pellaeon, forcing its crew to evacuate. Fel, along with his aide Ashik and his Jedi bodyguard Tahiri Veila, fled in three of the ship's complement of TIE Defenders. Despite their age, the starfighters' combination of speed and maneuverability enabled the three to reach the safety of the Turbulent-class Star Destroyer Bloodfin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE Defender was created for the 1994 LucasArts video game Star Wars: TIE Fighter in which the craft was flyable by the player. Although this craft was initially left out of the multiplayer Star Wars: X-Wing vs. TIE Fighter (1997) for the sake of balance, the game data files still have an entry for the TIE Defender in the craft library, with the description field reading \"Advanced space superiority fighter. This craft is too powerful to be put in this simulation. Dream on, fanboy!\" The TIE Defender returned in 1999's Star Wars: X-Wing Alliance, making an appearance in the single-player campaign and available as a player craft in the multiplayer mode."}, {"tag": "p", "text": "TIE Defenders appear in Star Wars Battlefront: Renegade Squadron and fighters which appear to be TIE Defenders can be seen in Rebellion 5, both of which take place before the canonical debut of the class after the Battle of Hoth, as established by TIE Fighter and repeated in numerous sources. The appearance of the TIE Defender in Renegade Squadron was explained in The Official Starships & Vehicles Collection 67 which established them as early TIE Advanced x7 prototypes."}, {"tag": "p", "text": "The TIE Defender also appears in Star Wars: Empire at War: Forces of Corruption, in which the player, controlling the Zann Consortium, can acquire the technology. However, no canon source has yet confirmed whether Tyber Zann took this opportunity. The fighters also appear in the 2011 novel Fate of the Jedi: Ascension by Christie Golden, in which they are twice referred to as the \"TIE Destroyer.\" LEGO released a TIE Defender set in 2010. The LEGO TIE Defender has six missile launchers and a cockpit that rotates when the model turns."}, {"tag": "p", "text": "The 2012 reference book The Essential Guide to Warfare includes illustrations of TIE Defenders at the Naval Station Validusia and accompanying the Star Dreadnought Wrath during an orbital bombardment. When asked about the presence of TIE Defenders in these images, illustrator Ansel Hsiao speculated that the units they were assigned to were considered of high importance due to the number of Star Dreadnoughts."}, {"tag": "h3", "text": "Technical specifications"}, {"tag": "p", "text": "Many of the starfighter's specifications changed between TIE Fighter and X-Wing Alliance. The earlier game gave a speed rating of 155 MGLT, a maneuverability rating of 175 DPF and a hull rating of 20 RU. These were revised to 144 MGLT, 110 DPF and 14 RU in X-Wing Alliance. The shield rating was given as 200 SBD in TIE Fighter but was listed as 100 SBD in both TIE Fighter: The Official Strategy Guide and X-Wing Alliance. Since it is the latest source, this article uses the values from X-Wing Alliance."}, {"tag": "p", "text": "There is also some discrepancy among sources as to the length of the TIE Defender. The TIE Defender's Databank entry and The Official Starships & Vehicles Collection 67 describe it as 9.2 meters long; however, Star Wars: TIE Fighter had originally given the length as 10 meters, a length which was repeated in The Official Star Wars Fact File 73 and The Official Star Wars Fact File Part 53. Furthermore, both The New Essential Guide to Vehicles and Vessels and More Starships! list the length as 6.6 meters. The 9.2 meter length also appears in Coruscant and the Core Worlds as the length of the TIE Advanced x7 which served as the prototype for the TIE Defender."}, {"tag": "p", "text": "In both TIE Fighter and X-Wing Alliance, the TIE Defender is depicted as faster than both the RZ-1 A-wing interceptor and the TIE Interceptor. This was reinforced by Star Wars: X-Wing Alliance: Prima's Official Strategy Guide, which described the ship as the \"fastest and most maneuverable craft in the galaxy.\" The figures given in the New Essential Guide to Vehicles and Vessels do show it as faster than both, but only in an atmosphere, while its acceleration value is slightly lower than the TIE Interceptor and significantly below that of the A-wing. The 2007 edition of Starships of the Galaxy describes the TIE Defender as \"much faster than any other TIE variant,\" though it is unclear if this is referring to atmospheric speed or acceleration. Star Wars: Rebellion: Prima's Official Strategy Guide states that \"only the A-wing and TIE interceptor are more agile in battle.\" This contradicts other sources, including the Databank and The Essential Guide to Vehicles and Vessels, which state that the TIE Defender was more agile than the TIE interceptor."}, {"tag": "h3", "text": "Other inconsistencies"}, {"tag": "p", "text": "Both The Essential Guide to Vehicles and Vessels and the TIE Defender's Databank entry place the cost of the ship at 300,000 credits. More Starships!, however, states that each unit cost 200,000 credits. Starships of the Galaxy repeats the 200,000 credit value while simultaneously calling it \"more than five times as expensive to produce as a standard TIE fighter.\" Since the cost of a TIE fighter is listed in the same book as 60,000 credits, the TIE Defender would have to have a 300,000 credit value to be five times the cost. More Starships! established that the TIE Defender could carry consumables for two days. Fantasy Flight Games' 2014 reference book Star Wars: Age of Rebellion Core Rulebook later revised this to one week. This article takes the later figure. Age of Rebellion Core Rulebook also describes the fighter's ion cannons as \"cockpit-mounted,\" contradicting earlier sources, including The Essential Guide to Vehicles and Vessels, The New Essential Guide to Vehicles and Vessels and The Official Star Wars Fact File 73, all of which place them on the upper wings."}, {"tag": "p", "text": "The Official Star Wars Fact File 11 states that \"the new TIE defender would not be at [the Battle of] Endor\". However, this contradicts the Death Star II Limited expansion set for the Star Wars Customizable Card Game, The New Essential Guide to Vehicles and Vessels and Starships of the Galaxy, all of which establish that the pilots of Onyx Squadron used TIE Defenders during the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}