{"url": "TJ-912/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Feminine programming", "Category:Separatist droid officers", "Category:T-series tactical droids"], "nodes": [{"tag": "h1", "text": "TJ-912"}, {"tag": "p", "text": "TJ-912 was a T-series tactical droid that was used by the Confederacy of Independent Systems during the Clone Wars. She served under Count Dooku's apprentice and assassin, Asajj Ventress, and commanded the forces of the Separatists during the Battle of Sullust against Generals Obi-Wan Kenobi and Anakin Skywalker. As the battle went on, she was tasked by the Count with eliminating Ventress, as ordered to Dooku by Darth Sidious. The tactical droid did all she could to see that this was accomplished before it seemed that she had succeeded and was ordered to retreat from the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "TJ-912 served Asajj Ventress, the greatest of Count Dooku's Dark Acolytes, in a Sullust system battle. The Separatists were fighting a Galactic Republic fleet led by Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, who were flying their Jedi starfighters. The tactical droid commanded Separatist forces from a destroyer while Ventress herself led the assault from the command ship, soon personally joining in the attack in her Ginivex-class starfighter. The assassin soon participated in a dogfight with Kenobi and Skywalker before she and Kenobi crashed into the main hangar of the command ship, soon followed in by Skywalker."}, {"tag": "p", "text": "As the Dark Jedi engaged in a lightsaber duel with her Jedi nemeses, Count Dooku made contact with TJ-912 via hologram on the bridge of her frigate. The Confederate Head of State had been ordered by his own master, Darth Sidious, to eliminate his apprentice in order to prove where his loyalty truly lay. The tactical droid informed Dooku that Ventress was dueling the Jedi on their command ship. He then ordered her to fire upon the ship. TJ-912 questioned the order, but ultimately followed it when Dooku confirmed his intention to destroy both the Jedi and Ventress. The Count was also displeased that the Separatists were in fact losing the battle and began ordering their reinforcements to retreat. Once her destroyer was in position, the tactical droid directed her battle droid underlings to open fire on the ship containing Ventress. To ensure the job was done, TJ-912 then contacted a nearby bomber and ordered it to calculate its flight path to terminate in the ship's main hangar."}, {"tag": "p", "text": "TJ-912 anticipated that the bomber crashing and exploding within the command ship's hangar would either finish the two Jedi and Ventress or leave them unable to escape the flagship's destruction. Despite this attempt, the bomber barely missed the three combatants, and they were therefore able to get back to their fighters as two adjacent Republic cruisers continued to blast away at the ship from both sides. It soon exploded from the unyielding cannon-fire, prompting TJ-912 to contact her superior once more. She informed the Confederate leader of the command ship's destruction and that their scanning indicated there were no survivors, unaware that Ventress had in fact escaped at the last moment. Pleased his aim had presumably been accomplished, Count Dooku declared the tactical droid's work done and ordered her to recall the remaining ships of the fleet from the area, an order she acknowledged."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TJ-912 is the first known T-series tactical droid with feminine programming. She was voiced by Cara Pifko."}, {"tag": "p", "text": "The line she quotes in the episode in response to an order (\"By your command\") is a classic Battlestar Galactica line often uttered by Cylons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}