{"url": "TK-119", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Clone stormtroopers"], "nodes": [{"tag": "h1", "text": "TK-119"}, {"tag": "p", "text": "TK-119 was a clone stormtrooper who was aboard the Galactic Empire's Death Star battlestation in 0 BBY. That year, a group of soon-to-be operatives of the Alliance to Restore the Republic infiltrated the Death Star to rescue one of its prisoners, Princess Leia Organa. Following the successful escape, the Princess and one of her rescuers, Luke Skywalker, went through the station's Central Core Shaft, where they found themselves trapped behind a blast door leading to a shaft. As the two were trapped on an overhang, with the controls for the bridge extension across the shaft disabled, TK-119 was among a trio of stormtroopers who attempted to shoot the pair with their E-11 blaster rifles. However, Skywalker returned fire, and managed to kill TK-119 when he shot the stormtrooper and caused him to fall down the shaft."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male TK-119 was a clone who served the Galactic Empire as a stormtrooper during the Galactic Civil War, a conflict between the Empire and the Alliance to Restore the Republic. By 0 BBY, he was aboard the Imperial Death Star battlestation."}, {"tag": "p", "text": "That year, the Death Star was infiltrated by a group of soon-to-be members of the Alliance, consisting of Han Solo, Chewbacca, and Luke Skywalker, in an attempt to rescue one of the station's prisoners, Princess Leia Organa of the planet Alderaan. Skywalker escorted Organa to Docking Bay 327, the hangar bay that the group arrived in aboard the YT-1300 light freighter Millennium Falcon. On the way to the hangar, the pair went through the Death Star's corridors, where they were spotted by a stormtrooper patrol, and were forced to take cover behind a blast door leading to the Death Star's Central Core Shaft. Attempting to prevent the stormtroopers from opening the door, Skywalker used his stolen stormtrooper E-11 blaster rifle to shoot out the control panel by the door, not realizing that he had destroyed the controls meant to extend a bridge across the chasm. As Skywalker and Organa found themselves stuck on a narrow overhang, TK-119 was part of a trio of stormtroopers who arrived on a higher overhang across from the pair, firing their E-11 blaster rifles at the Alliance operatives. TK-119 was killed when Skywalker returned fire and managed to shoot him in the chestplate, causing TK-119 to fall screaming down the shaft."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "TK-119 wore full stormtrooper armor and wielded an E-11 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK-119 first appeared in the 1977 film Star Wars: Episode IV A New Hope, where he was portrayed by uncredited stunt coordinator Peter Diamond, who fell only a short distance before being caught by a mattress. His fall was accompanied by the Wilhelm scream sound effect, marking its first usage in the Star Wars films. In 2002, TK-119 was first identified by name in a card for the A New Hope set of Wizards of the Coast's Star Wars Trading Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}