{"url": "TIE_ap-1", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Crawlers", "Category:Galactic Empire vehicles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE ap-1"}, {"tag": "p", "text": "The TIE ap-1, informally known as the TIE mauler, was a light Imperial ground assault vehicle, created by Santhe/Sienar Technologies, used during the early years of the Galactic Civil War. Part of the Twin Ion Engine, or TIE, series, the TIE mauler was created to fulfill the Empire's need for a fast ground assault vehicle to use against the growing rebellion against them. The mauler was equipped with three laser cannons and an enhanced self-destruct mechanism, and, due to its need for speed, was lightly armored. Although it was designed for the Galactic Civil War, it saw limited combat, and the mauler was phased out in favor of the TIE crawler, which was based on the design of the mauler."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The TIE mauler was built around a standard TIE/LN starfighter cockpit, fixed between a pair of tank treads, instead of wings. As with its airborne brethren, the mauler emphasized speed and maneuverability at the expense of the protection of armor and deflector shields. Because of their flimsiness, these vehicles were often deployed in groups of five. However, they often proved to be of optimum effectiveness when attacking in even larger numbers (such as 10-15) simply due to their speed, allowing multiple units to quickly overwhelm a defensive force by all attacking one target at a time, which, because of their weak, but rapid-fire cannons, proved highly effective for quickly demolishing lighter enemy resistance one target at a time. Given the right situation, TIE Maulers could end a battle that would normally be expected to be drawn-out by striking before the enemy had a chance to prepare their heavier defenses (assuming that they arrived before they were set up)."}, {"tag": "p", "text": "Although TIE maulers were armed with three rapid fire blaster cannons, the drivers of these vehicles soon discovered that the vehicles' treads were also effective weapons (perhaps more so than the blaster cannons) against enemy troops. Gruesome displays of the ap-1 running over Rebel soldiers earned it its nickname. Maulers were also equipped with core overload technology that could be activated in an emergency. This device would overload the engines, causing them to explode after a few moments. Rebel troops tried to use these few seconds to either destroy the mauler or flee."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The vehicle was designed by Santhe/Sienar Technologies to fulfill the Empire's need for a fast, low-cost ground vehicle. As a result, maulers were used throughout the Galactic Civil War. However, they were the inspiration for the more advanced century tank, or TIE crawler."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}