{"url": "TK-421/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clone stormtroopers", "Category:Death Star residents", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "TK-421"}, {"tag": "p", "text": "TK-421 was the designation of a stormtrooper stationed aboard the first Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point in 1 BBY, TK-421 went off-duty and went to the Star Tours interstellar travel agency for unknown reasons. His bag was eventually discovered by G2-9T during baggage checks, and upon learning of who it belonged to, decided that TK-421 might have good reason not to be at his regular post before clearing it."}, {"tag": "p", "text": "After the Millennium Falcon was captured shortly before the Battle of Yavin, he was ordered to stand guard in front of the freighter's boarding ramp, while a scanning crew attempted to determine if anyone was hiding aboard the Falcon."}, {"tag": "p", "text": "Just seconds after the scanning crew had made their way up the boarding ramp, a loud thump was heard and someone (Later revealed to be Han Solo) called down to them, asking TK-421 and his fellow guard, TK-422, for help with a piece of equipment. The two stormtroopers made their way up the ramp to assist the technicians; both troopers were ambushed by Han Solo and stripped of their armor to conceal Han and Luke's identities aboard the Death Star."}, {"tag": "p", "text": "Lt. Pol Treidum (observing from Docking Control Room 327 that TK-421 was absent) attempted to contact the stormtrooper, asking (via comlink) why he wasn't stationed at his post. Luke Skywalker (having disguised himself as TK-421 by that time) concealed TK-421's current status by motioning to his ear to imply that the comlink in his helmet must be broken."}, {"tag": "p", "text": "After the battle of Detention Block AA-23, a security team was dispatched to the hangar housing the Millennium Falcon where TK-421 and his comrades were found unconscious aboard the Freighter. He, along with TK-422 and the two crewmen were taken to the infirmary and perished in the Death Star's destruction during the battle of Yavin 4."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK-421 first appeared in the 1977 original trilogy film, Star Wars Episode IV A New Hope, and was portrayed by an uncredited extra, Stephen Bayley. In the novelization of the movie and in Star Wars: Galactic Battlegrounds, the trooper was referred to as THX-1138, a homage to George Lucas's first feature film. In the radio drama, he was referred to as TX-421. In Star Wars 3 the character is referred to as TX-421 and as part of Scanning crew BT-445. In the German dubbing of Episode IV, the trooper's designation is \"TK-241\" instead of \"TK-421.\" The Italian dub changed it to \"TK-21\" and had Treidum refer to him in plural form; this can either be a form of extreme respect or a form used when one does not know how many people they are talking to over radio or telephone, but could also be a translation error. In the video game Star Wars: Jedi Knight II: Jedi Outcast, the character TK-664 is a direct reference to this character. In the game, TK-421 is also the name of the player skin of a stormtrooper that is selectable in multiplayer. In the Star Wars: Battlefront series, TK-421 is one of the random names given to Imperial bots."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}