{"url": "TIE_starfighter", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "TIE starfighter"}, {"tag": "p", "text": "The TIE starfighter was the first upgraded model of the T.I.E. starfighter produced by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A modest upgrade of the T.I.E. starfighter used by the Galactic Republic, the TIE starfighter had a centralized power generator running both the engine and the weapons, unlike the later TIE Line starfighter, which had separate generators. It was tougher than the final TIE/LN version, but also cost more. It featured weak shields, a small hyperdrive and two one-shot concussion missile launchers, which allowed it to serve as a light bomber, long-assault craft or snubfighter. Unfortunately some of these systems were incompatible with the Twin Ion Engine and required a secondary power supply to operate. The TIE model was slower than the TIE/LN, and its laser cannons were not as powerful."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The newly formed Galactic Empire required a cheap and efficient starfighter that could be mass-produced. Sienar Fleet Systems especially impressed Emperor Palpatine with TIE starfighters, which cost only a fraction compared to other proposals. The Empire decided to reduce the cost even further by removing secondary energy generators and respective systems, leading to the enormously mass-produced TIE/LN starfighter. The original model still saw some use during the first years of the New Order, but became less common later. By 0 ABY, the Line model had become the standard TIE fighter in the Imperial Navy, and most of the original TIE starfighters were replaced or scrapped."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Force Unleashed Campaign Guide features an entry for a previously unmentioned TIE Series starfighter called TIE Prototype, which was said to be the predecessor of the standard TIE/LN starfighter. A closer inspection of the entry reveals that this starfighter's description is almost identical to that of the previously established TIE starfighter, and therefore it is simply another designation thereof."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}