{"url": "TK-421", "categories": ["Category:Canon articles", "Category:Death Star residents", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "TK-421"}, {"tag": "p", "text": "TK-421 was the designation of a male stormtrooper who was stationed on the Death Star. Initially working in the Sector AA-345 Maintenance Unit alongside the MSE-6 series repair droid MSE-6-G735Y, he soon caught the attention of Grand Moff Wilhuff Tarkin with an accidental holorecording displayed by the droid. They began a clandestine relationship that progressed quickly, and TK-421 was promoted to station security with hopes of moving to Coruscant. TK-421 was guarding the Millennium Falcon when it landed to rescue Princess Leia Organa. He was killed by Han Solo and his stormtrooper armor became a disguise used by Luke Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A man and his mouse droid"}, {"tag": "p", "text": "In 0 BBY, the Imperial stormtrooper with the designation TK-421 was stationed on the Death Star, where he worked in the Maintenance Unit of Sector AA-345. The MSE-6 series repair droid MSE-6-G735Y, which he called \"G7,\" assisted him by delivering supplies and equipment to different sectors of the station. TK-421 considered G7 the fastest mouse droid in the Imperial fleet and promised G7 that if his transfer was approved, they would go together and enter the racing circuit on Coruscant. Although he appreciated the aesthetic aspects of the Death Star, he felt trapped there by the rigorous routines, the lack of downtime, and his armor, especially his helmet."}, {"tag": "p", "text": "On one occassion, he complained to the droid about the helmet's effects on his complexion, such as giving him a pimple on his chin that he compared in size to a Kowakian monkey-lizard. When he told G7 to look at his skin, he inadvertently issued an order to activate its holorecorder. The droid thus recorded the stormtrooper with his helmet off and face on display, which was against regulations."}, {"tag": "h3", "text": "Catching the Grand Moff's eye"}, {"tag": "p", "text": "Not long afterward, TK-421 sent G7 to deliver a HypnoHypodermal Injector Needle C-7R to an IT-O interrogator droid in Detention Block AA-23; the droid was used by Darth Vader in his interrogation of the imprisoned Princess Leia Organa. In G7's haste to leave, it collided with Grand Moff Wilhuff Tarkin, whom the droid recognized as having security level Alpha One but could not identify by name. The collision injured Tarkin and damaged G7's holorecorder matrix, causing it to inadvertently display the holorecording of TK-421. After admiring the stormtrooper's appearance, Tarkin told G7 to play back the entire message, which the droid was obliged to obey as an Alpha-One-level clearance superseded all of its known commands and subroutines. However, G7's damage rendered it unable to comply and in need of maintenance. Tarkin told his colleague Lieutenant Blagg that he would personally deal with the trooper responsible for the droid, then ordered G7 to report to his quarters in Sector GM1-A and enter into sleep mode."}, {"tag": "p", "text": "After Tarkin repaired G7, he sent the MSE-6 unit back to TK-421 with a holomessage that indicated his interest in the stormtrooper, and an invitation to visit his quarters to repair his aqualeisure unit. TK-421 felt flattered that he had caught someone's eye, and told G7 that if he played the situation right, he could get them a transfer to Coruscant or anything else they wanted. Recognizing he was dealing with an officer who had Academy experience, TK-421 affected naivete and a backwater accent as he recorded his response, saying he would report to Tarkin's quarters after he showered with the antibacterial nanofoam Tarkin had sent him. He sent G7 ahead to deliver his message."}, {"tag": "p", "text": "Upon arriving at Tarkin's quarters, TK-421 thanked him for repairing G7. Tarkin invited him inside, but required him to first remove his armor to avoid tracking grease or other residue on the new carpet, which TK-421 recognized as Coruscant fiberweave and complimented. Tarkin pointed out a chair made with veermok hide; he had extensive experience hunting veermoks on his homeworld, Eriadu. He told TK-421 to go about his business in the aqualeisure unit while he prepared for a meeting with the Joint Chiefs, and reminded G7 to execute Imperial Protocol Alpha One to delete all records regarding the encounter."}, {"tag": "p", "text": "Several cycles later, TK-421 awakened G7 and told the droid not to worry about its memory gaps. He confided in the droid that they needed to maintain secrecy because everything occuring on the battle station relied upon Tarkin, whom he described as having an icy exterior with other people that was dropped when they were alone together. TK-421 said he made Tarkin laugh when they were together, and that G7 was better off not witnessing certain events or keeping them in its memory. With his security level raised to Beta and his transfer to a comfortable position in station security on the 300 level, TK-421 had hopes that he and G7 would continue their advancement to an assignment in Tarkin's personal detail; after that, they would move to Coruscant, where G7 would enter the droid racing circuit and TK-421 would live in Tarkin's penthouse overlooking the Imperial Palace. TK-421 was stopped from speaking further when he received a helmet transmission ordering him to guard a captured light freighter. He sent G7 to Tarkin's quarters while he reported for his first assignment on guard duty in Docking Bay 327."}, {"tag": "h3", "text": "Death and brief legacy"}, {"tag": "p", "text": "TK-421 was ordered to guard the Millennium Falcon alongside TK-710 while a scanning crew determined if anyone was aboard. Responding to a call for help from inside the ship, TK-421 and TK-710 entered and were ambushed by Han Solo. Accounts vary as to whether the pair were taken entirely unawares when Solo shot them or attempted to draw their blasters and were outdrawn by Solo. Luke Skywalker joined Solo in removing the troopers' armor, and Skywalker wore TK-421's as a disguise to infiltrate the station with Chewbacca and Obi-Wan Kenobi. Lieutenant Treidum, who was stationed in the docking bay control room, noticed that TK-421 was missing. When Treidum attempted to contact the stormtrooper and asked why he was not at his post, Skywalker emerged from the ship in TK-421's armor and pretended the helmet had a malfunction that interfered with the transmission."}, {"tag": "p", "text": "At some point before leaving the Death Star, the rebels placed TK-421's dead body in a crawl space, where it was later found. After learning of TK-421's death, the stormtrooper TD-110 privately observed that they had not known each other well, but TK-421 had been strong and did not deserve that fate. G7 was awakened from sleep mode by Tarkin after the Battle of Yavin had commenced, and was informed by Tarkin that TK-421 had been murdered by rebels. Tarkin admitted that he had envisioned plans for them together, and vowed that he would soon avenge TK-421 by annihilating the last of the Rebellion with the battle station's awesome destructive power. He invited G7 to witness the imminent destruction of Yavin 4 on the command bridge, but the droid did not arrive due to being caught in an explosion. Seconds afterward, the entire Death Star was blown up by Luke Skywalker, killing Tarkin and destroying MSE-6-G735Y."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "TK-421 was a human male who was 1.847 meters in height. According to stormtrooper TK-450, it was obvious that TK-421 had personally programmed MSE-6-G735Y because the droid stopped recording TK-450 while he was still talking, a behavior that TK-450 compared to TK-421 ignoring what he did not want to hear. TK-450 also thought the other trooper spent more time talking to droids than other beings. TK-421 was indeed fond of G7, and frequently confided in it about his feelings and his wishes for a future where he would paint racing stripes on the droid and enter it into a racing circuit. Though he was not eloquent, he talked at length to the droid. In his discussions with G7, he spoke of them as a pair advancing together. TK-450 mistakenly believed that TK-421 would be unable to stand up to attention from someone like Major General Cassio Tagge, Darth Vader, or Grand Moff Wilhuff Tarkin."}, {"tag": "p", "text": "TK-421 appreciated the aesthetics and engineering of the Death Star, particularly its distinctive lighting installed in the walls rather than overhead. He preferred the Death Star to his previous station on Lasan, a planet that was besieged by the Empire, where the overhead lighting made everything look depressingly sallow. One of his plans for life on Coruscant involved installing lighting that was similar to the Death Star's. His recognition of the craftmanship of Tarkin's Coruscant fiberweave carpeting caused him to temporarily drop his feigned accent."}, {"tag": "p", "text": "According to Luke Skywalker, TK-421's jumpsuit smelled like the Death Star had served a spicy lunch that day. TK-421's aesthetic concerns included his personal appearance and the image he projected of himself. He hated that his helmet negatively affected his complexion. After receiving his short-lived promotion to station security, TK-421 told G7 that the benefits included ordering people around and carrying a blaster rifle. He described it as \"very butch,\" a characteristic which he thought should be displayed when he responded to Tarkin's initial holomessage. Although TK-421 pretended to be less experienced and knowledgable in their encounters, Tarkin considered it a game between them and noticed TK-421's cleverness. They were each envisioning a future together before their deaths."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Based on a single holomessage, TK-421 successfully calculated behaviors that would appeal to Tarkin in order to secure advancements in his station that the Grand Moff had the power to grant. That included adopting a persona and performing an accent that he characterized as a \"backwater, rough-around-the-edges military grunt,\" but his natural voice had a higher pitch."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "TK-421 wore white plastoid stormtrooper armor over a black body glove and carried an E-11 blaster rifle while on duty in Docking Bay 327."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK-421 first appeared in the 1977 original trilogy film, Star Wars Episode IV A New Hope. He was portrayed by Stephen Bayley, who was not credited in the role. In the 2017 anthology From a Certain Point of View, which highlighted minor and background characters from A New Hope, TK-421 was one of the major characters in the short story \"Of MSE-6 and Men,\" written by Glen Weldon. He was also mentioned post-mortem in \"Bump\" by Ben Acker and Ben Blacker."}, {"tag": "p", "text": "In A New Hope, TK-421 goes off-camera when he enters the Millennium Falcon, with his fate implied by sound effects. The 2015 junior novelization A New Hope: The Princess, the Scoundrel, and the Farm Boy, written by Alexandra Bracken, depicted Han Solo setting his blaster to stun before shooting TK-421. Young-readers adaptations likewise stated or implied that TK-421 was knocked unconscious. In \"Of MSE-6 and Men\" and \"Bump\" however, TK-421 was killed."}, {"tag": "p", "text": "The stormtrooper's designation was originally THX 1138 in the 1976 novelization of A New Hope as a reference to George Lucas and Walter Murch's 1971 film, THX 1138. The \"TK-421\" designation later inspired the naming conventions used by the 501st Legion fan costuming organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}