{"url": "TK-710", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "TK-710"}, {"tag": "p", "text": "TK-710 was the designation of a human male stormtrooper who served the Galactic Empire during the Galactic Civil War. In the year 0 BBY, he was stationed aboard the first Death Star battle station when the YT-1300 light freighter Millennium Falcon was pulled in by the station's tractor beams. TK-710 and fellow stormtrooper TK-421 were posted to guard the ship's entrance in Docking Bay 327 while a scanning crew checked the interior of the vessel. The Falcon's crew ambushed the scanning crew and then impersonated them in order to lure TK-710 and TK-421 inside, incapacitating the stormtroopers and taking their armor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Tricked aboard the Falcon"}, {"tag": "p", "text": "TK-710 was the designation of an Imperial stormtrooper during the Galactic Civil War. In the year 0 BBY, TK-710 served aboard the Empire's first Death Star battle station with a security level of zeta while it was in the Alderaan system to destroy the rebel-affiliated planet Alderaan as a display of Imperial might. Shortly after the planet's destruction, the YT-1300 light freighter known as the Millennium Falcon was pulled into Docking Bay 327 aboard the Death Star by tractor beams. After the freighter was searched by stormtroopers, TK-710 and TK-421 were assigned to guard its entry ramp."}, {"tag": "p", "text": "A scanning crew was then sent aboard to scan the entire vessel for lifeforms; however, before they could begin, they were ambushed by the Falcon's captain, Han Solo, and his Wookiee co-pilot, Chewbacca. Solo then impersonated one of the crew and called down to TK-710 and TK-421, asking for them to help with some of the equipment. The two troopers made their way up the freighter's boarding ramp and quickly drew their weapons upon seeing Solo and Chewbacca, but the Falcon's crew was faster. Chewbacca clasped one of them around the throat from behind while Solo managed to grab the other's arm and divert the trooper's shots above his head, simultaneously shooting the trooper at point-blank range through a joint in his armor."}, {"tag": "h3", "text": "An impersonated Imperial"}, {"tag": "p", "text": "Solo then took TK-710's stormtrooper armor while his ally Luke Skywalker took TK-421's. Their disguises allowed the pair to sneak through the Death Star in a successful effort to rescue the imprisoned Princess Leia Organa of the Rebel Alliance."}, {"tag": "p", "text": "The repair droid MSE-6-G735Y encountered the disguised pair during their journey through the Death Star and recognized the two troopers' armor, noting to itself that someone other than TK-421 was wearing his armor, but Chewbacca scared the droid away before it could act on the discovery. The Empire later became aware of what had happened to TK-710 and TK-421 after TK-421's corpse was discovered hidden in a crawl space."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "TK-710 was a human male. Han Solo was impressed by how quickly TK-710 reached for his gun on board the Millennium Falcon, although the trooper was still not fast enough to save himself. Upon donning TK-710's armor, Solo discovered that the helmet had an odor of bad breath, and he complained that it smelled as though the trooper had slept in it."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "TK-710 wore stormtrooper armor and carried an E-11 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK-710 first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character was played by an uncredited extra. Stephen Bayley, who played TK-421, has said that he never knew the name of the extra playing TK-710 but described him as an older gentleman whom he suspected had passed away by 2016."}, {"tag": "p", "text": "The stormtrooper's canon designation was revealed as TK-710 by the short story \"Of MSE-6 and Men,\" which was written by Glen Weldon as part of the anthology book From a Certain Point of View, published on October 3, 2017. In the 2015 Star Wars LINE Webtoon, written by Hong Jac Ga, TK-710 is referred to as \"TX-4120\"; however, LucasBooks executive editor Jennifer Heddle has stated that the comic series is ambiguously canon, so this article assumes that the designation used in From a Certain Point of View is correct."}, {"tag": "p", "text": "For Star Wars Legends, the character first appeared in the 1976 novelization of a A New Hope by Alan Dean Foster. The stormtrooper eventually received the designation TK-422 in Legends as part of the 1998 Special Edition Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}