{"url": "TK-7", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Droids of unspecified degree"], "nodes": [{"tag": "h1", "text": "TK-7"}, {"tag": "p", "text": "TK-7 was a passive-aggressive droid who served as the Chief Editor Droid at the Galactic Digest magazine during the time of the Galactic Empire. The droid edited and left comments on an article written by the journalist Parazeen Parapa on the bounty hunters 4-LOM and Zuckuss after the Digest received a donation from the subjects' representative, Vap Tomulus. The Digest's server was sliced before TK-7 had finished revising the writing, and, to TK-7's shock, the unedited article was published as it stood, with the droid's comments still present."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time of the Galactic Empire, TK-7 held the position of Chief Editor Droid in the Culture Desk department of the Galactic Digest, a magazine publication that supported the Empire. On several occasions, the droid worked with the entrepreneur Vap Tomulus, finding him to be courteous and friendly, sometimes overly so."}, {"tag": "p", "text": "By the year 3 ABY, the Galactic Digest received a press release from Tomulus, including a sizeable donation, regarding the bounty hunters Zuckuss and 4-LOM, who claimed to be setting up a charity foundation with Tomulus's help. The memo, which included an Argazdan diamond that TK-7 placed in the Digest's charitable donations, led to the publication reporting on the endeavor. Parazeen Parapa, a Frizznoth intern at the publication's office, volunteered to be sent as a journalist to speak with the two bounty hunters. The interview went awry when Mozeen Parapa, the journalist's grandfather and the leader of the Parapa Cartel criminal organization, followed Parapa and killed Tomulus out of revenge over a Frizznoth massacre that he was responsible for."}, {"tag": "p", "text": "After receiving Parapa's article, TK-7 went through the writing to make comments. The droid questioned several of Parapa's choices, such as his seemingly sarcastic language when referring to the hunters' change of employment, drawing connection to his association with the Parapa Cartel, and his reference to the press release and the donation that the Digest received. TK-7 was also concerned about several details that Parapa had elaborated on, as well as the garbled Galactic Basic Standard Parapa and the other Frizznoth members of the cartel used when speaking to one another. However, as TK-7 was editing the article, the Galactic Digest's main server was sliced into, and the story was published with the droid's comments still included. TK-7 began to panic, demanding to call the Digest's office."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid TK-7 wrote with a passive-aggressive tone when commenting on Parapa's article. When Parapa volunteered for the assignment, TK-7 was initially concerned, but ultimately agreed with the intern's opinion that he deserved the chance. The droid wished to censor several elements of Parapa's writing, including his allusion to the bounty hunters' violent past, the mention of the destruction of the planet Alderaan, and Mozeen Parapa's disparaging comments about the Galactic Digest and its support of the Empire. TK-7 was shocked by the turn of events during the interview and panicked when the unfinished version of the article was published."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK-7 was created for the short story \"STET!,\" written by Daniel José Older and published in the collection From a Certain Point of View: The Empire Strikes Back in 2020. Older liked the thought of having a different voice within the story, as if it was in conversation with itself, leading to the idea of an in-universe writer receiving editorial comments. After first attempting to write the story without it, Older eventually returned to the concept. Older changed his user information on Microsoft Word so that he could add editorial notes that were attributed to the droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}