{"url": "TL-1800_freighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:TL-1800 freighters", "Category:TL-series freighter classes", "Category:Freighter classes"], "nodes": [{"tag": "h1", "text": "TL-1800 freighter"}, {"tag": "p", "text": "The TL-1800 freighter, also known as the TL-1800 light freighter, was a light freighter manufactured by Suwantek Systems."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The wide-bodied 30 meter long ship could carry 110 tons of cargo in its internal cargo bay, but could also attach four external cargo pods to its hull. This gave the TL-1800 an exceptional cargo capacity for its size, exceeding that of significantly larger ships such as the Etti Lighter and the YZ-775 medium transport. However, these pods reduced the already sluggish freighter's limited speed and maneuverability, and only one pod could be carried during atmospheric flight."}, {"tag": "p", "text": "The TL-1800 was also notable for its highly efficient Y-v-6 model sublight engines and StarBurn 4 hyperdrive, which could operate for a year or more without a major overhaul."}, {"tag": "p", "text": "Suwantek Systems would normally contract Fabritech or Industrial Automaton in the creation of systems such as the nav computer. With the TL-1800 Transport, Suwantek Systems instead tried to develop their own nav computer system, the Portal Delta, in order to cut costs. The Portal Delta was very glitch prone and required constant maintenance. Later models of this vessel contain the more reliable Fabritech units, though earlier models could still be found with the flawed Portal Delta nav computer system.\nIt would shut down when activated due to an inherent design flaw unless the user could work around it. Furthermore, once shut down, it could take a number of minutes for the restart sequence to boot it back up again.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "TL-1800 freighters were occasionally used by the Imperial Security Bureau. One, the Melnor Spear, was used by Daric LaRone on his escape from the Imperial Star Destroyer Reprisal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}