{"url": "Battle_of_Darkknell", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Battle of Darkknell"}, {"tag": "p", "text": "The Battle of Darkknell was a three-way battle in 1032 BBY during the Second Charge Matrica conflict of the New Sith Wars. It pitted the Hutt crime lord Zodoh against the Daimanate Sith Lord Daiman and the Galactic Republic represented by Jedi Knight Kerra Holt and Grace Command Captain Jenn Devaad. During the battle, Zodoh besieged the Daimanate capital of Darkknell and unleashed his fleet of Stormdrivers—large capital ships capable of creating artificial floods. By intimidating the Sith with this new superweapon and drowning Daiman's worlds, Zodoh planned to secure a stake in the Grumani sector, traditionally Sith domain."}, {"tag": "p", "text": "Zodoh's fleet overcame a weak Daimanate naval resistance and proceeded to flood Darkknell. However, his plans were interrupted by Kerra and Jenn who managed to infiltrate his flagship Voracious and disable the data processing center, in the process destroying the warship and disrupting the coordination of the Stormdrivers. Stripped of their leader, Daiman's forces were able to regain the initiative and routed Zodoh's forces. Zodoh was subsequently taken captive by the Sith Lord and executed, ending any Hutt ambitions of expanding into Sith Space."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "In his bid for power, the Hutt crime lord Zodoh sought to expand his business operations to the Grumani sector, a region in the Outer Rim which had come under the domain of several feuding Sith Lords during the Republic Dark Age. The decline of the Galactic Republic's influence had seen the Republic withdraw much of its forces to a safety cordon surrounding the Core Worlds and Colonies. The protracted centuries-long fighting also resulted in the decline of interstellar commerce and the HoloNet system throughout much of the Galaxy. Zodoh attempted to beat the Sith into submission by deploying his fleet of Stormdrivers, capital ships capable of generating artificial storms. He intended to browbeat the Sith Lords into becoming his clients while becoming the undisputed ruler of his own space empire."}, {"tag": "p", "text": "Zodoh picked Aquilaris Minor, an outlying and poorly-defended world within Lord Daiman's princedom the Daimanate. His forces quickly overwhelmed the small Daimanate garrison and wiped out an entire squadron of the Republic's Grace Command; a paramilitary relief mission which was actually a front for Baron Lemayne's black operations to flood Sith territory with Deluge, an addictive spice. Zodoh subsequently tested his Stormdrivers on Aquilaris and successfully flooded much of the planet. Thousands of deaths were only averted through the efforts of Jedi Knight Kerra Holt and her local allies Joad Kreel and Padgett who managed to evacuated many Aquilarians to an underwater harvesting station. Satisfied with the results of his Stormdrivers, Zodoh planned to drown all of Lord Daiman's planets, beginning with his capital Darkknell."}, {"tag": "p", "text": "Zodoh planned to make Darkknell his capital after drowning all resistance. Having cowered the Daiman's fellow Sith Lords, he made a deal with them to keep Daiman's forces busy at the frontiers. In return for their compliance, Zodoh offered to sell them Aquilarian seafood to mark the beginning of a \"business partnership.\" Despite a successful escape attempt by Grace Command Captain Jenn Devaad which killed several crew, damaged parts of his flagship Voracious, and disrupted his Stormdrivers' operations, Zodoh was undeterred by these losses and ordered his fleet to depart for Darkknell. Jenn managed to reunite with her Jedi friend Kerra on Aquilaris Minor and the pair departed for Darkknell on a stolen Hutt starfighter."}, {"tag": "h3", "text": "Saving Darkknell"}, {"tag": "p", "text": "Zodoh's invasion force quickly overwhelmed Daiman's defense fleet, which had been weakened by a purge orchestrated by Daiman to root out spice addicts from his ranks. Using his flagship Voracious to coordinate the Stormdriver fleet, Zodoh created large artificial floods and storms which quickly flooded Darkknell, threatening the lives of billions of sentients. Despite repeated broadcasts to the people of Darkknell that all was fine, the Sith Lord was impotent in preventing the storm from overwhelming his cities, killing his subjects, and even damaging his palace. At the Sanctum Celestial in the capital city Xakrea, a hapless Uleeta could only comment that her master \"seemed\" to have willed the Southern Reservoir to burst it banks. An exasperated Daiman could only lament ordering a full-scale purge of his armed forces. He also blamed his elder brother Odion for tying up his forces in border feuds and allowing Zodoh to assail his territory. Odion responded by gloating over the impending deaths of billions on Darkknell."}, {"tag": "p", "text": "Daiman was subsequently caught in a floodwave that inundated the Sanctum Celestial and caused extensive damage to its interior. Unwilling to concede defeat, Daiman claimed to have resources everywhere in his universe that would come to his aid. Help came from an unlikely source: his adversaries Kerra and Jenn Devaad, the last survivor of Devil Squadron who wanted to avenge the death of her squadron mates. Their Hutt starfighter emerged from hyperspace in the midst of a lop-sided space battle. Zodoh's Stormdrivers were already in position above Darkknell generating their global flood while Daiman's defense fleet was under heavy fire from Zodoh's starfighters. Based on her time aboard the Voracious, Jenn had correctly deduced that the Hutt lord's flagship contained a command center with a massive data processor for coordinating the Stormdriver fleet."}, {"tag": "p", "text": "They flew the starfighter into the hangar bay of Zodoh's flagship and Kerra was able to disembark and infiltrate the vessel. The Jedi Knight quickly wiped out Zodoh's guards and made her way to the data processing chamber, a massive dome in the heart of the Voracious. Meanwhile, Jenn harassed Zodoh's starfighter defenses. Kerra located her quarry only to be surprised by Zodoh who had donned his armor and jetpack. Having surprised her with electrical lightning, he then dueled with the Jedi Knight using a Mandalorian vibroblade. To place his foe at a deliberate disadvantage, Zodoh also deactivated the artificial gravity field and activated his jetpack."}, {"tag": "p", "text": "Following a one-sided battle, Zodoh had the young Jedi woman locked in a neck grasp. However, before he could deliver a killing blow, he was interrupted by Jenn's starfighter which shot a hole through the command dome and exposed the ship to zero-gravity. The ensuing explosion set of a series of blasts which destroyed the Voracious in a firestorm. Zodoh was blasted into space but survived since his Hutt physique was tough enough to withstand zero gravity. Meanwhile, his two Jedi foes escaped into hyperspace and returned to Aquilaris Minor. With the destruction of the Voracious, the Stormdrivers were unable to coordinate their global storm and were presumably disable or wiped out by Daiman's defense forces who were able to regroup and launch a counter-attack. The remainder of Zodoh's invasion force either retreated into hyperspace or were route by Daiman's defense force."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Battle of Darkknell proved a Pyrrhic victory for Sith Lord Daiman along with his Jedi opponent Kerra Holt who succeeded in overcoming a common enemy. However, large areas of Darkknell's surface were flooded and damaged during the global flood and many of its inhabitants were drowned or displaced. In space, an unconscious Zodoh was recovered by Daiman's cruisers who stripped him of his armor and brought him as a captive to Daiman's palace at Xakrea. In a dungeon, Zodoh was held restrained within a purpose-built metal cradle. When Zodoh awoke, he expressed relief of his narrow brush with death but this brief respite soon dissipitated with the discovery of his incarceration."}, {"tag": "p", "text": "With the tables turned, Zodoh encountered his Sith opponents including his nemesis Daiman. Also present via hologram were fellow Sith Lords Odion, Malakite and Arkadia Calimondra who gloated over the change in fortunes. Zodoh tried to plead with Daiman for his life by proposing a deal. Daiman however was unwilling to cooperate since he wanted to get revenge for the brief spell of ignominy that he endured when rendered impotent during the invasion. Daiman added that the flow of Deluge spice had stopped since his capture and mocked the Hutt crime lord by highlighting the flawed nature of the Stormdriver system due to their dependency on a large data processor. However, Daiman had developed a miniature Stormdriver which was capable of completely dehydrating individual lifeforms including Hutts. Dismissing Zodoh as an imperfect creation, Daiman proceeded to dehydrate Zodoh, effectively executing the Hutt crime lord and ending his imperial ambitions."}, {"tag": "p", "text": "Kerra's role in the Battle of Darkknell earned her the grudging respect of her enemy Daiman. The two subsequently established contact and made a secret deal to eliminate their mutual enemy Odion,whom both shared a mutual dislike for different reasons. Kerra wanted to avenge the ravaging of her homeworld and to find the whereabouts of her parents. Meanwhile, Daiman sought to punish Odion for indirectly aiding Zodoh during the Aquilaris campaign. With Daiman's acquiescence, she was able to infiltrate Tergamenion disguised as a factory worker. Daiman obtained intelligence of the presence of an Odionate agent named Wayman, a Claimer who had infiltrated Daiman's security forces. With Daiman as her control agent, Kerra posed as a Force-sensitive factory worker named \"Mercy\" who would make contact with Wayman and then infiltrate Odion's Novitiate, his elite corps of Dark side-wielders."}, {"tag": "p", "text": "The plan worked and Kerra managed to infiltrate the Odionate and enter Odion's inner circle. Despite their brief cooperation, Kerra still expressed her dislike of Daiman's excesses and stressed that this partnership was only a temporary \"alliance of convenience.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}