{"url": "TK8252", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "TK8252"}, {"tag": "p", "text": "TK8252 was the call sign of a male field stormtrooper in service with the Galactic Empire during the Galactic Civil War. In 10 ABY, TK8252 was stationed aboard one of the two artificial asteroids that attacked a New Republic base on the planet Altyr V. When Jedi Knight Kyle Katarn infiltrated TK8252's asteroid in an attempt to sabotage it, TK8252 and another trooper tried to prevent him from doing so by attacking him with rail detonators. In the end, however, Katarn successfully destroyed both asteroids."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "TK8252 was the call sign of a male field stormtrooper, the highest rank of stormtrooper, serving the Galactic Empire during the Galactic Civil War. By 10 ABY, TK8252 was serving aboard one of the two artificial asteroids created by the Empire to be used as mobile military bases. During Operation Shadow Hand, the two asteroids attacked a New Republic outpost on the planet Altyr V. However, Jedi Knight Kyle Katarn was on Altyr V during the attack, and he tried to sabotage the asteroids. Using a stolen Imperial shuttle, Katarn infiltrated the asteroid where TK8252 was stationed. As Katarn made his way through the asteroid, TK8252 and another field stormtrooper spotted him and pursued him through one of the asteroid's corridors. Using rail detonators, they fired rail charges at Katarn, one of which exploded near the Jedi, causing him to fall into a chasm. Believing that it was impossible for Katarn to survive such a fall, TK8252 reported to the base that the intruder had been eliminated. Katarn did survive, however, and he used the asteroid's weapons to destroy the other asteroid and then set TK8252's asteroid on self-destruct, escaping in the last moment before its explosion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "TK8252 held the rank of field stormtrooper, the highest possible in the stormtrooper hierarchy. During the events at Altyr V, TK8252 underestimated Katarn, believing that the Jedi would not survive the fall down the chasm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TK8252 appeared in a single cutscene in the 1998 video game Star Wars: Jedi Knight: Mysteries of the Sith, where he was voiced by Kevin Schmitt, the game's lead level designer. The game does not specify which one of the two stormtroopers pursuing Katarn is TK8252. In 2006, one of the game's developers, Ryan Kaufman, revealed in his blog that the stormtrooper was named after Schmitt's telephone extension number at the time. However, in his blog, Kaufman calls the character TK-825, missing the two at the end and adding a hyphen, while in the game's subtitles, there is no hyphen in the call sign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}