{"url": "TN-3465", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Females", "Category:First Order pilots", "Category:Humans"], "nodes": [{"tag": "h1", "text": "TN-3465"}, {"tag": "p", "text": "TN-3465 was a human female TIE fighter pilot who served in the naval forces of the First Order. Following the Battle of Starkiller Base, she and her BB unit BB-K8 accompanied Captain Phasma on a mission to hunt down Lieutenant Sol Rivas for his alleged role in Starkiller Base's destruction. Their mission brought them to the remote, rocky and oceanic world of Luprora."}, {"tag": "p", "text": "There, TN-3465 and BB-K8 helped Captain Phasma to enlist the help of the humanoid Lupr'or colonists in attacking the R'ora's stronghold, where Rivas had been taken captive. This attack served as a diversion for Phasma to kill Rivas in order to conceal her role in lowering Starkiller Base's shield. TN-3465 learnt about Phasma's complicity in the superweapon's destruction. However, Phasma killed TN-3465 and destroyed BB-K8 in order to eliminate all \"loose ends.\""}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Escaping Starkiller Base"}, {"tag": "p", "text": "TN-3465 was a First Order TIE fighter pilot who lived during the outbreak of the First Order/Resistance War. Having grown up in the First Order, TN-3465 lacked a name and was only known by her call designation. During the Battle of Starkiller Base, she was stationed inside an auxiliary hangar on Starkiller Base but had not joined the fight because a BB unit named BB-K8 was performing a data update on her TIE/sf space superiority fighter. While attempting to hunt down Lieutenant Sol Rivas for his alleged role in lowering Starkiller Base's shields, Captain Phasma came across TN-3465 in the hangar and ordered her to help track down Rivas."}, {"tag": "p", "text": "TN-3465, Captain Phasma, and BB-K8 departed Starkiller Base moments before the planet was destroyed by the stored stellar energy it had drained from a nearby star. Under Phasma's orders, TN-3465 pursued Rivas' TIE/fo space superiority fighter through space. However, Phasma was unable to shoot Rivas down since BB-K8 had not yet finished repairing the ship's laser cannons. Running out of fuel, Rivas landed his fighter on the planet Luprora. Under Phasma's orders, TN-3465 tailed him but took care to avoid alerting him to their presence."}, {"tag": "h3", "text": "Hunting Sol Rivas"}, {"tag": "h4", "text": "A rocky landing"}, {"tag": "p", "text": "After landing their TIE/sf fighter on Luprora, TN-3465 reported that Rivas' fighter was to the east. While traveling towards Rivas' TIE fighter, Phasma ordered TN-3465 to carry BB-K8 with straps since the globular droid was unable to navigate the planet's rocky surface. Arriving at the site, Phasma determined that Rivas had been captured by some kind of unknown creatures. The two then sought shelter at an abandoned dwelling where they changed out of their First Order uniforms into civilian clothes. While TN-3465 removed her helmet, Phasma wore a helmet with a red visor to hide her identity. To maintain her cover, TN-3465 adopted the nickname \"Pilot\" while Phasma called herself \"Captain.\""}, {"tag": "p", "text": "Sighting a nearby settlement, TN-3465, Phasma, and BB-K8 waded through a lake. However, they were attacked by a giant tentacled Tsw'ell monster, which dragged Phasma below the surface. TN-3465 was also hit by a tentacle and sank underwater while unconscious. Captain Phasma used a knife to hack through the creature's tentacles, killing it. TN-3465 and her team managed to reach the other side where they were met by a group of humanoid Lupr'or, who had colonized Luprora centuries before."}, {"tag": "p", "text": "TN-3465 found that her superior Captain Phasma was able to understand the natives, who spoke a variation of Lupre'en. The First Order visitors were hosted by Jair'i, the leader of the Lupr'or peoples. Jair'i informed his guests that the Lupr'or were the descendants of offworld migrants who had abandoned technology in favor of a lifestyle based on farming and fishing. However, rising sea levels and a deteriorating climate had eliminated the small land they once farmed. The Lupr'or also came under attack from the monstrous Tsw'ells and an indigenous alien race known as the R'ora. TN-3465 and Phasma learnt that Rivas had been taken captive by the R'ora."}, {"tag": "h4", "text": "Mission impossible"}, {"tag": "p", "text": "Jair'i sent the Lupr'or guide Dar'en to show TN-3465 and Captain Phasma the R'ora stronghold in an attempt to convince the offworlders of the futility of the task of rescuing Rivas. They found that the stronghold was an island surrounded by a lake, populated with Tsw'ells. While Phasma studied the situation, TN-3465 remarked that she wished that their fighter's weapons were still functional so that they could blast the stronghold from their air. Phasma responded that the two of them would have to find another way. The group would spend four days on the planet."}, {"tag": "p", "text": "Returning to the village, Phasma questioned a young Lupr'or girl about where she had gotten her necklace. The girl led Phasma, TN-3465, and Dar'en to the home of her great-grandmother Ali'ane, who revealed that she had gotten the necklace from an old Lupr'or starship, which she labeled the \"soul killer.\" Ali'ane's great-granddaughter agreed to lead the offworlders to the site of the ship in return for not telling the elderly woman."}, {"tag": "p", "text": "For several hours, TN-3465, Phasma, Dar'en, and Ali'ane's great-granddaughter climbed up a mountain. During the journey, TN-3465 grumbled about climbing rocks and vowed never to leave her ship again. Phasma told TN-3465 to speed up and not to grumble so much, prompting an apology. The Lupr'or girl led them to a wrecked Lupr'or ship, which rested on a high summit. TN-3465 and Phasma agreed that the contents of the ship would be sufficient for their plan."}, {"tag": "h3", "text": "Recruiting an army"}, {"tag": "p", "text": "Returning to the village, TN-3465 got BB-K8 to translate her message to Dar'en to bring all the villagers. However, BB-K8 mistranslated the Lupre'en word for everyone for \"men.\" TN-3465 lost her temper and chastised the droid for embarrassing her in the presence of Dar'en. TN-3465 demanded that the droid rectify his mistake at the expense of losing face. However, she was interrupted by Captain Phasma, who had donned her armor and blaster rifle. TN-3465 complied with Phasma's orders to don her uniform."}, {"tag": "p", "text": "TN-3465 was present when Phasma delivered a rousing speech urging the Lupr'or to fight against their impending extinction by utilizing all the resources at their disposal. She urged them to use the technology and weapons their ancestors had abandoned to wage war on the R'ora. Phasma promised to lead them to victory. In order to reach Sol Rivas inside the R'ora stronghold, Phasma devised a plan which involved using generators recovered from the starship to electrocute the tsw'ells inhabiting the lake surrounding the stronghold. TN-3465 was privy to Phasma's plan and praised her for her oratory. However, Phasma admitted that she was merely using the Lupr'or as cannon fodder to reach the stronghold."}, {"tag": "p", "text": "Three days later at dawn, the Lupr'or used the generators to electrocute the lake, frying the tsw'ells guarding the stronghold. Under Phasma's leadership, TN-3465, Dar'en and the Lupr'or army rowed across the lake and climbed the cliff which served as a wall for the R'ora stronghold. While climbing, TN-3465 remarked that she was going to fall. At that point, Phasma experienced a flashback of climbing on Parnassos with her fellow clan members Siv, Torben, and Frey. When Phasma called out Siv's name, TN-3465 asked who Siv was. Phasma responded that Siv was someone she used to know but was no concern. She told the pilot to climb faster."}, {"tag": "h4", "text": "Uncovering Phasma's secret"}, {"tag": "p", "text": "As TN-3465 reached the top, she remarked that if she never climbed anything again, it would be too soon. TN-3465 and Captain Phasma then gazed down upon the battlements at an army of fearsome R'ora defenders. TN-3465 and Phasma led the attack on the R'ora with the former firing her blaster. TN-3465 reported they were being overwhelmed and had to pull back. Phasma disagreed and told them to wait until the Lupr'or army descended down the wall and attacked the R'ora. While the battle raged, TN-3465 and Phasma proceeded to carry out their true mission."}, {"tag": "p", "text": "Captain Phasma assigned TN-3465 to keep watch for their exit while she went inside the R'ora tower to deal with Rivas. Against Phasma's orders, TN-3465 eavesdropped on the tower and heard the conversation between Phasma and Rivas. When Phasma demanded that Rivas confess to \"his crime\", Rivas pointed out that she had been responsible for lowering Starkiller Base's shield and taunted her. Phasma executed Rivas with her blaster rifle. Panicking, TN-3465 contemplated how she would be able to get off planet alive and decided to feign concern for the Lupr'or."}, {"tag": "p", "text": "When Captain Phasma asked why she had not waited by the exit, TN-3465 claimed that she had fought some R'ora to keep their escape route clear. After Phasma confirmed Rivas' death, TN-3465 asked Phasma if they were abandoning the Lupr'or. Phasma claimed that the Lupr'or were doomed because they were unsuitable to the planet's evolution. Since the native R'ora were more adaptable to the planet's rising seas, Phasma surmised that the Lupr'or were facing extinction and that their arrival had merely advanced that timetable."}, {"tag": "h4", "text": "An untimely death"}, {"tag": "p", "text": "While TN-3465 prepped up their fighter, Captain Phasma watched the rising seas engulfing the R'ora stronghold, wiping out the Lupr'or. She then destroyed BB-K8 with her blaster. Phasma then ordered a shocked TN-3465 to raise her hands and turn around. Feigning ignorance of Phasma's secret, TN-3465 asked why but Phasma countered that she knew already. Phasma told TN-3465 that she was a survivor who was determined not to leave any loose ends. TN-3465 protested she was not a loose end and told Phasma she had no way of threatening her. Phasma countered that it did not matter what she knew before shooting TN-3465 through the chest, killing her."}, {"tag": "p", "text": "As TN-3465 breathed her last breath, Phasma gently laid her down on the rock and closed her eyes. She remarked that one loose end is one too many. In Phasma's final report to the First Order, Phasma claimed that TN-3465 and BB-K8 had perished during the mission to hunt down and deliver justice to the \"traitor\" Sol Rivas. She also made sure that she identified the pilot by her proper designation, TN-3465."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "TN-3465 was a human woman with short black hair and blue eyes. As a First Order TIE fighter pilot, she knew how to fly a TIE fighter and also knew how to operate a blaster. She preferred flying to climbing on a terrestrial world. While TN-3465 depended on technology, Phasma was adaptable and resourceful. TN-3465 once lost her temper at the astromech droid BB-K8 after the latter mistranslated one of her messages to the Lupr'or, embarrassing her in the presence of the Lupr'or guide Dar'en. Despite this difficult relationship, She expressed sorrow and shock for BB-K8 when he was destroyed by Captain Phasma."}, {"tag": "p", "text": "TN-3465 was impressed by Captain Phasma's oratory and leadership but subsequently learned that Phasma was only manipulating the Lupr'or to achieve her goal of reaching Sol Rivas. She was horrified to learn that Phasma had killed Rivas in order to conceal her own role in the destruction of Starkiller Base. She tried to avoid arousing Phasma' suspicions by feigning concern for the Lupr'or. However, she had underestimated Phasma's determination to survive at all costs, including killing others to hide her secrets."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a First Order TIE pilot, TN-3465 wore a black uniform and helmet. During an undercover mission on Luprora, she wore a blue tunic, white scarf, brown trousers, and a belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TN-3465 first appeared in Star Wars: Captain Phasma, a 2017 four-issue comic published by Marvel Comics as part of the Journey to Star Wars: The Last Jedi promotional material. She was created by Kelly Thompson, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}