{"url": "TL-50_Heavy_Repeater", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Concussion rifles", "Category:Heavy repeating blasters", "Category:Repeating blaster rifles"], "nodes": [{"tag": "h1", "text": "TL-50 Heavy Repeater"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The TL-50 Heavy Repeater, also known as the TL-50 Repeater, was a model of heavy repeating blaster rifle that was manufactured for the special forces of the Galactic Empire. In addition to sending storms of blaster bolts from its multiple barrels, the rifle could gather its energy into a powerful concussion blast. It could also be modified with an extended barrel for reduced spread, and with a power cell for increased cooling power. During the Galactic Civil War against the Rebel Alliance, Commander Iden Versio of the Empire's elite Inferno Squad carried a TL-50 Heavy Repeater."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The TL-50 Heavy Repeater, or simply the TL-50 Repeater, was a model of heavy repeating blaster rifle that was capable of discharging storms of red-colored blaster bolts. Thanks to the rifle's reinforced casing with built-in power cell, it could additionally gather energy to release a lethal concussion blast as secondary fire."}, {"tag": "p", "text": "The standard TL-50 Heavy Repeater was black in color and consisted of triple barrels, arrayed in a triangular pattern. The weapon's frame contained cooling vents housed around the triple barrels, with a sight positioned at the top. Two horizontal tubes underneath the weapon connected the front of the rifle to the dark-green stock. The blaster rifle additionally possessed a trigger guard."}, {"tag": "p", "text": "The repeating blaster also came with a variant equipped with dual barrels but without the concussion-blast ability. Unlike the standard TL-50, the modified version lacked the horizontal tubes on the underside of the weapon. The TL-50 could additionally be modified with an extended main barrel featuring a larger sight that allowed for greater precision during sustained fire, along with a power cell attached to one side of the weapon, which produced two red lights, for superior cooling power."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TL-50 Heavy Repeater was manufactured for Imperial Special Forces during the reign of the Galactic Empire. Sometime between 19 BBY and 10 BBY, Masse Goskey, the proprietor of Masse Goskey's Arms Emporium and Explosives Mart in Mos Eisley spaceport on the planet Tatooine, and his associate Ephant Mon purchased a TL-50 for 3,200 credits. Mon recorded the transaction in a book that would eventually be known as the Smuggler's Guide."}, {"tag": "p", "text": "A TL-50 Heavy Repeater was used by Commander Iden Versio, who served as the leader of the Empire's special operations team Inferno Squad during the Galactic Civil War against the Rebel Alliance, until her defection during Operation: Cinder, following the Battle of Endor in 4 ABY. Her Heavy Repeater was the standard-issue TL-50 with triple barrels, modified with a power cell for greater cooling power. A stormtrooper squad leader also used a TL-50 Heavy Repeater on one occasion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Star Wars Battlefront"}, {"tag": "p", "text": "The TL-50 Heavy Repeater first appeared in the Death Star expansion pack for the video game Star Wars Battlefront, released in 2016. The rifle is unlockable via an in-game challenge called \"Imperial Instrument,\" which required getting twenty kills playing as an Empire soldier, getting seventy-five heavy-blaster kills, and winning a round of the \"Battle Station\" game mode. However, like all other blasters in the game, the TL-50 can also be wielded by rebel troopers and New Republic soldiers, as well as Imperial stormtroopers. While the 2018 reference book Star Wars: Smuggler's Guide, written by Daniel Wallace, does not capitalize the weapon's name and renders it as TL-50 heavy repeater, the 2020 Iden Versio and ID10 Commander Expansion for the Star Wars: Legion miniatures game identifies the blaster simply as TL-50 Repeater."}, {"tag": "p", "text": "The TL-50 was designed by 3D artist Erik Rading based on the Imperial Heavy Repeater, which figured prominently in the Star Wars: Jedi Knight video-game series from Star Wars Legends. The Heavy Repeater was introduced in Star Wars: Jedi Knight II: Jedi Outcast, released in 2002."}, {"tag": "h3", "text": "Star Wars Battlefront II"}, {"tag": "p", "text": "The TL-50 also appeared in the game's 2017 sequel, Star Wars Battlefront II, as a blaster option exclusively for the heavy trooper class, such as Heavy Battle Droids, heavy stormtroopers, and megablaster heavy assault troopers. The weapon is available for heavy troopers from all factions, including the Galactic Republic, the Separatist Alliance, the Galactic Empire, the Rebel Alliance, the New Republic, the First Order, and the Resistance. The blaster can be unlocked by defeating 500 enemies as the heavy class."}, {"tag": "p", "text": "The blaster is also the sole primary weapon of the \"hero\" character Iden Versio in multiplayer. However, in the single-player campaign, in which she is the main character, Versio's weapon is chosen by the player. The campaign's cutscenes additionally depict her wielding an E-11 blaster rifle as an Imperial."}, {"tag": "p", "text": "In Star Wars Battlefront II, the TL-50's range is significantly reduced in comparison to the previous Star Wars Battlefront. Although the blaster's secondary fire is a default and permanent feature in Star Wars Battlefront and the campaign of Star Wars Battlefront II, it appears as an unlockable modification for the sequel game's multiplayer modes. Along with the extended barrel and the power cell to increase cooling power, the player can only equip two of these three modifications at the same time in multiplayer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}