{"url": "Battle_of_Dantooine_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Battles of Dantooine", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Dantooine  (Yuuzhan Vong War)"}, {"tag": "p", "text": "The Battle of Dantooine was a battle on Dantooine between the New Republic and the Yuuzhan Vong."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Two months after the initial battle with the Vong at Helska IV, New Republic forces (including Luke Skywalker, Leia Organa Solo, Jacen Solo and Anakin Solo) were forced to evacuate Dubrillion and Destrillion. Because most of the ships lacked enough supplies to reach the Core, the refugee convoy was forced to land on Dantooine and await aid. Refugees from conquered worlds were also brought to Dantooine and a refugee camp had been established. However, the Yuuzhan Vong weren't far behind."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The battle began after Leia Organa Solo and Mara Jade Skywalker discovered that Yuuzhan Vong warriors had infiltrated the refugee camp through the use of Ooglith Masquers. During the struggle, Leia's loyal Noghri bodyguard Bolpuhr was murdered. Meanwhile, a massive Chazrach assault force approached the camp. Despite its sheer size, the Jedi Knights (including Anakin and Jacen Solo) discovered that the reptoids were easy to defeat. However, the large number of Chazrach resulted in the Yuuzhan Vong gaining the upper hand over the New Republic forces."}, {"tag": "p", "text": "Later, Skywalker discovered that the Chazrach were controlled by a beetle-shaped war beast, which came to be known as a Thrall herder. The creature was protected by numerous dovin basals which would intercept missiles and laser blasts directed at it. Luke Skywalker was able to use the Force to seize the black hole and had it suck itself into its own void. As a result, the Chazrach assault force was scattered and began attacking everything that moved, including each other."}, {"tag": "p", "text": "Despite this success, the Yuuzhan Vong still held the upper hand. As the melee raged on, so many New Republic soldiers and refugees were slaughtered that the refugee convoy no longer had supply problems and was once again able to leave the planet. Admiral Traest Kre'fey arrived in the nick of time with a fleet of warships and escorted the convoy to safety, abandoning the planet to the Vong."}, {"tag": "h2", "text": "Space battle"}, {"tag": "p", "text": "Alongside the New Republic ground forces was Rogue Squadron, in the atmosphere and immediate area. Jaina Solo was among them, applying a plan recently concocted by herself; strafing the enemy forces with lasers and torpedoes. The worked to a point until the Vong put living tanks into the mix. The tanks were armed with dovin basals and easily absorbed the lasers into the black holes they generated. Jaina quickly revised Rogue Squadron's battle plan, reprogramming the proton torpedoes to detonate in proximity to dovin basals, bypassing the Vong's mock shields. The change in plan worked marvelously and the enemy soldiers were quickly wiped out. A Yuuzhan Vong cruiser appeared in space and launched coralskippers to combat the X-wings."}, {"tag": "p", "text": "Rogue Squadron immediately focused their attention on the incoming threat and subsequently demolished the familiar foes, but were unable to break the massive cruiser's powerful shields. Rogue Squadron was divided into far smaller groups of three, presenting far more targets for the suddenly overwhelmed organic computer. However, the reduced focus of Rogue Squadron allowed the cruiser to regain part of its offensive edge. Jaina Solo herself launched multiple proton torpedoes through a neglected area of the cruiser's defense, crippling the ship. Several more warships immediately entered the area, causing Admiral Traest Kre'fey to order Rogue Squadron's retreat. The toll on Rogue Squadron was enormous; they lost half of their fighters, though the logistical data gained from the battle at least somewhat compensated for the loss."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, the Yuuzhan Vong nearly exterminated the planet's native Dantari. Jacen Solo also started his path to the dark side here as he felt oddly happy after he slaughtered so many sentients with a force signature. The battle ended in a defeat for the New Republic but the information gained from just the battle alone made up for the defeat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}