{"url": "TX-130_Saber-class_fighter_tank/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Galactic Empire vehicles", "Category:Saber-class assault tank line", "Category:Shielded ground vehicles"], "nodes": [{"tag": "h1", "text": "TX-130 Saber-class fighter tank"}, {"tag": "p", "text": "The Republic Interceptor TX-130 Saber-class fighter tank, otherwise known as the IFT-X or Republic fighter tank, was a maneuverable, fast-attack tank used by the Jedi Order and their clone forces during the Clone Wars."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "The TX-130 Saber-class fighter tank was equipped with twin laser cannons and a large payload of concussion missiles. Some models had a beam cannon turret on top. With a limited speed boost, Jedi pilots could remove themselves from tight combat situations, and then use the TX-130S's powerful optical zoom on the main turret to eliminate vehicles and personnel from a safe distance. Some were also equipped with an on-board R2 unit. The repulsorlift tank's armor was light enough to maintain its maneuverability, allowing the fighter tank to be used in an anti-vehicle and infantry support role."}, {"tag": "p", "text": "Constructed by Rothana Heavy Engineering, the TX-130 was 8.2 meters in length with a top speed of 320 kilometers per hour. It had room for 2 passengers, 750 kilograms of cargo, and supplies for one day. It carried 2 Exo-Shell 3 Shield Projectors.[source?]"}, {"tag": "p", "text": "The top turret of the tank had an open-cockpit for the gunner, while the tank's rear door was also a weak spot, and if any heavy weaponry landed a hit there, the damage would be more severe than any other section of the vehicle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TX-130S was sometimes referred to as the \"Jedi starfighter of the ground.\" During the Clone Wars, the versatile fighter tank saw action on planets such as Geonosis, Rhen Var, Raxus Prime, Thule, and Saleucami. Many notable Jedi piloted fighter tanks during the Clone Wars, including Mace Windu, Obi-Wan Kenobi, Anakin Skywalker, Luminara Unduli, and Ki-Adi-Mundi who used the Force and superior skills to get the best out of these maneuverable craft. In the hands of these Jedi, these tanks proved a match for many Separatist armored vehicles."}, {"tag": "p", "text": "The tank was phased out of service shortly after the proclamation of the Galactic Empire, and was replaced by stronger variants, such as the TX-130T fighter tank and the 2-M Saber-class repulsor tank, both of which having a different paint and aesthetic to the Republic's variant. However, production continued in secret, with several hundred models being sold to the Rebel Alliance."}, {"tag": "p", "text": "These vehicles were used by Rebel forces during the Battle of Turak IV."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though one of the usable vehicles in Star Wars: The Clone Wars video game, the TX-130 first appeared in the young readers book Boba Fett: Crossfire."}, {"tag": "p", "text": "A first LEGO version of the tank (LEGO STAR WARS - 7679 Republic Fighter Tank) was released in 2008 and a second version (LEGO STAR WARS - 75182 Republic Fighter Tank) was released in 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}