{"url": "TZ-33", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Masculine programming", "Category:Separatist droid officers", "Category:T-series tactical droids"], "nodes": [{"tag": "h1", "text": "TZ-33"}, {"tag": "p", "text": "TZ-33 was a T-series military strategic analysis and tactics droid with masculine programming who served the Confederacy of Independent Systems during the Clone Wars. Stationed in a Separatist outpost on the planet Felucia, the droids under TZ-33's command at the outpost were sent a battalion of reinforcements in 20 BBY by Separatist General Grievous shortly before being attacked by Republic forces led by Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano. The Republic forces quickly overwhelmed the outpost, and TZ-33 was destroyed by Skywalker during the fighting."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The T-series tactical droid designated TZ-33 was produced by Baktoid Combat Automata for the Confederacy of Independent Systems for use during the Clone Wars against the Galactic Republic. During the war in the year 20 BBY, the droid was stationed in a CIS mobile command center, which served as an outpost on the planet Felucia, where Republic and Separatist forces were engaged in a long-scale conflict for control of the planet. When the cyborg Separatist General Grievous learned that the Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano were leading clone trooper tank divisions on Felucia, he sent a battalion of battle droid reinforcements to TZ-33's outpost in a C-9979 landing craft, in the hopes of securing the Separatists' hold on the Felucia system."}, {"tag": "p", "text": "TZ-33 oversaw the disembarkation of the new troops from a Separatist command center, calculating an inevitable Separatist victory on Felucia based on the arrival of the droids. However, he had not realizing that he was being watched by Republic forces preparing to attack the Separatist outpost. The Jedi and clones split into three groups and surrounded the outpost, but before they could attack, the Separatist forces detected Republic All Terrain Tactical Enforcers supporting them from a nearby ridge. The AT-TEs opened fire on the outpost, prompting TZ-33 to order his troops to form up and mount a counterattack against the artillery vehicles."}, {"tag": "p", "text": "Once the outpost's gates were open to allow the B1 battle droids and DSD1 dwarf spider droid under TZ-33's control out, a force of clone troopers led by Skywalker charged the gate and pushed through into the outpost. A second force led by Jedi Master Plo Koon then entered the outpost using jetpacks on the left flank, and a third force commanded by Tano scaled the rear wall using grappling hooks. The Separatist droids were quickly overwhelmed, and after destroying several BX-series droid commandos defending TZ-33, Skywalker cleaved the tactical droid diagonally in two with his lightsaber as he tried to back away."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "TZ-33 was a T-series tactical droid with masculine programming. He had white sensors and green and yellow plating.3 Despite being programmed for military strategic analysis and tactics, TZ-33 did not anticipate the Republic's three-pronged attack on his outpost. While inside his outpost he carried no weapon, and could only try to back away as he was attacked by Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "TZ-33 first appeared in \"Padawan Lost,\" the twenty-first episode of the Star Wars: The Clone Wars television show's third season. The episode aired on April 1, 2011, and did not identify TZ-33 until the credits, which revealed that the droid was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}