{"url": "Battle_of_Death_Star_III", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Conflicts on Endor", "Category:Star Tours"], "nodes": [{"tag": "h1", "text": "Battle of Death Star III"}, {"tag": "p", "text": "The Battle of Death Star III was a space battle fought a few months after the Battle of Endor. During the battle, the Alliance of Free Planets' Red Squadron attacked a Death Star-like space station near Endor. The station was defended by a fleet of Imperial-class Star Destroyers and its contingent of TIE/LN starfighters."}, {"tag": "p", "text": "A similar weakness to the first Death Star had been discovered in the unfinished superstructure, and the Republic starfighters made their way past the Imperial escorts, fought TIE squadrons and made a trench run to their designated target. The unit was forced to defend a Star Tours travel agency StarSpeeder 3000 after the civilian vessel's inexperienced droid pilot accidentally stumbled into the midst of the battle."}, {"tag": "p", "text": "Firing proton torpedoes into a thermal exhaust port similar to the one on the Death Star I, the starfighters and the Star Tours ship withdrew from the battle, leaving the station to be destroyed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the events of the Battle of Endor, the interstellar traveling agency Star Tours attempted to capitalize on Endor by making a touring route known as the Endor Express. C-3PO and R2-D2 were placed on temporary loan for the company while their owners in the Alliance of Free Planets fought against the Tofs during the Nagai–Tof War."}, {"tag": "p", "text": "Because of Emperor Palpatine's death at Endor, the Galactic Empire had fractured into multiple factions, led by various warlords. One of these factions, the Kaarenth Dissension, led by self-proclaimed Supreme Commander Ennix Devian, managed to steal two unfinished Worldcraft from Coruscant (which had intended to be gifted to him and his rival, Ardus Kaine), and separated them to two different portions of the galaxy. He eventually modified one of the Worldcraft to resemble one of the Death Star superweapons as part of a feint against the fledgling Alliance of Free Planets."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As Devian expected, the Alliance of Free Planets eventually uncovered evidence of the construction of a supposed third Death Star being developed somewhere close to Endor, at that time the capital of the Alliance of Free Planets. They then dispatched Red Squadron to take it out. Before attacking the station directly, however, they had to deal with a fleet of Star Destroyers and a TIE fighter squadron. Because of this, the sector was cordoned off from civilian travel due to the combat situation."}, {"tag": "p", "text": "At some point during the dog-fight, a StarSpeeder 3000, ST-45, belonging to the Star Tours travel agency, unintentionally arrived in the middle of the battle after escaping a nearby comet storm. The droid pilot, RX-24, in a calculation error due to inexperience, inadvertently bypassed Endor completely due to exiting Hyperspace too late from their destination. The ship was later caught in one of the Star Destroyer's tractor beams, although it managed to escape after one of the Red Squadron pilots advised RX-24 to ease up on the main thruster. The ship was later damaged by a TIE fighter shot, although the ship was spared from destruction after R2-D2 repaired the stabilizer."}, {"tag": "p", "text": "Eventually, Red Squadron allowed it to participate in the actual battle on the Death Star, where it observed the group's X-wings maneuvers and also aided them by shooting down pursuing TIE fighters. Red Squadron then reached its target: a Thermal exhaust port similar to the one that doomed its predecessor, which the squadron then proceeded to fire a salvo of proton torpedos into. Despite impacting on the surface instead of entering perfectly, the torpedoes still managed to cause a chain reaction, just as Jan Dodonna had predicted in 0 BBY, and destroyed the station, taking all hands aboard with it."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the battle, the StarSpeeder 3000 returned to its docking area with minor damage. This event, however, was only the beginning of similar incidents that later forced the Star Tours agency to be shut down."}, {"tag": "p", "text": "Although the battle was won by the Alliance of Free Planets, it ultimately turned out to be a pyrrhic victory, as Devian had successfully raided various Alliance-aligned shipyards and stole several vessels while they were distracted with the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Death Star III idea was created to explain why a Death Star is present on the Star Tours ride when both of the stations in the movies were destroyed. Its canonicity was later confirmed in Convenient Daily Departures: The History of Star Tours, an article written by James McFadden for the official blog on StarWars.com. Later, a blog entry by Abel G. Peña and Daniel Wallace -- The Imperial Warlords: Despoilers of an Empire -- revealed Death Star III's full origin as a distraction concocted by Ennix Devian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}