{"url": "TV-94B/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Masculine programming", "Category:Separatist droid officers", "Category:T-series tactical droids"], "nodes": [{"tag": "h1", "text": "TV-94B"}, {"tag": "p", "text": "TV-94B was a T-series tactical droid that was used by the Confederacy of Independent Systems during the Clone Wars. He was assigned to General Grievous as a replacement for TV-94. He oversaw the space battle of the Battle of Kamino, led personally by Grievous and Count Dooku's Dark Acolyte, Asajj Ventress. The goal of the invasion was to destroy the cloning facilities of Tipoca City, halting the Galactic Republic's production of new clone troopers, and retrieve the DNA of clone template Jango Fett to unlock new tactical possibilities for the Confederacy. Commanding droid forces from the General's command ship while Grievous and Ventress went to complete their mission with the ground forces, TV-94B later retreated with the rest of the fleet when the invasion was a failure due to the efforts of Jedi Master Obi-Wan Kenobi, Shaak Ti and Anakin Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 21 BBY, during a Separatist attack on Kamino, TV-94B served aboard General Grievous's command ship. He stood by the General's side as he and Asajj Ventress discussed the invasion via hologram on the bridge. When the fleet jumped to hyperspace and arrived at Kamino, TV-94B acknowledged Grievous' order to use Attack Formation Echo-3 to engage the planet's blockade. The tactical droid then demanded the status of the command ship, making sure that deflector shields were raised, adjacent destroyers were in position, forward cannons were ready and the landing craft hidden in the fleet's frigates were prepared. He then informed the General that all of their ships were ready, and Grievous ordered him to commence the attack."}, {"tag": "p", "text": "As the space battle continued, Grievous sacrificed his forward frigate transports. This maneuver confused Jedi Master Shaak Ti, and made General Kenobi suspicious. What the Jedi did not immediately realize was that the debris from the frigates was the Separatists key to victory, as it contained the pieces to the hidden landing craft which were to be used in the invasion of Tipoca City. When the debris fell into the planet's ocean below the city, Grievous transferred to one of the frigates, going down with the landing craft to join his ground forces, and leaving TV-94B in charge of his command ship and the rest of the space forces."}, {"tag": "p", "text": "When the assembled assault craft attacked from the ocean and both General Grievous and Asajj Ventress personally pressed the attack on the city, the Dark Jedi went to the clone DNA room to secure the DNA of clone template Jango Fett while the General and his troops pushed onward, and killed every clone in sight. With the efforts of General Kenobi and General Skywalker, however, the mission was a failure, as Ventress lost the DNA and was forced to escape. She returned to the fleet with Grievous in an escape pod, and TV-94B's ships retreated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally, the Episode Guide on Star Wars.com claimed that it was TV-94 himself present on Grievous' command ship. Like TV-94, he was also voiced by Matt Lanter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}