{"url": "Battle_of_Denash", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Battle of Denash"}, {"tag": "p", "text": "A battle occurred in the years leading up to the Battle of Yavin between the Denash insurgents and Admiral Kinshara's One Twenty-Fifth task force of the Galactic Empire. The 125th Task Force encountered little opposition since most of the Denash insurgents had evacuated most of their ships and materiel to Batonn."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, the pirate and insurgent leader Nightswan waged an insurgent campaign against the Galactic Empire. Later, he relocated his operations to the Batonn sector, leading to the emergence of insurgent groups on Denash, Batonn, and Sammun. The Denash insurgents fought against the Imperial Governor Wistran. Following the capture of Scrim Island on Batonn by the Batonn insurgents, Fleet Admiral Jok Donassius ordered military operations against insurgent forces in the sector. Admiral Kinshara of the One Twenty-Fifth task force was tasked with pacifying the Denash insurgents."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Admiral Kinshara's 125th Task Force succeeded in pacifying the Denash insurgents, who did not put up much of a fight. However, preliminary interrogation of prisoners suggested that a large portion of their ships and material had already been transferred to Batonn."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Battle of Denash, Admiral Kinshara reported his findings to Fleet Admiral Donassius and the other Imperial admirals including Admiral Thrawn and Admiral Durril. Thrawn reported that Commander Karyn Faro had succeed in defeating the Sammun insurgents and capturing several starships and a large amount of material. By contrast, Admiral Durril's One Oh Third Task Force had been repulsed by the Scrim Island insurgents with considerable damage. Admiral Thrawn was tasked with recapturing the Scrim Island and subsequently defeated Nightswan and the Batonn insurgents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Denash first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted canonical origins of the titular character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}