{"url": "Tactical_unit", "categories": ["Category:Legends articles", "Category:Imperial intelligence organizations", "Category:Imperial Special Forces units"], "nodes": [{"tag": "h1", "text": "Tactical unit"}, {"tag": "p", "text": "A tactical unit was a combat force from the Imperial Security Bureau. In 0 ABY, one such unit was assigned aboard the Star Destroyer Reprisal, reinforcing the observers already deployed to the ship under Major Drelfin, and charged with operations against Rebel cells and sympathizers in Shelsha sector."}, {"tag": "p", "text": "This unit consisted of just ten squads of ISB agents plus two squads of Imperial Security Bureau stormtroopers drawn from COMPNOR's own cadres. In total, it contained the equivalent of just two or three platoons of troops, less than one full company—yet it was a self-contained command with its own droids and intelligence support as well as the stormtroopers, and warranted a Colonel as its senior officer, Vak Somoril."}, {"tag": "p", "text": "The tactical unit was also equipped with a pool of small spaceships for use on covert missions, outwardly nondescript, but in fact extensively upgraded with high-tech equipment, arsenals of military hardware, and infiltration equipment: an old space yacht, several outmoded troop transports and a number of light freighters, all of which were berthed in the Reprisal's Hangar Bay 5."}, {"tag": "p", "text": "Thoroughly committed to the New Order, ISB tactical units operated outside the normal chain of command, and regarded their own priorities as overriding those of the Imperial Navy, Imperial Army and even the Stormtrooper Corps. It is not clear quite where within the overall ISB hierarchy a tactical unit stood, but it may have combined personnel from several separate sections of the organization, such as Investigations and Enforcement. The personnel assigned to these commands certainly appear to have been highly-trained elite troops, in contrast to the turbo-cannon fodder of CompForce."}, {"tag": "h2", "text": "Appearances"}]}