{"url": "Tag_Greenley/Legends", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Alliance to Restore the Republic members", "Category:Corellians", "Category:Force ghosts", "Category:Humans", "Category:Impersonators", "Category:Males", "Category:Post-Ruusan Jedi", "Category:Royal Guard", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Tag Greenley"}, {"tag": "p", "text": "Tag Greenley was a legendary figure who along with his partner Bink Otauna constituted a mischievous duo. It is possible that the duo was based on actual persons, though historians continued to debate their existence."}, {"tag": "p", "text": "Possibly born on Alderaan, he had many adventures with Bink. According to the legend, the two witnessed and also affected several important events of the Imperial Period chronicled in the Journal of the Whills, the exploits of the Alliance to Restore the Republic, and the lives of the Skywalkers with outrageous and often hilarious results."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Revenge of the Clone Menace"}, {"tag": "p", "text": "Born to a Corellian family, Tag was the third child in his family after his sisters Ta-mara and De-hoff, but the first to be Force sensitive. He was, in fact, an unintended result of Darth Plagueis's manipulations of midi-chlorians. Tag was barely Force sensitive, but enough so to be accepted into the Jedi Order, where he met his friend-to-be Bink Otauna, another result of Plagueis' machinations. Both of the boys were weak in the Force, but they were able to scrape their way through their training. In order to stay afloat, Bink attempted to modify their grades by computer, but in the process accidentally deleted Kamino from the Jedi Archives. The two boys, afraid of being caught, fled, and ended up at Dex's Diner."}, {"tag": "p", "text": "There they tried to figure out what to do next, but were forced to run when Jango Fett, upon hearing a waitress' call of \"Order 66!\", tried to kill them. The two Padawans boarded a freighter bound for Naboo, where they accidentally ran into Anakin Skywalker, who was escorting Padmé Amidala back to her home. The two boys cut a deal with him; he would keep secret about their transgressions and help them get back home, and they would help him with his attempts to woo Padmé. While this worked for a while, when Anakin sensed that his mother Shmi was worred about him and left Naboo, he left the two boys behind, and they were forced to find an alternate way home. However, this was just as the Clone Wars broke out, and as a result it took them three years to make their way back to Coruscant. They arrived at the Jedi Temple just in time to find a massacre taking place. Anakin, now Darth Vader, refrained from killing them, as they had helped him win Padmé over so many years ago. However, he gave them specific orders: to forget they were ever Jedi and leave forever. The two did so, deciding that Tatooine would be a perfect place to hide where nothing would happen."}, {"tag": "h3", "text": "Tag & Bink Are Dead"}, {"tag": "p", "text": "Nineteen years later, they had joined the Rebellion and were serving aboard the Tantive IV when it was captured by the Devastator over Tatooine. The two were taken prisoner by a pair of stormtroopers, but were able to overpower them and don their armor. Disguised, they were taken back onboard the Devastator and transferred to the first Death Star. When the Death Star arrived at Alderaan, Bink's homeworld, they stole a pair of TIE fighters and headed for the planet. Unfortunately for them, this was just as Alderaan was destroyed, and the two found themselves in even more trouble when the Millennium Falcon arrived. Bink cautioned Tag not to return to the Death Star, but due to the Falcon's jamming, Tag misheard and did just that, thus luring the Falcon to be captured by the Empire. Still in disguise, the pair were put in charge of guarding the tractor beam power console that Obi-Wan Kenobi would later disable. They were almost called for duty as Darth Vader's wingmen, but managed to give him the slip and steal Grand Moff Tarkin's personal shuttle Tydirium. They were leaving the Death Star just as Luke Skywalker destroyed it, and their hyperdrive was knocked out, forcing them to make a landing on Yavin 4."}, {"tag": "p", "text": "This took them a few months, and by the time they arrived, the Rebels were long gone, the only things left being the leftover trash from the Rebel celebration and a medal reading \"Chewie\" that had been forgotten. Boba Fett arrived at this point, looking for Han Solo, but the pair got the drop on him. They tied him up and left for Cloud City to find old friend of Tag's, Lando Calrissian. Fett escaped soon after, and the two were shocked to see Slave I awaiting them. Lando wanted them gone, but when Tag reminded him that Lando had been taking credit for Tag's victory at the Battle of Taanab, Lando conceded and left to greet his other guest. The two hid in a room on Cloud City, but when they were surprised by C-3PO, Bink blasted him as payback for getting them caught on the Tantive IV. As a result, Lando made them escort Princess Leia Organa and Chewbacca to safety, but first they were taken to the carbon-freezing chamber, where Chewbacca knocked Tag unconscious. When he came to, the Empire was already taking control of the city, the Princess and Wookiee had already left, and a crowd of Cloud City's enraged inhabitants were pursuing them. Imperial reinforcements arrived in time, though, and the two were able to escape and get back to Mon Mothma and Gial Ackbar, with their captured Imperial shuttle in tow."}, {"tag": "h3", "text": "The Return of Tag and Bink"}, {"tag": "p", "text": "Some time later, they were sent, again in the disguise of stormtroopers, to assist Lando in meeting a Rebel contact on Tatooine. When they interrupted his meeting with Kannen Doom, who was supposed to help him get Han Solo back from Boba Fett, he forced them to help instead. They distracted Fett as Lando searched the ship, pretending to be an Imperial customs team, but not only had Han already been taken, but Tag and Bink were caught by Boba, who recognized them. They subdued him, and Tag donned Fett's armor, while Bink disguised himself as a gangster, and together the to infiltrated Jabba Desilijic Tiure's palace. Their first plan was to help Leia get Han out, but when she was captured, they went to their next plan, helping Luke get both of them out. When he failed, they went to the plan after that, helping Luke overpower the guards at the Great Pit of Carkoon and escape. Tag, still disguised as Boba Fett, went to help Luke, but the Jedi, mistaking him for the bounty hunter, attacked him. When Han Solo hit his jetpack, Tag sailed into the mouth of the sarlacc. Bink fared little better. When they came to, they were in the custody of Kannen Doom, who had been looking for Boba Fett, mistaking him for his father, who had dumped her. Boba arrived soon after, gunning for the pair, and they escaped to meet their contact, Manny Both-Hanz. He had information on a new Imperial space station, including that Emperor Palpatine would be aboard it. However, he was shot in their escape, and Manny Both-Hanz died bringing the Rebels the information. The two reported as such to Mon Mothma."}, {"tag": "p", "text": "She ordered them to take the body to the Empire in their commandeered Imperial shuttle to convince them that the Rebels had not learned the information Manny possessed. They were once again waylaid when the Empire sent them to escort the Emperor to the new Death Star, this time disguised as Royal Guards. The two were put on duty in the Emperor's throne room, where they listened as Darth Vader and Palpatine conspired to bring Luke to the dark side of the Force, and later as Luke arrived with Vader. They were surprised to hear that Luke was Vader's son. Palpatine dismissed his guards, and they left, hoping to find an elevator to make their escape in. However, the only elevator was on the other side of the tower they had just came from, and not wanting to look foolish, they waited, watching as Luke fought his father, was tortured by Palpatine, and Palpatine was killed by Luke's redeemed father. When Luke dragged his father into the elevator and left, they came back around and waited for the elevator to return. It was shortly after this that the Death Star exploded."}, {"tag": "p", "text": "On the surface of Endor, as the Rebels celebrated their victory, Tag and Bink joined them as Force ghosts, standing beside those of Yoda, Obi-Wan Kenobi, and Anakin Skywalker (in fact, two Anakin Skywalkers, oddly enough, one rather older)."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tag Greenley was a character penned by humorist Kevin Rubio. Partnered with Bink Otauna, the mischievous duo adventured through the events of the Star Wars films with outrageous and often hilarious results."}, {"tag": "p", "text": "Tag's appearance is based on Kevin Rubio's brother Craig."}, {"tag": "p", "text": "The name of the comic mini-series Tag & Bink Are Dead is a reference to the play and subsequent movie Rosencrantz and Guildenstern are Dead, about the comical adventures of two minor characters from William Shakespeare's Hamlet."}, {"tag": "p", "text": "According to Kevin Rubio, during the Clone Wars Tag and Bink were on Malastare, working as busboys in a local dive bar, and trying to collect enough money to buy transport to Alderaan."}, {"tag": "p", "text": "The exploits of Tag and Bink are canonized by The Complete Star Wars Encyclopedia as legend. The book also hints that the characters may, themselves, have existed in canon. However, the comics are non-canon, due to differences from both the movies and the Expanded Universe."}, {"tag": "p", "text": "Screenwriter Jon Kasdan and first assistant director Toby Hefferman portrayed Tag Greenley and Bink Otauna in deleted scenes from the 2018 film Solo: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}