{"url": "Tag_%26_Bink_Are_Dead_2", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Tag and Bink"], "nodes": [{"tag": "h1", "text": "Tag & Bink Are Dead 2"}, {"tag": "p", "text": "Tag & Bink Are Dead 2 was the second and final issue in the Tag & Bink Are Dead series of comics, and was released December 5, 2001."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Tag Greenley and Bink Otauna are dead. The two Rebel soldiers chose to disguise themselves as stormtroopers to escape the icy clutch of death. Eventually they found their way onto the Death Star where they (along with everyone else on the battle station) were blown to smithereens. That's how issue #1 of Tag & Bink Are Dead ended. So, if they're dead—how exciting is the second issue going to be?! PLENTY! And it's HILARIOUS to boot! Make sure not to miss this final chapter in the lives of Tag & Bink! Written by Kevin Rubio (creator of the Internet film sensation TROOPS and the laugh-riot short stories \"A Death Star Is Born\" and \"Force Fiction\" from Star Wars Tales) and illustrated by the masterful Lucas Marangon."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the party room of Massassi Station, a broken Monolith (from 2001: A Space Odyssey), a hat containing the number 42 (from The Hitchhiker's Guide to the Galaxy), and the rabbit suit and walrus mask from Magical Mystery Tour can be seen."}, {"tag": "p", "text": "A Joseph Schlitz Brewing Company poster appears in Lando Calrissian's room, along with a autographed poster of Mace Windu and a lava lamp."}, {"tag": "p", "text": "Kevin Rubio himself appears in one frame, typing on his laptop, while a minature AT-ST peers over the screen."}, {"tag": "p", "text": "Two Cylon Centurions from Battlestar Galactica march behind Emperor Palpatine."}, {"tag": "h2", "text": "Collections"}]}