{"url": "Taffy_(candy)", "categories": ["Category:Legends articles", "Category:Candy", "Category:Ewok food"], "nodes": [{"tag": "h1", "text": "Taffy  (candy)"}, {"tag": "p", "text": "Taffy was a type of sticky candy. In 3 ABY, it was sold at Mooth's trading post on the Forest Moon of Endor. When a group of Ewoks came to buy items from the store, one of them, Widdle Warrick, attempted to convince his brother, Wicket, to purchase some of the taffy. In that same year, Wicket's friend, Teebo, made a pink variant, sugar leaf taffy, from pebbles by using his magic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Taffy was a type of sticky, beige candy that could be eaten by Ewoks. A pink variant, sugar leaf taffy, could be made from pebbles via magic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Taffy was sold at Mooth's trading post on the Forest Moon of Endor in 3 ABY, when several Ewoks visited the store. Prior to the owner, Mooth, coming out to greet them, one of the young Ewoks, Widdle Warrick, stirred a pot of taffy he found, attempting to convince his brother, Wicket, to purchase some. As Wicket pondered his decision on what to purchase, Widdle continued to try to persuade him to choose the taffy, as he ate some of it himself. Ultimately, Wicket chose to purchase a rock."}, {"tag": "p", "text": "Wicket Warrick's friend Teebo made sugar leaf taffy also in 3 ABY, when the two of them were trying to get several wokling Ewoks to stop crying after their visit to the Horville's Hut of Horrors attraction, which greatly scared them. Teebo used his magic to inflate several pebbles until they exploded, causing himself to be covered in the taffy, which the woklings found to be humorous."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taffy first appeared in \"The Curse of the Jindas,\" the seventh episode in the first season of the animated television series Ewoks, which was released October 19, 1985."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}