{"url": "Tafanda_Bay", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Herdships", "Category:Ithor locations"], "nodes": [{"tag": "h1", "text": "Tafanda Bay"}, {"tag": "p", "text": "Tafanda Bay was the name of a floating herdship city above the planet of Ithor. Momaw Nadon was high priest of this city during Imperial intervention. Later, during the Yuuzhan Vong War, Relal Tawron served as high priest."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Ithorian herd ships were hundreds of meters tall and could house several thousand inhabitants.The ships hovered above the surface of Ithor, and the Ithorians considered the jungles within them sacred and would not allow themselves—or others—to set foot in them. The Ithorians lived on these herd ships for thousands of years and pointed to them as examples of ways to integrate technology and nature harmoniously."}, {"tag": "p", "text": "Unlike the gleaming towers preferred by Humans, the Tafanda Bay's exterior was covered by mosses, flowers, and immense trees. The Tafanda Bay had landing platforms for incoming starships and speeders, while dozens of gigantic repulsorlift engines propelled it slowly over the jungle landscape."}, {"tag": "p", "text": "The ship's interior environments reproduced virtually every terrain known to Ithor as well as many found on other worlds. The ship had several large halls where visitors could purchase goods from the shrewd Ithorian traders. A popular area to visit was the Great Atrium; it was nearly a kilometer across, with moss-covered walls leading to the open air above. Other popular destinations included the upper and lower observation decks, which offered stunning views of the jungle and Ithor's brilliant violet night sky. Adventurous visitors were allowed to rent speeders for guided sight-seeing tours above the jungle."}, {"tag": "p", "text": "Tafanda Bay was the flagship of the Ithorian ground fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The majestic eco-city was a popular destination for tourists and a center of commerce in the Lesser Plooriod Cluster."}, {"tag": "p", "text": "During the reign of the Galactic Empire, Emperor Palpatine sent the Star Destroyer Conquest to persuade the Ithorians to give up their ecological secrets. Momaw Nadon, high priest of Tafanda Bay at the time, surrendered the knowledge gathered together by generations of Ithorian botanists so that no harm would come to the jungles of Ithor. The Ithorians banished Momaw to Tatooine to serve his sentence."}, {"tag": "p", "text": "After the next \"great meet\" of Ithorian Herd Ships, Momaw returned to his place as high priest of Tafanda Bay."}, {"tag": "p", "text": "Years later, during the war with Admiral Daala, Wedge Antilles and alien scientist Qwi Xux arrived on Tafanda Bay hoping that Momaw Nadon would protect Qwi and her knowledge from the forces of the Empire. The loyalty of the Ithorians wasn't enough though to prevent Kyp Durron, under the influence of the dark side, from erasing Qwi's mind."}, {"tag": "p", "text": "In 25 ABY, Relal Towron replaced Momaw Nadon as high priest of Tafanda Bay. The Yuuzhan Vong invaded Tafanda Bay during the Battle of Ithor. The Legacy of Torment arrived in the system above Ithor after Corran Horn discovered on Garqi that the Bafforr trees reacted violently with the Yuuzhan Vong armor. As Admiral Gilad Pellaeon, Rogue Squadron, and a force of Chiss aliens led by Jagged Fel engaged Coralskippers in space, the Yorik-trema landed their troops inside Tafanda Bay. Luke Skywalker and his Jedi allies engaged the Yuuzhan Vong and Chazrach aboard the herd ship. Relal Towron had to be evacuated to the Core Worlds after the invasion. Ithor was destroyed in this battle, presumably taking Tafanda Bay with it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}