{"url": "Battle_of_Dorumaa", "categories": ["Category:Legends articles", "Category:Battles of the Thaereian War"], "nodes": [{"tag": "h1", "text": "Battle of Dorumaa"}, {"tag": "p", "text": "The Battle of Dorumaa was a battle that was fought during the Clone Wars on Dorumaa."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Galactic Senate ruled that the Thaereian Military should leave the Cularin system, they refused to, due to their secret alliance with the Confederacy of Independent Systems. They began a blockade of the system and in response, the Cularin Militia planned to attack their only base in the system, Dorumaa Base on Dorumaa. Major Xirossk planned the Militia attack aboard the Cularin 1 and decided against an orbital bombardment, due to the base's shields. He instead planned to have ground troops take out the base's shield generator and then negotiate its surrender. He also recruited the Heroes of Cularin to perform a special forces role during the battle."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Heroes were dropped off in the plains next to the shield perimeter, along with the rest of the Militia force. They penetrated the shield and were attacked by hundreds of B1-Series battle droids that were on the other side. After taking out the droids, the Militia forces attacked a group of Thaereian Armored Assault Tanks and destroyed them as well. They then were attacked by a group of Thaereian troopers and afterwards, by a IG-227 Hailfire-class droid tank. The Miltia then made an assault on the actual base and came under fire from the last Thaereian line of defense, a ditch with elite troopers in it. While the Militia force attacked the Thaereians around the base, the Heroes of Cularin destroyed two of the shield emitter towers. Cannon fire took out a third tower and the shield was brought down."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Major Ren Terlo, who had been leading the Militia force, arrived at the base in a staff vehicle, to negotiate with Vayla Sevren over the base's surrender. The Thaereians had lost their only ground foothold in the Cularin system, allowing them to be finally driven out of it in the Battle of Cularin."}, {"tag": "h2", "text": "Appearances"}]}