{"url": "Battle_of_Doornik-319", "categories": ["Category:Legends articles", "Category:Battles of the Black Fleet Crisis"], "nodes": [{"tag": "h1", "text": "Battle of Doornik-319"}, {"tag": "p", "text": "The Battle of Doornik-319 was a battle between the New Republic and the Duskhan League at the planet Doornik-319, the primary in the system of the same name.\nPrior to the battle, Morning's Bell, a Kubaz colony world within the system, had been razed by the Yevetha during the Great Purge."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Great Purge resulted in the deaths of countless beings throughout the Koornacht Cluster in an unprovoked, genocidal rampage. Although slow to respond, the New Republic finally sent a warning to Viceroy Nil Spaar of the Duskhan League to withdraw from the conquered planets or risk war against the Republic."}, {"tag": "p", "text": "No answer was ever received from the Viceroy, despite the ultimatum being relayed for several days across many channels. In response, President Organa Solo, with the backing of the Defense Council, ordered a blockade of Doornik-319, one of the planets brutally attacked and settled by the Yevetha. Doornik-319 was chosen as the target after recon drones showed evidence that the Yevetha were continuing to ship in colonists and supplies in utter defiance of the warning."}, {"tag": "p", "text": "With a Victory-class Star Destroyer known to be on station, the New Republic Fifth Battle Group put together several task forces to enforce this blockade and jumped into the first battle between the New Republic and Black Fleet."}, {"tag": "h2", "text": "The Ambush"}, {"tag": "p", "text": "The initial deployment into the system consisted of a flotilla from the Fifth Fleet's flag group, under the command of General Etahn A'baht: the Endurance-class fleet carrier Intrepid, the Majestic-class heavy cruisers Stalwart, Illustrious, Liberty and Vigilant and the Defender-class assault carriers Repulse and Shield, along with a mixture of light escorts and pickets. Jumping into orbit, this initial force found the system empty of ships, the ground settlements apparently abandoned and no sign of the Yevetha anywhere. Suspicious but without any other choice, the task force moved into blockade orbits against the planet and, almost immediately, the Yevetha struck."}, {"tag": "p", "text": "Ion cannons and high velocity missiles opened fire from three different sites on the planet's surface as a small Yevethan fleet dropped out of hyperspace, microjumping in between the high orbiting pickets and lower orbit capital ships. Caught between the planet and the ambushing Yevetha, the New Republic ships were left without room to maneuver as three Imperial-class Star Destroyers and six Aramadia-class thrustships, along with the Glory of Yevetha, engaged them at high speed, making a single pass through the Republic formation."}, {"tag": "p", "text": "The Sacheen-class light escort Trenchant was caught in a barrage of gravity bombs and proton torpedoes and destroyed. The heavier New Republic ships took varying amounts of damage, mostly to their shields, but the Yevetha did not press their attack, making one pass and breaking off. The captains of the Liberty and Illustrious requested permission to pursue the attackers, but were denied. General A'baht instead ordered the task force to break orbit, with the capital ships screening the lighter escorts and picket ships for the run to hyperspace."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "At the same time, General A'baht relayed the current tactical situation and deployment of the enemy ships via secure hypercomm to task forces Aster and Blackvine. The two battle groups were waiting two light hours above and below the system's orbital inclination respectively, out of sensor range of the enemy ships. With the order given, twenty-eight vessels jumped into the battle area, ambushing the ambushers in a carefully planned trap. The carriers launched their complements of the new K-wing bombers in one of their first combat actions before falling back behind the heavy ships. The K-wings were tasked with disabling the enemy vessels' shields, allowing the heavy turbolaser batteries on the New Republic capital ships to then engage and destroy the Yevethan fleet."}, {"tag": "p", "text": "Unfortunately, the Yevetha in turn unleashed a new tactic on the Fifth Fleet pilots and gunners, devised by Tal Fraan, an officer on board the Glory of Yevetha. As the bombers made their attack runs, they were suddenly subjected to a barrage of pleas from civilian hostages, survivors from the Great Purge now held prisoner on board the ships. Discipline and morale broke down rapidly in the attacking units; in the end, not a single Yevethan capital ship was claimed. Parts of the New Republic task forces started to retreat spontaneously, with General A'baht calling an official retreat minutes later."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Almost three squadrons of bombers were lost in the aborted engagement, along with the total loss of the Trenchant. Several capital ships took damage, especially the cruiser Phalanx, which was hit with a lucky shot while trying to recover a damaged K-wing. The total cost in lives to the Fifth Fleet was well over one thousand, in exchange for a complete and disastrous defeat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle for Doornik-319 appears in Shield of Lies by Michael P. Kube-McDowell. In the novel, no Yevethan casualties result from the conflict; however, the battle's image from The New Essential Chronology depicts the Yevethan thrustships taking hits and exploding. Even so, this article uses it for illustrative purposes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}