{"url": "Tahv", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Cities", "Category:Kesh locations"], "nodes": [{"tag": "h1", "text": "Tahv"}, {"tag": "p", "text": "Tahv, also known as the City of Glass, was the capital settlement of the Wild Space world of Kesh. It was built around 5000 BBY on the continent of Keshtah Minor by the planet's native sentient species, the Keshiri; Tahv's walls originally served the purpose of keeping the Keshiri safe from the planet's many dangerous creatures. Shortly thereafter, during the Great Hyperspace War, a group of Sith were forced to crash-land on the planet in their starship, the Omen. The Lost Tribe of Sith, as the survivors of the accident became known, conquered the Keshiri—as the natives believed them to be their gods—and helped them to drive away and domesticate Kesh's native beasts. Tahv then became a decorative city, focusing mainly on workings of art, often created by Sith artists using the Force."}, {"tag": "p", "text": "The Lost Tribe of Sith quickly took command of Tahv and the planet's government, and often forced the native Keshiri to work for them. Although the Sith moved into a newly-built Temple in the nearby Takara Mountains, they soon returned to live in Tahv. Many of the Sith lived toward the center of the city, while the Keshiri lived in the outskirts, or as servants to the Sith. By 3960 BBY, a stadium, the Korsinata, had been built in Tahv to hold rake-riding sporting events. However, in the following centuries, the Tribe was beset by infighting and Tahv fell into decay. By 41 ABY, the class difference between the Sith and the Keshiri had narrowed, although the outskirts of Tahv remained inhabited mostly by the less wealthy Keshiri. By that time, the Tribe's ruling body, the Circle of Lords, convened in the Circle Chambers in the capitol in central Tahv. In 44 ABY, the dark side entity Abeloth was brought to Tahv when she offered to ally with the Sith to defeat the New Jedi Order. However, she betrayed the Sith and attacked the city, killing thousands and leaving it in ruins."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The city of Tahv was located on the continent of Keshtah Minor on the remote Wild Space world of Kesh. Tahv's walls were large, originally built for defense against the planet's many dangerous animals; however, they were later used more for display than protection. The city itself was decorated with various workings of art, created through the Force by Sith artists, including levitating fountains, trees sculpted and shaped by the Force, and glass sculptures which gave it the nickname \"City of Glass.\" The city was also home to at least one pauper's tavern, which was decorated extensively with ornately carved glass. Sometime after 4975 BBY, a facility was created for housing the various wild species on Kesh, including the flying uvak used for transportation on the planet."}, {"tag": "p", "text": "Tahv had an extensive aqueduct system that was originally constructed by the indigenous Keshiri species and later improved upon by the Sith; the aqueducts were typically monitored by one Sith Saber and the Saber's apprentices. The outer edges of the city, nearest the walls, were the home of the more impoverished inhabitants—mainly the native Keshiri. Toward the center of the city, the area known as the Circle, Tahv grew more appealing and luxurious. Within the Circle was the capitol building and the Circle Chambers, in which the Circle of Lords, the planet's governing body, convened. As the Tribe returned to prominence in the galaxy, a spaceport was built in the open lands just outside the city. The entire city was permeated by the dark side of the Force, helping the Sith there to thrive."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early days"}, {"tag": "p", "text": "Tahv's Circle Eternal plaza was built on top of a series of underground Keshiri Burial Cairns, which predated the Hundred-Year Darkness. The Great Calamity was triggered by the arrival of two parties of offworld Dark Jedi and Jedi who had become stranded on Kesh following a galactic-wide pursuit. After the two rival Force-orders made peace, the Jedi hid a hyperspace-capable starship, the Last Hope, within the Keshiri burial cairns. In return, the Dark Jedi sealed their most powerful weapon, the Sith Lord Remulus Dreypa, within an oubliette, a stasis casket used to keep individuals in suspended animation. These Dark Jedi and Jedi then migrated to Kesh's South Pole, Eshkrene, where they founded the Doomed, a Force community committed to finding a balance in the Force and watching over the native Keshiri people. These offworlders gave rise to the Keshiri legends of the Protectors and Destructors. When the Neshtovar, a religious aristocracy which rode uvaks, came to power, they phased out these legends in favor of a creation story based around a Great Battle between the Skyborn and the Otherside, which was associated with any resistance to their religious order. When the Sith came into power, they reversed this cosmological order."}, {"tag": "p", "text": "The city was first built by the Keshiri people sometime before 5000 BBY. The walls of the city served mainly as protection for its inhabitants from the many dangerous animals that roamed the planet. In 5,000 BBY, during the Great Hyperspace War, the Omen—a Sith starship carrying a shipment of Lignan crystals to Sith Lord Naga Sadow—was knocked off-course while attempting to execute a hyperspace jump, and it crash-landed on Kesh in the Takara Mountains. The survivors of the crash made contact with a Keshiri woman, Adari Vaal, who told them of the city of Tahv. The Keshiri believed the Sith to be their gods, the Skyborn, and befriended them. Shortly after the Sith arrival, it was decided by the councilor Izri Dazh—leader of the Keshiri the Neshtovar, the Keshiri uvak-riders—and the city's governing body that all of the Keshiri in Tahv would be moved to humbler homes so that the \"Skyborn\" could live in luxury and the Keshiri could serve them. Over time, Tahv also became known by the name the \"City of Glass.\""}, {"tag": "p", "text": "With the help of the Sith—who eventually reorganized themselves into the Lost Tribe of Sith—and their superior technology, the Keshiri were able to drive off and domesticate many of the planet's predatory creatures. The Sith did not spend long in Tahv; within fifteen years of their arrival, they had left the city in favor of a Temple in the Takara Mountains. However, just ten years later, Grand Lord Yaru Korsin was killed, and in his honor, Nida Korsin, his daughter and successor as Grand Lord, ordered the Sith and their families to return to live in Tahv. Every twenty-fifth anniversary of Korsin's death the Sith held Testament Day in Tahv—a holiday that celebrated his final testament. Another holiday, the Festival of Nida's Rise, celebrated Nida Korsin's seventy-nine-year reign once every seventy-nine years. The two holidays converged for the first time in 3000 BBY, and several Sith and Keshiri alike attended."}, {"tag": "p", "text": "In Tahv, the Sith remained dominant over the Keshiri for thousands of years. In the same year as Nida Korsin's rise to power, she founded the Skyborn Rangers, an organization of uvak-riding Sith. Sometime later, a facility was constructed in Tahv to honor Nida Korsin and the Skyborn Rangers. The facility housed various predatory animals native to Kesh, as well as the uvak."}, {"tag": "h3", "text": "The Time of the Rot"}, {"tag": "p", "text": "Meanwhile, with the threat of danger removed, the walls of Tahv became more decorative than functional, and the city itself became more focused on art and beauty rather than protection and practicality. Sith artists began to influence the city, using the Force to shape trees and create impressive sculptures of glass formed from the planet's lavender sand. Windows, jewelry, domes, spires, and even weapons were fashioned with great care and sophistication. The Sith eventually formed three rival guilds that competed mercilessly for control of the craft of shaping sand into glass. It was not uncommon for such artisans to employ bodyguards to protect themselves from assassination attempts. The shikkar, a delicately crafted knife made from glass, was often used by the guilds to murder rival guild members. Meanwhile, the Keshiri became second-class citizens, and were even employed as servants and slaves of the Sith."}, {"tag": "p", "text": "By 3960 BBY, over a millennia after the arrival of the Sith, a stadium, the Korsinata, had been built in Tahv. The dangerous sport of rake-riding was held in the stadium, wherein Humans wrangled with uvaks whose wings had been clipped and fitted with glass prongs. In that year, an assassination attempt on Grand Lord Lillia Venn was made during a rake-riding event. The attempt failed, however, and resulted in the deaths of two of the Tribe's High Lords, Pallima and Dernas, as well as the framing of High Lord Candra Kitai and her daughter, Sith Saber Orielle Kitai, who were believed to be behind the attack. Candra was made to live and work in the facility—which by that time had come to be nicknamed by Orielle as \"the zoo\"—that had been built in honor of Korsin and the Skyborn Rangers."}, {"tag": "p", "text": "Venn was soon after killed, and the supporters of her regime were quickly ousted from Tahv. It soon became somewhat of a tradition amongst the Sith for one faction to subjugate Tahv and kill the Grand Lord, only to have the new rulers begin to turn on each other and have the process repeat. The Sith lore Caretaker Varner Hilts created the term \"The Time of the Rot\" for that period of time. From about 3,600 BBY to 3000 BBY, none of the Grand Lords lived in the capitol building, which fell into ruins and disrepair. Too, due to the frequent attacks and shifts in power, much of Tahv decayed into ruins. The streets began to decay and the aqueducts grew congested, causing spillage and collapses."}, {"tag": "p", "text": "Also, the Sessal Spire volcano became very active, and on one occasion erupted so powerfully that it collapsed part of the Korsinata. By 3000 BBY, Varner Hilts had a museum in Tahv that housed ancient maps of the deserted Sith Temple. On the Testament Day holiday in 3000 BBY, the Sith rediscovered the fact that their Human ancestors had been servants to a member of another species, Naga Sadow. The revelation caused many Keshiri to realize that the Humans were not the most important or powerful beings in the galaxy, and deadly riots broke out all over Kesh, including Tahv. During the riots, much of Tahv was ransacked, including Hilts' museum."}, {"tag": "h3", "text": "The Hilts Restoration"}, {"tag": "p", "text": "In 3000 BBY, the Caretaker Varner Hilts succeeded in reuniting the Lost Tribe of Sith by rallying them around the cause of reaching \"Keshtah Major\" or Alanciar (as it was called by the Alanciari Keshiri, a second continent which lay across the Western Sea from Keshtah Minor. Hilts had discovered a large map at the Kesh Sith Temple, which revealed the existence of this unknown continent. For the next twenty-five-years, the Tribe's chief engineer Edell Vrai experimented with long-distance uvak flights and boats before settling for airships, which were held afloat by hydrogen and propelled by uvaks. Grand Lord Hilts rebuilt the city's aqueduct system and also restored the Kesh capitol building to its former glory and splendor. It remained the residence of the Grand Lord and his Consort for the next millennia. Several thoughtcriers were also stationed in Tahv to facilitate long-distance communications across the continent."}, {"tag": "p", "text": "During the invasion of Alanciar in 2975 BBY, Grand Lord Hilts arranged for the Alanciari Keshiri signals officer Jogan Halder, who had been taken captive during Edell Vrai's reconnaissance mission to that continent, to be brought as a guest of the Tribe to Tahv. Hilts intended to conquer Alanciar without incurring heavy casualties on the side of the Tribe by winning over the \"hearts and minds\" of the Alanciari. Hilts wanted Halder and his Alanciari brethren to believe that the Sith were actually the Protectors. Thus, he staged a \"grand deception\" operation in Tahv which involved bringing the Tribe's most loyal Keshiri subjects onto the streets of Tahv to create a carnival atmosphere. These included artisans, painters, sculptors, musicians and singers who created the impression that the Keshiri living in Keshtah lived happy and carefree lives, as opposed to the militaristic drudgery of the Alanciari."}, {"tag": "p", "text": "Meanwhile, the Sith withdrew from public view to reinforce the impression that they did not lord over the Keshiri but rather stayed within the capitol building where they meditated in quiet contemplation. During his visit, Halder was greeted by many Keshiri who convinced about the benevolence of the Protectors. Hilts was then allowed to visit the Kesh capitol building where he found the Sith in quiet contemplation. He was then allowed to visit the Circle of Lords, which appeared to be an egalitarian council where no man or woman ranked above the other. While the Sith Lords acknowledged that Adari Vaal, the Herald of Kesh, had been right about the presence of the \"servants of Destructors\" among the Sith, they claimed that they had put down these \"evil ones\" one day after Vaal had left for Alanciar. Thus, the militarization of Alanciari society had been unnecessary."}, {"tag": "p", "text": "Jogan was also told that a servant of the Destructors known as Korsin Bentado had risen from among the Sith recently. Following his exile from Keshtah, this \"servant of the Destructors\" built airships and set out to conquer Alanciar. In reality, Korsin was a High Lord who had been tasked with leading the Ebon Fleet, the invasion fleet that would attack Alanciar. Hilts regarded the ambitious Korsin as a threat to his rule and had thus used the invasion as an opportunity to eliminate him, knowing full well about the military capabilities of the Alanciari. Finally, Jogan was told that Edell Vrai, the man who had kidnapped him, was a trusted friend of the Protectors who had come in search of Bentado and to make sure that the Alanciari did not serve the Destructors. Thus, the Sith were able to win over Jogan to their cause and he became their \"ambassador\" to the Alanciari. Following the defeat of Korsin, Jogan was able to convince the Alanciari about the benevolent intentions of the Sith and they submitted willingly to Sith rule."}, {"tag": "h3", "text": "The Return of Dreypa"}, {"tag": "p", "text": "That same year, the Testament of Varner Hilts was read for the first time on Testament Day. It replaced the older Testament of Yaru Korsin and explored the Tribe's Tapani origins and acknowledged their servitude to the Red Sith. As before, only Humans were allowed to attend the reading and the Keshiri were only allowed to read a censored version. In 2974 BBY, Hilts' daughter Takara Hilts pursued the Sith brigand and outcast Parlan Spinner into the Keshiri Burial Cairns beneath Tahv's Circle Eternal plaza. However, Spinner evaded capture and later attempted to assassinate Grand Lord Hilts during the Founding festival which commemorated the arrival of the Tribe on Kesh. This time, Takara Hilts foiled his plot and apprehended the \"Death Spinner\", who was brought before the Grand Lord himself. However, Hilts decided to spare Spinner's life and sentenced him to servitude aboard the Alanciari sailing ship Southern Star, which was captained by Captain Chegg."}, {"tag": "p", "text": "Later, Spinner allied himself with the ancient Sith Lord Remulus Dreypa, who he had freed from an oubliette after four millennia of suspended animation. While Dreypa was more preoccupied with reaching the stars, he agreed to lead a slave revolt against the Tribe and march on Tahv in order to overthrow the Tribe, whom he regarded as \"heretics\" who did not adhere to the Sith Code. However, his forces were routed at the Marisota Floodplain and the Sith Lord was forced to retreat to the volcano Sessal Spire where he unleashed leviathans, Sithspawn capable of draining the life energies of sentient beings. Prior to her death, the Doomed's leader Kaliska revealed that an ancient Jedi starship known as the Last Hope was hidden beneath the Circle Eternal. Spinner, who had abandoned Dreypa's cause, agreed to bring Takara's mother Iliana Hilts back to Tahv and to destroy the Jedi Starship before Dreypa could access it."}, {"tag": "p", "text": "In a bid to reach the stars, Dreypa gathered his Leviathans and they marched on Tahv. Much of the city was damaged and destroyed during the attack. Many buildings were destroyed and many of its inhabitants were killed. In response, the Tribe rallied all able-bodied Sith, Keshiri, freemen and slaves to defend their city. The Grand Consort Iliana Hilts led several Sith Sabers in the defense of Tahv while her husband Varner attempted to evacuate the capitol building's scrolls. One Leviathan breached the Kesh capitol building and attempted to devour Varner but was destroyed by Spinner, who had taken the Jedi Starship on a joyride above Tahv. During this joyride, Spinner accidentally destroyed the city's waterworks, disrupting Tahv's water supply. He then proceeded to destroy Dreypa's leviathans while Takara Hilts used Force lightning to kill Dreypa's last remaining Leviathan. Ultimately, Dreypa was killed when he was lured into the Jedi Starship, which was then sent on a one-way trip into the volcano Sessal Spire. Following the demise of Dreypa, Tahv's buildings were rebuilt and Spinner was admitted into the Tribe as a Grand Lord's Hand."}, {"tag": "h3", "text": "Evolution and destruction"}, {"tag": "p", "text": "In 37 ABY, a month-long festival, Presentation, was held in Tahv. This festival had several attractions: it gave the Keshiri a chance to join the Lost Tribe of Sith, and also held a competition for the Tribe's younger members to obtain an uvak. By 41 ABY, the class differences between the Keshiri and the Sith had begun to narrow, and several Keshiri held high positions in the Lost Tribe of Sith—at least one was a member of the Circle of Lords. In that year, Ship, a Sith Meditation Sphere, arrived on Kesh to assist in the training of the Tribe's apprentices. It also helped the Tribe begin to form its own armada, with the intent of waging war on the galaxy. As the Sith built up their armada, a spaceport was constructed in open land just outside of Tahv. In 43 ABY, Jedi Grand Master Luke Skywalker touched an Aing-Tii relic known as the Codex, causing his presence to be magnified and his name called through the Force to members of the Tribe. In response, the Tribe recalled their armada back to Kesh, and held an emergency meeting at the Circle Chambers in Tahv. It was during that meeting that Ship abruptly left Kesh, to follow the call Skywalker created through the Force."}, {"tag": "p", "text": "The Sith eventually allied themselves with Skywalker and his son, Ben, in hopes of learning more about Abeloth—the powerful dark side entity that had called Ship away from Kesh and remained in control over the Meditation Sphere. however, while viewing the Pool of Knowledge, a powerful Force nexus on Abeloth's planet, Ben Skywalker saw a vision of Tahv in the Pool. Sith Saber Gavar Khai feared that he was attempting to learn the location of the Sith's homeworld, and a duel broke out. Soon afterward, Abeloth contacted Khai in hopes of forming an alliance with the Sith. As Khai and Abeloth arrived in orbit, Grand Lord Darish Vol called for a meeting of the Tribe in the Circle Chambers in Tahv. After debating the matter, Vol decided to accept Abeloth's bid for an alliance, and told Khai that they would need three days to prepare a celebration for Abeloth."}, {"tag": "p", "text": "For the celebration, the city was adorned with myriad decorations such as fireglobes, and the Sith acquired as many special possessions as they could, including new shikkars, imported valuables from other worlds, and special clothing. Abeloth's arrival was attended by many members of the Tribe, and she was greeted personally by Vol. A large parade through the city's streets accompanied her arrival, consisting of the shumshur beasts of burden as well as hoversleigh. That evening, Abeloth staged a mental attack on Darish Vol. He fought back and forced her to flee from his mind, although he was left very weak. Vol called for his aide, Revar, to warn the city of her betrayal, but it was too late. Abeloth herself was also weakened, and in her frustration she unleashed waves of Force energy upon the city. The beings who were near her imploded from the energy, while others who were farther away had their bodies ripped apart. The city itself was severely damaged in the attack—pieces of glass and weapons were sent flying while the buildings collapsed and much of the City of Glass was consumed in fire. Abeloth then fled in Ship, while those Sith loyal to Khai fled with her. Soon afterward, the entire city was deserted by its residents."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The city of Tahv was originally occupied only by the indigenous Keshiri people. When the Sith arrived on the planet, they discovered the Keshiri and allied themselves with the native species, and the population of Tahv grew to include these newcomers as well. The Sith became dominant over the Keshiri; and, quickly taking control of the planet's government itself, they became the first-class citizens, with the native species dropping to a lower social status, often serving the Sith as slaves and servants. By 41 ABY, however, the status differential had narrowed. In 44 ABY, Abeloth's attack on Tahv left the city in ruins with thousands of its citizens killed, and it was soon afterward vacated."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Circle"}, {"tag": "p", "text": "The Circle was an area of Tahv that lay in the center of the city. It was known for its many artistic landmarks, as well as being very luxurious. Far more appealing than the outer areas of the city, where the poorer inhabitants lived, the Circle was the home of the wealthier citizens. It was in the Circle that the capitol building stood, and the planet's seat of government, the Circle of Lords, ruled from the Circle Chambers there."}, {"tag": "h3", "text": "Capitol building"}, {"tag": "p", "text": "The capitol building was a large, glass-domed building located in the center of a cluster of buildings in the Circle. The capitol's interior was dim and cool; and it had stone floors as well as a fountain of water. The building was several stories high, and the Circle Chambers were located in the upper levels. They were accessible via several flights of winding stone stairs. The office of the Caretaker was also located in the capitol building. During The Time of the Rot, the Tribe kept time by using Sandpipes in the capitol building."}, {"tag": "h3", "text": "Circle Chambers"}, {"tag": "p", "text": "The Circle Chambers, made of glass, was a large room located in the highest levels of the capitol building in Tahv. The ceiling of the hall was composed of a stained-glass dome. It was in this chamber that the Circle of Lords held council. The Lords were seated upon a raised dais, with the Grand Lord, who presided over the Circle of Lords' meetings, sitting on a throne made from metal and glass. Seated beside the throne were the High Lords, and beneath them were the Lords and masters."}, {"tag": "h3", "text": "Circle Eternal"}, {"tag": "p", "text": "The Circle Eternal was a plaza in Tahv where a council of Neshtovar—Keshiri uvak-riders, and the planet's governing body before the arrival of the Sith—held council. Located in the Circle Eternal was a tall column that served as a sundial. A meeting was being held in this plaza when the Omen crashed in the nearby mountains. A later meeting was held with the newly-arrived Sith, still believed to be the Skyborn, during which it was decided for a temple to be built in the Takara Mountains. Twenty-five years to the day after the Sith's arrival, a gathering of celebration took place in the plaza."}, {"tag": "h3", "text": "Korsinata"}, {"tag": "p", "text": "The Korsinata was a sports stadium located in Tahv. The stadium boasted a pentagonal field and several boxes that housed high-ranking members of the Sith Tribe. The dangerous sport of rake-riding—wherein humans wrestled with uvaks whose wings had been clipped and fitted with glass prongs—was held in the Korsinata. One side of the Korsinata crumbled after a major eruption from the Sessal Spire during The Age of the Rot."}, {"tag": "h3", "text": "\"The zoo\""}, {"tag": "p", "text": "A facility nicknamed \"the zoo\" by Sith Saber Orielle Kitai was used to house the wild animals of Kesh. Constructed sometime after 4,975 BBY in honor of Nida Korsin and her Skyborn Rangers, it housed a variety of predatory species. Although the Sith had killed those species for sport by 3960 BBY, the structure remained in use as a home for the Tribe's uvak. After being framed for an attack on Grand Lord Lillia Venn, former High Lord Candra Kitai was enslaved and made to live in the facility and shovel manure in its stalls."}, {"tag": "h3", "text": "Tahv spaceport"}, {"tag": "p", "text": "A spaceport was located in the open stretch of land just north of Tahv. Work began on the facility soon after the Sith Meditation Sphere Ship had arrived, and a basic spaceport was created with the help of the vessel. As the Tribe's armada expanded to include hundreds of ships, the spaceport became more and more active. In 44 ABY, the spaceport saw the arrival of Abeloth in Ship. When Abeloth unleashed her fury upon the city, the spaceport was only marginally damaged, and vessels were still able to land and launch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The city of Tahv was created by author Christie Golden for her first Star Wars novel, Fate of the Jedi: Omen, the second novel in the nine-part Fate of the Jedi series. Tahv was first identified as the \"City of Glass\" in Fate of the Jedi: Ascension, the eighth Fate of the Jedi novel, also by Golden. The city has also been featured in John Jackson Miller's Lost Tribe of the Sith eBook series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}