{"url": "Takodana", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:The Interior planets", "Category:Shadowports", "Category:Takodana locations", "Category:Tashtor sector planets", "Category:Western Reaches planets"], "nodes": [{"tag": "h1", "text": "Takodana"}, {"tag": "p", "text": "Takodana was a planet located in the Mid Rim, though it fell in the southwestern region of the galaxy known as the Western Reaches."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Covered in an abundance of lush forests and dotted with small lakes, Takodana, located on a hyperspace route between Chalcedon and Noe'ha'on, was a popular departure point that offered easy access to trade routes that connected the Inner and Outer Rim. For those heading outwards toward the galactic periphery, the planet was seen as a last taste of civilization, while those heading Corewards saw it a last grasp of frontier living. Travelers found the planet's neutrality and distance from galactic politics appealing, and as a result Takodana became a haven for fugitives, smugglers, and explorers. Takodana was known as the longtime home of Takodana Castle that served as an open port to spies and dubious travelers alike. The world was connected to the Ring of Kafrene mining colony by the Biox Detour hyperspace route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Thousands of years prior to the conflict between the First Order and the Resistance, a battle between the Jedi and Sith occurred on the planet. Maz Kanata's castle would eventually be built over the ancient battleground."}, {"tag": "p", "text": "A year after the execution of Order 66, Ahsoka Tano considered Takodana as a place to lie low after helping an attempted insurgency, during which she revealed herself as a Force-sensitive, on the moon Raada. However, she decided there were too many unknowns to staying on Takodana, electing to travel to the world of Thabeska, where she had lived prior to arriving on Raada, instead."}, {"tag": "p", "text": "Prior to being arrested on a ship in the Five Points system, Jyn Erso spent almost a year on Takodana after bouncing around the Mid Rim on planets such as Cerea and Coyerti."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, Takodana was the meeting place of Han Solo, Rey, and Finn with Kanata and her associates. While at the castle, Rey uncovered Skywalker's lightsaber, which called out to her in the Force. Not long afterward, their presence was reported to the First Order by Bazine Netal and a battle ensued between the Order and the Resistance, who had earlier been alerted to the presence of BB-8 by the undercover droid GA-97. Finn took up Luke Skywalker's old lightsaber and fought for a short time in the area surrounding Maz Kanata's castle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "The Force Awakens"}, {"tag": "p", "text": "Takodana was created for the 2015 movie Star Wars: Episode VII The Force Awakens. Director J.J. Abrams named the planet after Takadanobaba, a neighborhood in Shinjuku, Tokyo. Abrams stayed in a hostel in Takadanobaba the first time he visited Tokyo and named the planet as a nod to his favorite city."}, {"tag": "p", "text": "Landscape shots of the planet were filmed in the Lake District, in the northwest of England, UK, in July 2014. \"The landscape of Takodana\" is a digitally modified view from over Watendlath Fell (54°31′12.74″N, 3°05′56.36″W) looking north across a digitally enlarged Derwent Water, which is shown as contiguous with Bassenthwaite Lake (which it was, briefly, in December 2015 after serious flooding). The large mountain on the skyline to the right is recognizably Skiddaw, the fourth-highest summit in England."}, {"tag": "p", "text": "\"The Millennium Falcon arriving at Maz Kanata's castle\" is a view southwest across the face of Walla Crag (54°35′14.06″N, 3°07′12.50″W), which overlooks the town of Keswick. Maz Kanata's castle is digitally added to the real Derwent Water, and the fells of Cat Bells and Maiden Moor are clearly recognizable."}, {"tag": "p", "text": "The forest scenes for Takodana, where Rey first encounters Kylo Ren, were filmed at Puzzlewood, Gloucestershire, UK."}, {"tag": "h3", "text": "Other media"}, {"tag": "p", "text": "The planet Takodana also appeared in the 2016 non-Canon LEGO Star Wars: The Freemaker Adventures episodes \"The Test\" and \"The Kyber Saber Crystal Chase.\" Both episodes made use of plot elements from The Force Awakens including Maz Kanata and her castle. \"The Test\" also introduced Takodana's third moon, which was home to varactyls. The existence of Takodana's third moon was at variance with the 2016 Canon reference book Star Wars: Complete Locations, which stated that the planet did not have a moon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}