{"url": "Takara_Mountains", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Kesh locations", "Category:Mountain ranges"], "nodes": [{"tag": "h1", "text": "Takara Mountains"}, {"tag": "p", "text": "The Takara Mountains, known originally by the native Keshiri species as the Cetajan Mountains, were a mountain range on the remote Wild Space planet of Kesh. In 5000 BBY, during the Great Hyperspace War, a Sith starship, the Omen, crash-landed in these mountains. The survivors of the crash were stranded on the planet and eventually formed the Lost Tribe of Sith. They built a Sith Temple in the mountains, over and around the crash site of the Omen."}, {"tag": "p", "text": "Grand Lord Nida Korsin ordered the Sith Tribe to abandon the Temple in the mountains, an order that remained in effect for over a thousand years. In 3963 BBY, the Jedi Jelph Marrian crash-landed in the jungle highlands in the mountains; he lived among the Sith as a poor merchant who traded with the Keshiri, although Sith Saber Orielle Kitai eventually discovered the truth of his past. The two fell in love and moved to a new home in the jungle after Marrian's farm was destroyed in battle with the Grand Lord. By 41 ABY, the Sith had returned to the Temple and the mountains."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "."}, {"tag": "p", "text": "The Takara Mountains were a range located on the remote Wild Space planet of Kesh. Rocky, sharp, and ridged, they bordered one of the planet's oceans. Located within the mountains was a Sith Temple, built by a group of Sith that was stranded on the planet in 5000 BBY after their vessel, the Omen, crashed into the mountain range. The mountains were very steep, and the Temple was accessible only by air or by a hazardous climb up the slopes."}, {"tag": "p", "text": "The mountains were tall, rising high into the air; and some of them even accumulated snow on their tips. The slopes were covered in loose rock, although there were also clearings of grass in the lower areas of the mountains. At the base of the mountains were grassy foothills, and many of the mountains themselves were covered in a dense jungle—in which even most of the Sith did not dare venture. Although the majority of the mountains were not volcanic, by 3960 BBY there were still several active volcanoes among the range. The Marisota River also ran from the jungle highlands down to the lowlands below."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 5,000 BBY, during the Great Hyperspace War, a Sith warship, the Omen, was attempting to deliver a shipment of Lignan crystals to Sith Lord Naga Sadow when the vessel was knocked off course while executing a hyperspace jump. After coming out of hyperspace very close to the remote planet Kesh, it was forced to crash-land in the world's Takara Mountain range—then known as the Cetajan Range. The crash was witnessed by the indigenous Keshiri in the city of Tahv, and they believed it to be a volcanic eruption. The Keshiri took the eruption as a sign that their gods, the Skyborn, were angry at them because of the heretic teachings of geologist Adari Vaal. Vaal was forced to escape Tahv on the back of her uvak, Nink, and she took up refuge in the mountains, where she saw the wreckage of the Omen. Meanwhile, the Omen's captain, Yaru Korsin, dueled his brother, Devore Korsin, on the crash-site of the ship, over which of them would lead the Sith survivors. Yaru killed Devore by dropping him over the edge of a precipice into the ocean below."}, {"tag": "p", "text": "The survivors of the crash, who eventually formed a new Tribe of Sith, soon befriended the planet's native sentient species, the Keshiri, who believed the newcomers to be their gods and pledged themselves to service to the Sith. The Sith used the Keshiri to assist them in the construction of a new Sith Temple over and around the ruins of the Omen in the mountains. By 4985 BBY, the Cetajan Range had been renamed the Takara Mountains after Yaru Korsin's mother, Takara Korsin. Ten years later, another duel took place near the Omen's crash site in the Takara Mountains, in which Korsin and his nephew, Jariad Korsin, were killed. Yaru Korsin's daughter, Nida, then became the Tribe's Grand Lord."}, {"tag": "p", "text": "In memory of her father, Nida Korsin ordered the Sith to abandon the Temple in the mountains, so the Sith moved to Tahv—and the move remained in effect for generations after Korsin's death. As such, when the Jedi Jelph Marrian crashed in the jungle highlands in 3963 BBY, his presence was not immediately detected. Marrian began to live on a farm near the Marisota River, and although he eventually found the Sith, he masqueraded as a slave who traded with the Keshiri. Over time, he managed to recover his starfighter piece-by-piece from the jungle highlands, bringing it down from the mountains and hiding it near his home. However, in 3960 BBY, his past was discovered by the Sith Saber Orielle Kitai—who had recently fallen prey to a conspiracy that resulted in her being made a slave—and she quickly moved to reveal this information to the rest of the Sith as a way to ensure her reinstatement in the Tribe. Marrian intercepted her, however, and the two realized their love for each other. Upon returning to Marrian's farm, they battled the Grand Lord Lillia Venn and her Sith allies, killing them, but destroying Marrian's fighter in the process. Marrian and Kitai then left behind their old lives and moved to a new home in the Mountains."}, {"tag": "p", "text": "Eventually, the Sith returned to the temple in the mountains. The Sith Tyros often trained in the shadows of the mountains in the Sith Temple courtyard. In 41 ABY, a Sith Meditation Sphere known as Ship arrived on Kesh to make contact with the Tribe and help train their apprentices. It first spoke through the Force with Tyro Vestara Khai in the Temple courtyard, in the midst of the mountain range."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Takara Mountains first appeared as an unnamed mountain range in the eBook Lost Tribe of the Sith: Precipice, released on May 28, 2009. They were later named in Fate of the Jedi: Omen, author Christie Golden's first Star Wars novel and the second installment in the Fate of the Jedi series, released on June 23, 2009. The Mountains were then shown to be identified by the Keshiri as the \"Cetajan Mountains\" in the second Lost Tribe of the Sith eBook, Skyborn, and they have subsequently appeared in each of the eBooks in that series to date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}