{"url": "Takeover_of_Mandalore/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars", "Category:Battles of Mandalore", "Category:Changes of government", "Category:Conflicts involving the Death Watch", "Category:Conflicts involving the Shadow Collective"], "nodes": [{"tag": "h1", "text": "Takeover of Mandalore"}, {"tag": "p", "text": "In the year 20 BBY, the Mandalorian Death Watch allied with the Sith Lords Darth Maul and Savage Opress, launching a coup against the New Mandalorian government in an attempted takeover of Mandalore. Together, the Death Watch and the Sith assembled an army of criminals, from Black Sun and the Pyke Syndicate to the foot soldiers of the Hutt Cartels, all coming together as a coalition known as the Shadow Collective. In order to undermine the rule of the New Mandalorian leadership, the Collective's criminal element was ordered to attack New Mandalorian territory across Mandalore—including the New Mandalorians' capital city of Sundari—in order to sow panic and chaos, only for the Death Watch to arrive as rescuers, saving the people from the offworld attackers."}, {"tag": "p", "text": "The Shadow Collective's plans succeeded, and Pre Vizsla was able to dethrone the New Mandalorian leader, Duchess Satine Kryze, and replace her as Prime Minister and self-titled Mand'alor. However, Vizsla's ambitions led him to betray his Sith allies and have them imprisoned. While in prison, Darth Maul came across the former Prime Minister of the New Mandalorian people, Almec, and elected to use the disgraced leader to replace Vizsla. Breaking free of his incarceration, Maul stormed the Sundari Royal Palace with his apprentice and Almec in tow, challenging Vizsla to a duel for leadership. Honorbound, Vizsla accepted, and the two combatants fought ferociously through the throne room, but ultimately it was Maul who proved victorious, slaying Vizsla and taking his place as leader of Death Watch. Installing Almec as the new Prime Minister, Maul secured a puppet ruler to lead the New Mandalorians while keeping his presence in the background a secret to the populace at large."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While traveling through the galaxy, members of the radical Mandalorian splinter-faction known as the Death Watch came across a derelict escape pod drifting above the planet Florrum. Upon boarding the craft, Death Watch discovered the unconscious bodies of the Sith Lord Darth Maul and his apprentice Savage Opress; at the word of the group's leader, Pre Vizsla, the two Zabraks were brought aboard one of Death Watch's Kom'rk-class fighters—Vizsla's personal vessel, the Gauntlet—and taken back to the Death Watch's encampment on the swamp-covered moon, Zanbar. There, Death Watch attended to the Sith's injuries before Vizsla invited Darth Maul to talk, during which the two found they had a mutual enemy in the form of the Jedi Order, with Jedi Master Obi-Wan Kenobi equally despised by both men. Upon that shared animosity, Maul and Vizsla founded an alliance in pursuit of mutual benefit: the Sith would aid Death Watch in deposing Duchess Satine Kryze of the New Mandalorians, while Death Watch would assist the Sith in their plans to punish Kenobi for his actions against Maul a decade prior."}, {"tag": "p", "text": "Together, Death Watch and the Sith set out to assemble an army of followers, beginning their search at a fortress on Mustafar belonging to the leaders of a branch of the Black Sun crime syndicate. Negotiations with the syndicate branch's Falleen leaders were quick to sour, leading Savage Opress to kill them while Maul recruited the organization's Captain of the Guard, Ziton Moj, who authorized an alliance in the fallen leaders' stead. Back on Zanbar, with freshly gained supplies and a battalion of Black Sun foot soldiers in tow, Pre Vizsla and Maul were approached by Lom Pyke, leader of the Coruscanti spice-dealing Pyke Syndicate. Having caught word of Maul's intentions to raise a force of criminals, the Pykes moved to willingly join the growing assembly, and were readily welcomed by Death Watch and the Sith. With their newest allies, Death Watch set out for Nal Hutta, where Maul spoke before an assembly of the Hutt Ruling Council. The five assembled leaders of the Hutt kajidics responded hostilely to Darth Maul's demands and his refusal to offer any credits for the Hutts' services, ordering a team of bounty hunters—Sugi, Dengar, Embo, and Latts Razzi—and a cadre of Hutt servant soldiers to kill the offending visitors. The Sith and Death Watch forces overwhelmed the Hutts' minions and hired mercenaries, however, killing Oruba the Hutt and pursuing Jabba Desilijic Tiure to his palace on Tatooine, where Jabba and Gorga Desilijic Aarrpo agreed to join forces with Maul's criminal assembly at blasterpoint. The Hutt families contributed Nikto enforcers to the enterprise, and the Collective traveled back to Zanbar to make final preparations for the coup."}, {"tag": "p", "text": "Though Death Watch and the Sith now had an army with which to act, known in total as the \"Shadow Collective,\" tensions between Maul and Pre Vizsla began to emerge as the Sith Lord revealed his plans to use the Mandalorian homeworld of Mandalore as a power base from which he could conduct an underworld empire of his own. Vizsla's own ambitions extended no further than Mandalore and the downfall of the pacifist New Mandalorian regime, and so he began making preparations to betray Maul and his brother, Opress, once his goals were met. Likewise, Maul suspected Vizsla's inclinations toward treachery and began planning for the time when he would turn on the Mandalorian in kind. Despite their mutual misgivings, Maul and Vizsla assembled the leaders of the Shadow Collective on Zanbar, where they made plans to attack the New Mandalorians' domed capital city of Sundari with the Collective's criminal element, terrorizing the populace at the hands of Black Sun and the Hutt Cartel, before sending in the Death Watch to act as saviors against the invading gangsters. With their plans made and their troops mobilized, the Shadow Collective set out for Mandalore."}, {"tag": "h2", "text": "The takeover"}, {"tag": "h3", "text": "Peace under siege"}, {"tag": "p", "text": "Landing on Mandalore at the shipping docks of Sundari, under the guise of merchant vessels transporting shipments of spice, Pyke Syndicate thugs and Black Sun foot soldiers ambushed members of the New Mandalorian police force from shipping containers believed to be carrying the smuggled goods. The criminal contingent overpowered the police and customs officials, violently subduing and imprisoning the New Mandalorians and their droids in shipping containers, securing control of the docks. In Peace Park, in the shadow of the destroyed Memorial Shrine, Black Sun soldiers and Pyke gunmen under Ziton Moj opened fire on the crowd, killing police and civilians alike in an indiscriminatory manner aimed at causing panic. And at the Mandalore Banking Center, Lom Pyke led a team to attack and rob the facility, using the combat prowess and Force abilities of Savage Opress to carve through the police defenders and enter the bank."}, {"tag": "p", "text": "Within short order, the Shadow Collective's operatives had overwhelmed Sundari's defenders and overran Duchess Satine Kryze's forces throughout New Mandalorian territory across the desert regions of Mandalore in which the New Mandalorian people made their home. The concerned New Mandalorian citizenry gathered in the plaza outside of the Sundari Royal Palace demanding action, prompting Duchess Kryze to issue a statement to her people asking for calm in the face of the criminal attacks, and urging them to resist the temptation of violence. Amidst Kryze's entreaties to the public, the Death Watch appeared over the square, lead by Pre Vizsla. Though Kryze was quick to blame Death Watch for the attacks, Vizsla denied any wrongdoing and pledged his support to the people, decrying Kryze and her administration for its inability to protect the New Mandalorians. Winning favor with the angry crowd with his words, Vizsla and his cadre of Death Watch soldiers departed the palace to enact the second phase of the Shadow Collective's plan."}, {"tag": "p", "text": "A detachment of Death Watch soldiers struck at the Black Sun and Pyke gangsters holding the docks of Sundari, securing the area after arriving in force. The rogue Mandalorians freed the grateful hostages from their confines in the docks' shipping containers and apprehended the offworld criminals. Deeper into the city, Pre Vizsla's lieutenant and the Death Watch's Sergeant at Arms, Bo-Katan, engaged the foot soldiers of the Shadow Collective alongside her personal unit, the Nite Owls. Capturing the criminals with fibercord whips, the Nite Owls led the subdued horde of thugs away at blasterpoint while Bo-Katan assured the frightened citizens nearby that they would be safe now, assurances that were met with thanks and approval. Outside the Mandalore Banking Center, as Savage Opress and the Pykes fled the pillaged facility, Pre Vizsla confronted the Sith apprentice in a staged lightsaber duel as his troops secured the other thieves. Overcoming Opress before the eyes of the police, Vizsla disarmed his opponent and turned him over to the officers' custody."}, {"tag": "p", "text": "For their actions against the Shadow Collective, the people of Sundari were vocal in their praise of Death Watch, and with the popular support of the New Mandalorians, Pre Vizsla marched into the Royal Palace to confront Duchess Kryze. Refusing to allow her Royal Guard to engage the Death Watch intruders due to her strong pacifistic beliefs, Kryze peacefully submitted to Vizsla, conceding to the apparent will of her people. The deposed duchess was imprisoned along with her supporters in the New Mandalorian government, including Prime Minister Armatan, while Vizsla flaunted the captured leaders of the crime syndicates before Sundari's citizens as his prisoners and a symbol of his own worthiness to rule. Vizsla installed himself as the new Prime Minister, and took up the title of Mand'alor of the New Mandalorian people."}, {"tag": "h3", "text": "The Sith betrayal"}, {"tag": "p", "text": "Shortly after Pre Vizsla's rise to power, Darth Maul traveled to the Sundari Royal Palace to meet with the new Mand'alor and discuss the Shadow Collective's future. However, with his own goals already met, Vizsla turned on Maul and refused to aid the Sith Lord in moving against the other neutral systems over whom the New Mandalorian state held sway. Maul was captured, and shown off to the people of Sundari as the last of the criminal element that had attacked the New Mandalorian capital during a speech in which Vizsla revealed his intentions to remilitarize the New Mandalorian populace. Maul was then taken to prison, and jailed alongside his apprentice."}, {"tag": "p", "text": "Maul had expected Vizsla's eventual betrayal, and the Zabrak Sith had already planned to have Vizsla replaced by a more malleable servant. Freeing themselves from their cell, Maul and Savage Opress walked the prison complex until coming upon the incarcerated former Prime Minister of the New Mandalorian people, Almec. Deciding Almec would play favorably into his plans, Maul freed the disgraced politician, and departed the prison for the Royal Palace. Storming the throne room with Opress and Almec at his back, Maul issued a challenge to Vizsla of single combat, with the winner assuming the right to lead. Honorbound by the ancient warrior codes he sought to revive, Vizsla could not refuse the challenge and, drawing his heirloom Darksaber, engaged Maul in a duel. The two combatants fought fiercely, with Vizsla employing every tool and weapon with which his Mandalorian armor was equipped—from jetpack and flamethrower, to blasters and a fibercord launcher—but ultimately it was Maul who emerged victorious. Defeated, Vizsla was slain by Maul, who claimed the fallen warrior's Darksaber and his leadership over Death Watch. Yet while much of the radical Mandalorian faction knelt before their new leader, Bo-Katan and a number of other soldiers refused to serve a non-Mandalorian leader, fleeing the palace under heavy fire from those who were loyal to Maul. With Vizsla gone, Darth Maul reinstated Almec as Prime Minister, a puppet ruler who served Maul in secret while providing the people with a public face of leadership."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon his return to office, Prime Minister Almec addressed the people of Sundari, informing the citizens that Pre Vizsla was dead as he blamed Duchess Kryze for his murder. Almec also stated that it had been Vizsla's last wish that Almec succeed the Death Watch leader as Prime Minister, and decreed that the New Mandalorians would indeed re-embrace the Mandalorian warrior traditions. On the order of Darth Maul, Almec set out to assemble a new hand-picked administration, and maintained Mandalore's neutrality in the Clone Wars."}, {"tag": "p", "text": "The deposed former duchess, Satine Kryze, was able to briefly escape jail with the aid of her estranged sister Bo-Katan, and nephew Korkie Kryze, managing to send a message to the Jedi Temple on Coruscant with word of the Shadow Collective's takeover before being recaptured. At the news, Kryze's former lover Obi-Wan Kenobi traveled to Mandalore in an attempt to free Kryze—unknowingly doing as Maul had planned—only for his efforts to fail. The Jedi Master was captured and taken before Maul, where Kryze was stabbed and killed in front of Kenobi in revenge for Kenobi cutting the Sith Lord in half and leaving him for dead ten years prior. Though Maul intended to have Kenobi imprisoned so that he would be forced to live hopelessly with his grief, the Jedi Master was rescued by Bo-Katan and escorted out of Sundari amid a violent struggle between the Mandalorian super commandos loyal to Maul and Bo-Katan's forces. Kenobi was rushed offworld aboard a Kom'rk fighter, while the Dark Lord of the Sith, Darth Sidious arrived in Sundari to engage his former apprentice, Darth Maul. Maul and his own apprentice, Savage Opress, faced off against his former master, but Opress was eventually slain and Maul subdued by Sidious' powerful Force lightning, though Maul was spared in order to serve the Dark Lord's own future purposes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Shadow Collective's takeover of Mandalore first appeared in Star Wars canon in The Clone Wars: Darth Maul: Shadow Conspiracy, a young-reader novel published by Scholastic on January 1, 2013. The novel adapts the events of four episodes from the fifth season of the television series Star Wars: The Clone Wars, including \"Revival,\" \"Eminence,\" \"Shades of Reason,\" and \"The Lawless.\" The later three episodes of this four-part story arc depict the planning and execution of the takeover. The thirty-fourth issue of the Star Wars: Build the Millennium Falcon magazine, published by De Agostini in 2014, officially identified the conflict as the \"Takeover of Mandalore,\" though other sources illustrate that the Death Watch's coup only secured the sect localized control."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}