{"url": "Tal_Anavere", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance Intelligence members", "Category:Criminals", "Category:Females", "Category:Ho'Din"], "nodes": [{"tag": "h1", "text": "Tal Anavere"}, {"tag": "p", "text": "Tal Anavere was a female Ho'Din with an abiding passion for art. Alive during the Galactic Civil War, Anavere witnessed the Galactic Empire's policies crushing free expression in numerous star systems, particularly among primitive cultures for whose art she bore a particular affinity. Those policies led Anavere to revile the Empire and drove her to support the Alliance to Restore the Republic. Anavere established herself as an art dealer who traded pieces created by important members of the Imperial bureaucracy. She used her influence with such clients to extract intelligence that she passed on to the Alliance. In the period between the battles of Yavin and Endor, Anavere had begun to use addictive Ho'Din herbal teas to exert greater influence over her marks. The technique raised some concerns for General Airen Cracken of Alliance Intelligence, but he allowed her to continue working for the Alliance due to her ongoing effectiveness."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tal Anavere was a female Ho'Din, born around the year 70 BBY. She developed a passion for galactic art, with a particular affinity for artworks from pre-technological civilizations. Under the regime of the Galactic Empire, Anavere witnessed the artistic traditions of primitive cultures in many star systems curtailed or destroyed by Imperial slavery or domination. Believing the policies of the Empire crushed freedom of expression, Anavere became a con artist, gambler, and thief, eventually affiliating herself with the Alliance to Restore the Republic."}, {"tag": "p", "text": "As a Rebel operative, Anavere operated as an art dealer and specialized in trading artworks created by important members of the Imperial bureaucracy—there being no market in the Empire for her preferred, pre-technological art forms. Many of those Imperials, jaded by the experience of individuals purchasing their art simply to curry favor, came to trust Anavere as she made them feel their works were being purchased by individuals with a genuine interest in the pieces. Anavere used her positions of trust to gather intelligence for the Rebel Alliance, but she also took more direct action to remove bounties placed on Rebel heads and arrange amnesties. Anavere avoided reprisals from the Empire by utilizing multiple aliases, erasing records of her previous activities and, on occasion, faking reports of her own death."}, {"tag": "p", "text": "In the period between the Battle of Yavin in 0 ABY and the Battle of Endor in 4 ABY, Anavere established an art gallery, \"Sophistication,\" on Obroa-skai, a planet known for its massive library database. She also began using slightly addictive blends of Ho'Din herbal teas on her Imperial marks to increase her influence over them. That technique came to the attention of Airen Cracken, a general and member of Alliance Intelligence. Cracken was one of several high-ranking Alliance members who expressed reservations over Anavere's use of herbal teas; however, Cracken respected her abilities enough to include a file on the Ho'Din in his datafile on useful Alliance operatives."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tal Anavere was a Ho'Din, a reptilian sentient species native to the planet Moltok in the Atrivis sector and distinguished by tresses of vibrantly-colored head tendrils. Anavere lacked morals and had little respect for sentients, whether alive or dead; her sole concern was for art. Her passion for art eventually spawned a hatred for the Galactic Empire, as she witnessed numerous examples of free expression crushed by its policies. However, when dealing with Imperial clients, Anavere was effective in hiding that emotion, and she was able to convince many Imperials that their talentless artworks were genuinely appreciated. The Ho'Din was described as a \"very unpleasant being\" in her Alliance file, but despite that, Cracken continued to sanction her activities."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Anavere was knowledgeable about different cultures, art, and herbal medicine, and was skilled enough botanically to cultivate addictive strains of herbal teas. The Ho'Din was a gifted bargainer, con artist, and gambler, and was adept at knife fighting."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In addition to operating her own art gallery, Anavere possessed a datapad containing information on galactic art history, a deck of sabacc cards, a jeweled Rodian ceremonial dagger, and a collection of herbal teas. On at least one occasion, Anavere wore a loose-fitting, light-colored dress and a scarf."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tal Anavere was created by Chuck Truett for the 1994 West End Games publication Cracken's Rebel Operatives, a supplement to Star Wars: The Roleplaying Game. An illustration by Mike Vilardi accompanied her one-page entry in the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}