{"url": "Takara_Hilts", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Police", "Category:Sith in the Lost Tribe of Sith"], "nodes": [{"tag": "h1", "text": "Takara Hilts"}, {"tag": "p", "text": "Takara Hilts was a Force-sensitive female Human from the Lost Tribe of Sith which ruled the planet Kesh. The Tribe were the descendants of Humans from the First Sith Empire who had become stranded on Kesh during the Great Hyperspace War in 5000 BBY. She was the daughter of Grand Lord Varner Hilts and Iliana Hilts. As with most of the Lost Tribe, Takara lived on the continent of Keshtah Minor. Due to her parent's high social status in Keshiri Sith society, Takara enjoyed a privileged childhood as a Sith princess. By 2974 BBY, she had become the Prefect of Police for the Tahv Constabulary, the Sith capital Tahv's main law and enforcement agency. Despite her privileged lifestyle and powerful connections, Takara became frustrated at her father's decision not to appoint his own daughter as his political successor. Due to the millennium-long Time of the Rot, her father Varner had devised a meritocratic system to reduce political infighting within the Tribe."}, {"tag": "p", "text": "As a Constable, Takara was tasked with bringing criminals and other enemies of the state to justice. One criminal who eluded her was the Human Sith anarchist Parlan Spinner, an outcast who waged a guerrilla war on the Lost Tribe that had persecuted his family for generations. His acts of vandalism and other criminal activities made him a perennial source of instability for the Tribe's leadership. By 2974 BBY, Takara and her father Varner had devised an elaborate scheme to trap and capture Spinner. Through an informant in Spinner's gang, the authorities learned that Spinner was planning to disrupt the festivities commemorating Yaru Korsin's discovery of Kesh and to kill the Grand Lord himself. In response, Takara took Varner's place in the sedan chair during the parades."}, {"tag": "p", "text": "As planned, Spinner and his associates surface only to be captured by Takara and her Constables. After executing his associates, Takara had Spinner brought before her father in order to decide his fate. Much to the dismay of Takara and her mother Iliana, Varner decided to spare Spinner's life and to give him a second chance. Spinner became a sailor aboard the Keshiri sailing ship Southern Star which was captained by the Alanciari mariner Captain Chegg. Dissatisfied with her life on Keshtah, Takara stowed aboard the same ship. Unknown to her, the Southern Star had been sent on a mission to explore Eshkrene, Kesh's frozen South Pole."}, {"tag": "p", "text": "While the ship's crew were exploring Eshkrene, Takara and Spinner attempted to escape only to be spotted and pursued by Chegg's men. At the end of the pursuit, the two Humans were cornered by their Keshiri pursuers who attempted to execute them. However, the Keshiri were slain by members of \"the Doomed\"—the descendants of an even earlier group of Jedi and Dark Jedi who had become stranded on Kesh following the Hundred-Year Darkness. The Doomed took the two Humans captive, and their leader, Kaliska, brought them into their settlement where she explained the origins of the Doomed. Following the Great Calamity on Kesh, the two rival Force orders had made peace and migrated to Eshkrene where they attempted to find a neutral balance in the Force."}, {"tag": "p", "text": "Takara and Spinner also learned about the \"Great Weapon,\" who turned out to be the ancient Dark Jedi Baron Remulus Dreypa who had been imprisoned within an oubliette. Spinner and the remaining Keshiri crew managed to escape Eshkrene and steal the \"Great Weapon.\" Takara and Kaliska pursued them and attempted to reason with Spinner. However, Spinner destroyed the oubliette and released Dreypa. Spinner and the Keshiri crew quickly sided with the ancient Dark Jedi and pledged their allegiance to him. Meanwhile, Takara and Kaliska were imprisoned within the Southern Star's hold."}, {"tag": "p", "text": "After several days of voyaging, the Southern Star reached the port town of Eorm. There, Dreypa managed to win the awe of the local peasants by killing the tyrannical Lord Galathos and the local Tribal garrison. Baron Dreypa desired to return to the wider galaxy and seek revenge on the Galactic Republic and the Jedi. However, he was willing to exploit Spinner and his Keshiri followers to attain these goals. Dreypa led a peasant uprising against the Tribe and marched on Tahv. He also intended to use the captured Sith princess as a hostage in negotiations with the Tribe. However, Takara and Kaliska managed to escape their captors and flew back to Eshkrene with Eorm's entire herd of uvaks—winged reptilians who were used as steeds by both the indigenous Keshiri and their Human Sith overlords."}, {"tag": "p", "text": "Back at Eshkrene, Kaliska succeeded in rallying the Doomed, who assembled for an invasion of Keshtah Minor in order to stop Dreypa. They flew to Keshtah Minor on a herd of uvaks. Meanwhile, Dreypa and his Sith quisling Spinner made some initial gains but sustained heavy casualties at the Marisota Floodplain. Dreypa's forces retreated to the volcano Sessal Spire and were pursued by the Tribe's forces led by Takara's mother, Grand Consort Iliana. After the failure of negotiations between the two parties, Dreypa awakened his Leviathan Sithspawn which dwelled within the volcano crater and unleashed them on both his former allies and his foes. At that point, Takara and the Doomed arrived and attacked Dreypa and his Leviathans."}, {"tag": "p", "text": "During the melee, Takara also encountered her old enemy Spinner and attempted to execute him. However, the two quickly formed an \"unlikely alliance\" after they were attacked by a Leviathan. Spinner managed to kill the Leviathan and to also rescue Takara's mother Iliana from being \"absorbed\" by one. The three Humans then fled the battlefield. Meanwhile, Dreypa regained the upper hand against the Doomed, and many of them were devoured and killed by his monstrous Leviathans, who also absorbed their knowledge. Dreypa then learned that the ancient forebears of the Doomed had hidden a Jedi starship beneath the Circle Eternal, the Tribe's royal palace on Tahv."}, {"tag": "p", "text": "Meanwhile, Kaliska caught up with Takara and Spinner, and revealed the existence of the Last Hope to the two Human Sith. In the end, Spinner agreed to return to Tahv with the debilitated Iliana on an uvak while Takara stayed behind to hold off Dreypa. Kaliska herself agreed to accompany Spinner so that he could destroy the Last Hope. However, Dreypa caught up with them and Kaliska was killed, wiping out the last of the Doomed. Spinner and Iliana managed to escape back to Tahv as planned, but the former reneged on his promise to destroy the Last Hope. Instead, he attempted to flee Kesh for good and escape into hyperspace."}, {"tag": "p", "text": "Meanwhile, Takara was captured yet again by Dreypa, who attempted to use her as a bargaining chip to force Spinner to return the Last Hope. Spinner was moved by Takara's plight and resolved to stop Dreypa once and for all. The young anarchist abandoned his plans to escape Kesh and instead returned to Tahv where he destroyed Dreypa's \"pet\" Leviathans. During the fighting, Takara herself managed to destroy one of the Leviathans by using Force lightning. At the climax, both Takara and Dreypa ended up on the hull of the Last Hope. Spinner \"handed\" the starship back to Dreypa and jumped into the Southern Ocean with Takara."}, {"tag": "p", "text": "However, Spinner had set the ship's autopilot on a one way journey to Sessal Spire and the Dark Jedi was killed during the collision. Following the elimination of Dreypa and his Leviathans, the former outcast Spinner was elevated to the status of a hero for saving Tahv from Dreypa's powers. Spinner was able to improve his social standing within the Lost Tribe and became one of the Grand Lord's Hands. Following their experiences, Takara and Spinner developed a romantic relationship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Takara Hilts was the sole daughter of Grand Lord Varner Hilts and Grand Consort Iliana Hilts, the rulers of the Lost Tribe of Sith, the Human rulers of Kesh. Her ancestors were descended from ancient Human slaves of the Dark Lord Naga Sadow who had become stranded on Kesh while delivering Lignan crystals—crystals used in the construction of lightsabers—to the Sith Empire during the Great Hyperspace War in 5000 BBY. Led by Captain Yaru Korsin, these Human settlers became the rulers of Keshiri society by claiming to be the fabled Protectors from an ancient Keshiri legend about the Great Calamity. Over the succeeding millennia, the descendants of these Human Sith came to occupy a privileged status on Kesh. Due to physiological differences however, the Humans and Keshiri were unable to mate. During the Time of the Rot, Kesh experienced significant civil infighting and upheaval as rival elements of the Lost Tribe fought for power following the disappearance of Grand Lord Lillia Venn in 3960 BBY."}, {"tag": "p", "text": "After nearly a millennia of warfare, Takara's father Varner assumed leadership of the Lost Tribe in 3000 BBY and ended the fighting. Hilts was a historian who had dedicated himself to studying the history of the Lost Tribe and had instituted a series of reforms known as the Hilts Restoration which sought to return to the system first instituted by Korsin. Hilts established a meritocratic power structure that allowed the Sith on Kesh to channel their ambitions without causing violence. To avoid the succession struggles of the past, Hilts made the position of Grand Lost an elected office rather than a hereditary post. Since the Human Sith were a demographic minority on Kesh, Varner stressed that the Tribe had to avoid civil infighting in order to survive. To reduce conflict within the Tribe, her father also sponsored a marine exploration program to explore uncharted lands and seas beyond the main continent Keshtah Minor. This led to the construction of a fleet of wooden sailing ships and the colonization of the continent of Alanciar."}, {"tag": "p", "text": "As a result of her father's policies, the Lost Tribe's marine explorers discovered the continent Alanciar, a new frontier that was rich in lumber and new lands to house Keshtah's surplus population. These enabled the Tribe to construct a large fleet of wooden sailing ships to enable further maritime exploration efforts. The Doomed—the descendants of stranded ancient Jedi and Dark Jedi that had caused the Great Calamity millennia earlier but had since relocated to the frozen continent of Eshkrene in the South Pole—also observed these developments on Keshtah through ice mirrors created by the Force. In 3000 BBY, the Doomed had considered intervening in order to stop The Rot but changed their minds after Hilts managed to restore order to the Tribe. Takara was born at some period after 3000 BBY and presumably had a comfortable and privileged childhood due to her father's high social status. Meanwhile, her mother Iliana served as the commander of the Tribe's military forces which were constantly on the guard against various rebel elements."}, {"tag": "p", "text": "Since her father Varner believed that hereditary power led to greater corruption and instability, he took steps to ensure that power within the Tribe was not inherited. To avoid the problems of nepotism, Varner did not favor his daughter Takara by appointing her to powerful positions. Instead, he encouraged her to start from the bottom and her work her way to the top. When she came of age, Takara joined the Tahv Constabulary, an internal security police force based at the Tribe's capital of Tahv. Over the years, the young woman rose through the ranks of the Tahv Constabulary to become the Prefect of Police, the highest ranking police position in her city. By 2974 BBY, Takara had apprehended and eliminated several local criminals and rebels. As with many other members of the Tribe, Takara was also proficient in lightsaber combat and wielded a red-bladed Sith lightsaber, one of her Tribe's specialties."}, {"tag": "h3", "text": "The \"Death\" Spinner"}, {"tag": "p", "text": "During her career in the Tahv Constabulary, one of her targets was the young Human anarchist and outcast Parlan Spinner, the leader of a gang of outlaws known as \"Spinner's Web\" who perpetrated a series of hit–and–run acts of mischief against the state including the attempted assassination of all local Keshiri cake decorators prior to the wedding fete of High Lord Nikoll and an attempt to fly a tethered airship into the southeastern aqueduct. He was the descendant of Ermon Parrah, the relief navigator aboard the Omen—which had brought the Tribe's ancestors to Kesh—and one of the earliest Humans to be cast out of the Tribe. As punishment for his role in trying to steal the Omen and return to the stars, Parrah and his future descendants were enslaved and ordered to spin a cord that would reach the stars in return for being re-admitted to the Tribe. They became known as the Spinner family and would labor for centuries in a desperate attempt to fulfill the command. Since it was physically impossible to achieve such a feat, Parlan's descendants were kept in a perpetual state of pauperism. However, the young Spinner rejected this fate and left Eorm, even dropping his first name and adopting the moniker \"Death Spinner.\""}, {"tag": "p", "text": "In 2974 BBY, Takara cornered Spinner while he was attempting to desecrate the Keshiri Burial Cairns, an extensive network of catacombs beneath the Circle Eternal, the heart of the Tribe's power base on Tahv. Takara wrote a report titled Enemy of the Order: The record of Parlan Spinner, vandal and would-be revolutionary where she concluded that Spinner was disdainful of traditional but had no political aim to his activities. His actions were not guided by a specific set of goals or coherent philosophy but were instead motivated by a desire to harass the authorities through \"minor acts\" of mischief. Since the Tribe regarded him as a low-level offender, her father Grand Lord Varner assigned the task of pursuing Spinner to Takara and her Constabulary guards. The elite Sith Sabers and Sith apprentices were instead used to quell armed rebellions and powerful Force-users who opposed the Hilts establishment."}, {"tag": "p", "text": "Through an informant in Spinner's gang, Takara learned that Spinner had planned to disrupt the annual commemoration of the Lost Tribe's arrival on Kesh. She presented her report to her father, Varner, who recommended capturing Spinner rather than executing him. Ultimately, the reformist Grand Lord chose to spare the youth's life by capturing him since he intended to give him a second chance in life as a mariner exploring Kesh's uncharted seas and lands. During the celebrations, Spinner and at least two other accomplices donned jesters' masks and deliberately walked into a parade by members of the Lost Tribe. Several Keshiri onlookers initially mistook them as being part of the celebration but their presence aroused anger from the Sith participants. One Lord scolded one of Spinner's accomplices for going too far by disrupting the Founding celebrations. Spinner himself managed to break free from several Constables, exclaiming loudly that only a fool would celebrate being stranded on what he labeled a \"festering lump of a world.\" Before the guards could stop him, Spinner discarded his mask and headed towards the sedan carrying Lord Hilts, deriding the man as the \"Head Fool.\""}, {"tag": "p", "text": "To the horror of his mates, Spinner unsheathed his dagger and jumped into the sedan while shouting that he was the \"Death Spinner\" and was tired of waiting. However, the sedan chair proved to be a decoy and the youth encountered Prefect Takara herself, the daughter of Varner Hilts. She used the Force to knock the dagger out of his hand. Surrounded by several constables, Spinner refused to concede defeat. As a finale, the youth threw a minlohku dart at a Keshiri constable, grazing his shoulder. However, Spinner was quickly overpowered by the constable's comrades. Still defiant, the youth attempted to goad the Prefect by exclaiming that they could not break his spirit because he was the \"Death Spinner.\""}, {"tag": "p", "text": "However, Takara Hilts retorted that she did not want to break his spirit but rather his body. She ordered her constables to rough him as part of the night celebrations. Spinner was taken to the palace of Grand Lord Hilts where he was beaten and roughed up by the constables for several hours. However, Takara ensured that her subordinates did not permanently maim or cripple him because her father Grand Lord Hilts had ordered that he be captured alive and brought into his presence. However, Spinner's accomplices were not so fortunate since the Grand Lord's wife Iliana had ordered their summary execution. She disagreed with her husband's decision to spare Spinner's life since she regarded him as an assassin. However, Varner insisted that he get to meet the youth for himself."}, {"tag": "p", "text": "At dawn, a beaten and disheveled Spinner was brought before Takara's father Grand Lord Hilts. He explained to Spinner that he had not been present at the celebrations because he had little interest in state functions which took away time from his research. Unlike his Sith compatriots, Hilts believed that time was more valuable than power since nobody had ever broken the chains of time. Spinner regarded Hilts as a stereotypical \"absent-minded\" professor who did not fit conventional definitions of a \"proper\" Grand Lord. Her father was examining a Keshiri tapestry which detailed the ancient history of the Keshiri people. Varner explained the historical origins of the Tribe and how their ancestors had gained lordship over the Keshiri by co-opting ancient legends of the Great Calamity and convincing the superstitious Keshiri that they were the ancient Skyborn."}, {"tag": "p", "text": "Spinner responded that this action sickened him because he believed that Sith should not want to protect but rather to destroy. The anarchist also managed to untie his bonds and attempted to strangle the Grand Lord from behind. However, Takara caught him in the act and hit him on the head with an ancient urn before he could carry out his attempted murder and escape. True to his absent-minded personality, Varner merely asked his daughter if that urn had belonged to someone important. Takara then revealed that further investigations had confirmed that \"Death Spinner\" was actually the vagabond and slave Parlan Spinner. Spinner then angrily responded that her tribe was to blame for casting out his families many generations earlier and reducing them to pauperism. He reiterated that they still remained Sith who could use the dark side of the Force."}, {"tag": "p", "text": "Takara, however, had little sympathy for the outlaw youth, dismissing him as a vandal who had earlier been convicted for attempting to desecrate the Keshiri Burial Cairns beneath the Circle Eternal. She described Spinner as an irreverent miscreant who would kill anyone for any reason. Takara's hostility towards Spinner was joined by her mother Iliana who chided her daughter for bringing an assassin into her husband's parlor, adding that Spinner should have been executed in the street along with his coterie. However, Lord Hilts was unconcerned and merely explained to the youth that killing him would be unwise since Spinner lacked the necessary qualities to succeed him as landlord. Hilts further lectured Spinner and his family about the complex power structure his ancestors had established to channel their ambitions, the destructive Time of the Rot, and finally his own efforts to restore the old order through his reforms."}, {"tag": "p", "text": "The uneducated Spinner remained unmoved by Hilt's words and commented that the current political order only benefited the elite while the masses remained powerless. Grand Lord Hilts sensed that Spinner was impatient but reiterated that he could be put to good use. Following the conquest of Alanciar in 2975 BBY, the Grand Lord had commissioned the construction of a new fleet of wooden ships as part of a program to explore new frontiers in the continent of Alanciar. His wife Iliana chided her husband for allowing his enemies to live since that would threaten the family's grip on power. Takara also privately disagreed with her father's decision to spare Spinner but accepted his decision and escorted Spinner out of the palace chambers."}, {"tag": "h3", "text": "Uncharted Waters"}, {"tag": "p", "text": "Lord Hilts ordered his daughter Takara to fly an uvak to the new docks west of Berav where she would find a Keshiri mariner known as the Southern Star that had just arrived from Alanciar. The ship's Keshiri captain, Chegg, was due to depart on a surveying mission. Varner instructed her to inform Chegg that the Grand Lord was sending Spinner to join his crew. However, Iliana still distrusted Spinner and told her daughter Takara to kill him if he created trouble again. At that point, Spinner realized that Varner and Iliana Hilts were the parents of Takara. He then expressed his surprise that the daughter of nobles of such high social standing was doing patrol work, which was considered a lowly occupation delegated to Keshiri. Takara then explained to Spinner that this policy reflected her father's idea that power in the tribe was not hereditary but was rather earned through merit. She explained that the Grand Lord was elected by the High Lords since it provided a safety valve that prevented competition between the various ruling families. Spinner mockingly asked whether Lord Hilts was protecting her or his \"precious tribe.\""}, {"tag": "p", "text": "Takara replied that she did not care but it was difficult to follow Sith principles because of her father's meritocratic policies. Spinner then took the opportunity to taunt the Prefect by commenting that he had written the tome on being thwarted but was still determined to use his new job as a sailor to advance his social standing. As a final parting, Spinner commented that Takara could enjoy being her parent's slave while he would be gaining riches as a mariner. Chegg was a hard and demanding task master who disdained the arrogant disposition of many of the Human Sith on Kesh. He took Spinner's employment as an opportunity to exploit the Human youth by assigning him with the task of manning the ship's sails and rigging. Chegg and took advantage of Spinner's employment to exploit the young Human. Most of the previous Humans he had encountered while working as a mariner had been slaves and criminals who had been cast out by the Tribe."}, {"tag": "p", "text": "Despite their initial hostility, Spinner and Takara were destined to cross paths yet again. Bored of her job as a Prefect in Tahv, Takara decided to start a new life on Alanciar as well. As a recently conquered Sith territory and a large continent rich in lumber and land, Takara thought that she could start a new life in the frontier and gradually assume control of the territory. She planned to stow aboard the Southern Star and then get off the ship once they had reached Alanciar. However, she was unaware that Lord Hilts had assigned Captain Cheggs with the task of exploring and surveying Kesh's frozen southern continent of Eshkrene, the site of the planet's south pole. The Southern Star was an exploratory vessel within the Lost Tribe's sea forces. Takara sneaked below the deck of the Southern Star and hid within a cargo box for several days. One day, Spinner was below deck sharpening his daggers when he encountered Takara, who had stowed aboard the ship. She explained that she had grown tired of working as a Constable and like Spinner, she wanted to start a new life in Alanciar. Upon going on the ship's deck, Spinner curtly revealed to the Sith princess that they were actually sailing towards the South Pole."}, {"tag": "p", "text": "At that point, Captain Chegg encountered Takara. Unaware of her true identity, he assumed that she was another Human castaway who had stowed aboard the Southern Star. He grimly reiterated that everyone who stepped aboard his vessel had a job to do and that stowaways were shirkers. Spinner attempted to speak up for Takara and tried to explain that she was someone important. However, Takara claimed that she was only another passenger. Due to the privileged status of Humans in Keshiri society, Takara insulted the Captain by telling him to watch his mouth since he was a Keshiri. However, Chegg was not amused by the Human girl's recalcitrance and reminded her that the only \"gods\" above his ship were the surveyors and straw bosses on his crew. Everyone else below those positions were indentured laborers. He then ordered his two Human charges to get to work, reiterating that since they were heading into uncharted waters he needed all hands aboard to make a landfall."}, {"tag": "p", "text": "Spinner and Takara were then sent to work on the sails and rigging. Due to the polar climate, it was hard work for the crew on the exposed deck. Growing tired of his labor, Spinner asked Takara why she did not tell Captain Chegg who she actually was since that could have gotten them back to warmer regions. Takara responded that her parents would not give her the advantage of her family name and stated that she would thus not use it to her own advantage. Due to his impoverished background, Spinner thought that Takara was wasting her power and privileges. The Sith princess then replied that he could make his own way while she made her own way. She then reiterated that she was a Sith and she had made up a plan. This plan would involve stowing back aboard the ship and sailing back to Keshtah while leaving the Captain and his crew behind. Upon landing on the frigid shores of the South Pole, Chegg and his surveying crew began unloading supplies and equipment. They planned to set up camp and then explore the region over the following days."}, {"tag": "p", "text": "Unhappy with his polar assignment, Captain Chegg dubbed the newly uncharted land with the derogatory nickname \"Frozen Pit.\" While there were several wild animals and trees, Chegg believed that the land had not sapient life and expressed his bemusement on why the tribe had wanted him and his crew to survey the South Pole. He instructed his men to set up shelters since there was a snow storm approaching. Meanwhile, Spinner and Takara attempted to sneak back aboard the Southern Star but were caught by the crew. For Chegg, this confirmed his initial suspicions that Spinner was trouble since the moment he had come aboard and he ordered his crew to kill the two \"mutineers\". After fighting off several of the Keshiri crew by using their Force powers, the two Humans headed towards the forest. Meanwhile, Chegg promised to give double rations to whoever killed the ringleader and triple rations if they were both caught alive."}, {"tag": "p", "text": "As they fled, Takara chided Spinner for ruining her plans by following her. Takara had panned to sneak aboard quietly and then kill the guards one by one. However, Spinner had wanted to spike the Captain and stressed that it was no use winning if their opponents did not get to see it. After breaking out of the forest, they headed towards a large hill where they stumbled upon the skeletons on a massive creature, which turned out to be a leviathan, a monstrous and gigantic Sithspawn from the Hundred-Year Darkness. Takara slipped and lost her lightsaber. By that stage, Chegg and his men had caught up with the mutineers and taken Takara's lightsaber. While the Keshiri lacked the Force abilities of the Human Sith, they knew not to lose their weapons in the snow. After disparaging the Human \"Protectors\" by claiming that they would die like Keshiri, he and his crew were about to kill the Humans when they were slain by arrows fired by several cloaked figures in the horizon."}, {"tag": "p", "text": "Takara attempted to fight off the strangers with her lightsaber bit was quickly disarmed by them. The leader quickly recognized Takara as the daughter of Grand Lord Hilts and ordered her followers to lower their bows and arrows. She and her companions then removed their cloaks and identified themselves as members of the Doomed, the stranded descendants of Jedi and Dark Jedi veterans of the Hundred-Year Darkness who had made peace and moved to the South Pole. Their leader was a S'kytri woman named Kaliska, and her followers included a male Wookiee, a male Ithorian, and a female Chagrian. She explained that her people shared Kesh with the Sith tribe before explaining that her were people were known as \"The Doomed\" and that the two travelers were now \"doomed\" as well."}, {"tag": "h3", "text": "Captives of the Doomed"}, {"tag": "p", "text": "Following the capture of Takara and Spinner, the Doomed also detained the remaining Keshiri crew at the shore and impounded the Southern Star. The Doomed were unwilling to allow their captives to go free since they would spread word to the Lost Tribe of their existence. Since they could not join the Doomed, Kaliska had planned to execute the entire party but first planned to talk to Takara and Spinner. The prisoners were taken to the main settlement on Eshkrene that was home to the descendants of the Jedi and Dark Jedi veterans. The settlement contained a large tower. While walking through the streets of the settlement, Spinner and Takara were surprised to encounter other individuals from different species including Rodians and Twi'leks. The Lost Tribe castaways had been predominantly Human and members of other species aboard the expedition had gradually died out through violent or natural means."}, {"tag": "p", "text": "They were also surprised by the lack of Keshiri slaves. Spinner correctly surmised that the Doomed themselves had built the settlement. Spinner also attempted to flirt with Takara, but the young woman rejected his overtures and reminded him to address her as \"Takara\" rather than \"Red.\" She also threatened to chop off his hand if he touched her again. However, Spinner commented that she did not have her lightsaber since their captors had taken it from them. Spinner also sensed that while the dark side was strong on Eshkrene, they could not feel it in the people. Takara merely replied that it was too cold for people to feel anything in the Force. However, she concurred that the inhabitants were null. However, both Humans sensed that there was power around them, and they wanted it. Takara then caught sight of a dagger being wielded by a Twi'lek member of the Doomed."}, {"tag": "p", "text": "The two Humans then attempted to escape from their captors. Spinner fought with several of the Doomed and even punched a Rodian in the head. Meanwhile, Takara attempted to flee back to the ship and alert the Lost Tribe about the presence of the Doomed. However, the two were quickly disarmed and separated. The winged Kaliska personally intervened and grabbed Takara by her arms, taking her on a flight of the city. The older woman reprimanded Takara for her actions and reminded her that Eshkrene was at peace. She then introduced herself as the leader of the Doomed and explained that the remaining Keshiri crew were already in their custody. Takara expressed her surprise that the winged S'kytri woman had used the Force to sweep her into her hands. Kaliska admitted she could use the Force but said that it gave her no joy to do so. After explaining the identity of the Doomed to both Spinner and Takara, she took them to the Hall of Regret, which contained the history of the Doomed."}, {"tag": "p", "text": "There, Kaliska explained to both Humans that they could not afford to allow the Tribe's explorers to find Eshkrene. However, she reiterated that they could not allow any harm to come to Takara or her \"protector,\" Spinner. Kaliska was then unaware of the poor relations between the two Humans, and Takara took that as an insult. Meanwhile, Spinner expressed his surprise at the vast amount of metal on Eshkrene and criticized his captors for wasting it on lanterns. The Twi'lek guard replied that while the light itself was not valuable, what was valuable was what the light that revealed. He explained that the lights were known as glowbacters and revealed images that had been sketched onto the ice murals on the walls. These murals documented the history of the Doomed. As a local custom, all members of the Doomed came every day or night to commemorate their original landing on Kesh during the aftermath of the Hundred-Year Darkness and the exile of the Dark Jedi into the Stygian Caldera. As the leader of the Doomed, Kaliska explained the historical origins of the community to her two Human captives."}, {"tag": "p", "text": "Following the defeat of the Dark Jedi at the Battle of Corbos which ended the Hundred-Year Darkness, the Dark Jedi had been exiled to Korriban, a world in the Stygian Caldera which was home to the red-skinned Sith species. There, these Dark Jedi established themselves as Sith Lords, dark side wielding dictators who ruled the Sith. Several of these new Sith rulers including the former Baron Remulus Dreypa decided that it was time to take their revenge on the Jedi Order and the weakened Galactic Republic. They then assembled a strike force, gathering their new armies and their twisted Sith beasts. Those Sith Lords left their recalcitrant brothers behind them and ventured out of the Calder. But Dreypa and his forces came across a Jedi patrol composed of Corbos veterans looking for the Exiles, to make sure that they were unable to try to seek revenge on the Jedi and Republic. After a pursuit across the galaxy, the Jedi and Sith ships crash landed on Kesh, where the space battle became a tremendous clash of lightsaber and Force-powers."}, {"tag": "p", "text": "Unable to call for reinforcements due to the strange magnetic field of Kesh, the Jedi and their former brothers fought with a unparalleled ferocity, devastating the planet by using all the weapons at their disposal. But, horrified by the extent of damage and the impact of their conflict on the planet and its inhabitants, both sides formed a truce and the Sith sealed, into one of his own oubliettes, their darkest weapon, Dreypa himself. Seeking atonement, the Jedi and the Sith dedicated themselves to find the true neutrality between the Dark and Light sides of the Force, settling at the south pole of the planet, in Eshkrene, where they formed a new community, \"The Doomed.\" For thousands of years, the Doomed and their descendants watched over Kesh and the Keshiri, mounting guard initially on the prison of Remulus Dreypa and later monitoring the influence of the Lost Tribe of Sith on Kesh."}, {"tag": "h3", "text": "The Great Weapon"}, {"tag": "p", "text": "After Kaliska had finished telling the history of the Doomed, Takara realized that the Doomed had been on Kesh far longer than the Tribe. She asked Kaliska if the Doomed had been spying on her people. Kaliska confirmed that the Doomed had been monitoring developments in other parts of Kesh through ice images. While the Doomed had considered intervening during the Time of the Rot a generation earlier in order to protect the Keshiri, they had ruled this out after her father Varner Hilts assumed leadership of the Tribe. Kaliska praised Varner Hilts as a wise man who had restored peace and order and thanked Takara on behalf of her father. Takara was however more critical of her father since she believed that he had done nothing for her."}, {"tag": "p", "text": "She also criticized Kaliska for expressing concerns about how the Sith treated the Keshiri and reiterated that her people had a privileged position on Kesh. At that point, Kaliska sensed that Takara had a strong sense of ambition and added that this trait was common among the Lost Tribe. Despite their initial differences, Takara came to respect Kaliska and to empathize with Doomed. By contrast, her enemy Spinner alienated his hosts by expressing his desire to use the \"Great Weapon\" while deriding the Doomed for not using it. Kaliska ordered her followers to confine Spinner with the sailing ship's crew. However, she allowed Takara to remain since the Sith princess expressed her interest in staying with the Doomed and learning more about them. When Spinner derided her for being a \"traitor\" to the Tribe, Takara responded that she wanted to find out more about the Doomed and remarked that the anarchist belonged in prison."}, {"tag": "p", "text": "After Spinner had departed, Kaliska and Takara left the Hall of Regret. Kaliska took the Sith princess on a tour of the Doomed's settlement which eventually took them to the local stables, which the S'kytri woman regarded as Eshkrene's \"greatest treasure.\" These farm animals were the descendants of ancient offworld livestock brought by the Jedi and Dark Jedi with some even coming from remote lands on Kesh that the Tribe had not discovered. Due to the harsh and cold conditions on Eshkrene, these animals were the main source of food for the Doomed. While Takara was initially disinterested in the animals, Kaliska taught the Sith to appeal to them by calming them through the Force. This Force ability was unknown to the Tribe who were unable to calm their uvak steeds, reptilian avians that served as the Tribe's main form of transportation."}, {"tag": "p", "text": "When Takara speculated whether she could use her new-found Force ability to calm the uvaks, Kaliska responded that she herself already knew the answer. Kaliska also reiterated her belief that all life on Kesh formed one system with all of its inhabitants living in symbiosis. Kaliska's comments about order saving everyone also strongly resonated with her father's worldview. However, their conversation was erupted by a loud horn. Kaliska and Takara quickly discovered that Spinner and the Keshiri crew had escaped from prison and stolen the \"Great Weapon.\" They had also stolen the Southern Star and sailed away while the city was still in morning meditation."}, {"tag": "p", "text": "An exasperated Kaliska regretted not destroying their sailing ship and ordered all warriors to be sent to the harbor. Takara quickly realized that Spinner was intending to use the \"Great Weapon\" to destroy her Tribe and convinced Kaliska that Spinner was never her friend but rather an enemy she had been pursuing for a few years. Takara and Kaliska agreed that they would fly to the Southern Star and attempt to reason with Spinner and the crew. The S'kytri woman then lifted Takara and flew her towards the coast. Despite their decision, Takara still felt that Spinner was unwilling to listen reason but expressed her desire to kill him."}, {"tag": "p", "text": "Shortly later, the pair caught up with the Southern Star, which was already sailing through the icy ocean. Takara and Kaliska landed on the ship's deck and confronted Spinner with Takara claiming that the \"Great Weapon\" had been sealed for a reason. However, Spinner disregarded her warnings and reiterated that he was no longer the Tribe's slave and thus did not have to take orders from anyone, least of all his former pursuer. Spinner claimed that there was no weapon he could not use and expressed his curiosity about the weapon that even the Jedi were afraid of. Despite Kaliska's objections, Spinner broke open Dreypa's oubliette with a hammer which unleashed a small explosion and a cloud of gas."}, {"tag": "p", "text": "Baron Remulus Dreypa emerged from the broken oubliette and proclaimed that he still lived despite spending four thousand years confined within his prison. Spinner and the Keshiri crew immediately pledged their allegiance and services to the ancient Dark Jedi. Outnumbered and unarmed, Takara and Kaliska were quickly taken captive by the crew and imprisoned below the Southern Star's hold. Unwilling to comprehend the ignominy of being a captive of her former prey, Constable Takara struggled against her captors and had to be restrained. By contrast, Kaliska did not resist her captors and instead entered into a state of meditation. During the voyage, Spinner managed to convince Lord Dreypa to spare his captives since Takara was the daughter of Grand Lord Hilts and could provide an important bargaining chip."}, {"tag": "h3", "text": "Escape to Eshkrene"}, {"tag": "p", "text": "After several days of voyaging, the Southern Star arrived at the port time of Eorm. During the voyage, Spinner briefed Dreypa about the existence of the Lost Tribe. While Lord Dreypa was more interested in returning back to the larger galaxy than taking over Kesh, he still agreed to put on a demonstration of his Force powers at Eorm. The sailing ship's arrival coincided with the local Sith Lord Galathos razing several houses in retaliation for the locals not meeting their quota of producing sailcloth material for the Tribal fleet. Dreypa intervened and killed Galathos and his men by calling down Force lightning upon them and the surrounding buildings. The Dark Jedi's display of Force powers awed the local population."}, {"tag": "p", "text": "Spinner initially viewed Dreypa as a liberator who would overthrow the ruling Tribal order. However, Dreypa was unwilling to fight for the rebels but offered to lead them so that they could avenge their former oppressors. Dreypa's spellbinding oratory awed the mixed crowd of Keshiri and Human outcasts who began arming for a peasant uprising against Tahv, the Tribe's capital. Both Takara and her new-found friend Kaliska were present. Takara personally found Lord Dreypa to be a charismatic and effective communicator. Kaliska agreed but warned that Dreypa's ability to organize a peasant uprising was nothing compared to his sorcerous powers which had once threatened Kesh's existence during the Great Calamity."}, {"tag": "p", "text": "Kaliska explained to Takara that Dreypa had been the dreaded weapon her ancestors had sealed within a device of his own making. Since they were unable to destroy it, they had guarded it for millennia. Since the oubliette had been broken, they were unable to imprison him again. The Doomed leader also warned the Sith princess not to underestimate Dreypa's powers and abilities. However, Dreypa overheard their conversation. He remarked to Takara that Kaliska was descended from the Dark Jedi forces who had betrayed him by imprisoning him within the oubliette. Dreypa explained that he had been able to survive and preserve his sanity through an ancient amulet."}, {"tag": "p", "text": "Dreypa also recalled that there was something he was looking for in the ancient past but could not remember what exactly it was. He asked Kaliska whether she knew if that knowledge was with her people in Eshkrene. Kaliska feigned ignorance and claimed that the Doomed were only concerned with the fate of the Keshiri natives. She added that while on Eorm, Dreypa would have to deal with the Human Lost Tribe. Dreypa then boasted that his ambitions were limitless and that the Tribe would serve him once he had shown them what it meant to be a \"true\" Sith. However, Takara angrily responded that Kesh was her people's world and that the Tribe would resist his insurrection."}, {"tag": "p", "text": "Lord Dreypa replied that he would willingly meet any challenge and vowed to kill her father, whom he mocked as a \"feeble fool\" who had been elevated as the leader of the Tribe. Shortly later, Spinner arrived with several lightsabers he had stolen from the Tribe's local guardhouse. Earlier, Dreypa had made a pact with Spinner and promoted him to the title of Sith Lord. Dreypa then ordered his men to bind Kaliska and Takara as prisoners since he intended to use the latter as a hostage for leverage. Dreypa then ordered Spinner to arm the rebels and to march on Tahv immediately."}, {"tag": "p", "text": "Takara then hatched an escape plan which involved stealing lightsabers under the guise of pretending to chat with Spinner. She confronted the anarchist over his decision to betray the Tribe. However, Spinner was unmoved and rejected the Tribe as his people and claimed that he was only working with Dreypa because he wanted to overthrow the Tribe. Takara then taunted Spinner by claiming that Dreypa would take the glory for himself even if they succeeded. While Spinner was preoccupied with their conversation, she stole two lightsabers from his knapsack. Before they parted, Takara insulted Spinner by telling him to scurry back to Dreypa's side and that he would always be a slave."}, {"tag": "p", "text": "Takara and Kaliska were then led away to the uvak stables by three Keshiri men armed with spears. The older woman Kaliska warned Takara not to waste her breath on Spinner and prophesied that he would betray everyone. Kaliska replied that she had not expected to change his mind and then unleashed her lightsabers on their captors, quickly killing them within seconds. The two women then headed to the nearby uvak stables which was home to Eorm's entire herd of uvaks. Kaliska had planned to fly the uvaks back to Eshkrene and bring the Doomed to Keshtah so that they could stop Dreypa's plans. Kaliska and Takara used the Force to calm the uvaks and to convince them to fly them back to Eshkrene. Kaliska explained to Takara that these reptilian avians were capable of flying much farther than the Sith knew."}, {"tag": "p", "text": "Takara and Kaliska then left Eorm with the town's entire herd of uvaks, depriving Dreypa's forces of an air force. After several days of flying, Kaliska and Takara arrived back at Eshkrene. There, Kaliska succeeded in rallying the entire population of the Doomed. Since they were facing a powerful Dark Jedi who in the ancient past had wrecked much death and destruction during the Hundred-Year Darkness, Kaliska gathered all members of her community for the mission. While this intervention would break their historic promise not to go to war near the Keshiri again, the Doomed believed they had a duty to preserve the peace on Kesh by stopping Dreypa at all costs. Kaliska was also aware that the Dark Jedi had hidden several monstrous Sithspawn known as Leviathans within Sessal Spire, a large volcano at the edge of Keshtah's southern coast overlooking the Southern Ocean."}, {"tag": "h3", "text": "From Foes to Allies"}, {"tag": "p", "text": "Meanwhile, Dreypa and Spinner led a revolt against the Lost Tribe. Despite initial successes at the Marisota Floodplain, Dreypa's forces were nearly wiped out by the Tribe's elite Skyborn Rangers, an air force consisting of uvak riders. Dreypa then ordered his Forces to retreat to Sessal Spire, intending to unleash his secret weapon and escape Kesh. After negotiations with the Tribal military commander Iliana Hilts failed, Dreypa summoned up several Leviathans which had been hibernating within the volcano. These monstrous Sithspawn quickly killed many Tribes member and rebel alike. Dreypa also abandoned his former lieutenant Spinner since he had outlived his usefulness to the Dark Jedi. In response, Spinner quit Dreypa's cause."}, {"tag": "p", "text": "In the midst of this feeding frenzy, Kaliska and the Doomed arrived at Sessal Spire. Doomed archers targeted the Leviathans' blister traps and attempted to avoid close quarter combat with the Sithspawn. Dreypa then unleashed Force lightning on the attackers. While Spinner was trying to sneak away from the battlefield, Takara caught him and flew her uvak towards him, slamming him to the ground. She then shouted that kick had been retribution for selling out his people to the Dark Jedi enemy. Spinner responded that the Tribe was not his people and tried to goad Takara by claiming that she was a slave of her parents. During the duel, he unsheathed several glass daggers while Takara activated her red-bladed lightsaber. However, Takara was able to dodge both his blades and she kicked him in the face with her boot, knocking him to the ground. After pinning Spinner down to the ground, Takara announced that the tribe had found him guilty and was about to execute the young anarchist with her lightsaber. However, Takara was distracted by the cries of her mother who was in the grip of a Leviathan."}, {"tag": "p", "text": "Takara quickly rushed away and attempted to save her mother by hacking at the monster's tendrils. However, she too was captured by the Leviathan. At that point, Spinner intervened and attacked the Leviathan. He used his daggers to puncture the beast's blister traps. A free Takara then threw her lightsaber to Spinner who then used it to slay the beast. Takara was shocked that her former enemy Spinner had willingly chosen to help her since she had been about to kill him. Spinner responded by claiming that while he was not interested in helping her, he had many ambitions for himself which did not involve the Leviathans destroying his society. While Spinner and Takara had managed to save the life of the latter's mother, she had been aged by the Leviathan. Iliana was no longer the middle-aged warrior queen but was now an old woman. Spinner explained that the Leviathans stole the life force of their victims but they had managed to stop it before it could finish its work."}, {"tag": "p", "text": "The Doomed were busy keeping the Leviathans preoccupied which allowed the three Humans to escape the battlefield before more Leviathan larvae hatched. Takara and Spinner then loaded the debilitated Grand Consort aboard an uvak. By that stage, Dreypa had gained the upper hand over the Doomed through the use of Force lightning and the Leviathans' awesome powers. One of his Leviathans managed to catch a Rodian member of the Doomed in one of its blister trap. Since the Sith Lord commanded the Leviathans, he was able to absorb their knowledge and quickly learned that the Doomed were the descendants of the Jedi and Dark Jedi who had imprisoned him within the oubliette. At that point, Dreypa recalled that his forebears had hidden a Last Hope beneath the Keshiri Burial Cairns in Tahv."}, {"tag": "p", "text": "The sole Sith survivors of the onslaught at Sessal Spire were Spinner, Takara, and Iliana. The S'kytri woman Kaliska was the lone survivor of the Doomed on Keshiri since all her brethren had been devoured by Dreypa's Leviathans. During their journey back to Tahv, Kaliska had a brief conversation with Takara and Spinner. Since Dreypa's Leviathans had been too strong for even the Doomed to handle and he was rapidly learning their secrets, Kaliska suggested that they combine their assault with the Tribe's remaining forces. However, Spinner dismissed that idea since he felt that the Tribe's leadership would have regarded her as a \"freakish\" alien in the same vein as the Leviathans. While Takara's mother Iliara could have led the Tribe's forces, she was in a debilitated state and had to be flown back to Tahv on her uvak. There, she hoped that the Tribe's sages could heal her."}, {"tag": "p", "text": "Kaliska suggested to Takara that as a Sith Princess she was in the position to lead her troops. She reminded Spinner and Takara that Dreypa had to be stopped since he would pose a threat to the wider galaxy if ever he escape offworld. Spinner then interjected at that point and asked the S'kytri woman if the \"business about the stars\" had not just been poetry. Kaliska replied that she was not interested in the Human youth since his actions had unleashed the threat of Dreypa. While she disliked Spinner for his opportunism, she expressed her surprise that he stayed with them. Spinner then asked Kaliska about an earlier comment she had made about her people not leaving even though they had the ability to use the Force. He and Takara had assumed that she had meant that the Doomed could not leave the South Pole. However, he concluded that they had not left the planet even though they had a starship."}, {"tag": "h3", "text": "The Jedi starship"}, {"tag": "p", "text": "Takara overheard Spinner's and Kaliska's conversation and asked Kaliska about the issue. Kaliska then confirmed that a single Last Hope had survived the Great Calamity for centuries but that her forebears had hidden it within the Keshiri Burial Cairns beneath the Circle Eternal, the center of the Tribe's government on Kesh. However, her forebears had preserved the spacecraft since destroying the vessel would have alerted the Lost Tribe to their presence. Now that Dreypa had finished extracting the memories of the slain Doomed members, the Sith Lord had recalled that there was a way offworld. In order to prevent Dreypa from taking the starship for himself and posing a threat to the Galaxy, Kaliska stressed that the vessel had to be destroyed. It had been the Doomed's last hope of escaping the planet but it would become dangerous if it fell into the wrong hands."}, {"tag": "p", "text": "Kaliska explained to the two Human Sith that she was unable to enter the chamber since it was too narrow for her large wings. Takara was reluctant to enter the catacombs since it would take days to get inside. However, Spinner had managed to enter the cairns within less than a day and was deemed the most suitable person for the job. As a grave robber in his earlier days, Spinner knew how to reach the Last Hope quickly. Takara then convinced him to also return to Tahv with both her mother and their uvak by presenting it as a chance for the former anarchist to redeem himself. While Kaliska was hesitant to trust the young man, Takara persuaded her to accompany Spinner and Iliana while the Sith princess herself remained behind to stop Dreypa. She remarked that as a Sith she was unwilling to let herself be controlled by fate. At that point, the group was attacked by one of Dreypa's Leviathans which had caught up with them."}, {"tag": "p", "text": "Spinner and Iliana were able to escape the scene on their uvak. Since the young man had never ridden an uvak before, he had to teach himself how to control the winged beast. Kaliska was unable to join them since she had been captured in one of the Leviathan's tendrils. Takara attempted to save her but it was too late since the beast had finished draining all her life energy and information. While Takara remained behind to delay Lord Dreypa, Spinner and Iliana arrived in Tahv. Having devoured the last remaining member of the Doomed, Dreypa learned that the Last Hope was located on Tahv. Since he was more concerned with getting offworld and exacting revenge against the Jedi and the Republic, he was willing to allow his Leviathans to devour Kesh. However, Takara overheard him and she confronted him, taunting him that Kesh would \"feed on him\" instead."}, {"tag": "p", "text": "The Sith princess ignited her lightsaber and stressed that Kesh belonged to the Tribe. She vowed to slay him and then bury him for good. Lord Dreypa taunted her by claiming that the Tribe had already sent its best forces after him and that she was the only one left. However, Takara retorted that she was the Tribe and that her Tapani forebears had broken their chains from earlier Sith despots. Finally, she vowed to break the Dark Jedi herself. Takara was referring to Yaru Korsin's Red Sith Purge which marked the Tribe's extermination of the last vestiges of Naga Sadow's Sith Empire. Despite her training and rhetoric, Takara proved no match for Dreypa who disarmed her and took her captive. He intended to keep the Sith princess as his hostage."}, {"tag": "p", "text": "By then, news of Dreypa and his Leviathans had spread to the Tribe's seat of power which caused much fear and panic among the population. The Tribe rallied all its forces including Sith, Keshiri, and even slaves to meet this new threat. While Iliana was brought by a court official into the presence of her husband Varner, who was shocked by the effects of the Force-induced accelerated aging process on his wife. After the tenders had taken the uvak back into the palace stables, Spinner took the opportunity to slip away and enter the burial cairns. Within minutes, he made his way through the catacombs and found the Last Hope. However, he reneged on his promise to destroy and instead activated its engines, intending to escape Kesh for good by heading into hyperspace."}, {"tag": "h3", "text": "Dreypa's Hostage"}, {"tag": "p", "text": "Following Spinner's escape, Dreypa used a holo-emitter to contact Spinner and delivered an ultimatum that the Sith outcast return the Last Hope or he would destroy the Tribal capital Tahv with his Leviathans. However, Spinner was initially unmoved and claimed that he did not care about the Tribe. Dreypa then presented the captive Takara Hilts who was being held in the grip of a Leviathan's tentacle. By reading the late Kaliska's memories, the Dark Jedi had discovered that Spinner secretly cared for Takara and realized that this was his weakness. Spinner tried to deny his affection towards Takara by claiming they were sworn enemies. However, Dreypa rejected Spinner's lies and commented that Kaliska's memories indicated that he had helped her mum."}, {"tag": "p", "text": "As one of the founders of the Sith Order, Dreypa was disgusted that the Tribe on Kesh had strayed from true Sith teachings and claimed that caring about other beings made one their slave. Dreypa then offered to trade Takara and her homeworld for the ship. He instructed Spinner to meet him at Tahv. Unable to withstand the ignominy of being defeated and taken prisoner a third time, an exasperated Takara claimed that she was nobody's weakness. While struggling to break free from her Leviathan captor, Takara angrily told Spinner to leave Kesh for good since nobody on Kesh knew or care about who he was. Takara's plight had an impact on Spinner and he decided to abandon his quest to explore the galaxy. Instead, he chose to destroy Dreypa's Leviathans and to free Takara from the Dark Jedi. Spinner then headed back to Tahv and asked the Last Hope's computer to give him a quick tutorial on operating the vessel's weapon systems and tractor beam projector."}, {"tag": "p", "text": "Dreypa's Leviathans damaged much of Tahv and forced the Tribe's Sith Sabers to retreat. Takara's mother Iliana led the beleaguered defense of the city while her scholar father Varner tried to salvage several historical documents. One Leviathan even broke into the Grand Lord's palace just as the scholarly Varner Hilts had begun efforts to evacuate the Tribe's prized tomes. The monster was about to devour the elderly Sith Lord when Spinner's Last Hope arrived over the palace. Spinner then used the ship's tractor beam projector to drag the Leviathan into the skies. He then used the ship's turbolaser cannons to destroy the beast. Spinner also used the starship's intercom system to announce to the Grand Lord that he had come to help the Tribe. Spinner then killed several of the remaining Leviathans by strafing them with his turbolaser systems."}, {"tag": "p", "text": "Lord Dreypa was furious when he saw his \"pets\" being wiped out by Spinner's Last Hope. Soon, the Sith Lord was left with only one Leviathan but Takara was still trapped in the beast's tentacle. Dreypa then ordered his Leviathan to leap on top of a tall building to meet Spinner and his starship. The Dark Lord repeated his ultimatum and threatened to murder the Sith princess. However, Spinner remained defiant and told the Sith Lord that he was \"going to send him back to his coffin in pieces.\" At that point, Takara took advantage of Dreypa's distraction and used Force lightning to attack the massive Leviathan, beheading the monster. As the beast descended to its death, she and Dreypa leapt onto the hull of the Last Hope. Realizing that he had both Takara and Dreypa onboard, Spinner took the starship on a fast spin to the Southern Ocean."}, {"tag": "p", "text": "Due to its advanced engine systems, the vessel reached the shores of Keshtah within seconds. Spinner then stopped the vessel and hovered over the ocean before opening the cockpit's canopy. He claimed that he was ready to deal with the Sith Lord and apologized for destroying his monstrous \"critters.\" He offered the Sith Lord the opportunity to leave Kesh for good in return for taking his deal to rule the planet. However, Dreypa threatened to kill both Spinner and Takara for the trouble they had caused him. Before he could kill them however, Spinner grabbed Takara and they jumped from the vessel into the ocean below. Spinner had earlier reset the ship's computer to take the vessel on a one-way course into Sessal Spire's caldera. To prevent Dreypa from changing the ship's course, he had the course program locked. As planned, Dreypa re-entered the ship's cockpit only to be trapped on a one-way journey to Sessal Spire."}, {"tag": "p", "text": "The doomed ship crashed into the crater which exploded in a fiery explosion. With that, Lord Dreypa perished and the ancient Dark Jedi's threat to the Lost Tribe was ended. However, the Last Hope, the only means of getting offworld on Kesh was also destroyed. This meant that no information about Kesh and the Lost Tribe reached the wider galaxy until the aftermath of the Second Galactic Civil War. Following the battle, Takara initially reprimanded Spinner for destroying the Tribe's only way off the planet. She also questioned Spinner on why he had chosen to destroy his only way offworld when he had the power to leave Kesh forever. Takara asked Spinner what sort of Sith her was. A cheerful Spinner merely responded that he was just a vandal who wrecked stuff. He also commented that his actions that day had saved Kesh and rightfully believed that his former oppressors would welcome him as a hero."}, {"tag": "h3", "text": "Two Hands"}, {"tag": "p", "text": "Following their experiences at the Siege of Tahv, the two former enemies Takara and Spinner developed a romantic relationship. The two Humans were subsequently rescued by the Tribe and brought back to Tahv. The former outcast Spinner was rapidly elevated to the status of hero for saving Tahv. His earlier indiscretions were conveniently forgotten and the grateful Grand Lord Varner even offered Spinner employment as one of his Hands, an elite spy. The Tribe also dispatched a second exploratory mission to Eshkrene to find out more about the enigmatic Doomed. All members of that Force order had perished during Dreypa's rebellion and little trace of their former settlement remained on Eshkrene. This led Lord Hilts to concur that their Force powers were the only thing protecting their city from the elements."}, {"tag": "p", "text": "During the reconstruction efforts in Tahv, Takara encountered Spinner and expressed her surprise that he had not been put in chains. By then, the Sith princess Takara had washed herself and changed into new garments. By contrast, Spinner remained in the same clothes he had worn for the past few days and had not cleaned himself. Spinner joked that he was lucky that the planet did not have enough metal to make chains and explained that he had been put in charge of the rebuilding effort. Takara commented that she was pleased he had found a new purpose in life."}, {"tag": "p", "text": "During a private conversation in the palace gardens, Spinner explained that the Grand Lord had offered him the position of becoming his new Hand but that he had to think about the offer. Hilts explained that her father had in the past offered her the same position but she had not opted for it. She also warned him about being careful in his dealings with the various Lords before suggesting that the youth pay attention to his personal hygiene by bathing himself. Spinner jokingly warned her to respect his new celebrity status as the hero who had saved Tahv. The young man was jubilant about his newfound opportunity of working for the Tribe, which would allow him to lift his own social status."}, {"tag": "p", "text": "Meanwhile, the two Hilts parents were observing the warm budding relationship between the two former enemies. The Grand Consort Iliana was still skeptical about appointing an outsider as his own special agent while overlooking their own daughter Takara. In response, Varner assured his wife that it was likely that both Parlan and Takara would become his own personal Hands. It can be assumed that Spinner and Takara would go on to develop a close romantic relationship and then marry, producing successors."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As with many Sith, Takara Hilts was driven by ambition and power. Despite her high social status as a Sith princes in Keshiri society, Takara was still unsatisfied with her job as a Prefect of Police, which she regarded as lowly. She initially believed that her father Varner Hilts' meritocratic power structure prevented her from fully realizing her power. This motivated her fateful decision to stow aboard an Alanciari sailing ship and start a new life on Alanciar, where she hoped to assume power over the place. Ultimately, this decision led her to cross paths with her enemy Parlan Spinner and set in motion a chain of events that would almost threaten the Tribe's existence."}, {"tag": "p", "text": "As a Human on Kesh, Takara enjoyed a privileged social status. She looked down on the indigenous Keshiri, a purple-skinned humanoid species that lived on Kesh. She attempted to use her species' status to bully the Alanciari Captain Cheggs. However, Cheggs was unmoved by her rhetoric and forced her to help Spinner to operated the sails since they were going to land on Eshkrene. Later, Takara was angered when the Doomed leader, Kaliska, questioned her people's treatment of the Keshiri."}, {"tag": "p", "text": "Despite her desire for power, Takara was more open to learning about the Doomed, the descendants of an earlier group of stranded Jedi and Dark Jedi who had landed on Kesh following the Hundred-Year Darkness. Through her friendship with Kaliska, Takara learned about the Doomed's origins and beliefs. She also learned how to use the Force to calm animals. Her warm relationship with Kaliska led her to sympathize with their cause which was centered around preventing the Dark Jedi Remulus Dreypa from escaping Kesh and posing a threat to the galaxy."}, {"tag": "p", "text": "Takara initially had an adversarial relationship with Parlan Spinner, a Sith outcast and anarchist who sought to overthrow the Lost Tribe. However, they became allies after Spinner saved Takara and her mother Iliana from being devoured by a Leviathan, an ancient Sithspawn. The two would then play a pivotal role in the defeat of Lord Dreypa, whose actions nearly destroyed the Lost Tribe. Their shared experiences led them to develop a romantic relationship following the defeat of Dreypa."}, {"tag": "p", "text": "Despite her ambitious nature, Takara still exhibited love and affection towards her parents and subsequently Spinner. Unlike other women, Takara disliked being dependent on other male protagonists to rescue her. As a constable, Takara regarded being taken captive by other persons as a great ignominy. On two occasions, she fought her captors and was successful on the second occasion when she managed to slay Dreypa's last surviving Leviathan."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Sith apprentice in the Lost Tribe of Sith, Takara was proficient with dark side powers like Force lightning. As with most other members of the Tribe, she was also competent in the art of lightsaber combat but was still no match for powerful Dark Siders like Remulus Dreypa. She also knew how to ride an uvak, a winged reptilian creature that was commonly used as a riding animal on Kesh. Under Kaliska's guidance, Takara learned to use the Force to tame animals."}, {"tag": "p", "text": "As the Prefect of Police in Tahv, Takara was skilled at police work, which she used to capture Parlan Spinner. As a member of the ruling elite, she was also well educated and regularly wrote reports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Takara Hilts was developed by John Jackson Miller as one of the two major protagonists of the Star Wars: Lost Tribe of the Sith comic series, which debuted on August 8, 2012. This five-issue comic series ran until December 12, 2012. She was illustrated by Andrea Mutti, inked by Pierluigi Baldassini, and colored by Michael Atiyeh. Along with the Lost Tribe outcast Parlan Spinner, she served as one of the two main point-of-view characters in the stand-alone series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}