{"url": "Tal_Merrik", "categories": ["Category:Canon articles", "Category:Confederacy of Independent Systems individuals", "Category:Death Watch members", "Category:Galactic Republic senators", "Category:Humans", "Category:Males", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Tal Merrik"}, {"tag": "p", "text": "Tal Merrik was a human male prince who represented his homeworld of Kalevala in the Galactic Senate during the Clone Wars, and served as a member of the Galactic Senate's Council of Neutral Systems. Merrik secretly worked alongside Death Watch, a group of Mandalorians who disagreed with the pacifist ways of the New Mandalorians, and sought to usurp Duchess Satine Kryze. Merrik's attempt on Kryze's life brought him into contact with Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, the latter of whom killed Merrik aboard the Coronet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Alongside Satine"}, {"tag": "p", "text": "A male human, Tal Merrik served his homeworld of Kalevala, a planet in the Mandalore system, in the Galactic Republic's Senate. However, in secret, Merrik was working with the Mandalorian terrorist organization known as Death Watch, and due to this, also the Confederacy of Independent Systems."}, {"tag": "p", "text": "Merrik was seen walking alongside Satine Kryze on Mandalore in the Sundari Royal Palace, during the time she greeted Obi-Wan Kenobi, an emissary from the Jedi High Council who was investigating rumors of Mandalorian involvement with the Separatists. He was also noticeably surprised when Kryze retorted against Kenobi, whose government accused her of treason against the Republic. Merrik attempted to speak to Kenobi and Prime Minister Almec before Kryze interrupted him and engaged in a battle of words with Kenobi. Kenobi revealed his mission was assigned by the Jedi Council, silencing Kryze, who had believed him to be on assignment from the Republic. Kryze and Kenobi then departed on a walk through the domed capital city of Mandalore, Sundari."}, {"tag": "h3", "text": "The Coronet"}, {"tag": "h4", "text": "Interrupting debates"}, {"tag": "p", "text": "Merrik later was present on the Coronet, a luxury starship used to take members of the Council of Neutral Systems to the galactic capital world Coruscant. Kenobi, Jedi Knight Anakin Skywalker and several clone troopers were also aboard as protection against a Death Watch threat. Merrik questioned the Duchess on how the Council would oppose the Clone Wars. Kenobi entered the room and entered a follow-up debate with Kryze on the merits of Jedi involvement in the war, before being interrupted by Orn Free Taa. Merrik and Taa agreed that both Kryze and Kenobi proved there were two sides to every dilemma."}, {"tag": "p", "text": "Later, Kenobi and Kryze continued their debate, which Merrik interrupted once more, stating that they could all use rest and refreshments. Kryze then promptly left the room, as the others, including Kin Robb and Onaconda Farr, observed in silence."}, {"tag": "h4", "text": "An interruption at dinner"}, {"tag": "p", "text": "Farr, Kryze, Robb, Merrik and Taa shared dinner, which included deep-fried nuna leg, aboard the Coronet. Kenobi entered the room and announced to the senators that the clones were investigating a disturbance below decks. Merrik observed as Kenobi received a call on his comlink that revealed a container had been opened and emptied. Inside the container were assassin probes, one of which was dispatched in the lower levels while a second had escaped up the elevator. The second assassin probe arrived at the dinner service quickly and prepared to attack the senators before Kenobi dispatched it."}, {"tag": "p", "text": "However, the assassin probes spouted smaller SD-K4a mini-assassin droids that swarmed the room. Kenobi used his lightsaber to destroy many, whilst Kryze utilized her blaster pistol to deactivate them. After somewhat returning to dinner service, Kenobi arrived with one of the probe killers in a container. Kenobi used the probe to see which senator it would not attack, revealing the traitor. When Kenobi realized that Merrik was the treasonous one, Merrik quickly retaliated and took Kryze hostage."}, {"tag": "h4", "text": "Taking the Duchess hostage"}, {"tag": "p", "text": "Merrik held a blaster to Kryze's head and took the Duchess from the dinner room, arriving at the helm of the ship, where he quickly dispatched all the pilots and contacted Pre Vizsla. Death Watch informed him that reinforcements were on the way, just as three Droch-class boarding ships carrying B2-series super battle droids arrived on the Coronet. Merrik, who had secretly wired the starship's engines to explode at the press of a button, threatened Kenobi as a fight ensued across the ship as the droids attacked the clone troopers and Mandalorian Protectors."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "As Merrik made his way to escape, Kryze expressed her love for Kenobi, who did the same, much to Merrik's chagrin, before she insulted Merrik, calling him a slug for his betrayal, stepping on his foot and taking his blaster. As they both pointed their weapons at him, Merrik expressed amusement that neither of them would kill him, as Kryze would be branded a hypocrite to all of her pacifist ideals and Kenobi would be seen as a hero to everyone but the Duchess, who would be disgusted. Merrik then tauntingly asked who would brand themselves a killer in striking him first. Neither of them killed him; instead, Anakin Skywalker snuck up behind the unsuspecting senator and killed him with a lightsaber through the chest."}, {"tag": "p", "text": "Merrik's dreams of Mandalore switching sides would eventually be fulfilled when Death Watch conquered Mandalore two years later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tal Merrik first appeared in \"The Mandalore Plot,\" the twelfth episode of Star Wars: The Clone Wars' second season. His identity was confirmed in the credits. He was voiced by Greg Proops, who voiced Fode in The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}