{"url": "Battle_of_Drongar", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Drongar"}, {"tag": "p", "text": "The Battle of Drongar, also known as the Jasserak Engagement, was fought during the Clone Wars. Drongar was not a strategic military point; instead, both the Galactic Republic and the Confederacy of Independent Systems wished to control the planet's main export, bota. Both sides of the war fought for the planet over one year already as of 24th month after the Battle of Geonosis, but used weapons like slugthrowers, swords, and staffs to make sure the plants weren't damaged."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "By seven months after the Battle of Geonosis, Republic forces were in need of reinforcements. The Acclamator-class assault ship VCD987 was dispatched with a fresh detachment of clone troopers and Jedi Knights Tsui Choi, Sian Jeisel, and Kai Justiss. En route, the Republic cruiser was ambushed by Quarren Separatists loyal to Count Dooku. With its engines disabled, Dooku and Sora Bulq led the Quarren soldiers in a boarding action. After securing the Jedi, Bulq was ordered to slay the surviving clone troopers, cutting off reinforcements to Drongar."}, {"tag": "p", "text": "Meanwhile, on the ground, Jedi Commander Barriss Offee aided a small surgical unit, saving countless lives during the ensuing battle. Eventually, the overall strength of the droid fighting force was enough to have Republic troops pulled off the planet (which was also due to the fact that Separatists had used saturation bombing which rendered the majority of the bota useless). However, the Republic managed to secure about two metric tons of bota, and they were eventually supported by the Venator-class Star Destroyer Resolution, which forced the droid armies into a retreat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}