{"url": "Tal_Fraan", "categories": ["Category:Legends articles", "Category:Males", "Category:Officers", "Category:Yevetha"], "nodes": [{"tag": "h1", "text": "Tal Fraan"}, {"tag": "p", "text": "Tal Fraan was a male Yevetha, unusual in his xenophobic society for his interest in the attitudes and behaviour of other species."}, {"tag": "p", "text": "Tal Fraan appears to have pursued a military career, serving in the garrison on the prison moon of Pa'aal and the crews of the warships Devotion of Yevetha and Glory of Yevetha. His postings on Pa'aal and aboard Devotion placed him in close proximity with the prisoners who were forced to assist the Yevetha with the reverse-engineering of captured Imperial technology, and gave him an extensive opportunity to study Human behaviour."}, {"tag": "p", "text": "Subsequently, while serving aboard Glory, he played a role in planning the defense of the Doornik-319 system, also known to the New Republic as Morning's Bell, and to the Yevetha themselves as Preza. Based on his study of the prisoners' psychology, Tal Fraan appears to have originated the idea of placing hostages aboard Yevethan warships to act as human shields against the New Republic Fifth Fleet, a tactic which led to the Yevethan victory at the Battle of Doornik-319. In response, Tal Fraan was promoted by Glory's commanding primate to a higher rank within the crew. This was probably the point at which he attained the position of proctor."}, {"tag": "p", "text": "The young proctor's role came to the attention of Nil Spaar, the ruling Viceroy of the Yevetha, who summoned Tal Fraan from the Glory to serve as his personal aide and advisor. In this role, he took the title of \"proctor cogent\"."}, {"tag": "p", "text": "An encounter with Han Solo made Tal Fraan realise that he had miscalculated the effect that direct displays of aggression against hostages would have on the New Republic. Noting the New Republic's apparent lack of appetite for confrontation with the Imperial warlords, he now suggested, as an alternative, that the Yevetha feign an alliance with a powerful Moff. Instead of pausing, however, the New Republic Fifth Fleet advanced into Yevethan space, discovering and destroying the Black Nine shipyard at the Battle of ILC-905."}, {"tag": "p", "text": "This failure resulted in Tal Fraan's death at the hands of Nil Spaar who decapitated him with his dew claws."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources and references"}, {"tag": "h2", "text": "Sources"}]}