{"url": "Tales_from_Wild_Space:_Look_Before_You_Leap", "categories": ["Category:Real-world articles", "Category:Tales from Wild Space"], "nodes": [{"tag": "h1", "text": "Tales from Wild Space: Look Before You Leap"}, {"tag": "p", "text": "Tales from Wild Space: \"Look Before You Leap\" is a comic story that was published as the secondary story of Star Wars Adventures 7 on March 7, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Impatient BB-00"}, {"tag": "p", "text": "Onboard the Star Herald out in Wild Space, CR-8R \"Crater\" was arguing with BB-00 \"Boo\" who wanted to go visit the planet below them. Crater told him that he would have to wait as he scanned for hostile life forms. Emil Graf agreed with Crater and asked Boo if he had ever heard the phrase, \"Look before you leap.\" The phrase reminded him of a story he heard one time."}, {"tag": "h3", "text": "Surviving the stomach"}, {"tag": "p", "text": "Around 30 years earlier, Nien Nunb and Shriv Suurgav were sent to protect a refugee starship when they landed on a planet to track two TIE fighters who were looking for the location of the ship. All of the sudden a ship that was crunched up into the shape of a ball came soaring past the Sullustan and the Duros. They went over to investigate the crash and found out that it was one of the TIE fighters. The ground started to shake around them and the two made a dash for their ship. The ship started to sink into the ground, knocking Nunb and Suurgav around. The ship landed in a green colored river. They fell off a green waterfall, into a tunnel and landed on a small piece of land surrounded by the green liquid. Nien Nunb and Shriv but on breath masks and went outside to the engine filters that were clogged with the green gunk."}, {"tag": "p", "text": "When they got out, they noticed the second TIE fighter was crashed on the other side of the river. Then, many worm like creatures came out of the cracks in the walls wrap themselves around the TIE fighter until it fell in the green liquid. A vine from the top of the tunnel came down and grabbed the destroyed cockpit of the TIE fighter. The creatures noticed Nunb and Suurgav and started to swim to them. Nein quickly ran inside the ship but Shriv stayed out to clean the engine filter. The creatures started to latch on to the ship, scaring Nien Nunb. Shriv ordered Nien Nunb to pilot the ship out of cave even though he was still on top of the ship cleaning it. The Sullustan took the ship up towards the exit of the tunnel as the creatures went flying off. Shriv knocked frantically on the ship so he could get back in. As they made it through the exit Shriv told Nien Nunb that the islands were \"alive\" and that they were just in a stomach. Nien Nunb saw it as a mission accomplished."}, {"tag": "p", "text": "Back on the Star Herald Boo was much more willing to allow Crater to scan the planet of hostile life forms after hearing Emil Graf's story. Boo changed his mind and wanted the planet to be scanned twice just in case. Crater went ahead and scanned the planet, joking that he might do it a third time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}