{"url": "Tales_of_Villainy:_The_Hostage", "categories": ["Category:Real-world articles", "Category:Tales of Villainy"], "nodes": [{"tag": "h1", "text": "Tales of Villainy: The Hostage"}, {"tag": "p", "text": "\"Tales of Villainy: The Hostage\" is a comic story that was published as the secondary story of Star Wars Adventures 3 on February 3, 2021."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Bahlah the Shadow Collective, led by Savage Opress was attempting to break down the door to the Stronghold of the Morubas crime family."}, {"tag": "p", "text": "From inside the stronghold, Krantz reported to Jjan the leader of the Morubas crime family that the Shadow Collective attack had increased. But Jjan was not worried because even if the Collective did breakthrough he still possessed their leader, the former Dark Lord of the Sith, Maul."}, {"tag": "p", "text": "Maul had came to Jjan with an offer in good faith. Maul wanted the Morubas crime family to join him and other syndicates to form the \"Shadow Collective\" but after Jjan learned that Maul had planned to kill him after they met he took Maul captive by poisoning him."}, {"tag": "p", "text": "Maul warned Jjan that Opress and his men will storm the stronghold but Jjan was confident that they were safe in the stronghold that had withstand attacks from countless armies. He exclaimed that they were in the safest place in the galaxy. But he let his confidence get the better of him. Maul broke out of his restraints and used The Force to reach for his lightsaber."}, {"tag": "p", "text": "The guards charged at Maul but as he began to fight back, he revealed that Maul had allowed for his intentions to be known so he could be captured and brought into the stronghold. Maul took out the last guard and confronted Jjan. Opress then entered and reported to Maul that the Shadow Collective had broken through the defenses and were taking over the rest of the stronghold. But Jjan did not believe that his soldiers will join him. But Maul no longer saw a need to bring the Morubas crime family into the Shadow Collective. He did not believe that the crime family was worthy of their history and left Jjan to pick up the ruins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}