{"url": "Tales_of_Villainy:_Invasion_of_Echo_Base", "categories": ["Category:Real-world articles", "Category:Tales of Villainy"], "nodes": [{"tag": "h1", "text": "Tales of Villainy: Invasion of Echo Base"}, {"tag": "p", "text": "\"Tales of Villainy: Invasion of Echo Base\" is a comic story published as the secondary story of Star Wars Adventures 1 on October 7, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Galactic Empire had launched an assault at the Alliance to Restore the Republic's Echo Base on the planet Hoth. General Maximilian Veers reported to Dark Lord of the Sith, Darth Vader that they had taken down the main power generator and the he could begin his landing."}, {"tag": "p", "text": "Vader and his snowtroopers had landed on the battlefield and fought off defending rebel troopers. As they reached the entrance to Echo Base, Vader ordered his snowtroopers to capture the Heroes of Yavin alive. He then used the Force to break down the door to Echo Base as the snowtroopers charged in. A battle ensued in the hangar as a rebel tried to alert the command of the Imperial infiltration. As Vader took out the rebel soldiers he sensed the presence of Han Solo, and Princess Leia Organa. Vader then entered the medical bay which gave him memories of his past injuries when he noticed the bacta tank."}, {"tag": "p", "text": "Meanwhile, a group of snowtroopers chased C-3PO through the base. They stopped at a room with the sign ripped off, assuming he was in there. But when they opened the door, one of them was dragged in by a wampa. The other quickly closed the door as Vader came back, requesting a status update. He then received a report that Solo and Organa were nearby, heading back to the Millennium Falcon. Vader broke down a barrier as they reached the hangar."}, {"tag": "p", "text": "His snowtroopers set up blaster cannons as the Falcon prepared to take off. The Falcon took out many snowtroopers as it made it's escape. Vader looked on knowing that he would have to make Luke Skywalker come to him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}