{"url": "Tales_from_Wild_Space:_Adventures_in_Wookiee-Sitting", "categories": ["Category:Real-world articles", "Category:Tales from Wild Space"], "nodes": [{"tag": "h1", "text": "Tales from Wild Space: Adventures in Wookiee-Sitting"}, {"tag": "p", "text": "Tales from Wild Space: \"Adventures in Wookiee-Sitting\" is a story featuring Cassian Jeron Andor and K-2SO. It was published as the back-up story of Star Wars Adventures 3 on October 18, 2017."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "While Shannon Denton wrote the story, Alan Tudyk was brought on to write some of K-2SO's dialogue."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Strange supplies"}, {"tag": "p", "text": "On board the Star Herald while traveling through Wild Space, CR-8R \"Crater\" and BB-00 \"Boo\" were playing a game of Dejarik. Crater told Boo that he will never win against him because he is simply not programmed too. Emil Graf didn't think so and told Crater to hold on a second. He told Boo that even though it seems like the programming is always against them sometimes it's best to go with the flow which reminded him of a story about this."}, {"tag": "p", "text": "Many decades earlier, Cassian Andor and his droid companion, K-2SO were raiding an Imperial freighter. Cassian had deployed gas to make it seem to the Galactic Empire that smugglers had stolen supplies and not members of the Rebel Alliance. K2 thought it was the worst idea Cassian ever had. The Rebel Army was in need of the supplies they were stealing and both were surprised to find that the supplies was three Wookiees. Realizing that it would not be safe to bring three young Wookiees on an upcoming raid, Cassian and K2 flew to the moon, Charissia. Cassian put K-2SO in charge of watching the Wookiees while he went on the raid. Cassian promised to be back by sunrise and took off."}, {"tag": "h3", "text": "\"Wookiee-sitting\""}, {"tag": "p", "text": "K2 tried to have the Wookiees eat a protein mixture that he made. But the Wookiees refused to eat it. He tries to persuade the Wookiees by telling them that they will become big and strong as a herd of large, grey creatures appeared around them. The Wookiees ran away as the creatures ran by but one of them running over K-2SO. One of the Wookiees, D'Koetaa used a black vine to grab K2 and move him out of the way. The other Wookiees, D'Lylaa and Wyhyatt were riding on the creatures to K2's amaze. K2 then got on one of the creatures and rode to a pond with the Wookiees."}, {"tag": "p", "text": "The next day, Cassian came back from the raid and called out to K-2SO and the Wookiees. Cassian confirmed to K2 that the raid was a success and K2 told him that he was right when he said earlier that everyone liked him. K-2SO told Cassian that he was too small and soft to deal with the tough work of \"Wookiee-sitting\"."}, {"tag": "p", "text": "Back on the Star Herald, Emil Graf told Crater that sometimes they are blind to their own potential and that there is more to winning then just their programming. But Crater still believed he would still win."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}