{"url": "Tales_from_the_New_Republic", "categories": ["Category:Real-world articles", "Category:Legends short story collections", "Category:Tales from the New Republic"], "nodes": [{"tag": "h1", "text": "Tales from the New Republic"}, {"tag": "p", "text": "Tales from the New Republic is a Star Wars Legends anthology book edited by Peter Schweighofer and Craig Carey. It contains eleven short stories, including material previously published in the Star Wars Adventure Journal. It was first published in paperback form by Bantam Spectra on December 1, 1999."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Written by some of today's leading science fiction writers, these tales sweep us into a world where the only laws are cunning, force, and power—and only the bravest, craziest, and deadliest dare to tread. Here mercs and smugglers, gangsters and warriors fight toe to toe, side by side, and behind each other's backs in the backwaters of a universe ripped apart by war...."}, {"tag": "p", "text": "On Zelos II a man and a woman are held prisoner in a dark cell, each fighting in their own way for survival at the hands of Imperial captors—and a chance for escape that could cost one of them their life. On the tortured landscape of Ryloth, Fenig Nabon awaits a ship of women warriors to complete a dangerous deal: the smuggling of a troupe of dancers to the homeworld of the Hutts—only to get more than she bargained for. And in a stunning new novella written especially for this collection by Hugo Award–winning, New York Times bestselling author Timothy Zahn and Michael A. Stackpole, Senator Garm Bel Iblis, believed dead at the hands of an Imperial assassin, teams up with Hal Horn in a duel against the Empire's most dangerous agent. At stake are the plans for a terrifying new weapon called the Death Star—and the fate of both the Empire and the New Republic."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}