{"url": "Tales_from_Wild_Space:_A_Small_Push", "categories": ["Category:Real-world articles", "Category:Tales from Wild Space"], "nodes": [{"tag": "h1", "text": "Tales from Wild Space: A Small Push"}, {"tag": "p", "text": "Tales from Wild Space: \"A Small Push\" is a comic story that was published as the secondary story of Star Wars Adventures 12 on July 25, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Pedestrian insults"}, {"tag": "p", "text": "Walking through the streets of the planet Ryloth, a young Twi'lek girl named Neesha Tor was being insulting by other pedestrians who looked down on her for being poor and an orphan. Another Twi'lek called out to her because of her bad smell. She told Neesha that she used to live near her grandmother and watched her mother grow up. Everyone expected greatness from her mother so when she deserted Neesha, everyone believed that she deserved it. Her son tried to give Neesha some food but the woman would not allow it."}, {"tag": "p", "text": "Neesha Tor went over to the side of a cliff where a one earred tooka was. She admired the tooka and asked it if it had done anything for anyone to hate it. Asking this question angered Neesha who kicked the ground in front of her. She slipped and fell but she managed to grab on to the edge of the cliff. Hanging on to the edge of the cliff with just hand, Neesha realized this is what she deserved."}, {"tag": "h3", "text": "Windu to the rescue"}, {"tag": "p", "text": "But an individual from the top of the cliff told her that he didn't believe her. Using his lightsaber to fall down the cliff he greeted Neesha and introduced himself as Jedi Master Mace Windu. Windu offered the girl his assistance in getting her out but Neesha questioned how he could do it. The Jedi Master was confident that he could do it and used The Force to lift Neesha up and towards the top of the cliff. Windu then jumped up and joined her at the top of the cliff."}, {"tag": "p", "text": "Neesha Tor questioned why Mace Windu would help her because she believed that she was worthless unlike him. Windu told her that she was not worthless and that everyone needs help sometimes, no matter what they think of you. Windu believed that one day she will help people and walked off into the sunset."}, {"tag": "p", "text": "Many decades later, the cartographer, Emil Graf complemented Neesha Tor on her story and asked her if she knew what Mace Windu meant when he was talking to her. She told Graf that she didn't know at the time but had learned what the Jedi Master meant now. Windu told her that the decisions she made now are justs as important as the choices she made afterwards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}