{"url": "Tales_from_the_Empire", "categories": ["Category:Real-world articles", "Category:Legends short story collections", "Category:Tales from the Empire"], "nodes": [{"tag": "h1", "text": "Tales from the Empire"}, {"tag": "p", "text": "Tales from the Empire is an anthology about the Galactic Empire; the short stories were selected from the Star Wars Adventure Journal. It begins with an introduction titled \"A Galaxy Filled with Stories\" by Peter M. Schweighofer."}, {"tag": "h2", "text": "Stories"}, {"tag": "h2", "text": "Back-cover blurb"}, {"tag": "p", "text": "Culled from the pages of the Star Wars Adventure Journal, one of the most popular Star Wars magazines in the field today, comes this exciting new short-story collection. Here are stories from such award-winning and New York Times bestselling authors as Timothy Zahn, Michael A. Stackpole, and Kathy Tyers as well as exciting newcomers, including Erin Endom, Laurie Burns, and Patricia A. Jackson. From the desperate flight of a civilian mail courier carrying vital Rebel intelligence through an Imperial blockade, to a suicidal commando raid on an impregnable Imperial prison, to a Corellian smuggler mysteriously hired by an actor turned Jedi Knight turned Imperial assassin for one final transformation, these tales capture all the high adventure, imaginative genius, and nonstop action that are the hallmarks of the Star Wars saga."}, {"tag": "p", "text": "What's more, the centerpiece of this magnificent collection is the short novel Side Trip, the first-ever collaboration between Timothy Zahn and Michael A. Stackpole, in which a freighter smuggling arms for the Rebels is commandeered by an Imperial Star Destroyer led by a mysterious helmeted figure who claims to be the notorious bounty hunter Jodo Kast. It is all part of a devious plan that includes Hal and Corran Horn, who are working undercover to nail the infamous Corellian warlord Zekka Thyne. But one slip up can get them all killed."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Despite being on the cover, neither Boba Fett nor his ship Slave I appear in the anthology. The closest reference is a mention of Fett's name in Side Trip, though in an ironic twist, Admiral Thrawn does don Mandalorian armor in the guise of notorious Fett impersonator Jodo Kast."}, {"tag": "h2", "text": "Cover gallery"}]}