{"url": "Tales_of_the_Jedi_%E2%80%93_Redemption_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - Redemption"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – Redemption 2"}, {"tag": "p", "text": "Tales of the Jedi: Redemption 2: The Search for Peace is the second issue in the Star Wars: Tales of the Jedi - Redemption series of comics. It was published on August 26, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Hoggon arrives at Exis Station and takes a place in an airshaft to watch the convocation, as Sylvar has taken the chance to speak. She talks of Ulic Qel-Droma and mentions that he betrayed the Jedi and now wanders free. She makes reference to Ulic's conspiring with Exar Kun, and the death of Jedi, including her mate Crado. She then states that Ulic is the greatest shame of the Jedi Knights."}, {"tag": "p", "text": "On Rhen Var, Ulic takes up his lightsaber, but cannot feel anything in the force. The weapon is nothing but a tool in his hands. The ground beneath him then gives way, dropping him into a hole."}, {"tag": "p", "text": "Back on Exis, Vima stares at two hologram's belonging to her mother; one is Vima's father, Andur, and the other is Ulic. Vima asks her mother about training, to which Nomi responds with \"not today.\" Vima then goes off to the docking bay, stowing away on a ship, intent on finding her own trainer. Also in the docking bay is Tott, who asks Sylvar to come with him to Ryloth, in order to deal with the anger within her."}, {"tag": "p", "text": "Upon arriving at the new city of Tott's clan, the two Jedi are told of an attack on the clan by another clan. Tott leaves to deal with the situation and asks Sylvar to help while he is gone. Sylvar decides to try and rally the clan, telling them that they must attack and have revenge. Tott returns to announce that blood shed does not create peaces, and that a solution has been reached; the two clan leaders will go into the desert together and a new head-clan will join the tribes. Not used to the difference in custom, Sylvar asks to be taken home to Cathar."}, {"tag": "p", "text": "On Rhen Var, Ulic looks back on what he has done in the past; betraying Nomi and killing Cay. He considers this to be a place as good as any to die, but is urged to live on by an image of his deceased teacher, Master Arca Jeth. Ulic pulls his strength together and climbs back up through the snow."}, {"tag": "p", "text": "On Exis Station, Nomi finds her hologram of Ulic missing, and is told by Master Thon that Vima is missing."}, {"tag": "p", "text": "On his ship, Hoggon discovers that Vima has stowed away on his ship. Vima says she is looking for Ulic Qel-Droma, and show Hoggon the hologram. Hoggon takes her to Rhen Var and drops her on the planet, giving her a transmitter with which to contact him. After Hoggon leaves, Vima states that she will not leave until she is a Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}