{"url": "Talia_(Onderon)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Females", "Category:Galactic Republic individuals", "Category:House of Kira", "Category:Monarchs of Onderon", "Category:Onderon Royalists", "Category:Onderonians"], "nodes": [{"tag": "h1", "text": "Talia  (Onderon)"}, {"tag": "p", "text": "Talia was a female Human who served as the Queen of the planet Onderon during the years prior to and following the Jedi Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Talia was a direct descendant of the Dark Lord Freedon Nadd. However, the death of her grandparents broke the sway of the dark side over their descendants, as evidenced by her being one of the Republic's and the Jedi's staunchest allies in the Post-Jedi Civil War era."}, {"tag": "p", "text": "Before the Mandalorian Wars, Talia made an alliance with the Republic, eventually gaining Republic citizenship for Onderon. This would later cause much suffering and conflict for her people."}, {"tag": "h3", "text": "Conflict"}, {"tag": "p", "text": "When the Mandalorian Neo-Crusaders invaded the Republic, Onderon was one of the first Republic worlds to fall to them. Talia's position during this time is unclear, but her cousin, General Vaklu, led the resistance to the Mandalorians. Near the end of the war, Revan and his forces liberated Onderon, though credit for this went mainly to Vaklu in the eyes of the Onderonian people."}, {"tag": "p", "text": "When Revan led his corrupt forces in the Jedi Civil War, he left Onderon almost untouched. But the Republic still needed soldiers and supplies from Onderon during this time."}, {"tag": "h3", "text": "Vaklu's Manipulations"}, {"tag": "p", "text": "After the Jedi Civil War, the dark days of the Dark Wars began. During the next five years, the Republic began the Telosian Restoration Project, a project to see if the Republic could heal the worlds that had been ravaged in both wars. Because Onderon was one of the few worlds in the Republic that was still intact, materials and wildlife were constantly exported to Telos IV."}, {"tag": "p", "text": "Talia, as a staunch supporter of the Republic, agreed to supply the Republic with the materials it needed. Vaklu, however, saw a chance to rise to ultimate power on Onderon by taking Talia out of the picture. He began to preach about how the Republic had brought war to Onderon, how it had taken so much and now was not able to give anything back. This won him many followers and soon, Vaklu was able to openly challenge Talia's ideas in the government. Soon, he had the military blockade the planet on the grounds that he was searching for \"Republic treachery\", when in reality he was trying to prevent Republic aid from reaching Talia."}, {"tag": "p", "text": "Talia's main counsel during this time was the Jedi Warrior Master Kavar, who also served as one of her strategists."}, {"tag": "h3", "text": "Meetra Surik"}, {"tag": "p", "text": "Soon, Meetra Surik, known as the Jedi Exile came to Onderon searching for Kavar. Vaklu, who had been warned about her by his secret allies, ordered Colonel Tobin to destroy the Exile's ship. Surik escaped with her ship damaged to the moon of Dxun. There, she met the remnant of the Mandalorians rebuilding on the moon. After allying with them, she managed to land on Onderon."}, {"tag": "p", "text": "When Surik was able to meet with Kavar, Tobin attempted to kill both of them, but both managed to escape. Soon after, Vaklu met with the council of lords and stated that Talia was guilty of treason. He launched a full-scale assault on Talia's royal palace. While the majority of the military remained loyal to Talia, Vaklu had Nihilus' soldiers for reinforcements. Furthermore, the Sith used the dark side to control a number of Onderon's beasts to fight for them. It seemed that Talia was doomed."}, {"tag": "p", "text": "But Surik returned to Onderon using a Basilisk war droid. By the time Surik had reached the throne room, Vaklu's forces had breached it and Vaklu was personally dueling Talia. Talia proved to be the more skillful duelist, and Vaklu desperately ordered his men to shoot her. Surik intervened, however, and defeated Vaklu. Captured and at Talia's mercy, Vaklu declared that Talia's reign would not be easy, as her attachment to the Republic would destroy Onderon. He then taunted her by saying he would be free within a week by his supporters. But to Vaklu's horror, Talia intended to execute Vaklu on the spot. It was then that Surik pointed out that if Vaklu was executed, it would make him a martyr to his supporters; the captive General was nonetheless sentenced to death and executed by firing squad. The queen then began the process of winning back the support of her people."}, {"tag": "h3", "text": "Future"}, {"tag": "p", "text": "Based on Kreia's prediction, Talia had a long and successful reign, bringing prosperity to her beloved people and leaving behind their antagonism with the Republic for helping them win the war. Consequentially, much of Onderon's identity would be replaced culturally by that of the Republic's, as many Core Worlds did before it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "She was voiced by Seeta Indrani."}, {"tag": "p", "text": "The fact that Oron Kira and Galia are her parents is in question, though it is the most logical explanation seeing as there isn't much proof that they were her grandparents and the fact of the timeline, since Galia and Oron were probably married in 4002 BBY or sometime shortly thereafter, it is just possible that Galia gave birth to her sometime later in life. One fact disputing this is the existence of Vaklu, as thus far, Galia is not known to have any siblings."}, {"tag": "p", "text": "Talia's accent sounds like a South Asian accent, like those in or near India."}, {"tag": "h3", "text": "Failure to Convince"}, {"tag": "p", "text": "If you fail to convince Talia, she will ultimately kill Vaklu for his treason. The player can also claim the decision is Talia's to make. She will then have Vaklu killed. This option does not shift the Exile to the dark side and gains influence with Kreia and even Mandalore if he is with Surik, despite the latter's respect for Vaklu."}, {"tag": "h3", "text": "Alternate dark side choice"}, {"tag": "p", "text": "Meetra Surik's intervention swung the balance of the battle into General Vaklu's favor, as Vaklu's troops stormed the palace, and invaded the Queen's throne room. Jedi Master Kavar tried to stop the invasion, but Surik, aided by the dark side's rage, defeated him in a grueling battle. Queen Talia was subsequently killed, either by Vaklu's forces, or in a duel against Surik (depending on Surik's choice)."}, {"tag": "p", "text": "Ironically, even though Vaklu, the secessionist, came out victorious, he turned on his Sith allies, choosing to send his troops to Telos, when the Sith invasion commenced."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}