{"url": "Tales_of_the_Jedi_%E2%80%93_The_Sith_War_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - The Sith War"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Sith War 1"}, {"tag": "p", "text": "Tales of the Jedi - The Sith War 1 is the first issue of the Star Wars Legends comic book miniseries Star Wars: Tales of the Jedi — The Sith War. It was written by Kevin J. Anderson, illustrated by Dario Carrasco, Jr., and first published on August 15, 1995 by Dark Horse Comics."}, {"tag": "p", "text": "The issue is set six months after the events of Tales of the Jedi – Dark Lords of the Sith 6, and it features the story \"Edge of the Whirlwind,\" in which Mandalore the Indomitable challenges the fallen Jedi Ulic Qel-Droma to a duel."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This issue kicks off the thrill-a-minute follow-up to the best-selling Dark Lords of the Sith saga. Picking up six months after our story left off, Exar Kun and Ulic Qel-Droma are implementing their insidious plan for revitalizing the Golden Age of the Sith. While insinuating his darkside teachings to Jedi students on the planet Ossus, it becomes clear that Kun is only concerned with securing a powerful Sith Holocron from its sealed repository in the great library of Ossus. Ulic has devoted himself to developing the darkside military strategy -- the key to which may just be winning the loyalty of the ferocious warrior race led by a masked mysteryman named Mandalore."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "Mandalorian crusaders"}, {"tag": "p", "text": "The Mandalorians, led by Mandalore the Indomitable, wage war on the Empress Teta system. Mandalorian warriors riding Basilisk war droids attack an orbital Tetan carbonite smelter. They disable it with an atomic compression bomb, causing it to crash into a city on a planet's surface."}, {"tag": "p", "text": "Regarding the Mandalorian invasion as an obstacle to his larger plan, the Sith apprentice Ulic Qel-Droma parleys with Mandalore, who challenges Ulic to a duel. With the approval of the Krath leader, Aleema Keto Ulic accepts Mandalore's challenge on the terms that if he wins, he shall receive control of the Mandalorian warriors."}, {"tag": "h3", "text": "Subversion on Ossus"}, {"tag": "p", "text": "Meanwhile, the Dark Lord of the Sith Exar Kun visits Ossus' Gardens of T'alla, meeting with several Jedi apprentices. He claims to have unearthed forgotten Jedi secrets and powers and offers to share them with other Jedi. Jedi Knight Oss Wilum is concerned that Kun is asking them to leave their masters and accept him as their teacher while Crado reminds Kun that Master Vodo-Siosk Baas has not yet declared Kun a master yet."}, {"tag": "p", "text": "Kun claims the Jedi Masters are suspicious of his teachings and criticizes the late Master Arca Jeth for letting Sith magic escape his grasp. An apprentice named Zona Luka agrees with Kun but Cay Qel-Droma counters that Master Arca sacrificed is own life to save other Jedi. When Wilum mentions the fallen Jedi spirit of Freedon Nadd, Kun claims that he hunted down and vanquished Nadd's spirit without the help of Arca. As proof, Kun displays his Jedi amulet and invites the other Jedi to join him in learning ancient Jedi secrets."}, {"tag": "h3", "text": "Duel on Kuar"}, {"tag": "p", "text": "On Kuar, Ulic faces Mandalore the Indomitable in a duel over two fallen towers suspended by chain. Ulic wields his lightsaber while Mandalore rides a Basilisk war droid. Despite being outgunned by Mandalore, Ulic uses his Force powers to separate Mandalore from his war mount."}, {"tag": "p", "text": "During the second round, Mandalore wields a Mythosaur axe. He manages to gain an advantage over Ulic but Ulic uses his Force powers to leap onto a nearby war droid. Armed with the war droid, Ulic demands that Mandalore surrender. Mandalore is defiant but Ulic attacks Mandalore with the war droid, causing the Mandalorian leader to fall off his vantage point."}, {"tag": "p", "text": "Accepting defeat, Mandalore cedes his warriors to Ulic and asks him to kill him. However, Ulic reassures Mandalore that he is not interested in his death but has a \"much better fate\" in mind."}, {"tag": "h3", "text": "Enemy within the ranks"}, {"tag": "p", "text": "Meanwhile, Nomi Sunrider continues her training in Jedi battle meditation under the tutelage of Master Odan-Urr in the Great Jedi Library on Ossus. Nomi's daughter Vima is also present. Master Odan-Urr tells her that the ancient Sith Lords built meditation chambers and that the best way to combat Sith battle meditation is to use her Jedi abilities to take power away from her opponent; effectively stripping them of the Force."}, {"tag": "p", "text": "Odan-Urr also has a Sith holocron containing the forgotten histories and lore of the Sith dating back a hundred thousand years. Nomi and Vima, whom Odan-Urr predicts will be a Jedi Master with many apprentices, leave the Jedi Master's chambers. Shortly later, the Sith holocron starts glowing and Exar Kun uses the Force to summon it."}, {"tag": "p", "text": "Odan-Urr tries to drive Kun away with the light side of the Force but the ancient Jedi Master is no match for the Dark Lord, who kills him. After Odan-Urr becomes one with the Force, his Jedi followers enter the chamber. Kun claims that Odan-Urr died peacefully but gifted the holocron to him."}, {"tag": "h3", "text": "Raid on Foerost"}, {"tag": "p", "text": "A gigantic ship called Golthar's Sky arrives at the Foerost Shipyards seeking repairs. However, the giant ship is actually a Force illusion conjured up by Aleema Keto to hide a combined Krath and Mandalorian attack force. The Foerost Shipyards are overwhelmed and boarded by Mandalorian warriors, Tetan soldiers, and Basilisk war droids while CX-133 Chaos fighters take out the defensive cannons."}, {"tag": "p", "text": "Ulic forces the surviving shipyard workers to hand him the operations codes for the shipyard's 300 warships. Shortly later, Ulic is contacted via holoprojector by his master Dark Lord Exar Kun, who informs him that he has recruited 20 Jedi Knights. Ulic boasts that he commands two armies and 300 of the newest Republic warships. While Kun believes that they should gather more ships while he trains his Jedi, Ulic proposes attacking the galactic capital Coruscant since the Republic's military is stretched defending its shipards and outposts."}, {"tag": "p", "text": "Kun disagrees and says that they should build up their forces before attacking together. Mandalore the Indomitable backs up Ulic and reassures Kun that his clans are the best fighters in the galaxy. Kun allows Ulic to proceed with his plan but warns that if he fails, he will go on without him. Ulic is determined to prove that the Republic is weak and vulnerable."}, {"tag": "p", "text": "Republic Navy reinforcements led by Captain Vanicus arrive at the Foerost Shipyards. While rescuing survivors and checking the station's automated security systems, Vanicus and his troops discover a holo-recording of Ulic and Mandalore discussing a surprise attack against Kemplex IX. Vanicus recognizes Ulic and laments that this is a dark day for the Republic."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In Tales of the Jedi - The Sith War 1, Zona Luka says that Jedi Master Arca Jeth died on Onderon, and Oss Wilum explains that it happened by an avatar of Freedon Nadd. The previously published Tales of the Jedi – Dark Lords of the Sith 3 establishes that he died in the Conclave at Deneba by a Krath war droid."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}