{"url": "Talid", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Mammalian sentient species", "Category:Mid Rim species", "Category:Talid"], "nodes": [{"tag": "h1", "text": "Talid"}, {"tag": "p", "text": "The Talid were a sentient species that were indigenous to the planet of Ando Prime. Ten-Abu Donba was a Talid."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A mammalian species, Talids had six limbs: two of which were legs, and four spindly arms. Each arm possessed a hand with two fingers and an opposable thumb. Their hair was white or blond, usually naturally, but dyed to these colors if naturally dark. Their hair was wiry, usually grown long, strung with beads made of stone or bone indicating wealth and status. Animal fat was applied to the hair for stealth to keep the beads from shining. Males sported beards, and both genders had some body hair. The Talids had stocky bodies with thick hides, and could survive harsh weather, but were not particularly agile. Their eyes were narrow and the noses at the end of their muzzle had four nostrils. Talids' typically covered their bodies and faces for protection from the harsh environment. They dressed in all-temperature cloaks made of furs that allowed them to blend into the snowy environment."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Native to the planet Ando Prime, the Talid were a nomadic species, that were scattered across the planet. Living apart from the Human settlements, the Talid were xenophobic, limiting their interactions with offworlders and colonists to trade and salvage. Though possessed of a playful spirit, this characteristic of their personality was seldom seen by non-Talids; after opening trade negotiations with a short ceremony, Talids got straight to the point. Talid concepts of trade were similar to those of the Killiks, engaging in direct barter to achieve an equilibrium before formally closing negotiations, sometimes after months or even years. The subtleties of this practice were lost on many offworlders, resulting in colonists often misunderstanding the Talids to be thieves. However, the Talids also understood the concept of money."}, {"tag": "p", "text": "Patient opportunists, they were very aggressive in salvaging operations, and would position slugthrower-equipped snipers to drive off anyone approaching junk they considered rightfully their own. They often salvaged wrecked podracers. Unfortunately, many offworlder pilots were ignorant the Talids existed: At some point, former podracer Ree and his team were trying to scavenge some mining scanning gear from wrecked podracers at Juaka Canyon, but they were attacked by Talids, who also claimed to own that scrap. It should be noted, nevertheless, that Ree had been led to the Canyon by native Geon Justic, who did not tell him about the Talids hoping that Ree would be killed."}, {"tag": "p", "text": "The Order of Dai Bendu was influential among the Talid of Ando Prime, with their monasteries and shrines standing among the mountains since before the foundation of the Galactic Republic. While primitive and tribal, their civilization's traditions were ancient and rich, rooted in their long history. From an early age, all Talids learned how to survive in the wilds and how to handle and ride tantas, reptomammals which were larger, quadrupedal relatives of Tauntauns. Talids' knowledge of terrain and use of tantas helped them in salvage disputes."}, {"tag": "p", "text": "The Talids, at the time of the Rise of the Empire, apparently had no other spoken language other than Basic. They seldom learned other spoken languages. However, they used a unique system of hand signals and noises known as \"Talid signaling.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}