{"url": "Tales_of_the_Jedi_%E2%80%93_Redemption_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - Redemption"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – Redemption 3"}, {"tag": "p", "text": "Tales of the Jedi: Redemption 3: Homecoming is the third issue in the Star Wars: Tales of the Jedi - Redemption series of comics. It was published on September 23, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h3", "text": "Vima and the fallen Jedi"}, {"tag": "p", "text": "On Rhen Var, Vima Sunrider searches for Ulic Qel-Droma in an abandoned city, narrowly escaping a colliding bridge. Amidst a shattered glass window, Vima encounters Ulic, who initially mistakes her for her mother Nomi. Vima tells Ulic that she has wants him to train her as a Jedi. Still tormented by guilt about his role during the Great Sith War, Ulic refuses because he is no longer a Jedi and cannot feel the Force."}, {"tag": "p", "text": "Since Vima reminds him of her mother, he sends a distraught Vima away. Caught in a blizzard, Vima tries to call for help on her transmitter. However, Ulic takes pity on her and shelters her under a wrecked tunnel."}, {"tag": "h3", "text": "Sylvar's internal struggle"}, {"tag": "p", "text": "Tott Doneeta and the Cathar Jedi Sylvar return to Sylvar's homeworld of Cathar. Though Sylvar had hope to find peace, she is greeted by a jubilant crowd of locals, who consider her a hero. However, Sylvar is instead reminded of the things that she has already lost."}, {"tag": "p", "text": "Later that night, Sylvar confides with the holy man Kharr her anxieties about the loss of her mate Crado and her hatred towards Ulic. Kharr tells Sylvar that she is wrong and that the true enemy is the anger within her. Sylvar decides to go on a blood hunt to purge herself of the rage inside her."}, {"tag": "p", "text": "The following day, Sylvar and Tott walk by a giant tree in which the Cathar have carved hieroglyphs about her life into its bark. Sylvar invites Tott to come with her on the blood hunt, which she explains is a ritual cleansing for her people."}, {"tag": "h3", "text": "The reluctant teacher"}, {"tag": "p", "text": "Back on Rhen Var, Vima tells Ulic that her mother Nomi doesn't know that she is here and does not understand how badly she wants to become a Jedi. Ulic asks Vima if she understands the cost of being a Jedi, telling her that he has experienced the loss of his mother, murdered his own brother, betrayed Nomi, and became blinded to the Force. Tormented by the harm that he has wrought on the galaxy, Ulic asks Vima why she would want him to teach him. Vima replies because he is Ulic."}, {"tag": "p", "text": "While repairing his ship, Hoggon realizes that Ulic is a wanted criminal and that he had transported both Ulic and Vima on his ship. Hoggon decides to warn the Jedi, hoping that the Jedi will send a battalion of Jedi Knights to fight Ulic. He resolves to travel to Exis Station and warn Nomi."}, {"tag": "h3", "text": "Consumed by rage"}, {"tag": "p", "text": "On Cathar, Sylvar leads Tott to the lands devastated by the Kiltik. While Sylvar is exhilarated by the prospect of the hunt, Tott is horrified by the skeletons of creatures killed by the Cathar during their hunts. Sylvar counters that killing the Kiltiks is a mercy to her planet and will quench the fires within her."}, {"tag": "p", "text": "Sylvar takes Tott to a cave where the Kiltik sleep during the day, explaining that they hunt at night. Inside the cave, Sylvar slays the Kiltik guard with her lightsaber before killing the Queen and offspring. While Sylvar enjoys the hunt, Tott is horrified and disgusted by the loss of life. He chides her for giving in to her anger and warns her that the path of anger leads to the dark side. She tells Sylvar to work her problems out and to remember Ulic."}, {"tag": "h3", "text": "A ghost from the past"}, {"tag": "p", "text": "Meanwhile at Exis Station, Nomi receives a holo transmission from her daughter telling her that she is safe and that she is going to be trained by Ulic. While a shocked Nomi grapples with the news, an alien attendant informs her that Hoggon is seeking to visit her. Nomi tells the attendant to send him away while she laments her daughter's \"recklessness.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}