{"url": "Tales_of_the_Jedi_%E2%80%93_Redemption_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - Redemption"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – Redemption 4"}, {"tag": "p", "text": "Tales of the Jedi: Redemption 4: The Trials of a Jedi is the fourth issue in the Star Wars: Tales of the Jedi - Redemption series of comics. It was published on October 28, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A call for help"}, {"tag": "p", "text": "On the planet Cathar's Vast Veldt, Sylvar, the ferocious Cathar Jedi, has gone into isolation herself, directing all her anger and energy toward thoughts of revenge aimed at Ulic. Trying to purge her anger, she kills a horned rodent creature but still does not feel cleansed."}, {"tag": "p", "text": "While sitting by a campfire, Sylvar senses someone stalking her. It turns out to be a scout, who brings news that Nomi Sunrider's daughter Vima has disappeared. Sparing the messenger's life, Sylvar departs to aid her friend Nomi."}, {"tag": "h3", "text": "Vima's first lightsaber lesson"}, {"tag": "p", "text": "On Rhen Var, the powerless, exiled Jedi Ulic Qel-Droma continues to train Vima. Impressed with Vima's dedication and mastery of levitation, Ulic teaches her how to build her first lightsaber using her late father Andur Sunrider's Adegan crystals. Ulic then teaches her how to spar with a lightsbaer."}, {"tag": "p", "text": "Meanwhile on Exis Station, the opportunistic Hoggon tries to see Nomi but is dragged away by two soldiers, who do not believe his claims that he has found Ulic. With Nomi not wanting to grant him an audience, Hoggon decides to seek out Sylvar, knowing that she wants to find Ulic."}, {"tag": "p", "text": "Vima makes great progress in mastering lightsaber strokes. While Ulic is pleased with his student's progress, Ulic thinks that he cannot teach her further because he is no longer a Jedi. Vima tells him that Ulic is still human even though he is no longer a Jedi and thinks that he is making excuses. Ulic explains that he is like a blind artist who can no longer see to paint. Vima suggests that he could become a sculptor instead that uses feelings. While skeptical, Ulic decides to give it a try."}, {"tag": "h3", "text": "Forgiveness versus vengeance"}, {"tag": "p", "text": "While reflecting on her lightsaber, Jedi Master Nomi admits that she has hated these weapons and never wanted to use them. Nomi thinks that she was forced into the Jedi path because of the murder of her husband Andur. Nomi also regrets not giving Vima the attention and training that she needed. Believing that Vima has the potential to be a proud Jedi Knight, she thinks that it is poetic that Ulic is teaching her about the cost of being a Jedi."}, {"tag": "p", "text": "Shortly later, Sylvar enters Nomi's chambers, having received her message. Sylvar is shocked to learn that Vima is training to be a Jedi under Ulic and asks Nomi how she can let him touch her daughter. Nomi counters that Ulic has a good heart and does not believe that he will harm her. Sylvar responds that Ulic is major war criminal who was responsible for the death of her mate Crado. Sylvar thinks that Nomi has a soft heart and mind before storming out. Later, Sylvar is tailed by Hoggon, who tells her that he knows where Ulic is. He also offers her a ride on his starship."}, {"tag": "h3", "text": "Sculptors of the Force"}, {"tag": "p", "text": "Back on Rhen Var, Ulic and Vima erect scaffolding near some giant ice structures. Ulic counsels Vima to form an image in her mind of what she wants to create and to let the Force flows. An enthusiastic Vima agrees and and the two get to work carving ice sculptures with their lightsabers."}, {"tag": "p", "text": "To honor his late Master Arca Jeth, Ulic carves a giant sculpture of Arca's face. To honor her late father Andur Sunrider, Vima carves an image of Andur's face using her mother's hologram as a guide. After carving their sculptures, Vima tells Ulic that this proves that he has the heart of a Jedi despite having no Force powers. Ulic is pleased that they have honored their memory. When Vima remarks that Ulic has trained her as if he were a Jedi Master, Ulic says he wishes that he could believe that were true."}, {"tag": "h3", "text": "Making amends"}, {"tag": "p", "text": "With the Jedi Conclave on Exis Station over, the Jedi prepare to depart for Coruscant. Feeling bad that she has neglected her daughter's training in her service to the Galactic Republic, Nomi departs on her starship to make amends by training Vima. She hopes to get there before Ulic causes too much damage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}