{"url": "Tales_of_the_Jedi_%E2%80%93_The_Sith_War_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - The Sith War"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Sith War 4"}, {"tag": "p", "text": "Tales of the Jedi: The Sith War 4: Jedi Holocaust is the fourth issue in the Star Wars: Tales of the Jedi — The Sith War series of comics. It was published on November 1, 1995 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Returning to Yavin 4"}, {"tag": "p", "text": "Following the events on Coruscant, Ulic Qel-Droma, Exar Kun and Mandalore return to Yavin 4. Ulic learns from Mandalore that Aleema Keto had betrayed him. Having enough of Aleema's manipulations, he vows to deal with the traitor. When Aleema arrives, he hides his feelings and gives her the \"honor\" of leading the next attack."}, {"tag": "h3", "text": "Assault on Ambria"}, {"tag": "p", "text": "Meanwhile, the Jedi Knight Nomi Sunrider, her young daughter Vima Sunrider, and fellow Knight Sylvar travel to the planet Ambria to visit her old Jedi Master Thon seeking solace and training. However, they are followed by Kun's acolyte Crado and the Sith–possessed Oss Wilum. Wilum summons several dark side Hssiss to attack the Jedi including Master Thon and Sylvar."}, {"tag": "p", "text": "However, the Jedi fight back with Nomi using her battle meditation skills to distract and defeat the dark side monsters. Thon and Sylvar also manage to kill several of the beasts. Thon incapacitates Wilum while an enraged Sylvar attacks Crado for his treachery, scarring his face. Crado escapes offworld while Nomi and Sylvar attend to Wilum. Master Thon fears that he was the target of a Jedi student seeking to murder his own master and hopes that the other Masters are safe."}, {"tag": "h3", "text": "Jedi bloodbath"}, {"tag": "p", "text": "Across the galaxy, Exar Kun's corrupted Jedi students murder their masters. One of them Zona Luka fatally wounds her Master Dominus in a lightsaber duel but the mortally wounded Dominus also kills her."}, {"tag": "p", "text": "Later, the Jedi Knights Qrrrl Toq, Dace Diath and Shoaneb Culu discover the dead Luka and the robes of her Master Dominus, who has become one with the Force. Shoaneb realizes that the killings of Jedi Masters was the cause of the great disturbance that she had sensed through the Force. The three Jedi surmise that Ulic Qel-Droma and Exar Kun are waging wasr on the Jedi through military might and evil use of the Force."}, {"tag": "h3", "text": "Purging the ranks"}, {"tag": "p", "text": "Following his failed assassination attempt on Master Thon, Crado manages to convince Exar Kun to give a second chance by accompanying Aleema in an attack on Kemplex IX in order to draw the Republic fleet away. Inside the control room of Naga Sadow's warship Corsair, Exar Kun briefs Aleema and Crado on how to us crystals to wrench fire from the stars."}, {"tag": "p", "text": "Mandalore the Indomitable is upset that Ulic has not given him the chance to lead the mission but Ulic reassures him that he knows that Aleema is a traitor who will still play into their hands. Ulic also regards Crado as weak and a liability. Before Aleema and Crado depart for the assault, Ulic and Exar Kun tell them that they will bring glory and victory while concealing the true purpose of their mission."}, {"tag": "h3", "text": "The Sith offensive"}, {"tag": "p", "text": "While the Jedi meet to discuss the deaths of eight Jedi Masters at the Great Jedi Library of Ossus, Tott Doneeta informs them that the nearby spaceport city of Kemplex IX is being assaulted by an ancient Sith warship. Master Thon fears this attack is a feint and that the Sith's true target is Ossus. Dace, Shaoaneb, and Qrrrl Toq agree to lead the counter-attack."}, {"tag": "p", "text": "Arriving at Kemplex IX, the Jedi discover that Aleema has killed all life on that station. However, the Jedi and their Republic allies sense the Sith battleship is hiding nearby in the Cron Cluster. As the Jedi fighters and Republic warships approach, Aleema uses the Sith battleship's crystals to rip the core from the center of one of the ten stars in the Cron Cluster. She hurls the flaming radioactive core into the midst of the Jedi pursuers, incinerating them."}, {"tag": "p", "text": "While Aleema and Crado are initially triumphant, they soon discover that Aleema's gambit has set off a chain reaction that also destroys the nine remaining stars. Aleema and Crado are killed. The supernovae also unleashes a wave of devastation that threatens several nearby worlds including Ossus"}, {"tag": "p", "text": "The destruction of the Cron cluster not only eliminates Aleema and Crado but also leaves the Ossus undefended. Ulic and Exar Kun head to Ossus to pillage its Great Library of precious secrets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}