{"url": "Tales_of_the_Jedi_%E2%80%93_The_Sith_War_2", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Tales of the Jedi - The Sith War"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Sith War 2"}, {"tag": "p", "text": "Tales of the Jedi - The Sith War 2 is the second issue of the Star Wars Legends comic book miniseries Star Wars: Tales of the Jedi — The Sith War. It was written by Kevin J. Anderson, illustrated by Dario Carrasco, Jr., and first published on September 19, 1995 by Dark Horse Comics. The issue features the story \"The Battle of Coruscant,\" in which Ulic Qel-Droma's forces invade the Republic capital."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ulic Qel-Droma spent years learning to control the Force. He wanted to be on the side of the good, a member of the Jedi elite. But it is not the Force one must control to become a Jedi; rather, one must learn to control oneself. Ulic Qel-Droma has tasted power, and now he cannot fight the dark hunger inside him…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "Invading Coruscant"}, {"tag": "p", "text": "On Coruscant, Jedi Master Vodo-Siosk Baas and a delegation of Jedi including Cay Qel-Droma, Nomi Sunrider, Tott Doneeta, Sylvar, Dace Diath, Shoaneb Culu, and Qrrrl Toq meet with the  tentacled Supreme Chancellor and Defence Minister Netus, who informs them that the leader of the attack of the Foerost Shipyards was Ulic Qel-Droma. The Republic Navy has been dispatched to meet Ulic at Kemplex IX."}, {"tag": "p", "text": "Cay and Nomi are shocked and horrified. Master Vodo believes that the Sith prophecies are coming true and blames himself for failing to sense his apprentice Exar Kun's hunger for dark side knowledge. At that time, Shoaneb senses a major disturbance in Force as the joint Krath and Mandalorian fleet attacks Coruscant."}, {"tag": "h3", "text": "Exar Kun's new recruits"}, {"tag": "p", "text": "Meanwhile, Exar Kun, along with his new Jedi followers, travel to Yavin 4 aboard his starship Starstorm One. After landing, Kun leads them to his Great Temple. However, Oss Wilum senses that the place is strong in the dark side and tries to return to the ship only to be attacked by Kun's Massassi warriors."}, {"tag": "p", "text": "Kun manages to calm things down but Wilum is concerned about Kun's blindness to the dark side. However, Kun manages to convince the Jedi that he is reclaiming Yavin 4 from the dark side. Leading them to the steps of the temple, he reveals that Odan-Urr's holocron is actually a Sith holocron."}, {"tag": "p", "text": "Claiming that he wants to destroy the holocron, he convinces the Jedi to raise their hands and arms to block the blast. However, Kun's true purpose is to corrupt the Jedi, turning them into Sith acolytes. Only Crado, who has willingly chosen to side with Kun, is unaffected."}, {"tag": "h3", "text": "Siege of Coruscant"}, {"tag": "p", "text": "Meanwhile, the Jedi and the outnumbered Republic defenders battle with the Krath and Mandalorian invasion force. Working with Mandalore the Indomitable and Aleema Keto, Ulic's plan is to capture the Republic War Room and knock out the Republic military command. While Mandalore deploys strike teams, Aleema agrees to use her Sith illusions and to provide a phalanx of Tetan ground troops."}, {"tag": "p", "text": "Working with Netus, Cay manages to reactivate an old laser cannon while Nomi, Dace, Sylvar, Tott, and Master Vodo hold off an armored Mandalorian landing force, taking out two Basilisk war droids. However, ulic and Aleema's Tetan troops managed to fight their way through Republic forces and reach the War Room. Mandalore also acquires a new ion-flow cannon gun."}, {"tag": "p", "text": "Through the Force, Nomi senses Ulic and Aleema in the Republic War Room. There, Ulic tries to force a Republic officer to tell each Admiral to deploy their squadron to the Vento system shipyards in an attempt to cause a hyperspace cataclysm. With Jedi forces approaching the War Room, Aleema betrays Ulic and issues orders for the Krath and Mandalorian forces to retreat. Mandalore also receives these orders and is shocked that Aleema has promoted him to warlord."}, {"tag": "p", "text": "As the Krath and Mandalorians withdraw, the Jedi storm the War Room. Ulic draws his lightsaber but the Jedi disarm him and his soldiers with the Force. Master Vodo and Nomi block Ulic's Jedi powers while the other Jedi trap him in a wall of light. The tentacled Supreme Chancellor thanks the Jedi and announces that Ulic will stand trial and be sentenced to Death."}, {"tag": "h3", "text": "Kun's new disciple"}, {"tag": "p", "text": "Back on Yavin 4, Kun speaks with his new disciple Crado, telling him that the unwary Jedi have absorbed the residue of the Sith exiles and will serve in a different manner. Kun tells Crado that he wants him to stay by his side and that he has many important tasks for him. Kun sends his new Jedi slaves out on a mission to show the Republic and Jedi never to underestimate Sith power."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}