{"url": "Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_4", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Tales of the Jedi - The Golden Age of the Sith"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Golden Age of the Sith 4"}, {"tag": "p", "text": "Tales of the Jedi – The Golden Age of the Sith 4 is the fourth, penultimate issue of the Star Wars Legends comic book miniseries Star Wars: Tales of the Jedi — The Golden Age of the Sith. It was written by Kevin J. Anderson, illustrated by Dario Carrasco, Jr., and first published on January 8, 1997 by Dark Horse Comics."}, {"tag": "p", "text": "The issue features the story \"Pawns of a Sith Lord,\" in which Sith Lord Naga Sadow begins to initiate Gav Daragon in the ways of the dark side."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When Gav and Jori Daragon were first captured by the evil Sith, they feared for their lives. Now, Jori fears for her brother's spirit, as would-be Dark Lord Naga Sadow begins to initiate him into the ways of the dark side of the Force. Naga Sadow is playing a deadly game of chess, and the Daragon siblings are his pawns."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "A new Dark Lord"}, {"tag": "p", "text": "On Ziost, the new Dark Lord of the Sith Naga Sadow receives a mark on his forehead from two Sith pincerbugs."}, {"tag": "p", "text": "Meanwhile, Empress Teta goes with Odan-Urr and Memit Nadill to Coruscant to address the Senate on Odan-Urr's recent vision. The Senate seems completely unconvinced, but Teta vows to strengthen at least the Koros system's army."}, {"tag": "h3", "text": "Sadow's influence"}, {"tag": "p", "text": "Elsewhere, at Naga Sadow's Khar Shian citadel, the Force-sensitive Gav Daragon uses a Sith amulet to conjure up illusions. Sadow compliments Daragon, telling the young Human that he has potential and that the Sith magic that he learns will be a powerful ally in their coming struggle. He tells Gav to learn to become adept with Sith magic if he ones to get home safely."}, {"tag": "p", "text": "Sadow puts the next stage of his plan into action by sending his loyal Massassi warriors to infiltrate Ziost and steal the Starbreaker 12. The Dark Lord then travels to his decoy fortress on the nearby planet of Khar Delba where Jori Daragon is being held. When Jori asks when she can see her brother, Sadow claims he is protecting them since they are both still under the execution order. When Jori tells Sadow that she needs her ship back, he reassures her that he has already made some \"extreme arrangements.\""}, {"tag": "h3", "text": "Kressh's retribution"}, {"tag": "p", "text": "On Ziost, Sadow's Massassi warriors infiltrate the Starbreaker 12's impound hangar and kill Ludo Kressh's guards. Before escaping on the Starbreaker 12, they purposely leave behind behind Naga Sadow's emblem, which Ludo Kressh soon discovers. Realizing that Sadow had staged a false flag attack in order to seize power, Kressh calls together his fellow Sith Lords Horak-mul and Dor Gal-ram, demanding an attack on Sadow's fortress."}, {"tag": "p", "text": "Several days later, Sadow returns to Jori on Khar Delba. He brings a hologram message from her brother Gav, who tells her that Sadow has taught him to use his Force powers in a \"different way\" and that Sadow had made arrangements for them to return to the Galactic Republic."}, {"tag": "p", "text": "Sadow then shows Jori the Starbreaker 12, which he has recovered. He tells her that she is free to go home and to escape from this nightmare. Before Jori can leave, Kressh's fleet, led by Horak-mul and Gal-ram, attacks the icy world. Jori panics and says they have to get to cover. Sadow, however, is not worried, as this is all part of his plan."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}