{"url": "Tales_of_the_Jedi_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi (miniseries)"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi 4"}, {"tag": "p", "text": "Tales of the Jedi 4: The Saga of Nomi Sunrider, Part 2 is the fourth issue in the Tales of the Jedi: Knights of the Old Republic series of comics. It was published on January 18, 1994 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Nomi's doubts"}, {"tag": "p", "text": "On the planet Ambria, Nomi Sunrider, now under the Jedi tutelage of Master Thon, sits outside with her daughter Vima, who happens to be playing with a group of neeks. Vima chases the neeks to the hazardous Lake Natth, where she is confronted by a pair of hssiss, who quickly scare off the neeks. Nomi runs after Vima and saves her by using her battle meditation against the beasts, making them attack each other."}, {"tag": "p", "text": "Nomi warns Vima never to go near the lake. While coming to terms with her newfound Force powers, Nomi struggles with self doubt about her Jedi path. These doubts are amplified by the dark side influence emanating from Lake Natth. Nomi is still traumatized by the death of her late husband Andur Sunrider, pondering why the Force failed him on the day he was murdered."}, {"tag": "p", "text": "When Vima asks if her father is coming back, Nomi says that she wishes it were true but says that she doesn't think they'll be seeing or hearing from him again. Aware of Nomi's pain and grief, Jedi Master Thon has left her alone for several months. Through the Force, he is aware of greater events taking place in other parts of the galaxy. Thon foresees that Nomi will become a great Jedi who will be remembered for her deeds of bravery as long as the Jedi Knights survive."}, {"tag": "h3", "text": "A pirate expedition"}, {"tag": "p", "text": "Meanwhile, somewhere in the Stenness Node, ore-shuttler Captain Gruna's Ithullian ore hauler is ambushed by pirate captain Finhead Stonebone's pirate gang. Gruna's hired security from Bogga the Hutt arrives, but isn't able to help very much, as the lone pilot Dreebo's Light tactical fighter is shot down. Pirate captain Finhead's E-2 Asteroid Miners Marauder Starjacker and Stenness Raider insert their long snouts into the ore hauler, sucking up innumerable amounts of mutonium and captives."}, {"tag": "p", "text": "Unfortunately for the pirates, they are soon sucked up by Bogga's Core Galaxy Systems Dreadnaught Enforcer One which heads towards Bogga's private moon, orbiting Taboon. Several armed Weequay guards confront the prisoners, forcing them out of their marauder ships. Finhead is horrified to learn that Boga, the crime boss of the Stenness Worlds, has a presence in the system."}, {"tag": "h3", "text": "Oss and Tott's departure"}, {"tag": "p", "text": "Back on Ambria, Oss Wilum repairs the damaged A-3DO, having taken several months to obtain the spareparts due to the planet's remoteness. When Nomi asks why Master Thon chose to live on such a bleak land, Wilum explains that Thon wanted to test himself and drove the dark side energies back into the wilderness. Nomi is frightened of Master Thon but Oss vouches for him, saying he is the best Jedi Master he has met but warns that he can be scary and testing."}, {"tag": "p", "text": "Oss tells Nomi that he will be departing with the Twi'lek Tott Doneeta to assist Master Arca Jeth and his apprentices Ulic and Cay Qel-Droma in the recent Naddist Uprising on Onderon. Nomi and Vima stay behind with Master Thon on Ambria."}, {"tag": "h3", "text": "Hutt entanglements"}, {"tag": "p", "text": "On the Taboon moon, the Enforcer One brings Finhead Stonebone and his fellow pirates to face justice at Bogga's palace. Bogga is dealing with one of his subordinates Gudb, who has failed to bring him the Adegan crystals. Bogga threatens to feed him to his pet hssiss Ktriss."}, {"tag": "p", "text": "Shortly later, Finhead is brought before Bogga to be \"sentenced\" for robbing his friend Captain Gruna. Instead of killing him, Bogga decides to show \"mercy\" to Finhead and tells him about trouble with Master Thon, who has his Adegan crystals."}, {"tag": "h3", "text": "Nomi's fears"}, {"tag": "p", "text": "Meanwhile, Nomi learns that she can understand Master Thon through the Force. While her daughter Vima cuddles a toy Ewok, Thon tells her that she will use the adegan crystals to build her first lightsaber. However, Nomi is still tormented by the fact that she killed the criminals who murdered her husband Andur."}, {"tag": "p", "text": "Thon tells Nomi that she was acting in self-defense rather than vengeance. He tells her that she has shown great natural skill with the lightsaber. Nomi responds that she will accept her training as long as she does not have to use a lightsaber. While believing that Nomi is destined to used a lightsaber, Thon relents and invites Nomi and Vima on a tour of her world."}, {"tag": "p", "text": "Before leaving, Nomi invites A-3DO but the droid declines due to his joints. If they and Master Thon don't return, Nomi tells A-3D0 to take the ship SunGem and to tell Master Chamma everything that has happened. While Nomi is afraid of Master Thon, Vima does not share her mother's fear of the alien."}, {"tag": "h3", "text": "Impressed into Hutt service"}, {"tag": "p", "text": "Unwilling to face a Jedi, Finhead declines the job offer and asks for an easier one. Bogga orders a Weequay guard to unchain Finhead's first mate Roko. Graballa unleashes his Hssiss Ktriss on Roko, who is mauled to death in the presence of the other pirates and Graballa. Finhead agrees to find and kill Bogga, who uses Roko's death as a lesson to teach ore pirates not to steal from him."}, {"tag": "p", "text": "Bogga then impresses Captain Finhead into his service, allowing him to ply his trade in order systems but telling him to pay tribute to him each year. With Ktriss disliking the stench of Finhead, Bogga orders the pirate to leave, reiterating his order to bring the Adegan crystals and the remains of Master Thon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ambria is mistakenly referred to as Arkania by Oss Wilum on page 16."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Collected in"}, {"tag": "p", "text": ""}]}