{"url": "Tales_of_the_Jedi_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi (miniseries)"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi 1"}, {"tag": "p", "text": "Tales of the Jedi 1: Ulic Qel-Droma and the Beast Wars of Onderon, Part 1 is the first issue in the Tales of the Jedi: Knights of the Old Republic series of comics. It was published on October 1, 1993 by Dark Horse Comics. The first 12 pages were previewed in black and white in Dark Horse Insider, Volume 2, issues 15 through 20, with 2-page installments in each issue from March to August, 1993."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the tundra world of Arkania, a blindfolded Jedi apprentice Ulic-Qel Droma duels with a Combat-trainer while his Jedi Master Arca Jeth, his brother and fellow apprentice Cay, and Tott Doneeta watch. Ulic manages to use the Force to cut off the droid's right arm. After Cay repairs the droid's arm, Master Arca and his apprentices sit down for a meal."}, {"tag": "p", "text": "Master Arca Jeth tells the history of the planet Onderon to his apprentices Ulic, Cay, and Tott Doneeta. Eons ago, the atmospheres of Onderon and its moon Dxun were briefly connected, allowing the flying Drexl beasts of Dxun to fly to Onderon, terrorizing the human Onderonian inhabitants. Then, as the great city of Iziz was built, the criminals were cast out into the wildlands, where they eventually learned to tame the Drexl beasts, using them to attack Iziz."}, {"tag": "p", "text": "Master Arca explains that he has been chosen as the Jedi watchman of the Onderon system, and sends Ulic, Cay and Tott to Iziz to settle this 300-year conflict known as the Beast Wars. The three young apprentices travel to Iziz on the Nebulon Ranger. After dodging Beast Riders, the Jedi manage to land at the Royal Citadel."}, {"tag": "p", "text": "Upon landing, they are greeted by the Onderonian Minister of State Novar. The Twi'lek Tott is briefly detained due to the Royal Citadel's ban on aliens. However, Queen Amanoa intervenes and grants an audience to the three offworlders. After the Jedi state their mission, Amanoa claims that her city is being plagued by the Beast Riders."}, {"tag": "p", "text": "Shortly later, several Beast Riders burst into Queen Amanoa's throne room. The Jedi put up a valiant fight against the Beast Riders but are unable to sop the Beast Riders from kidnapping Queen Amanoa's daughter Princess Galia. Amanoa sends the Jedi out into the wildlands to save her. Led by the headstrong and over-confident Ulic, the three Jedi follow the trail of the Nebulon Ranger but their ship is shot down by one of the Beast Riders' seeker-torpedoes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}