{"url": "Tales_of_the_Jedi_%E2%80%93_The_Sith_War_6", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Tales of the Jedi - The Sith War"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Sith War 6"}, {"tag": "p", "text": "Tales of the Jedi - The Sith War 6 is the sixth and final issue of the Star Wars Legends comic book miniseries Star Wars: Tales of the Jedi — The Sith War. It was written by Kevin J. Anderson, illustrated by Dario Carrasco, Jr., and first published on January 1, 1996 by Dark Horse Comics. The issue features the story \"Dark Lord,\" which depicts Sith Lord Exar Kun's final stand on Yavin 4."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The storm clouds of battle gather over Yavin Four, and that entire world could be a casualty! To make his final stand against Jedi Nomi Sunrider, the betrayer Ulic Qel-Droma has let slip the dogs of war in a final, climactic confrontation."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "Mandalorians on Onderon"}, {"tag": "p", "text": "Above Onderon, Mandalore the Indomitable leads a phalanx of Mandalorian warriors riding Basilisk war droids into the moon Dxun, taking advantage of the close orbital alignment between the moon and its planet."}, {"tag": "p", "text": "At the Iziz Royal Palace, Oron Kira and Queen watch the invading Mandalorians flying towards their city. Oron rouses the Beast Riders and their Drexl war mounts. The Mandalorians demand the city's surrender but are met by fierce resistance from the Best Riders, whose war beasts matches the technological might of the Mandalorians. Lord Kira also requests reinforcements from the Galactic Republic."}, {"tag": "h3", "text": "Evacuation of Ossus"}, {"tag": "p", "text": "While Jedi Master Thon reflects on the tragic events, Jedi Knight Nomi Sunrider is horrified by her actions in stripping the fallen Ulic Qel-Droma of his Force powers. As Ulic struggles with his guilt, Oss Wilum convinces Ulic to help them stop the Dark Lord Exar Kun. Ulic agrees to help lead the Jedi to Kun's base on Yavin 4."}, {"tag": "p", "text": "Before evacuating Ossus, Master Thon farewells Master Ood Bnar, who has decided to remain behind to face the shockwave. The Jedi evacuate Ossus before the shockwave unleashed by the explosion of the ten suns of the Cron Cluster hits the planet. As Ossus burns, the Jedi vow to defeat the Sith and head towards Yavin 4."}, {"tag": "h3", "text": "Mandalore's last stand"}, {"tag": "p", "text": "Back on Onderon, Republic reinforcements led by Captain Vanicus arrive, forcing the Mandalorians into retreat. Unwilling to surrender and with his orbiting battleships destroyed, Mandalore the Indomitable and his surviving warriors flee to Dxun. His Basilisk war droid is hit by enemy fire and crash-lands on Dxun. Mandalore is soon attacked by two jungle beasts."}, {"tag": "h3", "text": "Fall of the Sith"}, {"tag": "p", "text": "Seeking to end Exar Kun's Great Sith War, a large Jedi armada arrives above Yavin 4. Nomi Sunrider intends to create a wall of light either to cleanse or destroy the Sith influence. Ulic tries to convince Exar Kun to surrender while Master Thon adds that the dream of a Sith golden age is a nightmare from which they must await."}, {"tag": "p", "text": "Unwilling to concede, Exar Kun consults the Sith scrolls for information on how to survive to fight in other ways. Kun sends one of his Massassi warriors into the isolation chambers beneath the Sith temples on Yavin 4. Seeking to break free of his mortal body and run rampant across the galaxy, Kun summons the Massassi for a ritual to drain their energies for this spell."}, {"tag": "p", "text": "The wall of light generated by the Jedi clashes with the Sith energy generated by the Masassi, triggering a massive firestorm that incinerates the entire moon. Nomi, Thon, and Ulic realize that they have defeated Kun but ponder the cost of victory. With the Sith threat vanquished, the Jedi armada departs to begin the work of rebuilding the galaxy."}, {"tag": "p", "text": "Exar Kun gathers the last of his Massassi and tells them to hide, as backup, in case Kun is unable to defeat the Jedi. Exar Kun performs a Sith ritual, sacrificing his own body to create a giant fire all across Yavin 4. The Jedi believe that the fire has killed Kun and they retreat."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "On Dxun, the Mandalorian warriors find Mandalore the Indomitable's dead body. Seeking to continue their traditions, one of the Mandalorians dons Mandalore's helmet and names himself Mandalore the Ultimate."}, {"tag": "p", "text": "Two years later, Ulic returns to Yavin 4 on his ship Cay's Dream to find a way to restore his Force powers but finds nothing. However, Exar Kun is still alive and senses Ulic, but is trapped and unable to act."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}