{"url": "Tales_of_the_Jedi_%E2%80%93_The_Sith_War_3", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Tales of the Jedi - The Sith War"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – The Sith War 3"}, {"tag": "p", "text": "Tales of the Jedi - The Sith War 3 is the third issue of the Star Wars Legends comic book miniseries Star Wars: Tales of the Jedi — The Sith War. It was written by Kevin J. Anderson, illustrated by Dario Carrasco, Jr., and first published on October 17, 1995 by Dark Horse Comics."}, {"tag": "p", "text": "The issue features the story \"The Trial of Ulic Qel-Droma,\" in which Exar Kun rescues Ulic Qel-Droma from the Galactic Republic."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ulic Qel-Droma has fallen victim to the spell of the dark side, and now he must stand before the Jedi masters to answer for his crimes. But another from within the Jedi ranks has taken up his mantle of evil. Exar Kun is turning his doting apprentices into Sith-possessed assassins and sending them out to kill the Jedi masters, and the fate of the entire Jedi force hangs in the balance!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "Sorrows of a master"}, {"tag": "p", "text": "On Dantooine, Jedi Master Vodo-Siosk Baas struggles with his failure to stop the corruption of his apprentice Exar Kun and the Great Sith War. Believing that Ulic Qel-Droma is merely a victim, Vodo travels to Coruscant to make things right."}, {"tag": "h3", "text": "Loyalty and honor"}, {"tag": "p", "text": "In Cinnagar, Aleema Keto feeds several Krath commanders who questioned her right to rule to pet creeper. Meanwhile, Mandalore the Indomitable investigates abortive attack on Coruscant, seeking to ascertain why the attack failed. Mandalore proposes rescuing Ulic but Aleema is unconcerned, claiming that the Jedi will only reprimand Ulic."}, {"tag": "p", "text": "Determined to continue the Krath campaign of conquest without Ulic, Aleema orders a strike on Kemplex IX. Unwilling to abandon his leader Ulic, Mandalore resolves to rescue him."}, {"tag": "h3", "text": "Jedi pain"}, {"tag": "p", "text": "At the Senate Hall on Coruscant, Ulic's brother Cay and former friend Nomi Sunrider attend the court proceedings, intending to speak on his behalf. Cay is unwilling to give up on his brother but Nomi believes that Ulic is no longer the man that she knew and love. A defiant Ulic is led to the dock where he likens the Krath and Mandalorian offensive to an \"avalanche.\""}, {"tag": "h3", "text": "Helping an ally"}, {"tag": "p", "text": "On Yavin 4, the Dark Lord of the Sith Exar Kun sends off his new corrupted apprentices to kill their Jedi Masters in order to make way for a new golden age of the Sith. Kun assigns his acolyte Crado to accompany Oss Wilum on an assassination attempt on Master Thon but vows to deal with his former Master Vodo himself."}, {"tag": "p", "text": "Shortly later, Mandalore the Indomitable arrives on shuttle and informs Exar Kun that his master Ulic has been captured. Kun reluctantly agrees to help in order to teach Ulic a lesson and to show the Republic that they have no hope against the Sith. Kun and Mandalore depart on his Sith warship Corsair for the Coruscant."}, {"tag": "h3", "text": "Ulic's trial"}, {"tag": "p", "text": "The tentacled Supreme Chancellor charges Ulic with several crimes including the destruction of shipyards, the looting of supply bases, the enslavement of mercenaries, and betraying his vow as a Jedi Knight to protect the Republic. Ulic is defiant and says that the glory of the Sith will bring the Republic's accomplishments to dust."}, {"tag": "p", "text": "Cay tries to speak on his brother's behalf, saying that Ulic has been greatly affected by the death of Master Arca Jeth and that he tried to infiltrate the Krath but that they have somehow warped him. Ulic doesn't warn his brother to interfere, saying that he doesn't understand anything. The trial is interrupted by the arrival of Exar Kun, Mandalore, and several Massassi warriors."}, {"tag": "h3", "text": "Uninvited guests"}, {"tag": "p", "text": "Kun uses the dark side to unlock Ulic's chains and to freeze the senators and guards. However, the Jedi and the Supreme Chancellor are unaffected. Mandalore apologizes for being late but Ulic is impressed by the devotion of his vassal. Nomi tries to reason with Ulic but he warns her not to interfere because he doesn't want to hurt her."}, {"tag": "p", "text": "The Cathar Sylvar fights and kills several Massassi warriors. She demands to know what Kun has done to her mate Crado. Kun replies that Krado is learning ways to make himself strong and that she has sent him on an errand. While Ulic keeps the Jedi occupied, Kun confronts the Supreme Chancellor and uses his Sith powers to take over the Chancellor's mind."}, {"tag": "p", "text": "Under Kun's control, the Chancellor gives a speech denouncing the Republic and heralding a new golden age of the Sith. Cay tries to reason with Ulic but Ulic warns that he will have to kill him if he gets in his way."}, {"tag": "h3", "text": "Master and apprentice"}, {"tag": "p", "text": "At that point, Master Vodo enters the Senate Hall, intending to put a stop to his fallen apprentice Exar Kun. The two speak in private. Boasting that he has exceeded his Sith predecessors, Kun offers Master Vodo a place in his new Sith Brotherhood but Vodo rejects it. Kun ignites his double-bladed lightsaber and challenges Vodo to a duel, saying that he must join the Sith Brotherhood if Kun wins."}, {"tag": "p", "text": "Master Vodo refuses to Kun's demands and fights back with his wooden staff. Vodo tries to appeal to Kun to return to the light but Kun is unwilling to give up his new-found power and empire. After a fierce fight, Kun strikes down and kills Master Vodo, who becomes one with the Force."}, {"tag": "p", "text": "An enraged Sylvar tries to avenge Master Vodo but is thrown back by Kun's Massassi guards. Having made their point, Kun leaves with Ulic and Mandalore. Nomi and Cay comfort a grieving Sylvar."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}