{"url": "Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - Dark Lords of the Sith"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi – Dark Lords of the Sith 2"}, {"tag": "p", "text": "Tales of the Jedi: Dark Lords of the Sith 2: The Quest for the Sith is the second issue in the Star Wars: Tales of the Jedi - Dark Lords of the Sith series of comics. It was published by Dark Horse Comics on November 1, 1994."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "An unwelcome visitor"}, {"tag": "p", "text": "A month after the outbreak of the Krath uprising in the Empress Teta system, Cay Qel-Droma and Tott Doneeta await a Jedi archaeologist on Onderon. He is to investigate and collect Sith artifacts discovered in the remains of King Ommin's Lair. The archaeologist, who turns out to be Exar Kun, arrives and inquires about the artifacts. He is met with resistance and complains to Master Arca, who sees through his ploy. Kun immediately departs for Iziz."}, {"tag": "h3", "text": "Krath magic"}, {"tag": "p", "text": "Meanwhile in the Empress Teta system, the Krath led by Satal and Aleema rapidly conquer the system's seven worlds. Aleema uses her dark side powers to alter the perceptions of their enemies, allowing them to conquer six of the system's worlds. Only Koros Major is able to defy the Krath. The cousins command the assault on Koros Major from an orbital command station."}, {"tag": "p", "text": "Led by Ulic Qel-Droma and Nomi Sunrider, a joint Galactic Republic and Jedi peacekeeping fleet arrives to aid Koros Major's resistance against the Krath. Aleema uses Sith magic to conjure up legendary space creatures known as space grazers. However, Nomi is able to see through the illusions through the Force and uses battle meditation to guide the Republic and Jedi fleet."}, {"tag": "h3", "text": "Kun's journey into darkness"}, {"tag": "p", "text": "Back on Onderon, two Naddists Nebo and Rask give a speech praising Freedon Nadd, King Ommin and Queen Amanoa and denouncing the Jedi. This angers the crowd who pelts them with stones. However, a lightsaber–wielding Exar Kun intervenes and takes the two mean away. The two Naddists agree to guide Kun to the tomb of Freedon Nadd on the Dxun moon."}, {"tag": "p", "text": "After killing an Onderon beast, Exar Kun enters the tomb, which is constructed of Mandalorian iron. After using his lightsaber to break through the tomb, he  discovers the sarcophagi of King Ommin, Queen Amanoa, and Freedon Nadd. The apparition of Nadd appears and guides Kun to a set of scrolls written by Naga Sadow. He is told to travel to the world described by the scrolls."}, {"tag": "p", "text": "As Kun exits the tomb, he is accosted by Nebo and Rask, who demand that he give them the scrolls. Giving into the dark side, Kun strikes them down with Force lightning. While disturbed by the dark side, Kun resolves to uncover the secrets of the Sith scroll."}, {"tag": "h3", "text": "The dark side advances"}, {"tag": "p", "text": "Back in the Empress Teta system, the joint Republic and Jedi fleet bombards the Krath command shuttle, having realized that the space grazers were dark side illusions. In response, Satal launches a swarm of Chaos fighters to counter the Republic and Jedi assault. Nomi Sunrider uses the Force to touch the mind of Aleema, assaulting her thoughts."}, {"tag": "p", "text": "Despite the illusions fading, Satal had mixed several Chaos fighters among Aleema's illusions, which launch suicide attacks on the Republic ships. Ulic is wounded by flying shrapnel when a Chaos fighter rams into the bridge of the Republic flagship Reliance. While Captain Vanicus orders a retreat, Nomi tends to the wounded Ulic."}, {"tag": "p", "text": "Meanwhile, Exar Kun translates the Sith scrolls using an electronic translator aboard his ship Starstorm One. The scrolls tell him that one the Dark Jedi had dominated the Sith, they threatened to subvert the existence of the Republic. Facing extermination, the Sith wandered from system to system until they reached Korriban. Using this knowledge, Kun sets a course for Korriban."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}