{"url": "Battle_of_Duro_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Battles of Duro", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of Duro  (Yuuzhan Vong War)"}, {"tag": "p", "text": "The Battle of Duro during the Yuuzhan Vong War was a loss for the New Republic. Duro was the first Core world to be conquered by the Yuuzhan Vong. The New Republic had planned to make the polluted world habitable again in order to house millions of displaced refugees."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the battle, the Yuuzhan Vong deployed Dovin basals which pulled all the floating cities down onto the planet. All these cities were destroyed upon crashing on Duro's surface except Urrdorf City, which managed to escape along with thousands of Duros. The Yuuzhan Vong also deployed the Ychna—a giant space snake that attacked the orbital floating city of Orr-Om and two powerful serpentine monsters called Tu-Scart and Sgauru. However, the Jedi Knight Anakin Solo succeeded in destroying the Ychna by firing a proton torpedo into its mouth. Yet, the Yuuzhan Vong succeeded in conquering Duro."}, {"tag": "p", "text": "During the battle, Leia Organa Solo was captured by Warmaster Tsavong Lah, who tortured her to the brink of paralysis. Lah intended to sacrifice Leia to Yun-Yammka, the God of War and the patron deity of the Warrior caste. Jacen Solo, Leia's son, managed to locate Leia, but Lah was unconcerned, as he had heard Jacen was a pacifist. Jacen himself had tried to withdraw from the Force to try to stop his role in the violence, and it was either use the Force or let his mother die. In the end, Jacen barely had to think. Using the Force to create a whirlwind of loose objects around the room, Jacen managed to knock Lah out a window, tearing the Warmaster's left foot loose."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath of his defeat, Lah offered to halt the invasion at Duro, and leave the rest of the galaxy in peace. In return, Tsavong Lah, a fanatic against the Jedi, called for the lives of every Jedi alive. Any world which gave a Jedi refuge would be targeted for attack. Most of the galaxy confused non-Jedi Force-sensitives as Jedi and included them in the list."}, {"tag": "p", "text": "Nas Choka, Lah's eventual successor as Warmaster, criticized this decision from day one, believing that Lah spent too much of his resources trying to destroy the Jedi. However, many planets took Lah at his word. Several Jedi Knights were killed or betrayed to the Yuuzhan Vong in hopes of protection or fair treatment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}