{"url": "Tales_of_the_Jedi_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi (miniseries)"], "nodes": [{"tag": "h1", "text": "Tales of the Jedi 5"}, {"tag": "p", "text": "Tales of the Jedi 5: The Saga of Nomi Sunrider, Part 3 is the fifth issue in the Tales of the Jedi: Knights of the Old Republic series of comics. It was published on February 1, 1994 by Dark Horse Comics."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Hutt entanglements"}, {"tag": "p", "text": "On the Taboon moon, the pirate Finhead Stonebone, seeing his first mate Roko slaughtered by Ktriss, pledges himself into the service of Bogga the Hutt. Bogga makes Finhead his vassal and tasks him with recovering the Adegan crystals and killing Jedi Master Thon."}, {"tag": "h3", "text": "Master and apprentice"}, {"tag": "p", "text": "Meanwhile on the planet Ambria, Master Thom begins Nomi Sunrider's Jedi training. He tells her that it is not enough for a Jedi to know the light but that they must also feel the tension between the two sides of the Force. He explains that the dark side challenges and tests them, frocing them t reach beyond themselves like when she rescued her daughter Vima Sunrider."}, {"tag": "p", "text": "When Nomi recalls that Oss Wilum told her that Thon chose Ambria because the dark side dwells there, Thon explains that the planet had a great darkness but that drove it into Lake Natth. Thon wants to rest near the lake but Nomi is worried because this is where the hssiss that attacked her child live. Thon instead takes Nomi and Vima to a nearby rift to meditate."}, {"tag": "p", "text": "There, Master Thon explains that the Force is deeper in this rift. He also tells her that Jedi can learn to use their lightsabers as an instrument of meditation for focusing the mind and strengthening their connection to the Force. He tells her that she must construct a lightsaber using the adegan crystals she brought. Still feeling guilty about killing the two criminals in self defense, Nomi refuses to have anything to do with lightsabers."}, {"tag": "h3", "text": "A history lesson"}, {"tag": "p", "text": "Respecting Nomi's wishes, Master Thon instead brings Master Arca Jeth's holocron to educate Nomi and Vima about the history of the Force and the Jedi. At Thon's prompting, the holocron's gatekeeper Master Ood Bnar recounts the history of the Jedi Order's wars with the armies of the dark side. He explains that the Force has always been with them, surrounds and penetrates them. Those who are Force-sensitive can use it for good and evil."}, {"tag": "p", "text": "Bnar explains that evil began before recorded history when magicians used dark side powers to make themselves into kings and gods, exploiting the weak-minded. Bnar also explains that dark siders also used their dark powers to wage war, destroying entire nations and civilizations. Some of these dark siders were Jedi."}, {"tag": "p", "text": "When Master Thon tells Master Ood that the Jedi of his time whisper of a coming conflict, Bnar prophesies that the shadow of the dark side will eventually fall across the galaxy in their day. Bnar also prophesied that Nomi would play an important part in the battles to come. Not understanding the situation, the young Vima is frightened by the holocron."}, {"tag": "p", "text": "In return for the adegan crystals, Master Thon gifts Nomi his lightsaber, which he trained under his master. Unwilling to continue with her Jedi training due to her fear of lightsabers, Nomi considers returning to her homeworld to start a new life."}, {"tag": "h3", "text": "The pirate attack"}, {"tag": "p", "text": "While Nomi struggles with Ood Bnar's prophecy, Finhead Stonebone's pirate gang and Booga's enforcers travel on their E-2 Asteroid Miners Marauder Starjacker and Stenness Raider to Ambria. The pirates deploy Armored skiffs and attack Master Thon's hut. A-3DO flees the bombardment. Master Thon thinks it is an opportunity for Nomi to use her lightsaber but she refuses to use it."}, {"tag": "p", "text": "Against Nomi's protest, Master Thon rides with her and Vima towards the pirates' armored skiffs. Refusing to wield her lightsaber, Nomi takes her child to safety. She hides behind a rock with A-3DO and they make plans to flee aboard the Lightside Explorer. With his apprentice unwilling to fight, Master Thon surrenders to Finhead's pirate gang and Bogga's enforcers."}, {"tag": "p", "text": "Speaking telepathically, Master Thon convinces Nomi to use her battle meditation skills to pit the pirates against Bogga's enforcers. Finhead wants to take the crystals to Bogga while other gangsters want it for themselves. Watching the gangsters fight, Nomi has a change of heart and decides to wield Master Thon's lightsaber. She kills several pirates and gangsters. Thon joins the fight and unleashes powerful waves of Force energy. The pirates fleet aboard their skiffs. Standing over the remains of fallen pirates, Thon says that nobody wants enemies but that they can be useful because they force us to reach beyond ourselves and find courage."}, {"tag": "h3", "text": "A new chapter"}, {"tag": "p", "text": "That night, Master Thon says that the holocron prophesied that Nomi would become a great Jedi. He coppiments her for using her Jedi powers well. While cuddling her daughter Vima, Nomi says that she could not have done it without Master Thon. She believes that his Force powers amplified hers. Thon disagrees and says that he left her entirely to her own devices. Nomi decides to join the Jedi's battle against the dark side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}