{"url": "Taleucema", "categories": ["Category:Legends articles", "Category:Capital cities", "Category:Confederacy of Independent Systems cities", "Category:Galactic Empire cities", "Category:Galactic Republic cities", "Category:Saleucami locations"], "nodes": [{"tag": "h1", "text": "Taleucema"}, {"tag": "p", "text": "Taleucema was the capital city of the Outer Rim planet Saleucami. Established by Pantoran colonists when the planet was first settled, Taleucema was the planet's primary trading hub and home to the world's primary spaceport."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Built within a massive, fertile crater nearly sixteen kilometers across, Taleucema was a large city on the surface of Saleucami. Taleucema was a Pantoran word that translated as \"verdant\" or \"rich\" due to the location's abundance of growing things and wildlife. The spaceport, which dominated the northeastern sector of the city, was constantly busy with traffic from both local populations and cargo and trading vessels from offworld. The areas around the docking bays were brightly illuminated, in order to counter Saleucami's dim natural lighting. Patroled by an effective security force of droids and living guards, the port was the lifeblood of the city. The Traders' Belt was the name of the neighborhood that bordered the spaceport; it was comprised of cantinas, gambling dens, high-end retail, massage parlors, and was one of the cities largest entertainment centers catering to the crews servicing the ships flying in and out. Roads criscrossing the city were crowded with pedestrians and landspeeders during the day, giving way to street gangs and individuals of sinister demeanor in the evenings. The Paradise was a cantina located in the Belt, and was well-known by anyone familiar with the city. The Warren was a neighborhood located on the eastern wall of the crater and was considered an overcrowded slum. The buildings were crumbling ferrocrete tenements connected by a network of tunnels and caves carved from the crater's sandstone wall.Populated by the city's undesireables, the Warren was prone to casual violence from gangs warring with one another. The largest gangs, Yellow Thaelos and the Stoneskins, clashed over control of the region. The outskirts of the city were dominated by fields of bubse trees; the city featured the only mass production facility on the planet to produce bubse tree extracts and medicines."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}