{"url": "Tallisibeth_Enwandung-Esterhazy", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Tallisibeth Enwandung-Esterhazy"}, {"tag": "p", "text": "Tallisibeth Enwandung-Esterhazy, better known by her nickname Scout, was a Force-sensitive female Human Jedi Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the time of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi training"}, {"tag": "p", "text": "A native of Vorzyd V, the young Human Force-sensitive Tallisibeth Enwandung-Esterhazy was born to poor parents in the slums of their world. When a recruiter for the Jedi Order passed through the planet's ports, the family begged the Jedi to take their child offworld and train her in the Order. Turning the girl over to the Coruscant Jedi Temple, Enwandung-Esterhazy entered into the Temple's academy and began training in the ways of the Force. Despite her tenacity and will to succeed, Enwandung-Esterhazy had a relatively weak connection to the Force; many of her instructors doubted that she would pass the Trials of Knighthood and that she was destined for the Jedi Service Corps. Earning the nickname Scout due to her ability to quickly analyze a situation using the Force, Enwandung-Esterhazy focused on honing her physical abilities in order to compensate for her poor performance in Force-related exercises."}, {"tag": "p", "text": "During the later stages of the Separatist Crisis, Enwandung-Esterhazy was selected by Master Chankar Kim to be her apprentice, much to the surprise of many of the academy's instructors and students. Under Master Kim's tutelage, Enwandung-Esterhazy constructed a sky blue-bladed lightsaber and honed her abilities in many unorthodox maneuvers. When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Master Kim dutifully accompanied Master Mace Windu to Geonosis on a major rescue mission and laid down her life during the ensuing battle. Devastated when news of her master's untimely death reached the Temple, Enwandung-Esterhazy felt certain that the Council of Reassignment would place her in the Agricultural Corps; a move that was championed by Master Jai Maruk, who expressed his opinion to Grand Master Yoda after the girl had remained at the Temple for two years awaiting reassignment. Master Yoda did not agree with Maruk's assessment, and bet Maruk that Enwandung-Esterhazy would win the annual Jedi Temple Apprentice Tournament, with the wager being that Maruk would choose her as his Padawan should she win. Maruk agreed, and was shocked after Enwandung-Esterhazy survived all eight rounds and won the tournament through creative, non-Force methods. Maruk hesitantly took her as his Padawan, and she ascended to the rank of Commander within the Grand Army of the Republic."}, {"tag": "h3", "text": "Mission to Vjun"}, {"tag": "p", "text": "A few months into the Clone Wars, the Jedi learned that Count Dooku, leader of the Confederacy, had taken over Château Malreaux on Vjun. Dooku then made a plea to Master Yoda, claiming that the war had gotten out of hand and that he was willing to negotiate a truce. Master Yoda selected a small group of Jedi to come along with him to Vjun, bringing Masters Maruk and Maks Leem, as well as their respective Padawans, Enwandung-Esterhazy and Vjun native Whie Malreaux."}, {"tag": "p", "text": "On the way to Vjun, the Jedi stopped at Phindar Station, and were ambushed by Sith assassin Asajj Ventress and a group of assassin droids. During the battle, Masters Maruk and Leem engaged Ventress in a lightsaber duel, but she proved to be the better duelist. Maruk nearly gave in to the dark side, but was calmed by Leem; despite this, Maruk was slashed across the stomach, mortally wounding him, and Leem was stabbed in the back, killing her. As Maruk lay dying, Enwandung-Esterhazy clambered to his side and begged him not to leave her; Maruk promised her that he never would. Enwandung-Esterhazy had lost her second Master to the Clone Wars, but the Jedi pressed on from the station to Vjun."}, {"tag": "p", "text": "After landing planetside, Master Yoda left the Padawans and began negotiations with Count Dooku. In the meantime, the two investigated tremors in the Force that Malreaux had felt, and ended up running into Ventress once more. Both Padawans were quickly captured and Enwandung-Esterhazy was held by Ventress in a Force-grip. Ventress, sensing Malreaux's feelings for Enwandung-Esterhazy, tried to tempt the boy to the dark side by telling him to kiss his vulnerable companion. Holding the life of Enwandung-Esterhazy in her hand, she forced him to choose. Malreaux struggled with the decision, but Enwandung-Esterhazy managed to speak through Ventress' grip, telling Malreaux that she knew he would make the right decision. Malreaux resisted Ventress' temptations, much to her chagrin and, as Ventress prepared to order a cadre of assassin droids to kill the Padawans, Solis arrived and attacked Dooku's acolyte, giving the two adolescents time to escape. Soon, Jedi Obi-Wan Kenobi and Anakin Skywalker arrived to rescue Yoda and the Padawans, and Enwandung-Esterhazy returned with them to Coruscant afterward."}, {"tag": "h3", "text": "The Dark Times"}, {"tag": "p", "text": "Remaining at the Jedi Temple for the rest of the war, Enwandung-Esterhazy was present when Supreme Chancellor Palpatine betrayed the Order and issued Contingency Order 66 to the Grand Army, commanding them to turn their blasters on the Jedi and execute them. Escaping the Temple as Darth Vader invaded with the 501st Legion, Enwandung-Esterhazy was later found by Nyreen Vollen, who brought her to Mandalore in the company of fellow Jedi Kina Ha. When Enwandung-Esterhazy first arrived on Mandalore, her new guardian Kal Skirata was initially shocked by the girl's resemblance to another Jedi, recently deceased Etain Tur-Mukan; the similarities almost brought him to tears and made him struggle to keep his composure. The strill Lord Mirdalan even thought she was Tur-Mukan and got excited upon first seeing her. Enwandung-Esterhazy lived in Kyrimorut and bonded with Mij Gilamar, who agreed to give her some first aid training, and scientist Ovolot Qail Uthan who made Enwandung-Esterhazy her assistant. When Skirata made a deal with fugitive Jedi Master Djinn Altis to take in the Jedi who were staying in Kyrimorut, Enwandung-Esterhazy decided that she wanted to stay on Mandalore with Gilamar and Uthan, but was unwilling to give up being a Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Human female, Tallisibeth Enwandung-Esterhazy was red-haired and had an athletic body; she was considered pretty by fellow Padawan Whie Malreaux, who became infatuated with her. Resembling fellow Jedi Etain Tur-Mukan both physically and personality-wise, Enwandung-Esterhazy was constantly doubting herself, but was very kind and strong regardless, and believed in hard work to overcome obstacles. She was quick to form friendships with people, such as Padawan Ahsoka Tano, with whom she was close friends and received letters from Tano about her experience during the war. She also became close to Cuy'val Dar Sergeant Mij Gilamar and Doctor Ovolot Qail Uthan after the disbanding of the Order, almost starting to become like an adopted daughter to the already close pair. However, despite her fugitive status and the dissolution of the Order, she was not yet ready to become Mandalorian by adoption like former Jedi Bardan Jusik, proud of her Jedi heritage and her accomplishments."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "While Enwandung-Esterhazy was somewhat weak in the Force, she compensated by wearing armor and becoming adept in lightsaber combat and unarmed combat—not to mention a willingness to ignore proper rules of conduct. This latter trait was not always expedient as it could include practices impossible outside training sessions, such as grabbing a training lightsaber blade. She was said to be the favorite student of Master Ilena Xan and possessed natural precognitive abilities which manifested itself in her habit of scoping out a situation and reading it just a little faster than everyone else; a skill which earned her the nickname \"Scout.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}