{"url": "Battle_of_Eliad", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Minos Cluster", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Battle of Eliad"}, {"tag": "p", "text": "The Battle of Eliad was a significant engagement of the Minos Cluster Campaign during the Great Galactic War. Beginning in 3680 BBY, the battle was waged between the forces of the Sith Empire and those of the Jedi Order in alliance with the Galactic Republic. The conflict began when the Empire launched its invasion of the Minos Cluster in the first year of the war, a move that shocked the Republic and sent the capital planet of Coruscant into panic. In response to the offensive, the Jedi High Council dispatched a fleet of battlecruisers to ferry Jedi Knights to the frontlines in the Minos Cluster, including the embattled planet of Eliad, where the Empire had commenced a massive invasion. For months, the Jedi defenders and Imperial conquerors engaged one another in a sustained stalemate, resulting in heavy casualties on both sides. Although the battle for Eliad later turned in favor of the Jedi and Republic, the larger campaign continued throughout the twenty-eight years of the war. The Sith were eventually recalled from the Minos Cluster in preparation for the Sacking of Coruscant in 3653 BBY, effectively forfeiting any persisting contest on Eliad and in the greater Minos Cluster."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Battle of Eliad was a conflict spurred on by the overtures of the Sith Empire during the early days of its invasion of the Outer Rim Territories. In 3681 BBY, the Sith led their refurbished Empire into the Great Galactic War against the Galactic Republic, making many drastic and successful advances into enemy territory. The early focus of the war was in the Outer Rim, where Republic security forces struggled to mount a concentrated defense. As a result, the Empire swept across the Tingel Arm, scattering their opponent's fleets and sending shockwaves throughout the Republic's populace. Deliberation and cooperation turned to gridlock on the Republic's capital world of Coruscant—a situation made even more dire with the Empire's invasion and seizure of the Minos Cluster, a resource-rich region in the Outer Rim."}, {"tag": "p", "text": "While the Republic Senate debated fruitlessly on appropriate courses of action, the High Council of the Jedi Order authorized a fleet of battlecruisers to ferry Jedi Knights to the front for the defense of the Minos worlds. In 3680 BBY, the vessels departed Coruscant, leaving behind the rapidly deteriorating political arena for a rapidly deteriorating tactical theater."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Upon reaching the Minos Cluster, a number of the Jedi vessels deployed to Eliad, where the Empire had launched a massive invasion led by Sith Lords and enforced by numerous Imperial soldiers. The Jedi made landfall and engaged the enemy, but their arrival did not reflect a quick success. Instead, the belligerent forces dug into the world, fighting one another for months on end and suffering heavy losses as a result. The challenges faced by the Jedi were only amplified by events along the Rimma Trade Route, which had been blockaded by Imperial ships to prevent the free flow of goods and war materiel to the frontlines of the Minos Cluster."}, {"tag": "p", "text": "Several months into the engagement, the Jedi began to see increased success in their defensive actions, slowly turning the tide of the battle in their favor. Prior to this point, the Sith had managed to confound their efforts through overwhelming force and control of the Rimma Trade Route, having managed to fend off Republic efforts to free the hyperlane and deliver much-needed supplies to the Jedi combatants. However, around this time the Republic managed to regroup and break the blockade—a development which occurred in conjunction with a significant Jedi victory on Eliad's surface."}, {"tag": "p", "text": "Gnost-Dural, a young Kel Dor Jedi Knight, contributed to that victory on Eliad by dueling with a Sith Lord of the ancient Sith species. Although Gnost-Dural had feared direct confrontation with a member of the notoriously fierce race, he was able to quickly defeat his opponent. After the fight, the Kel Dor Jedi took the Sith's lightsaber for examination and recorded his experiences in a personal war journal."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "During the early days of the battle, riots and violent political demonstrations gripped Coruscant as the planet descended into panic. However, as reports of the Jedi's heroism and sacrifices began to filter back to the Republic's capital, morale was lifted and the demonstrations ended. While senators and Jedi resumed defense negotiations, Republic citizens flocked to military recruitment offices, creating a boom in enlistment numbers. Soon, Republic soldiers began to occupy the front lines, giving the Jedi a much needed reprieve and allowing them to be assigned to other theaters. Gnost-Dural was ultimately reassigned to serve with the Republic Navy and other commanders were brought into the theater. By the third decade of the war, Jedi Master Orgus Din and Havoc Squad's Lieutenant Harron Tavus had been given command of the Republic forces in the Minos Cluster, including any remaining defenders on Eliad. The contest for the Minos Cluster continued throughout the twenty-eight years of the Great Galactic War and only came to an end when the Sith forfeited the region in preparation for their Sacking of Coruscant in 3653 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Eliad was first introduced to Star Wars canon by Robert Chestney in his book, The Journal of Master Gnost-Dural. The book is written as a series of first-person entries into a journal kept by the Jedi Master Gnost-Dural during the Great Galactic War and littered with notations by Grand Master Satele Shan, allegedly added during the Cold War. The Journal of Master Gnost-Dural was released December 16, 2011 as part of the collector's edition bundle of Star Wars: The Old Republic, to which Chestney also contributed."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}