{"url": "Talon_I_combat_cloud_car", "categories": ["Category:Legends articles", "Category:Cloud cars", "Category:Ubrikkian Industries products"], "nodes": [{"tag": "h1", "text": "Talon I combat cloud car"}, {"tag": "p", "text": "The Ubrikkian Talon I combat cloud car was an armed air vehicle designed to fill a niche between starfighters and lighter vehicles like the Storm IV cloud car. Introduced some time before the Battle of Yavin, Talon I combat cloud cars were known to be used until at least the era of the New Jedi Order."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Unlike most airspeeders, which generally had a flight ceiling around a few hundred meters, the Talon I had a ceiling of 100 kilometers. Using the Ubrikkian \"Servant,\" a combined ion/repulsorlift engine, the Talon I could reach an airspeed of up to 1,500 km/h and could fly in environments that prohibited repulsorlift use by using only its ion thrust and aerodynamic design."}, {"tag": "p", "text": "Though unshielded, it had good armor for a vessel of its size. A fire-linked double blaster cannon gave the Talon I sufficient firepower to challenge many starfighters and small transports, and its low cost made it a common sight in the aerospace fleets of many planetary law enforcement and customs agencies. Proper licensing allowed private citizens and organizations to use the Talon I as well."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 1.5 ABY a Corellian gang raided and devastated the headquarters of Corellian Vehicle Reclamation using modified Talon I cloud cars."}, {"tag": "p", "text": "The Noghri used Talon I cloud cars on Honoghr, based out of their main spaceport in Nystao. When Luke Skywalker first visited there, he was escorted by a pair of these craft. They were also used on Bespin and some Imperial-controlled planets, and were known to be popular in the Outer Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}