{"url": "Tallaani_Shipyards", "categories": ["Category:Legends articles", "Category:Shipwrights", "Category:Shipyards"], "nodes": [{"tag": "h1", "text": "Tallaani Shipyards"}, {"tag": "p", "text": "The Tallaani Shipyards, also known as Tallaan Imperial Shipyards, were a number of shipyards in orbit of Tallaan and spread throughout the Tallaan system. The most important of these was located midpoint between Tallaan and its largest moon. The shipyards were made up of several hundred orbital docks, each able to service several dozen large ships or hundreds of smaller craft. Most of the docks themselves were over 200 years old by the time of the Rebellion era, and were continually being updated and revamped to keep them safe and up to current technological standards. The typical dock was manufactured by the Corellian Engineering Corporation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were established in 4000 BBY. By the time of the Rebellion era the yards had been an integral in the interstellar operations of the Republic for several hundred years. The yards manufactured the Mansk-class light escort frigate, Tapani-class assault frigate and the Tapani-class carrier. During this time they were defended by defense platforms manufactured by Golan Arms, and work was always underway on several Star Destroyers in the yards. The yards also refurbished Torpedo Spheres. In order to cover up Grand Moff Wilhuff Tarkin, Admiral Conan Antonio Motti, High General Cassio Tagge, Chief Siward Cass, High General Trech Molock, General Hurst Romodi, Chief Moradmin Bast, and Colonel Wullf Yularen's involvement in the Death Star as well as their death at Yavin 4, their deaths were reported on pro-New Order propaganda sources as being caused by a fiery crash during the final approach for a planned inspection of the Tallan shipyards. Once the New Republic came to power, the shipyards went to work producing warships for the New Republic Navy. During the Yuuzhan Vong Invasion of the galaxy, the Tallaani Shipyards were defended by General Garm Bel Iblis."}, {"tag": "p", "text": "During the Second Galactic Civil War, the Tallaani Shipyards went on to manufacture the new Bothan frigate, which was used by the Confederation in their drive toward Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}