{"url": "Battle_of_Eidoloni", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Eidoloni"}, {"tag": "p", "text": "The Battle of Eidoloni was a conflict in the Eidoloni system between the Galactic Empire and the Alliance to Restore the Republic that took place in 3 ABY."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the investigation of the Comm Center, an Imperial communications relay that was broadcasting Imperial secrets to the Rebel Alliance through an old frequency that was not used for some time by Zaletta, who was willing to defect from the Empire, the Alliance pinpointed the exact location of the defector who was located on a outpost called DX-11a. The Alliance decided to attack the outpost to draw the defector out of hiding and allow him to join without attracting suspicion. However, they believed that the probability of an Imperial response was high. What the Alliance never suspected was that Commander Kupalo was actually a brain-washed spy for the Empire."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "The EF76 Nebulon-B escort frigate Redemption along with 4 T-65 X-wing starfighters arrived at a location nearby the outpost. The 4 X-wings then approached the station and destroyed all the TIE fighters. The two other ships, the container transport Freedon and the Neutron Star-class bulk cruiser Golga'tha also jumped into hyperspace, rendering the base defenseless. After bringing down the shields, 4 Lambda-class T-4a shuttles launched from the station. Red 2, piloted by Ace Azzameen, inspected them and found the last one, AA-23, to contain the defector. The Alliance then sent the shuttle coordinates to rendezvous with the Rebels. The shuttle received the coordinates and left to meet with the Redemption. While that was going on, the fighters finished of the station and returned to the frigate."}, {"tag": "p", "text": "When Zaletta offered his defection and docked with the Redemption, the Imperial II-class Star Destroyer Subjugator and the Immobilizer 418 cruiser Restrainer arrived in an attempt to trap and destroy the Redemption. The Liberty arrived, launching Y-wings in to help destroy the Restrainer and provide cover for the Redemption. Despite the Subjugator's large amounts of TIE fighters, TIE interceptors, TIE bomber and TIE Avengers. The Restrainer was destroyed, allowing both of the Alliance starships to escape into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Zaletta was placed in the Liberty's brig for suspected treachery until the Alliance would verify his claims of ignorance. Meanwhile Kupalo, knowing that soon Zaletta's claims would be verified, would soon attempt to steal the shuttle to try and make Zaletta's defection all for nothing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bonus objectives are to destroy the Space Station DX-11a, all Imperial starfighters and the Subjugator. It is not certain if all of these Bonus objectives are Canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}