{"url": "Talusian_Smugglers", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Pirate organizations", "Category:Smuggling organizations"], "nodes": [{"tag": "h1", "text": "Talusian Smugglers"}, {"tag": "p", "text": "The Talusian Smugglers were a band of smugglers that operated on Talus during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Talusian Smugglers were active on Talus, in the Corellian system during the Galactic Civil War. They had a base located near the city of Nashal."}, {"tag": "p", "text": "After the Battle of Yavin, the smugglers turned their activities to piracy. They  made an arrangement with a traitorous member of the Neetha Den, a Selonians den who lived in a cave near the smuggler base. The traitor proposed the so-called Askura deal to the den mother Kiisa Kimotte and the other Selonians as a partnership with the smugglers. However, the deal was fake and the Selonians were soon exploited by the smugglers. The smugglers captured several Selonians and kept them as hostages in order to force the rest of the den into mining for them. In fact, the captive Selonians were shipped to Ord Mantell and sold as slaves. Nevertheless, not all the smugglers agreed with that and some considered they could make a fine profit without having to exploit the Selonians. The situation generated anti-human sentiments among the Selonian population of Talus and hostile anti-human demonstrations erupted in the city of Nashal. Despite no act of violence against Humans was reported, the local police force and the Cluster World Relations agency issued a travel warning for Nashal. Via Corellia News Service, Marx Grocco, Director of Cluster World Relations, explained that this preventive measure was meant to insure the public safety of Talusian human citizens and human travelers for any possible hostile encounters with non-human protestors."}, {"tag": "p", "text": "Circa 1 ABY, the Corellian Security Force was aware of the situation but the smugglers used the fact that the CorSec could not intervene in Selonians matters. However, Agent Taarna then recruited an independent spacer in order to help the Selonians without involving the CorSec. The spacer later worked with Tika Sileste, Ravi Thienta, Lika Fimente and Kiki Dorente, the advisor to the Neetha den mother, to develop a strategy against the smugglers. The spacer then attacked the base and killed many smugglers, including their leader. The spacer also destroyed the smugglers' droids, and the weapon caches, and retrieved stolen Selonian supplies of food, hides and electronic parts. Although the spacer eventually discovered that the captive Selonians had already been sold as slaves, the assault severely weakened the smugglers and crippled their ability to exploit the Selonians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Talusian Smugglers appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Talusian Smugglers were added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}