{"url": "Talss", "categories": ["Category:Legends articles", "Category:Continents", "Category:Tython locations"], "nodes": [{"tag": "h1", "text": "Talss"}, {"tag": "p", "text": "Talss was the largest continent on the planet Tython. Also known as the Dark Continent, it was sparsely populated and wild."}, {"tag": "h2", "text": "Landscape"}, {"tag": "p", "text": "The continent of Talss was most easily defined by the massive and deep canyon known as the Rift; a thousand kilometer-long stretch of volcanic mountains. Prone to seismic quakes and eruptions, the Rift was riddled with pits of quicksand and acid. The Great Temple of Vur Tepe was constructed over an active volcano in the area of the Rift. Unique wildlife sprang from this region, and the Je'daii Order constructed the Great Temple Anil Kesh over the chasm. Part of the southeastern end of the Tythos Ridge, the Rift was also home to the Abyss of Ruh, a bottomless pit and a well-spring for dark energy."}, {"tag": "p", "text": "Along the northern edge of the Tythos Ridge sat the Great Je'daii Temple of Kaleth, and was later the site of a Jedi Temple and Kalikori village."}, {"tag": "p", "text": "The southern end of Talss featured bizarre and alien landscapes ringed by rolling hills that that descended into wide, endless plains that lacked significant plant growth due to the extremes of the winds. Beyond these plains was the Red Desert, wherein stood the ruins of the Old City. The Je'daii knew of the Old City, which was ancient and abandoned during their time. A sprawling city of tumbled ruins, pyramids, and mysterious caverns and canals, some Je'daii believed that the city was constructed by the Gree; others believed the Gree simply inhabited existing structures long since abandoned. Most of the structures were buried in sand by the time Je'daii Journeyer Lanoree Brock chased her brother, Dalien Brock, into the caverns beneath the city's largest pyramid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}