{"url": "Talz", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Outer Rim Territories species", "Category:Talz"], "nodes": [{"tag": "h1", "text": "Talz"}, {"tag": "p", "text": "The Talz were a sentient species native to Alzoc III and the planet Orto Plutonia, on which they remained undiscovered until the Clone Wars. Their discovery caused a brief war between a Talz village, and the Pantoran Assembly, due to Chairman Chi Cho of Pantora believing they were a hostile force. After the death of Cho, Senator Riyo Chuchi of Pantora talked with, and ended the war with, the Chieftain of the village, Thi-Sen. After this the Talz were officially recognized a free and equal people, and were allowed to live peacefully on their homeplanet."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Talz were large bipeds covered in thick, shaggy white fur with sharp talons capping their five-fingered hands. They possessed four black eyes (the small ones were used for day vision, and the larger ones for night vision) and a small proboscis for feeding and communicating. The shaggy fur coat protected them against the freezing conditions of their ice and snow habitat."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Talz were a primitive civilization that used few tools and lived a simple life in a harsh environment. They organized themselves in tribes led by chieftains, and used the native narglatches as mounts and protection. They had a language of their own, called Talzzi, but were unable to speak Galactic Basic Standard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Talz hailed from Alzoc III and Orto Plutonia, a frigid planet located in the Pantora system. During the Clone Wars, both the Galactic Republic and the Confederacy of Independent Systems attempted to establish outposts on Orto Plutonia, only to be wiped out by the natives. After the attack on the Republic base, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker arrived with a detachment of clone troopers, which included Skywalker's Clone Captain, Rex. The Jedi and clones were also joined by the droids C-3PO and R2-D2, and representatives of the planet Pantora, which was in the same system. These representatives were Chairman Chi Cho, Senator Riyo Chuchi. Cho believed that whoever had attacked the Republic were an aggressive force, and waged war on the Talz who had attacked: Chieftain Thi-Sen and his Talz tribe. The ensuing battle caused heavy casualties on both sides, including the two Pantoran guards who tried to protect the chairman, and the majority of the clone cold assault troopers minus Rex himself and a few other clones. The two Pantoran guards were also killed, and Cho was badly injured. He ordered Chuchi to destroy the Talz, but she refused, as his actions had been seen as being out of order by the Pantoran Assembly. After hearing this Cho was left in disbelief and with his last breaths said that he had died for his people, and then died from his injuries. Chuchi approached Thi-sen, and brought C-3PO as a translator. Chuchi explained that to die for ones people was a great sacrifice, but to live for them was a greater sacrifice. She said she would live for her people, and Thi-sen said he would do the same. The two groups departed as equals, and the Talz were recognized as the sovereign and free people of Orto Plutonia."}, {"tag": "p", "text": "During the Galactic Civil War, the Talz were still a primitive species. They used few tools, and they were only taken to space by slavers."}, {"tag": "h2", "text": "Talz in the galaxy"}, {"tag": "p", "text": "By the time of the Clone Wars, the Talz were not advanced enough to master space travel, and, by the Galactic Civil War, the species was still primitive, and Talz were taken out to space by slavers. During the war, some Talz could be found on planets such as Tatooine, Espirion, and Son-tuul. At least one Talz was present at Chalmun's Spaceport Cantina when Obi-Wan Kenobi saved Luke Skywalker from Cornelius Evazan and Ponda Baba by cutting off the latter's arm."}, {"tag": "p", "text": "By the waning years of the Galactic Civil War, some Imperial personnel considered Talz meat delicious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}