{"url": "Battle_of_Ession", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Battles in the Corporate Sector", "Category:Battles of the Hunt for Zsinj", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Ession"}, {"tag": "p", "text": "The Battle of Ession was a conflict between the New Republic and the forces of Warlord Zsinj. Zsinj planned the battle as a trap, using the Pakkerd Light Transport facility on Ession as bait, in order to destroy several squadrons of New Republic starfighters, including Rogue Squadron. However, the crew of the Corellian corvette Night Caller was being impersonated by Wraith Squadron, and the battle was the culmination of the Wraiths' long-standing charade. While Zsinj intended for Ession to be a mission to deal with what he believed was Rogue Squadron, it was in fact a trap designed to destroy the Imperial-class Star Destroyer Implacable, commanded by Admiral Apwar Trigit. The New Republic forces, though outnumbered, had the element of surprise and were able to destroy the Implacable. Furthermore, Apwar Trigit was killed while attempting to flee the battlefield."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Using the captured CR90 corvette Night Caller, Wraith Squadron had been masquerading as Zsinj's agents while mounting a number of covert air and ground missions to destroy numerous Zsinj-held assets. The Wraiths had originally aimed to destroy Admiral Apwar Trigit's Star Destroyer Implacable in the previous Battle of Talasea, but Trigit had not brought the Implacable into the system, leaving the Wraiths to score only an inconclusive victory. Following this, Zsinj and his subordinate Trigit had determined that a New Republic presence was following the Night Caller and decided to trap the New Republic force, whom they believed was Rogue Squadron and commando support."}, {"tag": "p", "text": "Zsinj sent a transmission to the Night Caller's captain, whom he believed was Zurel Darillian, but was actually Wraith Garik Loran in disguise, informing him of the rendezvous at Ession, the location of a Zsinj-allied starfighter manufacturing plant. Under the command of Atril Tabanne, the Night Caller set a course for Ession while Wraith leader Wedge Antilles contacted his superiors to request reinforcements."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Initial maneuvers"}, {"tag": "p", "text": "While the Night Caller waited in formation with the Implacable around Ession's primary moon, Loran had managed to convince Apwar Trigit to keep the Implacable in one place near a relay dish. Kell Tainer, the unit's backup mechanic and demolitions specialist, had come up with the idea to place a permanent relay dish on the surface of the moon in order to hide their sensor signature, ostensibly to conceal the presence of the Star Destroyer from the New Republic. However, it would actually jam the Implacable's targeting sensors, hopefully preventing severe damage to the much smaller corvette."}, {"tag": "p", "text": "After the Night Caller received a signal informing them of the imminent arrival of other New Republic forces, Trigit called \"Darillian\" to ensure that New Republic forces were expected. Loran experienced a momentary pang of nervousness when Trigit used a catchphrase that Darillian should have been familiar with, but covered his lapse by drawing on his experiences with Ysanne Isard to divert the inquisitive admiral's attention. Furthermore, Loran was able to persuade Trigit to let his TIE fighters escort the Implacable, placing them in a position to deal significant damage to the Star Destroyer. At the last minute, Wedge Antilles and Captain Atril Tabanne switched places, with Antilles commanding the Night Caller and Tabanne piloting a TIE fighter, as Antilles was the more experienced pilot of Corellian corvettes. As a result, Wraiths Wes Janson, Falynn Sandskimmer, and Voort saBinring, along with Tabanne, were in TIE fighters docked into the Night Caller's escape pod hatches while the other Wraith pilots, Eurrsk Thri'ag, Tyria Sarkin, Kell Tainer, Myn Donos, Ton Phanan, and Hohass Ekwesh, waited in their T-65 X-wing starfighters in the Night Caller's hold."}, {"tag": "p", "text": "Shortly afterwards, the cargo transport Red Feathers jumped in-system. The ship was actually the former pirate Super Transport VI Blood Nest, recovered from the moon of the same name and renamed Red Feathers. Additionally, it concealed three New Republic starfighter squadrons and was rigged to detonate upon entering atmosphere, releasing the fighters. On the Implacable, Imperial Intelligence analyst Gara Petothel accurately predicted this strategy and informed Trigit. The transport reported to Ession's spaceport that it was losing structural integrity and would self-destruct to avoid impacting with the planet. An escape pod was launched, which actually contained a commando team led by Judder Page. Page's Commandos sabotaged the launch tubes for the Pakkerd facility's own TIE fighters, denying Trigit his expected reinforcements."}, {"tag": "p", "text": "When the Blood Nest broke apart, X-wings of Rogue Squadron, Y-wings of Green Squadron led by General Horton Salm, and A-wings of Blue Squadron led by General Edor Crespin, escaped from its cargo bay. The Implacable and the Night Caller launched their TIEs. However, while the Implacable's fighters raced ahead to engage the New Republic fighters, the four TIEs from the Night Caller took up station around the Implacable while Garik Loran reported to his starfighter."}, {"tag": "h3", "text": "Surprise attack"}, {"tag": "p", "text": "The Night Caller quickly revealed its true allegiance by firing on the Implacable with its turbolasers and activating its tractor beam. The X-wings in its bow hangar executed a Loran Spitball, which sent a salvo of fourteen proton torpedoes towards the Implacable. Meanwhile, the unit's TIE fighters, designated Gray Flight, opened fire on the unshielded Implacable, hoping to inflict a critical blow. Tabanne, in her TIE fighter, fired a series of laser cannon blasts destroying the Implacable's bridge and shield generators in her surprise attack. Antilles used the Night Caller's large tractor beam to anchor the ship to the moon as her thrusters oriented towards the moon. The thrusters' emission threw up dust from Ession's moon to conceal the corvette from the Implacable's gunners. Antilles then took over as gunner for its main turbolaser turret. The torpedo barrages were able to destroy a large amount of the Implacable's power cells, and with their targeting jammed, the Implacable was unable to effectively employ its batteries. With its starfighters engaged with the three other New Republic squadrons, the Star Destroyer found itself increasingly beleaguered. Trigit recalled his starfighters; however, they were pursued by Rogue and Blue Squadrons while Green Squadron destroyed the TIE manufacturing facility on Ession."}, {"tag": "p", "text": "As the Implacable's fighters raced back, Atril Tabanne's fighter sustained a glancing hit, but she was rescued by Cubber Daine in the Narra, the Wraiths' Lambda-class T-4a shuttle. However, Kell Tainer, suddenly overcome by fear at sighting the returning TIEs, began fleeing the battlefield. His wingmate, Hohass Ekwesh, followed him in an attempt to persuade him to return. Tainer refused and Ekwesh returned to the fight. Tainer suspected that one of the Wraiths would be sent to destroy him for his cowardice. However, he was snapped out of his fear-stricken state by the thought of forcing his lover, Tyria Sarkin, to destroy him. Realizing that his unit needed him, Tainer returned to battle. As the Implacable's fighters arrived to defend their ship, they became rapidly engaged against Rogue, Wraith, and Blue squadrons in a fierce dogfight. While the TIEs sustained casualties, they also prevented most of the Wraiths from attacking the Implacable."}, {"tag": "p", "text": "However, Wraith pilot Falynn Sandskimmer, in defiance of orders, flew her TIE fighter into a hole burned through the Implacable's armor, and began systematically destroying its power cells from within. She was followed in by Eurrsk Thri'ag in his X-wing. Between the two them, they quickly savaged the interior of the Star Destroyer's power cells. The damage to the Implacable was compounded by fire from the Night Caller, which Antilles kept concealed within its dust cloud."}, {"tag": "h3", "text": "Destruction of the Implacable"}, {"tag": "p", "text": "Realizing that his ship could not be saved, Admiral Trigit activated its self-destruct and fled with two bodyguards in hyperdrive-equipped TIE interceptors. Petothel was disgusted with his needless sacrifice of thousands of loyal crewmen, and announced Trigit's escape to the New Republic forces. She also gave the signal to abandon ship, and used Trigit's personal escape pod for herself after finishing final preparations for her new identity as Lara Notsil, which she would use in an attempt to infiltrate Wraith Squadron."}, {"tag": "p", "text": "Even as the Implacable commenced its self-destruct countdown, the starfighters continued to engage each other. While several Imperial fighters were destroyed, Wraith Ton Phanan was forced to eject after sustaining damage from what appeared to be a TIE interceptor belonging to the 181st Fighter Group, as was Kell Tainer. As the Implacable, heavily damaged, lost control and fell towards the surface of the moon, Antilles ordered Thri'ag and Sandskimmer out of the interior of the Star Destroyer. Thri'ag managed to bring his fighter out of the ship's keel, but was vaporized by a turbolaser battery, slaying him instantly. Sandskimmer's ship was caught on framework from the Implacable. Unable to escape, she perished when the Star Destroyer crashed into the moon."}, {"tag": "p", "text": "Still, the battle was not over yet, as Imperial fighters remained. After Tetran Cowall, disguised as noted Imperial ace Soontir Fel, killed a dissenting TIE pilot, the Implacable's remaining starfighters agreed to a cease-fire proposed by Antilles. However, General Edor Crespin and Lieutenant Myn Donos pursued the fleeing Trigit and his escorts, who had refused to surrender. Crespin shot down the admiral's bodyguards, while Donos killed Trigit himself with a pair of proton torpedoes."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the battle, the surviving Wraiths were granted leave on Borleias, where they were commended by Admiral Gial Ackbar for their skill and dedication. However, Wraith pilot Ton Phanan was not among them, as he was recovering from injuries sustained during the battle. Gara Petothel, having disguised herself as Trigit's sex slave, was rescued by the New Republic. She would later infiltrate Wraith Squadron. Kell Tainer, who had been struggling with issues of fear and responsibility, finally felt at ease, having overcome his anxiety in the heat of battle. Myn Donos, whose Talon Squadron had been destroyed by Trigit, finally felt peace over the loss of his squadron, though the loss of his significant other, Falynn Sandskimmer, plagued him."}, {"tag": "p", "text": "The surviving Imperial fighters on Ession regrouped and eventually returned to service with Zsinj. Cowall, leading an ersatz 181st, would later engage Wraith Squadron on a number of occasions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ession was created by author Aaron Allston as the climatic battle of the novel X-Wing: Wraith Squadron. On his site, Allston admitted to an error in the battle that has Janson changing craft from a TIE fighter to an X-wing. Allston stated that Janson's canonical vehicle was a TIE fighter throughout the Battle of Ession."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}