{"url": "Tammuz-an/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Rocky planets", "Category:Tammuz-an locations", "Category:Tammuz sector planets"], "nodes": [{"tag": "h1", "text": "Tammuz-an"}, {"tag": "p", "text": "Tammuz-an was a double-ringed planet. The planet's inhabitants, called Tammuz-an, were tall blue- or purple-skinned humanoids governed by a monarchy. The planet was the homeworld of Mon Julpa."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For decades prior to the creation of the Galactic Empire, Tammuz-an lay within the area of the galaxy known as Hutt Space. The Hutts' territory waned in the aftermath of the Clone Wars, leading Tammuz-an to fall outside their borders. In the early years of the Empire, a vizier by the name of Ko Zatec-Cha wiped the memory of Prince Mon Julpa and cast him away, usurping the throne. Eventually Mon Julpa, the true prince, returned to his homeworld and reclaimed the throne as rightful ruler of Tammuz-an."}, {"tag": "p", "text": "Mon Julpa's next act as ruler of Tammuz-an was to put an end to the fighting between the two factions on his world. The kingdom Julpa ruled over was inhabited by the purple-skinned humanoids, while blue-skinned humanoids inhabited Lord Malameu Toda's Outer Territories. The two races put aside their differences to vanquish Gir Kybo Ren-Cha, a pirate from the nearby world of Tarnoonga who had long preyed on Tammuz-an. After this brief alliance, the two factions were able to band together to create a unified Tammuz-an."}, {"tag": "h2", "text": "Tammuz-an military"}, {"tag": "p", "text": "Mon Julpa and Lord Toda maintained troops within their domains, including guards armed with staff-like energy weapons. For protection along the airways, the Tammuz-an employed Imperial repulsorcraft like the Side Gunner and the Sniper vehicle. Ubrikkian Floater-935s and airhooks were used for individual transport.\nThe Tammuz-an maintained a small navy which supported its shipping\n fleet and protected Tammuz-an space. Among the vessels used were zeppelin-shaped capital ships and R-22 Spearhead fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"Tammuz\" is the Hebrew form of the name of a Sumerian god (and associated month), \"Dumuzid.\" There was a month in the Babylonian calendar named after this god. Tammuz was originally the son of Nimrod, the king who built the Tower of Babel, but later was deemed a god by his mother as he was born over nine months after Nimrod's death."}, {"tag": "p", "text": "Tammuz is also the 10th month of the Jewish calendar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}