{"url": "Battle_of_Esyram", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Imperial Fleet Operation: Clean Sweep"], "nodes": [{"tag": "h1", "text": "Battle of Esyram"}, {"tag": "p", "text": "The Battle of Esyram was a space battle between the Alliance to Restore the Republic and the Imperial Navy that occurred when the Dreadnaught-class cruiser Warlover attacked a Rebel cargo operation in the Esyram system."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "As the Warlover was outmatched in starship-to-starship combat by the MC80 Calamari Star Cruiser Valorous, which was taking possession of Class-E cargo containers holding water, the Imperial Dreadnaught kept its distance and launched four flight groups of TIE Series starfighters: two groups of interceptors and two groups of bombers. Valorous deployed Green Squadron in nimble A-wings to intercept the Imperial fighters, while Red Squadron, piloting T-65 X-wing fighters escorted the Delta-class DX-9 space transports of Val Group in their mission to transfer the cargo containers to the Calamari Cruiser's hangar bay. The Imperial fighters were tasked with destroying as many cargo containers and Rebel transports as possible, but if they did not succeed, they were to engage the Valorous directly—a considerably dicier proposition."}, {"tag": "p", "text": "Fortunately, the Imperial Navy was holding a squadron of lethal TIE Avengers in reserve. They may have entered the fracas if the Imperial commander judged the battle to be shifting in the Rebels' favor. Comparatively, the Valorous and its starfighters had only a few Y-wing starfighters from Gold Squadron to prevail upon for support if they were being overwhelmed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Dreadnaught Warlover Attacks Rebel Cargo Operation\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side, both sides have conflicting mission objectives, and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Imperial Fleet Operation: Clean Sweep, using the default craft assigned to the player."}, {"tag": "h2", "text": "Appearances"}]}