{"url": "Battle_of_Exegol", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Battles in the Unknown Regions", "Category:Battles of the First Order–Resistance war", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Exegol"}, {"tag": "p", "text": "The Battle of Exegol was the decisive final battle in the war between the First Order and the Resistance in which the Resistance and the citizens' fleet defeated the Final Order, the Xyston-class Star Destroyer fleet designed by the Sith Eternal. The Resistance's victory prevented the Star Destroyers from leaving Exegol to reinforce First Order forces and began an uprising against it across the galaxy. The battle was also the final conflict in the ancient, millennia-long war between the Jedi and the Sith, ending in a decisive victory for the Jedi with the destruction of Darth Sidious and prevention of the Sith's return as a whole."}, {"tag": "p", "text": "The origins of the battle emerged from the revelation that Darth Sidious had returned after his death at the Battle of Endor and was hiding on Exegol in the Unknown Regions, where Sith cultists had constructed a massive fleet to establish a new Sith Empire. Jedi Padawan Rey, having just learned her true identity as the Emperor's granddaughter, utilized a Sith wayfinder to locate Sidious' stronghold, simultaneously showing the Resistance the path to Exegol."}, {"tag": "p", "text": "The battle began when the Resistance navy attacked Exegol to prevent the launching of the Sith fleet. A ground team led by General Finn was tasked with taking out a navigation tower while an air team commanded by General Poe Dameron was to defend them. However, when the Sith Eternal realized the Resistance was targeting the navigation tower, Allegiant General Enric Pryde had the source of the navigation signal switched to his command ship, forcing the Resistance's ground team to land on his Resurgent-class Star Destroyer Steadfast. The Resistance was nearly destroyed by the Sith Eternal forces until General Landonis Balthazar Calrissian and Chewbacca arrived on the Millennium Falcon with a massive makeshift citizens' fleet composed of over fourteen thousand starships piloted by volunteer civilians from all across the galaxy."}, {"tag": "p", "text": "Meanwhile, Darth Sidious attempted to turn Rey to the dark side of the Force, exhorting her to sacrifice him and rule the galaxy as a Sith. However, Ben Solo arrived to help her; they defeated the Knights of Ren and Sidious' Sovereign Protectors, but Sidious used their connection to heal himself. The Dark Lord disposed of Solo, using the Force to cast him into a nearby abyss, and ascended the Throne of the Sith himself, from where he unleashed torrents of Force lightning into the sky, electrifying the Resistance's fleet and the citizens' fleet. However, Rey was restrengthened by the spirits of past Jedi, allowing her to stand and face her grandfather, who refocused his lightning towards her, giving the Resistance an opportunity to finish their mission. Finn and Jannah destroyed the command ship, disabling the signal and preventing the Sith fleet from leaving Exegol, while the citizens' fleet and starfighters destroyed a large number of Sith Star Destroyers."}, {"tag": "p", "text": "Rey defended herself from her grandfather's Force lightning with the lightsabers of her masters, Luke Skywalker and Leia Organa, causing the lightning to deflect back at the Sith Lord and disintegrate him, killing the Emperor and his disciples and preventing the return of the Sith Order. Rey died, but Solo reappeared and sacrificed himself to resurrect her, giving his life force to her. With the Sith fleet destroyed, Rey and the rest of the Resistance and citizens' fleet departed from Exegol. During their return to their base, they learned that people were rising up against the First Order all across the galaxy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, the Dark Lord of the Sith and Emperor of the Galactic Empire Darth Sidious managed to return after his death and arrive on the planet Exegol in the Unknown Regions in a clone body, albeit requiring to be sustained by an Ommin harness due to his new body being physically impaired. On Exegol, the former Emperor was attended to by a Sith cult, the Sith Eternal. During the following years, the Sith Eternal constructed a massive armada of planet-destroying Xyston-class Star Destroyers for what Sidious called the Final Order, with the goal of establishing a new Sith Empire and restoring Sith rule to the galaxy. In 35 ABY, by which point the First Order, a military junta formed by former Imperial officers, nobles, technologists, and warlords who had fled into the Unknown Regions after the fall of the Empire, had controlled large swathes of the galaxy as part of their war of conquest, a broadcast was put out across the galaxy using the voice of Emperor Palpatine, thought still to be deceased, which promised revenge."}, {"tag": "p", "text": "Seeking to crush any potential threat to his rule, Supreme Leader Kylo Ren, who had risen to rule the First Order after assassinating his master and predecessor, Snoke, sought a path to the Emperor. Ren acquired his grandfather's wayfinder device and used it to travel alone to Exegol, where he found the returned Sidious and his followers. The Sith Lord revealed to Ren that he created Snoke, and told Ren that the First Order was \"just the beginning.\" He promised Ren the might of the Final Order if he killed Rey, the last Jedi, who he revealed to Ren was his granddaughter."}, {"tag": "p", "text": "After a series of missions with Poe Dameron, Finn, Chewbacca, C-3PO, BB-8, and D-O, Rey acquired the Emperor's wayfinder. However, it was destroyed by Ren, who had also informed her that she was the Emperor's granddaughter, making her a Palpatine. Rey defeated Ren in a lightsaber duel after he was distracted by the death of his mother and Rey's Jedi Master, Leia Organa, and took his TIE whisper. Initially giving into fear and exiling herself on Ahch-To, where she destroyed Ren's ship, Rey was motivated by the spirit of her first Jedi Master, Luke Skywalker, who encouraged her to face her fear. Rey traveled along a safe route to Exegol in Skywalker's X-wing, Red Five, using Ren's wayfinder and transmitted her plotted course to the Resistance, allowing them to travel along her passage. Through information acquired from D-O, a droid that had been owned by a Sith cultist, Ochi, the Resistance learned that the Sith fleet required a signal from a navigation tower in order to deploy off of Exegol, and devised a battle strategy to take out the tower. Poe Dameron and Finn, who had become the leading generals of the Resistance after Leia Organa's death, sent General Lando Calrissian and Chewbacca on the Millennium Falcon to the Core systems to try and recruit any of the free worlds to aid them. Meanwhile, Ren experienced a vision of a memory of his father, Han Solo. Confessing his love for his father, Ren threw his lightsaber into the sea and renounced the dark side, redeeming himself and assuming his born identity as Ben Solo once again."}, {"tag": "p", "text": "Emperor Palpatine—the public identity of Darth Sidious—contacted the First Order's Allegiant General Enric Pryde, who, as an Imperial veteran, had previously served the Emperor, allowed Sidious to formally take change of the First Order, which gained the Sith fleet in order to increase their resources. General Pryde subsequently pledged his personal allegiance to the Emperor. The Emperor then declared that the Final Order was beginning; he ordered Pryde to Exegol, and sent him a ship from the Sith fleet, which Pryde used to destroy a planet close to the Resistance on the Emperor's orders, Kijimi. Pryde arrived to Exegol on his Resurgent-class Star Destroyer, the Steadfast, which served as the Sith fleet's command ship."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Air battle"}, {"tag": "p", "text": "The Resistance arrived on Exegol to find a massive armada of Xyston-class Star Destroyers, which comprised Sidious' fleet. They realized the fleet had the potential to destroy any planet in the galaxy, since every Star Destroyer was equipped with the same cannon as the one that destroyed Kijimi. Poe and Finn opted to launch a ground assault over an air assault in order to disable the navigation tower while at the same time avoiding Sith Eternal tracking. However, an officer spotted the assault force and informed Pryde, who immediately recognized the threat and had the signal transferred to the Steadfast, intending to lead the fleet out themselves."}, {"tag": "p", "text": "When the lander realized the signal had been transferred, Finn reached out with the Force to identify the new source of the command signal. Identifying the Steadfast as the source because it stood out among the Sith Star Destroyers, they carried forward with their ground assault and landed on the hull of the Resurgent Star Destroyer instead. Pryde ordered a large group of Sith troopers onto the hull to stop the boarders, along with an electromagnetic pulse to disable their speeders. To his disbelief, another officer told him that they weren't using speeders; instead, they were using orbak mounts. The strike team managed to disable the tower after a brutal battle. Pryde was not concerned, and simply ordered it to be restarted. As the Resistance strike team prepared to leave, Finn and Jannah stayed behind to stop them from resetting and switching the signal to another Star Destroyer. Poe then ordered the starfighter pilots to launch an attack on the Sith Star Destroyers until Calrissian and reinforcements arrived."}, {"tag": "h3", "text": "Showdown with the Sith"}, {"tag": "p", "text": "While the battle raged above, Rey entered the Sith Citadel and found Sidious in the throne room, which contained an arena filled with Sith loyalists. Sidious expressed his satisfaction at finally seeing his granddaughter, while telling her that the Resistance was walking into a trap. Above the throne of the Sith, he opened the ceiling, revealing an outnumbered and outmatched Resistance and its seemingly imminent failure against the Sith Eternal forces. Sidious exploited Rey's feelings for the Resistance, telling her that the only way to save them would be for her to strike him down in anger, calling her \"Empress Palpatine\" and encouraging her to take her rightful place on the throne of the Sith. This would ensure the Sith Lord's essence's transferal to Rey's body, renewing the Sith Eternal for the reign of a new Sith Empire. Rey was faced with a confrontation of wills as the desire to save the Resistance as well as her uneasiness of being a Palpatine collided in her mind. With the Sith loyalists chanting, Sidious prepared to be killed by Rey."}, {"tag": "p", "text": "However, a glimpse of hope came when Rey sensed the newly redeemed Ben Solo through the Force. Landing his TIE scout next to Red Five, which Rey had used to reach Exegol from Ahch-To, Solo made his way into the Sith Citadel, shooting down some Sovereign Protectors. On the way, he encountered his former comrades, the Knights of Ren. He attempted to get past them by Force pushing Cardo to the ground. However, Kuruk and Ushar responded by Force pushing Ben."}, {"tag": "p", "text": "When Vicrul attempted to attack Ben with his phrik scythe, Ben caused him to stumble. The other knights, Cardo, Kuruk, Trudgen, and Ushar, attacked the unarmed Ben, scarring his face. He contacted Rey through their Force-bond and nodded. Pretending to strike down Sidious, Rey instead used their Force bond to transfer the lightsaber of Anakin Skywalker to Solo as she ignited the lightsaber of Leia Organa. Solo then proceeded to use the Skywalker lightsaber to kill his former comrades, starting with a fatal slash to Kuruk and Cardo's chests and grazing Ap'lek's Mandalorian executioner vibro-ax."}, {"tag": "p", "text": "Blocking swings from Ushar's war club and Trudgen's vibrocleaver, Solo Force pushed Ap'lek to his death, as he restrained and felled Vicrul. Trudgen attempted to attack his former leader but was effortlessly stabbed in the chest. Ushar attempted to attack too but Ben leapt over him and stabbed him from the back. After Ushar dropped dead, Solo then arrived at Sidious' lair and reunited with Rey, who had just finished off Sidious' Sovereign Protectors."}, {"tag": "p", "text": "At first, Sidious intended to kill both of them, but realized that the duo together made a Force dyad, a phenomenon that, according to Sidious, had not been seen in generations. Realizing that their powers combined would allow him to fully return to life, Sidious used the Force to drain the life energy of both Rey and Solo to restore himself to the form he had before his first death at the hands of Anakin Skywalker, during the Battle of Endor. Drained of their powers, Rey and Solo collapsed to the floor. Having no further need for Solo, Sidious used the Force to throw him into a nearby abyss, exclaiming revenge and declaring the death of the Skywalker family."}, {"tag": "h3", "text": "The galaxy fleet arrives"}, {"tag": "p", "text": "Up above, the Resistance was taking heavy losses, as Finn and Dameron continued to lead the fight. Temmin Wexley was shot down by Sith TIE fighters, making Poe realize that they were losing the battle. However, Calrissian arrived in the Millennium Falcon, bringing with him the citizens' fleet, a massive armada comprised of over 14,000 ships from all points across the galaxy. The citizens of the galaxy had come to aid the Resistance in their hour of need. Poe ordered the fleet to target the superlaser cannons, to considerable effect. Pryde was stupefied at the appearance and size of the fleet, arguing that the Resistance had no navy. Admiral Griss, on the other hand, realized that it was not a navy but just people that had finally had enough of their tyranny and banded together to bring them down. Sith Star Destroyers began falling to cruisers and fighters alike, with one being brought down single-handedly by a lone Y-wing piloted by Zori Bliss, who had escaped the destruction of her homeworld."}, {"tag": "h3", "text": "End of the Sith"}, {"tag": "p", "text": "Sidious, having been fully restored to his former self, told his Sith loyalists to not fear the attack of the Resistance, as no one would be able to stop the Sith's return. He then proceeded to ignite a powerful storm of Force lightning into the air, which disabled all Resistance ships up to the size of Nebulon B frigates, including those of Finn, Poe, and the galaxy fleet, and sending them plummeting toward the ground, including the legendary Tantive IV. Much to Poe's shock, he realized he was losing control of his X-wing. Weakened and seemingly defeated, Rey heard the voices of past Jedi, including her former Master Luke Skywalker, Luke's father Anakin, Obi-Wan Kenobi, Yoda, Qui-Gon Jinn, Ahsoka Tano, Mace Windu, Luminara Unduli, Aayla Secura, Kanan Jarrus, and Adi Gallia encouraging her and lending her the strength to carry on against the Sith Lord."}, {"tag": "p", "text": "Rey then stood up, with her new courage and strength received from the Jedi before her. Sidious, noticing this, ceased his Force lightning attack on the Resistance fleet. Poe, having realized that his starship's systems were back online, regrouped the allied forces and resumed their assault on the Sith fleet, stating that they had one chance to take out the armada of Sith Star Destroyers. Telling Rey that her death would be the end of the Resistance, Sidious launched a barrage of Force lightning at Rey. Rey then attempted to block it with Leia's lightsaber, but Sidious told Rey that she was \"no match for the power of\" him and that he is \"all the Sith.\" However, Rey retaliated by telling Sidious that she is \"all the Jedi,\" calling back the Skywalker lightsaber and igniting it, using the two lightsabers to deflect Sidious' lightning back at him. Physically unable to take the strain of the immense energy reflected back at him, Sidious screamed in agony and horror as he was disintegrated by his own lightning. In a massive explosion that decimated the entire arena, Sidious, and all of the Sith Eternal, Darth Sidious—the man who wrought evil throughout the galaxy for an entire century—was destroyed, aborting the Sith Order's return and permanently ending the ancient Sith-Jedi conflict."}, {"tag": "p", "text": "Rey died from the sheer amount of power required to utterly destroy Sidious, an event felt by Finn, and her body collapsed to the ground. However, Solo had survived the earlier ordeal with Sidious, and climbed up the cliff from the abyss, running back to Rey as he realized she sacrificed herself to kill Sidious. Finding Rey dead, Solo mourned her and cradled her in his arms. However, he then made the decision to sacrifice himself so that Rey could live again. He put his hand on her and transferred his own life force into her body, resuscitating her. Rey and Ben then shared a kiss before Ben Solo, the last Skywalker and redeemed Jedi, vanished into the Force, having brought balance back to the Force as his grandfather, Anakin Skywalker, once had. Simultaneously, back on Ajan Kloss, Maz Kanata watched with a sense of peace as Organa's body became one with the Force."}, {"tag": "h3", "text": "Fall of the Final Order"}, {"tag": "p", "text": "Meanwhile, above Exegol, the Resistance and citizens' fleet were continuing to press the attack against the remaining forces of the Sith Eternal. Finn and Jannah successfully destroyed the Steadfast by turning its turbolasers against the ship itself. The Steadfast burst into flames, killing all on board. It then fell towards the ground and crashed into the surface of Exegol, while Calrissian and Chewbacca rescued Finn and Jannah aboard the Millennium Falcon. With the Steadfast destroyed before it could transfer the signal to another friendly ship, the entire Sith fleet became trapped on Exegol. The Resistance and the galaxy fleet destroyed the rest of the Sith Star Destroyers in a similar fashion to the Steadfast, by blowing up their axial superlasers. With the Final Order destroyed and all the ships falling to the ground in ruins, Rey, the Resistance and the galaxy fleet emerged victorious and left Exegol to return to Ajan Kloss, where they celebrated the end of the First Order/Resistance War."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the Resistance and their citizens' fleet left Exegol, they learned that across the galaxy people were rising up as the weakened First Order began to collapse without the Sith fleet to reinforce them. Across the galaxy, people rose up and destroyed the Resurgent-class Star Destroyers, as seen on Cloud City, Jakku's Starship Graveyard, and on the forest moon of Endor. The Resistance and their allies returned to the Resistance's base on Ajan Kloss, where they celebrated their victory, among them Rey, Finn, and Poe Dameron."}, {"tag": "p", "text": "The end of the battle saw the ushering of peace across the galaxy. Through Rey and Ben Solo, the ancient conflict between the Sith and Jedi finally ended in a Jedi victory as the deaths of Darth Sidious as well as the collapse of the Sith Eternal marked the end of the threat of any Sith rule across the galaxy. Through Finn, Poe, Lando, and the rest of the Resistance and the galaxy fleet, the entire Sith fleet collapsed on Exegol, with no threat of return. Their actions also ushered in a new sense of hope and courage across the galaxy as people gathered the will to rise up and destroy the remains of the First Order."}, {"tag": "p", "text": "Afterwards, Rey traveled to Luke's home on Tatooine to reminisce about all that she had accomplished, before burying the Skywalker lightsabers into the sand using the Force. Following the burial she revealed she had constructed a lightsaber of her own, and ignited its yellow blade. When an old woman who was passing by asked who she was, Rey, with both Luke and Leia's Force spirits watching in the distance, confidently declared that she was \"Rey Skywalker.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Exegol served as the climactic battle of the 2019 film Star Wars: Episode IX The Rise of Skywalker, the final installment of the Star Wars sequel trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}