{"url": "Taneetch_Soonta", "categories": ["Category:Canon articles", "Category:Females", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Taneetch Soonta"}, {"tag": "p", "text": "Taneetch Soonta was a female Rodian of the Chekkoo clan from the planet Rodia and sales executive for armament manufacturer Utheel Outfitters during the Galactic Civil War. Her uncle, Huulik, was a Jedi Knight during the Clone Wars and was killed by his clone troopers during Order 66. Although she met her uncle only a few times before his death, Soonta greatly admired Huulik and would occasionally visit his mausoleum that their family had built in the swamps of Rodia. About a year after the Battle of Yavin Soonta met the aspiring Jedi and pilot Luke Skywalker when he came to Chekkoo Enclave seeking to purchase weapons for the Alliance to Restore the Republic. Soonta, upon seeing Skywalker's lightsaber began a discussion with the young pilot about their mutual respect for the Jedi Order and, per Skywalker's request, took the rebel to visit Huulik's tomb. When the pair were ambushed by a wild ghest near the mausoleum Soonta retrieved Huulik's old lightsaber from his sarcophagus and gave it to Skywalker. He used the lightsaber to kill the ghest and allow the two to return to the Enclave. A few days later, Skywalker again visited Utheel Outfitters and Soonta helped the man purchase a series of weapons to refit the yacht Desert Jewel."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A female Rodian of the Chekkoo clan from the Betu continent of Rodia, Taneetch Soonta was born in the final years of the Galactic Republic. Soonta's uncle Huulik was a Force-sensitive and Jedi Knight, serving as a Jedi General during the Clone Wars. Since Jedi were not allowed to maintain personal relationships with their family members, Huulik rarely visited Rodia and only came due to his responsibilities as a Jedi. As such, Soonta only met her uncle once or twice as a child, but there few encounters made a lasting impact on the young Rodian, with Soonta viewing her Huulik as the personification of honor. She also came to know the names of Anakin Skywalker after he saved Huulik's life during the battle of Sedratis, and Jedi Master Obi-Wan Kenobi after his assistance in rescuing a kidnapped child from another Rodian clan."}, {"tag": "p", "text": "Huulik was eventually killed by his own clone troopers when Supreme Chancellor Palpatine declared Order 66 at the end of the war. Soonta's family constructed a secret mausoleum for their deceased Jedi relative in the swamps near the Chekkoo Enclave. Due to her admiration for Huulik, Soonta would occasionally pay her respects at the tomb, eventually becoming the last member of her family to visit after a time. As the Galactic Empire rose up from the remnants of the Galactic Republic and slandered the name of the now extinct Jedi Order, Soonta always held doubts about the Empire's claim that the Jedi had betrayed Palpatine and the Republic. Over the years Soonta came to be a sales executive for Utheel Outfitters, a secretive armament manufacturer affiliated with the Chekkoo clan based out of their Enclave that supplied weapons to various underground elements across the galaxy."}, {"tag": "h3", "text": "Contact with Luke Skywalker"}, {"tag": "p", "text": "Nearly twenty years after Huulik's death, in the midst of the Galactic Civil War against the Empire, Soonta met Luke Skywalker during his tour around the clan's manufacturing facilities. A prospective Jedi and young pilot, Skywalker had come as a envoy for the Alliance to Restore the Republic seeking to purchase weapons for the Alliance's war effort. The next morning after the tour the Rodian met Skywalker to have breakfast together at the Outfitter's solarium and discuss the terms of a weapons' deal. However, she noticed Skywalker's lightsaber among his tunic and waited for their server to depart with their orders to politely ask him about his weapon. Wary of souring relationships with the Chekkoo, he hesitated to tell her truth, but Soonta openly confessed her view of the Jedi did not align with that of the Empire."}, {"tag": "p", "text": "Catching Skywalker's attention, Soonta continued to speak about her Jedi uncle, his connection to Luke's father Anakin, as well as her knowledge of Luke's deceased mentor Obi-Wan Kenobi. Skywalker, eager to learn about the Jedi and ways to train himself in the ways of The Force, was interested to learn this information along with the fact that Huulik's clones had betrayed the Jedi, which conflicted the official Imperial records. Expressing his desire to pay his respects for the fallen Huulik, Soonta accepted Skywalker's proposition and offered for them to test the Outfitters' speeder bikes while on their way to the tomb. Soonta led Skywalker deep into the swamp, landing on the bank of a the small island that housed Huulik's mausoleum. However, the Rodian did not plan the trip strategically, neglecting to account for the predatorial ghest that resided in the swamp water and tended to ambush creatures near the water's edge. Realizing her error as they landed their speeders, the Rodian urged Skywalker to dismount quickly in case a ghest emerged, and just as the young rebel moved away from the bank a ghest did appear and destroyed his speeder."}, {"tag": "p", "text": "Recognizing that the ghest would likely return as the two tried to leave, Soonta decided to deal with that problem after they completed the purpose of their journey and led Skywalker into Huulik's tomb. After entering the aged structure, Soonta knelt before the grave and said a few phrases in her native language to honor Huulik. She also opened the deceased Jedi's sarcophagus upon Skywalker's request, even retrieving her uncle's old lightsaber and giving it to the rebel, much to Skywalker's surprise. Soonta surmised that Skywalker could now kill the ghest by duel wielding the two lightsabers. Soonta's theory proved correct, and the prospective Jedi managed to decapitate the wild animal, taking a nonlethal bite wound to the shoulder in the process. After Skywalker defeated the creature, Soonta drove the remaining speeder with the wounded rebel back to the enclave and helped him reach the infirmary. She also made sure to take pictures of the destroyed speeder and the dead ghest to explain to her superiors what had occurred at the tomb."}, {"tag": "p", "text": "Skywalker soon left Rodia to provide the Outfitters' weapons catalog and prices back to the Alliance leadership, but returned to the Enclave a few days later along with Alliance operative Nakari Kelen to purchase weapons for the luxury yacht Desert Jewel. However, Skywalker did not contact Soonta ahead of time to inform her of their intentions, and was met with resistance by a Rodian at the Enclave's spaceport who refused the rebels entry into the Enclave, unaware that the rebels were permitted to do business with the Outfitters. As Skywalker tried to convince the spaceport employee to let them pass, Soonta gained word of Skywalker's presence and commed the Rodian at the spaceport that the rebels were known customers. Soonta met the pair of rebels to a hidden passage way in the Enclave's bazaar where Skywalker purchased a series of weapons from the sales executive, including a pair of laser cannons as well as a single Utheel Rockcrusher Compact Seismic Charge. Skywalker also paid Soonta for instillation of the weapons on the yacht."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Soft-spoken and polite, Soonta had great respect for the Jedi Order due in part to her interactions with her uncle Huulik. As such, she was very willing to help Luke Skywalker learn about the Jedi, even going so far as to give him her uncle's old lightsaber. Soonta was also very skeptical of the Galactic Empire's account of the demise of the Jedi Order, believing that the victors of war often shaped history to suit their ends. While she showed attentiveness by documenting the destruction of the speeder, her lack of planning for the trip resulted in Skywalker being injured by his fight with the ghest."}, {"tag": "p", "text": "Soonta had large, black eyes, and, in Skywalker's opinion, a very pungent smell common amongst her species. Soonta had a habit of moving her head antenna back when excited to hear good news, as well as flicking her head to the left when expressing a \"no.\" When Soonta made a rather large sale to Skywalker for the weapons for the Desert Jewel she expressed her happiness by releasing a gurgling sound from her mouth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taneetch Soonta's first appearance in Star Wars media was in the 2015 canon novel Heir to the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}