{"url": "Tan_Divo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Coruscant Security Force officers", "Category:Coruscanti", "Category:Divo family", "Category:Humans", "Category:Inspectors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tan Divo"}, {"tag": "p", "text": "Tan Divo was a Human male police inspector in the Coruscant Security Force during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Though somewhat arrogant, Divo was good at his job which allowed him to climb in the CSF hierarchy, attaining the rank of lieutenant by c. 22 BBY. Divo was assigned to several notable cases including the kidnapping of the two daughters of Pantoran Chairman Notluwiski Papanoida by the Separatists. Though Divo made assurances of his ultimate success in the investigation, his team missed blood on the bottom of Papanoida's Icon of the Moon Goddess during a scan of the chairman's apartment on the planet Coruscant. This prevented Divo from receiving a vital clue to the identity of the kidnappers, and the case from Divo's perspective went cold."}, {"tag": "p", "text": "Divo was also called to investigate the death of Senator Onaconda Farr. Relying on his instincts as an investigator, Divo rejected Senator Padmé Amidala's opinions as to the cause of Farr's death, concluding that Farr had been poisoned. Divo's dismissal led her to pursue a separate investigation with the assistance of Senator Bail Organa. After an attempt on the lives of Amidala and Organa at the Coruscant docks, the body of Senator Mee Deechi was discovered in his office, and Divo opened a second investigation into Deechi's homicide. Divo was able to gather evidence in both cases and further his investigations. Throughout the affair, Divo had little regard for politics and was frustrated by Amidala's constant meddling. After Lolo Purs, Farr's assistant, accused Senator Halle Burtoni of Kamino of attacking her and as Farr had been killed with a Kaminoan-engineered poison, Divo arrested Burtoni for the murders. However, the killer was revealed to be Lolo Purs herself. After intervention by Divo and Amidala, Purs was taken into custody. Purs' reasons for the murder confirmed Divo's original theory: that the Senator had been killed due to his past."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Papanoida kidnappings"}, {"tag": "p", "text": "A male Human, Tan Divo lived on the planet Coruscant and entered the field of law enforcement as a police officer with the Coruscant Security Force. His confidence and old school, by-the-book handling of cases, as well as his effective abilities as a detective, allowed him to reach the rank of lieutenant by the time of the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic."}, {"tag": "p", "text": "Around 22 BBY, the Trade Federation initiated a blockade of the planet Pantora, demanding it pay an alleged financial debt as part of a plot to bring it into the Confederacy. The Trade Federation officer in charge of the blockade, Sib Canay, hired the bounty hunter Greedo and a Gotal accomplice to kidnap the two daughters of Pantoran Chairman Notluwiski Papanoida as further leverage against the Chairman. Canay hoped that by kidnapping Papanoida's daughters, he could force the chairman to capitulate. After the kidnapping, Lieutenant Divo was sent as the investigating inspector."}, {"tag": "p", "text": "Divo arrived at Papanoida's apartment with several police droids, but they were unable to find any clues that would lead them to the kidnappers. Though Divo made assurances of a continued investigation to Papanoida and his son, Ion Papanoida, the case largely became cold with no evidence. Unbeknownst to the CSF, the Icon of the Moon Goddess had been moved from its original position in Papanoida's apartment. Under the icon was a small sample of blood left by Greedo when he was struck by the icon during the struggle with Papanoida's daughters. After finding the blood and identifying its source, Papanoida, with the help of Jedi Padawan Ahsoka Tano, was able to rescue his daughters."}, {"tag": "h3", "text": "Homicides in the Senate"}, {"tag": "h4", "text": "Initial investigation"}, {"tag": "p", "text": "Around 21 BBY, as the Clone Wars continued, the Galactic Senate on Coruscant debated on a bill that would decrease military spending, thus halting the production of more clone troopers for the Grand Army of the Republic. After a speech by Senator Padmé Amidala promoting the bill, the proponents of the legislation—including Senators Onaconda Farr, Mon Mothma, and Bail Organa, along with Farr's assistant, Lolo Purs—withdrew to Amidala's office. While enjoying refreshments including Domaine de la Maison sur le Lac wine, Farr choked and died. The CSF responded to the suspicious death, bypassing the Senate Guard, which normally held priority over incidents involving senators. Divo was assigned as the inspector on the case and was assisted by his servant droid, LEP-171B, and several police droids. Samples were taken of the drinks, and the forensics report concluded that a poison had been given to the Senator, thereby classifying the death as a homicide. After the Rodian Senator's funeral, Farr's political allies were summoned to Supreme Chancellor Palpatine's office in the Republic Executive Building."}, {"tag": "p", "text": "There, Divo revealed that Farr had not died of natural causes but had in fact been murdered. He asked the senators if they knew of anyone who hated Farr and suggested that something from his past had been the reason for his murder. The senators responded that Farr had been loved, and Amidala suggested that Farr had been killed because of someone who was angry over the proposed military spending reduction bill. Divo was dismissive of that idea and told the senators to stay out of his investigation."}, {"tag": "p", "text": "Not convinced by Divo's assurances, Amidala had decided to pursue her own theory. She began by questioning Farr's political enemies, Senators Mee Deechi and Halle Burtoni. Deechi revealed that he had Farr followed to dig up dirt on the Senator and that the night before his death, Farr had gone to the Coruscant docks for a clandestine meeting. Though reminded by her friends that Divo had ordered them to stay out of the investigation, Amidala went to the docks with Organa. There, they were ambushed and shot at though they did not know the identity of the attacker. The disturbance alerted CSF forces and police droids secured the crime scene. After arriving on the scene with LEP-171B, Divo expressed his annoyance at Amidala's actions. Not only had she failed to inform him of her lead at the docks and had gone to investigate herself, but she had also made his job more difficult by alerting the killer to the fact that the investigation was closing in on the culprit."}, {"tag": "h4", "text": "A second murder"}, {"tag": "p", "text": "In a show of frustration, Divo told Amidala and Organa that they had generated a great deal of paper work for him to file. He also lectured Amidala on the importance of rules and their importance to keep the peace and maintain order. During the conversation, Amidala came to believe that Deechi might have been responsible for the attempt on her life, as he was the one who had told her about the docks. Though Divo tried to tell her to slow down, she ignored him, and the frustrated inspector followed her and Organa back to Deechi's office. There, they found Deechi stabbed to death in his chair."}, {"tag": "p", "text": "In order to secure the lives of the individuals involved in the case including Senators Amidala and Organa as well as Farr's assistant Lolo Purs, Divo gathered all of them together at the Senate Building and told them they would be placed under the protection of CSF and Senate Guard forces. However, Lolo Purs refused and left the room. Divo questioned the remaining persons about who else had been aware that Amidala and Organa were going to the docks. In response, Amidala stated that the only other person who had known was Senator Burtoni. Though Divo tried to locate Burtoni, she was nowhere to be found. He returned to the senators in time for Purs to burst in and claim that Burtoni had attacked her. Divo ordered the Senate Guards and CSF droids to find Burtoni, and the police conducted a search of her office, without success. Eventually they were able to capture her and bring her to the Chancellor's office, where several individuals involved with the case, including Amidala and Organa as well as Chancellor Palpatine, were waiting. Initial questioning by Divo led Burtoni to deny any involvement in both Farr's murder and the attack on Purs. Divo then revealed that a forensics report indicated that the poison used to kill Farr, one that was lethal only to Rodians, was Kaminoan-made in origin. With that evidence in hand, Divo ordered Burtoni taken away."}, {"tag": "p", "text": "However, at that point, Amidala noticed that since the poison must have been in everyone's drink, Purs should have died as well, as she was also Rodian. Amidala then remembered that Purs had not drunk anything. Purs, feeling revealed and exposed, pulled out a small blaster and took Amidala hostage. When asked why by Amidala, Purs answered that she had killed Farr because of the war he had brought to Rodia and that a new and morally stronger leader was needed. As Deechi had known about the meeting, Purs had felt that he had to be removed as well. Her confession validated Divo's original theory, as it had been a mistake from Farr's past that had led to his murder. During the conversation, Divo, unnoticed by Purs, discreetly activated the police droids outside of the Chancellor's office. They surprised Purs at the door, allowing Amidala to break away and knock her unconscious. The police droids and Divo then took Purs into custody."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tan Divo was a light-skinned Human male with a short squared body at 1.8 meters tall, gray hair, red eyes, and a comlink on his ear. He was armed with an A43 Hushabye pistol and a small baton. He carried these as well as other equipment on his utility belt. Divo was a competent and effective police officer, though he subscribed to an old school of thought in police investigations that asserted that only the police could collect evidence and solve crimes. Consequently, his ideas on means, motives, and opportunity had to fit within the evidence he discovered. In his confidence of his abilities, Divo would also at times forget the support that he received from police droids. Two things that Divo disliked most were politicians and report writing, though the latter was ironically one of his talents."}, {"tag": "p", "text": "As an inspector, Divo had a conflicting reputation on being able to solve crimes. His methodology allowed him to rise through the ranks to lieutenant; yet he was viewed by some as incompetent and useless. In some cases Divo was viewed as incompetent even though he did not have all the facts. While investigating the disappearance of Chairman Papanoida's daughters, he conducted what he believed was a thorough sweep of their apartment but failed to find a sample of blood on the Moon Goddess statue. Papanoida's son, Ion, disregarded Divo as useless, and he and his father conducted another search, discovering the blood under the statue. Choosing to not inform the police of the found evidence, they pursued the matter on their own. Similarly, during the interrogation of Halle Burtoni, Divo presented the results of a thorough investigation based on the evidence and information available to him. As he was not aware of all of the facts, however, Divo had drawn the wrong conclusions and had the incorrect person in custody instead of the true culprit, Lolo Purs."}, {"tag": "p", "text": "In contrast, Divo demonstrated both his abilities as a detective by using his instinct and his ability to act decisively. When first beginning his investigation of the homicide of Farr, Divo felt that the murder was for personal reasons from Farr's past due to the fact that a poison, an intimate weapon preferred by politicians, had been used. Even though Divo did not care for politics and lacked the ability to skillfully maneuver the halls of power, he had a keen sense for motive. For though dismissed by the senators around him, Divo's initial theory turned out to be correct, as Purs had murdered Farr for his past mistakes and moral weakness. When Purs was revealed and took Amidala hostage, Divo proved that while he might have conducted slower investigations than others would have liked, he was also capable of taking quick and decisive action. Keeping calm and focused while everyone else was distracted, Divo activated the police droids who surprised Purs, allowing Amidala to free herself."}, {"tag": "p", "text": "As a dedicated, by-the-book law officer, Divo believed that without rules, order could not exist. He continually emphasized this while investigating the homicides in the Senate. His confidence in knowing what was right and wrong and his strong belief in rules resulted in sometimes slow but methodical investigations. As the investigation continued, Divo displayed both the calmness and cynicism of a typical Coruscant police officer, though this frustrated others such as Padmé Amidala, who felt he did not instill confidence. In dealing with other persons, Divo did not aspire to be diplomatic. He voiced his opinion regardless of who was listening, including the Supreme Chancellor of the Republic, and was frequently sarcastic in his responses. After the incident at the docks, Amidala's suggestion that she felt she could ignore the rules floored Divo, and he lectured her sarcastically about what he saw as her ignorance. Though he had been written off as incompetent by Amidala, he disapproved of her own disregard for the rules and amateurish detective work, which alerted the murderer to a possible leak in Deechi that had to be closed by also killing him. Though others assumed his incompetence, Divo's overall actions proved he was also underestimated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tan Divo was created for the Star Wars: The Clone Wars television series and was voiced by actor Tom Kenny. Divo initially appeared in the episode \"Senate Murders,\" which aired on March 19, 2010. StarWars.com's online Encyclopedia states that Divo had a low rate of success and that \"he often jumps to conclusions of guilt before a thorough investigation is conducted\" and that his attitude \"… forces others to seek clues without his help.\""}, {"tag": "p", "text": "However, the entry directly conflicts with several statements by Tom Kenny and Supervising Director Dave Filoni published on StarWars.com as to Divo's abilities. Divo was described by Filoni in the episode commentary as an old school detective who thought that rules were very important yet was competent and underestimated. Similarly, Kenny stated that Divo, while not on the level of the Jedi, was written to be good at his job and good at getting into the mind of the criminals—in other words a typical cop and part of the \"Joe Fridays of Star Wars.\" Kenny stated that he played the character with this in mind and added, \"… he's not shy about advertising the fact that he's good at it and has a good track record.\" In creating Tan Divo, Kenny drew inspiration from other TV characters, especially Columbo, in that Divo would be intentionally abrasive in order to get someone to blab and reveal themselves."}, {"tag": "p", "text": "Divo briefly also briefly appeared in the episode \"Sphere of Influence,\" which aired on October 1, 2010. It should be noted that chronologically \"Sphere of Influence\" occurs before \"Senate Murders.\" Divo received entries in Star Wars: The Clone Wars Character Encyclopedia, published on June 21, 2010, and in Star Wars: The Clone Wars: New Battlefronts: The Visual Guide, published on August 30, 2010. In the episode commentary for \"Senate Murders,\" Filoni hinted at Divo's future, speculating that he might have gotten closer to Palpatine and become a civil administrator commanding clone troopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}