{"url": "Tan_Tengo", "categories": ["Category:Legends articles", "Category:Females", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Tan Tengo"}, {"tag": "p", "text": "Tan Tengo was a female Sullustan who lived during the Republic Dark Age. She was born on the planet Darkknell, which had become the capital of the Sith Lord Daiman's princedom known as the Daimanate by 1032 BBY. At a young age, she was orphaned and was raised by her grandfather Gub Tengo. For much of her childhood, Tan lived under Sith rule. In 1032 BBY, Tan's life changed after she came into contact with the undercover Jedi Knight Kerra Holt, who had assumed the cover identity of an itinerant worker and private tutor. While tutoring Tan, Kerra however was spying on the Black Fang research installation where Daiman was developing a prototype warship known as a Convergence Tactical Assault Vehicle. Kerra destroyed the facility."}, {"tag": "p", "text": "Following the capture of an undercover Odionate operative Narsk Ka'hane, Daiman came to suspect that his estranged older brother Sith Lord Odion was behind the bombing. In retaliation, he concocted an elaborate scheme to lure Odion into a trap on Gazzari. Daiman purchased an arxeum—a university specializing in war sciences—from the Bactranate, a neighboring Sith state. He also recruited a thousand students for the university from throughout the Daimanate. Due to her proficiency in mechanics, Tan was selected for this scholarship. In reality, Daiman planned to use these students as bait for Odion while his forces attacked Odion's invasion force on Gazzari."}, {"tag": "p", "text": "Tan and the other students were saved when Kerra resurfaced during the Battle of Gazzari. She revealed that she was a Jedi Knight and helped Tan and the other students escape the battlefield. After a lengthy argument, Kerra managed to persuade the mercenary Jarrow Rusher to evacuate her students on his modified troopship Diligence. Following a long and arduous voyage, the Diligence ended up on Byllura, a Sith world that was controlled by the Dyarchy, a minor Sith princedom. While exploring Byllura, Tan and the Duros mercenary Beadle Lubboon were captured by the Unifiers, red-clad Sith adepts. Kerra pursued their captors and her actions culminated in the collapse of the Dyarchy."}, {"tag": "p", "text": "Shortly later, Byllura was annexed by the Arkadianate, another Sith state ruled by Arkadia Calimondra, the older sister of the Dyarchy's former twin rulers Dromika and Quillan. Arkadia publicly extended her hand of friendship to the beleaguered crew and passengers of the Dyarchy. She also offered to shelter Tan and the refugees in the Arkadianate where they would be integrated as Arkadianate subjects. Tan Tengo was initially taken in by Arkadia's charismatic personality and her \"enlightened\" Sith regime. She almost came to regard the Arkadianate capital city of Calimondretta on icy Syned as her new home."}, {"tag": "p", "text": "However, Arkadia proved to be untrustworthy after she tried to coerce Kerra into assassinating her grandmother Vilia Calimondra, the matriarch of the Calimondra family and the instigator of the Second Charge Matrica which devastated the Grumani sector. With the help of the Bothan Sith spy Narsk Ka'hane, Kerra, Rusher and the passengers aboard the Diligence managed to escape the Arkadianate. Tan and the other students managed to reach the Galactic Republic where they were protected from the fighting and devastation created by the New Sith Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Childhood"}, {"tag": "p", "text": "Tan Tengo was born in 1044 BBY, and she lived with her grandfather Gub Tengo on the planet Darkknell, the capital of the Daimanate. As with all Daimanate citizens, she was obligated to work for the Sith Lord Daiman's war effort and worked at a war munitions factory. Since she was still a dependent, Tan was allowed to work for only one eight-hour shift. In 1032 BBY, Gub hired a Human woman named Kerra Holt to help take care of Tan, and neither of the Sullustans realized that Holt was secretly a Jedi Knight who had infiltrated the Daimanate capital. Since he was too preoccupied with his state job of doctoring documents to show the Daimanite alphabet, Gub had delegated the tasks of tutoring his granddaughter to the Human woman. His legs had also been crippled by a vat collapse during an industrial accident during the Chagras Hegemony era. During Kerra's stay on Darkknell, the two girls shared the same room and they became close friends. Due to her undercover work as a Jedi infiltrator, Kerra was often missing for many hours. Kerra was able to explain her disappearance by claiming that she had been going out on romantic dates with an unknown male friend."}, {"tag": "p", "text": "Unknown to Tan and her grandfather, Kerra had been spying on the Black Fang testing facility, the premier military research think tank within the Daimanate. She intended to destroy the facility to sabotage Daiman's war effort. During her missions, Tan learnt that there was another spy doing surveillance work at the Black Fang facility: the Bothan Narsk Ka'hane, an independent intelligence operative who worked for several Sith Lords including Odion. However, his true master was Vilia Calimondra, the matriarch of the Calimondra family. Narsk had been tasked with collecting secrets on a military research project known as the Convergence Tactical Assault Vehicle for Odion and then destroying the research facility. However, Kerra captured him and destroyed the datapad containing the data on the vehicle. She then destroyed the facility with a baradium thermal detonator. After that, she stole the Bothan's Cyricept Mark IV stealth suit and then left Narsk to be captured by Daiman's Correctors."}, {"tag": "p", "text": "Kerra managed to escape back to the Tan household where she was reprimanded by Gub for being late home. After apologizing, Gub assigned her with tutoring his daughter in the afternoon after they had both return from their work shifts in the munitions factory. However, that afternoon, Tan was assessed by the Industrial Heuristics talent scouts Ler-Laar Joom and Eraffa, and the pair persuaded Gub to send Tan to work for the company studying war sciences. Her supervisor at the factor had observed that Tan was skilled with electronics and mathematics. The scouts offered her an internship specializing in the design and manufacturing of optical bombsights. Tan and her grandfather Gub accepted the offer since the company purported to offer better opportunities and job prospects that were not available on her poverty-stricken homeworld. Since Tan would have turned thirteen years old the following year, she would have been obligated to work three eight-hour shifts daily to qualify for a basic ration. Gub had also been concerned that his granddaughter would be eligible for conscription into the Daimanate military."}, {"tag": "h3", "text": "Daiman's Plot"}, {"tag": "p", "text": "Tan Tengo would join a group of about one thousand younglings who had been selected as students for Industrial Heuristics' arxeum project in the Daimanate. Unknown to the Sullustan girl and the other students, they were all merely disposable decoys who were to be sacrificed as part of Daiman's latest plot to trap Odion in retaliation for the destruction of the Black Fang research installation. Despite Narsk's denials, Daiman rightfully suspected that his older brother Odion had a role in the bombing and concocted a scheme to lure Odion into another trap on Gazzari. Daiman approached the Bactranate Quermian Sith Lord Ayanos Bactra with an offer to buy an arxeum—a mobile university dedicated to war research—from Industrial Heuristics. In exchange, Daiman offered to provide the students for the university who would be transported to the planet on four transports provided by the company."}, {"tag": "p", "text": "The transaction would occur on Gazzari and he promised Bactra's forces safe passage to the Gazzari system. Daiman later contracted the services of several mercenaries including the Brigadier Jarrow Rusher and convinced them to set up a trap on Gazzari. As part of the battle plan, the mercenaries would assemble their forces including several large artillery cannons around a massive caldera. Prior to the battle, Bactra's arxeum and the student transports would land within the caldera. Odion's forces would then invade Gazzari and the mercenaries would hold them at bay until Daiman's regular forces and attack fleet emerged from hyperspace. Daiman then planned to trap Odion's forces on Gazzari and kill his estranged older brother once and for all. While Rusher was initially concerned about using the children as decoy targets, he reluctantly cooperated after Daiman choked him with the Force. At the same time, Kerra infiltrated Daiman's palace the Sanctum Celestial where she attempted to assassinate him. However, she changed her mind when she learnt about Daiman's plot."}, {"tag": "p", "text": "As part of his trap, he arranged for Narsk to listen to the proceedings and then to escape back to the Odionate with the assistance of Kerra. Unknown to all the participants, Daiman had intentionally allowed Narsk to escape in order to lure Lord Odion into his trap on Gazzari. Meanwhile, Kerra stowed aboard Daiman's flagship the Era Daimanos and hitched a ride to Gazzari. As planned, the nihilistic Lord Odion saw the Gazzari deal as an opportunity to wreck further bloodshed and destruction. Despite Narsk's suspicions that this was a trap, the Sith Lord was undaunted by Daiman's plot and instead dispatched a sizable fleet to invade the planet."}, {"tag": "h3", "text": "An Unlikely Reunion"}, {"tag": "p", "text": "Tan and the students were transported to Gazzari in a fleet of four Industrial Heuristics transports. During the journey, Tan was excited about embarking on her first visit to another planet and was completely oblivious to Daiman's plot. The arxeum was the first to land in the Gazzari caldera and was shortly followed by the four transports. Tan along with the other arxeum students then disembarked from their transports. They were then escorted by droid minders towards the arxeum which was situated approximately one kilometer away from the ships. However, before Tan and the arxeum's other prospective students could enter the facility, Odion's forces landed on Gazzari and destroyed the university."}, {"tag": "p", "text": "Odion also deployed the Death Spiral, a massive siege platform, which proceeded to attack Daiman's mercenary forces encamped around the valley. These forces included Brigadier Jarrow Rusher's Rusher's Brigade which experienced heavy casualties. During the fighting, her Human friend Kerra emerged out of hiding and rescued Tan and the other students before they could be killed during the fighting. Kerra also stole a speeder bike from a fallen Odionate soldier and used it along with her green lightsaber to shepherd the arxeum students forward to safety. Fortunately, much of Odion's firepower had been concentrated on the arxeum which enabled Kerra and the arxeum students to flee to higher ground."}, {"tag": "p", "text": "Shortly afterwards, Odion himself arrived on the battlefield and his presence triggered subconscious suicidal feelings among many of the participants including Kerra and the students. During the journey, Kerra also noticed that Daiman's command dome was nearby, untouched beneath its raised energy shield. Believing she had left the baradium nitrate just outside the dome, Kerra prepared to detonate it while unaware that the explosives were still in a bandolier slung over her shoulder. Before Kerra could carry out her plans, Tan found Kerra and called out to her, asking what the Human Jedi was doing. Due to Tan's actions, Kerra quickly realized that the bandolier was still on her shoulder."}, {"tag": "p", "text": "Tan also retrieved Kerra's lightsaber and asked whether she was a Jedi. Kerra confirmed that she was indeed a Jedi and hugged Tan in order to comfort the frightened young Sullustan girl. During a brief conversation, Tan expressed her bewilderment at the destruction of the arxeum, which she had regarded as her future school. She also asked Kerra why the various Sith forces were trying to kill her and her fellow students. Tan and her fellow arxeum students' plight only hardened Kerra's resentment towards the Sith and reinforced the Jedi Knight's desire to defeat them. She assured Tan that the arxeum students had done nothing wrong to end up as targets of the Sith and promised to make the Odionites worried about what she was going to do next."}, {"tag": "p", "text": "After releasing Tan, Kerra saw a speeder bike flying towards them. This speeder bike was piloted by the Givin Jelcho, a fanatical Odionite adherent and a navigator aboard Odion's flagship Sword of Ieldis whom she had earlier encountered during the Chelloan affair. In a split-second reaction, Kerra used the Force to telekinetically push the bike to the ground and then knocked the Givin unconscious, kicking him in the jaw. Kerra then used the bandolier containing the baradium nitrate to secure the unconscious Givin to the bike. She then jammed its accelerator and sent it flying into the speeder bays of the Death Spiral. Once the explosives were inside the speeder bays, Holt set off the explosives using the detonator she had stolen from Ka'hane, destroying the siege tower."}, {"tag": "p", "text": "This massive explosion weakened the Odionite forces on Gazzari while allowing Rusher's mercenaries to retreat. Kerra then led the students to the east, where the laser fire from the Death Spiral had created a path to the top of the ridge. Climbing to the top, Holt encountered Jarrow Rusher and the remnants of his brigade, whose members were now loading their weaponry aboard the mercenary transport Diligence. After a lengthy argument, Holt convinced Rusher—who had already lost five-sixths of his forces;to allow her student refugees aboard his ship."}, {"tag": "h3", "text": "Voyage to Byllura"}, {"tag": "p", "text": "Tan Tengo survived the Battle of Gazzari and managed to escape Gazzari aboard the Diligence. Their escape coincided with a new startling development in the Second Charge Matrica, the contest between the local Sith Lords of the Grumani sector that had ravaged the region for the past eight years since the death of Chagras had caused the collapse of the Chagras Hegemony. The Calimondra family matriarch Vilia Calimondra, the grandmother of these Grumani Sith Lords, had decided that the Bactranate ruler Lord Bactra had outlived his usefulness. She ordered her grandchildren to invade the Bactranate and promised to divide the spoils among her family during the next bequest session. She ordered the Bothan spy Narsk Ka'hane to deliver her message to Odion and Daiman."}, {"tag": "p", "text": "After the destruction of the Death Spiral, Narsk was able to carry out his orders. The two warring Sith factions quickly abandoned their fighting and turned on Bactra's ships, destroying half of the Quermian's flotilla in under a minute. Amidst the fighting, the Diligence, carrying Rusher, Holt, and the arxeum students, made for space. Nevertheless, the Diligence survived the onslaught as Bactra's forces fled to hyperspace, and Daiman and Odion ordered their fleets to invade the planet Jutrand, Bactra's capital. As the forces of all three Sith Lords made for Jutrand, the Diligence, too damaged to continue fighting and carrying over a thousand students seeking refuge from the battle, fled into hyperspace, making six jumps to evade any pursuers."}, {"tag": "p", "text": "The voyage to Byllura would last several days and would be remembered by both Tan and Kerra as an unpleasant and hectic experience. Brigadier Rusher resented Kerra and her refugees as an unnecessary burden that hampered his mercenary operations. Rusher wanted to fly to another location where he could drop off the refugees as quickly as possible. The large number of student refugees aboard the Diligence created a serious overcrowding problem since there were insufficient facilities and beds to accommodate all the refugees. Rusher delegated the problems of managing the students to Kerra and his new Duros recruit Beadle Lubboon, who was the only crew member willing to help the refugees."}, {"tag": "p", "text": "By contrast, most of the other crew were hostile and indifferent towards the newcomers for sleeping in the bunks that had been previously occupied by their fallen comrades during the Gazzari disaster. Thus, Kerra was forced to recruit some of the older students including Tan to help attend to the younger refugees' needs. Kerra's problems were compounded by the lack of adequate numbers of refreshers since the former liner had been designed for male Devaronians. The diverse interspecies mix of the student body also proved volatile due to the vast physiological and cultural differences between individuals from different species. Interspecies tensions erupted in the form of squabbles over privacy and space throughout the journey."}, {"tag": "p", "text": "During the voyage, Tan's friendship with Kerra strengthened as the Sullustan girl came to regard the older Human woman as her big sister. To mark their friendship, Kerra gave her the Mark IV stealth suit that she had stolen from Narsk on Darkknell as a surprise gift. Tan also came to idolize Kerra as her hero. Throughout the journey, Kerra would shared bedtime stories of the historic exploits of the Jedi Knights. Kerra and Tan would also befriend some of the other refugees aboard the Diligence including the Ortolan girl Eejor, the Snivvian teenager Yuru, and the prepubescent Human girl Lureia. All had lived under the Sith and came from impoverished backgrounds. Due to the time zone differences between Darkknell and the Diligence, Tan was unable to sleep and donned the Mark IV stealth suit with the intention of playing games with Kerra."}, {"tag": "p", "text": "Donning her stealth suit, Tengo attempted to surprise Kerra while the latter was resting in her bunk. However, Kerra noticed her presence since the Sullustan girl had forgotten to activate the suit's sound baffles. She also reminded Tengo that she still had some \"growing up to do\" if she wanted to hunt Sith. Kerra noticed that Tan Tengo was awake and active and asked whether she was sleepy. Tengo replied that she had not adjusted to time aboard the starship. Kerra responded that this excuse would not last forever. Kerra then asked Tan whether she knew about the whereabouts of the Diligence's captain Jarrow Rusher. Tan revealed that she had tailed the Duros mercenary Beadle Lubboon and found that Rusher was two decks upstairs in the solarium. After thanking the Sullustan girl, Kerra departed to confront Rusher about the abysmal living conditions aboard the Diligence."}, {"tag": "p", "text": "Unknown to everyone aboard the Diligence, the Sith matriarch Vilia Calimondra had been monitoring the whereabouts of Kerra and the ship her stolen Mark IV stealth suit since it was connected to an embedded information system. Knowing this, she reassigned the Bothan spy Narsk to work for her granddaughter Arkadia Calimondra, who was planning an invasion of Byllura, the planet nearest to the Diligence's jump route."}, {"tag": "h3", "text": "A False Paradise"}, {"tag": "p", "text": "Tan's escape aboard the Diligence would bring her to Byllura, the dominion of the Dyarchy, a minor Sith realm. After making six jumps, the Diligence finally arrived in the Bylluran system. Due to a lack of reliable navigational information, the Diligence's crew had been unable to find a hyperspace route that would lead them to the Republic. Thus, Rusher was forced to settle for Byllura. While there was little extant information about the political situation in Byllura, there were rumors that Byllura was a Sith principality ruled by children with a regent running the realm on their behalf. According to one of Rusher's friends who had visited the planet, they had been in power for at least five years. As events unfolded, these rumors were confirmed to be true."}, {"tag": "p", "text": "Byllura was indeed controlled controlled by the Dyarchy, a Sith realm that was the home of Quillan and Dromika, the younger children of the late Chagras, the former ruler of the Chagras Hegemony. These two Sith twins had a powerful affinity with the Force; with Quillan having a powerful farsight ability while Dromika could send out strong hypnotic commands that would compel other sentients to do her bidding. Under the guidance of their Regent Saaj Calician, the twins had used their Force abilities and a network of enslaved Celegians to directly impose their will on the inhabitants of the Dyarchy, turning their subjects into thralls."}, {"tag": "p", "text": "As the Diligence entered into the atmosphere above Byllura's capital city Hestobyll, Kerra and Rusher were relieved to encounter no resistance. Brigadier Rusher was granted permission to land via commset by an unidentified individual dubbed \"Deep Voice\", who was actually the Celegian \"One\". Upon arriving at their allocated hangar platform, they were surprised to find that there was no welcoming party. Believing Byllura to be a safe destination free of any Sith presence, Rusher ordered the refugees to disembark. However, he was opposed by Kerra who insisted on conducting a proper reconnaissance probe of Hestobyll before allowing the passengers to disembark. This sparked another argument between the young Jedi Knight and the mercenary leader which ended in a compromise when Kerra managed to get Jarrow to give her one hour to do a proper recon probe of Hestobyll in exchange for returning the refugees onboard the Diligence."}, {"tag": "p", "text": "However, the Diligence's landing was being monitored by the enslaved Celegian \"One\" who had transmitted the information back to Calician. While Calician was aware that the ship's captain had indicated a readiness to off-load his passengers on Byllura, he became suspicious about a potential threat to the Dyarchy when an unidentified person (later revealed to be Kerra) got the student refugees to re-board the ship. Calician suspected that this was a Daimanate trick and quickly dispatched a contingent of Unifiers to investigate the Diligence under direct orders from Dromika, who was in turn being telepathically controlled by her twin brother Quillan. Still, Calician regarded the arrival of the Diligence as an opportunity to hasten his plans for galactic domination, beginning with several of Daiman's unguarded systems."}, {"tag": "h3", "text": "Prisoners of the Dyarchy"}, {"tag": "p", "text": "Tan Tengo would inadvertently set the stage for a chain of events that would bring about the complete collapse of the Dyarchy. While Kerra conducted her reconnaissance probe of Hestobyll, Tan and the other students stayed aboard the ship. She along with many of the other students were disappointed and impatient at not being allowed to disembark the Diligence. Meanwhile, Brigadier Rusher assigned thirty two crew including the shipmaster Dackett and Prenda Novallo outside onto the landing platform to make repairs to the Diligence."}, {"tag": "p", "text": "Despite Rusher's orders that the passengers remain on the vessel, the Sullustan girl Tan sneaked out of the ship, determined to follow Kerra who she idolized. In response, Rusher sent the Duros trooper Lubboon to bring her back. An hour later, the Diligence received another transmission from \"Deep Voice\" on the commset that the Byllurans had seen the refugees on the platform and were sending people to help with their situation. According to \"Deep Voice\", the refugees would supposedly be \"directed to a center for assigning quarters.\" Seeing it as an opportunity to get rid of the refugees, Rusher contacted Kerra but the Jedi remained distrustful."}, {"tag": "p", "text": "After an hour, Kerra encountered Tan who was in turn being tailed by an exhausted Lubboon. The Duros soldier was physically unfit and had struggled to keep up with the young Sullustan girl. Kerra was initially angry at the Sullustan girl for disobeying her orders. Both also attended to the exhausted Lubboon with Tan asking Kerra if she had Jedi healing powers. Kerra responded that her solution would be to make the Duros run laps everyday. Tan also noted to Kerra that the buildings on Hestobyll were drab and plain. The three travelers then became swept into a large crowd heading towards one of the hexagonal silos."}, {"tag": "p", "text": "In an attempt to find out about the situation on Byllura, Kerra pulled aside an elderly Duros but he did not understand Galactic Basic Standard. Despite his Duros ancestry, Lubboon was unable to help because he did not speak Durese. However, Kerra quickly realized that language was not the issue but rather he could not respond because he was being controlled by external forces. After observing the silent and uniform movement of the crowd walking towards the silo, Kerra would conclude that the people of Hestobyll had been reduced to thralls by mental suggestions from unidentified Force users. Kerra thus concluded that the Sith rulers on Byllura were directly imposing their will on the masses. As they moved nearer towards the silo, they discovered that a network of Celegians was being used to transmit these Force-induced mental commands."}, {"tag": "p", "text": "As they traveled through the streets, Kerra tried to warn Tan and Beadle to stay together. However, the travelers were separated by the crowd. Tan and Beadle also succumbed to the effects of the Force-induced mental manipulations, and were drawn towards following the flow of the crowd. At that point, a party of \"Scarlet Riders\" arrived in airspeeders. They used Force persuasion to coerce the various people within the crowd into complying with the Dyarchy's orders. Two Scarlet Riders also arrested Lubboon while a third captured Tan. The Sullustan girl and the Duros youth were then led into an airspeeder which quickly departed for the Loft, the Dyarchy's headquarters. In an attempt to save her two charges, Kerra attacked the Scarlet Riders and embarked on a pursuit through the streets and skies above Hestobyll. This pursuit would end at the Loft, a palace built on a rock opposite the harbor. The Loft was home to the Dyarchy's twin rulers Quillan and Dromika, and their Regent Calician."}, {"tag": "p", "text": "Kerra also managed to warn Rusher in time to bring most of his crew back aboard the Diligence, minutes ahead of the arrival of another party of Unifiers dispatched to the spaceport. The Unifiers captured several members of Rusher's crew including shipmaster Dackett and Novallo who had been making external repairs to the ship on the landing platform. However, Rusher and the crew managed to fight off the attackers. After wiping out the Scarlet Riders and destroying their airspeeders, he then rescued his captured crew. With the Dyarchy's fleet lifting into space from their underwater hangar bays beneath Hestobyll's reflection pools, Rusher ordered the Diligence out to sea and away from the chaos."}, {"tag": "h3", "text": "Escaping the Dyarchy"}, {"tag": "p", "text": "Following their capture, Tan and Beadle were brought to the Loft where they were detained by the Unifiers. By then, Regent Calician and the Sith twins had learnt about Kerra's presence through their telepathic network. The twins viewed Holt as a threat and they ordered the Krevaaki to protect them, taking direct control of his mind via the Force. Meanwhile Kerra managed to infiltrate The Loft's airspeeder hangar bay. After killing several Scarlet Riders in the hangar bay, she then made her way to chamber in which the aged Celegian known as One was held. There, she persuaded him to stop sending messages on behalf of the Dyarchy, placing the communications network into disarray."}, {"tag": "p", "text": "Finally, she instructed One to send Tan and Beadle to the airspeeder hangar bay so that they could be picked up later. The Celegian complied with Kerra's instructions and sent a sentry to escort Tan and Beadle to the airspeeder hangar bay. There, Beadle found a working airspeeder and attempted to use it to escape the Loft. However, the inexperienced Duros did not know how to drive the speeder and was only able to keep it afloat by flying in circles outside the hangar. Following their escape, the Sullustan girl Tan sat on the ledge of the hangar's landing port and waited for the arrival of the Diligence. Meanwhile, Kerra encountered Calician and the Sith twins. After a fight, Kerra was disarmed and Quillan ordered his sister Dromika to order Calician to kill her after she refused to submit to them."}, {"tag": "p", "text": "Meanwhile, Brigadier Rusher flew the Diligence over the harbor and ocean towards the mesa which housed the Loft. At that time, Rusher was in the ship's cargo deck when he witnessed Tan and Lubboon outside the hangar bay through the monitor. Rusher flipped the switch to lower the cargo deck's hangar bay and he contacted Luboon. When Rusher asked Lubboon why he picked up Tan but left Kerra behind, the Duros replied that he had found the speeder before she could escape the palace and added that he did not know how to pilot the vehicle. Rusher was about the reprimand the Duros trooper for losing his headset when Lubboon revealed that the Brigadier had already lent it to Kerra for her recon probe. When Rusher asked if Lubboon and Tan had killed those Scarlet Riders lying on the floor of the hangar bay, Tan replied that Kerra had attacked the Loft after their arrival."}, {"tag": "p", "text": "Shortly later, two of Rusher's soldiers leapt from the cargo deck into Lubboon's airspeeder and managed to gain control of the vehicle. Since Rusher was unable to land the massive Diligence on the Loft's hangar bay without its stowed cannon barrels jabbing the cliff wall, he instructed Tan to wait while his men backed the airspeeder up so that she could get on. Rusher then told Tan to hop into the airspeeder when they reached her. However, Tan refused to go unless Rusher rescued Kerra as well. Tan explained that Kerra was still inside the Loft and tried to convince him to follow her. Rusher was initially reluctant to storm the Loft and rescue Kerra. However, he changed his mind after witnessing several droids being thrown out the window from the Loft's penthouse. Tan and Rusher then realized that Kerra was at the penthouse above the Loft."}, {"tag": "p", "text": "After rescuing both Lubboon and Tan, the Diligence flew to the Loft's penthouse. By then, Kerra had broken away from Calician and the twins and was fighting for her life. The Diligence then used its heavy frontal gun emplacement to breach the penthouse's windows. In the ensuing chaos, Kerra sensed that Quillan was the dominant twin who was merely using his sister Dromika as his puppet. Realizing this, she kidnapped Quillan and brought him on board the Diligence. Once aboard the Diligence, Quillan descended into an infantile tantrum since he was unable to sense his sister through the Force."}, {"tag": "p", "text": "Meanwhile, a distraught Dromika fell into a comatose state since she could not discern between a physical presence and a Force emanation. Brigadier Rusher was initially angry with Kerra for bringing a Sith aboard, albeit an adolescent, since it violated his strict maxim of not taking any Sith Lords as passengers. Following their escape, Tan befriended Quillan and initially mistook him for a fellow refugee from Gazzari. Due to their similar ages, Tan was able to keep the captive Quillan calm by acting as his playmate. Fortunately for Tan and Kerra, the adolescent Sith Lord chose not to use the Sullustan girl as a new puppet."}, {"tag": "p", "text": "The incapacitation of Quillan and Dromika would have enormous repercussions for the Dyarchy on Byllura. Bereft of its twin rulers, the highly-centralized fiefdom rapidly disintegrated into anarchy. Meanwhile, One successfully convinced his Celegian compatriots to rebel. They refused to send anymore telepathic messages and this led to the collapse of the entire telepathic network. The Celegian uprising made it impossible for Calician to co-ordinate the Dyarchy's manufacturing efforts. This created pandemonium among the enslave workers and a series of explosions caused by malfunctioning equipment destroyed several shipyards and munitions factories. With the end of the Dyarchy's telepathic network, the population emerged from their mentally-induced thralldom and quickly reclaimed their former cognizance and autonomy. Riots quickly broke out across Byllura's major centers including Hestobyll as the inhabitants vented out their fury on the old order."}, {"tag": "p", "text": "As the Diligence exited Byllura's upper atmosphere, the Dyarchy was invaded by a fleet of Arkadianate warships led by their older sibling and Sith Lord Arkadia Calimondra. Arkadia's warfleet quickly disabled the Dyarchy's battleships and also captured the Diligence in their tractor beam projector. Arkadianate forces rapidly occupied Byllura and annexed the former Dyarchy. Arkadia took her younger brother and sister into custody though they were kept separate from each other. Finally, Calician himself was executed by Arkadia's troops with the Bothan spy Narsk witnessing the execution."}, {"tag": "h3", "text": "Guests of Arkadia"}, {"tag": "p", "text": "While Tan Tengo would play a lesser role in the events that occurred in the Arkadianate, she still managed to visit an Arkadianate world and initially believed it was a \"utopian paradise.\" Arkadia Calimondra surprised Kerra and Rusher by welcoming them as guests and offered to provide shelter for the passengers aboard the Diligence. She also provided them with coordinates to her capital of Syned, a remote icy planet in the fringes of the Grumani Sector. While Kerra was initially apprehensive, Rusher accepted the offer because the Diligence was already overcrowded and running low on supplies. There, Arkadia convinced Kerra and Rusher to hand over her brother Quillan into her custody."}, {"tag": "p", "text": "After some discussion, Kerra and Rusher complied and returned aboard the Diligence to bring Quillan. They were met by a trundle car that had been provided by Arkadia to transport them to Patriot Hall, the main public atrium at her capital city of Calimondretta. Tan Tengo and Beadle Lubboon also accompanied Quillan, who remained seated in a brown hoverchair. When Arkadia first encountered the young Sullustan girl, she was initially suspicious until Kerra explained that she had brought Tan along to calm the adolescent Sith Lord. After giving Tan a friendly nod, Arkadia's aides took Quillan into custody. Rusher brought the clumsy Duros trooper Beadle along for this meeting since he wanted to give the impression that they were not a threat to Arkadia."}, {"tag": "p", "text": "Satisfied with her guests, Arkadia then took them on two separate tours of her capital city Calimondretta. Syned had been recently colonized and Arkadia's city had been built within a series of connected ice calderas. Arkadia also sought to present a positive image of herself and her regime to her visitors. She praised them for helping her to bring the defeat of the former Dyarchy while deriding the late Regent Calician as the \"evil\" mastermind who had manipulated her two younger siblings."}, {"tag": "p", "text": "Shortly later, they were joined by Narsk Ka'hane, the Bothan spy whom Kerra had encountered earlier on Darkknell. During this meeting, Kerra and Rusher would learn that the Bothan was an independent operator who worked for various Sith Lord. Narsk demanded the return of his stealth suit but Kerra explained that she had already give it to Tan. Kerra attempted to ask Tan to return the suit but the Sullustan girl had already gone on an official tour of Calimondretta with Trooper Lubboon. Thus, Narsk would have to wait until Rusher sent somebody else back to the Diligence."}, {"tag": "p", "text": "From the beginning, Tan took a personal liking towards Arkadia. Arkadia was pleased by the Sullustan girl's optimism and claimed that Calimondretta had a lot to offer her and her fellow refugees. Tan was still unaware about Arkadia's secret conspiracy to use Kerra to assassinate her grandmother Vilia Calimondra, the family matriarch. Arkadia also planned to deploy the biological agent Chagras's Blood, a nerve toxin extracted from Synedian algae, during a planned expansionist campaign. Arkadia also instructed her Twi'lek aide Warmalo to provide Rusher with food supplies for the Diligence. This ploy also succeeded in winning Rusher over. Finally, Arkadia arranged for the friendly Herglic mother Seese to take Kerra on a tour of her capital. Meanwhile, Arkadia herself would take Tan and Beadle on a tour of her capital, intending to win her guests over so that they would be willing to join her Sith regime as new subjects."}, {"tag": "p", "text": "Arkadia succeeded in winning Tan, Lubboon and Rusher due to her charismatic personality and her successful propaganda display. However, the Jedi Knight Kerra still distrusted the Sith Lord due to the historic animosity between the two Force Orders. Kerra also rightfully suspected that Arkadia wanted to exploit them for her own cause. During Tan's tour of the Arkadianate capital, the Sullustan girl came to admire her host's personality and her supposedly well-run and \"enlightened\" society particularly its well-run Promisoriums."}, {"tag": "p", "text": "In these state-run schools, children throughout the Arkadianate were indoctrinated into becoming \"productive\" and loyal subjects of Arkadia. Tan was amazed by the wide range of subjects taught at these schools including calculus, genetics, and stellar cartography. By contrast, many children back in the Daimanate were denied access to education and were forced to work as cheap labor. The Promisoriums were a cornerstone of Arkadia's policy of continually rotating her subjects through different jobs throughout their lives. Officially, this was done to encourage flexibility and versatility among her subjects. In reality, this policy served as an insurance policy for Arkadia's rule by preventing anyone from gaining enough influence to challenge her rule."}, {"tag": "p", "text": "During the tour, Tan shared with Arkadia about her childhood growing up in the Daimanate. She explained that she had also been selected for a munitions training course by Industrial Heuristics and that the students would be limited to one subject for the rest of their lives. Even Arkadia was shocked by the constricted nature of Daiman's education system. At some point, the clumsy Duros Trooper Lubboon accidentally fell down an escalator that was designed for Herglics, a large cetacean species. Each of the escalator's steps were two meters-long. While Lubboon survived the fall, his forehead was grazed."}, {"tag": "p", "text": "Following the tour, Tan encountered Kerra who had also finished her tour of Calimondretta. The young Sullustan girl was excited about life in the Arkadianate and extolled the virtues of Calimondretta's education system. Due to her impoverished background growing up in the totalitarian Daimanate, Tan had little exposure to other parts of the galaxy and thus initially believed that the Arkadianate was a utopian paradise in lawless Sith Space. Kerra and Tan were both pleased by the well-run state of the Promisoriums. After returning to Patriot Hall, the teenaged Sullustan gave Arkadia a hug, which pleased the Sith Lord but caused Kerra to wince. Arkadia saw this as an opportunity to promote a favorable image of her realm by inviting Tan to tell her friends aboard the Diligence about the supposedly \"good life\" waiting for them in the Arkadianate."}, {"tag": "p", "text": "Later, Tan and Kerra encountered Rusher who had finished acquiring supplies for the Diligence and had been won over by Arkadia's propaganda. In return for his services, Arkadia promoted Warmalo from being the storehouse manager to the director of metallurgical operations on Syned. Tan and Lubboon were allowed to leave on a transport heading to the Diligence which carried all the food supplies. This influx of food was a relief to the crew and passengers aboard the Diligence which had begun to run low on supplies. Meanwhile, Kerra and Rusher remained behind for a meeting with Arkadia."}, {"tag": "h3", "text": "The Great Escape"}, {"tag": "p", "text": "Tan Tengo remained aboard the Diligence during the Siege of Calimondretta which saw Kerra and Rusher along with the ship's passengers, many Arkadianate defectors, and the Bothan spy Narsk and Quillan escape the Arkadianate. After allowing Kerra to attend a session of the Bequest where the Jedi Knight learned about the intricate political dynamics of the Grumani Sector, the Sith Lord Arkadia tried to recruit Kerra as assassin. She intended to assassinate her grandmother and family matriarch Vilia Calimondra in order to seize power in the sector. The plot involved Kerra couriering Quillan to Vilia's secret location and then killing the matriarch. However, Kerra refused to work for the Sith Lord and Arkadia had her imprisoned, intending to execute her. She then ordered Rusher to deliver the passengers aboard the Diligence to Patriot Hall where they would be integrated as Arkadianate subjects."}, {"tag": "p", "text": "The Bothan spy Narsk took up the offer to courier Quillan to Vilia and then assassinate the matriarch. However, he was actually a double agent working for Vilia and received orders from the matriarch that ordered him to work against Arkadia's plot. Vilia had somehow learnt about her granddaughter's plot and sought to countermand it. Narsk managed to convince Rusher to work against Arkadia's plans by promising to give him half of the hyperspace coordinates that would lead into a jump point in neutral space. Narsk also managed to free Kerra from her prison before she could be exposed to the nerve toxin Chagras's Blood. In return for helping to create a diversion, Narsk gave Kerra the second half of the coordinates. Rusher kept to his side of the bargain by hijacking an icecrawler that had been dispatched to transport the refugees to Calimondretta. Rusher then used the vehicle to infiltrate Arkadia's capital and assault it. This created a diversion that allowed Narsk to escape with Quillan on a shuttle to Vilia's secret location."}, {"tag": "p", "text": "Kerra also fought with Arkadia and managed to escape, stealing the Sith Lord's prized twin-bladed lightsaber. She was rescued by Rusher who brought her back aboard the Diligence. The ship's 1,717 student passengers were also joined by about 500 Arkadianate refugees who had grown weary of Arkadia's dictatorial rule. These included the Twi'lek Warmalo, the supply clerk who had been promoted to the position of metallurgist. These defections dealt a blow to Arkadia's rhetoric that the Arkadianate was an \"enlightened Sith regime.\" Tan and many of the other students were excited by the news that the Diligence was finally heading to the Galactic Republic itself after several weeks of rough living. Kerra recalled that the Sullustan girl was so excited that she had barely slept. Several of Tan's fellow refugees would also join Rusher's Brigade as independent military operatives."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tan Tengo was a Sullustan child who was reaching adolescence. She was playful, adventurous, optimistic, and had a good sense of humor. Tengo regarded the Jedi Knight Kerra Holt, who was just a few years old than her, as a big sister. Tengo was eager to follow and assist Holt due to her close friendship. However, she was also naive due to her youth. During her visit to the Arkadianate, she was tricked by the Sith Lord Arkadia Calimondra into believing that the Arkadianate was actually a utopia."}, {"tag": "p", "text": "While she was not Force-sensitive, Tan Tengo had a talent for working with electronics and machinery. She was praised by her supervisor in Xakrea for her skills with disassembling electronic components. In 1032 BBY, her talents led her to being recruited by Industrial Heuristics as a student for a military industrial program which built bomb-sights. She was also capable of following someone unnoticed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tan Tengo first appeared as a minor supporting character in John Jackson Miller's stand-alone novel Knight Errant, which was first released on January 22, 2012. She has not appeared in any other Expanded Universe literature to date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": "."}]}