{"url": "Battle_of_Falleen/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Falleen"], "nodes": [{"tag": "h1", "text": "Battle of Falleen"}, {"tag": "p", "text": "A battle took place in 22 BBY during the Clone Wars when a Confederate fleet under the command of General Grievous attacked the planet Falleen. A Galactic Republic battle group—including eight Jedi and numerous clone troopers—attempted to defend the planet but was ultimately unsuccessful. Grievous deployed ground troops to seize the planet, but the droids were unable to get past the shields of a fortress belonging to the planet's Falleen king. The Dark Acolyte Asajj Ventress infiltrated the fortress and defeated the king's bodyguards, at which point the king himself tried to kill her. However, Count Dooku had also infiltrated the fortress. He subdued the king, forcing him to deactivate the fortress' shields and allowing the Confederacy to capture the planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, the Jedi High Council discovered evidence that the Confederate General Grievous was planning to invade the Republic-aligned planet of Bothawui—home to the Bothans, who possessed unmatchable information collection skills. If Bothawui fell to the Confederacy, the Republic and the Jedi would loose a valuable ally. The Jedi Council therefore dispatched Jedi General Anakin Skywalker and his Padawan, Jedi Commander Ahsoka Tano, with a fleet of three newly constructed Venator-class Star Destroyers to protect the planet."}, {"tag": "p", "text": "En route to Bothawui, Skywalker and his forces were pursued by Grievous's fleet of four Munificent-class frigates. Skywalker engaged Grievous on three separate occasions, suffering several losses throughout their stalemate encounters. Grievous, however, delayed his pursuit of Skywalker in order to coordinate several attacks on Republic forces on separate fronts. The cyborg general soon decided to capture Falleen and picked up two more frigates to invade the planet."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Grievous arrived at Falleen and engaged the Republic forces stationed there—consisting of the Jedi Knights Lobis Lobin, Kydra, and Tafasheel Arkan, as well as five other Jedi, numerous Republic officers, clone troopers, and cruisers. Grievous dispatched Hyena-class bombers to aid in the attack, and C-9979 landing craft were deployed with ground troops aboard. B1-Series battle droids seized the planet's surface but were unable to get past the shields of a fortress that belonged to the king of Falleen."}, {"tag": "p", "text": "However, Confederate Head of State Count Dooku had arrived on the planet with the Dark Acolyte Asajj Ventress. Dooku devised a plan for Ventress to duel the Falleen king's bodyguards and draw the king out of his palace, allowing Dooku himself to enter the fortress and subdue the king. Ventress approached the fortress, and the king sent his Dashade bodyguards to eliminate the intruder. The guards attacked Ventress with electrostaffs, but as they engaged the lightsaber-wielding Dark Acolyte in combat, Ventress gained the upper hand."}, {"tag": "p", "text": "As the king watched the duel through a gatekeeper droid stationed nearby the combatants, Ventress destroyed the droid, preventing the king from continuing to spectate the events unfolding outside his palace and consequently did not notice Dooku's arrival. The king armed himself with a blaster and left his secure command center to confront Ventress. As the Dark Acolyte eliminated the last of the guards, the king arrived and prepared to kill Ventress. However, Dooku was able to enter the fortress himself and appeared behind the king, holding the Falleen at lightsaber point. The Sith Lord ordered the king to lower his fortress' shields and submit to the Confederate cause."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By the time the battle was over, Falleen had fallen to the Confederacy. The Republic battle group had been completely eradicated, including all eight Jedi. The Republic starship Bespin Dancer and its crew had also been eliminated. With his victory at Falleen secured, Grievous continued toward his original destination of Bothawui. Skywalker arrived at the Both system ahead of the Confederate general. Unaware of the Republic's defeat at Falleen, Skywalker contacted Jedi Masters Yoda and Mace Windu of the Jedi Council. As the pair was busy in a conference with Supreme Chancellor Palpatine, Skywalker was relayed to Master Obi-Wan Kenobi. Kenobi informed Skywalker of the Republic's loss of Falleen and reported that Grievous's fleet was headed to Bothawui. Although outnumbered in vessels, Skywalker intended to remain at Bothawui to protect the planet from falling into the Confederacy's grasp."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Falleen first appeared in The Fall of Falleen, an issue of the weekly online The Clone Wars comic series that led into \"Downfall of a Droid,\" an episode in the first season of the 2008 Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}