{"url": "Tangrene_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Enslaved species", "Category:Extinct sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Tangrene  (species)"}, {"tag": "p", "text": "The Tangrene were a sentient species that evolved on the Outer Rim Territories planet Tangrene. The species developed a peaceful, nomadic society that lived on a world with very little surface vegetation. Their homeworld was discovered between 5,000 and 3000 BBY, and was the terminus of a hyperlane. Under the Galactic Empire, the Tangrene were enslaved in order to construct an Imperial Intelligence Ubiqtorate center. Following completion of the project, the local Imperial Moff ordered the genocide of the Tangrene to prevent any future uprisings."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Tangrene were a peaceful, sentient species. Their homeworld was mountainous, with barely any surface vegetation or moisture. Instead, lakes formed in underground caverns, around which developed fungal and vegetative ecosystems. In response to their environment, the Tangrene developed into a nomadic society."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Tangrene people evolved on a planet of the same name, located within a part of the Outer Rim Territories that was explored during the period from 5,000 to 3000 BBY. The Tangrene system was incorporated as part of the Morshdine sector and became the end point of a sizable hyperlane. During the Clone Wars fought between the central Galactic Republic and the breakaway Confederacy of Independent Systems, Tangrene was within contested territory."}, {"tag": "p", "text": "During the regime of the Galactic Empire, the successor state to the Republic, the Tangrene were enslaved by the Empire and pressganged into constructing a defensive complex of garrisons and shield generators of what eventually became a highly secure Imperial Intelligence Ubiqtorate center. Once construction was complete, the Morshdine sector Imperial Moff elected to forestall any chance of rebellion by depopulating the planet. The Tangrene were completely defenseless in the face of Imperial might, and the entire Tangrene population was massacred. After their extinction, the Tangrene homeworld was the site of several battles between various factions of the Galactic Empire and its rival, the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tangrene were created by Eric Trautmann, author of the roleplaying game supplement The Last Command Sourcebook, published in 1994. The West End Games product was created as a companion to the Timothy Zahn novel The Last Command. The information on the Tangrene was later republished in 1996 as part of the The Thrawn Trilogy Sourcebook compilation. The massacre of the Tangrene then appeared on a map of Imperial atrocities in 2009's The Essential Atlas. None of these sources makes it clear whether Tangrene is the plural and singular form of this species."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}