{"url": "Tanner_Carzyn", "categories": ["Category:Legends articles", "Category:FarStar crewmembers and personnel", "Category:Humans", "Category:Males", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Tanner Carzyn"}, {"tag": "p", "text": "Tanner Carzyn was a teenage Imperial technician serving under Moff Kentor Sarne on Kal'Shebbol. He later became a member of the crew of the New Republic CR90 corvette FarStar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Carzyn had lived under Imperial rule his entire life. Born in the Colonies, Carzyn moved around with his parents who were always chasing phantom business opportunities. They moved to the Minos Cluster, then eventually settled on Kal'Shebbol. Carzyn dreamed of joining the Imperial military as a gunner, but the Imperial defeat at the Battle of Endor ended his dream. Realizing that the Academy would never accept an application from him, he tried to join Moff Sarne's ground forces."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "Sarne's administration accepted Carzyn into their ranks, but not as a soldier. Instead, he was assigned as a technician, responsible for fixing and maintaining weapons emplacements on capital ships and ground fortifications. When the New Republic liberated Kal'Shebbol in 8 ABY, Carzyn, like many non-essential personnel, was left behind by Sarne. Feeling betrayed, Carzyn swore revenge on the Moff."}, {"tag": "h3", "text": "Onboard the FarStar"}, {"tag": "p", "text": "Carzyn told the New Republic forces that Moff Sarne had enslaved and betrayed his family, and managed to get assigned to the FarStar as a weapons technician. Responsible for maintaining both the ship's turbolasers and starfighter weapon systems, Carzyn was outwardly loyal to the New Republic. However, he secretly planned to jump ship when the FarStar came into contact with Sarne's forces. Despite feeling betrayed, Carzyn was torn between a desire to go after Sarne himself, or defect and join him in his fight."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Carzyn was wholly loyal to the Empire, believing it to be the best means of keeping order in the Galaxy. By extension, he was fully loyal to Moff Sarne following the fragmentation of the Empire after the Battle of Endor."}, {"tag": "p", "text": "Carzyn's feelings following his abandonment on Kal'Shebbol by Sarne were confused. On one hand, he wanted revenge on the Moff for leaving him behind despite his loyalty. On the other, he wanted to defect and rejoin the Moff. He struggled with the decision throughout his service on the FarStar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}