{"url": "Battle_of_Felucia_(Outer_Rim_Sieges)/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Felucia theater", "Category:Battles of Felucia"], "nodes": [{"tag": "h1", "text": "Battle of Felucia  (Outer Rim Sieges)"}, {"tag": "p", "text": "The Battle of Felucia occurred late in the Clone Wars, part of the Outer Rim Sieges. It was initially a mission assigned to the 182nd Legion of the Grand Army of the Republic to combat the Separatist forces which had taken control of the planet. When contact with the 182nd was lost, the 501st Legion of elite clone troopers was deployed to investigate their disappearance."}, {"tag": "p", "text": "After the 501st secured the area, the 327th Star Corps under the command of Jedi Master Aayla Secura and Marshal Commander CC-5052 arrived and began a manhunt for Presidente of the Commerce Guild, Shu Mai, who was believed to be holding Jedi Knight Barriss Offee prisoner. Following her rescue, the battle quickly shifted to an attempt to stop the spread of deadly toxins from contaminating Felucia's water supply. In the midst of the battle, the Order 66 protocol issued by Supreme Chancellor Palpatine was received, and the Jedi were shot dead by their own men."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Earlier in the war, General Grievous of the Confederacy of Independent Systems led an assault on Felucia and secured the planet for the Separatists. The Jedi Plo Koon, Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano, Anakin's Padawan, were sent to save the planet. However, the clone trooper force was greatly outnumbered and the Jedi were forced to retreat, failing in their mission."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "It began with the landing of the 182nd Legion which, after some time, the Republic lost contact with. Therefore, elements of the elite 501st Legion were deployed to begin routing the Separatist army from the planet."}, {"tag": "p", "text": "The very first phase of the battle was the 182nd Legion attacking the Felucian blockade by the CIS. They were taken out with mild difficulty. Yet when they landed on the surface, they were overrun and called in the 501st Legion for help."}, {"tag": "p", "text": "Upon arrival however, the 501st quickly found that Felucia had a nightmarish topography. With dense foliage and seemingly infinite jungles and spores, ambushes were common, and heavier support vehicles were hard to use. The 501st sent a patrol to scout ahead, but their transmission was abruptly cut off by blaster fire, screams and an unearthly screeching noise. Moving forward, the troopers encountered six feral acklay, which had decimated the patrol. Rockets and mines were used to great effect, but the group suffered heavy casualties. Two gunships tried to land to reinforce the group, but one gunship was shot by AA guns and crashed in the brush nearby."}, {"tag": "p", "text": "501st members protected an AT-TE from super battle droids and assault droids for some time. About fifty advanced down the hill. They attempted to destroy the vehicle with rockets, but it had little effect, and that made the droids easy targets for the clones. After the onslaught, the clones repaired the vehicle by taking a power cell from the downed Republic gunship and using it to re-power the walker to make use of it."}, {"tag": "p", "text": "Eventually Jedi General Aayla Secura arrived on Felucia, and was able to lead the 501st contingent to rout the Separatist defenders at a high cost of troops. It was here that Secura dubbed the 501st \"the bravest men she had ever seen\". Armed with dual lightsabers, Secura cut through the droid ranks to recover a powercell from the crashed gunship and powered up the walker, causing devastation to the CIS tanks advancing on their position."}, {"tag": "p", "text": "The Republic troops then preceded to destroy six Anti-Vehicle turrets that were causing damage to Republic forces from the area near the fungal tree, and moved on."}, {"tag": "p", "text": "As part of the hunt for Commerce Guild Presidente Shu Mai, Secura and her troops arrived at the Nigkoe Detention Facility where they believed Jedi Knight Barriss Offee was being held prisoner."}, {"tag": "p", "text": "Attacking the facility, the clone troopers, under the command of Clone Commander Bly, engaged the Gossam Commandos and secured the area while Secura freed both Offee and her Selonian Padawan Zonder."}, {"tag": "p", "text": "Still on the trail of Mai, Jedi Generals Secura and Offee, along with the 327th Star Corps clone troop infantry under the command of Bly, arrived at her heavily fortified compound outside of Kway Teow."}, {"tag": "p", "text": "After creating a diversion that destroyed several B2 super battle droid guards, the Jedi and clones advanced on Aratech BARC speeder bikes toward the compound. They were attacked by several droid starfighters, but these were dealt with by a Republic squad of ARC-170 starfighters."}, {"tag": "p", "text": "Having entered the compound through a lake and waterfall-access, and let their troops inside, Aayla Secura, Barriss Offee and their Padawans Ekria and Zonder found that their search was for naught; Shu Mai's personal ship had left days ago and no one had entered or left the compound since."}, {"tag": "p", "text": "While gathering information on the ongoing attack on Coruscant, the Jedi were informed by Commander Bly that the compound was filling up with toxins. A countdown sequence had also begun, which prompted Secura to order a full withdrawal from the area.\nMoments before the compound exploded, the Jedi and their troops managed to escape."}, {"tag": "p", "text": "A clone trooper task force of the 327th Star Corps infantry, under the command of Jedi General Aayla Secura, prepared to attack several of Felucia's water treatment facilities to prevent the Gossam homeworld from being infected by a toxin released into the water supply. This situation had come about due to a self-destruct mechanism designed by Presidente Mai."}, {"tag": "p", "text": "The clone trooper reinforcements, brought in by Jedi General Stass Allie, who then went on to Saleucami, were briefed on the situation by Commander Bly. It was stated that Felucia's defenses were heaviest against air assault, thus a ground attack would be most effective. Since the jungle would slow them down, Jedi Knight Barriss Offee would lead one squad to Har Gau, while a second squad, led by Jedi Padawans Ekria, Zonder and the newly-arrived Drake Lo'gaan, would target Jiaozi. General Secura's squad would accompany the Padawans and then proceed to Niango."}, {"tag": "p", "text": "The 327th Star Corps task force then split up and headed into the woods."}, {"tag": "p", "text": "As the Padawans' force reached Jiaozi, they staged a diversionary attack and withdrawal, to lure the guards away from the water treatment facilities and allow the three Jedi access. The toxins were restrained from spreading further, but remote access to the other stations was impossible, as they each were on an isolated network. Padawan Ekria then tried to raise Generals Secura and Offee, but failed as the transmissions were being jammed. In an attempt at finding out the state of the other forces, Ekria gained access to cameras installed inside clone trooper helmets. This feat might possibly have saved the three Padawans from certain death, as Order 66 was given a few minutes later."}, {"tag": "p", "text": "When the order was given, Barriss Offee was under siege from B-2 battle droids. Having seen Lieutenant Galle arrive with reinforcements, she ordered him to open fire. She was subsequently shot to death by an AT-TE walker and her own troops."}, {"tag": "p", "text": "Aayla Secura had stopped on her way to Niango, due to reports of a Separatist armored unit in the area. As her troops waited, Secura was distracted by a bird suddenly taking flight, while at the same moment Commander Bly received Order 66 and proceeded to shoot his commanding officer in the back before she could even react. Aayla Secura was finished off by concentrated fire from the clones surrounding her."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Having witnessed the slaughter of their seniors, the three Padawans situated at Jiaozi water treatment facilities managed to escape their own troops and fled the planet."}, {"tag": "p", "text": "After containing the toxins and saving the planet, the newly established Galactic Empire absorbed Felucia into its control."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}