{"url": "Battle_of_Felucia_(Great_Jedi_Purge)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Felucia", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Felucia  (Great Jedi Purge)"}, {"tag": "p", "text": "The Battle of Felucia was a series of skirmishes between the Galactic Empire and the Felucian race. An order was issued to Imperials stationed on the planet to enact complete genocide of the Felucian race, which had turned savage under the influence of Dark Jedi Maris Brood. Much of the race had retreated into the Ancient Abyss, and so a Sarlacc stabilizer was built to allow passage into the creature to round up any survivors and kill them."}, {"tag": "p", "text": "During the course of the battle, Brood had taken Senator Bail Organa hostage, who had come to the planet to find Jedi Master Shaak Ti. He was unaware she had been killed a year before. Galen Marek, the secret Sith apprentice of Darth Vader, arrived to extract Organa later during the battle, and so casualties on both sides of the conflict were immense."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the assassination of Jedi Master Shaak Ti, the planet went unprotected, and the Galactic Empire established its presence and took over. Maris Brood, stranded on the planet, succumbed to the planet's dark side energies, and in doing so took the Felucian tribes with her. Now considered a savage species by Imperial forces on the planet, Felucians were sought to kill. Both sides were locked in deadly conflict, with both hunters and prey alike gaining little ground over the other."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Genocide"}, {"tag": "p", "text": "Survivors of the Felucian species either engaged in warfare with the Imperials, or fled into the maw of the massive Sarlacc at their Ancient Abyss. To eliminate these survivors, the Empire restrained the Sarlacc by constructing the Sarlacc stabilizer, which consisted of the main elevator, three bridges, chains restraining the Sarlacc tentacles, and three power generators. Though partly due to the Sarlacc's sheer size, entry and navigation within the beast, without the danger of being digested in doing so, was made possible by the construction of the stabilizer."}, {"tag": "p", "text": "AT-STs were among the reinforcements sent down to the planet, landing in capsules ejected from the Imperial fleet above. Incinerator stormtroopers and Heavy stormtroopers made up much of the Empire's ground forces on the planet, along with Purge troopers. To combat the Empire's lethal machinations, Felucians used Rancor mounts to great effect."}, {"tag": "h3", "text": "Arrival of Galen Marek"}, {"tag": "p", "text": "Using Leia Organa, whom he had rescued from Kashyyyk, as a bargain chip, Galen Marek attempted to contact Bail Organa to help him form an army to oppose the Emperor. Organa, however, was last heard from on Felucia, in search of Shaak Ti—whom Starkiller had recently dueled. The Senator had not been heard from since. With the help of Master Rahm Kota—albeit almost letting slip his indirect involvement in Organa's predicament—Starkiller headed to Felucia to find the rogue Senator."}, {"tag": "p", "text": "Upon the Rogue Shadow's landing, Starkiller unknowingly arrived in the middle of a firefight between the Felucians and stormtroopers, who both suffered heavy losses. Passing through the decayed vegetation, now lined with marks of Imperial establishment, Marek came across another firefight--one between the Imperials and Organa's bodyguards. Entering the fray on the latter's behalf, Marek killed the Imperials before asking the guards for Organa' location."}, {"tag": "p", "text": "He destroyed at least two AT-STs, deployed from AT-ST drop pods, on his advance before reaching the Sarlacc stabilizer. Sensing the creature's pain, he freed it of the chains restraining it, and powered the main lift, searching its stomach for Organa. He had lost communication with Juno Eclipse inside, and was met with both Imperial and Felucians. Once he reached the creature's lung, he was spewed out."}, {"tag": "p", "text": "After being expelled from the sarlacc, Marek found himself once again in between the conflict raging between the Felucian natives and the Imperial pacification forces. It was here that Marek discovered that the Felucians were making use of their Rancor mounts against the advanced technology used by the Empire. Being caught in the fighting, Starkiller was forced to fight both sides, as well as a Rancor mount."}, {"tag": "p", "text": "He eventually came upon the Rancor Graveyard, where Senator Organa was being held. As Marek freed Bail Organa, the Senator informed his renegade savior that Shaak Ti's apprentice had gone mad. It was then that they were confronted by Brood, who said she was not insane, but had embraced the power of the dark side. Marek attempted to warn her off by saying that he did not want to hurt her, but she replied by saying he would not as her new pet would not allow it to happen."}, {"tag": "p", "text": "A fight broke out with Starkiller focusing his efforts on the large Bull Rancor. He ultimately defeated the large beast through the use of the Force and sent it crashing into the ground, where it sunk and fell into an underground chamber."}, {"tag": "h3", "text": "The Duel"}, {"tag": "p", "text": "Now alone, the two Force users battled one another over the senator. Maris Brood proved to be quite vicious in her attempts to kill the young Sith apprentice. As part of her efforts to kill Starkiller, she threw one of her lightsabers, but Starkiller caught it and used it against her. Furthermore, with no allies to aid her, she was forced to use her Force cloak abilities to hide her from Starkiller, but this resulted in her being struck by lightning."}, {"tag": "p", "text": "Defeated, Maris begged Starkiller to spare her life, as she said she was beaten with their being no need to kill her. She furthermore stated that it was not her fault, as she had been driven mad by being abandoned by Shaak Ti on Felucia. Galen allowed her to escape and she hurried into the forests of the planet. Upon freeing the senator, Organa said that Maris reminded him of another Jedi who had fallen to the dark side, and that Galen should not have let her escape. However, Marek replied by saying that she would never be free, as she would be haunted by the memories of her actions on Felucia."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Organa saved, Starkiller took him to the Rogue Shadow where they discussed plans for a rebellion against the Empire. Organa and Master Kota were discussing Maris' actions, with Organa saying she was driven to the dark side due to Master Shaak Ti being killed at the hands of Darth Vader or one of his assassins. Kota claimed that it may have been the same who blinded him above Nar Shaddaa. Thinking of Kazdan Paratus, Kota quickly said he received no communications or word of him. However, Organa was not convinced as open rebellion was too dangerous, and stated that they needed a sign to show that the Empire was weak. Galen said he would meditate on the matter and inform them of his next decision, but for that, he would require Vader's counsel for his next target."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The firefight that Starkiller encounters upon his arrival depends on each version. In the PS3/X-box360 version, Starkiller encounters Felucians and Imperial troops. In the PS2/Wii version, the firefight is between Imperial Troops and Organa's Bodyguards. Also in the PS2/Wii versions, Starkiller does not enter the Sarlacc as the Imperials do not set up the base there either."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}