{"url": "Battle_of_Florrum", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Florrum"], "nodes": [{"tag": "h1", "text": "Battle of Florrum"}, {"tag": "p", "text": "A battle took place on the planet Florrum around 22 BBY during the Clone Wars. After aiding in the liberation of the Hutt prisoner Ziro Desilijic Tiure from Republic custody, the bounty hunter Shahan Alama attempted to go into hiding from the Republic. However, Alama encountered a Confederate frigate over Florrum while on the run, and the frigate's Neimoidian captain deployed droid starfighters to engage Alama's craft. A Republic transport under the command of Jedi General Aayla Secura was patrolling the area, and Secura dispatched Clone Commander CC-5052 with a squad of troopers and a LAAT/i gunship to assess the situation. The gunship eliminated the droid fighters on the surface of Florrum and shot down Alama's craft before returning to Secura's vessel."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 22 BBY during the Clone Wars, the bounty hunter Cad Bane formed a team of hunters to free Hutt crime lord Ziro Desilijic Tiure—who had been arrested for crimes against the Galactic Republic—from the Republic Judiciary Central Detention Center on the galactic capital of Coruscant. The hunters' mission was successful, and Bane and his team escaped with Ziro. Shortly thereafter, Bane transmitted the monetary reward for the mission into the accounts of his comrades and then ordered his accomplices to flee and hide from the Republic. One member of the team, the Weequay Shahan Alama, was mistrustful of Bane, doubting that Bane had sent them their full payment. However, Alama cooperated and escaped in his Flarestar-class attack shuttle to the Outer Rim Territories."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Over the Outer Rim planet of Florrum, Alama came across a Confederate Munificent-class star frigate. The frigate's Neimoidian captain recognized Alama's vessel as the same model of starship that was used by a gang of pirates, which was led by the pirate Hondo Ohnaka and was based on Florrum. Upon accessing the sector's threat files, the Neimoidian captain confirmed that the Confederate Head of State Count Dooku had once been captured by the pirates. Deducing that Alama was a member of the pirate gang and seeking payback for the pirates' crimes against the Confederacy, the captain ordered an OOM command battle droid lieutenant to target the attack shuttle. As his craft was attacked by the frigate, Alama headed to the surface of Florrum."}, {"tag": "p", "text": "Meanwhile, a Republic task force, consisting of a single Acclamator-class assault ship under the command of Jedi General Aayla Secura, was scouting the area. Marshal Commander CC-5052 reported Alama's independent vessel to Secura, who ordered the clone commander to take a single LAAT/i gunship and gather more information through a reconnaissance of the planet. CC-5052 assembled a squad of clone troopers for his gunship and was accompanied by several other gunships to the surface of Florrum."}, {"tag": "p", "text": "Upon detecting the Republic gunship, the Confederate captain ordered his droid starfighter forces to attack the enemy craft. Vulture droid starfighters, Hyena-class bombers, and B1-Series battle droids on Single Trooper Aerial Platforms were dispatched to confront the Republic gunship. The gunship engaged the enemy forces, and CC-5052 and his crew were able to defeat the Confederate battle droids. After then engaging and shooting down Alama's craft, the Republic gunship returned to Secura's Acclamator-class transport."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A wounded Alama left his damaged craft and came across Hondo Ohnaka, with whom the bounty hunter was acquainted. However, Ohnaka expressed his intent to take Alama hostage and sell him to whomever wanted to capture him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle first appeared in Hunting the Hunters (Part I), an issue of the online The Clone Wars webcomic series that transitioned between the first and second seasons of the 2008 Star Wars: The Clone Wars television series."}, {"tag": "p", "text": "Even though Hunting the Hunters (Part I) states that only one gunship was sent, four were pictured. During Gunship Over Florrum, an online game released on StarWars.com that was based on the events of the comic, only one gunship participated in the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}