{"url": "Battle_of_Fitsay", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Periphery", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Fitsay"}, {"tag": "p", "text": "The battle of Fitsay was a conflict that happened during the Sedri civil war in the city of Fitsay on the planet Sedri."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Ad the result of an alliance between the renegade bishop of war, Karak, and Imperial Commander Aban, a joint Imperial–Sedrian renegade force attacked the city of Fitsay in an effort to secure the Golden Sun. They were opposed by the warrior monks, Alliance to Restore the Republic agents, and a number of former renegades that had been swayed to break from Karak after they had learned of his alliance with the Empire. After the Imperial forces started battling the Priests of the Sun and the former Sedrian renegades outside the city of Fitsay, Karak, took six of his most trusted and powerful renegades, Dragob, Glish, K'hondo, Porm, Spodan and Burborok as well as his pet razort Tooch and their prisoner Mors Odrion, to the Sun Caves in an attempt to claim the Golden Sun for himself and defeat the Imperials and the Priests."}, {"tag": "p", "text": "At the cave the group was confronted by the High Priest of the Golden Sun Cardo, however one of the renegades attacked him, slashing him across the chest and causing a near fatal wound. The group then moved into the cave, with Karak and Odrion heading straight for the main chamber while the others spread out through the cave to slow down any pursuers. The group of six rebels, Rekara and Cardo's son Pek soon entered the cave in search of Karak and came upon the huge chamber. They then went on to successfully stop Karak by persuading the Golden Sun to separate and weaken its power, which in turn also weakened Karak, who was later arrested and imprisoned for his betrayal."}, {"tag": "h2", "text": "Appearances"}]}