{"url": "Tanus_Spijek", "categories": ["Category:Canon articles", "Category:Agents of the Rebel Alliance", "Category:Elom", "Category:Individuals of unspecified gender"], "nodes": [{"tag": "h1", "text": "Tanus Spijek"}, {"tag": "p", "text": "Tanus Spijek was an Elom spy for the Alliance to Restore the Republic hired to carry messages between the planet Alderaan and the moon Yavin 4 during the Galactic Civil War. In the year 4 ABY, Spijek was on the planet Tatooine where he spent time in the palace of the crime lord Jabba Desilijic Tiure and witnessed Luke Skywalker arrive to speak with the crime lord, and witnessed the Jedi killing Jabba's pet rancor Pateesa. The Elom was amongst those who then accompanied the Hutt to the Great Pit of Carkoon on the sail barge Khetanna to witness the execution of Skywalker and several of his friends. The Jedi managed to free himself and with the help of his allies killed the Hutt and destroyed the barge."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Elom Tanus Spijek was hired by the Alliance to Restore the Republic to act as a spy and messenger for them during the Galactic Civil War against the Galactic Empire. Spijek ferried messages between the planet Alderaan—where founding Alliance Bail Organa lived, and the moon Yavin 4, where the Alliance High Command were based for part of the war in the Great Temple. In the year 0 BBY, the Empire destroyed Alderaan and soon after in 0 ABY the Alliance was forced to evacuated Yavin 4 following the Battle of Yavin."}, {"tag": "p", "text": "In the year 4 ABY, Spijek was on the planet Tatooine and spent time in the palace of the Hutt crime lord Jabba Desilijic Tiure. During a performance in Jabba's throne room by the Max Rebo Band Spijek sat in one of the room's booths in front of the Whiphid J'Quille in order to watch. The performance ended with the Twi'lek dancer Oola being dropped through a trapdoor into the rancor pit below the throne room and devoured."}, {"tag": "p", "text": "Immediately after the performance, Princess Leia Organa disguised as the bounty hunter Boushh made a commotion while entering the throne room with the Wookiee Chewbacca, causing Spijek to recoil in fear as she stood in front of him to face Jabba. Organa—whose plan was in fact to try and rescue her lover Han Solo from Jabba—haggled with Jabba over the bounty price for bringing him the Wookiee, activating a Thermal detonator in order to scare the Hutt into increasing his offer. Spijek and many others present in the room to cowered in fear at the explosive, but much to their relief of Organa deactivated the grenade once Jabba compromised with her on the amount. Organa was caught later that night attempting to free Solo from carbonite and imprisoned by Jabba."}, {"tag": "p", "text": "After Organa had been redressed as Jabba's slave, Spijek was then spending a night in the palace, resting on the floor up against a wall alongside many members of Jabba's court in the throne room. He was awoken when the Jedi Master Luke Skywalker arrived demanding audience with Jabba. The Jedi sought to persuade Jabba to release Solo, Organa and Chewbacca. Spijek stood to watch the two speak, and witnessed Skywalker threaten the Hutt with a DL-18 blaster pistol taken from the guard Nizuc Bek before being dropped into the rancor pit below the throne room."}, {"tag": "p", "text": "After Jabba's pet rancor Pateesa ate the Gamorrean Jubnuk, who had fallen in with Skywalker, was killed by the Jedi, much to the horror of the Hutt and his court. Spijek and the crowd then watched as Skywalker and his friend Han Solo were dragged before Jabba and sentenced to death through being eaten by the sarlacc at the Great Pit of Carkoon. The Elom then boarded the Hutt's sail barge Khetanna in order to travel to the pit and witness the executions. While traveling across the Dune Sea on the barge, Spijek spoke with the Ugnaught Yoxgit. Once above the pit, Skywalker managed to free himself and board the barge from the Bantha-II cargo skiff he had been transported on. Skywalker's ally Princess Leia Organa then killed Jabba by strangling him to death and together Skywalker and his allies destroyed the sail barge and escaped Tatooine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tanus Spijek had mottled gray, brown and white fur, black eyes and gray and pink skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tanus Spijek first appeared in the film Star Wars: Episode VI Return of the Jedi, which was released in May 28, 1983. The character was not named in the film, but was first identified in canon in the video game Star Wars: Force Collection, originally released in 2013."}, {"tag": "p", "text": "The name originated from a card in the Jabba's Palace Limited set of the Star Wars Legends Customizable Card Game released by Decipher, Inc. in 1998. According to a Star Wars CCG fan site, the name was an anagram of Justin Pakes, an employee of Decipher at the time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}