{"url": "Tanya_Madera", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Alliance Military members", "Category:Females", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Tanya Madera"}, {"tag": "p", "text": "Tanya Madera was an Imperial spy who infiltrated the Rebel Alliance, becoming a Major who was the second-in-command of Reginard Base. She was in charge of the base's more mundane operations such as supply logistics, personnel, and schedules. She was always polite yet efficient, her tidy uniform and shoulder-length brown hair hiding her true nature. She had been assigned by the Galactic Empire to infiltrate a Rebel base and covertly alert the Imperial Navy of its location. To accomplish this, she hid a transmitter within the passive sensor array which would broadcast a Stellar Class (Class B) starport beacon. However, Senior Technician Adonar Dellox learned of the beacon while working on the sensor array and so Madera murdered him, by injecting him with the deadly triflexia virus through her needler pistol."}, {"tag": "p", "text": "She quickly exited the scene, later turning up with the commander of the base, General Halomar Corros, and claimed to have been working alone in her cabin when a group of Rebels were investigating the death. She later visited one of the base's X-wing pilots in the medical bay and infected him with the triflexia virus also to make it appear as if it was an outbreak. After this, she visited the group of Rebels who were repairing the active sensor array and explained some of their findings; when they discovered more sub-space transmitters she informed them truthfully that they were used to send sensor data back to the base, though she then lied to them when they discovered parts with Imperial markings, telling them that they had been stripped from downed Imperial ships or stolen from nationalized corporations, and finally told them the truth when they found a sizable charge of detonate which was used as a safety device to keep the array from falling into Imperial hands."}, {"tag": "p", "text": "When the group arranged with General Corros to deploy the sensor array on the other side of the planet, she arranged to go with them to supervise. However, when Hawker Bryce-Kelly's ship, Queen's Victory, landed near the sensor array, Corros sent Madera and the group back to find out why they had headed straight for the sensor. The group landed near the sensor array, and, as suggested by Madera, they approached the ship on foot in several groups. The ship only had three glow rods, however, and Madera took one of them leaving the group with only two. When the group confronted Bryce-Kelly, he informed them that he had simply headed towards a starport beacon and pointed towards the sensor array when asked where it was located."}, {"tag": "p", "text": "During this time, Madera had slipped away from the group and hid in the forest between the group and the sensor array. When they moved to shut down the beacon, Madera attacked them. Though initially using her needler pistol, it only had five poisoned needles left and so she soon switched to her blaster pistol. The group eventually managed to overpower her, kill her, and undo her modifications to the sensor array."}, {"tag": "h2", "text": "Sources"}]}