{"url": "Taozin", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Taozin"}, {"tag": "p", "text": "The Taozin were a type of creature that, as a grub, had a long body with eight limbs. In 10 BBY, the crime lord Dryden Vos kept a Taozin grub on display in his study aboard his ship, the First Light. A Taozin grub was also kept in Oga's Cantina in Black Spire Outpost on the planet Batuu in around 34 ABY. The Taozin was placed in brine that the creature infused with certain qualities. Some species considered the infused brine a delicacy that increased their mental fortitude."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Taozin were a type of creature with a life cycle that included a grub stage. While a grub, the creatures possessed a long, white-skinned body with eight pairs of legs clustered at one end below its head, which had black eyes. If kept in brine as a grub, the liquid was life-preserving and sedating for the Taozin, which infused the liquid with certain properties."}, {"tag": "h2", "text": "Taozin in the galaxy"}, {"tag": "p", "text": "By 10 BBY, the crime lord Dryden Vos had received a Taozin grub as a gift from Moff Doelsor Triggant. Vos kept the grub in suspended animation within a transparent sealed jar, which was displayed on a pedestal in his study onboard the Nau'ur-class yacht First Light."}, {"tag": "p", "text": "During the First Order occupation of the planet Batuu in around 34 ABY, the Blutopian Oga Garra stored a Taozin in a jar of brine on the top shelf of her cantina in Black Spire Outpost. Garra reserved the Taozin for only her most important guests, as some species considered its brine an exotic and valuable delicacy, believing that it granted them mental fortitude. Author Eloc Throno wrote about both Vos and Garra's Taozin in the book Traveler's Guide to Batuu, speculating that the properties of the Taozin brine was why Vos had held one aboard his yacht."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Taozin first appeared in the new Star Wars canon in the 2018 Anthology Series film, Solo: A Star Wars Story. The creature was then identified in Pablo Hidalgo's accompanying reference book, Solo: A Star Wars Story The Official Guide; however, the book incorrectly labeled an image of a dwarf vinock as the Taozin grub. This was rectified when both creatures were correctly labeled in the 2019 video \"Every Creature in the Star Wars Movies,\" which was part of the Star Wars By the Numbers series created by StarWarsKids.com."}, {"tag": "p", "text": "The Taozin were originally created for the Star Wars Legends continuity, where they first appeared in Michael Reaves's 2001 novel Darth Maul: Shadow Hunter. They were later depicted in an illustration by R. K. Post published in the Power of the Jedi Sourcebook, a 2002 Legends supplement to the Star Wars Roleplaying Game produced by Wizards of the Coast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}