{"url": "Battle_of_Flashpoint_Station", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Meerian sector", "Category:Battles of the Mandalorian Wars"], "nodes": [{"tag": "h1", "text": "Battle of Flashpoint Station"}, {"tag": "p", "text": "In 3964 BBY, the Mandalorian warrior clans attacked Flashpoint Stellar Research Station, a lightly-defended Galactic Republic scientific installation in the Outer Rim, as part of the initial campaigns of the Mandalorian Wars. Flashpoint Station was an easy target for the Mandalorians, who captured the station without much trouble. After seizing Flashpoint Station, the Mandalorians gave the installation to the infamous biologist Demagol, who used it as his base for research into Jedi powers."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the decades after the end of the Great Sith War, the Galactic Republic faced a new enemy from beyond its borders—the Mandalorian warrior clans, who had carved out their own empire in the farthest reaches of the Outer Rim. By 3964 BBY, the Mandalorian Neo-Crusader armies, led by chieftain Mandalore the Ultimate, had begun probing the Republic's borders. Preparing for a larger invasion aimed at the ecumenopolis of Taris, the Mandalorians soon set their sights on Flashpoint Stellar Research Station, a Republic scientific installation within striking distance of Taris and its tributary worlds. Located on the barren world of Flashpoint extremely close to its star, Flashpoint Station was situated under an artificial magnetic shield that protected it from the extreme heat and radiation generated from the nearby star."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "A scientific research station, Flashpoint Station was only lightly defended and was an easy target for a Mandalorian attack. The station quickly fell to the invaders, who raised their own banners on the installation."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Close to the front but largely inaccessible due to its location, Flashpoint Station was promptly given to the infamous Mandalorian biologist, Demagol, who used the installation as a base for his research into the powers of Jedi. Over the coming months, Flashpoint Station played prison to a number of captive Jedi, who were subjected to Demagol's brutal live experiments that left many dead. As for the war effort itself, the Mandalorians waited two-and-a-half months to make their next move, beginning an ultimately stalemated campaign to capture the planet Suurja."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle for Flashpoint Station was first mentioned in The Taris Holofeed: Prime Edition, an in-universe news report occurring at the end of the comic Knights of the Old Republic 0, written by John Jackson Miller and released in 2006. The event was referenced in two other Knights of the Old Republic issues, along with the reference books The Essential Atlas and The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}