{"url": "Tantive_IV_(story)", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Star Wars Manga stories"], "nodes": [{"tag": "h1", "text": "Tantive IV (story)"}, {"tag": "p", "text": "Tantive IV is an Infinities comic written and illustrated by Formalin and featured in the anthology book Star Wars Manga: Black. It tells the story of the Tantive V a CR90 corvette which Vader mistakenly captures, believing it to be the Tantive IV. On board the ship, Vader encounters Abso Bar Binks, the son of Jar Jar Binks."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Darth Vader is pursuing Princess Leia Organa's ship in order to retrieve the Death Star plans. Vader's Star Destroyer, The Devastator, captures a CR90 corvette and brings the craft aboard. Vader's stormtroopers hot-wire the blast doors to open the ship, but when the doors open, two boomas roll out. The explosives detonate, and clouds of smoke obscure the area. Vader and the stormtroopers storm the ship, but they are immediately attacked by a cloaked figure. The stormtroopers switch to infrared, but they are unable to stop the mysterious figure. The stormtrooper commander tells his troops to hold their fire, as the figure might be Leia Organa. However, Vader claims that the figure is not the ambassador. In response, the figure disrobes, revealing himself to be Abso Bar Binks, Jar Jar Binks' son. Abso reveals that he joined the Rebellion because the Empire was cruel to his father, always confiscating the presents that he would bring home to Abso and his mother."}, {"tag": "p", "text": "Abso wards off the attacks of the stormtroopers, beating them with his fists and dodging their blasterfire. However, Abso slips on a mouse droid, falling to the ground. Vader demands to know where the Death Star plans are, Force choking the Gungan. The stormtrooper commander interrupts, telling Vader that there is no sign of the plans—only unarmed Gungans are aboard the ship. Abso explains that his job was to stall Vader, as his ship, the Tantive V, looks exactly like Princess Leia's ship, the Tantive IV. Vader is furious, and the stormtroopers throw Abso and his fellow Gungans into a room in the back of the ship. Vader tells his men to leave the Gungans, as they are not worth the stormtrooper's blasterfire. The stormtrooper commander tells Vader that they have located the Tantive IV nearby, and the Imperials release the Tantive V to pursue the correct ship. An hour later, Vader's Star Destroyer captures the Tantive IV."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally published in Japan, the stories from Tokyopop's Star Wars Manga were considered to be of \"fuzzy\" continuity by Lucasfilm. Since then, they have been republished in English in the United Kingdom under Infinities label, which established the material in them as non-canonical."}, {"tag": "p", "text": "Author Daniel Wallace stated definitively in the article We Need to Talk About Jar Jar, written for Star Wars Insider 131 in February 2012, that the stories included in the Star Wars Manga: Black comic trade paperback are non-canon."}, {"tag": "h2", "text": "Notes and references"}]}