{"url": "Tar", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Tar"}, {"tag": "p", "text": "Tar was a male soldier who lived on the Outer Rim planet Crucival during the Imperial Era. He joined a band of soldiers led by the human Hazram Namir. In 0 BBY, the band was recruited by the Galactic Empire to help defend Crucival's transmitter tower from Rebel Alliance forces. However, almost the entire band, including Tar, was killed in the battle after the Empire abandoned them. Namir, the sole survivor, blamed the deaths of Tar and the rest of the band on the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tar was a soldier who lived on Crucival, an Outer Rim planet ridden with war between various competing factions, during the Imperial Era. He fought for at least one master, who was eventually lost. Tar then resorted to robbing passersby in the streets, hiding the brand that symbolized his former faction. Hazram Namir, another soldier who had once fought against him, eventually recruited Tar to join him and a band of other soldiers who were ready to stop fighting in the reoccurring wars on the planet."}, {"tag": "p", "text": "In 0 BBY, the Galactic Empire offered to arm any volunteers who would help the Imperials defend Crucival's transmitter tower against an imminent attack by the Rebel Alliance's 61st Mobile Infantry. Tar and the rest of Namir's band of soldiers were among the many who took the offer. However, nearly all of them died in the first wave of the attack after the Empire abandoned the armed volunteers. By end of the battle, Tar and the rest of the band had been killed, leaving only Namir alive. The soldier blamed the Empire for their deaths, and subsequently joined the 61st during the company's recruitment drive a week after the battle. He cited the deaths of the band to the rebel Besalisk Gadren as his reason for enlisting."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tar was given a rifle and a particle blaster by the Empire to use during the Battle of the Tower."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tar was mentioned in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}