{"url": "Taquito/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Pilots", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Taquito"}, {"tag": "p", "text": "Taquito ((pronounced /ʈaqɪʈo/)) was a male Rodian pilot who lived during the last years of the Galactic Republic on the Outer Rim planet Iego. At some point during the Clone Wars, Iego was captured by the Confederacy of Independent Systems. Before leaving, the Separatists left a laser grid system over Iego that destroyed all ships that attempted to leave the planet. Taquito was one of the many pilots who tried to break through the grid, but his ship was destroyed, resulting in his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Rodian Taquito lived during the last decades of the Galactic Republic on Iego, in the Outer Rim. At some point, he became friends with the Human youth Jaybo Hood, who also lived on the planet. Some time after the outbreak of the Clone Wars in 22 BBY, the Confederacy of Independent Systems invaded Iego and used it as a base before leaving some time later. When they abandoned Iego, the Separatists installed a laser grid around the planet that destroyed all ships attempting to leave Iego. The people of Iego believed the laser grid to be a god that they named Drol. Many starfighter pilots tried to navigate through the grid, but they were all unsuccessful, and their ships were destroyed. Taquito also attempted to leave Iego, but like those before him, his ship was hit by the grid. He managed to transmit a last-minute distress call but was killed when his craft exploded from the damage done by the grid."}, {"tag": "p", "text": "During the first year of the Clone Wars, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker traveled to Iego to find a cure for the Blue Shadow Virus, a deadly disease re-created by the scientist Nuvo Vindi. After the Jedi did so, they tried to leave Iego but were forced to return to the planet because of the laser field. A citizen named Amit Noloff showed the Jedi a hologram of Taquito's death to prove to them that Drol was not a myth. With the help of Jaybo Hood, the Jedi were able to destroy the laser grid, allowing the inhabitants of Iego to leave at their discretion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male Rodian and a friend of Jaybo Hood, Taquito attempted to make it through the grid, but like many others, he was killed by the laser grid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taquito first appeared in \"Mystery of a Thousand Moons,\" the eighteenth episode in the first season of The Clone Wars television series which aired on February 13, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}