{"url": "Battle_of_Foerost_(Great_Sith_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Articles with elements from unlicensed sources", "Category:Battles of Foerost", "Category:Battles of the Krath Holy Crusade during the Great Sith War"], "nodes": [{"tag": "h1", "text": "Battle of Foerost  (Great Sith War)"}, {"tag": "p", "text": "A battle at the planet Foerost occurred in 3996 BBY during the Great Sith War. It began as a raid carried out by the Krath forces of Sith Lord Ulic Qel-Droma and the Crusaders of Mandalore the Indomitable. Qel-Droma planned to seize the many ships under construction for the Galactic Republic, and instead use them in his bid for galactic domination. At Qel-Droma's behest, Krath sorceress Aleema Keto created an illusion that allowed their forces to slip into the Foerost shipyards unchallenged. Bolstered by the armies of Mandalore, Qel-Droma's forces stormed the facility and secured the operational codes for the newly-completed vessels. Fleet Captain Orley Vanicus was dispatched to interrupt the raid with a contingent of Republic reinforcements, but was too late to stop the theft of over three hundred warships. A recording of Qel-Droma from the attack was later discovered, finally leaking the secret identity of the Republic's new enemy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "By 3996 BBY, the shipyards maintained by the Galactic Republic at Foerost had been established as one of the oldest and most successful starship construction facilities in the galaxy. For hundreds of years, the facility had produced warships for the Republic Navy with raw materials from the surface of Foerost, an uninhabited planet. The vessels built there were prized by the Republic as some of the most advanced warships in their fleets. More than three hundred of the ships, most either newly completed or nearly so, sat relatively unguarded in the shipyards."}, {"tag": "p", "text": "Leader of the dark side Krath cult of the Empress Teta system, Sith Lord Ulic Qel-Droma desired the vessels for use in the coming war between the Sith Brotherhood and the Republic. He gathered his fleet, bolstered by the Crusaders of his newly-sworn ally Mandalore the Indomitable, and set out for the Foerost shipyards. Upon arrival, the lover of Qel-Droma, sorceress Aleema Keto, conjured a Force illusion that disguised the Krath armada as a single, large vessel, called the \"Golthar's Sky.\" The illusion, which thwarted the monitors' sensor systems and gave the impression of a massive vessel exiting hyperspace, approached the shipyards and requested clearance to dock for repairs. Dock supervisors in Tower Bravo noticed the ship's density and offered to dispatch an inspection crew, as none of the Foerost docks were able to support the vessel."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Keto dropped the illusion at that moment and revealed a fleet of Tetan attack ships. Krath-dispatched CX-133 Chaos fighters swarmed and strafed the shipyard, which resulted in the swift destruction of the facilities' defensive emplacements. Basilisk war droid-mounted Mandalorians penetrated the modules and stormed the control decks and operations centers. Tetan troops, equipped with jetpacks, also boarded the stations to reinforce overwhelming force of the Mandalorian offensive. While the Republic forces attempted to fend off the Krath assault in futility, one of their number, a Human named Dace Golliard, fled the battle in an attempt to save his own life."}, {"tag": "p", "text": "The shipyards were quickly overrun, due largely to the ferocity of the Mandalorian assault. Qel-Droma, Aleema Keto, and Mandalore the Indomitable boarded the station assumed command at the control center. The Sith Lord demanded the operational codes of the newly-completed warships, and killed the first person to deny knowledge of said codes in order to demonstrate the gravity of his request. The other technicians present quickly realized their predicament and fully complied, and Qel-Droma was given the access he sought."}, {"tag": "p", "text": "During the battle, Qel-Droma proved that he was an excellent strategist: one hundred and fifty vessels were captured before the end, and the Mandalorians noted that it would be sufficient to attack Kemplex IX. He also confronted Jedi Master Sli'Lon Tahar and killed him in a duel to stop him from using battle meditation to weaken the Sith attack. Tahar just had time to inform some adventurers where the tomb of an ancient Sith was located before being struck down by the fallen Jedi, but accidentally revealed it to Qel-Droma as well."}, {"tag": "p", "text": "Communication was soon established with Exar Kun, the Dark Lord of the Sith and Qel-Droma's Master. Kun had managed to sway twenty Jedi Knights to their side of the war, which Qel-Droma found to be rather meager in comparison to the two armies and now the three hundred vessels that he had acquired. The Krath leader announced to Kun his plans to attack Coruscant, the seat of galactic power. The Krath forces then pulled out and abandoned the shipyards."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon receiving news of the attack, the Republic Navy sent a fleet under the command of Captain Orley Vanicus to try and interrupt the raid, but the reinforcements arrived too late. All of the complete and near-complete warships had been stolen, the facilities largely destroyed—the scene was a graveyard. Corpses of slain yard workers floated among the wreckage. Vanicus resolved to salvage as much as he could and investigate the scene in the hopes of discovering the identity of the attackers."}, {"tag": "p", "text": "Few rescue pods remained to be recovered, leaving very few witnesses to the raid. Searching through the control centers, Vanicus' men discovered that the attackers had damaged as much computer hardware as possible in an attempt to erase all evidence of their identity. However, one file was found, recorded by the station's automated security systems. Vanicus, who had fought at the Battle of Koros Major alongside the Jedi, recognized Qel-Droma—the secret was out. Qel-Droma's treachery was not the only one exposed either; the Republic also learned of Dace Golliard's absconding from the massacre at Foerost. He was branded a criminal of the Republic and spent the next several decades of his life as a fugitive."}, {"tag": "p", "text": "Thirty-three years after the raid on the Foerost shipyards, Dace Golliard—who had since turned to a life of crime as a slaver—was apprehended by Admiral Saul Karath of the Republic Navy. Karath was especially eager to capture Golliard, since the Admiral's father, Craddock Karath, was one of the many Republic soldiers who had perished while Golliard had escaped to safety. Karath vowed that the outlaw would finally face the court-martial that he had tried so desperately to avoid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The events of the battle took place in the comic book Tales of the Jedi – The Sith War 1, which was written by author Kevin J. Anderson and drawn by artist Dario Carrasco, Jr. Several of the characters and story elements of the issue were developed by previous Tales of the Jedi writer Tom Veitch in the preceding story arc, titled Star Wars: Tales of the Jedi - Dark Lords of the Sith. The forty-ninth issue of the Star Wars: Knights of the Old Republic comic series, entitled Demon, Part 3, revealed that Knights of the Old Republic character Dace Golliard participated in the battle. The death of Craddock Karath during the battle, who was the father of KOTOR mainstay Saul Karath, was also brought to light in the same issue. Demon, Part 3's author, John Jackson Miller, identified Craddock Karath as the dock employee who was gunned down by Mandalore and Ulic Qel-Droma upon their entry into the shipyard control room."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}