{"url": "Tarasin", "categories": ["Category:Legends articles", "Category:Expansion Region species", "Category:Force-sensitive species", "Category:Reptilian sentient species", "Category:Tarasin"], "nodes": [{"tag": "h1", "text": "Tarasin"}, {"tag": "p", "text": "The Tarasins were a bipedal, sapient reptilian species indigenous to Cularin. They were remotely related to the gigantic Kilassin."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Tarasins were 1.6 to 1.7 meter-tall reptilians covered in translucent scales that allowed the species' color-changing skin below to show through. Tarasins also had a colorful fan of flesh and scales—known as a kampo— that opened around their heads when they experienced strong emotional distress, which could be a detriment to negotiations, as it was difficult for a Tarasin to hide discomfort. This color-changing ability was useful for camouflage and communication, and the scales naturally repelled heat. Some examples of colors they took on included being brown when calm and in a comfortable environment, or becoming red after extended exertion or when excited. Tarasin also had short tails and short spines that protruded from their forearms—known as a sa'tosin—which gave the creatures the ability to sense the use of the Force. Tarasins were naturally curious and protective but also slow to anger. What they lacked in sheer physical strength they made up for with a brilliant intellect."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although the Tarasins initially lived in nomadic tribes, at some point in their past they decided to create a different society. Tarasins would since live in a tribal system in the jungle underbrush of Cularin, grouping together in clans called irstat. Most irstat numbered several dozen, but they could be much bigger — The Hiironi irstat had a population of around three hundred as of 33 BBY; however the \"alien\" cities of Gadrin and Hedrett had a minority Tarasin population of 2,000 and 2,900, always under the 15% of their total."}, {"tag": "p", "text": "The first two irstat to be created met in a rock that was intended to be used as a landmark: Each tribe would live separate from the other, so that both of them could have enough food, but they would also live at one day of distance of each other in case any of them needed help. The stone was to be the middle point among them."}, {"tag": "p", "text": "The buildings of an irstat were made of wood, and to outsiders looked like they could be broken down and moved easily, but the Tarasin were not normally nomadic. Some irstats started incorporated some prefab buildings into their villages, but even then they blended in with the environment."}, {"tag": "p", "text": "The eldest female of each tribe was revered as the \"Mother\", and regarded as an exemplar of perfection. She served as the spiritual leader of the irstat. The second eldest female filled the role of chief, called the Irstat-Kes. Females were not seen as superior, but this situation was seen as practical, as the males were away from the irstat much of the time gathering food and other resources."}, {"tag": "p", "text": "In time, the stone of the first two irstats became a monument of sorts in the middle of the Sacred ch'hala tree grove, surrounded by dozens of ch'hala trees. It was not used for worship, but only to celebrate wood life, and no outsider was allowed to visit without a Tarasin escort. The irstat-kes of each tribe was supposed to met with her peers in the grove, and every Tarasin religious leader must visit the grove at least one and bring a ch'hala sprout to plant it in his or her irstat."}, {"tag": "p", "text": "Tarasins were normally vegetarians, though they hunted kilassin for other uses, such as for their skins or medicinal uses, as they find it distasteful to hunt kilassin for food. Those who lived near non-native settlements might take up the eating of meat, but only when around offworlders, and never the meat of kilassin."}, {"tag": "p", "text": "The curiosity of Tarasins gave them a desire to learn about the outside world, and many frequently pursued adventure off Cularin, though they did not like to stay away too long. These qualities also made them accepting of the customs and traditions of outsiders."}, {"tag": "p", "text": "This led to them being quick to trust the first offworlders who landed on Cularin. Though the Tarasin and outsiders were able to work together at first, soon the offworlders wanted to reap the resources of Cularin with quicker methods which would leave long-term damage, and the Tarasin resisted. The Tarasin Revolt (161 BBY–154 BBY) ensued, which was finally brought to an end with the Cularin Compact. This agreement granted the Tarasins some rights, and stopped outsiders from looting the planet's natural resources."}, {"tag": "p", "text": "During the revolt, some Tarasins took refuge and quarters in the Ishkik caverns, discovering the local stone. After it, they returned to their irstat way of life, but began using the ishkik stones to build tools or as decoration."}, {"tag": "p", "text": "In 119 BBY, the Jedi Order built an experimental academy in nearby planet Almas. Soon, Tarasins began sending there their Force-sensitive children. Master Nerra Ziveri accepting applications of students that would have been deemed too old in other Jedi academies, specially among Tarasins, but always screening carefully every applicant to avoid potential dangers. Elder Tarasins were worried about their younglings finding the non-irstat environment too intimidating, which could lead them to fail in their Jedi training. As such, elder Tarasins exhorted young ones not to go, but this proved ineffective. Besides, Master Ziveri began new policies to adapt his Academy to the Tarasin students' needs (such as the Jedi quests to solve the unease of Tarasins to leave their planetary system), and even constructed new buildings more adequate for them. The Elders eventually sent a Tarasin religious leader and force adept, Mother Missira, to the Almas Academy, where she was to look after the Tarasin students and teach them their cultural heritage. The Almas Academy became since the alma mater of many Tarasin Jedi, some of whom left the system as Jedi Knights."}, {"tag": "p", "text": "Between 78 BBY and 53 BBY, some Tarasins were kidnapped by local crime lord Riboga the Hutt, to be sold off-system as slaves; however, Riboga mainly dealt with Core World slaves. This practice stopped when Riboga was replaced with crime lord Nirama, who was opposed to slavery."}, {"tag": "p", "text": "In 34 BBY, a Tarasin male by the name of Duus left the planet Cularin. He was searched thoroughly, but eventually the examination was abandoned, and Duus was declared a traitor to the Tarasin. Other Tarasins, such as Ta'Sen, also left Cularin but were not persecuted for some reason;"}, {"tag": "p", "text": "Tarasins spoke Tarasinese, but were known to communicate by simply changing their skin colors when spoken conversation was impractical, dangerous, or impossible. An outsider could, with time, learn how to interpret these unspoken communications."}, {"tag": "h2", "text": "Religion"}, {"tag": "p", "text": "The Tarasin believe they have a symbiotic relationship with Cularin, and their religion is based around the appreciation of the natural world. This closeness with their homeworld is what makes the Tarasin reluctant to leave it for an extended time. The Tarasin have a strong connection with the Force, and their spiritual leaders were often able to call upon the Force in small ways. When the Almas Academy was established, a number of Tarasin studied there to become Jedi."}, {"tag": "p", "text": "The Tarasin believed that the ch'hala tree was sacred. This may have been influenced by the trees having a similar ability to shift their colors as the Tarasin, but it is also the most unique tree on Cularin. As part of the Cularin Compact, the Tarasin did allow a few of these trees to be harvested each year, but only as live transplants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}