{"url": "Taria_Damsin", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Shadows", "Category:Lightsaber combat instructors", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Taria Damsin"}, {"tag": "p", "text": "Taria Damsin was a female Human from the colony world of Ghaina, who served as a Jedi Master and Shadow of the Jedi Order during the Clone Wars. A contemporary of fellow Master Obi-Wan Kenobi, she was dying from a disease known as Borotavi syndrome."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Taken from her parents at a young age, Taria Damsin was the first and only Jedi that her homeworld, Ghaina, ever produced. During her early life at the Jedi Temple on Coruscant, Damsin had a very close friendship with Obi-Wan Kenobi that blossomed into a brief romance. After she and Kenobi ended their short-lived affair, they developed an even deeper friendship, one which would carry on over the years despite missions that would send them to other sides of the galaxy for extended periods of time."}, {"tag": "p", "text": "After passing her Jedi Trials and becoming a Jedi Knight, Damsin was sent on extended missions away from the Temple. On one such mission to Pamina Prime, having eaten a poisonous mollusk, Damsin was diagnosed with the incurable Borotavi syndrome. Unwilling to be brought down by the terminal illness, Damsin continued to take on missions, though most of her time she was forced to stay at the Temple and take on a teaching role. Prior to her terminal diagnosis, Damsin was known as one of the Jedi Order's most capable Jedi Shadows."}, {"tag": "p", "text": "During the Clone Wars, Damsin did not take on the title of Jedi General, but focused on teaching the next generation of Knights. Having run into Master Kenobi on her way to teach an advanced lightsaber class, she asked her old friend to join her in the teaching, as her assistant had food poisoning. Agreeing, the two taught the class, though Kenobi constantly fretted over Damsin's supposed overexertion. Damsin later saw Kenobi off as he left for his secret mission assigned to him by Grand Master Yoda."}, {"tag": "p", "text": "During Kenobi's mission, Master Yoda summoned Damsin and Padawan Ahsoka Tano to his personal chambers in order to send them on a mission to Corellia. Following a visit to the Temple's wardrobe warehouse to pick suitable disguises, the pair landed in Coronet and made use of the Transit Authority to get to the retirement suburb Visk where their target, Mata Fhernan, resided. Discovering that Fhernan was in fact out to the market in Tiln, the pair made their way to carefully extract the woman and take her back to the Temple. Unbeknownst to Fhernan, an Anzati assassin was tracking her on the orders of Separatist General Lok Durd, who was holding Fhernan's daughter, Bant'ena, captive. Escorting the woman out of the market with some Force-assistance, the Jedi were ambushed by the Anzati but managed to capture him without any harm to Fhernan. During the assault, Damsin's illness caused sharp pains and her blood flowed from her nose and eyes. Though discomforted, she managed to get the woman safely offworld, and back to Coruscant."}, {"tag": "p", "text": "After being released from the Halls of Healing by Chief Healer Vokara Che, Damsin finally revealed her illness to Padawan Tano who, like most of Damsin's fellow Jedi, was ignorant of her fatal disease."}, {"tag": "p", "text": "While waiting for Obi-Wan and Anakin Skywalker's return, Damsin suggested that Tano help her organize a tournament for some of the younger Padawans in the Temple. Each of them led a team through the artificial environments of a state of the art training dojo. Fighting against remote training droids, the teams raced to the top of a tower in the center of a mini city replica. Their teams ended up tying."}, {"tag": "p", "text": "Upon learning that the Separatists had surrounded Kenobi and Skywalker on Lanteeb and had a bioweapon facility there, Damsin was sent by Master Yoda to destroy the Separatist bioweapon. She was inserted by means of a ruse, flying a captured Separatist ship while ostensibly being pursued by Republic forces. The ruse succeeded and the Separatist blockade defended her from the mock attack while allowing her vessel through their lines. She de-orbited into Lanteeb's skies and intentionally crashed her ship, faking its destruction with the help of the body of a dead operative supplied by Senator Bail Prestor Organa. Slightly injured from the crash, Damsin went unnoticed as she penetrated inside the laboratory to Fhernan. Damsin rigged the laboratory and informed Fhernan that the rest of her family was safe. The scientist briefly described the bioweapon and ultimately agreed to stay behind and detonate the explosives. Damsin promised to tell Fhernan's mother of her sacrifice and said goodbye. The scientist followed through on her pledge, destroying the lab and bioweapon."}, {"tag": "p", "text": "She managed to escape the base before Fhernan blew up the plant, making her way to the village of Torbel where Kenobi and Skywalker were cornered by battle droids. As the droids entered the village, Taria sprinted her way through their ranks, where she was hit by a blaster shot to the upper back. After destroying a number of droids, Kenobi was able to carry the wounded Jedi to safety while Anakin enabled the deflector shield. Thanks to an armored bodysuit supplied for the mission, her injury was superficial, but the exertion caused her illness to worsen."}, {"tag": "p", "text": "Damsin informed the two Jedi about the bioweapon's destruction. Kenobi then took her to the healing house of the village. Kenobi brought a girl named Greti, who was Force-sensitive, to help heal Damsin with limited results. After recovering from her wound, Damsin helped keep the shields up as the droid army attacked again, causing one of the generators to collapse. She took command of the defenders to the side of Kenobi and Skywalker and defended the village against the droids as the Republic fleet arrived in time to finish the rest. After the battle was over, the remaining villagers were given sanctuary on the planet of Naboo. However, her exertions on the surface of Lanteeb had cost her considerably and her Boratavi syndrome was no longer in remission. By the time she departed Lanteeb, Kenobi believed she had only weeks to live despite Republic medical care."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A strong woman, Damsin was thought of as peculiar for a Jedi by many of her peers. Eager to accept a mission and get out of the Temple, she was known to skirt the rules while still acting rationally. Refusing to let her terminal illness slow her down, she would refuse to accept pity from her fellows and preferred to be called Taria to Master Damsin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}