{"url": "Battle_of_Fort_Nowhere", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of Ruusan"], "nodes": [{"tag": "h1", "text": "Battle of Fort Nowhere"}, {"tag": "p", "text": "The Battle of Fort Nowhere took place one year after the Battle of Endor."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Fort Nowhere was a Class Two military installment functioning as a city and a smuggler's haven. It was situated on Ruusan and was inhabited primarily by smugglers and colonists from Sulon. The two sides in the battle were Jerec's Imperial branch—who were searching for the Valley of the Jedi situated not far from the fort—and the local settlers of Fort Nowhere."}, {"tag": "h2", "text": "Before the battle"}, {"tag": "p", "text": "Prior to the battle, Dark Jedi and Imperial representatives Sariss, Boc, and Yun parlayed with Mayor Byron Devo III of Fort Nowhere. The settlers initially being very hostile, Sariss nearly Force-choked a settler named Lasko to death to \"soften up\" the dwellers of Fort Nowhere. The Dark Jedi drained Mayor Devo, Marie Peeno, and the tapcafe's owner for relevant information and promised to leave Fort Nowhere alone despite the fact that, according to Imperial law, virtually everything about Fort Nowhere was illegal."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Jerec ordered the settlement destroyed even though Devo had cooperated with Sariss. The Imperial assault was primarily ground-based; the Imperial forces consisted of six TIE/LN starfighters and four assault shuttles worth of stormtrooper platoons (that is, four times forty stormtroopers in all), staged twenty-six hours prior to the battle on the nearby flats."}, {"tag": "p", "text": "The TIE Fighters commenced the attack, destroying larges portions of the Fort's defenses—including large portions of the walls—with laser fire. The assault shuttles followed, landing their troops in the middle of the chaos. The smugglers managed to down one TIE Fighter and the number three assault shuttle, both of which were shot down by settlers Dinko and Peeno. The remaining three shuttles managed to land, and soon the smugglers and settlers were overrun by stormtroopers."}, {"tag": "p", "text": "The Fort Nowhere forces were no match for the Imperials and the battle lasted only thirty-five minutes: fifteen minutes to subdue the fort itself and another twenty to clear out its underground system of caves and tunnels."}, {"tag": "p", "text": "The three Dark Jedi participated actively in the battle. Sariss personally beheaded Mayor Devo during the battle, while Boc amused himself by finishing off wounded smugglers and settlers. Yun was ordered to destroy the fort's subsurface farms."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Fort Nowhere was completely razed and most of its inhabitants were killed; only very few managed to escape, most of whom were later hunted down by trainee stormtroopers. Apart from the downed TIE Fighter and assault shuttle, Imperial losses were minimal."}, {"tag": "p", "text": "Some days after the battle, when the Imperials had proceeded to the Valley of the Jedi, Kyle Katarn and Jan Ors arrived at what was once Fort Nowhere in the Moldy Crow. Shocked with the devastation, the Rebel agents searched in vain for survivors among the ruins."}, {"tag": "p", "text": "Later they discovered a group of survivors in the deserts of Ruusan, including Lasko, Luther Pardy, Carole Grawley, and Grif Grawley, who helped them find the Valley of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}