{"url": "Battle_of_Fortress_Vader", "categories": ["Category:Canon articles", "Category:Battles of Mustafar", "Category:Battles of the Imperial Era", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Fortress Vader"}, {"tag": "p", "text": "The Battle of Fortress Vader was fought on the planet Mustafar at some point during the reign of the Galactic Empire when an army of Mustafarians, led by Father Kkkt, rose up to save what was left of their homeworld after Darth Vader caused the planet to scream as he built his castle, Fortress Vader. During the battle, Vader proved a challenge to the Mustafarians, but Kkkt and the other chiefs used the Force to flood the battlefield with lava."}, {"tag": "p", "text": "The Fortress Vader Imperial garrison was wiped out, with only Vader surviving. He retreated to the fortress as the remaining Mustafarians tried to destroy it and used the energies of the dark side locus under it to wipe the army out. With the Mustafarians dealt with, the Sith Lord Darth Momin confronted Vader in the focusing chamber to kill him. The two fought and Momin badly injured Vader, but was then crushed by a stone. Now alone in the fortress, Vader opened the door to the dark side of the Force and entered it."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After killing two rogue Inquisitors during a chase on Coruscant, Emperor Palpatine gave Darth Vader the planet Mustafar to build himself a personal stronghold. The fortress was designed by the disembodied spirit of an ancient Sith Lord named Darth Momin. The construction of the castle unleashed a great deal of dark side energy, which was sensed by a Force-sensitive elder of a nearby tribe of Mustafarians. Through several different iterations of construction Darth Vader and Momin attempted to open a dark side portal. Each time the portal started to open, there were cataclysimic effects on the surrounding landscape, which was extremely dangerous for the native tribes and fauna. There were small uprisings of Mustafarians over the castle's construction. Sometimes, large herds of lava fleas attacked the castle, which caused even Momin himself to marvel. None of these small uprisings proved to be more than the Imperial garrison could handle."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Mustafarian resistance"}, {"tag": "p", "text": "When the construction was complete on the ninth iteration of Vader's castle, the Sith once again attempted to open the portal, but they were stopped by reports of another, unprecendented attack by the native population, led by Father Kkkt. Frustrated, Vader was forced to leave in order to aid his troops in fending off the attack, lest the castle be overrun and destroyed. In Vader's absence, Momin once again activated the portal, despite his claims that he could not use the Force in his disembodied state. Momin's original body stepped through the portal, and the ancient Sith was fully ressurected, thousands of years after his death."}, {"tag": "p", "text": "The Imperial garrison found themselves quickly overwhelmed by the attackers, and attempted to retreat, but Vader was able to turn the tide of the battle and rally his troops against them. Seeing an opportunity to destroy Vader, Kkkt rallied more mystics of his tribe to call on the \"Blood of Mustafar.\" Kkkt and his mystics were able to use the Force to summon a great wave of lava that washed over all of the Empire's forces, leaving no survivors except for Vader himself, who used the Force to lift himself to safety, but not without serious damage to his suit and cybernetics. Vader reentered the cave beneath his castle in order to open the portal, which once again released cataclysmic levels of dark side energy, burning what was left of the Mustafarian resistance."}, {"tag": "h3", "text": "Duel in the Sith cave"}, {"tag": "p", "text": "When Vader returned to the cave, Momin attacked him and the two Sith Lords engaged in a lightsaber duel. During the fight, Momin taunted Vader, claiming that he would never be able to open the dark side door, as it would have rejected him. Momin lamented the apparent decline of the Sith's power in the thousands of years since his death, calling Vader and Sidious \"Jedi-obsessed weaklings\". Vader was gravely wounded during the duel, but he was able to reach out with the Force and crush Momin beneath an enormous stone as the ancient Sith Lord claimed the dark side loved him. A disbelieving Momin died for the second time."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Momin dealt with, Vader opened the door to the dark side himself and his spirit left his body to enter it. On the other side, Vader saw his life pass before him through visions before reaching an illusion of the Jedi Temple. There, he was faced by the visions of Jedi he had encountered in the past and he massacred them all. After killing an illusion of Palpatine, Vader then found his beloved, Padmé Amidala. He intended to resurrect her, but she instead jumped off the balcony where she stood and was destroyed. Heartbroken, Vader was soon distracted by a beam of light. The individual within it overwhelmed him, and Vader's spirit was returned to his body. Having failed to resurrect his wife, Vader destroyed the portal and contacted Palpatine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}