{"url": "Target_Vader_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Target Vader"], "nodes": [{"tag": "h1", "text": "Target Vader 2"}, {"tag": "p", "text": "Target Vader 2 is the second issue of the canon comic book miniseries Star Wars: Target Vader. It was written by Robbie Thompson, illustrated by Stefano Landini, and published on August 14, 2019 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE HUNTER BECOMES THE HUNTED! VALANCE and DENGAR track DARTH VADER while also seeking out the perfect weapon to kill the SITH LORD…which they'll need as Vader turns the tables on the hunters and corners them! And both hunter and hunted uncover dark secrets behind the criminal syndicate known only as THE HIDDEN HAND."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Valance's Origins"}, {"tag": "p", "text": "Years before the hunt for Vader, a young Beilert Valance asks his father if he would be a miner on Chorin forever like he and his grandfather were. His father says he is proud of his work, but he adds that the Valance family had been miners for centuries as slaves before the Galactic Empire arrived and liberated them. Beilert was born a free man, and his father believed he belonged elsewhere."}, {"tag": "h3", "text": "Narrowing the Hunt"}, {"tag": "p", "text": "In the present day, Valance shoots down two TIE fighters in the Broken Wing. Dengar chastises him, but Chio Fain reassures him that the TIEs were just scouts, and Valance had a communications jammer. Landing on Arvina in the Outer Rim Territories, Valance orders Urrr'k to stay with the ship while he takes the rest of the crew to Fetya's Hollow in search of weapons. Fetya greets them in her shop, and Valance explains that they were hired by the Hidden Hand. Fetya reveals her dealings with the group as well, pointing to a Rebel Alliance starbird left by one of the Hidden Hand's buyers, but she denies any status as a \"good guy\" and surrounds the crew with hired guns. Before she can kill them, however, her shop is destroyed by a Star Destroyer overhead."}, {"tag": "p", "text": "Valance's team escapes Fetya's Hollow in a stolen troop transport, and he reveals that he never jammed the TIEs' communications, rather amplified their signal with Hidden Hand call signs. As a result, Darth Vader himself arrives in his TIE fighter and prepares to shoot the crew down, but they escape aboard the Broken Wing into hyperspace. Once they exit, Chio Fain explains that he sliced into Fetya's records and has a list of Hidden Hand outposts Vader will soon visit—outposts they can trap him at. Back on Arvina, Vader kills Fetya and her crew, and his stormtroopers secure her weapons supply. They also inform him that Valance has exited hyperspace, as they had received a transmission from an informant about where Valance is going."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}