{"url": "Target_Vader_6", "categories": ["Category:Real-world articles", "Category:Star Wars: Target Vader"], "nodes": [{"tag": "h1", "text": "Target Vader 6"}, {"tag": "p", "text": "Target Vader 6 is the sixth and final issue of the canon comic book miniseries Star Wars: Target Vader. It was written by Robbie Thompson, illustrated by Stefano Landini, Roberto Di Salvo, and Georges Duarte, and published on December 11, 2019 by Marvel Comics."}, {"tag": "p", "text": "The issue features the story \"Free,\" in which Beilert Valance attempts to outsmart both the Galactic Empire and the Hidden Hand."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "SHOWDOWN! Valance has escaped the clutches of the Empire, and finally has a lead on who's REALLY behind the mysterious crime syndicate, the Hidden Hand. In the process, he's uncovered a mystery about his own past. Darth Vader… AND members of the Rebellion, desperate for one last arms deal with The Hidden Hand. Will Valance be able to finish the job and kill Vader? Will Vader crush the Rebellion once and for all? Or will The Hidden Hand continue to walk between the raindrops and escape them all? Check out the thrilling finale to find out!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Becoming a Hunter"}, {"tag": "p", "text": "After his time in the Galactic Empire, the bounty hunter Cavic flies with Beilert Valance aboard the Broken Wing, fleeing three Arquitens-class light cruisers. Neither hunter expects the Empire to abandon their pursuit, but Cavic says he knows where to hide and flies to a hidden outpost in a nearby asteroid field. They watch as one cruiser is destroyed by asteroids, and Cavic explains that since he and Valance were Imperials, they had an advantage over other hunters by knowing the Empire's limits. Cavic touted the bounty hunter life, telling Valance that although it was short and rife with debt, at least they would be free."}, {"tag": "h3", "text": "The Fall of the Hidden Hand"}, {"tag": "p", "text": "At the rebel outpost on Lowik, officer Aeliar expresses her disdain to Gita about trusting Valance to secure weapons for the Rebel Alliance. Elsewhere, on the Hidden Hand asteroid base, Valance lands and plants a tracker before being captured. The Hidden Hand members take him to their leader, who reveals himself as Gwi, the \"messenger\" who initially hired Valance to kill Darth Vader. Gwi punches Valance in frustration, gloating that he spent years to build the Hidden Hand and could fall neither to the Empire nor Valance. Valance claims that the rest of his bounty hunter team died hunting Vader, and that he found the base after realizing that all the other outposts were also in asteroid fields."}, {"tag": "p", "text": "Gwi asks why Valance would steal from other bounty hunters and bother to return after his failure, and Valance says that all his work was for Chorin. Disappointed in Valance's motivations, Gwi prepares to kill him, but Darth Vader arrives, having followed Valance's tracker. In the ensuing fight, Vader captures Gwi to be questioned by Emperor Palpatine, and Valance escapes. Vader orders the Imperial forces on Chorin to destroy any trace of Valance, but by the time stormtroopers arrive at Valance's village, he had already evacuated its populace to Lowik. Gita promises that his people will be safe and offers Valance a place with the Rebel Alliance, but he refuses and returns the lucky gemstone Yuralla Vega gave him when he first left Chorin."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "On Coruscant, Dengar gloats to the patrons of a bar about his deal with Darth Vader, but his story is interrupted by the arrival of Valance, who punches him and asks the bartender to buy him a drink. The bartender asks what Valance did with his credits, and he says he simply \"blew them all on something stupid,\" having actually supplied the rebels with the weapons they needed."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}