{"url": "Battle_of_G%27rho", "categories": ["Category:Legends articles", "Category:Battles in Wild Space", "Category:Battles of the Ssi-ruuvi invasion"], "nodes": [{"tag": "h1", "text": "Battle of G'rho"}, {"tag": "p", "text": "The Battle of G'rho was the invasion of the remote colony world of G'rho on the edge of Wild Space by the Ssi-ruuvi Imperium in 2 BBY; marking one of its first incursions of the known galaxy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Emperor Palpatine made contact with the alien invaders called the Ssi-ruuk, he made a deal with them: In exchange for their battle droid technology, the invaders were allowed to attack smaller colonies at the edge of colonized space. The G'rho colony was one of these."}, {"tag": "p", "text": "The system's defenses included a patrol craft, which was lured away before the battle with a faked distress call. This left the planet relatively undefended and ready for the invasion."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Ssi-ruuk attacked the colony with a force of six ships and took the defenders completely by surprise. Major Brco tried to communicate with the invaders, but all his hails were ignored."}, {"tag": "p", "text": "When the ships touched down near the Boku Settlement and the Ssi-ruuk invaded one of the domes, Brco ordered the Conjo fighters under the command of Lieutenant Jerriman to attack the enemy ships. Ydra Sibwarra, a force-sensitive fugitive from Chandrila, used this moment to sent a message to her son Dev, telling him to run away and hide."}, {"tag": "p", "text": "In the end, the fighters proved to be no match for the invader's ships. Shortly after the order had been given, G'rho's command center was bombarded with paralysis gas. Trig Kilwallen, Ydra's brother, force-sensitive and one of the Conjo pilots, was able to feel the upcoming attack. He and his wife Seni escaped the battlefield, but the colony was quickly overrun and planet occupied by Ssi-ruuvi and P'w'eck troops. Only around 150 colonists managed to escape the encirclement and formed a resistance."}, {"tag": "p", "text": "When Unit Commander Th'twirirl surveyed the battlefield, looking for refugees, he noticed the small human boy Dev Sibwarra hiding in a ravine. He and four other Ssi-ruuk left the lander and made contact with the boy. Since both couldn't understand each other, Th'twirirl offered Dev some qrikki sweets and lured him onboard."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "Fate of the colonists"}, {"tag": "p", "text": "Since their technology depended on extracting the life energies of other beings via an agonizing process known as Entechment, most of the surviving Colonists were enteched. While the invasion fleet moved on, they left behind a large ground force and constructed a large entechment facility."}, {"tag": "p", "text": "After the battle, at first forty-eight colonists were revived to recharge the converters, followed by the continued entechment of similar groups, depending on the needs of energy."}, {"tag": "p", "text": "Dev Sibwarra was brought to the laboratory of Ptellung, who used this opportunity of a cooperating specimen to measure and probe the young human. After Sibwarra was no longer of any use to him, he gave the boy back to Th'twirirl, who brought him to the entechment chambers."}, {"tag": "p", "text": "Ydra Sibwarra had remained her force-senses after being enteched and charged into a coil. When she reached out and found out that her son was about to be enteched, she used her last will to overcharge her own coil as well as several others. That and Dev Sibwarra's emotional reaction made Th'twirirl realize that the boy might have more \"entechment energy\" than other humans. Fourious about the destruction that the human child had seemingly caused, Entechment Master Yifaii ordered him to be recycled."}, {"tag": "p", "text": "Despite Yifaii's orders, Th'twirirl decided to keep Sibwarra alive and gave him to Yifaii's assistant, Firwirrung. He and Elder Bluescale brainwashed the boy through mind manipulation techniques. However, what astounded them was the boy possessed strange powers to sense others. It was from this boy that the Admiral Ivpikkis discovered that Humans were the galaxy's dominant species. He also discovered that humanoids had longer containment time when enteched and could last longer than most other species. Due to Sibwarra's Force abilities and his ability to communicate with his fellow Humans, the Ssi-ruuk used Dev Sibwarra to calm the subjects being enteched."}, {"tag": "h3", "text": "The Underground"}, {"tag": "p", "text": "A few colonists could escape the battle and continued to fight the Ssi-ruuk, Trig Kilwallen and his wife Seni. The Ssi-ruuk continuously swept the planet for any escaped humans. With each day, more and more survivors were captured and enteched."}, {"tag": "p", "text": "After four months, the resistance had only a few dozen soldiers and two Conjo fighters left. Trig and Seni Kilwallen launched a desperate mission to destroy the entechment facilities, hoping that a peacekeeping force would answer their calls for help. The But four months after the battle the last resistance was finally wiped out. Previous attempts to infiltrate the base had failed due to Ssi-ruuvi weapon scanners and three members of the Underground had been captured."}, {"tag": "p", "text": "While Trig sneaked into the facility using the force, his wife, still injured form a previous fight, would fly an air strike against the facility. Since the two Conjo fighters had been carefully hidden and not been used in previous engagements, anti-air gun emplacements were not expected. The mission was a success, despite Trig being discovered by two P'w'eck soldiers and Seni almost dying due to her injuries. She managed to land somewhere in the woods, hoping to be found by her husband before the Ssi-ruuk would find her."}, {"tag": "p", "text": "Despite the valiant efforts of the Underground, it seemed unlikely that help ever arrived on G'rho due to the Imperial cover up that reported no survivors after the initial attack."}, {"tag": "h3", "text": "Imperial cover-up"}, {"tag": "p", "text": "Emperor Palpatine, who had made a secret agreement with the Ssi-ruuk, covered up the incident and blamed the attack on Rebels. At 32:2:4 an official statement was released through Imperial HoloVision and Galaxywide NewsNets, stating that the system patrol craft had been lured away by a faked distress call, while the colonists had been massacred by the Rebels."}, {"tag": "p", "text": "Nonetheless, rumors escaped about this and other incidents and spacers whispered about them in the galaxy's cantinas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle and Dev Sibwarra's capture were first mentioned in Kathy Tyers' The Truce at Bakura, but were greatly expanded upon in The Truce at Bakura Sourcebook and the included short stories Strangers with Sweets and Last Strike at G'rho, also written by Kathy Tyers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}