{"url": "Tarc", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Colonies species", "Category:Crustacean sentient species", "Category:Tarc"], "nodes": [{"tag": "h1", "text": "Tarc"}, {"tag": "p", "text": "The Tarc were a sentient crustacean species, indigenous to the planet Hjaff. Standing at around two meters tall with four arms and a chitinous exoskeleton, they appeared intimidating to most humanoids, a reputation furthered by their ruthless and emotionless behavior. The Tarc, in fact, did not lack emotions, but believed them to be private and not to be shared with others. Fiercely protective of their culture and sovereignty, the Tarc saw other species as a threat to both of these and, as a result, were extremely isolationist as a society. The Tarc colonized the star systems around their homeworld, making the area a buffer between them and the rest of the galaxy and using their navy, the Ivlacav Gourn, to destroy any intruders. That practice led the species into conflict with the Galactic Empire during the Galactic Civil War."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Tarc were a carnivorous species of crustacean that originally evolved from large sea-dwelling creatures. However, evolutionary pressures forced them to adapt to life on land, where they became well adapted to the arid desert environment of the three continents of their homeworld, Hjaff. These adaptations included great tolerance for high temperatures and the ability to go without fresh water for extended periods of time, despite their aquatic origin. Such traits derived from the Tarc being covered entirely in a chitinous exoskeleton that could store water and act as a means of controlling body temperature. The exoskeleton also provided protection from damage but made the Tarc far heavier and bulkier than Humans and humanoids of similar size. However, the added size made them more intimidating."}, {"tag": "p", "text": "The Tarc were hairless bipeds, possessing two legs and four arms, as well as two eyes and a pair of antenna on their head. The upper pair of arms were dexterous with three fingers on each hand, while the lower arms ended in claws used for fighting. On average adult Tarc stood between 1.75 and 2.2 meters tall. Despite their size, they had surprisingly quick reflexes, although their weight caused them to be relatively slow on land."}, {"tag": "p", "text": "Due to their diet of meat, the Tarc never evolved the need for lips, teeth or tongues. Instead, they possessed hollow spikes inside their mouths, which injected acidic saliva into food. Once the food was shredded into smaller pieces, it then was ingested directly through the spikes for nourishment, as the Tarc lacked stomachs. The lack of such an organ meant the Tarc could not digest tough or sinewy meat, so their diet consisted of sand mollusks and other small creatures with soft flesh native to the deserts of their homeworld."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Private priorities"}, {"tag": "p", "text": "Most other beings generally perceived the Tarc as cold and emotionless, since the species considered the emotions they did have as personal, rarely sharing them with others. They often came across as ruthless, only caring about their own survival, although that was entirely a product of their culture and the environment in which they lived. A Tarc's actions were always necessary and decisive, aiming to achieve a specific result within a set time period, often more short term than long. If an action did not achieve the desired result, another was quickly implemented to replace it. Deliberation was rare amongst the Tarc and not highly valued."}, {"tag": "p", "text": "The Tarc's society originally was divided among a large number of nations, each prioritizing the protection of their own sovereignty and culture against the others. Although the Tarc were not a particularly violent or warlike species, international disputes led to many wars when they saw aggression as a logical action to achieve their goals. The Tarc's tactics normally consisted of using overwhelming force to defeat and then destroy the enemy in a short period of time, with mercy never being an option. The Tarc only engaged in conflict for what they believed was truly an appropriate action to achieve the goal they sought, very rarely doing so out of anger or hatred, although they were capable of such emotions. However, during combat, the Tarc sometimes became enraged due to their pent up emotions. Whilst in this state they were incredibly dangerous, attacking anything and anyone nearby."}, {"tag": "h3", "text": "Xenophobic civilization"}, {"tag": "p", "text": "The Tarc's culture developed as the nations became more advanced and came to depend on each other and the global economy of Hjaff more than that of individual states. The nations eventually integrated into a single union that sought stability. This government was politically a hierarchical system and was led by two political bodies, the continental leadership and the Keddek, an individual planetary leader. The continental leaders were three individuals, each representing one of Hjaff's three continents, who acted as advisers to the Keddek and assisted in carrying out the Keddek's rule. The Keddek was superior to the three leaders and had near full power over the entire species but had to obey the Hjaff constitution whilst ruling. If not, the continental leaders were expected to overthrow the ruler with their combined military strength and choose a replacement. All positions of leadership within the Tarc political system were held for eight standard years—the equivalent of ten of the Tarc's years—before a vote was taken to determine who would next hold the position. All Tarc were expected to vote in these elections; those who did not faced punishment normally in the form of a prison sentence or indentured servitude."}, {"tag": "p", "text": "The Tarc possessed a zero-tolerance policy in relation to other species, something that could border on xenophobia, as they saw non-Tarc as a threat to their way of life. That was exacerbated by the Tarc mouth structure, which resulted in the Tarc language being spoken in a series of clicks and clacks from their mouth spikes accompanied by growls and grunts. Besides their own language, the lack of a tongue meant the Tarc could not speak Basic or most other languages, and so communication with other species was difficult. The space surrounding their homeworld in the Colonies was colonized and acted as a buffer between them and the rest of the galaxy, with the Tarc navy—the Ivlacav Gourn—destroying any starships that entered the region. The species attempted no further expansion beyond their defended region, and it was a crime for a Tarc to leave their home system without specific permission."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "From evolution to space"}, {"tag": "p", "text": "The Tarc originally evolved in the oceans of Hjaff before beginning to move onto the shores at an early stage in their development. Once on land, they moved evolutionarily further away from their aquatic origins and geographically deeper into the deserts that made up most of their homeworld. In such harsh conditions, the species developed complex tools to help them survive, and they soon advanced and spread across the planet. The early members of the Tarc species segregated into a large number of different nations of varying size and strength across the different continents of Hjaff. These nations each sought to defend their individual cultures and sovereignty and, as a result, often came into conflict with one another. After a long period of these various international wars, in which the Tarc's society and technology slowly developed, each nation gradually came to depend on the others as a global economy formed. Due to such interdependence, the Tarc nations eventually ceased to fight one another and integrated into a single union, lead by a global leader named the Keddek and a body of three continental leaders."}, {"tag": "p", "text": "Shortly after the formation of the union, the Tarc began space exploration in the surrounding systems of their own Hjaff system. They colonized these regions, taking control of twenty systems and then encountering other sentient life. The Tarc were horrified but not shocked to discover alien life, but they interpreted such outsiders as a threat to their culture. The Tarc immediately retreated and ceased all space exploration, leaving their colonized systems as a buffer between them and the rest of the galaxy. Military outposts were built on many worlds at the edge of their region of colonized space, and the Tarc navy destroyed all intruders on sight."}, {"tag": "h3", "text": "Imperial conflicts"}, {"tag": "p", "text": "Such policies led to a number of skirmishes between the Ivlacav Gourn and the Imperial Navy during the reign of the Galactic Empire. The Tarc won all such skirmishes, prompting Imperial Moff Joss Leskwin, who governed the region of space containing the Tarc-controlled systems, to form a strike force strong enough to take on the Tarc navy and engage the species in full-scale war. As the conflict escalated, some Tarc suggested that the species should seek aid from the Alliance to Restore the Republic, a rebel force simultaneously in conflict with the Empire in the Galactic Civil War. Those individuals believed the Tarc culture would be preserved better under Rebel control than that of the Empire. However, such Tarc had little political representation or influence."}, {"tag": "p", "text": "Prominent Iyra Sentientologist Tem Eliss wrote an entry on the Tarc species in his book, The University of Sanbra Guide to Intelligent Life, during their conflict with the Empire. In the book he theorized that most likely the Abinyshi species, who inhabited the planet Inysh in the Inysh system close to Hjaff, were the first other sentient species the Tarc encountered. At the time of the book's writing, the Keddek on Hjaff was named Visacc."}, {"tag": "h2", "text": "Tarc in the galaxy"}, {"tag": "p", "text": "Given that the Tarc were forbidden to leave their region of colonized space, very few were found in the rest of the galaxy. Due to the isolated nature of the Tarc and their inability to speak Basic, those Tarc who did leave Hjaff had an incredibly difficult time communicating with other beings, as almost no non-Tarc spoke their language. Given the restrictions on leaving their homeworld, most Tarc found away from Hjaff and its surrounding systems were outcasts or criminals and, as such, often came to work for criminal organizations. They usually found employment as bodyguards, enforcers, bounty hunters, and assassins, due to their intimidating appearance and strength. One such Tarc, active during the Galactic Civil War, was Fascyn, who became an assassin and bounty hunter as part of House Salaktori, the preeminent member house of the Bounty Hunters' Guild. Fascyn was personally selected by the house's CEO to join the organization, as all members were."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tarc were created as a species for West End Games' Star Wars roleplaying game, with a detailed description of the race given in the fourteenth issue of the Star Wars Adventure Journal. The article, part of the Alien Encounters series, was written by Trevor J. Wilson and Craig Robert Carey, and published in 1997. The article included an illustration of a Tarc by Pablo Hidalgo and roleplaying attributes for the species that favored dexterity, strength, and perception, whilst granting the Tarc average scores in the remaining attributes."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}