{"url": "Taris", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ecumenopolises", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Outer Rim Territories planets", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Taris"}, {"tag": "p", "text": "Taris was a polluted urban planet located in the Outer Rim. Although Taris was a heavily populated ecumenopolis, much of the surface itself was polluted with wrecked starships and dense, overgrown swamps. Makeshift tenements made of shipping containers and crashed starships stacked on top of one another, while yellow smog drifted in the atmosphere. The elite of the planet dwelled in nicer skyscrapers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Taris was a very diverse ecumenopolis, that was covered in both urban sprawl and wastelands. On the far side, dwelled the wealthy, and middle class. Wealthy citizens lived in massive towers guarded by private security forces, that were surrounded by cities filled with middle class residents. On the opposite side, poorer inhabitants lived in squalor in wastelands such as the former Talinn district. The Talinn district was covered by decaying urban infrastructure, wrecked starships, and old shipping containers. Additionally, Talinn was overgrown with three-fingered vines and slime-slick fungus. Purple was considered a traditional color of administration on Taris."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point in galactic history, Taris suffered from a devastation of some sort, resulting in the surface being littered with ships, many buildings being destroyed, and the atmosphere becoming largely polluted. Although the city ultimately maintained its status as a major urban world, much of its population resorted to living in makeshift homes, many of which were old shipping containers."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, Taris was represented in the Galactic Senate by Senator Kin Robb. Near the end of the war, Admiral Wullf Yularen received rumors that Count Dooku's new right-hand \"Admiral Enigma\" (the fallen Jedi Master Quinlan Vos) was planning to attack Taris with his Providence-class Dreadnought. As a result, the Jedi High Council authorized a mission to rescue Vos from Separatist captivity."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "Five years after the founding of the Galactic Empire, a ship made a quick jump to Taris before quickly leaving the system for Thustra. The vessel then rendezvoused with a group of rebels, who had commandeered Moff Wilhuff Tarkin's ship, the Carrion Spike. Around the time of the Battle of Scarif, Taris was represented in the Imperial Senate by Senator Tynnra Pamlo."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "In the months following the Battle of Endor, a cabal of dark side adherents known as the Acolytes of the Beyond bought the late Darth Vader's supposed lightsaber, intending to destroy it to return it to its master in death. In 5 ABY, the New Republic operatives Norra Wexley, Sinjir Rath Velus, and Jas Emari lured the bounty hunter Mercurial Swift into a trap on Taris' wasteland. They questioned him for information on Grand Admiral Rae Sloane before releasing him. In response, Swift sought to capture a bounty on Emari's head."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, Taris was represented by Andrithal Robb-Voti in the New Republic Senate on Hosnian Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taris made its first entry into canon with the release of the novel Tarkin on November 4, 2014. In the Legends continuity, Taris was created for and first appeared in the 2003 role-playing game video game Star Wars: Knights of the Old Republic."}, {"tag": "p", "text": "A preview of The High Republic Adventures 1 included in The High Republic Free Digital Sampler had Taris highlighted on an included galaxy map. In the final comic, other worlds were highlighted instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}