{"url": "Tarkin_(superweapon)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Semi-protected articles", "Category:Death Stars"], "nodes": [{"tag": "h1", "text": "Tarkin (superweapon)"}, {"tag": "p", "text": "The Tarkin, or the Tarkin Project, was an Imperial superweapon modeled in principle after the first Death Star battlestation and named in honor of the late Grand Moff Wilhuff Tarkin. The Tarkin combined the first Death Star's offensive capabilities in the form of a planet-destroying ionic cannon superlaser with a defensive shield generator and a set of engines. Imperial engineer Bevel Lemelisk designed the Tarkin, at the behest of Emperor Palpatine following the Death Star's destruction at the Battle of Yavin, as a prototype weapons testbed for the construction of the Eclipse-class Super Star Destroyer, a massive warship armed with a ship-mounted superlaser. With technological refinements, the Tarkin improved upon the mistakes learned from the first Death Star, including the absence of the single design flaw—an exposed thermal exhaust port—that proved to be the original battlestation's undoing, in the name of the development of a second Death Star, built concurrently with the Tarkin."}, {"tag": "p", "text": "The Empire secretly began constructing the Tarkin in the Patriim system, above the garrison planet Hockaleg, under the supervision of Admiral Nod Warfield. In 3 ABY, following the Battle of Hoth, Imperial Grand Admiral Martio Batch requisitioned the Tarkin's destructive superlaser to smash the planet Aeten II—the only ever offensive application of the Tarkin superweapon—releasing millions of the planet's deeply buried stygium crystals into space, which Batch gathered to recreate the stygium screen cloaking device for his TIE Phantom development project."}, {"tag": "p", "text": "Once learning of the Tarkin's existence shortly thereafter, the Rebel Alliance dispatched an elite commando team consisting of Luke Skywalker, Princess Leia Organa, the Wookiee Chewbacca, and the droids C-3PO and R2-D2—the only Rebels to have been aboard the first Death Star and survived—to the Patriim system to infiltrate the Tarkin and destroy the superweapon from within before it could be completed. Despite the presence of the Dark Lord Darth Vader and a traitorous group of the superweapon's commanding officers, who sought to both kill Vader and stop the Rebel saboteurs, Organa drew upon a recollection of the original Death Star's technical schematics to rewire the Tarkin's superlaser firing mechanism to fire on itself. The Tarkin later self-destructed upon activation of the sabotaged superlaser in a failed attempt to obliterate the Rebels as they fled from the battlestation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Tarkin superweapon, also known as the Tarkin Project, was a giant planetary-scale battlestation following the same basic principles of the first Death Star. The Tarkin combined the Death Star's primary offensive battery and massive ionic cannon superlaser, capable of shattering a planet in the same mold as the Death Star's, with a defensive shield generator system and a set of engines. The Tarkin's superlaser, comprising a central concave dish encircled by a series of secondary tributary nodes, dominated the battlestation's external forward superstructure. The awesome size of the Tarkin reduced the Empire's normally-fearsome Star Destroyers to diminutives by comparison. Unlike its predecessor, the Tarkin was constructed without the single design flaw—an exposed thermal exhaust port—that led to the Death Star's destruction."}, {"tag": "p", "text": "Set back from the forward superlaser dish was the Tarkin's central command tower and bridge. The command tower resembled the same trapezoidal design found on Imperial-class Star Destroyers, sans the twin deflector shield generator domes. The bridge, too, resembled the layout of the Imperial-class Star Destroyer in a general sense, with a wide angular viewport and a command walkway. A series of double-tiered seated command stations were circularly-arrayed before the bridge's viewports."}, {"tag": "p", "text": "The battlestation's interior was divided into sections and levels identified by letters and numerals—K-level and sections TH-10 and TH-11, for example. The interior also housed the installation's main power reactor, the primary external tractor beam generator, the escape pod bay, hangar bays hosting the Tarkin's starship complement, and the superweapon's complex activating mechanism. A series of service lifts offered rapid vertical transport between the Tarkin's many decks."}, {"tag": "p", "text": "A stormtrooper guard force patrolled the Tarkin and provided security for the battlestation's sensitive areas, restricting access only to those with proper clearance, and a series of gunners controlled the Tarkin's superlaser firing mechanism. The Tarkin also maintained a TIE/LN starfighter contingent for close-range aerial support. Non-military construction vehicles aboard the Tarkin included cargo vessels and cargo trolleys."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Design origins and destruction of Aeten II"}, {"tag": "p", "text": "The Tarkin was a direct descendant, in both form and function, of the Empire's first Death Star, destroyed in the Battle of Yavin in 0 BBY. Incensed at the loss of his weapon of doom, Emperor Palpatine ordered engineer Bevel Lemelisk, the Death Star's original designer, to produce a resurrected Death Star, even larger and more powerful than the first. At the same time, the Emperor likewise had already ordered the construction of a pair of massive warships equipped with superlasers—the Eclipse-class dreadnought. To keep the Rebel Alliance from discovering the new Death Star and to test the ship-mounted superlaser of his new warships, the Emperor tasked Lemelisk with developing a prototype of the Eclipse-class into an operational weapons platform."}, {"tag": "p", "text": "Lemelisk first set to designing a superlaser weapons testbed, similar in principle to the first Death Star prototype constructed in the Maw Installation, that corrected the mistakes learned from the first Death Star's design with technological refinements. Imperial officers eventually christened this weapons testbed, essentially a scaled-down version of the Death Star, the \"Tarkin\", in memory of the late Grand Moff Wilhuff Tarkin, the Death Star's former commanding officer."}, {"tag": "p", "text": "After Lemelisk's design team completed their work on the Tarkin, they began designing the Death Star's successor. Meanwhile, construction on the superlaser testbed began at the Patriim shipyards in the Patriim system, above the garrison planet Hockaleg. The Empire secretly funneled resources into the Tarkin's construction under the nose of the Rebel Alliance. Although considerably smaller in size than the Death Star, the Tarkin was still so large as to be visible in the Hockaleg sky as a rectangular satellite. The construction was overseen by Admiral Nod Warfield."}, {"tag": "p", "text": "As the Tarkin neared completion in 3 ABY, following the Battle of Hoth, the superlaser testbed became a symbol of intrigue for Grand Admiral Martio Batch. The Emperor had tasked Batch with developing a working cloaking device, since cloaking technology had become almost non-existent in the galaxy by the time of the Galactic Civil War. Batch succeeded only in creating a cloak that suffered from \"double blindness,\" meaning that those aboard the cloaked starship could not see out. To create a fully functional cloak, Batch required access to the once-common stygium crystals found in the mines of the hidden planet Aeten II, but the mines had long since run dry. To solve the problem, Batch requisitioned the Tarkin's superlaser."}, {"tag": "p", "text": "Batch pulled rank to divert the Tarkin to the Aeten system in the Dreighton Nebula of the Outer Rim Territories, where he used the superlaser to shatter Aeten II, thus releasing millions of the planet's remaining stygium crystals into free-floating space. Thanks to the Tarkin, Batch used the freed stygium crystals to recreate the classic stygium screen cloak in conjunction with his prototype TIE Phantom project. The destruction of Aeten II would prove to be the only time the Tarkin successfully fired its superlaser."}, {"tag": "h3", "text": "Rebel infiltration"}, {"tag": "p", "text": "The Tarkin was constructed in the Patriim orbiting drydock facility above Hockaleg, held in temporary balance by the gravitational pull of the planet below. The Tarkin's sizable labor force resided in meager shanties in a spaceport town on the planet while in between work shifts, and construction crews were shuttled to the Tarkin daily. Several Imperial-class Star Destroyers protected the Tarkin drydock construction site."}, {"tag": "p", "text": "Not long after the destruction of Aeten II, a Rebel pilot, Maraba Tev, led a spy mission to the Patriim system, where he stole a set of the Tarkin's schematics, revealing the battlestation's existence to the Rebel Alliance. Realizing the full destructive capabilities of the Tarkin and the incredible threat the battlestation posed, the Rebellion resolved to destroy the Tarkin before it became operational. Because the Tarkin was built without the single design flaw found in the first Death Star, a direct attack would have been suicidal. Instead, Rebel General Carlist Rieekan organized and dispatched a small commando team to infiltrate and bring the battlestation down from the inside. The Rebel assault squad included Luke Skywalker, Princess Leia Organa, the Wookiee Chewbacca, and the droids C-3PO and R2-D2—the only Rebels to have infiltrated the original Death Star and survived."}, {"tag": "p", "text": "The Rebel commando team did successfully infiltrate the Tarkin, first by docking on Hockaleg aboard the freighter, the Millennium Falcon, listed as a vessel in need of repairs, and then mixing in among the Tarkin's construction crew and boarding a shuttlecraft that delivered them to the Tarkin in orbit. However, the Imperial superweapon would serve as a crossroads for three competing factions at the time of the Rebel infiltration. The Dark Lord Darth Vader, recently arrived aboard the battlestation for an inspection, detected Skywalker's presence as soon as he boarded. Vader ordered all on-board security to vacate the area housing the Tarkin's main power reactors, planning to confront Skywalker there and turn him to the dark side of the Force. Meanwhile, a group of the Tarkin's commanding officers, tired of living in fear of the Dark Lord's iron discipline, planned to kill Vader before the day was out."}, {"tag": "p", "text": "The Rebels split up into three parties, each tasked with neutralizing a certain component of the Tarkin—Chewbacca planned to destroy the battlestation's exterior tractor beam generator to allow for an escape, Organa would secure an evacuation route by seizing control of an escape pod, while Skywalker would destroy the central reactor with a proton grenade—but not before alerting the Tarkin's bridge to their presence. Vader immediately moved to the sector of the Tarkin housing the reactors to intercept Skywalker, ordering the battlestation to increase security along possible escape routes, while the Tarkin's commanding officers, recognizing Vader's preoccupation with the Rebel infiltrator, prepared to strike."}, {"tag": "h3", "text": "The Princess's vengeance"}, {"tag": "p", "text": "Only one-third of the Rebels' sabotage strategy went as planned. Chewbacca, with the help of C-3PO, succeeded in blowing up the Tarkin's tractor beam generator after a conspicuous tangle with a trio of stormtroopers. Organa, however, was ambushed by four waiting stormtroopers in the Tarkin's escape pod bay. Although she quickly dispatched the group, Organa was forced to abandon the Rebels' planned escape route. Skywalker's mission was also foiled, not by Vader, but rather through the intervention of the Tarkin's commanding officers."}, {"tag": "p", "text": "Vader was already waiting for Skywalker when the latter reached the reactor generator room, but before the two warriors could meet, Colonel Nord, one of the Tarkin's officers trying to kill Vader, remotely opened an airlock in the sector housing the reactor from the bridge, hoping to flush the Dark Lord out into space. The airlock breach nearly pulled both Vader and Skywalker to their deaths, and ripped the proton grenade out of Skywalker's hands into the depths of space, but both managed to resist the pull of vacuum. Skywalker pulled himself into an open freight lift and escaped the area, but the loss of the proton grenade meant he could not sabotage the Tarkin's reactor. Through his strength in the Force, Vader overcame the pull of vacuum to reach the manual controls and close the airlock, but he knew Nord had just tried to kill him."}, {"tag": "p", "text": "Meanwhile, Organa, finding herself lost, had unwittingly stumbled into the activating mechanism for the Tarkin's central ionic cannon, which she realized was the very same machinery that had destroyed her homeworld of Alderaan. Knowing the Rebellion could never allow the Empire to use the Tarkin's superlaser, Organa bought her sabotage team a mode of insurance. She remembered the original schematics to the first Death Star that R2-D2 had once helped secure, enabling her to switch a few wires in the firing mechanism, which reversed the polarity modes of the superlaser's fire controls, in essence setting the Tarkin to self-destruct should it ever fire its primary weapon."}, {"tag": "p", "text": "With their sabotage mission seemingly all but a failure, the Rebel team commandeered an unused transport and escaped from the Tarkin, but Vader ordered a pair of the battlestation's TIE Fighters after them in pursuit. The sudden arrival of Lando Calrissian in the Millennium Falcon helped the Rebels escape the TIEs, only to prompt Vader to enter the fray in pursuit of the Rebels in his own personal TIE fighter. The escaping Millennium Falcon managed to disable Vader's fighter but in doing so succeeded only in leaving both the Dark Lord and the fleeing Rebels in perfect firing sight of the Tarkin. Nord ordered the battlestation's ionic cannon primed, hoping to wipe out both Vader and the Rebels at once, but just as the Tarkin's superlaser completed primary ignition and the battlestation's gunners activated the firing mechanism, the Empire's superweapon testbed exploded."}, {"tag": "p", "text": "Leia Organa's tampering of the Tarkin's ionic cannon firing mechanism had set the superlaser to fire on itself. In a roundabout way, the Rebels' sabotage mission had been a success, and Organa single-handedly destroyed the same superweapon technology that had wiped out Alderaan. She and the Rebels escaped the Tarkin's destruction."}, {"tag": "p", "text": "The Tarkin detonated in a massively expanding fireball of burning fuel in all directions that was clearly visible in the skies of Hockaleg. The explosion instantly swallowed two nearby Star Destroyers and a dozen more smaller vessels, and released billions of debris fragments, as well as electromagnetic radiation interference that prevented any local ship-to-ship communications. The explosion's shockwave sent Vader's fighter tumbling away into space, although the Dark Lord narrowly avoided his own destruction in the battlestation's wreckage and was soon rescued by a stormtrooper from the Hockaleg spaceport. Vader reasoned that the Emperor was possibly already aware of the Tarkin's destruction and would likely express his displeasure at the loss."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The loss of the Tarkin did not quell the threat of Imperial superlaser technology, however. The Empire unleashed the second Death Star only months later during the Battle of Endor, and although this Death Star would suffer the same fate as the Tarkin testbed—destroyed by the Rebellion—the battlestation's superlaser performed successfully during the battle. Years later, in 10 and 11 ABY, the resurrected clone Emperor Palpatine took the two Eclipse-class warships for which the Tarkin had served as a ship-mounted superlaser testbed—the Eclipse and the Eclipse II—as his personal flagships in a failed campaign to destroy the New Republic. Both vessels, like the Tarkin, were eventually destroyed. In 12 ABY, the Hutt crime lord Durga Besadii Tai commissioned Bevel Lemelisk to construct yet another Death Star-like superweapon, the Darksaber, which was similar in principle to the Tarkin, although it too met the same fate as its predecessors."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Tarkin's core group of commanding officers included an alliance of men who had banded together to kill Darth Vader, the battlestation's commander-in-chief, in a plan originally formulated by Colonel Nord. They had grown tired of the Dark Lord's unforgiving nature and his tendency to kill their fellow officers for committing honest mistakes any Human would be prone to make. Unless they stopped Vader, they feared any one of them would be the next to meet one of Vader's dark-side executions. The group met within a secluded maintenance area near the bottom levels of the Tarkin to discuss their plan of action."}, {"tag": "p", "text": "The group of Imperial officers included General Biel; Captain Voal, who originally carried out Vader's command to remove all security personnel from the Tarkin's reactor area in preparation for Luke Skywalker's capture; and Nord, the man responsible for the failed attempt on Vader's life. From the bridge, Nord remotely opened an airlock near the reactor area during the Rebel infiltration, hoping to flush Vader out into space, but the Dark Lord's Force powers allowed him to survive. Vader realized Nord's treachery, but the Tarkin exploded, killing the group of insurrectionists before Vader could deal with them."}, {"tag": "p", "text": "Other officers serving aboard the Tarkin during the Rebel infiltration included an admiral stationed aboard the bridge. Vader commanded this admiral to ready his personal TIE fighter for launch to chase down Skywalker and the fleeing group of Rebels."}, {"tag": "p", "text": "During the Rebel infiltration, the stormtrooper named Berl was among a trio of soldiers guarding the Tarkin's exterior tractor beam generator. Chewbacca physically lifted Berl from the ground and threw the stormtrooper into the heart of the generator, blowing it."}, {"tag": "p", "text": "Additional stormtroopers patrolled Hockaleg's spaceport on the planet below, including troopers CT-4981, who left his post upon the Tarkin's destruction to search for survivors and recovered Vader; TK-813; and TK-529. CT-4981's duties included clearing shuttle flights to the Tarkin in orbit. Aside from enlisted military personnel, the Empire conscripted a number of Humans for ground operations at the spaceport. A sizable and motley construction crew of humanoids and other alien species—many of whom harbored disfavor for the Empire—also resided on the planet among the spaceport's spread of ramshackle structures while laboring on the Tarkin above. Each member of the construction crew wore green standardized uniforms. Skywalker and Leia Organa stole the uniforms of two construction crewmen, a laborer named Brunok and his partner, enabling them to intersperse among the construction crew and infiltrate the Tarkin. After witnessing the Tarkin explode in the skies above, many of the project's laborers revolted and ran amok of the Hockaleg spaceport, attacking the Imperial headquarters and the stormtroopers they encountered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tarkin superweapon was introduced into Star Wars canon in the story arc covering Marvel Star Wars comic issues 51 and 52—Resurrection of Evil and To Take The Tarkin—released in September and October 1981. Marvel Star Wars creators David Michelinie and Walt Simonson originally intended the Tarkin to be a second Death Star, but Lucasfilm forced them to change their story. Michelinie and Simonson were unaware upon the development of the Tarkin story arc in 1981 that Lucasfilm actually planned to feature a second Death Star in the film Star Wars: Episode VI Return of the Jedi come 1983. With no real explanation from Lucasfilm why they couldn't use a Death Star, Michelinie and Simonson simply changed their Death Star idea to a stripped-down flying cannon while keeping the same story. Eventually, they did learn that they had inadvertently stumbled upon George Lucas's same story idea for Return of the Jedi."}, {"tag": "p", "text": "The March 2003 article Who's Who: Imperial Grand Admirals, written by Daniel Wallace and Abel G. Peña for Star Wars Insider 66, connected the Tarkin's backstory with Grand Admiral Martio Batch destroying the planet Aeten II for the benefit of a stygium cloaking device, which serves as an explanation for how the Empire had access to stygium-type cloaking technology in the 1995 video game Star Wars: Rebel Assault II: The Hidden Empire, despite canonical evidence suggesting the contrary. In a June 2005 blog posting on StarWars.com, Wallace later called this link \"the retcon of retcons.\""}, {"tag": "p", "text": "In the November 2006 article Comic Marvels from Star Wars Insider 91, writer Jason Fry later picked the Tarkin story—Marvel issue 51, Resurrection of Evil—as the number one \"Anticipation\" story in the entire Marvel Star Wars comic run, because of its connection to a second Death Star, which wouldn't be realized until the release of Return of the Jedi nearly two years later."}, {"tag": "p", "text": "The events of Marvel issues Resurrection of Evil and To Take The Tarkin inspired the Ryder Windham short story Vader Adrift, published in the November 2011 Star Wars Insider Special Edition 2012 magazine, which introduced new developments involving Darth Vader immediately following the Tarkin's destruction."}, {"tag": "h3", "text": "Non-canon history"}, {"tag": "p", "text": "The eleventh issue of the Star Wars Adventure Journal, published November 1996, included a recurring department of the magazine entitled \"Fragments from the Mind's Eye,\" drawn by Pablo Hidalgo. This issue depicted a humorous scenario in which a number of previously destroyed Imperial superweapons up to that date in Star Wars canon—including both Death Stars, the World Devastator, and the Galaxy Gun, among others—are being sold at B'hob's Discount Superweapons. Featured among the junkyard of failed Imperial superweapons is the Tarkin battlestation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}