{"url": "Battle_of_Galidraan", "categories": ["Category:Legends articles", "Category:Battles in the Thanium sector", "Category:Battles of the Mandalorian Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Galidraan"}, {"tag": "p", "text": "The Battle of Galidraan was a conflict that led to the crippling of the True Mandalorians by the Jedi."}, {"tag": "h2", "text": "First conflict"}, {"tag": "p", "text": "The Governor of Galidraan had secretly been hiding the Mandalorian Death Watch splinter group on his world. He was also facing an insurrection by some of his colonists, so he hired the True Mandalorians under Jango Fett to eliminate the rebels, which they did. However, under the advice of the Death Watch leader, Tor Vizsla, he also informed the Jedi Council that a group of Mandalorians were murdering \"political activists.\""}, {"tag": "h2", "text": "Second conflict"}, {"tag": "p", "text": "A unit of Jedi under Master Dooku were dispatched to Galidraan; no sooner had the True Mandalorians completed their work for the governor than the Jedi arrived and ordered them to stand down, which Fett refused to do. This resulted in a bloody stand-off."}, {"tag": "p", "text": "As the battle commenced the Mandalorians switched to projectile weapons. Myles–Fett's aide-de-camp–decided to provide Fett with air support using his jetpack but a Jedi used Force Jump to reach him and cut him in half. This pushed Fett over the edge and resulted in him killing five Jedi with his bare hands. At the same time, Komari Vosa aggressively cut down scores of Mandalorians. Fett then confronted the Jedi who killed Myles. After Fett had thrown himself at the unknown Jedi they had a brief fight, which ended in the Jedi's death. Jango was then captured by Dooku and the remaining Jedi."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The casualties on both sides were heavy, with Jango being the only survivor out of at least three hundred Mandalorians. The Jedi handed Jango over to the Governor of Galidraan, and the Mandalorian was sold into slavery."}, {"tag": "p", "text": "Dooku would later reflect that \"It was a misguided mission from the start and not the first of the Council's poor decisions\" and was one of the main reasons he chose to leave the Jedi Order. About ten years before the Battle of Geonosis, a Mandalorian named Silas was captured by Count Dooku and tortured when he refused to provide information regarding Jango Fett. Eventually, he broke under the torment. After listening to his story, Dooku ordered Silas' death."}, {"tag": "p", "text": "In later years, the Battle of Galidraan would become used as a euphemism for a militaristic debacle, and in the aftermath of the Yinchorri Uprising it was used as an example by Finis Valorum of why the Jedi could not serve as the Republic's army."}, {"tag": "h2", "text": "Known Participants"}, {"tag": "h3", "text": "Mandalorians"}, {"tag": "h3", "text": "Republic"}, {"tag": "h3", "text": "Other"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was originally placed at 34 BBY in Open Seasons. Later, The New Essential Chronology placed it at 40 BBY, The Cestus Deception gave it an implied placement of around 43 BBY, and Jedi vs. Sith: The Essential Guide to the Force, The Official Star Wars Fact File and the Star Wars: The Ultimate Visual Guide placed it at 44 BBY while the Star Wars: The Ultimate Visual Guide: Special Edition placed it at 44 BBY and also made reference to \"two years before the Battle of Naboo\", which would mean 34 BBY. Two different dates (44 BBY and 41 BBY) were also given for the battle in the Star Wars Annual 2008. In addition, the databank article on Antidar Williams, written by a fan for a What's The Story? contest, places the battle several years after the 44 BBY Stark Hyperspace War. The Essential Atlas again places it at 44 BBY. Galaxy at War dates the end of the war (and therefore this battle) to 34 BBY, the first resource to corroborate the original dating. This article uses the 44 BBY date because a plurality of recent sources use it."}, {"tag": "p", "text": "The New Essential Guide to Characters states that the Jedi outnumbered the Mandalorians and that Jango Fett was not captured after the fight. Both statements are contradicted by other sources on the battle."}, {"tag": "p", "text": "While the True Mandalorian Silas offers to tell Dooku about this battle under torture, there's no evidence he was actually there, and circumstantial evidence, (such as a later statement by Dooku that every Mandalorian but Jango died there) that he was not."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}