{"url": "Taris_dueling_ring", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Rooms", "Category:Sporting venues", "Category:Taris locations", "Category:Tarisian culture"], "nodes": [{"tag": "h1", "text": "Taris dueling ring"}, {"tag": "p", "text": "The Taris dueling ring was an arena that featured sanctioned duels on the planet Taris. Travelers and residents alike were permitted to fight using weapons of choice to earn credits, as well as fame. The ring was a profitable business venture in the years leading up to and during the Jedi Civil War, offering spectating and gambling entertainment. During this time, it was owned by Ajuur the Hutt, and featured such famous duelists as Bendak Starkiller, Ice, Twitch, and Revan. Tickets to watch the matches were sold to patrons and gambling on the outcome provided a means of rewarding the winning duelists and grossing additional profit for management. However, in 3956 BBY, most of Taris was destroyed by orbital bombardment. Nevertheless, an arena was active on Taris during the Galactic Civil War after the Upper City had been rebuilt."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the cantina of the Tarisian Upper City, the Taris dueling ring was a battle arena where inhabitants of the ecumenopolis of Taris could duel to earn credits. The dueling ring was owned and fully-operated by the Hutt crime lord Ajuur, who had ties with Davik Kang, a prominent member of the Exchange crime syndicate. Ajuur personally arranged the fights and often sought match-ups that would be of highest interest to potential spectators. Even though it was sustained through its entertainment value, dueling was considered a viable sport by duelists."}, {"tag": "h3", "text": "Duels"}, {"tag": "p", "text": "Each match only consisted of two duelists who sparred until one was rendered unconscious. Each duelist was allowed to battle with any weapon of choice. Some competitors fought with blasters, blaster rifles and even grenades. Others, such as Marl, preferred vibroblades and vibroswords. Armor was permitted to be worn by duelists, and it was permissible for other aids, such as medpacs and stimulants, to be used as well. In spite of fighting with deadly weapons, there was an extremely low chance of death. Energy suppression fields covered the arena, specifically the ring itself. While the weapons still caused a measure of pain, the fields allowed for the competitors to only be knocked unconscious rather than being killed. In the event of serious injuries, medical droids were available on site. On the other hand, sanctioned death matches had been permitted in the past. These matches were banned by the Sith when they began their occupation of Taris."}, {"tag": "h3", "text": "Spectating"}, {"tag": "p", "text": "Inside the arena venue, spectators who purchased tickets watched the matches in-person. Tickets were purchasable in the cantina area through Ajuur. Since seating was limited, not all spectators were sold tickets and allowed into the venue. In the cantina area adjacent to the arena, viewscreens were set up for additional interested spectators to watch the fights free of charge if they did not have tickets. Monitors were also set up in other locations of the cantina. Gambling on the duels was permitted, if not encouraged, and provided significant business. All wagers were placed through Ajuur, who managed the gambling on the fights."}, {"tag": "h3", "text": "Winnings"}, {"tag": "p", "text": "The actual amount of credits a winner earned for defeating a competitor varied. Under Ajuur's ownership, the standard prize for winning a match was 10% of the profit from all the wagers. Winning duelists were paid directly, and losing duelists earned no reward. Since the reward was linked to gambling, a match that garnered more interest and wagers was more profitable for the winner."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Taris dueling ring was noted to have existed since the years following the Great Sith War. Over time it began to feature such prominent fighters as Bendak Starkiller, who boasted to have never lost a death match. Once the Sith Empire took control of Taris and death matches were outlawed, Starkiller went into retirement. During the Jedi Civil War, the number of duelists dropped. Following the destruction of the Endar Spire, Taris was blockaded by Darth Malak's ships, preventing all interplanetary travel. The dueling ring, like other establishments on Taris, suffered from this, as potential competitors were prevented from reaching the planet. There were still, however, a few remaining duelists actively competing. In 3956 BBY, when Revan and Carth Onasi crash-landed on Taris, Revan fought as a duelist by competing under the pseudonym Mysterious Stranger. The Mysterious Stranger defeated all competing duelists Taris had to offer including Marl, Ice and the Rodian Twitch, the reigning champion. By becoming the new champion, Revan earned a reputation that even extended into the Lower City."}, {"tag": "p", "text": "While Revan was fleeing Taris with his party, the Sith decimated the planet by orbital bombardment. Carth Onasi once spoke of Taris, noting that \"no building over two stories was left standing\". Large portions of the Upper City were rebuilt by 3 ABY, and a dueling ring was once again active in the rebuilt city. The ring featured a Gungan by the name of Twitch as its champion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Taris dueling ring first appeared in the 2003 video game Star Wars: Knights of the Old Republic. The player, as Revan, has the choice of competing in the dueling ring, though it is not required to successfully finish the game. Once the player has defeated all active duelists, they have the choice of battling the retired Bendak Starkiller in an illegal death match. However, accepting Bendak's challenge leads to the player gaining dark side points, and Revan is, canonically, light sided."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}