{"url": "Tarkin%27s_Will", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Imperial II-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Tarkin's Will"}, {"tag": "p", "text": "The Tarkin's Will, formerly known as the Fortitude, was an Imperial II-class Star Destroyer in the Imperial Navy. It served at the Battle of Yavin, where it was severely damaged by debris from the Death Star. Following the battle, the Fortitude was scheduled to be scuttled, but was rechristened as the Tarkin's Will  by the vengeful Imperial Commander Ellian Zahra, who took the vessel as her flagship."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Battle of Yavin"}, {"tag": "p", "text": "The Fortitude was an Imperial II-class Star Destroyer in service to the Galactic Empire's Imperial Navy during the Galactic Civil War. In 0 BBY, the Fortitude was present at the Battle of Yavin, where the young Rebel pilot Luke Skywalker destroyed the Empire's planet-killing superweapon, the Death Star. In the aftermath of the explosion, debris from the battle station struck the Fortitude, killing many. Although the ship survived, the damage to the hull was severe, leaving great scars running across its surface. After the battle, the ship was scheduled to be recycled and turned to scrap."}, {"tag": "h3", "text": "Hunting the Rebel Armada"}, {"tag": "p", "text": "Before the ship could be scuttled, it was handpicked by Commander Ellian Zahra to become her flagship following the Battle of Hoth. Zahra, who lost someone close to her on board the Death Star, chose the ship because of its history, hoping that its scarred surface would serve as a reminder of the crimes of the Rebel Alliance. Zahra filled the crew of the ship with others who had lost friends and family at Yavin. Renamed after the Grand Moff who held command of the Death Star, the Tarkin's Will would go on to serve Zahra as she hunted the remnants of the Alliance Fleet."}, {"tag": "p", "text": "Not long after the Battle of Hoth, Zahra cornered the Fourth Division of the Rebel armada at Rendezvous Point Delta-Three using a signal analysis protocol to pinpoint the enemy fleet's location. Commanding from the Tarkin's Will, Zahra led her forces in blockading the Fourth Division, trapping the rebels between a star and her assault group. The blockade was broken by the arrival of the Millennium Falcon, which destroyed one of Zahra's light cruisers and allowed the survivors of the attack to escape."}, {"tag": "p", "text": "Sometime later, the Tarkin's Will was successful in destroying the Rebellion's Sixth Division, leaving no survivors. Following the engagement, Zahra's second, Lieutenant Gorr, proposed repairing the ship's outer hull, unaware of its memorial significance. Commander Zahra chastised him aboard the bridge, informing him of the ship's past and then leading the crew in a rallying cry of remembrance for those they had lost. Zahra later intercepted transmissions from the Alliance Fleet's Seventh Division and began tracking their movements. As she reported her findings to Vader, the Sith Lord felt a disturbance in the Force on Tempes in the Outer Rim. She offered to have the Tarkin's Will provide assistance on his mission there, but Vader denied her, insisting that he would handle the matter himself. Instead, he commanded her to not let a single rebel ship escape their grasps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tarkin's Will first appeared in Star Wars 1, written by Charles Soule and illustrated by Jesús Saiz, released on January 1, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}