{"url": "Taris_survival_gloves", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gloves"], "nodes": [{"tag": "h1", "text": "Taris survival gloves"}, {"tag": "p", "text": "Taris survival gloves were a type of utilitarian glove produced by a galaxy-spanning corporation known as Czerka Corporation soon after the planet Taris was bombarded by the Sith Empire, at the order of the Sith Lord Darth Malak in 3956 BBY. The gloves were named after Taris in order to market the gloves' defensive protection, and were still in use by the year 3951 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A type of all-purpose glove, the Taris survival gloves were designed to provide their users with additional protection. The outsides of the gloves were a light-tan color, while the insides were brown in color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Taris survival gloves were created by the galaxy-spanning corporation known as Czerka Corporation shortly after the planet Taris was bombarded by the Sith Empire under the command of the Sith Lord Darth Malak, during the Jedi Civil War between the Galactic Republic and the Empire in 3956 BBY. Czerka named the gloves after Taris in order to prompt buyers into viewing the gloves' defensive properties as a good idea. By the year 3951 BBY, during a series of conflicts between the remnants of the Sith Empire and the Galactic Republic known as the Dark Wars, the gloves were well-liked and quite common, selling for prices around 150 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Taris survival gloves first appeared in Star Wars: Knights of the Old Republic II: The Sith Lords, a 2004 video game released by Obsidian Entertainment. In The Sith Lords, the gloves were a common item that could be found in randomly determined locations throughout the game, and because of this, it was not guaranteed to appear each time through the game. The gloves granted the player with a small bonus to all saves, which allowed the player to resist certain attacks. The gloves' description referenced the bombardment of Taris, which occurred during Star Wars: Knights of the Old Republic, the previous game in the series. The Taris survival gloves also received an entry in Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide by Prima Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}