{"url": "Battle_of_Garos", "categories": ["Category:Legends articles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Garos"}, {"tag": "p", "text": "The Battle of Garos occurred during the Galactic Civil War shortly after the end of the Thrawn campaign. The planet Garos IV was freed by the New Republic after years of intense local resistance against the Galactic Empire."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the death of Grand Admiral Thrawn, Alexandra Winger, a member of the Garosian resistance, was involved in a mission on the planet Sarahwiee with Luke Skywalker and the Page's Commandos. Alex Winger's actions brought Garos IV's situation to the attention of the New Republic which sent a fleet to Garos."}, {"tag": "p", "text": "In preparation of the New Republic invasion, Dark Jedi Jaalib Brandl was charged to oversee the evacuation of the Imperial dignitaries from the capital Ariana."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the beginning battle, Alexandra Winger and her adoptive father, the Imperial Governor of Garos IV were kidnapped by Brandl who decided to betray the Empire and kill the governor. Tork Winger was severely injured but Alex managed to convince the Dark Jedi to release them."}, {"tag": "p", "text": "The New Republic fought the outnumbered Imperial forces on the planet, with support of the Garosian resistance. The battle was short and damage to the planet was light. Matt Turhaya, Alex Winger's biological father was killed during the assault."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the battle, Garos IV joined the New Republic. A prisoner exchange took place a few weeks after the battle, allowing Dair Haslip to infiltrate the Imperial forces once again."}, {"tag": "p", "text": "The popularity of the University of Garos caused an economic upswing of the planet during following years."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}