{"url": "Tarnta%27s_Fang", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:CR90 corvettes", "Category:Slaver starships"], "nodes": [{"tag": "h1", "text": "Tarnta's Fang"}, {"tag": "p", "text": "The Tarnta's Fang was a modified CR90 corvette which was owned by Tarnta Bane, and operated by the Consolidations Unlimited slaving group. The Fang was always a clean, efficient, well-run vessel. Tarnta expected his men to keep their quarters clean and tidy, and to conduct themselves as professionally as possible - the fun of raids were never allowed to translate into sloppiness. The atmosphere of the ship reflected this attitude; the walls and floor glowed with a soft white light, and the corridors were free of debris with dirt and dust never being allowed to coalesce."}, {"tag": "p", "text": "The ship was modified from a regular Corellian Corvette to have 12 turbolasers, rather than the regular 6, and the storage areas were converted into prisoner pens, which could hold a maximum of two-hundred slaves. Additionally, it had a crew capacity of 50 people in total."}, {"tag": "p", "text": "The slave pens, in contrast to the rest of the ship, were dark, gloomy, and crowded. A few hours in them was enough to turn most prisoners into gibbering wrecks. Slaves were quickly taken to the dual holding floors, where they were chained to the wall and forced to crowd with hundreds of other prisoners. Food was distributed in buckets, with no provisions made for captives' hygiene, as Tarnta felt such conditions were useful for breaking a slaves' will. Before being presented to buyers, they were cleaned up and made presentable. Pens were split into upper and lower sections, and had a central catwalk dividing the floor down the middle. The shackles on the walls prevented slaves from reaching this catwalk. The slave pens were overseen by Nuubsal the Hutt, who maintained his rule through fear and force."}, {"tag": "p", "text": "The Fang was used by Tarnta to attack passenger ships; his general tactics were to use the turbolasers to take out the targeted ship's engines, then board the ship and either murder or kidnap anyone on board. It was on one of these missions that the ship was invaded by Cermack Rustill, J'rek de Mahdav, Ne Thruska, and Selnia Trigg, who incited a riot shortly before the ship crashed on the planet Darstell 4, where it crashed into the Imperial Governor's Palace."}, {"tag": "h2", "text": "Sources"}]}