{"url": "Tarong", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Outer Rim Territories species", "Category:Tarongs"], "nodes": [{"tag": "h1", "text": "Tarong"}, {"tag": "p", "text": "The Tarongs were large sentient avians from the twin worlds of Iri and Disim in the Epidimi system. Notably skilled mimics, Tarongs were typically talkative and friendly people. They were fond of space travel, gems, and protocol droids."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Tarongs were believed to be the descendants of prehistoric flying reptiles. However, both of their homeworlds hosted few reptilian species (other than small lizards) during historical times. They sported two wings, four legs, and long tails with a fan-shaped fin on the end. Their front legs had three-clawed feet which could be used as nimble hands, while their stronger, three-clawed rear feet were used for perching or to grasp and carry off prey animals. Their powerful wings spanned from ten to twenty meters, allowing them to fly at up to forty kilometers per hour."}, {"tag": "p", "text": "Tarong wings were thin, leathery membranes of skin supported by bone, with tufts of feathers on their undersides. Their bodies had thick, warty skin, ranging in color from olive green to reddish tan to brown, darkening with age. Tarong feathers were similar in color to their skins."}, {"tag": "p", "text": "Their feathered heads were dominated by large hooked beaks and dark yellow eyes. Tarong eyesight was particularly keen, extending into the infrared and working even in low light conditions. This helped them to hunt their prey, primarily small rodents and marsupials. (They were picky eaters, and found reptilian meat unpalatable.) Tarongs had acute hearing, but almost no sense of smell."}, {"tag": "p", "text": "Their preferred habitat was tropical to temperate forests. On their homeworlds, they lived primarily in the large trees of the equatorial rainforests. Though they could live in cooler regions, Tarongs would die in three hours if exposed to near-freezing temperatures."}, {"tag": "p", "text": "Tarongs had highly developed linguistic capabilities and vocal structures, making them natural mimics. They fell into mimicry naturally when talking to non-Tarong, quickly picking up their languages and imitating their voices. Conversation was omnipresent in Tarong culture: protracted conversations and storytelling were at the heart of their courtship rituals and their informal government. In fact, though they were carnivorous, they would not eat their prey without chatting with it for several minutes, since they would never eat anything that could talk back."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Tarongs lived in huts in forest canopies, with each family unit sharing a hut big enough for the entire family of four to ten Tarongs. Twelve to thirty families formed small tribes, informally led by the largest or longest-established family. Nearby tribes would visit each other once per season, holding meetings which lasted for days as each member reported at length on their activities and observations. An older Tarong, or one who had told the best tales at a previous meeting, would preside over the meeting. This honor was the closest the Tarong had to a formal political leadership position. Traditionally, this honor would not be given to the same Tarong for more than two successive meetings."}, {"tag": "p", "text": "Even though they were large carnivores, Tarongs were non-violent, greeting strangers as friends and only resorting to violence towards fellow sentients in defense of themselves or their families. Even then, the extent of their retaliation was typically to fly the offender to an inaccessible place and leave him or her there. (Of course, when they did this to non-Tarong who could not fly, this could still result in their opponent's eventual death.)"}, {"tag": "p", "text": "Tarongs did not wear clothing: in fact, they were frequently amused by the practice in other species. Despite this, they often wore ornamental belts, rings, necklaces, and other jewelry. The only wore full suits of clothing when visiting cold planets. These heating suits covered their entire body, except for their beaks, keeping their wings folded up inside."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Iri and Desim hosted nearly identical species when scientists from the Galactic Republic first visited their system circa 5000 BBY. The fact that the people of Iri and Desim were genetically nearly identical implied that the population of one of the worlds had been transported from the other in the distant past, but which one hosted the original Tarongs was never established. By the time of the Galactic Civil War, the two species had interbred extensively, making them a single hybrid people."}, {"tag": "p", "text": "After first contact with the Galactic Republic, the two Tarong species were introduced to one another and to galactic civilization. Two dozen Tarongs came with the scientists when the expedition returned, with many more following over the centuries. Many temperate worlds hosted Tarong clusters, and Tarongs frequently convinced visitors to take them out to explore the galaxy."}, {"tag": "p", "text": "Both Iri and Desim hosted spaceports, where the Tarongs traded their mineral wealth for ornaments, gadgets, and other trade goods. Jewelry was particularly prized, as were droids. Tarongs were particularly fond of protocol droids, with every village and many of the larger families having at least one. These talkative droids were particularly prized, since they would talk for hours with their masters. Tarongs treated protocol droids as honored guests and family members, keeping them in prime condition and decorating them with jewelry. Mining droids were also sought by some Tarong families, allowing them to extract more high-grade ore and set up regular trading relationships with offworlders."}, {"tag": "p", "text": "Aside from the introduction of droids, their lifestyle changed little after galactic contact. Though Tarongs who had traveled left the Epidimi system sometimes returned, filled with enthusiasm about the political structures and laws of another species, their attempts to lead a formal government led to little more than amusing tales to tell at the next seasonal meetings."}, {"tag": "p", "text": "When the Galactic Empire came to power, the Tarongs noted that Imperial representatives were unfriendly, not talkative, and seemingly cruel. They tried to keep contact with the Empire to a minimum. In fact, some Tarong families even established secret trading relationships with representatives of the Alliance to Restore the Republic during the Galactic Civil War. Some Tarongs even left their homeworlds on Rebel ships, seeking companionship and adventure. These Tarongs made excellent spies, able to survey locations from overhead and accurately repeat overheard conversations. Sk'rirak and her brother K'derek were among these Tarong Rebels. Though the Alliance welcomed the assistance of the Tarongs, they remained fearful of an Imperial crackdown in the Epidimi system which would destroy the semi-anarchic Tarong society."}, {"tag": "h2", "text": "Sources"}]}