{"url": "Taroon", "categories": ["Category:Legends articles", "Category:Males", "Category:Royalty", "Category:Rutanians"], "nodes": [{"tag": "h1", "text": "Taroon"}, {"tag": "p", "text": "Taroon was a male Rutanian and the son of King Frane of Rutan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The laws of Rutan and Senali made the kings of the planet and the moon exchange their firstborns when they were seven years old in order to avoid a war. Taroon wanted to be the king instead of his brother, but his father saw him as the clumsier and weaker of his sons. When Leed insinuated that he wanted to stay on Senali, Taroon drew up a plan. He knew that it would be an argument between Frane and Leed. He hired some Rutanians, either some close friends or individuals who would benefit if he were to become king, to kidnap his brother and act as a marginal clan on the moon, in order to make everyone think that Leed was the leader of this clan. Then, he planned an attack with tracker droids against Frane's neks, in order to blame Leed. This would have caused the threat of war to become apparent, although he did not think that actual conflict would occur. The fight would make Leed stay on Senali, and Taroon the only successor on Rutan."}, {"tag": "p", "text": "However, his father called in Jedi assistance to bring Leed home. Through some complications, Qui-Gon Jinn was able to deduce that Taroon was behind all the strange events and confronted him at his school. But when Taroon revealed that he had dispatched the tracker droids to attack, he learned that Drenna had decided to stay on Rutan and was tending to the nek kennels. After thwarting the attack, Taroon confessed his conspiracy to his father and apologized to Drenna for putting her in danger, as he had believed the kennels to be abandoned. Finally, King Frane accepted Leed's wish to stay on Senali and agreed with Taroon to name him as the future King of Rutan, remarking that his conspiracy reminded him of his mother. He later fell in love with Drenna."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}