{"url": "Tarnta_Bane", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Humans", "Category:Males", "Category:Pirates", "Category:Slavers"], "nodes": [{"tag": "h1", "text": "Tarnta Bane"}, {"tag": "p", "text": "Tarnta Bane was an opportunistic smuggler who formed the slaving group Consolidations Unlimited. He took advantage of the chaos caused by the Galactic Civil War, and gathered a small army of equally ruthless scum to carve out his own little criminal empire. He was an anomaly among the slaving community; he was a jovial, boisterous man who genuinely liked people. The ethical connotations of his job never hit him, and he didn't let the abject misery of others get in the way of his good time. He enjoyed seeing his men happy and put his business associates at ease with his boyish charm and easy smile. Even his slaves are given friendly treatment by him (though the same can't be said for other members of Consolidations Unlimited); he treated his profession like some kind of big game in which his victims were the losers, often he would even smugly say \"better luck next time, big guy!\". His jocularity should not be confused with frivolousness, however, as he would kill anyone who crossed him with the same glee he exuded over the rest of his life."}, {"tag": "p", "text": "Tarnta was known to fly aboard his starship, the Tarnta's Fang, and would accompany his crew aboard ships which were disabled. On one such occasion, when he was boarding the Shining Comet, he met personally with Cermack Rustill thinking that, because he was an Endomorph, he would make a better slave, going as far as calling him their \"prize\". It is likely that, if he had known Cermack was planning to take down his operation, he would have shot him on the spot. Instead Cermack was taken to the slave pens aboard the Fang and held prisoner by Nuubsal the Hutt. When Cermack incited a riot among the slaves Tarnta immediately led a team down to quell it. Unfortunately, as soon as this happened, the ship dropped out of hyperspace unexpectedly, crash landing on the planet Darstell 4. Although Governor Bellows attempted to have him killed, Tarnta managed to escape into the city of Symt, where he escaped off planet and swore revenge on the group of rebels who caused him to lose his prize ship."}, {"tag": "h2", "text": "Appearance"}, {"tag": "p", "text": "Tarnta dressed in no-nonsense clothing designed for close combat fighting. He carried twin blasters stuffed into his belt like a pirate and had a wrist communicator attached to his right arm at all times. His black hair was tied back in a pony-tail and his eyes flashed with a deep-set love for his job."}, {"tag": "h2", "text": "Sources"}]}