{"url": "Battle_of_Garel", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles in the Lothal sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Garel"}, {"tag": "p", "text": "The Battle of Garel was a battle fought during the Galactic Civil War in 3 BBY when the armed forces of the Galactic Empire launched an attack against Phoenix Cell on the Outer Rim planet of Garel. The Empire learned of the rebellion's location in the Garel City Spaceport after Ezra Bridger, a Padawan in the rebellion, was overheard talking about the rebels' location. Agent Kallus of the Imperial Security Bureau and Admiral Kassius Konstantine of the Star Destroyer Relentless led the assault against the rebels, while the Inquisitors known as the Seventh Sister and the Fifth Brother sought out Bridger and his master, Kanan Jarrus. At least one rebel transport was downed and destroyed  during the rebellion's retreat from Garel, but, due to the piloting of Captain Hera Syndulla of the Ghost, the Empire's tractor beam was disabled and the Phoenix Cell was able to escape from the planet and into hyperspace."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Duel in Hammertown, the two Inquisitors known as the Seventh Sister and the Fifth Brother discovered that the rebellion had a presence on the planet Garel. The Inquisitors shared this information with the Imperial Security Bureau Agent Kallus and Admiral Kassius Konstantine. Kallus, who was a perennial opponent of the Spectres, urged the different Imperial officials to work together to crush the rebels. He then ordered Admiral Konstantine to redeploy the Imperial fleet from Lothal to Garel. Prior to the planned assault, the Imperial authorities on Garel withdrew their stormtrooper patrols in Garel City in order to lull the rebels into a false sense of security."}, {"tag": "p", "text": "The planned Imperial attack on Garel was preceded by an uprising in an Imperial prison. Ephraim and Mira Bridger, the parents of the Jedi rebel Ezra Bridger, had been inspired by their son's broadcast earlier to launch a prison breakout. The prison uprising succeeded in freeing many prisoners, including former Lothalian Governor Ryder Azadi, but the Bridgers were killed during the escape. Meanwhile, on Garel, Ezra experienced a Force vision of his parents and the impending Imperial attack."}, {"tag": "p", "text": "Ezra informed the rebel leaders Hera Syndulla and Kanan Jarrus about his vision. Hera and Kanan, who had just received news about the prison uprising on Lothal, decided to tell Ezra what Tseebo had shared with Hera earlier. Tseebo had told Hera that Ezra's parents were imprisoned within a network of Imperial prisons, but they were unsure which one it was. Hera later informed Ezra that Commander Jun Sato's contact in the Core had sent him news of a mass breakout from an Imperial prison the night before, and Ezra realized that due to his vision, his parents were likely involved. After scanning a list of prisoners involved in the escape with the Force, Ezra picked out \"Prisoner X-10.\" The Empire had deleted the prisoners' names and faces, so they did not know that this prisoner was Governor Azadi."}, {"tag": "p", "text": "Believing that the prison uprising and his Force vision were related, Ezra decided to travel to Lothal. After Sabine Wren received intelligence that the Imperial fleet above Lothal had departed, the Spectres made preparations to leave Garel. While shopping for supplies, Garazeb Orrelios and Chopper reported that they had not encountered any patrols. However, Sabine, as a former Imperial cadet, knew that the Empire always withdrew their patrols prior to a military operation, and rightfully suspected that an Imperial assault on Garel was imminent."}, {"tag": "h2", "text": "Assault on Garel"}, {"tag": "p", "text": "Zeb and Chopper shortly found themselves pursued by a stormtrooper patrol. Meanwhile, a fleet of Star Destroyers arrived over Garel City. While waiting for Zeb and Chopper to return, Hera ordered Sabine to slice their jamming system in order to hamper the Imperials' efforts to locate the rebel ships. Zeb and Chopper managed to reunite with Kanan and Ezra in their hangar bay but were forced to fight off several stormtroopers led by Agent Kallus himself. Giving into his rage, Ezra used the Force to hurl Kallus against a wall."}, {"tag": "p", "text": "Kallus was followed by the Fifth Brother and the Seventh Sister, the latter of whom attempted to goad Ezra into a lightsaber duel. Before Ezra could respond, Kanan used the Force to shoot out the blast door controls, closing it in front of the Inquisitors. Reunited, the Spectres boarded the Ghost and managed to fight off a group of stormtroopers. Once airborne, Hera gave orders for Phoenix Squadron to abandon Garel. As the rebel fleet fled into the skies of Garel, Admiral Konstantine ordered his crew to prepare a tractor beam to intercept the rebel ships. At least one rebel ship was also hit by an Imperial laser blast and crashed into the streets of Garel."}, {"tag": "p", "text": "Phoenix Squadron Commander Jun Sato and Rex's CR90 corvette Liberator was intercepted by Konstantine's Star Destroyer Relentless and trapped by the warship's tractor beam. Meanwhile, Hera instructed Kanan, Ezra, and Chopper to leave for Lothal on the Phantom. The Phantom then took advantage of a momentary gap in the Imperial formation to flee into hyperspace. Meanwhile, Hera responded to Sato and Rex's distress call by flying the Ghost towards the Relentless in an attempt to knock out the tractor beam projector."}, {"tag": "p", "text": "Just as Sabine had acquired a torpedo lock on the tractor beam projector, a TIE blast knocked the ship out of alignment before she could fire. Undaunted, Hera then undertook a dangerous maneuver which involved ramming the Ghost against the projector, knocking it off the Relentless' hull. The projector then collided with a TIE fighter. With the Liberator free, the Ghost and the Phoenix rebel fleet was able to jump into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite their efforts, the Galactic Empire failed to capture most of the rebel fleet hiding on Garel. Most of the Phoenix rebel fleet managed to escape into hyperspace. However, the rebels also suffered serious losses including at least one ship. Upon learning about the Phoenix rebels' losses, Alderaanian Senator and rebel leader Bail Organa sent his adopted daughter Princess Leia Organa to deliver three Sphyrna-class Hammerhead corvette to reinforce the Phoenix forces. In order to hide Alderaan's links to the rebels, Leia arranged for the Spectres to steal the ships on Lothal."}, {"tag": "p", "text": "Meanwhile Ezra, Kanan, and Chopper managed to find Prisoner X-10 on Lothal and learned that he was Governor Azadi, a friend of Ezra's parents. From Azadi, Ezra learned about the deaths of his parents and was able to make peace with his past. Reuniting on Lothal, the Spectres then joined forces with Princess Leia and Azadi to steal the Hammerhead corvettes from an Imperial depot on Lothal."}, {"tag": "p", "text": "In 2 BBY, before Grand Admiral Thrawn attacked Atollon, Ezra mentioned the assault on Garel as they received the warning about the Imperial fleet leaving Lothal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle on Garel first appeared in the Star Wars Rebels episode \"Legacy,\" which premiered on Disney XD on December 9, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}