{"url": "Tarr_Seirr", "categories": ["Category:Legends articles", "Category:Cereans", "Category:Jedi Watchmen", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Tarr Seirr"}, {"tag": "p", "text": "Tarr Seirr was a male Cerean Jedi Knight who fought in the Clone Wars against the Separatists. Raised by the Jedi Order, he became a Jedi Watchman for his home system Cerea, and helped advise the planet's government during the Separatist Crisis. When the Clone Wars broke out, he was transferred from Cerea to fight alongside his long-time idol, Jedi Master Ki-Adi-Mundi. In 22 BBY, he was selected to be a part of the elite task force sent to destroy a droid factory of the Confederacy of Independent Systems in planet Hypori. However, the Republic fleet, which carried the Jedi and their clone troopers, were blasted out of the sky before they could even land. Only Seirr and five other Jedi managed to survive the crash landing, but they were quickly surrounded by a droid army under the command of General Grievous. After the remaining Jedi took a shelter from one of the crushed assault ships, Grievous ordered the droid forces to stop, and personally entered hand-to-hand combat with the trapped Jedi warriors. During the fight, Seirr tried to strike Grievous from behind, but he was grabbed by the cyborg general's clawed foot and crushed to death, then thrown into the wall of the ruined assault ship along with Aayla Secura"}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet Cerea and raised by the Jedi Order, the Cerean male Tarr Seirr always idolized Ki-Adi-Mundi, a Cerean Jedi Master and a member of the Jedi High Council who served as the Watchman for the Cerean Quadrant for decades. After passing his Trials of Knighthood, Seirr was elevated to the rank of Jedi Knight. During the growing Separatist Crisis, members of the Council found themselves too occupied, and Mundi relinquished his position as Watchman to Seirr. Shortly before the Clone Wars, when Cerean government indicated the planet's uncertainty to officially side with the Galactic Republic, Seirr advised the Cerean government to join the Republic to prevent the planet from falling to the Separatists of the Confederacy of Independent Systems. However, Cerea ultimately chose neutrality during the war."}, {"tag": "h3", "text": "Attack on Hypori"}, {"tag": "p", "text": "When the Clone Wars broke out in 22 BBY, the Jedi Watchmen were scattered to different battlefront locations, and Seirr was reassigned from Cerea to a strategic battlefront location. He was secretly reluctant to depart from his homeworld, as the planet was left susceptible to danger of the Separatist invasion, but nevertheless obeyed the order and left Cerea."}, {"tag": "p", "text": "As the Clone Wars raged on, Seirr had a chance to fight alongside his role model, General Ki-Adi-Mundi. Around 22 BBY, Jedi General Daakman Barrek uncovered a massive CIS droid factory on planet Hypori. An elite task force, consisting of Barrek and his Padawan Sha'a Gi, along with Seirr, and Jedi Generals Ki-Adi-Mundi, Aayla Secura, Shaak Ti and K'Kruhk were dispatched to the planet to destroy the factory, reinforced by an army of clone troopers of the Grand Army of the Republic. However, the mission turned out to be a disaster; as the Republic ships emerged from hyperspace, Confederacy's orbital mines caused the majority of the transports to crash to the planet, and straight behind the Separatist's lines. Seirr and the other Jedi survived the landing, but nearly all clone troopers were killed. The situation rapidly grew worse when the survived troopers were surrounded by a massive droid army that was stationed on the planet under the command of the Supreme Commander of the Droid Armies, General Grievous. During the ensuing fight, Seirr received a wound on his left arm, Barrek was killed by Grievous, and all remaining clone troopers were shot by droid forces. Separated from other survivors and chased by B2 super battle droids and OG-9 homing spider droids, Seirr and Ki-Adi-Mundi tried to retreat on one of the crashed cruisers. Grievous, who wanted to slay the Jedi personally, ordered the droid army to halt, while Seirr and Mundi ran inside the wrecked ship, where they reunited with the other Jedi. Moments later, Grievous told the survivors to prepare to meet a \"warrior's death\", and started to move toward the wreckage."}, {"tag": "h3", "text": "Final duel"}, {"tag": "p", "text": "Inside the ruined ship, the Jedi activated their lightsabers, preparing to face off against the cyborg general. However, scared by the approaching threat, Padawan Sha'a Gi mentally broke, and rushed out of the ruins. Grievous quickly crushed him on earth, killing him, and hid inside the ship. The remaining Jedi backed off in the center of the cruiser, but were suddenly attacked by the reemerging Grievous, who leaped from shadows in the middle of the Jedi. Although the Jedi hunter was surrounded, he managed to hold his own during the duel. Grievous soon gained the upper hand, and after striking Seirr and the rest of the Jedi away, he severely wounded K'Kruhk, who fell unconscious. Shaak Ti then used telekinesis to throw scrap metal against Grievous, while Seirr tried to defeat the general by striking him in the back. However, Grievous blocked the metal with his lightsabers, and after noticing Seirr, grabbed the Jedi Knight's head with his cybernetic foot, and crushed Seirr's head against the ground, killing him. He then threw the lifeless body of Seirr against the roof along with injured Aayla Secura."}, {"tag": "p", "text": "Only Ki-Adi-Mundi and a severely wounded Shaak Ti, Secura, and K'Kruhk survived the engagement. Later on, Seirr's fears transpired to be reality when unprotected Cerea became a battleground as Republic and Separatist forces fought to claim its allegiance. As a result, much of the serene wilderness of the planet was despoiled in the fighting, and many Cereans were killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Raised by the Jedi Order, Tarr Seirr strongly believed in the Jedi cause. He respected the Jedi Code, even when it meant to leave something important behind; when he was assigned to a more tactical location from his homeworld Cerea, he hid his reluctance of leaving the planet to a danger and obeyed the assign. He was very fond for Cerea, and didn't want it to join the Separatist cause."}, {"tag": "p", "text": "Seirr greatly revered Jedi Master Ki-Adi-Mundi, and when he relinquished his position as Watchman to Seirr, the young Cerean took the role very seriously, and helped advise the ruling Cerean government during the Separatist threat. During the Battle of Hypori, Seirr asked Mundi's advice during their retreating, and stayed close to the Jedi Master even inside the shelter; when Mundi tried to stop Padawan Sha'a Gi for bolting, Seirr was the first Jedi who followed the Cerean Jedi Master. Seirr was seemingly nervous when General Grievous approached, but didn't later hesitate to attack the cyborg."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A Jedi Knight, Seirr was an accomplished swordsman, his skill with a blade rivaling many Jedi Masters. Favoring Form 4, Ataru, Seirr proved to be an adept duelist, and because of this, as well as his Cerean heritage, he was selected to succeed Ki Adi Mundi as the Jedi Watchman of the Cerea System."}, {"tag": "p", "text": "Even with the combined strength of him and the four Jedi generals, however, he was unable to defeat Grievous, who blocked and dodged the lightsaber strikes of the Jedi and ultimately killed him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tarr Seirr was a character created for Star Wars: Clone Wars, where he was voiced by Daran Norris. In the episode 20, he was only credited as Warrior #3. Much of his backstory was later written on the official Star Wars Databank. He also appeared in a mobile strategy game Star Wars: Battle for the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}