{"url": "Battle_of_Garqi", "categories": ["Category:Legends articles", "Category:Battles in the Tadrin subsector", "Category:Battles of the Yuuzhan Vong War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Garqi"}, {"tag": "p", "text": "The Battle of Garqi was a battle in the Yuuzhan Vong War."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Going on a reconnaissance mission to Garqi, a Yuuzhan Vong-controlled world, Jedi Knights Corran Horn, Ganner Rhysode, and Jacen Solo arrived in the Lost Hope, a frigate that was rigged to explode. They, along with six Noghri commandos entered the Best Chance, a smaller vehicle inside the Lost Hope. The Lost Hope exploded above Garqi, raining debris, including the Best Chance, which was supposed to look like a piece of debris. The Best Chance made it to the planet, where the Jedi met up with resistance fighters against the Yuuzhan Vong."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Jedi and Noghri waited in underground tunnels beneath a plaza in the Wlesc neighborhood where the Yuuzhan Vong forces were assembling, and used their holovision goggles to get a better view of the streets. The Human slaves, called Thrall, then ambushed the Yuuzhan Vong force, and the battle started. The Noghri started to slice through the Chazrach, while the Jedi faced the Yuuzhan Vong warriors. Ganner Rhysode killed the first Yuuzhan Vong warrior, but another issued a command to the slaves, Human and Chazrach, which turned to face the Jedi."}, {"tag": "p", "text": "The Jedi started slaughtering the slaves, and Corran Horn managed to kill the lead warrior, while focused sniper fire from resistance fighters killed the third. The Jedi then escaped to the nearby Pesktda Xenobotanical Garden, where Ithorian Bafforr trees were housed. The Yuuzhan Vong entered the Garden. The leader warrior, named Krag Val, challenged Corran, but Ganner stood in front of him, and the Noghri Mushkil stood in front of Ganner, although the Noghri was killed. Ganner then attempted to engage the Yuuzhan Vong leader, but Krag Val's amphistaff came down, and left a huge gash on Ganner's face."}, {"tag": "p", "text": "Jacen Solo engaged Krag Val, and managed to temporarily disable him until Corran Horn came. But by the time Corran engaged the warriors, their armor had gone under an allergic reaction to the Bafforr tree pollen, and suffocated the warriors. Samples were taken of the pollen, and the garden was burned, along with the warriors. The Jedi and Noghri returned to the Best Chance, and the resistance fighters chose to stay behind."}, {"tag": "p", "text": "The Ralroost arrived in system with Rogue Squadron, one of the pilots being Jaina Solo. Their plan was to pick up the Best Chance, but a huge Yuuzhan Vong force arrived in the area. Rogue Squadron fought the coralskippers, but the Best Chance was being overrun. At that time, Admiral Pellaeon arrived in-system with the Chimaera. The Chiss Clawcraft engaged and overran the coralskippers, while the Star Destroyers engaged the enemy capital ships, destroying a Yuuzhan Vong corvette. This gave the New Republic time to flee, along with the Imperial forces and a large refugee fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}