{"url": "Task_Force_99", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial Army squads", "Category:Imperial Special Forces units", "Category:Stormtrooper units", "Category:Task Force 99 members"], "nodes": [{"tag": "h1", "text": "Task Force 99"}, {"tag": "p", "text": "Task Force 99, also known as SCAR Squadron, was an elite Imperial stormtrooper squad led by Sergeant Kreel. One of their missions was to investigate Sunspot Prison, an installation that was recently abandoned by the Alliance to Restore the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early service"}, {"tag": "p", "text": "Task Force 99 was formed at least two years before the skirmish on the Ghost Moon, where it served under the command of a sergeant, until it was eventually placed under the command of Sergeant Kreel."}, {"tag": "h3", "text": "Hunting rebels"}, {"tag": "p", "text": "Days after the assault on Sunspot Prison, Task Force 99 arrived to the deserted station as they were tasked with tracking down Kolar Ludd. As members of the squad were unsure of what to do next, Kreel informed them that their current mission did not matter anymore, as they had just received new orders."}, {"tag": "p", "text": "The squadron was able to capture Rebel Admiral Verette. They killed him and strapped him to the front of a Taylander shuttle as a distraction while they boarded the Rebel-held Star Destroyer Harbinger. Ultimately they failed to stop the Rebels from breaking the Siege on Tureen VII, although they captured the protocol droid C-3PO."}, {"tag": "h3", "text": "The hunt continues"}, {"tag": "p", "text": "The squad later captured the smuggler Sana Starros, and tortured her for the location of Leia Organa's team, tracking them to Hubin. Upon landing, they were met by Thane Markona of Clan Markona. Markona insisted they take advantage of his hospitality, and Kreel agreed to duel Luke Skywalker. Markona decided to assist the rebellion, distracting SCAR Squadron while the Clan and Organa's team escaped in SCAR Squadron's shuttle. They were then stuck there for months, as Hubin was an isolationist moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Task Force 99 was named after Clone Force 99, also known as the Bad Batch. Both squads were comprised of members, of which each had a specialization, making them distinct to others in their particular corps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}