{"url": "Tash_Arranda/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:We're Doomed!", "Category:Alderaanians", "Category:Females", "Category:Humans", "Category:Jedi Knights of the New Jedi Order", "Category:New Republic individuals", "Category:Sentientologists"], "nodes": [{"tag": "h1", "text": "Tash Arranda"}, {"tag": "p", "text": "Tash Arranda was a Force-sensitive Human female from Alderaan who survived the destruction of her homeworld and later became a Jedi of the New Jedi Order. She was the daughter of Milessa and Kalf Arranda and the older sister of Zak Arranda."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Tash and her younger brother, Zak Arranda, were born on Alderaan. Tash had very few friends on Alderaan; she was considered odd, due to her habit of finishing others' sentences. At some point, she began accessing the HoloNet, where she learned of the Jedi after some information was uploaded onto the galactic communication service. Despite study of the Jedi Knights being illegal under the rule of the Galactic Empire, Tash searched through library databases from her desk computer in order to find out more about the nearly forgotten Jedi Order. After breaking through the code, she learned more about the order from an individual on the HoloNet who went under the name of ForceFlow."}, {"tag": "p", "text": "Sometime later, both Tash and her brother embarked on a field trip off planet for two weeks. However, during that time, the Empire deployed their Death Star I battle station which destroyed Alderaan, killing everyone they had known, including their parents, friends and neighbors. Both children were later adopted by their Shi'ido uncle, anthropologist Mammon Hoole, who was only related to them because his brother married the Arrandas' Aunt Beryl. They accompanied Hoole and his research droid, DV-9, on his adventures as he studied the sapient races of the galaxy. In the first six months of this journey, Hoole never told the children about their destinations or even his first name. During this time, he also had his personal research droid DV-9 tutor the children in various subjects."}, {"tag": "h3", "text": "Project Starscream"}, {"tag": "p", "text": "One of their earliest adventures was an expedition to the planet D'vouran, though Hoole never told Tash or her brother of the destination. While she was pretending that she was a Jedi pilot fighting Imperial pilots, the Lightrunner came out of hyperspace early and nearly crashed on the planet. However, Hoole managed to land the ship though it was badly damaged in the process. They attempted to gain the aid of the native Enzeen that inhabited the planet's surface. During their time there, Tash got a bad feeling that something was watching them, and she did not entirely trust the Enzeen. However, neither Hoole nor her brother believed her. Hoole later planned to leave the children in his droid's care while he went to conduct some research, but Tash, her brother and DV-9 found themselves taken hostage by the criminal henchmen of Smada the Hutt, who wanted to make use of Hoole's shape-changing abilities in order to serve as his assassin. When Hoole refused, Smada ordered his Gank killers to vaporize the Arrandas, but they were stopped by the intervention of the Heroes of Yavin. While they helped Hoole repair the ship, Tash confessed to Luke Skywalker that she received strange \"feelings\" at times of danger though dismissed them. He counseled her by saying that she should trust her feelings. This led to her examining information on the Misanthrope on the HoloNet from the Millennium Falcon's computer. During her search, Imperial forces attempted to track down her signal but after Skywalker told her, she shut the computer down to prevent her from being traced. At night, she and her brother stayed at one of the Enzeen's homes under the supervision of DV-9. During the night, she heard strange noises, but she only found Chood, who claimed it was stray animals. When she returned to her room, she found one of Smada the Hutt's henchmen attempting to abduct her sleeping brother. They managed to escape the Ganks and fled to the Don't Go Inn, where they were sheltered though no one believed their claims of the Hutt's henchmen. This led to Hoole telling Tash that her obsession with the Force was going too far and that she needed to stop fixating on it, something that disheartened her. Later, her brother was nearly killed by Smada but was saved by Hoole's intervention. At this point, she accompanied the seemingly crazy hermit known as Kevreb Bebo. He led her to an abandoned Imperial lab and told her that all of his companions had mysteriously disappeared. He gave her a pendant that he believed prevented him from disappearing as well. She left the lab and was subsequently captured by Smada, who wanted to use her and Zak to draw Hoole out of hiding. They were later rescued and escaped D'Vouran."}, {"tag": "p", "text": "The children were Force-sensitive, and briefly encountered Jedi Master Yoda on Dagobah shortly before the Battle of Hoth. They also met Luke Skywalker, Princess Leia Organa, and Han Solo. While practicing with the Force, she found out that when she was angry she was more powerful. She found herself upset to discover Hoole once worked for Gog."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "Both of the Arrandas received university training after the threat of the Empire had lessened and became anthropologists themselves. They also attended the Jedi Praxeum for a time before Hoole moved them to an undisclosed location."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "She did not have much interest in zoology, but was more interested in learning about Jedi lore. Ever since she learned of the Jedi, she sought to learn more about them, as well as to meet one and even become a Jedi someday. Generally, she considered herself a good student though the science subjects were not her favorite to study. She had some difficulty making friends with children her own age on her homeworld, as they believed her to be weird. This stemmed from her always finishing other people's sentences or making predictions on when a pop quiz was going to be held and even getting strange feelings about different things. The last of those three tended to be events that were sad or frightening, such as knowing that her parents were killed despite being light years away from the incident."}, {"tag": "p", "text": "She was determined to set herself as an example for her younger brother to follow. Whenever she was reminded of or attempted to remember her homeworld, she wanted to cry but refrained from doing so, as she believed that being the elder sibling gave her a duty to uphold to her younger brother. As such, she felt that she had to make things easier for Zak, but she still missed her parents terribly. After her parents were killed, for a time she felt lost and alone to the point that she believed she might have gone crazy. However, the focus on looking after her younger brother made her determined to not lose anyone else in her life. Following the destruction of Alderaan, Tash hated playing an Imperial pilot in holographic games due to their part in the destruction of her homeworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}