{"url": "Tarsus_Valorum/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Coruscanti", "Category:Diplomats", "Category:House Valorum", "Category:Humans", "Category:Males", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Tarsus Valorum"}, {"tag": "p", "text": "Tarsus Valorum was the Supreme Chancellor of the Galactic Republic during and immediately following the conclusion of the New Sith Wars and was responsible for enacting the Ruusan Reformations that reconstructed the entire Republic. A member of the politically influential House Valorum of Coruscant, Valorum became the first Supreme Chancellor who was not a member of the Jedi Order in over four centuries. The New Sith Wars ended during his term, and Valorum devised and implemented both the Ruusan Reformations and the Unification Policies, a series of reforms that dissolved both the Republic Military and the Jedi Order's Army of Light while decentralizing the Republic's power. As a result of the reforms, Valorum became known as the man who reunited the galaxy."}, {"tag": "p", "text": "After his second term as Supreme Chancellor ended, Valorum remained an ambassador for the Republic, visiting many worlds in an attempt to re-establish their ties to the Republic and to improve galactic relations with non-Republic planets. One of the more prominent cases of his ambassadorship occurred when he survived a kidnapping attempt on Serenno by the Anti-Republic Liberation Front, which was secretly being aided by Darth Zannah and the Order of the Sith Lords. Valorum was saved by Johun Othone, a Jedi Knight serving as his advisor. To repay Othone for saving his life, Valorum agreed to a request made by Othone and petitioned the Galactic Senate for funds to create a memorial for the Jedi who died battling the Sith Brotherhood of Darkness during the last battle of the New Sith Wars. Valorum secured the funds and Othone, before the latter's death at the hands of the Sith, constructed what became known as the Valley of the Jedi on Ruusan."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Tarsus Valorum was a Human male born circa 1050 BBY on Coruscant, the capital of the Galactic Republic, as a member of the politically influential House Valorum. During the final days of the New Sith Wars, a galaxy-wide armed conflict between the Jedi Order and the Sith Brotherhood of Darkness, Valorum was a candidate for the office of the Supreme Chancellor of the Galactic Republic. Though Jedi Master Valenthyne Farfalla was in line to take the position, the Jedi declined in order to fight with the Army of Light during the Ruusan campaign, the last campaign of the war. With Farfalla out of the running, Valorum was elected as the first non-Jedi Chancellor in over four hundred years. It was during that period that Valorum began formulating ideas for the decentralization of the Republic's government."}, {"tag": "h3", "text": "Ruusan Reformations"}, {"tag": "p", "text": "In 1000 BBY, the New Sith Wars came to a close with the destruction of the Sith during the Seventh Battle of Ruusan. Both the Republic's citizens and the Galactic Senate were eager to put the war behind them. To this end, Valorum expanded his ideas for Republic decentralization and devised a series of Republic-wide reforms that he called the Ruusan Reformations, named for the battle that had ended the New Sith Wars. These reforms included changes to how the Jedi Order operated within the Republic. Because Valorum saw the creation of the Army of Light as a reaction to the Brotherhood of Darkness, he felt that it or any other Jedi military force was no longer required. The Jedi High Council would also operate under the supervision of the Republic's Judicial Department. At their core, the reforms were meant to unify the Republic and end the cycle of wars that had faced the galactic body for centuries."}, {"tag": "p", "text": "Outside of Jedi affairs, Valorum also reorganized the millions of sectors within the Republic to one thousand twenty-four, believing that such a re-organization would allow better representation in the Galactic Senate. Hoping to curb corruption and decentralize power away from powerful Core sectors that held the most influence, Valorum confined representation to those sectors, with a few exemptions made for politically powerful Core Worlds. Other slots, such as those for species and cultural entities, were also granted. One such reform allowed \"functional constituencies,\" which came to include entities such as corporations, to be granted Senate delegations."}, {"tag": "p", "text": "Valorum chose Valenthyne Farfalla as his first olive branch in reaching out to the Jedi Order in passing the reforms. While the Senate was responsible for approving laws, Valorum wanted to ensure that he would have the support of the Order, believing that the backing of the Jedi High Council would show the Order's commitment to peace. Farfalla believed that the Jedi Order should remain independent from the Republic, but Valorum felt that the Jedi had become a cause of war in the galaxy. Following a closed-door meeting between Valorum, Farfalla, and Farfalla's apprentice, Johun Othone, Farfalla ultimately agreed to make sure that the Jedi Order complied with Valorum's wishes."}, {"tag": "h3", "text": "Diplomatic efforts"}, {"tag": "p", "text": "Relying on ambassadors and treaties, Valorum successfully pushed the Ruusan Reformations through the Galactic Senate and implemented them during his term, leading to the largest dismantling of central authority that the Galactic Republic had ever seen. As a result of the successful passage of the reforms, Valorum became known as the man who reunited the galaxy."}, {"tag": "p", "text": "Valorum was re-elected to a second term, during which time Johun Othone was promoted to the rank of Jedi Knight and served as the Jedi member of the Chancellor's Guard. After his Chancellorship ended, Valorum continued to utilize Othone's skills as a Jedi advisor, having the Jedi Knight accompany him on numerous diplomatic missions. Nevertheless, the former Chancellor refused an honor guard, as he felt that he was not a threat to anyone and that he was not important enough for anyone to attempt to assassinate. Valorum's second term concluded in 992 BBY, and his successor pledged that she would continue the work that Valorum had started with the Ruusan Reformation."}, {"tag": "p", "text": "In the years following the end of his second term, Valorum conducted nearly fifty diplomatic missions, enacting a series of policies intended to re-unify the Republic, and choosing to remain an advocate for the Republic and its values throughout the galaxy. These missions were seen as crucial to the Republic, as they involved attempting to bring worlds into the government for the first time or convincing those that had previously seceded from the Republic to rejoin the galactic fold."}, {"tag": "h3", "text": "Kidnapping attempt"}, {"tag": "p", "text": "In 990 BBY, two years after his term as Chancellor ended, Valorum and Othone traveled to Serenno to conduct one such diplomatic mission. He hoped to convince the planet's six most powerful families to persuade the other ruling families of the world to cut off funding to the planet's anti-Republic factions. Upon arrival, Valorum was targeted for kidnapping by the Anti-Republic Liberation Front, one of the more powerful anti-Republic groups and one that was being aided by the Sith Lord Darth Zannah. The sect set off an explosion that destroyed the Chancellor's transport and killed its crew, but Othone defeated the would-be kidnappers and saved the diplomat's life. Valorum promised to do whatever Othone asked in order to repay him, but the Jedi's only request at the time was that the former-Chancellor hire a security detail."}, {"tag": "p", "text": "The attempted kidnapping succeeded in unintentionally accomplishing Valorum's goal of having the planet's leaders fight against the separatist groups. The ruling families promised swift action in dealing with the threats and offered a reward for any information anyone had on the assailants. However, Darth Bane, Zannah's Master and the Dark Lord of the Sith who was behind the kidnapping plot, foresaw the outcome. Bane exploited Valorum's mission as a means to divert the attention of the Republic and the Jedi Order away from his Order of the Sith Lords, of which the galaxy was unaware, and toward the Serenno separatists."}, {"tag": "p", "text": "Following the mission, Othone requested that Valorum petition the Senate for funds to create a memorial to Jedi Master Hoth and the other Jedi who died defeating the Sith Brotherhood of Darkness during the Seventh Battle of Ruusan. The Jedi Council, however, did not approve of the construction of the memorial, feeling it to be a sign of vanity. Yet, the Republic media and the Galactic Senate, both of whom were shocked by the Jedi Council's decision, approved Valorum's request. Othone began constructing the memorial, called the Valley of the Jedi, on Ruusan, but was killed by Darth Bane and Darth Zannah shortly thereafter. The construction was nevertheless completed."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "While the Ruusan Reformations repaired many of the declining aspects of the Republic, it ultimately fostered the very things it aimed to remove. Because the reforms were designed to give each member of the Senate a powerful voice, the Senate found itself faced with gridlock and greed. In the centuries that followed, this bureaucratic system became a source of contention amongst the Republic's citizens, as well as some of its leaders. One part of the system, the granting of Senate representation to \"functional constituencies,\" enabled corporations such as the Trade Federation to be represented by a Galactic Senator. Beginning in 124 BBY, the Federation used its power to buy votes from poorer sectors. The Federation employed this tactic during the Invasion of Naboo of 32 BBY, using its political influence in an attempt to stall a Senate investigation into the Senate testimony of Padmé Amidala, the Queen of Naboo, who truthfully claimed that the company's battle droid army had invaded her world."}, {"tag": "p", "text": "It was also this bureaucratic system that Palpatine, the Senator of Naboo during the Federation's invasion of the planet, used as justification to convince Queen Amidala that then–Chancellor Finis Valorum, a descendant of Tarsus Valorum, needed to be removed from office. A special Chancery election led to Palpatine's election as Supreme Chancellor and, subsequently, his creation of the First Galactic Empire in 19 BBY."}, {"tag": "p", "text": "In the centuries that followed Tarsus Valorum's term as Supreme Chancellor, a number of other members of House Valorum rose to prominence in the political arena. Tullius Valorum and Laeca Valorum were seen as important politicians of their time. Eixes Valorum went on to become Supreme Chancellor of the Galactic Republic, as well as Finis Valorum, who was the last Supreme Chancellor prior to the election of Palpatine and the rise of the First Galactic Empire."}, {"tag": "p", "text": "Around one thousand years after Valorum proposed constructing the Valley of the Jedi, the location of the Valley of the Jedi, which received funding due to Valorum's standing with the Galactic Senate, became lost. Nevertheless, it was re-discovered by Morgan Katarn, a Force-sensitive ally of the Alliance to Restore the Republic that opposed the First Galactic Empire. Morgan was murdered by a Dark Jedi named Jerec, who used the Valley's inherent Force powers to increase his power exponentially. Jerec was eventually defeated by Morgan's son, Kyle Katarn, but a second Dark Jedi, Desann, discovered the location of the Valley and used it to create a Dark Jedi army. Desann and his army were defeated by Kyle Katarn during the Battle of Yavin 4."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When the Chancellor was in his early fifties, Johun Othone noticed that Valorum looked at least ten years younger than he was. With his dark brown hair, bright blue eyes, and square chin, his face was one that many called honest and determined. Physical traits such as these, coupled with his long record of public service in the Republic, were what led to Valorum being appointed the first non-Jedi Chancellor in four hundred years. These traits complimented Valorum's oratory skills when he proposed and successfully passed the Ruusan Reformations through the Senate."}, {"tag": "p", "text": "Despite his accomplishments, many felt that Valorum had remained modest, citing his lack of an honor guard and light accommodations as an example. While he was a decorated diplomat after his second term as Supreme Chancellor ended, Valorum nevertheless chose to fly in vessels, such as the Emissary-class shuttle New Dawn, that some, including Othone, believed were less extravagant than what most former Heads of State would have chosen to utilize on ambassadorial missions."}, {"tag": "p", "text": "Unlike most politicians, Valorum was seen as being a man of conviction, someone who believed his words rather than simply saying them for the sake of votes or popularity. His convictions pushed him to champion the Ruusan Reformations, as well as serve as a diplomat on dozens of missions after his Chancellorship ended. He felt it necessary to travel on these missions, such as when he traveled to Serenno and was nearly kidnapped, believing that one was required to win the hearts and minds of a planet's people in order to bring it into or convince it to rejoin the Republic."}, {"tag": "p", "text": "Valorum had a low opinion of a number of politicians, specifically those who did not serve the public's interest. He felt they were untrustworthy, recognizing that politicians would lie to further their own goals. As he warned on more than one occasion, a politician could not be trusted if he or she made a promise over a holoprojector, as only meeting behind closed doors could allow for someone to look the politician in the eye and see if he or she was telling the truth."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Being a man of deep convictions, Valorum possessed the ability to present his goals for the Ruusan Reformations using renowned oratory skills. These goals became reality, as the Ruusan Reformations were implemented after he worked throughout his Chancellorship to pass them. He was considered by the Senate to be a man of great diplomatic skill, which led to him becoming a seasoned diplomat for the Republic even after his second term as Chancellor came to a close. These diplomatic skills were used in nearly fifty ambassadorial missions after his Chancellorship. The Senate was also seen as a body that would do whatever Valorum requested of it, an opinion expressed by Valenthyne Farfalla after Valorum petitioned for funds for the Valley of the Jedi, despite the Jedi Council's opposition."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tarsus Valorum wore a blue shirt with a collar covering most of his neck. The collar and the front of the shirt were decorated with a gold design. Atop the shirt, he wore a darker blue robe. When traveling after his time in office came to an end, he flew in an Emissary-class shuttle called New Dawn. Johun Othone believed the ship was less extravagant than what most former Supreme Chancellors would have chosen to travel in and that Valorum could have secured the funds from the Senate for a larger vessel. Valorum, however, said that New Dawn was more than adequate to suit his needs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tarsus Valorum was introduced via mention by author Daniel Wallace in The New Essential Guide to Characters, a reference book published by Del Rey in 2002. However, he was only mentioned as one of many members of the renowned Valorum political dynasty and was not revealed as the Supreme Chancellor behind the Ruusan Reformations until the publishing of The New Essential Chronology, also penned by Wallace, in 2005. Valorum made his first appearance in 2007's Darth Bane: Rule of Two by Drew Karpyshyn, and his physical appearance was revealed in 2009 with the publishing of The Essential Atlas by Wallace and Jason Fry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}