{"url": "Tarth_Jaxx", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Females", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Tarth Jaxx"}, {"tag": "p", "text": "Tarth Jaxx was a female Mon Calamari shipwright who lived during the Galactic Civil War.\nCirca 1 ABY, Tarth Jaxx and another Mon Calamari shipwright, Io Tsomcren, ordered a large shipment of starship component to Ral Mundi's Starship Emporium, in Coronet on the planet Corellia. However, when Jaxx and Tsomcren arrived in the Coronet Starport, the shipment was missing. Ral Mundi was confuse for the situation and deeply apologized for the delay. However, as the shipment did not show up Jaxx started to become hostile, while Tsomcren remained comprehensive. Mundi thus requested assistance of the Corellian Security Force and CorSec Lieutenant Mack Jasper sent a spacer to investigate. The spacer discovered that the shipment was stolen by the Ragtag gang but finally managed to retrieve it. However, de to the Ragtag involvement, the shipwrights did not get the shipment immediately as the CorSec decide to hold it as evidence, making Jaxx even more furious."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tarth Jaxx was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "Ral Mundi, Tarth Jaxx and Io Tsomcren were added to the game with the expansion Star Wars Galaxies: Jump to Lightspeed, released on October 27, 2004. This NPCs were originally three \"greeter NPCs\": NPCs present at the entrance of starports to provide general information to players arriving on a new planet. With the release of the \"Publish 21\", on August 4, 2005, a new quest featuring Ral Mundi, Tarth Jaxx and Io Tsomcren was added to the game. The quest, named \"Find the Missing Shipment of Starship Components\", was best known as \"Ral Mundi's quest\". Ral Mundi's quest was revamped with the release of the \"Publish 27\", on February 15, 2006, as the quest was inserted into the \"Legacy Quest\", the main questline in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}