{"url": "Taryn_Zel", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Females", "Category:Hapan royals", "Category:Jedi Coalition personnel", "Category:Police"], "nodes": [{"tag": "h1", "text": "Taryn Zel"}, {"tag": "p", "text": "Taryn Zel was an officer in Hapan Security in 41 ABY, the daughter of a half-brother of Isolder, making her the first cousin of Tenel Ka Djo, the Queen Mother. She was the identical twin of Trista Zel, and the two were very valuable officers to Tenel Ka. She later became engaged to the Jedi Knight, Zekk."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Taryn and Trista were born to a male sibling of Isolder sometime around 20 ABY. When they reached adulthood, Taryn and Trista became officers in Hapan Security, and due to their close relations with Tenel Ka, were very useful operatives to her. Nobody knew of their close relationship to Tenel Ka, and they were given their own security team to help them out during missions."}, {"tag": "h3", "text": "Retrieving Ben"}, {"tag": "p", "text": "After the Jedi Knight Ben Skywalker had escaped Galactic Alliance Guard, Taryn and Trista were tasked by Tenel Ka Djo and Prince Isolder to retrieve him and return him to the Jedi base on Shedu Maad. After waiting about eight standard hours on Nova Station, the twins finally encountered Ben and took him to their skiff."}, {"tag": "p", "text": "However, on the way to meet up with Isolder at the rendezvous point, Isolder's ship came under attack by the Anakin Solo, and the prince was captured. The twins then took Ben directly to Tenel Ka to inform her of her father's capture."}, {"tag": "p", "text": "After Tenel Ka's ship, the Dragon Queen, dropped Ben off at the Jedi base, Taryn took an interest in Zekk, who was standing nearby. Trista scolded her sister for indulging in such behavior while on duty, but Taryn shrugged it off."}, {"tag": "p", "text": "Later on, the twins and Ben Skywalker were assigned to defend Shedu Maad against an attack by the Anakin Solo. The pair were shocked to hear that a nanokiller had been released on the Dragon Queen, killing all those on board with royal blood, and refused to answer Ben's questions as to whether or not Tenel Ka and Allana were among the casualties. Shortly after, the twins and Ben uncovered a plot by General Livette to betray the Hapan crown by allying with the Remnant. Trista volunteered to stay behind and keep an eye on the traitor, and Ben and Taryn went after the Remnant troops and their leader, Tahiri Veila. Taryn would later help Ben bring Tahiri into custody."}, {"tag": "h3", "text": "Reappearance"}, {"tag": "p", "text": "Six months after the Battle of Uroro Station, Taryn reappeared after a period of absence, romantically involved with the Jedi Knight Zekk. She would answer no questions about where she had been or why she had not reported Zekk's survival to the Jedi Order. She also participated in a successful mission to free Valin and Jysella Horn from carbonite, and later in Operation Shieldfall on Nam Chorios."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Taryn enjoyed making jokes and slight flirting, much in contrast to her sister Trista, whom she chided for being a dug."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Taryn Zel first appeared in the novel Legacy of the Force: Invincible along with her sister Trista. She was scheduled to appear in the novel Blood Oath by Elaine Cunningham along with Trista and the Jedi Zekk before the novel was cancelled.[source?] However, upon her next appearance in Fate of the Jedi: Backlash, it was revealed that she and Zekk were in a relationship together, which would have been a development from the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}