{"url": "Taselda", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Purge survivors", "Category:Nam Chorios residents", "Category:Post-Ruusan Jedi Knights", "Category:Redeemed Jedi", "Category:Therans"], "nodes": [{"tag": "h1", "text": "Taselda"}, {"tag": "p", "text": "Taselda, also known as Sel was a centuries-old Human female who once served as a Jedi Knight during the last decades of the Galactic Republic. Falling to the dark side of the Force and descending into madness during a mission to Nam Chorios, Taselda remained alive for centuries by consuming the native droch insects. At some point during the reign of the Galactic Alliance, Taselda was approached by the Theran Listeners and healed, regaining her sanity and aging at a normal rate."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born to Human parents from Alderaan and the Hapes Consortium roughly four hundred years prior to the Great Jedi Purge, Taselda was identified as Force-sensitive and was sent to the Coruscant Jedi Temple for training in the ways of the Force. Spending many years in the Temple academy, Taselda graduated and became a Padawan to a wise Jedi Master. After completing her Trials of Knighthood, Taselda enjoyed a happy life as a young Jedi Knight, serving the galaxy from the capital planet. When the Jedi High Council paired her with a senior Knight, the Hutt Jedi Beldorion, for a mission to the planet Nam Chorios, Taselda gracefully accepted and boarded a shuttle for the distant world."}, {"tag": "h3", "text": "Lost on Nam Chorios"}, {"tag": "p", "text": "While on the turbulent world, the Jedi lacked enough emotional grounding to combat the violent surges in the Force that made Nam Chorios so dangerous. When Beldorion focused his greed and thirst for power into controlling the world, Taselda lost control in the dark side of the Force and went insane. Having lost her lightsaber in a confrontation with Beldorion, Taselda fled into relative poverty as she slowly nursed her badly injured body back to health. Setting up a home in the Newcomers' section of the capital city of Hweg Shul, the madwoman began eating the world's native drochs, a process which kept her youthful for centuries. However, through the consumption of these dangerous insects, Taselda absorbed the memories of the hundreds of victims the drochs had fed on, causing her mind to deteriorate at an accelerated rate."}, {"tag": "p", "text": "While the Hutt ruled over the world, the Great Jedi Purge swept across the rest of the galaxy, initiated by Dark Lord of the Sith Darth Sidious the new ruler of the Galactic Empire. Unaffected by the purge, the Dark Jedi of Nam Chorios were not affected by Jedi business until thirteen years after the Battle of Yavin when the Jedi Knight Callista Ming arrived to investigate the world. Encountering Taselda, the madwoman coerced Ming to help overthrow Beldorion, a task that proved to much for Ming, who was imprisoned. Soon after Ming's defeat and capture, Jedi Luke Skywalker arrived in search of her. Recognizing his superior strength in the Force, Taselda approached him and attempted to use a mixture of mind-altering drugs and her mastery of the Force to manipulate the young Jedi. An ambitious plot, it failed to work on the powerful Jedi and Taselda was forced back into hiding."}, {"tag": "h3", "text": "Theran Listener"}, {"tag": "p", "text": "Without her meddling, Beldorion was defeated by the untrained Force-sensitive Leia Organa Solo and freedom brought to the world. The New Republic installed several NovaGuns in orbit to prevent the spread of the droch-spread Death Seed plague and continued to monitor the planet's economic growth and the well-being of its citizens. This benefited beings such as Taselda because of the prominence of the Theran Listeners, a group of Oldtimers who used special Force techniques to commune with the native Tsils. When approached by the Listeners, Taselda accepted to be the subject of a special type of mnemotherapy that eventually restored her mind through the repression of the horrible memories she experienced by eating drochs. Recovered from her brush with the dark side, Taselda became an active Listener herself, becoming respected by her colleagues and a known figure in Hweg Shul."}, {"tag": "p", "text": "Thirty years after the end of the reign of Beldorion, Jedi Skywalker returned to Nam Chorios, now Grand Master of the Jedi Order. Accompanied by his son, Ben, and the Sith Vestara Khai, Skywalker was directed to Taselda on his search for the dangerous dark side entity Abeloth. Though Taselda did not remember her encounter with Skywalker, she accepted them into her home and recounted the events that had transpired on the world. Ignorant of Abeloth, Taselda refused Skywalker's suggestion to flee the world until she was dealt with, as the creature's strength in the dark side would overwhelm Taselda. Opting to assist the Jedi instead, Taselda gave Skywalker the mnemonic key that would put her in a state of hypnosis should he need to be reassured of her state of mind. Remaining in Hweg Shul as Skywalker departed to investigate a disappearance, Taselda fell under the sway of Abeloth as did all of the Listener present in the city."}, {"tag": "p", "text": "Lying in wait at her house, Taselda was to act normally when the Skywalkers returned and sound an alarm that would bring Abeloth to her location. Having long ago recovered her lightsaber, Taselda approached the Jedi in her living room and welcomed them back. Sensing that something was wrong, Skywalker sang an old Alderaanian lullaby, the mnemonic key Taselda had spoken of earlier, and put the old woman into a trance. Sel revealed her part in Abeloth's plot to the Jedi; Skywalker then put her to sleep and wiped her memory of their visit. Upon awaking, Taselda followed Abeloth's summons to an old pump station in the Crystal Valley where she fell into a deep agonizing slumber as her life force was feasted on by Abeloth. After a brief encounter with Skywalker, Abeloth's hold on the Listeners and Taselda was broken, and she returned to her normal duties in Hweg Shul."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The New Essential Guide to Characters her name is erroneously spelled Talseda. In Conviction her name is spelled Teselda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}