{"url": "Task_Force_Admonitor", "categories": ["Category:Legends articles", "Category:Imperial task forces"], "nodes": [{"tag": "h1", "text": "Task Force Admonitor"}, {"tag": "p", "text": "Task Force Admonitor was an Imperial task force commanded by Senior Captain Thrawn. It was named after its commanding vessel, the Imperial I-class Star Destroyer Admonitor. Eight months after battle of Yavin the task force was involved in battle between Thrawn and an alien warlord named Nuso Esva. When Thrawn was temporarily away from his ship, the task force was commanded by Captain Voss Parck."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Besides the Imperial I-class Star Destroyer Admonitor, the task force had several support ships. At least four Carrack-class light cruisers served in the force, as well as two Strike-class medium cruisers."}, {"tag": "p", "text": "During the battle of the Poln system, the task force was bolstered by five heavy cruisers, and three light cruisers, all of which were of unknown alien configuration."}, {"tag": "p", "text": "Specter Squadron, and Gray Squadron were starfighter squadrons based on the Admonitor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The earliest known use for the group was eight months after the battle of Yavin. Thrawn had been driven into a conflict with Nuso Evsa, who held a vast empire and was a skilled manipulator. Thrawn placed command of the force to Captain Voss Parck, while he went to have a meeting with the Emperor onboard the half completed second Death Star. Thrawn requested at least six Imperial-class Star Destroyers as reinforcements for him to counter the Evsa' Firekilns. Palpatine couldn't spare any more ships, as a majority of them were tasked with hunting down the rebel fleet. However, Palpatine convinced Thrawn to speak to Darth Vader, as he controlled Death Squadron. Meanwhile, sometime during this meeting, Parck engaged Evsa's Eastern Fleet at Tepitxii. The battle seem to have been lost, if not for the Imperial II-class Star Destroyer Chimaera arriving to assist. Thanks to the Chimaera's untimely arrival, Parck was able win the battle against the Eastern Fleet. However, before he could destroy anymore ships, the fleet jumped, heading to the Poln system. The task force tracked them to the Poln system, and followed them there. Little did they know, the star system was being used as a trap by Evsa. By the time they arrived, they were attacked by the Eastern Fleet. Out gunned, and surrounded, defeat was inevitable. Thrawn would have had his career humiliated, and Evsa would have gained new territory for his empire. Not only that, but the Chimaera was on a collision with a Golan I defense platform, but Jorj Car'das and Thrawn used the Lost Reef and Chimaera's remaining tractor beam systems to steer the seriously damaged ship away from the orbital battle station. This ruined Evsa's battle plan, but he still proceeded to his ultimate victory. But, Thrawn revealed his surprise: Death Squadron. The Executor-class Star Dreadnought Executor, backed by several Star Destroyers including; Avenger, Stalker, Devastator, Tyrant, Accuser, Adjudicator. Thrawn temporarily gave command of his task force to Vader, and the battle was won, and Evsa's Eastern Fleet was decimated, pushing back his plans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}