{"url": "Task_Force_231", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Imperial task forces"], "nodes": [{"tag": "h1", "text": "Task Force 231"}, {"tag": "p", "text": "Task Force 231 was an Imperial Navy task force active at the time of the Lothal campaign. After Imperial Karyn Faro was promoted to commodore, she was promised command of the flotilla, but no follow-up appointment had occurred after several weeks, with Imperial High Command failing to bring the commodore into pre-command orientation in regular time. After an argument with Imperial Assistant Director Brierly Ronan, Faro was given reason to suspect that her superior, Grand Admiral Thrawn, was responsible for blocking her path to the task force. However, Thrawn later revealed to Faro he was actually working to get her command of the larger Eleventh Fleet instead, a request High Command later approved."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Task Force 231 was a task force within the Imperial Navy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Faro's appointment"}, {"tag": "p", "text": "Around the time of the Battle of Atollon, during the Lothal campaign, the captain of the Imperial Star Destroyer Chimaera, Karyn Faro, was promoted to commodore. Alongside this, Faro was also promised command of Task Force 231, once the flotilla's current commander had moved up to one of the larger fleets. However, six weeks later, Faro was still serving under Imperial Grand Admiral Thrawn in the Seventh Fleet and, as the Chimaera fought several battles against the hostile Grysk Hegemony, was unsure where her future lay."}, {"tag": "p", "text": "It should have been upon the Chimaera's return from these missions that Faro was pulled off the ship for pre-command orientation on the planet Coruscant, according to standard Imperial Navy procedure, but this did not occur. The commodore believed it was possible there had simply been a delay, although Imperial High Command was usually rigid about timings and should have sent a message resetting the orientation or assignment. However, no such message had been received, and Faro's quiet inquiry had not been followed up."}, {"tag": "h3", "text": "Thrawn's plan"}, {"tag": "p", "text": "A week after Faro sent her inquiry, the commodore got into an argument with Thrawn's political opponent, Imperial Military Department of Advanced Weapons Research Assistant Director Brierly Ronan. Ronan told Faro that through doing some digging, he had discovered Thrawn was the one holding back her appointment to command Task Force 231, though the details were murky. Although the commodore dismissed Ronan's accusation as a lie, she was still shaken by his words, pondering whether she had upset Thrawn or other Imperial higher-ups, or was being kept back because Thrawn did not want to lose his Star Destroyer's captain."}, {"tag": "p", "text": "A short time later, just before the Liberation of Lothal, Thrawn revealed to Faro that he had indeed been blocking her appointment to the 231st, although not to keep her in the Seventh Fleet or because of any poor performance. In reality, Thrawn had requested that Faro be given the larger Eleventh Fleet instead, as he believed that that command was more deserving of her skills as a superior administrator, tactician, and officer. That reassignment was approved earlier on the morning that Thrawn revealed his play to Faro, with her due to leave the Chimaera shortly after."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Task Force 231 was first mentioned in the 2018 novel Thrawn: Alliances by Timothy Zahn, the second book in the Star Wars: Thrawn series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}