{"url": "Tassar", "categories": ["Category:Legends articles", "Category:Eternal Empire individuals", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Tassar"}, {"tag": "p", "text": "Tassar was a female Human native of Zakuul living during the Galactic War. A Battalion Commander of the Eternal Empire, she was the foremost architect of the Star Fortress program. The massive battlestations successfully subjugated the larger portion of the Core Worlds in the years following the Eternal Empire conquest of the larger galaxy. During the war against Zakuul, several Star Fortresses were destroyed by operatives of the Anti-Zakuul Alliance, leading to Tassar's political downfall. After Vaylin assumed the Eternal Throne, Tassar went into exile with her loyal troops rather than face her wrath. Tassar's followers revered her zealously as a cult formed around her. Eventually they intercepted an Alliance transport with samples for Juvard Illip Oggurobb, allowing Tassar to discover Rakata Prime and the technology of the Infinite Empire, which she wanted to use to upgrade the Star Fortress design to be completely indestructible. Tassar and her followers made significant progress in constructing a new Star Fortress on Rakata Prime's surface, however following the death of Vaylin, they were discovered by the Alliance forces. A strike team was dispatched in 3629 BBY to stop Tassar and her efforts. They defeated her Scout Captain Sterla and eventually reached the beachhead where Tassar confronted them with a battalion of Skytroopers. After a prolonged fight, the Alliance forces prevailed and killed Tassar, putting a final end to the Star Fortress program."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Commander Tassar appears in Star Wars: The Old Republic: Knights of the Eternal Throne as the final boss of the \"Landing Party\" Uprising, introduced in Game Update 5.1: Defend the Throne."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}