{"url": "Taslin_Brance", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:Resistance High Command members", "Category:Resistance Military officers"], "nodes": [{"tag": "h1", "text": "Taslin Brance"}, {"tag": "p", "text": "Taslin Brance was a human male officer who held the rank of major in the Resistance during its conflict with the First Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Taslin Brance was born on the planet Rinn."}, {"tag": "h3", "text": "The Resistance"}, {"tag": "p", "text": "Brance eventually became a major in the ground forces of the Resistance, serving in the Resistance base on D'Qar about 30 years after the Battle of Endor, along with General Leia Organa and others in the Resistance leadership."}, {"tag": "p", "text": "Brance was the first to receive a coded and encrypted transmission informing the Resistance of an attack by First Order stormtroopers against a Jakku community, resulting in the death of Lor San Tekka. The report also noted the destruction of pilot Poe Dameron's X-wing fighter, leading Brance to openly speculate that Dameron and his astromech droid, BB-8, had perished. Organa admonished him for speculation, who noted BB-8's resourcefulness and expressed hope for his survival."}, {"tag": "p", "text": "Brance was also present at the D'Qar base when the Resistance received word that Hosnian Prime, the planet serving as the headquarters for the Galactic Senate, had been destroyed by the First Order's Starkiller Base superweapon. Shocked and horrified by the news, Brance was the first to report the planet's destruction to Organa and the other Resistance leaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taslin Brance was portrayed by Emun Elliott in the film Star Wars: Episode VII The Force Awakens (2015). Best known for his roles in the television series Game of Thrones and the science fiction film Prometheus (2012), Elliott had only one line in the film: \"A laser cannon?.\""}, {"tag": "p", "text": "Although his rank badge clearly identifies him as a major, Brance was both referred to and addressed as a lieutenant in Alan Dean Foster's novelization of The Force Awakens."}, {"tag": "p", "text": "Brance's first name \"Taslin\" was not revealed until the release of the 2016 reference book Star Wars Character Encyclopedia: Updated and Expanded, written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}