{"url": "Tatooine", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Arkanis sector planets", "Category:Desert planets", "Category:Galactic Empire planets", "Category:Hutt planets", "Category:Rocky planets", "Category:Slavery worlds", "Category:Tatoo system", "Category:Tatooine locations", "Category:Triellus Trade Route"], "nodes": [{"tag": "h1", "text": "Tatooine"}, {"tag": "p", "text": "Tatooine was a sparsely inhabited circumbinary desert planet located in the galaxy's Outer Rim Territories. It was the homeworld of Anakin and Luke Skywalker, who would go on to shape galactic history. Part of a binary star system, the planet was oppressed by scorching suns, resulting in the world lacking the necessary surface water to sustain large populations. As a result, many residents of the planet instead drew water from the atmosphere via moisture farms. The planet also had little surface vegetation."}, {"tag": "p", "text": "Initially inhabited by native Jawa and Tusken Raider species, it saw a population explosion following the search for valuable mining deposits on the planet's silicate surface. Finding the ore to have unwanted metallurgic properties, mining firms left the planet en masse, leaving behind valuable equipment, most notably large sandcrawlers, which were later used by the Jawa population."}, {"tag": "p", "text": "The Hutt Clan also maintained a presence on Tatooine, with Jabba the Hutt owning a palace in the desert at least by the time of the Clone Wars until his death shortly before the Battle of Endor."}, {"tag": "p", "text": "Generally ignored by the galaxy at large, Tatooine gained the notice of the Empire during the Galactic Civil War when an escape pod carrying two droids in possession of top-secret information launched from the starship Tantive IV and landed on the sandy Outer Rim world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Tatooine was a planet located in the Outer Rim, a region of the galaxy far removed from its core. It had three moons, Ghomrassen, Guermessa and Chenini. Long ago, Tatooine was covered in oceans and rainforests, but for unknown reasons, it became a hot desert world. Tatooine orbited twin suns, Tatoo I and Tatoo II. The whole planet was covered in harsh deserts, and only a small part of its northern hemisphere could sustain intelligent life. The landscape was covered with sand dunes, mountains, and canyons, which made traversing the planet very difficult. Due to the absence of surface water, those who lived on Tatooine had to draw moisture through the dry air."}, {"tag": "p", "text": "Inhabiting the planet were many native species, the largest of which were the carnivorous krayt dragons. The common krayt dragon, while more plentiful, was shadowed by the greater krayt dragon, which submerged itself under the shifting sands and used its powerful limbs to swim through the dunes. In addition, the common bantha and eopie species also found a home on the world, along with dewbacks, rontos, womp rats, massiffs and scurriers."}, {"tag": "p", "text": "The cities of Tatooine were frequently blasted by sandstorms and the inhabitants always seemed to know when one was coming. Not much distinguished the towns as the poor standard of living was common. The cities were separated from each other by large expanses of deserts. Rural life, on the other hand, was mostly small moisture farms that sold water and food for a meager living."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "An annual holiday celebrated on the planet was Boonta Eve. The holiday was celebrated in honor of Boonta Hestilic Shad'ruu, a Hutt who rose to be a god."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early History"}, {"tag": "p", "text": "It was homeworld to the native Jawa and Tusken Raider species—and presumably with vast oceans of surface water and lush rainforest. According to the Legend of Lehon, Tatooine had also been inhabited by a group called the Kumumgah during this time, but there was little evidence to support the story. Sometime in Tatooine's history, the whole planet became a desert by unknown means, and much later it would be colonized by early settlers and explorers, who mistook the planet for a third sun owing to its highly reflective silicate surface."}, {"tag": "p", "text": "As a result of sporadic and unsuccessful colonization ventures, the planet became a haven for smugglers and criminal activity, while scattered, isolated settlements of hard-working inhabitants attempted to earn a living in the wastes."}, {"tag": "p", "text": "A long-ago mining boom saw the widespread use of sandcrawlers on the desert plains in an effort to mine valuable minerals. However, after it was discovered that most valuable minerals could be found on the surface, along with most minerals having unwanted metallurgic properties, the sandcrawlers were abandoned and eventually picked up by the native Jawas for use as shelter and mobile bases, from which they collected scrap from thousands of years of crashed spacecraft and failed mining projects."}, {"tag": "p", "text": "Offworlders erected various cities in the desert, and colonists who decided to stay on the planet built moisture farms. The B'omarr Order on Tatooine kept their disembodied brains floating in jars that hung below their spider-like droid bodies, and built a monastery on the planet which would eventually come under the ownership of Jabba Desilijic Tiure as his palace."}, {"tag": "p", "text": "Most wealth eventually found its way into the city of Mos Espa, with most of it procured from gambling and off-world trade, especially through the lucrative black market. The influx of commercial ventures fueled Mos Espa's growth, eventually securing its regional importance as a hub of economic and financial activity. With high tariffs imposed by the Hutts, some believed themselves able to escape paying them by doing business in the planet's de facto capital, however often found themselves scammed and broke if not through gambling, through simple bad luck."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "In the last decades of the Galactic Republic, Tatooine was home to a human slave named Shmi Skywalker and her son, the young Anakin owing to lax enforcement of Republic anti-slavery laws. Nine years later, Queen Padmé Amidala of Naboo escaped the capture of her homeworld by the Trade Federation, and she took refuge on Tatooine with her companions and protectors, including the Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi. The Skywalkers befriended Amidala's party, and the young slave ended up participating in a podrace to help his new friends obtain a new T-14 hyperdrive generator for their damaged starship. After discovering that Anakin Skywalker would make an exceptional recruit for the Jedi Order, Master Qui-Gon Jinn managed to obtain his freedom from the junk dealer Watto in the city of Mos Espa, and the Queen's party left Tatooine with the boy. After participating in numerous adventures, including the Invasion of Naboo, the former Tatooinian slave joined the Jedi Order under Kenobi's tutelage."}, {"tag": "p", "text": "Ten years later, Tatooine hosted another major event in the saga of the Skywalker family. Anakin Skywalker, now a gifted but unruly Jedi student, sensed that his mother, who had stayed on Tatooine and gotten married, was in terrible pain. Skywalker returned to the desert world in the company of Amidala, who was now a senator of the Republic and the young Jedi's secret lover. It transpired that Shmi Skywalker had been captured by Tusken Raiders and was detained in one of their camps. When Skywalker finally discovered his mother's location, he arrived too late, and she died in his arms from the consequences of the Tuskens' mistreatment of her. Enraged, the young Jedi slaughtered the entire Tusken tribe. That act of brutality, which took place on Tatooine, resulted in the native Tusken Raiders believing Anakin to be a vengeful demon spirit, and later had serious consequences as the first step towards Anakin Skywalker's fall from grace. Shortly after the incident, the Clone Wars broke out, and the tortured Tatooinian Jedi became a major player of the pan-galactic conflict."}, {"tag": "p", "text": "During the Clone Wars, a Jedi-backed mission to Jabba's Palace occurred, with the Jedi hoping to rescue Rotta the Huttlet from the Separatist Alliance. Later during the war, Chairman Papanoida and his son, Ion Papanoida headed to Tatooine to track down the bounty hunter Greedo, who had kidnapped members of their family."}, {"tag": "p", "text": "Three years after the start of the war, Skywalker fell to the dark side and joined the Sith, old adversaries of the Jedi who had long planned to take over the galaxy. The Galactic Empire, a new regime established to replace the Republic, started to hunt all Jedi. Skywalker's former master Obi-Wan Kenobi went into hiding on Tatooine, bringing the infant son of the fallen Jedi with him. On the desert expanses of Tatooine, Kenobi hoped that he could keep young Luke from his father's evil influence. Kenobi entrusted the boy to Shmi's stepson, Owen Lars, and his wife Beru."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "In the years following Emperor Palpatine's formation of his New Order, the Great Drought of Tatooine scorched the world's surface, impoverishing the many moisture farmers of a reliable source of income to procure food and other basic supplies. The situation was not helped by Jabba's thugs collecting \"water taxes\" from the many towns and isolated settlements across the planet, often resorting to threats and brute force to acquire enough water for the crime lord. With Obi-Wan Kenobi witnessing the suffering of the population, he disabled the weapons of the thugs, allowing the populace to chase them off. Later, a young Luke Skywalker attempted to confront the thugs, but was ultimately rescued by Obi-Wan after falling unconscious in a brief scuffle. With the legacy of the Jedi safe, Obi-Wan vowed never to return to town, while a week later the drought finally ended, and Jabba vowed revenge on the man who had stolen his water, to no avail."}, {"tag": "p", "text": "In addition, the Empire's rise prompted the Hutts to revise their oftentimes shady business schemes, resulting in a transfer of regional wealth and influence from Mos Espa to Mos Eisley, prompting the slow economic decline of Mos Espa."}, {"tag": "p", "text": "In 2 BBY, the former Sith apprentice Maul traveled to Tatooine to hunt down his old nemesis Obi-Wan Kenobi. Unable to draw the Jedi Master out of hiding, Maul used the fragment of the Malachor Sith holocron to lure the Jedi rebel Ezra Bridger to the planet. Ezra traveled with the C1-series astromech droid Chopper to Tatooine. The two rebels were attacked by Tusken Raiders, who damaged their RZ-1T trainer. After being lost in the desert, Ezra and Chopper were rescued by Kenobi, who revealed Maul's deception. Kenobi then instructed the two rebels to return to Atollon while he defeated and fatally wounded Maul in combat. As Maul died in Kenobi's arms, Kenobi confirmed Maul's suspicions that he was hiding the Chosen One."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Shortly after the Battle of Scarif in the Galactic Civil War, the droids R2-D2 and C-3PO landed on Tatooine's surface in an escape pod after their CR90 corvette the Tantive IV was captured by the Imperial I-class Star Destroyer Devastator. With the droids carrying the technical readouts to the battle station, a task force was sent to the planet in order to capture the two droids. Upon coming in contact with a Jawa sandcrawler, the two were abducted and later sold to Owen Lars of the Lars moisture farm, with R2 being chosen after another astromech droid, R5-D4 broke down. Later that day, Luke Skywalker, unknowingly Anakin Skywalker's son came across a recorded message of Princess Leia pleading for the help of Obi-Wan Kenobi against the Galactic Empire. Intrigued, if only because R2 later ran away, forcing Luke and C-3PO to retrieve him, the two were attacked by native Tusken Raiders. Being saved by Kenobi after he imitated the cry of a krayt dragon, Luke Skywalker learned that he was a Jedi while Kenobi offered to train him. Refusing and heading home, Skywalker came across the remains of the sandcrawler that originally sold the two droids to his family. Realizing that it was the work of Imperial forces and that they may have traced the droids back to his house, Luke rushed back only to find the moisture farm burned to the ground, with the charred remains of his aunt and uncle laying outside in the sun. Agreeing to go with Ben Kenobi to Mos Eisley, they hired the services of smuggler Han Solo and his partner, Chewbacca to transport them offworld to Alderaan. Barely escaping an intense firefight with multiple sandtroopers, the two escaped Tatooine and several Star Destroyers into hyperspace."}, {"tag": "p", "text": "Sometime during the Galactic Civil War, Tusken Raiders under the leadership of the Jundland General attacked local settlements. He and his followers were ultimately defeated by a gang of mercenaries located on-world. Having allied with the Rebel Alliance, the gang led the Rebels into a series of successful operations on Tatooine that would conclude with the defeat of the Empire's 68th Legion and Tatooine garrison. Nevertheless, the Empire would come to reestablish its presence on the desert world, with Lieutenant Ardo Banch serving as an officer in the garrison."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, a shuttle with emissaries in the employ of Jabba the Hutt, meant to negotiate a deal to provide support to the Empire at Weapons Factory Alpha on Cymoon 1, was intercepted by the Alliance to Restore the Republic, and a strike team consisting of Han Solo, Luke Skywalker, and Leia Organa proceeded to the factory, infiltrating and destroying it. The negotiations having failed, Darth Vader returned to Tatooine to negotiate the deal with Jabba in person. After the negotiations were complete, Vader remained on Tatooine shortly to wipe out a Tusken Raider tribe and hire the bounty hunters Boba Fett and Black Krrsantan to ascertain the identity of the pilot who destroyed the First Death Star. Fett tracked down and dueled Skywalker, who had returned to the late Ben Kenobi's dwelling for education, learning his name and reporting to Vader."}, {"tag": "p", "text": "Four years later, the notorious bounty hunter Boba Fett delivered Han Solo, now frozen in carbonite, to the crime lord Jabba Desilijic Tiure, where he would serve as a wall decoration. Attempting to rescue Solo, the droids R2-D2 and C-3PO infiltrated Jabba's Palace disguised as servants after Luke Skywalker \"gifted\" them to the crime lord. Arriving at the palace not long after, Luke Skywalker attempted to bargain with Jabba for his friend's life, only to be refused and dropped into a rancor pit. After a struggle, Luke managed to kill the rancor, angering Jabba and sentencing him and Han Solo (who was freed by Leia Organa in the guise of a bounty hunter who had captured his friend, Chewbacca) to death in the Great Pit of Carkoon, while Leia became one of Jabba's many entertainers. Later, as they were about to be executed, R2-D2 fired Luke's lightsaber at him from Jabba's sail barge, allowing Luke, Han Solo and Lando Calrissian, who had been disguised as a guard, to make their escape. After an intense shootout, Leia strangled Jabba to death with the chain used to keep her hostage, and Boba Fett was knocked into the sarlacc. Luke Skywalker, Han Solo, Leia Organa, Chewbacca, Lando Calrissian ,and the two droids escaped the planet once more."}, {"tag": "h3", "text": "New days for Tatooine"}, {"tag": "p", "text": "After the Battle of Endor, a Jawa sandcrawler scavenged the wreckage from Jabba's sail barge, including a set of Mandalorian armor. Also during this time, numerous crime syndicates attempted to build legitimacy as mining companies, with one such company, the Red Key Raiders, afraid that the New Republic would eventually stamp out their operations on the planet. These companies tried to take advantage of the power vacuum caused by the death of Jabba. The enigmatic lawman Cobb Vanth obtained Boba Fett's armor from a Jawa sandcrawler and defeated the Red Key gangster Adwin Charu."}, {"tag": "p", "text": "By 5 ABY, Vanth had become the mayor and Sheriff of Freetown and dedicated his life to protecting the town from the Red Key Raiders. He also enlisted Jabba's former Beastmaster Malakili in helping to tame two unruly rontos and to raise the Huttlet named Borgo. With Malakili's help, Cobb struck a deal with the local Tusken Raiders to protect the town in exchange for water and receiving a pearl from the stomach of a krayt dragon. This alliance proved important in repelling an attack by the Red Key syndicate led by Lorgan Movellan."}, {"tag": "p", "text": "During the New Republic Era, the bounty hunter Din Djarin defeated a pursuing bounty hunter in a dogfight. His ship, the Razor Crest was damaged and he landed at a repair facility run by Peli Motto in Mos Eisley. While seeking work to pay for the repairs in a local cantina, he met Toro Calican, a young bounty hunter looking to join the guild by capturing Fennec Shand, a well-trained mercenary. Despite having misgivings, Djarin agreed to help him in exchange for the bounty's reward, while all other credit."}, {"tag": "p", "text": "Around this same time, Grogu, an infant member of Yoda's species traveling under the care of Djarin, exited the Razor Crest and attracted the attention of Peli Motto, who cared for him while repairing the ship for Djarin. Djarin and Calican then traveled into the Dune Sea on speeder bikes, looking for Shand. They came upon Tusken Raiders; Djarin bartered with them for safe passage. They eventually came across a Dewback with a dead bounty hunter attached to it, which is revealed to be bait laid out by Shand to attract anyone looking for her. The two managed to fend off Shand's attacks, but lost one of their speeder bikes in the process. Nevertheless, the pair was able to take Shand into custody."}, {"tag": "p", "text": "Djarin agreed to go retrieve the Dewback they encountered earlier to replace the destroyed speeder. Calican watched over Shand during this period. While alone, Shand told him that Djarin was a traitor to the guild and that the bounty on him was worth a great deal more than her bounty. Calican was unconcerned with the bounty, but Shand pointed out that taking out a Mandalorian would make him a legend. She then offered to help Calican capture the Mandalorian if he set her free. However, Calican instead shot her, assuming that she would betray him, and then headed to the repair facility on the speeder bike, where he took Motto and Grogu hostage. Shortly thereafter, Djarin arrived and used a flash grenade to disorient Calican, using the opportunity to kill him. Djarin then gave Calican's money to Motto to pay for the repairs on his ship. He and Grogu then left Tatooine."}, {"tag": "p", "text": "Djarin, through a lead given by Gor Koresh, would later return to Tatooine in search of other Mandalorians in his quest to find a Jedi. Upon his return, in place of another Mandalorian, he was instead met by the lawman Cobb Vanth donning Boba Fett's armor. After a tumultuous start, the two became allies and worked together to unite the local citizens of Mos Espa and nearby Tusken Raiders to liberate all from the terror of a greater Krayt dragon. During this time, the bounty hunter Boba Fett began to track Din Djarin, watching him from a distance in the Tatooine desert. Joined by Shand, whose life he had saved after Calican shot her, Fett eventually regained his armor after following Djarin to the planet Tython."}, {"tag": "h3", "text": "A war ends"}, {"tag": "p", "text": "With the destruction of the Final Order on Exegol, the First Order began to collapse, as people from across the galaxy rose against the tyrannical regime, ending the First Order/Resistance War. Sometime after the battle, Rey traveled to the Lars moisture farm on Tatooine with BB-8, where she buried Leia's lightsaber and the Skywalker lightsaber, using her own newly-crafted one in their place. When a local asked for her name, she forwent Palpatine's lineage, going by the name \"Rey Skywalker\" with the blessing of the Force spirits of Luke and Leia. Rey and BB-8 then looked off into the distance as the twin suns of Tatooine rose."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Tatooine had only a few port cities, including Mos Espa and Mos Eisley. Beside those cities, which attracted many criminals, most settlers of Tatooine operated moisture farms in the expanse of the desert. Due to the planet's dangerously high daytime temperature and whipping sandstorms, most residents of Tatooine kept their skin covered with practical materials that wick away sweat and limit exposure to the harmful ultraviolet radiation of the twin suns."}, {"tag": "p", "text": "Tusken Raiders often attacked isolated settlements on the fringes of their territory such as Anchorhead, and often took potshots at podracers during the Boonta Eve Classic, celebrated once every year as part of the Boonta Eve holiday celebrating the famed Hutt Boonta Hestilic Shad'ruu and his ascension to godhood. The Max Rebo Band's song \"Lapti Nek\" ranked number two in the top five of Tatooine's greatest hits, beaten by Figrin D'an and the Modal Nodes' number-one single \"Mad About Me.\" The Modal Nodes followed up their success with the number-three hit \"The Sequential Passage of Chronological Intervals\" and ranked-five hit \"Goodnight, But Not Goodbye (Mad About Me Remix).\" The Max Rebo Band was left with only two of Tatooine's top five songs, with their number-four hit \"(That Joyous Night) I Ate My Mate.\""}, {"tag": "p", "text": "Lawful inhabitants on the planet often utilized moisture vaporators owing to their energy efficiency, resulting in their status as one of the most crucial pieces of equipment for survival. While single vaporators often cost 500 credits each, some individuals bought and owned multiple units, creating moisture farms. Often utilizing the extra water for small hydroponic gardens, few gardens yielded enough to make substantial profits. In addition, vaporators required frequent maintenance and security systems to deter attacks from Tusken Raiders, who believed all water was sacred and belonged to them. The Raiders, native to the planet, were a nomadic tribal society with strict social and moral codes, along with defined territorial boundaries. Frequent colonial trespasses on their sovereign territory, along with the collusion between old values and galactic modernization, often forced the Tuskens to attack colonists whom they both vehemently feared and despised."}, {"tag": "p", "text": "Jawas were also a native species to Tatooine, and as such deeply entrenched into a nomadic lifestyle. Unlike the Tuskens, whom they attempted to avoid, Jawas frequently sold collected scrap metal and droids to the scattered settlers on the planet, earning a reputation as merchants and vagabonds. Myth and folklore also played an important part in Jawa society, with the Jawa's belief that the great Dune Sea was once a true ocean. Later research into ancient fossil-bearing rock and eroded canyons seemed to support this notion. Nonetheless, most of Tatooine's inhabitants refused to believe the story, finding it far-fetched and ludicrous."}, {"tag": "p", "text": "Slavery, while banned through Republic laws, was readily and blatantly practiced under the twin suns.\nAn entire section of Mos Espa was purposed as a Slave Quarter. On Tatooine, at least, the institution of slavery was seen as a socioeconomic symbol of wealth and prestige, resulting in highly protective owners who reluctantly parted with their possessions. Used as capital in business transactions, nearly all slavery operations were overseen by the Hutt gangsters, who regarded slavery as a useful institution."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tatooine first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. It then went to appear in the 1983 film Star Wars: Episode VI Return of the Jedi and in all three films of the prequel trilogy. The planet wasn't actually named in Episode IV, though director George Lucas had called it Utapau in all but the film's first draft only to rename it in the fourth draft after the movie's desert location Tataouine (French spelling) in Tunisia (see also Tunisia for other Tunisian-inspired names)."}, {"tag": "p", "text": "Filming of Tatooine scenes took place around Djerba, Matmata, Tozeur, Medenine, Ksar Hadada, the Chott el Jerid, and La Grande in Tunisia, Death Valley in California, and Yuma in Arizona."}, {"tag": "p", "text": "In the 1999 film Star Wars: Episode I The Phantom Menace, Tatooine's map is actually a map of the real planet Mars."}, {"tag": "h3", "text": "Real-world similarities"}, {"tag": "p", "text": "On September 15, 2011, a planet (actually a Saturn-like gas giant) in the real-world universe was discovered with two suns. The official name is Kepler-16b, but many call it the real Tatooine (even the NASA calls it the \"Tatooine-like\" planet). A Lucasfilm Ltd. employee was present at NASA's news conference. Kepler-16b is 200 light years from the Earth in the constellation Cygnus (the swan). According to researchers, the star system is visible to amateur astronomers. Coincidentally, the planet was discovered a day before the release of the Star Wars Blu-rays in North America."}, {"tag": "p", "text": "As of January 11, 2012, two more gas giants that orbit two suns each have been found. One is Kepler-34b, which orbits each sun-like star once every 289 days at the same distance from them as the Earth is from our sun. Kepler-34b is located 4900 light years away from Earth. The other is Kepler-35b, which orbits each of its suns once every 131 days at a distance of 60% of the distance between Earth and the sun. Kepler-35b's suns are smaller than our sun and are located 5400 light-years from Earth."}, {"tag": "p", "text": "The Centaurus constellation contains a planet that, like Tatooine, orbits two stars, which scientists once believed to be physically impossible."}, {"tag": "p", "text": "Some critics have seen Lucas's use of a desert planet as excessively derivative of Frank Herbert's Arrakis from the Dune novel series.[source?] Tatooine could also be taken as a derivative of the planet Mongo of the Flash Gordon serials, presented as a desert planet too in some media. This assumption is strongly supported by the presence of the starport Gordon on the planet Aquilae in Episode IV's rough draft, the same planet which was later named Utapau in the second draft, where Gordon is briefly mentioned. Utapau, as noted above, was ultimately renamed Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}