{"url": "Tasu_Leech", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Character stubs", "Category:Assassins", "Category:Humans", "Category:Kanjiklub members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tasu Leech"}, {"tag": "p", "text": "Tasu Leech was the leader of Kanjiklub, a criminal organization active approximately thirty years after the Battle of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Tasu Leech grew up on the Hutt colony world of Nar Kanji and became a brutal street fighter. He was something of a child prodigy in his youth. Owned by the Hutts, he became the deadliest pit fighter out of Nar Kanji, and also worked as an assassin. He claimed that even the Hutts feared him. He spoke Jablogian, refusing to speak a word of Galactic Basic Standard since he considered it a \"soft language for soft people.\""}, {"tag": "p", "text": "He was loaned to Syphacc by the Hutts, and served as his protection against the bounty hunter Beilert Valance, who tracked Syphacc to a H'unn Cabaret Pit on Nar Kaaga. Leech shot Valance, choosing the shoulder rather than the head in order to let his target know who had pulled the trigger. However, Valance used his palm blaster to disarm his attacker, and he and Leech fought hand-to-hand. Leech pulled two knives, but Valance threw Fournine-Jaytwelve into him, drawing blood. Leech refused to give up, but Valance head-butted him, knocking him out."}, {"tag": "h3", "text": "Leading Kanjiklub"}, {"tag": "p", "text": "Eventually, the human colonists of Nar Kanji overthrew their overlords and struck out on their own, leaving the colony world in disarray. Leech became the nominal leader of Kanjiklub, having defeated many would-be usurpers to his command under the Kanjiklub tradition that the leader could be challenged to combat by his underlings for control of the position. Leech rarely thought beyond their next raid and wasn't one for elaborate plans."}, {"tag": "p", "text": "The smuggler Han Solo attempted to deliver cargo for Kanjiklub, but failed and left Leech's gang empty-handed. He borrowed money to complete a risky cargo haul of rathtars for King Grevoth Prana IX, but the organization took issue with the risks he took with their capital. While at the Sliver on Kaddak with Qin-Fee and other Kanjiklubbers, Tasu overheard the Resistance protocol droid C-3PO informing Commander Poe Dameron that Solo had also borrowed a significant sum of money from the Guavian Death Gang in order to fund his smuggling operations. Angered by the information, Leech confronted Bala-Tik's gang, trading heated words before coming to an accord. Making a deal, the two gang leaders shook hands, finding common ground in their mutual hatred of Solo."}, {"tag": "p", "text": "Leech led Kanjiklub enforcers in a confrontation with Solo aboard his Baleen-class heavy freighter Eravana, joining the Guavians in cornering him inside his ship. However, their attempt to make Solo pay was interrupted when the scavenger Rey accidentally released his cargo of rathtars. The beasts rampaged through the ship, eating Kanjiklubbers and Guavians alike, and Tasu Leech was killed during the chaos."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tasu Leech claimed that even the Hutts feared him, and preferred to show victims his face before killing them. He was a brutal street fighter and refused to speak Galactic Basic Standard, dismissing it just a \"soft language for soft people\". Instead, Leech preferred to speak Jablogian and let his \"Huttsplitter\" blaster rifle do the talking."}, {"tag": "p", "text": "In combat, Leech could perform a nerve cluster punch."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tasu Leech wielded a \"Huttsplitter\" blaster rifle, custom-made by his lieutenant, Razoo Qin-Fee, with a gundark bone grip and a narglatch tusk vibro-spike under the barrel. He wore lightweight armor to avoid impeding agility, and a plastoid blast jerkin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tasu Leech was portrayed by Yayan Ruhian in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}