{"url": "Taun_We/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Clerical workers and assistants", "Category:Females", "Category:Galactic Republic individuals", "Category:Kaminoans", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Taun We"}, {"tag": "p", "text": "Taun We was a female Kaminoan who hailed from Kamino, an extragalactic world noted for its major cloning facilities. As the administrative aide of Prime Minister Lama Su, she was closely involved in the creation of the clone troopers, an army of elite soldiers bred to serve the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Project Coordinator"}, {"tag": "p", "text": "Approximately ten years before the Battle of Geonosis, Taun We and her people were hired by Jedi Master Sifo-Dyas to create a clone army for the Galactic Republic. In addition to her duties as administrative aide to Prime Minister Lama Su of Kamino, she also served as Project Coordinator for the Republic clone troopers. She closely monitored the development of the rank-and-file soldiers, as well as the training of a special unit known as clone commandos."}, {"tag": "p", "text": "During the accelerated growth and training process of the clone troopers, Taun We also acted as a guardian to Boba Fett, an unmodified clone of Jango Fett, the bounty hunter who had been selected to become the army's template. Whereas Fett felt no emotional sentiments toward the rest of his copies, he regarded Boba as the only \"true clone;\" a son to be raised and cared for. With only two other female influences—MU-12 and Zam Wesell—in Boba's life, Taun We became a virtual \"surrogate mother\" to Fett's son."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 22 BBY, Jedi Knight Obi-Wan Kenobi tracked Jango Fett to Tipoca City, the planetary capital of Kamino. Unaware of Kenobi's mission, Taun We assumed that he was a Jedi representative sent to gather a progress report on the clone army. She and Lama Su personally escorted Kenobi on a tour through their clone military education complex, proudly displaying the Kaminoans' creations to their Jedi guest. She then introduced Kenobi to Boba and Jango Fett, whom Kenobi deduced to be the hunter he was sent after. Before reporting his findings to the Jedi High Council, Kenobi was informed by Taun We that the battle-ready clone battalions were prepared for deployment, although additional troopers required more time to be grown."}, {"tag": "p", "text": "After Supreme Chancellor Palpatine activated the clone troopers as the Republic's official army, under the command of Jedi officers, the Republic entered into a state of war—known as the Clone Wars—against the Separatist rebellion. When the Separatist forces invaded Kamino in an attempt to destroy the Republic's primary cloning source, Taun We helped to coordinate the planet's defenses in order to protect the Kaminoan facilities. Although most of their remaining units were unfit for combat, as Taun We noted during the fighting, Kamino was ultimately spared from conquest by the combined efforts of Jedi and Alpha-class ARC troopers."}, {"tag": "p", "text": "However, the true purpose of the Clone Wars was the eradication of the Jedi Order and the creation of Sith galactic hegemony. In 19 BBY, the Sith Lord Darth Sidious, publicly known as Chancellor Palpatine, issued Order 66 and hence declared all Jedi as enemies of the Republic. In the aftermath of the purge, Palpatine used the programmed loyalty of the clone troopers to enforce the rise of his New Order, a Galactic Empire ruled by himself as emperor. The clones, reorganized into Imperial stormtroopers, were used by the Empire to enforce the Emperor's reign on various worlds, including Taun We's homeworld of Kamino, which ultimately lost its independence as a result of its own creations."}, {"tag": "h3", "text": "Later years"}, {"tag": "p", "text": "Following the end of the Clone Wars, Taun We lived through several long time periods such as the era of Imperialization, the Galactic Civil War and the Yuuzhan Vong War. Though she was still alive as of 40 ABY, Taun We no longer served the government of Kamino; her planet having been reduced to a shadow of its former self. Employed by Arkanian Microtechnologies, she was stationed in the company's facility on Vohai in the Parmel sector. By then, a much older and terminally-ill Boba Fett discovered Taun We's location and forced her to divulge any information that could reverse his condition."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Taun We was polite and courteous, possessing a gentle nature that made her fair to everyone. Tall and graceful, the female Kaminoan was considered beautiful and elegant; her personality and understanding of Human emotional psychology qualified her as the Project Coordinator for a Republic Army of Human clones. Yet despite being well-versed in Human behavior, Taun We was also naïve enough to not realize that Obi-Wan Kenobi did not know about the clone army's existence before his arrival on Kamino. Her talent for nurturing young clones aided in the development of a relationship between her and Boba Fett, who viewed her as the closest example he had to a mother figure."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taun We was an entirely computer-generated character. She was voiced by Rena Owen, who described Taun We as a creature of love and light. Owen performed Taun We's voice on set, wearing a specially modified hardhat with a maquette of the alien's head on top, which provided her co-stars with the proper line-of-sight for talking with the two-meter tall alien."}, {"tag": "p", "text": "Taun We is a playable character in LEGO Star Wars: The Complete Saga, except in the Nintendo DS version, where she appears as a non-playable character during the Kamino level, guiding the player."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}