{"url": "Taung/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds species", "Category:Extinct sentient species", "Category:Human and Near-Human species", "Category:Mandalorian culture", "Category:Outer Rim Territories species", "Category:Pre-Republic", "Category:Taung"], "nodes": [{"tag": "h1", "text": "Taung"}, {"tag": "p", "text": "The Taungs were an ancient species of humanoid simians. Indigenous to the galactic Core World of Coruscant, the two-meter-tall, gray-skinned Taungs were warriors from youth, and viewed battle as a source of honor both for the individual and their gods. Famous for their struggles against the Human Battalions of Zhell—prehistoric Coruscant's other major power—the Taungs waged war against their enemies for hundreds of years. When a powerful volcano erupted and devastated the Zhell, spewing ash into the sky with such density it blocked out the light of Coruscant's sun, the Taungs labeled themselves the \"Warriors of the Shadow\", or Dha Werda Verda in their language. Despite their loss, the Zhell eventually managed to drive the Taungs from Coruscant, and the defeated Taungs fled to the planet Roon, located in the Outer Rim. There they remained for millennia, until legendary Mandalore the First led the Taungs to conquer a new world which they named Mandalore in honor of their leader, and the Taungs subsequently recast themselves as the Mandalorians or Mando'ade—\"Sons and Daughters of Mandalore.\""}, {"tag": "p", "text": "As the newly entitled Mandalorians, the Taungs set out to conquer the worlds around their new home, their nomadic nature and worship of war driving them crusading outward as they increased their territory. Under the rule of Mandalore the Indomitable, another Taung warlord following in the leadership tradition established by Mandalore the First, the Taungs began to take in beings of other species into their culture, transforming what it meant to be Mandalorian forever after. This willing acceptance of other beings peaked during the Mandalorian Wars, when Mandalore the Ultimate led the Mandalorians on a campaign against the military forces of the Galactic Republic. Though initially victorious, the intervention of the Jedi Knight Revan and his loyal Jedi followers turned the tide of the war against the Mandalorians, culminating with the devastation of the planet Malachor V. The Taung race had suffered heavy losses during the war, and by its end, were generally believed to have drifted into extinction, survived by the legacy of the Mandalorian culture they had passed on, that remembered the Taungs as the Progenitors."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A Humanoid species, the Taungs were a bipedal race of sentient simians. Gray-skinned and yellow-eyed, Taungs were typically tall and strong. On average, Taungs reached a height of two meters, and weighed around ninety-five kilograms. Taungs were known to be extremely resilient, able to endure physical hardships that many other species could not. Their five fingers were tipped with sharp claws, and bony ridges adorned the top of their skulls. Taung lifespans were known to reach and occasionally exceed eighty-five years. Considered children until the age of six, Taungs attained adulthood when they turned thirteen, passed through middle age between the years of forty-six and sixty-four, and were viewed as elderly beyond the age of sixty-five. Galactic historical records document no known instances of Taungs with a sensitivity to the Force."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Taung society was nomadic and clan-based. Veterans of successful campaigns were honored, and looked upon with reverence. These battle-tested elders became chieftains, de facto leaders of their clan and community; higher authority came only from the Mand'alor, a title that meant \"Sole Ruler\" in the Taung language, and a role that embodied a single leader of all the warrior clans. These aspects continued on throughout later Mandalorian culture long after the Taungs themselves had passed from the galaxy. Pragmatism and ruthlessness were common traits among the Taungs, matched only by their loyalty to their clan kinsmen. Their practical nature was reflected in their naming practices, typically choosing names that corresponded to traits they deemed desirable. Common names included such examples as Atin, Kot, and Tor—meaning \"persistent\", \"strength\", and \"justice\", respectively. The Taungs spoke an archaic form of what later became the Mandalorian language of Mando'a."}, {"tag": "p", "text": "The civilization of the Taungs was one steeped in war, and the Taungs were warriors above all else. Their combat-centered nature gave rise to a religious warrior society governed by elaborate laws that evolved into the Canons of Honor. Early in their history, the Taungs waged war as a means of ritual worship to their god Kad Ha'rangir—a destroyer god they believed to personify change and growth. The Taungs sought the favor of Kad Ha'rangir as they denied the temptations of Arasuum, the sloth-god who was an avatar of idleness and stagnation. But after the Taungs had recast themselves as the Mandalorians, and Mandalore the Indomitable had risen to lead them, the act of war itself became the center of Mandalorian worship, and to wage war was to be divine. Disputes were resolved through Taung blood duels that involved a challenge to single combat in a fight to the death."}, {"tag": "p", "text": "Despite their violent, warring nature, the Taungs were far from primitive, and maintained a high priority of procuring the latest in technological advancement whenever possible, often through the plundering of a defeated foe. The tradition of Mandalorian armor began with the culture's Taung founders, and their unique helmets and war masks were forged in the image of the Taungs' face, including slanted outer angles and a pointed chin. Unlike later iterations, the armor of the Taungs was sparse in its armament due to their belief that it was unarmed combat that brought the highest honor. Taung children were trained in martial arts from a young age, and tested themselves repeatedly in numerous physical and mental challenges prior to achieving adulthood. The experience and skills they obtained through their robust upbringing made wandering Taungs valuable assets to mercenary companies."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "War for a world"}, {"tag": "p", "text": "The Taungs evolved on the planet Coruscant, located in the central region of the galaxy known as the Core Worlds. During the pre-Republic era, the Taungs inhabited Coruscant alongside the other major power to arise on the prehistoric world, the Zhell. The Zhell—thirteen tribes of Humans who also evolved on ancient Coruscant—and the Taungs waged war against each other for hundreds of years, struggling for control of the planet. At some point amidst their warring, a volcanic eruption brought devastation upon the Battalions of Zhell, when it smothered their city with thick ash and nearly destroyed the early Human race. The enormous plume of released ash and smoke was so dense and wide-spread across the sky, that it blocked out the light from Coruscant's sun, leaving the land beneath in darkness for two years. The Taungs leaped at the advantage nature had provided, and in the aftermath of the eruption, subjugated their age-old enemy. They viewed the smoke and shadow as an emblem of their destiny, and it was then that they adopted the name Dha Werda Verda for themselves, a title that meant \"Warriors of the Shadow\" in the Taung language."}, {"tag": "p", "text": "However, the Taungs' victory over the Zhell was doomed to be a fleeting one. Over time, the Zhell eventually managed to win back control of Coruscant and drive the Taungs from their shared homeworld. Though an offshoot sect of priestly female Taungs fled Coruscant for the galaxy's Unknown Regions in pursuit of atonement through introspective meditation, the majority of the Taungs were forced to flee to the planet Roon in the Outer Rim, there the Taungs remained until the legendary leader, Mandalore the First, led his people to seek a new world. The Taungs found another planet in the Outer Rim—a world of multiple ecosystems, uninhabited by intelligent life, and dominated only by a race of non-sentient creatures of colossal size known as mythosaurs—and claimed this new planet as their own."}, {"tag": "h3", "text": "Mandalorian rebirth"}, {"tag": "p", "text": "In honor of their leader, Mandalore the First, the Taungs named the newly conquered world Manda'yaim, or \"home of the Mand'alor, which was later transliterated simply as Mandalore in the language of Galactic Basic Standard. Similarly, the Taungs recast themselves as the Mandalorians, or Mando'ade: \"sons and daughters of Mandalore.\" The newly branded Mandalorians set to taming their new world, and in the process slaughtered the enormous mythosaurs, leaving only their skeletons behind. The planet Mandalore became the home of fierce clans of masked Taung warriors led by a single warlord who always adopted the name Mand'alor, meaning \"sole ruler\" in their language, after Mandalore the First. Over time, however, a single world proved not to be enough for the Mandalorian Taungs, and they set out to conquer other planets and battle new foes."}, {"tag": "p", "text": "The Mandalorians warred with the insectoid Nevoota species, a conflict which saw the demise of the Nevoota and the deification of war itself by the early Mandalorians. With this new religious shift, the Taungs' conquests evolved into holy crusades, and they took on the additional, informal descriptor of \"Mandalorian Crusaders.\" Their new outlook led the Crusaders to later annihilate several other species in their entirety, including the Fenelar, Kuarans, Tlönians, and the Basiliskans—obtaining their infamous Basilisk war droid mounts from the latter. The Taungs only truly met their match with the inhabitants of the planet neighboring their new homeworld of Mandalore, Mandallia. The native Mandallian Giants were large in stature and ferocious in combat, repelling the Taungs' offensive in such a manner that the Mandallians earned the respect of their would-be conquerors, and were granted the opportunity to fight beside them as fellow Mandalorians. Yet the Mandallians were only the first non-Taungs taken into the Mandalorian fold, and as the Mandalorians continued to strike at other worlds, individuals that impressed the warriors were often accepted into the culture, including the likes of the Zeltron scientist Antos Wyrick and numerous other Iskalloni slaves, who joined after the Crusaders' invasion of Iskadrell. This willing acceptance of beings from other species forever changed what it meant to be a Mandalorian, moving the word from simply another name for the Taungs, to an encompassing term for a single shared culture uniting many different beings."}, {"tag": "h3", "text": "Old Sith Wars and decline"}, {"tag": "p", "text": "The Mandalorians, both Taungs and otherwise, were drawn into a whole new war when the latest in the tradition of the Mand'alor, a Taung warrior by the sobriquet Mandalore the Indomitable, challenged the fallen Jedi Ulic Qel-Droma. The former Jedi Knight bested Mandalore the Indomitable in single combat on the planet Kuar, and from that point the Mand'alor swore the loyalty of he and his followers to Qel-Droma and, by extension, his Sith Master Exar Kun. The Mandalorians waged war against the Galactic Republic on behalf of the Sith, even striking against their former homeworld of Coruscant, but when they had been tasked with taking the planet Onderon late in the campaign, Mandalore the Indomitable was slain within the jungles of Onderon's moon, Dxun. Another Taung took up his ceremonial mask and became the new Mand'alor, proclaiming himself Mandalore the Ultimate. The new Mand'alor—spurred on by elements of the Sith Empire in hiding—encouraged the Taung belief that the foretold \"Last Great Battle\" was fast approaching. Under his leadership, the acceptance of non-Taungs into the Mandalorian culture grew to an all-time high as he prepared for full-scale war against the Galactic Republic."}, {"tag": "p", "text": "Under Mandalore the Ultimate, the Mandalorians expanded their sector of space as they proceeded to conquer world after world until the Republic finally moved to engage the rising Mandalorian threat. In what became known as the Mandalorian Wars, one of several conflicts that were later grouped under the unofficial compilation, the \"Old Sith Wars,\" the Republic clashed with Mandalorian Neo-Crusaders across the galaxy in a sixteen-year-long struggle. However, it was only with the intervention of a group of Jedi lead by the Jedi Knight Revan, that the Republic was truly able to turn the tide against the Mandalorians. Revan fought and killed Mandalore the Ultimate at Malachor V, bringing an end to the Mandalorian Wars not long after."}, {"tag": "p", "text": "The Mandalorian Wars had been one of the bloodiest conflicts in the history of the Republic, and the casualties among the Taung species had been severe. By the war's end, most believed that the Taungs had been driven to extinction, though at least one Mandalorian Taung—an unsubstantiated claimant to the title of Mand'alor—survived for several years after the war's end. Several hundred years later, during the time of the Cold War—a proxy conflict between the Sith Empire and Galactic Republic—a number of surviving female Taungs from the priestly Warriors of Shadow sect fought the religious order of the Knell of Muspilli above a nameless moon in the Unknown Regions. Eventually, someone was sent to study the wreckage of the battle that had been left behind."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Long after the Taungs departure from the galaxy, their impact remained. In 15 BBY, the Human merchant Mungo Baobab discovered the fabled Roonstones on the planet Roon. Encoded in one of the Roonstones was an ancient recording of the poem Dha Werda Verda, detailing the Taungs' struggle against the Zhell on prehistoric Coruscant in an archaic form of Basic. Another iteration of the Dha Werda Verda, a thunderous battle chant in Mando'a, was passed through Mandalorian culture for ages, and even adapted by Mand'alor Jango Fett for clone trainees in the Grand Army of the Republic prior to the start of the Clone Wars."}, {"tag": "p", "text": "The Taungs' most lasting contribution to the history of the galaxy was the Mandalorian culture itself, which outlived its founders by more than four thousand years. Though anthropologists would later be divided over whether it was indeed the Taungs who were the first Mandalorians, quarreling over the similarities between the Mandalorian language and the remaining Taung texts, the Mandalorians followed in the example of the Taungs as nomadic warriors for much of their history, though they became a much more diversified group of beings from countless species and walks of life, all united by the common culture."}, {"tag": "p", "text": "Far from the warrior culture of the Mandalorians, the Warriors of Shadow―the sisterhood of priestly Taungs that elected to flee ancient Coruscant for the Unknown Regions after their defeat at the hands of the Zhell―had a profound impact on the foundation of an entirely different group altogether: the Sorcerers of Rhand. These female Taungs, who believed in seeking atonement through meditation and introspection, joined the Knell of Muspilli death cult, and the fanatical Kanzer Exiles to inspire the teachings of the Sorcerers of Rhand, when over thousands of years, the three unique philosophies and belief systems merged to form a unique new culture that revered the Way of the Dark."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Taungs were first introduced to the Star Wars universe in the Star Wars: Tales of the Jedi — The Sith War comic book series, though at the time, they were known only as the Mandalorian species. The liner notes for the Shadows of the Empire soundtrack first provided the \"Taung\" name, and it was the Star Wars Insider article, The History of the Mandalorians, that established that the grey-skinned beings from the Tales of the Jedi comics were the Taung race. The History of the Mandalorians further elaborated on the Taungs as the precursors of the Mandalorian culture, and the Galaxy at War sourcebook provided biological and cultural information on the Taung species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}