{"url": "Tau_Idair", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Jedi Knights of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Tau Idair"}, {"tag": "p", "text": "Tau Idair was a female human Jedi Knight serving the Jedi Order and the Galactic Republic during the Galactic War and the ensuing conflict with the Eternal Empire. The surprise attack of the Eternal Empire on both the Sith Empire and the Galactic Republic saw Jedi numbers thin over time, leading to surviving Jedi going underground. Jedi Master Gnost-Dural recruited her to join him on Ossus after the two survived a grueling campaign on Mimban."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human female, Tau Idair was trained by the Jedi Order in the ways of the Force from an early age. A natural in lightsaber techniques, Idair constructed her own green-bladed lightsaber as part of her training, and heavily modified and tinkered with it over time. Idair was eventually raised to the rank of Jedi Knight sometime before the Galactic War, and would go on to fight against the Sith Empire. During that war, in 3640 BBY, she was stationed on Corellia as her first assignment. During the ensuing fighting, a Sith jumped aboard her transport and slew five of her oldest friends in quick succession with his two lightsabers before she could move to stop them. Idair killed the Sith in brutal fashion, however, beating him with her bare hands when he turned on the pilot, then pushing him out of the ship with his grenade in his mouth. This event weighed heavily upon her in the years following the incident, and left her questioning her worth as a Jedi."}, {"tag": "p", "text": "Idair later fought back against the Eternal Empire following their campaign against both the Sith Empire, the Jedi Order, and the Galactic Republic. Their campaign saw the Jedi numbers thin out to the point where those remaining, including the Grand Master Satele Shan, either went into hiding or disappeared, hoping to regroup with other Jedi. Eventually, Idair found herself fighting alongside Jedi Master Gnost-Dural in a lengthy campaign in the swamps of Mimban, resulting in the pair being among the only survivors. Following this, Idair joined Gnost-Dural on Ossus after being convinced to come with him instead of walking her own path alone. She spent the first two years just learning to relax  as she constantly worried that someone would show up, looking for blood. Over this time, she’d assist in recruiting others to their colony, soon, the colony's ranks included the seasoned doctor Archiban Frodrick Kimble and the Jedi Knight Nadia Grell."}, {"tag": "p", "text": "Idair’s fears turned out to be justified, however. In the year 3628 BBY, in the wake of an imminent Sith invasion force led by Darth Malora, Tau began aiding in the defense of the colony. It was at this time that the Alliance Commander was contacted by General Daeruun to help in the same goal, leading to a meeting between Idair and the Commander as she returned to report on perimeter alarms and incoming mutated Geonosian forces."}, {"tag": "p", "text": "Gnost-Dural introduced the two, before asking the Commander if they would assist Idair in holding off the enemy. Idair initially was apprehensive, stating that she didn’t need any help, as she had all the back-up she needed in the form of her lightsaber. However, she acquiesced to the offered assistance by the Commander and filled them in on the mutated geonosians that the sensors had picked up, and further went into detail about the Sith leading them, Malora, explaining that she sought to control life itself and saw war as nothing more than a playground for her monstrosities."}, {"tag": "p", "text": "Idair then referred to the old ruins riddled all over Ossus, and how the geonosians would cut through them to approach unseen. Filling the Commander in on her plan to stop their advance by collapsing the tunnels themselves, the Commander and Idair set off on their mission."}, {"tag": "p", "text": "After collapsing many of the tunnels, and rescuing some artifacts from some of the ruins, Idair opened up to the Commander about her experience on Corellia, and lamented upon her actions. The Commander tried to console Idair, but Idair brushed it away, instead deciding to report their progress in the mission to Gnost-Dural, who informed them of a final tunnel to collapse that would seal off the mutant geonosians hidden approaches completely."}, {"tag": "p", "text": "On their way to the final tunnel, Idair recalled that the Sith once fried Ossus with a supernova, and jokingly commented that she didn’t know how the Sith planned to top themselves this time around. When the Commander asked if anyone had survived the supernova, Idair stated that she and Gnost-Dural believed there was, due to the fact that every time they dug into the deeper chambers of the old ruins weird things began to happen, such as tools and lights going missing, and footprints appearing in the sand where no one had walked. Idair noted that she could feel some kind of life there apart from the colonists, and that whoever they were, they were staying hidden, which she thought to be a smart move. The Commander changed the subject, asking what the plan would have been had the Sith not shown up at the colony, and Idair stated that she would have set out with a team to find other Jedi and bring them back to Ossus, so as to rebuild the order, but she shook the idea off, as with the arrival of the Sith they had instead fallen back to war."}, {"tag": "p", "text": "Following their collapse of the final cave, Idair tried to contact Gnost-Dural, but was unable to as the sensors had been jammed preceding the Empire’s official invasion of the planet. The two returned to the colony and spoke to Gnost-Dural in person, who informed them that the Empire’s change in tactics did not fit Malora’s style, commenting on how strange the situation had become and urging the group to move quickly. He mentioned that there were still many people outside of the colony, at the farms and at the library, and that they should split up to cover both areas at once. Idair jokingly told Gnost-Dural that he didn’t need to act as if they had a choice on who would go where, as she knew he wanted to see the library one last time before leaving the planet. The Commander assured Gnost-Dural that they and Tau would handle the farms, then meet up with him at the library, before giving him a direct frequency to General Daeruun. Tau sarcastically commented that she was sure the Republic would just sweep in and save the day, to which Gnost-Dural responded by saying that even if the Republic simply picked up their evacuation craft it would be a huge help."}, {"tag": "p", "text": "Before the Commander and Idair departed however, Gnost-Dural stopped Idair to speak to her on the matter of her taking a padawan, despite Idair’s protests that it wasn’t a good time for said discussion, protests that were rebutted by Gnost-Dural who stated it was always a good time to learn, teach, and grow. Idair dismissed the idea, claiming that the Order didn’t need more Jedi like her, but Gnost-Dural told her that despite her thoughts to the contrary, she wasn’t a bad Jedi, and she was more than the killer she saw in herself. Idair thanked Gnost-Dural for believing in her, but claimed that she just wasn’t ready, and they had more pressing matters to deal with. Gnost-Dural agreed, telling her to go check on the farms while he checked on the library, and then afterwards they’d meet up so she could select her padawan."}, {"tag": "p", "text": "Idair and the Commander departed for the farms, setting up the perimeter defense turrets before going to find Nadia Grell and the other farmers. They found Nadia speaking to a man named Zaryos, who specified that they could not leave until they had downloaded their data to an astromech droid, emphasizing that they found out how to grow crops in a radioactive wasteland, and that such information would be invaluable to the Republic. Idair assured Zaryos that they had it covered, and that he should get to the shuttles so everyone could get loaded up faster. When the Commander also insisted upon it, Zaryos relented and left the data in the hands of Idair, Nadia, and the Commander, just as Imperial soldiers arrived. The three were able to fight off the Imperials and save the data, however, Idair was clearly bothered by the whole affair, as unlike the mutated Geonosians, the Imperials were not brainless monsters, but fighting them didn’t feel any different to her. Even with the Commander’s reassurances however, Idair still seemed shaken up, and stated that they needed to move along and get to the library to aid Gnost-Dural."}, {"tag": "p", "text": "Upon arriving at the library, Idair and the Commander found it under assault by Imperial forces. Racing inside while fighting through the chaos, they found Gnost-Dural severely wounded, with Darth Malora pacing about in front of him, rambling on about trying to find something. When Idair confronted Malora, and Malora informed her that they were probably too late to help Gnost-Dural, Idair ignited her lightsaber stating that Malora had said the wrong answer. Following this, Idair and the Commander fought Malora and a number of her Geonosian mutants, ultimately defeating her. Upon her defeat, Idair discovered that Gnost-Dural was still alive, to which Malora commented that Darth Malgus must be losing his touch, revealing to the Commander that Malgus was still very much alive despite his supposed death over Ilum. Shortly thereafter, Malgus’ forces flew overhead on their way to destroy the colony, but they were intercepted by Republic fighters which had just arrived on Ossus. Idair proclaimed shock and relief at this, just as the Commander was contacted by General Daeruun. Idair requested Daeruun send medics, just as Malora attempted to get away. However, Idair stopped her, saying that she never said Malora could leave, and Malora was taken prisoner by the Commander shortly thereafter."}, {"tag": "p", "text": "Idair and the Commander met up with General Daeruun at the colony, who informed them of his plans for transporting the colony’s evacuees to safety in Republic Space, while also establishing an outpost in the colony itself to help in keeping the planet under control. Idair questioned if they had potentially shot down Malgus and killed him, to which Daeruun expressed doubt, claiming that it was a bit too much to hope for."}, {"tag": "p", "text": "Soon after, Idair expressed interest in joining up with the Republic, volunteering to aid General Daeruun in his fight against the Sith, before thanking the Commander for their help in defending Ossus and the people there. With that, Idair departed to prepare to leave the colony."}, {"tag": "p", "text": "After the Commander, Arn Peralun, and Aryn Leneer returned from their expedition to the ruined Dantooine Jedi Enclave, where they investigated the whereabouts of Darth Malgus, she was among the Jedi selected by Gnost-Dural to discuss their next moves in rebuilding the Jedi. Gnost-Dural chose to invite her, along with Sal-Deron and Vinyor Tesh to the meeting because Gnost-Dural considered them among the Jedi Order's most important representatives."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The years of conflict wore heavily on Idair, who found it easier to battle mindless monsters than sentient opponents. Idair also suffered from extreme survivor's guilt after losing fellow Jedi on Corellia. This  made her reluctant to take on a Padawan. Gnost-Dural noted that she thinks of herself as \"bad Jedi\" when so many \"good Jedi\" have fallen in her place and believed that she can move past the killer she saw herself as if given the opportunity to teach and grow. Ultimately, Idair accepted that she couldn't stand by while the evils of the Sith Empire continued to spread."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Tau Idair used telekinesis and Force Stun. In combat, Idair wielded a green single-bladed Jedi lightsaber which she often modified."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tau Idair first appeared in the 2018 update for Star Wars: The Old Republic. Idair is voiced by Enuka Okuma."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "p", "text": "If the player chooses to side with the Republic in the Jedi Under Siege storyline, Tau Idair acts as a temporary companion for the duration of the Ossus storyline. During the fight with Darth Malora in the Jedi Library, the player can choose to kill Malora instead of taking her prisoner, which will grant dark side points."}, {"tag": "p", "text": "On Mek-Sha, during Onslaught, an Imperial character who has chosen to sabotage the Empire's efforts for the Republic has an option to tell Tau \"You have nothing to fear from me, Jedi\", whether she understood that remark is unclear.  A loyal Imperial has the option to tell her she cannot win."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}