{"url": "Taurill/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Hive-mind species", "Category:Primate sentient species", "Category:Semi-sentient species", "Category:Taurill"], "nodes": [{"tag": "h1", "text": "Taurill"}, {"tag": "p", "text": "Taurill were small, multi-limbed, furry creatures. They scurried about in a way that reminded many sentient beings of vermin. During most of their history, the galactic community considered the Taurill to be a non-sentient or semi-sentient species. However, the Taurill had a hive mind controlled by the Taurill Overmind that gave them full sentience, although an individual Taurill was really only another set of photoreceptors and manipulative organs for the Overmind. When one Taurill noticed something of interest for the Overmind, nearby Taurill ran to analyze that same object from different perspectives, feeding the Overmind with information."}, {"tag": "p", "text": "At some point before 12 ABY, Durga Besadii Tai, a Hutt crime lord, came across the Taurill and made a deal with the Overmind. As a result, Durga began to travel in the company of a swarm of his supposed pet Taurill, and he sometimes used them as spies or saboteurs. At one point, he even used the Taurill to build a superweapon, the Darksaber, but his scheme was a disaster and ended in the death of the Hutt and all of the Taurill involved in the project."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The body of a Taurill was covered in gray-brown fur, except for the tail, the head, and the limbs. The head was shaped like a Human skull, except for its two constantly-blinking, big, curious eyes distanced from the head by ommatophora. A Taurill had six jagged, pointed limbs. Four of those appendages were arms, characterized by their malleability and their sturdiness. The other two were commonly used as legs, but in certain situations they could be adjusted to be used as a third set of arms, as was readily apparent when the Taurill's movements were seen. Each of the four arms ended in a three-fingered manipulator, while each leg had a pointed, non-fingered end. In addition, a Taurill also had a segmented, arrow-headed tail."}, {"tag": "p", "text": "Taurill were small creatures that stopped growing once they reached a length of 1.20 meters. They were flexible enough to squeeze their bodies if needed to explore through very narrow openings. While the Taurill were simian and indeed retained several physical traits of apes, at the same time they also resembled lice."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "While there were thousands of individual Taurill, all of them were controlled by a single collective consciousness, known as the Taurill Overmind, or simply Overmind, to the extent that a Taurill \"individual\" was only a set of sensory and manipulative organs for a single organism that made up the whole species. This could also be expressed in a simplified form by saying that Taurill were \"eusocial.\""}, {"tag": "p", "text": "The hive mind was interested in gathering information, using the individual Taurill to do so. The Taurill were thus known to look intently in all available directions, as if they were paranoid, to feed information to the Overmind; to outsiders, each individual seemed to be trying to gather information for its own interests. The Taurill would swarm over, crawl over, and touch anything or anyone in their range, unless they were met with some resistance. While in this mode, Taurill would move constantly in a vermin-like way. Taurill were also known to race around. At least some individual Taurill had names, as was the case of Bortis."}, {"tag": "p", "text": "Individual Taurill did not have independent thoughts, recognizable emotions, or abstract motivations, leading to the species being classified as semi-sentient. However, considering the hive mind, the Taurill fulfilled the requirements of sentience. Users of the Force scanning the Taurill for intelligence only felt weak, blurred impressions from the collective mind. As discovered by scientist Mammon Hoole, a Taurill had to be near a collective of other Taurill to receive instructions from the Overmind. Should a Taurill be far enough from the group—a rare circumstance under normal conditions—its body would stop moving, as the brain would have stopped to send it any orders. Although the body would remain biologically alive, it would eventually die of hunger or dehydration and would take no independent measure to feed itself. When Taurill did eat, their diet included shag ferns."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "First contact"}, {"tag": "p", "text": "While the native planet of the Taurill was unknown, the species was already known—and labeled non-sentient—in the later years of the Old Republic. In 22 BBY, the individual Taurill Bortis showed a systematic skill to play the sport known as greenputt which, along with the discovery of capable neek players, led to the creation of the Non-Sentient Professional Greenputt Tour."}, {"tag": "p", "text": "At some point, a xenobiologist working as a scout discovered the hive mind of this species while researching in the Outer Rim Territories. This individual sold this information to Durga Besadii Tai, a young Hutt crime lord. Planning to obtain a profit from the Taurill, Durga killed the scout to protect the secret, and then approached the Taurill to make a deal. The Hutt offered power and wealth, but the Overmind declined, as it had no need for fortune. The Overmind instead asked Durga to scatter individual Taurill throughout the galaxy, allowing the Overmind to grow. Durga readily accepted and was assigned thousands of Taurill. The Hutt trained the creatures to behave as his pets and to run whenever he clapped his hands. The creatures proved themselves excellent pets."}, {"tag": "h3", "text": "Stealing the Death Star plans"}, {"tag": "p", "text": "In 12 ABY, Durga visted Chief of State Leia Organa Solo of the New Republic in Coruscant as a cover to steal the schemes of the first Death Star from the Imperial Palace. Durga was to be in the company of ninety-eight Taurill that had already received specific instructions of how to behave. The creatures, being from an uncommon species, surprised Organa Solo and her companions, an effect not repeated by the appearance of Durga's Gamorrean slave entourage. When directly asked about the creatures, Durga mentioned that they were harmless, semi-sentient pets. During the meeting, the Hutt signaled for the Taurill to disperse, claiming that Organa Solo seemed to be distracted by the moving creatures crawling on Durga's body."}, {"tag": "p", "text": "Following their orders, two particular Taurill struggled with a guard, trying to seize his ceremonial rifle. One of the aliens tried to push himself in the barrel while the other \"accidentally\" pulled the trigger, killing his companion with a resounding blast. The guard was astonished at the situation and Durga pretended to be surprised. The remaining Taurill scattered, apparently scared at the explosion, with some of its fellows hiding in shadows, pieces of furniture, doors or ducts. Durga again pretended to be worried about his pets and ordered the guards to capture all of them."}, {"tag": "p", "text": "The New Republic guards and Organa Solo's droid C-3PO began tracking the Taurill, as the Gamorreans proved to be inept for this task. Predictably, this endeavor took several minutes. Meanwhile, three Taurill took advantage of the chaos to reach the Imperial Information Center, in a lower level of the palace, dodging guard droids and accessing a computer terminal. Using special codes provided by Durga, they accessed secret information, saved it in a small data cylinder and hid it in the fur of one of the creatures. The Overmind instantly knew of their success and reported to Durga using another Taurill, one that had been \"re-captured\" by the Hutt. Durga then ordered one of his assistants to blow an instrument to supposedly soothe the Taurill and summon them. Once the Taurill had been gathered, the Gamorreans attempted to count them, but their skills were limited and they required C-3PO's help. Durga attempted to blame Organa Solo for the accident, but she refused to accept culpability and instead accused Durga of bringing uncontrollable pets to diplomatic meetings."}, {"tag": "h3", "text": "Constructing the Darksaber"}, {"tag": "p", "text": "Soon afterward, C-3PO found Taurill fur in the keyboard the Taurill spy had used. Along with R2-D2, the protocol droid discovered the crime performed by the Taurill and reported to Organa Solo. After this, the Chief of State wrote a report explaining the situation and the Taurill incident and decided to send a military team to deal with Durga's scheme. Meanwhile, two of Durga's allies, General Sulamar and Doctor Bevel Lemelisk, used the stolen information to build a new superweapon in the safe environment of the Hoth asteroid field. Lemelisk developed the design and trained two individual Taurill to build it, having been told that the whole workforce would get the same knowledge, and provided them with customized space suits. As the Taurill worked harder than common sentient workers, Lemelisk estimated that they would build the superweapon faster than any other workforce. The Taurill began to work as a swarm, following Lemelisk's outlines."}, {"tag": "p", "text": "While the Taurill workers appeared to be productive, enthusiastic builders, they were easily distracted: any novelty, such as a nearby moving asteroid or visible starship, attracted the Overmind's attention, who then sent individual Taurill to catch a new perspective of whatever it was. Once the event was over, the individuals took up their jobs again, but they did not return to their intended positions, and as such parts of the Darksaber's construction was incorrect. Because of the species' short attention span, the computer core was connected to a thermal exhaust port, the superlaser anchor points were offset ninety degrees from each other, and several beams were welded to inappropriate places. Lemelisk discovered this disaster but decided to not report it to Durga, as the Hutt could easily blame Lemelisk. Instead, Lemelisk doubled the Taurill shift and supervised them to solve the mistakes. This was achieved in two days."}, {"tag": "p", "text": "Soon after, Durga required Lemelisk's presence on Nar Shaddaa. Durga believed the Taurill were performing nicely and Lemelisk could not correct him without risking his wrath. Thus, Lemelisk told Sulamar about the situation. In Lemelisk's absence, Sulamar worked to keep under control the delays caused by Taurill's short attention span."}, {"tag": "p", "text": "The superweapon turned out to be useless due to the Taurill's faulty work and the defective materials used in the construction; Lemelisk noted that anyone with a training in technology would have been aware of the weapon's flaws, and only managed to keep a timetable by writing false results. He eventually declared the construction finished, and the Taurill stopped working, instead simply inhabiting the inner rooms of the so-called Darksaber. Several New Republic agents infiltrated the Darksaber, but one of them, General Crix Madine, was captured and taken to Durga at the weapon's bridge. Durga then executed Madine, with several Taurill intently watching until Lemelisk shooed them away. The Taurill went back to other decks. Durga, still believing that his Taurill had done a good job, attempted to use the Darksaber to destroy an asteroid. The Darksaber did not work and was destroyed by the collision of two planetoids against its frame. Durga died, taking all of the Taurill on board with him. At some point after the Darksaber episode, Mammon Hoole included an entry on the Taurill in his publication The Essential Guide to Alien Species."}, {"tag": "h2", "text": "Taurill in the galaxy"}, {"tag": "p", "text": "In the times of the Old Republic, the existence of Taurill was known to the general public, as exemplified by Bortis. At that point, the Taurill were believed to be non-sentient. Only after Durga discovered the hive mind and made a deal with the Taurill did they have a chance to expand throughout the galaxy as was the Overmind's wish. From that point onward, the Taurill were mostly seen as Durga's personal pets."}, {"tag": "p", "text": "The collective mind of the Taurill was an important advantage when trying to create a unified Taurill workforce: the foreman only had to train one Taurill, and all of available Taurill would take advantage of that training. Although the Taurill would then work tirelessly, moved by an untiring Overmind, they were easily distracted, which could lead to spoiled work. Other limitations included the inability to develop advanced technology themselves, and their strange appearance that could confound the foreman."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Taurill first appeared in the novel Darksaber, written by Kevin J. Anderson, and first published in 1995. They were later mentioned in Stephen J. Sansweet's Star Wars Encyclopedia in 1998. The species was first graphically depicted in The Essential Chronology in 2000 with an illustration by Bill Hughes. In The New Jedi Order: Agents of Chaos II: Jedi Eclipse, the narrator compares a character's eyes moving with Taurill racing about. Had it been said by a character it would have meant that at that point, knowledge about Taurill was more extended. The Taurills were also mentioned in Checklist: 10 Star Wars Superweapons, an article written by Pablo Hidalgo and appearing on the official Star Wars site in 2008."}, {"tag": "p", "text": "The novel Darksaber does not specify the moment when Durga met the Taurill. As Durga was born in 105 BBY, this could have happened before the events told in the website HoloNetNews about Bortis, dated in 22 BBY. However, Durga was known to have been considered a pre-adult until 5 BBY; thus, it is unlikely that he could make such important deals and decisions before that point."}, {"tag": "p", "text": "The Essential Guide to Alien Species unambiguously lists the height of an adult Taurill as 1.20 meters. However, in Darksaber, Leia Organa Solo considers that one of those creatures has the approximate size of her forearm. The Essential Chronology provides a picture of the Taurill building the Darksaber and apparently surviving in a vacuum without the pressure suit Lemelisk provides them in the novel, directly contradicting that story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}