{"url": "Tavion_Axmis", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Jedi", "Category:Disciples of Ragnos members", "Category:Empire Reborn members", "Category:Females", "Category:Humans", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Tavion Axmis"}, {"tag": "p", "text": "Tavion Axmis was a Human female Dark Jedi who was at large during the early years of the New Republic. Apprenticed under the Dark Jedi Desann, Axmis traveled with him to find the lost Valley of the Jedi and served alongside him in Hethrir's Empire Reborn. After her defeat at the hands of Kyle Katarn and Desann's subsequent death, she became the leader of the Disciples of Ragnos cult. She took Alora as her apprentice, and set herself upon the task of resurrecting the ancient Sith Lord Marka Ragnos."}, {"tag": "p", "text": "During Luke Skywalker's search for the cult, she turned Rosh Penin, one of Katarn's apprentices and a student at the Jedi Praxeum, to the dark side of the Force. Katarn and his apprentice Jaden Korr encountered and confronted her, and Penin at Vjun. Following this, Axmis journeyed to the Sith tomb world of Korriban to resurrect Ragnos; Korr was sent to stop her, and he defeated her after a fierce duel. In desperation, Axmis let the spirit of Ragnos fill her, and he guided her body in combat. She was killed after Korr defeated Ragnos, her body unable to withstand the ordeal."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Desann's apprentice"}, {"tag": "p", "text": "Originally an Empire Youth in Lord Hethrir's Empire Reborn movement, Tavion Axmis displayed signs of Force-sensitivity and was \"purified\" by the extra-dimensional being Waru. She received training in the use of her Force abilities under Desann, Hethrir's right hand and failed Jedi trainee; during this training, Axmis was selected by Desann to be his personal apprentice, and the two conceived of a scheme to discover the location of the lost Valley of the Jedi. During the Battle of Artus Prime, Desann and Axmis intercepted Jan Ors, the partner of Kyle Katarn and one of the only two people to know the location of the Valley. Axmis managed to capture her and bring her aboard their shuttle. Katarn arrived to rescue his partner, only to be quickly defeated by Desann. On Desann's order Axmis, in the shuttle and out of Katarn's line of sight, activated her lightsaber and appeared to kill Ors. Desann spared Katarn and boarded his shuttle, leaving the planet with Axmis."}, {"tag": "p", "text": "However, they did not leave the system. When Katarn left in the Raven's Claw, he immediately went to the Valley of the Jedi to regain his former Force-sensitivity, with the intention of using it to exact revenge on Ors's killers. Desann and Axmis followed him there; as Desann piloted their ship to the planet's surface, Axmis contacted Admiral Galak Fyyar to alert him of the Valley's location. Soon after, Axmis and Desann brought the presumed-dead Jan Ors to Admiral Fyyar's flagship, the Doomgiver. After building up a deadly new force known as the Reborn, Axmis left her master's side to oversee Imperial Remnant forces on Bespin who were smuggling cortosis for the shadowtroopers."}, {"tag": "p", "text": "While on Bespin, Axmis confronted Kyle Katarn, whose search for Desann had led him to Cloud City. She taunted him, announcing that they had only killed Ors to trick him into leading them to the Valley, and congratulated him for beginning the \"era of Desann.\" After an intense duel on one of Cloud City's landing platforms, Axmis was overcome by Katarn's superior skill with a lightsaber. Angry over Ors's apparent death, Katarn held Axmis aloft with the Force over the platform's edge. Axmis begged for her life, saying that she was \"not brave enough to die\", and revealed to Katarn that Ors was alive on board the Doomgiver, which was docked at a base in the Lenico Belt. Katarn spared her, commanding her to get away before Desann found her."}, {"tag": "p", "text": "After obeying Katarn's order and escaping, Axmis lost her master, who was slain by Katarn in the underground of Yavin 4."}, {"tag": "h3", "text": "Cult leader"}, {"tag": "p", "text": "After Desann's death, Axmis took on an eager and sadistic apprentice: the Lethan Twi'lek female Alora. She then acquired an ancient artifact known as the Scepter of Ragnos from a merchant on Commenor, who did not survive their meeting. With the Scepter, she drained areas of the galaxy strong with the Force, and empowered her new followers, creating the Disciples of Ragnos, who sought to resurrect the ancient Dark Lord of the Sith known as Marka Ragnos. She invited surviving Reborn to join her, which became her New Reborn."}, {"tag": "p", "text": "Eventually Axmis made a bold move on Yavin 4, deploying Alora to infiltrate the Jedi Academy to access Luke Skywalker's private record of the locations of Force nexuses, while Axmis and the Kothos twins drained the Force energy at a Massassi Temple. To avoid interference, the energy of the scepter was harnessed to shoot down an arriving shuttle carrying a load of new Padawans. However, Axmis's actions did not go unnoticed; Jaden Korr, a newly arrived Jedi Padawan, made his way to the Temple after being separated from the main group of Jedi on the arriving starship. He spotted Axmis's activity, forcing her to knock him out with the energy of the scepter. Despite Korr's intervention, Axmis and her forces escaped Yavin 4 safely with the valuable data."}, {"tag": "p", "text": "Soon, Luke Skywalker dispatched the Jedi to areas of strong Force energy in an attempt to intercept the cult. One of these students, Rosh Penin, was captured by Axmis on his mission to Byss. She used his fear of being killed against him, and turned Penin to the dark side."}, {"tag": "p", "text": "Axmis and Penin traveled to Vjun, the location of Darth Vader's Bast Castle, and were attempting to drain the castle's Force energy when Jaden Korr arrived. Axmis remained in the shadows as the two former friends dueled. Axmis revealed herself after Korr defeated Penin and Kyle Katarn arrived. She refused to give up her new apprentice, and told Katarn to save his pity because of the shame he caused her on Bespin. Axmis ripped Korr's lightsaber from his grasp with the Force and threw it to weaken the ceiling, which she then brought down on the Jedi with the power of the Scepter of Ragnos. The ensuing chaos allowed her to escape with Penin."}, {"tag": "p", "text": "After neutralizing the cult's activities on Taspir III, Korr killed Alora and saved Penin, who was redeemed from the darkness. Korr and a team of Jedi then went to Korriban to stop Axmis from resurrecting Marka Ragnos, culminating in an epic battle between the Jedi and the Disciples of Ragnos."}, {"tag": "p", "text": "Korr made his way to the Tomb of Marka Ragnos and confronted Axmis, eventually defeating her; but she refused to cower as she did before Katarn. She took the Scepter of Ragnos and released all of the Scepter's remaining energy into the ancient Sith Lord's remains. Ragnos's spirit rose, infusing Axmis's body with his strength, and dueled Korr again using Ragnos's ancient Sith sword. Despite Axmis fighting with Ragnos's enhanced dark side abilities; Korr was able to destroy the Scepter, forcing Ragnos's spirit to flee back into his tomb. His departure from Axmis's body killed her, and all the energy the New Reborn had stolen was returned to its proper place in the galaxy. When Jaden exited from the ancient structure, he permanently sealed it shut by placing boulders in front of the exit, forever sealing Tavion's husk of a body inside the evil tomb."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Axmis was a powerful Dark Jedi skilled at lightsaber combat with occasional bouts of overconfidence masking an essential cowardice, exemplified by her begging for her life when she was defeated by Katarn. After the death of Desann, Axmis ably led the Disciples of Ragnos, training her apprentice Alora to exhibit her own ruthlessness. However, her overconfidence led to her death: in her duel with Jaden Korr, she tried to use Ragnos's spirit to kill the young Jedi, believing his death and Penin's fall to the dark side would make Katarn's efforts a failure, turning Katarn to the dark side. Instead, her overconfidence failed her, and she died when Ragnos's spirit withdrew from her body."}, {"tag": "p", "text": "Axmis's lightsaber was named \"Stinger.\""}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Axmis was an extremely lethal enemy. She possessed incredible skill with the lightsaber and was a master of a variation of the Fast style of saber combat, which she would later teach to her apprentice Alora. Axmis would typically utilize flashy acrobatics with her sword technique, constantly flipping and somersaulting around her opponent, attacking them from many different angles in an attempt to overwhelm their defenses with her lightning-quick strikes."}, {"tag": "p", "text": "She was also very powerful in the Force. She was capable of a strong Force push, and possessed a high level of skill with the abilities of Force lightning and Force grip."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Axmis was voiced by Kath Soucie in Star Wars: Jedi Knight II: Jedi Outcast and Star Wars: Jedi Academy."}, {"tag": "p", "text": "Although her last name is never stated in the games, Axmis is the surname written in the Holocron continuity database."}, {"tag": "h3", "text": "Axmis's homeworld"}, {"tag": "p", "text": "Although there is no clear evidence, it is possible that Axmis may have been one of the Nightsisters—dark side witches from Dathomir, some of whom escaped the remote world despite its Imperial blockade. Both Axmis's style of clothing and her facial tattoo could be marks of a possible Dathomiri ancestry. Additionally, Luke Skywalker heard rumors about her when on a recruitment mission to Dathomir."}, {"tag": "h3", "text": "Alternate end"}, {"tag": "p", "text": "A bonus mission is included in Star Wars: Jedi Knight II: Jedi Outcast (the Pit) in which Kyle Katarn—armed only with a lightsaber and his Bryar pistol—faces off against Axmis. This is non-canon, since she is eventually killed by Jaden Korr on Korriban. The map itself made an appearance in the Multiplayer section of the game as a Duel map."}, {"tag": "p", "text": "If the player chooses to turn to the dark side then, instead of resurrecting Marka Ragnos in Star Wars: Jedi Knight: Jedi Academy, Axmis lets Jaden Korr kill her (seemingly unafraid of death anymore). After her death, Korr duels his master, Kyle Katarn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}