{"url": "Tavvar_Va%27ran", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chefs", "Category:Kubaz", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tavvar Va'ran"}, {"tag": "p", "text": "Master Chef Tavvar Va'ran was the second-best Kubaz chef in the galaxy, though few knew that Emperor Palpatine himself retained the best Kubaz chef for his personal staff. Va'ran worked at the Manarai restaurant, Coruscant's most exclusive fine-dining venue for Imperial high society, but his employment came with a dangerous catch. He had been personally hired by Manarai co-owner Guri, which left Va'ran indebted to Guri's master—Prince Xizor, leader of the Black Sun crime syndicate."}, {"tag": "p", "text": "In 3.5 ABY, Va'ran nervously obeyed Guri's order to secretly murder Imperial Advisor Fendrilon Koozar for prying into Black Sun's business. To carry out the deed, Va'ran poisoned Koozar's meal one busy night at the Manarai with a combination of natural ingredients and untraceable chemicals designed to produce a painful death some hours after eating. Va'ran learned the following evening that his recipe worked as planned, as Koozar had killed himself after throwing a hallucinatory fit and crashing his luxury airspeeder in a fiery explosion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tavvar Va'ran worked as Master Chef at the Manarai, the most exclusive restaurant on the Imperial throneworld of Coruscant and the premier gathering place for the Imperial Center elite. Va'ran was the second-best Kubaz chef in the Empire, though few knew that the best Kubaz chef was actually on Emperor Palpatine's personal staff. While usually only responsible for creating the restaurant's fine culinary delights, Va'ran ultimately answered to the demands of the woman who had personally hired him: Guri, part-owner of the Manarai and chief lieutenant to Prince Xizor, leader of the powerful Black Sun crime syndicate."}, {"tag": "p", "text": "Guri never let Va'ran forget that he was in her debt, and Va'ran knew that Guri would not hesitate to eliminate him and encourage the Manarai's management to fill his vacancy with the galaxy's third-best Kubaz chef should he be uncooperative. So it was that Guri came to Va'ran on one busy night at the Manarai in 3.5 ABY with orders to secretly murder patron Fendrilon Koozar, one of the Emperor's Advisors who had meddled in Black Sun's affairs. Guri instructed Va'ran to give Koozar the \"house special,\" a code phrase meaning a combination of ingredients—both natural food seasonings and nearly untraceable chemicals—that would be added to a victim's dish throughout the meal. The poisoned recipe was designed to interact with the meal's natural oils and spices, as well as the victim's own digestive system, eventually resulting in painful death some hours after ingestion."}, {"tag": "p", "text": "To accommodate Guri's desire for a discreet recipe that might cause Koozar to hallucinate and plummet to his death from some great height, Va'ran considered the various chemical combinations and spices in Koozar's food and his own knowledge of Human physiology. He decided to add a dose of tasteless thetametabuterin to Koozar's Wroonian flycatcher filet appetizer, a hybrid mold on his bowl of sufar greens and mecolar briddlings, and some collafa spice in his main dish of fleek-eel broiled in zaffa oil. Va'ran's recipe produced the desired effect—the following evening, the Master Chef saw on the newsnets that Koozar had been killed after throwing an uncontrollable fit while riding in his luxury airspeeder, seizing the controls from his droid pilot and slamming the vehicle into the Ministry of Land Management in a fiery explosion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tavvar Va'ran was nervous about having been given the responsibility of murdering Imperial Advisor Fendrilon Koozar on Black Sun's behalf, knowing full well that his own life hung in the balance if he did not cooperate. Thus did he obediently prepare the \"house special\" for Koozar on Guri's orders, nevertheless displaying an odd grimace with his snout at the thought of that poisoned recipe. Although Guri was gorgeous by Human standards, Va'ran found her unappealing, knowing what dark intentions lay masked behind her beautiful exterior."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tavvar Va'ran appeared in the short story \"A Very Special Meal,\" which was written by Peter Schweighofer and included in the June 1996 Shadows of the Empire Sourcebook, a supplement for West End Games' Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}