{"url": "Tav_Kennede", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:New Republic individuals", "Category:Pilots", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Tav Kennede"}, {"tag": "p", "text": "Tav Kennede was the son of Ved Kennede, the head training instructor for the Emperor's Royal Guard. In 11 ABY, Kennede's father, along with many other Royal Guardsmen, was killed on Yinchorr by stormtroopers under the command of Carnor Jax, a rogue Guardsman who participated in a conspiracy against the late Emperor Palpatine. Tav Kennede was informed of Jax's actions by Kir Kanos, the only survivor of the massacre, and allied himself with the Guardsman to avenge his father's death. After a brief meeting on Baramorra, Kennede and Kanos decided to employ themselves as bounty hunters to the Hutt crime lord Grappa, intending to build up the reputations of their false identities to a point where they could successfully infiltrate the Imperial Interim Ruling Council, Jax's co-conspirators."}, {"tag": "p", "text": "While at Grappa's palace on Genon, Kanos assigned Kennede to spy on Mirith Sinn, a New Republic commander who also employed herself to Grappa and claimed to be hunting Kanos over the recent death of a friend. Over the course of his surveillance, Kennede came to the conclusion that Sinn had ulterior motives and was using her faux vendetta against Kanos as a cover. After Grappa discovered Sinn's true intentions to spy on the Hutt and gave her over to his Zanibar allies, Kennede and Kanos were forced to rescue the woman from Xo, the Zanibar homeworld, but Kanos allowed himself to remain behind on the planet to ensure Sinn's escape."}, {"tag": "p", "text": "Upon learning from Sinn about evidence of a Black Sun conspiracy to replace the Ruling Council with clones, Kennede joined the woman in leading a New Republic strike on Black Sun's main cloning facilities, and the pair later freed Kanos after the Zanibar returned him to Grappa. Kennede, Kanos, and Sinn subsequently traveled to Ord Cantrell, headquarters of the Ruling Council, and allied themselves with Imperial shipping magnate Baron Ragez D'Asta in a confrontation with Xandel Carivus, a former Councilman who had disbanded the Ruling Council and declared himself the new Emperor. Kanos was able to kill Carivus, avenging the death of the late Ved Kennede. Tav Kennede decided to join the forces of Baron D'Asta, who had recently withdrawn the sector he ruled from the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and service to Kir Kanos"}, {"tag": "p", "text": "Tav Kennede was the son of Ved Kennede, a former Imperial Royal Guardsman and Master Instructor of the Imperial Royal Guard Academy on Yinchorr. Though Tav Kennede was never trained to be a Royal Guardsman himself, his father taught him the secret battle language of the Guard as a child."}, {"tag": "p", "text": "In 11 ABY, Kennede's father and the majority of the Royal Guard gathered on Yinchorr to mourn the passing of Emperor Palpatine, whose final clone had recently been killed on Onderon. When one Guardsman claimed to have knowledge of an Imperial conspiracy surrounding the death of the Emperor, the entire party was attacked by stormtroopers under the command of rogue Guardsman Carnor Jax, who had betrayed the Emperor for his own purposes and sought to cover up his part in the Emperor's death. The massacre claimed the lives of almost every Guardsman, including Kennede's father; the only survivor was Guardsman Kir Kanos, who informed Tav Kennede about Jax's betrayal."}, {"tag": "p", "text": "Kanos, who remained fanatically loyal to the deceased Emperor, killed Jax and sought out Kennede's aid in the execution of other parties involved in Palpatine's death, including Jax's co-conspirators, the Imperial Interim Ruling Council. Kennede willingly allied himself with Kanos, seeking to gain vengeance on those responsible for his father's death."}, {"tag": "p", "text": "The Guardsman soon contacted Kennede from the planet Baramorra and requested that several items be brought to him within two days, including an R2-series astromech droid, to aid in their mission. Kennede complied and Kanos told him to look for a bounty hunter named Kenix Kil, an alias the Guardsman had assumed when bounties placed on him by the Interim Ruling Council elevated following Jax's death. Kennede immediately recognized the name as an anagram for \"Kir Kanos\" in the Royal Guard battle language and had no trouble identifying him two days later on Baramorra, after the Guardsman executed Boss Banjeer, nephew of the Councilman Admiral Banjeer. As requested, Kennede brought Kanos the equipment he needed. The pair left Baramorra and made several stops before formulating a plan to take down the remaining conspirators."}, {"tag": "h3", "text": "Spying on Mirith Sinn"}, {"tag": "p", "text": "Disguised as bounty hunters, Kennede and Kanos decided to enter into the employment of the Hutt crime lord Grappa on Genon in order to gain inside information on their next target, the Ruling Council, which they hoped to infiltrate by gaining their cover personas notoriety among Grappa's group. They successfully gained access to Grappa's palace on Genon and blended in as a pair of the Hutt's many bounty hunters. At the palace, Kanos recognized New Republic Commander Mirith Sinn, who had recently employed herself to Grappa and claimed to be looking for Kanos. Kanos knew that Sinn blamed him for the death of her friend, Sish Sadeet, and ordered Kennede to spy on Sinn to confirm whether she was seeking vengeance on the Guardsman. Sinn, in reality, was using her past with Kanos as a cover story to investigate Grappa's involvement in the recent hijackings of New Republic supply ships."}, {"tag": "p", "text": "Tav Kennede continued to keep tabs on Sinn while she was at Grappa's palace and followed her to the planet Smarck, where Grappa had arrived with much of his court to perform a business transaction with the Black Sun crime syndicate. Kennede surreptitiously shadowed Sinn as she began searching the Black Sun facility for clues relating to her investigation. When Sinn peered through the opening of a door leading to a chamber where Grappa and his Black Sun associate, Macus Kayniph, were having their private dealings, Kennede noticed that whatever she witnessed occurring behind the door surprised her greatly. After Sinn broke off from the rest of Grappa's entourage, Kennede was unable to follow her. He reported back to Kanos and concluded that Sinn was likely not hunting the Guardsman, believing that she had found whatever she was looking for back on Smarck. Kennede admitted that he had no idea what Sinn's intentions were and was ordered by Kanos to continue his surveillance of the woman."}, {"tag": "p", "text": "Back at Grappa's palace, Kennede continued watching Sinn from a distance when the Hutt held a banquet in honor of his Black Sun allies. Kennede followed Sinn as she sneaked through a restricted area of the palace and into a set of quarters. There, Sinn found a drugged and captive Feena D'Asta, daughter of the Imperial shipping magnate Baron Ragez D'Asta and purportedly a member of the Ruling Council. When one of Grappa's guards discovered Sinn and attempted to turn her in, Kennede swiftly stabbed him in the back with a knife and told a confounded Sinn to head to back to the banquet before her absence began causing suspicion. Kennede then disposed of the guard's body and returned to the banquet as well, where he continued to monitor the New Republic operative."}, {"tag": "p", "text": "Sinn's former subordinate, Massimo, soon arrived at the banquet and sold her out to Grappa, revealing her true reasons for being employed to the Hutt. After Grappa gave Sinn over to the Zanibar, a species allied with the Hutt, for one of their sacrificial ceremonies, Kanos decided to follow her to the Zanibar homeworld, Xo, with the hopes of rescuing the woman because he believed he had a debt to repay to her. He instructed Kennede to pick both of them up from Xo at a later time. As planned, Kennede arrived at Xo the next day and flew his two-seated X-wing toward the surface of the planet. Kanos had already rescued Sinn but the two were fleeing from Zanibar forces. Kennede opened fire on the pursuers with his X-wing's laser cannons and the moment he touched down, Sinn boarded the X-wing, occupying its remaining seat. On Kanos's orders, he lifted off with Sinn and escaped Xo while the Guardsman was taken captive by the remaining Zanibar."}, {"tag": "h3", "text": "Taking down Xandel Carivus"}, {"tag": "p", "text": "Kennede and Sinn traveled to a New Republic base, where Kennede temporarily became a Republic recruit. He revealed to Sinn his identity and his past with Kanos, and Sinn in turn described what she saw on Smarck. She explained that she witnessed Black Sun agents handing Feena D'Asta over to Grappa, despite the fact that she knew D'Asta was with the rest of the Ruling Council on Ord Cantrell. Kennede and Sinn came to the conclusion that one of the D'Astas was a clone intended for a Black Sun plot to control the Ruling Council."}, {"tag": "p", "text": "Shortly afterward, Kennede joined several squadrons of New Republic starfighters led by Sinn in an attack on Black Sun's cloning facilities on Smarck. During the battle, Sinn received word that Kanos had been taken back to Grappa's palace by the Zanibar. Kennede, Sinn, and several other New Republic pilots made their way to Genon and confronted Grappa, who was surprised to learn that Kennede's employment to him was a ruse. They were able to intimidate the Hutt into releasing both Kanos and the original Feena D'Asta."}, {"tag": "p", "text": "When Baron Ragez D'Asta learned that his daughter, in reality a clone of the original Feena D'Asta, had been imprisoned along with the majority of the Ruling Council by former Councilman and self-declared Emperor Xandel Carivus, the Baron launched an all-out attack against Carivus's forces at Ord Cantrell. The battle ultimately ended in a ceasefire and the safe release of the D'Asta clone. After Sinn and Kanos arrived and reunited the Baron with his real daughter, Kennede accompanied the party to confront Carivus at Ord Cantrell's capital city, De-Purteen. Baron D'Asta threatened Carivus with the secession of his sector from the Empire, prompting the Emperor to call for his guards. In the ensuing firefight, Kennede saved the elder D'Asta's life by taking a blaster bolt in his shoulder that was intended for the Baron. The injured Kennede told Kanos to go after the fleeing Carivus, and was taken to safety by Feena D'Asta's clone. Once Kanos succeeded in killing Carivus and avenging the death of Kennede's father, Kennede and the Guardsman decided to get Baron D'Asta to safety before additional Imperial troops arrived."}, {"tag": "p", "text": "Kennede, Sinn, Kanos, and Baron D'Asta, along with his daughters, reconvened on the Baron's flagship a short time later. After Baron D'Asta announced the withdrawal of his sector from the Empire, Kennede chose to enter into his service. Prior to bidding Kanos farewell, Kennede told the Guardsman that his services were always at his disposal. He remained aboard the Baron's flagship while Sinn returned to New Republic space and Kanos went off to pursue his continuing vendetta against the Emperor's enemies."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tav Kennede was a brown-haired and brown-eyed male Human. In the wake of Palpatine's final death, Kennede understood that the Empire had grown corrupt and was no longer the same authority that his father or Kanos had once served. He had no qualms about attacking Imperial holdings and willingly joined the New Republic to combat the Empire. When Jax and the Ruling Council betrayed his father, he joined Kir Kanos in his quest to take down the conspirators. Kennede was very loyal to Kanos; he aided in fulfilling the Guardsman's personal agendas, such as discovering Mirith Sinn's true intentions at Grappa's palace, and did not hesitate to leave Kanos behind on Zanibar when the Guardsman issued a direct order to do so. Kanos considered Kennede a friend, and Kennede offered the Guardsman his services even after the two parted ways."}, {"tag": "p", "text": "Kennede was able to successfully spy on Mirith Sinn, a trained New Republic agent, without the woman ever noticing him until he was forced to intervene on her behalf at Grappa's palace. He was covert in his methods, and was able to kill one of Grappa's guards and discard the body before causing suspicion. When he gave Kanos his report on Sinn's activities at Smarck, he understood the importance of maintaining their false identities in public and only referred to the Guardsman in the third person. Kennede played his cover well, and Grappa was unable to discover his true intentions until he confronted the Hutt with his New Republic allies. He willingly put his own life before that of others, saving Baron D'Asta from a lethal blaster bolt. Kennede decided to enter into the Baron's service after his own personal quest for vengenace against his father's murderers was settled."}, {"tag": "p", "text": "While he was in Grappa's employ, Kennede typically wore a concealing black cloak and was armed with a blaster, as well as a knife. He was a skilled pilot, saving Kanos and Sinn from the Zanibar by clandestinely flying to their location in his X-wing and utilizing his fighter's laser cannons against the pursuers. He also flew several combat missions with the New Republic in his X-wing, while Sinn commanded the various starfighter squadrons from the fighter's copilot seat. As a child, Kennede was taught the secret battle language of the Emperor's Royal Guard by his father, which Kanos considered to be a breach of Guard protocol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tav Kennede was created by Randy Stradley and Mike Richardson for the 1998–1999 comic book series Crimson Empire II: Council of Blood, illustrated by Paul Gulacy. He first appeared in the comic's second issue as a background character present in several panels with Mirith Sinn, though his physical appearance was concealed by his cloak. He played a larger role in the third issue, wherein he first received dialogue. The fifth issue established his name and background, and depicted him unconcealed for the first time. He also appeared in the final issue of the series and was featured on the issue's cover, illustrated by Dave Dorman. Kennede additionally made a brief appearance in the 1999 comic The Bounty Hunters: Kenix Kil, also written by Stradley and illustrated by Javier Saltares. He received an entry alongside his father in the 1999 Star Wars Handbook 2: Crimson Empire supplement work. Kennede's biography in the Handbook was later reused almost verbatim for his entry in The Complete Star Wars Encyclopedia in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}