{"url": "Battle_of_Hapes_(Second_Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Hapes", "Category:Battles of the Second Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Hapes  (Second Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Hapes was an engagement between Hapan loyalists and usurpers wishing to replace Queen Mother Tenel Ka Djo with a pro-Corellian ruler. It was during this engagement when Jacen Solo ordered his ship to open fire on the Millennium Falcon, despite the fact that his parents were onboard."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Hapes Consortium, under Queen Mother Tenel Ka, had pledged their support to the Galactic Alliance in their actions against Corellia in the form of two fleets. However, elements of Hapan society wished to secure independence from the Alliance, and side with the fledgling rebellion. Due to Tenel Ka's stance, the Heritage Council—a group hostile to the Queen, realized that the only way to change policy was to assassinate Tenel Ka, and her daughter Allana, and assume control. The Corellian leader Dur Gejjen, eager for such a strong ally in Corellia's battle against the Galactic Alliance, promised Corellian aid if necessary. Due to extenuating circumstances, the Heritage Fleet, led by Ducha AlGray, was forced to engage the Hapan Loyalists in an open fleet battle above Hapes."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Loyalists and usurpers"}, {"tag": "p", "text": "The Hapan Royal Navy was assembled over the planet when the forces of the Heritage Council struck. Following intelligence leads, Jacen Solo had taken a portion of the fleet and headed to the Relephon Moons to assault the usurpers' fleet, led by AlGray, stationed there. However, AlGray's fleet had already departed to Hapes, forewarned by spies. Linking with the three Corellian Dreadnaughts from the Kiris shipyards, they used a comet as cover to near the planet. However, when they microjumped to further in-system, the Royal Navy was waiting for them at the reversion coordinates, due to intelligence provided by Han Solo and Leia Organa Solo, who had infiltrated the Heritage fleet."}, {"tag": "p", "text": "The opening salvo of the entire Royal Navy had a devastating effect on the unshielded usurper fleet as they exited hyperspace. Though they managed to raise shields eventually, the formation sustained much damage and AlGray's flagship, Kendall, took concentrated fire."}, {"tag": "p", "text": "However, the Corellian Dreadnaughts—designed specifically for intense combat—were preparing for a full assault with the objective of breaking into the Royal Navy and destroying the Dragon Queen, Tenel Ka's command ship. The Solos, breaking their cover, sent a message to Tenel Ka telling her to retreat toward Hapes in order to counter the Corellian tactic."}, {"tag": "h3", "text": "Late arrivals"}, {"tag": "p", "text": "Admiral Nek Bwua'tu, who had been monitoring the fleet at the Kiris shipyards, arrived on the far side of Megos. Led by Bwua'tu on board the Admiral Ackbar, the fleet rounded the Hapan moon and ripped a hole in the usurper flank as it continued its pursuit of the Queen. However, just as the engagement looked like a decisive Alliance victory, the Galney fleet exited hyperspace and began to accelerate toward the battle."}, {"tag": "p", "text": "Ducha Galney was assumed by Tenel Ka to be one of her staunchest allies, mostly due to the fact that the Ducha's sister was her chamberlain. However, Jaina Solo and Zekk had discovered that Ducha Galney was in league with AlGray and the Heritage Council. When rescued by Ben Skywalker aboard the Rover, they tried to beat the Galney fleet back to Hapes in order to warn the Queen before they infiltrated her formation. Emerging in the center of the Galney fleet, the Rover evacuated its crew and broadcast a warning to the Hapan Royal Navy. Racing in from Hapes's gravity well, the Galney fleet was designated hostile."}, {"tag": "p", "text": "Jacen Solo, aboard the Anakin Solo, returned from the Relephon Moons and began to fire at the Galney Fleet as it moved toward the battle. One Battle Dragon was destroyed before it could raise its shields, and the Loyalist Battle Dragons accompanying the Anakin Solo also destroyed two more during the pursuit. Half of the Galney fleet broke off to engage Solo, hoping to detain him while the other half raced toward the Dragon Queen and the Royal Navy to reinforce the usurper fleet. Unbeknownst to the Hapans accompanying Jacen, Chume'da Allana was present aboard the Anakin Solo, and had already narrowly avoided death at the hands of Aurra Sing."}, {"tag": "p", "text": "Not wishing to endanger his daughter further, and feeling Tenel Ka would want him to do the same, Solo sent 18 Battle Dragons in pursuit of the attacking element of the Galney fleet to reinforce the Queen, remaining behind with the other two and the Anakin to protect the heiress to the Hapan throne. His pursuit screen took heavy damage as it attempted to break through the defensive half of Galney's forces."}, {"tag": "h3", "text": "Final stages"}, {"tag": "p", "text": "As Bwua'tu tore into the the usurper fleet and the Royal Navy rallied around their queen, Solo's rescue flotilla finally broke through the Galney defense and pursued the other half of the traitor fleet to the rest of the battle. As the traitors neared, the remnants of the Royal Navy began to open fire on them. Solo's six surviving Battle Dragons in the rescue flotilla also engaged their rear."}, {"tag": "p", "text": "Solo then led the Anakin Solo and his two Battle Dragons into the remainder of the Galney's defensive screen. Operating on a personal agenda, he ordered one long range turbolaser battery to fire on the Millennium Falcon as it neared the evacuees from the Rover. His strikes inflicted catastrophic damage on the vessel, killing the Noghri bodyguards Cakhmaim and Meewalh, and forcing the evacuees to once again eject. The Falcon, however, managed to escape and jumped to hyperspace just before destruction."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The three Corellian Dreadnaughts were defeated, though all three cannot be assumed to have been destroyed as Admiral Genna Delpin returned alive from the engagement and was later promoted to Supreme Commander. The Galney fleet was crushed, and Jacen Solo was credited with its destruction and saving Tenel Ka, which made him a hero to the Hapan people. The Heritage Council's fleet was also defeated, and the nobles who had taken part in the treasonous assault were suitably punished, presumably by execution. The Millennium Falcon, although she had sustained extensive damage, survived and was flown to Gyndine by the Solos where it was repaired by Lando Calrissian. After the battle, Jacen Solo became something of a sex symbol among Hapan women."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}