{"url": "Team_Fireball", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Members of Team Fireball"], "nodes": [{"tag": "h1", "text": "Team Fireball"}, {"tag": "p", "text": "Team Fireball was a racing team put together by Jarek Yeager to help run his repair shop on the Colossus, a refueling platform located on the Mid Rim planet Castilon. Neeku Vozo, Tam Ryvora, Kazuda Xiono, and R1-J5 \"Bucket\" were members of Yeager's crew during the era of the New Republic. They were in the process of restoring a decrepit racing ship, the Fireball, by the time Xiono joined the team."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early days"}, {"tag": "p", "text": "Jarek Yeager, a former Rebel pilot, came to make his home on the Colossus refueling station on Castilon at some point after the Galactic Civil War. He acquired a reputation as one of the station's best racers, often winning whenever he competed. It was rumored that part of Yeager's success was due to using hyperfuel as a boost. However, by 34 ABY, he had stopped racing, preferring to focus on his repair shop. Team Fireball, the team of racers and mechanics he founded, by that year consisted of Yeager, Tamara Ryvora, Neeku Vozo, and the astromech droid R1-J5, nicknamed \"Bucket.\" It was named after a decrepit racing ship, the Fireball, that Yeager had acquired. Yeager had promised Ryvora the ship if she could fix it up."}, {"tag": "h3", "text": "A new member"}, {"tag": "p", "text": "In 34 ABY, late in the Cold War, Yeager's friend Poe Dameron, a member of the Resistance, brought recently recruited spy Kazuda Xiono to the Colossus. Dameron persuaded Yeager to hire Xiono as a mechanic as a cover for his spying work. Yeager was uncertain, due to a misunderstanding that had led Xiono to quickly acquire an inflated reputation as the alleged \"greatest pilot in the galaxy,\" which caused other Colossus residents to target him, but acquiesced. The team was forced to work quickly to make the Fireball flight-capable, as Xiono had unwillingly been signed up for a solo race the next day by Vozo, who thought he was helping him become the best pilot. Ryvora and Xiono got off on bad terms, as she was resentful that Yeager was loaning him the ship, and felt that he had insulted her mechanical skills by pointing out the Fireball's state of disrepair."}, {"tag": "p", "text": "In the race, against the youngest member of Ace Squadron, Torra Doza, Xiono performed well, but pushed the Fireball too hard and crashed, putting the ship out of action again and necessitating a rescue. Yeager warned Xiono afterwards that, although he could work with the team, he didn't want any involvement in Xiono's mission."}, {"tag": "h3", "text": "The \"triple dark\" storm"}, {"tag": "p", "text": "Xiono's lack of mechanical training caused difficulties with the rest of Team Fireball, arousing Ryvora's suspicions. When the team was hired to repair the ship of a Neimoidian named Hallion Nark, Xiono's errors made their client unimpressed. However, Xiono overheard Nark conducting a covert comlink conversation, which made him later realize that Nark was a spy for Kragan Gorr and his pirate gang. While the rest of Team Fireball made it to a shelter during the ensuing attack, Xiono and Dameron's astromech droid, BB-8, who was keeping an eye on him, helped covertly drive the attack off. The rest of the team was skeptical when Xiono later claimed he had been working on the Fireball for the entire attack, and Yeager didn't believe Xiono when he was told what he did."}, {"tag": "h3", "text": "Rucklin's heist"}, {"tag": "p", "text": "Xiono's status as the newest member of the team led to him being targeted by Jace Rucklin and his team, Lin Gaava and Gorrak Wiles, who saw him as an opportunity to steal Yeager's valuable hyperfuel. Rucklin successfully manipulated Xiono into sneaking him into Yeager's office, where he swiped the fuel behind Xiono's back. The manipulation was made easier by Xiono's frustrations with his heavy workload, which he felt was interfering with his mission for the Resistance, and his poor mechanical skills. After Bucket discovered the theft, Xiono put himself in danger to save Rucklin, who had turned his ship into a bomb by adding too much hyperfuel. Afterwards, Xiono apologized to Yeager, stating he understood if he was fired, but Yeager let him stay on."}, {"tag": "h3", "text": "Visiting the High Tower"}, {"tag": "p", "text": "During a storm, Xiono along with BB-8, Vozo, and a reluctant Ryvora received an invitation from the Ace Squadron leader Hype Fazon to visit the exclusive Doza Tower, the residence of the Doza family and the Aces. While Xiono and Vozo were delighted to be in the company of elite pilots, Ryvora was bitter towards Fazo for abandoning her after he had won a race. Xiono took advantage of their visit to spy on a meeting between Captain Imanuel Doza and the First Order emissary Major Elrik Vonreg. He discovered that the First Order were seeking access to the Colossus. Xiono was pursued by stormtroopers but escaped into a corridor with the help of BB-8."}, {"tag": "h3", "text": "Refugees from Tehar"}, {"tag": "p", "text": "While working on the Fireball, Xiono accidentally damaged an acceleration compensator, angering Ryvora. In an attempt to raise funds, Xiono along with Vozo and BB-8 attempted to collect a bounty on two children, Kel and Eila. With the help of Vozo's Chelidae friends, Xiono and his friends managed to find the children and learnt that they were the survivors of a First Order massacre on Tehar. Xiono helped the children escape Commander Pyre by faking their deaths. After the children found refuge with the Chelidae, Xiono managed to return the repaired compensator to Ryvora. He also informed Ello Asty about the massacre on Tehar."}, {"tag": "h3", "text": "The \"salvage run\""}, {"tag": "p", "text": "Later, Yeager took Xiono on an unscheduled early morning \"salvage run\" offsite. Ryvora expressed surprise since a salvage run was not listed on the schedule. This \"salvage run\" turned out to be a training flight for Xiono with his mentor Dameron. Xiono and Dameron later responded to a distress call aboard a Darius G-class freighter in the Castilon system's Sector six. After braving several Kowakian monkey-lizards and Kowakian ape-lizards, Xiono and Dameron managed to rescue a Mirialan named Synara San. Unknown to everyone, Synara was a member of Kragan Gorr's Warbird gang."}, {"tag": "h3", "text": "The second pirate raid"}, {"tag": "p", "text": "Team Fireball later received a job from Captain Doza to repair the platform's defence system's tracking computer. Since they lacked a CoMar Tri-Tracker chip, Xiono and Ryvora turned to Synara San, who had found work in the salvage yard. Learning that the platform's defense system was down and that Ace Squadron was away, Synara alerted Kragan Gorr, whose Warbirds raided the Colossus. Yeager and Xiono managed to reinstall the tracking computer despite opposition from Kragan and his pirates. Meanwhile, Synara managed to gain Ryvora's trust after saving her from a pirate in the loading docks. Vozo and Bucket hid inside the repair shop during the fighting while BB-8 accompanied Ryvora to the loading docks."}, {"tag": "h3", "text": "The Platform Classic"}, {"tag": "p", "text": "Xiono, Ryvora, and Vozo were excited that galactic racing champion Marcus Speedstar would be contesting the upcoming Platform Classic. Since their employer Yeager had once been a racing champion, they along with most of the platform's inhabitants wanted Yeager to race against Speedstar. Unknown to the rest of Team Fireball, Yeager and Speedstar were brothers who had fallen out over Speedstar's role in causing the deaths of Yeager's wife and daughter during a racing accident years ago. Yeager rejected an invitation from Captain Doza to race against Speedstar."}, {"tag": "p", "text": "Yeager rebuffed Speedstar's attempts a reconciliation. Unaware of the bad blood between the two brothers, Kaz, Tam, and Neeku socialized with Speedstar and his crew Oplock and R4-D12. Annoyed at Xiono and Ryvora's attempts to get Yeager to race Speedstar, Yeager tried to bully his younger brother into pulling out of the Platform Classic. Unknown to Team Fireball, Speedstar was struggling to pay back his debts to the Guavian Death Gang, who had kidnapped Oplock as a hostage. Determined to save his friend Oplock, Speedstar refused to pull out of the race. Yeager was forced to take part after Aunt Z placed bets on the two brothers."}, {"tag": "p", "text": "Blaming Xiono for the debacle, Yeager loaned him to Speedstar. Xiono learned about the details of Yeager's estrangement from Speedstar and realized that Speedstar genuinely wanted to make things right with his brother. Meanwhile, Yeager told Neeku that Speedstar had not been there for him. Later, Xiono tried to convince Yeager to forgive his younger brother but Yeager was still bitter towards Speedstar. While the rest of Team Fireball watched the race, Yeager raced against Speedstar; with the two brothers occupying the first and second places in the race."}, {"tag": "p", "text": "Following a series of obstacles, Yeager reconciled with Speedstar after realizing that his brother was no longer obsessed with money and fame but genuinely wanted to save his friend Oplock. Yeager pulled out of the race, allowing Speedstar to win the prize money which he need to pay the ransom to secure Oplock's release. Yeager also lent Speedstar some extra money to ensure Oplock's safe release. While Yeager still had not fully forgiven Speedstar for his family's deaths, the two brothers were on talking terms. Yeager also thanked Xiono for urging him to forgive his brother."}, {"tag": "h3", "text": "Second visit to the High Tower"}, {"tag": "p", "text": "Under orders from Poe, Xiono and BB-8 sought to gain access to Doza Tower in order to find information on Captain Doza's connections with the First Order. With the help of Doza's daughter Torra, Xiono and BB-8 managed to infiltrate Doza Tower during a meeting between Captain Doza and Commander Pyre to discuss the First Order's offer of \"protection.\" Xiono and BB-8 managed to download information about the meeting from Doza's datapad. Xiono also discovered Captain Doza's Imperial uniform, which led him to believe that Doza was in cahoots with the First Order. After narrowly escaping exposure by a vindictive Rucklin, Xiono, BB-8, and Torra narrowly escaped being incinerated in a trash incinerator. Xiono told Torra that he was a former New Republic pilot who had become a racer but denied being a spy."}, {"tag": "h3", "text": "Xiono's second trip offworld"}, {"tag": "p", "text": "Later, Xiono borrowed the Fireball for an offworld mission with Poe Dameron. Regarding the Fireball as her ship, Ryvora took offense that Xiono had borrowed \"her ship.\" When Yeager pointed out that he was still the ship's technical owner, Ryvora revealed that she had \"forgotten\" to install a new stabilizer. Despite the Fireball's breakdown, Xiono and BB-8 managed to rendezvous with Poe. Following an adventure at Station Theta Black, Xiono and Poe discovered that the First Order was building many weapons."}, {"tag": "h3", "text": "Casual adventures"}, {"tag": "p", "text": "During one of their breaks, Xiono, Neeku, BB-8, and Bucket played a game of holodarts at Aunt Z's Tavern with Torra. Xiono made three attempts to hit the centre of the board but missed. Bucket then had a turn with his first two darts hitting the bull's eye. However, the third pierce Xiono's buttocks, causing him pain."}, {"tag": "p", "text": "Later, Yeager rewarded Neeku for his hard work by treating him for lunch. Neeku decided to buy a gorg from Bolza Grool's stand. However, the gorg escaped and led Neeku on a chase through the marketplace. When the gorg returned, Neeku decided to get bantha milk. Yeager later quipped to BB-8 that Neeku could have easily gotten a droid instead."}, {"tag": "p", "text": "One day, Bucket found that his helmet was missing. Bucket questioned Xiono, who suggested that he retraced his steps. Bucket traveled through the Colossus and visited Flix and Orka's Office of Acquisitions where he acquired a hat with a mechanical propeller. Bucket later returned to the garage only to find BB-8 sporting his missing helmet. Bucket pursued BB-8, causing the other droid to drop his helmet. Xiono picked up the helmet and handed it to Bucket. Still grumpy about the loss of his cap, Bucket kicked Xiono in the shin."}, {"tag": "p", "text": "Later, Neeku and a reluctant Tam allowed Xiono to test the Fireball's engines by racing the ship against Torra's Blue Ace. During their flight, the Fireball's throttle handle broke, causing Xiono to lose control of the ship. As the Fireball hurtled back into Yeager's garage, Xiono managed to jam the handle into the broken socket long enough for the ship to regain control of the ship. Though Xiono managed to land the ship safely, the Fireball's landing gear and cockpit canopy collapse much to Tam's dismay."}, {"tag": "h3", "text": "The Bibo incident"}, {"tag": "p", "text": "While visiting Synara San in the loading docks, Neeku adopted a baby rokkna which he nicknamed Bibo as a pet. Bibo's presence disrupted work at Yeager's garage, causing an irritated Yeager to tell Neeku to get rid of his pet. This upset Neeku, who departed the garage in search of his missing pet. Meanwhile, Synara took Xiono on her salvage skiff into the sea, intending to question him about his Resistance connections."}, {"tag": "p", "text": "However, they narrowly escaped Bibo's mother, who was seeking her child. Bibo's mother attacked the Colossus, laying siege to the platform. Following a skirmish with Ace Squadron, Xiono managed to convince Neeku to return Bibo to his mother. Reunited with her child, the rokkna ceased her rampage. As a consolation, Xiono bought Neeku a pet gorg. However, Neeku ate the gorg, mistaking it for food."}, {"tag": "h3", "text": "The phase connector theft"}, {"tag": "p", "text": "As Kaz's mechanical skills improved, he gained the praise of Yeager, Tam, and Neeku. Kaz informed Yeager that he had obtained the Fireball's new repulsorlifts and injectors from Flix and Orka in return for agreeing to look after their shop, the Office of Acquisitions, for one day. Yeager allowed Kaz to look after the Office of Acquisitions. Kaz subsequently foiled a First Order plot to steal a phase connector."}, {"tag": "h3", "text": "Torra Doza's kidnapping"}, {"tag": "p", "text": "Kaz, Tam and BB-8 socialized with Torra Doza and Synara San. Unknown to everyone, the pirate spy Synara had received orders from Captain Kragan to smuggle the pirates Valik and Drell, who were tasked with kidnapping Torra as part of a First Order plot to convince Captain Doza to accept a military occupation. Synara subsequently experienced a change of heart and warned Kaz. Though the pirates kidnapped Torra, she was rescued by the First Order Major Elrik Vonreg, who convinced Captain Doza to accept First Order protection."}, {"tag": "h3", "text": "Helping Synara"}, {"tag": "p", "text": "After the First Order imposed a military occupation of the Colossus, First Order stormtroopers visited Yeager's repair Station and questioned Team Fireball about their knowledge of Synara's whereabouts. Kaz, BB-8 and Neeku later helped Synara to escape the First Order by fleeing into an escape pod. Though Synara was a pirate, Kaz regarded Synara as a friend for helping to save the Colossus from Bibo's mother and warning them about Torra's kidnapping. Unaware of Synara's true pirate identity, Tam was upset that her friend did not say goodbye."}, {"tag": "h3", "text": "Helping Kel and Eila again"}, {"tag": "p", "text": "As time passed, Tam became more sympathetic to the First Order due to the security that they brought to the station. By contrast, Kaz thought that the First Order's presence was unnecessary since the station already had the Ace Squadron and security droids. Yeager, who had lived during the time of the \"Old Empire\" and fought for the Rebellion, distrusted the First Order and thought they were taking away freedom in the name of security. Neeku tried to take a neutral stance."}, {"tag": "p", "text": "Later, Kel and Eila came seeking Kaz's help after they knocked out the stormtrooper CS-515. While Bucket stayed behind, Neeku, and Tam decided to accompany Kaz, the latter to find out what Kaz was up to. Kaz agreed to infiltrate the First Order base in order to check that CS-515 had not reported Kel and Eila. Meanwhile, Neeku and Tam stayed with the children, the unconscious CS-515, and the Chelidae in the engineering deck."}, {"tag": "p", "text": "During her time with Kel and Eila, Tam learned about the First Order's role in the massacre on Tehar. When CS-515 awoke, Neeku knocked him unconscious after befriending him. Meanwhile, Kaz managed to steal a data rod and narrowly escaped reprogramming at the hands of Commander Pyre. Later, Kaz shared the information from the data rod with Yeager and the two learned that the First Order wanted to use the Colossus as a military supply line for their invasion of the galaxy."}, {"tag": "h3", "text": "Mission to the Dassal system"}, {"tag": "p", "text": "Kaz later accompanied Poe Dameron on a mission to investigate First Order activity in Sector Epsilon 51-3. Kaz and Poe traveled to the Dassal system where they discovered several planets that had been \"cored-out\" by the First Order and that the system's sun was missing. While visiting a village on a moon, they discovered evidence of a massacre and encountered a spider probe droid. Despite being pursued by Major Vonreg's squadron, Poe and Kaz managed to escape. Before parting company, the two exchanged droids with Poe taking back BB-8 and Kaz taking CB-23."}, {"tag": "p", "text": "While Kaz was away with Poe, the rest of Team Fireball was servicing a racer. When Kaz returned, he claimed that he took BB-8 to a repair shop on Takodana and got CB-23 on loan. Tam grew suspicious about Kaz's frequent absences and expressed anger at Yeager for keeping information about Kaz and himself from her."}, {"tag": "h3", "text": "The crackdown"}, {"tag": "p", "text": "Later, the First Order began cancelling races on the Colossus and detaining dissidents like Hype Fazon and Aunt Z, developments which created unease among Team Fireball. Tam also grew suspicious about the damage to the Fireball sustained during Kaz's recent trip offworld. Yeager secretly met with Captain Doza to discuss the First Order's detention of dissidents in the West Docks but concealed the details from Tam. Acting on this information, Kaz and CB-23 managed to free Hype, Aunt Z, Nod and Grevel from the First Order and helped them escape offworld."}, {"tag": "p", "text": "Though Kaz managed to escape, Captain Pyre learnt that the Fireball had breached Sector Epsilon 51-3 and raided Yeager's garage, placing Team Fireball under arrest for conspiring against the First Order. Team Fireball managed to escape into the lower levels of the Colossus after Bucket fired foam at the stormtroopers. However, Bucket was shot and separated. Believing the situation to be a misunderstanding, Tam surrendered and was taken into First Order custody."}, {"tag": "p", "text": "Tam was questioned by the First Order Security Bureau Agent Tierny, who sowed a wedge between her and her friends Kaz and Yeager. Tierny revealed that Kaz was a Resistance spy and claimed that Yeager was not being honest towards her. Meanwhile, the rest of Team Fireball reunited with Bucket, Kel, Eila, and the Chelidae in the engineering deck. Working in coordination with Captain Doza, they managed to submerge the Colossus so that Kaz and Yeager could send a distress message to the Resistance. However, Yeager was captured and General Leia Organa was unable to send reinforcements to Castilon. Kaz, Neeku, CB-23, Kel, Eila, and the Chelidae then formed the Colossus Resistance."}, {"tag": "h3", "text": "Divergent paths"}, {"tag": "p", "text": "While Agent Tierny won over Tam by promising her place as a pilot in the First Order, Kaz and his resistance cell proceeded with their plan to rescue Yeager and to warn the New Republic. Kaz, Neeku and their team captured the hyperdrive room from the First Order. Kaz and CB-23 tried to swim to Doza Tower but were pursued by First Order SCUBA troopers. The two were only saved from capture when Neeku managed to depressurize the corridor beneath the engine room, sucking the SCUBA troopers into the sea."}, {"tag": "p", "text": "Undaunted, Kaz and CB-23 continued their mission by navigating through the Colossus's corridors and tunnels, linking up with Tam and Buggles. On the way to Doza Tower, they witnessed a transmission of the Hosnian Cataclysm. While Kaz was distraught, he decided to expel the First Order from the Colossus. Working with Neeku and his team, Kaz and Torra helped to flush stormtrooper forces into the sea."}, {"tag": "p", "text": "Kaz and Torra managed to free Yeager and Captain Doza. However, Kaz and Yeager were unable to convince Tamara Ryvora not to join the First Order. Tam was still angry at Kaz and Yeager for keeping secrets from her and not trusting her. To Kaz and Yeager's dismay, Tam left with Agent Tierny and Commander Pyre. Meanwhile, Neeku and his team prepared the Colossus's engines and hyperdrive for lift-off. Following a brief dogfight, Team Fireball minus Tam escaped aboard the Colossus into hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Team Fireball was created and developed for the animated series Star Wars Resistance. The first footage of the squad was released on August 17, 2018. Further details regarding the members of Team Fireball were released on August 29, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}