{"url": "Tchuukthai", "categories": ["Category:Legends articles", "Category:Reptilian sentient species", "Category:Tchuukthai", "Category:Unknown Regions species"], "nodes": [{"tag": "h1", "text": "Tchuukthai"}, {"tag": "p", "text": "Tchuukthai, also called Wharls, were sapient ceratopsian quadrupeds from the Unknown Regions. They had bristly fur on their shoulders and back, while natural armor plating covered their head, joints, and vital organs. Even where there was no armor, their skin was thick and leathery, offering natural protection. Those that had dealings with other species generally wore clothing, while others did not."}, {"tag": "p", "text": "The Tchuukthai were considered semi-mythical non-sentient creatures for millennia. The Tchuukthai encouraged, and possibly propagated, this view with displays of bestial ferocity that discouraged explorers and curious visitors. A number of famous love poems were composed by Tchuukthai, although they translated poorly into Basic."}, {"tag": "p", "text": "A Jedi Master befriended the Tchuukthai later known as Thon, who was instructed in the Jedi arts and eventually became a Jedi Master himself around the time of the Great Sith War. Thon's nature was unknown even to most Jedi for millennia, though it's possible others of the species left (or were taken from their unknown homeworld as captive beasts) into the galaxy."}, {"tag": "p", "text": "The Tchuukthai were, at least, aware of the Lugubraa, as they were credited with naming the Lugubraa's place of origins, the Stratos Distribution."}, {"tag": "p", "text": "Bureaucrats from the Galactic Republic Bureau of Xenology labeled Thon a \"Wharl\", though the Jedi Master declined to refute or acknowledge the designation or any other speculation as to his origins."}, {"tag": "p", "text": "The Tchuukthai were generally quite thoughtful, and although they would often put on displays of ferocity for outsiders, disdained fighting. Some enjoyed meeting outsiders while others preferred to be left alone."}, {"tag": "h2", "text": "Common Tchuukthai names"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first mention of the Tchuukthai, by that name, was in The Courtship of Princess Leia in 1994, in a brief reference to Tchuukthai poetry. Previously, in the Star Wars: Tales of the Jedi miniseries, the character Thon had appeared without a given species name. Tales of the Jedi Companion identified him as a \"Wharl\" in 1996. At this point Daniel Wallace had already contemplated making Thon's species the Tchuukthai, and when Wallace wrote The Essential Guide to Planets and Moons in 1998, he retconned the Wharls and Tchuukthai as the same species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}