{"url": "Te_Corso", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Elomin", "Category:Females", "Category:Jedi Masters of the New Jedi Order"], "nodes": [{"tag": "h1", "text": "Te Corso"}, {"tag": "p", "text": "Te Corso was an Elomin female who served the New Jedi Order during both the Sith–Imperial War and the Second Imperial Civil War. Before the conclusion of the former conflict, she was a consultant to the ruling Triumvirate of the Jedi-allied Galactic Alliance, but the two organizations were ultimately defeated by the Galactic Empire in 130 ABY. The Jedi were then massacred by the One Sith, and their survivors, including Corso, were forced into hiding as the Sith seized control of the galaxy. Corso found her way to a Hidden Jedi Temple on the planet Taivas before 137 ABY; by that time a Jedi Master, she helped rebuild a broken order."}, {"tag": "p", "text": "In that year, the Jedi Council dispatched Corso and three other Masters to meet with Admiral Gar Stazi of the Galactic Alliance Remnant. Shortly after they arrived in the Arkanis sector and boarded the flagship of the Remnant fleet, an attack came from the two groups' common enemy: Darth Krayt's Galactic Empire. Corso and fellow Master Drok flew X-83 TwinTail starfighters alongside the Remnant's own forces in a defensive action as the fleet prepared to flee, and after a series of hyperspace jumps, they were able to help shake the Sith–Imperial pursuit. An alliance against Krayt's Empire was solidified, and the Jedi ambassadors remained with Stazi over the following weeks."}, {"tag": "p", "text": "Corso later organized and led the volunteer Sword Squadron during the Remnant's evacuation of the planet Dac following the poisoning of its oceans by the Sith–Imperials. With aid from their allies in the Empire-in-exile, the Jedi and Remnant forces saved 20 percent of the water world's residents, and Corso returned to Taivas. When Darth Krayt soon afterward learned of the Hidden Temple's location, the entire Alliance made a stand against the Imperial onslaught, and Corso was killed by the lightsaber of a powerful Sith trooper while protecting Jedi Master T'ra Saa. The time bought by Corso's sacrifice allowed Saa to gather energy and release a beam of light into space at the moment of her own death, which created an escape corridor for the overmatched Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Before the storm"}, {"tag": "p", "text": "The Elomin female Te Corso lived during the time of the Sith–Imperial War, and she became a member of the New Jedi Order prior to the conflict's end. On at least one occasion, she visited the galactic capital world of Coruscant to consult with the Triumvirate, the ruling body of the Jedi-allied Galactic Alliance. While on the capital, Corso additionally met Ona Antilles, the young daughter of Triumvir Bail Antilles. Jedi Master Kol Skywalker was another advisor to the Triumvirate, but in 130 ABY, they ignored his urgings of caution and approved a plan to strike at the Galactic Empire over the planet Caamas."}, {"tag": "p", "text": "An Imperial trap at Caamas soundly defeated the Alliance Fleet and cost them the war. Concurrent attacks on the Jedi Temples of Coruscant and Ossus by the Empire's One Sith allies decimated the order's ranks and scattered its survivors, including Corso, across the galaxy. The Sith seized control of the Empire and spent the next seven years hunting Jedi down, but by 137 ABY, Corso had made her way to a Hidden Jedi Temple on the planet Taivas, where the order worked to covertly rebuild its ranks."}, {"tag": "p", "text": "In 137 ABY, the temple was visited by a delegation of Imperial Knights representing Emperor Roan Fel, whose Empire-in-exile opposed the Sith Empire from which he had been ousted. Corso was on Taivas when the princess Marasiah Fel proposed an alliance to the skeptical Jedi Council, who wrongly believed that Marasiah's father had ordered the attack on Ossus. Although her fellow Knights left Taivas to assist the former Jedi Cade Skywalker on a mission to assassinate the Sith Lord Darth Krayt, the princess remained at the temple to continue her negotiations."}, {"tag": "h3", "text": "Forging friendship under fire"}, {"tag": "p", "text": "Severely injured by Skywalker's strike team, Krayt was taken to the brink of death and believed fully dead by the Jedi Council. Around the same time, the Empire-in-exile formally allied with the remnants of the Galactic Alliance, and the council decided that the time had come for the Jedi to take an active part in the ongoing war against the Sith–Imperials. Corso, by then a Jedi Master, was chosen as an emissary and sent to meet with Admiral Gar Stazi of the Galactic Alliance Remnant, along with fellow Masters Sayar Dun'La, Asaak Dan, and Drok. Princess Marasiah provided a holomessage to vouch for them and prove that they were not Sith in disguise. The four Masters formed a squadron of X-83 TwinTail starfighters and rendezvoused with the Remnant fleet, stationed in the Arkanis sector."}, {"tag": "p", "text": "The Jedi were cleared to land in a hangar of Stazi's flagship, the Alliance, where they were greeted by the Admiral and several other Remnant officers. Corso introduced herself and her fellows, and her identity was confirmed to a wary Stazi by Ona Antilles, who now served the Remnant as a lieutenant. After Corso informed the Admiral of the council's intentions, she was interrupted by Imperial Knight Sigel Dare, who had come to the Alliance to request the use of a captured Imperial shuttle. Corso suggested retiring to a private location and invited the Imperial Knight to come, but Dare was eager to reach the planet Dac and retrieve her stranded comrade Treis Sinde. Intrigued by Sinde's role in helping Dac's resistance groups fight the world's occupying Sith–Imperial forces, Dan joined her, and the three remaining Jedi followed Stazi to the Alliance's bridge."}, {"tag": "p", "text": "On the bridge of the Star Destroyer, Corso sensed something amiss seconds before the Sith–Imperial First Coruscant Task Force dropped out of hyperspace. The traitorous Shipman Tealart had kept the Alliance's deep-space alarms off, and he used the distraction to shoot Stazi in the back just before being maimed by Drok's lightsaber. Stazi's second in command, Jhoram Bey, began to shout orders as Dun'La took the Admiral to sick bay, and Corso volunteered both herself and Drok to join the Alliance starfighters' rear-guard defensive action as the fleet prepared for lightspeed. Bey allowed it, and the two Jedi added their Twintails to the Remnant's CF9 Crossfire starfighter complement; the group defended against attacking Predator-class fighters until the fleet was ready. After releasing anti-ion emission tracers, the Remnant forces jumped to a rendezvous point in the Opoku system."}, {"tag": "p", "text": "The fleet was followed by the Imperials, however, who were tracing the frequency vibrations of the Alliance's communications array. Bey commanded another hyperjump, during which he was advised of the Imperials' tactic by a barely-conscious Stazi. After arriving in the Teraab sector, the entire fleet save for the Alliance was ordered out of the system as Bey shut down the array. Corso, Drok, and the rest of the fleet promptly returned to trap the arriving Imperials, who quickly fled into hyperspace themselves. The starfighters were recalled and the fleet left the system. A formal alliance was struck, and Corso and her brethren remained with the Remnant forces over the following weeks as Stazi recovered from his injury."}, {"tag": "h3", "text": "Race against time"}, {"tag": "p", "text": "Shortly after the battle, the Remnant's Rogue Squadron discovered that the Sith–Imperials had poisoned the oceans of Dac. Volunteers from across the galaxy flocked to Stazi's banner as he arranged a massive evacuation, and Corso stood on the Alliance's bridge with the Admiral as he appealed to General Oron Jaeger of the Empire-in-exile for help. Without word from his Emperor, who was out of contact while negotiating with Jedi representatives on the planet Agamar, Jaeger was unable to send aid. Corso, however, shared Jedi knowledge of a potential safe haven for the refugees, and additionally offered to organize an ersatz squadron of Jedi who had arrived with the volunteers. Stazi consented and quickly formulated a plan."}, {"tag": "p", "text": "Sword Squadron, as Corso dubbed it, worked in cooperation with the Rogues and infiltrated the Mon Calamari Shipyards. They took control of the yards' turbolaser emplacements while ground and space forces eliminated the minimal remaining Imperial resistance. The volunteer Emergency evac fleet then spent ten hours evacuating the water world's residents, after which time Imperial reinforcements arrived in the form of the Outer Rim Third Fleet, whose guns turned on the fleeing refugees. Sword Squadron and the other present starfighter groups fought back, and the Sith–Imperials fled after General Jaeger—having finally received word from Fel—arrived with a fleet of his own. With the Empire-in-exile's help, twelve more hours of evacuation allowed 20 percent of Dac's population to be saved before the effects of the poison engulfed the entire planet."}, {"tag": "h3", "text": "Enemy at the gates"}, {"tag": "p", "text": "In early 138 ABY, Corso, Dun'La, and Drok returned to Taivas. With a three-way Alliance against Darth Krayt's Empire solidified, a group of Imperial Knights visited the Hidden Temple; Cade Skywalker was close behind with another Knight: Master Antares Draco, who had been tortured by the Sith into revealing Taivas's location. Skywalker formulated a plan to trap the Sith–Imperials between the planet and the Alliance's combined fleets, and it was agreed to by Emperor Fel, Admiral Stazi, and the Jedi Council. The present Jedi and Imperial Knights, Corso included, prepared their defense."}, {"tag": "p", "text": "Taivas's magnetic forces prevented the attacking Imperial fleet from orbitally bombarding the planet, and a ground assault was consequently launched. A group of Jedi and Imperial Knights defended the temple's gates while Corso, Dun'La, and Drok remained in the Council Chamber with Master T'ra Saa, who coordinated the engagement through battle meditation. After the rest of the allied forces arrived in orbit, a fully recovered Darth Krayt unleashed his secret weapon: an army of powerful Sith troopers, whose starfighters plowed through friendly and enemy forces alike on their way to the temple. The defenders of the gate fell back to the Council Chamber, where Corso, Dun'La, and Drok joined them in a stand against their new foes."}, {"tag": "p", "text": "The Jedi and Imperial Knights resisted the lightsabers of their mysterious attackers, and Skywalker's uncle Rawk quickly ordered the majority of the group to escape. Corso, Dun'La, and Drok remained with the Skywalkers to protect Master Saa, who was gathering large amounts of energy. Corso was killed when a Sith trooper slashed her across the chest, and Dun'La and Drok were similarly felled. Their sacrifices allowed Master Saa to survive until a Sith trooper's starfighter crashed into the Council Chamber, at which point she and Rawk focused the gathered energy into a beam of light. The light shot into space, destroying enemy vessels and creating an escape corridor for the overmatched ships of the Alliance, who used the opportunity to flee from the seemingly-invincible Sith troopers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Te Corso was quick to take action during military emergencies and provide her services as a starfighter pilot. She volunteered to fly for the Galactic Alliance Remnant before formally striking an alliance with them; Corso additionally referred to the Empire-in-exile as the \"true Imperial forces\" despite the fact that they had no official partnership with the Jedi. Her judgment was trusted by both the Galactic Alliance Triumvirate and the Jedi Council. Corso took no offense when Gar Stazi suggested that she could be a Sith in disguise, instead expressing admiration of the Admiral's caution and tact. She had magenta-colored skin, purple eyes, and no hair, and in 137 ABY, Corso used a blue-bladed lightsaber. One year later, she favored a green blade."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A Jedi Master, Corso was sensitive to the Force. She was able to sense the impending arrival of an enemy task force from hyperspace and was additionally an apt pilot. While defending the Hidden Temple, Corso was killed in lightsaber combat by one of Darth Krayt's Sith troopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Te Corso is a character in Star Wars: Legacy, a comic book series penned by John Ostrander and Jan Duursema. She first appeared in 2008 on the cover of the series' twenty-sixth issue along with Dun'La, Dan, and Drok, in a drawing done by Omar Francia. However, none of the four were included in the issue itself. Ostrander and Duursema originally intended that they would accompany Skywalker on his mission to assassinate Darth Krayt—a mission that was launched in the issue and fulfilled in the Star Wars: Legacy: Vector story arc, released later in the year—but they were ultimately dropped from the storyline due to a surplus of characters already on Skywalker's strike team."}, {"tag": "p", "text": "Corso made her first appearance proper in 2009 when she played a large role in Legacy's forty-second issue, penciled by Dave Ross. Two of artist Chris Scalf's rough drafts of the issue's cover included Corso, but the final version featured only Drok and Gar Stazi. Corso later appeared in Legacy's forty-seventh issue, released in 2010, and the fourth issue of Legacy's followup miniseries, Star Wars: Legacy—War, released in 2011. Both issues were penciled by Jan Duursema. In the latter issue, Corso uses a green-bladed lightsaber, but the cover of Legacy 26 shows her yielding a blue-bladed weapon. However, the issues are set in different years, and this article treats both colors as canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}