{"url": "Battle_of_Hapes_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Hapes", "Category:Battles of the Yuuzhan Vong War", "Category:Empire of the Hand events"], "nodes": [{"tag": "h1", "text": "Battle of Hapes  (Yuuzhan Vong War)"}, {"tag": "p", "text": "A battle was fought above Hapes during the Yuuzhan Vong War in 27 ABY between the Hapes Consortium, Empire of the Hand and New Jedi Order against the Yuuzhan Vong Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the events of the Mission to Myrkr and the capture of Coruscant, the Jedi Knight Jaina Solo, and the other surviving members of the Myrkr strike team, fled on the stolen Vong frigate Ksstarr to Hapes which was the homeworld of strike team member Tenel Ka."}, {"tag": "p", "text": "Prior to the attack, Teneniel Djo, the current Queen Mother and the daughter-in-law of former Queen Mother Ta'a Chume, was in a near-comatose state caused by the Force backlash that resulted from the deaths of the Hapan fleet at the Battle of Fondor. Ta'a Chume saw this as an opportunity to thwart her and replace her with Jaina, who would reign as her pawn alongside Isolder. The Jedi also attended the funeral of Anakin Solo, one of the fallen members of the strike team."}, {"tag": "p", "text": "While on Hapes, Jaina Solo discovered how the Yuuzhan Vong track their ships, and how to confound that technique. By utilizing a small repulsor device created by Lowbacca, she was able to send up countless decoys, both to test her theory and to infuriate the Vong. Jaina would also make the Ksstar her personal transport and have it renamed Trickster."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Meanwhile, the Yuuzhan Vong Warmaster Tsavong Lah dispatched his son Commander Khalee Lah and the Priest Harrar with a battle fleet to Hapes with the intent of capturing Jaina due to her part in the Myrkr mission and her role of being the twin sister of Jacen Solo who they had captured earlier. They would then be sacrificed to the Yuuzhan Vong gods."}, {"tag": "p", "text": "During the subsequent battle, Tenel Ka gave Jagged Fel, Jaina and Kyp Durron the command of the newly made Hapan Royal Navy. During the battle, Jaina used her experience with the stolen Vong vessel Trickster to manipulate the gravitic signatures of the bioengineered vessels of the enemy fleet. Thus, the Yuuzhan Vong were tricked into firing on their own vessels. After a long battle, the Yuuzhan Vong were defeated and Hapes remained free. Khalee Lah committed suicide rather than bring dishonor to his father and Domain Lah."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Later, Teneniel Djo was poisoned by Ta'a Chume as part of her plot to take over the Hapes Consortium. Ta'a Chume attempted to force Jaina to marry her son Isolder, which she refused. Tenel Ka quickly restored order by assuming the position of Queen Mother and having Ta'a Chume arrested."}, {"tag": "p", "text": "Because of her role in deceiving them, as well as subsequent disinformation by New Republic Intelligence, the horrified Yuuzhan Vong began to believe that Jaina Solo was Yun-Harla, the Goddess of Deception."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}