{"url": "Battle_of_Haruun_Kal", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of Haruun Kal", "Category:Battles of the Clone Wars", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Haruun Kal"}, {"tag": "p", "text": "The Battle of Haruun Kal was a battle that took place on the planet Haruun Kal during the Clone Wars. Jedi General Depa Billaba led her battalion of Republic clone troopers against enemy forces from the Confederacy of Independent Systems. The Separatist commander, General Grievous, engineered an onslaught that claimed the lives of ninety percent of Billaba's troops, resulting in a Confederate victory. Grievous personally bested Billaba in single combat, and she remained in a coma for the next six months as she healed from her extensive injuries. Eventually, she recovered and received command of a new battalion of soldiers, though her failure at Haruun Kal haunted her for some time."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the Clone Wars, the planet[source?] Haruun Kal became a battlefield when detachments from the Grand Army of the Republic and the military of the Confederacy of Independent Systems clashed there. Overseeing the Republic infantry was Jedi General Depa Billaba, a member of the Jedi High Council. Her battalion of clone troopers encountered resistance in the form of the Confederate General Grievous. Grievous's forces decimated Billaba's troops, causing her unit to suffer ninety percent casualties. Only four soldiers survived the carnage: Commander CC-10/994, nicknamed \"Grey\"; Captain Styles; Sergeant Soot; and Corporal Big-Mouth."}, {"tag": "p", "text": "Grievous, meanwhile, engaged Billaba in single combat and defeated her, severely injuring her and rendering her comatose. Though Grievous failed to confirm her death, the Confederacy eventually learned of her survival and included it in its intelligence files."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "On account of the Republic's catastrophic losses, the Confederate forces claimed victory on Haruun Kal. Billaba was brought back to the Jedi Temple on the Republic capital of Coruscant, where she entered medical treatment. Some of her surviving men, including Styles and Grey, believed that they had failed her at Haruun Kal and swore to never do so again."}, {"tag": "p", "text": "Billaba did not emerge from her coma until six months later, at which point her fellow Jedi Masters evaluated her and allowed her to return to her seat on the Jedi High Council. Her defeat at Haruun Kal not only tarnished her reputation as a military commander, but it also hindered her confidence as a general and forced her to live with the guilt of losing so many men. Nevertheless, she helped to thwart a Separatist attack on the Jedi Temple and resumed her military service with a new Padawan, Caleb Dume. Grey, Styles, and the other survivors of Billaba's previous unit became the commanding officers of her new battalion within the Grand Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Haruun Kal was created as part of the backstory for Star Wars: Kanan, a canon comic series published by Marvel Comics. Writer Greg Weisman developed the details of the battle for the series' second story arc, First Blood. The battle was initially alluded to in the story arc's first issue."}, {"tag": "p", "text": "The plot point of Depa Billaba entering a coma after a battle on Haruun Kal originated in Shatterpoint, a Star Wars Legends novel that was written by author Matthew Stover and published in June 2003."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}