{"url": "Techno_Union/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Commerce and labor guilds and unions", "Category:Confederacy of Independent Systems organizations", "Category:Conglomerates", "Category:Techno Union"], "nodes": [{"tag": "h1", "text": "Techno Union"}, {"tag": "p", "text": "The Techno Union was one of the Galactic Republic's commerce guilds. It was a large coalition of high technology firms formed primarily of heavy manufacturing concerns. The Techno Union lobbied the Galactic Senate on behalf of its members' interests and attempted to ensure fair commerce between its members. In time, the Techno Union would grow to include galactic shipping magnates to further ensure the free flow of goods."}, {"tag": "p", "text": "The Techno Union was one of the first to pledge its support to the newly formed Confederacy of Independent Systems, and went on to be one of the major suppliers of starships, battle droids, and other weapons for the Separatist cause during the Clone Wars. They also created many research and development projects for the CIS ranging from superweapons to cloning experiments."}, {"tag": "p", "text": "In 19 BBY, the Techno Union was dissolved when its Foreman, Emir Wat Tambor was slain with the rest of the Separatist Council at the hands of Darth Vader. The guild was then imperialized by the newly-formed Galactic Empire."}, {"tag": "h2", "text": "Composition"}, {"tag": "h3", "text": "Baktoid Armor Workshop"}, {"tag": "p", "text": "Prior to the Invasion of Naboo, Baktoid Armor Workshop was a Trade Federation-owned design firm that specialized in developing rugged all-terrain ground vehicles for use by civilians. Wat Tambor was one of (or possibly the) Baktoid's executive officers. Raith Sienar was an acquaintance of Baktoid's chief designer, a man who was obsessed with tanks. After the Invasion of Naboo, the Trade Federation tried to distance itself from Baktoid. Being the Foreman of the Techno Union and an executive of Baktoid, Wat Tambor associated Baktoid Armor Workshop with the CIS, supplying many of the ground vehicles for the Battle droid forces such as the AAT."}, {"tag": "h3", "text": "Baktoid Combat Automata"}, {"tag": "p", "text": "Baktoid Combat Automata was the sister company of Baktoid Armor Workshop but the two were very different. As Baktoid Armor Workshop was a public company, Baktoid Combat Automata worked in secret creating battle droids and weapons for the Confederacy of Independent Systems. Baktoid Combat Automata had factories on many planets that churned out countless amounts of battle droids."}, {"tag": "h3", "text": "Haor Chall Engineering"}, {"tag": "p", "text": "Haor Chall Engineering was one of the companies that the Trade Federation had contacted for the creation of combat vehicles. They were founded by the Xi Char an insectoid race and a fanatical religious order devoted to high-precision manufacturing. Haor Chall Engineerings factories on Charros IV were destroyed by the Republic permanently crippling the company. Sienar Fleet Systems then absorbed what was left of Haor Chall Engineering."}, {"tag": "h3", "text": "Republic Sienar Systems"}, {"tag": "p", "text": "Republic Sienar Systems was the predecessor to Sienar Fleet Systems and was founded during the days of the Galactic Republic. It funded the Allied Tion Historical Society. During the Clone Wars, the company supplied numerous vehicles to the Confederacy of Independent Systems, much to the disdain of the Galactic Senate. Shortly before Emperor Palpatine took control, the Senate ordered the dissolution of Republic Sienar Systems. The company's holdings were also absorbed by the Republic Navy."}, {"tag": "h3", "text": "Kuat Drive Yards"}, {"tag": "p", "text": "Kuat Drive Yards was one of the many firms associated with the Techno Union before the Clone Wars. They were then contracted with the cloners of Kamino and seceded from the Techno Union."}, {"tag": "h3", "text": "BlasTech Industries"}, {"tag": "p", "text": "BlasTech Industries was one of the premier arms manufacturers in the galaxy. It left the Techno Union in favor of the Republic prior to the outbreak of the Clone Wars."}, {"tag": "h3", "text": "Corellian Engineering Corporation"}, {"tag": "p", "text": "Corellian Engineering Corporation was one of the three largest starship manufacturers in the galaxy. CEC, as it was known as, relied on civilian sales rather than military contracts. Although its business is done mostly with the Galactic Republic, it does associate with the Confederacy of Independent Systems for a few occasions."}, {"tag": "h3", "text": "Mon Cala Shipyards"}, {"tag": "p", "text": "Mon Cala Shipyards was a member of Techno Union, until the Galactic Civil war broke out. Tearing them away from their parent company. Despite this Mon Cala was a devout member of the Union. Building many warships for their cause."}, {"tag": "h3", "text": "Colicoid Creation Nest"}, {"tag": "p", "text": "Colicoid Creation Nest was the primary droid manufacturing company on Colla IV. It was operated by the Colicoids who developed the fearsome Droideka in their own image."}, {"tag": "h3", "text": "Arakyd Industries"}, {"tag": "p", "text": "Arakyd Industries was a major manufacturer of droids, heavy weapons, and starships, dating back to the days of the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early events"}, {"tag": "p", "text": "In the last decades of the Galactic Republic, Foreman Wat Tambor modeled the Union's behavior after the Trade Federation, earning a seat in the Senate and the right to defend itself with a droid army. At some point centuries ago, the group purchased the Foerost Shipyards that once served the Republic Military during ancient times. Following this point, corporate signatories that were part of the Techno Union used the facility for the construction and testing of both new materials as well as propulsion systems. It eventually became the largest construction asset within the organization. The Techno Union was known to have claimed the planet Saleucami in 35 BBY with the intention of transforming it into one of their mechworlds."}, {"tag": "p", "text": "By the years of the Separatist Crisis, growing corporate competition led to the Techno Union petitioning for bolstering their security forces at Foerost Shipyards. The Galactic Senate approved the request by Foreman Wat Tambor that led to 40,000 battle droids being assigned to the shipyards in exchange for continued Republic access to the facility. At the same time, the General Ministry Institutes cut funding for a number of organizations and bodies within the Republic. This led to some groups relying on private funding as a source of credits. The Techno Union was one such private entity that, alongside Kuat Drive Yards, was providing generous donations to the Fondor Academy of Engineering and Design. The reason for the institution being subsidized was because both entities drew a sizable pool of employees from the Academy."}, {"tag": "p", "text": "During these years, there were rumors that Hego Damask had been meeting with the heads of the various guilds that included the Corporate Alliance, Techno Union and Trade Federation with the goal of brokering a deal regarding trade. When the Separatist Crisis came to a head, the Techno Union was one of the first to pledge its support to the Confederacy of Independent Systems. This was despite the misgivings of several high ranking members of the Techno Union and led to the Galactic Senate expelling their representatives leading to them joining the Separatist Movement."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "As the conflict grew into the Clone Wars, the Techno Union was one of the Confederacy's key suppliers of starships, battle droids, and weapons. It is clear that at this point the union was split, with some individual members choosing to support the Republic. BlasTech and CEC left, wishing to stay loyal to the Republic, TaggeCo switched to the Republic during the war, while Arakyd remained neutral and sold to both factions."}, {"tag": "p", "text": "In 20 BBY, the Republic attacked their base on Xagobah. During the course of the battle, Boba Fett tried to assassinate Wat Tambor, only to be stopped by General Grievous who was there at the time. Eventually however, the Republic liberated Xagobah."}, {"tag": "p", "text": "In the years prior to the Wars, Kuat Drive Yards was a member and experimented with new and larger capital ship designs under the auspices of the Union. At some point, the company split with the organization, with Kuat preferring to create ships for the Republic from that point on. The information gained with these projects, provided the Techno Union with some intellectual clout later on, as a representative of the Union's neutral Research and Development Wing participated in a debate on the nature of the mysterious Separatist superweapon that was active early in the Clone Wars."}, {"tag": "p", "text": "At some point during the war, the Techno Union had prepared plans for an advanced battle droid model at one of the facilities on a planet. Knowledge of this was discovered by the Republic who dispatched Anakin Skywalker and his Padawan Ahsoka Tano to infiltrate the planet in order to steal those schematics. This led to General Skywalker masquerading as a wealthy merchant by the name of trader Kwarelsky with Ahsoka pretending to be his slave. As Kwarelsky, Anakin intended to donate a considerable amount of money to the Separatist cause due to the great expense faced in fielding droids for warfare. After seeing that Kwarelsky suffered from apparent allergies, the grateful Skakoans intended to upgrade him into a cybernetic being which was when Skywalker revealed his true allegiance to the Republic. Padawan Tano in the mean time managed to defeat the droid security forces and steal the data she needed whereupon she freed her master before he could be converted into a cyborg."}, {"tag": "p", "text": "In 19 BBY, unhappy with the progress of the Separatist Droid Army and in awe of the prowess of General Grievous, Wat Tambor commissioned research into developing alternative infantry. These included constructing cloning facilities in Saleucami's underground caverns for the production of the Confederacy's own clone army—Morgukai clones trained by Anzat assassins and the establishment of a secret laboratory on Nelvaan to experiment on the creation of mutants and cyborg control devices."}, {"tag": "p", "text": "However, this base was powered by a siphon generator that drained a captured geothermal crystal, keeping Rokrul region in a wintery state by draining all the thermal energy from the land. The base also transformed all the males of the nearby Rokrul village into savage mutants. However, the base was destroyed by Anakin Skywalker at the Battle of Nelvaan."}, {"tag": "p", "text": "Following the end of the Clone Wars and the rise of the Galactic Empire, the remnants of the Techno Union were likely folded into the Empire's military-industrial complex along with the other manufacturing interests of the defeated Confederacy."}, {"tag": "h2", "text": "Allied planets"}, {"tag": "h3", "text": "Skako"}, {"tag": "p", "text": "Skako was the home planet of the Skakoan species and headquarters of the Techno Union. The planet was located in the Core and had heavy atmospheric pressures. Skako was similar to Coruscant by which the entire planet was covered in a dense city. Skako and the Techno Union were represented in the Galactic Republic by Foreman Wat Tambor until seceding to the CIS."}, {"tag": "h3", "text": "Fondor"}, {"tag": "p", "text": "Fondor was a planet known for its massive ship yards. Fondor favored to the Techno Union and the CIS during the Clone Wars but the population was unsupportive of the Separatist cause and contributed very little to the war effort."}, {"tag": "h3", "text": "Foundry"}, {"tag": "p", "text": "Foundry was one of the many worlds that the Techno Union used to churn out B1-Series battle droids prior to the Clone wars. After the Republic outlawed the B1 battle droid, Foundry ceased production of battle droids. The city of Denus was also home to Wat Tambor's private estate."}, {"tag": "h3", "text": "Mechis III"}, {"tag": "p", "text": "Mechis III was one of the premier droid manufacturing planets. The surface of the planet was covered with automated factories. There, the Techno Union constructed many of their droid products."}, {"tag": "h3", "text": "Telti"}, {"tag": "p", "text": "The moon of Telti was located in the Inner Rim and was covered with countless droid factories. Baktoid Armor Workshop had factories on the moon prior to the Clone wars."}, {"tag": "h3", "text": "Metalorn"}, {"tag": "p", "text": "Metalorn was a harsh industrial planet that was stripped of its natural resources by the Techno Union during the Clone wars. Wat Tambor had constructed a B1 battle droid factory on the planet that also constructed cortosis battle droids. The Techno Union destroyed the lush forests and dried up Metalorn's rivers for the transportation of materials. In 21 BBY Anakin Skywalker foiled the production of the cortosis battle droid and ceased production of the droid."}, {"tag": "h3", "text": "Geonosis"}, {"tag": "p", "text": "The planet of Geonosis was home to the first capital of the CIS and Techno Union owned droid factories. After the outlawing of battle droids, the Techno Union moved its droid factories to Outer Rim Territories like Geonosis where they remained hidden until the out-break of the Clone wars."}, {"tag": "h3", "text": "Balmorra"}, {"tag": "p", "text": "Balmorra was one of the Techno Unions B1 battle droid production planets prior to the Invasion of Naboo. The factory was then shut down after the outlawing of battle droids."}, {"tag": "h3", "text": "Foerost"}, {"tag": "p", "text": "Foerost was a planet located in the Core and was orbited by the Foerost Shipyards, which was one of the Republics oldest and largest shipyards. The Techno Union bought these shipyards in 522 BBY. In 22 BBY, the Techno Union secretly tightened the security of the shipyards, in preparation for the Clone wars. Later during that conflict, the system was blockaded by the Republic. In 20 BBY, the Techno Union broke the Republic blockade through the use of a fleet of Bulwark-class Mk I battlecruisers, setting off the epic Battle of Foerost. This fleet ravaged Sector Zero until it was stopped by a fleet of Victory-class Star Destroyers."}, {"tag": "h3", "text": "Hypori"}, {"tag": "p", "text": "After the Invasion of Naboo, the Techno Union transformed Hypori into a foundry world. Baktoid Armor Workshop and an entire Geonosian hive created huge underground factories that were kept secret to the Republic until the Clone wars."}, {"tag": "h3", "text": "Tar Morden"}, {"tag": "p", "text": "Tar Morden was a planet with a Techno Union factory. At the end of the Clone wars, the Galactic Republic seized the factory and acquired many Crab droids, which were sent to Carida."}, {"tag": "h3", "text": "Ord Cestus"}, {"tag": "p", "text": "In 26 BBY, a mining union strike was ended with the use of killer droids. Techno Union factories on Ord Cestus produced B1 battle droids until shortly before the onset of the Clone Wars, when such production seemingly stopped, continuing in secret on hidden factories such as those on Geonosis."}, {"tag": "h3", "text": "Xagobah"}, {"tag": "p", "text": "In 21 BBY, Xagobah was conquered by the Confederacy of Independent Systems. The planet was liberated by the Galactic Republic in 20 BBY. It was during the liberating battle that young Boba Fett attempted to collect a bounty on Wat Tambor's head, and failed."}, {"tag": "h3", "text": "Nelvaan"}, {"tag": "p", "text": "During the Clone Wars, Nelvaan was home to a Techno Union laboratory that experimented on the warriors of the Nelvaanian tribes, unhappy with the progress of the Confederacy droid army and in awe of the prowess of General Grievous. Their experiments, based around a siphon generator that drained thermal energy from the surrounding area, resulted in the endless winter experienced all over the planet. The base was destroyed by Anakin Skywalker and freed the mutated yet liberated Nelvaanian warriors in the Battle of Nelvaan."}, {"tag": "h3", "text": "Saleucami"}, {"tag": "p", "text": "Saleucami came under direct control of the Techno Union three years before the Battle of Naboo. During the Clone Wars, Saleucami was a valuable member of the Confederacy of Independent Systems and was as a result named by Supreme Chancellor Palpatine as part of a \"Triad of Evil,\" alongside Felucia and Mygeeto."}, {"tag": "h3", "text": "Vulpter"}, {"tag": "p", "text": "Vulpter was a heavily polluted, industrial planet in the Deep Core and was the headquarters for Arakyd Industries."}, {"tag": "h3", "text": "Mustafar"}, {"tag": "p", "text": "Mustafar was a volcanic planet which had been a Techno Union possession since 300 BBY. The Techno Union utilized the world as a mining facility to extract many valuable minerals, including Mirkanite, from the lava flows on its surface as well a source of geothermal energy. During the Clone Wars, Mustafar was the last capital of the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Associations"}, {"tag": "h3", "text": "Notable members"}, {"tag": "h4", "text": "Tendir Blue"}, {"tag": "p", "text": "Tendir Blue was a CIS agent working for the Techno Union."}, {"tag": "h4", "text": "Bunt Dantor"}, {"tag": "p", "text": "Bunt Dantor was a Skakoan who worked in the Techno Union Research and Development Wing. He created many of the systems onboard a mysterious new weapon for the Separatists."}, {"tag": "h4", "text": "Poggle the Lesser"}, {"tag": "p", "text": "Archduke Poggle the Lesser, was the leader of the planet Geonosis. He lead the creation and production of the B2 super battle droid. He also built many droid factories across the Geonosian desert."}, {"tag": "h4", "text": "Dua Ningo"}, {"tag": "p", "text": "Dua Ningo was a Sullustan military officer who lead the Separatist Bulwark Fleet. His fleet destroyed the Galactic Republic fleet blockading the Techno Union owned Foerost Shipyards and began to terrorize Republic worlds in Sector Zero."}, {"tag": "h4", "text": "Wat Tambor"}, {"tag": "p", "text": "Emir Wat Tambor was the foreman of the Techno Union and the executive of Baktoid Armor Workshop, both of whom manufactured most of the battle droids used by the Trade Federation. He was one of the first to pledge his Droid Army to the new Confederacy of Independent Systems, receiving a seat on its governing council. Tambor became the lead engineer of the Separatists, supplying them with various automata for their campaigns against the Galactic Republic."}, {"tag": "h4", "text": "Domb Treetor"}, {"tag": "p", "text": "Domb Treetor was a Skakoan Appropriations Chief for the Techno Union prior to the Clone Wars. After the Techno Union signed into the Confederacy of Independent Systems, he became a Major in the Separatist armed forces."}, {"tag": "h4", "text": "Main Techno Union scientist"}, {"tag": "p", "text": "The main Techno Union scientist was the lead engineer on the planet Nelvaan. There, he created mutated Nelvaanian cyborgs as a replacement to battle droids. His project was ultimately killed as with him."}, {"tag": "h4", "text": "Kul Teska"}, {"tag": "p", "text": "Kul Teska was a scientist in the Techno Union, considered one of the brilliant minds of the company. However, an accident that caused his disfigurement led to his resignation. In his bid to finish his research on gravity and associated weapons, he turned to a life of crime, offering his services as a mercenary. His perfected cybernetic augmentations and arsenal made him a bitter rival of Cad Bane, which together with his gravitic research captured the attention of Count Dooku, who hired him to do continue his scientific work on Bephour."}, {"tag": "h4", "text": "Gume Saam"}, {"tag": "p", "text": "Gume Saam was an Ishi Tib politician representing both his homeworld of Tibrin and the Techno Union since as early as the beginning of the Clone Wars. Though publicly a supporter of the Galactic Republic, he swayed towards the interests of the Confederacy of Independent Systems. Together with fellow senators Lott Dod and Nix Card, Saam conspired with Count Dooku to stage an attack that would allow him to pass a bill, which would deregulate the banks and open new lines of credit for the Techno Union, InterGalactic Banking Clan and Trade Federation."}, {"tag": "h2", "text": "Products"}, {"tag": "h3", "text": "Battle droids"}, {"tag": "h4", "text": "B1 Battle Droid"}, {"tag": "p", "text": "B1-Series battle droids were battle droids that made up the backbone of the Trade Federation Droid Army and later the Separatist Droid Army. B1s were perhaps the most numerous—and expendable—soldiers in galactic history, and, unlike most organic soldiers, they were capable of action in hostile environments such as underwater environments or in the vacuum of space. They were designed, for the most part, to defeat their enemies through sheer numbers, not through their ability to think and utilize combat skills (unlike clone troopers). The B1 was a product of Baktoid Combat Automata, owned by the Techno Union and the Trade Federation. They were the successor of the OOM battle droid, which were more expensive because they had more independent programming than the B1."}, {"tag": "h4", "text": "OOM-Series Battle Droid"}, {"tag": "p", "text": "The OOM-series battle droid was the predecessor of the B1 battle droid. The OOM battle droid was a product of Baktoid Combat Automata. While physically identical to the latter, the OOM-series possessed more advanced and independent programming. They were already a common sight in the galaxy before the Invasion of Naboo, serving as security and crew for the Trade Defense Force. They later served in the Clone Wars alongside their more common but simpler B1 descendants. They were color coated for the specific function each droid served."}, {"tag": "h4", "text": "B2 Super Battle Droid"}, {"tag": "p", "text": "The successor to the B1 battle droid, the B2 super battle droid was an upgrade from the inferior B1. The B2 possessed better firepower, heavier armor, and independent thought. They also had modular arms for more weapon attachments and specialized equipment for their feet. The B2 battle droids processing unit and signal receptor were located inside the torso of the machine protecting it with its heavy armor. Like the B1, the B2 was manufactured by Baktoid Combat Automata."}, {"tag": "h4", "text": "Fastlatch-class defense droid"}, {"tag": "p", "text": "The Fastlatch-class defense droid was a squat, self-activating droid consisting of a domed, clamshell body suspended by four pincer-like legs. It had twin photoreceptors bracketing a single, central blaster cannon, and an antenna protruding from the upper dome. These droids were known to become more aggressive towards targets the nearer the enemy got to the source of their programming. Though self-activated, the droids could be programmed to avoid attacking beings who carried repellent signal emitters.[source?]"}, {"tag": "h4", "text": "LM-432 Crab Droid"}, {"tag": "p", "text": "Ranging from three to twenty feet tall, LM-432 crab droids could use its legs to attack infantry in its way. As well as their powerful pincer legs, LM-432 crab droids were armed with twin blasters. These blasters were capable of rapid fire and a powerful double blast. They were also equipped with a vacuum pump system integrated into their forward pincers, which could suck up and then spit out mud to either clear space for Separatist forces or obscure the visual sensors of enemy forces. This earned them the nickname of \"muckracker\". Crab droids also used their front two pincers to whack opponents out of the way or to crush them with their ends."}, {"tag": "h4", "text": "Octuptarra Combat Tri-Droid"}, {"tag": "p", "text": "The Octuptarra combat tri-droid had a large balloon-like head atop a thin stalk body, armed with laser turrets. It was named after the eight-eyed, gasbag-headed vine walkers native to Skako. They were equipped with three laser turrets as standard, one on each side, below each photoreceptor. Their rotating multi-jointed assemblies allowed them to change facing almost instantly and they could fire from extended ranges, though they were vulnerable in close-quarters fighting. It was almost impossible to approach such droids, as all sides conceivably faced the front."}, {"tag": "h4", "text": "Spelunker Probe Droid"}, {"tag": "p", "text": "Used for initial exploration of mineral resources, the two-meter tall Spelunker probe droid had four articulated pincer legs for traveling and a repulsorlift to further support the weight of its cylindrical body. The legs could also generate traction fields, allowing the droid to walk vertically and even upside down. The droids, which were able to survive in a wide range of climates, were dispatched to planets via hyperspace pods, where they would use their sophisticated sensor arrays to locate potential mining spots. Once the droids found an economically viable site, they would begin preliminary blasting in preparation for larger mining teams. The Techno Union modified many of these droids for military service."}, {"tag": "h4", "text": "Tri-Droid"}, {"tag": "p", "text": "The Tri-droid was an up-scaled version of the smaller Octuptarra combat tri-droid. Chain-fed ordnance launchers replaced the laser cannons of its predecessors, with the reserves of ammunition stored within the hollows of its bulbous head, although some models did retain laser cannons as seen in the Battle of Christophsis. One rocket fired from a single behemoth was powerful enough to annihilate an UT-AT if aimed correctly, as seen in the Battle of Mygeeto. These three-legged artillery droids were formidable in battle, reducing infantry and tanks to rubble. Their rotating multi-jointed assemblies allowed them to change facing almost instantly and they could fire from extended ranges. It was almost impossible to approach such droids, as all sides conceivably faced the front."}, {"tag": "h4", "text": "Droideka"}, {"tag": "p", "text": "The Droideka was a type of heavy battle droid used by the Trade Federation and the CIS. The Droideka was equipped with two twin-repeating blasters for arms and a built-in shield projector. They could curl up into a \"ball form\" to quickly maneuver around the area. The droideka was designed by the carnivorous Colicoids of Colla IV, who were displeased by the limitations of Baktoid Combat Automata's basic B1 battle droids, and chiefly manufactured on their homeworld."}, {"tag": "h4", "text": "C-B3 Cortosis Battle Droid"}, {"tag": "p", "text": "The C-B3 cortosis battle droid was a battle droid similar in design to the B2 super battle droid. Their outer shell was made out of cortosis, a substance that could block lightsaber attacks. The black outer shell was clamped to the droids' frame in formfitting plates. The droids also had the same intelligence matrix as the similar B2 battle droid, however, they lacked the gripping hands of the B2 battle droid, since their arms ended in double high-intensity laser cannons. The ball joint of the wrist allowed the cannons to swivel in almost any direction. The droids could also use their arms to block lightsaber blades."}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h4", "text": "Mankvim-814 Light Interceptor"}, {"tag": "p", "text": "The Mankvim-814 light interceptor was a bulbous, oval-shaped, short-range fighter created by the Feethan Ottraw Scalable Assemblies on behalf of the Techno Union on the planet Utapau. The Techno Union built these tiny, short-ranged starfighters on the planet from local materials. They were hastily constructed in the ancient Grand Halls without any regard for Utapau's architectural heritage. The Mankvim-814's simple construction consisted largely of a reactor feeding power to a high-velocity ion drive. A magnetized rudder tilted the ion flow for off-axis thrust, while side thrusters aided roll and yaw adjustments. The interceptor was armed with twin rapid-fire laser cannons and durable deflector shields for combat. The Mankvim-814 light interceptor seated one pilot, typically a droid pilot. The interceptor's aerodynamic wings, fitted with repulsorlifts, aided with overall maneuverability."}, {"tag": "h4", "text": "Variable Geometry Self-Propelled Battle Droid, Mark I"}, {"tag": "p", "text": "The Variable Geometry Self-Propelled Battle Droid, Mark I (also known as the Vulture-class droid starfighter or simply as the Vulture droid) was a Droid starfighter designed by Haor Chall Engineering, which was founded by the fanatical Xi Char, a religious order dedicated to high-precision manufacturing. It was equipped with four blaster cannons, two Energy torpedo launchers, and an integrated droid brain rather than a pilot. The Vulture droid was used by the Trade Federation and the CIS. It was used heavily throughout the Clone wars."}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h4", "text": "Bulwark-Class Mk.I Battlecruiser"}, {"tag": "p", "text": "The 1,000-meter long Mark I battlecruisers were built for the Bulwark Fleet, which the Techno Union used to escape the blockade of Foerost during the Clone wars. In response, the Galactic Republic commissioned their fleet of Victory-class Star Destroyers prior to schedule to protect Sector 0."}, {"tag": "h4", "text": "Hardcell-Class Interstellar Transport"}, {"tag": "p", "text": "The Hardcell-class was a cylindrical, titanium-hulled vessel just over 220 meters in height, and powered by a cluster of six primary thruster engines. The Hardcell did not use conventional Repulsorlifts for flight, instead using rocket propulsion designed for atmospheric and stellar travel. The transport's drive motors were deployed to generate enough retro-rocket thrust to achieve vertical landings at speeds of up to 800 kilometers per hour. A set of three landing legs—sometimes converted into landing claws for operations on low-gravity worlds—were deployed from the underside of the transport to stabilize its landing. The Hardcell-class could achieve takeoff at speeds of 4,000 kilometers per hour, though in space, the vessel was capable only of a relatively slow sublight speed of 40 MGLT.\nThe transport was crewed by organics, with crew and medical quarters located in the conical nose. Most had pressurized cabins so that Skakoans could remove their pressure suits. This area also contained an advanced sensor array and secure communications equipment to maintain contact with the Interstellar Stock Exchange."}, {"tag": "h3", "text": "Other"}, {"tag": "h4", "text": "Techno Union HoloDroid"}, {"tag": "p", "text": "The Techno Union HoloDroid was a droid equipped with a holo-emitter and the ability of momentum. Similar to that of the Trade Federation mechno-chair, the HoloDroid was used for intergalactic communication for important personnel."}, {"tag": "h4", "text": "Skakoan Combat Engineer"}, {"tag": "p", "text": "Skakoan combat engineers were Skakoans that worked in the science of combat engineering. They worked on the planet Nelvaan for General Grievous and the Confederacy of Independent Systems. There they performed crude experiments on the native Nelvaanians, turning them into hideous mutated cyborgs using a unique form of microelectronics for Grievous to call them his elite and for the war."}, {"tag": "h4", "text": "Skakoan Legal Deputies"}, {"tag": "p", "text": "The Skakoan legal deputies, also known as Skakoan Commandos, were elite Skakoans who served as members of Wat Tambor's staff. Two members rescued Wat Tambor from a detainment center on Delrian by decompressing their pressure suits and incapacitating the squad of eight clone troopers assigned to escort Tambor."}, {"tag": "h4", "text": "C-9979 Landing Craft"}, {"tag": "p", "text": "The C-9979 landing craft was a large-sized landing craft built by Haor Chall Engineering for the Trade Federation's military forces, and later for the Confederacy of Independent Systems. The C-9979 configuration was chosen due to its close resemblance to the commercial barges used by the Federation's merchant fleet. The ship had four wings with a wingspan of 370 meters. These wings were removable so that they could be stored away easily aboard the massive battleships. They were bound by powerful tensor fields to the fuselage when the craft was assembled for use. Even the strongest metal alloys were unable to bear the immense cargo weight inside the wings, thus making tensor fields essential for the craft. These wings were used to carry vehicles racked in garage channels for maximum loading capacity. When deployed, these vehicles were guided along repulsor tracks to a staging platform. Because of its heavy cargo, the landing craft had a huge antigravity lifting capacity. The landing craft was manned and operated by B1 battle droids. Landing craft were stored in the hangars of warships where they were assembled, serviced, and repaired."}, {"tag": "h4", "text": "Multi-Troop Transport"}, {"tag": "p", "text": "The Multi-Troop Transport (MTT) was manufactured and designed by Baktoid Armor Workshop. Reminiscent of a jungle animal, its reactor and main engines were in the rear, in classic Baktoid style. The MTT could carry 112 battle droids with their standard blaster rifles in a hydraulically powered deployment rack. This rack extended out from the face of the MTT, allowing the droids to be deployed directly into combat if needed. The MTT's control room was staffed by a OOM pilot battle droid and a droid gunner/engineer. It was armed with only a quartet of 17kv anti-personnel blaster cannons mounted in ball turrets. A single turret was accurate and powerful enough to target and destroy a starfighter in atmospheric combat."}, {"tag": "h4", "text": "Ostracoda-class Gunboat"}, {"tag": "p", "text": "The Ostracoda-class gunboat was a sea-going vessel designed by Baktoid Armor Workshop for the Trade Federation. The gunboat boasted a rotating anti-aircraft laser turret and two twin laser cannons, as well as an energy bomb launcher. It could glide over waterways like the AAT did on land."}, {"tag": "h4", "text": "Single Troop Aerial Platform"}, {"tag": "p", "text": "The Single Trooper Aerial Platform, or the STAP, was an agile flying machine designed for use by the Trade Federation's and Confederacy of Independent Systems' B1 battle droids. It was designed by Baktoid Armor Workshop. Each STAP was piloted by a single battle droid that stood on a long foot panel, gripping a pair of handles that controlled its weapons and were used to pilot the craft. STAPs utilized by the Trade Federation prior to the Clone Wars tended to be brown in color; Separatist STAPs were predominantly blue with white triangular markings."}, {"tag": "h4", "text": "Armored Assault Tank"}, {"tag": "p", "text": "The Armored Assault Tank, or AAT, was formidable; it was augmented with heavy inches-thick frontal armor that allowed it to plough through walls, and had heavy weaponry. It carried a payload of 55 shells, but once it ran out, the AAT had to return to its carrier to have its bottom section completely replaced, fully recharging its supply. Its crew consisted of four battle droids (one commander, one pilot, and two gunners), and could also carry six B1 battle droids on the hand grips on the outside of the tank The commander typically sat inside the turret of the primary blaster cannon, while the gunners and pilot were positioned in the main hull of the tank. The gunners operated both secondary blasters, and the commander controlled the main turret. The OOM series commander was essential to the function of the rest of the crew; if the commander was destroyed, the crew would cease functioning, often causing the tank to drift out of control."}, {"tag": "h4", "text": "Manta Droid Subfighter"}, {"tag": "p", "text": "The Manta droid subfighter was an aquatic droid fighter craft used by the Trade Federation and later the Confederacy of Independent Systems. It was designed by Haor Chall Engineering, who also constructed the Vulture droid. The sleek torpedo-like droid body was capped in front of a large wedge-shaped diving plane. The forward edge of the plane had an electromotive field, that when merged with repulsorlift-driven supercavitation vectrals incorporated into the subfighter's design, resulted in a very fast and surprisingly maneuverable underwater vessel. The twin barrels recessed in the plane sport laser cannons or torpedo launchers, and a few models even featured articulated barrel assemblies that allow both types of weapons on the same fighter."}, {"tag": "h4", "text": "Platoon Attack Craft"}, {"tag": "p", "text": "The Platoon Attack Craft, also known as the battle droid carrier, was a repulsorsled battle droid carrier created by Baktoid Armor Workshop. The troop carrier was piloted by two battle droid pilots. The vehicle's drive unit was adapted from a civilian cargo sled, though it featured a large troop deployment rack behind it. Similar to the deployment racks used in MTTs, the troop carrier's single rack could hold 112 battle droids, folded into their space saving configurations. The Techno Union created a copy of the Trade Federation version for their battle droids."}, {"tag": "h4", "text": "Mini-Sub"}, {"tag": "p", "text": "An aquatic version of the MVR-3 speeder bike, the mini-sub, adapted by the Xi Char cathedral factories, saw action in underwater battles during the Clone Wars. The mini-sub had armor protection for the droid pilot, as well as a single, large laser cannon. They were transported to underwater battlefields inside specialized carriers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}