{"url": "Tearfin", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Tearfin"}, {"tag": "p", "text": "Tearfin was a novice bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime following 0 BBY, she received a bounty to locate a smuggler who stole a crate of equipment. The equipment had a transponder, so she easily traced her mark to a city on Tatooine. Unfortunately, the smuggler realized that she was being tracked, so she turned off the transponder, and blended in with a group of other fellow smugglers within the city."}, {"tag": "p", "text": "Tearfin located the group of smugglers, but because she didn't know what what the smuggler looked like, she didn't know which one was her mark. She interrogated all of the smugglers, including the head smuggler, Captain Himfan. Unfortunately, Tearfin failed to find any information, because all of the smugglers simply blamed each other. She did, however, trust the captain."}, {"tag": "p", "text": "Fortunately for Tearfin, a spacer seeking to become a Hero of Tatooine found Tearfin, and offered to help. Tearfin stubbornly conceded that she could use some help, and allowed the spacer to interrogate the smugglers, named Barosk, D'lonis, Parugga, Klaphini, Rh'klin, and their captain, Himfan. After a grueling interrogation, the spacer determined that Rh'klin was the smuggler who stole the equipment. The spacer informed Tearfin of this finding, and was awarded the Mark of Intellect for the successful interrogation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tearfin is a Non-Player Characters (NPC's) in the MMORPG Star Wars Galaxies. She periodically spawns in random cities across Tatooine, along with the six smugglers. Players taking part in the \"Hero of Tatooine\" quest-line must help Tearfin determine which of the smugglers is her mark. By using process of elimination, players may determine that Rh'klin in the one who stole the equipment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}