{"url": "Battle_of_Herdessa_(Nagai%E2%80%93Tof_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of the Nagai-Tof War"], "nodes": [{"tag": "h1", "text": "Battle of Herdessa  (Nagai–Tof War)"}, {"tag": "p", "text": "The Battle of Herdessa was a preliminary battle in the Nagai invasion of 4 ABY."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the Battle of Endor, the Rebellion was busy with diplomacy as they prepared to set up a new government with the Alliance of Free Planets. Traveling to several worlds, leaders such as Mon Mothma and Leia Organa ensured the citizens that their interests would be met under the new government."}, {"tag": "p", "text": "These diplomatic missions eventually brought these two leaders to the planet Herdessa. The Alliance ambassadors were met with a less than friendly meeting after their arrival. Unknown to the Alliance, the Dark Lady Lumiya had allied with the leaders of the world as head of planetary security. In this position of power, Lumiya began to orchestrate a slaving operation, with members of the lower classes being shipped off world. This operation was being carried out in conjunction with another slaving operation on the planet Kashyyyk. The purpose of these concurrent slaving operations was to destabilize the Alliance's influence to pave the way for a Nagai invasion."}, {"tag": "p", "text": "As diplomatic relations ensued on Herdessa with the planetary leaders, Brylin, Tof, and Gaza, a behind the scenes slaving operation continued as planned. With the support of Herdessan shocktroopers Lumiya prepared to raid the slums of the city. As negotiations soured, Leia excused herself from the meeting and came face to face with Lumiya dealing with a lower class citizen personally. Leia helped the woman escape and fled back to her hideout where she learned that the woman Suzu was the leader of the resistance against Lumiya and the corrupt Herdessan politicians. After realizing that the Herdessan leaders were aiding Lumiya in setting up the slaving operation, Leia agreed to pledge her support to Suzu and her comrades."}, {"tag": "h3", "text": "The battle"}, {"tag": "p", "text": "Almost immediately after Leia had pledged her support, she was thrust immediately into an open conflict between Lumiya's forces and the Herdessan Rebels. Personally leading a large group of Herdessan shocktroopers, Lumiya burst into the Rebel's base. Nearly all the Rebels were incapacitated by stun beams in the firefight, but Leia and Suzu were able to escape from the battle."}, {"tag": "p", "text": "Realizing that the Rebels proved a potent threat at this point, Lumiya deployed a force of stormtroopers into the city to put down the Rebellion. After having taken the rebels captive, Lumiya found that Leia was still missing. Over a loudspeaker, Lumiya declared to the middle class citizens that they should evacuate their homes so that her forces could search their homes for the fugitive."}, {"tag": "p", "text": "Mon Mothma, now a prisoner of the corrupt Herdessan government, tried to appeal to the people to throw off their oppressors, but the citizens were too terrorized to stop the proceedings. However, a small fight broke out between several of the lower class citizens. The Herdessan Rebel Finn was soon detained and Lumiya prepared to execute him. Luckily, Suzu and Leia created a diversion that delayed the execution and allowed Leia to ambush Lumiya's guards."}, {"tag": "p", "text": "As Leia distracted the guards, Suzu released the rest of the prisoners and a final fight broke out between Lumiya's men and the now armed rebels. As the Rebels and the Imperial exchanged blaster fire, the remaining Herdessan citizens seized the opportunity to rise up against Lumiya and her corrupt allies. Attacking the Imperials from the rear, the Herdessan citizens quickly subdued their former oppressors, ending the battle."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Although the Herdessan slaving ring was destroyed, Lumiya was able to escape from the battle, making her way back to her forces. The corrupt planetary leaders were overthrown and were most likely replaced by Suzu and Finn. Herdessa likely became a member of the Alliance of Free Planets after this incident."}, {"tag": "p", "text": "Mon Mothma became concerned with the strength of the forces under Lumiya's control and spoke with Leia about discovering Lumiya's whereabouts and plans. Although plans to destabilize the Alliance with the introduction of a new slave trade had failed, Lumiya returned to the Nagai staging point on Kinooine where she prepared for the arrival of the main Nagai fleet. During the Skirmish on Kabray, Leia would put together Lumiya's allegiance to the Nagai in setting up the slave trade on Herdessa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}