{"url": "Techno_Union_Droid_Army/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Separatist Droid Army units", "Category:Techno Union"], "nodes": [{"tag": "h1", "text": "Techno Union Droid Army"}, {"tag": "p", "text": "The Techno Union Droid Army was owned by the Techno Union. During the Separatist Crisis, Foreman Wat Tambor pledged the army to Count Dooku's Confederacy of Independent Systems, which was merged into the Separatist Droid Army."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Foreman Wat Tambor of the Techno Union devoted the organization's droid army to the Confederacy of Independent Systems on Geonosis, following suit with the Trade Federation and, later, other corporate businesses."}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, Emir Wat Tambor and his T-series tactical droid, TA-175 launched an invasion of the planet Ryloth, after the discovery of treasure belonging to Corporate Alliance Magistrate Passel Argente. Neimoidian Captain Mar Tuuk headed the orbital defense force, while TX-20 was left in command of the Proton cannons. Nearing the end of the battle, the planetary capital, Lessu, was bombarded by the forces of the Galactic Republic and Wat Tambor was captured as his Sheathipede-class transport shuttle left with TA-175, under orders by Count Dooku. Scientist Kul Teska later commanded the remaining troops in order to retrieve an essential component of the Gravitic polarization beam from Bounty hunter Cad Bane. After a confrontation with Jedi Anakin Skywalker and Ahsoka Tano, he fled the planet with the Gravitic Core on Bane's Telgorn dropship, The Sleight of Hand."}, {"tag": "p", "text": "The Techno Union base on Xagobah was assaulted by Republic troops in 21 BBY. Wat Tambor and General Grievous commanded the Techno Union Droid Army throughout the battle but the planet was liberated."}, {"tag": "p", "text": "Wat Tambor, unhappy on the inferiority of battle droid infantry, began experimenting on new forms of infantry in 19 BBY. Cloning facilities were established on Saleucami and a Techno Union base was established on Nelvaan to experiment on mutation and cybernetic control devices. This Nelvaan base used a Siphon generator and churned out mutated Nelvaanians, with weapon systems grafted to their arms. The base and its commanding Techno Union scientist were destroyed by Anakin Skywalker."}, {"tag": "p", "text": "At the end of the Clone Wars, the Techno Union was imperialized into the Galactic Empire along with other technology manufacturers."}, {"tag": "h2", "text": "Forces"}, {"tag": "h3", "text": "Organic Forces"}, {"tag": "h3", "text": "Battle droids"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}