{"url": "Tech_Mo%27r/Legends", "categories": ["Category:Legends articles", "Category:Bith", "Category:Males", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Tech Mo'r"}, {"tag": "p", "text": "Tech Mo'r  was a Bith musician and professional ommni box player for the popular Jizz band known as Figrin D'an and the Modal Nodes. Along with his band mates, Tech was a registered member of the Intergalactic Federation of Musicians (IFM) in good standing. Like many Bith, Tech possessed a highly evolved brain, which allowed him a special acuity when it came to analyzing and relating to music. As such, his talents helped to greatly enhance the quality and popularity of the Modal Nodes' music."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Figrin D'an and the Modal Nodes had entered into an exclusive contract with the Tatooine crimelord, Jabba Desilijic Tiure. They would routinely perform in the courts at Jabba's Palace and his Mos Eisley townhouse, but it didn't take long before they all regretted entering into a contract with the Hutt. Recognizing Jabba's penchant for executing underlings that displeased him at a moment's notice, the Modal Nodes began to fear for their lives. It would only be a matter of time before Jabba decided to make a snack of the musicians, by tossing one down into the dungeon abode of his pet rancor. Fortunately for them, a golden opportunity was fresh at hand."}, {"tag": "p", "text": "One of Jabba's rivals, a Whiphid named Lady Valarian, offered the band 3,000 credits to perform at her wedding to the Whiphid hunter, D'Wopp. Figrin decided that the fast money would enable them to get off of Tatooine and out from under the thumb of Jabba the Hutt. They arrived at the Star Chamber Café reception hall inside of the Lucky Despot Hotel & Casino in Mos Eisley."}, {"tag": "p", "text": "Jabba learned of the Modal Nodes breach of contract and sent several of his bounty hunters down to the casino to disrupt the festivities. As luck would have it, Imperial stormtroopers likewise raided the party and a massive fire-fight broke out. During the confusion, the Modal Nodes met a party guest named Wuher who showed them a quick way out. Wuher put in a good word for them with Chalmun—a Wookiee who owned a nearby cantina where Wuher tended bar. Chalmun hired the Modal Nodes to play a couple of gigs at his bar, the following evening. They were performing the night when Luke Skywalker and Obi-Wan Kenobi entered the cantina seeking a pilot willing to ferry them to the Alderaan system. They continued to perform at Chalmun's on a regular basis. Occasionally, Chalmun's nightshift manager, Ackmena, would liven the bar's atmosphere by singing along with the Modal Nodes' rhythms."}, {"tag": "p", "text": "Shortly after this event, Figrin D'an wagered the band's instruments and equipment on a hand of sabacc. He lost the bet, but the Modal Nodes soon convinced him to win their equipment back. He eventually succeeded and the Modal Nodes went on to play the intergalactic circuit."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tech Mo'r was one of the more quiet members of the band and was commonly characterized by a \"glazed look in his eyes\". This was due largely in part to the fact that he was usually inebriated during most of their performances."}, {"tag": "p", "text": "During set breaks, Tech Mo'r could usually be found fiddling about, making adjustments on his ommni box."}, {"tag": "p", "text": "Tech once lost his ommni box to Figrin D'an over a hand of Sabacc. Figrin never allowed Tech the opportunity to win the instrument back, and because of this, he developed a longstanding hatred of Fiery Figrin. Despite their animosity towards one another however, they still managed to conduct themselves professionally when it came to their craft."}, {"tag": "p", "text": "Most of his colleagues in the band similarly lost ownership of their instruments and equipment to Figrin D'an—the only exception to this was Doikk Na'ts, who custom built his own Fizzz."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jibralta Merrill played the role of Tech Mo'r in Star Wars: Episode IV A New Hope. The artist has never been given screen credit for the role, although later investigations suggest that Jon Berg was under the mask."}, {"tag": "p", "text": "In 1995, Kenner released a special Power of the Force series mail-in offer for a five-piece action figure lot containing the members of the Modal Nodes. Tech Mo'r was one of the action figures featured in the set."}, {"tag": "p", "text": "In 1997, Tech Mo'r was released as a twelve-inch action figure for the Wal-Mart exclusive Star Wars Collector Series."}, {"tag": "p", "text": "In 2007, the Kenner mold was reissued as part of an exclusive Wal-Mart Commemorative Tin Set containing the members of the Modal Nodes. This time around, Tech Mo'r and the other figures were given fabric vests."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}