{"url": "Tecora/Legends", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Confederacy of Independent Systems starships", "Category:Galactic Republic starships", "Category:Slaver starships", "Category:YV-865 Aurore-class freighters"], "nodes": [{"tag": "h1", "text": "Tecora"}, {"tag": "p", "text": "The Tecora was a YV-865 Aurore-class freighter used for transporting slaves and goods to Zygerria. The Tecora sported a large cargo hold and could transport creatures the size of a Blixus. The ship's captain was Darts D'Nar. During the Battle of Kiros, it was captured after Anakin Skywalker and Ahsoka Tano boarded the ship and apprehended Darts D'Nar. The ship was then placed under Republic custody."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Kiros"}, {"tag": "p", "text": "During the Clone Wars, Count Dooku invaded the planet of Kiros. Dooku arrived on the planet with Zygerrian slaver Darts D'Nar aboard the Tecora and enforced his 'protection' on the governor and the people of Kiros."}, {"tag": "p", "text": "The Tecora remained on Kiros when the Republic landed on the planet and destroyed the droid forces. Jedi General Obi-Wan Kenobi tried to negotiate a surrender with D'Nar, but with no success. D'Nar attempted to flee Kiros on the ship, but was stopped when Anakin Skywalker stabbed his lightsaber into the right engine. D'nar then engaged in a brief duel with Ahsoka Tano, but was quickly defeated and the Tecora was taken into Republic custody."}, {"tag": "h3", "text": "Use by the Republic"}, {"tag": "p", "text": "After learning the whole 50,000 Togruta population of Kiros was not on the planet, Skywalker, Kenobi, Ahsoka Tano and Clone Captain Rex infiltrated Zygerria using the Tecora. The group then went undercover as slavers to find the missing colonists. The plan went south and their true identities were revealed."}, {"tag": "p", "text": "After Count Dooku executed Zygerrian Queen Miraj Scintel for refusing to kill Skywalker, the latter and Tano used the ship to land at the Kadavo slave processing facility. It was identified as being in Skywalker's possession and was destroyed shortly after landing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}