{"url": "Tecora", "categories": ["Category:Canon articles", "Category:Captured starships", "Category:Confederacy of Independent Systems starships", "Category:Galactic Republic starships", "Category:Slaver starships", "Category:YV-865 Aurore-class freighters"], "nodes": [{"tag": "h1", "text": "Tecora"}, {"tag": "p", "text": "The Tecora was a reddish-colored YV-865 Aurore-class freighter that belonged to Darts D'Nar during the Clone Wars. D'Nar used the ship for transporting slaves and goods to Zygerria, until its capture by Republic forces during the Battle of Kiros. Under Republic custody, it served as Jedi Generals Anakin Skywalker and Obi-Wan Kenobi, and their team's means to infiltrate to Zygerria to find enslaved Togruta colonists from the planet Kiros."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As an YV-865 Aurore-class freighter, the Tecora was highly durable with primitive yet powerful thruster engines located on its articulated boom arms that extended from the ship's primary hull. A blocky transport which had its spacious storage bay outfitted for live cargo, the Tecora sported a large cargo hold in which creatures the size of a blixus could be transported, and could be competently operated by a single pilot—namely, its owner, Darts D'Nar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Tecora was owned by Zygerrian slaver Darts D'Nar. A servant of Queen Miraj Scintel, D'Nar used the Tecora to transport slaves to be sold at the Royal Slave Auction so that the Zygerrian Slave Empire saw its resurgence. Through its alliance with the Confederacy of Independent Systems, D'Nar was sent to the neutral planet of Kiros to round up all 50,000 of its Togruta citizens. On the Tecora, he landed alongside a contigent of the Separatist Droid Army and abducted the inhabitants of the artisan colony and had them transported to Zygerria, while he and his ship remained to await for Republic forces to arrive."}, {"tag": "p", "text": "After ten rotations, Jedi General Obi-Wan Kenobi of Grand Army of the Republic tried to negotiate a surrender from D'Nar, but with no success. During the Battle of Kiros, D'Nar attempted to flee on the Tecora. He boarded the ship and blasted off the governor's tower landing platforn, but was stopped when Anakin Skywalker disabled one of the ship's thrusters with his lightsaber. As Skywalker fended off a blixus on the cargo hold, Ahsoka Tano engaged in a brief duel with D'nar, who was quickly defeated. As D'Nar was arrested, the Tecora was taken into Republic custody."}, {"tag": "p", "text": "After learning the whole Togruta population was nowhere to be found on the planet, Skywalker, Kenobi, Tano, Clone Captain Rex and the astromech droid R2-D2 infiltrated Zygerria by using the Tecora. Skywalker, Kenobi and Rex went undercover as Zygerrian slavers to find the missing colonists; while Skywalker dealt with Queen Scintel and offered Tano (posing as a slave) as a gift, Kenobi and Rex went to find the colonists. When they were exposed and captured, only R2-D2 remained free to contact Skywalker and help free Tano. Skywalker then told the astromech and his Padawan to ready the ship while he recovered his lightsaber (in Scintel's possession). Tano and R2-D2 piloted the freighter until Skywalker gave her the signal to Tano to be ready with the getaway."}, {"tag": "p", "text": "Skywalker landed on the waiting ramp of the Tecora and boarded it with a dying Scintel. In a last show of gratitude, she revealed Kenobi, Rex and Togruta's location in the Kadavo system, prompting the Jedi pair to fly the Tecora to Kadavo. On the way there, they contacted Republic reinforcements, led by General Plo Koon in the upcoming battle. The Tecora arrived first to the Kadavo slave processing facility, where Skywalker, Tano, and R2-D2 got off the ship, shortly before the heavy turbolasers defending the facility destroyed the Tecora, seemingly stranding the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tecora has its name written on its hull in Aurebesh type, as well as the words \"DELTA S-9\" on the trailing edge of its wings. This Zygerrian ship shares its name with a Portuguese slave ship from the early 1800s."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}