{"url": "Teckla_Minnau/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Clerical workers and assistants", "Category:Galactic Republic bureaucrats", "Category:Humans", "Category:Naboo Royal Handmaidens"], "nodes": [{"tag": "h1", "text": "Teckla Minnau"}, {"tag": "p", "text": "Teckla Minnau was a Human female from Naboo who served as a handmaiden to Senator Padmé Amidala. Born in the city of Parrlay, Minnau attended a private school in Naboo's capital of Theed with her half-sister, Nandi. In 32 BBY, when the Trade Federation invaded the planet and attacked Theed, Minnau fled to an outlying marsh village, where she waited out the invasion. Though she was separated from Nandi for the duration of the Federation's occupation, they were reunited at the Naboo people's victory celebrations. The half-sisters entered into service to Senator Amidala, and in 22 BBY, they managed her family's Lake Country residence of Varykino. At the dawn of the Clone Wars later that year, Minnau was sent to Coruscant to become part of Amidala's staff at the Naboo Embassy. While raising children in the difficulties of wartime, Minnau provided moral support for Amidala during her career in the Republic Senate, particularly during Amidala's campaign against a military increase bill."}, {"tag": "p", "text": "In the final month of the war, Minnau accompanied Amidala on a mercy mission to Scipio, the headquarters of the InterGalactic Banking Clan. During the ensuing negotiations, Amidala was forced to collaborate with Banking Clan representative Rush Clovis, a former colleague and old flame, who suspected the Core Five leadership of corruption but so far lacked evidence to prove his claims. Minnau and Amidala agreed to help Clovis gain access to the Banking Clan's Main Vault, but while covertly sabotaging the Vault's power generator, Minnau was shot and killed by the bounty hunter Embo. Her actions allowed Amidala and Clovis to gain the necessary evidence and expose the Core Five as embezzlers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life on Naboo"}, {"tag": "p", "text": "The Human female Teckla Minnau was born in the city of Parrlay, Naboo, to a middle-class merchant family during the reign of the Galactic Republic. She grew up with her half-sister, Nandi, and they formed a close relationship in a childhood that was largely free of incident. They were eventually sent to Naboo's planetary capital of Theed, where they stayed at the household of their law clerk brother, Rehtul Minnau, and attended a private school to be instructed in the ways of hospitality, history, etiquette, and the arts."}, {"tag": "p", "text": "In the year 32 BBY, the Trade Federation invaded Naboo, and Theed was attacked. Just hours after the Federation assault, as gun battles raged through Theed's streets, Minnau and Nandi accompanied members of the Royal Naboo Security Forces in fleeing to nearby swamps. The half-sisters were separated while doing so, and for several days, Minnau had to avoid Federation bombing runs and Single Trooper Aerial Platform patrols. After reaching a marsh village, Minnau waited out the rest of the invasion there until Naboo had been liberated by forces led by Queen Padmé Amidala and Gungan Boss Rugor Nass. During the celebrations of the Naboo victory, Minnau was reunited with Nandi, and they went on to complete their schooling."}, {"tag": "p", "text": "Within a decade of the Invasion of Naboo, Minnau and Nandi became employed as servants of Amidala, who had since risen to be Naboo's representative in the Republic Senate. While Amidala worked in the Senate on the galactic capital of Coruscant, Minnau and Nandi remained on Naboo to manage the senator's family estate, Varykino, in the Lake Country, where they worked as resort waitresses. In 22 BBY, after being targeted by a series of attempts on her life, Amidala returned to Naboo with a Jedi bodyguard, Anakin Skywalker, and decided to stay at Varykino. Minnau and Nandi waited on Amidala and Skywalker at the estate during the pair's dinner, serving freshly hand-picked shuura fruit after their meal and then returning to clean up the pair's plates."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Aide to Amidala"}, {"tag": "p", "text": "It was only a short time later that the Clone Wars broke out across the galaxy, and Minnau was subsequently recalled to join Amidala's staff at Coruscant's Naboo Embassy. In her new position as a handmaiden for Amidala, Minnau was once again separated from Nandi. By 21 BBY, Minnau had begun to raise children of her own. Because of the war, the district where her family lived had sparse access to running water and electricity, to the point that her children had no light to read or study by at night and could only bathe every two weeks. Despite those hindrances, Minnau remained a loyal aide to Amidala, striking up a close relationship with her while also gaining her trust."}, {"tag": "p", "text": "Following a Senate debate on a proposal to escalate clone trooper production, which would sustain and expand the Republic's war effort against the Confederacy of Independent Systems, Minnau accompanied Amidala from the Senate Building back to her office in the Republic Executive Building. Minnau brought back a datapad and waited while Amidala spoke with her close allies, Senators Bail Prestor Organa and Onaconda Farr, about defeating the troop increase bill. A night later, when Amidala, bruised and battered after a run-in with bounty hunters, returned to her Naboo Embassy apartment, Minnau treated her facial wounds with an antiseptic. Though Minnau suggested that Amidala report the incident to the Jedi High Council, the senator refused, as she knew that her assailants had been trying to prevent her from voting against the troop increase. Minnau provided moral support for Amidala, who was losing hope with her prospects of defeating the bill. At Amidala's request, Minnau stayed at the apartment to tell her about the war's effect on her family, a conversation that Amidala took to heart."}, {"tag": "p", "text": "When Organa was injured by the same bounty hunters who had attacked Amidala, he was unable to deliver the oppositional speech that was to precede the final vote on the clone trooper escalation bill, and the task of addressing the Senate fell to Amidala. Although Amidala was not confident that her fellow politicians would listen to her on account of her partisanship, Minnau, presenting her senator with her formal Senatorial headpiece, convinced her to speak before the Senate by citing the fact that she truly understood the war's impact on the Republic citizenry. Minnau followed Amidala to the Senate Chamber, where she watched her address the Senate body. In a speech that was broadcast across Coruscant, Amidala provided a moving account of the war's effects on Minnau, an everyday civilian, and her family, articulating her belief that the longer the conflict went on, the more it would consume funds for the people's basic services. Her address stirred the Senate, and her colleagues received it with a thunderous round of applause. Because of her speech about Minnau, Amidala won much support in the Senate, though the bill to heighten clone trooper production was ultimately passed."}, {"tag": "h4", "text": "Negotiations on Scipio"}, {"tag": "p", "text": "In 19.1 BBY, the final month of the Clone Wars, Minnau traveled with Amidala on a mercy mission to the planet Scipio, the headquarters of the InterGalactic Banking Clan. Amidala sought to secure a new loan from the Banking Clan to aid refugees who had been displaced from their homes by the war. Minnau accompanied Amidala, a pair of Senate Commandos, and Banking Clan representative Nix Card aboard the GX1 Short Hauler Valorous, which landed at the city surrounding the Main Vault amidst the icy mountains of Scipio. Mak Plain, a Banking Clan official, received Amidala, Minnau, and their associates at the entrance to the neutral zone surrounding the Main Vault, where all monetary transactions were conducted free of partisanship to the Republic and the Confederacy. While the Senate Commandos remained outside with the Valorous, Minnau followed Amidala and the Banking Clan representatives into the neutral zone and proceeded to the Vault's main rotunda. There, Amidala met with the Core Five, the primary leadership of the Banking Clan. As Core Five spokesman Clu Lesser introduced the special representative who would be directly discussing the terms with Amidala, Minnau and her senator were surprised to see Rush Clovis enter the rotunda."}, {"tag": "p", "text": "Clovis was the former senator of Scipio, and though he had been romantically involved with Amidala a number of years ago, he had been exposed as a war profiteer, having provided funding for a major Separatist battle droid foundry on Geonosis. Amidala outright refused to collaborate with Clovis and blocked further progress until he was removed from the negotiations. That night, Plain showed Amidala and Minnau to their guest quarters, and Minnau thanked Plain before he left. Immediately thereafter, Minnau noticed someone creeping up behind Amidala and shouted a warning. Amidala, having smuggled an ELG-3A blaster pistol into the neutral zone, aimed her blaster at the intruder: Clovis. He told Amidala that he needed her help, and though Minnau protested, Amidala decided to hear him out and followed him out onto the room's balcony to confer privately. Clovis explained that while he suspected there were no financial funds remaining in the banks, the evidence was out of his reach within the records of the Main Vault, to which only the Core Five were permitted entry."}, {"tag": "p", "text": "Just then, sniper shots fired by the bounty hunter Embo, who was too far away to be identified, narrowly missed Clovis and Amidala, the latter of whom ran back into the suite to take refuge with Minnau. Clovis pleaded with Amidala to pressure the Core Five into opening access to the Main Vault, then escaped on a hover sledge that he had parked several meters beneath the balcony. After the local Muun authorities arrived to verify that Amidala was safe, Minnau saw the security agents off, while Amidala holographically contacted Supreme Chancellor Palpatine to discuss Clovis's suspicions. When negotiations with the Core Five resumed the next morning, Amidala successfully petitioned the Banking Clan leaders to grant her access to the Main Vault the following day. During a subsequent break from the talks, Minnau and Amidala accompanied Clovis aboard the H-2 executive shuttle Scipio to his personal residence in a remote area outside the city. Inside, Minnau joined Amidala while the latter discussed with Clovis their plan to retrieve the hidden files within the Main Vault. Clovis intended to set off an explosive charge at the Main Vault's power generator, which would plunge the entire facility into shutdown. In the brief interlude preceding the backup generator's activation, Amidala would use a device to locate the secret data files and download them from the mainframe. Presently, Minnau informed Amidala that she would be retiring for the night, and her senator did the same shortly thereafter."}, {"tag": "p", "text": "The next morning, Minnau went with Clovis and Amidala to the Main Vault, where they met Plain, the Core Five, and several Muun security agents. After the Core Five had entered the Vault with Amidala, Clovis attempted to sneak off to plant his detonator at the power generator. However, Plain stopped Clovis and pressured him into waiting for Amidala to return, since opening the Vault had been his idea. Noticing Clovis's dilemma, Minnau discreetly took the explosive charge from him and undertook his part of the scheme. She proceeded down several levels to the generator superstructure, and once she had glanced around to make sure no one had spotted her, she placed the detonator onto the structure. Unbeknownst to her, a minute seeker droid sent by Embo had located her. Embo aimed at her from a long distance away with his bowcaster, and Minnau halted in her tracks when she saw his bowcaster's targeting light on her body. She frantically scanned her surroundings, but before she could pinpoint her attacker, Embo fired a single shot that killed her. Mere seconds later, Minnau's explosive activated, compromising the entire power grid and allowing Amidala to surreptitiously retrieve the required data files from the Vault mainframe."}, {"tag": "p", "text": "In the Muun authorities' following investigation into the power grid failure, Minnau's body was found at the scene of the bomb site, and it was concluded that she had sabotaged the power grid. Although Minnau's murderer went unidentified, Amidala and Clovis were able to use the recovered data files to expose the Core Five as the masterminds of an embezzling scandal that had depleted the banks."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Standing 1.68 meters tall, Teckla Minnau had fair skin, black hair, and blue eyes. A loyal aide to Senator Padmé Amidala, she possessed enough skill in the fields of etiquette and hospitality to serve Amidala and her family. A resourceful individual, Minnau was able to survive the Invasion of Naboo despite being in great danger. She earned Amidala's trust and placed the senator's needs before her own without complaint. She dutifully tended to Amidala's wounds after the senator was injured in an encounter with bounty hunters, and she was of the belief that Amidala should report the encounter to the Jedi Council. Minnau did not support Amidala simply through matters of administration or physical treatment. She was quite concerned for her senator on a personal level, providing words of encouragement when Amidala was losing hope that no one else cared about the ongoing deterioration of democracy within the Senate. Because Amidala was willing to interact with \"people like\" herself, Minnau believed that her senator was unlike most politicians in that she actually listened to the words of the people, was concerned for the wartime struggles they were going through, and cared about their needs—such principles, Minnau saw, were a strength of Amidala's."}, {"tag": "p", "text": "Minnau was timid at times; while attempting to comfort Amidala following the bounty hunters' attempt on her life, she became embarrassed when she felt that she had said too much and subsequently made to leave. However, she stayed when Amidala asked that she tell her about her family and their repercussions from the war. Minnau later mustered up the confidence to convince Amidala to speak before the Senate in place of Bail Organa, citing Amidala's trait for understanding the war's true effect on the civilian populace. Because of Minnau's conviction, Amidala was able to find her own confidence to address the full Senate. Minnau displayed a measure of distrust for Rush Clovis, directly voicing to Amidala her belief that meeting with Clovis was not a good idea. Nevertheless, Minnau agreed to assist Clovis in his endeavor to gain access to the Banking Clan's Main Vault. When Clovis was held up by Mak Plain and was unable to plant his explosive charge at the power generator, Minnau even took it upon herself to complete Clovis's part of the plan, an action that ultimately cost her her life. She was able to speak Galactic Basic Standard, and her first name was fairly common among Humans. At Varykino, she wore a simple blue dress with a matching head cap. While serving Amidala on Coruscant, she donned a hooded, lavender-colored outfit. During the negotiations on Scipio, she wore a full-length maroon robe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Teckla was conceived for Star Wars creator George Lucas's 2002 film Star Wars: Episode II Attack of the Clones, although she made her first appearance prior to that in author R. A. Salvatore's novelization of the film, in which she was identified by her first name. The name \"Teckla\" was mentioned in the 2003 Galactic Campaign Guide as an example of a Human female name, but it was not until 2008 that the character's backstory was elaborated upon in a StarWars.com Databank entry by Evan Burger, writing as \"Shadowcultist,\" through the Hyperspace feature What's The Story? In using the surname \"Minnau\" for Teckla, Burger alluded to the name that actor Nathan Hamill had created for his own character, Rehtul Minnau, in the 1999 film Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "Minnau received an entry in the 2008 The Complete Star Wars Encyclopedia and was mentioned in the twenty-eighth issue of De Agostini's Star Wars: The Official Starships & Vehicles Collection series. In December 2010, eight years after her original creation, Minnau was given a prominent role in \"Pursuit of Peace,\" the eleventh episode in the Star Wars: The Clone Wars television series' third season, in which she was voiced by actress Ashley Moynihan. She later appeared in the episode \"An Old Friend,\" which was released in March 2014 with the series' sixth and final season. For that episode, actress Anna Graves—who had previously voiced the character Satine Kryze—provided Minnau's vocal portrayal."}, {"tag": "h3", "text": "Original fate"}, {"tag": "p", "text": "\"An Old Friend\" depicts Minnau dying at the hands of the bounty hunter Embo, contrary to Evan Burger's original description of her life in her Databank entry. According to that entry, after Amidala becomes pregnant, Minnau is one of the few beings entrusted with the knowledge of her senator's pregnancy, and she becomes a caretaker and nurse to Amidala. Following Amidala's death and Supreme Chancellor Palpatine's transformation of the Republic into the Galactic Empire in 19 BBY, Minnau returns to Naboo. She marries an aspiring writer and eventually becomes a handmaiden to Naboo's Queen Kylantha. This article assumes that the aforementioned portion of Minnau's Databank entry has been overwritten, given her death in \"An Old Friend.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}