{"url": "Tedryn-Sha", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Dark Side Elite", "Category:Dark Side Squadron members", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tedryn-Sha"}, {"tag": "p", "text": "Tedryn-Sha was a Human male Dark Side Adept loyal to Galactic Emperor Palpatine, who reigned over his Dark Empire after being reborn in a clone body. In 10 ABY, after Palpatine's elite cadre of Dark Jedi, the Dark Side Elite, suffered losses due to the efforts of Jedi Master Luke Skywalker and his Jedi, Sha was chosen to reinforce the group. The Emperor empowered Sha and a fellow darksider named Xecr Nist with the dark side of the Force; Nist became the Emperor's newest Executor, while Sha was appointed as Palpatine's second-in-command."}, {"tag": "p", "text": "Later, Sha participated in an attack on the New Republic hideout on the planet New Alderaan. Tasked with incapacitating Skywalker by poisoning him with miniature scarab droids so he could be taken captive, Sha and the Dark Jedi Krdys Mordi infiltrated Skywalker's personal quarters while he was asleep and released the droids. However, the Jedi's screams alerted his sister, Leia Organa Solo, and the Jedi trainee Jem Ysanna, who rushed to his aid. In the ensuing fight, both Sha and Mordi were slain, although Sha managed to mortally wound Ysanna beforehand."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The initiation"}, {"tag": "p", "text": "Tedryn-Sha, a Human male, was a Dark Side Adept serving as a personal advisor to Galactic Emperor Palpatine, who was reborn in a clone body yet again after being killed in 10 ABY by Jedi Knight Luke Skywalker and his sister, Leia Organa Solo. After the Emperor's return later the same year, Tedryn-Sha, along with a darksider named Xecr Nist and the Imperial engineer Umak Leth, joined Palpatine on an inspection tour of his newest superweapon, the Galaxy Gun, which was being constructed in orbit of the world of Byss, the capital of Palpatine's Dark Empire."}, {"tag": "p", "text": "As they were performing the inspection aboard a shuttle, Palpatine was notified that Executor Sedriss QL and Vill Goir, two members of the Dark Side Elite, Palpatine's elite cadre of Dark Jedi, had been killed by Skywalker on the planet Ossus. To replace the fallen Dark Jedi, Palpatine chose Tedryn-Sha and Xecr Nist, empowering them with the dark side of the Force. The ritual was so powerful that it caused a disturbance in the Force, which was even felt by Skywalker back on Ossus. Palpatine then named Nist the new Executor, thus placing him in charge of the entire Imperial Military, while Tedryn-Sha became Palpatine's second-in-command."}, {"tag": "p", "text": "While those events transpired, a shipment of X-1 Viper droids, procured from Governor Hinch Beltane of the planet Balmorra, arrived on Byss aboard the star hauler Reliance. However, Beltane had secretly betrayed the Empire and had allowed the New Republic to smuggle a group of commandos within the droids. After the droids were delivered to the Emperor's Citadel, the infiltrators powered them up. Sha then bore witness as the New Republic forces launched their attack on the Emperor's fortress. In response, the Emperor gave the order to release fearsome chrysalide rancors, which repelled the Viper droids' attack. Nonetheless, the New Republic troops escaped from Byss with the help of local smugglers."}, {"tag": "p", "text": "Having complete confidence in the power of the Galaxy Gun, Palpatine gave his forces the order to let the fleeing smuggler ships go, a command that took his newly appointed Dark Jedi by surprise. Knowing that the enemy would return to Pinnacle Base on the moon Da Soocha V, Palpatine issued an order to fire the Galaxy Gun, obliterating the moon."}, {"tag": "h3", "text": "Arrival on Vjun"}, {"tag": "p", "text": "With the New Republic in disarray after the destruction of its base, Palpatine directed his efforts toward locating Skywalker and his handful Jedi recruits. The Emperor believed that the Jedi would take refuge on the same planet that served as the secret hiding place of Leia Organa Solo and her children—the twins Jaina and Jacen. Sha's Master hoped to capture the children so he could turn them over to the dark side, but he needed to learn the location of the planet first. The opportunity presented itself when a New Republic pilot, Major Ntthan, was captured by the Empire in an uncharted region of space while making a supply run to the New Republic hideout. The pilot was promptly delivered to Bast Castle on the planet Vjun, the headquarters of the Dark Side Elite, where Dark Jedi Kvag Gthull started interrogating him in order to learn Organa Solo's location."}, {"tag": "p", "text": "Sha and Nist accompanied Palpatine to Bast Castle aboard the Lambda-class shuttle Tridius to oversee the results of the interrogation. When they arrived, Gthull informed Palpatine and the Dark Jedi that after a twelve-hour-long torture session, Ntthan had revealed the coordinates and the name of the planet—New Alderaan. Palpatine ordered Nist to assemble all Dark Jedi and embark on a mission there. The darksiders were to infiltrate the city of New Aldera and capture Skywalker and the Solo children, after which the Empire would launch a full-scale assault on the settlement using All Terrain Armored Transports."}, {"tag": "p", "text": "Boarding I-7 Howlrunner starfighters, Sha and the rest of the Dark Side Elite embarked on a journey toward their goal as part of Dark Side Squadron. Upon exiting hyperspace near New Alderaan, Sha consulted the ship's sensors but was unable to detect the presence of Skywalker and his allies. Nist assured him that they were indeed on the planet and advised Sha to rely on the dark side to guide him to his target."}, {"tag": "h3", "text": "The incursion on New Alderaan"}, {"tag": "p", "text": "As the darksiders' ships approached the New Republic settlement, they passed above Skywalker himself, who was standing outdoors alongside one of his Jedi trainees, Jem Ysanna. Although the Jedi Master did not notice the ships, he almost sensed the presence of the Dark Jedi through the Force, a result of Sha failing to mask his Force presence well enough. After Dark Side Squadron landed their ships, Nist reprimanded Sha for his mistake. The Executor then dispatched Sha and Dark Jedi Krdys Mordi to Skywalker's quarters, providing the pair with a number of tiny scarab droids, which carried a powerful poison capable of incapacitating the Jedi. Sha and Mordi were to release the droids upon Skywalker, who was battling Palpatine in his sleep, as the Emperor had entered the Jedi's dreams and was haunting him there. Nist himself took the rest of the Dark Jedi and went after the Solo twins."}, {"tag": "p", "text": "Making sure to hide their Force presence from Skywalker this time, Sha and Mordi successfully reached the building that housed Skywalker's quarters. Releasing the scarab droids upon him through a window to his room, the two watched as the droids began their work on immobilizing the Jedi. However, just as Sha and Mordi entered the room and moved in to claim their captive, Skywalker cried out in his sleep, resisting the Emperor's influence. That scream alerted Organa Solo and Ysanna, who arrived at the scene ready to defend the Jedi Master. As a result, Mordi was immediately killed, sliced in half by Ysanna with her lightsaber."}, {"tag": "p", "text": "Certain in his powers as the Emperor's second-in-command and knowing that Palpatine wanted Organa Solo to be taken alive if possible, as she was pregnant with her third child, Sha gave the women a chance to surrender, but Organa Solo refused and fired her blaster at Sha. The Dark Jedi blocked her shot with his hand and, in response, shot Ysanna square in the abdomen with his own blaster pistol. Not skilled enough yet to avoid the shot, Ysanna was gravely wounded by it. Sha was then struck down by the infuriated Organa Solo, who cleaved him in half with her own lightsaber."}, {"tag": "p", "text": "Skywalker was healed from the poison by the Jedi Vima-Da-Boda with the Force, while Nist and the rest of the darksiders were defeated by Skywalker's remaining Jedi. Signaling the Imperial AT-ATs to attack, Nist and two other survivors were forced to retreat from New Alderaan under the walkers' covering fire. Although the Empire captured the planet and Ysanna died from the wound inflicted by Sha, the New Republic was able to retreat and regroup once again, while the Emperor failed to capture Skywalker or the Solos."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "One of the Emperor's personal advisors, Tedryn-Sha was a faithful servant of Palpatine, although he initially doubted his Master's return after the Emperor's latest death in 10 ABY. Sha believed in Palpatine's return only when he saw the Emperor alive with his own eyes. Sha's service to his Master ultimately earned him the indoctrination into the ranks of the Dark Side Elite and the position of Palpatine's second-in-command."}, {"tag": "p", "text": "Initially meek and subservient, the initiation into the ranks of Dark Jedi gave Tedryn-Sha a boost of self-confidence, which showed in his intonation and behavior. Even before his empowerment, he respected Xecr Nist's authority over him, and that attitude carried over to their service in the Dark Side Elite. Sha addressed his superior darksider using the honorific title of \"Lord\" and did not argue with his reprimands."}, {"tag": "p", "text": "Sha took pride in being the Emperor's second-in-command and boasted on this ranking before Organa Solo, whom he recognized as the daughter of Palpatine's deceased apprentice, Darth Vader. Upon first arrival at Bast Castle, Sha was awed to discover a statue of Vader there—erected by the late Sedriss QL—and he realized that the Castle had once belonged to Vader himself. He was also fairly fearful of Skywalker's powers as a Jedi, being confused as to how the darksiders were supposed to subdue him. Tedryn-Sha had light skin and a yellow glow in his eyes."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "After being empowered with the dark side by Emperor Palpatine himself, Sha became a full-fledged Dark Jedi. However, his connection to the dark side of the Force was not perfect, as he had to be reminded by fellow cohort Xecr Nist to rely on the dark side in order to locate Luke Skywalker on New Alderaan. While approaching the New Republic hideout, Sha also struggled to mask his presence in the Force from Skywalker, but he was ultimately able to do so during the abduction attempt."}, {"tag": "p", "text": "Sha could intercept a blaster bolt fired at him by Leia Organa Solo with his gloved hand and could pilot an I-7 Howlrunner, flying as a member of Dark Side Squadron during the mission to New Alderaan. The Dark Jedi was proficient enough as a marksman to be able to kill Jem Ysanna with one blaster shot, although Ysanna's lack of evasion skills played a part in it as well."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Customary for the members of the Dark Side Elite, Sha wore a dark robe with a long, flowing cape, as well as heavy boots, gauntlets, and head coverings. The darksider was armed with a blaster pistol on New Alderaan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tedryn-Sha was created by author Tom Veitch and first appeared in the 1995 comic book Dark Empire II 4. Sha appeared in two subsequent issues of the Star Wars: Dark Empire II comic series, before being killed off in the sixth issue. In all his appearances, Sha was illustrated by artist Cam Kennedy. Sha later appeared in the Dark Empire II audio drama adaptation."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "In the audio drama of Dark Empire, Sha's role in the battle on Byss is presented differently from the original portrayal in the comics. In the audio version, he and Xecr Nist arrive at Byss aboard the Reliance with the cargo of Viper droids and then join Palpatine on his inspection of the Galaxy Gun."}, {"tag": "p", "text": "After they have been empowered by Palpatine, Sha and Nist leave their Master's side and arrive at the Emperor's Citadel. Sha then oversees the delivery of the Viper droids to the Citadel, relishing in his authority over the workers unloading the droids from cargo shuttles."}, {"tag": "p", "text": "When the New Republic commandos activate the droids, Sha is taken by surprise and is wounded by the droids firing at him. Sha then commands the defense of Byss alongside Nist until the Emperor gives the order to release the chrysalide rancors."}, {"tag": "p", "text": "However, in the comic version, Sha and Nist are already with Palpatine aboard the shuttle near the Galaxy Gun by the time the Reliance arrives, and they stay aboard the shuttle throughout the battle. This article follows the events as depicted in the original comic book."}, {"tag": "p", "text": "The comic guide Star Wars Handbook 3: Dark Empire mistakenly states that it was Krdys Mordi who underwent the initiation alongside Xecr Nist, instead of Tedryn-Sha."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}