{"url": "Teek", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Endorians", "Category:Males", "Category:Teeks"], "nodes": [{"tag": "h1", "text": "Teek"}, {"tag": "p", "text": "Teek was a male member of the Teek species, and a native of the forest moon of Endor. He was a playful, mischievous being, with scruffy, white fur and two large upper incisors. As his species had an accelerated metabolism, he could move extraordinarily fast and was often seen as a blur. Teek was the only companion of a stranded Human scout by the name of Noa Briqualon, with whom he shared a cabin on Endor. Briqualon spent most of his time attempting to repair his damaged starship and was generally hostile toward outsiders who stumbled upon his home. The two lived together in isolation for years, with little or no interaction with other sentient beings."}, {"tag": "p", "text": "However, in 3 ABY, a Human girl named Cindel Towani and her Ewok companion, Wicket Wystri Warrick, stumbled upon the house of Teek and Briqualon, who eventually formed a close bond with the two children. Several days after their first encounter, Towani was kidnapped by the Sanyassan warlord Terak, and Teek and his friend aided Warrick in her rescue. Teek proved vital to the recovery, using his superior speed to great effect, and after they rescued Towani, he helped fight Terak's warriors in the woods. Teek saved his companion's life when he attacked Terak, who was ready to strike the helpless Briqualon with his sword. Warrick then finished off the Sanyassan warlord. Teek was ultimately left behind when Briqualon and Towani departed on the starship, which the old Human had finally repaired, although he found a home with the Ewoks of Bright Tree Village, many of whom had aided him in the skirmish with the Sanyassans."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Teek was a member of the species of the same name, born on the forest moon of Endor some time before the rise of the Galactic Empire. Teek eventually became the companion of Noa Briqualon, an old Human male, who had been stranded on the moon ever since his starship crashed there. The two lived together in a small cabin, near where Briqualon's starship lay. Briqualon was extremely reluctant to speak with other people on the moon and spent most of his time working on fixing his ship. Teek, however, opted to stay away from the ship and usually spent his time perched in trees as Briqualon worked relentlessly to restore function to his vessel."}, {"tag": "h3", "text": "Wicket and Cindel"}, {"tag": "p", "text": "In 3 ABY, Teek stumbled upon two lost companions in the woods: a female Human child named Cindel Towani, and an Ewok named Wicket Wystri Warrick. The two had been captured by a Sanyassan Marauder warlord named Terak but had managed to escape. However, the Sanyassans were determined to find Towani, thinking that she would help them unlock the secret of a piece of technology they had stolen during an attack on her village, an assault that killed her family. Despite Warrick's apprehension, Towani decided to follow Teek, finding him amusing and hoping that he would lead them to shelter and food. Teek led them to Briqualon's cabin, where the two children, mistakenly assuming the house to be unoccupied, decided to stay. However, when Briqualon returned home, he was furious at his friend for allowing strangers into the house, and demanded that the children leave. Towani and Warrick made camp nearby, and Teek brought them food. The old scout eventually had a change of heart and allowed Towani and Warrick to stay for one night only. Despite Towani's fragile mental state, he maintained that they would have to leave come morning, and a disappointed Teek accepted the decision."}, {"tag": "p", "text": "Although the children accepted Briqualon's terms and left in the morning, Briqualon reconsidered and allowed Warrick and Towani to stay with him and Teek as long as they proved themselves useful and helped out around the cabin. The next day, curious as to where Briqualon continued to disappear, the two guests followed the bearded Human as he set off to work on the starship, despite Teek's best efforts to dissuade them. Briqualon discovered them, told them his story, and allowed them to stay in his house as long as they needed. However, in the early hours of the morning, Towani was kidnapped by the Nightsister Charal, and after searching the surrounding forests, Warrick and Briqualon left to rescue the young girl. Teek, though apprehensive at first, eventually sped off to assist them."}, {"tag": "h3", "text": "Terak's Keep"}, {"tag": "p", "text": "The trio arrived at Terak's Keep, where Terak was holding Towani. When they reached the moat around the huge building, they opted not to swim across, as the waters were infested with vicious beings. Instead they used Briqualon's grappling hook to climb atop the great wall, where Teek and Warrick incapacitated the patrolling guard and helped the larger Briqualon up onto the wall. The three of them searched the castle for Towani and discovered she was imprisoned, along with a group of Ewoks, in a nearby cell. However, Terak's men heavily guarded Towani's cell, and Teek and his friends could not pass the guards undetected. Teek, though, stole a guard's uniform, which the trio used to disguise themselves. They reached the dungeon where Towani was being kept, though two additional Sanyassans, playing cards, sat close to Towani. Teek slipped one of the men's cards into the Sanyassan's sleeve; when the other player noticed, a fight ensued, leaving the two Sanyassans dead and Teek with the keys needed to free Towani and the Ewoks."}, {"tag": "p", "text": "With the Ewoks freed, Teek and a group of rescued prisoners made their way back out of the Keep. However, Terak heard them escaping and sounded the alarms. Teek and the others eventually reached a dead end, but Briqualon used some explosives to blow a hole in the wall. The Sanyassans, led by Terak himself, soon reached the group, who were swinging across the moat on Briqualon's rope one by one. As Briqualon and Towani left, the young girl spotted a crystal oscillator, the only remaining part Briqualon needed to get his ship running; the old man took it. Although the guards fired at them, Teek, Briqualon, Towani and the Ewoks escaped. However, Terak sent dozens of his men after the group."}, {"tag": "p", "text": "The escapees reached a forest, although Terak's soldiers, aided by Charal, tracked them. Briqualon led them to his ship, but it would take him several minutes to power up the vessel. Teek was sent to scout the area and to discover how far away the Sanyassans were, while the Ewoks assembled a powerful catapult near the ship. Teek found Terak's men; however, he inadvertently led them back to Briqualon's ship. The Sanyassans clashed with the Ewoks in the forest, and although Teek did not join the effort against Terak's warriors, he dealt the warlord a blow when he rubbed two stones together. The resulting flames caused Terak's two massive blurrg beasts to retreat."}, {"tag": "p", "text": "Teek took control of one of the cannons on Briqualon's starship and fired back at the marauders. Through the efforts of Teek and his companions, Terak's warriors were driven back to the Keep, although the warlord himself remained to fight with Briqualon. Teek, perched high in a tree, watched in horror as Terak stood over a helpless Briqualon with his sword raised. However, the furry creature intervened and saved the life of his companion by jumping on Terak's head, unbalancing the Sanyassan. Through the efforts of Teek and Warrick, who inadvertently unlocked the dark magic in the warlord's ring, Terak was turned to stone."}, {"tag": "h3", "text": "Goodbyes"}, {"tag": "p", "text": "With Terak defeated, Towani and Briqualon decided to leave Endor, although Teek opted to stay behind and live with the Ewoks. Briqualon said his emotional goodbyes to Teek, who was saddened that he would not see his companion again. Teek was also sad at the loss of Towani, although she vowed to return and see him and Warrick again. The starship successfully took off, and Teek, alongside Warrick, saw his friend leave the moon for good. He spent the rest of his life with the Ewoks of Bright Tree Village."}, {"tag": "p", "text": "Shortly after the Battle of Endor in 4 ABY, the Star Tours travel agency began offering tours of the forest moon. Teek boarded a StarSpeeder 3000 at one point and was featured in a safety video that showcased the vessel's under-the-seat storage."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In appearance, Teek had scruffy white fur, with a pair of close-set eyes and two oversized buck teeth, and he often spoke through giggles. He was less than a meter tall, and due to his fast metabolism, he had extremely quick speed, which allowed him to run faster than any other being on Endor."}, {"tag": "p", "text": "Teek was friendly and hospitable toward others and often went out of his way to help them. When he first met Towani and Warrick, he led them to his home and offered them food and shelter, even though Briqualon was far less accommodating. When Teek was worried for the two children, he sneaked muffins to Towani and Warrick, despite Briqualon's orders that he specifically not do so."}, {"tag": "p", "text": "Teek was optimistic and mischievous, though not harmful, and he spent much of his time laughing and giggling with others, something that Briqualon discouraged. He displayed a strong sense of mirth, such as when he threw nuts at Warrick. Teek displayed inventiveness, such as when he framed the Sanyassan gambler, almost single-handedly getting the group past that particular obstacle. Teek once again demonstrated his inventive nature when dealing with Terak—although Teek was smaller than the warlord, he found a way to incapacitate the Sanyassan. Similarly, Teek used flames to scare off Terak's blurrgs and stole a guard's uniform in Terak's Keep."}, {"tag": "p", "text": "Teek was a brave and loyal friend to Briqualon, Warrick, and Towani. He tried to hide the secret of Briqualon's starship from the two guests, and he later risked his life on several occasions during the rescue of Towani. Teek stayed with his companions when he could easily have used his immense speed to quickly get to safety."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Like all members of his species, Teek was extremely quick, and when at full speed, he often looked as if he was a mere blur. He used his speed as both a source of amusement and as a weapon of sorts—he once used his speed to tie a Sanyassan to a tree on Endor. He could also play a type of flute, which he used with Towani, Briqualon, and Warrick when they played music and danced together in Briqualon's house."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Teek was created by George Lucas for Jim and Ken Wheat's 1985 made-for-television movie Ewoks: The Battle for Endor. The character was initially a puppet, but Wilford Brimley—who played the part of Noa—objected to the idea of working with a puppet, and often called on crewmember Niki Botelho to stand in his line of sight while he spoke with Teek. It was eventually decided that Teek would be played by an actor in a suit, and the diminutive, sixteen-year old Botelho was told to report to the film's creature shop to be fitted with a full body costume. Teek's costume had two heads: one articulated and one not. The articulated head contained devices to make Teek's eyes and face move, and was operated by off-camera puppeteers. During the filming of one scene, Botelho fell down a hill and into a creek, and the weight of her costume nearly caused her to drown until crewmembers could rescue her and remove her mask."}, {"tag": "p", "text": "In the score of The Battle for Endor, composer Peter Bernstein used a specific musical theme to represent Teek. The fast-paced motif musically expresses Teek's playful nature and his speedy running ability. The theme appears on the soundtrack LP in the track titled \"Teek.\""}, {"tag": "p", "text": "Teek also appears in two adaptations of The Battle for Endor: a book and record published by Buena Vista Records and the Random House children's book, The Ring, the Witch, and the Crystal: An Ewok Adventure. He is additionally featured in a Star Tours safety video. It was initially unclear if the creature was in fact Teek, but a toy package later confirmed the creature's identity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}