{"url": "Teepo", "categories": ["Category:Legends articles", "Category:Army of Light members", "Category:Individuals of unspecified species", "Category:Jedi Lords", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Teepo"}, {"tag": "p", "text": "Teepo was a male Jedi Lord and a member of the Jedi Order who lived during the New Sith Wars, fighting alongside Lord Hoth as part of the Army of Light."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Lord"}, {"tag": "p", "text": "A Force-sensitive, Teepo was trained in the ways of the Force by the Jedi Order during the Republic Dark Age. As the Galactic Republic warred with the New Sith Empire, the Jedi High Council's protégé Jedi Master Skere Kaan split from the Order and created the Brotherhood of Darkness to serve as the new body of the Sith Empire. A Jedi Lord, Teepo had a host of loyal Jedi Knights known as Paladins as he ruled over his constituent worlds, protecting them from the Sith for years. Unlike the main body of the Order on Coruscant, Teepo and his followers believed that blasters should be utilized in conjunction with the Order's traditional weapon, the lightsaber. The Paladins focused strongly on their connection to the Force, wearing masks to enhance their connection to the mystic energy field."}, {"tag": "p", "text": "When Lord Hoth rallied the banners of the Lords across the galaxy, Teepo and his Paladins answered the call to war and joined Hoth's Army of Light as they swept across the galaxy and crushed several Sith strongholds. Following the conclusion of the war in 1000 BBY and the passage of the Ruusan Reformations by the Galactic Senate, the Jedi High Council censored Teepo and his followers for their use of blasters and their involvement in the war. Retreating from Coruscant, Teepo and his surviving Paladins survived without the Order, practicing their beliefs in peace far from the Jedi Temple."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Over the ensuing millennia, long after Teepo's death, the Paladins thrived as a separate group within the Order. Keeping their distance from Coruscant and the High Council, an offshoot group known as the Gray Paladins formed from breakaway members of the Teepos, practicing more radical beliefs then their Teepo cousins. Ironically, Teepo's Paladins survived the Great Jedi Purge that ravaged the Jedi Order in 19 BBY, remaining active well into the reign of the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}