{"url": "Battle_of_Hoth_(0_BBY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of Hoth"], "nodes": [{"tag": "h1", "text": "Battle of Hoth  (0 BBY)"}, {"tag": "p", "text": "A battle occurred in 0 BBY, shortly before the Battle of Yavin, when Imperial forces located the Alliance to Restore the Republic's Gamma Base on Hoth. The Rebels were forced to evacuate Hoth and flee to Yavin 4."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the Battle of Toprawa, Imperial forces under Darth Vader tracked Princess Leia Organa's CR90 corvette Tantive IV to Tatooine in an attempt to retrieve the plans to their Death Star battlestation after they were captured by Rebel agents. In an effort to keep them out of Imperial hands, Organa sent the plans to the planet's surface in the care of the droids R2-D2 and C-3PO. The Imperials began a search of the planet and, upon discovering the presence of a Rebel base there, launched forces to destroy it. However, a group of Rebels were able to escape Tatooine and fled to Gamma Base on Hoth. Determined to locate the Rebels, Vader dispatched Viper probe droids to search for them."}, {"tag": "h3", "text": "The battle"}, {"tag": "p", "text": "After one of the probe droids arrived on Hoth, the commander of Gamma Base dispatched Rookie One in a T-47 airspeeder to investigate, ordering him to destroy any probe droids he found. Rookie One soon confirmed the presence of a probe droid and the Rebels prepared to evacuate while the pilot pursued the droid into a cave."}, {"tag": "p", "text": "After destroying the probe, Rookie One brought his snowspeeder out of the cave and rendezvoused with other Rebel snowspeeders to assist in the defense of Gamma Base—All Terrain Armored Transports were approaching the base and the Rebels needed more time to evacuate. The Rebels fought bravely against the heavily armored All Terrain Armored Transports, succeeding in bringing down two of the walkers with their laser cannons."}, {"tag": "p", "text": "As the Rebels retreated, Rookie One's snowspeeder suffered a power loss and he was unable to stay airborne. However, he told the others to carry on without him and ensure the safety of the fleeing transports while he attempted to return to base on foot. Unable to wait for the downed pilot, the commander oversaw the evacuation, leaving Rookie One alone on the planet. By the time he crossed the frozen landscape to reach Gamma Base, the base was overrun by Imperial stormtroopers. Rookie One fought his way through the base, eventually reaching the hangar where he boarded the last remaining T-65 X-wing starfighter, making his escape in the nick of time as stormtroopers fired futilely after him."}, {"tag": "p", "text": "Rookie One's departure was just in time to assist the last GR-75 medium transport as it attempted to escape to hyperspace. The pilot joined up with Commander Ru Murleen's group and the Rebels fought waves of TIE fighters, keeping them away from the transport until it safely jumped out of the system. Once the Rebel pilots were clear of the Imperial fighters, they followed the transport to safety."}, {"tag": "p", "text": "At some point during the battle, the Star Tours-owned StarSpeeder 1000 Star Tours Flight 1401, having just escaped from Spaceport THX1138 with a Rebel spy onboard from Imperial forces occupying the station, arrived at Hoth. It briefly bore witness to the final stages of the battle, and was briefly damaged by a blaster bolt from one of the AT-ATs, and narrowly avoiding being crushed by one. It eventually gained enough traction after falling off a cliff to exit Hoth."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Rebels fled to Yavin Base on Yavin 4. However, the Imperials had captured Organa and allowed her to escape, tracking her back to Yavin 4. Unconcerned by the Imperial failure to prevent the Rebel evacuation of Gamma Base, Vader prepared for a major strike on Yavin Base itself. Following the Battle of Yavin, the Rebels would eventually return to Hoth and establish Echo Base, banking on the idea that the Empire would not suspect the idea of the Rebels returning there. However, they were once again forced to evacuate in 3 ABY when the Imperials discovered the new base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle made its only appearance in the 1993 LucasArts video game Star Wars: Rebel Assault by Vincent Lee. The game featured an original story, though many of the events were designed to be reminiscent of events shown in the Star Wars movies. The battle had much in common with the Battle of Hoth from 1980's Star Wars: Episode V The Empire Strikes Back and, although the planet was never identified in the game itself, both the manual for the Sega CD version and the box for the PC version identify the ice-world featured as \"Hoth\"."}, {"tag": "p", "text": "The Rebel presence on Hoth in 0 BBY poses a continuity error: According to earlier sources, planet Hoth was unknown to the Alliance Intelligence prior to the Battle of Yavin, until discovered accidentally when Luke Skywalker crashed on the planet. Another source gives a different account, that the Rebels learned the existence of Hoth by the Habassa species, also after the Battle of Yavin. In the development of the battle depicted in Star Tours: The Adventures Continue, George Lucas suggested to the Imagineers to keep the battle plan instead of a tauntauns and wampas scenario they conceived to avoid continuity issues, offering the suggestion that the Rebels and Imperial forces clashed on Hoth before, but the Empire did not expect the Rebels to return to Hoth afterwards. The staff, when hearing this from Lucas, were surprised that he was willing to sacrifice continuity for this ."}, {"tag": "p", "text": "In the ride Star Tours: The Adventures Continue, one of the randomly chosen destinations upon escaping from Imperial forces congregated at the Star Tours space station was Hoth, which depicted a battle between the Rebel forces and the Imperial forces. As the ride's story is strongly implied to take place between 2 BBY (the founding of the Rebel Alliance) and 0 BBY (the events of A New Hope), it's very likely that this was the battle depicted. The Hoth scenario, while random, is always chosen during the middle of the ride. It should also be noted that the Hoth section is the only one of the three middle scenarios (Hoth, Kashyyyk, and Tatooine) that deals with an actual combat situation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}