{"url": "Teeloo", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Males", "Category:Pilots", "Category:Rodians", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Teeloo"}, {"tag": "p", "text": "Teeloo was a male Rodian pilot who owner the Neeva-Beelo, a YT-1210 transport during the time of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 32 BBY, Teeloo had a large family, with six sisters, four brothers, and at least one aunt and one uncle. He also had an undetermined number of cousins, who were disliked by their father."}, {"tag": "p", "text": "An uncle gave him a ship, the YT-1210 light transport Neeva-Beelo, mostly to annoy Teeloo's cousins, who were looking forward to inherit it. His uncle also gave him some basic flying lessons and a small cargo, which consisted of a few animal skins, Rodian ale, and some other items, to get started in a business. Teeloo accepted the gifts, but he believed his cousins were very angry at it. Teeloo's plan was to take his mother, aunt, and siblings with him when he made a jump to the system where he wanted to work the rest of his life, and stay there — He hated astrogating."}, {"tag": "p", "text": "One night Teeloo heard somebody trying to get into the Neeva-Beelo, and thinking it was his cousins, he took off. He looked for an out-of-the-way system to go to, and found the Cularin system. His hyperdrive blew out when he reverted from hyperspace. Looking for a place to repair, he went to Tolea Biqua."}, {"tag": "p", "text": "Unfortunately, Teeloo's inexperience with flying meant he did not notice a small snubfighter near his ship as he turned toward his approach vector — He believed sensors would automatically report that without him checking them out. He rammed the fighter, which belonged to a member of the Blood Raptors gang, sending it spinning off. He laid low in his ship for a day, but he needed to sell his cargo and get started on repairs, so he eventually left the Neeva-Beelo. When he did, the Blood Raptors were waiting."}, {"tag": "p", "text": "The Raptors, led by Scar Blenner, roughed Teeloo up and took his cargo. They also said they were going to take his ship if he did not beat one of them in a race through Eskaron the next day. If he did manage to win, they said they would return his cargo — although they intended to keep Teeloo's ship no matter the race. The cargo had already been taken away and the Blood Raptors were just giving him a little more roughing up to remember them by when a group of Cularin's heroic individuals happened by and chased off the Raptors."}, {"tag": "p", "text": "Teeloo's rescuers offered to help him win the race. They might have repaired several of the Neeva-Beelo's many problems and crewed his ship during the race against the Raptor pilot Gael Kinner. The race covered The Spiral, Skinning the Mynock and the Cavern of Teeth in Eskaron and then, the first pilot to get out of the planet could choose the final part: Either go through the Cularin system asteroid belt and back, or visit the dangerous city of Nub Saar before returning to Tolea Biqua."}, {"tag": "p", "text": "During the middle of the race, Teeloo's opponent ended up destroying a ship in another race which was sponsored by Cularin's crimelord, Nirama. This brought Teeloo to Nirama's attention. They also had a brush with the local pirates, who operated from the asteroid belt."}, {"tag": "p", "text": "The Neeva-Beelo ended up winning the race[source?], but the Blood Raptors were going to take the ship anyway. Nirama's men interrupted the fight, and took all involved before Nirama. The crimelord determined that the Blood Raptors were responsible for the destruction of his ship, and punished them. To Teeloo, he offered to repair the Neeva-Beelo completely, and Teeloo could work for him to pay off the debt."}, {"tag": "p", "text": "Teeloo was grateful to Nirama for the opportunity, and worked for him loyally, despite having to sometimes become a smuggler. His service for Nirama was not exclusive, and he did other work around the Cularin system, including some work for Renna's Transport Service. Teeloo and Renna became friends and eventually became romantically involved. Teeloo's loyalty to Nirama became his doom when Riboga the Hutt moved to take back control of Cularin's crime toward the end of the Clone Wars. Riboga targeted those who worked for Nirama, and Teeloo was killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Teeloo was a kind-hearted and likable Rodian. He was not extremely bright, but was loyal and reliable. He could be proud–he would not let Renna pay off his debt to Nirama for him. He spoke Basic with a lisp."}, {"tag": "p", "text": "His running from Rodia on short notice changed his plan to take his family with him. It is unknown if he went back for them before the Cularin system disappeared for almost a decade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}