{"url": "Tekshar_Falls_Casino", "categories": ["Category:Legends articles", "Category:Casinos", "Category:Kuat locations"], "nodes": [{"tag": "h1", "text": "Tekshar Falls Casino"}, {"tag": "p", "text": "The Tekshar Falls Casino was a gambling establishment located in Kuat City, the capital of the planet Kuat. An architectural marvel built into the Tekshar Falls, the casino featured opulently designed interiors, luxury suites, fine dining, and sabacc tables for gamblers to play at."}, {"tag": "p", "text": "In the year 40 ABY, Boba Fett and his granddaughter Mirta Gev visited the Tekshar Falls Casino in search of information on the whereabouts of bounty hunter Jaing Skirata. The two Mandalorians met with the gangster Fraig in one of the casino's private suites, but the meeting quickly turned hostile after Fett hung Fraig from the suite's balcony in an effort to coax his compliance. Having acquired a lead on Skirata, Fett and Gev escaped the Tekshar Falls via their jetpacks and departed Kuat soon after."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in Kuat City, the capital of the Core World of Kuat, the Tekshar Falls Casino was built into the rocky cliff face beneath the eponymous Tekshar Falls, part constructed materials and part natural stone. The five-hundred-meter, man-made waterfall was made to serve as an extravagant entrance to the casino, requiring prospective gamblers to make their way down a tree-lined boulevard to the base of the falls and cross a footbridge through the wall of water. Inlaid motion sensors triggered automated force fields that parted the downpour on approach, forming a wide, dry portal in the falls for guests to pass through. Several turret outcroppings protruded through the falls from the casino within, and the rushing waterfall also provided its own hydroelectric power to the Tekshar."}, {"tag": "p", "text": "Behind the falls entrance, the Tekshar was warm, dry, and vividly lit. Inside, the lobby was opulently decorated, featuring flocked wall coverings, thick purple carpeting, gilding, numerous mirrors, and low-level lighting. A front desk attended by a steward was positioned to welcome guests, and the lobby parted into two sections, one leading off toward the Tekshar Falls' restaurant while the other led to the gambling tables. The Tekshar's restaurant offered a wine list to patrons featuring a number of selections. Above the lobby, over thirteen floors filled with various suites, salons, and gaming tables were accessible by turbolift. Suites at the Tekshar Falls Casino could be furnished with gilt-framed sabacc tables, beverage-stocked kitchens, and through a pair of transparisteel doors, a railed balcony offering a view overlooking Kuat City, kept dry by an overhang that diverted the water from the falls."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built by the Tirual Construction Holdings company in Kuat City in the years prior to the outbreak of the Second Galactic Civil War, the Tekshar Falls Casino became renown as a Kuati feat of engineering near impossibility for its impressive use of the Tekshar Falls as an extravagant water feature. By that time, the reigning Mand'alor Boba Fett owned shares in the casino via his investments in Tirual Construction Holdings."}, {"tag": "p", "text": "In 40 ABY, Fett and his granddaughter Mirta Gev were searching for the Mandalorian bounty hunter known as Jaing Skirata. After learning that Skirata had killed a gangster named Cherit from the bartender of the Paradise Cantina on Kuat's moon, Bador, the two were directed to the Tekshar Falls Casino in order to speak with Cherit's former associate and Skirata's potential employer, L. Fraig. Following the lead to Kuat City, Fett and Gev visited the Tekshar. After checking in with the casino's front desk, the pair were escorted to the Tekshar's thirteenth floor by a Trandoshan footman where they met with Fraig in his private suite. Despite Fett's initial attempts to amicably persuade the gangster to share what information he knew about Skirata, violence soon broke out when Fraig was not forthcoming and Fett hung the gangster from the balcony in an effort to intimidate him. Though Fraig revealed what he knew under duress, Fett and Gev were forced to flee the casino and Fraig's guards over the balcony with the use of their jetpacks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tekshar Falls Casino first appeared in the novel Sacrifice, the fifth entry in the multi-author Star Wars: Legacy of the Force series, written by Karen Traviss and published May 29, 2007."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}