{"url": "Teezee-Too", "categories": ["Category:Canon articles", "Category:Alliance Intelligence members", "Category:Alliance to Restore the Republic droids", "Category:Feminine programming", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "Teezee-Too"}, {"tag": "p", "text": "Teezee-Too, also known as Teezee, was an RA-7 protocol droid that worked for General Airen Cracken of the Rebel Alliance's Intelligence division. In the Imperial Coalition for Progress' Minister Pitina Voor's complex plot to kill Emperor Palpatine, Alliance Intelligence was tricked into manipulating the archaeologist Doctor Chelli Aphra, who possessed the Jedi artifact known as the Farkiller. Cracken and Teezee-Too pretended to reveal an assassination plot of their own, involving a superweapon, so that Aphra would steal back the Farkiller, which they had sabotaged with a stun weapon, and inform the Empire of the rebels' plot, allowing the Farkiller to fall into the hands of the Emperor. Aphra, however, was aware of Voor's true plot, broadcasting it live to the galaxy, and the rebels chose not to go forward with their plan."}, {"tag": "p", "text": "Some time later, Alliance Intelligence sought to find Aphra, who had been forced into working as an archaeological consultant for the Empire after being captured by Darth Vader. Teezee-Too was stationed aboard the starship Unnamed, where Captain Magna Tolvan brought in a captured Imperial shuttle that held Aphra. The archaeologist escaped Tolvan, and encountered Teezee-Too in the operations room of the Unnamed. Aphra hijacked Teezee-Too, disguising the protocol droid in her clothing to trick Tolvan and her strike team. Tolvan entered the Unnamed's operations room, and fell for Aphra's trick, allowing the archaeologist to escape while Tolvan unknowingly confronted Teezee-Too."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving the Rebellion"}, {"tag": "p", "text": "During the Galactic Civil War between the Rebel Alliance and the Galactic Empire, Teezee-Too served Rebel Alliance Intelligence Service, the Rebellion's intelligence division, working for General Airen Cracken. She occasionally assisted Extraction Team Misericorde, a strike team led by Captain Magna Tolvan, a former Imperial careerist who defected to the Rebel Alliance."}, {"tag": "p", "text": "As part of her plot to assassinate Emperor Palpatine, Minister Pitina Voor of the Coalition for Progress leaked information to the Rebel Alliance, informing them that the archaeologist Doctor Aphra possessed the Farkiller, an ancient weapon created by the rogue Jedi Oo'ob. As Voor predicted, the rebels assumed that Aphra, being hunted down by the Empire, would be desperate to clear her name. As such, Alliance Intelligence devised a false plot, involving the creation of a superweapon using the rifle, to lead Aphra into foiling the plot and delivering the weapon into the hands of the Empire. They installed a non-lethal stun weapon into the rifle, which would be activated when it was delivered to the Emperor for inspection, taking down the defenses in the Imperial Palace on Coruscant."}, {"tag": "h3", "text": "Hypothetical superweapon"}, {"tag": "p", "text": "Once Aphra had stolen the Farkiller from the Slinani Migration Shrine Red Mist, taking it to Unox, Teezee-Too accompanied Extraction Team Misericorde to collect the weapon. As Captain Tolvan disembarked from a U-wing, Teezee-Too announced her presence to Aphra, a former lover of Tolvan's who had previously betrayed her in order to save her own life. Tolvan stunned Aphra, who was taken back to the space station Trading Post Sh'ung-tesk, a livestock market where the Rebellion had temporarily set up a base. When Aphra woke, Tolvan took the Farkiller from her, while General Cracken and Teezee-Too explained their false plan to create a superweapon to kill the Emperor, using both the Farkiller and the plans from the Empire's Death Star."}, {"tag": "p", "text": "When the rebels had finished detailing their plan, Teezee-Too revealed that she knew Aphra had planted slicing units onto their technology, including herself. When Cracken offered to let Aphra into the Rebellion, the archaeologist declined, leaving with her ward, Vulaada Klam. However, after being tracked down by bounty hunters on Arbiflux, Aphra returned to General Cracken, who asked Teezee-Too to watch over Aphra. Teezee-Too escorted Aphra to the laboratory where the Farkiller had been kept, claiming that she distrusted the archaeologist. Aphra proved Teezee-Too correct when she revealed that the protocol droid had missed one of her hijack units, which she used to slice into Teezee-Too."}, {"tag": "h3", "text": "An unexpected turn"}, {"tag": "p", "text": "Able to control the droid, Aphra demanded Teezee-Too to access the laboratory's security systems, sealing the room and altering the sensor readings to hide her activities. Before Aphra could steal the Farkiller back, however, she was confronted by Tolvan. However, the rebels had known Aphra would steal the Farkiller, allowing her to take the weapon and escape with the help of the Wookiee bounty hunter Black Krrsantan."}, {"tag": "p", "text": "With the Farkiller in her possession, Aphra used a communication relay on Usk Minor to inform the Empire of the supposed rebel plot, and was retrieved by Minister Voor, who took her to the Coalition for Progress headquarters on Centax 3. The Farkiller was delivered to the Emperor, who wished to inspect the artifact, and the rebels planned to attack the Imperial Palace once their stun weapon had activated. However, Aphra had known both the rebels and Minister Voor were manipulating her. While Voor revealed the details of her plot, Aphra used a hijacked cam droid to transmit her speech to both the rebels and the Empire. Having learned that they had also been manipulated, and that Palpatine had not fallen victim to the sabotaged Farkiller, Teezee-Too and Alliance Intelligence chose not to continue their seizure of power on Coruscant."}, {"tag": "h3", "text": "Aboard the Unnamed"}, {"tag": "p", "text": "Following Aphra's prevention of Minister Voor's plot, she was captured by the Sith Lord Darth Vader, who forced her to work for the Empire as part of a team of archaeological consultants to Project Swarm, the search for the new rebel base, located on the planet Hoth. After Aphra discovered Asteroid Helix 13-v, an asteroid where rebels had briefly stopped before moving to Hoth, Alliance Intelligence discovered that Aphra had investigated the asteroid through footage obtained from cameras hidden in the temporary base. Tolvan's strike team was sent to capture the Imperial shuttle carrying Aphra, which was pulled into the Rebel Intelligence starship Unnamed."}, {"tag": "p", "text": "While Tolvan attempted to capture Aphra, Teezee-Too was stationed in the operations room of the Unnamed, analyzing the footage from the Asteroid-Helix. From the footage, Teezee-Too concluded that the Empire was attempting to find their new headquarters, reporting her discovery to Tolvan. However, Aphra had escaped Tolvan, and made her way to the operations room, incapacitating Teezee-Too. As Tolvan and Strike Team Misericorde rushed to the operations room, Aphra placed her jacket, gloves, and hat on Teezee-Too, and remotely controlled the droid to appear as if Teezee-Too were her. When Tolvan entered, she believed that Teezee-Too was Aphra, and attempted to confront her. Tolvan ordered \"Aphra\" to turn around, and Teezee-Too managed to stand, revealing Aphra's trick. Aphra, who was waiting outside the door to the operations room, destroyed the door's control panel, trapping all members of the strike team besides Tolvan."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As an RA-7 protocol droid, Teezee-Too was manufactured by Arakyd Industries. Standing 1.7 meters tall, Teezee-Too had red plating and photoreceptors. She had an archive of records, including historical information written by Professor Korin Aphra. Teezee-Too was also able to display holographic images, including a live feed. Despite being a droid, who Teezee-Too claimed had little use for faith, she still believed in earning trust, especially within the Rebellion. Teezee-Too was able to predict statistics, claiming that she estimated a 76 percent chance that Gurtyl, the pet qaberworm of Aphra's ward Vulaada Klam, was a diversion for one of Aphra's schemes. Teezee-Too was distressed by Aphra's numerous attempts to hijack her, and was  irritated when she succeeded in doing so aboard the Unnamed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While collecting Aphra and the Farkiller on Unox, Teezee-Too rode a speeder bike. In the operations room of the Unnamed, Teezee-Too had access to various technology, and was able to view previously-recorded footage on holographic screens."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Teezee-Too first appeared in Doctor Aphra 32, a comic written by Simon Spurrier, penciled by Wilton Santos and Caspar Wijngaard, and published by Marvel Comics on May 8, 2019. Teezee-Too was identified in the following issue, similarly written by Spurrier and penciled by Santos, and published on June 19, 2019. In Doctor Aphra 34, written by Spurrier and published on July 17, 2019, Teezee-Too's name was spelt as \"Teezee-Two.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}