{"url": "Battle_of_Hoth_(Great_Galactic_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Battles of the Great Galactic War", "Category:Battles of Hoth"], "nodes": [{"tag": "h1", "text": "Battle of Hoth  (Great Galactic War)"}, {"tag": "p", "text": "The Battle of Hoth was a major naval battle that occurred in 3665 BBY, during the second decade of the Great Galactic War between the Galactic Republic and the resurgent Sith Empire. A fleet of highly advanced prototype warships, including the Republic superdreadnaught Star of Coruscant, was ambushed by the Imperial Navy after Chiss agents alerted Imperial Intelligence to the fleet's existence, and the Hoth system became the site of a massive space battle that lasted for days. While the battle began along the supposedly secret route that the Republic fleet was traveling, the conflict passed through several star systems before reaching its peak above the planet Hoth. The final stages of the battle in the Hoth system destroyed over seventy-five vessels, inflicting heavy damage on both the Imperial and Republic Navies and sending ships such as the Star of Coruscant, the Conraddas Vindicator, the Vehement Sword, and the Ambria's Fury crashing to the icy surface of Hoth."}, {"tag": "p", "text": "The Battle of Hoth severely demoralized the Republic Military, breaking the momentum generated by the recent victory at Alderaan and leading to the Republic's eventual acceptance of the Treaty of Coruscant, which ended the war in 3653 BBY. Over fifteen years after the battle, the wreckage of the destroyed ships turned the planet's icy surface into a hotly contested battleground. Both the Empire and the Republic battled each other and the White Maw pirate organization in an effort to salvage what they could of the prototype technology lost in the last war."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the wake of victories such as the Battle of Alderaan and a campaign under the leadership of General Jace Malcom, the Galactic Republic began to gather a fleet of prototype starships and powerful warships, led by the legendary prototype superdreadnaught Star of Coruscant, with the purpose of eventually attacking the Sith Empire's capital of Dromund Kaas and ending the Great Galactic War. However, in 3665 BBY, a secret Chiss enclave on the planet Hoth intercepted coded Republic messages indicating the fleet's existence and that it would soon pass along a secret route in the Outer Rim Territories. The enclave notified Imperial Intelligence, as the Chiss Ascendancy was an ally of the Empire, and the Imperial Navy gathered near the system."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As the Republic fleet passed along the secret route, not far from the uninhabited Hoth system, a massive strike force from the Imperial Navy ambushed the Republic ships. This began a protracted battle that lasted for days and spread over several star systems. The presence of the powerful prototype ships ensured the survival of many of the Republic crew members—including Satele Shan, one of the Jedi Knights assigned to protect the fleet—but the battle claimed the lives of many on both sides and destroyed hundreds of vessels. The fighting reached its peak in the Hoth system, where over seventy-five vessels were sent crashing to Hoth's surface. Colonel Laren Omas, the driving force behind the Star of Coruscant project, survived most of the battle, but he was killed when his personal shuttle, the Starbreeze, was shot down over the planet."}, {"tag": "p", "text": "Republic ships such as the Sendant Pride and the Deliverance were damaged or destroyed during the battle and succumbed to Hoth's powerful gravity well, joining the growing number of ships strewn upon the icy surface. The Vehement Sword, a prototype warship equipped with the newly developed Null Cannons—weapons that fired energy blasts to disable entire starships, similar to large-scale ion cannons—was another casualty of the conflict, breaking in half upon impact and splintering the Null Cannon prototype into dozens of pieces. The Star of Coruscant itself crashed onto the planet, but the dreadnaught's armor was so strong that the ship remained completely intact, buried in the snow and ice. A Valor-class cruiser, the Intercessor, escaped the battle and went on to fight in the Sacking of Coruscant and the Cold War. The starfighter carrier Conraddas Vindicator was among the casualties as well as a Republic transport ship that was carrying experimental stealth field generators. The Mon Calamari–designed cruiser Dauntless Star shot down over sixty Imperial fighters before being destroyed, while starfighter units such as Victor Squadron took down dozens of battle cruisers before they, too, were eliminated."}, {"tag": "p", "text": "Many Imperial craft were claimed by the battle as well—the Enforcer, Storm Fire, and Indignation were among the ships that crashed on Hoth's surface, and an Imperial scientist's shuttle, the Deference, was also shot down and ended up in the Highmount Ridge region. Among the more notable casualties were an Imperial prison ship carrying the legendary Jedi Master Wyellett, and the Ambria's Fury—a sleek and secretive warship whose loss distressed the Moffs of the Empire. Imperial Admiral Layek Davos was shot down in the battle as well, and a Sith holocron was believed destroyed during the fighting, though it was actually lost amid the crashed ships."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Battle of Hoth was a heavy blow to the Republic war effort, and, despite the cost to the Imperial Navy, it was considered a victory for the Empire. Many veterans of the Great Galactic War later believed that the engagement was a major turning point in the war and one of the main reasons that the Republic later accepted the Treaty of Coruscant twelve years later to end the war. The image of the Star of Coruscant falling to Hoth's surface was a great tool for Imperial propaganda, and Colonel Omas' death during the battle also spelled the end of the Republic's Shadow Arsenal superweapon project, though the Republic scientist Doctor Nasan Godera continued to work on the stealth arsenal of planet-cracking missiles in secret. After being shot down, Admiral Davos was stranded on Hoth's surface for six months before he was rescued."}, {"tag": "p", "text": "Neither the Republic nor the Empire attempted any recovery or salvage efforts beyond the retrieval of Davos by the Empire, and pirates from the White Maw organization took advantage of their disinterest to begin salvage efforts of their own. The Star of Coruscant became a pirate fortress, and it was not until sometime after the Treaty of Coruscant that the Republic and the Empire returned to Hoth in order to salvage what they could from the remains of their prototype ships. Over two decades after the battle, Imperial forces recovered the holocron that had been thought destroyed with help from the Chiss Ascendancy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Hoth was first mentioned in the entry for the planet Hoth in the Holonet, a section of the official website for the 2011 video game Star Wars: The Old Republic. The battle is greatly expanded on in the in-universe sourcebook The Journal of Master Gnost-Dural as well as the in-game Codex and various missions on Hoth for both factions in The Old Republic. However, the Journal is internally inconsistent as to the dates; the initial entry that mentions the battle is dated to 3665 BBY, but in a second later entry dated approximately four and a half years later, Gnost-Dural refers to the battle as having taken place around three years earlier—which places the battle around 3664 BBY. The very first concept art for Hoth by lead artist Arnie Jorgensen featured the Starship Graveyard, and the Graveyard and the Battle of Hoth were elements of the planet's storyline from the beginning of the development process. The 2012 reference guide Star Wars: The Old Republic Encyclopedia gave additional information on the battle, including that the Chiss Ascendancy was responsible for the Empire learning about the Republic fleet. The cut Republic mission \"Survivor\" would have featured the player rescuing Pilot First Class Darkil Aro, who had crashed during the Battle of Hoth after taking down an Imperial battle cruiser and managed to survive the last two decades amidst the frozen wastes. The Imperial Agent missions involving the Shadow Arsenal superweapon place the Battle of Hoth near the end of the war, though this is inconsistent with all other sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}