{"url": "Teezyk", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Gladiators", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Teezyk"}, {"tag": "p", "text": "Teezyk was a male Rodian bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In his early years on Rodia, Teezyk received training in all manner of combat, including the use of blasters and hand-to-hand fighting. He became a hero in the arena, but later left Rodia and became a gifted bounty hunter, even respected by the Hutts, who often recruited him for their most dangerous missions. Even in his later years, Teezyk was willing to come out of retirement, for the right price. He often claimed that he had only failed to complete one mission in his entire career, and that was only because the being who hired him had called off the hunt before it could be completed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Teezyk was a true professional: when on a bounty hunting assignment, he focused solely on the task ahead, all the while keeping a cool and level-headed state of mind. His preferred method of hunting included meticulous investigation; learning as much as possible about his targets allowed him to carry out his job when they least expected it. Despite his calculating manner of assassination and apprehension, Teezyk preferred not to analyze the nature of his work. He was of the opinion that bounty hunting was just a job, and nothing more than that. He remained unaffiliated with any factions throughout his career, choosing to place his trust only in himself, and always working alone."}, {"tag": "p", "text": "He had absolutely no distinguishing physical features, a boon in his line of work: his unassuming appearance allowed him to easily hide in crowds, and to approach targets without drawing suspicion. He wore simple clothes, and seldom spoke. He could both write and speak Basic, Bothese and Dosh, in addition to his native tongue Rodese. Following his retirement, Teezyk enjoyed the peace and quiet of his palace on Rodia, but still felt the urge to take up the odd bounty assignment."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}