{"url": "Tel_Trevura/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Criminals", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tel Trevura"}, {"tag": "p", "text": "Tel Trevura was a male criminal who once stole a JumpMaster 5000 from the planet Svivren. He was believed dead by 5 ABY and had a bounty on his head at that time."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tel Trevura was a male criminal who was known as an escape artist. Prior to the Assembler information broker Kud'ar Mub'at's death in 4 ABY, he took a JumpMaster 5000 starship at blasterpoint from the planet Svivren. At some point, Trevura and his Jumpmaster 5000 were involved in a skirmish involving a RZ-1 A-wing interceptor and a TIE/IN interceptor above a dark celestial body. During the skirmish, the engines of the A-wing exploded causing it to be knocked out of the fight. Sometime later, Trevura's JumpMaster 5000 crashed onto a planetoid in Wild Space, and scouts later discovered the starship. Mub'at had the registry of the crash altered so that Trevura was not connected to the ship."}, {"tag": "p", "text": "By 5 ABY, Trevura was considered dead, though he still had a bounty on his head. That year, Mub'at's successor Balancesheet revealed to the infamous bounty hunter Boba Fett that Trevura was indeed alive and that the downed JumpMaster 5000 was Trevura's. Balancesheet traded the fact with Fett for information regarding the Niordi cyborg D'harhan, along with forty percent of Trevura's bounty when Fett took him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tel Trevura was first mentioned in the 2012 reference book The Essential Guide to Warfare, which was written by Jason Fry and Paul R. Urquhart. Although this article states that Balancesheet would get the forty percent, Warfare says that Fett would get it. However, as Fett bargains the price Balancesheet stated at fifty percent down to forty, this article assumes that he would not want less money, and thus that the money was supposed to go to Balancesheet instead."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}