{"url": "Telos_Holocron", "categories": ["Category:Legends articles", "Category:Sith holocrons"], "nodes": [{"tag": "h1", "text": "Telos Holocron"}, {"tag": "p", "text": "The Telos Holocron was a holocron of atypical design crafted by adherents to the Sith Order at some point prior to the Golden Age of the Sith. Intended to be a repository of the lore and wisdom that defined their philosophy, the holocron was passed down through generations of Sith Lords after its creation, many of whom imbued their knowledge within the device. A number of the Lords became gatekeepers of the Telos Holocron, lending their image and voice to the repository as a simulacrum that future users could interface with. In 40 ABY, the New Jedi Order discovered the Sith holocron and quarantined it within their academy on the Outer Rim world of Ossus. While investigating the device, Jedi Master Tionne Solusar learned that its most recent gatekeeper was Darth Sidious, former Dark Lord of the Sith and Galactic Emperor."}, {"tag": "p", "text": "The Sith holocron contained testimonials from numerous Sith Lords from varying points in galactic history, including Ajunta Pall of the Dark Jedi Exiles, Naga Sadow of the original Sith Empire, Darth Bane, founder of the Order of the Sith Lords, Darth Revan and Sidious himself. While a number of the entries were in regards to the history and plight of the Sith, others were more focused on dark side practices and teachings of the arcane powers that could be accessed through the Force. While it was in his possession, Sidious made several additions to the repository based on his own experiences, and contributed addenda to the entries of past users in order to update the holocron with more modern references. In the year of its discovery, Master Solusar was able to unlock the device and transcribe its contents into a manual on the Force that she was crafting for future generations of Jedi."}, {"tag": "h2", "text": "Properties"}, {"tag": "p", "text": "The Telos Holocron was of a highly atypical design, defying the conventions of both Jedi and Sith holocrons. Where most holocrons created by the Sith were pyramidal in shape, the Telos artifact was amorphous, characterized by an asymmetrical base of red matter surrounded by spiky protrusions. Set within the base was a vertical formation, the apex of which held a clear crystal. The device appeared to eschew the intricate crystalline matrices of other holocrons, and lacked the glyphs and outward markings that so often characterized Sith holocrons. Despite its unconventional appearance, it was obvious to members of the New Jedi Order that the Telos Holocron was an artifact of the Sith."}, {"tag": "p", "text": "Like all holocrons, the Telos Holocron was a storage device imbued with the power of the Force. As a repository of protected information regarding the Sith Order and its teachings, the Telos Holocron was both guarded and overseen by gatekeepers—manifestations of the thoughts and personae of previous users. These gatekeepers were more than simple virtual intelligences—they were able to interface with and react to users in real-time, responding to their queries as if they were true beings. While most Sith holocrons only manifested their gatekeepers audibly, the Telos Holocron provided a visual simulacrum of its guardians as well. The contents of the device were only accessible to Force-sensitives; however, unlike other holocrons, the Telos Holocron was capable of detecting the persuasion of those who attempted to use it and deny access to Jedi who would possibly use the information within to undermine the goals of the Sith."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "By 40 ABY, the Telos Holocron contained information and testimonials from over five thousand years of Sith history, as well as almost all force powers pertaining to the dark side. The various Sith Lords who possessed the holocron over the ages contributed to its knowledge base, leaving records of historical events, analysis of Sith practices, or lessons on the manipulation of the Force. In 10 ABY, Darth Sidious, Dark Lord of the Sith and Galactic Emperor, added his persona to the Telos Holocron to become the gatekeeper of the device. Sidious's simulacrum appeared as the Dark Lord did in his youth, under the pretense that elderly teachers can seem antiquated and condescending."}, {"tag": "p", "text": "The gatekeeper greeted users with a statement encouraging them to explore the powers at their disposal, regardless of any warnings issued by past teachers, and praised them for being strong enough to access the information within the holocron. It went on to state that while the information within the holocron was freely available to the user, the contributors' wish offered it under a single stipulation—that the learner use the information for the benefit of only themselves. The simulacrum closed the greeting by claiming that the first priority for any student looking to comprehend the ways of the Sith was understanding the history of their order."}, {"tag": "h3", "text": "The Conquest of Sith Space"}, {"tag": "p", "text": "One of the earliest contributors to the Telos Holocron was Ajunta Pall, who, as Sidious noted, was one of the earliest Sith Lords and a combatant in the final battle at Corbos during the Hundred-Year Darkness. Pall addressed his record to his descendants and those of his comrades, who had taken up the title of Sith Lords and established an empire around their newly-forged religion. In the entry, the Sith Lord advised listeners on how to govern the Sith Empire, urging them not to only rely on superior power and the Force, but also ambition. He continued into an extended explanation of the Empire's origin, in which he stressed that the rulers of the Sith should be thankful not only to their forefathers, but to the Jedi Order as well."}, {"tag": "p", "text": "As Pall explained, the Sith Order and its empire was born out of the Jedi Order and the schism it suffered in the Hundred-Year Darkness. After discovering methods of twisting lifeforms through the use of the malignant side of the Force, a sect of the Jedi Order came to be known as Dark Jedi, and were persecuted by the orthodox Jedi Knights. After the defeat of the Dark Jedi at Corbos, Pall and his comrades were exiled from known space and purged from the records of the Jedi Order. After being loaded onto unarmed vessels and sent to uncharted regions of space, the Exiles landed on the Outer Rim world of Korriban, home to the primitive Sith species. Pall provided a first-hand account of how the Exiles used their sorcery to oppress and dominate the natives, eventually earning the title \"Lords of the Sith.\""}, {"tag": "p", "text": "Pall closed his entry with an anecdote on an attempt by some of his fellow Sith Lords to exact revenge on the Jedi and his opposition to the plan. After leaving the space that had been organized into the first Sith Empire, the activist Lords were never heard from again. Nevertheless, Pall stated his belief that the day would come for a renewed Jedi-Sith conflict."}, {"tag": "h3", "text": "The Sith Code"}, {"tag": "p", "text": "A Dark Lord of the Brotherhood of Darkness known as Qordis added a short entry to the Telos Holocron in which he recited and explained the Sith Code. According to Qordis, the tenets of the code were more than simple phrases for memorization and recitation; indeed, understanding them was the key to unlocking the deepest powers of the Force. Qordis indicated that the Code had been in use since the Exiles took up the title of Lords of the Sith, and included a copy of the text. Sidious added an addendum to the Dark Lord's entry, noting that Qordis was one of the more powerful Lords of Kaan's Brotherhood of Darkness, yet still fell to Darth Bane during the latter's purge of the Sith Order at the close of the New Sith Wars."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Quarantined by the Jedi"}, {"tag": "p", "text": "The holocron was discovered on Telos IV by the New Jedi Order in 40 ABY, shortly after their rediscovery of the Great Holocron. Nearly half of the Master's Council argued that the Holocron should be destroyed due to the threat of it falling into the wrong hands."}, {"tag": "p", "text": "Kam Solusar was suspicious of the device, but studied it with his wife Tionne Solusar with the support of Luke Skywalker. Four Jedi were assigned to watch over Tionne as she delved into the Telos Holocron, watching for any signs of potential corruption or manipulation of the user."}, {"tag": "p", "text": "One of the Holocron's Gatekeepers was Darth Sidious, who obtained the Holocron at some point during his reign and left his dark legacy to future generations."}, {"tag": "h2", "text": "Sources"}]}