{"url": "Telti/Legends", "categories": ["Category:Legends articles", "Category:Moon stubs", "Category:Confederacy of Independent Systems moons", "Category:Factory worlds", "Category:Galactic Empire moons", "Category:Galactic Republic moons", "Category:Inner Rim moons", "Category:Techno Union planets"], "nodes": [{"tag": "h1", "text": "Telti"}, {"tag": "p", "text": "Telti was a moon located in the Inner Rim."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was the location of a major droid construction facility, which covered nearly the entire surface of the moon. The moon had no atmosphere, and all the manufacturing facilities were located in domed structures connected via air-tight tunnels and overland corridors. It was guarded by a wide range of battle droids and guard droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the Clone Wars, Telti was the site of one of the Techno Union factories which produced B1-Series battle droids. This factory and others across the galaxy were shut down prior to the outbreak of war, leading to 12.5 million employees being laid off. While business reasons were cited, in reality, the Techno Union had joined forces with the Separatists, and had moved production lines to worlds in the Outer Rim Territories, far from the prying eyes of Republic inspectors."}, {"tag": "p", "text": "After the Battle of Endor the moon joined the New Republic, but fell under the control of Brakiss, a Dark Jedi underling of Kueller. On Kueller's orders Brakiss produced droids on Telti equipped with bombs. These droids were used to decimate Almania, Pydyr, Auyemesh, and Smuggler's Run, as well as bomb the New Republic Senate."}, {"tag": "p", "text": "The droid threat was eventually stopped when Cole Fardreamer, R2-D2 and C-3PO travelled to the planet after discovering bombs planted inside upgraded X-Wing starfighters. After Cole was captured and sent away to be tortured, R2-D2 reprogrammed a number of old astromech droids stored on the planet. With their help, R2-D2 managed to overpower the Red Terror, modified gladiator droids set to the guard the manufacturing facility, and deactivate the explosives with Brakiss' remote. Brakiss was then driven into his shuttle and off of the planet by the remaining astromech units, escaping."}, {"tag": "p", "text": "EV-9D9 and EV-9D9.2 were assembled on Telti."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}