{"url": "Tem_Madog", "categories": ["Category:Legends articles", "Category:Cathar", "Category:Je'daii Temple Masters", "Category:Males", "Category:Tythans"], "nodes": [{"tag": "h1", "text": "Tem Madog"}, {"tag": "p", "text": "Tem Madog was a male Cathar Je'daii Temple Master serving the Je'daii Order on Tython at the height of the Infinite Empire's reign. A master craftsman and experienced in metallurgy, Madog was responsible for crafting Madog steel, a highly durable and nearly unbreakable metal used as the primary component in a Je'daii's Force-imbued blade. Overseeing the forges of Vur Tepe, Madog was a member of the Council of Masters on Tython at the time of the Force Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Master of the Forge"}, {"tag": "p", "text": "A Force-sensitive Cathar, Tem Madog was trained in the ways of the Force by the Je'daii Order on the planet Tython, one of nine planets in the Tython system which made up the Settled Worlds. Appointed as a Je'daii Temple Master, the highest ranking members of the Order, Madog governed the Great Temple of the Forge, Vur Tepe. Madog and the other Temple Masters formed the Je'daii Council, meeting via holocommunication at the Temple of Balance, Akar Kesh. The Cathar Je'daii and the other Temple Masters formed the Je'daii Council, meeting via holocommunication at the Temple of Balance, Akar Kesh. Like the other Temple Masters, Madog was a member of the Overseeing the forges built into the mountain fortress of Vur Tepe, Madog was renowned throughout the Order for the forging of Madog steel, a highly durable metal which he used to construct the Force-imbued blades carried by Je'daii."}, {"tag": "p", "text": "When the Devourer, a starship of Rakatan design, crash landed on Tython in 25,793 BBY a massive Force storm threatened all life on Tython. Receiving a directive from Temple Master Ketu to gather all Je'daii at his Temple so that they could enter into group meditation, Madog and his Temple joined the rest of the Je'daii Council and their respective Temples in meditation so that they might dissipate the storm and return the Force to Balance. Successfully ending the storm through their combined meditation, Madog received a group of Je'daii to Vur Tepe who carried an exotic weapon which was brought to Tython by a warrior aboard the ship. Presented with the weapon known as the Forcesaber, Madog attempted to alter the weapon in the hottest forge at Vur Tepe but could not mar the hilt, nor could he ignite its blade of coherent energy. Puzzled by the lack of an ignition switch and the strange crystal apparatus housed internally, the enigma was deepened when Ranger Hawk Ryo was able to activate the weapon with ease. Instructing Ryo to hold onto the Forcesaber and report back on his findings, Madog promised to await his report. When the Force Hound Xesh allied himself with the Order, Madog was quick to listen to the man as he explained how to manufacture the weapons en masse and began setting the Je'daii at Vur Tepe to the task of replicating the Forcesaber."}, {"tag": "h3", "text": "Force Wars"}, {"tag": "p", "text": "When the Infinite Empire revealed itself, it launched a massive assault on the Tython system which saw the fall of many worlds. As they made their slow approach toward Tython, Master Rajivari took command of the Je'daii's army and Master Madog served as a general during the fighting. Wielding a Forcesaber of his own, Madog fought on the front lines at the battle for Shikaakwa, leading units of troops alongside Masters Tave and Daegen Lok. Working their way through the swamps surrounding Ryo Fortress and the capital city, Madog assisted Xesh and Sek'nos Rath as they slaughtered Flesh Raiders before they finally beat back the Empire's forces and the planet was secured."}, {"tag": "p", "text": "Returning to battle on Ska Gora, Madog drove the Je'daii attack after Sek'nos Rath and Xesh disappeared from the battle. Giving his faith over to the Seers and the Force, Madog opened himself up to the dark side of the Force to further power the Forcesaber and feed his bloodlust. Sensing a shift in the Force to the dark side during the battle, Madog received orders from Master Rajivari that all members of the Order were to break off their attack and retreat back to their ships based on intelligence reporting an impending attack on Tython."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the novel Dawn of the Jedi: Into the Void, author Tim Lebbon repeatedly and mistakenly refers to Tem Madog as only a Je'daii Master and not a Temple Master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}