{"url": "Telosian_Restoration_Project", "categories": ["Category:Legends articles", "Category:Galactic Republic organizations"], "nodes": [{"tag": "h1", "text": "Telosian Restoration Project"}, {"tag": "p", "text": "The Telosian Restoration Project was an initiative of Supreme Chancellor Tol Cressa to restore the ecosystem of Telos IV after the planet was rendered lifeless by orbital bombardment during the Jedi Civil War. The outcome of this project would determine the Republic's policy towards the Outer Rim worlds—if the project was successful, it would consider financing the restoration of other planets that had suffered from the Mandalorian Wars and the Jedi Civil War."}, {"tag": "p", "text": "To monitor the Restoration Project, the massive Citadel Station was built in orbit above Telos. The project itself was guided by Chodo Habat and his Ithorian herd. The surface of Telos was divided into \"restoration zones,\" each of them having a unique code, and the Republic started importing lifeforms from other worlds—for example, cannoks, meant to keep the herbivore population in check, were taken from Onderon, its jungle moon of Dxun and Ithor itself."}, {"tag": "p", "text": "By 3951 BBY, the Ithorians had been challenged by Czerka Corporation, which, through not entirely legal means, attempted to take control over the Restoration Project. Their plans were different from the ones proposed by the Ithorians—instead of restoring the nature of Telos, they proposed urbanizing it. In reality, they saw the project only as a cover-up—what they actually wanted was access to abandoned Republic military bases on the planet's surface. However, the corruption within the Czerka department on Citadel Station was eventually exposed by Meetra Surik, and the Telosian Council drove the company away from Telos."}, {"tag": "p", "text": "According to Darth Traya's predictions, the Restoration Project would complete successfully, and the surface of Telos would once again harbor life for years to come. The project was still underway by 3643 BBY, over three hundred years later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}