{"url": "Telsij/Legends", "categories": ["Category:Legends articles", "Category:Gray Squadron personnel", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Telsij"}, {"tag": "p", "text": "Lieutenant Telsij was a Human male Y-wing pilot and a lieutenant who served in Gray Squadron during the Galactic Civil War. At the Battle of Endor, he flew as Gray Two in a Y-Wing, acting as Colonel Horton Salm's wingman. He was one of only four pilots to survive an attack on the Imperial Academy of Carida. His gunner at Endor was Karie Neth. When TIE fighters began to attack the Rebel starfighters in space, Telsij cried out that they were being overwhelmed. Despite the overwhelming numbers of Imperial fighters, the Rebellion emerged victorious."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 1999, an action figure of Telsij was released by Hasbro as part of the \"Rebel Pilots\" Cinema Scenes set, but was incorrectly identified as Arvel Crynyd. Although the shape of the helmet included with the figure matches that worn by Telsij, the pattern on it was based on another helmet prop created for the film, which was later worn by Rebel pilot Till in the video game Rebel Assault II: The Hidden Empire."}, {"tag": "p", "text": "The name \"Lieutenant Telsij\" first appeared in a Star Wars Customizable Card Game set released by Decipher in 2000."}, {"tag": "p", "text": "According to stage director Hilary Westlake, the actor who portrayed Telsij is likely to have been Eiji Kusuhara. Westlake was a close friend of Kusuhara, and wrote his obituary for The Guardian after his death in 2010. After viewing footage of Telsij's appearance in Return of the Jedi, Westlake told NPR that, \"Albeit brief, I would say it is most certainly Eiji.\""}, {"tag": "p", "text": "Telsij was never given a full name in Star Wars Legends, but the 2019 canon reference book Rebel Starfighters Owners' Workshop Manual gave him the first name \"Gureni\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}