{"url": "Temple_of_the_Ancients", "categories": ["Category:Legends articles", "Category:Infinite Empire locations", "Category:Lehon locations", "Category:Rakata culture", "Category:Sith academies", "Category:Temples"], "nodes": [{"tag": "h1", "text": "Temple of the Ancients"}, {"tag": "p", "text": "The Temple of the Ancients, also called the Temple of the Elders, was a temple on Lehon that was said to hold the secrets of the Star Forge. The temple's doors were blocked by a mysterious force field that only Rakata could bring down by performing a special ritual or by using an ancient tome, and even then, the force field would not stay down for long."}, {"tag": "p", "text": "The structure itself was twenty meters tall. Located on the top of the Temple of the Ancients was the summit. It contained an elevator to the main floor, as well as a disruptor field that forced starships to land, either controlled or not, on the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "When several Mandalorians were stranded on Lehon, they built a camp at the Temple of the Ancients until they were killed by Revan. When Revan helped the Elder Rakata free a prisoner from the Black Rakata, the Elders performed a ritual allowing Revan into the temple. Shortly after, when the Star Forge was destroyed in the Battle of Rakata Prime, a celebration was held at the Temple Exterior, where Revan and his companions were personally awarded the Cross of Glory by Admiral Forn Dodonna."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "During the Jedi Civil War, Revan and crewmembers Zaalbar, Mission Vao, Carth Onasi, Jolee Bindo, Juhani, HK-47, T3-M4, and Canderous Ordo crash-landed on Lehon while on their way to infiltrate the Star Forge. Their crash-landing was caused by the disruptor field installed within the temple. With their ship damaged and in need of repair, Revan set out with his companions to scout out the area for possible replacement parts from the other crashed ships which littered the area and to find a way to shut down the disruptor field."}, {"tag": "p", "text": "Revan met with The One, a leader of the native Rakata, who made him a deal. The One would help him enter the Temple of the Ancients if Revan brought back an ancient tome from the Elders, another tribe living on Rakata Prime. Revan, however, sided with the Elders, who then allowed Revan access to the Temple."}, {"tag": "p", "text": "The priests had only started their ritual when Juhani and Bindo rushed up to them and told them they had sensed great danger in the temple, and they couldn't let Revan face it alone. At first the priests refused, but after Revan insisted that he could not destroy the Star Forge alone, the priests agreed to let all three Jedi inside."}, {"tag": "p", "text": "In addition to battle droids and a number of Dark Jedi and Sith who had been sent to the temple by Darth Malak, they discovered an ancient computer terminal which gave them the secrets to the Star Forge and the way to disable the disruptor field that brought them down to Rakata Prime in the first place. But they encountered what they least expected: a former Jedi named Bastila Shan, corrupted by the dark side. When the redeemed Jedi Revan came to the summit to deactivate the shield, which prevented the Ebon Hawk from taking off, along with Jolee Bindo and Juhani, they encountered Shan, who was their companion before being captured by Darth Malak and tortured into submitting to the dark side. After a lightsaber duel, Bastila tried to convince Revan to reclaim his title as the Dark Lord of the Sith, but Revan refused. Bastila fled, and Revan deactivated the disruptor field generated from the summit before proceeding to his final confrontation with Malak."}, {"tag": "h3", "text": "After the Jedi Civil War"}, {"tag": "p", "text": "Three centuries later, during the Galactic War, the Temple was occupied by the Order of Revan and repurposed as a factory to create invincible cyborg supersoldiers equipped with Rakata technology for the Order's Infinite Army. When a strike team invaded, the cyborgs were destroyed and the supervising Revanites, Darth Arkous and Rian Darok, were killed rather than be captured. Subsequently, Revan arrived in a Harrower-class dreadnought and opened fire on the Temple in an attempt to kill his enemies but the strike team escaped via shuttle."}, {"tag": "p", "text": "Thousands of years later, Darth Bane would arrive at the Temple to seek its secrets. In the lowest sublevel, he finally found Darth Revan's holocron. Bane studied from it extensively until it lost power and died. He would use the information in the holocron to form the Order of the Sith Lords, which eventually brought down the Old Republic and nearly destroyed the Jedi. Inside the Temple, he was confronted by the Sith Lord Kas'im. Bane and Kas'im engaged in a protracted duel that eventually moved to the steps of the Temple. Bane was then able to kill Kas'im by striking him with a powerful wave of Force energy that brought down the Temple entrance way around him. Bane then departed, and the further history of the Temple is unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic the player is given the choice of killing the Elders as he was told by the One instead of siding with them. Doing this allows the player to recover an ancient tome, which Revan could then present to the One, and Rakata priests disable the shields."}, {"tag": "p", "text": "Later, inside the temple itself, if Revan chooses to follow the dark side, he reclaims his title as Darth Revan, and kills companions Jolee and Juhani. Revan and Bastila return to the Ebon Hawk and tell the crew of Revan's return to the dark side."}, {"tag": "p", "text": "Also, the Elders say that only people who are strong in the Force can enter the Temple. But if the player chooses non-Jedi characters from his group after disabling the disruptor field and exiting the Temple, they will also be able to enter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}