{"url": "Battle_of_Iskalon_(Nagai%E2%80%93Tof_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Trans-Nebular sector", "Category:Battles of the Nagai-Tof War"], "nodes": [{"tag": "h1", "text": "Battle of Iskalon  (Nagai–Tof War)"}, {"tag": "p", "text": "The Battle of Iskalon was the second major battle in the Nagai invasion of 4 ABY."}, {"tag": "h2", "text": "Battle"}, {"tag": "h3", "text": "Buildup"}, {"tag": "p", "text": "Following the Second Battle of Endor, Luke Skywalker and Lando Calrissian traveled to Iskalon, intending to inform the Iskalonian people of Kiro's death, at the hands of Den Siva on Kinooine. Setting down at the wrecked city of Pavillion, the two men found the small platform littered with Nagai corpses. The Nagai, under General Kruskob Tiltanka, had invaded the world and taken the School captive using deadly sonic blasters. When the Iskalonians refused to build the Nagai base a number had been slaughtered."}, {"tag": "h3", "text": "Battle"}, {"tag": "p", "text": "After speaking with the Iskalonian leader, Mone, Luke and Lando learned that Kiro was, in fact, still alive. After escaping Siva on Kinooine, Kiro had returned to Iskalon, and began opposing the Nagai construction efforts on the planet. When the prisoners had been killed, he'd counterattacked and left the littered corpses of the Nagai on the platform for Luke to find. Kiro revealed himself when Skywalker, Calrissian and Mone came under attack from a squad of Nagai. Although he was able to protect Luke and Lando, Kiro was unable to stop Mone, Dania Francis, and their school of Iskalonians from being captured by the Nagai. Kiro left the scene immediately, however, giving Luke no chance to speak to his old friend."}, {"tag": "p", "text": "With Pavilion secure, Luke and Lando donned rebreather apparatus and headed underwater, hoping to bring down the Nagai's tower. They began to demolish the structure with Luke's two lightsabers, but were attacked by a patrol squad of Nagai. Once again, Kiro appeared, defeating the Nagai. Kiro then headed inside the tower to try and rescue Mone and the captured Iskalonians, who were being used as slaves by the Nagai. Luke followed him, leaving Lando to demolish the towers foundation."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Although Luke and Kiro were able to free Mone and the others, Kiro was shot in the heart by a Nagai and seemingly killed. Lando brought the tower tumbling into the sea, breaking the Nagai hold on the planet. Kiro then revealed himself to Luke – he had not, in fact, been killed, but feigned death for a second time. He asked Luke to keep his survival a secret, especially from the Zeltron Dani, before disappearing into the waters for one final time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}