{"url": "Temple_Spire/Legends", "categories": ["Category:Legends articles", "Category:Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Temple Spire"}, {"tag": "p", "text": "The Temple Spire, also referred to as the Tranquility Spire, was the highest of the five spires of the Jedi Temple. The Spire was the most sacred site in the Temple and emanated a contemplative atmosphere. By the late Clone Wars, the Temple Spire also housed a Jedi Council chamber."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Established above and around the sacred spire, the mountain which contained the Force nexus in which the Temple was originally contained, the tower stood taller than the surrounding Council spires. As the building grew, it came to completely cover and reshape much of the mountain, with its peak remaining in its original shape within the spire."}, {"tag": "p", "text": "At the conclusion of the Clone Wars, when Jedi Knight Anakin Skywalker fell to the dark side and began to carry out Darth Sidious' Order 66, he went to the Temple and began his slaughter of all of its occupants. Temple Spire's base was heavily bombed by LAATs, causing the Tower to list. While it lay empty for over a decade, it was occasionally visited by the Sith, searching for hidden knowledge. During the invasion of the Yuuzhan Vong, the spire collapsed, revealing the sacred spire underneath. It is here that the deranged Lord Nyax would do battle with Jedi Grand Master Luke Skywalker, his wife, and Knight Tahiri Veila."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The tallest of the Temple's five spires, the Temple Spire was filled largely with turbolifts which carried visitors to the tower up and down. As passengers traveled up within the turbolifts, visitors were able to view the history of the Order through transparisteel windows. Mosaics, heritage tapestries and towering memorial statues of the most revered Jedi which were suspended within the tower on repulsorlift pads. At the base of the tower, the original mountain peak of the sacred spire jutted out of the Temple Ziggurat and was encircled by transparisteel hallways which overlooked the barren slopes of the edifice. Pathways led from the outer halls onto the mountain and through it, leading down into ancient chapels and temples. It was the site of meditation chambers and halls where the youngest Jedi were brought to have their minds opened to the vastness of the Force."}, {"tag": "p", "text": "While the bulk of the Spire contained with floating statues and murals, the summit of Temple Spire was filled with meditation chambers and halls. The veranda was the name given to the upper levels of the tower which was marked by three wings which jutted out from the otherwise cylindrical section. Specialized halls and chambers were located within the wings and were used for celebrations or significant occasions. Directly below the veranda was a small hanger reserved for special Jedi transports and high-ranking Jedi. In the space directly above the veranda was the spacious Hall of Knighthood which served as a space for the Jedi High Council to elevate Padawans to the rank of Knighthood. Padawans preparing to undergo the Knighting ceremony would spend the week prior in deep meditation in one of the veranda's private meditation rooms. During the Clone Wars, a circular chamber within the Spire's summit was used as a meeting place for the Jedi High Council. The pinnacle room at the very summit of Tranquility Spire held the most sacred and oldest documents from the founding of the Order on Tython, many of which had been saved from destruction on Ossus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The novel The Clone Wars: Wild Space erroneously states that the Jedi Archives are located within a third of the Tower."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}