{"url": "Battle_of_Iziz", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Articles with conflicting sources", "Category:Battles of the Beast Wars"], "nodes": [{"tag": "h1", "text": "Battle of Iziz"}, {"tag": "p", "text": "A battle, fought in the year 4000 BBY, was the culmination of a centuries-long planetary conflict known as the Beast Wars of Onderon. The battle began after three Jedi Knights arrived on Onderon to oversee an attempt at a peaceful existence between the people of Onderon's lone city, Iziz, led by the Queen Amanoa, and the Beast Riders from the planet's wilderness. However, the Jedi's negotiations with Amanoa were suddenly halted when Beast Warrior Commandos raided the Iziz Royal Palace, during which time Princess Galia, Amanoa's daughter, was kidnapped. Upon orders from the queen to retrieve the princess, the Jedi successfully located Galia at the Beast Rider's jungle citadel, Fortress Kira, and discovered that she was in the process of marrying Oron Kira, son of Beast-Lord Modon Kira."}, {"tag": "p", "text": "The Jedi learned during the reception that Amanoa ruled Iziz through the power of an ancient Dark Lord of the Sith named Freedon Nadd, and that the Beast Riders' refusal to submit to her will was what sparked the war. They convinced Galia and Kira to return with them to Iziz to present their marriage to Amanoa as an end to the conflict, but the queen rejected the proposal outright. In a gesture that shocked them all, Amanoa invoked the spirit of Nadd, while ordering her armies to engage the Beast Riders in war. Following Amanoa's refusal, Oron Kira contacted his army, which was the largest gathering of Beast Riders ever assembled, and commanded them to begin their attacks on Iziz."}, {"tag": "p", "text": "Both sides suffered many casualties early on in the battle. The tide steadily turned in favor of the Beast Riders, who had managed to capture the city and surround the Royal Palace. However, Amanoa and the Naddists, city-dwelling worshipers of Freedon Nadd, employed the power of the dark side of the Force, for which the Beast Riders had no defense. Slowly, the direction of battle swayed, this time in favor of Amanoa and the city-dwellers. Not until the arrival of Jedi Master Arca Jeth, who exercised his mastery of Jedi battle meditation against the Naddists, was victory delivered into the hands of the Beast Riders. During the battle, Amanoa was killed, having been released from Nadd's influence and unable to withstand the potency of Jeth's light side power. With the death of her mother, Galia assumed the throne of Iziz, with Kira ruling at her side as king."}, {"tag": "h2", "text": "Background"}, {"tag": "h3", "text": "Civil unrest in the Onderon system"}, {"tag": "p", "text": "In the year 4000 BBY, Princess Galia of the planet Onderon was kidnapped by the outlaws from her planet's wilderness, known as the Beast Riders. Led by Beast-Lord Oron Kira, the Beast Riders assaulted the Royal Palace of Iziz, Onderon's only city, just as a trio of Jedi Knights consisting of Ulic Qel-Droma, his brother Cay, and the Twi'lek Tott Doneeta, arrived to mediate a peaceful end to the centuries-long civil war between Kira's people and the city-dwellers. Specialized Beast Warrior Commandos breached the throne room of the palace and successfully abducted the princess, whom they spirited away into the wilds of Onderon immediately after. Queen Amanoa, Galia's mother, demanded in the name of the Galactic Republic that the Jedi rescue her daughter. The three Jedi agreed to free Galia, and immediately set out in search of her."}, {"tag": "p", "text": "After their starship, the Nebulon Ranger, was shot down and crash-landed in the jungles of Onderon, the Jedi encountered and tamed wild boma-beasts, who led them to the Beast Rider stronghold where the princess was. Much to their surprise, the Jedi saw that Galia and Kira were engaged in a wedding ceremony, in the presence of nearly 400 Beast Riders. The Jedi interrupted the ceremony in an attempt to rescue Galia, who seemed like she was being forced into the union. However, the princess revealed that she was binding herself to Kira of her own accord and refused to return to Iziz. The astonished Jedi were then invited to join the remainder of the ceremony by Oron Kira's father, Modon."}, {"tag": "p", "text": "During the reception, the Jedi learned that Amanoa was secretly a practitioner of Sith magic and was harnessing it through the spirit of Freedon Nadd, an ancient and deceased Dark Lord of the Sith. Through Amanoa, the citizens of Iziz—the Naddists—worshiped the memory of Nadd, and those who refused to submit themselves to his power were banished to the wilderness beyond the walls—left to be devoured by the wild beasts whose domain it was. These exiles managed to conquer the beasts and amass themselves into a sizable beast-riding army with which to eventually combat Amanoa's forces. After spending years trading information and conspiring with the city's political underground, Modon felt as though the time had come to act. Ulic Qel-Droma convinced Galia and Oron to present their union as a truce before Amanoa, with hopes that she would end her war and make peace with her enemies. Modon, however, was skeptical in the chance that diplomacy would prevail, and instead gathered the other Beast-Lords in preparation for war, in the event the Jedi peace mission was unsuccessful. Under his banner, thousands of Beast Riders rallied in the wilderness, united in the largest host ever gathered up to that point on Onderon for the final battle against the citizens of Iziz."}, {"tag": "h3", "text": "Confronting the Queen"}, {"tag": "p", "text": "With Galia accompanying them onboard the Nebulon Ranger, the Jedi returned to the walled city, under escort of Kira and several other Beast Riders mounted on flying beasts. After being initially attacked by Iziz's defense towers, they were allowed to land in the city after it was revealed that Galia was with them. The royal advisor Novar met them at the Iziz spaceport and quickly escorted Galia, Kira, and the three Jedi into Amanoa's throne room. The queen was less than pleased to learn that her daughter had married into the Beast Rider's fold. Nevertheless, she did entertain them, as the Jedi again offered her a place within the Republic, while Galia implored her mother to embrace the light. The opportunity to sway Amanoa vanished when Kira offered her an ultimatum: recognize his and Galia's marriage as an end to their war, or the Beast Riders would rise up against her in battle."}, {"tag": "p", "text": "Amanoa rebuked Galia and her companions, and then called upon the spirit of Freedon Nadd and literally summoned darkness; the power of which rapidly overtook the throne room and the palace. She further commanded her Royal Protector bodyguards to surround the party, and eliminate their chance to escape. The Jedi made short work of most of the Protectors, however, while Kira commed both his father and Commander Gobee, advising them to commence their counterstrike, as the peace negotiations had failed. Kira's arm was singed by enemy blaster fire at that moment, a painful realization that the final battle for Iziz was officially underway."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Iziz under siege"}, {"tag": "p", "text": "Outside the walls of Iziz, both Gobee and Modon Kira received orders from Oron to begin the counterstrike. As Kira attempted to make his own departure from the palace, Gobee led his wings of Beast Riders in an aerial assault on both the north and eastern walls of Iziz, while Modon's forces advanced in boma-mounted ground formation. Their attack was met with turbolaser and ion cannon resistance, but Iziz's wall defenses were soon overwhelmed by the superior strength in Beast Rider numbers."}, {"tag": "p", "text": "At some point during battle, Gobee touched his beast down and continued to lead the siege from the ground, managing to overtake the ramparts of the northern wall. In a coordinated attack, Gobee and his ground troops then scaled the defense towers as his flying squads rained heavy blaster fire from above. The commander and his troops successfully captured the towers and killed the Naddist Wave gunners who manned them. With the northern wall secured, the Beast Riders entered the city and overran the soldiers in the streets of Iziz. However, the Royal Palace itself remained impregnable, and the Beast Riders took their heaviest losses at its feet. Gobee nonetheless held his position near the citadel, which was from where Kira's last transmission had originated. When one of his soldiers informed him of the severe casualties being dealt to the Beast Riders by the palace resistance, Gobee commanded Flight leader Kurt to disengage the enemy in the east and suppress the fire coming from the palace roof. Gobee was soon met by Kira, whom he joined in command of their forces. The Beast Riders eventually subdued the city from all sides and converged on the Royal Palace."}, {"tag": "h3", "text": "Amanoa's power"}, {"tag": "p", "text": "Inside the palace, Amanoa's royal guardsmen had the Jedi pinned down. Recognizing the threat she presented with her dark side powers, Cay Qel-Droma seized the queen and demanded that she cease her spell-casting. He was then attacked from behind by one of her Royal Protectors, causing his lightsaber to careen into the leg of an adjacent Royal Protector. Before Qel-Droma could retrieve his weapon, a third Protector attacked him and severed his left arm. Amanoa used the distraction to steal away into the depths of the palace, all the while invoking the spirit of Freedon Nadd to further bolster the might of her armies."}, {"tag": "p", "text": "Ulic Qel-Droma fought back intense enemy fire to rescue his brother. With Cay in tow, Ulic then retreated to the abandoned laboratory of Galia's father, where Ulic dressed Cay's wound. Cay spotted a dilapidated XT-6 service droid whose parts could be adapted for Human use, and proceeded to configure one of the droid's arms as a prosthetic replacement for himself. Ulic also advised him that Galia had been taken to the Nebulon Ranger by Tott Doneeta, and that Kira had escaped the palace to join his Beast Riders in battle. They both noted that Amanoa's whereabouts were unknown."}, {"tag": "p", "text": "Amanoa had retreated to the tunnels under the palace and was drawing on the power of Freedon Nadd's tomb. Planetside, darkness blackened the sky, and the Jedi felt as though their ability to use the Force had been stifled. Victory soon turned in favor of Amanoa's forces, as her spell gave them an increased will to fight while sapping the strength of their enemies. The armies of Iziz managed to retake the northern wall while their armored companies moved in, whose artillery bombardments were enough to completely drive off the already retreating Beast Riders from Iziz. In just a few short moments, the city once again belonged to the city-dwellers."}, {"tag": "p", "text": "Having taken up command in a sensor tower along the wall of Iziz, Kira was surprised when Gobee appeared with Novar, a prisoner-of-war. However, the royal advisor openly mocked the Beast Riders with their impending defeat; he began to reinforce Amanoa's spell through his own strength in the dark side, and Kira and Gobee immediately began suffering from its effects. Novar then prepared to kill them, when the unexpected arrival of an off-world starship and the being onboard reversed the ebb and flow of battle yet again."}, {"tag": "h3", "text": "Influence of a Jedi Master"}, {"tag": "p", "text": "In the skies above Iziz, Arkanian Jedi Master Arca Jeth began to reaffirm the Beast Riders' resolve from his starship through use of an ancient Jedi Force technique known as battle meditation. Amanoa's darkness receded from the atmosphere of Onderon as quickly as it had appeared in the face of his light-side assault. Almost instantly, the Beast Riders' courage was restored. They fought with a renewed zeal to swiftly defeat the worshipers of Freedon Nadd, who were conversely suffering from the demoralizing effects of Jeth's meditation, and the battle was won. In the sensor tower above the city streets, Novar was also beaten, having been overcome by the physical prowess of Kira."}, {"tag": "p", "text": "Upon landing his ship, Jeth was greeted by all three of his apprentices, who could sense the disdain emanating from their Master. Jeth had sent his apprentices to Onderon in his stead only three days prior, but felt that his intervention was required since things had fallen out of his students' control. After the battle, Jeth focused on locating Amanoa and the source of her dark side power. Accompanied by Galia, Tott Doneeta, Ulic, and Cay Qel-Droma, Jeth descended into the lower levels under the palace, intent on confronting the queen sorceress."}, {"tag": "p", "text": "Led by the Force, Jeth and his companions followed a path that led to a tomb under the palace, until they came upon Amanoa, who was kneeling at the feet of the sarcophagus of Freedon Nadd and chanting his name in reverence. Jeth's strength was enough to drive Nadd's influence from the catacombs, and Amanoa also died, as the power that supported her was gone. Jeth then threw back the massive lid of Nadd's coffin to reveal the skeletal remains of the deceased Sith Master, still brimming with potent dark side energies. Removing Nadd's ancient lightsaber from the tomb, Jeth proclaimed the Dark Lord's power broken and declared Galia finally free of its power."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the centuries-long war between the peoples of Onderon finally over, the marriage of Kira and Galia, the new king and queen of Onderon, was made official under Republic law, and the institution of peace could begin through their union. Also, to ensure the complete purge of Nadd's influence on the planet, Arca Jeth ordered the erection of a new tomb on Onderon's closest moon called Dxun, constructed of lightsaber-resistant Mandalorian iron. Nadd's remains were to be housed there, as well as Amanoa's, to be left under the protection of the moon's natural fauna. After their formal union, the new king and queen oversaw the funeral procession of Amanoa and Nadd, in the presence of their Jedi allies, whose assistance in the battle of Iziz helped unify the warring peoples of Onderon under one banner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle at Iziz was written and conceived by author Tom Veitch for the Star Wars: Tales of the Jedi comic series, in the storyarc of Ulic Qel-Droma and the Beast Wars of Onderon, released in the fall of 1993. The battle also appeared in the audio rendition of that same comic. Veitch laid a substantial foundation for Freedon Nadd's backstory in the audio drama, which he would later expand on in the subsequent Freedon Nadd Uprising, and Dark Lords of the Sith storyarcs. Veitch also used this battle to kill off the character of Amanoa."}, {"tag": "p", "text": "There are two conflicting stories with regards to the loss of Cay Qel-Droma's arm. In the comic version, Qel-Droma's arm is severed by a Royal Protector with a bladed weapon.\nHowever, in the audio drama, his arm is blasted off by Novar, who runs off laughing afterward."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}