{"url": "Tenebrae%27s_curse", "categories": ["Category:Legends articles", "Category:Diseases and maladies", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Tenebrae's curse"}, {"tag": "p", "text": "Tenebrae's curse was unleashed concurrently with the Battle of Zakuul. When the Commander of the Eternal Alliance cast the spirit of the Immortal Emperor Valkorion out of his mind, the former Emperor's Wrath Scourge and the Jedi Knight Kira Carsen found and destroyed his original Sith body. This triggered a trap laid by Tenebrae: the destruction of this body was tied to a Sith ritual that released the plague into the air, thanks to the said ritual carved into his body centuries prior. Since Scourge and Carsen had already been affected similarly by the emperor in the past, they were not infected, but left comatose for more than a year."}, {"tag": "p", "text": "Jedi Master Satele Shan led a mission to rescue Scourge and Carsen around 3628 BBY. The plague still lingered, however, and Shan and her followers were unknowingly infected. Within days, they were left in a nightmarish sleep, in which they slowly began merging into a hive mind. Scourge and Carsen, having been successfully rescued by the Jedi, captured them and kept them quarantined in a transport vessel flying an undetermined course through unsettled sectors of the Outer Rim Territories."}, {"tag": "p", "text": "Kira later realized that the ritual carved into Tenebrae's original body was not a plague, but an imprint, an echo of his original self meant to manifest when both his body and spirit were destroyed. Although the imprinted spirit did not maintain memories of the original, it still possessed the same powers."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The plague's symptoms were apparently purely psychological, with no physical changes mentioned. Symptoms included coma, nightmares, and delusion (the afflicted being lost in a dark side hive mind). Even individuals very strong in the Force were easily clouded by the plague. Individuals who had previously been affected by Tenebrae in similar ways, such as Children of the Emperor or members of his power base, were immune to the disease, only being left comatose upon contact."}, {"tag": "p", "text": "It was revealed that the ritual was not a plague but rather an imprinted spirit of Tenebrae, which manifested and fed off of the memories of impressions of Satele and her students, allowing the Emperor to once more be reborn but without memories of the original. However the clone of Tenebrae, by analyzing the memories of people near him, came to learn of the real Tenebrae's various exploits during his lifetime. However, his personality did not change as a result, but instead the clone condemned the original Tenebrae for having become \"complacent\" and \"distracted by mortal concerns; Empires, wars. Even a family.\" and that he had seen how that path led to the original Tenebrae's destruction. The imprint then went on to declare that he would conquer the Galaxy for himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}