{"url": "Tenel_Ka_Djo", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Females", "Category:Former Jedi", "Category:Galactic Alliance individuals", "Category:Hapan Queen Mothers", "Category:Hapans", "Category:Jedi Coalition personnel", "Category:Jedi Consulars", "Category:Jedi Knights of the New Jedi Order", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Tenel Ka Djo"}, {"tag": "p", "text": "Tenel Ka Djo was a female Hapan Jedi Knight and the daughter of Prince Isolder, Chume'da of the Hapes Consortium, and the Dathomiri witch Teneniel Djo. Although she was the heir of the Hapes Consortium, she preferred the traditions and customs of her mother's people over those of her father's, which angered some Hapans, including her grandmother, Ta'a Chume, and preferred not to be addressed by her full name, Tenel Ka Chume Ta' Djo. Tenel Ka joined Luke Skywalker's Jedi academy when she was a young teenager, and became close friends with Jacen and Jaina Solo, Lowbacca, Raynar Thul, and Zekk."}, {"tag": "p", "text": "During her stay at the Jedi academy, Tenel Ka and her friends repelled the deadly Shadow Academy, foiled the Diversity Alliance, and put an end to the return of the Black Sun. During the Yuuzhan Vong War, Tenel Ka was part of Myrkr strike team to destroy the Jedi hunting voxyn queen. During the mission, she realized that she was in love with Jacen Solo, though he was captured by Vergere and taken into Yuuzhan Vong custody. She survived the mission, and later became Queen Mother of Hapes against her personal wishes, and a year later she learned that Jacen had indeed survived Myrkr. During the Killik crisis in 36 ABY, Tenel Ka agreed to send Jacen Solo a fleet to aid the Killiks, which were now under the leadership of former friend, Raynar Thul. She and Solo also had a daughter, Allana, and Tenel Ka resigned from the New Jedi Order in order to devote her full attention to the throne."}, {"tag": "p", "text": "In 40 ABY, Tenel Ka and Allana were marked for death by a sect attempting to gain control of the Consortium. When Jacen turned to the dark side, he vowed never to kill Tenel Ka or Allana, despite his Sith mentor Lumiya's arguments that killing them would bring peace and stability to the galaxy. During the Battle of Kashyyyk, she turned against Jacen, horrified by his actions. This caused Jacen to value Allana's life far more than Tenel Ka's to the point that Jacen was prepared to kill Tenel Ka if she attempted to keep Allana from him. He later kidnapped Allana to force Tenel Ka back into an alliance, though upon Tenel Ka's urgent request, she was rescued by Luke Skywalker, Han Solo, and Leia Organa Solo. It was then that the elder Solos discovered their connection to Allana. The Solos continued to keep the secret, and Tenel Ka allowed the Jedi to relocate to the Transitory Mists, inside Hapan territory."}, {"tag": "p", "text": "Tenel Ka soon helped in the downfall of Jacen, now Darth Caedus, by trapping his fleet over the Jedi's base on Shedu Maad. However, a nanovirus targeting Hapan royal blood was released on her capital ship, and Jacen reached out to her shortly before his death, screaming at her to protect Allana. With his help, Tenel Ka and Allana managed to escape the nanovirus, though Tenel Ka realized the Hapan style of life was not meant for Allana. With that, she requested that Han and Leia take her to the Jedi Academy on Shedu Maad and raise her outside the machinations of Hapan politics. By 43 ABY, Tenel Ka had yet to reenter the Galactic Alliance, not approving of the appointment of Chief of State Natasi Daala or the aggressive actions of the Imperial Moffs. She was later targeted by the Lost Tribe of Sith, and after a failed assassination attempt on her life, Tenel Ka helped evacuate the Jedi Academy on Ossus before the Sith could attack."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Choosing a path (—23 ABY)"}, {"tag": "p", "text": "Tenel Ka was raised in the traditions of both of her parents, learning the ways of politics on Hapes, and training both physically and in the ways of the Force on Dathomir. She developed the beliefs and values of her mother, Teneniel Djo and her great-grandmother, Augwynne Djo, who was the leader of the Singing Mountain Clan on Dathomir. Her father, Isolder, accepted her choices, though they did not bode well with his mother, former Queen Mother Ta'a Chume. Chume's attempts to sway her granddaughter to train to be a fit Queen Mother fell on deaf ears, for Tenel Ka decided to train as a Jedi Knight, with the support of her mother."}, {"tag": "p", "text": "When she was old enough, Tenel Ka went to Yavin 4 to train at Luke Skywalker's Jedi Praxeum. She became fast friends with Jacen and Jaina Solo, though she did not tell them of her position as the Hapan heir, as she wanted them to accept her for who she was, not for her title."}, {"tag": "h3", "text": "Jedi Training (23 ABY–25 ABY)"}, {"tag": "h4", "text": "Discovering the Shadow Academy"}, {"tag": "p", "text": "A month after meeting Jacen and Jaina, Tenel Ka was introduced to Lowbacca and his translator droid, Em Teedee, when he joined the Jedi Academy from Kashyyyk. He asked Tenel Ka to call him by his nickname, Lowie, as a sign of friendship, though Tenel Ka refused to, claiming that it was not out of a sign of disrespect, but that she'd honor him by using his full name."}, {"tag": "p", "text": "While the group of friends was repairing a crashed TIE fighter, the pilot, Qorl, abducted Jaina and Jacen, but Tenel Ka made it back to the Praxeum to summon help, although by the time help arrived, Qorl had taken off in the newly repaired craft. Jacen and Jaina later escaped, but so did Qorl."}, {"tag": "p", "text": "While her friends were visiting Lando Calrissian at his GemDiver Station, Tenel Ka had to stay behind to welcome one of her grandmother's ambassadors that was assigned to check in on her. When her friends were kidnapped by the Shadow Academy, she set out to help Luke Skywalker find them. The pair first traveled to GemDiver Station where Lando informed them that the twins and Lowbacca's captors used Corusca gems to invade the station, and that led them to Borgo Prime, where the only shipments of the gems were sent. They soon discovered that the gems had been purchased by a Nightsister."}, {"tag": "p", "text": "It was during the trip that a conversation came up about how both of them had been dreaming of the return of the Nightsisters. Tenel Ka, as her parents spoke very little about it, was curious of why her mother thought so highly of Skywalker and of what happened when her father and Skywalker had first visited Dathomir. She was unsettled and embarrassed to learn from the teasing Jedi Master that upon meeting him, Teneniel had captured Luke. Tenel Ka was chagrined at the very thought of him submitting to the Dathomir marriage customs that she had always viewed as quaint and provincial. Tenel Ka was newly embarrassed to realize that her mother had captured the greatest known Jedi Master at the time and had fully expected him to marry her and father her children. The situation suddenly struck her as so ridiculous that she let lose a rare giggle."}, {"tag": "p", "text": "The two set out to Dathomir, where they met with Augwynne Djo, Tenel Ka's great-grandmother who informed them that the Nightsisters had returned. They then witnessed Vonnda Ra and Vilas, members of the Nightsisters, campaign for new members, using equal treatment of males, something unusual to Dathomir society, as a draw for male members. Pretending to be interested, Tenel Ka and Luke traveled to the Great Canyon Clan where they encountered Vonnda Ra. They displayed their powers to Ra, who approved of them and then sent them to join the Shadow Academy."}, {"tag": "p", "text": "They boarded the Shadow Chaser, which was piloted by Nightsister Garowyn. Once they made it to their destination, they dumped Garowyn in an escape pod and then docked at the Shadow Academy. They disembarked and were approached by the Solo twins and Lowbacca, who had all broken out of their cells. During the escape, Tenel Ka confronted the Shadow Academy's Second in Command, Tamith Kai, who attempted to sway Tenel Ka to her side. Tenel Ka refused, and kicked Tamith Kai hard in the unprotected kneecap, shattering it and sending her tumbling down the boarding ramp of the ship. At this time, things were said and done that would lead to much enmity between the Jedi trainee and Nightsister. They then set out, knowing that it would not be their last encounter with the Shadow Academy."}, {"tag": "p", "text": "Sometime after their safe return to the Praxeum, Tenel Ka accompanied her friends to Coruscant for a vacation. On their first full day there, she met Jacen and Jaina's old friend Zekk. Though they got off to a rocky start when she lassoed him with some fibercord rope, Tenel Ka and Zekk quickly became friends."}, {"tag": "p", "text": "A couple of days later, Tenel Ka was invited to a diplomatic banquet in honor of the new Karnak Alphan ambassador and her children. Because she had had experience with the Karnak Alphans and their odd customs due to her royal upbringing, Tenel Ka managed, with Anakin Solo's assistance, to have an important Karnak Alphan dinner custom performed. The ambassador, not expecting an observation of her people's ways by her hosts, expressed her great appreciation to Leia Organa Solo."}, {"tag": "p", "text": "After Zekk disappeared, Tenel Ka joined Jacen in his search for the missing youth in the undercity of Coruscant. Tenel Ka had managed to recall the layout of the area from her previous visit with Zekk and the rest of her friends. After saving each others' lives a few times, the two of them eventually found Zekk. Any relief that might come from finding him ended abruptly when Zekk revealed that he was going to train to become a Dark Jedi at the Shadow Academy. With that, he left his stunned friends behind."}, {"tag": "h4", "text": "A severe accident"}, {"tag": "p", "text": "Due to the threat that the Shadow Academy and its Dark Jedi posed, Luke Skywalker decided that Jacen, Jaina, Tenel Ka, and Lowbacca were ready to build their lightsabers. Tenel Ka struggled with the importance of a lightsaber, believing that it was the warrior's skill that mattered, and not their weapon. While her friends began constructing their lightsabers, Tenel Ka set out doing rigorous physical training to prove to herself that she was able to handle a lightsaber, and upon hearing from Lowbacca that the three were nearly complete, began creating her own."}, {"tag": "p", "text": "Tenel Ka considered several options for the lightsaber handle, wanting something suitable for a warrior of Dathomir, thinking of the rancor as the appropriate symbol. She then remembered that she had kept two of the smaller teeth from her great-grandmother's favorite rancor, when it had died a few years earlier. The two treasured possessions would be of the right shape and size."}, {"tag": "p", "text": "With Lowbacca flying her to a volcano, Tenel Ka traveled down a lava tube and found the crystals within that she used as her lightsaber's focusing crystals. Back at the temple, Tenel Ka realized the tooth's hollow that she had chosen was a little too small for the crystal arrangement she had hoped for. Her closer inspection also revealed a tiny flaw in each hazy volcanic crystal, but decided to make do as her sense of competition urged her to complete its construction quickly. Her blade was a white-gray color due to the volcano's crystals. During an exercise designed by Luke Skywalker in which Tenel Ka and her friends had to wear visors that made laser remotes invisible, Tenel Ka used the Force to deflect the bolts aimed at her and was the only one to slice her remote in half."}, {"tag": "p", "text": "With Luke Skywalker supervising, Tenel Ka then began her first lightsaber sparring exercise with Jacen Solo, where Tenel Ka found herself approving of her friend's skill. After switching to their left hand, their blades clashed and became locked against each other. The stress of pushing back caused the components inside the tooth to vibrate, quickly escalating to cause the handle itself to rattle. Although unsettled to how her weapon was now feeling in her hand, Tenel Ka ignored it. With a sharp crack, her lightsaber components failed, but Jacen didn't notice and kept pushing. The power source overloaded with a shriek and suddenly quit. The blade disappeared, and Jacen's pushed right through the now empty air, and through flesh and bone, severing her left arm just above the elbow. Tenel Ka could see as her lightsaber hit the ground and explode in her dismembered hand, rendering it unable to be reattached. The accident drastically changed their relationship, especially in light of the fact that, prior to the accident, Jacen had hoped they would become more than friends. Tenel Ka fell unconscious before she hit the ground. She was quickly brought back to the Jedi academy by Skywalker, who managed to keep the Solos and Lowbacca from Tenel Ka to protect her secret that she was the Hapan princess. She then refused to see her friends; though not because she blamed them, but because she did not want them to see her in such a pitiful state."}, {"tag": "p", "text": "Tenel Ka was whisked away to Hapes by her grandmother, Ta'a Chume's Ambassador, Yfra. Tenel Ka was greeted by her grandmother Ta'a Chume, who prepared a show for her arrival. Gorgeous, nearly naked young men, muscular and dressed only in skimpy loincloths, performed a gymnastics show for Tenel Ka, while other scantily clad male servants provided music nearby. Later in the medical room, Tenel Ka briefly considered whether she should continue to train as a Jedi, but in a display of personal strength and confidence, Tenel Ka refused to have the temporary droid arm (which she Force pushed into the opposite wall), nor the prosthetic replacement her grandmother had arranged for her to be attached, and sought to enhance her physical abilities along with her Jedi talents to make up for her loss."}, {"tag": "p", "text": "Soon after, Jacen and the others arrived and sought to comfort Tenel Ka, and asked her why she hadn't told them she was a princess. In response, Tenel Ka said that she did not think they would accept her on her own merits, even though they had. Jacen and Tenel Ka apologized to each other and spent time together. Then after foiling a plot by one of Ta'a Chume's ambassadors to kill her and her grandmother, she decided that her path was definitely one of a Jedi. She returned to the Jedi academy and constructed a second lightsaber from relics of both sides of her family: The second, larger rancor tooth and choice Rainbow gems picked out from the remains of the tiara of the Royal Princess of Hapes (accepted by her on Ta'a Chume's insistence that she'd take it back to Yavin 4), which she had smashed apart with the tooth. This lightsaber was carefully constructed and produced a turquoise blade. The use of several Rainbow Gems made her lightsaber one of the most expensive lightsabers used by the Jedi (along with Jacen Solo's and Ganner Rhysode's Corusca gem lightsabers.)"}, {"tag": "h4", "text": "Endgame"}, {"tag": "p", "text": "On Kashyyyk, she learned that Zekk had indeed been brainwashed and trained as a Dark Jedi. Along with her friends, Tenel Ka escaped the Shadow Academy's forces through the Kashyyyk Underworld, leading to Jaina's confrontation with Zekk. Throughout their pursuit, Tenel Ka and her friends put a stop to Tamith Kai's allies, Vonnda Ra and Garowyn, who both met their ends in the Underworld. They stopped the attack by the Shadow Academy on Kashyyyk and prepared for an attack on the Jedi Praxeum."}, {"tag": "p", "text": "When the attack did come, Tenel Ka journeyed to the landing pad with Lowbacca, where she confronted Tamith Kai. Soon a TIE fighter came crashing down on the landing pad only moments after Tenel Ka and Lowbacca were able to escape, though the Nightsister was not. She then watched as Jaina began to duel Zekk, who later redeemed himself by telling the Jedi not to enter the temple. Soon after, the temple was destroyed by bombs that had been placed there by the Shadow Academy."}, {"tag": "p", "text": "The Shadow Academy itself had self destructed, for reasons unknown to the Jedi. In fact, it had been because the Emperor's Royal Guards had masterminded the entire operation, and, upon Brakiss learning the truth, they killed him. Tenel Ka then helped in the reconstruction of the Jedi Praxeum."}, {"tag": "h4", "text": "Fighting the Diversity Alliance"}, {"tag": "p", "text": "Shortly after, her parents and grandmother sent her an old unmarked Hapan ship which she named the Rock Dragon. Tenel Ka chose Jaina and Lowbacca as pilot and co-pilot, for she knew, especially with one arm, they could enjoy the title more than she could. Soon after, Tenel Ka and her friends went to the Graveyard of Alderaan for their maiden voyage in search for a shard of the planet to bring back to Jacen and Jaina's mother, Leia. While there, they were confronted by Boba Fett (who, in fact, was Fett's daughter Ailyn Vel wearing Fett's armor), but they managed to escape with help from Zekk in the Lightning Rod."}, {"tag": "p", "text": "Afterward, Tenel Ka helped stop an attempt to abduct Raynar and Aryn Dro Thul, who had both been kidnapped by Diversity Alliance agents who wished to use them to draw Bornan Thul out of hiding. The elder Thul had happened across the location of the secret Imperial warehouse where a human plague resided, and Diversity Alliance leader Nolaa Tarkona wanted it. After Lowbacca had seemingly joined the Diversity Alliance, she and her friends went to rescue him. However, they were caught by Diversity Alliance personnel and sentenced by Nolaa Tarkona to work in the ryll mines. Lowbacca found out about their presence and arranged an escape plan. In the confusion, however, Tenel Ka and Jacen were separated from Jaina and Raynar and were stuck on the dark and frozen side of Ryloth, where they found the exiled Twi'lek leader Kur. The two Jedi trainees bonded over their exile, and helped Kur regain his position of power on Ryloth. Help came in the form of the Rock Dragon piloted by Lowbacca."}, {"tag": "p", "text": "After Zekk rescued Bornan Thul from bounty hunters, Tenel Ka and the rest of her friends went with them to destroy the asteroid containing the Emperor's Plague. During the battle Bornan Thul died when the Emperor's Plague was released, using his last moments to keep the plague from spreading. But Tenel Ka and her allies did win the day. In a celebration, the normally stoic Tenel Ka kissed Jacen Solo for the first time."}, {"tag": "h4", "text": "Black Sun insurgency"}, {"tag": "p", "text": "After the defeat of the Emperor's plague, an old enemy—Black Sun—resurfaced. One of their agents, a woman named Anja Gallandro on Ord Mantell, caught Jacen's attention, which made Tenel Ka jealous of the older woman. Both Jacen and Zekk found her intriguing and exotic, something that angered both Tenel Ka and Jaina, and both became instantly suspicious of her. Though they befriended Anja after helping her on Anobis, the girl's erratic behavior was unnerving to Tenel Ka."}, {"tag": "p", "text": "They then journeyed to Cloud City upon Lando Calrissian's request, and they were attacked by Black Sun's hidden leader, Czethros and his men. During a small battle, Jacen was thrown from the floating city, and Tenel Ka feared him lost. The warrior woman took what appeared to be his death very hard, especially since Jacen had been clinging to her boot before falling, and because she felt that he might have survived if not for her missing arm, because he might have been able to hang on to her hand better than to her boot. But soon after that, he reappeared, alive and unharmed, after being picked up by a Thranta Rider. Later, Tenel Ka, Jacen, Jaina, Zekk, and Lowbacca helped Anja with her drug addiction and destroyed Black Sun once and for all on Kessel and Mon Calamari. After the defeat of Black Sun, Tenel Ka, Jacen, Jaina, Zekk, Raynar, Anakin Solo, and Lowbacca graduated from the Jedi academy."}, {"tag": "h3", "text": "Yuuzhan Vong War (25 ABY–29 ABY)"}, {"tag": "h4", "text": "The invasion begins"}, {"tag": "p", "text": "During the beginning of the Yuuzhan Vong War, Tenel Ka continued aiding her mother and father navigate through the Hapan intrigue against her grandmother. She was also present during multiple Jedi meetings concerning the invasion of the Yuuzhan Vong, including the one about the Yuuzhan Vong priestess Elan, who turned out to be a fraud. She was present on Hapes when Isolder won the honor duel that sent the Hapan Royal Navy to the doomed Battle of Fondor. After that, she and the Rodian Jedi Jovan Drark went on a spying mission to Bilbringi."}, {"tag": "p", "text": "As the war dragged on, Tenel Ka was once again reunited with her old friends: Jacen, Jaina, Lowbacca, Zekk, and Raynar, as well as two new friends, Anakin Solo and Tahiri Veila. Two years into the war, Tenel Ka and her friends discovered that their old friend, Lusa, had been killed by the Yuuzhan Vong Jedi-killing beasts, voxyn. Soon after the death of Lusa, Tenel Ka accompanied her friends to the Battle of Froz, where she manned the group's sensor platforms with Lowie, Ulaha Kore and Raynar. She was a key figure in the battle, which ended in their victory. Also, the group strengthened their battle meld, which would later be put to the test during the Mission to Myrkr weeks later."}, {"tag": "h4", "text": "Death of a friend"}, {"tag": "p", "text": "In 27 ABY, the Yuuzhan Vong created the Jedi-killing voxyn, and Tenel Ka, along with Jacen, Jaina, and her old academy friends, traveled from planet to planet to collect voxyn corpses for Jedi Scientist/Healer, Cilghal. Cilghal then determined that the location of the voxyn was on the planet Myrkr, or rather, the Yuuzhan Vong worldship orbiting above it. Along with her old friends, Tenel Ka elected to be a member of a Jedi strike team to infiltrate the worldship and destroy the Voxyn queen, for all the voxyn were clones. The mission was to be led by Luke Skywalker himself, though Tenel Ka pointed out that if he were to lead the mission, he would doom them all. She explained that Luke would be killed by the Yuuzhan Vong the moment they were captured (For the Strike Team planned to turn themselves over to the Vong before taking over the Yuuzhan Vong ship). Tenel Ka stated that the strike team needed to consist of Jedi with whom the Yuuzhan Vong would take for granted. Anakin Solo then took control of the strike team, and the seventeen members of the strike team began making preparations."}, {"tag": "p", "text": "The strike team was turned over to the Yuuzhan Vong by Lando Calrissian upon the request of Leia Organa Solo, and Tenel Ka and the others were brought on board the Exquisite Death, led by Duman Yaght. Along with the other Jedi, Tenel Ka was tortured in an attempt for the Yuuzhan Vong to learn of the Jedi's secret base, though the Jedi were able to keep quiet. Tenel Ka managed to resist the torture, and her resistance was later admired by Yuuzhan Vong warrior Khalee Lah.\nTenel Ka and the other Jedi soon escaped imprisonment and took over the ship, killing Duman Yaght in the process, though Jedi Knight Ulaha Kore was wounded in the process. While waiting for the Yuuzhan Vong ship to arrive at Myrkr, Tenel Ka helped Jacen patch up the rift between him and his brother, Anakin. After crash landing on the worldship, Baanu Rass, when the Yuuzhan Vong attacked them, Tenel Ka and the strike team unintentionally rescued a pair of Dark Jedi from Yuuzhan Vong captivity. The Dark Jedi, Lomi Plo and Welk, were allowed to stay with the strike team, though in the near future it would not bode well for the Jedi."}, {"tag": "p", "text": "The strike team, now followed by a squad of Yuuzhan Vong warriors led by Executor Nom Anor, prepared to set up an ambush for the Yuuzhan Vong. Tenel Ka and the other Jedi trapped the warriors and managed to kill many, though Nom Anor was able to escape. While journeying through the slave dens, the Jedi were then ambushed by Nom Anor and his forces, and during the battle, Jovan Drark was mortally wounded and Tenel Ka brought him to the healer, Tekli, though the Rodian was too far gone. When all hope seemed lost, Tenel Ka and the Jedi discovered the ship, Tachyon Flier, a possible rescue ship. However, the Dark Jedi stole the shuttle with a wounded Raynar Thul and defenseless Em Teedee aboard. When Alema Rar stated that she wished the shuttle would be destroyed by the Yuuzhan Vong, Tenel Ka pointed out the horrible truth that their friend was still aboard."}, {"tag": "p", "text": "When Anakin later sacrificed himself to save the strike team and Jaina blamed Jacen for his death, Tenel Ka jumped to his aid. Tenel Ka stated that Jacen did nothing wrong and did not deserve Jaina's blame, though she was rebuked by Jaina, who claimed Tenel Ka had the emotional depth of a ronto. The two were both angered at each other, though Zekk stopped any fight that would occur."}, {"tag": "p", "text": "The team then split up into two groups, and Tenel Ka went with Jacen and some others to continue on with the mission while Jaina, Zekk, and some others went to claim Anakin's body. They were approached by Vergere, a mysterious Fosh whose loyalty was unpredictable. Tenel Ka did not trust Vergere, but was forced to cooperate with her when the bird agreed to help them kill the Voxyn Queen. They then ran into Jaina's team, who had found a ship to take them to safety, and Tenel Ka and the others helped her secure it while Jacen went off to kill the Voxyn Queen. Tenel Ka attempted to kiss him before he left, but was cut off by Vergere."}, {"tag": "p", "text": "After securing the vessel, Tenel Ka was shocked to see Jacen captured and at the mercy of Vergere and Nom Anor. The strike team was forced to leave, and Tenel Ka realized that it was better for Jacen if they flee, since the Yuuzhan Vong would not kill him unless they had Jaina too, since they were obsessed with twins."}, {"tag": "h4", "text": "Becoming Queen Mother"}, {"tag": "p", "text": "With the success of the mission, the remaining strike team members plotted a course to Coruscant, only to arrive to witness the Yuuzhan Vong's conquest there. Being pursued by New Republic ships, Tenel Ka and the others decided that with Coruscant fallen, they needed another safe haven to put the ship down, and the group settled on Hapes. Jaina then performed the Solo Slingshot, a space maneavour created by Han Solo, to convince her parents of the Jedi's presence on the ship and have them follow them to Hapes. Tenel Ka was sent ahead in an escape pod to inform her parents and grandmother of their arrival. While in the escape pod, she apparently felt Jacen's death through the Force, and after breaking down, she realized she had loved Jacen."}, {"tag": "p", "text": "On route to Hapes, her escape pod was intercepted by Hapan pirates wearing the colors of the Ni'Korish. Because they resented the fact that Tenel Ka shunned her Hapan heritage and that she was a Jedi trainee, they opened fire on her once she was on board their craft. She used her Force abilities to defeat them, but she let them live as she decided murder was not the way of the Jedi."}, {"tag": "p", "text": "On Hapes, Tenel Ka was greeted by her father, and saved him from an assassination attempt by his cousin. Shortly afterward, she went to pay a visit to her ailing mother, who gave her an emerald ring with instruction to pass it on to the next Queen Mother."}, {"tag": "p", "text": "Tenel Ka then attended the funeral of Anakin Solo and watched Jaina fall to the dark side. Noticing that Ta'a Chume paid more attention to Jaina Solo than she did to her heir, Tenel Ka deduced that Ta'a Chume was plotting to replace Teneniel Djo with Jaina. However, she was too late in preventing Ta'a Chume's Ni'Korish assassins from poisoning her mother."}, {"tag": "p", "text": "Even though she hated everything the position stood for, and was still mourning for Jacen and her mother, Tenel Ka was crowned Queen Mother of Hapes by her father, very much to Ta'a Chume's disappointment. Tenel Ka placed her grandmother under arrest for her part in the murder of Teneniel Djo, and pledged the support of the Hapan government and military to the fight against the Yuuzhan Vong. The emerald ring given to her earlier by her mother was actually a holochip showing the location of a rebuilt Hapan fleet. Tenel Ka placed this fleet under the command of Jagged Fel, and the Hapan fleet scored a victory at the Battle of Hapes."}, {"tag": "p", "text": "During Jaina Solo's daring assault on the Supreme Overlord's fleet in 28 ABY, Queen Mother Tenel Ka led a squadron of Hapan ships to aid her. They succeeded—only to learn that the ship did not hold the Supreme Overlord at all. Soon after, she learned that Jacen Solo had survived his capture with the Yuuzhan Vong, although it is unknown if they spoke to one another around this time. She was later one of the Jedi that was knighted in a ceremony on Mon Calamari and took part in the battle above Ebaq 9."}, {"tag": "p", "text": "Later, Tenel Ka grew more into the politics that came with being Queen Mother. She became a high ranking official in the Galactic Alliance, and her fleet became more active in the war, aiding the Galactic Alliance in many battles. She was one of the people in Cal Omas's inner circle that opposed the use of Alpha Red. Tenel Ka was, at some point, named a Jedi Knight by Skywalker along with the other strike team survivors."}, {"tag": "p", "text": "Close to the end of the Yuuzhan Vong war, Tenel Ka joined forces with Lando Calrissian and others to defend Zonama Sekot from the Yuuzhan Vong, and succeeded in repelling the invaders. After the war was over, Tenel Ka was one of the Jedi that went to Zonama Sekot for Luke Skywalker's meeting, then returned to Hapes to continue on as Queen Mother."}, {"tag": "h3", "text": "Dark Nest Crisis (35 ABY–36 ABY)"}, {"tag": "h4", "text": "New responsibilities"}, {"tag": "p", "text": "In 35 ABY, Jacen Solo returned from his five year journey of wandering the Galaxy, and visited Tenel Ka. He had recently learned about the Dark Nest Crisis, and asked Tenel Ka about sending a fleet to guard the Killiks while the Jedi tried to find a way to deal with the Chiss. Jacen and the Strike Team had gone to the Unknown Regions when Raynar Thul had called them. Tenel Ka said that she had to lock herself in the Palace to stay on Hapes. She kissed him then, and told him that if he stayed the night, his chances on getting the Fleet would increase. The end result was that the Killiks got their fleet—and Tenel Ka became pregnant."}, {"tag": "p", "text": "Tenel Ka assigned Dukat Aleson Gray, of the Relephon Moon and her ninth cousin, to command the Hapan Fleet, and he used the Kendall as his flagship. The Hapan Fleet was to be used as reinforcements only, and to buy the Jedi time to solve the border dispute. Furthermore, Tenel Ka refused to listen to Chief of State Cal Omas, who wished her to recall her fleet. This would then prompt the Chief of State in pleading with Han Solo and Leia Organa Solo and Luke Skywalker to convince Tenel Ka to recall her fleet, though they refused. Under Gray's command, the Hapans began a battle with the Chiss over rescuing Luke and Mara Jade Skywalker on Gorog's base, Kr."}, {"tag": "p", "text": "Throughout the next year, Tenel Ka would have many secret and secure HoloNet discussions with Jacen, the two finally admitting their love for one another. However, their relationship remained a secret and Tenel Ka chose not to reveal that he had impregnated her over the HoloNet. In order to throw off her suspicious nobles of the father of her baby, Tenel Ka prolonged her pregnancy through the Force, slowing down the development process. Though it fooled many, it did not fool Tenel Ka's grandmother, Ta'a Chume."}, {"tag": "h4", "text": "Leaving the Jedi Order (36 ABY)"}, {"tag": "p", "text": "In 36 ABY, she gave birth to Jacen's daughter, Allana. To protect Allana from the wrath of the Hapan nobles, she refused to reveal the identity of Allana's father and led the nobles to believe that one of them possibly fathered her. Tenel Ka also refused to release any holos of the child to the public. Tenel Ka remained hidden in seclusion for months before the child's birth, the knowledge of Allana's birth and their location a secret from everyone."}, {"tag": "p", "text": "One week after Allana's birth, Jacen, Tenel Ka, and Allana were attacked by agents of the Dark Nest acting on Ta'a Chume's behalf. The Dark Nest were angry with Tenel Ka's involvement with the Killik/Chiss border dispute a year ago. During the attack, Tenel Ka was thrown against a wall by Ben Skywalker in an impressive display of Force power on the untrained Force user's part. Tenel Ka then woke up and helped Jacen defend Allana from the Killiks. Because Ben accidentally found out about Allana's paternity, Jacen erased Ben's memory of the incident rather forcefully, which disturbed Tenel Ka. Jacen then focused most of his energy into protecting her and their baby from the Killiks, going so far as to render Ta'a Chume comatose and lead a preemptive strike against the Chiss. However, even though Allana was safe, Tenel Ka was greatly disturbed by Jacen's startling behavior."}, {"tag": "p", "text": "Later that year, when Luke Skywalker ordered a Jedi convocation on Ossus, she resigned from the New Jedi Order. She was heartbroken to do so, but her duties as Queen Mother affected her duties as Jedi Knight too much. She also could not leave the Hapan people, in fear that a horrible ruler like her grandmother would take the throne. Following the ancient Jedi tradition, Tenel Ka tried to give back her lightsaber, but Luke Skywalker urged her to keep it, saying that there would always be a place for Tenel Ka if she changed her mind."}, {"tag": "p", "text": "Tenel Ka was touched by Luke's gesture, and he said that she carried inside her everything a Jedi symbolized, and that they would all miss her. She also said that one day in the future she may be able to become a Jedi once again, and that she'd miss everyone greatly. Han Solo and Leia Organa Solo, who were in the room at the time, attempted to cheer the Hapan up by planning on visiting Hapes every so often to see Allana, but it only agitated Tenel Ka more, since she knew that Leia would be able to sense the bond that linked them. Tenel Ka tensed up at the mention of her daughter, which Han and Leia found suspicious. Tenel Ka then returned to Hapes to navigate her way throughout the political intrigue."}, {"tag": "h3", "text": "Second Galactic Civil War (40 ABY–41 ABY)"}, {"tag": "h4", "text": "A betrayed love"}, {"tag": "p", "text": "During the tumultuous days of the Second Galactic Civil War, Jacen Solo betrayed the Jedi, Tenel Ka and Allana when he decided to secretly train as a Sith Lord under the Dark Lady of the Sith, Lumiya. He did so to keep Allana safe, and a few weeks after making the choice, Lumiya told Jacen Solo that he must sacrifice something greater than his public image if he wanted to be fully embraced as a Sith. Jacen wondered if his sacrifice would have to be killing Tenel Ka and Allana, the two people he loved most."}, {"tag": "p", "text": "During the struggle, Tenel Ka and Allana were also marked for death by the Corellian leadership as part of a plan to draw the Hapes Consortium into the war on the side of Corellia. Its Head of State, Dur Gejjen, was in desperate need of allies since many worlds refused to join them openly. Gejjen requested a meeting with Tenel Ka in regards of her allegiance, and she denied him without hesitation. She also assigned the Galactic Alliance Supreme Commander Gilad Pellaeon two battalions of Hapan Battle Dragons. The Corellians, unable to give up on their allegiance with Hapes, devised a plan to assassinate Tenel Ka and Allana and place a pro-Corellian Queen Mother in her place. Gejjen then contacted Han and Leia Solo, with Han openly supporting Corellia. He deceived them, making them believe that Tenel Ka had agreed to a meeting and was considering switching sides, and that Han and Leia were to go and act as Corellian delegates. In fact, they were being used to draw Tenel Ka out in the open for their plan to work."}, {"tag": "p", "text": "Han and Leia Organa Solo discovered the plot when Tenel Ka placed them in a waiting room since it was the day of the Queen's Pageant. Despite being allied to the Corellians, they did not approve of the assassination plan and sought to rescue their old friend and her daughter. They managed to convince the assassin, Jedi-killer Aurra Sing that they were working for Gejjen, and after purposefully foiling the attempt, escaped the palace with Sing to discover who was behind the plot. Jaina Solo and Zekk arrived too late to warn Tenel Ka, and Tenel Ka informed them that they may have been involved in the assassination plot, but that she was not sure. She then requested that they travel throughout the Hapan system and rally support and fleets from her nobles that she could trust."}, {"tag": "p", "text": "Tenel Ka then contacted Jacen Solo to help her and her daughter. Tenel Ka believed that the assassination attempts would continue. She interrogated multiple witnesses and kept them in the Well, a secret chamber. She soon found them murdered, and realized that the plot ran deep into her inner circle. When Jacen arrived in his Star Destroyer the Anakin Solo, Tenel Ka requested that Allana stay aboard with him. They shared a brief moment together before Jacen placed an arrest warrant on his parents."}, {"tag": "p", "text": "Luke Skywalker and Mara Jade Skywalker soon arrived in search of their son Ben, and also to give Tenel Ka a transmission from Han and Leia, which revealed their innocence in the plot and what had happened with Gejjen. They also informed her that Aurra Sing was after Allana, and that Ducha AlGray was a traitor and a head in the coup government, Heritage Council. Tenel Ka then asked Jacen to scrap the warrant on his parents, though he refused, saying they were still in league with Corellia before the assassination attempt on Hapes."}, {"tag": "p", "text": "Tenel Ka then geared up for a battle, and prepared all of her fleets and took position over Hapes on her personal Battle Dragon, Dragon Queen. They were soon attacked by the AlGray fleet, as well as the Corellian fleet which contained two Corellian Dreadnaughts. During the battle, Jaina and Zekk arrived to reveal that Ducha Galney was a traitorous noble. When Galney's fleet arrived, Tenel Ka knew they were against her. Meanwhile, Han and Leia had arrived and had picked up Jaina and Zekk and Ben Skywalker and a Galactic Alliance Guard operative after their ship had exploded. Jacen saw their ship and opened fire on it, though they were able to escape."}, {"tag": "p", "text": "The tide of the battle turned when Galactic Alliance admiral Nek Bwua'tu arrived and hammered the Corellian fleet. The battle turned in Tenel Ka's favor, and the Corellians were forced to flee. However, the Heritage Council leaders besides Galney and AlGray did escape, and later joined the Confederation. Tenel Ka was then informed of Jacen's actions against his parents and was stunned, but decided to give him the benefit of the doubt. However, as Tenel Ka spoke with Jacen after the crisis abated, she became increasingly aware how much darker his personality was becoming."}, {"tag": "h4", "text": "Wavering loyalties"}, {"tag": "p", "text": "Some months after the failed assassination attempt, Jacen visited Tenel Ka and Allana yet again, just after his appointment of joint Chief of State of the Galactic Alliance. He had vowed never to kill them for his Sith sacrifice, but he still was not sure. His trip there was to make sure they were not his destined sacrifices. After a close family moment, Tenel Ka accompanied him as he set out, where she expressed her concern on the coup. She disapproved of it, but wished Jacen luck in handling the job and the war."}, {"tag": "p", "text": "A day after, Tenel Ka was greeted by Luke Skywalker and Jaina Solo, who informed her that they had felt Mara Jade Skywalker's death through the Force. Tenel Ka ordered the search for Mara within the Hapan system, and her body was soon found on Kavan, in the Hapes Cluster. Tenel Ka allowed the group, which now consisted of Luke, Jaina, Han and Leia Solo, and Ben Skywalker, to stay in the Fountain Palace to grieve. She then ordered the investigation of who killed Mara within the Hapan system. Tenel Ka was disturbed that Jacen did not show up to give his sorrow and mourn with his family, and she had no idea that he was the one who killed Mara and declared himself Darth Caedus."}, {"tag": "p", "text": "Over the course of the next week, Tenel Ka had assigned every Hapan fleet besides the Home Fleet to Alliance command under the request of Admiral Cha Niathal. When she traveled to Coruscant to attend the funeral of Mara Jade Skywalker, she attempted to contact Luke to give her regards to her old friend, though she was turned away by Saba Sebatyne on Luke's request, as he turned down everyone looking to see him. She began to fear he was withdrawing in on himself, but continued her plans on going to the funeral. After sending her Lady in Waiting, Lady Aros to lock down the nursery after sensing a disturbance in the Force within her own suite, she was greeted by Jacen Solo. They shared an intimate embrace before Tenel Ka asked him how he was handling Mara's death. He brushed the topic aside quickly, leaving Tenel Ka a little puzzled, and they discussed Luke's withdrawn state, and how any of Jacen's attempts to make peace with the Jedi would be thwarted in fear of Jacen trying to take over the Jedi."}, {"tag": "p", "text": "It was then that Jacen shared his shocking vision to Tenel Ka: That if the Confederation forces won the upcoming battle at Kuat, then they would be able to make a push to Coruscant and win the war. He informed her that he did not have the forces to crush the Confederation, with the Jedi refusing to cooperate and the Kashyyyk forces squabbling over whether or not they should give the Galactic Alliance their fleet. He then asked her to give him the Home Fleet, which Tenel Ka instantly refused to do since it would leave her and Allana open to attack from her nobles. Jacen then linked the Galactic Alliance's fate with Tenel Ka and Allana, claiming that the Confederation would kill them and tear the Consortium apart. Tenel Ka then reluctantly decided to give him the fleet, but only if he made peace with Luke. Jacen reluctantly agreed, and the two spent the night together."}, {"tag": "p", "text": "Tenel Ka then attended Mara Jade's funeral along with old friends from the Mission to Myrkr and other Galactic Alliance dignitaries. There, Tenel Ka attended as a Jedi, and was allowed to meditate with her former friends at the funeral. During the funeral in which Saba Sebatyne was giving the eulogy, Jacen arrived to stand with Luke, with whom he agreed to make peace with. Tenel Ka then agreed to send him the Home Fleet, leaving herself and Allana without defense in hopes that Jacen could end the war and the threat on their lives like he promised."}, {"tag": "h4", "text": "Against Darth Caedus"}, {"tag": "p", "text": "Weeks later, Tenel Ka began hearing reports of Jacen holding the Jedi academy on Ossus hostage and sending Ben Skywalker to assassinate Cal Omas. Once the Jedi refused to cooperate with Jacen anymore and left the Galactic Alliance, Jacen had tracked them to Kashyyyk and Tenel Ka was told that he was burning the planet to the ground. She was heartbroken to hear that, and refused to believe it unless she was given proof."}, {"tag": "p", "text": "Days later, Han and Leia Solo arrived on Hapes and were attacked by Tenel Ka's old friend, Tahiri Veila, who was under Jacen's orders to arrest his parents. Tahiri and Leia engaged in an all-out brawl, with Leia the victor. Han managed to convince Leia not to kill Tahiri, and Tenel Ka stopped Tahiri from arresting them. When Tahiri informed Tenel Ka that Jacen had issued a warrant on them, she reminded her old friend that the Galactic Alliance and especially Jacen had no authority in the Hapes Consortium. Tahiri was furious, and Tenel Ka confiscated her StealthX and sent her back to Jacen as a message that his meddling in Hapan affairs would not be tolerated."}, {"tag": "p", "text": "Han and Leia then informed Tenel Ka that her reports were true; that Jacen had abandoned the defense of Kuat and chased the Jedi to Kashyyyk, where he was burning the planet. Tenel Ka was devastated, and couldn't believe that Jacen had left her and Allana undefended to attack the peaceful planet of Kashyyyk, homeworld of their friend Lowbacca; that he had lied about ending the war, but was prolonging it. It was then that she made the decision to turn away from Jacen, and that she could not follow his dark path any longer. She recognized him for what he truly was: evil. And with that, Tenel Ka, in the company of Han and Leia, set out to Kuat to collect her Home Fleet."}, {"tag": "p", "text": "After collecting the Home Fleet, Tenel Ka and the Solos arrived on Kashyyyk, where Tenel Ka witnessed the devastation that was taking place. She couldn't believe that Jacen would go to such lengths for revenge. Jacen's fleet was being pounded by the Confederation forces, and he was continuing to order his ship to burn the Kashyyyk forests. Tenel Ka then opened a channel to Jacen, who mistook her arrival as helping him. She then asked for his formal surrender, which he refused."}, {"tag": "p", "text": "He was shocked at what he was hearing, and even requested to know if he was hallucinating. When she demanded to know his reasons for his past actions, he attempted to lie to her though she saw through them without hesitation. Tenel Ka then informed him that she would send a skiff over to collect him, though he refused one. He then blamed her for cowardice, though Han and Leia said she was being even stronger to turn against him. Jacen blamed his parents for her betrayal, though Tenel Ka assured him the choice was hers. She opened her heart for his touch, and where he once felt love was replaced by anger and disappointment. When he refused to surrender once more and the connection ended, Tenel Ka was forced to fire on the father of her child; her one true love."}, {"tag": "p", "text": "Jacen was able to escape Tenel Ka's barrage when the Bothans made a huge critical error due to the Dark Jedi Alema Rar and the work of her Sith Meditation Sphere. She then held a parlay on the Dragon Queen, where she announced that she was withdrawing her fleets from Alliance command, but that she still full heartedly supported the Galactic Alliance. When asked how, Tenel Ka replied that Jacen Solo was not the Galactic Alliance, and that he had turned it into something more of an Empire. Tenel Ka also allied the Hapes Consortium with the Jedi and Wookiees in the Jedi Coalition."}, {"tag": "p", "text": "Days later, Caedus, angered and heartbroken by Tenel Ka turning against him, swore to kill Tenel Ka if she stood between him and Allana. He also kidnapped Allana to try to force Tenel Ka to once again support him, leaving her a message that he would kill Allana if she did not give him military support once again. The threat toward Allana, however, was untrue, but Tenel Ka didn't know that. Still, during the attempt, Tenel Ka sensed a disturbance in the Force, and located Jacen's presence. Using Force speed, she rushed throughout the Palace and saw multiple bodies of her aides, and she was shocked that Jacen would murder innocent people."}, {"tag": "p", "text": "She made it to her private hangar, where she watched Jacen board Tahiri Veila's StealthX with Allana. She locked gazes with Jacen, and saw nothing but coldness. Before she could do anything, the Galactic Alliance ship Jacen had flown in on exploded behind her, knocking her unconscious. When she woke up, she watched a transmission left behind by Jacen that lied if she did not bring her fleets back under Galactic Alliance command, he would kill Allana."}, {"tag": "p", "text": "Tenel Ka, being a trusted friend among the Jedi, was given the location of their new Jedi base on Endor, and traveled there where she met with Luke, Saba Sebatyne, and multiple other Masters in the forests. She informed them that the reason she cut off ties with the galaxy was because Jacen had kidnapped Allana. Luke offered to rescue Allana, and Tenel Ka accepted, relieving some of her stress."}, {"tag": "p", "text": "Days later, Luke led a strike team to the Anakin Solo, and the team's mission resulted in Allana's rescue by Han and Leia Solo and return to Tenel Ka. Han and Leia discovered their connection to Allana, and the secret that Tenel Ka had kept for years was finally out."}, {"tag": "p", "text": "A week after getting her daughter back, Tenel Ka was approached by Han and Leia, who requested that they be able to relocate the Jedi in the Transitory Mists. Tenel Ka agreed, and the Jedi took refuge on Hapes a few weeks later."}, {"tag": "h4", "text": "The final battles"}, {"tag": "p", "text": "Weeks after giving the Jedi their base, Tenel Ka sent her close cousins Taryn and Trista Zel to collect Ben Skywalker, who had escaped imprisonment from Caedus' new Sith apprentice, Tahiri Veila. They were to bring Ben to her father, Prince Isolder, and he would bring him to the Jedi base on Shedu Maad. Her father, however was kidnapped by Jacen, and her intelligence reports announced that his fleets were moving towards the Transitory Mists, obviously aware of the Jedi base located in there."}, {"tag": "p", "text": "Along with Allana, Tenel Ka traveled to Shedu Maad, where she warned Luke Skywalker of Jacen's impending presence. When asked how Caedus knew the location of the Jedi base, Tenel Ka noticed that Jaina, who had fought Jacen weeks earlier, had his blood imprinted on her and she realized that Caedus had used the Nightsister's blood trail. She then refused to leave for safety, and prepared to help the Jedi in their upcoming battle with Caedus. When asked by Ben how one would go about redeeming another, Tenel Ka mistakenly thought he was referring to Caedus and expressed her belief that Caedus did not want to be redeemed. Realizing this, Tenel Ka stood firm to stop him instead of bringing him in. Tenel Ka's Hapan Home Fleet then attacked Caedus's fleet, along with his ally, the Imperial Remnant."}, {"tag": "p", "text": "Caedus and his Imperial allies tracked the Jedi to Shedu Maad, where they opened fire on the Jedi fleet while Tahiri Veila led Imperial forces to the Jedi base on the planet below. While the Jedi were defending their planet, Tenel Ka lost another close friend, Zekk, who was shot down and went missing during the battle. Tenel Ka then led her Hapan fleet into the fray and cornered the Imperial forces, destroying their fleet."}, {"tag": "p", "text": "During the battle, her capital ship, the Dragon Queen, was attacked with an Imperial nanovirus that targeted the blood of the Hapan Royal family. The blood had been taken from Prince Isolder during his captivity on the Anakin Solo shortly before Caedus killed him. Tenel Ka, unknowing of the existence of the nanovirus, allowed for an Imperial ship to land in her flagship, though it was that ship that carried the virus."}, {"tag": "p", "text": "Just before the nanovirus was released, however, Tenel Ka felt Jacen—not Caedus—screaming at her in the Force to protect Allana, and she was able to escape with her daughter from the nanovirus. Her escape was unknown to her subjects during the heat of the battle, and Taryn and Trista feared her dead while they battled the Imperials on Shedu Maad. Furthermore, there was an attempt by Ducha Requud to take over the throne, along with Commander Livette."}, {"tag": "p", "text": "However, she realized the awful truth that Jacen had been killed in a lightsaber duel with his sister, Jaina Solo, and that the Hapan life was too dangerous for Allana. Tenel Ka proclaimed her daughter dead, killed by the nanovirus, and secretly requested that Han and Leia Solo raise her daughter at the Jedi academy. With that, Tenel Ka gave up her daughter, ensuring her safety."}, {"tag": "h3", "text": "Political intrigue (41 ABY–44 ABY)"}, {"tag": "p", "text": "After the appointment of former Imperial Admiral Natasi Daala as the Galactic Alliance's new Chief of State, tensions between the Galactic Alliance and Jedi Order rose. Due to this, Tenel Ka allowed the Jedi to permanently move their Jedi base to Shedu Maad. Also, Allana's adventurous nature was interfering with her education at the Jedi Academy, and Tenel Ka requested that she travel personally with Han and Leia Solo instead of living at the Academy."}, {"tag": "p", "text": "The threat of the Imperial Remnant continued, however, and due to this, Tenel Ka refused to rejoin the Galactic Alliance. As of 43 ABY, Tenel Ka had yet to reenter Hapes into the Galactic Alliance. When young Jedi Knights began to fall ill to a strange dementia and were used as political tools against the Jedi by Chief of State Daala, the Jedi Council decided that they could no longer keep their ill Jedi on Coruscant."}, {"tag": "p", "text": "They then requested that Han and Leia Solo ask Tenel Ka to allow them to bring the crazed Jedi to the Jedi Enclave on Shedu Maad, which she agreed to. Tenel Ka also made a request of her own to the Solos, that they bring Allana with them in order for her daughter to experience the world to one day fulfill the role of Queen Mother."}, {"tag": "h4", "text": "Sith resurgence"}, {"tag": "p", "text": "In 44 ABY, following the successful Jedi coup against Daala that ousted her as the GA's Chief of State, Tenel Ka was called to the world of Klatooine by the Solos. There, she was to help settle the deal that would officially and legally allow Klatooine to leave the tyranny of the Hutt Empire and become an official member in the Galactic Alliance's body. The situation on Klatooine gave Tenel Ka an opportunity to see her daughter again; unfortunately, her escort fleet had been trailed by members of the Lost Tribe of Sith, led by Sith Saber Querdan Dei. Dei concocted a plan that involved kidnapping Allana's guardian protocol droid, C-3PO, and planting a bomb in him set to go off near Tenel Ka at a rally."}, {"tag": "p", "text": "This assassination attempt on Tenel Ka's life was due to the fact that one of the Lost Tribe's late High Lords, Sarasu Taalon, had foreseen a Jedi queen who would bring peace and balance to the galaxy and therefore presented a threat to the Sith's plans for galactic conquest, and that the Sith had identified the future queen as Tenel Ka's offspring. However, Allana prevented this plot and Leia killed Dei to make sure the Sith failed to kill Tenel Ka."}, {"tag": "p", "text": "Following the success of Klatooine's freedom from the Hutts, Tenel Ka never had the chance to give Allana a parting goodbye before her escort whisked her back to Hapes."}, {"tag": "p", "text": "Tenel Ka would once again encounter the Lost Tribe after they took control of Coruscant. Tenel Ka used the excuse of a training exercise to lend a portion of the Hapan fleet to help aid the Jedi and Han and Leia evacuate the Jedi Academy on Ossus. This also gave Tenel Ka an opportunity to spend time with her daughter, who stayed aboard the Dragon Queen II with her while Han and Leia led the evacuation."}, {"tag": "p", "text": "As the evacuation began, Tenel Ka witnessed her daughter undergo a Force vision, and though Allana refused to tell her mother what the vision contained - expressing her desire to keep a promise to old friends - she made a point to tell her mother she needed to talk to Saba Sebatyne. Tenel Ka promised to help Allana, but after the evacuation was successful."}, {"tag": "p", "text": "At first the evacuation went as planned - Han and Leia, along with Kam and Tionne Solusar broke through the Sith attack to land their students on Tenel Ka's flagship. However, it was noted that one ship, before landing on the Dragon Queen II, had been overrun by Sith and attempted to board. However, Tenel Ka, the Solos, and the Solusars were not duped and refused to let the ship land, with the Sith retaliating by killing all those aboard."}, {"tag": "p", "text": "Despite the loss, the evacuation proved successful and Tenel Ka was given custody of Allana, with Han and Leia returning to Coruscant to warn Saba Sebatyne of Allana's vision. However, Allana disobeyed orders and sneaked aboard the Millennium Falcon, prompting Tenel Ka to send Taryn Zel and Zekk - both members, along with Trista Zel of the newly founded Lorellian Court - to keep her safe."}, {"tag": "p", "text": "After the war with the Sith and their ally Abeloth ended in the Jedi's favor, Tenel Ka had her flagship play host to the wedding of long time friend Jaina Solo and Jagged Fel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a child at the Jedi Praxeum, Tenel Ka was relatively humorless. Despite Jacen Solo's best efforts, he could hardly ever make her laugh. Tenel Ka was very serious, as well as stubborn when it came to daily physical routines. Due to her rigorous training exercises, Tenel Ka developed a rather lithe, muscular form and a proud persona. Tenel Ka preferred acting to debating, and had a very straight-to-the-point attitude, which led to her kissing Jacen after the demise of the Diversity Alliance. She was very confident in her abilities, and decided to use her physical attributes rather than the Force whenever possible. During a lightsaber training exercise, Tenel Ka lost her arm when her lightsaber malfunctioned due to her arrogance. She then refused a prosthetic limb as a reminder of what arrogance leads to. Losing her arm by Jacen Solo's hand did not pull the friends apart, but instead drew them closer. Tenel Ka believed Jacen guiltless, and harbored no hard feelings towards her best friend. However, despite the pair's attraction to each other, they never revealed their feelings for one another."}, {"tag": "p", "text": "During the Mission to Myrkr, Tenel Ka revealed her true feelings to Jacen when she attempted to kiss him, though she was cut off by Vergere. However, Jacen was soon captured by Vergere and taken as a prisoner of the Yuuzhan Vong. After feeling what she perceived to be Jacen's death, Tenel Ka let out a rush of angry emotions, as she realized just how strong her feelings were for him. Despite her anger however, Tenel Ka could not bring herself to kill the assassins that attacked her soon after she felt Jacen's death, for she was very in control of her emotions, which was a very gifted talent that proved worthy when she was forced to become Queen Mother. A year later, Jacen was found alive, though Tenel Ka was too busy with her duties as Queen Mother to start a relationship. During the Swarm War, Tenel Ka admitted to Jacen her feelings for him and the two conceived their daughter Allana."}, {"tag": "p", "text": "At the time of the Second Galactic Civil War, Tenel Ka remained allied to Jacen and the Galactic Alliance. However, when she witnessed firsthand how far Jacen had descended to the dark side and was manipulating her at Kashyyyk, Tenel Ka's love for him was soon replaced by shock and disappointment. When Tenel Ka's pleas for Jacen to renounce his dark path were ignored, she assailed his ship to halt his brutal methods. Realizing the Jacen she had loved was gone and replaced by the Sith Lord Darth Caedus, Tenel Ka withdrew all Hapan support from the Galactic Alliance. After Caedus had kidnapped and taken Allana hostage, Tenel Ka's animosity towards him deepened into loathing. The revelation that Jacen was Mara Jade Skywalker's murderer along with Caedus imprinting Jaina with a blood trail made Tenel Ka give up all hope of redeeming her former love back into the light side and decided to send Allana into the custody of the Jedi for protection."}, {"tag": "p", "text": "After becoming the Queen Mother, Tenel Ka had to sacrifice many of her beliefs and ideals, and adapt them to the Hapan way. No longer the Dathomiri warrior on the outside, Tenel Ka had to become colder and more demanding as a person, a personality fitting for the Queen Mother. She also became more analytical and intricate, and took pleasure in throwing off her nobles and playing games to discover which were loyal to her and which just wished to become her paramour. For example, Tenel Ka's sense of humor had never been ideal, as said by Jacen Solo, and it was a fact she was well aware of. And so when she told a joke, she knew that those who laughed wanted something from her, as opposed to those who did not."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Tenel Ka was created by Kevin J. Anderson and Rebecca Moesta in 1995. Her first appearance was in the couple's Young Jedi Knights series. With the start of the New Jedi Order series, Tenel Ka was absent except for a cameo in both of the Agents of Chaos novels by James Luceno. She would later take on a larger role in Troy Denning's The New Jedi Order: Star by Star, and Elaine Cunningham's The New Jedi Order: Dark Journey. Tenel Ka also appeared in The New Jedi Order: Destiny's Way and The New Jedi Order: The Unifying Force, both of which were minor roles."}, {"tag": "p", "text": "In the Dark Nest Trilogy by Troy Denning, Tenel Ka would be given a chapter in each novel, and though her appearances were few, she developed a major story arc as Jacen Solo's secret lover and the mother to their child, Allana. It was not until Star Wars: Legacy of the Force that Tenel Ka took on a major role, and would appear in five of the nine novels in the series. Tenel Ka finally appeared in Fate of the Jedi in the novel Fate of the Jedi: Conviction and later Fate of the Jedi: Apocalypse."}, {"tag": "h3", "text": "Role beyond the New Jedi Order"}, {"tag": "p", "text": "When asked on the Star Wars forums, Sue Rostoni commented on how she was saddened that Tenel Ka could not be included in the storyline more thoroughly.[source?]"}, {"tag": "p", "text": "It was later asked at the San Diego Comic Con in July 2009 Tenel Ka's involvement in Fate of the Jedi and though it was confirmed she'd appear, the authors had yet to decide whether or not she would obtain her own arc in the series. Ultimately, she did not."}, {"tag": "h3", "text": "Name"}, {"tag": "p", "text": "Tenel Ka is referred to as \"Tenel Ka\", although her full name is given as \"Tenel Ka Chume Ta' Djo\" in the Young Jedi Knights novels; this shows that she uses the Dathomiri surname \"Djo\", inherited from her mother Teneniel Djo and her great-grandmother Augwynne Djo. She prefers not to use the full name, however, and it is possible that Chume Ta' is not a proper personal name, but instead the Hapan royal title for the Queen Mother's eldest daughter: if this is so, then her full name would change when she becomes Queen Mother herself, probably to \"Tenel Ka Chume Djo\"."}, {"tag": "p", "text": "The only mentions of her simply being called \"Tenel\" are in her entry from The Essential Guide to Characters, Walter Jon Williams's Destiny's Way, Troy Denning's Apocalypse, and The Essential Reader's Companion where this form never appears in dialogue, but occurs in narrative prose in scenes told from the points of view of both Jaina Solo and Luke Skywalker. This suggests that Luke and Jaina may both think of Tenel Ka as \"Tenel\", although there is no evidence that they use the abbreviated form in speech."}, {"tag": "p", "text": "In The Complete Star Wars Encyclopedia, she is listed as \"Ka, Tenel\". Tenel Ka is then referred to as Ka, indicating that it is her last name, though this is not the case. It is the only instance in which her name is listed that way."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}