{"url": "Tenn_Graneet", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Humans", "Category:Imperial Navy personnel of the Galactic Empire", "Category:Males", "Category:Republic Navy personnel"], "nodes": [{"tag": "h1", "text": "Tenn Graneet"}, {"tag": "p", "text": "Tenn Graneet was a Human male Imperial gunner who was master chief gunnery officer in the Imperial Navy during the Galactic Civil War. In 0 BBY, Graneet was stationed aboard the Imperial-class Star Destroyer Steel Talon. He was killed on board the Death Star shortly afterwards during the Battle of Yavin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Graneet had served in the Navy for thirty years and had served in the Clone Wars as a gunner. Grannet was a lifelong military man, who enjoyed his career and was always eager to be placed in front of the largest gun available. At one point, Tenn sustained a muscular injury and, during the surgery, received a physical modification that increased the strength in his right arm by thirty percent. Tenn's nephew, Hora Graneet, was also a member of the Imperial Navy, and was killed onboard the Star Destroyer Battle Lance."}, {"tag": "p", "text": "As the Death Star neared completion, Graneet, being among those Imperial gunners who were the highest-ranking and best trained, was transferred to the superlaser gunnery crew. Graneet was initially thrilled with the new assignment, but as he familiarized himself with the new superweapon, he began to question whether any person was capable of wielding such power wisely. He rationalized his concerns with the mistaken belief that the Empire would not actually fire the weapon at full power on an inhabited planet, rather on uninhabited moons, planets, and other bodies. During the final months of construction, Graneet and his crew trained on a simulator of the main firing control chamber, familiarizing themselves with the firing sequence and working to shorten the firing sequence as much as possible. Graneet took pride in his abilities and his crew, and was glad to be the first to test the Death Star's superlaser."}, {"tag": "p", "text": "As the NCO IC of the superlaser's gunnery crew, it fell to Graneet to actually complete the firing sequence by pulling the firing lever. The first time he actually fired the weapon was against an old Lucrehulk-class battleship, Fortressa, that was being used by the Rebel Alliance. Even though the weapon was only at four percent power, it was more than enough to completely destroy the Rebel capital ship. Eventually he grew such a dislike of his job, he started to wonder about other possibilities, and stated that it was his dream to become a commander of a Super-class Star Destroyer."}, {"tag": "p", "text": "Graneet later fired the superlaser against the planet of Despayre. The destruction of Despayre took three shots to complete over the course of several hours. The first shot killed every living thing on the planet and cooked the surface of the planet. The second caused further tectonic stress to the planet, and the third shot finally blew the planet apart. After this, Graneet was highly shaken as he began to realize how much power the Death Star really had. He felt extremely guilty to have been the one to destroy Despayre, even though its main population had been that of convicted criminals. Later, Graneet was ordered to fire on the inhabited planet of Alderaan—killing nearly two billion sentients in the process."}, {"tag": "p", "text": "Following the destruction of Despayre and Alderaan, Graneet had a severe pang of conscience. Knowing that he had sent billions to their deaths, he soon came to see himself as the largest mass murderer in galactic history, and knew that if somehow the Rebel Alliance were to win the war, he would be tried and executed for his crimes. As news that it was Graneet who fired on Despayre and Alderaan spread throughout the Death Star's population, many of the people who Graneet encountered began reacting differently to him. He also seriously began to doubt if he would force himself to destroy another planet when ordered to, but worried that if he refused, someone else would simply pull the lever for him. He even began to doubt his own loyalty to the Empire, and began to hate them and himself for causing the death of so many innocent civilians."}, {"tag": "p", "text": "When given the order to fire the superlaser at the rebel base on Yavin 4, Graneet froze, wracked with guilt and wishing desperately for something to save him from his dreadful duty. In desperation, he informed his gunnery crew and the overbridge to \"stand by\" and then repeated his order a few seconds later, until his wish was granted, as his few moments of hesitation were sufficient to allow Luke Skywalker to destroy the Death Star. Graneet died in the resulting explosion. Incidentally, his hesitation also allowed the Rebels to eliminate not only a significant force of manpower and materials fielded by the Empire, but also some of the most achieved and capable of the Empire's officer corps, including Grand Moff Tarkin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The gunner that mans the superlaser in Star Wars: Episode IV A New Hope was identified in the Death Star novel as Master Chief Gunnery Officer Tenn Graneet. Contrary to the nature of the character's responsibility, Death Star portrays Graneet as a morally conflicted individual who hated his actions but found himself forced to carry them out."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}