{"url": "Temptor/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Amphibians", "Category:Creatures of Endor", "Category:Jungle and forest creatures", "Category:Predatory creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Temptor"}, {"tag": "p", "text": "Temptors were predatory, forest-dwelling amphibians native to Endor."}, {"tag": "p", "text": "Temptors got their name for using their long, \"furry\", lure-like tongues to draw their prey (small rodents, small birds, and other smaller forest animals) toward their powerful hidden jaws. Food was always abundant on Endor and the temptors usually ate rodents, birds and other small creatures."}, {"tag": "p", "text": "A temptor had pale, fleshy skin covered with thick mucus which allowed it to slither into tight spots and then strike prey in a flash after luring it with its tongue. One common prey of the temptor is the rugger."}, {"tag": "p", "text": "The tongue tip itself has pheromonal excretory pores and a nerve cluster."}, {"tag": "p", "text": "Even though it slithered almost like a snake, a temptor still had wide-splayed claws for assistance in anchoring itself to the ground or wherever it had accustomed itself to hide, such as in hollow logs or small caves. A temptor had excellent eyesight due to multiple eyes on its head."}, {"tag": "p", "text": "Temptors were, by 32 BBY, denizens of Gardulla the Hutt's pleasure garden, built within her Tatooine palace that was located near the Dune Sea. The garden housed many other predators as well, both plants and animals, that would, to Gardulla's untiring delight, pounce upon unwary passersby—captive beings that Gardulla constrained to enter the garden for her own and others' perverse entertainment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The temptor was recycled for Caravan of Courage from unused concept art for Return of the Jedi. It was originally slated to be called a tempter—just as the spelling (in error) exists in Dave Wolverton's Episode I Adventures 7: Capture Arawynne—with the only real difference between them being that the tempter was a rodent-like creature, and the temptor is reptilian. Wolverton's snake-like creations also bear 'powerful teeth'."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}