{"url": "Tendau_Nandon", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic members", "Category:Galactic Empire science and engineering personnel", "Category:Ithorians", "Category:Males", "Category:Spies", "Category:Xenobiologists"], "nodes": [{"tag": "h1", "text": "Tendau Nandon"}, {"tag": "p", "text": "Tendau Nandon was a male Ithorian who worked as a scientist for the Imperial Corps of Bioengineers until he joined the Alliance to Restore the Republic during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the war, Nandon was a close colleague of the female xenobiologist, Dusque Mistflier. Tendau developed a natural affinity towards Dusque and came to regard her as a close friend. Tendau's passion for nature and cosmic balance caused him to dislike his Imperial supervisors. Through time, he began to covertly work against their aims and sell important information to the Rebel Alliance."}, {"tag": "p", "text": "In 1 ABY, Tendau and Dusque attended the grand opening of the Aerie Casino in the city of Moenia on Naboo. During the festivities, Tendau made contact with a Rebel sympathizer named Mastivo. Shortly thereafter, Tendau and Dusque journeyed to Naboo's moon, Rori, on a scientific expedition. They examined several dank caves and encountered creatures such as the borgle bat and the tusk cat."}, {"tag": "p", "text": "Upon returning to Naboo, Tendau found himself surrounded by Imperial stormtroopers. They had discovered that Tendau was trading Imperial secrets to the Rebel Alliance. They took Tendau aside and executed him in front of a crowd of people. Aware of what fate had in store for him, Tendau accepted his death with grace and nobility."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tendau Nandon was a kind and gentle Ithorian with a massive respect for nature, apparent in that although he carried a CDEF blaster pistol sidearm, he was never truly comfortable carrying it. He was cognizant of what he perceived to be the cosmic balance, and strove to maintain the balance in his own meager way, lest chaos consume his lifestyle. It was this insight that inspired him to eventually betray his Imperial supervisors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}