{"url": "Tera_Sinube", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Cosian", "Category:Jedi High Council members", "Category:Lightsaber combat instructors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tera Sinube"}, {"tag": "p", "text": "Tera Sinube was a male Cosian Jedi Master who lived during the height and later descent of the Galactic Republic. Sinube was the marshal of a Jedi outpost on Derra during the High Republic Era, and sat on the Jedi High Council sometime before the Invasion of Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 231 BBY, Sinube had recently risen to the rank of Jedi Master, and was in charge of a Jedi Temple outpost on Derra. When the nearby planet Cyclor was attacked by the Nihil pirates, Master Stellan Gios contacted Sinube for assistance, and he dispatched the legendary Ikkrukkian Master Porter Engle to lead a drift of Jedi Vectors to assist."}, {"tag": "p", "text": "Decades before the Invasion of Naboo, Sinube was the leader of the Jedi youngling Hawkbat Clan, whose members included Zang Arraira, Arath Tarrex, Sifo-Dyas, and Dooku. While Dooku was still a Jedi youngling, Master Sinube traveled to Serenno along with Dooku, Sifo-Dyas, Grand Master Yoda, Master Yula Braylon, and many other younglings and masters for the galactic festival there. He and Master Braylon rushed to Yoda's aid when the youngling Sifo-Dyas accidentally knocked into him. He selected Zang to be his Padawan apprentice in 86 BBY."}, {"tag": "p", "text": "Sometime before the Invasion of Naboo, Sinube was seated on the Jedi High Council, and was present when the Padawan Cere Junda met with the Council in the fallout of the battle for Ontotho and was granted the rank of Jedi Knight for her conduct."}, {"tag": "p", "text": "As a Jedi investigator, Sinube was an expert in the planet Coruscant's criminal underworld. His connection to the Force allowed him to solve crimes faster than seasoned detectives in the Coruscant Police."}, {"tag": "p", "text": "During the Clone Wars, Sinube helped Padawan Ahsoka Tano to recover her lightsaber, which had been stolen by a thief named Bannamu. He later volunteered his Astromech droid, M5-BZ for a mission to infiltrate a separatist dreadnought and steal an encryption module scrambling communications within the region. He also trained younglings in the Jedi arts at the temple on Coruscant."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Sinube was the owner of M5-BZ, and wielded a pale blue-bladed lightsaber that could also be used as a cane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}