{"url": "Battle_of_Jakku", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Battles of the Galactic Civil War", "Category:Battles of Jakku"], "nodes": [{"tag": "h1", "text": "Battle of Jakku"}, {"tag": "p", "text": "The Battle of Jakku was the decisive last stand of the Galactic Empire made on Jakku at the dawn of the era of the New Republic as it fought against the Republic following the Battle of Endor that took place in the year 5 ABY. During the waning months of the conflict, Counselor Gallius Rax assumed control of the Empire and concentrated much of its remaining forces on Jakku, an Inner Rim desert world where the Empire would make its last standoff against the New Republic."}, {"tag": "p", "text": "Unknown to his own soldiers, Rax plotted to destroy the Empire in order to fulfill his obligations to the late Emperor Sheev Palpatine. However, he also intended to retreat into the Unknown Regions where he could forge a new Empire with those whom he regarded as the worthy few, such as Commandant Brendol Hux. When the Republic's forces attacked the Empire on Jakku, Rax attempted to destroy the entire planet along with both factions. However, his efforts were thwarted by Grand Admiral Rae Sloane, who killed Rax during the battle."}, {"tag": "p", "text": "While the fighting on Jakku would continue in the months that followed Rax's death, the battle was a decisive victory for the New Republic. In the aftermath, Grand Vizier Mas Amedda and Chancellor Mon Mothma signed the Galactic Concordance on Chandrila, officially marking the end of both the civil war and the Empire itself. Following the end of the Civil War, an Imperial remnant was formed from the remaining Imperial forces on Jakku and fought against the New Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Imperial disintegration"}, {"tag": "p", "text": "During the Battle of Endor, the Galactic Empire was drastically weakened when the Alliance to Restore the Republic managed to destroy its dreaded battle station, the second Death Star. Before it was destroyed, Luke Skywalker, a Jedi Knight, turned his father, the Sith Lord Darth Vader, away from the dark side of the Force. Vader, once again the Jedi Anakin Skywalker, threw Darth Sidious, his former Sith Master and Galactic Emperor of the New Order, down the second Death Star's reactor core, where he died. The Rebels celebrated their victory on the Endor moon, believing the fight to be won. Nevertheless the Rebellion, which had been reorganized into a government known as the New Republic, would still be engaged in bloody combat against the remaining forces of the Empire in the year following the station's destruction."}, {"tag": "p", "text": "In the months after the Battle of Endor, the New Republic won a string of victories against the Empire, consolidated control over much of the galaxy, and reconvened the Galactic Senate on Chandrila. Meanwhile, the Empire splintered into several Imperial remnants including Governor Ubrik Adelhard's Imperial remnant and Grand Moff Lozen Tolruck's remnant on Kashyyyk. While Grand Vizier Mas Amedda still ruled Coruscant, he was largely a powerless figurehead who lived under house arrest on the wartorn Imperial capital."}, {"tag": "p", "text": "By 5 ABY, Fleet Admiral Gallius Rax had assumed leadership of the Imperial forces in the Vulpinus Nebula, the Almagest, the Recluse's Nebula, the Queluhan Nebula, the Ro-Loo Triangle, and the Inamorata. Rax also commanded the Ravager, the last Super Star Destroyer under Imperial control. Rax exercised control through his puppet Grand Admiral Rae Sloane, an able commander who served as the Empire's public face. Rax manipulated Sloane into instigating faux peace talks with the New Republic. After framing Sloane for the Attack on Chandrila, Rax assumed leadership of the Empire and proclaimed himself Counselor to the Empire. He then brought the Ravager as well as most of, if not the entirety of, the remaining Imperial fleet to Jakku."}, {"tag": "p", "text": "Unknown to Rax's subordinates, Jakku had been designated as the staging ground in Emperor Palpatine's Contingency plan to ensure that the Empire would not outlive him if he were to die. As a Sith Lord, Palpatine had no plan of delegating his Empire to a successor. Palpatine had met Rax on Jakku after the young orphan had sneaked aboard his yacht in 25 BBY. Sensing potential in the boy, Palpatine tasked Rax with guarding a mysterious excavation site in the Plaintive Hand plateau, which later became the Jakku Observatory complex. In return, Palpatine arranged for Rax to receive an education and engineered his rise to Fleet Admiral. Throughout his life, Rax was tasked with carrying out the Emperor's Contingency."}, {"tag": "h3", "text": "The Contingency Plan"}, {"tag": "p", "text": "Under Rax's command, Imperial forces established a presence on the desert planet for months prior to the New Republic accidentally discovering them. The long wait coupled with Jakku's harsh and bleak climate exacted a heavy psychological toll on the Imperial forces. Many of the Imperial stormtroopers and officers stationed on Jakku became undisciplined and failed to take care of their uniforms and armor. They also terrorized the local communities by stealing food and water. Rax also exercised harsh discipline against personnel who questioned their purpose on Jakku. One stormtrooper RK-242 was beaten up by his Sergeant Rylon and comrades for expressing a desire not to be on Jakku."}, {"tag": "p", "text": "In addition to the orbiting Imperial armada, Counselor Rax also maintained an Imperial base in the Sinking Fields for his ground forces. In addition, Rax developed a working relationship with the local Hutt crime lord Niima. Niima's slaves and henchmen kidnapped many children from small villages and makeshift orphanages run by the Anchorites. Rax had once been a servant to the Anchorite Kolob and sought revenge against the Anchorites for his harsh upbringing at the hands of Kolob. These children were then trained by the former Commandant Brendol Hux into ruthless child soldiers who were prepared to obey and kill at Rax's orders. While searching for Rax, Sloane and Brentin learned about Rax's activities. These revelations only intensified Sloane's hatred of Rax, who had usurped her authority during the Attack on Chandrila."}, {"tag": "p", "text": "Rax also maintained another Imperial facility in Jakku's Plaintive Hand plateau known as the Observatory. The Observatory housed a replica of the late Emperor's pleasure yacht Imperialis and a computerized map of the Unknown Regions based on Grand Admiral Thrawn's knowledge of that unexplored region. The Observatory was also built over a deep borehole which led to the molten core of Jakku. As part of the Contingency, Rax planned to destroy the Empire and their New Republic opponents by blowing up the planet. In secret, Rax subverted the Contingency by secretly arranging for himself and other \"worthy\" Imperials like Hux, his son Armitage Hux, and the child soldiers to escape into the Unknown Regions to rebuild the Empire."}, {"tag": "h3", "text": "Discovery and deadlock"}, {"tag": "p", "text": "While searching for the fugitive Rae Sloane, the New Republic operative Norra Wexley and her team discovered Counselor Rax's Imperial fleet above Jakku. Norra and the bounty hunter Jas Emari used an escape pod to land on the planet while her son Temmin Wexley and Sinjir Rath Velus took their ship Moth back to the New Republic capital on Chandrila. Temmin sent his B1-series battle droid and companion Mister Bones to look after his mother on Jakku. Norra and Jas were captured by stormtroopers. Norra was forced to work at a kesium gas rig while Jas found herself a captive of Niima the Hutt and the bounty hunter Mercurial Swift; with the latter seeking to collect a Black Sun bounty on Jas as punishment for an earlier ambush on Taris."}, {"tag": "p", "text": "Meanwhile, Sloane and the former rebel operative Brentin Lore Wexley traveled to Jakku to seek revenge against Gallius Rax. After encountering Niima, they managed to convince the Hutt crime lady to take them to Rax's weapons facility. Norra later escaped her Imperial captors with the help of Mister Bones. Jas later escaped from her captors and reunited with Norra. Continuing their hunt for Sloane, Norra and her comrades tracked them down to the Plaintive Hand plateau. However, Counselor Rax spotted Sloane among Niima's caravan and bombarded them. Norra and Jas could only watch as Rax and his Imperial forces took Sloane and Brentin into custody. The former Grand Admiral and rebel operative were imprisoned at the main Imperial base on Jakku, where Rax made preparations for his apocalyptic showdown with the New Republic."}, {"tag": "p", "text": "Elsewhere, Temmin and Sinjir returned to Chandrila with news of the Imperial presence on Jakku. The two warned Chancellor Mon Mothma, Princess Leia Organa, and Han Solo. However, Mothma's political rival Senator Tolwar Wartol had planted a listening device on Leia and Han's nanny droid T-2LC. Wartol leaked this news to the media and accused Mothma of withholding information from the public. Per New Republic procedure, the Galactic Senate was charged with voting to authorize any large-scale military action by the New Republic Defense Force."}, {"tag": "p", "text": "During the Senate's first vote on the issue on Chandrila, the vote failed to pass since Mon Mothma failed to secure a majority by five votes. This issue was complicated by the New Republic's efforts to transfer its capital from Chandrila to the agricultural world of Nakadia in the Mid Rim. Later, the Chancellor discovered that Senator Wartol had conspired with Black Sun and the Red Key Raiders to coerce five senators into voting against Mothma's resolution. These senators were Ashmin Ek of Anthan Prime, Rethalow of Frong, Dor Wieedo of Rodia, Grelka Sorka, and Nim Tar. Mothma managed to delay the re-vote by eating pta fruit aboard Wartol's ship. Since Nakadia had strict biosecurity laws, Wartol's ship was quarantined for several hours."}, {"tag": "p", "text": "Meanwhile, Mothma dispatched a team of five spies consisting of Han Solo, Temmin, Sinjir, the former New Republic Special Forces soldier Jom Barell, and Sinjir's boyfriend Conder Kyl to spy on the five senators and convince them to change their votes. They discovered that Ashmin Ek, Rethalow, and Dor Wieedo had been bribed into opposing Mothma's resolution in favor of favorable trade deals. Nim Tar's child and Sorka's pet jerba had been kidnapped. Solo and his team managed to rescued Nim Tar's child from the gangsters. Sinjir then posed as Mothma's adviser and issued a missive offering to pardon the five senators for their transgressions if they voted in favor of Mothma's resolution the second time. Due to Sinjir's connivance, the five senators voted in favor of sending New Republic forces to Jakku."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Preparations"}, {"tag": "p", "text": "Following the Galactic Senate's decision to intervene on Jakku, the New Republic mobilized its military forces. Besides defeating the Imperial fleets, the New Republic's other objectives on Jakku included capturing a critical sector in the Galactic Civil War and taking out an Imperial weapons facility on the planet. With the expanding New Republic Defense Fleet facing a shortage of starships and the Empire still controlling several major galactic shipyards, General Carlist Rieekan assembled several boarding parties to capture Star Destroyers from the Empire. These boarding parties consisted of several former Imperials including Lieutenants Thane Kyrell and Kendy Idele, who were familiar with the Star Destroyer layouts including their hyperdrives and self-destruct mechanisms. The New Republic space assault was commanded by Admiral Ackbar and Commodore Kyrsta Agate while the ground assault was commanded by Lieutenant General Brockway and General Tyben; with the latter being based on Chandrila."}, {"tag": "p", "text": "Meanwhile, Counselor Gallius Rax mobilized all Imperial forces on and above Jakku. Rax tasked Grand Moff Randd with commanding the Imperial fleet and assigned General Hodnar Borrum with commanding the Empire's ground forces on Jakku. Prior to the battle, Rax also used his child soldiers to secretly assassinate the Imperial propagandist Ferric Obdur as part of the Contingency. As a demonstration of his power, Rax also forced Sloane and Brentin to watch as his child soldiers executed a contingent of stormtroopers. Rax later delivered a rousing speech urging his forces not to show any quarter to the enemy and claiming their victory was at hand. This speech was broadcast to Imperial forces via hologram. In secret, Rax planned to destroy most of his forces and the planet as part of the Contingency. He and a select few would then depart for the Unknown Regions in a replica of the yacht Imperialis."}, {"tag": "p", "text": "Due to the Empire's martial defeats across the galaxy and the severe depletion of its military reserves, the New Republic forces outnumbered their Imperial counterparts. New Republic military assets included the flagship Admiral Ackbar's MC80A Home One Type Heavy Star Cruiser Home One, three Nadiri Starhawk-class Battleship Mark Is including Agate's ship Concord, and the Alderaanian escort frigate Sunspire. In addition, the New Republic deployed thousands of starfighters, U-wings, and ground forces including the elite SpecForces and New Republic army. Soon after, Ackbar would call on the entire rebel fleet to join the battle, including dozens of MC80 Star Cruisers, several CR90 corvettes, EF76 Nebulon-B escort frigates, and Inferno Squad for the battle. Additionally, the Carrack-class Cruiser Oculus was used to spy on the Imperial forces from a distance."}, {"tag": "p", "text": "Meanwhile, Imperial assets included Rax's Super Star Destroyer Ravager, Captain Groff's Star Destroyer Punishment, and Captain Ciena Ree's Star Destroyer Inflictor, Admiral Garrick Versio's Star Destroyer Eviscerator, and many other Star Destroyers. Other Imperial forces included TIE fighters, TIE strikers, TIE bombers, TIE interceptors, stormtroopers, sandtroopers, and various types of walkers such as AT-ATs and AT-STs. Unknown to both Rax's forces and the enemy, Rax's secret weapon was to explode the planet Jakku's core, destroying both forces save for a few selected Imperials deemed worthy to survive."}, {"tag": "h3", "text": "Space battle"}, {"tag": "p", "text": "The Battle of Jakku occurred one year and four days after the battle of Endor. Upon exiting hyperspace, the New Republic fleet began bombarding the Imperial fleet, which fired in response. Both sides deployed starfighters and dogfights took place both in space and the skies above Jakku. During the fighting, Captain Wedge Antilles and Temmin Wexley flew X-wing starfighters as part of Phantom Squadron, which was tasked with protecting the capital ships from Imperial TIE fighters. At the urging of Temmin, Phantom Squadron entered Jakku's atmosphere to escort the U-wing landers carrying New Republic commandos to battle. In response to the New Republic landings, the Empire deployed several walkers into the desert to defend the main Imperial base from encroaching enemy forces."}, {"tag": "p", "text": "As the fight began, Flare and Wild squadrons engaged TIEs while Nath Tensent and Chass na Chadic lead Hail squadron and attempted to attack an Gozanti-class cruiser, but the Gozanti's two Raider escorts provided covering fire to scatter the bombers as one of the first Star Destroyers dies in the battle. Soon, the first New Republic casuilties began with the Brightsaber was destroyed as the Imperials converged on the Star Destroyers."}, {"tag": "p", "text": "Despite their superior numbers and the clear space above Jakku, the New Republic fleet was unable to penetrate the neatly compressed Imperial fleet. The Imperials had used their Star Destroyers to form a strong defensive perimeter around the Super Star Destroyer Ravager, which blunted the New Republic assault. Throughout the battle, the smaller Imperial warships would repeatedly open formation to allow the Ravager to unleash its formidable firepower against the New Republic fleet. Advancing forward, Admiral Ackbar and Commodore Agate managed to tighten the radius of the Empire's defense by deploying the New Republic's three advanced Starhawk cruisers and several CR90 corvettes as part of a wedge strategy to break through the Imperial formation. However, the Republic fleet was still unable to penetrate the Imperial defensive perimeter and lost several ships in the process."}, {"tag": "p", "text": "While the Starhawk layed siege to the Ravager, Hera Syndulla gathered two corvettes and several transports and moved to escort the ground forces to the surface to begin landing troops. One TIE Bomber slipped through Syndulla's defenses and attacked the Deliverance, though the fighter didn't do much damage, the impact had caused captain Nisteen Arvad to fall and was bleeding. At this point, already several New Republic ships, such as the Hunting Hound, Serenade, and Canny Bargain had either become critically damaged or had been lost to Shadow Squadron, hiding in radiation they gathered from Chadawa. Having recognized their presence, Hera alerted Nath and had his squadrons reroute to the area. Passing an MC30C Frigate battling TIEs, Alphabet, Hail, Flare, and Wild squadrons entered Shadow Squadron's kill zone and had found the Yadeez. Nath targeted the modified freighter, figuring taking out Shadow Wing's leadership was the easiest path to victory. After finishing off the MC30c, Shadow Squadron's TIEs started targeting Syndulla's fighters. Before the fight, on an open frequency, a conversation began between Shadow Squadron and the New Republic squadrons. The peace in this small part of the battle was eventually broken and the casualties began."}, {"tag": "p", "text": "Meanwhile, the Deliverance was taking fire from enemy TIE fighters. Wyl Lark was helping out injured crew members when he accidentally caught a spy onboard. The spy, Palal Seedia, attacked Wyl. Wyl tried to talk to her, but Seedia wouldn't have it. She eventually beat him and triggered off her bombs, killing herself and causing a ripple effect of explosions and fire. The rest of Syndulla's forces weren't doing much better. Hail Squadron was down to two pilots, and the bombers had yet to hit the Yadeez. Despite the raging battle, some in the two forces continued their conversations and even played games. Despite the wounds, the Deliverance had arrived to assist in the defeat of Shadow Squadron. Seeing the ongoing damage to their Star Destroyer, Chass became enraged and attacked Shadow Squadron's pilots directly. Hera began ordering the evacuation of the Deliverance while the Yadeez began to head towards to the Concord. Hera set the Star Destroyer on a collision course with the Yadeez and ordered her forces to move in on the freighter. The TIEs moved farther to the freighter to the burning Star Destroyer as Hera announced her presence on the open comm, though some had remained. Nath began a suicide run towards the freighter. The conversations ended but the fighters began listing the names of their fallen friends they lost to the war. Nath attacked the freighter, but Chass and Hail Six had missed due to the sudden death of Hail Twelve. Nath decided to go again but attack the engine, announcing his plan over the open comms. However, Chass broke formation and dangerously fired onto the freighter's thrusters, however she hit the freighter and her fighter shattered to pieces. Seven fighters left, Nath lead them in another assault on the freighter. Nath announced he was the one who killed Cololnel Shakara Nuress and finished the freighter's engines with his last run. Shadow squadron retreated to the broken Yadeez and Nath lead his five remaining fighters out of the battle. Nath left the battle while the other four returned to the Starhawk to offer their assistance. Hera disembarked from the Deliverance on the Ghost and joined the larger battle."}, {"tag": "p", "text": "The tide of the battle began to turn in the New Republic's favor when Captain Groff of the Star Destroyer Punishment panicked and rammed his starship into the Starhawk Amity. Despite the Amity's destruction, Groff's suicide attack created a hole in the Imperial defense. At the urging of Admiral Ackbar, the Starhawk Concord, captained by Commodore Agate, took advantage of this hole to attack the Ravager directly. Though the Concord was severely damaged by the Ravager's firepower, Commodore Agate used her ship's state-of-the-art tractor beam to latch onto the Ravager. Ackbar then dispatched several New Republic ships and fighters to knock out the Super Star Destroyer's engines. Lieutenant Gina Moonsong's Blade Squadron also took part in the assault on the Ravager's engines."}, {"tag": "p", "text": "As a result, both stricken vessels crashed onto the surface of Jakku. Agate perished with her ship but Grand Moff Randd fled the Ravager in an escape pod. With Ravager plummeting rapidly towards Jakku's surface, Admiral Ackbar warned New Republic soldiers and pilots on the surface to avoid falling debris and take cover. With the battle turning against the Empire, Imperial ships began entering the planet's upper atmosphere in order to tighten their cordon, unleashing a fanatical defense to prevent the New Republic from capturing its secret research facility below. In a last-ditch effort, crippled Imperial ships began using their tractor beams to drag Republic vessels into the sandy wastes. Upon impact with the surface, nearly the entire populations of the falling ships would perish."}, {"tag": "h4", "text": "The Spectral Destroyed"}, {"tag": "p", "text": "The Spectral was an Interdictor-class Star Destroyer, which, at some point before the Battle of Jakku, was stationed at the Imperial Drydock at Kuat Drive Yards. Right before Jakku, it was sent to Fondor's Shipyards. There, it provided cover for the star destroyers attempting to flee before the New Republic fleet arrived. The Spectral fought the New Republic's Shepherd Squadron until Admiral Rae Sloane ordered remaining star destroyers to Jakku. However, the Spectral's commander, Admiral Ektol Traz continued the battle and deployed his fighters."}, {"tag": "p", "text": "As Shepherd Squadron closed in to attack, Admiral Traz ordered the Spectral to jump into hyperspace to Jakku. Unbeknownst to the Spectral's crew, Shepherd Two, lieutenant Bak Rychuk and his BTL-A4 Y-wing assault starfighter/bomber was dragged into hyperspace along with the Spectral. Eventually, the Imperials noticed, and Admiral Traz was informed of this and fact, and attemted to open fire on Rychuk's Y-wing, however, it was to no avail. The Spectral arrived at Jakku and tractored Rychuk's Y-wing into its hangar. Unfortunately, Rychuk's Y-wing had breached the Spectral's focusing dome and Admiral Traz was forced to power down the Spectral."}, {"tag": "p", "text": "As Rychuk was confronted by the Spectral's stormtroopers, Rychuk's droid, Zeetoo-Zeetoo was ordered to overload the Spectral's reactor coil or shut down its life support. Zeetoo, instead, activated the Spectral's starboard maneuvering thrusters and attempted to push it out of Jakku's orbit. As the Spectral's orbit decayed, its engine ignitors became unresponsive and the Spectral started falling towards the surface. When the Rebel fleet arrived, Admiral Traz ordered all hands to abandon ship. As he made his way to his command shuttle, Traz's security droid, K-8Z8, held him back and told him he could not abandon ship, as Trz was captain. Traz named K-8Z8 as the Spectral's captain and made his way to an escape pod with Rychuk. Only K-8Z8 and Zeetoo were left aboard as the Spectral crash-landed on Jakku and was buried in the sand."}, {"tag": "h4", "text": "Boarding the Inflictor"}, {"tag": "p", "text": "Following the destruction of the Ravager, New Republic forces began assaulting the concentrated Imperial positions from multiple sides at once both in space and on the ground. With the Imperials no longer having the martial advantage it once had in the years before Endor, outdated battle tactics as much as flawed leadership gnawed away at an Imperial victory. The centralized nature of the Imperial command also constricted the ability of Imperial forces to respond to their New Republic adversaries. With the battle turning against the Empire, Captain Ciena Ree of the Inflictor wondered whether the Empire's plans for making a stand at Jakku were betrayed by an admiral or Grand Moff in a power play. New Republic attacks on Imperial flanks also contributed to heavy Imperial losses."}, {"tag": "p", "text": "Before Captain Ree could contact Grand Moff Randd to suggest splitting up the fleet to combat the Rebel star cruisers from multiple angles, as well as sending twenty-gun raiders into the atmosphere to support the TIE fighters in orbit, her ship was suddenly boarded by New Republic soldiers led by her lover Thane Kyrell. With no choice, Captain Ree attempted to activate the ship's self-destruct, only to discover that the boarders had disabled it. Seeing no other option, as well as seeing a way to leave the Empire she disliked while keeping her oath, Ree ordered her crew to evacuate and then scuttled the ship by crashing the Star Destroyer onto the surface of Jakku."}, {"tag": "p", "text": "As the Inflictor plunged into Jakku's atmosphere, Kyrell managed to force his way into the command bridge. Wanting to free herself of her oath through death, Ree pleaded with Thane to leave in an escape pod before the Inflictor crashed. However, Thane was unwilling to abandon his lover and forcibly rescued her. Following a struggle, Thane managed to stun Ciena and carry her into an escape pod before the Inflictor crashed. The two landed in the deserts of Jakku where their pod was picked up by New Republic soldiers, who took Captain Ree into custody."}, {"tag": "h3", "text": "Ground battle"}, {"tag": "p", "text": "In order to assault Imperial ground facilities, General Tyben and Lieutenant General Brockway dispatched U-wings to deploy New Republic commando forces. The New Republic U-wings were escorted by several New Republic starfighter units including Phantom Squadron. Temmin and his fellow Phantom Squadron fliers began strafing the Imperial walkers. During the U-wing landing wave, the New Republic SpecForces soldier Jom Barell sacrificed his life by donning his jetpack and intercepting an Imperial concussion missile. Barell was killed by the missile but saved his comrades aboard the U-wing from death."}, {"tag": "p", "text": "As the battle raged, General Tyben contacted Admiral Ackbar by hologram to inform him that New Republic forces under Lieutenant General Brockway had made some success against the Imperial Army and were pushing their line back klick by klick. Since the Empire was fighting like an insurgent force and using suicidal tactics, the New Republic ground forces sustained significant casualties. Despite the limited progress, Tyben hoped to seize the main Imperial base by nightfall if they could stem their casualties. Tyben also observed the Empire's willingness to take heavy casualties in order to slow down the New Republic advance. Despite Tyben's insistence that he be allowed to come to Jakku, Admiral Ackbar insisted that Tyben remain on Chandrila in case the Battle of Jakku turned out to be a ruse. The New Republic ground forces divided their forces. Though this was risky, it allowed them to attack on multiple fronts, which the Imperials were unable to adequately respond to."}, {"tag": "p", "text": "The ground assault also coincided with Norra and Bones flying a stolen Imperial shuttle in an attempt to reach the Imperial base in the Sinking Fields to find Brentin and Grand Admiral Sloane. Norra had escaped from Imperial captivity with the help of Mister Bones. Temmin almost shot down his mother's shuttle by mistake but Bones managed to lower the shuttle's ramp and signal to Temmin. After a brief conversation, mother and son parted company and returned to their missions."}, {"tag": "p", "text": "The destruction of the Ravager turned the tide of the ground battle decisively in favor of the New Republic. Temmin's X-wing was damaged by falling debris from space and crash-landed in the desert. He was accosted by three sandtroopers and an AT-ST walker. Before the Imperials could harm the New Republic pilot, Mister Bones, who had parted company with Norra, attacked and killed them with Temmin's help. However, Bones was permanently disintegrated when the AT-ST he had hijacked was bombed by two passing A-wing starfighters."}, {"tag": "h4", "text": "Ambushing an Imperial convoy"}, {"tag": "p", "text": "After her B-wing starfighter was hit by falling debris from the Ravager, Lieutenant Moonsong of Blade Squadron traveled ten kilometers to an abandoned stormtrooper camp where she encountered Temmin Wexley, who shared supplies with her. Together, the pair joined up with the Third Recon Group in ambushing an Imperial convoy traveling through a pass to reinforce Imperial forces at Golga Station and Base Alpha."}, {"tag": "p", "text": "At the advice of Gina, Major Ranz used jury-rigged power packs to blow up the second Imperial Troop Transport in the convoy, obstructing them. In response, the Imperials formed a triangular defensive formation. New Republic troops then bombarded the Imperials, destroying several vehicles and killing the occupants. The Imperials then formed a skirmish line that was defended by a tripod-mounted blaster cannon."}, {"tag": "p", "text": "When Imperial stormtroopers launched a frontal attack, Gina, Wexley, and three squad members met their attack head-on with grenades and blasters. Gina and Temmin managed to capture the first Troop Transport. Temmin managed to repair the comm-dish before being stunned. This allowed Gina to send a voice message to New Republic fighter command."}, {"tag": "p", "text": "The Imperials launched another counter-attack with the support of blaster cannon. Major Ranz blew himself up to stop stormtroopers from overrunning his position. Several New Republic soldiers led by Sergeant Agarne regrouped with Gina and Temmin their dune. A flight of TIE fighters then strafed Major Ranz's former position, killing the troopers there. Before the TIEs could finish off the other rebels, B-wings from Blade Squadron shot down the enemy fighters. Shortly later, Gina was rejoined by her former boyfriend and starfighter pilot Braylen Stramm."}, {"tag": "h4", "text": "Jas and the bounty hunters"}, {"tag": "p", "text": "Meanwhile, Jas managed to convince the bounty hunters Dengar, Embo, and Jeeta to join forces with her in fighting for the New Republic in return for receiving pardons. When Mercurial Swift objected, the bounty hunters ejected him from their Corellian shuttle before flying to join the fray. Jas' plan work and the bounty hunters secured pardons from the New Republic and later formed a bounty hunting group."}, {"tag": "h4", "text": "Corlac and Terex"}, {"tag": "p", "text": "Elsewhere, a stormtrooper named TK-605 shot his corporal, feeling that there was no reason to fight anymore. His fellow squadmate TK-603 questioned this, but after they realized that the Empire was losing the battle, they both quit. They buried their armor to keep the New Republic soldiers from hunting them down and walked off into the sunset. Later, TK-605 and TK-603 were able to use a head of a AT-AT and make it into an improvised starship to get them off-world."}, {"tag": "h4", "text": "Stopping Rax"}, {"tag": "p", "text": "As the ground battle raged, Norra and Bones managed to land at the main Imperial base where they found Brentin and Sloane, who had managed to free themselves from Rax's captivity. Following a brief struggle, Sloane managed to convinced her nominal foes to travel to the Observatory in order to stop Rax once and for all."}, {"tag": "p", "text": "Amidst the fighting on Jakku, Counselor Rax traveled with Brendol, his son Armitage Hux, Adviser Yupe Tashu, and his contingent of child soldiers on a shuttle to the Observatory. After entering the landing dome, Rax instructed the Huxes and his child soldiers to wait aboard the Emperor's yacht Imperialis while he and Tashu entered the Observatory to implement the final stage of the Contingency. Rax and Tashu made their way to the deep well which led to Jakku's molten core. After Tashu donned a Sith mask and activated a Sith holocron, the two initiated a dark side ritual. After praying, Rax threw an unsuspecting Tashu to his death down the borehole."}, {"tag": "p", "text": "Tashu and Rax's ritual caused Jakku's core to shake, triggering a process that would lead to the planet's destruction if left unhindered. Norra along with Sloane and Brentin arrived and resolved to stop Rax's plan. While Brentin and Norra tried to use telescoping vents to seal the shaft, Sloane fought with Rax in hand to hand combat. Despite putting up a fierce fight, Rax gained the upper hand over Sloane and broke a few of her fingers. Hearing Sloane's screams, Norra and Brentin rushed to her aid. Rax managed to kill Brentin with his blaster but Norra managed to pass her blaster to Sloane. This allowed Sloane to kill her nemesis."}, {"tag": "p", "text": "In his dying moments, Rax told Sloane that she now served the Contingency and to take the Imperialis into the Unknown Regions to rendezvous with the Emperor's flagship Eclipse. Rax also revealed that the ship contained a data spike that contained the coordinates for a hyperspace route through the volatile region. Sloane then reconciled with her former adversary Norra and vowed to finish Brentin's efforts to steal the borehole. While Sloane sealed the borehole, Norra left with her fallen husband and was rescued by Jas and her fellow bounty hunters, who had arrived in their shuttle. After sealing the borehole, Sloane departed aboard the Imperialis for the Unknown Regions with Brendol, Armitage, and the child soldiers."}, {"tag": "h3", "text": "End of the Eviscerator"}, {"tag": "p", "text": "At the same time, Inferno Squad, led by Iden Versio, assisted with the planetside operations. After buying time to evacuate ground forces and destroying TIE bombers from a downed Star Destroyer, Iden and Shriv Suurgav protected the Corvus during its escape, culminating in the apparent demise of Gideon Hask in a dogfight. Seeing an opportunity to save her father, Iden crashed her X-Wing onto the hull of the Eviscerator, almost falling to her death in the process."}, {"tag": "p", "text": "Fighting her way inside to the bridge, Iden pleaded with her father to come with her, but Garrick refused, urging Iden to survive. Parting with her father on good terms, Iden managed to reach an escape pod before the ship crashed into the planet below. After being rescued from her pod by Del Meeko, they shared a kiss before being interrupted by Shriv, inviting them to watch the end of the battle and the death of the Empire. Wyl's escape pod had been found and rescued by a TIE pilot looking for survivors of the Ravager and Eviscerator. Nath began to repair his fighter, looking for signs his teammates were alive while snipping TIEs when he could. His astromech, T5, had found Wyl's pod and Nath went to rescue him. Chass meanwhile had been found by the Polyneus riders, searching for survivors."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "Geopolitical impact"}, {"tag": "p", "text": "Following the death of Counselor Gallius Rax, Grand Vizier Mas Amedda escaped from the Imperial Palace with the help of a group of child soldiers known as the Anklebiter Brigade. He initiated contact with Chancellor Mothma and sued for peace. In the wake of the Empire's catastrophic defeat at Jakku, Amedda was able to sign a peace treaty known as the Galactic Concordance on Chandrila; formally ending the Galactic Civil War. Under the terms of the Imperial Instruments of Surrender, the remnants of the Empire were ordered to cease fighting and the Imperial government was dissolved immediately. While most Imperial officers were designated as war criminals, non-combatant functionaries were given conditional pardons. Amedda escaped prosecution and later served as the head of a provisional government on Coruscant, but he was widely derided by the media and historians as one of the architects of the Empire."}, {"tag": "p", "text": "Despite the Empire's official capitulation, the Imperial remnant on Jakku refused to surrender and continued fighting for several months. While New Republic forces managed to capture the main Imperial base, the retreating Imperials managed to destroy their research base and weapons facility before jumping into the Unknown Regions. While several Imperial captains used their warship's tractor beams to draw New Republic vessels onto the planet's surface, other captains used mysterious hyperspace coordinates to flee into the Unknown Regions. After several months of bitter fighting, New Republic soldiers managed to overcome the last Imperial holdouts on Jakku. The New Republic also had to contend with large numbers of Imperial prisoners, among them Admiral Ektol Traz."}, {"tag": "p", "text": "Over a month following the battle, the Empire did not attempt to instigate any other large-scale offensives with the New Republic. The exhausted Empire would be bound by the punitive treaty, forcing it to order all Imperial vessels located in the Core and Inner Rim to remain within pre-determined boundaries, as well as cede the Imperial capital of Coruscant over to the new government. Harsh war reparations and severe restrictions on its military capabilities effectively turned the fractured Empire into a rump state. With the treaty signed, a few prominent members of the reestablished Galactic Senate believed that the New Republic's war with the Empire was nearing its end and that the Empire's total capitulation was imminent."}, {"tag": "p", "text": "Despite the defeat of Imperial forces on Jakku, other scattered Imperial remnants remained in the galaxy but posed little threat to the New Republic, which had gained control over much of the galaxy. Due to the presence of these scattered Imperial remnants, the New Republic Starfleet remained on war footing in the immediate aftermath of the battle. A small but well-armed Imperial fleet led by Jakku veterans Commander Nash Windrider and Grand Moff Randd regrouped in the Queluhan Nebula for an assault on the New Republic. Meanwhile, the alien pirate Eleodie Maracavanya intercepted and destroyed three Imperial II-class Star Destroyers in an attempt to curry favor between his self-proclaimed Sovereign Latitudes of Maracavanya and the New Republic."}, {"tag": "h3", "text": "Wreckage and conspiracy theories"}, {"tag": "p", "text": "Following the Battle of Jakku, Niima the Hutt established a black market based on salvaging junk, weapons, computers, and engines from the wrecked starships. Decades later, Jakku's desert landscape was still littered with wreckage from the battle in an area known as the Graveyard of Giants, with the Executor-class Star Dreadnought Ravager and Star Cruisers of both sides littering the landscape. Despite most ships having crashed in the Graveyard, wrecked fighters, warships and miscellaneous debris could be found in locales such as Kelvin Ravine, Carbon Ridge, the Goazon Badlands and other points across the entire world. Survivors of the battle who ejected from a fighter or came down in an escape pod often wandered the desert in search of inhabited settlements. With Jakku's nearly non-existent population at the time, many died of exposure wandering the Goazon, or starved to death in caves, becoming carrion for ripper-raptors. As a result, the planet became littered with bodies, and the bones of fallen soldiers still in uniform strapped to ejector seats or stuck under wreckage littered locales from Feressee's Point to the Spike. The moving sands of the Sinking Fields often exposed crashed ships for a short time before burying them once more. Lifeforms such the iron-beaked carrion birds known as steelpeckers would break down metals in the crashed starships, while transplanted creatures and parasites from the battle would stubbornly find a place in the desert ecology."}, {"tag": "p", "text": "After the establishment of Niima Outpost by Niima the Hutt, an entire economy would be established based on the foraging of valuable technology in the Graveyard, with local junk boss Unkar Plutt controlling a monopoly over the business from his base at Niima Outpost following the Hutt's death at the hands of a bounty hunter. As a result, many stories would circulate over the origins of the wreckage and the battle that was fought, with many local residents falsely claiming to have been on the planet when the ships fell."}, {"tag": "p", "text": "Most Imperial ships were noted by locals to have suffered considerable battle damage, while some Republic ships did not. To some, this gave further credence to the tractor beam theory of how some of the ships crashed on the surface. The result of washing table gossip, one theory as to why the Empire put up such a fervent defense was to protect a secret research base at Carbon Ridge. This theory was supported by the presence of wide-eyed, bearded old men known as dead-enders twenty-nine years after the battle, with dead-enders throwing rocks and babbling strings of numbers while chasing scavengers away. Some believed that the old men were actually former Imperials guarding their secret base owing to them wearing scraps of old Imperial armor."}, {"tag": "p", "text": "Others such as the scavenger Rey, believed that an Imperial warship came down on the Carbon Ridge instead of crashing into the Graveyard, with the surviving officers sending out stormtroopers to secure the crashsite while they waited for a rescue, only to have a giant rockslide bury the ship, leaving the stormtroopers there guarding nothing. It was a known fact to locals that Unkar Plutt became irritated when mentioning Carbon Ridge owing to him having sent a failed expeditionary force of six thugs to the Ridge, only to have four of them return with brittle stormtrooper armor, having found nothing other than abandoned caves. As a result, treasure hunters generally left the caves alone."}, {"tag": "p", "text": "The second theory for the stalwart Imperial defense resolved around the rebuttal of the notion that the Imperial base was at Carbon Ridge, but rather that it was underneath the Sinking fields and was a storehouse filled with treasure looted from ancient civilizations and hidden by order of the Emperor. The third theory was that the Emperor maintained a hidden throne room on the planet, and had planned to explore and conquer the rest of the galaxy from this secret facility."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Decades later, the Battle of Jakku would be taught as one of the last major stands of the Empire within the New Republic educational system. Additionally, an Imperial artifact collector would name himself after the battle, going under the pseudonym 'Avenger of Jakku'. With the collapse of the Galactic Empire, the New Republic would turn its attention to reshaping the galactic order. Meanwhile, the Imperial forces that fled Jakku into the Unknown Regions eventually reestablished themselves into a militaristic junta called the First Order, that was dedicated to overthrowing the New Republic."}, {"tag": "p", "text": "Despite most inhabitants on Jakku either living in the sacred villages of isolationist religious worshippers such as at Tuanul or Niima Outpost, some folks such as Rey, scavenged through the old battlefront with her speeder bike and maintained the destroyed AT-AT Hellhound Two as her home."}, {"tag": "p", "text": "Decades later, an abandoned Republic corvette carrying secret information coveted by both the Imperials and New Republic during the battle was discovered. It would become the focus of a group of scavengers to retrieve this information."}, {"tag": "p", "text": "Twenty-nine years after the battle, the Millennium Falcon piloted by Rey and a defecting First Order stormtrooper known as Finn would fight against several First Order TIE fighters over the wreckage."}, {"tag": "p", "text": "When the Supreme Leader Kylo Ren discovered the secret Sith Fleet being built up at Exegol by the now-revived Darth Sidious, he briefly speculated whether they may have been made up of the remaining Imperial ships that fled after the Battle's end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Jakku made its first appearance in Claudia Gray's 2015 novel Lost Stars. The battle also appears in Star Wars Battlefront as a free downloadable level released on December 8, 2015, two weeks before the premiere of Star Wars: Episode VII The Force Awakens. Anyone who pre-ordered the game received the DLC one week early on December 1, 2015. The space portion of the battle would also appear in Hyperspace Mountain, a temporary overlay of Disneyland's Space Mountain attraction that opened on November 16, 2015 as part of the Season of the Force event. The attraction storyline puts guests into the role of a recon team sent to investigate the Imperial presence on Jakku, which escalates into the beginnings of the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}