{"url": "Tera_Sinube%27s_sabercane", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Canes", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Tera Sinube's sabercane"}, {"tag": "p", "text": "Tera Sinube's sabercane was a specialized mobility aid that also served the Cosian Jedi Master Tera Sinube as a lightsaber in situations where armed combat was the necessary course of action. Designed to be as much of a weapon as a reinforcement for his gnarled frame, Sinube only exposed the duplicity of his sabercane when the handle and collar were separated from the shaft to produce a light blue beam of plasma. Sinube used his sabercane during the Clone Wars, a conflict that pitted the Republic against the Separatists, when he wielded it to great effect against the thieving Terrelian Jango Jumper Cassie Cryar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Due to his age, Jedi Master Tera Sinube utilized a sabercane, a specialized device that was both a crutch and a lightsaber in one. The handle of Sinube's sabercane was T-shaped, and along with the collar, was made of wood from his homeworld. The activation stud for the sabercane's light blue energy portion was installed in the handle, and the intricately carved collar connected to a shaft that finished with an enlarged ferrule, the size of which provided increased stability and support for the aged Cosian as he moved about. The rounded ferrule had a flat bottom and four symmetrically placed protrusions to further supplement its owner's stability. In its completed form, the sabercane was roughly half the height of Master Sinube."}, {"tag": "p", "text": "As Jedi Masters advanced in age and became less able to sustain themselves physically, they made use of devices to help lessen the burden on their bodies. In situations where a peaceful approach was less practical and therefore required more aggressive negotiations, some elderly Jedi chose to imbue their walking sticks with the power of the Force, while others abandoned them entirely in favor of lightsabers. Master Sinube, however, fought with both his cane and lightsaber, as they were one and the same. He surprised his opponents, who attacked Sinube as though he was unarmed, by separating the lightsaber from his cane and wielding both parts in concert, with the lightsaber in place as the bladed weapon while the ferrule at the end of the shaft—which Sinube brandished in a reverse grip—served as an effective bludgeon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 21 BBY, Jedi investigator Tera Sinube utilized his sabercane while on a quest to find the missing lightsaber of Jedi Padawan Ahsoka Tano. The two Jedi traversed the lower levels of the galactic capital world of Coruscant and eventually found the Terrelian Jango Jumper Cassie Cryar in possession of Tano's weapon. They were forced to give chase and were able to eventually corner Cryar on a train. When Cryar attempted to attack Sinube with Tano's lightsaber, the Cosian Jedi Master separated the shaft from the handle and collar, from which he then produced his lightsaber blade. Wielding shaft and saber in either hand, Sinube proceeded to battle Cryar with both parts, parrying several of her ripostes with his lightsaber before using the cane extension like a cudgel and striking Cryar in the head with it. The Jedi then retrieved the lightsaber from Cryar, letting the unconscious thief get arrested by the police droids."}, {"tag": "p", "text": "Later in the Clone Wars, a conflict that divided the galaxy in warfare between the Galactic Republic and the Separatist Alliance, Sinube was overseeing a group of younglings training in the courtyard of the Jedi Temple when Jedi Knight Anakin Skywalker and Padawan Barriss Offee's duel spilled out of the Temple corridors. Sinube drew his sabercane in defense of the younglings and watched as Skywalker subdued the Dark Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tera Sinube's sabercane made a brief first appearance along with its owner in the ninth episode of the Star Wars: The Clone Wars television series' second season, titled \"Grievous Intrigue\" and released on January 1, 2010. In the eleventh episode of the season, \"Lightsaber Lost,\" Sinube's sabercane was fully featured and was also revealed to be both a lightsaber and a walking stick. Details for the device were provided with the summer 2010 release of The Clone Wars Character Encyclopedia, which identified Sinube's lightsaber specifically as a \"sabercane.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}