{"url": "Tent/Legends", "categories": ["Category:Legends articles", "Category:Portable shelters"], "nodes": [{"tag": "h1", "text": "Tent"}, {"tag": "p", "text": "A tent was a portable shelter or lodge, usually made of cloth or skin, stretched and sustained by poles. They came in a great variety of shapes, from rougly conical to rectangular. Tents were primarily used as portable homes by nomadic people such as the Tusken Raiders of Tatooine, whose shelters were known as urtya."}, {"tag": "p", "text": "Tents were also part of the armies' life. When permanent structures were not required or available, military camp often consisted of tents, some of which were communal while other were personal—usually the privilege of commanding officers. Personal tents used by military leaders could be very spacious—some were large enough to be used as assembly halls for war councils—and very ornate. According to Darth Bane, Lord Qordis' tent on Korriban had been decorated with rare woven tapestries and ornate rugs."}, {"tag": "p", "text": "By the time of the Clone Wars, some Jedi Generals still used tents as their temporary headquarters on the battlefront. When the Jedi Master Mace Windu explored the jungle of his homeworld of Korun, he used a \"wallet tent\" he kept in a hand-sized pocket of his kitbag. Once the pressure seal was pressed, the tent's internally articulated ribs automatically unfolded a transparent skin to make a shelter large enough for two persons. Survival tents were available in several formats, which could accommodate from one to six persons and cost from 200 to 600 Galactic Credit Standard at the time of the Galactic Civil War."}, {"tag": "p", "text": "At the time of the New Republic, there also existed inflatable tents that could be used in case of emergency. The Human Han Solo kept one such tent aboard his personal ship, the Millennium Falcon, and he used it when he decided to explore the planet Dathomir in 8 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "{{Scroll_box|content="}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}