{"url": "Tepasi/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles needing illustration", "Category:Planet stubs", "Category:Core Founders", "Category:Core Worlds planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Tepasi"}, {"tag": "p", "text": "Tepasi was a planet located within the Tepasi system of the Core Worlds. A forested world situated on the Commenor Run, it was colonized by Humans before 26,000 BBY and was already emerging as a hub of commerce when it became a founding member of the Galactic Republic. In 200 BBY, Tarzen Tagge provided aid to the planet after it experienced a series of groundquakes, precipitating the crime lord's founding of the Tagge Company. Tepasi remained loyal to the Republic during the Clone Wars, and after the death of Emperor Palpatine it was the site of the crumbling Tagge Company's only remaining facility."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Tepasi was located within a star system of the same name in the Core Worlds region of the galaxy. It was situated on the Commenor Run, a hyperlane which connected it to Esseles and Korfo. The planet was susceptible to groundquakes, and forests, which supported predatory achtnaks, were present on its surface. Unlos Tagge was a city on Tepasi."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Tepasi was colonized by Humans, who arrived in sleeper ships from Kuat, between 27,500 and 26,000 BBY, and around 25,000 BBY, when it was emerging as a hub of commerce, it became a founding member of the Galactic Republic."}, {"tag": "p", "text": "In the fourth year of the Galactic War, a corrupt female customs official who quit from an arms smuggling for a local syndicate was looking for a new place to call home."}, {"tag": "p", "text": "Around 600 BBY, a family of Tepasi nobles made investments that made the conversion of the Christoph system into a viable mining concern possible. In 200 BBY, crime lord Tarzen Tagge used his fleet of small freighters to deliver supplies and crews to an area of Tepasi that had been devastated by a series of groundquakes, thereby becoming a local hero. By the time the area's production facilities and roads were rebuilt, Tagge had founded the Tagge Company, a construction firm which operated as a front for his smuggling operations."}, {"tag": "p", "text": "Tepasi eventually became the throneworld of the House of Tagge family of nobles, and in 22 BBY, Baroness Sanya Tagge reaffirmed the family's loyalty to the Republic in an address to the populace of Tepasi. It indeed remained within space loyal to the Galactic Republic upon the outbreak of the Clone Wars and it was later loyal to the Galactic Empire.[source?] After the death of Emperor Palpatine, the Tagge Company crumbled and its holdings were ultimately reduced to a single facility on Tepasi, where the Tagge family was still well-respected. Tepasi was a stronghold of the New Republic during the Hunt for Zsinj of 7–8 ABY and the Thrawn campaign of 9 ABY. By 137 ABY, Tepasi was within territory claimed by Darth Krayt's Galactic Empire and was part of the region known as the Core Worlds Security Zone."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Tepasi was inhabited by Humans from Kuat beginning in the period from 27,500 to 26,000 BBY and featured at least one noble family by approximately 600 BBY. Captain Faro Argyus, a Senate Commando for the Republic, came from Tepasi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}