{"url": "Terentatek/Legends", "categories": ["Category:Legends articles", "Category:Jedi hunters", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Sithspawn", "Category:Subterranean creatures", "Category:Terentatek", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Terentatek"}, {"tag": "p", "text": "Terentateks were creatures which fed off the blood of Force-sensitives, and inhabited caves and tombs strong with the dark side of the Force. Several guarded the entrance to a section of Naga Sadow's tomb."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Terentateks resembled rancors, although smaller (approximately one-fourth the size of a fully-grown bull Rancor) except they had a number of spines growing from their backs and a pair of flaps, or tusk-like projections attached to their mouths. They also had massive claws (four to a hand). The tusks and claws of a terentatek were highly venomous. It was theorized that they were once rancors, subjected to mutations by the Sith, and that when the dark side was weak in the galaxy, terentateks would hibernate and remain dormant for many years, only to return when the dark side was strong again."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first prototype of what would become the fearsome terentateks was first seen on Tython, centuries before the rise of the Republic, when the Je'daii Master Quan-Jang, trying to craft a creature able to sense explosives during the Despot War, alchemically created terenta. However, the terentateks eventually developed a taste for Force-enriched meat, and thus began targeting Force-users. At some point, they were deposited on Tython's moon of Bogan, where they prowled the surface."}, {"tag": "p", "text": "The first recorded encounter with a modern terentatek occurred on the jungle world of Dromund Kaas in 4904 BBY, when the link between the terenta and the terentateks was long forgotten. While clearing a section of the planet of jungle and hostile wildlife, the Human Odile Vaiken fought and slew a modern terentatek. Some sources reported that the modern version of the terentateks evolved on Korriban, where the power and presence of the dark side of the Force gradually distorted their shapes and corrupted their minds. The Sith Lord Exar Kun was also reported to have created terentateks through Sith alchemy. A terentatek's hide was highly resistant - in some cases even immune - to the effects of the Force. They became the most dangerous of the creatures bred by the Sith. They were so powerful and dangerous to the Jedi that they were often dubbed Jedi Killers, and Kun used the monsters to destroy Jedi outposts on Tatooine, Kashyyyk, and Tython."}, {"tag": "p", "text": "During an event known as the Great Hunt, numerous Jedi traveled throughout the galaxy to try to exterminate the terentateks. Jedi were often sent in groups of two or three to battle these beasts, and the Jedi of the group had a strong Force bond between them. This was done so that the group could strengthen itself from the dark influence prevalent in the lairs of the terentatek, and as it had to rely on it's weaponry skills alone due to the almost complete Force immunity of the terentateks. None of the hunts were completely successful, however. Even though the Jedi seemingly exterminated a majority of the terentateks each time, the waxing of the dark side would trigger the terentateks to come out of hibernation and repopulate the galaxy. Such events included the rise to power of Revan, Malak, and Emperor Palpatine."}, {"tag": "p", "text": "Terentateks were also found on Tatooine, Kashyyyk, Onderon, Dromund Kaas, Tython, and Yavin 4. During the Jedi Civil War, Revan and his companions found and killed a terentatek in Kashyyyk's Shadowlands while searching for the Star Forge. It had been a ceremonial beast used in an old Wookiee ritual. In one such ritual many years ago, Bacca's Ceremonial Blade had broken from its hilt and become embedded in the creature's flesh when a headstrong Wookiee chieftain had attempted to slay it - the blade was recovered by Revan. Revan also single-handedly fought and killed two terentateks in the tomb of Naga Sadow. There was also a terentatek in the Shyrak Caves on Korriban, which turned out to be near the entrance to the tomb of Ludo Kressh. Teneb Kel fought and killed a terentatek on the planet Lenico IV in 3678 BBY. One more developed variant was found in the Tomb of Naga Sadow during the Cold War, but it was killed by the recently released Khem Val (imprisoned in the same tomb) and a powerful Sith acolyte."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BioWare used the umber hulk's model from Neverwinter Nights as the basis for the terentateks in Star Wars: Knights of the Old Republic."}, {"tag": "p", "text": "In the game Star Wars: Assault Team, a terentatek is found on Kashyyyk following Luke Skywalker, Han Solo, and Chewbacca after stealing an Imperial encryption module."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}