{"url": "Tergamenion", "categories": ["Category:Legends articles", "Category:Grumani sector planets", "Category:Sith planets"], "nodes": [{"tag": "h1", "text": "Tergamenion"}, {"tag": "p", "text": "Tergamenion was a world that was located in the Grumani sector, in the Outer Rim Territories. It was a darkworld and during the Republic Dark Age the planet was the site of Daimanite military research and production complexes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Second Charge Matrica in the Republic Dark Age, the world was under the control of the Sith Lord Daiman. According to the Republic Intelligence, Tergamenion was the site of research and production complexes that produced night-vision equipment and advanced targeting systems."}, {"tag": "p", "text": "Shortly before the Jedi-led Operation Influx in 1032 BBY, Jedi Master Vannar Treece briefly described the planet in his report to the Republic Supreme Chancellor Genarra and noted that the facilities on Tergamenion were critical to the Daimanite war effort, however the world was too remote for an effective Republic strike."}, {"tag": "p", "text": "Five to six weeks later, Sith Lord Ayanos Bactra had an arxeum, a mobile war sciences university, located near Tergamenion. He offered the arxeum to Daiman in exchange for a safe passage across Daimanate territory to strike at Vellas Pavo. Daiman agreed to the offer, however he chose the facility near Gazzari."}, {"tag": "p", "text": "Later that year, following the Aquilaris campaign, Jedi Knight Kerra Holt visited Tergamenion, where she established contact with Daiman in a bid to defeat Sith Lord Odion and to gain information on her parents Aron and Mercia Holt. With Daiman's cooperation, Kerra disguised herself as a slave worker named \"Mercy\" and established contact with Wayman, an undercover Claimer working for Odion as a recruitment agent. Kerra was subsequently able to infiltrate the Odionate and join the Novitiates, an elite corps of dark side Force-users in Odion's service. Kerra subsequently learnt about Project Pandemonium, a research project to locate the Helm of Ieldis, an ancient Sith artifact capable of driving sentient beings into a killing frenzy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}