{"url": "Terec", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Jedi Knights of the Jedi Order", "Category:Kotabi", "Category:Non-binary individuals", "Category:Trans individuals"], "nodes": [{"tag": "h1", "text": "Terec"}, {"tag": "p", "text": "Terec was a trans non-binary Kotabi Jedi Knight and the bond-twin of Ceret. Both twins were stationed at the Starlight Beacon space station during the High Republic Era. Their bond meant Ceret and Terec shared the same gestalt mind, frequently finishing each others' sentences even when not in the same room."}, {"tag": "p", "text": "Terec and Ceret joined Jedi Master Sskeer and Jedi Knight Keeve Trennis in traveling to the Kazlin system after Starlight received a scrambled distress signal from the system. Docking the T-1 shuttle with the wreckage of a ship, they began to search for survivors, donning rebreathers upon encountering gas that implied the Nihil had attacked the ship. Terec joined Master Sskeer as the group split up, Trennis and Ceret going towards the flight deck as Terec and Sskeer continued to search the ship. They were soon attacked by a lone Nihil marauder, who injured Terec before being killed by Sskeer."}, {"tag": "p", "text": "Terec was patched up by Trennis and waited for Jedi Master Avar Kriss, who was the Marshal of Starlight Beacon, and Jedi Knight Vernestra Rwoh to arrive at the Hutt ship as Sskeer and Ceret went to Sedri Minor to investigate the source of the grain. There, Terec collapsed as they felt Ceret's pain. As Terec was supported by Rwoh, Kriss contacted Sskeer to learn what had happened."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Terec first appeared along with Ceret in The High Republic 2. A post on the Star Wars Instagram for International Transgender Day of Visibility in 2021 expanded upon Terec's in-universe pronouns to confirm that Terec and Ceret are both trans non-binary. The post included Javier Garrón's The High Republic 6 variant cover, part of the line of Pride Month variant covers for Marvel comic books to be released in June 2021, which feature gay and transgender artists paired with LGBTQ+ characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}