{"url": "Terr_Taneel", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Galactic Republic senators", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Terr Taneel"}, {"tag": "p", "text": "Terr Taneel was a human female senator for the Galactic Republic who was on the planet Coruscant during the final days of the Clone Wars and represented Senex. Taneel was also present in a meeting with members of the Delegation of 2,000."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A human female from Neelanon Terr Taneel was a senator in the Galactic Republic during the conflict against the Confederacy of Independent Systems, known as the Clone Wars. She represented the world Senex in the Galactic Senate and sat on a committee close to Supreme Chancellor Sheev Palpatine. After the Chancellor's rescue during the Battle of Coruscant, she breathed a sigh of relief and was amongst the crowd who greeted the Chancellor on one of the Senate Building's landing pads when he was returned from Separatist capture by Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "Taneel later attended the Galaxies Opera House while Palpatine and Skywalker were viewing a performance of Squid Lake there. Taneel met with Senators Padmé Amidala, Mon Mothma and Bail Organa among other members of the Delegation of 2,000, a group of 2,000 senators who demanded that Chancellor Palpatine return the emergency powers he had been granted back to the Senate when the war came to an end."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Taneel was suspicious of Palpatine during the Clone Wars and concerns about his power-grabbing caused her to join forces with Organa and his allies. The senator was an intelligent and diplomatic individual, but was not especially strong or fast and had little skill in combat. She was not Force-sensitive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Taneel was portrayed by director George Lucas' eldest daughter Amanda Lucas in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy. In April 2003, George Lucas discussed with the costume designer Trisha Biggar the need for four female Senatorial outfits, including one for Amanda and another for her sister Katie. Ultimately, Katie was given the part of Chi Eekway Papanoida and Amanda the part of Terr Taneel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}