{"url": "Battle_of_Jutrand", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Battle of Jutrand"}, {"tag": "p", "text": "The Battle of Jutrand took place in 1032 BBY during the Second Charge Matrica. During the Battle of Gazzari, for which Ayanos Bactra was present, the Sith Lords Daiman and Odion, previously at odds, joined forces. At the request of their grandmother, Vilia Calimondra, Odion and Daiman attacked Bactra's fleet, which fled into hyperspace. The forces of Daiman and Odion followed them to Jutrand, the capital of the Bactranate. During the battle, Odion's forces captured the planet, and Bactra fled to a Quermian retirement colony. One of Bactra's largest corporations, Industrial Heuristics, then relocated to the Daimanate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Battle of Jutrand was the beginning of a joint invasion of the Bactranate by the combined Sith forces of Lords Daiman, Odion, Lioko, and Malakite; the grandchildren of Vilia Calimondra, the matriarch of the powerful Calimondra family. She had ordered the liquidation of the Quermian Sith Lord Bactra because she felt that he had outlived his usefulness to the family. While Vilia regarded him as a valuble family friend with business connections, he was always regarded as an expandable outsider by the ambitious Sith matriarch. Unlike other Sith Lords, Bactra did not enslave his conquered subjects and did extensive business dealings with several corporations including Industrial Heuristics, as opposed to nationalizing their assets which several other Sith Lords had already done."}, {"tag": "p", "text": "The invasion of Jutrand occurred within the historic context of the Second Charge Matrica, the second in a series of competitions that had been started by Vilia to keep her family divided and prevent them from challenging her monopoly over the family affairs. In 1066 BBY, Vilia had promised to grant her vast holdings to the heir that conquered the most territory. During the first Charge Matrica, her seven children annexed parts of the Galactic Republic before turning on each other. The sole survivor was Chagras, who became the titular ruler of the Chagras Hegemony. However, Vilia still lived and reigned over her empire. In 1040 BBY, Chagras died and his empire descended into anarchy as Vilia's grandchildren fought over territory, beginning the Second Charge Matrica."}, {"tag": "p", "text": "Several Sith states emerged within the Grumani sector including the Odionate, Daimanate, and the Bactranate. Since the Duros Space Run ran through the Bactranate, its capital Jutrand became a strategic business center and was home to several corporations including Industrial Heuristics. In 1032 BBY, Daiman lured Odion's forces into a trap on Chelloa. Odion survived but was grievously wounded and vowed revenge on his brother and the Jedi Knight Kerra Holt. In retaliation, Odion sent the Bothan spy Narsk Ka'hane to steal military secrets from the Daimanate capital of Darkknell and to destroy the Black Fang research installation. However, Narsk was captured by Daiman who suspected Odion's hand in the destruction of the Black Fang installation. In response, he concocted a plot to lead Odion into another trap at Gazzari. He then contacted Bactra to purchase an arxeum by citing the loss of the Black Fang research facility. Daiman promised to supply the students and to provide safe passage for Bactra's forces to travel to Gazzari."}, {"tag": "p", "text": "However, Daiman arranged for Narsk to listen to the proceedings and then to escape in order to lead Odion to Gazzari. Daiman's plot succeeded and Odion invaded Gazzari, deployed his deadly Death Spiral siege tower. During the Battle of Gazzari, both sides suffered heavy losses while Bactra's fleet watched from the safetly of space. Meanwhile, Kerra evacuated the students to safety and convinced the mercenary Brigadier Jarrow Rusher to transport the refugees aboard his starliner Diligence. Towards the end of the battle, Narsk received a transmission from his true employer, Vilia Calimondra. She ordered him to deliver a transmission to her two grandsons Odion and Daiman which ordered them to cease fighting and join forces against the Bactranate. The two Sith Lords abandoned their fight and then attacked the Bactranate fleet in the Gazzari system. They wiped out six ships and pursued the remaining six to Jutrand."}, {"tag": "p", "text": "Odionate and Daimanate forces then invaded Jutrand. This was followed by a general invasion of the Bactranate which collapsed within a few days. During a subsequent bequest convened by Vilia, Daiman obtained control of Industrial Heuristics. However, Odion protested and claimed that he had a right to the company since it had been headquartered on Jutrand, which had been bequeathed to him. As quid pro quo, Vilia allowed him to keep Jutrand and arrange for the transfer of two legions of Trandoshan slave warriors from her own forces to augment Odion's troops. Bactra's remaining corporate assets were redistributed among her other grandchildren particularly Lioko and Malakite whose forces had also participated in the invasion. During the bequest, Chagras's grand-daughter and Sith Lord Arkadia Calimondra cited an intelligence source that Bactra had gone into hiding at a Quermian retirement colony."}, {"tag": "p", "text": "The Sith Lord Odion also acquired Jubalene where he enslaved the population and put them to work in war forges. Meanwhile, he had all the children within his portion of the former Bactranate including those in Jutrand and Jubalene imprisoned and indoctrinated at planet-sized orphanages known as cloisters. To satisfy his sadistic and nihilistic pleasures, Odion also made use of Bactra's now redundant bankers and attorneys by coercing them into participating in violent arena fights against wild beasts like rancors and gundarks. The elimination of the Bactranate also enabled Odion to restart Project Pandemonium, a project to locate the ancient Sith artifact known as the Helm of Ieldis. It was capable of driving sentient beings into a mindless homicidal frenzy. As part of his campaign to launch a galactic apocalypse, Odion's forces also invaded Sarrassia to secure information on the Helm. While Sarrassia had nominally been under the influence of Bactra who ended the religious conflict between the Grumani Hierophants and the Spumani Crusaders, he had left the planet alone. In contrast, Odion destabilized Sarrassian society."}, {"tag": "h2", "text": "Appearances"}]}