{"url": "Battle_of_Jussafet_Four", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Hunt for Zsinj", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Jussafet Four"}, {"tag": "p", "text": "A battle at Jussafet Four was an engagement between the New Republic fleet under the command of Han Solo and Warlord Zsinj's planetary invasion force, the Raptors."}, {"tag": "p", "text": "Duros monitoring the Jussafet system reported a large force of Raptors attacking the planet, indicating that the battle was not one of Zsinj's many feints. But before the battle could get under way, two of Zsinj's brainwashed agents, Nuro Tualin and Tal'dira had to be prevented from assassinating Han Solo and Wedge Antilles."}, {"tag": "p", "text": "After the sleeper agents were eliminated, the battle went well for the New Republic. Polearm Squadron attacked numerous Raptor sites on the ground and soldiers supported by Wraith Squadron took the main Raptor base near the planetary capital. Rogue Squadron and Nova Squadron took out the supporting corvette and TIE Fighters in the nearby asteroid belt, and Mon Remonda traced their escape vectors to locate the rest of Zsinj's attack fleet, consisting of two Carrack-class cruisers, and a modified freighter vessel. The latter three ships fled before Mon Remonda reached them."}, {"tag": "p", "text": "After the fighting was concluded, the New Republic forces captured as many Raptors as possible along with several of their Y-4 Transports. What the New Republic forces couldn't claim, they left for the local defense forces."}, {"tag": "p", "text": "The performance of the New Republic forces in defending a world loyal to the Galactic Empire impressed Admiral Teren Rogriss, who was Solo's Imperial counterpart in hunting Zsinj. Rogriss entered the system after the battle, and made an offer to Solo to share intelligence on Zsinj. This détente would later prove instrumental to Solo's mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}