{"url": "Terex", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Criminals", "Category:Cyborgs", "Category:First Order Security Bureau personnel", "Category:Humans", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Terex"}, {"tag": "p", "text": "Terex was a human male who served as a stormtrooper designated TK-603 in the Galactic Empire. In the years following the Battle of Jakku, Terex became the leader of a crime syndicate on Kaddak known as the Ranc gang. Still determined to rebuild the Empire, Terex joined the First Order, an Imperial remnant that had relocated to the Unknown Regions. By 34 ABY, Terex had become an agent in the First Order's Security Bureau. During the early phase of the Cold War, Terex fought the Resistance starfighter pilot Poe Dameron and his Black Squadron. Terex also blackmailed the Resistance technician Oddy Muva into spying on Poe and Black Squadron by holding his wife Sowa Chuan captive."}, {"tag": "p", "text": "After being bested by Poe on Ovanis and Megalox Beta, Terex embarked on a rogue mission to destroy the Resistance. Terex retook control of the Ranc gang and tried to destroy Poe and the Resistance. However, he was outsmarted by Black Squadron a third time. Following his failed bid to destroy the Resistance, Terex was arrested by Commander Malarus and brought back to the First Order for punishment. While Terex was condemned to the mines, he managed to convince Captain Phasma of his loyalty to the First Order. As a result, he was given a second chance and was fitted with a cyborg construct."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "During the Galactic Civil War, Terex, designated TK-603, was a stormtrooper of the Galactic Empire. He learned that ambition was forbidden, and that conformity was everything. TK-603 was stationed at the Rothana Imperial Shipyards during the last years of the Galactic Civil War. He guarded the base and knew how to access its security codes. During the Battle of Jakku, Terex was pulled from sentry duty to bolster up the frontline assault squads. TK-603 ended up on the same team with a man named Corlac, who answered to the call designation \"TK-605.\" The Battle of Jakku was the last major battle of the Galactic Civil War which brought the end of the Old Empire."}, {"tag": "p", "text": "After seeing the devastation of the Imperial fleet, TK-603 expressed disbelief at the Empire's defeat while his squadmate TK-605 remarked that it was the Empire's end. When their corporal ordered them to fight to the last, TK-605 shot him dead. When TK-603 protested, TK-605 responded that he did not feel like fighting to the last man and asked TK-603 if he agreed. When TK-603 asked what their orders were, TK-605 responded that there was no one left to give orders because the Empire had thrown everything they had against the New Republic and lost. TK-605 began to remove his stormtrooper armor in order to evade the New Republic. Despite his misgivings, TK-603 obliged."}, {"tag": "p", "text": "As they began burying their armor, TK-605 introduced himself as Corlac and asked TK-603 what was his name. When Terex responded that his callsign was TK-603, Corlac chastised him for refusing to accept that the Empire was gone. Terex reluctantly introduced himself and remarked that it was a long time that he had thought of his old identity. After burying their armor, they decided to hide until night and then try to find a settlement. Corlac proposed that they find some work and figure a way offworld. Terex replied that it was difficult for him to leave his armor behind since they had been trained to treat the armor as part of themselves but surmised it was now trash. Corlac complimented Terex for realizing this fact."}, {"tag": "p", "text": "Terex and Corlac spent about a year on Jakku building an \"Ugly\" out of the head of an AT-AT walker, a pair of S-foils, and a pair of TIE Interceptor wings. While Corlac wanted to head into the Outer Rim Territories and link up with his criminal contacts, Terex was determined to rejoin the Imperial remnants and put down the Republic. Corlac convinced Terex to focus on building underworld contacts first. Terex agreed to leave Jakku but not before retrieving his stormtrooper armor and uniform."}, {"tag": "h3", "text": "Building the Ranc gang"}, {"tag": "p", "text": "While departing Jakku, Terex expounded that the Empire stood for law and order and opined that they could not abandon it. He and Corlac traveled to the Outer Rim planet of Kaddak, which was then a remote outpost. At a cantina on Kaddak, Corlac introduced Terex to two female pirates named Wenda and Bett. Corlac told Terex that Wenda and Bett were going to help them to restore the Empire. The four hatched a plan to commandeer an Imperial shipyards at Rothana by using Terex's knowledge of the base to bypass its security. They would then use the base's resources to build a new Imperial fleet. However, Corlac, Wenda, and Bett secretly had no intention of reviving the old Empire. Their true plan was to use the fleet to start a criminal empire and kill Terex should he refuse to join them."}, {"tag": "p", "text": "At the Rothana Imperial shipyards, Terex, Corlac, and the pirates were sealed up in the repair bay. After several attempts, Terex managed to bypass the shipyard's security. After the pirates had taken control of the shipyards, Terex discovered the late Grand Moff Wilhuff Tarkin's flagship Carrion Spike. While repairing the ship, he overheard Corlac, Wenda, and Betta planning to kill him. After learning of their treachery, Terex uses the Carrion Spike's weapons systems to obliterate the control station where they were meeting, killing Corlac and the two pirates. When the other pirates including Wisper and Zumgi confronted Terex, he told them that he now accepted that the Empire was gone forever and took control of the gang."}, {"tag": "p", "text": "Realizing that the Empire being gone, and thus the apparent end to law and order, meant he now can do anything he ever wanted, he then embraced a life as a crime lord. Now calling himself \"Lord-General Terex,\" Terex built a successful criminal empire known as the Ranc gang, with Kaddak as his main base of operations. During this time, he had amicable dealings with Grakkus the Hutt, who was imprisoned on Megalox Beta."}, {"tag": "h3", "text": "Cold war"}, {"tag": "h4", "text": "Joining the First Order"}, {"tag": "p", "text": "After years of controlling his empire, Terex received tribute from two alien pirates in the form of a set of armor that resembled Imperial stormtrooper armor, but was modern in design. The pirates who gave Terex the armor informed him that it was stolen from a cargo shipment addressed to the First Order. Terex took an interest in the organization and joined the First Order, eventually being granted the rank of agent. Terex passed control of his empire to his right hand man, Wisper. Several senior First Order officers including Captain Phasma despised Terex for his criminal origins and he was not granted the position that he rightfully believed he deserved."}, {"tag": "p", "text": "As a First Order Security Bureau Agent, Terex ran a spy ring consisting of individuals who had been blackmailed into spying for the First Order. Terex maintained his leverage over these individuals by keeping their loved ones as slaves aboard the Carrion Spike. These alien slaves served Terex's every whim. While Phasma regarded Terex's slave harem as at odds with the First Order's values, Terex believed that he had a right to enjoy life. One of these slaves was the Abednedo woman Sowa Chuan, whose husband, Resistance technician Oddy Muva, had been blackmailed into spying on the Resistance squadron Black Squadron. At one point during the Cold War, Terex had an encounter with Resistance pilot Venisa Doza, who escaped from him with her astromech droid Torch by setting off multiple explosions and having Torch pilot a TIE/fo space superiority fighter as a diversion."}, {"tag": "h4", "text": "Battle of the Crèche"}, {"tag": "p", "text": "After the events of Operation: Sabre Strike, Terex was sent by Phasma to capture Poe Dameron on the planet Ovanis. Terex was aboard the Carrion Spike being serviced by several alien slaves including Chuan when Phasma contacted him. Phasma briefed Terex about Dameron and his role in stealing information that Senator Erudo Ro-Kiintor was passing to the First Order. Due to the urgency of the information, Phasma assigned him considerable resources to complete the mission and told him that the true offensive would begin soon."}, {"tag": "p", "text": "When Terex asked if Starkiller Base was ready, Phasma expressed her unhappiness that he had been prying into the First Order's secrets. After Terex reassured her that it was his job to keep secrets, Phasma reiterated that Dameron had to be found because they needed the information he had stolen. Terex expressed annoyance at Phasma's command not to fail and remarked that he had been doing this work since before she had been born. Phasma replied that every officer in the First Order knew exactly about his shady past and warned him not to fail his mission. Terex traveled to Ovanis with a First Order landing platform, several TIE/fo space superiority fighters, Atmospheric Assault Landers, and stormtroopers."}, {"tag": "p", "text": "Following the tracker planted on Dameron's starfighter, Terex entered the planet's underground tunnels on a speeder bike, flanked by a squad of stormtroopers, who were equipped with jetpacks. Encountering a pair of large, sealed doors, Terex had his squad destroy the barricade, voicing the belief that obstacles were for little people, and he entered the central Cave of the Crèche. Upon entering, Terex was confronted by the Crèche cultists and their leader, an elderly woman, who ordered them to leave."}, {"tag": "p", "text": "Terex managed to force his way into the cave with his stormtroopers. When the Crèche elder told him that her people were guarding a giant blue egg, Terex responded that he was searching for Dameron. Though the woman feigned ignorance, one of Terex's stormtroopers managed to track down Dameron tracker. Terex denounced the Crèche as liars and threatened to torch their egg if they did not surrender Dameron. Unwilling to see the Crèche people suffer, Dameron gave himself up. The Resistance pilot then offered to negotiate with Terex and told him that he had \"all the leverage here.\" Meanwhile, Terex's forces were attacked by Dameron's Black Squadron comrades."}, {"tag": "p", "text": "Unperturbed, Terex ordered his flametroopers to torch the egg and revealed that he had brought reinforcements including the Maxima-A class heavy cruiser Ravenous and more TIE fighters. Holding the upper hand, Terex demanded that Dameron turn over the data that he had stolen. As Terex continued talking, the Crèche egg hatched, giving birth to an enormous blue winged creature which attacked all the other life forms present. Dameron seized the opportunity to attack Terex with a sucker punch. Terex regained the upper hand but this distraction enable Dameron's droid BB-8 to steal his blaster. While Terex's stormtroopers fought the creature, Dameron demanded that Terex call off his fighters and troops."}, {"tag": "p", "text": "Terex responded that his troopers were defending them against the Crèche creature. When a black winged creature appeared and began to do battle with the first, Terex attacked Dameron. During the fight, Terex demanded to know why Dameron was fighting to protect others and concluded that the Crèche knew something that was of interest to both him and Dameron. Terex attempted to shoot Dameron dead but BB-8 shocked him with his arc welder. His troops defeated, Terex found himself at the mercy of Black Squadron and the Crèche cultists. However, Dameron did not want to trigger a war between the First Order and the New Republic and decided to release Terex and his men once they had already left the planet. The Crèche departed on the back of the black, winged creature, which they regarded as their savior. Dameron then radioed for the Ravenous to pick up Terex and his surviving troops."}, {"tag": "h4", "text": "Megalox Beta"}, {"tag": "p", "text": "After the First Order learned that Dameron and his Black Squadron comrades were traveling to the prison world of Megalox Beta to question Grakkus about the explorer Lor San Tekka's whereabouts, Terex bribed his way inside Grakkus' fortress within the prison compound. Megalox Beta was a high gravity world and the prison was protected by a gravity field. He also bribed the prison warden Luta and her guards into letting Black Squadron into the prison but abandoning them to the prisoners. Despite his efforts, Dameron and Black Squadron managed to fight their way into Grakkus' fortress."}, {"tag": "p", "text": "Since Terex and Grakkus knew each other, he was able to make a deal with the imprisoned Hutt for information regarding Tekka's location, which Grakkus claimed to know. However, when Dameron arrived, Grakkus changed the terms of the deal, declaring that he would only give the information to one of them—whoever successfully managed to break him out of prison. Terex protested but Grakkus retorted that he had made lots of deals and that he was solely concerned with escaping Megalox. Before leaving, Terex told Dameron \"may the worse man win.\" After leaving Grakkus' palace, Terex taunted Dameron's fellow pilots and vowed to return."}, {"tag": "p", "text": "Terex then met with three other crime bosses Papa Toren, Kan Be, and Isin. When Terex identified himself as a First Order intelligence agent, Kan Be mocked him and likened his uniform to a \"hat on an aiwha.\" When Terex alluded to his past as a stormtrooper, Toren's Ximpi told the agent that his master was only interested in knowing what he wanted. Terex explained that he had come to recruit their help in overcoming Grakkus' posse, knowing that the crime bosses hated Grakkus and that their gangs together outnumbered Grakkus' forces."}, {"tag": "p", "text": "Terex explained that Grakkus had broken a deal with him. He tasked the crime bosses with killing Grakkus' guards, Dameron, and his Back Squadron. Terex also planned to interrogate Grakkus and kill him. In return for their help, Terex promised to get them out aboard his ship, the Carrion Spike. The three gangsters accepted Terex's deal and assembled their gangs for an assault on Grakkus' fortress. Terex then stood by Kan Be, Isin, and Torn as their gangs stormed fortress. However, Dameron and Black Squadron helped the Hutts to fight off the assault."}, {"tag": "p", "text": "Terex's plan encountered another obstacle when Black Squadron's astromech droids disabled Megalox's gravity field. Terex and his allies were then stuck on the ground by the planet's high gravity. Dameron and his Black Squadron were unaffected because they wore gravity belts and were able to rescue Grakkus. While Black Squadron and Grakkus escaped the prison, Terex then summoned the Carrion Spike. One of his droids evacuated him aboard the ship's gangplank. When Terex's former allies demanded their ride, Terex responded that they had failed in their mission and left them to die."}, {"tag": "p", "text": "Furious that he had been outsmarted by Poe a second time, Terex commanded the crew of the Carrion Spike to attack the space station above Megalox Beta, disabling the prison's gravity field. He then proceeded to attack the station's escape pods and shuttles to hamper their evacuation efforts. When Dameron and his Black Squadron approached the Carrion Spike with their starfighters, Terex ordered his crew to fight the Resistance starfighters. After the ship began to sustain heavy damage, Terex consented to his crews' advice to cloak his ship and retreat. For his failure to transmit Grakkus' information, he was ordered by Phasma to return to First Order space. Despite her warning, Terex chose to ignore her."}, {"tag": "h4", "text": "Return to Kaddak"}, {"tag": "p", "text": "While his First Order crew made their final repairs to the Carrion Spike, Terex retreated to his quarters. When the First Order corporal asked how long they would remain outside First Order Space, Terex responded that they were outside First Order Space for a reason. When his slaves Sowa Chuan and an Umbaran female asked if they could do anything for him, Terex pointed his blaster at them and told them to leave him alone. Terex then reflected on his past experiences during the Battle of Jakku. After ending his contemplation, Terex stared at his Ranc gang armor, which was made from his modified stormtrooper armor."}, {"tag": "p", "text": "Shortly later, one of his bridge crew reported that they had received a priority transmission from Captain Phasma demanding to know why he had not reported for their debriefing. When the crew mentioned that Phasma was requesting his after-action report, Terex disabled the Carrion Spike's communications, engines and weapons systems with \"Authorization Code TK-603.\" He then donned his Ranc gang armor where he confirmed that he had indeed disabled the ship's systems. Taking full control of the Carrion Spike, Terex returned to Kaddak. Terex tasked the corporal with looking after the Carrion Spike and told the man that he was looking for something important in light of their recentness string of defeats."}, {"tag": "p", "text": "After disembarking from the Carrion Spike, Terex walked to the Sliver's Level 72 where a Zabrak pickpocket tried to steal his blaster. At first, he was going to shoot the boy but the boy's mother interceded and pleaded for mercy, claiming the boy did not know who he was. Terex appeared to reach for his blaster, but instead he pulled out a credit from his pouch and tossed it to the boy, saying that he knows who he is now. Terex then walked into a cantina, where a table was waiting for him. Several of the patrons were shocked to see the former crime lord visiting but welcomed him back. He then spoke to Wisper and the other Ranc gang associates including Zumgi. After exchanging pleasantries, Wisper asked why he had returned in his old armor. When Terex replied that he had come to take back control of the Ranc gang, Wisper tried to shoot him but Terex drew his vibroblade and forced her to drop her gun. Wisper protested that Terex had given up leadership of the gang when he joined the First Order. Terex countered that her mistake was to think that she owned the gang. When Wisper tried to reassert her authority over the gang, Zumgi shot her dead and welcomed Terex back."}, {"tag": "p", "text": "Terex did not return to Kaddak alone. Meanwhile, the Resistance pilot Poe, General Organa's spymaster C-3PO, BB-8, and the technician Oddy Muva recovered the BX-series droid commando N1-ZX, who had been captured by the Ranc gang. As a member of the Resistance spy droid network, N1-ZX purportedly had information on the First Order including the location of Supreme Leader Snoke. Terex and his gang then went to the Carrion Spike where they took control of the ship from the First Order crew. When the First Order corporal protested that the ship was First Order property, Terex was unperturbed and responded that he and his criminal associates would destroy the Resistance, something that had eluded the First Order. Terex and his crew then flew the Carrion Spike over Kaddak and placed a bounty on Poe's head. However, Poe and the droids managed to escape."}, {"tag": "h4", "text": "The rogue expedition"}, {"tag": "p", "text": "Despite the crowd's efforts, Poe and the droids managed to escape aboard his T-70 X-wing starfighter Black One. However, Terex and his lieutenant Zumgi had arranged for Poe's escape in order to track him and the droid down. After receiving word that their sensors had locked on to Dameron's X-wing, Terex mustered his fleet of \"Uglies.\" Unknown to Terex, they were followed by the Resistance technician Oddy, who was determined to rescue his wife Sowa from captivity. After mustering his fleet of \"Uglies,\" Terex briefed his lieutenants Zumgi and Brrang about his plan to track Poe's X-wing and attack once he had exited hyperspace. Terex then retreated to his private quarters to inform Captain Phasma about his plan to destroy Poe and the Resistance."}, {"tag": "p", "text": "When Phasma objected to his costume, Terex responded that he was Lord-General of the Rancs of Kaadak. Phasma then reminded Terex that he had been ordered to return to First Order Space to account for his failure to obtain information from Grakkus the Hutt that was crucial to the next stage of their war effort. Phasma also warned him that Kylo Ren had taken an interest in his \"missteps.\" Terex was unmoved and responded that he had once met Darth Vader. Terex then told Phasma of his plan to use N1-ZX to lead his Ranc forces to the Resistance base so that they could destroy General Organa and the Resistance. Phasma chastised him for disobeying Snoke's orders to avoid open hostility against forces aligned with the New Republic. Terex responded that he was not solely a First Order officer and that his pirates were not First Order personnel. He boasted that they would accomplish what the First Order could not. When Phasma warned him that the consequences of insubordination would be dire, Terex mocked the First Order for not accomplishing anything. Despite her protests, he told her to have faith in his plans and shut down the transmission. Terex then ordered Sowa Chuan to serve him beverages."}, {"tag": "p", "text": "However, Poe, after consulting with the droids, realized that the information N1-ZX was carrying was a trap set by Terex. He exited hyperspace in a system with a desert world. Terex and his Ranc fleet followed but realized that Poe had not led them to the Resistance base. Despite this setback, Terex ordered his \"Uglies\" to kill Poe. Following a brief dogfight, Poe's X-wing was shot down and crashed-landed on the desert world. Unknown to Terex, Oddy Muva managed to overpower Zumgi and forced the gangster to lead him to Terex's haven. After Terex's forces forced Dameron's ship down, Terex then led his ground forces to capture him. They were ambushed by BB-8, who had chained his chassis to a stalactite. Despite BB-8 loosening rocks over Terex's gang, the Lord-General of the Rancs managed to shoot down the droid."}, {"tag": "p", "text": "He then captured C-3PO, who had decided to stay behind to give Poe and N1-ZX more time to escape. However, C-3PO then spoke to the Fjor-bats and they attacked Terex and his men. After driving the bates, Terex then shot off one C-3PO's legs and extracted information from him. He then called to Dameron as his men spread themselves out to find him. Meanwhile, Terex's fleet of \"Uglies\" was attacked by Poe's Black Squadron mates. Black Squadron was aided by Oddy, who escaped with the slaves in escape pods and reprogrammed the Carrion Spike's battle computers to attack the \"Uglies.\" One of Poe's pilots, Temmin, also managed to transmit a droid personality template that reprogrammed N1-ZX with the programming of the murderous B1 battle droid \"Mister Bones.\" \"Mister Bones\" quickly slaughtered Terex's landing party but was disintegrated by Terex, who blasted off his head. Terex then asked Poe if he had any more droids for him to destroy."}, {"tag": "p", "text": "Terex was then subdued by Dameron, who threw him to the ground. Pointing a blaster at him, Poe dismissed him as a \"twisted evil piece of trash\" and told him that he had it coming round. Terex however tossed a knife at Poe, wounding him in the hand. Before Terex could kill him with his vibroblade, he was subdued by BB-8. Meanwhile, Terex's Ranc forces were destroyed by First Order forces led by Commander Malarus, who also destroyed his flagship Carrion Spike. Malarus then led a landing party to the desert world and met Poe and the captive Terex. Malarus reassured Poe that she did not have any quarrel with the Resistance but had come to apprehend Terex. Before handing him to Malarus, Poe played a recording by Temmin reporting that Terex fleet had been destroyed by Black Squadron and the First Order. When Terex countered that Poe had lost one of his pilots L'ulo L'ampar, Poe countered that he had only lost a friend while Terex had lost everything. Poe told a dejected Terex that his fight had ended while his had only begun."}, {"tag": "h4", "text": "Imprisonment"}, {"tag": "p", "text": "Terex was then taken aboard a Resurgent-class Star Destroyer where he was imprisoned. There, he demanded to speak with Phasma about ending the Resistance. Phasma came in to his cell to talk to him about the information he retrieved from C-3PO. There, she told Terex that it was useless due to BB-8's attack on him. Terex then tried to convince Phasma that he was valuable since he was one of the First Order's valuable agents. Phasma told him he was but not anymore since he disobeyed the Supreme Leader's orders. Terex then tried to convince her that he was still loyal to the First Order, but she left him to think of a way to change her mind."}, {"tag": "p", "text": "Terex told Phasma of his attempt to bring the Empire back following its defeat at Jakku and how it failed. He then gave his position as a king in the underworld to join the First Order to bring order and control back to the galaxy. This convinced Phasma to not send Terex to the mines. Terex was then taken by two troopers where he was given a cyborg construct to ensure his loyalty."}, {"tag": "h4", "text": "Continued service"}, {"tag": "p", "text": "Terex then went with Malarus aboard her transport. Together, they and their troops then boarded the Romary. Terex then told Malarus about Captain Perrili's business with the Resistance on several occasions."}, {"tag": "p", "text": "Terex then went with Malarus aboard the Enshado where they siezed the fuel from a tanker. There, they attempted to fight Dameron and his Black Squadron to prevent him from taking the fuel. After Malarus failed, Terex told her that that Dameron was that good. He was then knocked down by Malarus. After the Enshado returned to First Order space, Terex told Malarus several of his secrets concerning Dameron and his next mission. They then went to Abednedo, where they found Muva and Chuan. Together, they took Muva."}, {"tag": "p", "text": "Terex then interrogated Oddy for information on the Resistance's forces aboard the Enshado. However, Terex thought about Oddy's offer about removing the implant, but continued with interrogation. He told Malarus that Oddy was proving to be resistant. Despite, Malarus told Terex to keep Oddy alive to serve as bait for Dameron."}, {"tag": "p", "text": "After Dameron and Snap Wexley were captured, Terex was then ordered to kill Oddy by Malarus. As Terex prepared to execute Oddy, Terex tried to resist his implant and told Oddy that Dameron was onboard before. He then joined Malarus in pursuing Suralinda Javos and eliminating the remaining members of Black Squadron. They then saw that Dameron had escaped. They then watched as Oddy made a suicide run on the Enshado before they made their escape into hyperspace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Terex was a human male. At the time of the Battle of Jakku, he had brown hair and gray eyes. By the First Order–Resistance conflict, his hair had turned gray and his face had several scars. Despite the Imperial defeat on Jakku, Terex struggle to accept the fact that the Empire had fallen and was reluctant to abandon his identity as a stormtrooper. Terex's patriotic and idealistic zeal contrasted with the opportunistic and pragmatic streak of his friend Corlac. Corlac took advantage of their friendship to manipulate Terex into helping his criminal associates access the Rothana Imperial Shipyards. Corlac and his associates conspired to kill Terex but the former stormtrooper killed them instead. Accepting that the Empire was dead, Terex became the leader of the Ranc gang. However, he reconsidered his decision after learning about the existence of the First Order."}, {"tag": "p", "text": "Like many Imperial and First Order officers, Terex was extremely arrogant, maintaining a twisted sense of decorum at all times. He was often sarcastic and humorous, outwardly appearing genial and reasonable, but failing to mask the callous ruthlessness that let him brutalize the Crèche people with ease. He also showed very little respect for the lives of others, maintaining a group of slaves on the Carrion Spike and failing to understand Dameron caring about the Crèche. An avid believer in Palpatine's Empire, Terex hoped the First Order could grow to become as the Empire was at the height of its power. He spoke of his time in the Stormtrooper Corps many times to his troopers, and as an older man he rejected ideas of conformity and curbing ambition, seeing the individuals behind the armor as people whom he hoped to teach. Terex also enjoyed hunting."}, {"tag": "p", "text": "Terex was willing to use any means to get results. He hired several criminals to attack Grakkus' fortress on Megalox Beta. Grakkus hoped to extract information about Tekka from the Hutt and then kill him after he had outlived his usefulness. Terex was a good negotiator and offered Grakkus' rivals Papa Toren, Kan Be, and Isen the opportunity to escape the prison world if they helped him to attack Grakkus' fortress. Terex could also be vindictive and abandoned the three crime lords after they failed to kill Grakkus and Black Squadron. When Poe and Black Squadron beat him to Grakkus, Terex attacked the Megalox Beta space station in retaliation and tried to destroy Grakkus' shuttle. Still, Terex was pragmatic enough to recognize defeat and was willing to retreat in order to fight another day."}, {"tag": "p", "text": "Despite Terex's ruthless and violent streak, he was also capable of mercy. On one occasion, he spared a Zabrak child pickpocket after the boy's mother interceded on his behalf. Instead of shooting the boy, Terex gave him a credit. Terex's vendetta against Poe Dameron led him to reassert control of the Ranc gang and plant false intelligence in the Resistance BX-series droid commando N1-ZX in an ambitious attempt to destroy the Resistance. Terex's ambitions and vendetta against Dameron led him to willfully disregard Supreme Leader Snoke's directive not to engage in hostilities with the New Republic and the Resistance. Terex was however outsmarted by Poe, who realized Terex's plan and led him into a trap on an uncharted desert planet. Terex's forces were destroyed by the combined efforts of Black Squadron, the rebellious spy Muva, and Commander Malarus's forces."}, {"tag": "h3", "text": "Relationships"}, {"tag": "p", "text": "Terex came to regard the Resistance pilot Dameron and his Black Squadron as implacable obstacles to his ambitions of advancing his own career in the First Order. As a spymaster, Terex blackmailed several individuals including the Resistance technician Oddy Muva into spying for him by holding their loved ones ransom including Oddy's wife Chuan. Terex also had a tense relationship with his superior, the First Order Captain Phasma. Terex's indulgence in alien slaves, Wookiee–brewed brandy, and Kessel spice earned him the contempt of the more dutiful Captain Phasma. Terex believed that he had a right to indulge in these luxuries in return for his services to the Empire. Terex also displayed his disdain towards Captain Phasma when he disobeyed her orders to report back to First Order Space for a debriefing following his failed attempt to acquire information about Tekka from Grakkus. These tensions reached a climax when Terex willfully disobeyed Phasma's orders in an ambitious plot to use the Ranc gang to destroy the Resistance."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As an Imperial stormtrooper, Terex was initially assigned to sentry duty at the Rothana Imperial Shipyards before being reassigned to front line assault during the Battle of Jakku. Due to his work, Terex was familiar with the shipyard's access codes and also knew how to repair starships. Terex helped his old comrade Corlac build an \"Ugly\" out of various starship and vehicular parts. As the crime lord of the Ranc gang, Terex knew how to operate weapons systems, lead his forces, and once fought a Hutt in hand-to-hand combat. He also owned at least one First Order speeder bike."}, {"tag": "p", "text": "As a First Order agent, Terex was a skilled tactician and a master of intelligence regarding various top secret matters in the galaxy, including the details of Starkiller Base, something Phasma suggested he should not have known about. He was also acutely aware of Dameron and his history. Physically, he was a competent yet dirty fighter, holding his own against Dameron on more than one occasion. However, Dameron on one occasion outsmarted him by giving Terex a sucker punch. While Terex was distracted, BB-8 stole his blaster. Terex was also a competent negotiator who managed to convinced three crime lords to assist him by appealing to their desire to escape Megalox prison and hatred for Grakkus."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a stormtrooper, Terex wore the standard white armor and black overalls. As a First Order agent, Terex wore a modified black uniform that was reminiscent of the stormtrooper overalls. As the leader of the Ranc gang, Terex wore a costume consisting of modified stormtrooper armor outfitted with various accessories and painted with the gang's insignia. He also kept a collection of Imperial helmets and equipment from the Old Empire. He also had a rifle that had two electric blades on it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}