{"url": "Teroch/Legends", "categories": ["Category:Legends articles", "Category:Clan Awaud", "Category:Humans", "Category:Males", "Category:Mandalorians", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Teroch"}, {"tag": "p", "text": "Teroch was a Human male Mandalorian, born on the planet Mandalore in the galaxy's Outer Rim. Tall and muscular, with considerable martial skills and little interest in politics, Teroch chose to make his living as a mercenary, working for a variety of clients over the years. He was a friendly man and a skilled warrior, who cared greatly for his clan and took part in their migration from Mandalore to the backwater world of Vlemoth Port, where they established a new settlement known as Arumorut. Over the decades, Teroch fought against the stormtrooper forces of the Galactic Empire numerous times for several clients, and in time, he assumed the role of gogi, a veteran Mandalorian instructor. When he wasn't working, Teroch patronized the Sheb Niktose cantina at Arumorut, where he drank ne'tra gal and shared stories with the bar's other customers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Teroch was a male Mandalorian, born on the planet Mandalore—the Mandalorians' cultural homeworld, located in region of the galaxy known as the Outer Rim Territories—in the years prior to the Great Clan Wars. A member of Clan Awaud, Teroch trained in combat from childhood, before undergoing his verd'goten—the traditional Mandalorian rite of passage that marked the transition into adulthood—at the age of thirteen, after which he became a recognized adult in Mandalorian society. In time, Teroch elected to use his skills as a soldier to earn a living as a mercenary, and he became friends with the chieftain of Clan Awaud, Nam Beroya. When tensions on Mandalore between the pacifistic New Mandalorian sect and the radical Death Watch were on the rise, Chieftain Beroya decided to avoid the ideological schism and take his clan offworld; Teroch followed, moving around the galaxy as the Mandalorian's nomadic ancestors had."}, {"tag": "p", "text": "During the Clone Wars, a pan-galactic struggle between the Galactic Republic and the separatist Confederacy of Independent Systems, Teroch and several other mercenaries from Clan Awaud worked security for the Confederacy, and later took jobs that were offered by the Hutts. After the end of the war, and after years of living on the move, Teroch and his clan felt the need to finally settle down and establish a permanent home for themselves. They traveled to the planet Vlemoth Port in the Outer Rim's Instrop sector, and in the forested northern foothills, founded a Mandalorian settlement they called Arumorut. From Arumorut, Teroch and his peers contracted mercenary and bounty hunter work throughout the regions of surrounding space, along the Slice and the Western Reaches. Teroch found himself pitted against the forces of the Galactic Empire multiple times over the next two decades, killing a large number of the Empire's stormtroopers while battling Imperial patrols for clients. He also took part in Arumorut's defense of an allied Talz village nearby, after it came under attack by Zygerrian slavers. The Mandalorians were ultimately successful in driving the Zygerrians from Vlemoth Port, but not before they managed to capture dozens of Talz from the Gnaaz tribe and Nam Beroya, who had been wounded in battle. With Beroya believed dead by the members of Clan Awaud, his adopted daughter Vera succeeded him as chieftain, with Teroch's full support."}, {"tag": "p", "text": "As he grew older, Teroch eventually became a gogi, an aged veteran who served as an instructor for younger Mandalorian scouts. By the time of the Galactic Civil War, Teroch could be found on occasion at the Sheb Niktose cantina, located near the mountain lake that sat close to Arumorut. It was at the Sheb Niktose that Teroch met a group of operatives from the Alliance to Restore the Republic, who had come to Arumorut in the hopes of recruiting the resident mercenaries in a battle against the Galactic Empire. Though Teroch had been in the midst of a mug of ne'tra gal with another Mandalorian, when he caught sight of the newcomers he was quick to invite them over to the bar to talk, spending nearly an hour with the rebel operatives, discussing the history of the clan while doing several shots of tihaar together. He was later present at the home of Chieftain Vera Beroya when the rebels came to negotiate for her assistance, and conferred with Beroya on the logistics of the mission they were presented with."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Teroch was a Human male with a tall, muscular frame and a dark brown complexion. He had brown eyes and black hair, with a thick beard that had grayed with age, and a number of scars. Teroch cared little for politics—whether they involved the localized disputes between Death Watch and the New Mandalorians, or more large-scale matters like the Galactic Empire's activities—preferring a more simple existence as an apolitical mercenary. Possessed of a friendly demeanor, Teroch liked to talk with others, and he enjoyed drinking ne'tra gal or tihaar when he wasn't working."}, {"tag": "p", "text": "A traditional Mandalorian, Teroch was an adherent of the Resol'nare, the six tenets of Mandalorian culture. He spoke the Mandalorian language of Mando'a, in addition to Galactic Basic Standard, and wore a suit of personally-owned Mandalorian armor. Teroch cared for the members of Clan Awaud, as well as its chieftains, and as a gogi, the veteran warrior passed along his knowledge to younger Mandalorian soldiers under his tutelage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Teroch was first introduced to the Star Wars universe in Fantasy Flight Games' 2016 Protectorate Starfighter Expansion Pack for the Star Wars: X-Wing Miniatures Game. Teroch later appeared in Fantasy Flight Games' roleplaying game adventure book Friends Like These, published on December 8, 2016. Friends Like These elaborated on Teroch's history and ties to Clan Awaud, in addition to providing a full-body illustration of the Mandalorian veteran."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}