{"url": "Terminus/Legends", "categories": ["Category:Legends articles", "Category:Corellian Trade Spine", "Category:Kallea sector planets", "Category:Outer Rim Territories planets on the Hydian Way", "Category:Shadowports"], "nodes": [{"tag": "h1", "text": "Terminus"}, {"tag": "p", "text": "Terminus was a planet located within the Terminus system of the Outer Rim Territories. Terminus sat on the juncture of two of the galaxy's most important trade routes, the Hydian Way and the Corellian Trade Spine making it a highly trafficked port despite its remote location on the edges of the Outer Rim's Western Reaches. Its proximity to Wild Space and the Unknown Regions meant that strange and unfamiliar ships were a common sight in Terminus' skies."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Outer Rim's Kallea sector, at the junction of two of the galaxy's major trade routes—the Hydian Way and the Corellian Trade Spine—Terminus sat on the very fringes of the Outer Rim's Western Reaches. The planet's unique location made it a bustling shadowport, its skies filled with diverse ships piloted by unknown species from Wild Space and the Unknown Regions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Galactic Civil War, Terminus had fallen under the sphere of influence of the Gorensla Hutt clan. In 0 ABY, Terminus became a hunting ground for a group of exiles from the Red Nebula, who kidnapped a number of smugglers and mercenaries to facilitate a heist of the Nebula's Great Life Jewels. The exile leader Klysk took captured passing travelers Han Solo and Chewbacca as they passed through Terminus, among others."}, {"tag": "p", "text": "Terminus was later portrayed in the popular opera The Kallea Cycle, which depicted the Freia Kallea's establishment of the Hydian Way several millennia before.\nIn 4 ABY, the remaining Nagai survivors of their defeat at the hands of Alliance of Free Planets forces at the Second Battle of Endor traveled to Terminus, using it as a waypoint for their retreat up the Hydian Way and the Corellian Trade Spine. The Alliance forces followed and clashed with the Nagai at Terminus, a battle in which the Nagai raiders prevailed."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Terminus' main spaceport featured a number of well-regarded cantinas and leisure establishments, especially down the side streets where tourists were less likely to look."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Terminus first appeared in Star Wars 50: The Crimson Forever, written by Archie Goodwin and released in 1981. In its comic appearance, the world was illustrated by Al Williamson. Terminus shares a name with a planet that was mentioned in George Lucas' third story draft of Star Wars: Episode IV A New Hope, but was ultimately removed from the final film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}