{"url": "Terror_Trooper", "categories": ["Category:Legends articles", "Category:Imperial projects and operations", "Category:Stormtrooper variants", "Category:Terror units"], "nodes": [{"tag": "h1", "text": "Terror Trooper"}, {"tag": "p", "text": "Terror Troopers were an experimental class of elite stormtroopers that formed the infantry of the Galactic Empire's Terror Units. Shortly after the Galactic Civil War began with the founding of the Alliance to Restore the Republic, Darth Vader dispatched several Terror Troopers to assist the bounty hunter Boba Fett in his mission to capture Juno Eclipse."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Terror Troopers were created as cyborg experiments conducted by the Imperial Department of Military Research. Their masks were deliberately intended to invoke the appearance of the infamous Separatist General Grievous from the Clone Wars."}, {"tag": "p", "text": "Shortly after the start of the Galactic Civil War in 2 BBY, the Terror Troopers were deployed on their first known mission after a renegade clone of the late Galen Marek escaped from the Timira City Cloning Facility on Kamino. In response, Darth Vader charged Boba Fett with luring Starkiller back to him. Despite the bounty hunter's exceptional skills, Vader thought that Fett would not likely survive an encounter with his former apprentice's clone. Thus, he redirected Fett to finding Captain Juno Eclipse so that she could be brought to Kamino, knowing that Starkiller would follow. Although Fett requested a squadron of Imperial stormtroopers to assist him in Eclipse's capture, Vader was willing to grant the mercenary far more than he requested. Satisfied with his backup, Fett began his search for Eclipse with the Terror Troopers, including Terror Biodroids, Terror Droids and one Terror Walker."}, {"tag": "p", "text": "Shortly after learning the location of Captain Eclipse's starship, the Salvation, Boba Fett ordered his forces to attack the Rebel frigate, much to the relief of the Imperial pilots who feared the Terror Troopers. After successfully infiltrating the Salvation, Fett ordered several Terror Troopers to escort him to the bridge. However, Starkiller and General Rahm Kota had also just arrived in the Rogue Shadow and were heading to the Salvation. Before storming the bridge, Fett instructed the Terror Troopers to use caution when fighting Starkiller, warning them about how the clone's Force lightning was liable to disrupt their onboard systems."}, {"tag": "p", "text": "After making their way to the bridge, the Terror Troopers easily killed the bridge crew, sparing only Captain Eclipse as per Vader's orders. As Fett escorted his prisoner to Slave I, the Terror Troopers remained on the Salvation to stall Starkiller long enough for Fett to escape with Eclipse. Although they utilized all of their combative abilities against Starkiller, they were ultimately no match against the clone's skills. Despite the fact that none of the Terror Troopers were able to defeat Starkiller or last very long against him, they nevertheless succeeded in buying Fett just enough time to reach Slave I with Eclipse before traveling to Kamino."}, {"tag": "p", "text": "Although he failed to prevent Fett from escaping with Eclipse, Starkiller eliminated the remaining Terror Troopers aboard the Salvation. After Starkiller used Eclipse's Rebel frigate to penetrate Kamino's planetary shields, General Kota's Rebel forces assaulted Timira City. The Terror Troopers fought alongside the planet's Imperial forces in defense of the cloning facility, only to be annihilated by Starkiller as he pressed on towards the city's top spire where Vader held Eclipse captive. Despite the considerable military force that protected Kamino, the Terror Troopers and the rest of the Imperial garrison failed to prevent the Alliance from winning the battle and capturing Darth Vader in the process."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Terror Troopers possessed a Stun blaster of some sort. They also appeared to have a cloaking ability similar to that of the Shadow Trooper and incredible agility which allowed them to dodge most melee attacks. Due to their fast reflexes and stealth capabilities, the Terror Troopers were sent into hostile environments in order to quickly dispose of targets without leaving a trace. Interestingly, the Terror Trooper was visible using force sight, even when cloaked."}, {"tag": "p", "text": "They were also specialized in direct combat via their sharpened, durasteel talons on their hands and feet, and their strength, speed, and agility were augmented via their cybernetic limbs. Their Grievous-like masks provided augmented respiration for the trooper's augmented lungs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Terror Troopers' helmets resemble the faceplate of General Grievous, while the tips of the boots resemble his talons. The chest armor, codpiece, and knee pads are similar in appearance to those of clone trooper armor. The metal claws on the hands resemble clawed fingers of the Sith stalker armor.\nThe Terror Trooper also shows a close resemblance to the Clone assassin, both attacking and dodging in the same technique."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}