{"url": "Terrib_Igmusk", "categories": ["Category:Canon articles", "Category:Keteerians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Terrib Igmusk"}, {"tag": "p", "text": "Terrib Igmusk was a Keteerian male who worked as a hotel concierge. Around 34 ABY, Igmusk was present in the Canto Casino on the planet Cantonica as Resistance agents Finn and Rose Tico searched for the Master Codebreaker. When the pair rode a herd of fathiers through the casino, Igmusk fled from the animals."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Terrib Igmusk was a Keteerian male who worked as a hotel concierge. Around 34 ABY, Igmusk was present in the city of Canto Bight on the planet Cantonica, where he lurked inside the Canto Casino."}, {"tag": "p", "text": "The Keteerian spoke with a human male near one of the casino's gambling tables as the Resistance agent Finn searched for the casino patron known as the Master Codebreaker. Igmusk was still in the casino when Finn and his partner Rose Tico rode a herd of fathiers, which they had liberated from the Canto Bight racetrack, through one of the building's windows. Igmusk fled from the animals as they trampled through the building."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Igmusk had brown skin and dark eyes. He wore a black suit with a white shirt and brooch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Terrib Igmusk first appeared in the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi, in which he was played by Keith De'Winter. For the film, Igmusk's creature design was titled \"K020.\" The character was first identified in the 2019 episode guide for \"Dangerous Business,\" an episode of the television series Star Wars Resistance. In the \"Bucket's List Extra\" section of the episode guide, Terrib was misspelled as \"Teerib.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}