{"url": "Terrorist_attack_of_14:9:19", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars", "Category:Battles of Coruscant", "Category:Terrorist attacks"], "nodes": [{"tag": "h1", "text": "Terrorist attack of 14:9:19"}, {"tag": "p", "text": "The terrorist attack of 14:9:19 occurred on Coruscant around 22 BBY. Palpatine secretly orchestrated the attack under the guise of Darth Sidious. The attack was later publicly attributed to the Confederacy of Independent Systems. Finis Valorum, the key victim of the attack, had been Supreme Chancellor of the Republic before Palpatine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Palpatine wanted to get rid of Valorum because Valorum had been talking to Senator Bail Organa about Palpatine's political maneuverings. Around 22 BBY, Finis Valorum reappeared in politics following his retirement after being replaced by Palpatine. Valorum had observed Palpatine's activities, both public and private, from a distance, especially how the chancellor's opponents had a habit of disappearing. The most noteworthy of these disappearances was that of Seti Ashgad who disappeared following his opposition to cam droids. Possibly the Enforcement Act had been the last straw in a string of offenses which forced Valorum into action. But Palpatine had ears everywhere, even in custodial droids working in Bail Organa's residence at Cantham House, so when Valorum came to visit Organa there, it was not long before comments like this reached the Chancellor's desk:"}, {"tag": "p", "text": "What Palpatine thought of Valorum's words is unknown, but they clearly buttressed Organa's courage, so the next morning he appeared at the Chancellor's Suite to insist that under no circumstances would he support the Enforcement Act, and that in fact he would oppose Palpatine on it. The Chancellor said nothing about it, though he did offer Organa a cryptic warning."}, {"tag": "h2", "text": "Orchestration"}, {"tag": "p", "text": "Shortly after the Battle of Jabiim, Sajé Tasha, an Anzat assassin, was hired by fallen Jedi Sora Bulq and Senator Viento, both subordinates of Darth Sidious, to assassinate former Supreme Chancellor Finis Valorum. Valorum boarded the freighter Star of Iskin, and Tasha followed and killed him, drinking his \"soup\". Tasha planted a bomb on the Star and presumably exited before the ship lifted off. The Star of Iskin was destroyed to cover her tracks. All aboard died, and the burning wreck killed thousands on the surface when it crashed."}, {"tag": "h2", "text": "Aftereffects"}, {"tag": "p", "text": "The information of how Tasha had been contacted would later be utilized by Quinlan Vos in his hunt for the Sith, though it would lead him to believe that Viento, and later Bulq, was the elusive \"Second Sith\" whom Dooku had mentioned to Obi-Wan Kenobi on Geonosis three years before. Originally tabled,the Enforcement Act was brought back to discussion following a pirate attack on the ship of Bail Prestor Organa as well as the destruction of the Star of Iskin carrying Finis Valorum. The bill was ultimately passed.. The Enforcement Act gave some of the Senate's powers to the Chancellor, and also gave away some fundamental rights of citizens to the central government, something that was never intended to be done. Among other things, the Act allowed for searches and seizures to be conducted without warrants or due process, and permitted the unrestricted use of observation droids. It also dealt harsh penalties for captured pirates, resulting in them preferring to fight to the death than to surrender. Palpatine, who had orchestrated both the assassination of Finis Valorum as well as the pirate attack on Bail Organa, benefited tremendously because he was given more power as a result of his machinations as Darth Sidious. The Finis Valorum Memorial was constructed on Coruscant to honor the last being who served as Chancellor before Palpatine's rise to power. Only 200 people attended the opening ceremony. Future generations, however, would look more kindly on him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}