{"url": "Battle_of_Kadavo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Articles with cut elements", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Kadavo"}, {"tag": "p", "text": "A battle was fought in 21 BBY on the planet Kadavo during the Clone Wars. Having occupied the Togruta colony world of Kiros, the Confederacy of Independent Systems secretly transferred the world's entire population to the planet Zygerria, where the Togruta were to be sold as slaves at an auction. A Galactic Republic task force led by High Jedi General Obi-Wan Kenobi, Jedi General Anakin Skywalker, and Skywalker's Padawan, Ahsoka Tano, liberated Kiros and discovered links leading to Zygerria. The Jedi and Clone Captain CT-7567 soon infiltrated the auction and tried to rescue the Togruta but were captured by the Zygerrians and enslaved. Skywalker and his Padawan, however, escaped from the Zygerrians and headed for Kadavo to rescue Kenobi, CT-7567, and the Togruta, who had been transferred to the Zygerrian slave processing facility on the planet. While en route, the two also called for reinforcements from the Republic."}, {"tag": "p", "text": "Tano and her Master arrived on the planet first on the Zygerrian slave ship Tecora and tried to break into the slave processing facility. When ordered to cease by the Zygerrian Keeper Agruss, lest the slaves be killed, Skywalker did not comply. At that moment, the reinforcements arrived, led by Admiral Coburn and Jedi Master Plo Koon. Koon's Wolfpack detachment attacked the facility with LAAT/i gunships and clone Z-95 starfighters, but were halted by its ray-shielded turbolaser defenses. However, Skywalker was able to destroy the defensive towers, while Kenobi and CT-7567 rebelled and killed Agruss. As a last act before his death, the Keeper tried to throw the Togruta into the volcanic crevice below the facility, but, following a plan devised by Tano, the Republic forces evacuated them on Admiral Coburn's Arquitens-class light cruiser, the Hand of Justice. After picking up Skywalker, Kenobi, Tano, and CT-7567, the Republic strike team destroyed the slave facility."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 21 BBY during the Clone Wars, the Confederacy of Independent Systems occupied the Togrutan colony world of Kiros and secretly transferred its entire population to the planet Zygerria, where they were to be sold as slaves at an auction held by the Zygerrian Queen Miraj Scintel. A Galactic Republic task force led by High Jedi General Obi-Wan Kenobi, Jedi General Anakin Skywalker, and Skywalker's Padawan, Ahsoka Tano, liberated Kiros and found clues that led them to Zygerria."}, {"tag": "p", "text": "Posing as slave traders, Skywalker, Kenobi, Tano and Captain CT-7567—nicknamed \"Rex\"—infiltrated the auction and tried to rescue the Togruta but ended up being caught by the Zygerrians and becoming slaves themselves. While Skywalker was left in service of Queen Scintel, Tano was imprisoned on Zygerria, and Kenobi and Rex were transferred along with the Togruta to the Zygerrian slave processing facility on the planet Kadavo. Commanded by the Zygerrian Keeper Agruss, the processing facility was kept aloft above a pool of lava."}, {"tag": "p", "text": "On Kadavo, the Keeper tried to break Kenobi's will by dropping several Togruta into the lava and promising to do the same with the other slaves should the Jedi attempt to rebel. Unwilling to put the innocent in danger, Kenobi and Rex were eventually forced to submit to the Keeper after the Zygerrian guards began punishing the Togruta for Kenobi's defiance. Skywalker and Tano soon escaped from Zygerria and headed for Kadavo to rescue Kenobi and the Togruta, also summoning reinforcements commanded by Admiral Coburn."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Back on Kadavo, the Keeper was contacted by Dooku and ordered to execute his Republic prisoners. Agruss summoned both Kenobi and Rex to the facility's command center and told the two about his intention to dispose of them. While the Keeper communicated with Kenobi and Rex, Skywalker and Tano arrived on the captured Zygerrian slave ship Tecora. As the two Jedi and their astromech droid R2-D2 disembarked from the craft, heavy turbolasers that guarded the facility destroyed the Tecora. Taking cover near the facility's blast doors, Skywalker and Tano activated their lightsabers and started cutting through them. Acting on Dooku's orders, the Keeper positioned the Togrutan slaves on a platform above the lava pool and threatened to dump them to their deaths unless Skywalker surrendered. In response, Skywalker summoned his reinforcements."}, {"tag": "p", "text": "The Arquitens-class light cruiser Hand of Justice, commanded by Admiral Coburn, descended into the planet's atmosphere. While Coburn's Venator-class Star Destroyer remained in orbit, launching LAAT/i gunships and clone Z-95 starfighters piloted by members of the Wolfpack, a clone detachment under the command of Jedi General Plo Koon. Koon himself flew his personal Delta-7B Aethersprite-class light interceptor, the Blade of Dorin. As the Wolfpack attacked the facility, the Zygerrian guards scrambled to its defense, launching their two nimble HH-87 Starhoppers into battle. The Zygerrian pilots damaged clone pilot's Warthog's craft, but General Koon outmaneuvered them and destroyed the Starhoppers. The Wolfpack then focused on destroying the defensive towers, which had already taken down one LAAT/i gunship. However, the turrets were ray-shielded, and the Republic forces were unable to inflict any damage."}, {"tag": "p", "text": "Meanwhile, taking advantage of the confusion, Rex and Kenobi broke free of their restraints and assaulted their Zygerrian captors, while Skywalker, Tano, and R2-D2 broke into the facility. As Kenobi and Rex continued to battle their guards, Agruss used his computer to electrify the walls of the slave pens holding the Togruta and opened the hatch beneath the pens, intent on dropping the slaves to their doom. Agruss then smashed the controls so that Kenobi could not cancel his command. Kenobi contacted Koon, informing him of the situation. In turn, Koon communicated with Skywalker, warning him that the cruiser could not descend any further to rescue the Togruta until the turrets were destroyed. Skywalker then set off to destroy the towers, while Tano went to help the slaves."}, {"tag": "p", "text": "Using the Force, Skywalker leaped onto one of the towers, killed its gunner, and used the weapon to destroy all other emplacements, opening the way for Admiral Coburn. However, as there was no way to bring the slaves onto the landing platform, Tano advised the Admiral to position the Hand of Justice under the facility, beneath the opened slave pens. In the meantime, Kenobi and Rex managed to defeat the remaining Zygerrian guards, leaving only Agruss. In hopes of saving his life, the Keeper reminded Kenobi of his inability to kill an unarmed man due to the Jedi Code. However, trooper Rex was not bound by the Code, and he killed Agruss with a throw of a force spear. After Admiral Coburn maneuvered his ship underneath the facility, Commander CC-3636 and the Wolfpack used jetpacks and ascension cables to help transport the slaves and Tano onto the Hand of Justice. After Skywalker, Kenobi and Rex were evacuated aboard one of the gunships, and the light cruiser carrying the Togruta left the facility, Koon ordered all gunships to open fire, and the slave processing facility was destroyed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Zygerrian Slave Empire was dealt a crippling blow with the destruction of the slave processing facility. Shortly after the battle, aboard the Republic cruiser, the leader of the rescued slaves, Governor Roshti, thanked Tano for her service to the Togruta. Although Roshti believed that his people would not recover from the horrors they had been through soon, he admitted that Tano could be right in that those events would only make the Togruta of Kiros stronger. Roshti then told Tano that he and his people were considering joining the Republic; a notion which the Padawan supported."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Kadavo was first depicted in the 2009 comic book The Clone Wars 6, written by Henry Gilroy and illustrated by Scott Hepburn. The battle served as a conclusion to the Slaves of the Republic story arc of The Clone Wars comic series. In 2011-2012, the comic books were adapted into three episodes of The Clone Wars television series. The third episode of the arc, \"Escape from Kadavo,\" aired on January 6 of 2012, featured the battle. However, the television episodes differed from the original storyline of the comic books in a number of ways. This article currently describes the battle as portrayed in the TV series, while the original material is presented below."}, {"tag": "h3", "text": "Comic book portrayal"}, {"tag": "h4", "text": "Skywalker's mission"}, {"tag": "p", "text": "A major plot point in the comic book series that is absent from the on-screen adaptation is Dooku attempting to impair the reputation of the Jedi Order by spreading word that during the battle on Kiros, the Jedi eradicated the entire planet's population. As such, Skywalker's escape from Zygerria and his attempt to liberate the slaves on Kadavo puts Dooku at risk of being exposed as a liar. In order to prevent that from happening, Dooku sends his servants—the assassin, Asajj Ventress and the General Grievous—alongside a Separatist fleet to kill everyone on Kadavo–Republic, Zygerrian and Togruta alike."}, {"tag": "p", "text": "The Republic forces under Skywalker's command, consisting of several Venator-class Star Destroyers, arrive at Kadavo. Backed by a squad of clone troopers, Skywalker and Tano board a Zygerrian transport and use it to reach the Zygerrian Labor Processing Hub, which is guarded by a group of B1-Series battle droids and B2 super battle droids. The battle droids—who assume that the transport is delivering new slaves—are caught off guard by the appearance of the Jedi and the clones, and are quickly destroyed before they could react to the threat. Reaching the main door to the complex, Skywalker starts cutting his way in, but he is contacted by the Keeper and ordered to stop, or risk the slaves being killed. Desperate to rescue the slaves, Skywalker ignored the Keeper's threats and continued cutting into the facility."}, {"tag": "h4", "text": "Separatist fleet arrives"}, {"tag": "p", "text": "Meanwhile, the Separatist fleet arrives and engages the Republic task force above the planet. Leading several Hyena-class bombers, Ventress—in her starship, the Trident—attacks the Republic Shadow Squadron, killing several pilots, including Shadow Three and Shadow Five. While General Grievous' fleet, consisting of a Providence-class carrier/destroyers and Vulture droid starfighters, fights the Republic forces, Ventress and the Hyena-class bombers head toward the Labor Processing Hub, intent on destroying it. Believing that the Confederacy has come to aid him, the Keeper once again demands Skywalker's surrender, and Skywalker reluctantly agrees."}, {"tag": "p", "text": "However, the bombers proceed to attack the hub, destroying one of the cables that holds the facility above the volcanic crevice. As a result of this, the whole facility begins to incline, causing several Togruta slaves to lose their balance and fall into the lava to their deaths. Having witnessed the bombers attacking the hub, the Keeper realizes that Dooku's intention is to kill the slaves. In hopes that the Confederate forces would spare the Zygerrians if they disposed of the Togruta themselves, the Keeper tries to activate a mechanism that would dump the remaining slaves into the lava as well. Kenobi and Rex attack the Zygerrians that are guarding them, subduing the Keeper and preventing him from exterminating the population of Kiros. Kenobi damages the dumping mechanism, but the Togruta still remain in danger on a platform above the lava pool."}, {"tag": "h4", "text": "Republic reinforcements"}, {"tag": "p", "text": "In the meantime, more Republic forces arrive at Kadavo, forcing General Grievous to sound a retreat, thus leaving Ventress to fend off on her own. As the bombers initiate another attack on the facility, Skywalker orders his clone trooper escort to open fire. One blaster shot hits an enemy bomber's proton bomb, causing the explosive to detonate and sparking a chain reaction that destroys most of the bombers. Distraught, Ventress tries to request more Hyena-class fighters from Grievous, only to find out that the droid general has abandoned her. With the rest of the Confederate forces having fled, Ventress remains to battle the Republic alone. Meanwhile, Kenobi and Rex join with Skywalker and inform him of the danger that the Togruta are in. Having noticed Skywalker's transport, Kenobi quickly formulates a plan to rescue the slaves. Positioning the vessel immediately below the Togruta, the Jedi assemble on the ship's roof and use the Force to levitate the slaves onto the transport."}, {"tag": "p", "text": "At that moment, Ventress's Trident performs an attack run on the Jedi's ship. The Jedi deflect her shots with their lightsabers, but Ventress clamps her ship onto the transport and uses her ship's claws to attack the Republic forces. Rex tries to destroy the Trident with a missile launcher, while Skywalker and Kenobi fight back with their lightsabers, but neither tactic works, and Ventress corners the Jedi. As she is preparing to deliver a killing blow, however, a group of V-19 Torrent starfighters, led by Plo Koon, attacks the Trident and forces Ventress to retreat."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "With the battle over, the Republic utilizes LAAT/i gunships to evacuate the Togruta and to secure the captured Keeper. The Republic then plants explosive charges throughout the facility to destroy it. Before the explosives are triggered, however, the Republic troops are informed that Supreme Chancellor Palpatine has requested them to leave the Labor Processing Hub intact for later use. Realizing that the facility could only be used for one purpose—to house slaves—the Jedi decide to disobey Palpatine's direct order and destroy it."}, {"tag": "p", "text": "The Republic helps the Togruta return to Kiros. To protect the colony against another possible invasion, the Republic stations a garrison of clone troopers on the planet. The Togruta, however, feel that the clones' presence might not be enough to protect them and decide to change their peaceful way of life, arming themselves and receiving combat education from the Republic troops."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}