{"url": "Tesar_Sebatyne", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Barabel", "Category:Galactic Alliance Starfighter Corps personnel", "Category:Jedi Coalition personnel", "Category:Jedi Guardians", "Category:Jedi Knights of the New Jedi Order", "Category:Joiners", "Category:Males", "Category:New Republic individuals", "Category:Pilots", "Category:Wild Knights"], "nodes": [{"tag": "h1", "text": "Tesar Sebatyne"}, {"tag": "p", "text": "Tesar Sebatyne was a Barabel Jedi Knight who was trained under his mother, Saba Sebatyne, and flew in their squadron of Force users, the Wild Knights."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "Due to Barabel mating customs, Tesar shared a father with either Bela Hara or Krasov Hara. It was impossible to know which one Tesar could call his sister. Nevertheless, all three were hatchmates and had a sibling-like bond."}, {"tag": "p", "text": "In the aftermath of the Battle of Duro, Tesar, his hatchmates and Jedi Izal Waz assisted Han Solo and Leia Organa Solo in escaping assassins from Corellia and escorting their master Eelysa."}, {"tag": "p", "text": "Two years into the war, Tesar, his hatchmates, and the Wild Knights entered the war effort in visible fashion. Tesar, Bela, and Krasov made an impression on their fellow Jedi with their impressive coordination and tactics through the battle meld during the skirmish at Froz."}, {"tag": "p", "text": "As the threat of the voxyn became clear to the Wild Knights in the wake of Master Eelysa's death, Tesar opted to go on the strike team to Myrkr, and was one of the few who survived. Sadly, both his hatchmates died during the mission."}, {"tag": "p", "text": "After a brief stint on Hapes following Myrkr and the fall of Coruscant to the Yuuzhan Vong, Tesar rejoined the Wild Knights and fought bravely during the campaign at Borleias under the command of General Wedge Antilles."}, {"tag": "p", "text": "As the war wore on into its third year, he was formally given the rank of Jedi Knight in a ceremony on Mon Calamari and fought under Admiral Traest Kre'fey's command as a flight leader in Jaina Solo's Twin Suns Squadron. At the Battle of Ebaq 9, Tesar was stranded alongside Jaina and Lowbacca inside the bunker on the surface of the moon. He was incapacitated during the fight against Warmaster Tsavong Lah."}, {"tag": "p", "text": "Tesar alternated between Twin Suns Squadron and the Wild Knights for the remainder of the war, and piloted a Zonama Sekotan fighter at the end of the Yuuzhan Vong War during the Battle of Yuuzhan'tar."}, {"tag": "h3", "text": "Dark Nest Crisis"}, {"tag": "p", "text": "In 35 ABY, Tesar, Lowbacca, and Jaina Solo arrested the Yaka pirate Redstar on his ship, the Night Lady, and attended his trial on the maximum security space station MaxSec Eight. During the trial they received a mysterious Force-call from the Unknown Regions. Along with the other survivors of the Myrkr strike team, they set out to discover the source of the call, and found that it was the creature which had once been their fellow Jedi Raynar Thul, believed slain at Myrkr, but now transformed into the Prime Unu of the hive-minded Killik species."}, {"tag": "p", "text": "Along with Tekli, Alema Rar, Jaina Solo, Zekk, Lowbacca, and Tahiri Veila, Tesar was coerced into joining the Killiks by UnuThul's exploitation of the Myrkr battle meld, and he became a \"Joiner\"—someone who was influenced and was subject to the control of the Colony, subjected to Force and pheromonal manipulation so profound as to physically affect brain-structure. The Joiners then helped the Killiks to defend their nests against the Chiss. However, Tesar was convinced to return to known space by Luke Skywalker. After the Qoribu Truce, Tesar and Lowbacca went on to hunt pirates hijacking Abaarian water shipments."}, {"tag": "p", "text": "Just as Jaina and Zekk came to form a dyad within the Joiner meld, Tesar seemed to grow particularly close to Lowbacca and Tahiri. During the closing months of the Killik conflict, the three of them conspired to reveal Raynar's survival to Aryn Dro Thul, his powerful mother. Tesar and Lowbacca were the ones to tell Madame Thul about the New Jedi Order's possible plans to assassinate her son, because Raynar, as UnuThul, was believed to either intentionally or inadvertently be causing the Dark Nest to keep coming back."}, {"tag": "p", "text": "When Luke Skywalker found out what the three Jedi had done, he viewed their actions as a betrayal of their allegiance to the Jedi Order by undermining his attempts to bring unity to the Knights as Grand Master. Tesar and his friends attempted to redeem themselves by telling Luke about Jacen Solo's attack on Supply Depot Thrago, but to no avail. Luke sent them to Dagobah to meditate on what it meant to be a Jedi. He told them that he would call them once he felt they were ready to rejoin the order, and that they were not to leave until they felt that call."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "By 40 ABY, Tesar and Lowbacca were operating under Admiral Nek Bwua'tu's command. They were specifically tasked with monitoring the secret Kiris shipyards. Tesar was one of the many Jedi Knights present at the Funeral of Mara Jade Skywalker, where his mother delivered the eulogy. Sebatyne later was part of a huge battle meld at the Second Battle of Balmorra."}, {"tag": "p", "text": "Towards the end of the Second Galactic Civil War, Tesar sparred with fellow Jedi Lowbacca and Zekk against Jaina Solo, in preparation for her coming battle with Darth Caedus, who Tesar had known as Jacen Solo before his fall to the dark side. Tesar was also involved while Jaina learned to control the power of shatterpoints. The war concluded following the death of Caedus, whom Jaina successfully bested in battle."}, {"tag": "h3", "text": "Picking up the pieces (43-44 ABY)"}, {"tag": "p", "text": "In 43 ABY, Tesar was one of the Barabels along side Wilyem, Zal, and Dordi that helped to get the mad Jedi off Coruscant and to the Jedi facility on Shedu Maad, when Chief of State Natasi Daala wanted to freeze all of them in Carbonite. They later made a nest inside the Jedi Temple."}, {"tag": "h3", "text": "The fight for Coruscant"}, {"tag": "p", "text": "When Grand Master Luke Skywalker directed the Jedi Order to leave Coruscant as a trap for the Sith, he ordered the four Barabels (Tesar, Wilyem, Zal, and Dordi) to hunt and kill every Sith that came across their path."}, {"tag": "p", "text": "When Allana Solo saw a vision of Sith attacking and killing all of the Hatchlings, she and her grandparents Han and Leia Solo returned to Coruscant to inform Jedi Knight Bazel Warv so he could go and tell the Barabels of the impending attack, but they were ambushed at the secret exit of the Jedi Temple which was lead by Vestara Khai. Jedi Warv died defending the House of Solo from the Sith, dying a hero for Allana Solo."}, {"tag": "p", "text": "When the Parting Gift came to rescue the group along with a lot of Hatchlings, Tesar Sebatyne told him that his baby Barabels liked Jagged Fel."}, {"tag": "h3", "text": "Leaving Coruscant"}, {"tag": "p", "text": "Tesar was at the Wedding of Jagged Fel and Jaina Solo and most likely was one of the Jedi who lit his Lightsaber for Jaina Solo Fel to walk under."}, {"tag": "p", "text": "He along with his mother Saba Sebatyne, and the Hatchlings and his nest mates Wilyem, Zal, Dordi left Coruscant, and went to Shedu Maad."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}