{"url": "Tessek/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Accountants", "Category:B'omarr Monks", "Category:Cyborgs", "Category:Desilijic servants", "Category:Males", "Category:Quarren"], "nodes": [{"tag": "h1", "text": "Tessek"}, {"tag": "p", "text": "Tessek was a Quarren male from the water planet of Mon Calamari. He once had ties with Republic politics, but when the Galactic Empire invaded his home planet, he fled and became a member of Jabba Desilijic Tiure's court. While serving as the Hutt's accountant, Tessek planned to kill his master by planting a bomb on his sail barge. Tessek managed to survive the Battle of the Great Pit of Carkoon after escaping on a speeder bike—however, when he returned to Jabba's Palace, his brain was forcibly removed from his body by the B'omarr Monks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Quarren leader with ties to Galactic Republic politics, Tessek fled his homeworld of Dac when the Galactic Empire began taking both Quarren and Mon Calamari as slaves. Tessek eventually ended up on Tatooine, a planet which was unsuited to the Quarren skin type, causing him to have to lie in a bath for much of the day. Following his arrival on Tatooine, Tessek eventually found work as Jabba Desilijic Tiure's accountant. After his conscience began to bother him, Tessek formulated a plot to assassinate Jabba. He collaborated with the Empire to have Jabba killed, and the sly Quarren employed Barada, Ree-Yees, and some Weequays as agents for him. After Jabba was dead, Tessek planned to sell his criminal empire to Lady Valarian, while keeping the legitimate side of Jabba's empire for himself. However, those closest to Jabba knew of Tessek's betrayal and informed the Hutt, who quickly began to distrust the Quarren."}, {"tag": "p", "text": "To protect his credits, and some of Jabba's wealth as well, Tessek hid huge amounts of funds in key locations throughout the Tatooine desert. In 1 ABY, one of these buried safe boxes was compromised when creatures built their lair near Tessek's treasure trove, preventing him from retrieving his money. To correct the problem, he was forced to hire a well armed individual to exterminate the creatures and retrieve the safe box."}, {"tag": "p", "text": "Tessek made a deal with Imperial Prefect Eugene Talmont to get Jabba to go to a spice deal that would be raided by Talmont. However, Tessek paid two of Talmont's junior officers to fire at both the Khetanna and their own superior. Tessek also had Barada, Jabba's chief mechanic, plant a bomb on Jabba's sail barge, which was large enough to destroy Jabba, Talmont, and the entire warehouse."}, {"tag": "p", "text": "The morning of the spice deal, Tessek was visited in his private chamber by an enlightened B'omarr monk, who predicted that if the Quarren's plan succeeded, he would become a slave of wealth, and would be plotted against by beings similar to himself. The monk also told Tessek that Jabba was fully aware of his accountant's disloyalty, through the spying of Salacious B. Crumb and Ortugg. Then the spider-like droid invited Tessek to join the B'omarr, and become enlightened. Tessek declined the offer, and shot the droid with a concealed blaster pistol."}, {"tag": "p", "text": "Tessek's plans became more complicated when Luke Skywalker arrived at Jabba's Palace, demanding that Han Solo and Princess Leia be set free. The Hutt refused, and sent the young Jedi Knight to the rancor's pit. Unlike most of the beings who went down there, Skywalker survived, killing the beast. A furious Jabba then ordered that the prisoners be taken to the sarlacc pit immediately. When Tessek became reluctant to go, Jabba's suspicions were raised. He demanded that Tessek stay at his side at all times."}, {"tag": "p", "text": "Extremely desperate, Tessek tried to plead with Ephant Mon, Jabba's closest friend, to ask Jabba to release Skywalker. Tessek feigned interest in the Hutt's safety, while actually he just wanted the Hutt to go to the spice deal. Despite Mon's efforts, Jabba insisted that Skywalker and friends were to be fed to the sarlacc."}, {"tag": "p", "text": "Tessek managed to hide a swoop bike on his master's sail barge just before it departed, as he did not intend to be present when his bomb was detonated. As the huge sail barge traveled to the Great Pit of Carkoon, Tessek became more and more visibly dehydrated—his skin began to itch and crack in spots, and his normal gray skin blanched to white."}, {"tag": "p", "text": "When the barge finally reached their destination, Tessek was extremely worried—the expected phalanx of Rebel fighters had yet to arrive, and the execution had already begun. With a miniature battle taking place aboard Jabba's skiffs, Tessek attempted to shoot his master, but with Leia Organa in the way, he decided not to, leaving the young Princess to murder the slimy Hutt. Tessek also foiled an attempt from a Weequay, one of his henchmen, to kill Leia, shooting him in the neck. Tessek escaped just in time to see his master's sail barge explode."}, {"tag": "p", "text": "Shortly thereafter, Tessek returned to the Palace, and was forcibly recruited by the B'omarr Monks and had his brain removed from his body. After a short time adjusting to his new body, Tessek liked to climb atop the towers in Jabba's Palace, becoming friendly with Buboicullaar and Bib Fortuna, who had both joined the ranks of the B'omarr."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tessek was a scheming individual, who would betray as many people as possible to ensure a profit. The Quarren accountant was always extremely nervous, worrying about what Jabba might do to him if he discovered his treachery. Tessek also disliked most of the other regulars in Jabba's Palace, especially Ree-Yees, who Tessek had to forcibly remind not to reveal his plans to everyone. The two also often fought."}, {"tag": "p", "text": "Although he both hated and feared the B'omarr monks, they had sensed his desire for freedom and on the morning before Jabba's death, offered to help Tessek obtain it. Fully aware of what that offer required, the Quarren refused. However, after his brain was forcibly removed and placed in a brain jar, Tessek did indeed find the peace and freedom he desired just as the monks had promised and ultimately, he was more happy than he had ever been when he was in his body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tessek was played by the actor/mime artist Gerald Home in Star Wars: Episode VI Return of the Jedi but went uncredited."}, {"tag": "p", "text": "In the rough draft of the Attack of the Clones script, Tikkes was named Tessek. As that was the version used by James Luceno for the Episode II references he put into Cloak of Deception, the Tessek that appears in that book is presumably now Tikkes. The name Tessek was also used instead of Tikkes in the novelization of Episode II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}