{"url": "Tetan_Monarchy", "categories": ["Category:Legends articles", "Category:Planetary governments", "Category:Nobility", "Category:Rulers of the Empress Teta system"], "nodes": [{"tag": "h1", "text": "Tetan Monarchy"}, {"tag": "p", "text": "The Tetan Monarchy was the legitimate governing body of the Empress Teta star system, presided over by the ruling family of Empress Teta. The monarchy was officially established after the Unification Wars of 5000 BBY, when the then-Empress of the then-named Koros system unified the system's seven worlds under one banner. To honor Empress Teta, the system was renamed for her in tribute after her death. From then on her descendants would rule, perpetuating the Tetan legacy through the generations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 5000 BBY, the then-ruler of the what was known as the Koros system, managed to unify the seven worlds within under her banner. Empress Teta was her name, and after her death, the system was renamed in her honor."}, {"tag": "p", "text": "More than one thousand years later, the Empress Teta system was still ruled by the Monarchy set in place by the legendary Empress. Descendants of Teta known as the Keto family ruled the system now, although violent measures became the norm when maintaining order throughout the Tetan worlds. Lord Keto, the reigning Emperor of Empress Teta, maintained control through use of torture droids."}, {"tag": "p", "text": "That same year, power was wrested from Lord Keto and Lady Magda Keto (his sister, and also Empress of Teta) by their own children. Lord Keto's son Satal, and Lady Keto's daughter Aleema staged a violent governmental coup that resulted in the deaths of both the former Lady and Lord Keto. Under the guise of their Sith-inspired Krath, the Satal and his cousin Aleema became the new rulers of the Empress Teta system. The Krath dominion would not last forever. Within a year, both Aleema and Satal had perished. Satal died at the hands of a fallen Jedi named Ulic Qel-Droma on the balcony of the Krath palace, the Iron Citadel. Aleema was consumed by a supernova of her own design, being tricked into creating the catastrophy by the same Jedi that slew her cousin. Despite this, the Tetan legacy was carried on after the deaths of Aleema and Satal Keto, surviving thousands of years into the Imperial era, with Emperor Alor Keto ruling over Empress Teta by the time of the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}