{"url": "Battle_of_Kamino", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of the Clone Wars", "Category:Battles of Kamino", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Kamino"}, {"tag": "p", "text": "The Battle of Kamino, also known as the Raid on Kamino, the Attack on Kamino, or the defense of Tipoca City, was fought during the Clone Wars between the Jedi-led Grand Army of the Galactic Republic and the Droid Army of the Confederacy of Independent systems. The Separatists launched the battle as one of their key campaigns during the war, hoping to capture Kamino and eliminate the cloning facilities in Tipoca City, thus depriving the Republic from creating more clone troopers for their army. The Separatists, led by General Grievous and Asajj Ventress, were repelled by the Republic. However, the attack on Kamino proved the Republic had intelligence leaks and that every Republic planet was vulnerable to assault."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Confederacy of Independent Systems had attempted an assault on Kamino earlier in the Clone Wars. However the attempt was stopped by the destruction of Rishi Station."}, {"tag": "p", "text": "The following year Jedi Generals Anakin Skywalker and Obi-Wan Kenobi intercepted a transmission between Confederate General Grievous and assassin Asajj Ventress. They were planing an attack on Kamino. Thus, Skywalker, Obi-Wan, Commander Cody, Captain Rex and the troopers of the 501st Legion were then sent to reinforce the blockade and General Shaak Ti's forces at the cloning facilities in Tipoca City."}, {"tag": "p", "text": "During this time, Ventress and her forces were hiding in the deep oceans of Kamino aboard a Trident-class assault ship. There they awaited Grievous's arrival."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Space distraction"}, {"tag": "p", "text": "When Grievous's fleet approached Kamino, the blockade under Admiral Wullf Yularen was ready to hold the line against the Confederate fleet. Grievous's T-series tactical droid TV-94B reported that all ships were in position and the Confederate fleet attacked. Skywalker and Broadside then led the fighter squadrons against the fleet. Grievous sacrificed his larger transports to protect his command ship. However, there was more to this strategy, as the debris from the destroyed ships fell into orbit and into the oceans of Kamino. This debris actually contained assault craft to be used to attack the city. When the debris fell into the ocean, Ventress ordered her aqua droids to assemble the assault crafts."}, {"tag": "p", "text": "However, General Kenobi suspected that debris was a clue. So, Kenobi took a Kamino sub down into the ocean to investigate. There, he discovered the aqua droids assembling the assault crafts. Kenobi was attacked by four of the aqua droids, and then forced to abandon the submarine. Kenobi was subsequently saved by an aiwha."}, {"tag": "h3", "text": "Assault on Tipoca City"}, {"tag": "p", "text": "The Trident assault ships then came out of the ocean and attacked Tipoca City. The aqua droids under Ventress led the attack against the clone troopers under Commander Colt and his fellow ARC trooper Havoc. General Grievous then landed with his battle droids. After killing Colt, Ventress and Grievous discussed their plans. While Grievous would attack the clone barracks, Ventress would secure a sample of the clones' DNA."}, {"tag": "p", "text": "During this time, troopers Fives and Echo were acting as snipers. They were then given grenades by 99 after Havoc was killed. They later found a group of clone cadets and took them back to the barracks. Once there, they were joined by Captain Rex and Commander Cody. Together, they prepared to fight Grievous's forces. When battle droids were about to enter the barracks, Cody, Rex and the others were able to attack them. Grievous was then confronted by Kenobi and the two dueled. They fought until they got to a platform where a Trident assault ship destroyed the platform. Grievous thought Kenobi had fallen to his death, but was actually saved once again by an aiwha."}, {"tag": "p", "text": "Ventress then entered the DNA room and retrieved a DNA sample. However, she was confronted by Skywalker. The two then fought until Ventress lost the sample and was surrounded by clone troopers. As Skywalker was about to let his troopers execute Ventress, Grievous came in a flight pod. Ventress boarded the Pod and retreated."}, {"tag": "p", "text": "During this time, Rex, Cody, their troops, and the clone cadets were able to destroy the battle droids, though 99 was killed in the cross fire. Several ARF troopers then destroyed the last Trident assault ship."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "For their actions during the battle, Echo and Fives were promoted to ARC troopers. Republic officer Wilhuff Tarkin was decorated at the battle."}, {"tag": "p", "text": "Despite the Republic victory, the facilities on Kamino underwent wide-spread damage and intense fighting, although they were able to remain operational. Grievous's attack on the planet also proved that any Republic planet was vulnerable to Separatist assault, and the Republic had intelligence leaks. The attack proved to be a morale boost for the Confederacy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}