{"url": "Ter%C3%A4s_K%C3%A4si/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Teräs Käsi"], "nodes": [{"tag": "h1", "text": "Teräs Käsi"}, {"tag": "p", "text": "Teräs Käsi, or \"steel hand\" in Basic, was an unarmed combat discipline. It was created sometime prior to 3678 BBY on the planet Bunduki by the Followers of Palawa, refugees of the planet Palawa, which was devastated earlier in a war somehow involving the Jedi Council. The Followers of Palawa created Teräs Käsi solely to fight with Jedi, and presumably, ensure that another world would never be destroyed by the actions of the Council. The Followers of Palawa studied the Force and midi-chlorians, even though they themselves were not necessarily Force-sensitive."}, {"tag": "p", "text": "Teräs Käsi enabled a user to develop extreme speed and an aptitude for anticipating strikes, most notably shown by clone assassins. In addition, Teräs Käsi taught non-Force-sensitives how to close their minds to Jedi and Sith, thus protecting themselves from mental attacks. Teräs Käsi also had a developed set of fighting skills, and Nine Edicts. Some lightsaber duelists used Teräs Käsi techniques in combat, most notably Darth Maul. Jedi Master Anoon Bondara was also a master of Teräs Käsi techniques, which he coupled with his lightsaber ability to duel. Jedi Knight Joclad Danva was also a Teräs Käsi practitioner. Jedi Master Plo Koon was believed to be a Teräs Käsi practitioner as well, since he was a master at hand-to-hand combat. It is not known how Jedi could have been trained in Teräs Käsi, as the Followers of Palawa did not appear to be on friendly terms with the Jedi."}, {"tag": "p", "text": "Phow Ji was a Teräs Käsi champion who once defeated Joclad Danva. Arden Lyn was also a follower of this combat style. Nova Stihl had been a practitioner of Teräs Käsi for twelve years."}, {"tag": "h2", "text": "Known moves"}, {"tag": "p", "text": "Many of the techniques and attacks of Teräs Käsi were named after various animals around the galaxy, suggesting that practitioners of the martial art took inspiration from the way animals moved."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Teräs Käsi is inspired by a real-life fighting style called pencak silat."}, {"tag": "p", "text": "In Steve Perry's novel The Musashi Flex, a prequel to his Matador book series, Teräs Käsi is briefly mentioned as one of the fighting styles practiced by the novel's main character."}, {"tag": "p", "text": "Translated from Finnish, \"teräs käsi\" means \"steel hand,\"[source?] though it's grammatically incorrect. The proper form is an yhdyssana, or compound word, spelled \"teräskäsi\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}