{"url": "Testament_of_Jogan_Halder", "categories": ["Category:Legends articles", "Category:Speeches"], "nodes": [{"tag": "h1", "text": "Testament of Jogan Halder"}, {"tag": "p", "text": "The Testament of Jogan Halder was a speech given by Jogan Halder, an Alanciari Keshiri soldier in 2975 BBY. This speech was delivered after the Invasion of Alanciar and was used to convince the Alanciari that the Lost Tribe of Sith from Keshtah Minor did not pose a threat to them. His former lover Quarra Thayn noted that Halder's speech showed that he was a skilled and articulate speaker. Halder's speech was well-received by the Keshiri in Alanciar who peacefully submitted to Sith rule. The Testament was delivered three times: firstly at Port Melephos, secondly at Sus'mintri, and it was then broadcast by semaphore across the continent."}, {"tag": "h2", "text": "Details"}, {"tag": "p", "text": "Jogan Halder's Testament began with an account of his travels beyond the ocean to Keshtah Minor, the domain of the Lost Tribe of Sith. He acknowledged that he had been kidnapped and taken from the shores of Alanciar by the Human Sith. Upon landing, Jogan related that he had been blindfolded and transported on a cart to Tahv, the capital of the Tribe. There, Jogan recalled that he had his blindfold removed and was allowed to roam the city freely. The city was filled with Keshiri craftsmen, painters, sculptors, and musicians who greeted him. The Keshtah Keshiri told him that they were a \"happy and free\" people who lived under the protection of the Sith, whom they called the \"Protectors\", ancient gods in Keshiri mythology. He claimed that the Keshiri in Keshtah had lived in peace for two millennia and had been able to commit themselves fully to recreational activities like the arts, painting, music, and singing. By contrast, the Keshiri in Alanciari were said to have spent the past two millennia in drudgery to defend their society against the Sith, a threat which he claimed did not actually exist."}, {"tag": "p", "text": "Halder was also allowed to visit the Tribe's capitol where he befriended the Circle of Lords. He described the Circle of Lords as a council where no man or woman ranked above the other. The Sith told Jogan that the Sith did not actually pose a threat to the Alanciari. While they acknowledged that Adari Vaal had been right about the presence of the \"evil\" Destructors among the Sith in her home continent, he claimed that the Tribe had already purged the Destructors exactly one day after Vaal had left the continent for Alanciar. According to Halder, if Adari had waited just one more day, those beings that she had feared would have been destroyed and her warning would have been unnecessary. He argued therefore that the militarization of Alanciari civilization had been unnecessary."}, {"tag": "p", "text": "However, Jogan also added that a servant of the Destructors had risen in Keshtah again two thousand years later but had been driven from the continent. This same individual had also built a fleet of airships and had sought to conquer Alanciar. Jogan then asked his hosts about the airships of Edell Vrai, whose warriors had accosted and kidnapped him. The Sith councilors then assured Halder that Vrai had been a trusted fried who had been sent to search for those criminals. Vrai had been startled by the military and technological power of the Alanciari, and feared that the Alanciari also served the Destructors. The Sith had captured Jogan because they wanted to verify that the Alanciari were not the \"vile enemies of legend.\" According Halder, the clash between the Alanciari and Vaal's forces had thus been an unnecessary and needless misunderstanding. Jogan then recalled that he had assured the Sith that the Alanciari had always been on the side of good and that they would resist any evil that came their way. He then added that the Alanciari were not deserving of their wrath. Finally, Halder concluded that the Sith were happy with Jogan's report and they offered to help them defeat the Destructors"}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Testament of Jogan Halder was part of Grand Lord Varner Hilts' plan to conquer Alanciar, a continent that lay beyond Keshtah Minor, the home of the Sith Tribe. Since 3000 BBY, the annexation of Alanciar had been one of the most important goals of the Grand Lord Hilts, who used it as a cause to would unite the Tribe and end the Time of the Rot, a nine-hundred year period of civil warfare and anarchy which had devastated Keshtah Minor. Under the leadership of his chief engineer High Lord Edell Vrai, the Sith had developed a fleet of airships by 2975 BBY. Vrai led a reconnaissance mission to survey Alanciar's landmass before returning to Keshtah Minor."}, {"tag": "p", "text": "Unknown to the Tribe, the Keshiri Herald Adari Vaal had escaped to Alanciar two thousand years earlier following a failed attempt to drive the Sith from Kesh. She transformed the Keshiri living on Alanciar into a highly militarized society that was dedicated to resisting any Sith invasion from Keshtah. The Alanciari developed a sophisticated network of semaphore signal stations, anti-aircraft ballistae, an air force, maritime Shore Guard, and a large, well-equipped and highly disciplined military. Adari's message was preserved in the Keshtah Chronicles, a publicly-available history book that detailed everything that Adari knew about the Sith Tribe. In addition, patriotic plays telling Adari's message and story were held on Observance Day every ten years to commemorate the time that she spent plotting her unsuccessful uprising against the Sith."}, {"tag": "p", "text": "The Alanciari forces wiped out Vrai's reconnaissance fleet above Garrow's Neck. However, Edell and several of his followers managed to survive and capture two Alanciari soldier: the soldier Jogan Halder and his secret lover Quarra Thayn, the wardmaster and chief military administrator of Uhrar. In addition, they managed to seize Halder's copy of Adari Vaal's Keshtah Chronicles from his private library. This tome provided the Tribe with invaluable intelligence on the mindset and culture of the Alanciari. Vrai and his crew also commandeered an Alanciari harvester Mischance which they used to return to Keshtah Minor with the captive Jogan Halder. Meanwhile, Vrai stayed behind on Alanciar with Quarra Thayn who had agreed to lead him on a reconnaissance ground probe of her home continent in return for not harming her lover, Jogan."}, {"tag": "h3", "text": "The Grand Deception"}, {"tag": "p", "text": "Following Edell Vrai's unsuccessful mission,his followers had managed to make contact with Grand Lord Hilts. After learning of the situation on Alanciar, Hilts devised a plan to conquer Alanciar without sustaining heavy casualties on the Tribe's part. After learning of the contents of the Keshtah Chronicles, he decided to bring Jogan Halder to Keshtah Minor and indoctrinate him into believing that the Tribe did not actually pose a threat to Alanciar. Thus, Hilts ordered Vrai's crew to travel back with Halder on the Mischance, which the Tribe intended to study since they lacked the technology and resources needed to building wooden sailing ships. As part of this grand deception, Hilts arranged for the Tribe's most loyal Keshiri supporters to stage a large public carnival in the capital Tahv on the day that Jogan was scheduled to arrive. Meanwhile, the Sith retreated from public view to reinforce the deception that the Sith were benign and resided within their capitol in \"quiet contemplation.\""}, {"tag": "p", "text": "Hilts' \"great deception\" worked according to plan. After arriving in Keshtah, Jogan Halder was transported by cart to the Sith capital Tahv. Throughout the journey, Jogan was blindfolded while his captors ran ahead and worked with the others to coordinate the deception. As soon as Jogan arrived in Tahv, he was welcomed by the local Keshiri who told him of the benign intentions of the Sith. He was later allowed to visit their capitol building where he was misled by the Circle of Lords into believing that the Sith were the Protectors, ancient gods in Keshiri religion. The Sith claimed that Edell Vrai and his airships which the Tribe had shot down earlier did not pose a threat to the Alanciari. Rather, they were emissaries of the Tribe who had been sent in pursuit of Korsin Bentado, a rival High Lord, whom they described as the \"servant\" of the Destructors, malevolent entities in Keshiri religion. The Sith claimed that Bentado had been driven from the Tribe but had built a fleet of airships with the intention of conquering other continents. In the end, Halder was won over by the Sith's arguments and became their \"ambassador\" to the Keshiri."}, {"tag": "p", "text": "In reality, the Sith had intended to conquer Alanciar from the start. Vrai had actually been sent to scout Alanciar in preparation for Korsin Bentado's invasion. Bentado was the military of commander of the Tribe's invasion force which was known as the Ebon Fleet due to the dark hue of its airships. Knowing the military capabilities of the Tribe based on Vrai's dangerous \"first contact\", Grand Lord Hilts had intentionally allowed Bentado to invade Alanciar with the intention of giving the Alanciari a \"fight\" they could win. During the invasion, Bentado's Ebon Fleet was wiped out. However, the High Lord and several of his followers survived and regrouped. They then infiltrated the Alanciari capital of Sus'mintri where they assassinated the entire War Cabinet and seized control of Vaal Hall and its centralized signal tower, which controlled the entire semaphore network throughout Alanciar. This development benefited the Sith because they had effectively decapitated the centralized military leadership of the Alanciari without arousing the local population and garrison."}, {"tag": "p", "text": "Korsin Bentado informed Grand Lord Hilts of the news. This pleased the Grand Lord who then departed for Alanciar on his airship Good Omen with his \"ambassador\" Jogan Halder. He ordered Bentado to hold his position until more Sith reinforcements arrived. However, Bentado then conspired against Hilts since he had already planned to kill Hilts and then establish a \"Second Tribe\" on Alancair under his own leadership. Bentado had regarded Hilts as an obstacle to the Grand Lordship. He planned to use Vaal Hall's signal tower to order the Keshiri gunners and uvak squadrons to shoot down Hilts' airship before it could land at Port Melephos, a maritime port. However, Bentado was stopped by Hilts' ally Edell Vrai, Quarra Thayn and his own Keshiri aide Squab, who was secretly loyal to Grand Lord Hilts. In the end, Bentado was personally killed by Squab. Vrai then secured control over Bentado's followers."}, {"tag": "h3", "text": "The New Herald"}, {"tag": "p", "text": "Jogan Halder's Testament was delivered at three known separate occasions. On its first occasion, it was delivered shortly after Grand Lord Varner Hilts' airship Good Omen landed at Port Melepoth. On its second occasion, the Testament was delivered at the Alanciari capital of Sus'mintri. On the third occasion, Halder delivered the Testament by using Vaal Hall's semaphore system which transmitted the Testament throughout Alanciari. On all occasions, the reading of Jogan Halder's Testament attracted large crowds and was overwhelmingly warmly received by the local population who regarded it as an end to centuries of their society being trapped in a war footing. Many Keshiri regarded him as the new \"Herald\" and the successor to Adari Vaal, who had played an important role in shaping Alanciari society. However, skeptical observers like Quarra Thayn noted that this new \"Herald\" unlike Adari \"told tales which pleased the Sith.\""}, {"tag": "p", "text": "Jogan Halder's testament was immediately followed by a speech by Grand Lord Hilts, who had proclaimed himself as the \"Kesh-born\" minion of the Bright Tuash, an avian Keshiri deity. Hilts claimed that he was two thousand years old and that both the Sith and Keshiri were his children. He also claimed that Adari Vaal, the revered founder of Alanciari civilization, was his daughter and that she had been well-meaning but misguided. He backed Jogan's account and professed to be saddened that the Destructors had attacked and killed the Alanciari War Cabinet. He also assured the Alanciari that the Destructors and their leader had been defeated by his agent Edell Vrai and the Alanciari woman Quarra Thayn, whom he described as a well-trained soldier. To facilitate peace between the two continents, the \"Bright Tuash\" decreed that both Human and Keshiri relief workers in white robes would arrive from Keshtah over the next few days to promote reconciliation and unity."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Jogan Halder's Testament was a pivotal turning point in the history of the planet Kesh. As a result of its message, the Alanciari peacefully submitted to the Tribe. Following the Sith annexation of Alanciar, Jogan became a professional hermit who visited the various cities of Alanciar in the airship Good Omen to repeat the story of his adventure. Halder's story was dramatized with the help of Keshiri actors and song-writes imported from Keshtah and gradually replaced the Observance Day plays which were based on the life of Adari Vaal, whose teachings were regarded by the new Sith authorities as outdated if not subversive. According to official rhetoric, Adari had merely been found on a rock. By contrast, Jogan had lived on a rock before his revelation to the truth. Thus, Jogan was regarded as the new \"Rock of Kesh.\" The Sith also perpetuated the notion that the past two thousand years of Alanciar's history had been lost to a sort of \"collective madness\" which had been governed by an unnecessary fear of the Sith. Due to his services to the Tribe, Halder gained a place of honor in their society. This prestige was also enhanced by the fact that he was the first recorded Alanciari visitor to Keshtah Minor, the domain of the Tribe. Finally, he broke off contact with his one-time lover Quarra since he was preoccupied with his new role and status."}, {"tag": "p", "text": "As a result of the peaceful annexation of Alanciar, the Lost Tribe gained access to a large and wealthy continent which had a substantial industrial base and was rich in lumber. This lumber enabled the Tribe to build a significant fleet of sailing ships which began exploring the other regions and seas of Kesh in 2974 BBY. Grand Lord Hilts himself regarded the conquest of Alanciar as one of his most successful policies since he not only increased the Tribe's territories but also eliminated a political rival, Korsin Bentado. Hilts would regard the act of bringing the Alanciari Keshiri willingly into the Sith's service as a greater victory than capturing new slaves in combat. This victory was recorded in Hilts' testament, which was read to the Tribe's leadership every twenty-five years. Finally, Halder's one-time captor, Edell Vrai, was appointed as the new governor of Alanciar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}