{"url": "Tessala_Corvae", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Tessala Corvae"}, {"tag": "p", "text": "Tessala Corvae was a Major General, and one of the handful of high-ranking female officers in the Imperial Army. Her father had served with distinction as a general in the Clone Wars, and while she was a highly motivated and effective officer in her own right, she would not have overcome the Imperial military's inherent sexism as well as she did if she had not been a general's daughter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "Tessala Corvae was born into a family with a long pedigree of military officers. She was the daughter of a general who had earned fame during the Clone Wars, and through her father's distinction, she was admitted to the Imperial Academy on the Colonies planet of Carida. There, Corvae worked harder than most and graduated with honors in spite of the discrimination and other setbacks that beset her."}, {"tag": "p", "text": "Tessala Corvae distinguished herself in her Academy days at Carida and her subsequent service as an AT-ST commander, and on her promotion to Major General, she hoped for an independent Corps HQ command in an Outer Rim trouble spot—and another chance to prove herself in combat."}, {"tag": "p", "text": "Her experiences had left her with a belief that female soldiers were automatically undervalued by Army high command, and in response, she founded the Firebird Society, an all-female organization of loyalist initiates, whose ultimate aim was to prove the worth of women as warriors to the Imperial authorities. Highly-trained and highly-motivated, Corvae and her associates carried out vigilante actions against enemies of the New Order, to test and hone their combat skills, and to illustrate by direct action just how deadly and effective female warriors could be."}, {"tag": "h3", "text": "In the Tapani sector"}, {"tag": "p", "text": "Instead of seeing combat, Corvae found herself appointed instead to command the 1st Tapani Assault Battlegroup based on well-defended stronghold of Tallaan. Here, she effective and efficient as she stamped authority on her soldiers, but Corvae chafed at the diplomatic duties and the tasks associated with maintaining the garrison. She longed for unrest to break out in Tapani sector so that she would have an opportunity to demonstrate her mettle in battle."}, {"tag": "p", "text": "Although she was careful to avoid any too-overt actions that might lead the authorities to discover her role as the Matron of the Firebird Society, she found willing recruits among the Tapani noblewomen, swelling the group's membership to around a hundred, and she used her position as Army commander at Tallaan to secretly arm the sorority with Imperial equipment, including two Lambda-class shuttles, twenty sets of Stormtrooper armor, and an arsenal of infantry weapons."}, {"tag": "p", "text": "Years later in 9 ABY, Tessala Corvae was killed while attempting to retake the Lusankya during the Galactic Civil War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Physically, Corvae was tall and athletic, with ivory skin offset by ebony hair and bright red lips; in her character, she combined a willful strength with the well-trained professionalism of an Imperial officer. She could be both fair and vicious—and sometimes both at once, as seen in the harsh treatment she meted out to troops who failed to come up to the standard that the Army expected. Her professional expertise was centered on armor and artillery operations, but she had honed her hand-to-hand abilities in Firebird Society training camps, and she typically carried two concealed vibroblades as well as her service pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First introduced in the 1997 Star Wars: The Roleplaying Game supplement Lords of the Expanse with a brief mention in an individual article segment, Tessala Corvae was established as part of the Firebird Society. Later, Galaxy of Intrigue expanded on Corvae's background in the segments on the Firebird Society."}, {"tag": "p", "text": "Although Lords of the Expanse says that Tessala Corvae founded the Firebird Society, Galaxy of Intrigue states that she created a faction within the organization after joining it."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}