{"url": "Battle_of_Kalist_VI", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Battles in the Deep Core", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Kalist VI"}, {"tag": "p", "text": "A battle occurred at Kalist VI during the aftermath of the subjugation of Jabiim. It was a Rebel attempt to rescue mathematician Jorin Sol."}, {"tag": "h2", "text": "Space battle"}, {"tag": "p", "text": "The Imperial tanker, the Nuna's Twins, was attacked by the Red Squadron X-wings of the Rebel Alliance led by Wedge Antilles supported by a Recusant-class light destroyer. A TIE fighter defense force tried to hold the attackers off, but received several casualties. The timely arrival of the Acclamator-class slave ship carrying Jabiimi rebels commanded by Janek Sunber from the Battle of Jabiim caused the X-wing and The Rebel Destroyer to retreat."}, {"tag": "p", "text": "The Rebel attack was proved to be a distraction for a team of Rebel intelligence infantry, led by Luke Skywalker, to board the freighter."}, {"tag": "h2", "text": "The Infiltration"}, {"tag": "p", "text": "Under the alias of Jundland, Skywalker allowed a team disguised as stormtroopers to land. Upon entering the base, the intel team killed an entire platoon of stormtroopers. The team then cleared the deck of the bodies, and took on the role as their \"replacements\"."}, {"tag": "p", "text": "During the infiltration, Deena Shan slipped information of an Alliance base on the planet Thila. In truth, the base was abandoned and booby-trapped with a series of explosive mines. In the ensuing ambush, the entire stormtrooper team was wiped out. To Deena's dismay, her lover, Captain Kale Roshuir, led the team there, but he survived."}, {"tag": "p", "text": "Luke Skywalker met up with his childhood friend, Janek Sunber."}, {"tag": "p", "text": "The Alliance intel team discovered that Jorin Sol wasn't the only prisoner brought to the installation; a number of Jabiimi rebels were discovered by Basso, and the Alliance strived to rescue them."}, {"tag": "p", "text": "Rebel Intel trooper, the Duros Mouse, was assigned to plant a series of explosives in the base. After a confrontation with Imperial troops, he was discovered as a spy, he was pursued through the hallways of the installation. He managed to plant the last mine before getting gunned down."}, {"tag": "p", "text": "Upon Roshiur's near demise at the Ambush at Thila, he reported back to base: rebel operatives infiltrated the base. During a conversation with Sunber, Luke was recognized as one of the operatives after the series of explosives set by Mouse detonated. Luke had no choice but to knock his once friend out unconscious."}, {"tag": "h2", "text": "Starfighter bombardment"}, {"tag": "p", "text": "With the Imperial staff being evacuated and Jorin Sol with them, Red Squadron was signaled and began providing support for the Y-wings, bombarded the installation from above. Luke Skywalker commanded the Alliance Cruiser to entirely bombard the base as it was already being obliterated. As the base was being destroyed, Luke Skywalker and the intel team released the Jabiimi prisoners. As the Rebels and Jabiimi continued to board an Acclamator-class slave ship. Sunber, in a last attempt to prevent the rebels from escaping, confronted Luke and attempted to shoot him. Using his lightsaber, Luke deflected the bolt back and wounded Janek's shoulder, giving the slaves and Jorin Sol a chance to board the transport. As the rebel operatives escaped in the Nuna's Twins and the Acclamator, Sunber stood thinking—he lost both his friends, Luke and Biggs Darklighter, to the Rebellion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The much needed Imperial reinforcements arrived a few days late. The Imperials continued to rebuild the installation after the the near obliteration of the base. Sunber was healed through bacta treatment. Jorin Sol was successfully rescued, and the operation was a success for the rebellion."}, {"tag": "p", "text": "However, during Sol's torture, a chip was planted in his brain. He had been programmed as an Imperial spy with the chip, and was given the assignment of destroying the Alliance Fleet from within."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}