{"url": "Battle_of_Kalandis_Seven", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Pallis sector", "Category:Battles of the Galactic War"], "nodes": [{"tag": "h1", "text": "Battle of Kalandis Seven"}, {"tag": "p", "text": "During the Galactic War between the Sith Empire and the Galactic Republic, a battle was fought on the planet Kalandis Seven. The Republic Military gained momentum in the conflict after the news of a victory in the Battle of Corellia, and a covert attack on a spaceport and its subsequent bombing were severe blows to the Empire's efforts on the planet. The battle also saw Colonel Jace Malcom of the Republic Special Forces Division recalled back to the Core Worlds by Supreme Chancellor Leontyne Saresh, where he would be appointed as Supreme Commander of the Republic Military at some point after the Battle of Ilum."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 3642 BBY, the Galactic War broke out between the Galactic Republic and the Sith Empire after over a decade of peace during the Cold War. The Empire launched an offensive in the Core Worlds as the war continued, invading the planet Corellia and sparking the lengthy Battle of Corellia. The Empire also attacked planets across the Inner Rim and the Mid Rim, including Kalandis Seven in 3640 BBY."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Imperial Navy deployed command ships around the planet, though the Republic Military was still able to gain a foothold on the surface as the Republic Navy engaged the Imperial ships. Agents of the Republic Strategic Information Service aboard the ships began to propaganda down to the surface after the Battle of Corellia ended in a resounding victory for the Republic. The loss at Corellia forced the Empire to abandon its Coreward offensive, and Supreme Chancellor Leontyne Saresh's victory speeches were used to inspire the fighters on Kalandis as they continued to fight amid Kalandis VII's fog-covered canyons and plains."}, {"tag": "p", "text": "During the battle, a squad under the command of Sergeant Shanra Immel was tasked with destroying a nearby spaceport that was under Imperial control. Colonel Jace Malcom of the Republic Special Forces Division was assigned in an advisory capacity to the unit, though the group was attacked on the way to their objective and Corporal Amden vor Keioidian was critically injured. Immel decided to leave Keioidian behind with his med tracer active in hopes that he would be rescued, despite the possibility that the Empire might deploy the troopers known as \"vultures\" that hunted injured enemy combatants via their tracers, and the unit continued on to their objective. They reached their target three hours later, and the unit prepared to plant beacons on the spaceport so that the Republic's fighter wings could target the base accurately—a plan put together by Colonel Malcom."}, {"tag": "p", "text": "The attack was a success, as the Republic soldiers quickly eliminated the few sentries and personnel in their path in the south side of the spaceport and planted their beacons. However, Colonel Malcom spotted a planetary command ship that had just landed, and he decided to board the ship himself while Sergeant Immel's squad retreated and waited for the Republic fighters to arrive. Three hours later, Malcom began his attack aboard the ship, and he made his way to the bridge after eliminating the few sentries who made the mistake of crossing his path. Ignoring the scattered officers who were manning the ship's controls, Malcom charged the Sith overseer who was in command of the vessel. The resulting brawl caught the Sith by surprise so that she could not use her lightsaber, though she was still able to unleash a blast of lightning at the soldier before Malcom unloaded his blaster rifle into her stomach."}, {"tag": "p", "text": "To Malcom's surprise, the officers fled the bridge after realizing that the Sith had activated the ship's self-destruct mechanism, and the soldier fell through the viewport of the cruiser as it tore itself apart. However, Malcom landed on the wing of a Republic fighter, saving him from falling to his death, and the colonel was taken to a nearby base where he boarded a shuttle to the starship Frontier Justice. The Justice and its Jedi Knight pilot had been sent by the Supreme Chancellor herself, as Malcom was being recalled to the Core Worlds, though Malcom did not expect Sergeant Immel and her squad to survive longer than a month."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Not long after the battle, Malcom was selected to replace Supreme Commander Rans by the Supreme Chancellor, and the Special Forces veteran continued to guide the Republic Military during the ongoing war with the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Kalandis Seven first appeared in The Last Battle of Colonel Jace Malcom, a short story written by Alexander Freed for Star Wars Insider 137 in 2012. The story depicts Malcom's last assignment before being recalled to the Core Worlds, where he will be appointed as Supreme Commander at some point after the Battle of Ilum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}