{"url": "Battle_of_Kashyyyk/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Battles of the Felucia theater", "Category:Battles of the Great Jedi Purge", "Category:Battles of Kashyyyk"], "nodes": [{"tag": "h1", "text": "Battle of Kashyyyk"}, {"tag": "p", "text": "The Battle of Kashyyyk, also known as the Battle of Kachirho, was a prolonged campaign against the Galactic Republic that took place during the Outer Rim Sieges and was among the final conflicts of the Clone Wars. It was fought on the planet Kashyyyk, the homeworld of the Wookiees that had been invaded by the Confederacy of Independent Systems hoping to claim the Kashyyyk hyperspace junction, as well as gain information on secret hyperspace routes rumored to be in Wookiee archives, that could turn the war in its favor. In the course of the battle, Supreme Chancellor Palpatine issued Order 66, clone troopers turned their weapons on their Jedi commanding officers, though the Wookiees helped many Jedi escape."}, {"tag": "p", "text": "During the proclaimed transformation of the Republic into the Galactic Empire, confused fighting as part of an Imperial crackdown on the Wookiees followed."}, {"tag": "p", "text": "Kashyyyk would be totally subjugated by the Empire several weeks later and endured a prolonged period of occupation until it was at last liberated by the New Republic in 4 ABY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Kashyyyk was a major navigation hub for the eastern quadrant of the galaxy, sitting at a nexus of the lateral hyperlanes linking the Perlemian Trade Route and the Corellian Run, as well as dominating the ancient routes running from Hutt Space towards the Core Worlds. By 19 BBY, the Republic Military had secured the major super-hyperroutes to the north and south, so the Kashyyyk hyperlanes, though slower than the main routes, represented the Confederacy of Independent Systems' best chance of outflanking the Republic in the Outer Rim or penetrating the Core Worlds."}, {"tag": "p", "text": "Additionally, the Wookiees had long been rumored to possess knowledge of secret hyperspace routes; the Claatuvac Guild, based out of the city of Kachirho, had a long tradition of training hyperspace scouts, and both Republic and Separatist intelligence agencies were determined to claim their archives. Furthermore, Kashyyyk had long been considered a model of Republic influence in the Mid Rim, with the Wookiees being representatives of the Republic in the otherwise-dangerous Mytaranor sector and on the edge of Hutt Space. The Separatist movement considered the Wookiees politically embarrassing."}, {"tag": "p", "text": "Therefore, Kashyyyk was a strategically important system which had long been a target for the Confederacy military. Confederate leaders requested the Wookiees join their rebellion, but the Kashyyyk Royal Families proved indecisive. Separatist\nGeneral Grievous, frustrated over the Wookiees' delay, decided to send Confederate droids to Kashyyyk to force the issue. The droids accidentally killed Prince Rikummee, who was out hunting, and an enraged King Grakchawwaa decided to oppose the Separatists."}, {"tag": "p", "text": "After a number of probing attacks throughout the war, the Separatists finally decided on a full-scale invasion of the city of Kachirho in the Wawaatt Archipelago. This was to serve as a literal beachhead into the rest of the forest-covered planet. To this end, the Separatists made particular use of the age-old hostility between the native Wookiees and their system neighbors, the Trandoshans, to prepare for their attack. The Trandoshans already had slave camps on Kashyyyk where they held Wookiees captive. After it was discovered that Trandoshan slavers had an agreement with the CIS, it was known that Trandoshans might fight for the Separatists in an upcoming battle."}, {"tag": "p", "text": "Eventually, the Separatists landed a large droid force in secret and prepared for an invasion. A Wookiee woodsmith, Tarkov, on a grantaloupe hunt with his son Jaccoba, discovered the invasion force and warned the nearest township, Kahiyuk. From there, the alarm clarions spread the word of invasion to the other archipelago cities of Warralokk, Grunnrurr, and Rowrakruk. The Wookiees prepared for war. However, while the system was an important strategic location and both sides believed the battle to be straightforward, the battle was, in fact, little more than a diversion by Darth Sidious."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Initial actions"}, {"tag": "p", "text": "The battle began with a Separatist fleet deployed in orbit around Kashyyyk and a droid army deployed to occupy the Wawaatt Archipelago, establishing a planetary shield perimeter as protection against a counterattack. General Grievous selected the nearby city of Kachirho as his bridgehead. Kashyyyk was largely covered by dense wroshyr forest that provided good defensive cover, but at Kachirho, the shallow open waters of the Wartaki Sea offered a good approach for an amphibious landing, and the lines of communication into the interior were excellent. In preparation for the assault on Kachirho, the Separatists deployed large numbers of HMP droid gunships and NR-N99 tank droids, with considerable infantry support from B1-Series battle droids. The complex terrain made more-conventional armor like the Multi-Troop Transport or the Republic AT-TE unusable."}, {"tag": "p", "text": "The massive blockade of Trade Federation cruisers around the planet blocked any reinforcements to relieve the beleaguered garrison on the surface. The clone trooper pilots of the 501st Legion were dispatched to cut a path through the starships. Destroying the Munificent-class star frigate defenses, the fleet focused all firepower on the nearest Providence-class carrier/destroyer. Using a high-altitude LAAT gunship, a squad of clone troopers formed a boarding party and sabotaged the inside of the ship, destroying the command bridge, life-support, and engines. They came across a battle-plan holocron, which contained the Separatist's strategies for the ground battle, and delivered it safely back to their Star Destroyer. With a path cut through the blockade, the Republic's reinforcements touched down on the planet."}, {"tag": "h3", "text": "Delta Squad's mission"}, {"tag": "p", "text": "The clone commandos of Delta Squad, led by Boss, infiltrated a Trandoshan mercenary camp in order to rescue the Wookiee Chieftain Tarfful. The commandos successfully rescued Tarfful from several of General Grievous's MagnaGuards, as well as obtaining intelligence about the Confederacy's alliance with the Trandoshan mercenaries."}, {"tag": "p", "text": "Delta Squad also discovered the number of hostiles on Kashyyyk  was higher than the Republic High Command had previously thought. The squad then sabotaged the Trandoshans' outpost on Kashyyyk, destroying two of their landing pads. When the Confederacy launched their full-scale invasion of the Wookiee tree-city of Kachirho, Delta Squad was the only Grand Army of the Republic unit planetside capable of assisting in the defense. Delta Squad sabotaged a bridge connecting the two sides of Kachirho, stopping the Confederacy's advance. The commandos also secured vital munitions and ordnance depots for the Wookiees, allowing them to sufficiently arm themselves to fight against the Confederacy."}, {"tag": "p", "text": "Their final operation was the destruction of a Recusant-class light destroyer attempting to land more battle droids onto the surface. Following this, Sev, the team's sniper specialist, was lost and presumed MIA, but orders that came directly from Jedi Grand Master Yoda forced Delta Squad to abandon Sev. Delta Squad was then extracted and redeployed as the Republic invasion force arrived, and the Battle of Kashyyyk was joined."}, {"tag": "h3", "text": "Massing at Kachirho"}, {"tag": "p", "text": "Meanwhile, Wookiees from across Kashyyyk flocked to Kachirho. Among these brave Wookiees was Chewbacca, an old friend of Kachriho's chieftain, Tarfful, who feared greatly that Kashyyyk would be unable to defend itself against the might of Separatist forces. Led by Merumeru, Wookiee warriors established positions deep in entrenchments and revetments. These forces, on the ground and in the ornithopters and Wookiee catamarans, included Salporin, Eugroothwa, Zittaasabba, Attichitcuk, Guanta, Gorrlyn, and Lachichuk."}, {"tag": "p", "text": "The Wookiee defense of Kachirho was reinforced by a Republic vanguard led by clone trooper commander Faie, and included a battalion of scout troopers from the 501st Legion, a troop of clone commandos, and the 7th Aleena Reconnaissance Regiment led by the Jedi Master Tsui Choi, who collected intelligence on enemy maneuvers prior to the battle on flying Can-cells. Other elements were led by Jedi General Luminara Unduli, soon followed by Quinlan Vos."}, {"tag": "p", "text": "Unduli and Vos, as well as Wookiees led by Gumbaeki, Guildmaster of the Claatuvac Guild and an elder from the Palsaang tribe, infiltrated an encampment of Trandoshans using the Separatist raiding party as an excuse to capture and enslave Wookiees. Destroying the encampment and freeing the hairy simians was a simple matter, but a crab droid ambushed the group shortly afterward and was subsequently destroyed by the Inferno, a ship belonging to the Devaronian smuggler Vilmarh Grahrk, who'd had previous relationships with General Vos. Vilmarh, or \"Villie,\" alongside his young Wookiee friend, Gumbaeki's grandson, Chak, had apparently recently been smuggling goods to Palsaang. The Separatists' true intentions in invading Kashyyyk were revealed when a dying Trandoshan, Karniss, revealed that the CIS came in search of the hidden Claatuvac hyperspace routes that would give them much strategic advantage. Quinlan soon discovered these routes had fallen into the hands of Vilmarh, with some assistance from Chak, whose grandfather was a member of the Claatuvac Guild."}, {"tag": "p", "text": "After arriving through the dangerous Kashyyyk orbit (due to surrounding Separatist space forces) with Chieftain Tarfful from Coruscant, Jedi Master Yoda, who'd maintained good relations with the Wookiees in previous Trandoshan incidents (and earned the title \"Defender of the Home Tree\"), was informed of these routes. Consequently, Yoda revised the Republic defensive plan. Commander Faie had planned to disrupt and harass Separatist troops in a mobile defensive campaign. Instead, Yoda decided that the Separatists had to be stopped right outside Kachirho, a change of tactics that meant heavier casualties and necessitated the deployment of a larger army under Jedi command."}, {"tag": "h3", "text": "Yoda's battle plan"}, {"tag": "p", "text": "From Coruscant, Yoda had brought the the crack battalions of the 41st Elite Corps—generally regarded as the best division in the Third Army—led by clone commander Gree, and a full assault brigade from the 501st Legion. Yoda planned to conduct a static defense and hold the Separatists right outside the walls of Kachirho. The 41st Elite reinforced Kachirho just before the Separatists attacked."}, {"tag": "p", "text": "After receiving a transmission from the Jedi Council concerning the discovery of Separatist General Grievous on Utapau, Yoda went into battle meditation as the Separatist shield generator was lowered. Separatist forces rushed across the lagoon at speed in a simple wave attack, with armor and gunships storming Kachirho's beaches and sea walls with large numbers of droid infantry in support."}, {"tag": "p", "text": "Merumeru's Wookiee forces rushed across the beachfront to confront the enemy as more warriors swung from the cliffs along the archipelago to place mines on the combustible droid forces. Meanwhile, clone troopers fired from trenches, and clone sharpshooters sniped out enemies from the branches of Tree Kachirho. On the vehicle front, Wookiee Oevvaor jet catamarans were aided by the Republic's Juggernauts, AT-AP and AT-RT walkers and other assault vehicles. They faced opposition from Separatist NR-N99 droid tanks, DSD1 dwarf spider droids and Heavy Missile Platforms."}, {"tag": "p", "text": "The job of the 41st Elite and detachments of the 501st Legion, supported by Wookiees, was to fight on the beachfront defending the sea wall and to hold the line until Separatist forces were fully committed. When this occurred, Yoda gave the word to Master Unduli to counter-charge the droid army on its left flank with the 41st Elite. Simultaneously, Quinlan Vos, alongside Chewbacca and Tarfful, was sent across the lagoon to lead an attack on approaching Separatist forces, but Villie still felt it necessary to join the action, a decision that led to the destruction of the Inferno by an enemy gunship. Vos, Villie and Chak were immediately sent to a Juggernaut to recuperate."}, {"tag": "h3", "text": "Beaten back"}, {"tag": "p", "text": "The battle seemed to go back and forth until, despite the best efforts of the combined Wookiee/Republic defense, Kachirho was in danger of being overrun by the Separatists. The 501st Legion had been beaten back by Separatist forces, which were advancing on the Kachirho sea wall and attempting to destroy a crucial energy refinery. Defending the sea wall from atop it were two concussion turrets and multiple clone troopers. However, few attempts from the CIS to destroy the sea wall were made from the Wookiee refinery, and eventually the tide of the battle turned in favor of the Republic. The best efforts of clone engineers and TX-130S fighter tanks managed to keep the sea wall intact until Master Yoda could arrive to push the CIS back. With the foiling of this crucial mission, the droid army began to retreat from the refinery, and the surrounding beaches were recaptured."}, {"tag": "p", "text": "Despite this success, Republic forces suffered heavy casualties. The decision to meet the droid army in the shallows meant that Republic Juggernaut armor and AT-AP artillery could not be deployed until Separatist forces had come ashore, at the cost of heavy infantry casualties on the beachfront."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "Suddenly, Master Yoda was shocked by a strong disturbance in the Force as Order 66 was carried out throughout the galaxy. Clone Commander Gree received a comlink call on a frequency-locked channel reserved for the Supreme Chancellor. Supreme Chancellor Palpatine, alias the Sith Lord Darth Sidious, instructed him to execute Order 66 against General Yoda. A 41st trooper joined Gree and attempted to assassinate Yoda. As the clones prepared to execute him, Yoda drew his lightsaber, sensing what was about to happen, and in one fell swoop decapitated his would-be assassins. Yoda then escaped into the nearby jungle along with Wookiee warriors Tarfful and Chewbacca, after fighting through swarms of clone troopers. Their quick escape was fortunate, as a minute later, a Juggernaut fired at Yoda's command post in a meeting hall, obliterating it."}, {"tag": "p", "text": "Outside, the battle between Republic and Separatist forces was slowing down: Wookiees stacked wrecked droids while clone troopers assessed the damage to their equipment. Jedi Master Luminara Unduli was conferring with eight clone troopers on the transportation of wounded soldiers back to medships when Order 66 was executed and she was pelted with blaster fire from all directions. Jedi Master Quinlan Vos was reflecting on his decision to leave the Order for his love, Khaleen Hentz, when he was suddenly shot by the laser cannon of a nearby Juggernaut, under command of Commander Faie, who'd just received Order 66. Quinlan survived, although severely burned, and vengefully slew all the 41st Elite Corps troopers under Faie's command who were searching for him. Eventually, he ran into Faie and killed him, but not without suffering dire wounds from his DC-15S. Cleverly, Vilmarh Grahrk found him and burned Faie's body, then tricked the clone troopers into thinking it was Quinlan's. After nursing him back to good health in a bacta tank, Vilmarh and Quinlan would return eight months later, where the Jedi would reunite with Khaleen and meet his new son, Korto Vos."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "In the confusion surrounding Order 66, however, the droid army managed one last effort and broke the lines at Kachirho although the clone army was able to hold them back. Yoda, with Tarfful and Chewbacca, escaped into the nearby mountains, evading clone patrols. Later that evening, Chewbacca and Tarfful brought Yoda to an escape pod. After exchanging farewells, Yoda left the planet in the pod, and the two Wookiees went to rejoin their fellows. By this time, the droid army was slowly losing the war and was ultimately shut down by Sidious' new apprentice Darth Vader who at the behest of his master also killed the Separatist council on Mustafar, ending the war"}, {"tag": "p", "text": "With the fighting ceasing, AT-RT squads were deployed to patrol Kachirho. Due to the Wookiees' support the Jedi when Order 66 was issued, the Empire enforced a crackdown, with it taking several days of confusion to restore order in the city. The commando Triton Squad then began killing fugitive Wookiees throughout the forest before the Empire pulled out."}, {"tag": "p", "text": "Ultimately, the forces of the Galactic Empire left Kashyyyk empty-handed: after investigating the vault of the Claatuvac Guild in Tree Vikkilynn in Kachirho, they found the Guild's data stacks wiped clean of information. Some twelve of the Guild's most trusted scouts had fled with the navigational data encrypted in HoloGrids, and it would not be until nearly twenty years later that one came to light in the hands of Chewbacca."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Soon after the Clone Wars ended, the Wookiees to begin salvaging the masses of wrecked military hardware that the battle had left strewn across their world. Ironically, the Wookiees put this equipment to good use against Imperial forces several weeks later: the Empire, led by Darth Vader, returned to and occupied Kashyyyk mere weeks later when it was discovered the Wookiees were harboring fugitive Jedi led by Roan Shryne and Olee Starstone. Kashyyyk was subjected to enslavement thereafter by the Empire, with many millions of Wookiee slaves used in the construction of the Death Star. However, resistance on Kashyyyk continued for years afterwards, with Jedi Master Kento Marek leading a battle around 18 BBY, and the Empire was still conducting pacification operations as late as 15 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A climactic battle between the technologically advanced Empire and a race of primitive hairy aliens, the Wookiees, was present in George Lucas's original treatment for A New Hope. As the story changed and the trilogy structure was solidified in Lucas' mind, the battle was postponed until Return of the Jedi, where it developed into a battle featuring Ewoks on the forest moon of Endor. At the same time, the Wookiees developed into a more technologically savvy, though not less hairy, species. Lucas' original conception of the battle featured hundreds of Wookiees on screen. Due to costs, the original idea was scrapped and replaced by a battle featuring relatively few diminutive Ewoks, who did not play a very significant tactical role in the battle. A large-scale battle with hundreds of characters was eventually realized in The Phantom Menace."}, {"tag": "p", "text": "The first depiction of this battle appeared in the 2004 video game Star Wars: Battlefront as the last level in the game's Clone Wars Campaign. At the time of the game's release, LucasArts did not want any Episode III content to be revealed very early, therefore the game's depiction of the battle features clone troopers in phase I armor despite the fact that most clone troopers (besides the clone advisor in Republic Commando) would have already switched to phase II armor by the time this battle occurred."}, {"tag": "p", "text": "The fight was parodied in LEGO's Revenge of the Brick spoof of Revenge of the Sith."}, {"tag": "p", "text": "In LEGO Star Wars: The Video Game, an alliance of sorts between the clones and droids is depicted following the execution of Order 66. Needless to say, this event is not part of the Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}