{"url": "Teth_system", "categories": ["Category:Canon articles", "Category:Baxel sector star systems"], "nodes": [{"tag": "h1", "text": "Teth system"}, {"tag": "p", "text": "The Teth system was a star system located in the Baxel sector of Wild Space, at grid square U-16 on the Standard Galactic Grid. The system contained a single star orbited by the jungle planet Teth and its two moons. In 40 BBY, Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi were sent on a mission to Teth. There, the two investigated and prevented Hutts from attacking agricultural shipments on the Triellus Trade Route."}, {"tag": "p", "text": "Later, during the Clone Wars, the Confederacy of Independent Systems brought the son of Jabba Desilijic Tiure to Teth. As a result, the Galactic Republic launched an attack led by Jedi General Anakin Skywalker against the Separatist forces on the surface, where Skywalker and his Padawan, Ahsoka Tano, managed to rescue the Huttlet. Sometime later in 21 BBY, Teth served as the site of a skirmish between bounty hunter Cad Bane and Jedi Kenobi and Quinlan Vos."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Teth system was a star system located in the Baxel sector, which straddled both the Outer Rim Territories and Wild Space, with the Teth system located in the latter. It lay in grid square U-19 on the Standard Galactic Grid, and contained the jungle planet Teth and its two moons, which orbited the system's single star."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Teth system first appeared in the new Star Wars canon in the Star Wars: The Clone Wars theatrical film, which was released on August 14, 2008. The Teth system originally appeared in the Star Wars Legends continuity in the junior novelization of the Star Wars: The Clone Wars film, authored by Tracey West and published on July 26, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}