{"url": "Tev_Rimon", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Navy pilots of Darth Krayt's Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tev Rimon"}, {"tag": "p", "text": "Tev Rimon, a Human male, was a starfighter pilot in the service of Dark Lord of the Sith Darth Krayt's Empire during the Second Imperial Civil War. He flew a Predator-class fighter, under the call sign of \"Crasher\" in Captain Gunn Yage's Skull Squadron, a unit in the Imperial Navy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 137 ABY, Skull Squadron was stationed on the galactic capital of Coruscant when bounty hunter and former Jedi Cade Skywalker attempted to rescue the Bothan Jedi Knight Hosk Trey'lis from the Temple of the Sith. Given orders to capture Skywalker alive, Lieutenant Rimon and the Skulls engaged the former Jedi's starship, the Mynock, in the skies of the planet until Skywalker managed to lose his pursuers in the undercity."}, {"tag": "p", "text": "Approximately a week later, Rimon flew against the Mynock once again when a group of Skywalker's allies, including his mother, Moff Nyna Calixte—acting in disguise so she would not be recognized—piloted the ship as they attempted to rescue Skywalker from the Sith Temple where he was being held captive. Just as the Skulls started to wear down the Mynock, they were given orders to abort the mission by Captain Yage's father, Moff Rulf Yage. He later participated, along with the rest of the squadron, in the Operation: Thunderstroke."}, {"tag": "p", "text": "A year later, 138 ABY, Rimon fought in the Attack on the Hidden Temple, where Skull Squadron was given orders to shoot down a Jedi shuttle. Captain Yage refused to shoot defenseless children and shot Darth Rauder, instead. Rimon complied with Yage's commands and joined the Empire-in-Exile to fight against the Sith on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}