{"url": "Battle_of_Kariek", "categories": ["Category:Legends articles", "Category:Battles in Wild Space", "Category:Empire of the Hand events"], "nodes": [{"tag": "h1", "text": "Battle of Kariek"}, {"tag": "p", "text": "The Battle of Kariek was an engagement between The Warlord's army of Lakran mercenaries against the stormtroopers of the 501st Aurek Company and their Eickarie allies in 22 ABY."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Around 29 BBY, Kariek was invaded and occupied by a mysterious armored figure known as The Warlord and his army of Lakran mercenaries. For nearly fifty years, The Warlord oppressed and exploited the Eickarie people of Kariek with the least minor infraction being punished with imprisonment or execution. He and his henchmen also kept the Eickaries under his thumb using a series of fortresses and watchtowers to keep watch on the surrounding area."}, {"tag": "p", "text": "Despite his track-record of brutality, the Warlord enjoyed some limited support from the local population particularly collaborators. To keep the population subservient, he imprisoned several leading Eickarie nobles and elders at the fortress in his capital to keep the various Eickarie tribes were compliant to his rule. In the event of an armed insurgency, he planned to used them as bargaining chips by executing them to ensure his survival."}, {"tag": "p", "text": "Around 22 BBY, the United Tribes of Kariek was formed to resist the Warlord which was covertly supported by the Empire of the Hand which sought to expand its power in the Unknown Regions as much of the known galaxy lay under the control of the New Republic."}, {"tag": "h2", "text": "Details"}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "The Empire of the Hand had dispatched an expeditionary including four companies of the elite 501st Legion to Kariek in support of the underground United Tribes of Kariek's plan campaign to topple the Warlord's regime. Hundreds of these troops were stationed in the forests and plains on the outskirts of The Warlord's fortress in preparation for a straight-in assault with considerable air and ground support. There had also been a plan to orbitally bomb the Warlord's fortress to rubble though this was shelved as the command was uncertain whether or not the Warlord was in the fortress."}, {"tag": "p", "text": "The Imperial command appeared to have settled for using a small but highly trained and motivated unit to infiltrate the fortress through the tunnels connecting the fortress and watchtowers, in coordination with a ground and airborne attack. Using a disguised armored personnel carrier, the Stormtroopers entered the city around the Warlord's fortress. While on the way, they met Su-mil &ndash a freedom fighting Eickarie who knew of a third watchtower with no resistance in its tunnel. The earlier two were heavily guarded by a cadre of Lakra mercenaries."}, {"tag": "p", "text": "Along with Su-mil and several other Eickaries, the four-man squad entered these tunnels. They soon made it to their target only to find it sealed by a heavy metal door which the troopers were forced to use a special flash paste to get through. However, behind it stood a second barrier consisting of stone blocks cemented together by slabs of a grayish mortar. This time, the Eickaries deployed a catalytic mortar solvent which dissolved the second barrier."}, {"tag": "h3", "text": "Loyalty and trust"}, {"tag": "p", "text": "Twister and Su-mil led Unit Aurek-Four and a group of about 20 Eickaries through the corridors leading to the dungeons. On the way, they took on six Lakran guards and quickly overcame them. The Stormtroopers and their Eickarie allies then entered another corridor only to be captured by more Lakra. Su-mil then deceived the Lakra by pretending that he was a loyal subject of the Warlord and that he and the other Eickaries had captured Aurek Four on the streets outside the Warlord's palace."}, {"tag": "p", "text": "Su-mil then showed the Lakran commander where the Unit had allegedly entered. At first, Twister was shocked by Su-mil's betrayal but realized that Su-mil was still on his side after he used his blaster to make sign messages to him. Movement to the \"left\" indicated that he was lying while movement to the right indicated he was telling the truth. Using the comlink in his helmet, Twister signaled to the rest of Aurek Company for help. Soon, these reinforcements arrived and quickly ambushed the Lakrans with the Eickaries coming to their aid."}, {"tag": "p", "text": "With this group of Lakra put out of action, Su-mil and Twister along with several of their men rushed to the dungeons which had been left unguarded as the bulk of the guards were engaged against the enemy and protecting their master. It turned out that these Eickaries were captured nobles and elders from different tribes and were unaware of the United Tribes Agreement which united the Eickaries against the Warlord's regime. Speaking in the Eickarie language, Prince Ha-ran announced his identity and persuaded them to join in the fight against the Warlord and of the newly formed United Tribes of Kariek."}, {"tag": "h3", "text": "Bittersweet victory"}, {"tag": "p", "text": "Having convinced them, they then made their way to the circular inner stronghold of the fortress where it was reported the Warlord was hiding. They then entered the storm banquet chamber—a place for feasting during the stormy spring storms—only to find it booby-trapped with hidden explosives under the furniture. Using his helmet's advanced sensor systems, Watchman quickly spotted two sniper hollows and their snipers on the two sides of a door underneath the long banners."}, {"tag": "p", "text": "Moving their Eickaries allies back towards the entrance and the corridor, the Stormtroopers used their whipcords to grab two chairs near the door which had been fitted with grenades. The resulting explosion wrecked the chamber with the troopers narrowly avoiding a fiery death. The blast only managed to knock out one of the guards though the other was quickly killed by several of the Eickarie prisoners. This action earned the Stormtroopers the praise of the Eickaries."}, {"tag": "p", "text": "After a fierce and savage battle, the Warlord had been captured. Pinned down on the floor and still wearing his full-body armor, he was at the mercy of Su-mil who stood on him. However, instead of executing him as was the Eickarie custom, Su-mil handed the Warlord over to the Imperials who took him into their custody."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Since the Warlord always appeared in public wearing his full-body armor, the Empire of the Hand wanted to investigate whether he was either a rogue Eickarie or the leader of the Lakra invaders or even a member of an unknown species from the Unknown Regions. If he was of the third category, the Imperials wanted to investigate whether his species were a warlike and dangerous kind or if he was even disreputable among his kind."}, {"tag": "p", "text": "While Su-mil was taking a break at the Imperial base's rehab room's resistance machine, Twister caught up with him and thanked him for his aid in capturing the Warlord. Twister also praised him for his heroics and quick thinking during the battle and also offered Su-mil a place in the 501st Legion. When the next Imperial transport arrived, Su-mil was among those onboard."}, {"tag": "p", "text": "Many Eickaries were also disappointed that the Warlord had not been handed over to them to be executed given the fact that he had committed numerous atrocities during his 50 year reign in Kariek. However, the United Tribes later agreed to join the Empire of the Hand presumably to establish trade or military ties with a more powerful entity to ward off potential aggressors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}