{"url": "Battle_of_Kashyyyk_(Second_Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Battles of Kashyyyk", "Category:Battles of the Second Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Kashyyyk  (Second Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Kashyyyk took place in 40 ABY during the Second Galactic Civil War and, on the orders of Sith Lord and Chief of State Darth Caedus, saw the attempted subjugation and punishment of a Galactic Alliance member-world. It resulted not only in the withdrawal of the Hapes Consortium from the Galactic Alliance, but also the beginning of the New Jedi Order's military campaign to remove Caedus, whose identity as a Sith Lord remained secret, from high office. Despite this, Caedus achieved his military objectives; diverting the Confederation fleet away from its push towards Coruscant by forcing it to aid the Wookiees."}, {"tag": "p", "text": "During the battle, Caedus burned a large part of Kashyyyk's forests, much to the horror of the Jedi. Confederation forces encircled the Galactic Alliance Fifth Fleet, aided by Wookiee forces and a Jedi strike team. In the latter stages of the battle, the Hapan fleet under Queen Mother Tenel Ka Djo arrived to ensure Caedus's defeat. However, the rogue Dark Jedi Alema Rar arrived from the Sith world of Korriban to aid Caedus and, with the use of her ancient Sith Meditation Sphere, was able to influence the Bothan fleet into allowing Caedus a chance to escape."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Darth Caedus learned from his cousin Ben Skywalker of a Jedi plot to remove him from his office of Chief of State, coupled with the Order's desertion en masse at the Battle of Kuat, he decided both to wage a personal war against the Jedi and eliminate them as a threat, as well as divert the Confederation fleet from its drive on Coruscant. The Wookiee fleet, until that point uncertain as to whether or not to lend its considerable might to the Galactic Alliance war machine, remained in orbit around Kashyyyk while its leaders debated."}, {"tag": "p", "text": "Caedus intended to force the Wookiees to surrender the Jedi, though he knew full well that the proud species would refuse to do so, and thus he could make an example of the world. While his Galactic Alliance Guard contingent under Salle Serpa attempted to suppress the Jedi academy at Ossus, Caedus reverted from hyperspace over the Wookiee homeworld with the entirety of the Fifth Fleet. He led the Galactic Alliance forces in his personal Star Destroyer, the Anakin Solo."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Ultimatum"}, {"tag": "p", "text": "With the Fifth arrayed behind the Anakin Solo, Caedus observed the Wookiee fleet attempting to remove itself from its tenders in orbit, while a lone squadron of Owool Interceptors approached his forces. The Wookiee pilots threatened to open fire on the Galactic Alliance unless they explained their presence. In response, Caedus ordered Kashyyyk's leaders to relinquish Han and Leia Solo, enemies of his government who were on Kashyyyk at the time. In fact, Caedus's search for his parents was subordinated to his objective of capturing or killing the Jedi Masters and Knights who had traveled to Kashyyyk from Kuat. His demand that the Wookiees turn over the Solos was merely a ploy to create a pretext on which he could justify attacking the planet. When the Wookiees falsely claimed that neither of the Solos were present on the world, Caedus ordered the crew of the Anakin Solo to punish the natives of Kashyyyk by firing the Star Destroyer's long-range turbolasers at the planet's giant wroshyrs, with the intent of igniting a planet-wide conflagration. The Fifth Fleet, under Admiral Atoko, did not fire on Kashyyyk, ordered as they were to hang back and defend the Anakin Solo. As the long-range turbolaser blasts of Caedus' Star Destroyer set the planet's forests ablaze, Caedus ordered his gunners to target cities as well, and the Owools began their run on the capital ship."}, {"tag": "p", "text": "With the Wookiee Jedi Lowbacca leading the squadron, the Owool interceptors were able to 'ride the stripe' of the turbolaser blasts and thus conceal themselves from the Anakin Solo's sensors. Caedus did not realize what he faced until it was too late; by the time Commander Twizzl had ordered a ship-wide alert, the lone Jedi Knight was fast approaching the bridge. Although the Star Destroyer's defenses were able to eliminate the majority of the squadron, Lowbacca was able to launch a single shadow bomb. Ben Skywalker, who had come to believe that his cousin was responsible for his mother's death, was next to Caedus and Commander Twizzl on the bridge walkway and, moments before the shadow bomb hit the bridge, attempted to strike Caedus down to prevent him from taking any more lives. Fortunately for Caedus, Lowbacca's bomb exploded as Skywalker attacked, sending both men to the deck and wiping out the command crew. The young Jedi Knight was unable to kill Caedus amidst the chaos."}, {"tag": "h3", "text": "Jedi raid"}, {"tag": "p", "text": "Although both Lowbacca and Ben had failed to kill the Sith Lord, Caedus was forced off the bridge and encouraged to attempt to break his cousin's spirit and turn him into his Sith apprentice. He took Skywalker down to a secret chamber near one of the long-range turbolaser batteries and tortured his cousin in a Yuuzhan Vong device. On Kashyyyk, Han and Leia Organa Solo left the burning city of Rwookrrorro for Hapes in order to make an appeal for the military support of Caedus' lover, Queen Mother Tenel Ka Djo, while at the same time Grand Master Luke Skywalker began on Kashyyyk to ready much of the New Jedi Order for their assault against the Galactic Alliance forces in a wing of StealthXs. Skywalker led the Night Blades squadron on a raid on the Anakin Solo, hoping to eliminate Caedus personally and destroy the turbolaser batteries firing on the Wookiee homeworld. The Wookiee fleet was still organizing itself on Kashyyyk's far side, and therefore the Jedi were for the time being the planet's only defenders."}, {"tag": "p", "text": "As Skywalker led his wing of StealthXs against the Fifth, the Bothan fleet reverted from hyperspace and engaged the Galactic Alliance forces. Traveling from the engagement at Kuat, the Bothans were battle-damaged but numerically strong, led by Admirals Babo, For'o, and the famed Traest Kre'fey. However, while the Jedi felt that the arrival of such a large Confederation force masked their approach, they were proved wrong as the Fifth's Star Destroyers opened fire. Not only had Caedus anticipated their assault, but he had felt sure enough to fly out in his own StealthX to shoot down Skywalker and his own twin sister, Jaina Solo. The Jedi suffered many casualties as they engaged the Fifth Fleet, but Skywalker managed to fake his own death and land upon the Anakin Solo, disabling the long-range turbolasers as he made his way toward where Caedus, who had returned to the Anakin Solo, was torturing his son."}, {"tag": "p", "text": "On arrival in the torture chamber, Skywalker engaged his nephew in a fierce duel. Command of the Fifth Fleet fell to Admiral Atoko during the confrontation, which resulted in severe injuries to both Skywalker and Caedus. The Sith Lord was ultimately overpowered and the two Skywalkers escaped the Star Destroyer, leaving Caedus alive to stagger to the Anakin Solo's infirmary and receive medical attention. In the Sith Lord's absence, Admiral Atoko began to consider scuttling the Fifth Fleet, due to heavy damage sustained by its ships and crews."}, {"tag": "h3", "text": "The encircled Fifth"}, {"tag": "p", "text": "While the Jedi were assaulting the Galactic Alliance fleet, the Corellian contingent of the Confederation fleet arrived to help the Wookiees, along with the remnants of the Commenorian and Hutt fleets, which had been savaged at the earlier Second Battle of Balmorra. The Fifth Fleet was rapidly surrounded and battered by the now overwhelming might of its enemies. Caedus, expecting Admirals Bwua'tu and Darklighter to bring their commands to help him, was shocked to discover his co-Chief of State Cha Niathal had ordered the two officers to remain near the Core in case the Confederation push should continue. To compound matters for the infirmary-bound Darth Caedus, he had been unable to countermand Admiral Atoko's order to scuttle and abandon the fleet."}, {"tag": "p", "text": "Now, Caedus ordered his Admiral to break free of the forces surrounding them and make for the Bothan fleet. Atoko warned him that the crewers would probably desert if they were ordered to continue fighting, though the Admiral was dissuaded by Caedus, who reminded him that the Wookiees approaching in boarding craft to accept the Fifth's surrender would doubtlessly exact revenge for their burning planet. Caedus ordered the fleet to regroup around the Anakin Solo and make for a widening gap among the Corellian forces as the Confederation fleet seemingly prepared for new arrivals."}, {"tag": "p", "text": "Queen Tenel Ka, appalled at her lover's actions, arrived with the Hapan fleet in front of the Galactic Alliance forces and, in personal contact with Caedus, asked for his surrender. When Caedus refused, the Hapans under the Queen's father Isolder opened fire on the Anakin Solo. Although it was a foolhardy tactic, Caedus still attempted to force the Fifth Fleet through the gap between the Bothans and the Hapans, compelled by some nagging urge in the Force he could not interpret. Admiral Atoko asked once again to scuttle the fleet, as under the concentrated fire it only had minutes remaining."}, {"tag": "p", "text": "The Dark Jedi Alema Rar, in her ancient Sith Meditation Sphere, arrived at that crucial juncture and, through the power of the vessel, subverted the will of the Bothan commanders in her attempt to ensure Jacen's survival. As Caedus led his forces towards the Bothans in what seemed to be an obviously pointless tactic, Babo and the other commanders became certain, under Alema Rar's influence, that it was a trap, and moved forward to engage the remnants of the Fifth to foil Caedus' supposed plan. Thus a gaping hole in the blockade was suddenly opened. Caedus led his forces to safety and jumped to hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Aboard the Dragon Queen the Bothans apologized for their error of judgment and attempted to enlist the permanent support of the Hapes Consortium, Kashyyyk and the Jedi in the Confederation's struggle. Tenel Ka, for her part, announced that she fought Jacen, not the Galactic Alliance, and that she did not condone the actions of the Confederation. Tojjelnoot, the Wookiee official present, thanked the Bothan admirals but reminded them that Kashyyyk did not support the Confederation either, and deferred to Master Skywalker. Skywalker claimed that the Jedi's fight was against Jacen alone, and it was Han Solo who presented the idea of neutrality between the Confederation and the combined Wookiee, Hapan and Jedi forces. Therefore while the two different factions did not join forces against the Galactic Alliance, they departed the meeting with an agreement not to interfere in each other's affairs."}, {"tag": "p", "text": "The Jedi Order under Master Skywalker relocated clandestinely to the old Imperial outpost on the forest moon of Endor, and there Jedi Master Kyp Durron planned a mission to plant a tracking device on Jacen's person in order to monitor the fallen Jedi's movements. In his ongoing quest to discover the location of the new Jedi base, Darth Caedus made no true progress, and was instead distracted by the need to regain the Hapan Consortium's fleets, which had until Kashyyyk comprised a fifth of the Galactic Alliance's military. He was able to deliver an ultimatum to Tenel Ka several days after the Battle of Kashyyyk, once he had kidnapped their daughter, the Chume'da Allana, although he was only able to ensure Hapan neutrality rather than the return of the fleets to the Galactic Alliance's war machine."}, {"tag": "p", "text": "Han Solo and his wife Leia Organa Solo remained on Kashyyyk following the withdrawal of the Anakin Solo to help fight the large wildfires that their son had ignited on Kashyyyk. Using the Millennium Falcon, the Solos placed a number of beacons that allowed a Confederation cruiser to ignite specific sections of forest, with the intent of creating wide dead zones so that when the wildfires reached the burned areas they would not be able to travel any further and would instead burn themselves out. They were joined in this effort by Lando Calrissian, who arrived to assist the Wookiees in putting out the wildfires."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Kashyyyk spans the final third of Troy Denning's Legacy of the Force: Inferno. The consequences of the battle were dealt with in the next installment in the Legacy of the Force series, Legacy of the Force: Fury."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}