{"url": "Thakwaash", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Equine sentient species", "Category:Outer Rim Territories species", "Category:Thakwaashi"], "nodes": [{"tag": "h1", "text": "Thakwaash"}, {"tag": "p", "text": "Thakwaash were equinoid biped species from Thakwaa."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Each Thakwaash had many different personalities, each performing some specialized function. This was their normal mental state and was not considered a psychosis, as it would be in a Human. As they grew older and developed, they usually discovered more \"minds,\" and gradually improved upon their skill in switching between them. These personalities had various abilities and skills, behaviors, and views on life. These could include an undisciplined yet skilled pilot, a calm and polite socializer, an arrogant, elitist mind, an insane one (which only caused slight problems, since they could still switch to other \"minds\"), and others. This ability also helped them figure out how others would think, increasing their ability to imitate their target's writings or thought processes."}, {"tag": "p", "text": "They also possessed, on average, three times the strength of an average human male. For instance, Hohass Ekwesh was capable of killing a man weighing 100 kilograms by \"casually\" swinging him into a wall, one-handed. They are also usually very tall at an average height of three meters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire gave up trying to take over their homeworld due to their unpredictable natures, as well as their size and strength."}, {"tag": "p", "text": "The Thakwaash were members of the New Republic. Wraith Squadron pilot Hohass Ekwesh was a Thakwaash. Ekwesh was nicknamed \"Runt\" because he was a mere two meters tall—small for his species."}, {"tag": "h2", "text": "Common Thakwaash names"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}