{"url": "Battle_of_Kashyyyk_(Second_Imperium_Crisis)", "categories": ["Category:Legends articles", "Category:Battles of Kashyyyk", "Category:Battles of the Second Imperium crisis"], "nodes": [{"tag": "h1", "text": "Battle of Kashyyyk  (Second Imperium Crisis)"}, {"tag": "p", "text": "The Battle of Kashyyyk of the Second Imperium Crisis was a raid by the forces of the Second Imperium on Thikkiiana City on Kashyyyk in 23 ABY. Due to Kashyyyk's strategic importance as a major exporter of computer technology in the New Republic, the planet was targeted by the Second Imperium in order to obtain its valuable computer units for their war effort. Having won his place as the Shadow Academy's \"Darkest Knight\"—commander of the Imperium's Dark Jedi, Zekk was assigned command of this task force dispatched to Kashyyyk to capture the computer systems. However, his former friends and now Jedi trainees the Solo twins —Jacen and Jaina Solo— and their fellow companions Tenel Ka Djo and the Wookiee Lowbacca were also going to Thikkiiana city for a brief trip. Also, Lowbacca's sister Sirrakuk was undergoing a dangerous rite-of-passage ritual and needed the supported of her older brother Lowie."}, {"tag": "p", "text": "An Imperium commando force used holographic image disguisers—which allowed them to take on the shapes of Wookiees—when infiltrating the Thikkiiana computer fabrication facility's control tower. There, they disabled Kashyyyk's orbital defense systems and triggered the automatic lock-out systems. Meanwhile, the main Imperial force landed at the plant on an Imperial Assault Shuttle and quickly overwhelmed the Wookiee workers before making off with the computer units. In the skies above Thikkiiana, Imperial starfighters distracted the Wookiee defense forces through diversionary attacks on the surrounding suburbs."}, {"tag": "p", "text": "In an act of petty vengeance, Garowyn attempted to \"recover\" her stolen personal starship \"Shadow Chaser\" from Jaina and her Wookiee friend Chewbacca but was killed instead. Having received a distress signal from the fabrication plant, Jacen, Tenel Ka, Lowie and Sirrakuk arrived only to encounter Zekk, Vonnda Ra and a contingent of stormtroopers. The Jedi trainees fled down an escape hatch into the dangerous Shadowlands in the lower depths of Kashyyyk's world-spanning tropical jungles; hotly pursued by the Dark Jedi and Imperials. During this pursuit, the outnumbered Jedi used mixture of their Force abilities and the dangerous ecosystem to eliminate most of their pursuers. Most of the stormtroopers were eliminated by a giant slug whereas Vonnda Ra met her demise at the maw of a carnivorous syren plant."}, {"tag": "p", "text": "Meanwhile, Jaina encountered her former friend Zekk while searching for her friends in the Shadowlands. Despite his indoctrination, Zekk was unable to kill one of his former friends but instead warned her of the Second Imperium's impending attack on the Jedi Academy on Yavin 4; telling her to stay away from it. He then quickly departed to rendezvous with a fast transport. Knowing of the impending threat to the Academy, the Jedi quickly headed back to Yavin 4 while the Second Imperium made its way under the orders of the \"Emperor Palpatine\"."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "Following their successes in obtaining recruits and matériel during a raid on the New Republic's capital of Coruscant, the Second Imperium through the Shadow Academy had assembled a force of determined yet inexperienced young people over a period of several months. Depending on their abilities, these new recruits were trained as either Dark Jedi, stormtroopers or TIE pilots. In preparation for their campaign against the Republic, the Imperium planned to launch a raid on Thikkiiana City on the Wookiee homeworld of Kashyyyk. The city was important to the Republic as a manufacturer of sophisticated guidance and tactical computer systems for the New Republic Defense Fleet."}, {"tag": "p", "text": "As part of the Imperium's plans of reinstating the Galactic Empire, a small force would be sent to Kashyyyk to the assault the targeted computer fabrications plant and to make off with its valuable cache of guidance and tactical computers. This accompanied with Kuati-built hyperdrive cores seized during the Coruscant raid would allow the Imperium to complete construction on its fleet of hastily-assembled Star Destroyers. The captured computers would be used to transmit signals that would mimic the New Republic's secret starship ID patterns and thus allow the Imperium's starships to travel through Republic space disguised as Republic starships."}, {"tag": "p", "text": "Placed in command of the team was Zekk whose victory during a duel with rival student Vilas had earned him the rank of Darkest Knight—the leader of the Imperium's troops who answered to none but the Academy's commander Lord Brakiss. Apart from of his role as commander of the task force, Zekk along with the Nightsisters Tamith Kai, Garowyn and Vonnda Ra would infiltrate the control tower of the fabrication plant to sabotage the defense systems. For their role, these four were equipped with holographic image disguisers which would allow them to assume the shapes and forms of the planet's Wookiees."}, {"tag": "p", "text": "Per the request of Tamith Kai, Zekk was also tasked with assassinating the Jedi trainees Jacen and Jaina Solo in retaliation for their escape from the Academy and the theft of the state-of-the-art shuttle Shadow Chaser. Despite Zekk's abilities, Tamith Kai had always resented his presence since she felt that he had not given himself entirely to the dark side. Nightsister Garowyn also agreed to assist Tamith in the mission provided she was allowed to retrieve the prized Shadow Chaser which had been hijacked earlier by Jedi Master Luke Skywalker and Tenel Ka."}, {"tag": "p", "text": "Originally, the raid had been planned to take place a few weeks later. However, by monitoring communications between the Jedi Praxeum on Yavin 4 and the capital Coruscant, the Imperium had found out that the Solo twins and the mixed Hapan-Dathomiri princess Tenel Ka Djo were accompanying fellow trainee Lowbacca back to Kashyyyk. The Wookiee Lowbacca's younger sister Sirrakuk was going to undergo a dangerous Wookiee ritual and thus needed the support of a older sibling. During their trip, the Jedi trainees visited Thikkiiana City and its computer fabrication plant."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "The task force departed to Kashyyyk on a single assault shuttle which was capable of carrying a substantial complement of ground troops and starfighters. While the main force waited in the depths of space near the orbit of Kashyyyk, a four-member commando team were dispatched to infiltrate the Thikkiiana City's fabrication facility. The team consisted of dark siders Zekk, Tamith Kai, Vonnda Ra and an unidentified stormtrooper. With their holographic disguisers, they appeared to everyone else as ordinary Wookiees."}, {"tag": "p", "text": "Disguised as the morning shift team for the control tower, the four passed by all security at the facility without raising suspicion. The control tower of the plant controlled the facility's control points, lockout systems and Kashyyyk's orbital defense system. Once the Imperium had control of these systems, they would be able to prevent the Wookiee defenders from coordinating and thus obtain their computer units. To ensure no threat to their plans, the infiltrators had stunned the real security personnel in a small supply chamber at the outer storage platform."}, {"tag": "p", "text": "Upon entering, the disguised Zekk quickly destroyed the facility's alarm and intruder detection systems with a blaster while Vonnda disabled the strategically-important orbital defense systems by destroying the control panel. No longer needing to move around disguised as Wookiees, the commandos de-activated their longer disguises. Wanting to test his allegiances, Tamith Kai then ordered Zekk to trick the Solo twins and their companions into coming to the factory by sending a distress message through the communications console."}, {"tag": "p", "text": "At Lowbacc's residence, Jacen, Lowie, Sirra and Tenel Ka were playing a simulated miniature reenactment of the historic Battle of Yavin which resulted in the destruction of the first Death Star. It was then that the comm system received Zekk's message. Concerned and suspicious, the Jedi trainees decided to investigate for themselves. Meanwhile, Jaina and Chewbacca were making repairs to the Shadow Chaser at an outlying hangar bay constructed on top of a crown of giant wroshyr tree. The hangar bay was located far beyond Thikkiiana City's residential suburbs and the computer fabrication facility. During the journey, the Chaser's navigation systems had been disable in a meteor storm."}, {"tag": "h3", "text": "The raid"}, {"tag": "p", "text": "In the space above Kashyyyk, the Imperial assault shuttle arrived and deployed its contingent of heavily-armed TIE/In starfighterS. While the orbital defense satellites were still operational and were able to record data on the events unfolding, they were unable to open fire on the intruders since they had received no instructions from the control tower. However, the satellites still recorded data on those events for future references."}, {"tag": "p", "text": "By now, the Imperial commando team was besieged in the traffic control tower by several Wookiee engineers. However, the strong automated defenses of the tower ensured that the Wookiee's were unable to breach their own building. Displaying a mixture of sadism and humanocentrism, the Nightsisters trapped the Wookiee engineers by de-activating the locking mechanism to the building. Once inside, the Wookiees were electrocuted by the automated security systems and then mowed down by the gleeful stormtroopers. Zekk could only watch in horror."}, {"tag": "p", "text": "Descending into Kashyyyk's atmosphere, the Imperial starships headed for Thikkiiana's computer fabrication facility. To divert the attention of the Wookiee defenders manning the perimeter guns, the TIE fighters and bombers attacked the outlying residential districts. This diversion allowed the assault shuttle to land at the fabrication facility with a ground assault force of stormtroopers. Taken by surprise, the Wookiee staff were quickly overwhelmed while the prized computer units were captured."}, {"tag": "p", "text": "Meanwhile, Garowyn attempted to reclaim her stolen starship the Shadow Chaser under the cover of the main air attack. Unfortunately for the Nightsister, any chance of escaping was foiled by Chewbacca who removed the primary initiator module from the still-open engine hatch. When confronted by Jaina, Garowyn expressed surprise and disappointment that Jaina was not with her companions at the factory. In the ensuing duel, the Nightsister used her Force powers to hurl objects at Jaina and Chewbacca. Seeking to distract Garowyn, Jaina taunted her foe about the damaged Shadow Chaser while the Wookiee Chewbacca used his massive strength to hurl objects at her; causing her to trip on a pool of lubricant."}, {"tag": "p", "text": "Defeated, the dark-sider attempted to flee on a commandeered speeder bike. Chewie then leapt onto the vehicle; causing it to fall and crash into the jungle underneath. However, both survived by clinging on to branches Enraged, Garowyn attempted to kill Chewbacca with Force lightning but was distracted by Jaina who used the Force to stir the leaves behind her. Garowyn turned to confront the enemy behind her but lost her balance on the narrow branches and descended to her death in the dark and dangerous Shadowlands beneath."}, {"tag": "p", "text": "Upon arriving at the fabrication facility, Jacen and his companions were met by an oblivious tour droid whose programming led him to conclude that the air battle above was merely a simulated drill. Noticing the presence of powerful anti-aircraft perimeter guns and the disorderly reaction of the Wookiee defenders, the Jedi Padawans quickly help the outnumbered Wookiee gunners to mann the perimeter guns. Using his experience manning his father Han Solo's infamous Millennium Falcon's laser cannons, Jacen managed to shoot down two TIE fighters and a fully-loaded TIE bomber."}, {"tag": "h3", "text": "The Pursuit"}, {"tag": "p", "text": "As Jacen and his companions entered the debris-littered and wrecked fabrication facility, they encountered their former-friend-turned-enemy Lord Zekk and a vengeful Vonnda Ra— who had a grudge against the young Padawans ever since they escaped from the Shadow Academy. When Vonnda attempted to unleash Force lightning on the Jedi Padawans, Zekk—remembering his former friends—rebuffed her; asserting his position as the mission's commanding officer. This gave enough time for the Jedi to escape the dark-siders and their contingent of stormtroopers into the dark Shadowlands underneath."}, {"tag": "p", "text": "With Garowyn out of the way, Jaina and Chewbacca retrieved the damaged speeder bike and commuted to the Thikkiiana fabrication facility to investigate the recent events and to check on her brother Jacen and his companions. The journey to the city from their outlying location on the speeder bike was an uncomfortable and bumpy one. By the time they arrived at their destination, much of the fabrication plant had been burnt and wrecked by the Imperium raid. Most of the surviving Imperial fighters had returned to space."}, {"tag": "p", "text": "At the factory, Wookiee rescue teams were extinguishing fires and attending to injured or trapped workers. There, Jaina and Chewbacca learnt from Chewie's sister Kallabow that the Second Imperium had launched a lightning raid on the fabrication facility—causing significant damage to the compound and stealing computer equipment. Unfortunately, Kallabow had no information on the whereabouts of Jacen and the other Jedi trainees."}, {"tag": "p", "text": "While attending to the wounded Wookiees, the pair came across a wounded engineer who had witnessed two young Humans and two Wookiees being pursued by a party of stormtroopers and humans in dark capes down a corridor. According to the engineer, the corridor was connected to several maintenance trapdoors which led to the dark and dangerous forests of the Shadowlands. Having finished binding the engineer's wounds, Jaina and Chewie went to the corridor she had indicated and discovered that the trap doors had been ripped opened by the Imperial party. They then went to search for their companions."}, {"tag": "p", "text": "The four companions fled down a corridor into a trapdoor leading to the dark and dangerous jungles of the Shadowlands. Pursued by the Imperial party, they fled deeper and deeper into the thick and dense jungle; winding their away around the branches and trunks of the wroshyr trees while putting up with Em Teedee's irritating concerns. Descending into the deepest levels of the jungle, the young Jedi were attacked by a carnivorous syren plant which used its giant vines to grab them. Though they managed to escape by slicing through the thick vines with their lightsabers, their activity attracted the actions of their Imperial pursuers. Soon, the Jedi were completely surrounded by a squad of stormtroopers who were joined by the Dark Jedi Lord Zekk and the Nightsister Vonnda Ra who ordered their immediate execution."}, {"tag": "h3", "text": "Turning the Tables"}, {"tag": "p", "text": "However, unbeknownst to the stormtroopers, they were near a large and dangerous giant slug-like creature.When one of the troopers stepped on its surface area, the monster instantly reacted and attacked them. The slug creature appeared impervious to the stormtroopers' blaster bolts which only aggravated it further. Jacen then used his Force-abilities to convince the monster that he and his companions were the creature's friends while the Imperial troops were its foes. With their pursuers preoccupied by a greater threat, the four Jedi companions fled into the thick jungle. In the end, the slug creature was finally killed though most of the troopers were also killed and the Dark-siders weakened."}, {"tag": "p", "text": "Meanwhile, Jaina and Chewie made their way across the trail left behind by the two parties; traversing across the dense network of wroshyr branches and leaves. However, Chewbacca stepped on a rotting branch which cracked under the Wookiee's weight; sending him toppling deeper into the lower levels of the jungle. Unfortunately, this notified the Imperials of their presence. In response, the Imperial party split up with Vonnda and the surviving four troopers continuing the pursuit while Zekk remained behind to confront Jaina."}, {"tag": "p", "text": "Continuing the pursuit, the troopers used a giant bough as a position to fire blaster bolts and even a blazing fireball at their prey. In the ensuing pursuit, Jacen and Tenel Ka had become separated from Lowie and Sirra. Ordering Jacen to duck for cover in the thick foliage, Tenel Ka then sneaked back across the dense bush. Positing herself right under the stormtrooper's branch, she then used her lightsaber to slash through the ancient bough. Deprived of a standing ground, the stormtroopers toppled to their deaths in the deep forest floor beneath."}, {"tag": "p", "text": "Meanwhile, Lowbacca and Sirrakuk came back across the same syren plant they had encountered earlier. Wanting to complete her rite of passage which involved extracting syren fibers from the maw of the carnivorous plant, Sirra was about to make her way down to it. All of a sudden, the two young Wookiees were set upon by Vonnda Ra who unleashed Force lightning on Lowbacca. Seeking to save her brother, she threw herself on the Nightsister and together, they toppled into the maw of the syren plant. Upon crashing onto the maw of the syren, the plant's fleshy yellow petals contracted; trapping Sirra and Vonnda. Leaping off his high branch, Lowbacca managed to peel the leathery petals apart and reach Sirra's hand."}, {"tag": "p", "text": "Luckily for them, they were rejoined by Jacen and Tenel Ka who immediately set to work trying to rescue Sirrakuk. The syren's petals suddenly flapped opened from internal convulsions which gave enough time for the Jedi to rescue Sirra from an agonizing death. As soon as Sirra was free, the syren's petals contracted; trapping Vonnda Ra inside. Trapped inside the maw of the syren, the Nightsister met her demise and was digested by the carnivorous plant. Not only did Sirrakuk escape death but she also passed her rite of passage by obtaining a handful of the prized syren fibers which symbolized a Wookiee's courage and vitality."}, {"tag": "p", "text": "Meanwhile, Jaina found Chewbacca who had survived his fall but sustained a fractured leg. While attending to Chewie, she was confronted by her former friend Zekk who grimly informed her that the Jedi Praxeum on Yavin 4 was the Second Imperium's next target. However, despite his indoctrination, Zekk was not able to bring himself to kill her and instead warned her that the Jedi Praxeum on the jungle moon of Yavin 4 was the next target of the Imperium. He then quickly departed to rendezvous with a fast Imperial ship that he had signaled via his comlink. Luckily for Jaina and Chewie, they were quickly found and rescued by Jacen and the other Jedi Padawans. The two Wookiees Lowie and Sirra helped their wounded uncle stagger through the jungle while Jaina led the way back with her lightsaber."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Having acquired their targets, the Imperial strike force departed on their assault shuttle for the safety of the Shadow Academy. Despite Zekk's tactical victory, Tamith Kai still remained cold and hostile towards him which was exacerbated by the loss of her two Nightsister allies Vonnda Ra and Garowyn along with an entire complement of 11 stormtroopers. The captured tactical and guidance computer units were unloaded and installed on the Second Imperium's hastilly-assembled fleet of Star Destroyers and starfighters. Upon meeting his master Lord Brakiss, Zekk informed him of the losses expecially the death of the two Nightsisters."}, {"tag": "p", "text": "During the fighting, the strike force had lost 14 starfighters and 11 ground assault troops. However, Brakiss merely brushed them away as acceptable casualties since the mission had succeeded in achieving its goals. Zekk also assured Brakiss that he had eliminated the Solo twins and their companions. While Brakiss believed him, Tamith Kai was still skeptical. As soon as they had just arrived, the station received a holographic transmission from \"Emperor Palpatine\" who ordered the Shadow Academy to immediately depart from the Deep Core to the Outer Rim moon of Yavin 4 for an assault on Luke Skywalker's Jedi Praxeum."}, {"tag": "p", "text": "Despite the final death of his last clone during the Battle of Onderon in 11 ABY, Palpatine had mysteriously reappeared. In reality, the \"Emperor\" was a false holographic projection created by four Imperial Royal Guards as a means of coordinating the Second Imperium's resistance against the New Republic. The Second Imperium was an insurgent movement of Imperials who rejected the \"sham\" Bastion Accords which ended the conflict between the New Republic and Imperial Remnant."}, {"tag": "p", "text": "Meanwhile on Kashyyyk, the New Republic dispatched engineers and soldiers to help in the reparation and relief efforts at Thikkiiana city. Much of the computer fabrication plant had been devastated while large areas of the city had been damaged during the bombing raids. Having recovered from his broken leg, Chewbacca helped Jaina and his cousin Lowie make the final repairs to the Shadow Chaser for their return journey to Yavin 4."}, {"tag": "p", "text": "Jacen had also sent an alert to the Jedi Praxeum and the New Republic navy had made preparations to send reinforcements to the remote moon. Master Skywalker and the Solo's father Han Solo had also returned from a scouting mission. With the repairs completed, the Jedi trainees and Chewbacca left Kashyyyk on their transport Shadow Chaser and fled to the Jedi Praxeum to prepare for the impending attack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}