{"url": "Thana_Vesh", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Females", "Category:Humans", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Thana Vesh"}, {"tag": "p", "text": "Thana Vesh was a female Human who became one of the apprentices to Darth Gravus during the Cold War between the Galactic Republic and the resurgent Sith Empire."}, {"tag": "p", "text": "While on the planet Taris, Thana encountered a unique Imperial who rivaled her. Eventually, the Imperial earned the respect of Darth Gravus, the latter considering the Imperial more special than her after she picked up and tortured a Republic guard who only provided second-hand information. Not only was Thana infuriated, but she \"broke off her leash\" from Gravus. She nonetheless continued her duties in Taris. Later, Thana was captured by the Jedi and detained in a cell of the main Republic HQ; when the Imperial guided the Sith troops in the attack of the complex, they met Thana and decided her fate."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Born into wealth on Dromund Kaas, Thana was very spirited and destructive until her parents discovered she was Force-sensitive at an early age, but they tried to suppress her. She became angry and burned the entire city block. After realizing that she was the only one that had survived, the Sith took her to Korriban and trained her. Thana tore through the trials and the acolytes of the Sith Academy and later earned the attention of Darth Gravus."}, {"tag": "h3", "text": "Taris"}, {"tag": "p", "text": "After Gravus made her into his apprentice, they journeyed to Taris, where Thana would finally sink her teeth into the Republic forces. Her destructive potential proved to be useful, but her disorder often made a coordinated approach difficult. She also saw a direct rival in every other fighter who supported her master, whom she tried to overpower. When her master, with the help of some Imperial specialists, began to organize a targeted attack on Commander Kom Orda, he often had to slow Thana down, as she undertook unauthorized, but not very purposeful solo actions. She then captured an unofficial officer who worked for Orda's garrison, but her master, besides the information that Orda's base was protected by hidden campaigners, could not find anything important. While Gravus was aiming at a carefully planned, step-by-step attack, and initially wanted to destroy the runners, Thana pleaded for a direct attack, so her master then sent her to her room to prepare herself for the final attack, and did not disturb the action before. Thana opposed the order, and with some imperial soldiers entering Orda's base, her master would still destroy the runners. Disillusioned with the behavior of his student, Gravus ordered the attack on Orda's plant after the destruction of the runners and asked the Imperial troops to look for Thana. When the troops arrived in Orda's base, Thana was already involved in a battle with Orda and his bodyguard. When the others entered the room, Thana had been carelessness when Orda threw a stunning grenade, and then devoted himself to the newly arrived imperials. Shortly after, Thana regained consciousness, executed Orda, and expressed the hope that she would now rid of her rivals."}, {"tag": "p", "text": "This hope did not come true, however, for she met the fighters with Melkor Dinn, and reported how she was nearly killed by a Rakghoul, but in truth they were Nekghouls that were connected to the Force and trained by Jedi Master Sulan, thanks to the intel that was given by Mola Haxtor, whom Dinn had recently captured. Both Thana and the other fighters set off for the abandoned power station, where Sulan had been teaching dozens of Forceful Nekghouls to learn the ways of the light side and use that power to confront their dark side enemies that were a threat to the entire galaxy. As before, Thana goes on alone, again with the aim of surpassing her competitors. In the power plant, she revealed the position of her competitors to the Republic security forces, but these soldiers defended the following attack and followed Thana into the abandoned reactor. There, they reached Master Sulan just at the moment, Thana sought to attack him and his disciples, and together, they attacked the Nautolan. After Sulan's death, Thana left the reactor to fight another republic, and warned her opponents not to follow her."}, {"tag": "p", "text": "Despite been separated by her rivals, she encountered them once again with General Farvin, who sent them on an attack against the Cathar Bashun, another handler of the Republic on Taris. First, both should destroy the weapons provided by the Republic for the Cathar and decimate the simple soldiers. Thana designed killing the Cathar to a contest between her and the other fighters she lost. After that, they were to attack Bashun, who was entrenched in a Republic base. Again, Thana pulled away on her own, very much to Farvin's displeasure, who feared that she would endanger the mission with her self-interest. In fact, her concerns were not completely unfounded, for Thana was captured by Bashun. After their rivals defeated Bashun, Thana was freed."}, {"tag": "p", "text": "Shortly thereafter when Gravus ordered the last attack on the Republic main base of Olaris, Thana did not want to miss this battle. Like their rivals, the first step was to deflect the defense units of the base so that the advance to the central space port became possible. Afterwards, they were sent together to the space port to kill the Jedi Cerik, destroy the space port, and thus finally undo the efforts of the Republic. Thana reluctantly worked with her rivals, and began on the lower level with her attack, where she tried to overburden the energy grid, while her associates were to turn off the defenses of space. Before they could meet again, Thana fell into the hands of some Jedi guards. However, their comrades could free them. Also the planned overload of the energy grid failed, since the system had an emergency protection. So, with her former rivals, she set out to kill Cerik herself to get to the override code. Together they fought through the Republican troops and ultimately came to Cerik. Nor could his reinforcements from Cathar and other inhabitants of Taris stop them. Eventually, Cerik fell in the fight and Thana took the code to override the emergency safety system and overload the energy grid of the space harbor. In the process, she discovered that the transporters who had brought Cerik's reinforcements to flee with the civilians."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Thana used a single-bladed Sith lightsaber. She was strong in the force, as was evident by her combat prowess."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thana Vesh is voiced by Laura Bailey, who also voiced Kira Carsen on Star Wars: The Old Republic."}, {"tag": "p", "text": "During the main quest Taris, the Imperial player will encounter her in every turn. If the player is male, they have the option to flirt with her, but she will reject the player's advances. In the final quest, \"No Escape\", when Thana learns about the civilians attempting to escape, the player can decide to either keep them trapped and let them die in the station's destruction for dark alignment points or let them go for light alignment points. Afterwards, the player can fight and kill Thana for dark alignment points or let her go for light alignment points. If they do decide to let her go, she will later send a message to the player boasting about her victories in other areas, along with several credits. Her unique outfit is available on the Cartel Market as \"Thana Vesh's Outfit.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}