{"url": "Battle_of_Kashyyyk_(Separatist_Crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kashyyyk", "Category:Battles of the Separatist Crisis", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Battle of Kashyyyk  (Separatist Crisis)"}, {"tag": "p", "text": "The battle took place sometime during the Separatist Crisis, when a variety of planets and corporations began to withdraw from the Republic. The battle occurred when the Wookiee Trade Guild, which controlled a large amount of commerce in the Kashyyyk system, attempted to resist a new taxation imposed by the Trade Federation. As a result, the Sith Lord Darth Sidious, an ally of the Federation, ordered a legion of the Federation's droid army, including the newly unveiled B2 super battle droids, to destroy the Wookiee Trade Guild. The battle droid army, led by Sidious's apprentice, Count Dooku, attacked the Trade Guild's island headquarters in the Wawaatt Archipelago on Kashyyyk. The Trade Guild's private army tried to defend the island, but the entire village was eventually destroyed by the Federation's forces."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Sometime during the Separatist Crisis where several planets and corporations began seceding from the Republic, the Trade Federation—one of the corporations about to leave the Republic—attempted to impose several new excises on the Wookiee Trade Guild. The Trade Guild, which controlled a large amount of commerce in the Kashyyyk system, tried to oppose these new taxes, much to the displeasure of the Trade Federation."}, {"tag": "p", "text": "As a result, Darth Sidious, a Sith Lord and ally of the Federation, ordered a two-hundred strong legion of the Federation's battle droid army to be dispatched to the Trade Guild's headquarters on the Wookiee homeworld of Kashyyyk. Under the command of Sidious's new apprentice, Count Dooku, the droid legion consisted of assault battle droids, battle droid assassins, pilot droids, droidekas, and the new B2 super battle droids. The legion was tasked with completely destroying the Guild's small island base in Kashyyyk's Wawaatt Archipelago."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "When the Federation legion landed on the island, they immediately began to assault the Guild's headquarters, with Dooku leading the assault. Two-hundred members of the Guild's private army of Wookiees, armed with bowcasters and missile launchers, tried to defend the village from the assault. However, the Federation forces flanked the village from the hills on the northeast and northwest sides of the island, as well as from a small landing site on the south side. The droid army also utilized at least two Vulture-class droid starfighters to strafe the village, and eventually the Guild's army was overwhelmed and the entire village was destroyed by Dooku and his forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Federation left very few Guild members to survive the battle, effectively destroying the Wookiee Trade Guild. Years after the battle, the Federation and several other allies formed the Confederacy of Independent Systems, led by Count Dooku, which officially seceded from the Republic, resulting in the Clone Wars between the two factions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle made its first and only appearance in the video game Star Wars: Battlefront, where it made up the third level in the games historical Clone Wars campaign, despite the fact that the battle does not take place during the Clone Wars. In the level, the player fights in the Federation army and helps destroy the Wookiee Trade Guild."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}