{"url": "Thalleus_Tharn", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bith", "Category:Males", "Category:Medical professionals"], "nodes": [{"tag": "h1", "text": "Thalleus Tharn"}, {"tag": "p", "text": "Doctor Thalleus Tharn was a highly-decorated Bith scholar, brain surgeon, and xenopsychiatrist, who served as the chairman of xenopsychiatric medicine at the Greater Coruscant University. In 44 ABY, during the government-sanctioned siege of the Jedi Temple, Doctor Tharn's professional opinion was consulted by Galactic Alliance Chief of State Natasi Daala for the determination of the mental status of two Jedi Knights, Sothais Saar and Turi Altamik, both of whom had recently suffered from and been cured of a Force-induced psychosis. Through a preliminary field examination, Doctor Tharn attested to the restored cognitive stability of both Saar and Altamik, which ultimately prompted Chief Daala to lift the Temple siege."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi plight"}, {"tag": "p", "text": "Thalleus Tharn was a male Bith who lived in the years that followed the end of the Second Galactic Civil War. The Bith were a species renowned for their intellect and academic achievements, a position which he accepted."}, {"tag": "p", "text": "Doctor Tharn was called into service by Galactic Alliance Chief of State Natasi Daala in 44 ABY during the Mandalorian siege of the Jedi Temple to determine the sanity of two psychotically-afflicted Jedi Knights, Sothais Saar and Turi Altamik. He joined Chief Daala in her limousine as they proceeded to the Temple and, upon their arrival, waited in the vehicle as Daala exited to confront the Jedi entourage. The Chief of State parleyed with Captain Han Solo, the Jedi liaison, and agreed to lift the siege after, among other concessions, Saar and Altamik were taken into Galactic Alliance custody. Doctor Tharn was then summoned to join Chief Daala and Captain Solo, although he refused to accept the latter's attempted handshake. After his many decorations were lauded over by Daala, the details of his participation were confirmed, which included the sedation of both Jedi for safe transport and their thorough examination once they reached and were secured in his facility. When asked if he was aware that Daala intended for them to be frozen in carbonite, Doctor Tharn stated that such precautions were necessary to secure the criminally-insane Jedi until which time a cure was discovered for their condition."}, {"tag": "h3", "text": "Clean bill"}, {"tag": "p", "text": "As he beckoned Sothais Saar and Turi Altamik from the Temple, Doctor Tharn immediately realized to himself that both Jedi had recovered from their illness. Still, he intended to prove his assumption through the examination as requested by the Chief of State. Daala felt that it would be more prudent to apprehend them discreetly instead of allowing them to proceed otherwise unrestrained, to which the Bith doctor agreed and ordered for both Jedi to be taken into custody by his orderlies. He was denied by Captain Solo, however, who had been under the impression the exchange was to occur in full view of the public. As the Jedi approached, Chief Daala accused them of being impostors who might have had their appearances altered by plastic surgery. Captain Solo countered that Doctor Tharn, who was also a surgeon by profession, could examine Saar and Altamik to determine whether or not their features had been altered. Chief Daala was hesitant to accept Solo's claim that the Jedi had been cured of their affliction, and stated that she would only abide Doctor Tharn's assessment. When Solo suggested to the Bith doctor that other members of the medical community would view and critique his methods, Tharn requested to have the patients transported to his hospital for proper evaluation. However, when Solo implied that the detachment of Mandalorians assigned as guards were incapable of protecting the doctor if the Jedi suddenly became hostile, Tharn opted instead for a preliminary field assessment, one that would be conducted in full view of the HoloNet audience. He then ascended the steps of the Jedi Temple and approached Saar and Altamik, both of whom yielded in the presence of armed Mandalorians and Galactic Alliance Security officers."}, {"tag": "p", "text": "Doctor Tharn questioned Saar's raised-hands gesture of capitulation and agreed with the reasonableness of the Jedi's claim that he did not want to provoke the Mandalorians into the discharge of any haphazard blaster fire. The doctor spoke next with Turi Altamik, who admitted that while she and Jedi Saar had previously suffered from a violent bout of psychosis, they had both since recovered. Saar related his hesitation to trust Tharn, but the doctor guaranteed that whatever methods he used to determine the Jedi's sanity were completely for their benefit. He further asserted that unless a direct order was given by the Chief of State, no weapons would be fired at them. As both Jedi lowered their hands, Tharn again demanded that they trust him. When they agreed, the Bith suddenly kneed Sothais Saar in the groin, and Altamik raised Doctor Tharn in the air with the Force so as to prevent him from attacking Saar again. When he was returned to the ground, Tharn revealed the results of his field exam; the fact that he was still alive meant that both Jedi were indeed sane, just as Captain Solo had said. He explained to those present that he had been sure of the Jedi's sanity the moment they emerged from the Temple, but performed the preliminary assessment simply to appease the Chief of State. Daala grudgingly accepted Tharn's opinion despite his methods and lifted the siege, but vowed to have him confirm with the Mon Calamari Jedi healer Cilghal the successful recovery of all of the criminally-insane Jedi to her satisfaction."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Doctor Tharn was a tall, middle-aged, green-skinned Bith, distinguished in manner and refined in speech. His huge cranium was nearly emerald in color, while his eyes were jet-black. When flustered, Tharn's epidermal cheek folds receded and paled to chartreuse. Doctor Tharn's voice was deep and polished, one that reminded Han Solo of those of actors from various men's advertisements. Tharn refrained from and refused to greet other beings by shaking hands, and looked scornfully upon the gesture when it was extended toward him."}, {"tag": "p", "text": "The Bith doctor was well known and respected for his many academic achievements, with a reputation that far preceded him. By 44 ABY, more honors had been accorded Tharn than one could enumerate. His vast medical expertise resulted in an invitation to preside over the Greater Coruscant University's department of xenopsychiatry. Han Solo initially dubbed him \"brain-breaker,\" but openly conveyed the respect afforded a being of Tharn's reputation after being impressed by his preeminence as heralded by Daala. \"The expert,\" as he was occasionally referred to, likened brain surgery to an art form and dismissed Captain Solo's suggestion that the use of droids—whom Tharn believed were incapable of producing art—would reduce a measure of the risk associated with such practices."}, {"tag": "p", "text": "Tharn recognized the threat posed by criminally-insane Jedi and supported the idea of detaining them with carbon freeze as the safest and most efficient. He expressed a considerable degree of anxiety when he realized the danger they would present to both him and his facilities, and opted for an on-the-spot field test in lieu of a thorough hospital examination. Tharn understood the Jedi's apprehension with trusting him, a representative of Chief Daala, and did his best to allay their fears. However, while partially in agreement with Daala's position regarding the mentally-insane Jedi, Tharn preferred to employ his own methods with regard to handling Saar and Altamik. Nor did he hold any reservations about acting contrary to the Chief of State's orders, much to her disapproval. He also considered public opinion and made a show of assisting Saar after he had incapacitated the Jedi Knight with a knee to the groin, something Captain Solo was certain would make Tharn a household name. When Solo suggested that Tharn's technique would be scrutinized to the letter by his professional colleagues, the doctor became anxiously concerned with the opinions of his peers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thalleus Tharn was a character created by author Troy Denning for the sixth novel in the Fate of the Jedi series, titled Fate of the Jedi: Vortex. Vortex is Tharn's first and only appearance to date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}