{"url": "Battle_of_Kathol_System", "categories": ["Category:Legends articles", "Category:Battles in the Kathol sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Kathol System"}, {"tag": "p", "text": "The Battle of Kathol, also known as the Battle of Kathol System, was the final battle between Imperial Moff Kentor Sarne's forces and the crew of the FarStar."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The battle initially looked bleak for the crew of the FarStar being outnumbered two-to-one in the battle, facing a Victory-class Star Destroyer and an Immobilizer 418 cruiser. Just when the Imperials were about to destroy the FarStar, the Bothan Combat Response Element, led by Kursk Mal'ia and the flagship Boash'ua, intervened."}, {"tag": "p", "text": "The battle swung to the New Republic's favor until Imperial reinforcements, consisting of the Star Destroyer Titania, appeared. However, the Titania was unprepared for the Bothan reaction, and suffered massive damage in an all-out assault. The guns aboard the Titania continued to fire, even as other ship systems failed, and continued to harass the Republic ships until the Star Destroyers Raptor and Bastion arrived."}, {"tag": "p", "text": "The Republic's forces were unexpectedly augmented by ships from the Qektoth Confederacy, which attempted to take the DarkStryder technology for their own."}, {"tag": "h3", "text": "Imperial defeat"}, {"tag": "p", "text": "The battle ended when the FarStar was destroyed. After the crew abandoning ship, it plummeted into the surface of Kathol and exploded, destroying the Imperial garrison and wiping out Sarne's ground forces."}, {"tag": "p", "text": "The surviving members of the FarStar's crew set out to locate Sarne and eliminate him, as well as discover the secret behind DarkStryder. After the destruction of DarkStryder and the loss of Sarne's command, the Imperial Navy forces scattered, leaving Kathol under the control of the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}