{"url": "Thanoth", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Humans", "Category:Inspectors", "Category:Males", "Category:Members of the Inspectorate"], "nodes": [{"tag": "h1", "text": "Thanoth"}, {"tag": "p", "text": "Thanoth was a male human who served the Galactic Empire as an extremely skilled inspector. He was assigned to the Sith Lord Darth Vader as an adjutant in order to help investigate a large sum of credits confiscated from the Son-tuul Pride being stolen from an Arquitens-class light cruiser."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Inspector"}, {"tag": "p", "text": "The male human Thanoth held the rank of inspector and worked for the Galactic Empire's Inspectorate during the Galactic Civil War against the Alliance to Restore the Republic. Shortly after the Battle of Yavin, he was assigned by Grand General Cassio Tagge to replace Oon-ai as an adjutant for the Sith Lord Darth Vader while Vader investigated the theft of a large sum of credits from an Imperial Arquitens-class light cruiser. When first introduced to Vader on Tagge's Super Star Destroyer Annihilator, the Inspector noted dust on Vader's armor which placed him on the moon Anthan 13 within the last 24 hours, an orbital body located in the same star system that the theft had taken place, leading the inspector to correctly assume that Vader had been behind the incident."}, {"tag": "p", "text": "ISB agent Andressa Divo compiled a report on Dr. Aphra at Thanoth's request; she attached a personal assessment to the file; Divo concluded that the disgraced doctor would be of any use to Lord Vader."}, {"tag": "h3", "text": "Working with Vader"}, {"tag": "p", "text": "Eventually, Thanoth, a dedicated patriot of the Empire, uncovered Vader's true identity as Anakin Skywalker, and figured out Vader's plan to replace Emperor Palpatine. The inspector met and told Vader where he could find the wayward Doctor Aphra on Cosmatanic Steppes. Thanoth was subsequently killed instantly by the Sith Lord's lightsaber to keep his secret, although Thanoth believed it was for the best of the Empire that Vader succeeded. Thanoth considered the destruction of the Death Star to be a sign of the Emperor's growing weakness, and believed the Empire would be better off if Vader overthrew Palpatine with the aid of his son, Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}