{"url": "Thannor_Keth", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Cut content from Light and Shadow", "Category:Individuals of unspecified species", "Category:Lightsaber combat instructors", "Category:Males", "Category:Sith Masters", "Category:Sith sorcerers"], "nodes": [{"tag": "h1", "text": "Thannor Keth"}, {"tag": "p", "text": "Thannor Keth was a male Sith sorcerer who lived during the days prior to the end of the Great Sith War. He had two apprentices—twin siblings Xash and Sindra, whom he trained to use the dark side of the Force. Keth and his two pupils journeyed to the planet Vigil in search of a Force-sensitive girl of immense potential named Nova, crash-landing on the planet. He sent Xash and Sindra to retrieve the girl but both failed to do so and died in the process; it happened that Nova unwittingly came to him, and Keth immediately took her prisoner."}, {"tag": "p", "text": "As Thannor Keth tried to repair his damaged vessel, the girl's caretaker, Lian Dray—a fallen Jedi seeking redemption—appeared and confronted Keth over her capture. The diversion Dray created to effect the girl's rescue infuriated Keth, and the sorcerer pursued them through Vigil's forest where he attacked Dray with repeated torrents of Force lightning. The Jedi blocked the initial attack but was ultimately no match for Keth's dark side skill, and the Sith sorcerer quickly brought Dray down and attempted to sever his connection to the Force. Keth was killed, however, when Dray received assistance from Nova, who joined the Jedi in the creation of a Force shield that ripped Keth asunder, leaving behind only the smoldering tatters of his Sith robes."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The hunt for Nova"}, {"tag": "p", "text": "Thannor Keth was an aged male sorcerer of the Sith who lived during the days when the Galactic Republic and Jedi Order were embroiled in the Great Sith War. He was the Master of twin Force-sensitives, a male named Xash and his nearly-identical sister Sindra, both of whom he trained in lightsaber combat as well as mastery over the dark side of the Force."}, {"tag": "p", "text": "Keth and both of his apprentices were in pursuit of a young girl of incredible Force potential named Nova who, along with her parents, was on a starship that crash-landed on the world of Vigil. During the pursuit, Keth's ship crashed as well and suffered nominal damage. While he attempted to repair the craft, Keth sent his two apprentices to survey the wreckage of the ship and retrieve Nova—whom Keth believed to still be alive. His apprentices found the girl under the protection of a former Jedi named Lian Dray who resided on Vigil; they engaged him in combat, and he slew them both. Dray himself tapped into the dark side of the Force to defeat his opponents and, in doing so, frightened Nova so much that she fled the scene, only to run straight into Thannor Keth. The sorcerer immediately captured the girl and placed her in a Sith-designed cage that blocked an individual's connection to, and usage of, the Force."}, {"tag": "h3", "text": "Keth's defeat"}, {"tag": "p", "text": "As Keth attempted unsuccessfully to repair his starship, he began to sense the presence of someone nearby. When Lian Dray stepped out of the forest demanding that Keth release Nova into his custody, the sorcerer scoffed and rebuked him. Keth learned that, while he considered Dray beneath him, it had been this same fallen Jedi standing before him who had dispatched both Xash and Sindra. He then made Dray a proposition; if the Jedi repaired Keth's damaged ship, Keth would allow him to live. Dray refused, and manipulated the Force to damage the ship further. While Keth attempted to minimize the destruction, the Jedi freed Nova and escaped with her into the forest."}, {"tag": "p", "text": "Keth gave chase and managed to halt his quarry's flight by blasting him with Force lightning. As he closed the distance between them, Keth professed the superiority of the dark side's power over his foe; when Dray stated that he was already familiar with it, Keth offered a final time to grant the Jedi amnesty in exchange for Nova. The hollowness of Keth's overture was realized by Dray who again declined, causing the Sith sorcerer to chide him as a wretched Jedi attempting to salvage what remained of his dignity. Weary of parleying with Dray, Keth flung lightning at him again, which was absorbed by the Jedi's lightsaber and redirected in a stroke that felled a massive arcosia tree nearby. The Jedi mocked Keth's inability to defeat him thus far, and Keth responded by hurling an orb of nacreous energy at him, which Dray attempted to again block with his lightsaber—unsuccessfully. Keth's attack blasted its target and caused him to drop in agony."}, {"tag": "p", "text": "The Sith then moved in to kill Dray by conjuring a lattice of dark side energy which, as it constricted around its victim, slowly and painfully severed his connection to the Force. It was in his moment of triumph that Thannor Keth was overcome, however; Nova, who remained prostrate nearby while he assailed Lian Dray, conquered her fear and used her considerable Force strength to revitalize Dray's own dissipating connection. Together they created a powerful Force shield that incinerated Thannor Keth's flesh, leaving only his shredded Sith robes behind."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Thannor Keth was a man whose extremely thin, almost emaciated figure was obvious even through the folds of his billowing purple robes. His head was bald, and dead eyes were set in a face that was marred by extensive scarring. Lavish jewelry adorned each of his fingers and produced a sound akin to the clicking of insects. The combination of these features was enough to frighten Nova, who quivered whenever Keth's gaze turned toward her."}, {"tag": "p", "text": "Keth was deceptive, and he believed that such skill would adequately lure Lian Dray into doing his bidding. Though rebuffed each time, Keth attempted on several occasions to sway Dray with false promises; first by extending a pardon for the deaths of Xash and Sindra if Dray agreed to repair Keth's damaged starship, and again by offering to leave the Jedi alone if the latter relinquished custody of Nova. He was also exceedingly over-confident in his command of the dark side, so much so that he believed himself to be unmatched by his opponent, Lian Dray. He gave into fits of rage, shouting expletives if events turned out other than he had planned. When individuals refused to comply with his demands, Keth would raise his voice and issue threats, many of which he acted upon. Keth was not above spewing insults either, referring to Lian Dray as both \"disgraced\" and a \"Jedi whelp.\""}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Sith Master, Thannor Keth was able to successfully train apprentices in the Sith arts and in armed combat by way of the lightsaber, as evidenced by the prowess displayed by both of his students, Xash and Sindra. He sensed both the untapped potential of Nova and the strength of Lian Dray as the latter approached Keth's crashed vessel. As a Sith sorcerer Keth was extremely powerful, as seen in his ability to defeat Lian Dray—who was considered by his former Jedi peers to be the most powerful among them—in single combat. Keth was a master of Force lightning, which coursed all over his body before being unleashed in bolts of purple radiance. He also possessed knowledge of several ancient and magical Sith techniques, including the debilitating bolt of infinite hatred which he used to incapacitate Lian Dray. Keth's dark side web, a power that slowly killed its victim while severing their connection to the Force, was equally dangerous; it was undone, however, by the combined strength of Nova and her protector, whose Force shield managed to obliterate both the net and its creator, Thannor Keth."}, {"tag": "p", "text": "Keth also had moderate technological skill. He was able to construct a Sith-inspired cage that operated similarly to an energy vortex and made the utilization of Force powers impossible for whoever was trapped inside. When it came to starship mechanics though, Thannor Keth was virtually inept. He tried unsuccessfully several times to repair the damage his craft suffered in its crash to Vigil's surface, only making the situation worse with each attempt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Thannor Keth was created by author Paul Danner and appeared as the primary antagonist for a short story titled Light and Shadow, which was set during the time of the Great Sith War. According to the Star Wars fansite Lostworlds, Light and Shadow was originally slated to feature in one of West End Games' Star Wars Adventure Journals but was never published therein. Thus, the characters (Thannor Keth included), places, and events of Light and Shadow are not considered part of canon."}, {"tag": "p", "text": "The story can now be found on the internet at the Star Wars Fanboy Association. Danner has had five other short stories published in various Star Wars Adventure Journals; One of a Kind, Small Favors, The Last Hand, No Disintegrations, Please, and Two for One."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}