{"url": "Thanta_Zilbra_(planet)", "categories": ["Category:Legends articles", "Category:Destroyed planets", "Category:New Republic planets", "Category:Xappyh sector planets"], "nodes": [{"tag": "h1", "text": "Thanta Zilbra  (planet)"}, {"tag": "p", "text": "Thanta Zilbra was a barren and sparsely populated planet located within the Thanta Zilbra system of the Outer Rim Territories. In 8 ABY, the planet was first discovered by the smuggler Thanta Zilbra who discovered that the planet's native Zilbra fungi possessed life-saving therapeutic properties. He established an outpost which had grown to 13,000 by 18 ABY."}, {"tag": "p", "text": "During the First Corellian Insurrection, the planet was wiped out when the Human League fired a ray from Centerpoint Station at the planet's star; causing the Thanta Zilbra star to implode thus destroying the entire star system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "On the surface, Thanta Zilbra appeared to be little more than a barren and inhospitable planet covered with rocks and sand. However, the planet had a system of underground lakes and rivers which were a home to a rare species of fungi with life-saving properties known as the Zilbra fungi. In 18 ABY, the planet was home to an outpost of 13,000 settlers including the former smuggler Thanta Zilbra and his extended family."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 8 ABY, the smuggler Thanta Zilbra was on the run from a debtor who had extensive ties to the underworld. He and his crew crashed-landed on the-then uncharted planet and discovered that the native fungus in the planet's caves had therapeutic properties. After fixing his ship, Zilbra and his crew left Thanta Zilbra and sought out a sponsor for this lucrative business venture."}, {"tag": "p", "text": "After a deal was struck with the New Republic to ship the harvested Zilbra fungus to a number of selected biomedical facilities, Zilbra established an outpost on Thanta Zilbra and managed to make a reasonable profit from the deal. Over the years, the outpost grew in size to an estimated 13,000 settlers."}, {"tag": "p", "text": "In 18 ABY, the Thanta Zilbra system was the first inhabited star system to be targeted for destruction by Thrackan Sal-Solo's Human League, using Centerpoint Station. When the New Republic learned that the system was going to be destroyed, it dispatched a task-force consisting of five warships and transports including the Naritus to evacuate Thanta Zilbra."}, {"tag": "p", "text": "The inhabitants, unconvinced that they were in any danger, ignored the New Republic representatives that had come to help them evacuate—not even the New Republic personnel assigned to evacuate the planet believed that the threat was anything more than a rumor. About twelve hours before the system's sun was scheduled to explode, however, it began to show signs that it was indeed going to implode. In a mad race against time, the New Republic task force was only able to save 1,263 inhabitants."}, {"tag": "p", "text": "Among those who perished was the outpost's founder Zilbra himself, who forced his four sons and two daughters to leave the planet with their families in his old ship while he stayed behind. A number of casualties were not caused by the destruction of the planet itself, but because of chaotic space traffic. Thanta Zilbra was destroyed along with its two moons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}