{"url": "Battle_of_Kemplex_IX", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Battles in the Auril sector", "Category:Battles of the Krath Holy Crusade during the Great Sith War", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Battle of Kemplex IX"}, {"tag": "p", "text": "In 3996 BBY, Jedi and Sith forces fought an engagement at the Kemplex IX space station that proved to be one of the major turning-points of the Great Sith War. The Sith Lord Ulic Qel-Droma originally conceived of a plan to attack the Republic base at Kemplex IX as a feint, in order to draw forces away in preparation for the upcoming attack on Coruscant. Following the capture of Qel-Droma during that battle, Aleema Keto again proposed the idea to attack Kemplex IX and capture the jump-station there. Events, however, conspired against Keto and her plans for herself and Mandalore the Indomitable to attack the space station; Qel-Droma was rescued from Coruscant by the Dark Lord of the Sith Exar Kun and Mandalore. Following his rescue, Qel-Droma decided that Keto and Crado would lead an attack on Kemplex IX in preparation for an attack on Ossus. Through the use of Sith magic, Keto unwittingly set off a chain reaction of explosions in the Cron Cluster, which destroyed all forces present, both Sith and Jedi. The resulting supernova also sent out a massive wave of destruction from its source, which eventually devastated the Jedi planet of Ossus."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the capture of Ulic Qel-Droma during his invasion of Coruscant, and his subsequent rescue by Exar Kun during the trial of Qel-Droma, the leaders of the Brotherhood of the Sith began planning the next phase in their war of conquest. Qel-Droma devised an initial part of the plan that called for a strike against a key Republic hyperspace jump-station at Kemplex IX, located in the Auril sector near the Cron Cluster."}, {"tag": "p", "text": "Initially, Qel-Droma had used a fictitious attack on Kemplex IX as a ruse to draw Republic defenders away from the capital of Coruscant, in preparation for his invasion of that planet. Likewise, following Aleema Keto's betrayal of Qel-Droma, and his capture by the Jedi, Keto had assumed command of the Krath forces. One of her first actions as supreme commander was to order Mandalore the Indomitable and his Mandalorian warriors to attack the jump-station at Kemplex IX. Mandalore set Keto's orders in motion, knowing that his warriors would carry out his commands to the letter. However, Mandalore also suspected Keto of betraying Qel-Droma on Coruscant, and set out for Yavin 4 to meet with the Dark Lord of the Sith Exar Kun, in an effort to convince him to help rescue Qel-Droma from the Republic Inquisition. Due to Mandalore's intervention, Qel-Droma was rescued from the Republic by Kun, and was able to set the original plans of the two Sith Lords in motion, beginning with a strike on Kemplex IX."}, {"tag": "p", "text": "Though the two Sith Lords were outwardly working towards the same goals, both Qel-Droma and Kun harbored their own agendas for staging an attack against the jump-station at Kemplex IX. Following his rescue from the Inquisition, Qel-Droma learned from Mandalore how Keto had betrayed him during the invasion of Coruscant. Aware of Kun's agenda for a strike at Kemplex IX, Qel-Droma ordered Keto to take command of the attack there, confident that she would be rewarded in turn for her treachery against him. What Qel-Droma was aware of, which the others were not, was that Kun had an ulterior motive for also wanting a strike against Kemplex IX. Originally intending on using Sith magic to create a supernova in the Cron Cluster in an effort to wipe out Ossus, Kun altered his planning since he was now aware of Keto's own ambitious motives—Keto, Kun realized, was a threat to his and Qel-Droma's Sith legacy. To that end, Kun gave Keto command of an ancient ship, which had once belonged to the ancient Sith Lord Naga Sadow, that possessed a powerful arsenal of Sith weaponry—weaponry that had the ability to create supernovae by ripping the cores from stars. Excited to have the chance to use such a powerful ship, Keto listened as Kun explained that she was to use the ship's armament to destroy one of the Cron Cluster's stars, thus destroying her enemies' forces. Kun, however, neglected to advise Keto that the Sith magic imbued in the ship would not protect her from the destruction caused by the resulting supernova. Likewise, the Sith Lord failed to mention that he had altered the ship's arsenal so that after the one supernova had been created, it would then set off a chain reaction in the stars immediately surrounding it. This, Kun knew, would cause an enormous supernova to be created, though which the planet of Ossus would be devastated. Known only to Kun and Qel-Droma, it was Ossus that was the true objective, not the jump-station at Kemplex IX."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Anxious to use the Sith magic at her disposal, Aleema Keto, accompanied by her co-commander Crado, took command of Naga Sadow's ship and set course for the Auril Sector. Upon arriving in the sector, Keto and Crado began their attack against Kemplex IX, thus using several weapons aboard Sadow's battleship to successfully destroy all of the Republic defenses and personnel in the immediate area."}, {"tag": "p", "text": "However, word of a planned Sith attack on Kemplex IX eventually reached the Jedi who were stationed on Ossus, and among many, including Master Thon, it was thought that these reports were yet another ruse aimed at diverting the Jedi's attention from elsewhere. Believing everything that Kun and Qel-Droma could desire was located on Ossus, the Jedi Masters decided that a small fleet would be dispatched to Kemplex IX, led by the Knights Dace Diath, Shoaneb Culu, and Qrrrl Toq, in an effort to thwart any plans that the Sith might have had for the jump-station. Setting out immediately for Kemplex IX, the three Jedi arrived at the head of their fleet to discover that the jump-station had already been destroyed, and that all Republic personnel were dead. Discovering that the Sith attack had been real, the Jedi believed that they had missed their chance to strike back at those responsible. On the other hand, Dace Diath managed to use his starfighter's sensors to detect a fleeing capital ship's ion-wake, which was originating from the Cron Cluster, a nearby stellar body of ten densely packed stars."}, {"tag": "p", "text": "Identifying the ship as belonging to the Sith, the Jedi led their fleet in an attack run on the enemy craft. However, during the battle Shoaneb Culu, a Miraluka Jedi, sensed something strange in the Force—something that neither of her fellow Jedi could detect. Realizing too late that something dangerous and deadly was about to happen, Culu attempted to call out to the fleet and other Jedi to warn them. Despite Culu's best efforts, Keto managed to activate the Sith technology aboard Sadow's ship, and was able to successfully rip the core out of a nearby star. The resulting supernova was enormous, and immediately destroyed the entire Republic fleet and three Jedi. However, unbeknown to Keto were the alterations that Exar Kun had made to the ship's Sith weapons. Unable to control the weapons after the initial use, Keto was forced to watch in horror as the first supernova set off a chain reaction among the remaining nine stars. The subsequent explosion completely destroyed Naga Sadow's ship, and all hands aboard, which included Aleema Keto and Crado. In her final moments, Keto was able to piece the parts together and realize that Qel-Droma had returned her betrayal of him on Coruscant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the destruction of Kemplex IX complete, the supernova caused by Keto and her Sith magic was on a direct course for the Jedi-held world of Ossus—exactly as Exar Kun had planned. When word of the devastation of Kemplex IX and the impending supernova reached Jedi ears on Ossus, the planet's authorities issued orders for the planet to be evacuated of all personnel, and whatever Jedi artifacts could be gathered. Many Jedi had already managed to load their individual ships full of Jedi lore and valuables, and still, others, such as Nomi Sunrider and Cay Qel-Droma, chose to stay behind until the last possible moment to preserve what they could. It was during this chaotic time on Ossus that the Sith Lords Kun and Ulic Qel-Droma saw their chance to directly attack the planet and its still enormously wealthy storehouses of ancient Jedi knowledge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle at Kemplex IX first appeared in the issue The Sith War 4: Jedi Holocaust of the Tales of the Jedi series of comics. The battle was conceived and written by author Kevin J. Anderson, and was drawn by artist Dario Carrasco, Jr. Anderson used the battle as one of the main turning points in the sub-series The Sith War, effectively using the battle as a climax for the Great Sith War, which began in the sub-series Dark Lords of the Sith and which Anderson planned to end in the sixth and final issue of The Sith War."}, {"tag": "p", "text": "There has been some confusion since the first appearance of the battle surrounding a set of orders given by the character Aleema Keto to Mandalore the Indomitable. In the issue The Sith War 3: The Trial of Ulic Qel-Droma, Keto speaks with Mandalore, ordering an attack on Kemplex IX. Specifically, Keto says to Mandalore, \"We will do a double-feint and strike the Kemplex Nine jump-station after all! The Republic forces thought it was a diversion of Ulic's, and now they will have left it virtually unguarded!\" Following this exchange, the narration of the comic goes on to say that, \"Mandalore sets Aleema's orders in motion, following them to the letter. He knows his warriors will see that they are carried out.\" However, following this there is no information or pictures of the Mandalorians in action at Kemplex IX, either in the comics or source books. The next instance where Kemplex IX is mentioned, it shows the ruined and destroyed jump-station, and the narration of the comic says, \"Kemplex Nine was a bustling city in space…the only inhabited station in a hot, unstable cluster of ten stars known as the Cron Cluster. After Aleema's attack, though, it is no longer inhabited.\" Specifically the last line regarding Keto has led to some wonderment regarding exactly who was responsible for the destruction of the Kemplex IX jump station, or if perhaps two separate battles had occurred. Due to these factors, there is room for argument to say that the Mandalorians, without Mandalore, attacked the jump station following Keto's initial orders. However, due to the fact that Keto and Crado were already present in the Cron Cluster prior to the arrival of the Jedi, and combined with the comic's narration, there is also the argument that it was Keto and Crado who attacked the jump station prior to the Jedi's arrival. To date, no official source from Lucasfilm Ltd. has explained this situation, or offered any sort of explanation for the initial order by Keto to the Mandalorians."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}