{"url": "Thaneespi/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:Alliance Fleet personnel", "Category:Executive officers", "Category:Females", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Thaneespi"}, {"tag": "p", "text": "First Officer Thaneespi was a Mon Calamari female from the planet Dac. After its invasion by the Galactic Empire, she became a leader of the refugees from there. She went on to serve as an officer in the Alliance to Restore the Republic, participating in the Battle of Endor as one of the deck officers on the Star Cruiser Home One."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Thaneespi was a Mon Calamari female who was a refugee of the Imperial invasion of her homeworld, the planet Dac. After the invasion, she was one of the leaders of the Dac refugees. She became a deck officer and brilliant tactical analyst, serving aboard the MC80 Home One type Star Cruiser Home One of the Fleet of the Alliance to Restore the Republic. At that time, she served as first officer. In 4 ABY, just before the Battle of Endor, she stood next to Admiral Gial Ackbar on the starship and briefly conversed with him."}, {"tag": "p", "text": "The Star Cruiser then traveled to the Forest Moon of Endor, where it fought for the Alliance. Thaneespi served on Home One during the battle, which resulted in the destruction of the Empire's second Death Star and the death of Emperor Palpatine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Thaneespi was one of several brave leaders of the Mon Calamari refugees after the Empire invaded Dac, her homeworld. She had brown-mottled skin and yellow eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Thaneespi was a brilliant tactical analyst. She was also Force-attuned."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Thaneespi wore a helmet of a type worn by high ranking Mon Calamari officers. The helmet housed a communications device and offered moderate protection. She also carried a DH-17 blaster pistol with the trigger guard removed to allow Mon Calamari fingers to use it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thaneespi first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The scenes on Home One were filmed throughout the week of Tuesday, February 16, 1982. Thaneespi's helmet was originally intended to be worn by Admiral Ackbar, but it was given to her instead seeing as Ackbar's articulated head did not allow for the helmet to be used."}, {"tag": "p", "text": "She was first identified in the Death Star II Limited expansion set for the Star Wars Customizable Card Game, released in 2000. Thaneespi's 2000 Hasbro action figure from the Star Wars: Power of the Jedi toy line, titled Mon Calamari officer, has two images of Mon Calamari on its packaging; while one of them correctly shows Thaneespi, the other is of Captain Verrack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}