{"url": "TheForce.net", "categories": ["Category:Real-world articles", "Category:Unofficial websites"], "nodes": [{"tag": "h1", "text": "TheForce.net"}, {"tag": "p", "text": "TheForce.net, also known as TFN, is one of the oldest and most visited fan-run Star Wars news websites."}, {"tag": "p", "text": "The site began in late 1996 as \"Texas A&M University's Star Wars Page,\" founded by roommates Scott Chitwood and Darin Smith. Originally, the site was, in Chitwood's words, \"a few pictures and tons of text,\" but it eventually outgrew its environment. In September 1997, TheForce.Net was born."}, {"tag": "p", "text": "Soon the staff numbered over a dozen. Eventually, Joshua Griffin came on board as partial owner. Later, entrepreneur Philip Wise, owner of both the collecting site Rebelscum.com and the Lucasfilm-licensed autograph company Official Pix, joined Griffin as a co-owner of the site. The site's main technical staff are Anthony Baratta and Michael Spellacy."}, {"tag": "p", "text": "Early in TFN's lifetime, the site was a resource for spoiler information on the upcoming prequel films. However, as its profile grew, and as StarWars.com started meeting much of the demand for advance information, the site's focus moved away from spoilers and into more standard news reporting."}, {"tag": "p", "text": "On May 4, 2013, TFN launched a new design featuring streamlined sections, a commenting system, and social media integration."}, {"tag": "h2", "text": "News Sections"}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "Currently Inactive"}, {"tag": "h2", "text": "Staff"}, {"tag": "h3", "text": "Philip Wise"}, {"tag": "p", "text": "Philip Wise is TFN's webmaster and majority partner. His other projects include the collecting site Rebelscum.com and Official Pix, Lucasfilm's officially licensed distributor of cast-autographed photography. He is also notable in the Star Wars community for having one of the largest private collections of memorabilia in the world."}, {"tag": "h3", "text": "Joshua Griffin"}, {"tag": "p", "text": "Joshua Griffin is a partner in the site. Griffin was the editor-in-chief of the website for five of his eight years actively contributing to the site. He has written many editorials on the subject of Star Wars and thousands of news articles on the site. Griffin has been featured in publications like The Wall Street Journal, Entertainment Weekly, USA Today and Business 2.0. Offline, he has been involved in youth ministry since 1992 and is on the staff of the Saddleback Church in Orange County, California."}, {"tag": "p", "text": "He blogs daily at morethandodgeball.com."}, {"tag": "h3", "text": "Dustin Roberts"}, {"tag": "p", "text": "Dustin Roberts is the Content Manager for TFN and the former Official Star Wars Fan Club President. He also runs the R2-D2-oriented news site R2D2Central.com."}, {"tag": "h3", "text": "Other Staff"}, {"tag": "h2", "text": "External links"}]}