{"url": "The_Arena", "categories": ["Category:Real-world articles", "Category:Wookieepedia Featured articles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "The Arena"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"The Arena\" is a minor theatrical theme written by John Williams for the 2002 film Star Wars: Episode II Attack of the Clones and its respective score to represent the executions in the Geonosis Petranaki arena and, later, the Grand Army of the Republic. \"The Arena\" was performed by the London Symphony Orchestra (LSO) in 2002 and included in the track \"Love Pledge and The Arena\" on the Attack of the Clones soundtrack. The theme features many different sections of the LSO and contains references to \"Across the Stars\" and \"Binary Sunset.\" The theme appears in the films Attack of the Clones and Revenge of the Sith, the video game expansion pack Galactic Battlegrounds: Clone Campaigns, the video games Star Wars: Bounty Hunter, Star Wars: The Clone Wars, and Star Wars: Republic Commando, and the massively multiplayer online role-playing game Star Wars Galaxies. The theme is mainly polyphonic, is in the key of A minor before it modulates to C major, has a tempo of 88 bpm, and a duple meter with a time signature of 4/4. The sheet music for the piece was included in the Attack of the Clones music book. The Attack of the Clones soundtrack was released by Sony Classical on CD April 23, 2002, and as an MP3 download on May 24, 2005. Sony Classical announced on September 25, 2015 that it would be releasing the Attack of the Clones soundtrack along with the other five films' soundtracks in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "Composer John Williams wrote the musical score for the 2002 film Star Wars: Episode II Attack of the Clones, as had been the case for the four previous Star Wars films. He used the London Symphony Orchestra and London Voices to perform the music. Only the orchestra was used for \"The Arena,\" the motif used to represent the executions in the Petranaki arena on Geonosis. The Attack of the Clones soundtrack was released by Sony Classical on CD April 23, 2002, and as an MP3 download on May 24, 2005. On September 25, 2015, Sony Classical announced it would be releasing the Attack of the Clones soundtrack along with the other five films' soundtracks in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"The Arena\" is mainly polyphonic—sections in the orchestra generally play their own unique parts that are dissimilar to those of other instruments and groups by rhythm and pitch. The theme is in the key of A minor, has a tempo of 88 bpm, and a duple meter with a time signature of 4/4. The theme is also melodically similar to \"Droid Invasion Theme\" from the Star Wars Episode I: The Phantom Menace soundtrack."}, {"tag": "p", "text": "The theme starts off with a percussion, string, and woodwind part that frequently modulates into the key of C major before returning to the tonic key. Brass instruments play occasionally throughout this part, but only scarcely. This section is actually homophonic."}, {"tag": "h3", "text": "Anakin tames the reek"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Now polyphonic, the theme then goes into a snare drum roll that leads into the main melody, which is played by the tuba and bass trombone. The melody is complemented by a simple quarter note beat by the snare drums and low strings. The rest of the low brass and french horns then come in and repeat the melody in a higher octave. The trumpets come in toward the end of the melody's second run-through. The melody is then repeated by the french horns with the trumpets playing a countermelody, which at first consists mainly of an E. After this run-through, the theme goes into a complicated set of brass rythyms that are led by the trumpets. This is followed by a brief woodwind, string, and keyboard percussion phrase that leads into a fast string part, which repeats four times before going into another altered version of the main melody."}, {"tag": "p", "text": "After the altered melody, the composition carries on into several measures featuring more brass that is once again set to a quarter note beat by the percussion. It then rushes into a frantic percussion part with accented bursts by the brass. This leads into a fast-paced brass part accented in the background by short bursts of strings. Next the theme goes into a heavily accented phrase played mainly by brass instruments, which is followed by a descending low brass phrase. The main melody is played once again, this time going back and forth from the trumpets to the low brass and back to the trumpets. The low brass then plays two sets of two notes that are slurred together. This is complemented by a trumpet part consisting of a three note phrase that repeats twice. The main melody is then again played by the trumpets. The low brass then repeats the sets of slurs, this time to a much faster, more complicated trumpet part. The low brass then play a complicated rythym with trumpets and strings playing in short bursts. After this, the french horns plays the main melody once again, with brass, woodwinds, and strings playing bursts in the background. The trumpets and percussion play in between the phrases that compose the melody. Next the low brass play another rythym similar to the one earlier, with trumpets inplaying in the background"}, {"tag": "h3", "text": "Anakin rescues Padmé and Obi-Wan"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Next the strings go into a brief section of \"Across the Stars,\" the main love theme from Attack of the Clones. After several measures of low brass and trumpets, the theme goes into a timpani and string part, in which the strings repeat a fast phrase over and over. The brass play occasionally throughout this part. Following the string/timpani part, the low brass play an extremely low phrase. The next few measures feature the percussion, followed by the brass. Then the low brass and low strings play a bass melody, while the keyboard, percussion, and woodwinds play quick bursts. This is followed by another reference to \"Across the Stars\" by the strings, and then the french horns. This leads into another fast string part succeeded by a phrase split between the euphoniums and other low voices. The theme then references \"Binary Sunset,\" which switches from low brass to trumpets and back again. The strings follow playing the previous upbeat part once again. The trumpets come in for the last time, and the theme fades out with a low string part. By the end, the music has settled into the key of C major."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The theme appears one minute and fifty-five seconds into the track \"Love Pledge and The Arena\" on the Attack of the Clones soundtrack. Most of the track is composed of this theme. Though the theme appears in the 2005 film Star Wars: Episode III Revenge of the Sith, it does not appear on the film's soundtrack."}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "In Attack of the Clones, the theme is used only during the planned executions of Anakin Skywalker, Obi-Wan Kenobi, and Padmé Amidala in the Petranaki arena on the planet Geonosis, though here the majority of the theme is cut out, except for the moments scoring Poggle the Lesser announcing the start of the executions up until Skywalker tames the reek. It is also used in one of the DVD's main menus. The theme is used again in Star Wars Episode III: Revenge of the Sith to introduce the planet Kashyyyk prior to the battle there, and again when Darth Vader attacks the Jedi Temple on Coruscant."}, {"tag": "h3", "text": "In other canon media"}, {"tag": "p", "text": "The theme is played on the Takodana map while playing the \"Strike\" game mode in DICE's 2017 Star Wars Battlefront II."}, {"tag": "h3", "text": "In Legends"}, {"tag": "p", "text": "The expansion pack to the video game Star Wars: Galactic Battlegrounds, Clone Campaigns, released in 2002, uses the theme as part of a medley of background tracks meant to represent each of the game's factions. The theme itself represents the Confederacy of Independent Systems faction. The piece is also used during the bounty hunter Jango Fett's pit arena fight on Outland Transit Station in Chapter 1 of the 2002 video game Star Wars: Bounty Hunter, as well as the pit arena fight at Gardulla the Hutt's palace in Chapter 4. The composition makes another appearance in the 2003 massively multiplayer online role-playing game Star Wars Galaxies, as well as each of the game's expansion packs, by virtue of appearing in the game's initial release. It is also used in the 2003 console game Star Wars: The Clone Wars. The first appearance is during the LucasArts logo scene prior to the main menu. The game goes on to include the theme in several missions, including \"Mission 1: The Rescue Begins,\" when you first spot IG-227 Hailfire-class droid tanks, in \"Mission 2: To the Arena\" when you and the other Jedi reach the landing pad, in \"Mission 3: The Battle of Geonosis\" as you make it to the gunship on foot, in \"Mission 4: The Evacuation of Rhen Var\" during the cutscene depicting your arrival on Rhen Var, in \"Mission 9: New Alliances\" while on foot in the Separatist base, in \"Mission 14: Assault on Thule\" after you destroy the last power farm, and during \"Mission 15: Dark Side Rising\" after you destroy the last hangar. The theme can also be heard while playing the \"Academy\" game mode on Geonosis. The theme is utilized at the end of Chapter 12 of Star Wars: Clone Wars (2004) when Mace Windu becomes surrounded by B2 super battle droids after losing his lightsaber during the Battle of Dantooine. Chapter 22 contains the theme as well, using it during clips showing Separatist victories across the galaxy. The composition is utilized in Chapter 23 as the Separatist Droid Army begins its attack on the planet Coruscant. A later appearance is heard in the 2005 Star Wars: Republic Commando video game as the player is briefed inside a Republic gunship during the Geonosis intro scene. It returns during \"Save the Ship,\" part of the second campaign, and during \"The Bridge at Kachirho\" and \"Search and Destroy\" in the third campaign."}, {"tag": "h3", "text": "In other media and merchandise"}, {"tag": "p", "text": "The theme's sheet music appears in Star Wars: Episode II Attack of the Clones: Selections from the Original Motion Picture Soundtrack, the sheet music book for Attack of the Clones, from Bantha Music. The book was released for the following instruments and editions: trumpet, piano, easy piano, clarinet, tenor sax, and alto sax."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}