{"url": "The_Adasca_BioMechanical_Corporation_of_Arkania", "categories": ["Category:Legends articles", "Category:Arkanian culture", "Category:Arms manufacturing companies", "Category:Conglomerates", "Category:Medical companies", "Category:Mining companies", "Category:Scientific companies"], "nodes": [{"tag": "h1", "text": "The Adasca BioMechanical Corporation of Arkania"}, {"tag": "p", "text": "The Adasca BioMechanical Corporation of Arkania, known simply as Adascorp, was a vast medical corporation from Arkania. Famous for its bioengineering and medical research advances, Adascorp was allied with the Draay Trust and Czerka Corporation. It was owned by the House of Adasca and brought huge amounts of profit to the planet, forming Adascopolis."}, {"tag": "p", "text": "For years, Adascorp headquarters was located on the massive starship Arkanian Legacy. However, the ship was lost along with Lord Arkoh Adasca in his ill-fated attempt to secure galactic power through Operation Dark Harvest. The loss of the ship and its extensive archives and research facilities set Adascorp research back by decades. Worse, with no explicit heir to Arkoh's controlling interest in the corporation, ownership of the company remained contested. Adasca's niece Aurora was the sole heir of the company, but in her absence the Draay Trust filed to take over Adascorp."}, {"tag": "p", "text": "During the Cold War, Adascorp worked with the Republic Strategic Information Service and Jedi Master Juns Seros in preparing a trap for the bounty hunter Grand Champion of the Great Hunt. They did this by offering a legitimate deal where they offered credits in exchange for the hunter for sponsoring their new line of adrenals on Quesh. The bounty hunter arrived at the scene where they met the Director of Public Relations who was actually an SIS agent in disguise. Afterwards, Mako commented that the offer was legitimate and the Grand Champion commented that Adascorp was working with the Republic to bring them into custody."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}