{"url": "The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)", "categories": ["Category:Real-world articles", "Category:Art books", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "The Art of Star Wars: The Mandalorian (Season One)"}, {"tag": "p", "text": "The Art of Star Wars: The Mandalorian (Season One) is an art book for the first season of the live-action television series The Mandalorian. The book was written by Phil Szostak and published by Abrams Books on December 1, 2020."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This official behind-the-scenes companion to the Disney+ Star Wars series The Mandalorian features exclusive concept art, character and costume sketches, and vehicle and creature designs."}, {"tag": "p", "text": "The Art of Star Wars: The Mandalorian takes fans behind the scenes of the first ever live-action Star Wars television series. Filled with concept art, sketches, and interviews with key cast, crew, and creatives, including executive producer/showrunner/writer Jon Favreau and executive producer/director Dave Filoni, The Art of Star Wars: The Mandalorian will provide readers with an exclusive look at a whole new universe of Star Wars characters, locations, and vehicles."}, {"tag": "p", "text": "Premiering in November 2019 as a key launch title for Disney+, The Mandalorian follows the adventures of galactic gunslinger Din Djarin and the Child as they traverse the outer systems of the galaxy and evade remnants of the Empire. Readers will encounter early visual and conceptual ideas for these new characters and unexplored frontiers, filled with crime syndicates, bounty hunters, and smugglers. The gritty, lived-in cantinas and spaceports are populated by a talented cast that includes Pedro Pascal (Game of Thrones), Werner Herzog (Fitzcarraldo, Grizzly Man), Nick Nolte (48 Hours), Gina Carano (Haywire, Deadpool), Giancarlo Esposito (Breaking Bad), and Carl Weathers (Rocky)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}