{"url": "The_Academy", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "The Academy"}, {"tag": "p", "text": "\"The Academy\" is the sixth episode of the Star Wars: The Clone Wars television series' third season. It aired on October 15, 2010 and concluded a two-part storyline started with the previous episode, \"Corruption.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ahsoka Tano is assigned to teach a class at a leadership academy on Mandalore. Soon after she arrives, Duchess Satine's zealous nephew -- Korkie Kryze -- and his classmates uncover a nefarious plot. Prime Minister Almec is revealed to be an active part of the Mandalorian black market conspiracy on Mandalore, and he attempts to permanently silence Duchess Satine and the cadets before they expose his corruption. Ahsoka and the cadets defeat Almec before he can succeed."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Skywalker escorts his Padawan Ahsoka Tano to Mandalore for her undercover assignment: to investigate the corruption within the government and also to teach aspiring cadets the ways of lawful and public-serving conduct. She was chosen specifically so, by her status as a learner and her youth, she could serve as a role model for the students. At the landing platform the two are welcomed by Duchess Satine herself, Prime Minister Almec, and the cadets Korkie (the Duchess' own nephew), Amis and Lagos. Due to Obi-Wan Kenobi's previous encounters with the Death Watch on the planet, a no-weapons order has been issued, and Ahsoka is forced to surrender her lightsaber to her master, who leaves to rendezvous with fellow Jedi Kit Fisto."}, {"tag": "p", "text": "Ahsoka begins teaching classes, including Korkie and his friends, about the nature of corruption and their duty as lawful citizens to combat it. Later that evening, Korkie, Amis, Lagos, and Soniee talk about Ahsoka's lesson and Korkie muses over the rationing of the Academy's food supplies. They sneak off to a warehouse and stumble upon a clandestine meeting between three Mandalorian officers, three Gotals, and a humanoid figure wreathed in a robe and hood, who unfortunately has his back turned to the young cadets. They manage to get a holocam recording, but a blunder by Amis exposes the quartet; they narrowly manage to leave, but Soniee's laptop terminal is found by the conspirators."}, {"tag": "p", "text": "The next morning, the cadets visit Satine and report their discovery. While Satine believes them, she cautions them to hold back as they are still too young and untrained for this sort of thing, suspecting that the conspiracy runs even deeper. The cadets do not take this dismissal kindly and choose to ask Almec for help. In class, Ahsoka notices that the four are distracted and learns of their plans, but her own well-meaning words of caution dispirits the young cadets even more."}, {"tag": "p", "text": "The same night, as the cadets prepare to meet with the Prime Minister, they are met by members of the Mandalorian secret service, who attempt to arrest them for treason and conspiracy, but Ahsoka steps in and drives them away. By analyzing the holo-recording of the warehouse meeting, the cadets and Ahsoka discover to their surprise that the cloaked figure from the warehouse is Almec himself. As the five rush off to inform Satine, they find her missing and her bodyguards dead. Desperate, the cadets turn to Ahsoka for leadership, who devises a cunning plan: By pretending that she has arrested the cadets and voicing the suspicion that Satine is involved, she apparently gains Almec's trust but fails to learn of the Duchess' whereabouts. While Almec leaves to prepare a public statement, Ahsoka enters the prison under the pretense of wanting to conduct an interrogation, informs the cadets about the changes in her plan, and via a Force mind trick makes one of the guards take her to Satine's cell. But unfortunately, it turns out to be a trap; Almec has been waiting for this to happen, the officers prove to be resistant to Jedi mind tricks. Ahsoka is hit by a stun blast and captured."}, {"tag": "p", "text": "Almec proceeds to gloat over having established the black market system on Mandalore, self-indulgently claiming it was done out of humanitarian considerations. He tries to make the Duchess sign a confession of treason, which she refuses, so Almec has Korkie and the others brought to him to persuade her otherwise. When he prepares to have Korkie fit with a shock collar, Ahsoka and the cadets start a fight, and though outnumbered and handcuffed, they manage to overpower the guards and clamp a shock collar on Almec himself, forcing him to give up. After the conspirators are arrested, Ahsoka departs from her new friends, following her master back into the war while exchanging a few of their usual snippy comments about her assignment."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Mandalorian prison guards have a crest upon their shoulder that reads \"In Defense of Mandalore.\" It is written in a Mandalorian typeface developed for the Slave I display screens in Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}