{"url": "Battle_of_Khuiumin", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Battles in the Outer Rim"], "nodes": [{"tag": "h1", "text": "Battle of Khuiumin"}, {"tag": "p", "text": "The Battle of Khuiumin was fought between the Galactic Empire and the Eyttyrmin Batiiv pirates, resulting in the pirates destruction. The survivors formed the Khuiumin Survivors and vowed revenge against the Imperial commanders of that battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "For years, the infamous pirates had been using the Khuiumin system as a base of operations. The Emperor finally dispatched the Victory-class Star Destroyers Bombard, commanded by Captain Alistar Dadefra, and Crusader, commanded by Zlece Oonaar, to put an end to their threat. Although the Eyttyrmin Batiivs were aware of the impending Imperial attack, they were confident in their ability to defeat a pair of \"antiquated\" Victory-class ships. Instead of fleeing, the pirates chose to gather their forces and make their stand at Khuiumin."}, {"tag": "p", "text": "The pirate armada numbered over 140 ships, including about 70 starfighters, 50 missile boats converted from yachts and other civilian ships, several dozen cargo vessels armed with with improvised weaponry, and 28 stolen corvettes and patrol ships."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Bombard and Crusader exited hyperspace and launched their TIE/LN starfighters. While Crusader offered supporting fire from a distance, Captain Dadefra chose to plunge his Star Destroyer into the middle of the pirate fleet. Although it was screened by TIE fighters, the Bombard took heavy damage. However, through a bold move by the Imperials the tide of the battle began to turn in their favor."}, {"tag": "p", "text": "Using her tractor beam projectors, Bombard managed to grab hold of several Corvettes. Turbolaser fire stripped the Corvettes of most of their weaponry, and the helpless ships were reeled in to shield the Star Destroyer from the other pirate ships. Captain Dadefra ordered his ship to jam communications, sowing confusion amongst the pirate fleet. The Eyttyrmin Batiivs were caught in a dilemma: they weren't able to get a clear shot at the Star Destroyer, but they were also unwilling to destroy their own heaviest ships. The pirates made repeated, uncoordinated attempts to destroy Bombard's tractor beam projectors, but they were beaten back with precise turbolaser fire and volleys of concussion missiles."}, {"tag": "p", "text": "While the pirates continued to make futile attacks upon his ship, Captain Dadefra deployed his Zero-G Assault Stormtroopers. Braving enemy fire, the troopers flew across space and seized control of the nearby Corvettes. Dadefra then sent half of Bombard's gunners to his newly-acquired ships. Suddenly faced with not only Star Destroyers, but their own Corvettes, the Eyttyrmin Batiiv forces panicked and flew into disarray. Most of the pirates tried to flee the system by escaping into hyperspace. However, they were easily intercepted by Crusader, which had remained at a distance for this exact purpose. Another group of pirates fled to their base on Khuiumin's surface, where they prepared their defenses for one final stand. The Eyttyrmin Batiivs who chose to continue fighting were annihilated. The quick thinking of a young pirate named Jacob Nive saved many of the remaining Eyttyrmin Batiiv from certain death, but could not change the battle's outcome."}, {"tag": "p", "text": "Less than a day after the battle, Crusader delivered the final blow to the base on Khuiumin. A barrage of assault concussion missiles shattered the base's shields and destroyed the remaining pirates. The Eyttyrmin Batiivs were completely routed. In a single battle, their once sizable fleet was wiped away. Out of 8,000 pirates, less than 275 managed to escape with their lives. Imperial casualties numbered only 86 dead and 238 wounded."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The few surviving pirates took with them a single Corvette, the Backstab, whose Captain Jacob Nive led them as the Khuiumin Survivors. The survivors eventually learned the names of the Imperial commanders and vowed revenge. Jacob Nive organized the group into a high-skilled mercenary-like group and even integrated other, smaller pirate bands into his organization. Revenge finally came first in 1 ABY, when the Khuiumin Survivors aided the Rebel Alliance in the Battle of Derilyn and destroyed the Star Destroyer Brazen, Alistar Dadefra's new command and tracked down and killed Zlece Oonaar."}, {"tag": "p", "text": "Some other survivors managed to flee under the guidance of the pirate Omin. They went to the Tragan system, in the Outer Rim Territories, and founded Providence, with the remains of their now unusable starships."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Khuiumin first appeared in the short story Against the Pirate Armada, published in West End Games' The Star Wars Sourcebook. When the game was updated to Second Edition, the story was republished in the revised Sourcebook. The battle has since been mentioned in several works that included the Khuiumin Survivors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}