{"url": "The_Angle", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "The Angle"}, {"tag": "p", "text": "\"The Angle\" is a short story in the anthology From a Certain Point of View. The story, written by Charles Soule, focuses on the point of view of Lando Calrissian."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Lando Calrissian is playing a game of klikklak against the Verosian Jaff Basan at an illegal casino run by Luck Luck Freidal. Just as the game is heating up, the casino is raided by Imperial forces, who kill Freidal and seize all the money, ordering everyone out. Lando, unhappy because he lost a large amount of money, heads to a bar across the city, where he meets his friend Lobot. The gambler, as a peace offering to the bartender, Okkul, pays for everyone's drinks with his last credit chip. Lando informs Lobot that he's currently broke, thanks to the Imperial raid. He states that he doesn't know why the raid happened, because Freidal always paid large bribes to stay in operation."}, {"tag": "p", "text": "Lobot, in response, suggests that it's because the Imperials wanted to exert their authority, after recent events. Lando asks what Lobot's talking about, and the cyborg tells Okkul to replay the holovid that everyone in the galaxy is currently talking about, recently uploaded to the DarkNet by the Rebel Alliance. Okkul notes that he's already seen the footage ten times. Lando, an inveterate cynic who thinks playing hero is for suckers, initially believes the footage, of a battle raging around a massive space station, was faked as a propaganda video. That changes when, to his shock, he sees a very familiar starship entering the action, firing at a trio of TIE fighters: an old YT-1300 light freighter, the Millennium Falcon, which Lando used to own."}, {"tag": "p", "text": "He gets Okkul, who thinks Lando is crazy as they haven't even gotten to the best part of the holovid, to rewind the footage so he can watch the Falcon a few more times, and comes to the shocked conclusion that his old friend and fellow smuggler, Han Solo, was piloting the ship during the battle. Lobot agrees with this assessment. Lando considers Han one of the few people he really knows, so he can't understand why the Corellian, who is just as cynical as him, has suddenly decided to play hero. He could understand Han getting paid to do some smuggling for the Rebellion, but Han attacking an Imperial battle station is in an entirely different category. After the other bar patrons cheer at the holovid's climax, the destruction of the Death Star, Lando calls for a toast to the memory of the greatest smuggler he knew. Ultimately, Lando decides to stew over the revelation over several drinks, thinking that maybe there's something he's missing about the situation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}