{"url": "The_Balloon", "categories": ["Category:Real-world articles", "Category:Articles from unlicensed sources", "Category:MyComyc comics"], "nodes": [{"tag": "h1", "text": "The Balloon"}, {"tag": "p", "text": "The Balloon (Spanish: El globo) is a two-page comic that was drawn by Beaumont Studios in 1986. It was published in Spain by Editorial Gepsa, under the MyComyc imprint and in Castilian."}, {"tag": "h2", "text": "Rich Handley's plot summary"}, {"tag": "p", "text": "While testing a new hang glider, Wicket passes Explorer's Crag, where he discovers a hot-air balloon containing a corpse. With Logray's help, Wicket and Teebo re-inflate the balloon and buzz the Dulok village, mocking Gorneesh and his goons as they fail to bring the Ewoks down. NOTE: The corpse's identity is not revealed."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Droids and Ewoks strips featured in MyComyc in 1986 were rediscovered in 2013 when a fan named Adolfo Rodriguez mentioned them on the DarkHorse.com forums. They were soon afterward translated into English by Star Wars author Abel G. Peña, with his colleague Rich Handley re-lettering them. The two made the comics available for download on their respective websites on April 10. The original author is unknown."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Dark Horse's Vice President of Publishing, Randy Stradley, was interested in including the MyComyc strips in a future Star Wars Omnibus publication. When he inquired at Lucasfilm Ltd. about whether they had been officially licensed at the time of their publication, Lucasfilm found no paperwork proving that Editorial Gepsa had actually licensed the titles, despite the presence of appropriate copyright information. Nevertheless, Handley and Peña strongly suspect that the licensing did occur, although Handley has asserted that \"the strips' legitimacy is considered suspect for now, and Dark Horse has no plans to reprint them unless documentation emerges.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}