{"url": "Battle_of_Kirrek_(Great_Hyperspace_War)", "categories": ["Category:Legends articles", "Category:Battles in the Koros sector", "Category:Battles of the Great Hyperspace War"], "nodes": [{"tag": "h1", "text": "Battle of Kirrek  (Great Hyperspace War)"}, {"tag": "p", "text": "The Battle of Kirrek was a sortie fought during the Great Hyperspace War in 5000 BBY. During Dark Lord of the Sith Naga Sadow's invasion of the Galactic Republic, part of his fleet was brought to the Koros system, in an effort to conquer the system. With a battle for the system certainly forthcoming, Empress Teta, ruler of the Koros system, appointed a man named Llaban to command the forces on Kirrek. Llaban had previously led an army of rebels and pirates in opposition to Teta's efforts to unify the system just a short time earlier. Llaban was told to re-gather his army, and along with the support of Teta's forces, Llaban was given the services of two Jedi, Draethos scholar Odan-Urr and Celegian Jedi Master Ooroo, as well as prisoners from the nearby colony world of Ronika."}, {"tag": "p", "text": "The Sith force initially seemed unstoppable, and Kirrek's defenders were sent into a retreat while Odan-Urr's usage of battle meditation did not seem to have any effect. Finally, Master Ooroo formulated a plan and entered the fray. As a Celegian, Ooroo required a tank filled with cyanogen gas to exist in an oxygen-rich environment, his own native gas being lethal to oxygen-breathers; Ooroo shattered his tank and released the gas, which allowed the wind to carry it towards the invaders. The tactic worked to great success, drastically thinning the numbers of the Sith force. Soon afterward, the prisoners from Ronika arrived to replenish Llaban's forces, and led a charge into the heart of the Sith invaders. Although Ooroo perished due to the destruction of his cyanogen tank, Llaban and his forces were victorious in the Battle of Kirrek."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, two hyperspace explorers, Gav and Jori Daragon, on the run from creditors on Koros Major, fled into the Unknown Regions in their ship Starbreaker 12. There they discovered the long-isolated Sith Empire, which was in the midst of a power struggle between two Sith Lords, the expansionist Naga Sadow and the politically conservative Ludo Kressh. In the middle of a battle with Kressh, Sadow allowed Jori Daragon to escape back to Galactic Republic space in the Starbreaker 12, although not before attaching a tracking device to the ship's hull. Daragon returned to Koros Major, where she warned Empress Teta, ruler of the seven unified worlds of the Koros system, about the Sith threat. Although the Galactic Senate did not believe these forebodings, Sadow amassed a war fleet and entered Republic space not long after. The conflict that was later termed the Great Hyperspace War was ignited, with Sadow launching a full-scale attack on the Republic capital of Coruscant."}, {"tag": "p", "text": "Teta soon began preparing for war, as a large part of the Sith force led by now-Sith apprentice Gav Daragon had gathered in the Koros system. In a meeting in Teta's palace, Teta appointed Llaban, a military commander, to gather his former army and lead them against the Sith on Kirrek. Llaban had earlier led a ragtag army of rebels and pirates in opposition to Teta's efforts to unify the Koros system. Teta was impressed with the ferocity with which Llaban's rebels fought in the Koros Unification Wars and granted his request for amnesty. Also, Teta promised to bolster Llaban's forces with prisoners from the nearby prison world of Ronika. Additionally, two Jedi, the Draethos scholar Odan-Urr and his Celegian Master Ooroo, arrived to fight by their side. Llaban soon returned to Kirrek and gathered his army, and began final preparations for the battle to come."}, {"tag": "h3", "text": "Unintended Consequences"}, {"tag": "p", "text": "Prior to the assault on Kirrek, Naga Sadow assembled a large mining flotilla at Primus Goluud. Two of Sadow's mining vessels were the Sith dreadnaughts Omen and Harbinger, which were captained by the Human Yaru Korsin and the former Kaleesh Jedi Saes Rrogon respectively. While Sadow's Sith forces were comprised predominantly of Red Sith and Massassi, his forces also included a substantial number of Human ship crew and miners. These Humans were the descendants of Tapani migrants from House Nidantha who had traveled into the Stygian Caldera where they were captured and enslaved by the Sith Empire. Prior to the battle, Sadow gave Captain Korsin specific orders to deliver a mining team led by Korsin's half-brother Devore Korsin to the Phaegon system. Korsin and Saes were tasked with extracting and delivering Lignan crystals to Sadow's forces on Kirrek. Lignan crystals were powerful lightsaber crystals crafted from Lignan ore which enabled the blade of a lightsaber to last longer and burn hotter than normal crystals."}, {"tag": "p", "text": "While Sadow had designated Yaru Korsin as the leader of the expedition, he also reminded the Human Sith in a holocron transmission that he was still subject to the former's law and whim. While Sadow gave Korsin more freedom of action than most other Sith masters, he still warned Korsin that he only expected success and that failure would be punished by death. In addition, Sadow also dispatched the Sith quartermaster Ravilan Wroth and his retinue of Massassi warriors to escort the Sith expedition. The Omen and Harbinger left the main Sith mining flotilla which had gathered at the gas giant of Primus Goluud and traveled to Phaegon III. There, Captain Korsin ordered the bombing of the moon's surface to clear the way for a team of harvester droids to mine the Lignan. Despite their mission's success, the Sith mining fleet was attacked by a Jedi Infiltrator starfighter, piloted by Saes's former Jedi Master Relin Druur and his Padawan Drev Hassin. While the dreadnaughts' Blade-class starfighters fought the intruder, the two ships made preparations to jump into hyperspace."}, {"tag": "p", "text": "Hassin crashed his starfighter into the Harbinger, causing a series of explosions which killed himself and pushed the Harbinger towards the direction of the Omen. Meanwhile, Korsin's ship began to move out of the way too late, and the two dreadnaughts collided as the Omen jumped to hyperspace. The Omen was pushed just off course, and while in hyperspace encountered a massive gravity well that tore the ship apart. After a dangerous journey through hyperspace, the Omen crash-landed on a mountain in the remote Wild Space planet of Kesh. Since the Omen and its transmitter relay was badly damaged, it was unable to return to the stars and its crew and passengers would remain stranded permanently on Kesh. The Massassi warriors eventually succumbed to an unknown pathogen in Kesh's atmosphere. Later, Captain Yaru killed his estranged half-brother Devore Korsin during a duel near the Omen; eliminating a rival to his leadership of the 332 stranded Sith crew and passengers."}, {"tag": "p", "text": "Meanwhile, Saes dueled his former master Druur on the Harbinger, seeking to end the score between them once and for all. He succeeded in wounding Druur but failed to stop him damaging the Harbinger's hyperdrive. Druur's actions caused the Harbinger to accidentally jump over five thousand years into the future. With the Lignan ore, Saes used the Force to keep his ship together until it emerged from the the warp. Upon learning of what had happened, Saes intended to return his cargo to Sith space, unsure of what had happened to the Empire. During a final duel against Druur, Saes was finally killed by his former Master, who was angered by the death of Drev Hassan. Shortly later, Druur, who had also succumbed to the Dark Side, was killed during a Lignan ore explosion which also destroyed the Harbinger and its crew. This effectively destroyed the last remnants of Naga Sadow's forces."}, {"tag": "h3", "text": "The battle"}, {"tag": "p", "text": "Back on Kirrek, Llaban based his defenses around a citadel, reinforcing his positions with trenches and sharpened stakes. Finally, the Sith fleet launched their dropships containing the ground forces, which included large amounts of Massassi warriors and Sith war behemoths. Although Llaban's forces fought valiantly against the Sith advance, the Sith force initially appeared too numerous to stop. Aided by the Sith fleet's bombarding of the planet from orbit, the Sith forced Llaban's armies to move steadily backwards. To turn the tide of the battle, Odan-Urr attempted to use an exotic Force technique called battle meditation as he had while commanding Teta's forces on Kirrek during the Unification Wars. Odan-Urr hoped it would raise the spirits of Kirrek's defenders while simultaneously lowering the morale of the Sith. The battle meditation did not affect the single-minded fury of the Massassi warriors, however. With Kirrek's defenders calling for the Jedi to enter the fray, Odan-Urr believed all hope for victory was lost."}, {"tag": "p", "text": "With the Sith forces advancing, Master Ooroo left his position at Odan-Urr's side and went onto the battlefield. As a Celegian, Ooroo required a tank filled with cyanogen gas of his homeworld to survive in an oxygen-rich atmosphere. While oxygen was toxic to the Celegian, cyanogen gas was equally toxic to oxygen-breathers, and Ooroo planned to use this to his advantage. Now amidst the chaos of the battle, the Jedi Master cracked several apertures in his cyanogen tank, allowing the favorable winds to blow the dense gas into the heart of the Sith forces. This strategy worked to great success, as the gas caused many Massassi warriors to collapse and die, their skin itself having turned a light green due to cyanogen poisoning. Even though their chances at victory were dimming, the Sith continued to charge. Finally, more ships appeared in the Kirrek sky; although they were at first believed to carry more invaders, it was soon realized that the ships bore Empress Teta's insignia. The prisoners from Ronika had finally arrived, giving Llaban's forces new and fresh strength. With the released prisoners fighting at their side, Kirrek's defenders stopped their retreat and began to advance. The Sith warriors were forced to flee back to their ships, and the Battle of Kirrek had been won by Llaban's forces."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The defeat apparent on the faces of the Sith was overshadowed by the grief of Odan-Urr at the death of his Master, Ooroo. As the Celegian laid dying near the shattered remains of his cyanogen tank, Ooroo predicted that Odan-Urr would grow old and die among his precious scrolls and books, as one of the most ancient Jedi ever. This prophecy later proved true, as Odan-Urr died over a thousand years later in the Great Jedi Library on the planet Ossus, the most ancient Jedi of his time. The defeat of the Sith on Kirrek, along with Teta's victory at the Battle of Koros Major and the Republic victory on Coruscant, effectively ended any Sith hope of conquering the Republic. Naga Sadow and the Sith fled back to Sith space and were finally defeated by Teta at the second battle of Korriban. Naga Sadow was forced to fake his death and eventually went into hiding on the faraway moon of Yavin 4."}, {"tag": "p", "text": "Meanwhile on Kesh, Captain Yaru Korsin and the Sith survivors of the Omen managed to make contact with the native Keshiri, a purple-skinned Near-Human species. With the help of the Keshiri geologist and dissident Adari Vaal, Korsin and the stranded Sith were able to establish themselves as the new ruling elite on the continent of Keshtah Minor by claiming to be the Skyborn, a race of gods in Keshiri religion. While the Sith had plans to return to the stars and rejoin the Sith, they eventually gave up due to a lack of spare parts and natural metals on Kesh. These stranded Sith eventually developed into the purely Human Lost Tribe of Sith, which created a new Sith state on Kesh. By 4985 BBY, the Red Sith had been purged from the Tribe while the last non-Human, the Houk Gloyd, was killed during an internal power struggle within the Tribe."}, {"tag": "p", "text": "Over the next five millennia, Yaru Korsin would be remembered as the Founder of the Tribe. The Tribe also rewrote its history by destroying or distorting all information relating to their enslavement under the Red Sith, particularly Naga Sadow. To cover up the fact that the Tribe's founder Korsin had not returned to Sadow in order to escape punishment for failure, the Tribe's leadership adopted the belief that they were the Protectors, benign gods in Keshiri mythology who had returned to Kesh. Prior to his death, Korsin himself concealed Sadow's hologram transmission, the last remaining relic of the Tribe's true history, by recording his testament over it. In 3000 BBY, Sadow's secret transmission relating to the Battle of Kirrek was discovered and this sparked a violent bloodbath known as the Great Crisis, which devastated much of Keshtah. In the end, the Caretaker Varner Hilts ended the crisis and reunited the Tribe after he discovered a map which confirmed the existence of a second continent known as Alanciar or \"Keshtah Major\"."}, {"tag": "p", "text": "The new Grand Lord Hilts also commissioned a new testament which acknowledged the Tribe's origins as slaves to the Red Sith of the Sith Empire However, Hilts highlighted the fact that the Tribe's ancestors resisted their enslavement by learning about Sith philosophy and the dark side of the Force. While Hilts also acknowledged that the Tribe's arrival on Kesh had been accidental, he emphasized that the Tribe had turned the tables on their former Red Sith oppressors and rightfully exterminated them. This enabled the Sith Tribe to realize their \"true destiny\" as the rulers and slavers of the native Keshiri. Twenty-five years later, Hilts succeeded in annexing Alanciar and bringing it under Sith rule. Nearly three millennia later, the Lost Tribe rediscovered the wider galaxy after the Sith Meditation Sphere Ship made contact with the Sith Tyro Vestara Khai. The Tribe then created a Sith armada and and sought to expand into the galaxy. This put them into contact and conflict with both the New Jedi Order and a powerful entity known as Abeloth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Kirrek was an event that appeared in Tales of the Jedi: The Fall of the Sith Empire, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Kevin J. Anderson and released in 1996. The lead-up to the battle was mostly featured in the arc's third issue, First Encounter, with the actual events of the battle occurring in the fourth issue, The Dogs of War. In addition to these appearances, the battle was referenced in the opening page of the fifth issue, End of an Empire. In these appearances, the battle was illustrated by Dario Carrasco, Jr."}, {"tag": "p", "text": "The Battle of Kirrek also served as a plot device for John Jackson Miller's Lost Tribe of the Sith series which focused on\nthe story of a Human Sith Tribe that had become stranded on the planet Kesh. The series' first eBook Lost Tribe of the Sith: Precipice, which was released on May 29 2009, established the Tribe's ancestors origins as slaves of Naga Sadow and linked their arrival on Kesh to the Battle of Kirrek. The seventh eBook, which was released on July 18 2011, also recycled the Battle of Kirrek as a forgotten element of the Tribe's history. Meanwhile, Paul S. Kemp's novel Crosscurrent, which was released on January 26 2010, focuses on the story of Saes Rrogon, the captain of Sadow's second lost mining ship Harbinger, and his estranged former Jedi Master Relin Druur."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}