{"url": "The_Big_Game", "categories": ["Category:Legends articles", "Category:Sporting events"], "nodes": [{"tag": "h1", "text": "The Big Game"}, {"tag": "p", "text": "The Big Game was a popular gladiatorial competition held on the Wheel, a massive casino resort space station in the Mid Rim. Long considered a staple of the Wheel, the Big Game was contested between both fearsome warriors looking for fame and wealth, desperate unfortunates, and those accused of crimes on the station. The Big Game consisted of two stages: first, one-on-one preliminary fights were held to determine the qualifiers for the main event, a massive free-for-all where only one could survive. Blasters weren't allowed in the Big Game, with combatants forced to use either hand-to-hand weapons or less powerful needle rays."}, {"tag": "p", "text": "The Big Game was instituted by the Wheel's third administrator, Kelek the Blue, but reached its height during the reign of the Galactic Empire, under the guidance of Administrator Simon Greyshade. In 0 ABY, famous Rebel heroes Han Solo and Chewbacca competed in the Big Game, with Chewbacca emerging victorious after Solo faked his death. That dramatic contest coincided with a riot and firefight on the Wheel that resulted in Greyshade's death, although the patronage of his successor, Master-Com, ensured that the Big Game continued to have a long and fruitful future."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A fixture on the popular casino space station known as the Wheel, the Big Game was a gladiatorial contest that featured individuals of all sorts of different species battling to the death for entertainment and gambling purposes. The Big Game was one of the Wheel's calling cards, with the station's central hub being filled with gladiatorial arenas. Many of the combatants in the Big Game were taken from the Wheel's denizens, as those who ran into trouble on the station were sent to recompense for their crimes in the fighting pits. During the Imperial Period, the choice for those criminals or unfortunates was either fight in the Big Game or be immediately placed onto a waiting prison ship and sent to do hard labor in the infamous Spice Mines of Kessel. In addition, desperate gamblers who had maxed out their credit line also had the option to fight in the Big Game for a shot at fortune—in a sense, gambling on themselves."}, {"tag": "p", "text": "Would-be gladiators in the Big Game were immediately sent to the pits for a rigorous testing program that assessed their ability to survive and fight. Those who graded out with the best skills and reflexes were placed in the highest-paying preliminary fights. The format varied between the preliminaries and the main event: the prelims featured one on one battles between gladiators, while the main event took the winners of those fights and threw them all into the arena for one large free-for-all where only one could emerge victorious. In fact, it was written in the fighters' contracts that there could only be one winner in the main event, and the Wheel's administration held that any attempts to circumvent that rule was grounds for all remaining fighters to be slain. In between the preliminaries and the main event, victorious fighters from the preliminaries were treated with narco-mist until they could be declared medically fit for action. After returning to the arena for the main event, they soon found that they'd be fighting under different circumstances, including battling in zero-gravity."}, {"tag": "p", "text": "Blasters weren't allowed in the Big Game, forcing combatants to make do with other weapons—the specialty the fighters declared often had a heavy impact on betting patterns. Less powerful needle rays were often used as stand-ins for blasters. When the battle began, all other activity on the Wheel essentially ceased: the fights were shown on viewscreens on every casino in the Wheel, and patrons turned their focus exclusively to the Big Game. Decorated winners of the Big Game were recognized as champions, and were afforded riches and stature from their victories."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Located in the Mid Rim's Besh Gorgon system, the Wheel was first built in 84 BBY by the Qiraash visionary Doffen Gaitag, but it was the station's third administrator—the Tefaun banker Kelek the Blue—who instituted one of the station's most famous features, the Big Game. The Big Game was an immediate success, but it wound up leading to the end of its creator's control over the Wheel: the massive influx of scoundrels and rogues who flocked to the station to participate in the spectacle scared off many of the Wheel's richest patrons, forcing Kelek to take on a large debt to the InterGalactic Banking Clan to stay on her feet. Kelek was eventually forced to sell the station to Tionese mining mogul Dominic Raynor, but despite the change in management, the Big Game persisted."}, {"tag": "p", "text": "The competition's popularity reached new heights during the Imperial Period, under the guidance of Administrator Simon Greyshade, who worked out a deal with the ruling Galactic Empire that helped launch the Wheel to a new stratosphere of decadence. Greyshade and Emperor Palpatine worked out an agreement where Imperial troops were barred from operating on the Wheel, in exchange for significant taxes on the station's profits and an adherence to the anti-alien bias customary to the Empire. In practice, that meant all non-Humans were guilty until proven innocent on the Wheel, and many aliens accused of crimes on the station were pushed into fighting in the Big Game. If they declined to fight, those accused would be immediately packed onto an Imperial prison ship and sent to the Spice Mines of Kessel. Under Greyshade's rule, the level of competition in the Big Game also rose dramatically: the former Imperial Senator imported some of the deadliest fighters from around the galaxy for the fights, including Catumen, Wookiees, Bitthævrians and the ferocious fftssfft of Endor."}, {"tag": "p", "text": "Among the most fearsome warriors to enter the Big Game was the Wookiee Chewbacca, a Rebel war hero who found his way aboard the station while fleeing Imperial pursuit with several of his compatriots in 0 ABY. Their ship, the Millennium Falcon, boarded the Wheel without paying a docking fee, arousing the suspicions of Wheel Security, who apprehended Chewbacca attempting to reunite with his friends on the casino deck. After watching Chewbacca take down a Mandallian Giant in a frenzied brawl, the security officers immediately recognized him as an excellent specimen for the Big Game, and shipped him to the gladiator pits after rendering him unconscious. Meanwhile, Chewbacca's close friend Han Solo found himself in a financial bind: his Millennium Falcon had been confiscated over the unpaid docking fees, and his efforts to earn enough money gambling to bail himself and his friends had gone poorly. His credit line maxed out, Solo signed up for the Big Game in a last gasp at the fortune he needed, not knowing that his first mate would also be in the arena."}, {"tag": "p", "text": "Solo and Chewbacca would soon find that there were greater forces at work behind the Big Game, ones that had a vested interest in ensuring they did not win. Administrator Greyshade had brokered a secret deal with Imperial Commander Zertik Strom to allow a full Imperial takeover of the Wheel, in exchange for Rebel leader Leia Organa, who was also a member of the crew of the Millennium Falcon and with whom Greyshade had long been infatuated. Both Greyshade and Strom wanted Solo and Chewbacca dead: Greyshade because they were close with Organa, and Strom because they had proof of his schemes. After testing out with high marks in the fitness assessment, Solo was tossed into the arena against a hulking Ultaarian Greenback wielding poisonous dagger thorns. Using a simple power mace and shield, the underdog Solo managed to trip the Greenback and cause it to fall onto his own dagger thorn, leading to his death."}, {"tag": "p", "text": "Chewbacca was also victorious in his preliminary fight, and the two soon met in the main event of the night, a multi-being battle royale held in zero-gravity. On this occasion, the arena was made up to look like a battle in space, complete with look-alike planets that exploded when touched. Both Solo and Chewbacca soon found that their needle rays did not work, but Solo managed to still eliminate a few gladiators by using his ray shield to deflect the oncoming laser beams back into their targets. Thinking that they'd been sabotaged, Solo and Chewbacca teamed up, and eventually obtained a pair of working needle rays from dead combatants. After dispatching a Tyluun Night-Soarer to become two of the last three fighters left, they quickly realized that they would never be allowed to tie: one of them had to die to satisfy the powers that be. Thinking quickly, Solo used a hidden ray shield to fake his own death at Chewbacca's hands, and then signaled his Wookiee friend to eliminate his last opponent and claim victory. Solo's \"death\" coincided with an outbreak of rioting on the Wheel, precipitated by the station's denizens learning about Greyshade and Strom's treachery—both men perished in the firefight that followed, and Solo, Chewbacca and company managed to escape with their lives."}, {"tag": "p", "text": "After Greyshade's death, the Wheel was taken over by Imperial Commander Mulchive Wermis, who ran the station for a time before it was eventually liberated by the New Republic. For the first time, the Wheel's next administrator wasn't an organic: New Republic General Lando Calrissian turned control of the station over to Master-Com, the ambulatory supercomputer that controlled and monitored the Wheel's systems. Master-Com's near-century-long reign was an extremely prosperous time for the Wheel, and for the Big Game: the mechanical entity had a strong affinity for the contest, and controversially opened it up to droid combatants. By the time of Darth Krayt's Galactic Empire in 137 ABY, the Wheel had fallen into the hands of a new administrator, Pol Temm, a Kel Dor who had previously served as the head of Wheel Security. Temm's first act was to do away with the Big Game, instituting a ban on fighting and weapons, only to eventually die defending the station against Mandalorian Supremacists. Ironically, Temm was replaced by a former champion of the Big Game, the Gotal Attatag Gosem, who ruled the ring for three years until Temm took charge. One of Gosem's first acts was to rescind the ban on the Big Game, ensuring that gladiatorial combat would once again be a staple on the Wheel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Big Game first appeared in Star Wars 19, written by Archie Goodwin and released in 1978. The gladiatorial competition featured prominently in the next several episodes of the original Marvel Star Wars run, before additional information on its history was finally given in Viva Space Vegas! The History of the Marvelous Wheel, a pair of 2013 StarWars.com reference articles written by Abel G. Peña and Rich Handley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}