{"url": "The_Bespin_Gambit", "categories": ["Category:Real-world articles", "Category:Game stubs", "Category:Star Wars: Imperial Assault expansions"], "nodes": [{"tag": "h1", "text": "The Bespin Gambit"}, {"tag": "p", "text": "The Bespin Gambit is the third expansion to the tactical miniatures roleplaying game Star Wars: Imperial Assault. It was published by Fantasy Flight Games on June 2, 2016. The game is compatible with the Lando Calrissian Ally Pack, the Bossk Villain Pack, the Agent Blaise Villain Pack, and the ISB Infiltrators Villain Pack."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"You truly belong here with us, among the clouds.\" –Lando Calrissian, Star Wars: The Empire Strikes Back"}, {"tag": "p", "text": "Not every battle is fought between legions of troops or flights of starfighters. Some battles are fought with information, secrets, and covert operations, pitting the bravest Rebel Spies against the terrifying Imperial Security Bureau. Now, you can bring this shadow war to your games of Imperial Assault with The Bespin Gambit expansion!"}, {"tag": "p", "text": "In The Bespin Gambit, you'll find a wealth of new content to take your campaigns and skirmishes into the ritzy hotels and industrial underworks of Cloud City. Iconic characters like Bossk and Lando Calrissian join the game for the first time, gorgeous new map tiles portray some of the most memorable Cloud City locations, while new companions and a new condition change the flow every game. With two new Rebel heroes, one new Imperial class, new Mercenaries figure groups, a new mini-campaign, and a new focus on your Spy characters, The Bespin Gambit offers an indispensable bonus to every Imperial Assault player."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}