{"url": "The_Barricade", "categories": ["Category:Legends articles", "Category:Combat tactics", "Category:Piracy and privateering"], "nodes": [{"tag": "h1", "text": "The Barricade"}, {"tag": "p", "text": "The Barricade was a tactic used by pirates and privateers to capture and board a target vessel."}, {"tag": "h2", "text": "Execution"}, {"tag": "p", "text": "A pirate vessel wishing to utilize this tactic would use a tractor beam to drag a mass barrier into a space lane in order to block the way for the target vessel; the ship's internal hyperdrive safety overrides would then drag the ship out of hyperspace. The mass barrier could be any object more massive than the target ship itself; when the ship was ensnared, the pirates would attack and board it. The effect was similar to that achieved with the use of an Interdictor cruiser."}, {"tag": "p", "text": "The pirate Drea Renthal used this tactic to trap the passenger liner Queen of Empire as it made its way to Nar Shaddaa in 1 BBY. Using her new flagship, the former Imperial |Carrack-class cruiser Renthal's Vigilance, she dragged quite a sizable asteroid into the liner's projected hyperspace route. The tactic proved successful and Drea and her pirates were able to loot the vessel."}, {"tag": "p", "text": "In the later stages of his career, the pirate Drek Drednar adopted a bolder variant of the barricade. Roaming less remote locations, he would fill the cargo holds of his CR90 corvette \"Sable III\" with water and release it in space, which created huge ice asteroids so as to pull ships out of hyperspace without having to locate a nearby asteroid fields first."}, {"tag": "h2", "text": "Disadvantages"}, {"tag": "p", "text": "The Barricade had two disadvantages. Firstly, space lanes, even the narrowest of them, would be several kilometers wide, which meant that the chances of a ship passing through the exact coordinates of the mass barrier was quite low. Secondly, the ensnared ship could turn out to be be a heavily armed vessel capable of fighting back and perhaps even repelling the pirates. A way of avoiding ensnaring huge warships was to use relatively small mass barriers. However, this would narrow down the odds of capturing smaller and less well armed target ships as well."}, {"tag": "h2", "text": "A surviving tradition"}, {"tag": "p", "text": "Nevertheless, the Barricade was an old technique that had been used by pirates through several generations, especially by those who did not care what they ensnared as long as the target ship did not fight back too effectively, or if it was absolutely certain that the target would go through those coordinates at a specific time - knowledge which was typically obtained via intelligence and espionage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}