{"url": "Battle_of_Koros_Major_(Great_Hyperspace_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Battles in the Koros sector", "Category:Battles of the Great Hyperspace War"], "nodes": [{"tag": "h1", "text": "Battle of Koros Major  (Great Hyperspace War)"}, {"tag": "p", "text": "During the Great Hyperspace War, this clash was fought between the army of the unified Koros system and the forces of the Sith Empire. In 5000 BBY, Dark Lord of the Sith Naga Sadow gathered an invasion force and launched an attack on the Galactic Republic. A part of the Sith fleet led by Sadow's Sith apprentice and Koros Major native Gav Daragon, was sent to conquer the Koros system in a two-pronged attack focused on both his homeworld and the planet Kirrek. The Koros military, commanded by Empress Teta and Vontaige, one of her top advisors and generals, had a diminished fleet due to a recent war but nevertheless believed that they could provide a good accounting of themselves. During the planet-side engagement on Koros Major, Gav Daragon took a dropship down to the main area of battle in the city of Cinnagar to find his sister, Jori, whom he had not seen in a long time. While looking for her with his company of Massassi guards, Daragon had an altercation with a former acquaintance, Aarrba the Hutt, which resulted in the Hutt's death. Jori Daragon arrived at that moment and confronted her brother about the Hutt's death. Overcome with emotion, Gav fled and abandoned the battle soon afterward, deciding to attack Sadow and end the war. With Gav Daragon no longer present to direct them, the Sith lost the battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, hyperspace explorer Jori Daragon returned to her home planet of Koros Major after she had escaped from the long-isolated Sith Empire. Jori, sneaking into Koros system ruler Empress Teta's palace, warned the monarch that the Sith were preparing to wage war on the Galactic Republic in an expansionist endeavor. Shortly afterward, a large part of Dark Lord of the Sith Naga Sadow's force, led by Sith apprentice Gav Daragon, Jori's brother, gathered in the Koros system. A meeting was held in Teta's palace, where the Empress appointed Vontaige, one of her top advisors and generals, to help lead her forces against the Sith on Koros Major. Although many of the fleet's warships had been destroyed or damaged in the recent Koros Unification Wars, Teta believed that they could still make a good accounting of themselves. The citizens of Koros Major were determined to defend the world with their lives and launched their battleships. The Koros military began to take up defensive positions inside the capital city of Cinnagar, and even Teta herself began preparing for battle, donning a heavy suit of battle armor and wielding a large lance. Jori Daragon also armed herself with a protosaber that had been given to her by Jedi Knight Odan-Urr."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Sith fleet promptly began to bombard the planet, sending Cinnagar civilians into a panic. Numerous dropships, containing Sith Massassi warriors and war behemoths, launched toward the planet's surface. The Koros military utilized anti-aircraft guns as countermeasures against the incoming ships. These shots were often wild during the onslaught, and some nearly hit residential homes and businesses. Meanwhile, Gav Daragon, despite the objections of his subordinates, took a contingent of Massassi guards with him when he decided to go to the surface of Koros Major in a dropship. Gav told them that he intended to try a shut down of the city's defenses to facilitate a near-bloodless victory. He had an ulterior motive, however; he wanted to know what had become of his sister, Jori. He landed near the repair dock of a Hutt named Aarrba, an old acquaintance of the Daragon family. When Gav asked Aarrba for his sister's location, however, the Hutt merely spat in his face. Interpreting this as an attack, Gav's Massassi guards stabbed the Hutt in his abdomen. Mortally wounded, the Hutt rolled off his hoversled and crushed the Massassi guards to death."}, {"tag": "p", "text": "Jori Daragon arrived on the scene at that moment and spotted the dead body of Aarrba. Blaming her brother for the Hutt's death, Jori became enraged and slew the lone remaining Massassi guard with her activated lightsaber. With tears in her eyes, she confronted Gav about Aarrba's death. Overcome with the emotion of the situation, Gav Daragon fled the scene. He returned to his flagship and abandoned the battlefield of Koros Major to confront Naga Sadow, hoping to end the war that had ravaged his home and driven him and his sister apart. Without their commander, the Sith force was defeated by Teta and the Koros military."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Jori Daragon later led Teta's fleet in pursuit of her brother Gav, who had found himself in a predicament: he had become trapped aboard Sadow's empty Sith Meditation Sphere after Sadow tricked him into coming aboard the vessel by promising to meet him face-to-face. Gav gave the Koros forces the location of the Sith Empire, but soon afterward, Sadow reappeared and triggered a secret weapon to destroy the nearby star of Primus Goluud. The ensuing explosion killed Gav Daragon. Sadow returned to the Sith Empire defeated; his forces had taken losses at Koros Major, Coruscant, and Kirrek, thereby ending any hope of a victory for the Sith Empire. Teta's forces followed him to the Empire's holdings and defeated him in battle over Korriban, forcing the Dark Lord of the Sith to fake his death and flee to the faraway moon of Yavin 4. The city of Cinnagar was greatly damaged in the battle, but it had been fully rebuilt by 3996 BBY and was flourishing at that time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle on Koros Major is an event that first appeared in Tales of the Jedi: The Fall of the Sith Empire, a story arc of the comic book series Tales of the Jedi, written by Kevin J. Anderson and released in 1996. The lead-up to the battle and much of the action is featured in the arc's third issue, First Encounter, with closure to the Daragons' saga during the battle being given in the fourth issue, The Dogs of War. In these appearances, the battle is illustrated by Dario Carrasco, Jr. In addition to these appearances, the battle is mentioned in several reference books, including The New Essential Chronology, Jedi vs. Sith: The Essential Guide to the Force, and The Essential Atlas. The battle is additionally mentioned in Gav Daragon's entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}