{"url": "Battle_of_Koensayr_42", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Imperial Fleet Operation: Clean Sweep", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Koensayr 42"}, {"tag": "p", "text": "The Battle of Koensayr 42 was a space battle between the Alliance to Restore the Republic and the Galactic Empire in deep space. Imperial forces were attempting to sabotage the delivery of Koensayr Manufacturing Y-wing starfighters from the Deep Space Manufacturing Facility Koensayr 42 to the escort carrier Eleusis, but Eleusis responded by launching two squadrons of Z-95 Headhunters to defend the starfighter factory."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "The Empire had learned of the location of Koensayr 42, a Y-wing manufacturing plant in deep space. Imperial Intelligence had also established that the escort carrier Eleusis was scheduled to take stock of a shipment of Y-wings intended for Red Squadron. The Imperials timed their assault so that a pair of Gamma-class ATR-6 assault transports, escorted by a squadron of Alpha-class Xg-1 Star Wings, would emerge from hyperspace on an intercept vector toward the facility as Eleusis awaited the Y-wing delivery. An Imperial Special Operations aboard the assault transports was armed with a computer virus that would override the Y-wings' flight control systems and cause them to ram into the Eleusis, but in order to impregnate the Y-wings' autopilot, at least one transport would have to dock with Koensayr 42 so that the slicers could upload the virus directly into the factory's datacore."}, {"tag": "p", "text": "Although the Rebels did not know the Imperials' designs in detail, the Eleusis reacted to the entry of the Imperial formation by launching its elderly Z-95s, Blue and Green Squadrons. The Rebel starfighters, defending their carrier and the factory, attempted to interdict the assault transports. They may have summoned at least one flight group of X-wings from Rogue Squadron to assist them if they took many casualties."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Raid on Rebel Factory Koensayr 42\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side, both sides have conflicting mission objectives, and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Imperial Fleet Operation: Clean Sweep, using the default craft assigned to the player."}, {"tag": "h2", "text": "Appearances"}]}