{"url": "The_Children_from_Tehar", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "The Children from Tehar"}, {"tag": "p", "text": "\"The Children from Tehar\" is the sixth episode of the first season of the animated television series Star Wars Resistance. The episode premiered on November 4, 2018."}, {"tag": "h2", "text": "Official Description"}, {"tag": "p", "text": "In need of credits to fix a broken part, Kaz looks to recover two missing children and claim a sizable bounty."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The damaged compensator"}, {"tag": "p", "text": "The episode opens with a wide shot of the Colossus platform. At Jarek Yeager's repair shop, Tam Ryvora and Neeku Vozo are fixing the Fireball. Kazuda Xiono asks if he can help. Tam tells him that no offense, but installing an acceleration compensator requires a little more finesse than he possesses. Kaz scowls and sits down."}, {"tag": "p", "text": "Yeager tells Tam to be careful not to damage the casing before leaving. Tam tells Neeku that they have to tighten all three lockdowns at once. Neeku points out that he only has two hands, although he often wishes he had a third. Tam sighs, and reluctantly allows Kaz to help. An excited Kaz grabs a wrench and the three position their tools."}, {"tag": "p", "text": "Tam tells them to shift their wrenches to the left on three. The engine comes to life briefly but then turns dark. Kaz asks if it was top or bottom left. Tam groans in frustration and chastises Kaz for breaking it. Kaz apologizes and offers to buy her a new one. Tam throws her wrench down and angrily tells Kaz that they are expensive and rare. She hurls tools at Kaz, who flees out of the repair shop with BB-8. One tool hits Kaz on the back of the head."}, {"tag": "h3", "text": "The bounty"}, {"tag": "p", "text": "While visiting Aunt Z's Tavern, Kaz nurses his bruised head. When Kaz asks Aunt Z what she has for a roguish pilot on a budget, she offers him a cup of water. Kaz pays for it and drinks from the cup. Before he can finish it, she tells him that his budget ran out two sips ago. Taking pity on Kaz, Neeku pays the rest of the bill. Aunt Z compliments Neeku for being a real friend for Kaz, adding, \"one with money.\" Kaz thanks Neeku, but asks what he will do about Tam's compensator, as he wonders where he'll get the money for it."}, {"tag": "p", "text": "Kaz overhears the Rodian Glem and the Gotal Yani talking about a 20,000-credit bounty on a couple of runaway human children. Kaz sees a holoprojector depicting the two children. Yani dismisses the kids as runaway brats, while Glem thinks that they're probably on the other side of the galaxy by now. Yani remarks that most people regard this waterball as the other side of the Galaxy. Glem asks for another jet juice."}, {"tag": "p", "text": "Peering at the hologram, Kaz notices a crafted wooden charm that the boy is wearing on his wrist. Kaz asks Neeku if he's seen that symbol before, and Neeku says he has not. Kaz thinks that if he can find those kids, that reward can change everything. Neeku points out that Kaz is not a bounty hunter, because he has seen bounty hunters in action. Kaz counters that he is willing to become a bounty hunter for that kind of money, and tells Neeku that it is a win-win situation: getting Tam's part fixed and helping these kids. Kaz asks what could go wrong."}, {"tag": "h3", "text": "Chase in the marketplace"}, {"tag": "p", "text": "At the Colossus marketplace, an Ugnaught vendor haggles with the Arcona Garma, telling her no refills and one bowl only. While the vendor is distracted, the two fugitive children, Kel and Eila, sneak through the marketplace. Garma complains that she doesn't get paid until next week. Eila motions, and her brother Kel steals a bowl from the barrel behind the Ugnaught vendor. With Garma unable to pay for it, the Ugnaught decides to take the bowl for himself. When he turns, he discovers another of his bowls missing."}, {"tag": "p", "text": "Arriving at the marketplace, Kaz tells Neeku and BB-8 to keep looking. Neeku counters that the odds of finding those children here are akin to winning the Platform Lottery twice. Meanwhile, Kel and Eila hide behind a crate and the two help themselves to the contents of the bowl. However, they are discovered by the Ugnaught vendor. Kel pushes the top crate over, causing the vendor to fall. The two children flee, with the Ugnaught vendor in hot pursuit. The children run past the Klatooinian merchant Bolza Grool, who is carrying a crate of gorgs. The Ugnaught vendor crashes into Grool, causing him to fall and drop his contents. One gorg lands on the vendor's face."}, {"tag": "p", "text": "The children run away, but knock over Kaz, Neeku, and BB-8. Kaz tells them to slow down, and asks what their hurry is. Eila has broken her left leg, and Kel helps her up. Kaz sees the wooden charm on Kel's wristband and realizes they are the missing children. Kaz says that he and his friends are not going to hurt them and tries to convince them not to run."}, {"tag": "p", "text": "However, Kel leads his sister away. Kaz runs after them with BB-8 on his heels. He says they just want to help, but Kel pushes him away and says that they don't need his help. In the process, he drops the wooden charm. Kaz lands on top of BB-8, who squeaks at him. Kaz realizes that the children are in trouble and need help, and tells Neeku that they need more eyes on this. Neeku says that he has some friends who can help, but that they only have two eyes each. Kaz takes an interest in Kel's wooden charm, retrieving it."}, {"tag": "h3", "text": "Lair of the Chelidae"}, {"tag": "p", "text": "Later, in the underbelly of the Colossus, Neeku brings Kaz to the platform's Engineering Level. Kaz asks if he knows people down here, and remarks that this place is kind of disgusting. The three walk down a set of stairs and enter through a blast door into the domain of the Chelidae, an alien species known as the \"shellfolk,\" Neeku introduces Kaz to his Chelidae friends and greets two of them, telling the second that his shell looks extraordinary today. Neeku wishes that he had a carapace."}, {"tag": "p", "text": "Neeku tells Kaz that the Chelidae are the engineers, maintenance workers, and custodians of the power on the Colossus. He adds that they are the true heroes of this platform. He says that they have ears and eyes everywhere, and that's how they know what to fix. Neeku adds they know a great deal more. A Chelidae grunts."}, {"tag": "p", "text": "Neeku introduces Kaz to two of the Chelidae leaders, and tells them that he is looking for two children who will bring Kaz a great deal of money. Kaz blushes in embarrassment. One of the Chelidae leaders says that they will stay on the lookout. Kaz asks if they can move, and is startled by a dormant Chelidae."}, {"tag": "p", "text": "Neeku explains that the \"shellfolk\" can slow down their life systems. He tells them that they can reach him via a comlink he hands to the leader. The Chelidae grunt in response. Kaz leads Neeku out of the engineering deck, telling him that they have to keep looking because word may be out that the children are here."}, {"tag": "h3", "text": "An audience with Captain Doza"}, {"tag": "p", "text": "Exiting engineering, Kaz and Neeku are greeted by the droid 4D-M1N, who tells Kaz that Captain Imanuel Doza has requested his presence at Doza Tower. She tells him to follow her, and Kaz swallows nervously. The droid escorts Kaz, Neeku and BB-8 to Doza's office."}, {"tag": "p", "text": "Captain Doza recognizes Kaz as Yeager's new mechanic who challenged his daughter to a race. Kaz says that was a big mistake. Captain Doza points out that Kaz was seen in the marketplace with the two missing children, who have a large prize on their heads. Kaz confirms this was the case. 4D-M1N walks behind Kaz, startling him."}, {"tag": "p", "text": "Kaz shows Captain Doza Kel's charm, which Doza studies. Kaz asks why they are on the run. Doza counters that mercenaries do not usually ask questions, and that they just want to be paid. Kaz says he is no mercenary. Doza asks Kaz to consider who would place such a large bounty on two missing children, or why. Kaz says he didn't, and that he just wanted to help the children to get home. Doza remarks that he certainly did, and promises to let him know if they find them. He tells 4D to escort Kaz, Neeku, and BB-8 out."}, {"tag": "h3", "text": "Colluding with the First Order"}, {"tag": "p", "text": "After they have left, Captain Doza contacts Captain Phasma via hologram. Captain Phasma asks if Captain Doza has decided to accept the First Order's offer. Doza says that he has decided, in the interests of improving their relationship, to give them some information that he knows that they desire."}, {"tag": "p", "text": "Doza asks Phasma why the First Order would place such a large bounty on a pair of missing children. Phasma claims that they are children of a high-ranking and wealthy family within the First Order. She claims that they would be quite grateful to know the whereabouts of their missing family members. Doza tells her that they were spotted here on his platform within the last hour. Phasma is pleased, and says that she will dispatch her agents to retrieve them."}, {"tag": "p", "text": "Doza tells her that these children were wearing a symbol which doesn't resemble a First Order insignia. Phasma reiterates her claim that the children are members of a high-ranking family, and are not military. She tells Doza that the First Order is grateful for this display of loyalty. He tells her to remind her agents that this is his station and that in the interests of their future relationship, they need to abide by his laws. Phasma promises to remind them. After the transmission has ended, Doza fingers the charm."}, {"tag": "h3", "text": "Desperate straits"}, {"tag": "p", "text": "The janitor Opeepit is moving his trolley of cleaning tools over a drain. Below the drain, Kel and Eila hide. Eila is nursing her broken left leg. Kel asks if it hurts, and Eila says she thinks her leg is broken. Eila tells Kel that she hates this place, and that she wants to go back to their homeworld of Tehar. Kel responds that she knows they can't do that because there is nothing back there anymore. He adds that they are safe here for now. Eila disagrees, saying that no place is safe from \"him.\" Eila is startled by BB-8 rolling over the grate."}, {"tag": "p", "text": "Back at Yeager's workshop, Tam asks Kaz where her compensator is. Kaz claims that he was just going to get compensation to compensate her for the compensator. Neeku tells Kaz that he is receiving urgent news from their friends. Over the comlink, the Chelidae informant tells Neeku that they have found the children. Kaz is excited and wants to go, but Tam grabs him by the ear. She tells him that he isn't going anywhere without the compensator, as she wants its specs matched exactly. He drops the compensator by accident, and struggles to carrying the heavy device."}, {"tag": "h3", "text": "Helping Kel and Eila"}, {"tag": "p", "text": "Kaz follows Neeku and BB-8 to the engineering platform, where the Chelidae are looking after Kel and Eila. Kel is suspicious of Kaz, and thinks that he is after them because of the money. Kaz tells Kel that he is trying to help, and that if he gets them home he can make some money and that they won't be lost. He thinks that whoever is looking for them is offering a lot of credits because they care."}, {"tag": "p", "text": "Eila tells Kaz that they are not lost, but ran away. When Kaz asks from who, Kel tells her that if he wants to help, his sister's leg is broken and she needs medicine. Neeku tends to Eila and finds that she has a fever. Neeku asks the young ones where their parents are. Kel tells them that their parents are gone, and that their whole village is gone. He adds that they are the only survivors."}, {"tag": "p", "text": "When Neeku asks who was it who destroyed their people, Eila mentions the name Kylo Ren. When Neeku asks what a \"Kylo Ren\" is, she replies that that's what his army called him. She says that he was dressed in black and carried a lightsaber, like in the stories about the Jedi. Kel finishes off by saying that he and his sister barely escaped this destruction."}, {"tag": "p", "text": "Kel adds that Kylo brought a small army with him. Kel and Eila stowed aboard a cargo ship and made it off Tehar to the Colossus. Kaz realizes that the children are running from the First Order, and vows to keep the children save from them. Kaz tells Kel to come along so they can get his sister some help."}, {"tag": "h3", "text": "Eluding the First Order"}, {"tag": "p", "text": "An Upsilon-class command shuttle approaches the Colossus. While walking through the marketplace, Kaz tells Kel and Neeku that they need something for a broken bone. However, they can't bring Eila to a medical station because they will asks for identification. Kel says that he knows what his sister needs, and leads them to a stall selling herbs. Kaz thinks that Eila needs a biocast, not plant food."}, {"tag": "p", "text": "Kel spots a plant with the sprigs removed. Neeku pays for the herb, to Kaz's surprise. Neeku replies that money should be used on the necessities for anyone who needs it. Just then, they hear the voice of the First Order Commander Pyre, a gold-plated stormtrooper, who is questioning a purple-skinned alien vendor about the runaways. As the alien gestures, Kel confronts Kaz about his promise that they would not find him. Kaz says they have to find a way out of here without being spotted. BB-8 draw's Kaz's attention to a chute."}, {"tag": "p", "text": "While Kel is making his way to the chute, one of the stormtroopers spots the boy and alerts his commander. Kel, Kaz, Neeku, and BB-8 escape down the chute as the blast doors close, leaving the stormtroopers outside. Pyre tells his men to follow him. Kaz and the others emerge in the lower levels, where they are sighted by a pedestrian. Pyre and his men bump into the pedestrian and chase the fugitives, firing their blasters on stun. The group flees to engineering, and BB-8 seals the blast door in the nick of time."}, {"tag": "p", "text": "As the stormtroopers cut their way through the blast door, the group raise down the stairs into the engineering room. The Chelidae seal the second blast doors before the First Order can breach the deck. Neeku says that they are safe because the doors are blast proof, and Kaz counters that they don't know for how long."}, {"tag": "p", "text": "With Eila in pain, Kaz tells Neeku to prepare the herbs. Neeku says they can use the bag as a compress. When Kaz asks why the First Order wants them so badly, Kel tells Kaz that the First Order placed a bounty on them. When Kaz asks why, Eila says that they don't know, but that the First Order won't stop. She says that they took away their parents and home and don't know why."}, {"tag": "h3", "text": "Tricking the First Order"}, {"tag": "p", "text": "As the First Order forces their way through the second blast doors, Kaz tells them to stay calm and that they need to get the First Order to stop following them. Kel says that they won't stop as long as they are alive, and that they will just keep coming. As the First Order cut their way through the door, Neeku reminds Kaz that this is a dead end. Kaz says that he now knows what he has to do, and convinces the others to help him open a grate leading down to the ocean below. Neeku asks if Kaz's plan is to plunge them into the \"icy waters of bodily destruction and certain death.\""}, {"tag": "p", "text": "Kel and Eila watch as the First Order troops break down the second blast door. Commander Pyre demands to know where the children are and the Chelidae part to reveal Kel and Eila. Pyre offers the children the choice of coming with the First Order or being destroyed. Kel clutches his sister, and the two move towards the grate."}, {"tag": "p", "text": "Kel defiantly says that they will never let themselves be taken, and the two seemingly plunge into the ocean below. Pyre and his men barge past the Chelidae and look through the hole. Pyre orders one of his stormtroopers to scan the waters for life signs. One of the stormtroopers brings a scanner, and reports that the two life signs are slowing and that body temperatures are dropping."}, {"tag": "p", "text": "The second stormtrooper informs Commander Pyre that Captain Phasma is trying to call, and asks what he should tell her. Looking at the ocean below, Pyre says he will speak to her. Pyre contacts Phasma by hologram and reports that the children are no more. Phasma is very impressed, and believes that now that the children are gone, their plans will remain out of the reach of the Resistance. She praises Commander Pyre for doing well and orders him to return to base. The stormtroopers leave."}, {"tag": "h3", "text": "Finding refuge and safety"}, {"tag": "p", "text": "The Chelidae then look through the hole to find the children safely on the lower floor. Kaz praises one of the Chelidae for his nice catch, and asks Neeku if his shellfolk friends are okay. Neeku reassures him that they are, because they merely slowed down their life signs. The two Chelidae surface from the ocean."}, {"tag": "p", "text": "Kaz deduces that now that the children have met their \"doom,\" the First Order will leave them alone for a while. Kel thanks Kaz and Neeku, and says he was wrong about them both. The Chelidae chief tells the children that the shellfolk have invited them to stay for as long as they like. Neeku translates their language into Galactic Basic Standard. Eila thanks them both while stroking a gorg. Kaz also thanks one of the Chelidae for fixing Tam's compensator. However, he almost drops it."}, {"tag": "p", "text": "Back at Doza Tower, Captain Doza looks at Kel's wooden charm. 4D-M1N tells him that the First Order has left the platform. Doza thanks the droid and fingers the charm, looking ominously at the horizon."}, {"tag": "h3", "text": "The life of a spy"}, {"tag": "p", "text": "Back at Yeager's repair shop, Kaz returns with the compensator. Tam assumes that he has fixed the compensator, and asks how he did that. Kaz replies that he did it with the help of some friends, and claims it's no big deal. Tam is surprised to learn that Kaz has friends, and remarks that he is full of surprises. She asks Kaz what other secrets he's keeping from her. Kaz denies keeping secrets and claims that he is the most open person she will ever meet."}, {"tag": "p", "text": "Kaz then excuses himself, and contacts the Resistance via a computer screen. He is greeted by the Abednedo Ello Asty. Kaz identifies himself, and tells Ello that he is trying to reach Poe Dameron. Ello identifies himself, and says that he is taking reports from all agents and spies until Commander Dameron is back from his mission. Kaz realizes that there are other spies and agents besides him."}, {"tag": "p", "text": "He tells Ello that they had these two kids from Tehar, and that their planet was taken over and its population wiped out by the First Order. Ello says he has never heard of Tehar, and thinks that the planet is in the Unknown Regions. Kaz also reports that someone called Kylo Ren was leading the First Order army. He asks if that name means anything to him. Ello says that General Organa will want to hear about this immediately. He praises Kaz for his excellent intel, and tells him that Poe has said a lot of good things about him and that he is doing great things for the Resistance. Kaz thanks Ello before signing off."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}