{"url": "Battle_of_Korda_Six", "categories": ["Category:Legends articles", "Category:Battles in the Inner Rim", "Category:Battles of the Mandalorian Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Korda Six"}, {"tag": "p", "text": "The Battle of Korda Six was a battle of the Mandalorian Civil War. The True Mandalorians led by Mandalore Jaster Mereel were ambushed by the splinter Death Watch group led by Vizsla on the planet Korda Six."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The True Mandalorians had been hired by the Korda Defense Force to rescue a training squad that had been pinned down by natives on Korda Six. In reality, however, it was a setup by the Death Watch whom the True Mandalorians believed dead, who had trained and organized the Kordans in the art of war, then planted false information with the Korda Defense Force."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The True Mandalorians divided up into three squads: Vertigo Squad, an aerial-attack company under Montross; Headhunter Company, a heavy cleanup company under Jaster Mereel, and a basic infantry and security squad under Jango Fett, Jango's grunts. This was the first time Fett had been made a squad commander. The True Mandalorians left their carrier ship over Korda Six in Meteor-class Q-Carriers. The first sign of trouble was when they came under ion cannon fire while landing, causing one to crash, killing all aboard, and at least one other to land disabled and damaged. As the survivors formed up, they came under intense and coordinated Kordan blaster fire, catching the Mandalorians unprepared, causing many casualties."}, {"tag": "p", "text": "Mereel ordered Vertigo Squad to abort its attack on the Kordan gun emplacements, but Montross refused, leading his squad into heavy fire, and only surviving when Mereel's forces came to his aid. Fett used the aerial attack as a diversion, taking his squad to rescue the trapped Korda Defense Force training squad, but instead became ambushed by a Death Squad unit. When Vizsla appeared on the battlefield, Montross abandoned Jaster, whom he had been protecting, in hope of becoming Mandalore. This left Jaster open to attack, and he was killed. Jaster's body was recovered by Fett, who pulled him back behind friendly lines. Montross also made it back and survived the retreat action."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the defeat, Montross was permanently exiled from the True Mandalorians despite attempting to become the next Mandalore, the position of which was awarded to Fett."}, {"tag": "h2", "text": "Participants"}, {"tag": "h3", "text": "Mandalorians"}, {"tag": "h3", "text": "Death Watch"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}