{"url": "The_Capture_of_Imperial_Hazard", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction"], "nodes": [{"tag": "h1", "text": "The Capture of Imperial Hazard"}, {"tag": "p", "text": "The Capture of Imperial Hazard is a short story written by Nora Mayers and illustrated by Christopher Trevas. It was originally published in Star Wars Adventure Journal 10 by West End Games in May 1996 and was later archived online at Hyperspace on July 9, 2007."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sayer Mon Neela, former assistant barrister general of the Republic, now a war strategist and high-ranking rebel leader, was located on the planet Horob. As Imperial forces converged on the primitive planet, rebel base hurried to evacuate. To buy the ground forces time to escape, Neela ordered her yacht the Starcrossed to, instead of making a jump to the Rim, intercept the incoming Victory-class Star Destroyer Imperial Hazard."}, {"tag": "p", "text": "Neela then opened a channel to the Star Destroyer, identified herself and requested to meet the captain. To ensure her safety, she threatened to self-destruct her yatch and blow the Imperial Hazard at the first sign of aggression."}, {"tag": "p", "text": "To capture the wanted rebel leader, the Star Destroyer's captain Sergus Lanox accepted Neela to his ship."}, {"tag": "p", "text": "During the two's private meeting, they glimpsed into each other's character and developed mutual admiration, which they tried to mask."}, {"tag": "p", "text": "As Lanox attempted to capture Neela, she threatened to destroy Imperial Hazard with the Starcrossed, and counterofferred Lanox to surrender his ship to the Alliance."}, {"tag": "p", "text": "As the negotiation became a stalemate, Lanox had Neela escorted back to her ship."}, {"tag": "p", "text": "Unbeknownst to Lanox, Neela had secretly taken aboard a prototype spy device developed by rebel scientists on Horob. The device decoded the encryption of all systems on the Imperial Hazard, and started to cause critical system failures as it overloaded the Star Destroyer's computers."}, {"tag": "p", "text": "Soon the Imperial Hazard started to lose altitude, dragging Starcrossed with it as they were connected by an umbilical."}, {"tag": "p", "text": "Discovering Neela's treachery, Lanox personally led a stormtrooper contingent to storm the corridor."}, {"tag": "p", "text": "As the Imperial captain and the rebel leader confronted each other in a firefight, the Imperial Hazard imploded, rocking the corridor and plunged Lanox into Neela's arms. The two fell onto the floor, dazed and gaping. In the moment of life and death, Lanox abandoned the last chance to arrest the woman. He helped Neela to escaped by opening the jammed hatch on her ship, and gave her a long kiss, before struggling back to his own ship through the rapidly depressurizing corridor."}, {"tag": "p", "text": "Back to safety in a rebel base on Carosi XII, Neela privately admitted her admiration for Lanox to Bothan general Se'lab before the celebration held for her. Later through holonet news, Neela witnessed Sergus Lanox being presented the Distinguished Medal of Imperial Honor by Grand Admiral Takel, for his extreme heroism against rebel terrorism."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}