{"url": "The_Clone_Wars:_Shipyards_of_Doom", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:The Clone Wars graphic novellas"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Shipyards of Doom"}, {"tag": "p", "text": "The Clone Wars: Shipyards of Doom is the first in a series of digest-sized Clone Wars graphic novellas, published by Dark Horse Comics. An alternate version with a different cover is included with the Target exclusive edition of Star Wars: The Clone Wars DVD and Blu-ray."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Introducing a new, quarterly, graphic-novella series based on the exciting new Clone Wars motion picture and \"Clone Wars\" animated television series! In \"The Shipyards of Doom,\" Obi-Wan Kenobi and Anakin Skywalker lead an elite Clone Trooper strike force to destroy the Separatists' most important shipyards. But when the enemy is tipped off to their plan, the two Jedi heroes are forced to rely on help from Anakin's new, and still \"wet behind the ears\" Padawan, Ahsoka. But what can she do against the droid armies of General Grievous? Written by Henry Gilroy, the head writer for the TV show, Star Wars Clone Wars: The Shipyards of Doom packs all of the excitement of the animated series into a full-length, all-ages comics adventure!"}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The idea of \"the carbonite infiltration maneuver,\" with the Jedi sneaking into Separatist territory by freezing themselves in carbonite to get past droid bio scans and radiation beams, was adapted by Henry Gilroy from the original draft of Star Wars: The Clone Wars episode \"Destroy Malevolence,\" where it was going to be used to sneak aboard Malevolence."}, {"tag": "p", "text": "The maneuver would later appear onscreen in the Season 3 episode \"The Citadel,\" where it is used to infiltrate a high-security prison."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}