{"url": "The_Clone_Wars:_Prelude", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Prelude"}, {"tag": "p", "text": "The Clone Wars: Prelude is a seven-page webcomic and the first installment in The Clone Wars webcomic series, posted on StarWars.com on October 2, 2008. \"Prelude\" leads directly into \"Ambush\", the premiere episode in The Clone Wars television series. The webcomic was written by Pablo Hidalgo, illustrated and colored by Thomas Hodges, and lettered by Grant Gould. \"Prelude\" follows a pair of clone shock troopers nicknamed Rys and Jek getting ready for their next mission: escorting Jedi Master Yoda to a diplomatic meeting with King Katuunko of Toydaria. The comic also shows a discussion between Republic Supreme Chancellor Palpatine and Katuunko via hologram, which sets up the meeting between Yoda and Katuunko, as well as Count Dooku touring the Confederacy's new listening post, Skytop Station."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A pair of clone shock troopers of the Grand Army of the Republic, nicknamed Rys and Jek, relax at the Republic Service Organization center on the Republic's capital world of Coruscant. While Jek repairs his blaster rifle, Rys watches several Star Destroyers leaving the nearby drydocks, noting that the Laudable, under the command of General Ares Nune, is departing. Rys begins to complain about being stationed on Coruscant, tasked as bodyguards to senators; he believes the two of them should be out in the front lines of the war between the Republic and Confederacy of Independent Systems, fighting alongside their clone brothers. Jek counters that they were born to serve the Republic and that they go where they are needed, and, currently, they are needed on Coruscant."}, {"tag": "p", "text": "Meanwhile, on Ruusan 2, a moon deep inside Confederate territory, the leader of the Separatists, Count Dooku, inspects the Confederacy's new listening post, Skytop Station, in low orbit over the moon. Dooku, along with his apprentice Asajj Ventress, are led on the inspection tour by Separatist Council member Po Nudo, whose corporation has built the space station. Nudo boasts that Skytop Station can intercept almost any HoloNet transmission, and that it is the ultimate listening post in the quadrant. Although Ventress is unimpressed by the station, thinking it to be a cowardly venture, Dooku is quite pleased by it, hoping that it will yield results."}, {"tag": "p", "text": "At the same moment, King Katuunko of Toydaria, aboard his personal yacht, is contacted by Supreme Chancellor Palpatine of the Republic via hologram. Palpatine wants to set up a meeting place for negotiations regarding Toydaria joining the Republic, so that the Republic can use Toydaria as a staging ground for the war. Katuunko does not want to meet aboard a Republic cruiser filled with clones and insists instead that he negotiate with a Jedi, because he has never met one before. Palpatine argues that it would be risky to send an unarmed Jedi to a world as close to Separatist territory as Toydaria, so Katuunko arranges to meet on the neutral coral moon Rugosa in three days."}, {"tag": "p", "text": "Back on Coruscant, Rys continues to watch departing Star Destroyers, seeing the Brassbound lifting off, while Jek inspects his new Z-6 rotary blaster cannon. Lieutenant Thire, Rys's and Jek's commanding officer, then walks into the room and informs his subordinates that they've been reassigned to another mission. Rys, pleased at this news, asks Thire about their new task as the three clone troopers walk out of the room. Thire says that they are to escort a Jedi on a diplomatic mission to the Outer Rim. The three walk toward an awaiting gunship, aboard which Jedi Grand Master Yoda awaits."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "\"The Clone Wars: Prelude\" is a seven-page webcomic in The Clone Wars webcomic series that ties into the television series of the same name. \"Prelude\" leads directly into \"Ambush,\" the first episode of The Clone Wars television series. The webcomic reveals why Rugosa was chosen for the negotiations between the Republic and Toydaria, which was later shown in the episode, and why Yoda was chosen as the diplomatic envoy. In \"Ambush\", Yoda and his clone bodyguards are attacked by Ventress and a large droid army after the Confederates, using Skytop Station, are able to intercept the holographic message between Palpatine and Katuunko shown in \"Prelude\"."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "Posted on StarWars.com on October 2, 2008, \"Prelude\" was written by Pablo Hidalgo, drawn and colored by Thomas Hodges, and lettered by Grant Gould. Special thanks were also given to Leland Chee, the keeper of the Holocron continuity database; Sue Rostoni, the executive editor at Lucas Licensing; and Dave Filoni, the supervising director of The Clone Wars TV series. \"Prelude\" shares its cover with Shakedown, the second installment in The Clone Wars webcomic series. According to the 2010 Star Wars Annual 2011, \"Prelude\", along with the rest of certain The Clone Wars events, takes place in the year 21 BBY."}, {"tag": "p", "text": "\"Ambush\" was not supposed to be aired as the first episode until very close to the series premiere, so when it was moved, artist Tom Hodges, who was scheduled to do the accompanying webcomic, was already working on Shakedown as well. Although it involved significant stress, he managed to complete both comics just in time for the premiere."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the webcomic, the women seen serving drinks to the clone troopers in the background of the Republic Service Organization center were later retconned as members of the Republic Service Organization, which was inspired by the real-world Imperial Service Organization, a social network of volunteers who pledge to support charity organizations such as the 501st Legion in their endeavors."}, {"tag": "p", "text": "A number of characters who do not appear in \"Prelude\" are shown on the comic's cover. Among these characters are Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, Padawan Ahsoka Tano, Commander CC-2224, and Captain CT-7567."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "p", "text": ""}]}