{"url": "The_Clone_Wars:_Procedure", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Procedure"}, {"tag": "p", "text": "The Clone Wars: Procedure is a six-page webcomic in the Star Wars: The Clone Wars webcomic series posted on StarWars.com on October 6, 2008. It leads directly into the Star Wars: The Clone Wars television series episode \"Shadow of Malevolence.\" The comic was based on an idea by Henry Gilroy, written by Pablo Hidalgo, and illustrated and lettered by Grant Gould, with cover art drawn by Steven D. Anderson. Procedure details how Jedi Knight Anakin Skywalker obtained several new BTL-B Y-wing starfighters to combat the Separatists' new weapon, the Subjugator-class heavy cruiser Malevolence."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Jedi Knight Anakin Skywalker speaks to Supreme Chancellor Palpatine and Senator Ask Aak via hologram, asking them whether or not he can use the new Y-wing starfighters against the Confederacy's new weapon, the Subjugator-class heavy cruiser Malevolence. Senator Aak tells him that the Y-wings require field-testing for at least another three weeks and are therefore not ready yet. The Jedi offers to field-test the starfighters himself, but Ask Aak still refuses. Skywalker expresses his disappointment and cuts off communications, and after talking things over with his Padawan, Ahsoka Tano, he decides that he will obtain the starfighters himself. Skywalker, his personal astromech droid R2-D2, Tano, and Shadow Squadron take off in the Twilight, Skywalker's personal G9 Rigger freighter. The group goes to the Bormus testing facility, where the Y-wings are still stationed, orbiting the planet of Bormus."}, {"tag": "p", "text": "When Skywalker's group reaches the facility, Anakin speaks to a Gran working at the facility while Matchstick and Broadside—pilots from Shadow Squadron—secure fighters. At first, the clone troopers guarding the Y-wings don't allow the pilots near the ships since they don't have the proper authorization. However, Broadside and Matchstick argue, since they have a Jedi with them that outranks the guards. Meanwhile, R2-D2 gives the worker falsified documents saying that Skywalker is permitted to take the fighters. The Gran, though, refuses the Jedi's request, saying it violates procedure. However, when Skywalker and Tano threaten to tell the Supreme Chancellor about how the Gran delayed their efforts, the worker allows the Jedi to take the fighters. A few minutes later, Skywalker and Shadow Squadron take off in the new Y-wings, with Skywalker commenting on his intention to improve the fighters."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "The Clone Wars: Procedure is a six-page webcomic in the Star Wars: The Clone Wars webcomic series, which ties into the television series of the same name. Procedure leads directly into \"Shadow of Malevolence\", an episode in the first season of The Clone Wars television series. The comic shows how Anakin Skywalker acquired the Y-wing starfighters for his upcoming assault on the Malevolence, which was featured in the episode. According to The Essential Reader's Companion, Procedure, along with the rest of the events of the television series' first season, takes place in the year 22 BBY."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "The comic was posted on StarWars.com on October 6, 2008, and based on an idea by Henry Gilroy, written by Pablo Hidalgo, illustrated and lettered by Grant Gould, with cover art drawn by Steven D. Anderson. Special thanks were also given to Leland Chee, the keeper of the Holocron continuity database; Sue Rostoni, the executive editor at Lucas Licensing; and Dave Filoni, the supervising director of The Clone Wars TV series. Hidalgo has stated that he intended the Gran working in the Bormus facility to suggest that Senator Ask Aak was putting his friends into places of influence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "p", "text": ""}]}