{"url": "Battle_of_Korriban_(Disciples_of_Ragnos_crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Disciples of Ragnos campaign", "Category:Battles of Korriban", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Korriban  (Disciples of Ragnos crisis)"}, {"tag": "p", "text": "The Battle of Korriban was a large-scale conflict in 14 ABY, during the Disciples of Ragnos crisis. On Korriban, the Disciples had gathered to resurrect a dead Sith Lord, Marka Ragnos, while the New Republic sent Jedi to intercept the cultists, resulting in a huge battle primarily between Force users."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Prior to the battle, Luke Skywalker gathered all the available Jedi in the Grand Audience Chamber of the Massassi Temple to inform them that he discovered the Disciples of Ragnos' plan of absorbing residual Force energy from places and objects using the Scepter of Ragnos. The Disciples then headed to Korriban, to deliver the last part of their plan: the resurrection of Marka Ragnos."}, {"tag": "p", "text": "While the Jedi were mobilizing to intercept the cult on Korriban, Kyle Katarn received a distress signal from Taspir III from Rosh Penin, his fallen apprentice. Kyle and his other apprentice Jaden Korr decided to rescue Rosh on the Imperial-controlled planet."}, {"tag": "p", "text": "Korr and Katarn then infiltrated a large Imperial facility, the source of Penin's transmissions. Eventually, the two of them split up, so Korr was able to find his friend before Katarn. Upon seeing Penin unharmed, Korr was angered it could be a trap, and nearly killed him with his lightsaber, but Katarn's warnings made Korr spare his friend and let go of his anger."}, {"tag": "p", "text": "The Twi'lek Alora, who was present and apparently expecting to use Penin as bait to lure Korr to the dark side, suddenly attacked Penin, amputating his left arm. Alora and Korr then engaged in a fierce lightsaber duel that culminated in the death of Alora at Korr's hands."}, {"tag": "p", "text": "After the duel, Korr headed to Korriban, while Katarn took Penin back to the Praxeum to take care of his wounds. With the realization that the Disciples of Ragnos were close to completing their insidious plan, the Jedi began to mobilize for an assault on Korriban."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Korr arrived shortly after the main Jedi battle group with the Far Wanderer, and rendezvoused with a friend and another student. The three entered a ruined Sith temple, finding Sith Cultists and New Reborn battling Jedi on the way, and aided in the fight. With the help of his companions, Korr slew many of the cultists and progressed further into the temple."}, {"tag": "p", "text": "Korr then found himself in a large room, where he pushed four statues into place, opening the way for a descending stairway."}, {"tag": "p", "text": "He battled several cultists in his path while he raced towards the Valley of the Dark Lords. As he progressed, they met up with more Jedi, who helped Korr reach the open Valley."}, {"tag": "p", "text": "After managing to open a locked door, Korr saw the Valley from above, where light and dark Force users were fighting each other in great numbers across the tombs. By this stage, the cultists had a numerical advantage over their opponents, and many of the Jedi had succumbed to the cultists' furious attacks. However, the Imperials and cultists had not reckoned on the resolve of Korr, who at this point was irresistible as he carved a path through the valley, killing most of the Imperial and Cultist forces as he went."}, {"tag": "h3", "text": "Duel in Ragnos' tomb"}, {"tag": "p", "text": "Korr reached the entrance to the Ragnos' and found Tavion Axmis, who was in the process of resurrecting the Sith Lord. The two of them engaged in a fierce lightsaber duel, with Korr eventually gaining the upper hand and forcing Axmis to take more drastic measures."}, {"tag": "p", "text": "Refusing to cower like she did before Katarn on Cloud City, Axmis used the scepter to resurrect Ragnos. Ragnos' spirit possessed the Dark Jedi, and he had her draw an ancient Sith sword from the scepter to engage Korr. The young Jedi held firm and eventually managed to disarm the Ragnos-possessed Axmis from the scepter and stop the possessed Jedi from retaining it. Then he destroyed it, forcing Ragnos' spirit back into Chaos. When the Sith Lord left Axmis' body, she collapsed dead on the floor of the tomb, her body unable to withstand the corruption."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Korr sealed the entrance to Ragnos' tomb. Exiting the tomb, he met up with Skywalker and Katarn who had just arrived. The two Jedi Masters congratulated Korr on his successful mission. ."}, {"tag": "p", "text": "Shortly after, three New Republic MC80 Liberty type Star Cruisers arrived at the planet and destroyed the Imperial Star Destroyer that was providing support for the Dark Jedi and stormtroopers on the planet's surface, ending the battle, and annihilating the Disciples of Ragnos cult."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars: Jedi Knight: Jedi Academy game where the battle is featured, if the player kills the Cultists and Reborn quickly, the remaining Jedi will follow and assist the player in future fights."}, {"tag": "p", "text": "In the non-canonical dark side path, the Battle of Korriban becomes a three-way struggle between the Disciples of Ragnos, the New Jedi Order, and Jaden Korr. Korr battles both Jedi and their enemies, often interrupting their duels with each other, as his objective is to take the Scepter of Ragnos for himself instead of resurrecting Marka Ragnos. Upon reaching Ragnos' tomb, Jaden first defeats and kills Tavion and then attempts to kill his own master, Kyle Katarn. Jaden barely defeats his former master in a lightsaber duel and collapses the ceiling on him, though Katarn manages to survive. Jaden leaves with the Scepter and takes control of the Imperial II-class Star Destroyer that was in orbit around the planet."}, {"tag": "p", "text": "There is a glitch during the player's fight with Tavion when the player chooses the dark side ending: if the player enters the room with Tavion with a rocket launcher, and then fights Tavion with his or her lightsaber, the rocket launcher becomes the player's lightsaber hilt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}