{"url": "Battle_of_Korriban_(Post%E2%80%93Great_Hyperspace_War_counterinvasion)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Korriban"], "nodes": [{"tag": "h1", "text": "Battle of Korriban  (Post–Great Hyperspace War counterinvasion)"}, {"tag": "p", "text": "During the Republic counterinvasion of the Sith Worlds that followed the Great Hyperspace War, a battle occurred in the vicinity of Korriban that saw the temporary expulsion of the Republic Military from the greater Horuset system by the forces of acting Dark Lord Shar Dakhan."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Sith Empire's defeat in the Great Hyperspace War, Galactic Republic Supreme Chancellor Pultimo authorized a joint Jedi-Republic counterinvasion of the Stygian Caldera aimed at eradicating any vestigial threat posed to the safety of the Republic and freeing the Sith species from the dark side corruption under which it had languished for millennia."}, {"tag": "p", "text": "Sometime after the invasion's start, surviving Sith forces under acting Dark Lord Shar Dakhan engaged in suicide attacks on occupying Republic forces in the vicinity of the Sith homeworld of Korriban. Though costly, such attacks were temporarily successful in expelling the Republic Military from the greater Horuset system. In the brief lull that followed, Sith survivors began crawling out of the shattered tombs and ruined cities in which they had previously taken refuge."}, {"tag": "p", "text": "During this time, a reclusive Sith Lord named Vitiate appeared in their midst, gathering the remaining eight thousand Sith Lords and returning to his fief world of Nathema to undertake a ritual of Sith magic he claimed would bring about an end to the Republic invasion. In the aftermath of the Ritual of Nathema, Vitiate once again appeared on Korriban, gathering the youngest generation of Sith still in residence on the planet and departing aboard an exile fleet on a Sith exodus to Dromund Kaas. The Republic eventually returned to the Horuset system sometime after the fleet's departure, reestablishing control over Korriban prior to the counterinvasion's conclusion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This particular battle of Korriban was first mentioned in passing on page 128 of the The Essential Atlas as a suicide attack occurring sometime after the start Pultimo's counterinvasion of the Sith Empire. Star Wars: The Old Republic alludes to this attack in Codex Entry 30 titled \"Rise of the Sith Emperor,\" in which Vitiate makes the first of two appearances on Korriban during the Republic's temporary retreat from the Horuset system."}, {"tag": "p", "text": "There exists some discrepancy in the dating of this event. The Essential Atlas seemingly places it immediately after the second battle of Korriban towards the start of the counterinvasion. Codex Entry 30 seems to follow the progression of events established by The Old Republic: Revan, placing the battle late in the counterinvasion's final days after famine, disease, and internal conflict have already whittled down the Sith population. This could potentially be explained by the fact that the Atlas was published several years before the events following the Great Hyperspace War were established and solidified by ancillary The Old Republic material."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}