{"url": "The_Clone_Wars:_Bait", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Bait"}, {"tag": "p", "text": "\"The Clone Wars: Bait\" is a six-page webcomic and the eleventh installment in the Star Wars: The Clone Wars webcomic series. Its story takes place prior to the Star Wars: The Clone Wars television series episode \"Dooku Captured\". Posted on StarWars.com January 2, 2009, \"Bait\" was written by Pablo Hidalgo and illustrated and lettered by Grant Gould. \"Bait\" shows how Jedi Knight Anakin Skywalker was captured while attempting to board a Separatist frigate. This set up Jedi Master Obi-Wan Kenobi's rescue of Skywalker, shown in \"Dooku Captured\"."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Aboard the Twilght, his personal freighter, Jedi Knight Anakin Skywalker is working on his Delta-7B starfighter with the assistance of his astromech droid, R2-D2. While altering the appearance of his starfighter to make it appear heavily damaged, Skywalker notes to R2-D2 that the fighter's fake battle scars must look very realistic. Skywalker's former Master, Obi-Wan Kenobi, congratulates Skywalker on his work, while Skywalker's apprentice, Ahsoka Tano, states that the Twilight is approaching their destination, an ice field. Although Tano is skeptical of their plan, Skywalker believes that the Confederate battle droids are so gullible that they will be tricked by anything. With his starfighter now appearing disabled, Skywalker boards it, and the Twilight releases both the fighter and a broken hyperspace docking ring into the ice field."}, {"tag": "p", "text": "Nearby, on a Confederate Munificent-class frigate, a B1-Series battle droid informs the ship's droid captain that they have found the remains of a Jedi starfighter with a single life-sign aboard. The Captain orders his subordinates to bring the ship aboard—which was Skywalker's plan all along—but also to have a security detachment ready. In the frigate's hangar, Skywalker's fighter is brought in, with several armed battle droids ordering the Jedi to come out. Skywalker jumps out of the fighter, attacking and destroying several droids with his lightsaber. However, a B2 super battle droid manages to disarm the Jedi by shooting Skywalker's lightsaber out of his hand. Defenseless, Skywalker surrenders, and the droids inform him that they are elite units, for Skywalker is aboard the personal frigate of Count Dooku, the leader of the Separatist movement."}, {"tag": "p", "text": "Meanwhile, on the Twilight, it is revealed that Skywalker took a fraudulent lightsaber with him, as Kenobi picks up Skywalker's real lightsaber. Kenobi orders Tano to take the freighter back to the Republic fleet, as Kenobi dons a spacesuit and prepares to leave the Twilight in order to rescue Skywalker."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "\"The Clone Wars: Bait\" is a six-page webcomic in the Star Wars: The Clone Wars webcomic series, which ties into the television series of the same name. \"Bait\" leads directly into \"Dooku Captured\", an episode in the first season of The Clone Wars series, which aired on January 2, 2009. The comic reveals how Anakin Skywalker got himself captured while trying to board Count Dooku's frigate, and how Obi-Wan Kenobi prepared to rescue him, which would later be shown in \"Dooku Captured\". According to the 2010 Star Wars Annual 2011, \"Bait\", along with the rest of The Clone Wars events, takes place sometime around the year 21 BBY."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "Posted on StarWars.com on January 2, 2009, \"Bait\" was written by Pablo Hidalgo and illustrated and lettered by Grant Gould. Special thanks were also given to Leland Chee, the keeper of the Holocron continuity database; Sue Rostoni, the executive editor at Lucas Licensing; and Dave Filoni, the supervising director of The Clone Wars TV series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Further reading"}, {"tag": "p", "text": ""}]}