{"url": "The_Clone_Wars:_Cold_Snap", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Cold Snap"}, {"tag": "p", "text": "\"The Clone Wars: Cold Snap\" is a six-page webcomic in the Star Wars: The Clone Wars webcomic series, posted on StarWars.com on January 29, 2009. \"Cold Snap\" leads directly into \"Trespass\", an episode in the Star Wars: The Clone Wars television series. The comic was written by Pablo Hidalgo, illustrated and colored by Jeffery Carlisle, and lettered by Grant Gould. It tells the story of a clone cold assault trooper nicknamed \"Shiv\" writing a letter to a fellow trooper, Flanker, telling him about the problems he is facing while stationed at Glid Station on the ice planet of Orto Plutonia, including the dangerous and mysterious creatures the clones call the \"ice men.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A clone cold assault trooper nicknamed \"Shiv\" serving in the Grand Army of the Republic is writing a letter on a datapad to Flanker, a fellow clone trooper and hatchmate of his, telling him about being stationed at the Glid Station outpost on the ice world Orto Plutonia. Shiv jokes about how he and Flanker always thought that due to all the desert training they received, the two of them would be stationed on a water world, but, instead, Shiv is now on Orto Plutonia, which he believes is even colder than space. Shiv tells Flanker that his squad has been tasked with testing an assortment of subzero gear, and that not all of it works. Also, the clones' food rations were not shipped in insulated canisters, and the low temperature is freezing them solid. Now, the clones have to boil their food, taking away what little flavor the rations had to start with. Shiv mentions to Flanker that his squad has not come across any Confederate battle droids, but has stayed in fighting shape by building snowmen and using them as target practice."}, {"tag": "p", "text": "Shiv goes on to write that things got a lot worse when his squad started to encounter a very dangerous and mysterious species that they nicknamed the \"ice men.\" He says that all of the station's patrols who have apparently seen the \"ice men\" were killed. Shiv tells Flanker that things are not going well for him right now and reveals that he is on patrol with his commander, Mag. Mag and Shiv's CK-6 swoop bikes have frozen up, leaving the two stranded until dawn, when Glid Station can send out a gunship to pick them up. The two have built a small camp and set up a tent, and while Shiv is finishing up his letter in the tent, Mag walks in, wondering why Shiv is not resting for when it is his turn to take guard duty. Curious, Mag takes the datapad from Shiv's hands and, after looking it through, asks who Flanker is. Reluctantly, Shiv tells Mag that Flanker died during the Battle of Christophsis. As soon as Shiv says this, the \"ice men\" attack their camp, ripping open the clones' tent and killing Mag. As Shiv reaches for a blaster pistol, the \"ice men\" kill him as well, leaving the now-destroyed camp—along with Shiv's letter—to be covered up by the snow."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "\"The Clone Wars: Cold Snap\" is a six-page webcomic in the Star Wars: The Clone Wars webcomic series that ties into the television series of the same name. \"Cold Snap\" leads directly into \"Trespass\", an episode in the first season of The Clone Wars television series. The comic establishes the \"ice men\" and their attacks on Glid Station, both of which were further elaborated upon in \"Trespass\". The episode reveals that the \"ice men\" were actually a peaceful tribe of Talz who had been attacked by the Separatist battle droids stationed on Orto Plutonia, and in the resulting conflict, the Republic base had been caught in the middle. \"Cold Snap\"—along with the rest of The Clone Wars events—takes place in 22 BBY."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "The comic was posted on StarWars.com on January 29, 2009, and was written by Pablo Hidalgo, drawn and colored by Jeffery Carlisle, and lettered by Grant Gould. Special thanks were also given to Leland Chee, the keeper of the Holocron continuity database; Sue Rostoni, the executive editor at Lucas Licensing; and Dave Filoni, the supervising director of The Clone Wars TV series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}