{"url": "The_Clone_Wars:_Secret_Missions_2:_Curse_of_the_Black_Hole_Pirates", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:The Clone Wars: Secret Missions"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Secret Missions 2: Curse of the Black Hole Pirates"}, {"tag": "p", "text": "The Clone Wars: Secret Missions 2: Curse of the Black Hole Pirates is a Star Wars Legends junior novel written by Ryder Windham. It is the second volume of the Star Wars: The Clone Wars: Secret Missions series, following The Clone Wars: Secret Missions 1: Breakout Squad (2009) and preceding The Clone Wars: Secret Missions 3: Duel at Shattered Rock (2011). It was first published by Grosset & Dunlap on July 22, 2010."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Jedi Padawan Nuru Kungurama and the clone troopers of Breakout Squad—Breaker, Knuckles, Sharp, and Chatterbox—are sent on a diplomatic mission to the Unknown Regions by Chancellor Palpatine. Traveling with renegade cargo pilot Lalo Gunn in the Hasty Harpy, the young Jedi and his clone escorts are in for an unexpected surprise as they encounter the infamous Black Hole Pirates."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Cad Bane meets Asajj Ventress on Bogg 5, a moon in Bogden system. Ventress goes to Dooku's lair with Jedi Master Ring-Sol Ambase and another pod. On board the Hasty Harpy after a six day trip, Breakout Squad finally arrives in Chiss space, finding no planet, but rather a space station. Nuru meets the Chiss ambassador, but during their meeting, a Separatist fleet commanded by a Metalorn yacht attacks the station. Breakout Squad escapes and flees into hyperspace. Later, they unexpectedly come out of hyperspace near a black hole and are boarded by pirates calling themselves the Black Hole Pirates. After the pirates realize who they are, they say they are cursed by the black hole. They go to a moon the pirates call Plunder Moon. They find an old temple and use an Infinity Gate to jump back to Chiss space. When they get back to Chiss space, they defeat the Separatists and go their separate ways. Nuru is revealed to be Kung'urama'nuruodo of the Second Ruling Family. Later, in Dooku's lair, Ring-Sol Ambase wakes up."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}