{"url": "The_Clone_Wars:_Covetous", "categories": ["Category:Real-world articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Covetous"}, {"tag": "p", "text": "The Clone Wars: Covetous is a six-page webcomic in the Star Wars: The Clone Wars webcomic series leading directly into the Star Wars: The Clone Wars episode \"Storm Over Ryloth.\" The comic was posted on StarWars.com on February 26, 2009, written by Pablo Hidalgo, and both illustrated and lettered by Grant Gould. Covetous depicts the prologue to the Battle of Ryloth, seen in \"Storm Over Ryloth\". Separatist Council Member Passel Argente is visiting the city of Lessu on planet Ryloth, where he brings spoils to the Twi'lek broker Artruk to secure for him. Unbeknownst to Argente, however, he is being spied upon by fellow council member Wat Tambor, who decides to pillage the treasures by invading Ryloth."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the Twi'lek homeworld of Ryloth, Magistrate and Separatist Council Member Passel Argente is welcomed to Lessu, known as the \"city of riches,\" by the corpulent Twi'lek Artruk. The impatient Magistrate asks Artruk to secure the items that his droids are carrying, and Artruk complies. Unbeknownst to the group, however, is that they are being spied upon by a pair of Twi'leks. One of the spies, a pale-skinned Twi'lek named Voyla says that the items Argente is bringing will make a desirable plus to their war chest. However, his comrade, Cham Syndulla, tells him to speak more quietly and stay hidden. Voyla believes that Artruk will not notice them while he is occupied by the treasures marched before him. He thinks that the Magistrate is yet another greedy outlander who has come to steal the treasures of Ryloth and wants to \"teach him a lesson,\" but the other Syndulla notes that Argente is bringing items to Lessu, not taking from it. Suddenly, Syndulla notice that Argente is flanked by two B2 super battle droids."}, {"tag": "p", "text": "The loading of the Magistrate's items is nearly complete, and Artruk congratulates Argente for a very profitable month. He assumes that the treasures are from the planet of Christophsis. Argente, angrily, orders him not to use their real titles, as he wants the items to remain anonymous. Artruk assures that he is merely displaying respect, but the Magistrate tells that he is not paying to the Twi'Lek for his respect, but to erase Argente's connections to the items. Meanwhile, Syndulla informs Voyla that the outlander's droids are undoubtedly Confederate battle droids. Voyla asks if the war is arriving on Ryloth, which Syndulla replies that they should prepare for that, as they cannot rely on the Republic on Coruscant to take notice what happens on Ryloth. Voyla humorously admits it, as it would \"interrupt their dear senator's dinner hour.\" At the same time, Argente and Artruk are revealed to be secretly spied by yet an another side; the Magistrate's RA-7 protocol droid has been transmitting everything that the Magistrate has done on Ryloth to Techno Union Foreman and fellow Council Member, Emir Wat Tambor, and his tactical droid. Upon noticing Argente's treasures, Tambor asks his droid if Ryloth is one of their targeted worlds, which the droid replies that it is ranked as number seventy-nine. Tambor orders the droid to mobilize their troops, as they are moving Ryloth as number one target."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Clone Wars: Covetous is a six-page webcomic and the eighteenth issue in The Clone Wars webcomic series, which ties into the television series of the same name. The events of Covetous chronologically occurs before \"Storm Over Ryloth\", the nineteenth episode in first season of the television series."}, {"tag": "p", "text": "Covetous serves as a prologue to The Clone Wars Ryloth trilogy, and shows why Wat Tambor decides to invade Ryloth. It also marked the debuts of Cham Syndulla and TA-175, though both of them appeared unnamed in the web comic. Covetous has ties to the earlier web comic Discount, when it was revealed Passel Argente's RA-7 protocol droid was secretly a spy for Wat Tambor."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "Covetous was posted on StarWars.com on February 26, 2009. The comic was written by Pablo Hidalgo, and was both illustrated and lettered by Grant Gould. Special thanks were also given to Sue Rostoni, Leland Chee and Dave Filoni."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}