{"url": "The_Clone_Wars:_Invitation_Only", "categories": ["Category:Real-world articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Invitation Only"}, {"tag": "p", "text": "The Clone Wars: Invitation Only is a short webcomic leading directly into the Star Wars: The Clone Wars episode \"Hostage Crisis.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The main character is a bounty hunter, and is searching for Cad Bane. The bounty hunter comes upon a droid who explains to him that Bane can be found down the stone path to the side of the droid. The bounty hunter attempts to give the droid a tip, to which the droid replies, \"I'm a techno-service droid, not a safe deposit box.\" The bounty hunter then continues down the path.\nThe bounty hunter comes into the room where he believes Bane was. Hand on his pistol trigger, the bounty hunter taunts Bane. Then, he pulls out his blaster and fires a shot. The shots hit Bane in the chest. But as the bounty hunter looks closer, he notices that Bane was a dummy, with explosives attached to him. Behind him, a member of Cad Bane's posse presses a detonator, which explodes the bombs. The bounty hunter escapes on a jetpack, but as he flies higher and higher, another member of the posse shoots a net which captures the bounty hunter and sends him hurdling to the ground. The posse member nears the net, but the bounty hunter cuts his way out and throws a handful of flash-bang grenades. The posse member flinches, and the bounty hunter escapes. But as he runs, another posse member snipes the bounty hunter's legs out from under him. As he falls, the posse members near. Then Cad Bane enters the area, and while talking to him, reveals that the bounty hunter was named Davtokk. As Cad says that the event before was a test, Davtokk thinks it was a test for him. But it was not for him, but for Bane's posse. Bane then killed Davtokk, leaving him for the scavengers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}