{"url": "The_Clone_Wars:_The_Fall_of_Falleen", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: The Fall of Falleen"}, {"tag": "p", "text": "\"The Clone Wars: The Fall of Falleen\" is a seven-page webcomic in the Star Wars: The Clone Wars webcomic series that takes place prior to the Star Wars: The Clone Wars television series episode \"Downfall of a Droid\". Posted on StarWars.com on November 7, 2008, the comic was written by Pablo Hidalgo, illustrated by Thomas Hodges, and lettered by Grant Gould. \"The Fall of Falleen\" depicts the actions of Asajj Ventress and Count Dooku during the final act of a battle on the planet of Falleen."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Separatist forces are occupying the planet of Falleen. C-9979 landing craft are deploying ground troops, protected by Hyena-class droid bombers. A battle droid reports to General Grievous, Supreme Commander of the Droid Armies, that a city has fallen, except for one shielded fortress. Grievous orders the droid to continue landing the troops, mentioning that the shield is being taken care of."}, {"tag": "p", "text": "Dark Acolyte Asajj Ventress, having infiltrated the fortress, is spotted by a TT-8L gatekeeper droid. On a viewscreen, the King of Falleen notices her approach and sends his electrostaff-wielding Dashade bodyguards to deal with her. However, the electrostaffs are no match for Ventress, who is armed with lightsabers. She kills two of the bodyguards before using the Force to destroy the gatekeeper droids as well. No longer able to watch the duel, the king arms himself with a blaster and a thermal detonator and leaves his command center to confront the assassin personally. As Ventress kills the last Dashade, the king prepares to shoot her with a blaster pistol, but he is instead ambushed by none other than Count Dooku himself. Dooku had used Ventress as a ruse to lure the king out of his secure command center, while the elimination of the gatekeeper droids left the king oblivious of a second intruder within the fortress. Dooku orders the king to lower the fortress's shields and to submit the planet to the Separatists' cause."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "\"The Clone Wars: The Fall of Falleen\" is a seven-page webcomic in the Star Wars: The Clone Wars webcomic series, which ties into the television series of the same name. Chronologically, \"The Fall of Falleen\" takes place prior to \"Downfall of a Droid\", the sixth episode in the first season of the television series. The comic was posted on StarWars.com on November 7, 2008, and was written by Pablo Hidalgo, illustrated by Thomas Hodges, and lettered by Grant Gould. \"The Fall of Falleen\" depicts a battle on Falleen, which would be mentioned in both \"Downfall of a Droid\" and the novel The Clone Wars: Wild Space, written by Karen Miller. It was also the first appearance of the Hyena-class droid bomber, which would later appear in the television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}