{"url": "The_Clone_Wars:_The_Dreams_of_General_Grievous", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: The Dreams of General Grievous"}, {"tag": "p", "text": "\"The Clone Wars: The Dreams of General Grievous\" is a six-page webcomic in the Star Wars: The Clone Wars webcomic series that takes place prior to the Star Wars: The Clone Wars television series episode \"Lair of Grievous\". Posted on StarWars.com on December 10, 2008, it was written by Pablo Hidalgo and illustrated and lettered by Katie Cook, Grant Gould, Thomas Hodges, and Jeffery Carlisle. \"The Dreams of General Grievous\" shows the cyborg General Grievous thinking about his past as a Kaleesh warrior as he travels to his castle on the third moon of Vassek. However, a B1-Series battle droid breaks up his thoughts to reveal that Count Dooku is trying to contact him."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "During a time of war, a Kaleesh warrior holds a skull of a member of his own species. The warrior reveals that he has toppled nations, slain legends, and killed kings, and those who had heard of him were fearful of him. However, he says that these are all fading dreams of the past. He now feels failure and can only find his old vigor when he is at war. But the soldiers he now commands aren't the same warriors he led in the past. These troops that now serve under the once proud Kaleesh warrior's command aren't the ones from his dreams."}, {"tag": "p", "text": "The dreaming Kaleesh warrior is revealed to be the Confederate General Grievous. While he continues to dream in his personal starfighter, the Soulless One, a B1-Series battle droid interrupts his thoughts to tell him that Count Dooku is trying to make contact with him. However, Grievous ignores the droid and continues onward to his castle on the third moon of Vassek."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "\"The Clone Wars: The Dreams of General Grievous\" is a six-page webcomic and the tenth issue in the Star Wars: The Clone Wars webcomic series, which ties into the television series of the same name. \"The Dreams of General Grievous\" leads directly into \"Lair of Grievous\", an episode in the first season of The Clone Wars television series that aired on December 10, 2008. In the comic, the droid alerts Grievous that Count Dooku is trying to make contact with him, which will set up how Dooku began talking to Grievous via hologram prior to the cyborg general's arrival on the third moon of Vassek in \"Lair of Grievous\"."}, {"tag": "p", "text": "The comic was illustrated and lettered by Katie Cook, Grant Gould, Thomas Hodges, and Jeffery Carlisle, and written by Pablo Hidalgo. Special thanks were also given to Leland Chee, Sue Rostoni, and Dave Filoni. \"The Dreams of General Grievous\" was posted on StarWars.com on December 10, 2008."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}