{"url": "Battle_of_Kr", "categories": ["Category:Legends articles", "Category:Battles in the Unknown Regions", "Category:Battles of the Dark Nest Crisis"], "nodes": [{"tag": "h1", "text": "Battle of Kr"}, {"tag": "p", "text": "The Battle of Kr was a battle which took place on Kr during the Dark Nest Crisis in 35 ABY between the New Jedi Order and the Dark Nest."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the study by Jedi Master Healer Cilghal, the Jedi concluded that Gorog, the \"Dark Nest\", was a secret nest within the Killik colony, commanded by Nightsister Lomi Plo and Dark Jedi Welk. The Gorog was determined to machinate a reason for war against the Chiss Ascendancy by manipulating UnuThul and the Unu hive with the Force. The Jedi planned to root out and eliminate the Dark Nest so that the crisis between the Chiss and the Killiks could be peacefully resolved. Gorog Joiner, former Jedi Knight Alema Rar, was allowed to flee the Jedi Academy on Ossus with a captured Gorog assassin, with the Jedi task force following closely behind."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Alema Rar and Gorog fled to Kr, the moon of the planet Qoribu, which held the Taat nest. Jedi Masters Luke and Mara Jade Skywalker followed close behind in StealthX starfighters. The Skywalkers encounter heavy dartship resistance and were forced to land. There, Luke and Mara stormed into the Gorog nest, and were ambushed by a relentless outpouring of Gorog warriors, having to fight their way deeper and deeper into the nest."}, {"tag": "p", "text": "Meanwhile, the Millennium Falcon arrived at Qoribu but was detected by the fleets of the Chiss Ascendancy and the Hapes Consortium. Commander Jagged Fel of the Chiss and Dukat Aleson Gray of Hapes refused to believe Leia Organa Solo's claim that the Jedi could end the crisis. As the Hapes fleet moved to advance position to supposedly help the Jedi on Kr, the Chiss maneuvered as well and so started the Battle of Qoribu. The Falcon was temporarily caught in the crossfire from both sides until C-3PO declared their neutrality in the conflict."}, {"tag": "p", "text": "The Falcon blasted through a swarm of dartships with its repulsor beam and landed on Kr, deploying the Solo couple, Jedi Masters Saba Sebatyne, Kyp Durron, Kyle Katarn and Octa Ramis, and four YVH 5 Bugcruncher war droids. The reinforcements fought their way against Gorog warriors to join forces with the Skywalker Masters."}, {"tag": "p", "text": "Battle intensified as Luke and Mara dueled with Alema Rar, Welk, and the Gorog assassin respectively. The Force darkened as the Skywalkers used Force Choke and Force lightning against their enemies. A mysterious attacker drew away the power cells of the Jedi lightsabers and blasters, and slowing down the motion of Luke. Although Luke was convinced that it was Lomi Plo, the Jedi could not find her. Sensing the path of the Jedi had gone wrong, Luke refused to use anymore dark side power and outwitted the Dark Jedi. The battle ended with Mara defeating the Gorog assassin, which was killed by Welk, who attempted to blow Mara away with the insect's explosion. Luke killed Welk and injured Alema, but the Twi'lek fled; Lomi Plo was nowhere to be found. Numerous Gorog warriors were killed in the battle, with the Jedi losing two Bugcrunchers."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Falcon, left in the landing site, was under enemy fire with the Noghri bodyguards Cakhmaim and Meewalh defending the ship. Jaina Solo and Zekk arrived and killed the attackers with their StealthXs, while Jae Juun and Tarfang attempted to hijack the Falcon. C-3PO issued an emergency call but was shut down. UnuThul moved his flagship to Kr as the battle of Qoribu stabilized and stopped the hijacking."}, {"tag": "p", "text": "Leia then showed UnuThul the Dark Nest, its captive room that killed Chiss captives to feed the Gorog, and the body of Welk. Leia proposed a compromise to the Colony and the Chiss, which was accepted by both sides and led to the signing of the Qoribu Truce."}, {"tag": "h2", "text": "Appearances"}]}