{"url": "The_Core_Problem", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "The Core Problem"}, {"tag": "p", "text": "\"The Core Problem\" is the seventeenth episode of Star Wars Resistance Season One. It first aired on February 17, 2019."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Poe and Kaz investigate a location in the Unknown Regions that might be central to the First Order's plot."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Contacting the Resistance"}, {"tag": "p", "text": "A flock of speagulls flies over the oceans of Castilon, followed by three First Order TIE fighters flying over the Colossus. Jarek Yeager sighs and frowns as he watches. He, R1-J5 (\"Bucket\") and BB-8 find Kazuda Xiono trying to send a message to the Resistance on a transmitter. Kaz's efforts are unsuccessful and he is almost electrocuted."}, {"tag": "p", "text": "Yeager tells Kaz that it is obvious that it is not going to work. BB-8 beeps, and Yeager states that the First Order's communications blanket is way too strong for that \"thing.\" BB-8 beeps a favorable message to Kaz, who thanks BB-8 for believing in his skill. Kaz tells Yeager to be prepared to be proven wrong and tries the transmitter again. However, the machine lets out a deafening noise."}, {"tag": "p", "text": "Kaz finally manages to establish a channel, and he can hear Poe Dameron's voice. Kaz thinks that he managed to fix the transmitter, only to realize that Poe is standing behind him. Poe asks Kaz how he is doing. Both BB-8 and Kaz are delighted to see Poe. After greeting BB-8, Poe asks Kaz if he had been using that \"ridiculous\" contraption to contact him. Kaz says yes just as the transmitter short-circuits, prompting him to deny it."}, {"tag": "h3", "text": "Poe's visit"}, {"tag": "p", "text": "Kaz asks Poe how he managed to get through the TIE fighters and stormtroopers patrolling the Colossus. Poe admits that getting in was the easy part just as a pair of TIE fighters fly past the open hangar door. He remarks that some things have changed since they last met. Kaz tells Poe that he has been trying to send his reports, but the First Order has blocked all communications. Poe reveals that checking in with Kaz was only half the reason he's here. He tells BB-8 that they have a big mission ahead of them, and asks if the droid is ready to come home with him."}, {"tag": "p", "text": "Kaz is shocked that Poe is taking back BB-8. Poe tells Kaz that he has received orders from General Leia Organa to leave for Jakku the following day. He says he needs BB-8 for this mission. When Kaz asks about his mission on the Colossus, Poe tells Kaz that CB-23 will help him out. Kaz tells Poe that he was right to send him here because the First Order is planning something, and the Colossus is only a small part of their plan. Poe says he's interested and asks Kaz what he's got."}, {"tag": "h3", "text": "The gathering storm"}, {"tag": "p", "text": "In Yeager's office, Kaz and Yeager show Poe the star map Kaz got from the First Order's memory rod. Kaz tells Poe that the First Order has been moving tons of fuel through the station. When Poe asks what they want the Colossus for, since it's not the biggest refueling station in the galaxy, Kaz replies that the First Order wants to prevent the Resistance from having the Colossus. He says that it's the last stop before the Unknown Regions and is crucial for any fleet needing to fuel up."}, {"tag": "p", "text": "Poe is bemused that the First Order has several fleets, but Yeager tells him that Kaz has some new intelligence for him. Kaz loads a memory rod into BB-8, who highlights a point on the map. Kaz tells Poe that something is happening in a certain Unknown Regions sector. Poe says that he is short on time, but that General Organa does not like surprises. He invites Kaz to travel to that sector to investigate. Kaz is excited, but asks how they will get off the Colossus without the First Order noticing."}, {"tag": "p", "text": "Poe tells Kaz that his plan is crazy, but it might work. Yeager sighs and says he hopes that Poe is not pulling a Widowmaker maneuver. Not understanding the term, Kaz quips that he is not even married and Yeager playfully slaps him behind the head. Poe warns that it will be dangerous."}, {"tag": "h3", "text": "Sneaking out of the Colossus"}, {"tag": "p", "text": "Later, Kaz and Poe lower the Fireball down the launching pad above a freighter. Poe tells Kaz that they are going to ride that freighter until the ship clears the First Order scanners. Kaz fires up the Fireball's thrusters while BB-8 watches in the astromech socket. Poe clings on to the Fireball's hull."}, {"tag": "p", "text": "Kaz lands the Fireball on top of the freighter. After three TIE fighters fly over them, Poe suggests painting the ship in a less conspicuous color, but Kaz counters that the Fireball is a racer rather than a combat craft. As the cargo ship rises into the skies, Poe tells Kaz that they will drop off at the precise moment. When Kaz asks why Poe isn't flying the Fireball, Poe counters that he knows this ship better than him, since, after all, Kaz is still the \"greatest pilot in the galaxy.\" Kaz sighs."}, {"tag": "p", "text": "After the freighter reaches the right altitude, Poe tells Kaz to retract the landing struts. Kaz complies and the Fireball starts to dive. However, Kaz has trouble restarting the engines, and Poe clings on to dear life. Kaz struggles to restart the engines and manages to do so before the ship plummets into the sea. Poe clings on to dear life as the Fireball flies back into the skies. They are joined by Poe's T-70 X-wing starfighter, which is piloted by CB-23."}, {"tag": "p", "text": "With Poe's T-70 flying below the Fireball, Poe manages to jump back into his starfighter's cockpit. Once aboard, Poe puts on his flight helmet and greets CB-23. As he starts the ship, Poe asks Kaz if he is ready for this. Kaz says he is, but he's not sure about the Fireball. BB-8 beeps that he will be looking after Kaz. Poe expresses agreement with BB-8. Kaz says Poe is right and let's do this. The two then fly their ships into space."}, {"tag": "h3", "text": "Scene of a calamity"}, {"tag": "p", "text": "Arriving at the coordinates, Poe's starfighter sensors begin beeping. He says there used to be a system here, but that there is no star. Poe asks CB-23 if she can confirm and the droid agrees. Poe remarks that somehow this system's sun has disappeared, while Kaz expresses shock. The two fly past two wrecked planetoids. Kaz asks what could have done that."}, {"tag": "p", "text": "Poe surmises that they are strangely intact. Kaz realizes that the planetoids have been \"cored out.\" He asks why the First Order would do that, and suggests they are after resources. Poe disagrees, pointing out that the First Order left the planetoids' cores behind."}, {"tag": "p", "text": "The two then approach the planet Najra-Va, which Kaz notices has had a hole drilled through its surface. Poe decides to investigate and the two fly through the hole in the planet. When Kaz asks why someone would do this, Poe tells him to be patient because that is what they are going to find out. BB-8 beeps as they fly through the hole."}, {"tag": "h3", "text": "Caught in a well"}, {"tag": "p", "text": "Just then, the scanner on Poe's X-wing begins beeping as they approach several floating debris. Poe tells Kaz that they are approaching a gravity well. He tells Kaz to fire up his thrusters, turn around, and get out of here. Kaz tries to boost his racer's thrusters but they don't respond. Poe says that it is too late and that they have been caught. He advises Kaz to try and ride it out."}, {"tag": "p", "text": "Kaz and Poe's ships are pulled through the gravity well. They fly their ships past several rocks and debris. Poe is able to control his ship, but Kaz is unable to control the Fireball. Poe advises Kaz not to fight it but to steer into the gravity well. Kaz asks if he is crazy, but Poe tells him to trust him. Kaz gets BB-8 to reroute all power to the stabilizers. BB-8 complies and the two fighters sail through the gravity well. The currents carry their ship and they fly out through the hole on the other side of Najra-Va."}, {"tag": "p", "text": "Kaz says that he can't believe they are alive. Just then, Kaz's computer picks up a signal. Kaz says that it is coming from a moon ahead and asks Poe if they should check it out. Poe says that it is a good idea and they had better investigate."}, {"tag": "h3", "text": "Investigating a transmission"}, {"tag": "p", "text": "They fly to the moon, which still has an atmosphere. Kaz spots a village ahead. Poe says the atmosphere is still breathable and that they should land and check it out. The two land their fighters in the middle of an abandoned village. Poe lands and walks out with his blaster. Kaz finds the moon cold with the disappearance of the system's sun. Something is watching Kaz and BB-8 through its visual sensor."}, {"tag": "p", "text": "Poe hands Kaz a blaster and tells him to be careful not to vaporize his foot. Kaz remarks that it is so cold here that he doesn't think he would feel it. Poe tells CB-23 to stay with the ships and to make sure they are ready in case they need to make a quick getaway. CB-23 and BB-8 beep at each other. BB-8 follows Kaz and Poe. Unknown to them, they are being watched by something."}, {"tag": "p", "text": "Kaz remarks that the village looks old and wonders who lived here. Poe replies they are gone now and hard to say how long ago. Kaz slips in the darkness and accidentally fires his blaster. Poe tells Kaz to be careful, but Kaz replies that exploring ruins would be easier in the daytime. Gazing at a large structure above, Kaz wonders what happened here. BB-8 beeps."}, {"tag": "p", "text": "The three of them are being followed by a spider probe droid which takes an interest in Poe. When Kaz asks what kind of place this is, Poe says that it looks like a temple of some kind. He says he sees structures like this scattered through the Outer Rim, which he describes as relics of a bygone era. Kaz notices there was blaster-fire and remarks that the whole place must have been under attack."}, {"tag": "p", "text": "Just then, Poe finds a child's tooka doll and remarks that whoever did this wiped out the villagers and that they wanted them eradicated. Poe hands Kaz the doll. As the probe droid circles them, Poe hears the droid's movements and says that he senses they are being watched. He tells Kaz to get ready because they might have some company. He tells Kaz to keep his blaster ready. Just then BB-8 beeps, and Kaz wonders what destroyed the villagers. Poe whistles to Kaz and Kaz responds that he is focused."}, {"tag": "h3", "text": "Skirmish with the probe droid"}, {"tag": "p", "text": "Poe tells Kaz to follow him. They navigate through several pieces of debris and encounter the First Order probe droid. The droid hovers over the Resistance pilots. Poe fires at the droid and tells Kaz to get down. The probe droid knocks Kaz down, and Poe fires his blaster at the droid. The probe droid dispatches several smaller remotes equipped with blasters, leading Poe to exclaim that it has \"kids.\""}, {"tag": "p", "text": "While Poe deals with the smaller remotes, he tells BB-8 to follow the \"mother\" and not let it get away. BB-8 fires his grappling hook at the probe droid. Kaz volunteers to help but is hit in the head when the probe droid drags BB-8 into the air. BB-8 manages to fire a grappling hook which anchors him to a pillar."}, {"tag": "p", "text": "Poe leads the remotes among the pillars and manages to shoot one. He tells BB-8 to hang in there, before shooting a second remote. Kaz tries to help BB-8 by firing at the probe droid, but his blaster bolts miss. He tells BB-8 to hold that droid still. Poe asks Kaz which droid he is shooting at. Kaz manages to shoot the probe droid's visual processor, causing it to crash to the ground. Kaz cheers while Poe takes out the last remaining probe droid."}, {"tag": "p", "text": "Poe comes to Kaz and compliments him by telling him that he knew that he would shoot the right one eventually. Kaz remarks that it took a little practice. As the three examine the probe droid, Kaz asks what the \"thing\" is and what it's doing here. Poe says he doesn't know, and says that he hasn't seen anything like this. Just then a TIE fighter circles ahead, and Kaz says that he is starting to think it was a First Order droid."}, {"tag": "h3", "text": "Escaping the First Order TIEs"}, {"tag": "p", "text": "Poe realizes that the probe must have sent a distress call just as more TIE fighters, including Major Elrik Vonreg's TIE Interceptor, arrive. Major Vonreg strafes the ground and the three are forced to take cover. BB-8 beeps that they are trouble and Kaz agrees. Poe tells CB-23 to ready their ships for takeoff. CB-23 flies Poe's X-wing and takes out a TIE fighter. Kaz cheers, but Poe tells him to move."}, {"tag": "p", "text": "Kaz climbs aboard the Fireball with BB-8 while Poe jumps into his X-wing and flies off. Aboard his X-wing, Poe thanks CB-23 for her good work. Before leaving, Kaz promises to swap BB-8 with Poe later. Poe and Kaz fly their ships into the sky. Poe tells Kaz they should fly into the core. Kaz is hesitant, but realizes that it will be a good way to lose their TIE pursuers."}, {"tag": "p", "text": "The two Resistance pilots fly their ships through Najra-Va's core. As they enter the gravity well, Kaz lets the current carry the Fireball. Major Vonreg and the other TIE pilots follow in their TIEs. One of the TIEs crashes into debris and explodes. Kaz cheers that this is working. As they travel deeper into the gravity well, CB-23 pivots her head to avoid debris while a second TIE is struck by debris and explodes."}, {"tag": "p", "text": "Poe decides to take the \"red dots\" down and flies back into the gravity well. He shoots down two more TIE fighters. Having lost his escorts, Major Vonreg turns around and flees. Kaz remarks that this should do the trick. The two fly through the hole and away from the planet."}, {"tag": "h3", "text": "Parting company"}, {"tag": "p", "text": "When they are a safe distance, Poe tells Kaz to pull around because they need to do a droid swap. Kaz is alarmed but recalls their earlier arrangement. BB-8 beeps. Kaz says this is it and that he could not have done it without BB-8. Kaz tells BB-8 he is going to miss him. BB-8 beeps sadly and Kaz promises to see him again."}, {"tag": "p", "text": "As the two fly their ships side by side, Poe tells Kaz on his mark and the two fighters tip their tops to face each other. Poe tells CB-23 that he will see her soon and asks her to look after Kaz. CB-23 beeps in affirmation and detaches herself from her socket. BB-8 does the same and the two fly through space, wave to each other, and swap sockets."}, {"tag": "p", "text": "Poe welcomes BB-8 back. Before leaving, he tells Kaz that he has to go on that mission for General Leia. He says he will have one heck of a report for her when he comes back. Kaz asks Poe how he will get back on the Colossus. Poe replies that CB-23 will tell him, as she knows how. Poe and Kaz bid each other farewell before jumping into hyperspace."}, {"tag": "h3", "text": "Homecoming"}, {"tag": "p", "text": "Back on Castilon, it is nightfall, and several TIE fighters fly above the Colossus. At Jarek Yeager's Repair Station, Tamara Ryvora is servicing a racer with Bucket, Neeku Vozo, and Jarek Yeager. Tam complains that both primary folds are out of sync on this \"bucket,\" which causes Bucket to take offense, and Tam apologizes that she was referring to the ship. Tam asks where Kaz is, and remarks that he is always curiously absent when work is to be found."}, {"tag": "p", "text": "Kaz soon appears with CB-23. Neeku asks Kaz where he has been. When Tam asks where the Fireball is, Kaz tells her that it is docked below and that he just took the ship out for a spin. Tam counters that the First Order has them on lockdown. Yeager takes Kaz aside and asks what he saw out there. Kaz tells Yeager that whatever he thought the First Order was capable of, it's much worse."}, {"tag": "p", "text": "When Tam asks who the new droid is, Kaz introduces CB-23 to the rest of Team Fireball. He tells them that she's with him. When Neeku asks what happened to BB-8, Kaz claims that he needed some minor repairs and that he took him to a repair shop on Takodana. Kaz adds that CB-23 is on loan till BB-8 comes back."}, {"tag": "p", "text": "Neeku remarks that he is going to miss his small round friend because they were bonding quite nicely. Kaz promises that BB-8 will be back and says he promised to show CB-23 around, saying \"See you guys later.\""}, {"tag": "h3", "text": "Kaz's double life"}, {"tag": "p", "text": "After Kaz has left, Tam asks Yeager what's going on, but Yeager replies that it is none of her concern. Tam complains that Kaz had been sneaking off with the Fireball and got a new droid. She resents being kept in the dark, but Yeager replies that there are certain things she won't understand. Tam retorts that it's because he won't let her."}, {"tag": "p", "text": "Kaz and CB-23 walk outside. While holding the tooka doll in his hand, Kaz says that whatever happened out there means they could be next. He thinks that they could be in deep trouble. Three TIE fighters fly ominously above."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In \"The Core Problem,\" before Poe Dameron travels to Jakku, he makes a detour to Castilon to pick up BB-8. This detour was first mentioned in the 2018 comic book Poe Dameron 26."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}