{"url": "The_Contessa", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Aliases, nicknames, and pseudonyms", "Category:Corona Squadron personnel", "Category:Females", "Category:Humans", "Category:Unidentified royalty"], "nodes": [{"tag": "h1", "text": "The Contessa"}, {"tag": "p", "text": "The Contessa was an alias used by a human female who served in the Alliance to Restore the Republic during the Galactic Civil War. Born to high-ranking nobility, her homeworld was annexed by the Galactic Empire and her family killed in the process. Joining the rebellion, she became a capable starfighter pilot, coordinating the fragmented alliance's starfighter defenses in the aftermath of the Battle of Hoth. As squadron leader of Corona Squadron, she commanded her squadron through several missions around the galaxy, culminating in Battle of Endor. Following the Empire's defeat at Endor and the apparent death of Emperor Palpatine, the Contessa left the Rebel Alliance with the intention of contesting the presidency on her homeworld."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The human female who would eventually be known as \"the Contessa\" was born into the ruling family of a planet somewhere in the galaxy. Living in a palace, her family, which had ruled the planet for centuries, had their word treated as law."}, {"tag": "p", "text": "Eventually, during the Imperial Era, the Galactic Empire sent an ambassador to the planet, but the Contessa's family sent her away, believing nothing further would come of the visit. However, within five years, the Empire had killed all of the Contessa's family, and enslaved their former subjects, who had once seen the Empire as their liberators."}, {"tag": "h3", "text": "The rebellion"}, {"tag": "h4", "text": "Protecting the fleet"}, {"tag": "p", "text": "Escaping the Empire, the Contessa became a pilot in the Alliance to Restore the Republic, and the leader of Corona Squadron, which flew T-65B X-wing starfighters. In the immediate aftermath of the Battle of Hoth, which saw the Alliance forced to evacuate its hidden Echo Base, she was faced with rebuilding her own squadron which had fought at Hoth and was now based aboard the MC80 Star Cruiser Liberty. However, she was also tasked by Mon Mothma with organizing the starfighter defense of the Alliance Fleet's Rendezvous Point Delta-Three, which was threatened with being discovered by pirates operating out of the Vosch Cluster. The Contessa assigned Wedge Antilles, the former Rogue Three, to cobble together a makeshift squadron out of the understrength starfighter complement to neutralize the pirate threat."}, {"tag": "p", "text": "Under her direction, Antilles assembled a group of Rogue Squadron veterans, rookies, and troublemakers to crew a reformed Red Squadron. Antilles' squadron managed to attack the pirates before their location was compromised. Though the rendezvous point would eventually be discovered by Imperial forces, the delay secured by Red Squadron's efforts allowed the arrival of stragglers to the fleet, including the Millennium Falcon, allowing for their eventual escape."}, {"tag": "h4", "text": "Reconnaissance missions"}, {"tag": "p", "text": "Despite the rebel fleet's safe relocation to a backup rendezvous point, the Liberty and Corona Squadron did not accompany them. Instead, the newly-reformed group, including pilots Thane Kyrell, Yendor, Kendy Idele and Smikes, undertook a series of reconnaissance missions for the Alliance. Investigating intelligence reports of massive material processing operation for the Imperial Starfleet, the squadron charted D'Qar, which would later become a deep space cache and outpost for the Rebellion and later, the Resistance."}, {"tag": "p", "text": "In response to unusual level of Imperial activity, Admiral Gial Ackbar himself assigned Corona Squadron a scouting mission to the Hudalla system. Despite running on minimum power and hiding in Hudalla's planetary rings, the Contessa and her flightmates drew the attention of the massing Imperial fleet and were forced to fight their way out of the star system—losing Corona Three, Smikes, in the process."}, {"tag": "h4", "text": "Endor and beyond"}, {"tag": "p", "text": "The Contessa led Corona Squadron at the Battle of Endor, where their brief was to cover Red, Gold, Green, and Gray Squadrons as their fighter groups penetrated the second Death Star. However, the attack was thrown into disarray after it became apparent that the strike team inserted several days prior had failed to deactivate the shield generator on the Forest Moon. Furthermore, it became apparent that the Death Star was indeed operational when it destroyed the Liberty, Corona's operational base. Following the orders of General Lando Calrissian, who was leading the starfighter assault, the Contessa and Corona Squadron closed range with the Star Destroyer flotilla, in order to draw Imperial fire off the rebellion's cruisers."}, {"tag": "p", "text": "In the course of the melee, the Contessa identified the Imperial Star Destroyer Subjugator, and ordered her squadron to attack the engines, inflicting damage on at least one. As the signal came over the rebel comms that the shield had finally been brought down, the squadron returned to its original mission, preventing TIEs from entering the station's superstructure until Calrissian's starfighters hit the main reactor. With the station destroyed, the battle was effectively won by the rebellion."}, {"tag": "p", "text": "After the pivotal battle, the Contessa left Corona Squadron and the service of the Alliance Military. By 5 ABY, she had returned to her homeworld to stand for the presidency."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Contessa was a female human with black hair and dark eyes. She was a wise leader, guiding her squadron through many battles. She missed her family and her homeworld as it had been before the coming of the Empire. Although she wanted to believe that her family had ruled her homeworld well, she was willing to admit that that may not have been the case."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "The Contessa was a skilled starfighter pilot, surviving through some of the most pitched battles of the Galactic Civil War before leaving the military."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During her time in the Rebel Alliance Starfighter Corps, the Contessa flew an X-wing starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While writing the novel, Gray mentally pictured the Contessa as being portrayed by Michelle Yeoh.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}