{"url": "The_Clone_Wars:_The_Valsedian_Operation", "categories": ["Category:Real-world articles", "Category:The Clone Wars webcomics"], "nodes": [{"tag": "h1", "text": "The Clone Wars: The Valsedian Operation"}, {"tag": "p", "text": "The Clone Wars: The Valsedian Operation is a webcomic in The Clone Wars webcomic series taking place right after the events of The Clone Wars: Act on Instinct. It was released concurrently with The Clone Wars television series' third season. It began on September 14, 2010 and its final issue was published on April 29, 2011."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Valsedian Operation begins right where Act on Instinct left off. Having been expelled from the now-Separatist planet of Ukio, Jedi General Keelyvine Reus and her Padawan Tyzen Xebec are returning to Coruscant along with Clone Commander Ganch. Accompanying them is AgriCorps worker Sanya, whose help was instrumental in fighting the Separatist forces on Ukio. While their cruiser is docking, Tyzen welcomes Sanya back to her one-time home and Reus proceeds to thank her for her service to the Republic. She assures Sanya that her assistance will be well reflected in her report to the Jedi Council and that it might influence where the AgriCorps send her next. On debarking, the group is met by Captain Rex, who brings a priority message for the two Jedi to report immediately to Master Yoda. He also offers to take Ganch to an RSO Center for some down-time. Initially hesitant, Ganch obliges when Reus insists that he go and stand by until called for. He invites Sanya to go with him and she readily agrees."}, {"tag": "p", "text": "Reus and Xebec arrive at the Jedi Temple and enter a communication chamber where they are met by Yoda, Obi-Wan Kenobi, Anakin Skywalker, and his Padawan Ahsoka Tano. Chancellor Palpatine appears as a hologram and informs the Jedi of a predicament involving the new allies of the Republic—the Hutts. Palpatine was told by Jabba that a distant cousin of his—Torpo the Hutt—ignoring the treaty between the Republic and the Hutts, has sold the Valsedian asteroid belt—a rich trove of ore used in the production of fuel, armor and weaponry— to the Separatists. Anakin, Obi-Wan, Ahsoka, Reus and Tyzen are to investigate, but without clone or military escort, as any Republic military presence deep into Hutt space could cause a delicate political situation. Anakin proposes they use the Twilight and pass as smugglers."}, {"tag": "p", "text": "Rex, Ganch and Sanya arrive at the RSO Center when Reus contacts Ganch and informs him his services will not be required for their next mission."}, {"tag": "p", "text": "At the Archives of the Jedi Temple, talking with Obi-Wan, Reus reveals that she was trained in the lightsaber arts by Dooku."}, {"tag": "p", "text": "Back at the RSO Center, Rex, Ganch and Sanya meet Commander Cody, who asks them to join him on his table. The clones are having a drink and discussing the war when Sanya accidentally drops a fork on the floor. Picking it up, she discovers there are detonite charges planted under the chairs. A girl from the RSO staff determines the charges are not timer-based and are probably connected to a remote detonator. As it is not safe for the clones to move from their chairs, she proposes the RSO staff should disarm the charges."}, {"tag": "p", "text": "Later, on a landing platform, Ahsoka and Tyzen are bringing supplies aboard the Twilight, talking about Xebec's experience during the battle of Ukio."}, {"tag": "p", "text": "Meanwhile, in a hidden facility inside one of the asteroids in the Valsedian belt, a group of pirates—a Gamorrean called Duroc, a blue-skinned male Twi'lek, a yellow-skinned female Twi'lek with an eyepatch and a purple-skinned male—are sitting on a table, enjoying their fortune of being paid to guard a rock that no one visits. Suddenly Duroc starts choking and then flies into a wall. The cause turns out to be Asajj Ventress, who enters the room. Accompanied by the four pirates, Ventress inspects the mining operation taking place inside the facility. Ugnaught workers forced by battle droids do the ore processing. Ventress makes it clear she does not like the pirates and tells them their job is to guard the workers and make sure they stay productive."}, {"tag": "p", "text": "Back at the RSO Center, Sanya reports to Ganch there are charges at every table on the chairs that the clones are using. As the charges are blinking in unison, Sanya is sure they are linked. The RSO staff has to defuse all the charges at the same time. To stay connected they put on the clones' helmets. Cody links his helmet to theirs to see what they see. Then he guides them through the steps of defusing the charges and they succeed. Suddenly, a girl from the RSO staff runs away. Sanya and Ganch pursue her, but just outside the RSO Center she manages to blast a clone trooper, steal a BARC speeder and drive away. Ganch and Sanya quickly hop on another speeder and continue the chase."}, {"tag": "p", "text": "When the Twilight arrives at the Valsedian belt, Anakin, Obi-Wan and Reus are in the ship's hangar next to a red Delta-7B starfighter with R2-D2 in its astromech droid socket. Though he is not thrilled, Anakin is to be the backup for the mission as he is the most capable pilot present, so he hops in the starfighter and flies out of the hangar. Ahsoka and Tyzen guide the Twilight amid the floating rocks into a cave inside the largest asteroid where they land. There is stable pressure and trace atmosphere on the asteroid, so the Jedi put on breath masks."}, {"tag": "p", "text": "As the narrow tunnels are making their sensors unreliable, the Jedi split in two groups. The Padawans are to scan the smaller tunnels while the Masters take another route. Obi-Wan and Reus reach breathable atmosphere and take their masks off. They spot a Twi'lek approaching—most likely an administrator of the facility. Reus grabs him and using a Jedi mind trick, she asks him where is his master. The Twi'lek answers he is far away. Reus then asks who is in charge and who does he answer to and the Twi'lek says it is his master, confusing the Jedi. Meanwhile, the Padawans are crawling through a tunnel and as they spot a light underneath they suddenly fall inside a room full of battle droids. Ahsoka and Tyzen activate their lightsabers to engage the enemy. At that moment Obi-Wan senses the young Jedi are in danger. He rushes to help them while Reus remains to further question the Twi'lek."}, {"tag": "p", "text": "When sentry droids report Jedi intruders, Ventress orders the four pirates to deal with the Padawans, but leave the older Jedi to her."}, {"tag": "p", "text": "Up in space, orbiting in his starfighter, Anakin is attacked by Vulture droids."}, {"tag": "p", "text": "The speeder chase on Coruscant's skylanes is in progress. The saboteur RSO girl makes a hard turn downwards and Sanya and Ganch follow."}, {"tag": "p", "text": "Meanwhile, Obi-Wan reaches Ahsoka and Tyzen only to find they have matters under control. Together, the three Jedi continue the fight with the droids."}, {"tag": "p", "text": "In the tunnels nearby, Reus shackles her Twi'lek prisoner to a wall and asks him where Torpo is. To the Jedi's surprise it turns out Torpo is in the facility. Suddenly Reus is attacked by Ventress and the two engage in a lightsaber duel."}, {"tag": "p", "text": "Obi-Wan and the Padawans manage to destroy all the battle droids when they hear a scream for help. The Jedi run into a room where the four pirates have captured the Ugnaught workers under a shield and threaten to kill them. The Jedi engage the pirates. While Obi-Wan fights the purple-skinned one, Ahsoka and Tyzen defeat Duroc and the female Twi'lek."}, {"tag": "p", "text": "As the duel between Ventress and Reus continues, Asajj manages to destroy the shackles of the Twi'lek prisoner and he flees."}, {"tag": "p", "text": "Above, Anakin uses podracing tactics to deal with his Vulture droid pursuers."}, {"tag": "p", "text": "Obi-Wan's battle with one of the pirates still continues, but finally the Jedi reveals he is just stalling to give the Padawans time and then quickly ends the fight with a Force Push. Ahsoka reports they can not deactivate the shield as its generator is outside on the surface. Kenobi contacts Anakin and tells him he has to destroy the generator. Skywalker still has Vulture droids on his tail though."}, {"tag": "p", "text": "Still fighting, Ventress and Reus now reach a big door. The assassin's lightsabers accidentally cut the door and it opens. Inside is Torpo, screaming about conspiracy and invasion, and begging for help. Suddenly Ventress' red blades pierce the Hutt's body and he drops dead. Using the Force, Asajj pushes Reus into a wall and throws Torpo's body at her. By the time the Jedi manages to toss the corpse away, she is all covered in Hutt slime and Ventress is gone."}, {"tag": "p", "text": "Back on Coruscant, Ganch and Sanya find the RSO saboteur's speeder abandoned when they hear blasterfire. The two find the girl dead, but the shooter is long gone."}, {"tag": "p", "text": "In the asteroid belt, Anakin leads his Vulture droid pursuers to the shield generator where he makes a hard turn, forcing them to crash directly into the structure. The shield is down and the Ugnaughts are free. Anakin lands inside the facility as Chief Foreman expresses his gratitude to Obi-Wan. Reus joins them and infroms them that Torpo is dead and Ventress has escaped. Then Chief Foreman reveals that Torpo was not in charge. It was Bib Fortuna—Reus' Twi'lek prisoner—who also escaped. Anakin is immediately filled with anger as Fortuna is the henchman of Jabba the Hutt, who obviously deceived them. Unfortunately, as they have no proof, the Jedi can not do anything about it."}, {"tag": "p", "text": "Elswhere, Ventress informs Dooku that the Valsedian belt is no longer in their control. Comprehending Jabba's scheme now, the Count assures her they shall see to it that he will never again be so bold."}, {"tag": "p", "text": "The Twilight is landing back on the platform on Coruscant where Ganch and Sanya are approached by another RSO girl. She informs them the saboteur was not one of them as all RSO members were accounted for. Moments later Reus orders Ganch to join her in the Jedi Temple war room in 25 minutes, as Master Yoda has a new assignment for them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Clone Wars: The Valsedian Operation original credits:\nStory and Art by Tom Hodges\nScript by Pablo Hidalgo\nColors and letters by Grant Gould"}, {"tag": "p", "text": "Special thanks were given to Frank Parisi, Sue Rostoni, Leland Chee and Dave Filoni."}, {"tag": "p", "text": "The image from the cover art is a character design by Tom Hodges from 2009 made for Act on Instinct."}, {"tag": "p", "text": "The text in Aurebesh on the flags above the entrance of the RSO Center read:\nRSO\nRepublic Service Organization\nSenate District Lounge"}, {"tag": "p", "text": "When Sanya jumps in the second BARC speeder, Ganch shouts: \"I see it, wait, Sanya!\", a reference to Luke's line \"I see it, wait, Leia!\" in Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "After the speeder chase on Coruscant, Ganch mistakenly calls Sanya \"Sansa\"."}, {"tag": "p", "text": "While Tom Hodges was established already as a comic artist, The Valsedian Operation was his first time writing a story. According to an interview, he asked Pablo Hidalgo if he could write the summer story between seasons two and three of The Clone Wars. The story was approved and it became the season three webcomic."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}