{"url": "The_Cloud", "categories": ["Category:Real-world articles", "Category:Articles from unlicensed sources", "Category:MyComyc comics"], "nodes": [{"tag": "h1", "text": "The Cloud"}, {"tag": "p", "text": "The Cloud (Spanish: La Nube) is a two-page comic that was drawn by Beaumont Studios in 1986. It was published in Spain by Editorial Gepsa, under the MyComyc imprint and in Castilian."}, {"tag": "h2", "text": "Rich Handley's plot summary"}, {"tag": "p", "text": "As Artoo and Threepio search for new adventures, an artificial cloud envelops their ship, and ghost-like beings suddenly appear and then vanish. They find Tig's satellite, which the gangster is using to abduct space travelers. The droids board the satellite, deactivate the cloud apparatus and escape."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Star Wars-themed comics featured in Mycomic were rediscovered in 2013 when a fan named Adolfo Rodriguez mentioned them on the DarkHorse.com forums. Star Wars author Abel G. Peña translated them into English, while his colleague Rich Handley re-lettered them. The two then made them available for download on their respective websites on April 10. The original author is unknown."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Dark Horse's Vice President of Publishing, Randy Stradley, asked Lucasfilm Ltd. if the Mycomic strips had been officially licensed when they were published. Although the comics bore the appropriate copyright information, employees at Lucasfilm found no paperwork proving that Editorial Gepsa had actually licensed the comics. Nevertheless, Handley and Peña strongly suspect that the licensing did occur, although Handley has claimed that the \"the strips' legitimacy is considered suspect for now, and Dark Horse has no plans to reprint them unless documentation emerges.\" Handley noted on his blog that the phantom's presence was not explained."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}