{"url": "The_Clone_Wars:_Wild_Space", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The Clone Wars novels"], "nodes": [{"tag": "h1", "text": "The Clone Wars: Wild Space"}, {"tag": "p", "text": "The Clone Wars: Wild Space is the second in the series of novels inspired by Star Wars: The Clone Wars TV series, written by Karen Miller. The audio adaption of The Clone Wars: Wild Space was performed by Jeff Gurner. It was first published by Del Rey on December 9, 2008 in paperback."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Clone Wars have exploded across the galaxy as Republic forces and Separatists struggle to gain the upper hand. But while the Jedi generals work tirelessly to defeat Count Dooku and his rebels, Supreme Chancellor Palpatine is hatching his own dark plans."}, {"tag": "p", "text": "The Separatists have launched a sneak attack on Coruscant. Obi-Wan Kenobi, wounded in battle, insists that Anakin Skywalker and his rookie Padawan Ahsoka leave on a risky mission against General Grievous. But when Senator Bail Organa reveals explosive intelligence that could turn the tide of war in the Republic's favor, the Jedi Master agrees to accompany him to an obscure planet in the Outer Rim to verify the facts. What Obi-Wan and Bail don't realize is that they're walking into a deadly trap concocted by Palpatine... and escape may not be an option."}, {"tag": "p", "text": "Inspired by the full-length animated feature film Star Wars: The Clone Wars and brand new TV series, this thrilling adventure is filled with provocative, never-before-revealed insights into the characters of Obi-Wan, Anakin, Padmé, Yoda, Count Dooku and many other Star Wars favorites."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts off just shortly after the First Battle of Geonosis and before the end of Star Wars: Episode II Attack of the Clones, where it turns out that Anakin Skywalker and Padmé Amidala's attraction toward one another during the battle was not undetected by the other Jedi, such as Yoda. The latter asks Obi-Wan Kenobi to talk to Padmé in order to dissuade her from advancing her romantic relationship with Anakin. Using her political skills, Padmé lies by pretending to concede to Yoda's whims, and asks for Anakin to escort her back to her home planet of Naboo, where, unbeknownst to Obi-Wan or anyone else, she and Anakin will marry, an action that will later help bring Anakin to the dark side of the Force. This will be following Anakin's recovery from the injury of his lost arm in his lightsaber duel with Darth Tyranus."}, {"tag": "p", "text": "The book then skips ahead a few months into the Clone Wars following Anakin and his Padawan Ahsoka Tano's rescue of Jabba the Hutt's son. After Obi-Wan receives valuable information from his friend, Dexter Jettster, about an attack on the planet Bothawui by General Grievous, Obi-Wan is injured in a sneak attack on Coruscant by the Confederacy of Independent Systems. His injuries are not fatal, so he lives, albeit barely."}, {"tag": "p", "text": "As Anakin takes Ahsoka and a good sized portion of the Grand Army of the Republic to counter Grievous's forces at Bothawui, Senator Bail Organa gets a message from a shadowy ally of his that explains that there is a Sith Holocron on the planet of Zigoola in Wild Space. Obi-Wan and Padmé are told by Organa, and Obi-Wan agrees to go with the Senator in order to retrieve the Holocron and seek what information lies within it. The Jedi and the Senator rendezvous with Organa's contact in Wild Space, Alinta, but the three of them are attacked by space pirates. Alinta is killed, but Obi-Wan and Organa continue to Zigoola. But when they arrive on the planet, they crash several miles from the Sith temple and are forced to walk there in order to retrieve the Sith Holocron. During the journey, however, Obi-Wan suffers hysterically by dark side illusions projected by the planet due to its dark side nature from being immersed in the Sith. Eventually, the duo just barely make it to the Sith temple, but Obi-Wan can go no further because the closer they get to the Holocron, the stronger the dark side is to Obi-Wan and weakens his power. Obi-Wan is finally able to get into the Temple and destroy the Holocron, taking a crystal with him out of the temple as it collapses because of Obi-Wan's presence. He believes the crystal can contact home. Obi-Wan heals from the dark side projected by the destroyed Holocron and makes a Force call with the crystal to Master Yoda back on Coruscant. Yoda sends Padmé and several clone troopers to retrieve the duo from Zigoola, which is successful."}, {"tag": "p", "text": "The novel ends with Supreme Chancellor Palpatine ruminating on his thoughts for the failure of Obi-Wan's destruction on Zigoola, but he is reassured by the dark side, knowing that one day, the Jedi will fall and all power will be his."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The story is set concurrently with The Clone Wars season one episode Downfall of a Droid, and features several scenes from the show depicted from a different point of view."}, {"tag": "p", "text": "Obi-Wan Kenobi telling Bail Organa what the Jedi Council knows about the Sith threat is presented as the first time he has heard of the Sith, due to their shadowy nature. However, nearly every full-scale war the Republic had fought up to that point had been between the Republic and the Sith, which an educated senator such as Organa would probably be aware of."}, {"tag": "p", "text": "The Resolute is stated to be a brand new ship delivered from Allanteen Six Shipyards. However, the ship was present at the Battle of Christophsis which is an earlier event."}, {"tag": "p", "text": "The book takes place approximately one standard galactic month after the First Battle of Geonosis, which means Anakin was knighted within the first month of the Clone Wars which is contradictory to other C-Canon material."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}