{"url": "Battle_of_Kothlis_(Clone_Wars)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Kothlis"], "nodes": [{"tag": "h1", "text": "Battle of Kothlis  (Clone Wars)"}, {"tag": "p", "text": "A battle took place on the planet Kothlis during the Clone Wars, and marked the Galactic Republic's second return to the planet during the war. Admiral Wullf Yularen, along with the Jedi Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano were sent to stop the Confederacy of Independent Systems invasion, led by General Grievous. The Kaleesh warlord introduced a new weapon, able to jam all Republic communications. With the jamming in place, the Jedi and Clone Army faced a difficult battle but were eventually victorious."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Indomitable Battle Group drifted in space near Kothlis awaiting orders. Comm Officer Lt. Avrey received a Priority Alpha communication from Grand Master Yoda. The Admiral and Jedi went over to the Battle Operations Room to watch. The recording of the diminutive Jedi Master informed those present that General Grievous was moving his fleet towards Kothlis and ordered them to intercept before the Bothan Spynet was eliminated. Yoda also authorized them to call for reinforcements. The conservative Republic Admiral had grave doubts about the upcoming battle, but Skywalker convinced him it was necessary. Upon returning to the bridge, the Admiral called his fleet to battle stations and gave the order to jump to Kothlis. With a half-hour trip, Kenobi and Skywalker went to meditate while the Padawan Ahsoka Tano went to mobilize the ground troops. She met them in the mess hall, and after interacting with them for a few minutes, ordered the clones to start preparing for battle."}, {"tag": "p", "text": "When the Republic forces reverted to realspace, they found Grievous' fleet already waiting. To make matters worse, the Separatist forces introduced a powerful jamming system, able to completely close down Republic communications. Lt. Avrey informed the leaders she could work a way around the jamming using ancient but still usable technology. After an hour of waiting for a fix, Skywalker led the space forces to battle the opposing fleet while the ground forces were inserted into the atmosphere. The fighters were entirely without a way to organize their counter-strike and relied on split-second timing for the assault."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "While Skywalker destroyed numerous droid starfighters, his Padawan assisted Kenobi and the clones while they engaged the droid infantry. Skywalker's flying prevented a number of Clone pilot losses. After taking numerous losses, the Republic drove off the Separatist fleet. Many Bothans had gotten caught in the cross-fire, but the Bothan Spynet survived relatively intact, meaning the primary objective of the battle was fulfilled. Obi-Wan Kenobi received shrapnel from B2 super battle droids, and Ahsoka Tano was knocked unconscious. Lt. Avrey cleared communications and called the Coryx Moth to assist. After the battle, Skywalker landed near the battle scene while Gold Squadron eliminated the remaining Vulture droids. The Jedi General helped Clone medics heal the wounded and called for an evacuation of his former master and apprentice. When he arrived back unto the Indomitable, he was informed it had received damage and would be in space-dock for weeks. The Jedi were sent back to Coruscant on the Pioneer while the wounded were shipped to the Kaliida Shoals Medical Center to recuperate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}