{"url": "Battle_of_Krant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Bothan sector", "Category:Battles of the Hunt for the Decimator"], "nodes": [{"tag": "h1", "text": "Battle of Krant"}, {"tag": "p", "text": "The Battle of Krant was a major battle that took place in the Clone Wars."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following the destruction of the Trade Federation operation on Aereen, Echuu Shen-Jon and Naat Reath moved on to invade the planet Krant."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Once on Krant, Echuu and his men encountered a number of Wookiees who had escaped imprisonment by the Confederacy. They went on to destroy several factories producing Decimators, and even encountered a fully operational one, which proved very difficult to defeat. Soon afterwards, Naat was kidnapped by Sev'rance Tann. Allying themselves with the Wookiees, Echuu and the Republic gathered their army at an old Wookiee base and wiped out the droid armies."}, {"tag": "h3", "text": "Duel with Sev'rance Tann"}, {"tag": "p", "text": "When Echuu found Naat, Tann appeared and the two fought a long and fierce duel. Echuu let his emotions control him, and eventually defeated her through the aid of the dark side of the Force. When the dying Tann continued to taunt him, Echuu attempted to strike the final blow, but Naat stopped him and helped him to regain control of his emotions. She urged him that they should return to the Jedi Temple. However, Echuu realized that it wasn't his Jedi training that defeated Tann, it was the strong presence of the dark side within him, and he knew that it would forever be part of his destiny."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Sending Naat back to Coruscant, Echuu began a self-imposed exile on Krant, an exile that would continue through the Great Jedi Purge and into the early years of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An easter egg occurs in the mission, where the player can find Palpatine and Anakin Skywalker near a sith temple. Similarly, another easter egg in the same mission has Anakin Skywalker with Padmé Amidala, C-3PO, and R2-D2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}