{"url": "The_Coruscant_Holo_Net", "categories": ["Category:Legends articles", "Category:The Coruscant Holo Net"], "nodes": [{"tag": "h1", "text": "The Coruscant Holo Net"}, {"tag": "p", "text": "The Coruscant Holo Net was a newspaper in print that was published on Coruscant, capital world of the Galactic Republic, during the two last decades of that government. Although officially aligned with the Republic, that paper sometimes contained advertisments that went against the Galactic Constitution or had ties with the enemy Separatist Alliance. Keets Freely, its Chief Reporter during the Clone Wars, was among the first individuals to ever suspect the then-Supreme Chancellor Palpatine carried a hidden agenda. In the wake of the war and after the birth of Palpatine's Galactic Empire, the publication of The Coruscant Holo Net was discontinued and Freely was branded a traitor by the new regime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Established in 48 BBY, The Coruscant Holo Net was still widely distributed during the Clone Wars, for the price of 1. At that time, its journalism staff included Senior Reporter Nik Kigee, Senior Coruscant Correspondent Tho-Masfran Ciss, and Chief Reporter Keets Freely.\nShortly before the outbreak of the conflict, Ciss chronicled the failed assassination plot carried out by a group of mercenaries on the person of Supreme Chancellor Palpatine and the subsquent ascension of Security Advisor Jar Jar Binks to the position of Junior Representative in the Galactic Senate. At some point, Freely discovered a scandal involving the InterGalactic Banking Clan and the Supreme Chancellor. It appeared that the Chancellor had helped the Banking Clan develop a complex system of secret, tax-free bank accounts for megacorporations on a ring of planets. This allowed Palpatine to garner the support of both the Banking Clan and the largest corporations in the galaxy. When his editor refused to publish that discovery, Freely resigned from the agency. The paper's existence was discontinued shortly after the foundation of the Galactic Empire in 19 BBY, and its former Chief Reporter was given a death mark, becoming a target of the Enemy Eradication Order of Coruscant."}, {"tag": "h2", "text": "Content"}, {"tag": "p", "text": "Every issue The Coruscant Holo Net typically contained new articles and multiple advertisements, written entirely in the High Galactic alphabet. Despite its proclaimed Republican affiliation, The Coruscant Holo Net sometimes included content that went against the Republic's laws. One issue contained a cryptic advertisement invited the readers to contact the parliament of the Separatist Alliance on Raxus Secundus and ask \"the General\" in order to purchase Jedi lightsabers. On another occasion, the paper published a classified ad that promoted slavery, while the Rights of Sentience clause of the Galactic Constitution strictly forbade it."}, {"tag": "h2", "text": "Known issues"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}