{"url": "The_Crystal_Star", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Incomplete lists", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "The Crystal Star"}, {"tag": "p", "text": "The Crystal Star is Star Wars Legends novel written by Vonda N. McIntyre. It was first published in hardcover by Bantam Spectra on December 1, 1994. The novel is set in 14 ABY, following Planet of Twilight and preceding Before the Storm."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Princess Leia is dealt a crushing blow when her three children—Anakin and the twins Jaina and Jacen—are kidnapped. Leia's advisers counsel her to wait for a ransom note, but waiting is the hardest thing for a mother to do when her children are in danger—and worse than waiting is her discovery that she cannot sense her children through the Force."}, {"tag": "p", "text": "Ultimately, the princess has no choice. She, Chewbacca, and Artoo-Detoo track the kidnappers, following their trail to a disabled refugee ship where the answers provided by Rillao, a mysterious fugitive, only provoke more questions. The refugees' children are also missing—and Rillao thinks she knows who has them: a powerful Imperial officer named Hethrir who has his own twisted plans to restore the Empire to its former glory."}, {"tag": "p", "text": "Meanwhile, Han Solo and Luke Skywalker are on a separate mission to the planet Crseih to investigate a report of a lost group of Jedi. Crseih is at the mercy of strange quantum effects caused by the death of a nearby star that is slowly freezing into a uniquely perfect crystal. This crystal star causes a disruption in the Force, blunting Luke's power and cutting the Millennium Falcon off from Leia and their home base."}, {"tag": "p", "text": "What Han and Luke find on the planet is even stranger than a crystallizing sun: a charismatic alien named Waru who has attracted a following of fanatic devotees through his miraculous healing powers. Is Waru a being of benevolence? Or do his healing arts conceal a darker purpose? As Leia, Chewbacca, and Rillao follow Hethrir's trail of treachery across space, Luke and Han draw closer to the truth behind Waru's sinister cult. Ultimately, they will face an explosive showdown that could determine not only their own fates and the fate of the New Republic but whether the universe itself will survive."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Munto Codru, Jacen, Jaina and Anakin are kidnapped by a man named Hethrir. Their mother, Leia Organa Solo, immediately dispatches a rescue operation. Meanwhile, Han Solo and Luke Skywalker go to Crseih Station and learn of a secret cult (formed around Waru, a being from another dimension) that influences the crystal star."}, {"tag": "p", "text": "Hethrir continues to manipulate the children for several days. He leads the Empire Reborn, an organization looking to resurrect the Galactic Empire."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Essential Reader's Companion (2012) dates the events of The Crystal Star to 14 ABY, placing it between the novels Planet of Twilight (1997) and Before the Storm (1996). It was the first book to develop the characters of the three young Solo children."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}