{"url": "The_Doomed", "categories": ["Category:Legends articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "The Doomed"}, {"tag": "p", "text": "The Doomed were a group of former Jedi and Dark Jedi who lived on Eshkrene, the polar continent of Kesh, until circa 2974 BBY. When away from their primary settlement, they wore hooded brown parkas and wielded bow and arrow weapons. A group of the Doomed rescued Takara Hilts and Parlan Spinner from the Keshiri Captain Chegg, introducing themselves and declaring the newcomers members of the Doomed as well. The party who greeted the new arrivals included a male Wookiee, an Ithorian, a female Chagrian and a female S'kytri named Kaliska."}, {"tag": "p", "text": "Spinner and the Keshiri crew later escaped their prison and stole the Doomed's \"Great Weapon\": the oubliette containing the ancient Dark Jedi Remulus Dreypa. Following his release, Dreypa and his quisling Spinner attempted to overthrow the ruling Lost Tribe of Sith on the main continent Keshtah Minor. Takara joined forces with the Doomed who attempted to stop the Dark Jedi. However, they were slain by Dreypa's Leviathan Sithspawn at the Battle of Sessal Spire who devoured their life energies and memories. However, their sacrifice enabled Spinner to turn on his former ally Dreypa and ultimately defeat Dreypa during the Siege of Tahv."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "As the descendants of ancient Jedi and Dark Jedi Force-users from the Hundred-Year Darkness, all members of the Doomed were Force-sensitive. Their core beliefs were codified in the Code of the Doomed which advocated pacifism and regarded warfare as a necessary evil only applicable in just causes; and regarded power, especially Force sensitivity, as an aberration rather than advantage. They rejected the dualistic rivalry between Light and dark side users and instead tried to reach a \"true neutrality\" by ending the conflict between the two sides of the Force. Despite their rejection of violence and lack of lightsabers, the Doomed did not abandon combat arts but preferred to used primitive bows and arrows and the Keshiri aeromak—a spear used for hunting wild beasts."}, {"tag": "p", "text": "While the Doomed regarded the Force as a curse and a disease, they still used it for peaceful acts like crafting metal lanterns called glowbacters and crafting ice murals that detailed their history. The Doomed were also capable of using the Force to project ice images showing events occurring in other parts of Kesh. This enabled them to monitor developments that were occurring in the Keshiri continents of Keshtah Minor and Alanciar including the Hilts Restoration. It also enabled them to monitor key members of the Lost Tribe of Sith like Varner Hilts and his daughter Takara Hilts from a remote distance. They believed that as long as any member of the community could still wield the Force, they were unable to leave Kesh. For the purpose of returning to the wider galaxy, the Doomed had hidden a working Jedi starship under the Circle Eternal in the Lost Tribe's capital at Tahv."}, {"tag": "p", "text": "The Doomed worshiped at a temple called the Hall of Regret everyday where they came to reflect on their historical origins. They also kept their \"Great Weapon\"—the Dark Jedi Remulus Dreypa—imprisoned within a metal oubliette. They believed that there could only be peace on Kesh if Dreypa remained trapped within his prison or was killed in combat. As with other Force orders like the Jedi and Sith, the Doomed had a diverse mixture of species within its ranks including S'kytri, Wookiees, Ithorians, Chagrians, Twi'leks, Rodians, Weequays, and Humans. They also kept a wide range of Keshiri animals as livestock at a stable in their settlement."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Doomed were the descendants of stranded Jedi and Dark Jedi who had settled on Kesh following the end of the Hundred-Year Darkness. Due to their ancestry, all members of the Doomed were Force-sensitive. Following the Battle of Corbos which ended the Hundred-Year Darkness circa 6900 BBY, several defeated Dark Jedi including Karness Muur, Remulus Dreypa, and XoXaan were exiled by the Jedi and the Galactic Republic. These Dark Jedi Exiles ended up on the planet Korriban in the remote Stygian Caldera. Eventually, the Exiles used their Force powers to establish themselves as the rulers of the Sith and founded the first Sith Empire. However, some of these Sith Lords including Dreypa were not content to rule over the Sith and sought revenge against the Republic and the Jedi."}, {"tag": "p", "text": "Dreypa led a group of fellow Dark Jedi who commandeered a starship and exited the Stygian Caldera, intending to attack the Republic. However, they were intercepted by a Jedi patrol consisting of veterans from Corbos. The Jedi starships pursued Dreypa's vessel across the galaxy before finally crash landing on Kesh, a remote planet in Wild Space. Kesh's strong magnetic field prevented the Jedi from leaving the planet or communicating with their counterparts for assistance. The two rival Force orders fought a bitter battle on Kesh which devastated much of the planet's surface. During the fighting, monstrous Sithspawn known as Leviathans were also unleashed by Dreypa's forces. These events would be remembered by the indigenous Keshiri as the legendary Great Calamity that was fought between the Protectors and the Destructors."}, {"tag": "h3", "text": "The Quest for True Neutrality"}, {"tag": "p", "text": "The fighting nearly destroyed Kesh but most of the Dark Jedi combatants eventually became disillusioned with their Sith cause. With Baron Dreypa unwilling to compromise due to his lust for vengeance against the Jedi, these Dark Jedi turned on their leader and sealed him within an oubliette, a stasis casket capable of incarcerating sentient beings for millennia. There, Dreypa would remain for nearly four millennia. The Dark Jedi then made peace with their former Jedi enemies, which began a period recalled by later generations as the \"Atonement.\" Since Kesh was isolated from the rest of the galaxy, the Jedi and Dark Jedi agreed to withdraw from the Keshiri in atonement for the deaths and destruction they had wreaked on them."}, {"tag": "p", "text": "These Force-users eventually settled in the planet's South Pole on the frozen continent of Eshkrene. There, the former Jedi and Dark Jedi opponents worked together to achieve \"true neutrality\" between the light and dark sides of the Force. Over time, they discarded their former identities as Jedi and Dark Jedi and became a new Force-using community known as the \"Doomed.\" They advocated pacifism and viewed Force-sensitivity as an affliction rather than an advantage. While the \"Doomed\" came from a diverse mixture of species from throughout the galaxy, their isolation meant that certain species gradually died out as their representatives on Kesh aged and died. They also used the frozen climate to preserve genetic material for several generations, thus ensuring the continued existence of some species."}, {"tag": "h3", "text": "The Lost Tribe"}, {"tag": "p", "text": "Despite their self-imposed isolation, they still vowed to watch over the native Keshiri and protect them from any threats. The Doomed also developed a means of conjuring up ice images to observe developments in other parts of Kesh, particularly the main continent of Keshtah. In 5000 BBY, another group of Force-users crash-landed on Keshtah during the Great Hyperspace War, which marked the collapse of the First Sith Empire. These Sith miners and soldiers had become stranded after their mining vessel the Omen had been damaged during a space battle with a Jedi starfighter and consisted of Humans and members of the red-skinned Sith. Under the leadership of Yaru Korsin, these Sith took control of the Kesh on Keshtah by claiming to be the legendary Protectors who had saved them during the Great Calamity."}, {"tag": "p", "text": "Over the following centuries, the Human descendants of the stranded Sith became known as the Lost Tribe of Sith and came to hold a privileged position in Keshiri society. They established a feudal aristocracy that was led by a Grand Lord. In 4985 BBY, all members of the Sith species on Kesh were killed during the Red Sith Purge, leaving the Houk Gloyd as the sole remaining non-Human member of the Lost Tribe until his death ten years later. In 3960 BBY, the Grand Lord Lillia Venn was killed during the Night of the Upside-Down Meteor. This triggered nearly a millennium of civil infighting known as the Time of the Rot which split the Lost Tribe into several warring factions."}, {"tag": "p", "text": "By around 3000 BBY, the conflict had degenerated to the extent that the Doomed considered intervening on Keshtah in order to protect the native Keshiri. However, a reformist Sith Lord named Varner Hilts assumed leadership of the Tribe and ended the civil war. He rebuilt the Lost Tribe's civilization on Keshtah and instituted the Hilts Restoration. His policies included making the Grand Lord an elected rather than a hereditary position and making contact with the Keshiri on the continent of Alanciar by 2975 BBY. Through contact with the Alanciari Keshiri, the Lost Tribe discovered the art of building large wooden sailing ships and commissioned a fleet of exploratory vessels to explore Kesh's uncharted seas and lands."}, {"tag": "p", "text": "Despite their philosophical and ideological differences, the Doomed still respected Hilts for restoring peace to Kesh and looking after the welfare of the Keshiri. Unlike other Sith, the Lorekeeper harbored no ambitions of power but was more interested in preserving his civilization on Kesh. Thus, the \"Doomed\" leader Kaliska decided not to intervene on Keshtah."}, {"tag": "h3", "text": "First Contact"}, {"tag": "p", "text": "In 2974 BBY, a chain of events occurred in the Lost Tribe's territory that culminated in contact between members of the Tribe and the Doomed community. Based on his research into ancient Keshiri tapestries that recorded their prehistoric past, Grand Lord Varner deduced that the Lost Tribe had not been the first offworlders to visit Kesh. For Hilts, the Keshiri's hasty acceptance of his ancestors proved that other offworlders had visited on Kesh. He speculated these offworlders and their descendants were still living in uncharted lands and seas beyond the main continents of Keshtah and Alanciar. He decided to send a sailing ship the Southern Star, captained by the Alanciari Keshiri Chegg to conduct a surveying mission of Eshkrene, the planet's southern continent."}, {"tag": "p", "text": "Meanwhile, the Tahv Constabulary led by his daughter Takara Hilts had apprehended the local outlaw and anarchist Parlan Spinner during a trap at the festivities commemorating the Tribe's first landing on Kesh. Spinner was an outcast who was the descendant of Ermon Parrah, the first Human to be cast out of the Tribe. Deprived of any means of social mobility in Tribal society, Spinner became an anarchist who perpetrated acts of mischief against the state. While Varner's contemporaries called for the youth's execution, the Grand Lord opted to give Spinner a second chance by sending him on an exploratory mission. Hilts assigned Spinner to work with Captain Chegg aboard the Southern Star."}, {"tag": "p", "text": "Unbeknownst to the others, Varner's daughter Takara had also stowed aboard the Southern Star. Despite her comfortable job as Tahv's Prefect of Police, the young Sith princess was still dissatisfied with her life and wanted to start a new life on Alanciar, which was then still regarded by the Keshtah Sith and Keshiri as a new frontier. After several days of sailing through the Southern Ocean, the Southern Star arrived on the frozen shores of Eshkrene. While Chegg and the surveyors were establishing a campsite, Spinner and Takara attempted to escape back aboard the ship. However, they were spotted by the Keshiri and fled into the forest."}, {"tag": "p", "text": "However, members of the Doomed were monitoring the explorers. Before Chegg and his comrades could murder Spinner and Takara, Doomed archers killed the attackers and took the two Humans prison captive. Kaliska then introduced her party to the newcomers and ordered that they be brought to the Doomed's nearby settlement. The remaining members of the crew were also detained while the Southern Star was impounded."}, {"tag": "h3", "text": "The Great Weapon"}, {"tag": "p", "text": "However, Kaliska had recognized Takara through their ice images and decided to bring her and her \"Protector\" Spinner for a meeting at the Hall of Regret, the Doomed's place of worship. While on the way to the Hall of Regret, the two Human Sith were amazed at the diverse mixture of species in that community. Takara attempted to escape with Spinner's assistance but were subdued by their captors. The winged S'kytri woman Kaliska personally restrained Takara and used the Force to sweep the Sith princess into her arms. While flying to the Hall, Kaliska reprimanded Takara for her impatience and reiterated there was no way for her to escape since her Keshiri crew had been taken captive as well."}, {"tag": "p", "text": "Upon arriving at the Hall, Kaliska gave her Sith captives an account of the Doomed's origins during the aftermath of the Hundred-Year Darkness. She also explained that her people's Jedi and Dark Jedi ancestors had a \"Great Weapon\" that was kept sealed within a oubliette. Since the Great Calamity, the descendants of the Jedi and Dark Jedi who were stranded on Kesh had made peace in an attempt to find \"true neutrality\" within the Force. The Doomed regarded the Force as a curse and a disease and their traditions banned anyone from leaving Kesh while they were still Force-sensitive. Kaliska also explained that the Doomed had been able to observe developments on Keshtah due to their Force-generated ice images."}, {"tag": "p", "text": "Finally, she praised Takara's father, Grand Lord Hilts, for bringing peace to the Keshiri on Keshtah and Alanciar. When Spinner expressed his desire to see the Doomed's \"Great Weapon,\" Kaliska ordered that he be imprisoned with the rest of the crew. While the Doomed had not decided what to do with their captives, they agreed that the newcomers should not be allowed to return home. However, since they were unwilling to integrate them into their community, Kaliska had considered executing them. By contrast, Kaliska opted to spare Takara since she wanted the Sith princess to stay and learn more about her people. She brought the young woman to a stable that was home to the settlement's farm animals, which the Doomed leader regarded as Eshkrene's \"greatest treasure.\""}, {"tag": "p", "text": "Many of these animals were the descendants of ancient stock brought offworld by the early Jedi and Dark Jedi settlers. Some of the animals also came from remote lands on Kesh that the Tribe had not visited. Kaliska showed the Sith princess how to calm animals through the Force, a skill that remained unknown to the Lost Tribe. Meanwhile, Spinner and the Keshiri crew managed to break out of their prison and steal the \"Great Weapon\" from the settlement's main tower. They then seized back control of the impounded Southern Star after overpowering the token guard presence. Their theft of the Great Weapon threw the Doomed into panic."}, {"tag": "p", "text": "Kaliska and Takara pursued the Southern Star and attempted to reason with Spinner and the crew. However, Spinner broke open the oubliette which freed the ancient Dark Jedi Baron Dreypa from his ancient prison. Spinner and the Keshiri crew immediately pledged their allegiance to the Dark Jedi while Kaliska and Takara were imprisoned within the ship's hold. The Southern Star then sailed back to Keshtah and reached the port of Eorm. There, Dreypa killed the local Sith Lord Galantos and his followers while awing the locals through a display of Force power. After seizing control of Eorm, Dreypa promoted Spinner to the position of Sith Lord and appointed him as his second-in-command. Meanwhile, Kaliska and Takara escaped and stole Eorm's entire herd of uvaks, using the Force to convince the winged reptiles to fly them back to Eshkrene."}, {"tag": "h3", "text": "Last Stand at Sessal Spire"}, {"tag": "p", "text": "After several days of flying, Kaliska and Takara arrived back at Eshkrene. There, Kaliska succeeded in rallying the entire population of the Doomed. Since they were facing a powerful Dark Jedi who in the ancient past had wrecked much death and destruction during the Hundred-Year Darkness, Kaliska realized that they needed the Doomed's entire manpower. While this intervention would break their historic promise not to go to war near the Keshiri again, the Doomed believed they had a duty to preserve the peace on Kesh by stopping Dreypa at all costs. Kaliska was also aware that the Dark Jedi had hidden several monstrous Sithspawn known as Leviathans within Sessal Spire, a large volcano at the edge of Keshtah's southern coast."}, {"tag": "p", "text": "Meanwhile, Dreypa and Spinner led a revolt against the Lost Tribe. Despite initial successes at the Marisota Floodplain, Dreypa's forces were nearly wiped out by the Tribe's elite Skyborn Rangers, an air force consisting of uvak riders. Dreypa then ordered his Forces to retreat to Sessal Spire, intending to unleash his secret weapon and escape Kesh. After negotiations with the Tribal commander Iliana Hilts failed, Dreypa summoned up several Leviathans which had been hibernating within the volcano. These monstrous Sithspawn quickly killed many Tribes member and rebel alike. Dreypa also abandoned his former lieutenant Spinner since he had outlived his usefulness to the Dark Jedi. In response, Spinner quit Dreypa's cause."}, {"tag": "p", "text": "In the midst of the rampage, Kaliska and the Doomed arrived at Sessal Spire. Doomed archers targeted the Leviathans' blister traps and attempted to avoid close-quarter combat with the Sithspawn. Meanwhile, Takara pursued Spinner, intending to kill him for betraying the Tribe. However, Takara was then distracted by her mother Iliana being attacked by a Leviathan. The Sith princess tried to rescue her mother only to be captured by the beast. However, Spinner intervened and managed to kill the Leviathan, freeing both Takara and her mother. They then escaped the battle on Iliana's uvak."}, {"tag": "p", "text": "Through his mastery of the dark side including Force lightning, Dreypa quickly regained the upper hand against the Doomed. The Leviathans killed or captured many of the Doomed and their uvak steeds. The Leviathans then began draining their Doomed captives' life energies and knowledge. Since Dreypa controlled the beasts through a Sith amulet, he gained access to the thoughts and knowledge of the dying Doomed captives. During a conversation with a Rodian member of the Doomed, Dreypa learnt that the Doomed were the descendants of the Jedi and Dark Jedi who had imprisoned him within the oubliette."}, {"tag": "p", "text": "He then demanded to know why the Doomed had broken their pledge not to go to war again near the Keshiri. The dying Rodian answered that Dreypa's millennia-long imprisonment had been the only thing that ensured peace and denounced Dreypa as their \"great shame\" which had to be put right. Dreypa retorted that he would put all the Doomed right one at a time through their deaths. He then sensed that the Doomed were hiding something from him that he needed to get offworld: the hidden Last Hope. All members of the Doomed with the exception of Kaliska were killed during the skirmish with Dreypa's Leviathans."}, {"tag": "h3", "text": "Final secrets"}, {"tag": "p", "text": "After escaping Sessal Spire, Kaliska rejoined Takara and Spinner. She attempt to convince the Sith to combine forces with the Tribe for an assault on Dreypa. She feared that Dreypa was attempting to return to the greater galaxy in order to attack the Jedi and the Republic. However, both Spinner and Takara were pessimistic about this idea. Spinner claimed that the Tribe would regard her as a \"freakish\" alien while Takara added that her debilitated mother would be unable to lead the Tribe's forces. Despite escaping from the Leviathan's tendrils, the Tribe's commander had been rapidly aged by the beast and reduced to an old woman. During the conversation, Spinner realized that the Tribe had a secret means of leaving Kesh which they had not used yet: the Last Hope."}, {"tag": "p", "text": "After being pressed by Takara, Kaliska finally admitted that a single Jedi starship had survived the Great Calamity. The Doomed's ancient forebears had hidden the vessel in the Keshiri burial cairns beneath the Grand Lord's palace at the Circle Eternal in Tahv. Fearing that Dreypa could use the starship to wreck havoc on the galaxy again, Kaliska urged the two Sith to destroy the vessel. In the end, Spinner agreed to destroy the starship. As part of the plan, he would take the uvak and Iliana back to Tahv. Since Kaliska still did not trust the Sith anarchist, she agreed to accompany Spinner while Takara stayed behind to hold off Dreypa and his Leviathans."}, {"tag": "p", "text": "However, Dreypa and his Leviathans caught up with the party. Spinner and Iliana managed to escape but Kaliska was captured. The Leviathan then drained her life energy and knowledge, killing the last member of the Doomed. Through her death, Dreypa learnt about the location of the Last Hope and ordered his Leviathans to attack Tahv. Takara then fought with Dreypa but proved no match for the Dark Jedi who took her captive again. He intended to use Takara as a hostage to coerce Spinner into handing the Last Hope over. Meanwhile, Spinner arrived back in Tahv and located the starship. However, he reneged on his earlier promise to destroy the vessel and instead took it into the space above Kesh, intending to explore the galaxy."}, {"tag": "p", "text": "However, Dreypa used a holo-emitter to contact Spinner. He threatened to destroy Tahv and to kill Takara if Spinner did not hand over the Last Hope to him. Torn by his love for the Sith princess, Spinner abandoned his earlier plan to leave Kesh and returned to Tahv. There, he used the ship's turbolaser cannons to destroy all the Leviathans. At the climax of the fighting, both Takara and Dreypa landed on the hull of the Last Hope. Spinner took the starship to the Southern Ocean and then set the ship's autopilot on a collision course for Sessal Spire. After \"handing\" the ship to Dreypa, he and Takara jumped into the sea. Meanwhile, Dreypa and the Last Hope crashed into the volcanic crater, where they were killed."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "With the deaths of the Doomed and Baron Dreypa, the last remnants of the early Jedi and Dark Jedi who were stranded on Kesh following the Hundred-Year Darkness passed into the annals of history. The destruction of the Last Hope prevented any information about Kesh and the Lost Tribe's existence from escaping to the wider galaxy until the aftermath of the Second Galactic Civil War. Following the destruction of Dreypa, the Lost Tribe reasserted authority over Keshtah Minor. The former outcast Spinner quickly became lionized by the Tribe as their new \"savior\" and the only living man who had seen the stars from a close distance. He became Grand Lord Varner's new Hand, a secret agent in the service of the Tribe's leadership. Spinner also developed a romantic relationship with his former enemy Takara."}, {"tag": "p", "text": "Grand Lord Varner also sent a second expedition to Eshkrene to explore the Doomed's settlement. Following their deaths, the settlement's buildings had disintegrated into ruins since their will was no longer protecting the settlement. During a private meeting with Spinner, Varner acknowledged that he had sent the Southern Star to Eshkrene because he suspected that it was home to pre-Tribe settlers. Varner also regretted not being able to meet any members of the Doomed since they had sacrificed their lives in an attempt to stop Dreypa and his Sithspawn during the Battle of Sessal Spire. While Spinner regretted that the Doomed had not left another starship, Varner felt that the Tribe was still too disunited to cope with encountering offworld civilizations. The Doomed's role in the Dreypa rebellion was presumably recorded in the Lost Tribe's chronicles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Doomed first appeared in the Star Wars Expanded Universe as supporting characters in John Jackson Miller's Star Wars: Lost Tribe of the Sith—Spiral comic series, a sequel to his Lost Tribe of the Sith short-story series. They were drawn by Andrea Mutti, inked by Pierluigi Baldassini, and colored by Michael Atiyeh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}