{"url": "The_Dragon", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Arms dealers", "Category:Males", "Category:Ortolans"], "nodes": [{"tag": "h1", "text": "The Dragon"}, {"tag": "p", "text": "\"The Dragon\" was the alias of an infamous male Ortolan arms dealer who operated on the planet Anthan Prime. After the Battle of Yavin, Dr. Chelli Lona Aphra, a rogue archaeologist, acquired explosives from him, which she used to assault an Arquitens-class light cruiser in orbit of Anthan Prime. Following the raid, Inspector Thanoth of the Galactic Empire came to the conclusion that the Dragon had supplied the attackers with explosives. The Empire raided the Dragon's mansion after learning its location from Doowan, one of his dealers, and although he attempted to peacefully surrender and offered to tell them everything about his criminal operations, he was executed by Darth Vader, the true orchestrator of the attack on the Imperial cruiser, before he could reveal Aphra's identity."}, {"tag": "p", "text": "The Dragon's data was then used to track down \"the Ante,\" a Givin information broker based on the underside of the floating Anthan Prime city known as the Spire, in order to learn who attacked the Imperial cruiser. Although he was able to point out Aphra as she attempted to evade Imperial forces, he was discreetly killed by Vader using the Force before he could provide a name, leaving her identity a secret."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Dealings with Dr. Aphra"}, {"tag": "p", "text": "The individual known as \"the Dragon\" was a male Ortolan who operated as an arms dealer on Anthan Prime, a planet located on the edge of the galaxy's Outer Rim Territories, after the Battle of Yavin in the year 0 BBY. He was the most infamous arms dealer in his area of operation, and hired others to sell his wares. The Dragon sold explosives to Dr. Chelli Lona Aphra, a rogue archaeologist in service to Darth Vader, who was planning on raiding an Arquitens-class light cruiser in orbit of Anthan Prime that was carrying a large amount of credits confiscated from the Son-tuul Pride, a criminal organization that was based on the Outer Rim world of Son-tuul."}, {"tag": "p", "text": "She used the explosives to destroy a large asteroid in orbit of Anthan Prime, which created a meteor storm that the Imperial ship collided with, hiding the fact that they'd disabled it with an ion charge. Meanwhile, Aphra's crew infiltrated the ship and unsealed its vault, and then set a large meteor on a collision course with the ship, tearing a huge hole in it and jettisoning the credits and any evidence that she and her team were ever there into space, and then collected the credits while making the theft seem like an accident."}, {"tag": "h3", "text": "Imperial retribution"}, {"tag": "p", "text": "However, the Galactic Empire was not fooled and sent Darth Vader, the very person responsible for the attack, and Inspector Thanoth to find the party responsible and deliver justice. After examining the damage rendered to the ship, Thanoth correctly deduced the sequence of events that led to the successful theft of the Empire's credits and that the guilty party had purchased the explosives from the Dragon. They were able to successfully locate Doowan, one of the Dragon's dealers, and coax him into revealing the location of his boss's mansion, which was located in the lower reach of Anthan Prime's eastward core at the coordinates 241-86-1872, before executing him as a show of force."}, {"tag": "p", "text": "The Empire then raided the Dragon's mansion, where he attempted to surrender after his men had been wiped out by Imperial forces, and offered to tell them everything about his operations, including who he had sold the explosives that were used in the attack on the Imperial cruiser to. However, to prevent him from incriminating Aphra, Vader killed the Dragon with his lightsaber and when questioned by Thanoth about what happened, claimed that the Dragon had threatened to blow up the building and that he prevented him from doing so. The inspector noticed that there was no trigger and chastised Vader for not realizing that he was bluffing. Thanoth then located the Dragon's records, which were sealed in a high quality safe that he believed would incinerate its contents after three failures to open it. The inspector was able to open it on the third try after noting that Ortolan secretions were distinctive, and that the amount of sweat on each button showed how often it was used in the sequence that unlocked the safe. Thanoth then took the records in order to discover where the core of Anthan Prime's criminal element was, with the hope that a little more investigation would allow them to discover who attacked the Imperial cruiser."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Using the Dragon's data, Thanoth was able to arrange a private meeting with a Givin known as \"the Ante,\" the sector's prime information broker, who was based in the lower levels of the Spire, a city floating in upper atmosphere of Anthan Prime. Vader then marshaled a strike force of stormtroopers and attacked the Spire in hopes of capturing the Ante and learning who was behind the attack. After locating him, he revealed that he had destroyed his records, but was willing to cooperate and gave them the current location of the Plasma Devils, a criminal organization that was secretly a cell of the Alliance to Restore the Republic, based on the Thanteen Substrata on Anthan 1, a moon of Anthan Prime, that was disrupting Imperial operations across the sector."}, {"tag": "p", "text": "When Thanoth inquired about who had stolen the confiscated credits of the Son-tuul Pride, the Ante pointed out Aphra, who had been present on the Spire for a meeting with him, as she ran past, but before he could provide a name Vader used the Force to manipulate a Mon Calamari into killing the Ante with their blaster, preventing him from telling them her name. Vader was able to corner her and allowed her to escape, and brought down the ceiling to make it seem as if she brought it down with her ship, the Ark Angel. The doctor then evaded capture by Imperial forces after Vader persuaded Thanoth to instead pursue the revealed Plasma Devils, leaving Aphra's identity a secret."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although the Dragon was the most infamous arms dealer in his area of operation, when faced with death he attempted to surrender and offered to tell the Empire everything about his criminal operations, including who he sold weapons to. He was also a man of limited intellect and didn't wash his distinctive sweat off of the buttons of his safe, which, along with having chosen a simple combination, made it easy for Inspector Thanoth to guess its combination."}, {"tag": "p", "text": "A male Ortolan, the Dragon had blue skin and black eyes. Like all members of his species, he didn't have any arms, only legs. He pierced both of his large, floppy ears with four silver rings, and a pendant in the shape of a dragon hung from his left ear."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Dragon wore a vest of silver scale armor over a brown outfit. At the time of his death, he carried a blaster pistol. The Dragon kept his records in a high quality safe in his mansion on Anthan Prime, which Inspector Thanoth suspected would immolate its contents after three incorrect attempts to open it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dragon was first mentioned in Darth Vader 9, a canon comic written by Kieron Gillen and illustrated by Salvador Larroca that was released on September 9, 2015. He made his first appearance and met his demise in Darth Vader 10, which was also written by Gillen and illustrated by Larroca and was released on October 7, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}