{"url": "The_Disaster", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Artificial disasters", "Category:Battles of Alderaan", "Category:Events of the Galactic Civil War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "The Disaster"}, {"tag": "p", "text": "The Disaster, otherwise known as the Destruction of Alderaan, was the name given to the destruction of the planet Alderaan in the Coruscant Core at the hands of the Galactic Empire during the Galactic Civil War. Before the Disaster, the Rebel Alliance stole the plans for the Death Star, the Empire's deep-space mobile battle station. Princess Leia Organa of Alderaan was captured during an Imperial attempt to intercept the plans, and she was brought aboard the Death Star following her capture aboard the Tantive IV above the desert world of Tatooine. Once aboard, the young princess was tortured in the hopes that the Empire could extract the location of the Rebel base from her. Organa refused, and the station's commander, Grand Moff Wilhuff Tarkin, Governor of the Outer Rim Territories, threatened to use the Death Star to destroy Alderaan if she did not comply. Organa provided a false location, and although Tarkin believed her, he nonetheless destroyed Alderaan—and the billions of people living there—to demonstrate the station's power to the galaxy."}, {"tag": "p", "text": "The destruction of Alderaan and the massive loss of life sent a great disturbance through the Force, weakening those who felt it. Alderaanians who were off-world at the time took to calling Alderaan's destruction \"the Disaster\". Riots broke out in Alderaanian immigrant areas of the planet Coruscant, and the Empire killed many rioters and arrested many more immigrants. The Rebellion was ultimately able to prevent further planets from being destroyed when the Rebel pilot Luke Skywalker destroyed the Death Star during the Battle of Yavin. After the battle, Organa set out to find surviving Alderaanians in order to preserve what remained of the planet's culture."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, a trio of Jedi—Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano—were brought to the realm of Mortis by a group of Force wielders who dwelled there. These beings believed that Skywalker was the Chosen One who would one day bring balance to the Force and destroy the Sith. One of the beings, the Son—a representation of the dark side of the Force—showed Skywalker a vision of the Jedi Knight's future as Darth Vader, a Dark Lord of the Sith. In the vision, Skywalker witnessed events of his future, including the destruction of the planet Alderaan, an influential member world within the Galactic Republic. Skywalker briefly turned to the dark side as a result of the vision, but he gave up the dark side and his memory of his future was erased by the Father."}, {"tag": "p", "text": "Throughout the Clone Wars, Alderaan and its representative in the Galactic Senate, Senator Bail Prestor Organa, were publicly opposed to the war effort against the Confederacy of Independent Systems. At the end of the war, Darth Sidious—the Dark Lord of the Sith publicly known as Supreme Chancellor Palpatine—transformed the Republic into the Galactic Empire. In the years that followed, the Empire considered Alderaan to be a hotbed of rebellious activity, and it warned Imperial citizens that Alderaan was a dangerous world intent on ending the security that the Empire supposedly brought to the galaxy."}, {"tag": "p", "text": "Alderaan became a founding member of the Alliance to Restore the Republic, a Rebel Alliance opposed to the Imperial regime. During the Galactic Civil War, the Rebels stole the technical plans for the Death Star, a deep space mobile battle station capable of destroying entire planets. Princess Leia Organa, the adoptive daughter of Bail and secretly the daughter of Darth Vader, was entrusted with bringing the plans to Kenobi, who had gone into exile on the desert world of Tatooine. The princess was captured during a battle over Tatooine, but two droids—R2-D2 and C-3PO—escaped the princess' ship, the Tantive IV, and were able to bring the plans to Kenobi. The Jedi Master, along with Luke Skywalker—secretly Vader's son, and Leia's twin brother—and the two droids, set out to bring the stolen plans to Bail on Alderaan. They hired the Millennium Falcon, captained by the smuggler Han Solo and co-piloted by the Wookiee Chewbacca, to give them passage to Alderaan."}, {"tag": "h2", "text": "The Disaster"}, {"tag": "p", "text": "Following her capture, the princess was brought aboard the Death Star, where she was interrogated and tortured by Darth Vader in the hopes that she would reveal the location of the Rebel base, which was located in the Great Temple on Yavin 4. The torture was ineffective, and Leia refused to give up the location of the Rebellion. In order to persuade her to give up the information, as well as to finally demonstrate the power of the Death Star to the galaxy, Grand Moff Wilhuff Tarkin—Governor of the Outer Rim Territories and the commander of the Death Star—ordered that the station set course for Alderaan."}, {"tag": "p", "text": "Upon the station's arrival at Alderaan, Leia was brought to the Death Star's overbridge where Tarkin threatened to destroy the planet if she did not comply the Empire's demands to provide the location of the Rebellion. Leia was not prepared to give up the Rebels, but she also did not want to lose her homeworld and the millions of people who lived there. As a result, she lied to Tarkin and told him that the Rebel base was located on Dantooine. Although Tarkin believed her, he still intended to make use of the weapon; whereas Dantooine was too remote to give an effective demonstration of the Death Star's power, he saw Alderaan as the perfect target. Tarkin gave the order to fire upon Alderaan, and the Death Star's superlaser destroyed the planet in seconds, sending out a shockwave in all directions. The means of destruction fulfilled the vision that Anakin had seen on Mortis years earlier."}, {"tag": "p", "text": "As a result of its destruction, all that remained of the planet was a debris field. The two billion people living on the planet were killed, including Viceroy Bail Organa and his wife Queen Breha. Bail and Breha were both in the Royal Palace in the capital of Aldera at the time, and saw the Death Star eclipse the sun beforehand. Bail then immediately realized what was about to happen when he saw this, and he and his wife died together, hoping that their daughter was still alive, as the last they had heard of her was that the Tantive IV had been destroyed. The destruction was powerful enough that it sent a massive disturbance through the Force, one that Kenobi felt aboard the Millennium Falcon. Although he could not determine precisely what had happened, he could feel in the Force that millions of voices cried out in terror before they were silenced—the moment of the planet's destruction."}, {"tag": "p", "text": "All Imperials aboard the Death Star were ordered to watch Alderaan's destruction either by eye or on a screen. Thane Kyrell, Ciena Ree, Nash Windrider, and Jude Edivon, recent graduates of the Royal Imperial Academy, were present on the station and witnessed the destruction. Horrified by the Empire's ruthlessness, Kyrell later defected to join the Rebel Alliance. While sharing Thane's horror, Ree was unable to abandon her oath to the Empire and would remain loyal even until the Battle of Jakku five years later. While the Alderaanian Windrider was distraught by the destruction of his homeworld, it ultimately led him to rededicate his life to the Empire. He eventually rationalized his homeworld's destruction as necessary to the security of the Empire, and became ruthlessly dedicated to upholding its tyrannical rule. Meanwhile, Edivon rationalized that the destruction of Alderaan saved many lives from being killed in a war, though she herself struggled to accept this. Despite Edivon's prediction, the planet's destruction only strengthened the Alliance's resolve to overthrow the Empire and avenge the billions murdered. She later identified a flaw in the Death Star's design, but failed to convince her superiors to order an evacuation. Jude later perished during the Battle of Yavin."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following Alderaan's destruction, Imperial forces investigated Leia's claim that the Rebels were on Dantooine. Although they found the remains of a base, it had been abandoned for some time. Following the destruction of Alderaan, Tarkin went to deal with several Imperial weapons technicians, including Chief Gunner Endo Frant, who had hesitated before firing. After an earlier simulation where the gunners failed to fire upon the world Rango Tan, Tarkin had assembled the 168 gunners in charge of firing the superlaser and wrestled with Frant while explaining how dangerous the Rebellion was. Having failed to prove his point, Tarkin had the gunners tossed out the airlock. Meanwhile, the Millennium Falcon had entered the debris field and was captured by the Death Star, forcing its passengers and crew to find a means of escape. While Kenobi disabled the tractor beam that trapped the ship, Luke set off with Solo and Chewbacca to rescue Leia. They fought their way out of the Detention Level and returned to the Falcon, where they witnessed Kenobi engage in lightsaber combat with Vader. To give the Rebels a chance to escape, and to achieve immortality, Kenobi allowed Vader to kill him. The Rebels escaped to the base on Yavin 4, where the Empire followed them. Having analyzed the Death Star plans, the Rebels mounted the Battle of Yavin, in which Luke destroyed the Death Star, killing Tarkin and all Imperial personnel onboard."}, {"tag": "p", "text": "In the days after the planet's destruction, word spread that Alderaan had been destroyed. Alderaanians who were off-world at the time took to calling their world's destruction \"the Disaster.\" Vigils were held amongst the Alderaanian immigrant population on Level 3204 on Imperial Center, the capital planet of the Empire, in order to grieve for the missing and dead Alderaanians. When it became apparent through official government statements and pirated newsfeeds that the Empire had destroyed the planet, the vigils turned into riots, with calls for justice and revolution against the Empire. At first, many rioters were killed. Soon, however, Imperial stormtroopers and Coruscant underworld police arrested first-generation Alderaanians, justifying the arrests by saying that they needed to be questioned due to reports of so-called Rebel spies attempting to foment rebellion. Rumors suggested that second-generation Alderaanians were being given the benefit of the doubt and relocated."}, {"tag": "p", "text": "Many Alderaanians in service to the Rebel Alliance began wearing a tattoo of the Rebel Alliance starbird called a tear beneath their eye following \"the Disaster.\" The symbol was common enough that Imperial troops were able to recognize such fighters as Alderaanian on-sight. Meanwhile, Darth Vader ordered the Imperial Military to annihilate any surviving Alderaanians."}, {"tag": "p", "text": "Following the Battle of Yavin, Evaan Verlaine, a pilot in the Rebel Alliance and one of the surviving Alderaanians, informed Leia that the Empire had begun targeting the remaining Alderaanians. To preserve what was left of her people and her culture, Leia set out with Evaan to locate and save her people from the Empire. Several weeks later, the Rebel Alliance assaulted Cymoon 1 in order to destroy Weapons Factory Alpha, perhaps the largest weapons factory in the galaxy. During the assault, Leia ordered Solo to kill Vader in order to avenge the death of Kenobi and the destruction of Alderaan. Vader survived the attack, however, with only minor injuries."}, {"tag": "p", "text": "During the New Republic Era, two prominent figures of the First Order, Kylo Ren and General Armitage Hux, landed on a tropical planet inhabited by Bylsma, an ex-Alderaan guard who survived the Disaster as he was offworld. When he told Hux about the destruction of Alderaan, the General showed a sadistic smile."}, {"tag": "p", "text": "In 28 ABY, Leia cited the destruction of Alderaan as one of the main reasons for which she couldn't forgive her father, even posthumously, to Senator Ransolm Casterfo from Riosa. Six years later, following the Battle of Crait, while trying to convince the Mon Calamari to join the Resistance and fight against the First Order, Organa acknowledged that what she was asking them would require a kind of sacrifice as she had done several times over the years, silently remembering when the Death Star destroyed her homeworld."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Disaster was first depicted in the 1977 film Star Wars: Episode IV A New Hope and was first identified in the 2014 short story \"One Thousand Levels Down\"."}, {"tag": "p", "text": "Ben Burtt originally considered leaving the explosion of Alderaan silent or to delay it for a few seconds after destruction.[source?] This delayed concept would later find its way in the creation of the sound-delayed seismic charges seen in the 2002 film Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "An early abandoned plot point for the 1983 film Star Wars: Episode VI Return of the Jedi, according to A New Hope producer Gary Kurtz, had the surviving Alderaanians crowning Leia Organa as their Queen, isolating herself. Luke Skywalker was left on his own, as Han Solo's death was also in the plot, and it would give way to the then differently planned sequel trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}