{"url": "The_Courtship_of_Princess_Leia", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "The Courtship of Princess Leia"}, {"tag": "p", "text": "The Courtship of Princess Leia is a Star Wars Legends novel written by Dave Wolverton. It was first published on April 1, 1994 by Bantam Spectra. The novel is set in 8 ABY, four years after the events of Star Wars: Episode VI Return of the Jedi, and it ends with the wedding of Han Solo and Leia Organa."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Darth Vader and the Emperor are dead, but the Empire lives on and the Alliance must continue the struggle with dwindling supplies of cash and resources. Princess Leia, seeking rich, powerful allies to bring into the Alliance and a new planet as a home for the influential refugees of Alderaan, considers a proposal that could tip the balance of power against the evil Empire. The Hapes consortium, a cluster of sixty-three high-tech worlds, is ruled by the Queen Mother, who wants Leia to marry her son, the dashing and wealthy Prince Isolder."}, {"tag": "p", "text": "When Han Solo hears the news of Leia's impending nuptials, he reacts with shock. Han always dreamed of marrying Leia himself, but in spite of his heroic exploits he feels that she sees him as nothing more than a shiftless rogue and Corellian pirate, unworthy of her hand. Now he makes a desperate last gamble to win her back. Tricking Leia into accompanying him, Han flees with her to the beautiful and untamed planet Dathomir, where he hopes to win her heart."}, {"tag": "p", "text": "Fearing the imperious queen's reaction to Han's rash move, Luke Skywalker forms an unlikely alliance with Prince Isolder to track down the runaways. Luke has been traveling the far reaches of the galaxy in search of the scattered lore of the Jedi Knights. But when he, Artoo, and Isolder set off to Dathomir, Luke little suspects that it is only the beginning of an adventure that will lead to the discovery of an awesome treasure, a group of Force-trained \"witches\"…and a showdown with an invincible foe."}, {"tag": "p", "text": "The Courtship of Princess Leia relives the swashbuckling epic of the Star Wars film trilogy as starcruisers battle for control of space, knights of a forbidden order rise again, and a pirate sues for the heart of a maiden."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo, who had been aboard the Mon Remonda continuing the search for this hidden fortress, is wearily returning to the recently captured Coruscant and expecting an end to the long separation from his beloved, Princess Leia, the head of the New Republic. To his great surprise, when his vessel drops out of hyperspace and into the Coruscant system, he encounters a number of fearsome Imperial Star Destroyers, Hapan Battle Dragons, and a Nova-class battle cruiser. Han soon learns that the Hapes Cluster has sent a delegation of some kind to the New Republic to meet with its representative. Upon entering the Imperial Palace, Han enlists the help of C-3PO to translate and comment on the formal diplomatic reception. While observing the reception, Han watches as the Hapes delegation presents Leia with a number of stunning gifts from each world in the Hapes cluster, among them the dozen Star Destroyers Han had seen, a Hapan gun of command, a small plant resembling a bonsai which promotes longevity and intelligence and, most shockingly of all, the hand of Prince Isolder, the son of Ta'a Chume (the current ruler of the Hapes cluster), in marriage."}, {"tag": "p", "text": "When Leia nearly accepts this startling proposal, Han is driven into a frenzy of fear and jealousy. Guided by his desperation, Han wanders into a dive of a cantina in the lower reaches of Coruscant, where he participates in a high-stakes sabacc game. During the game, one of Han's opponents runs out of liquid financial instruments and instead proffers real estate in the form of a deed to an entire habitable planet, Dathomir. Thinking he has found a gift which would prove his worthiness to Leia and compare favorably with the gifts of Isolder (providing a place to resettle the expatriates of Alderaan to boot), he immediately rushes to her side to present his winnings. When Leia examines his gift and points out playfully that he has been conned (since Dathomir is in the section of the galaxy controlled by Zsinj), Han is devastated. To add insult to injury, Isolder denigrates the Millennium Falcon and offers Han a Nova battle cruiser if he abandons his quest to win Leia's heart. This last slight is enough to drive Han over the edge; he abducts Leia using the Gun of Command, and flees with her and Chewbacca, aboard his recently refitted Millennium Falcon, to Dathomir."}, {"tag": "p", "text": "Upon discovering the abduction, Prince Isolder pursues Han with his Hapan Battle Dragon and arrives at Dathomir shortly after Solo despite his head start. Isolder was able to track Han with the assistance of the Jedi Master Luke Skywalker who had returned from his mission to Toola having found only a despoiled Jedi archive. Luke aided Isolder by using his Force powers to navigate a shorter (but still safe) path through hyperspace, shaving time off other conventional routes. Arriving on Dathomir, Luke and Isolder discover that Zsinj had truly laid claim to Dathomir by establishing in the planet's orbit the Iron Fist, a number of other capital ships, and the complete orbital shipyard Han had hunted for so long."}, {"tag": "p", "text": "By this time, the Millennium Falcon has been forced to land on Dathomir itself, where it is captured by the Imperial garrison Zsinj had marooned on the surface years ago. Isolder immediately sets out in his Miy'til starfighter accompanied by Luke's X-wing while the Hapan fleet provide cover fire before leaving to inform the New Republic, Imperial Remnant, and the Hapes Consortium of the whereabouts of Zsinj (which had long been unknown)."}, {"tag": "p", "text": "On the surface, Isolder and Luke discover the remnants of the star-borne Jedi training academy, the Chu'unthor. Luke remembers having seen recordings of Yoda and a number of other Jedi knights failing to retrieve the library of the Chu'unthor due to interference by the Witches of Dathomir. Despite their intentions, the best the other Jedi had been able to do was seal the vessel thoroughly; so thoroughly that only centuries later the first intruder would need a lightsaber to break in. While attempting to gain access to the ship Luke is captured by a Dathomiri witch. Luke and Isolder, who was also captured only moments earlier, are taken back to her village."}, {"tag": "p", "text": "Meanwhile, Zsinj, who has also learned about Han Solo's presence on the planet, offers both an ultimatum and exchange to the head of the Nightsisters, Gethzerion. If the sisters will release Han to him to torture and execute as he likes, he will reward them with a Imperial shuttle to leave the planet. If they do not comply, however, he will keep his \"nightcloak\" (an interconnected network of geostationary satellites, which reflect all solar emissions back into space) intact, which will slowly freeze Dathomir until no life can continue to survive."}, {"tag": "p", "text": "Han and Leia soon infiltrate the Imperial garrison and steal the Falcon, piloting it out into the ongoing Battle of Dathomir. Han purposely allows the Iron Fist to acquire the Falcon with a tractor beam; once he is within the deflector shields, he breaks free of the beam lock and pilots his ship over the superstructure of the gigantic vessel. Once on the main bridge, he launches two concussion missiles which destroy the bridge, kill Zsinj, and knock out the ventral shields. With Iron Fist now completely exposed, the Hapan Battle Dragons move into position with their ion cannons, and disable the station. In the face of this catastrophic defeat, Zsinj's empire soon crumbles."}, {"tag": "p", "text": "Shortly thereafter, Solo and Leia marry, having realized during their intrepid journey together that they do indeed love each other. Isolder also gets his happy ending as it is revealed that he has fallen in love with his captor, Teneniel Djo, and asks her to marry him."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Courtship of Princess Leia was written by Dave Wolverton and was the author's first Star Wars novel. According to Wolverton, he had watched the 1954 musical film Seven Brides for Seven Brothers and became inspired to write about Leia Organa and Han Solo's marriage, which was first established in Timothy Zahn's 1991 novel Heir to the Empire. Wolverton wrote the novel as a \"romance,\" and he aimed to include a sense of humor and bold ideas."}, {"tag": "p", "text": "The Courtship of Princess Leia was first published as a hardcover Bantam Spectra original on April 1, 1994."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}