{"url": "The_DarkStryder_Campaign", "categories": ["Category:Real-world articles", "Category:West End Games sourcebooks"], "nodes": [{"tag": "h1", "text": "The DarkStryder Campaign"}, {"tag": "p", "text": "The DarkStryder Campaign is a supplement to Star Wars: The Roleplaying Game published by West End Games. This boxed set features a 14-page original story by Timothy Zahn called The Saga Begins and was published on July 17, 1995."}, {"tag": "p", "text": "This boxed set is the start of a campaign of adventures set in the early years of the New Republic in the remote Kathol sector. The DarkStryder Campaign includes a full color-map of the modified Corellian Corvette FarStar and a set of stat cards."}, {"tag": "p", "text": "The complete campaign is formed by:"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A long time ago in a galaxy far, far away ..."}, {"tag": "p", "text": "Four years after the Battle of Endor, the struggle against the remnants of the Empire continues. A New Republic task force has been dispatched to the distant Kathol sector to topple rogue warlord Moff Sarne. During the battle, the New Republic discovers mysterious artifacts known as \"DarkStryder technology.\""}, {"tag": "p", "text": "Join the crew of the Corellian Corvette FarStar as they scour the fringes of the Empire in search of Sarne and the source of the DarkStryder technology!"}, {"tag": "p", "text": "Captain Keleman Ciro—A member of Page's Commandos, handpicked by Lt. Page to lead the FarStar mission."}, {"tag": "p", "text": "Kaiya Adrimetrum—A New Republic commando, Kaiya is eager for revenge against the Empire."}, {"tag": "p", "text": "Gorak Khzam—The FarStar's security officer claims to be an independent trader."}, {"tag": "p", "text": "Darryn Thyte—Thyte is the communications officer no ship in the New Republic wanted. The FarStar got him."}, {"tag": "p", "text": "Jessa Dajus—Imperial officer Dajus has inside information on Sarne's plans, but her loyalty is held in question."}, {"tag": "p", "text": "Loh'khar the Finder—The Twi'lek \"procurement specialist\" who can cut any deal ... any deal at all."}, {"tag": "p", "text": "Ranna \"Wing-Ripper\" Gorjaye—The FarStar's fighter commander, Gorjaye knows there are two ways to do things: her way and the wrong way."}, {"tag": "p", "text": "Kl'aal—The Defel scout who escaped Sarne's regime and has pledged his services to the FarStar."}, {"tag": "p", "text": "Akanseh—The Mon Calamari medic wrongfully imprisoned by the Empire."}, {"tag": "p", "text": "Brophar Tofarain—The FarStar's chief mechanic and shuttle pilot."}, {"tag": "p", "text": "Lofryyhn—A personal friend of Kaiya, this Wookiee has a score to settle with Sarne."}, {"tag": "p", "text": "Sent into unexplored space with no support ships or supply stations, the crew of the FarStar must accomplish their mission by any means necessary ..."}, {"tag": "h2", "text": "Short stories"}, {"tag": "h2", "text": "Adventures"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This campaign is set in 8 ABY."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}