{"url": "The_Droid_Rescue_Gambit", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: All-Stars"], "nodes": [{"tag": "h1", "text": "The Droid Rescue Gambit"}, {"tag": "p", "text": "\"The Droid Rescue Gambit\" is the fifth episode in the LEGO Star Wars: All-Stars television series. It debuted on November 2, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "At the Resistance base on D'Qar, BB-8 tosses out an old capacitor while fixing Poe Dameron's T-70 X-wing starfighter, Black One. Roger criticizes BB-8 for wasting supplies and tells him what is thought to be useless can be useful. Roger then reads Chapter 202 of his autobiography, From Trenches to Wrenches: The Roger Story: \"The Droid Rescue Gambit.\""}, {"tag": "p", "text": "Back in the days of the Rebellion, Roger and Chopper attend a rebel briefing. Lieutenant Valeria shows the rebels a hologram of an Imperial Gozanti-class cruiser. She tells them that the Empire is sending a shipment of obsolete droids to a meltdown facility. Roger protests that this is outrageous, a sentiment echoed by fellow Clone Wars veteran Chopper."}, {"tag": "p", "text": "Roger vows that no droid will be left behind and departs with Chopper for the hangar. Roger offers to fly a T-65 X-wing starfighter while Chopper sits in the astromech socket. Chopper, however, rejects the arrangement due to bad memories. Roger tries to convince Chopper to change his mind by trying out the astromech socket for himself. However, Chopper takes the opportunity to enter the cockpit and fly the ship for himself, to Roger's horror. As the X-wing rockets through space, Roger expresses his regret at defending droids with broken processors and vows never again."}, {"tag": "p", "text": "Later, aboard the Gozanti cruiser, an Imperial officer tells his fellow officer that droid transport duty is boring. Just then, the second officer picks up a dead X-wing in space. The second officer wants to blast the ship, but the first officer says that the scanner reveals no life forms and cites the Emperor's \"no wasted\" cannon policy. The second officer grumbles about cost-cutting."}, {"tag": "p", "text": "After playing dead, Roger tells Chopper to reactivate the X-wing and fire at the cruiser's rear engines. With the Imperial cruiser disabled, Roger tells Chopper to board the ship. The second officer laments not blasting the X-wing. The first officer tells him to blame the Emperor. The doors to the bridge open, and the Imperials are confronted by several droids including a silver protocol droid, a green astromech droid, a probe droid, and an IT-O Interrogation Unit. When the first officer counters that the droids have restraining bolts, Roger reveals that they have been removed. The droids take revenge on their Imperial captors."}, {"tag": "p", "text": "Roger recalls that when the droids got back to the rebel fleet, they proved quite useful. One astromech droid services Valeria's starfighter while the protocol droid offers Admiral Ackbar a drink of hot caf. The interrogator unit finds work offering a rebel crew member his handkerchief."}, {"tag": "p", "text": "Returning to the present, Roger tells BB-8 the moral of the story is that every old part can have a new purpose. However, the capacitator explodes, severing Roger's left arm. When BB-8 beeps, Roger concedes that some things are just junk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}