{"url": "The_Drunk_Side", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with gameplay alternatives", "Category:Cantinas", "Category:Korriban locations"], "nodes": [{"tag": "h1", "text": "The Drunk Side"}, {"tag": "p", "text": "The Drunk Side, also known as the Dreshdae Cantina, was a cantina located within the settlement of Dreshdae on the planet Korriban, in operation during the Jedi Civil War. The cantina's bartender, who also managed the establishment, was the Rodian Mika Dorin; he had taken over from the bar's previous owner, who had run afoul of Czerka Corporation over the establishment's operations. Along with spacers and freighter crews who ferried Sith artifacts from the surface, many of the instructors from the nearby Sith Academy would stop by the establishment. Yuthura Ban was the most common face present, often staying there when visiting the colony. While there, she gave final approval to Sith hopefuls who had been given medallions, which signified their worthiness to attend the Academy. When the former Dark Lord of the Sith Revan, who had been mindwiped and retrained by the Jedi Council, came to Korriban in 3956 BBY, he met with Ban at the cantina, gaining her sponsorship to attend the Academy. The cantina was also home to Mika's under-the-table business that sold \"premium items,\" such as prototype Verpine shields and life support packs to special customers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The cantina itself was a simple affair, constructed as an extension of the Dreshdae settlement building, and only sparsely-decorated. Consisting of a single rectangular room, its long, U-shaped bar jutted out from the far wall nearly the full length of the establishment, while seats and small tables lined the sides."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built alongside the rest of the settlement, which served as the sector hub of Czerka Corporation operations within Sith Space, the cantina served spacers of many different species. During the Jedi Civil War, hopefuls from around the galaxy gathered there, hoping to demonstrate to any passing Sith that they were worthy to attend the Korriban Sith Academy that had been established by Darth [Revan/Legends|Revan's]] Sith Empire. Many of these hopefuls were largely ignored, though some were subjected to violent ends by the Academy's student body. At the same time, many freighter crews, contracted with the shipping of Sith artifacts off-world from the excavations within the Valley of the Dark Lords, where many ancient Sith Lords were buried, loitered at the cantina in between jobs. When the establishment's first owner nearly ruined the cantina financially, earning the ire of Czerka Corporation, the Rodian bartender, Mika Dorin, took over the bar's operations. He also began a side business selling \"premium\" arms and equipment to owners of the Dynamic-class freighter Ebon Hawk."}, {"tag": "p", "text": "When the mind-wiped and retrained Jedi Revan, accompanied by his comrades aboard the Hawk, arrived on Korriban in 3956 BBY, he visited the cantina, seeking clues to the location of that planet's Star Map. This ancient piece of Rakatan technology provided data that, combined with information from other Maps, provided the location of the Star Forge, the hidden weapons factory that was the pinnacle of the Infinite Empire and the power behind the Sith war effort. While asking various patrons about the artifact, Revan found that his vessel was the subject of admiration among the pilots and crew that frequented the place. Included among them was the bartender Dorin, who, along with a pair of Human pilots, treated Revan to a brief and admiring history of the Hawk and the \"services\" it had performed in the past. This included describing the ship's true purpose, smuggling, and information about those who had owned the vessel previously. Some time later, after securing a Sith Medallion from a student he had killed in order to defend a woman that the Sith had been threatening, Revan returned to the cantina to present the icon to the Twi'lek instructor Yuthura Ban. Ban, who was apprenticed to the Sith Master Uthar Wynn, was considered second-in-command at the Academy, and was intrigued by Revan's power in the Force. She voiced her suspicions that there was more to Revan than he claimed. Revan, however, managed to persuade her that he wished to join the Sith, as getting into the Academy was the only way to reach the Valley and the Map that he suspected was to be found there."}, {"tag": "p", "text": "After being accepted into the Academy, Revan and one of his companions, the Cathar Padawan Juhani, met a Sith archaeologist named Dak Vesser in the Valley of the Dark Lords. Not wanting to have anything to do with either of them or whatever had brought them to Korriban, Vesser took refuge in the cantina prior to departing the planet, but not before telling Revan about the tombs in the Valley and speaking with Juhani about their past as fellow Jedi trainees. When the Academy fell into chaos following the death of the headmaster, Wynn, and the redemption of Ban to the light side following Revan's double-cross and betrayal within the tomb of Naga Sadow, the cantina continued to do business. Eventually, Dorin, with the assistance of his partner Ziagrom, learned of Revan's true identity as the former Dark Lord of the Sith, and offered him access to the premium items they sold, including thermal detonators, life support packs, prototype personal shields, and advanced armor suits. Prior to setting out for Lehon and the Star Forge, Revan again returned to the cantina to partake in this continuation of the under-the-table business that the pair had traditionally carried out with prior owners of the Ebon Hawk."}, {"tag": "p", "text": "By 3951 BBY, Korriban was largely abandoned. When Meetra Surik arrived on the ancient Sith world sometime that year, she found the Academy deserted and access to Dreshdae blocked, forcing Atton Rand, serving as pilot, to land the Hawk in the Valley of the Dark Lords itself. Infighting among the Sith in the years following the Jedi Civil War had rendered the planet virtually uninhabited."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Drunk Side was frequented primarily by transient beings, mostly Humans, Twi'leks, or Rodians, which included spacers on layover, freighter crews awaiting a new shipment off-planet, those hoping to become students at the Sith Academy that had been established not far from Dreshdae, and Sith students themselves. The most prominent patron was easily Yuthura Ban, who, when not teaching at the Academy, would loiter in the cantina, waiting to pass final judgment on those who had acquired Sith medallions. Pazaak was also a popular pastime at the cantina; the Rodian Toll Apkar was often present and willing to play a few hands."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cantina was first introduced in the video game Star Wars: Knights of the Old Republic. Though it is referred to as the \"Dreshdae Cantina\" in dialogue, reading the sign next to the entrance shows the name, which is a play on the phrase \"The Dark Side.\""}, {"tag": "p", "text": "The player, as Revan, has a number of options dealing with the cantina. However, most of them are unrelated to the player's chosen alignment. With the exception of meeting Yuthura Ban, all other interactions that relate to The Drunk Side are completely optional. However, they do point toward the ultimate quest that has to do with that planet, which is finding the Star Map hidden in the tomb of Naga Sadow. While interacting with Yuthura, the player can choose to lie about their intentions if playing the canonical light side storyline or, if following the dark path, can express an honest desire to join the Sith. If the player has Juhani with them when entering the Valley of the Dark Lords and talks with Dak Vesser, he will flee back to The Drunk Side, intending to run away from the Sith after being discovered. The player has the option to follow him back to the cantina, and either let him go or attempt to kill him; if Juhani is in the party, however, she will prevent the latter choice from occurring."}, {"tag": "p", "text": "In addition, the \"premium items\" quest is not always available, due to how the quest is spawned in the wake of the escape from the Leviathan. It is not certain what triggers the appearance of Ziagrom, who gives the player the option of buying the items from Dorin at the cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}