{"url": "Battle_of_Liinade_III", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Hegemony theater", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Liinade III"}, {"tag": "p", "text": "A battle occurred at the planet Liinade III in 9 ABY. It was the first battle in a New Republic campaign against rogue Imperial warlord Delak Krennel."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Liinade III was chosen as the first target for the New Republic forces to strike in their campaign against the self-styled 'Prince-Admiral' Krennel. It was decided by Admiral Gial Ackbar that capturing the world would destabilize Krennel's regime sufficiently. Krennel advertised his Hegemony as a safe haven; Liinade was an attractive and prosperous world. Not only would the fall of Liinade III shock the citizens of the Ciutric Hegemony, but the planet also had close trade links with Corvis Minor and Vrosynri 8, which would be weakened by the planet's fall."}, {"tag": "p", "text": "The force assigned to the mission was largely the same one which would operate throughout the early stages of the campaign. Admiral Kir Vantai and Commander Sair Yonka both operating with the Imperial II-class Star Destroyers Moonshadow and Freedom and Admiral Areta Bell with the Swift Liberty, a Victory II-class Star Destroyer, along with General Wedge Antilles' Rogue Squadron and Horton Salm's wing of B-wings. Once any capital ships defending Liinade were disabled or destroyed, Assault shuttles from the Freedom would take the planet; the ground-side operation was estimated to need at least two weeks to complete."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Opening stages"}, {"tag": "p", "text": "Liinade III was guarded only by the Direption under Commander Vict Darron. Darron had requested additional troop support as he predicted a strike on Liinade III, but Krennel had denied him more aid than a solitary Dreadnaught-class heavy cruiser. Some time during the day, Darron was informed by his sensor officer, Lieutenant Harsis, that the Moonshadow and the Swift Liberty had dropped out from hyperspace and begun disgorging their fighters. Darron scrambled his wing mixed of TIE/LN starfighters and TIE/IN interceptors to defend."}, {"tag": "p", "text": "Admiral Bell's Swift Liberty targeted the starboard guns of the Direption, knowing full well that even if her less powerful ship got into a slugging match with the Hegemony Star Destroyer the Moonshadow would hammer it. Darron turning to attack both of them suggested he had further support incoming; what the Hegemony Commander didn't realize was that the New Republic did as well. As the starfighters met between the capital ships, Darron brought his attention fully to bear on Moonshadow, ignoring the Swift Liberty for the time being."}, {"tag": "h3", "text": "Slugging match"}, {"tag": "p", "text": "As Rogue Squadron made short work of the TIEs, Moonshadow concentrated all fire on Direption's port edge with a devastating barrage which brought down the shields over that part of the ship, while the Swift Liberty swung down beneath the Hegemony ship and attacked the ventral shields and the already damaged port edge. As the Victory Star Destroyer's fire continued a chunk of the Direption broke off into space. Darron called in his support."}, {"tag": "h3", "text": "Reinforcements"}, {"tag": "p", "text": "The Dreadnaught came out from hyperspace behind the Swift Liberty, blasting the aft of the ship. Luckily for Bell, her crew had been prepared and shunted power to the shields to reinforce them. Ignoring the Dreadnaught, the Swift Liberty continued its attack on the besieged Direption. Darron swung his ship about, swinging the shieldless port side away from the Moonshadow to buy time for the Dreadnaught to knock out the Swift Liberty. Unfortunately, Bell and Vantai coordinated their attack, with Moonshadow assaulting the aft shields and Swift Liberty attacking the unshielded port."}, {"tag": "p", "text": "Just as the Dreadnaught brought down the aft shields of the Swift Liberty, concentrating its firepower on her engines, Sair Yonka's Freedom jumped into the system. Knifing between Direption and the Dreadnaught, Yonka's starboard broadside dealt tremendous damage to the failing Hegemony ship, in some areas bursting through both sides of the ship's stricken port side. Freedom's port gunners targeted the Dreadnaught, and one sustained barrage beyond the forward superstructure overloaded the shields. Yonka didn't let up; the smaller ship was quickly overwhelmed by the sheer volume of fire being poured into it and split in half following a huge explosion."}, {"tag": "p", "text": "Commander Darron accelerated deeper into the system, but salvos from the Moonshadow and Swift Liberty overloaded both the starboard and aft shields. Thankfully the Hegemony commander was realistic enough to view the engagement as a loss and surrendered his ship."}, {"tag": "h3", "text": "Taking the planet"}, {"tag": "p", "text": "After the surrender of the Direption, the New Republic forces began landing troops in strategic locations on Liinade III. Although Lieutenant Horn was shot down during his raid on a dam, operations were otherwise successful. A squad of four AT-AT walkers came out to defend Valleyport spaceport facility against Antilles' X-wings, but were no match for the nimble starfighters. One by one the walkers were destroyed and Valleyport was secured for troop landings."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Lieutenant Horn's discovery of a secret lab near where he crashed yielded alarming results; records of a superweapon Krennel was supposedly planning to build. The information was taken very seriously by High Command; plans were drawn up to scout the systems of the Ciutric Hegemony. The findings were in fact planted by the real Ysanne Isard; the subsequent ambush at Distna was a devastating defeat for the pilots of Rogue Squadron."}, {"tag": "p", "text": "In terms of the campaign against the rogue warlord, Liinade III was a staging point for incursions into the Hegemony. Liinade III was a trade hub; the New Republic's foothold would prove costly to Krennel. In response to General Airen Cracken broadcasting the news that Krennel was constructing a superweapon, the Prince-Admiral stepped up his propaganda campaign, while continuing to attack convoys bound for the planet as he could not risk a costly full-frontal assault."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}