{"url": "The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Canon young-reader novels", "Category:Junior film novelizations"], "nodes": [{"tag": "h1", "text": "The Empire Strikes Back: So You Want to Be a Jedi?"}, {"tag": "p", "text": "The Empire Strikes Back: So You Want to Be a Jedi? is a canon junior novel written by Adam Gidwitz, with interior artwork by Ralph McQuarrie and Joe Johnston. It adapts the film Star Wars: Episode V The Empire Strikes Back, and was first published on September 22, 2015 by Disney–Lucasfilm Press."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Acclaimed, New York Times best-selling author Adam Gidwitz delivers a captivating retelling of Star Wars: The Empire Strikes Back like you've never experienced before, infusing the iconic, classic tale of good versus evil with a unique perspective and narrative style that will speak directly to today's young readers while enhancing the Star Wars experience for core fans of the saga."}, {"tag": "p", "text": "This illustrated novel is the first in the highly-anticipated series and features richly detailed art by celebrated Star Wars concept artist Iain McCaig-the creative mind behind the prequels characters Darth Maul and Padmé Amidala. Fans old and new will be delighted by this beautifully crafted book and the unexpected twists in this retelling of a beloved story.[source?]"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "On June 5, 2015, Disney revealed the cover artwork for the titles in the series."}, {"tag": "p", "text": "Although early announcements stated this book would feature art by Iain McCaig, the published book instead utilized interior art by Ralph McQuarrie and Joe Johnston with cover art by Khoa Ho."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The story is a retelling of Star Wars: Episode V The Empire Strikes Back, but with additional scenes, added comments and humor. Placed between chapters are lessons to the reader on how to be a Jedi, such as \"how to meditate, how to meditate while standing on one foot; how to meditate while standing on one foot while people are throwing dirty socks at you.\" The book's style is similar to Gidwitz's popular Grimm books. The narration is written partially out-of-universe, with references such as the Tin Man from The Wizard of Oz and \"British butlers.\" The second-person perspective of Luke Skywalker is also used at times."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}