{"url": "The_Embersteel_Blade", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "The Embersteel Blade"}, {"tag": "p", "text": "\"The Embersteel Blade\" is the fourth episode of the second season of LEGO Star Wars: The Freemaker Adventures. It was released on Disney XD on August 1, 2017."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "In an attempt to attain parts for the Arrowhead, Kordi Freemaker goes undercover at a swanky Imperial auction.…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Exposition"}, {"tag": "p", "text": "At the Imperial Palace on Coruscant, Darth Vader tells his Imperial officers that they need more kyber crystals to power the second Death Star. The officers report that they have found nothing as Lord Vader flips the holoprojector showing numerous Outer Rim worlds. He warns the commander that if he says nothing the next time, he will crush him. The officer tries to avoid reporting nothing but Vader loses patience and Force chokes him. Vader says they need to find another sources of kyber crystals."}, {"tag": "p", "text": "Vader is contacted via hologram by Emperor Palpatine, who asks him about the progress of the second Death Star. Vader and the officers claim they are making progress. When the Emperor leaves, Vader tells his officers they can resume their \"cowardly\" panicking."}, {"tag": "h3", "text": "Kordi's \"airtight\" plan"}, {"tag": "p", "text": "Meanwhile, Zander Freemaker and Rowan Freemaker are studying a model of the Arrowhead. When Zander asks where they should start, Rowan replies that they need something strong for the Arrowhead's blade. Quarrie tells them that they need one made from embersteel. Quarrie explains that embersteel is very rare and expensive and that he will have a hard time finding it. Kordi Freemaker then reports that an auction of rare ships is taking place on Mygeeto. One of the items on sale is a Theta-class H-2 executive star shuttle, which has embersteel wings."}, {"tag": "p", "text": "Kordi tells them that the auction is being held by the Empire to sell off ships that had been seized from Rebel Alliance sympathizers. Rowan is adamant on getting the wings until Zander tells him that they are selling them for 75,000 Credits. Kordi says she know who can loan them that money. She meets with Admiral Ackbar, Chancellor Mon Mothma, General Crix Madine, and General Hera Syndulla in the Home One's command center. Admiral Ackbar is shocked at Kordi's plan and accidentally spills coffee on Madine's tunic."}, {"tag": "p", "text": "While General Hera and Admiral Ackbar are reluctant, Kordi responds that the rebels want a ship that will turn the tide of the war and reassures them that she has an airtight plan. Hera and Ackbar agree to sanction her mission but Ackbar warns Kordi that she will have to pay back all the money that they loaned her should she fail. Kordi says she understands."}, {"tag": "p", "text": "Zander decides to travel lightly and separates the StarScavenger from its cargo compartment. Zander flies the StarScavenger out of Home One. Kordi is optimistic but Zander warns his sister that this auction is for the \"fanciest high rollers\" in the galaxy. Kordi reassures her brothers that she has got every last detail figured out and shows off her purple dress."}, {"tag": "h3", "text": "Infiltrating the Auction House"}, {"tag": "p", "text": "Outside the Mygeeto Auction House, various bidders arrive from all over the galaxy including a pair of Neimoidians. Kordi disguises herself as a princess but trips on her own dress, which Roger warns is a bad omen. Zander and Rowan are disguised as her servants and wear similar purple costumes. As she approaches the stormtrooper sentries, Kordi poses as the shape-shifting Clawdite princess Alo Kortessi of Zolan. When the stormtroopers point out that her face does not match their profile, Kordi points out that she is shape-shifter. When the stormtroopers asks her to prove her ability, Kordi pretends to throw a tantrum and threatens to call the Emperor. The stormtroopers let her through and arrest the real Princess Kortessi when she turns up."}, {"tag": "p", "text": "The Freemakers are relieved to have succeeded in infiltrating the Auction House. Shortly later, Ignacio Wortan, Wick Cooper, and Graballa the Hutt enter the auction house as well. Meanwhile, Zander gets excited when he sees an E-wing escort fighter and a Koro-2 all-environment Exodrive airspeeder. Kordi tells her brothers to leave the auction bidding to her but a Cerean auctioneer tells Kordi that nobles do not enter the bidding floor but send their underlings to do their bidding. Kordi panics but Zander reassures her they will get through."}, {"tag": "p", "text": "Meanwhile, Graballa is walking with his valet Yeppau, and the bounty hunters Baash and Raam. Graballa thinks that the auction house is the perfect place to find investors to build his beachside resort and sends his minions to enjoy their buffet. Baash and Raam are relieved and remark that Graballa is not a good reader. Graballa asks the Cerean auctioneer which way to the luxury terrace. The auctioneer responds that it is only for nobles, but Graballa counters that he wants to get away from the \"rift raft\" and makes fun of the two-headed Fodesinbeed Annodue."}, {"tag": "h3", "text": "Getting into knots"}, {"tag": "p", "text": "In the auction room, Zander tells Rowan that their plan is to bid on the H-2 shuttle and win. In the luxury suite, Kordi watches the auction while mingling with the nobles and munches on a tray of cupcakes. The announcer introduces the first item in the auction, a yellow Eta-2 Actis-class light interceptor. Zander is mesmerized and wants to bid on the fighter, which he thinks is worth 30 credits. Rowan reminds him that they need to bid on the H-2 shuttle. Zander counters that this ship can help the Rebellion, but Rowan tells him to keep their plan simple. Despite Rowan's and Kordi's objectors, Zander bids for the Eta-2 light interceptor."}, {"tag": "p", "text": "Kordi is startled by Ignacio Wortan and hides under an astromech droid who is serving as a waiter. She eavesdrop on Cooper asking why some people want to be poor. Kordi bumps into Graballa, who does not recognize her but still thinks that the princess reminds him of the \"Freemaker girl.\" Kordi keeps up her disguise as Princess Kortessi and tries to evade Graballa. She claims that she visited Kordi at the Freemaker Garage in the Wheel space station."}, {"tag": "p", "text": "Believing that Princess Kortessi is wealthy, he tries to entice her into investing in his \"Graballa's Beachside Resort and Buffet\" while Yeppau holds up a datapad. Graballa tells Kortessi that Pong Krell is the hotel's masseur. Back at the auction, Zander buys the Eta-2 light interceptor only to discover that the ship is worth 65,000 credits. The Cerean auctioneer tells him that the credits are payable now and that all sales are final. Rowan is frustrated. Back at the luxury suite, Kordi manages to escape Graballa by heading to the ladies' room. Graballa tells Yeppau that she isn't coming back and tries to sell his beachside resort to other guests."}, {"tag": "h3", "text": "Entanglements with Graballa"}, {"tag": "p", "text": "Zander and Rowan try to tell the auctioneer it was a mistake but he does not care. Kordi pulls her brothers into another room and scolds Zander for wasting their money on the wrong. Rowan says that he tried to stop Zander. Kordi screams in frustration, briefly alarming the stormtroopers who think it is a random scream. As the auction continues, Baash and Raam munch on Mygeeto burritos. They enter the auction room while the announcer is auctioning the H-2 shuttle. Raam accidentally bids for the H-2 shuttle much to Kordi's dismay."}, {"tag": "p", "text": "Back at the Rancor's Fist, Graballa lambastes Baash and Raam for bidding on the H-2 shuttle, which he dismisses as junk. Raam offers him a kornmino dog but Graballa hurls it at Dengar. When Graballa asks Dengar why he was not minding the \"brickheads\", Dengar counters that Graballa did not hire him to be a babysitter. Graballa retorts that he did not hire Dengar to be a freeloader. The Freemakers sneak into the dock where the Rancor's Fist is berthed. Kordi refuses to tell Zander her new plan because she cannot trust him. Graballa is upset about spending 75,000 credits on an unwanted ship."}, {"tag": "p", "text": "Kordi, still disguised as Princess Kortessi, feigns interest in Graballa's resort and expresses interest in the H-2 shuttle. She offers to trade the Eta-2 Jedi starfighter her underlings obtained with the H-2 shuttle. Kordi offers to exchange the ship in return for convincing her wealthy parents to invest in Graballa's resort. Graballa instead decides to kidnap Kordi and extort a heavy ransom from her parents. Rowan tries to follow, but the Rancor's Fist blasts off, leaving the two brothers behind."}, {"tag": "p", "text": "Meanwhile, Roger practices talking to Mon Mothma by using a mop. He dreams of leading the Rebel Alliance. Rowan tells Roger to fire up the converters, and they rush after the Rancor's Fist to rescue Kordi. Roger realizes that their plan failed while Zander flies the Jedi starfighter."}, {"tag": "h3", "text": "Kordi's business advise"}, {"tag": "p", "text": "In space, Graballa tries to contact the Clawdite royal family on their HoloNet channel while Baash hoists Kordi with chains. Graballa is unable to reach the royal family but manages to reach their automated ransom line. The HoloNet channel tells him to wait for the next customer representative while Kordi claims that he will never get them on that line. Dengar spots the Freemakers' ships, but Graballa is preoccupied with his kidnap plan."}, {"tag": "p", "text": "\"Princess Kortessi\" tells Graballa that he should work for a living but Graballa counters that a princess should not be telling him how to run his business. Kordi offers to help invest in his resort while Dengar leads several bounty hunters out in their starfighters to pursue Zander and Rowan. A dogfight breaks out while Kordi advises Graballa to install energy efficient light emitters and to turn down his thermostat. Kordi is briefly startled when she sees Naare frozen in carbonite."}, {"tag": "p", "text": "The StarScavenger and Zander's Jedi starfighter lead Graballa's starfighters on a chase. Zander enjoys flying the Jedi starfighter. Meanwhile, Kordi convinces Graballa to cut Dengar's retainer in half and to name Baash and Raam as dependents or liabilities. Graballa agrees because Baash and Raam got him a shuttle that he did not need. Kordi encourages Graballa to downsize his staff, and he hurls them out the airlock. Rowan and Roger marvel that Graballa is firing people at them."}, {"tag": "p", "text": "Graballa praises Kordi for helping to cut his expenditure and tells him he will have the resort in 50 standard years, which is considered short by Hutt standards. Graballa decides to release \"Princess Kortessi\" and invites him onto her team. Kordi agrees on the condition that he give her his H-2 shuttle. Graballa agrees to the request since he never wanted it."}, {"tag": "h3", "text": "Escaping the Rancor's Fist"}, {"tag": "p", "text": "At that point, Rowan and Zander land in the Rancor's Fist's hangar in their ships to rescue Kordi. Rowan tells Graballa to get away from his sister. Kordi pretends to keep the charade by claiming that she doesn't need rescuing but chains Graballa while he is not looking. When Baash and Raam approach, Graballa asks where is everyone else only for Baash to tell him that he threw them out the airlock. Graballa orders his henchmen to get the Freemakers but Zander hurls a container at Baash and Raam. Zander tells Kordi to fly the H-2 shuttle while Rowan flies the StarScavenger."}, {"tag": "p", "text": "Before they can leave, Dengar returns and demolishes Zander's Jedi starfighter with his ship. Dengar thinks he did something right but Graballa is preoccupied with his predicament. Rowan tells Kordi to leave the shuttle behind but Kordi is determined to honor her debt to Admiral Ackbar. Kordi knocks down Dengar by swinging a crane and flees in the shuttle. Kordi celebrates as the shuttle takes off from the hangar. Graballa orders Baash and Raam to chase the Freemakers, but the two go on strike and demand that Graballa discuss compensation packages with them. Raam tells Graballa that their talents are not being appreciated. Dengar complains about the work environment."}, {"tag": "h3", "text": "Denouement"}, {"tag": "p", "text": "The StarScavenger and H-2 shuttle flee into hyperspace and return to the Home One. Kordi asks Zander to install the frontal cannons on the Arrowhead. Quarrie adds that this is their moment of truth. Rowan uses the Force to fit the embersteel blades onto the frontal cannons, and Kordi welds them into place. The Freemakers step back to admire their work, and Rowan tells the Freemakers that the Arrowhead is coming together. Kordi has forgiven Zander for messing up her airtight plan. When Zander jokes that her plan was not very airtight, she tells him to hop off right now."}, {"tag": "p", "text": "Meanwhile, Jabba the Hutt contacts Graballa via hologram and talks to his cousin in Huttese. Vader then appears and solicits Graballa's mining expertise. Graballa offers his services and jokes about mining and Darth Vader's armor. The Sith Lord tells him to cut it out."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}