{"url": "The_Empire_Strikes_Back_(arcade_game)", "categories": ["Category:Real-world articles", "Category:1980s computer and video games", "Category:Real-world arcade games", "Category:1985 releases"], "nodes": [{"tag": "h1", "text": "The Empire Strikes Back (arcade game)"}, {"tag": "p", "text": "The Empire Strikes Back is the sequel to the popular vector graphics Star Wars arcade game. It was released by Atari in 1985. As in Star Wars the player takes the role of Luke Skywalker in a set of familiar battle sequences in a first-person perspective. Specifically the arcade features the Battle of Hoth and the subsequent escape of the Millennium Falcon into the Hoth asteroid field."}, {"tag": "p", "text": "The game takes the original gameplay, graphics, sounds, from the first arcade game and updates them to fit the new movie. Vector objects are now much more noticeably detailed, and the asterisk-particle shots from Star Wars are replaced with vector versions. The game was the third Star Wars arcade; Return of the Jedi came out the previous year. It was sold only as a conversion kit to the original Star Wars arcade game."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The main deviance from the first arcade game is the introduction of the \"JEDI\" bonus. If the player collects the letters of the word, all enemy shots will be instantly eliminated for a short time period and the player will receive military-style stripes next to their name if they make it to the high score list."}, {"tag": "p", "text": "During the Battle of Hoth sequences, the player is flying a Rebel snowspeeder. The first section has the player patrolling Hoth in a search and destroy mission for Probots. Imperial transmissions emanating from the Probots can be destroyed to prolong the stage. Once a certain number of droids are destroyed, the player advances. To earn a Jedi letter, the player must eradicate the specified number of probots."}, {"tag": "p", "text": "The second snow speeder sequence involves the assault of AT-AT and AT-ST walkers against the Rebel shield generator. The walkers have to be either destroyed or avoided, as collisions will damage the aircraft. The player has three tow-cables which can be used to take down the AT-AT walkers instantly if fired at the walker's legs. Otherwise the player has to aim for the red cockpits in order to destroy the walkers. To earn a Jedi letter, the player must eradicate the specified number of walkers"}, {"tag": "p", "text": "The second half of the player takes the role of Han Solo piloting at the head of a convoy trying to escape the Imperial onslaught. First, the player encounters a swath of TIE fighters. To earn a Jedi letter, the player must eradicate the specified number of TIE Fighters. Once enough TIEs are eliminated the player moves on to an asteroid field, where the goal is simply to survive. To earn a Jedi letter, the player must make it through the field without taking any damage. Once finishing the fourth stage, the game starts back at the beginning of the Battle of Hoth on a higher difficulty level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}