{"url": "The_Ewoks_and_the_Magic_Sunberries", "categories": ["Category:Real-world articles", "Category:Legends media", "Category:Real-world events", "Category:Star Wars: Ewoks"], "nodes": [{"tag": "h1", "text": "The Ewoks and the Magic Sunberries"}, {"tag": "p", "text": "\"The Ewoks and the Magic Sunberries,\" also referred to as \"Ewoks on Ice,\" was a 1986 American ice show based on the animated television series Ewoks. It was a segment of the traveling Ice Capades variety show Bravo America: Bold-Bright-Beautiful, which was produced and directed by Figure Skating Hall of Fame inductee Robert Turk. The Ewoks skit was written by Anne Snyder, and it was split into two acts that spanned Bravo America's intermission."}, {"tag": "p", "text": "Billed for ages \"3 to 93,\" the Ewoks segment featured musical numbers starring characters from the Ewoks cartoon, including Wicket, Princess Kneesaa, and the antagonistic Dulok King Gorneesh. \"Ice Capades and Ewoks\" souvenirs were available for purchase at the shows, and some items have become rare collectibles. In 2005, Star Wars Insider 83 ranked \"The Ewoks and the Magic Sunberries\" as the second-goofiest moment of the Star Wars Expanded Universe."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "On the moon of Endor in the year 3 ABY, the Ewok residents of Bright Tree Village sing and dance around bonfires each night. One night, the tribe's shaman, Logray, tells a story about life beyond the forest moon. However, the Ewoks' warring cousins, the Duloks, set out to cause trouble. An adventure ensues, and Ewoks including Wicket, Princess Kneesaa, Chief Chirpa, Logray, Teebo, Latara, and Paploo are pitted against the Dulok King Gorneesh, Urgah, and several Dulok scouts. In the excitement, the two tribes discover magic sunberries."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "\"The Ewoks and the Magic Sunberries,\" also referred to as \"Ewoks on Ice,\" was an ice show featured in the 1986 Ice Capades variety show Bravo America: Bold-Bright-Beautiful. It was divided into two scenes, \"The Ewok Village Square\" and \"Later That Night,\" which bridged Bravo America's intermission. The Ewoks production was preceded and followed by the acts \"Power Plus!\" and \"Romeo and Juliet,\" respectively. Bravo America was directed and produced by Ice Capades veteran Robert Turk, and the Ewoks segment was written by Anne Snyder and based on the 1985 animated television series Ewoks. Costumes for \"The Ewoks and the Magic Sunberries\" were designed and produced by Joseph Porro."}, {"tag": "p", "text": "The Bravo America tour was performed by professional ice skaters in rinks across the United States. These performances included appearances at the Nassau Coliseum and Meadowlands Arena in January 1986; Madison Square Garden and the Capital Centre in February 1986; Chicago Stadium in March 1986; and the Tulsa State Fair in September 1986. Ice Capades also toured in Canada, performing at the Pacific Coliseum in January 1987."}, {"tag": "p", "text": "The show's program contained three pages for the Ewoks production—a one sheet and a two-page spread—and billed it as \"A Tale For Kids, 3 To 93!\" The spread featured a poem from the show and images captioned \"Princess Kneesaa, Logray, Chief Chirpa, Wicket\" and \"Wicket And The Duloks.\" Some programs also included an image labeled \"Princess Kneesaa and friends.\" A line of \"Ice Capades and Ewoks\" merchandise that included pennants, buttons, and fiber optic flashlights were available for purchase at the Ice Capades shows. Additionally, KFC sponsored an Ewoks coloring contest and gave out tickets, and McDonald's offered admission coupons. The show was further promoted by televised commercials. One such commercial aired during \"The Season Scepter,\" the thirteenth episode of Ewoks' second season."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"The Ewoks and the Magic Sunberries\" was based on the television series Ewoks and set in the year 3 ABY. In the ice show, the Ewok Wicket costume corresponded to Ewoks' first season, with the character wearing an orange hood; in Ewoks' second season, Wicket's hood was green. \"The Ewoks and the Magic Sunberries\" was a part of the Star Wars Legends continuity, and it is not included in the current Star Wars canon."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Entertainment writer W. Royal Stokes of The Washington Post praised Bravo America and described the Ewok skit as \"charming.\" Similarly, Robert Blau of the Chicago Tribune also gave a positive review of Bravo America. In his review, he noted that the Ewoks segment \"entranced\" the younger audience, and he described the show's intermission-spanning cliffhanger as a \"clever ploy.\" Conversely, an attendee who saw \"The Ewoks and the Magic Sunberries\" as a child reflected on the experience in 2015: \"Think of it like comparing the Big Mac you see on the commercial to the Big Mac you actually get when you go to McDonald's.\""}, {"tag": "p", "text": "In 2005, the Star Wars Insider 83 article \"20 Most Memorable Moments of the Expanded Universe,\" written by Abel G. Peña and Enrique Guerrero, ranked \"The Ewoks and the Magic Sunberries\" as the second-goofiest moment of the Expanded Universe; the third-ranked moment was The Star Wars Holiday Special, and the first was \"Planet of Kadril,\" a comic strip in which Luke Skywalker and Han Solo wore drag-like clothing while opposing the Pacifog, a weapon which brought out the worst traits of individuals. In an accompanying blog post, Peña referred to \"The Ewoks and the Magic Sunberries\" as \"Lucasfilm's dirtiest secret.\""}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Robert Turk, who had directed Ice Capades shows since 1965, retired after the 1986 show and later wrote that \"those were the happiest years of my entire career.\" In 2010, he was inducted into the United States Figure Skating Hall of Fame. Ice Capades costumer Joseph Porro later returned to Star Wars,  becoming the costume designer for the 2019 Disney+ series The Mandalorian."}, {"tag": "p", "text": "\"The Ewoks and the Magic Sunberries\" was a topic of discussion for collector's panels at Celebration IV in 2007 and Celebration Anaheim in 2015. According to the 2010 book Star Wars Year by Year: A Visual Chronicle, the show's pennants have become rare collectibles."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}