{"url": "The_Epic_Continues", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Canceled content", "Category:Kenner toy lines"], "nodes": [{"tag": "h1", "text": "The Epic Continues"}, {"tag": "p", "text": "The Epic Continues was a planned 1986 extension of Kenner's \"Power of the Force\" action figure range. It was to feature original characters and vehicles, stemming from a new plot line created by Kenner designers. The plot concerned the genetics master Atha Prime, ruler of dark worlds, who had been freed from exile following the death of Emperor Palpatine. Striking at the Rebel Alliance, he was forced to do battle with Luke Skywalker, Han Solo, and the Mongo Beefhead Tribesmen. Meanwhile, Grand Moff Tarkin, who had evaded death at the Battle of Yavin, had returned to take control of the Galactic Empire."}, {"tag": "p", "text": "Many of the new figures and vehicles were inspired by elements from the films, and the ideas took shape in concept art and prototypes. Most of the prototypes were kitbashed, while others were minor alterations to existing designs. The proposal was presented to Lucasfilm Ltd., but they rejected the proposal. As a result none of the figures were produced, and the plot line was rendered non-canon. In the mid 1990s, several of the vehicles and droids from the line were canonized in the short story The Battle of Cadinth, and in the early 2000s Abel G. Peña made several attempts to canonize Atha Prime. Though the character was not directly made canon, one inspired by Prime, a genetic terrorist later revealed to be named Zeta Magnus, was."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Atha Prime, a genetics master and ruler of the dark worlds, has been freed from his exile by Emperor Palpatine's death at the Battle of Endor. With his army of shock troop Clone Warriors, he moves against the Rebel Alliance, decimating planets held in their thrall. They strike from the Annihilator, a city-sized capital ship that attaches to Prime's personal fighter, the Apex Invader. The fighter is piloted by Blue-Four, who doubles as Prime's confidant."}, {"tag": "p", "text": "At the same time, the Galactic Empire, headed by Grand Moff Tarkin, makes their own bid for power, using a wide variety of attack droids to do their bidding. Tarkin survived the Battle of Yavin and chose the wake of Palpatine's death to make his return. They also employ All Terrain Ion Cannons and operate from an Imperial Outpost."}, {"tag": "p", "text": "To combat the new threat of Prime, war hero Han Solo and Jedi Knight Luke Skywalker are called upon. They are aided in their efforts by the Mongo Beefhead Tribesmen from Tatooine. At their disposal are a wide choice of combat vehicles, such as Tandem X-wings and various landspeeders."}, {"tag": "h2", "text": "Development"}, {"tag": "h3", "text": "Concept"}, {"tag": "p", "text": "In 1984, Kenner employee Mark Boudreaux and his design team began brainstorming ways to extend the Star Wars toy line, hoping to prolong the inevitable falloff of interest in the brand due to the lack of a new film installment. Previously, the company had enjoyed success with their line of Mini-Rigs—small vehicles inspired by, as opposed to based on, other vehicles appearing in the films. The Mini-Rigs were Kenner's first foray into the realm of original material, and had been created to fill in the gap between the relatively cheap action figures and the relatively expensive film-based vehicles."}, {"tag": "p", "text": "Kenner's designers would often tinker with existing toy vehicles, modifying them in a kitbashing process, which entailed taking pieces and elements from existing models, and utilizing the pieces to create an entirely new model. Out of one of their kitbashing sessions came the idea to create a range of entirely new figures for a toy line to be released in 1986. The line would feature original characters and vehicles that feasibly could exist within the Star Wars universe. In addition to this, they formulated an original plotline involving their characters that would continue the Star Wars story on after Star Wars: Episode VI Return of the Jedi. The new plot line would involve a new enemy, Atha Prime, terrorizing the galaxy in the wake of Emperor Palpatine's death."}, {"tag": "h3", "text": "Designs"}, {"tag": "h4", "text": "Characters and droids"}, {"tag": "p", "text": "The Kenner designers utilized a number of different methods to present their ideas to Lucasfilm Ltd. This included black-and-white sketches, hand colored drawings, and physical prototypes that they had photographed. Several of the figures in the proposed lines were modifications or extrapolations of existing figures. Han Solo was redesigned with new, more \"heroic\" attire, while Luke Skywalker was given lightweight fencing armor, apparently worn by training Jedi Knights. One of the new \"hero\" figures was to be the Mongo Beefhead Tribesman, who was one of the few to be actually made into a prototype. The prototype was a kitbashed one—made up of a modified Quarren's head, an Ithorian's arms, and \"4-LOM's\" chest harness."}, {"tag": "p", "text": "In an attempt to push the Star Wars saga in a new direction, Kenner created Atha Prime—a genetics master who had orchestrated the Clone Wars. In their presentation of Prime, Kenner used a brief description of the character and a color concept drawing. The drawing for Prime was in fact slightly modified from Nilo Rodis-Jamero's designs for the Emperor's Royal Guards, from Return of the Jedi. The modifications included changes to the character's staff and headpiece. To accompany Prime, they also designed the Clone Warriors. In the way of characters affiliated with the Galactic Empire, the designers decided to re-introduce Grand Moff Tarkin, who had been apparently killed at the conclusion of Star Wars: Episode IV A New Hope. They had failed to create a figure of Tarkin during the original Star Wars run and intended to rectify that for their new line. To present the idea of a Tarkin figure, Kenner simply used a promotional still of Peter Cushing in the role from A New Hope."}, {"tag": "p", "text": "A variety of droid figures were proposed for the line, including a black Imperial Sentry Droid, much like R5-J2 from Return of the Jedi. For new droids, three Imperial Attack Droids, designated A, B, and C, had prototypes made. Several elements of these were kitbashed from earlier droid figures. To join Atha Prime's faction, the pilot droid Blue-Four was also designed."}, {"tag": "h3", "text": "Vehicles and playsets"}, {"tag": "p", "text": "For new vehicles to go with the line, Kenner created a variety of prototypes and designs based on or inspired by the craft seen in the original trilogy of Star Wars films. These toys would be categorized into two price ranges, labeled \"low priced vehicles\" and \"deluxe vehicles.\" Boudreaux kitbashed the Tandem X-wing, which was inspired by the \"lumbering World War II airplanes.\" The ship was painted in negative colors to those of a standard T-65 X-wing starfighter, despite Boudreaux's admission that there was no need for a night fighter in space. To accompany the Millennium Falcon toy that had been produced in years prior, a Millennium Falcon Cargo Handler was designed, which could be attached to the bow of the original toy. As a play on the Star Destroyer design from the original trilogy, concept sketches were made of the Annihilator, a large mobile command base for Atha Prime and his Clone Warriors. The design consisted of two Star Destroyers essentially mated together, one on top of the other. The Apex Invader, a personal vehicle designed for Prime, would have been able to attach to the top of the Annihilator. Other spacecraft making their way into the lineup would be the pre-existing TIE/sa bomber and T-65 X-wing starfighter. The TIE Bomber was presented with photocopied artwork by Joe Johnston."}, {"tag": "p", "text": "In terms of land vehicles, the designers formulated two landspeeders: the XP-36 and the XP-38, which had been mentioned in A New Hope. The former was intended to be a high-performance, light vehicle, while the latter was a state-of-the-art landspeeder. A prototype was made of the XP-36, while the XP-38 existed only as concept art. The XP-38 would serve as Skywalker's personal vehicle within the plotline. Another craft inspired directly by the films was a type of T-47 airspeeder modified for use on desert worlds. One toy that was nearly produced was the Scout and Retrieval Vehicle, which could carry damaged X-wings and airspeeders. An earlier version of the toy had been released with the original films, but Kenner's new version was presented two ways: as a slightly modified version of the original vehicle, with new stickers, and a heavily modified version, presented as concept art."}, {"tag": "p", "text": "Working from the All Terrain Armored Transport seen in Irvin Kershner's Star Wars: Episode V The Empire Strikes Back, an \"All Terrain Ion Cannon\" prototype was made. The design consisted of an AT-AT that had its back and top sheared off, and a large cannon placed in their stead. In addition to the original vehicles, the new Imperial sniper fighter, and the already established AT-AT, the T-16 skyhopper, the \"snowspeeder\" version of the T-47, and the X-34 landspeeder would be included in the line. For the skyhopper, Kenner simply photocopied an original design by Joe Johnston, as they had done with the TIE Bomber."}, {"tag": "p", "text": "A single playset was conceived for the new line, dubbed \"Imperial Outpost.\" The concept art for the set was designed by Boudreaux, who combined pre-existing elements such as a gun tower from an earlier Death Star playset with the landing platform and bunker complex seen on Endor in Return of the Jedi. In addition to the reintroduction of Tarkin, Kenner proposed a bantha figure, which they had not produced for the original toy line. Unlike Tarkin, however, the bantha was presented as concept art."}, {"tag": "h3", "text": "Rejection"}, {"tag": "p", "text": "The Kenner designers presented their sketches and photos to Lucasfilm Ltd., alongside proposals for figures from the existing films and the two television series, Star Wars: Droids and Ewoks. It is possible that Kenner also intended to have their new plotline accompanied by a third animated series. Notes were also made for two otherwise undocumented vehicles: the Rebel stinger fighter and the DS-2 droid skimmer. While Lucasfilm was pleased with the fact that the toy company had gone through so much effort, they were not ready to pursue coordinated attempts to flesh out the Star Wars galaxy beyond the films. In 1986, Kenner's Star Wars toy line would finally come to an end, due to lack of interest."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Although The Epic Continues was rejected by Lucasfilm, several elements from it have been canonized, and Atha Prime himself has been the subject of repeated attempts at canonization, chiefly by Abel G. Peña. At the same time, several elements of the plotline no longer fit with Star Wars canon. For instance, Atha Prime is identified as one the architects of the Clone Wars, but Darth Sidious and Darth Tyranus are shown to fill that role in 2002's Star Wars: Episode II Attack of the Clones. In addition to this, Wilhuff Tarkin's death has, since 1984, been confirmed."}, {"tag": "p", "text": "The three Imperial Attack Droids, as well as the sniper airspeeder and the Scout and Retrieval Vehicle, would be canonized in 1995, when Bill Smith used them in his short story entitled The Battle of Cadinth. The story, published in Star Wars Galaxy Magazine 2, gave the three droids new names: \"AP-1-C attack droid,\" \"AP-2 attack droid,\" and \"AP-3 attack droid.\" An illustration by Chris Moeller that accompanied the story showed these droids and vehicles in action. The Scout and Retrieval Vehicle was also used in the Star Wars: The Roleplaying Game supplement The DarkStryder Campaign, also published in 1995."}, {"tag": "p", "text": "Another vehicle canonized, in some form, was the Tandem X-wing. The idea of the vehicle, rather than the design, was used in Randy Stradley's Crimson Empire II: Council of Blood, published in 1998. The XP-38 would also return in a different form, as it was rendered in 1996's The Essential Guide to Vehicles and Vessels, with a design completely different to the one submitted by Kenner. In 2004, The New Essential Guide to Weapons and Technology, written by W. Haden Blackman, canonized the All Terrain Ion Cannon vehicle. Finally, in 2011 the Falcon's cargo handler appeared in the Millennium Falcon Owner's Workshop Manual as the Freight-loading external rover, and then was made part of the new canon in an updated version of that book, YT-1300 Millennium Falcon Owners' Workshop Manual in 2018."}, {"tag": "p", "text": "The same concept art that was the basis for Atha Prime was used by Cam Kennedy in Tom Veitch's Star Wars: Dark Empire comic series, published in 1991. The art inspired the Imperial Sentinels, the design of whom was in turn made into an action figure by Hasbro in 1998. While writing for issue 122 of the Official Star Wars Fact File, Abel G. Peña wrote a reference to Prime that connected him to the coup attempt featured in Star Wars: Empire: Betrayal, which also featured cloned soldiers. The reference, however, was cut during the editing stage. This did not stop Peña, and he would later make an attempt to consolidate the characters of Prime and Shadowspawn from the Dark Empire Sourcebook, written by Michael Allen Horne. Together with Daniel Wallace, Peña wrote an article on the Imperial Warlords, with the intent of having it published in Polyhedron magazine. The publication was canceled before such a thing could happen, leaving the connection, and Prime himself, non-canon."}, {"tag": "p", "text": "Eventually, in the 2007 article he co-wrote with Rich Handley entitled Aliens in the Empire, Peña alluded to a \"genetics terrorist\" that was intended to be Prime, thus canonizing at least one element of the original character. A blurb of the 2008 novel, Matthew Stover's Luke Skywalker and the Shadows of Mindor, contained information about the main villain, Shadowspawn, that was similar in wording to specific elements of Kenner's original brief for Prime. This led to speculation on the Jedi Council Forums as to whether or not the consolidation of Prime and Shadowspawn was still to go ahead in the upcoming novel, but this proved to not be the case upon the release of the book itself, as Shadowspawn was instead consolidated with the character Cronal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}