{"url": "The_Essential_Reader%27s_Companion", "categories": ["Category:Real-world articles", "Category:Essential Guides"], "nodes": [{"tag": "h1", "text": "The Essential Reader's Companion"}, {"tag": "p", "text": "The Essential Reader's Companion is a third-generation Essential Guide written by Pablo Hidalgo, and published by Del Rey. In July 2010, Sue Rostoni posted an updated publishing calendar with the book having been pushed back to March 20, 2012. In December 2011, the book was mentioned to be pushed back again to a release date of August 21, 2012. On March 19, it was announced on Facebook that the release date was moved back to October 2 for the art team to finish more paintings."}, {"tag": "p", "text": "At Celebration V it was announced the book would contain summaries of all novels, young readers books, and novellas, listed chronologically by their in-universe setting, as well as behind-the-scenes information and brand-new illustrations, specifically the long-awaited picture of Cal Omas."}, {"tag": "p", "text": "Unlike recent previous entries in the Essential Guide series, The Essential Reader's Companion is presented from an out-of-universe, or \"real-world,\" perspective, rather than as a piece of in-universe writing."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE DEFINITIVE WORD ON STAR WARS FICTION"}, {"tag": "p", "text": "The legendary motion picture Star Wars: A New Hope has spawned five big-screen sequels—and decades of bestselling fiction. From the original movie tie-in novel through the monumental Fate of the Jedi series, legions of devoted readers have helped expand science fiction's most celebrated film saga into a page-turning print sensation. Now, for the first time, a comprehensive overview of these sweeping Star Wars adventures is presented in one beautifully illustrated volume."}, {"tag": "p", "text": "Star Wars: The Essential Reader's Companion spans the entire galaxy of published Star Wars fiction—movie novelizations, original stand alone and series novels, short stories, eBook novellas, young adult titles, and comics—and features"}, {"tag": "p", "text": "Whether skimming through fateful eras from the Old Republic to the New Jedi Order; delving deep into the ancient history of the Lost Tribe of the Sith or the tumultuous Clone Wars; crossing paths—and lightsabers—with Dark Lords such as Plagueis or Bane, Sidious or Vader; helming the Millennium Falcon with Han Solo; or mastering the Force with Luke Skywalker, this one-of-a-kind, one-stop reference is a must for fans looking to maximize their knowledge of the sprawling Star Wars Expanded Universe."}, {"tag": "h2", "text": "List of books"}, {"tag": "h3", "text": "Chapter 1: Tales of Ancient Jedi and Sith"}, {"tag": "h3", "text": "Chapter 2: Height of the Republic"}, {"tag": "h3", "text": "Chapter 3: The Clone Wars"}, {"tag": "h3", "text": "Chapter 4: The Dark Times"}, {"tag": "h3", "text": "Chapter 5: The Galactic Civil War"}, {"tag": "h3", "text": "Chapter 6: The New Republic"}, {"tag": "h3", "text": "Chapter 7: The New Jedi Order"}, {"tag": "h3", "text": "Chapter 8: Legacy"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Essential Reader's Companion incorrectly states that Zaltin Corporation supported Ysanne Isard's coup on Thyferra."}, {"tag": "p", "text": "The Essential Reader's Companion incorrectly states that Jorj Car'das had a copy of the Caamas Document. It also incorrectly spells Grodin Tierce's name as \"Grodon.\""}, {"tag": "p", "text": "The Essential Reader's Companion incorrectly states that the Fallanassi harbored Vestara Khai, rather than Abeloth."}, {"tag": "p", "text": "The Essential Reader's Companion incorrectly states that Xaverri's character originates from The New Rebellion despite never appearing in the text at all."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}