{"url": "The_Frozen_Citadel", "categories": ["Category:Real-world articles", "Category:Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"], "nodes": [{"tag": "h1", "text": "The Frozen Citadel"}, {"tag": "p", "text": "\"The Frozen Citadel\" is the thirteenth episode of Star Wars: Droids: The Adventures of R2-D2 and C-3PO. Written by Paul Dini from a story by Ben Burtt and directed by Ken Stephenson, the episode originally aired on ABC on November 30, 1985."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Mungo Baobab, Auren, Nilz and the droids continue their search for the Roonstones."}, {"tag": "p", "text": "Governor Koong, eager to prove himself to Admiral Screed, attacks them by releasing Rooze Disease, a deadly biological weapon, on the province. Screed warns that the disease is too deadly, and that when the Galactic Empire tried to use it against their enemies, they killed off many Imperials. Sure enough, it seeps into the Imperial Ship control decks. While the Admiral is able to quickly don a protective breathing mask while his stormtroopers engage their armors' air filtration functions, Koong is fully exposed."}, {"tag": "p", "text": "Mungo and the others race to the Yomm home and find that Bola, Auren's mother, has been afflicted by Rooze Disease. Knowing that Nilz is a skilled healer, Koong sends Gaff to him for help. Auren attacks him but fails to subdue him; he captures her to ensure that Nilz will cure Koong."}, {"tag": "p", "text": "Mungo and the droids track Auren and Nilz. As Nilz treats Koong, Admiral Screed announces that he is tired of waiting for Koong to deliver the Roonstones and will leave soon."}, {"tag": "p", "text": "Mungo tries to take a shortcut through a volcano; the ship crashes in snow on the other side. As they walk, they find a mirror, and Threepio realizes that the message on the pyramid Mungo obtained from his great-uncle is written backwards. He is able to decipher the Roonstones' location. Artoo falls into the mirror, which causes him to shrink."}, {"tag": "p", "text": "Nilz has almost completed the cure; Auren worries that even when they cure Koong, he won't release them to cure Bola. She also realizes that Mungo has been tracking them."}, {"tag": "p", "text": "Mungo and Threepio use the mini Artoo as a distraction to steal some robes to disguise themselves. As Mungo distracts the guards with pies, Threepio sneaks the mini Artoo through a ventilation shaft. Artoo finds Nilz and Auren, who realize that he's fallen into a molecular disruptor trap. They escape and find the others."}, {"tag": "p", "text": "Koong attempts to convince Screed to stay. Mungo reveals himself and offers a bargain: if the Imperials leave Roon alone, he'll give up the cure to the disease and the source of the Roonstones—which were in Koong's fortress all along."}, {"tag": "p", "text": "Once he has the Roonstones' location, Screed reveals that he has no need for Koong. Enraged, Koong tries to shoot down the Roonstones, but ends up shooting them into the volcano. Before they escape, Mungo gives Koong the cure, but it is too late; the disease makes him disintegrate. On board the Caravel the group notices that R2-D2 kept a small Roonstone inside him."}, {"tag": "p", "text": "They return to Bola and cure her. Mungo plans to leave, despite not getting the Roonstones he came for."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This episode was released on DVD in 2004 as part of the Treasure of the Hidden Planet feature film."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}