{"url": "Battle_of_Malachor_V", "categories": ["Category:Legends articles", "Category:Battles in the Chorlian sector", "Category:Battles of the Mandalorian Wars"], "nodes": [{"tag": "h1", "text": "Battle of Malachor V"}, {"tag": "p", "text": "The Battle of Malachor V, also called Ani'la Akaan—the \"Great Last Battle\"—in Mando'a, was the final cataclysmic battle of the Mandalorian Wars. It transformed the planet Malachor V into a \"graveyard world\" after Meetra Surik sacrificed a significant portion of her own forces to obliterate the Mandalorian Neo-Crusaders."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Preparations"}, {"tag": "p", "text": "In the year 3960 BBY, Revan forced a final confrontation with the Mandalorians above Malachor V. He deployed a massive Republic fleet to the planet. In utter secrecy, he had prepared a superweapon, known as the \"Mass Shadow Generator,\" which had been designed by the Zabrak engineer Bao-Dur. The weapon was the centerpiece of a trap with which he hoped to bring about a conclusive end to the destructive conflict. Commanding the fleet and overseeing the device's use was a capable and jaded Jedi General, Meetra Surik (later known as the Jedi Exile) who had taken part in the recent bloody campaign on Dxun. Revan lured the Mandalorians to Malachor V and a massive fleet battle ensued in orbit."}, {"tag": "h3", "text": "Battle is joined"}, {"tag": "p", "text": "Revan himself was delayed outside the system by a Mandalorian scouting party. He eventually arrived at Malachor and entered the fray, but he was late and the Mandalorian Fleet was far from defeated. Soon thereafter, he was able to draw Mandalore into a direct confrontation and strike the great Mandalorian leader down in single combat. Meanwhile, more and more of the Revanchist Jedi fighting in orbit became affected by the dark power emanating from the planet below. Their resistance was worn down by years of bloody warfare and they were thus drawn to the dark side. With renewed vigor, Revan's forces pressed the attack. They soon achieved a stalemate and then slowly began to push the Mandalorian fleet back towards Malachor V."}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "Finally, as the fighting grew intense, Meetra Surik observed that the Mandalorians had taken the bait and that her trap was set to spring. With a nod of her head, she commanded Bao-Dur to activate the secret weapon. Moments later, she watched in horror as a significant portion of both fleets were suddenly drawn from orbit into a vast gravity vortex that was powerful enough to crush the countless ships into the planet's crust and fracture the world to its very core."}, {"tag": "p", "text": "Few ships from either fleet survived the battle of Malachor V unscathed, but the Mandalorians sustained the worst damage and the highest casualties. In the wake of their fleet's almost complete annihilation by the Mass Shadow Generator, the Mandalorian survivors rapidly transmitted their unconditional surrender, thus ending the Mandalorian Wars."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Once an agricultural world, Malachor V was fractured by the Mass Shadow Generator and tranformed into a cluster of planetoids that were only tenuously fused together by the gravitational anomalies present in the Malachor system. The broken remains of the planet were orbited by the drifting wreckage of countless Mandalorian and Republic warships. Littered with destroyed vessels from the battle, the surface below became a barren graveyard echoing with the deaths of thousands of Jedi, Republic soldiers, and Mandalorians. Thereafter, it was constantly assaulted by tectonically-generated storms that were capable of pulling ships from orbit."}, {"tag": "p", "text": "Revan disarmed and disbanded the Mandalorian clans following the battle, allowing them to scatter across the Outer Rim. There, devoid of leadership and honor, they degenerated. A few Mandalorian survivors returned to the Mandalore system, but many, including Canderous Ordo, humbled their pride and became mercenaries for hire. Other groups became outright bandits in a futile effort to relive their glory days."}, {"tag": "p", "text": "After slaying Mandalore the Ultimate and winning the war with a sweeping victory at Malachor V, Revan and Malak were hailed as heroes and saviors of the Republic. Soon after the battle, they led the remainder of their forces into the Unknown Regions under the pretense of tracking down the remaining remnants of the Mandalorian fleet, but they did not return and they sent no word of their whereabouts. In time, the Republic feared them lost in some tragic disaster, but in reality, they were amassing their forces to prepare for a conquest of the Republic."}, {"tag": "p", "text": "Meetra Surik, the Jedi General who had brought the war to its cataclysmic conclusion proved incapable of withstanding the psychic backlash of the destructive energies that she had unleashed. The concentrated deaths of so many Jedi, Mandalorians, and Republic soldiers all at once created a immense Wound in the Force. The only way for her to endure it was to unconsciously deafen herself to the Force. Thereafter she was deafened to its call; incapable of sensing it through the interference caused by the echoes of the suffering that she had witnessed. The battle was responsible for the cause of wounds in the force, most notably Darth Nihilus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle is described in the video game Star Wars: Knights of the Old Republic, its sequel, the historical article Chronicles of the Old Republic, and the Knights of the Old Republic Campaign Guide, but the various descriptions contain a number of notable discrepancies."}, {"tag": "p", "text": "In the first game in the KotOR series, Canderous Ordo states that Revan alone was responsible for winning the battle, but in the second game, he remarks that it was Meetra Surik who defeated his people. The sequel also makes it clear, via Bao-Dur's dialogue, that Revan was delayed and that his fleet was in dire straits by the time that he arrived—a fact which is difficult to reconcile with the other descriptions of the battle."}, {"tag": "p", "text": "Although Knights of the Old Republic II has the Exile ordering Bao-Dur to activate the Generator, the Revan novel, The Essential Guide to Warfare and Timeline 9: The Mandalorian Wars state that Revan was the one to activate it."}, {"tag": "p", "text": "The manner of Mandalore the Ultimate's death is also unclear. Knights of the Old Republic and The New Essential Chronology state that Revan killed Mandalore in hand-to-hand combat, but in Knights of the Old Republic II, Canderous states that Revan executed him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}