{"url": "The_Forgotten_Droid", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "The Forgotten Droid"}, {"tag": "p", "text": "\"The Forgotten Droid\" is the nineteenth episode of the second season of the animated television series Star Wars Rebels. It is the thirty-fourth episode of the series overall. The episode premiered on March 16, 2016 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "When Chopper steals a replacement for his original leg, he separates from the Ghost crew and finds himself stranded on an Imperial ship. The grumpy astromech meets an inventory droid in service of the Empire, but will this new acquaintance become friend or foe?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Left behind"}, {"tag": "p", "text": "After the theft of the Imperial fighter carrier above Ryloth, the rebel fleet is still looking for a safe haven to establish a new base. Commander Jun Sato convenes a meeting aboard the new flagship that is attended by the crew of the Ghost and Captain Rex. By cross-referencing several Galactic Republic and Lasat maps, the rebels identify the planet Berzite's moon in the Yost system as a prospective location. Ketsu Onyo, Sabine Wren's friend, recommends Berzite's moon on the grounds that the Empire lacked a presence there. However, the trip is delayed as the rebellion's fighter carrier does not have enough fuel to make the journey. Sabine, who had been tracking Imperial fleet movements, suggests stealing an incoming shipment of fuel from the Imperial depot at Horizon Base. Sato approves Sabine's plan and the crew of the Ghost departs for Horizon Base to obtain the fuel."}, {"tag": "p", "text": "Upon landing, the rebels make their way to the Imperial fuel depot while the astromech droid Chopper is assigned to watch out for Imperial forces. Kanan Jarrus' plan is to blast their way out after they have obtained the necessary fuel supplies. However, Chopper is distracted by the sight of a new droid leg being sold at a nearby stall. Chopper had an improvised left leg which did not fit him well. When Chopper raised the matter to Hera Syndulla, Hera reminded him that they were not on Horizon Base to shop and that they were on an urgent mission. Despite Chopper's protests, Hera orders him to keep a watch for Imperial forces and to alert them. Before leaving, Garazeb \"Zeb\" Orrelios and Ezra Bridger tease Chopper about \"getting a leg up\" and going \"shopping.\""}, {"tag": "p", "text": "Defying Hera's orders, Chopper activates his rocket booster and flies to the stall selling the droid leg. The stall is run by an Ugnaught scrap merchant. Noticing Chopper, the Ugnaught merchant assures the droid of the quality of his produce but admits to his involvement in shady dealings. The merchant offers to sell the leg to Chopper for 500 credits. When Chopper reveals that he lacks the funds to obtain it, the Ugnaught merchant orders him to leave. Meanwhile, the other five rebels approach the fuel depot and find that it is heavily guarded. While Hera reiterates that the rebels could not leave without getting the fuel, Kanan tells them to get the fuel \"quietly with no complications.\""}, {"tag": "p", "text": "Still determined to get the spare leg, Chopper steals it for himself and tries to flee back to the Ghost but is spotted by the Ugnaught merchant, who alerts several stormtroopers. Meanwhile, the other rebels flee back to the Ghost without Chopper. Left behind on Horizon Base, Chopper manages to dodge his Imperial pursuers by running aboard a departing Class four container transport. He hides in one of the hatches. Meanwhile, aboard the Imperial cargo ship, the Imperial RA-7 protocol droid AP-5 tells the captain on the ship that he is off by .002. The captain harshly responds by belittling AP-5 for being a \"useless droid\" before ordering him to go check on the ship's manifest."}, {"tag": "h3", "text": "Two unlikely friends"}, {"tag": "p", "text": "AP-5 walks past some stormtroopers who ignore him. He notices that a hatch is open and investigates it for any stowaways. Chopper tries to elude AP-5 but is eventually caught by him. AP-5 recognizes Chopper as a stowaway and the rebel droid who had stolen a droid leg from Horizon Base. When AP-5 notices that Chopper had a spark projector, Chopper reveals that he was a war hero. In return, AP-5 tells Chopper that he was a veteran of the Clone Wars who had served as an analyst droid for the Galactic Republic during the Ryloth campaign."}, {"tag": "p", "text": "Chopper also tells AP-5 that he flew a BTL-A4 Y-wing assault starfighter/bomber which crash-landed on Ryloth but was rescued by Hera. Finding a friend, AP-5 tells Chopper about his unhappiness at being reassigned to inventory duty and being constantly belittled by his Imperial superiors. AP-5 expresses his admiration for Chopper's fortitude. At that point, the Imperial captain interrupts their conversation via comlink and asks AP-5 about the manifest, while also warning him about the stowaway droid. Chopper then uses his electro-shock prod to disable AP-5's restraining bolt, freeing the droid."}, {"tag": "p", "text": "Shortly later, the Imperial captain arrives and proceeds to chastise AP-5 for neglecting the ship's manifest while asking him about the intruder. When the captain notices AP-5's missing restraining bolt and attempts to apply a new one, Chopper appears and attacks the Imperial officer. The officer grabs Chopper during the struggle and calls for reinforcements through his comlink. However, Chopper manages to stun him with his electro-shock prod. With nothing left to lose, the two droids decide to join forces and Chopper devises a plan to seize control of the ship. While AP-5 thinks Chopper's plan has a \"10.5%\" chance of succeeding, he still agrees to help. Chopper lures the stormtroopers into the cargo compartment and then jettisons it into space. The two droids then argue over who should lead the ship."}, {"tag": "p", "text": "Meanwhile, in hyperspace, the other crew of the Ghost heads back to the rebel fleet. On the way, Ezra, despite his acrimonious relationship with Chopper, urges his fellow crew to go back for the droid. However, Hera criticizes Chopper for only looking out for himself and allowing himself to get distracted by the droid leg. She also stresses that the rebel fleet is more important. Shortly later, they receive a transmission from Commander Sato that the rebel fleet is under attack from Imperial forces. When they exit hyperspace, they see the Imperial fleet attacking the rebels. Back on the cargo ship, AP-5 decides to go for his programmed destination."}, {"tag": "h3", "text": "Finding a new base"}, {"tag": "p", "text": "Aboard another Imperial warship, an Imperial officer informs Admiral Kassius Konstantine that the Ghost has entered the system. Realizing that the Ghost is carrying stolen fuel supplies for the rest of the fleet, Konstantine immediately orders all remaining fighters to focus fire on the Ghost. The Ghost's crew is assisted by Ketsu who helps them take out the attacking TIE fighters, managing to enter the cruiser. On the Imperial cargo freighter, AP-5 allows Chopper to serve as the ship's helmsman. Chopper changes the coordinates, much to AP-5's concern. He also tells AP-5 that he should come with the rebels, as they were kinder than his Imperial superiors."}, {"tag": "p", "text": "Back at the rebel fighter carrier, Hera manags to land the Ghost with much difficulty. Zeb and Ezra begin unloading the fuel supplies while Hera receives contact from Chopper through the ship's intercom. Hera is initially annoyed with Chopper for abandoning his post and informs him that the rebel fleet is preparing to depart for the Yost system. Over-hearing the conversation, AP-5 looks up the Yost system and informs them that an Imperial fleet is lying in ambush there. Chopper relays this information back to Hera. When Hera expresses skepticism, Chopper assures her that AP-5 is telling the truth. AP-5 cross-searches both Chopper and the Imperial data to look for any potential havens and finds one: the planet Atollon."}, {"tag": "p", "text": "Meanwhile, Hera informs Commander Sato that the Yost system is unsafe and that they have received coordinates to a new system. The cargo ship captain, regaining consciousness, heads back to the bridge to confront the hijackers. Taken by surprise, AP-5 claims that Chopper was holding him hostage. The captain however sees through the ruse and attacks the two droids. While AP-5 mans the controls and expresses gratitude for Chopper's friendship, Chopper fights the captain and manages to knock his blaster pistol out of his hand. The two fight with the captain gaining the upper hand due to his bigger size."}, {"tag": "p", "text": "AP-5 is about to transmit the new coordinates to Hera when he is shot twice by the captain. An enraged Chopper fights back even harder and manages to stun the captain again. Chopper then transmits AP-5's coordinates to Hera and the rebel fleet. Despite their victory, AP-5 is badly damaged by the blaster bolts and begins to shut down. Before powering down, he manages to tell Chopper that he was glad to have made a new friend, much to Chopper's dismay. Using AP-5's information, the Phoenix rebel fleet heads towards the new coordinates."}, {"tag": "p", "text": "Later, Hera and Kanan check out the coordinates and find that Atollon is indeed safe and void of any Imperial presence. Meanwhile, Sabine fixes AP-5's thermosensors by salvaging parts from the spare leg Chopper had stolen. AP-5 meets the crew of the Ghost for the first time. After learning that Chopper had sacrificed his new droid leg to repair him, AP-5 remarks that Chopper had a malfunctioning logic circuit. When Chopper uttered a rebuttal, AP-5 responds that the former's remarks were so foul that they could get him disintegrated in six systems. As the two droids depart the common room, the rest of the crew watch with bemusement."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}