{"url": "The_Flag_Parade", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "The Flag Parade"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"The Flag Parade\" is a theatrical motif written by John Williams for the 1999 film Star Wars: Episode I The Phantom Menace and its respective soundtrack. It was composed between October 1998 and February 1999 and recorded by the London Symphony Orchestra (LSO) during the month of February. The piece has a majestic style at a tempo of 92 bpm, with a time signature of 4/4 in the beginning and 2/4 during the main melody. The composition is one minute fourteen seconds long and is in the key of C major. The theme is used during the scene that shows the flag ceremony before the Boonta Eve Classic podrace near Tatooine's Mos Espa settlement. The composition is also used in the Mos Eisley \"heroes versus villains\" Assault Mode in the video game Star Wars: Battlefront II and again during the first cut scene in \"Chapter 5: Mos Espa Podrace\" of \"Episode I\" in LEGO Star Wars: The Video Game."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "John Williams wrote the score for the 1999 film Star Wars: Episode I The Phantom Menace and the respective soundtrack, as had been the case with the previous three Star Wars films from the original trilogy. \"The Flag Parade\" was written for use during the flag ceremony scene directly before the Boonta Eve Classic podrace outside of Tatooine's Mos Espa settlement. The piece, along with the entire score, was written between the months of October 1998 and February 1999 and recorded by the London Symphony Orchestra during the month of February. The original soundtrack was released by Sony Classical on May 4, 1999, and the Ultimate Edition was released on November 14, 2000. The original soundtrack was re-released on February 6, 2012 to coincide with the 3-D release of The Phantom Menace in theaters. The album was also released on vinyl by \"IAmShark\" in 2013. On September 25, 2015, it was announced that Sony Classical would be releasing the Phantom Menace soundtrack along with the other five films' soundtracks in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "\"The Flag Parade\" has a majestic style at a tempo of 92 bpm, along with a time signature of 4/4 at the beginning and 2/4 during the main melody. The composition is one minute fourteen seconds long and is in the key of C major. It starts with a loud cymbal crash and a brass fanfare, with trumpets followed by a descending phrase in which French horns are featured. Next in the fanfare is a trumpet part which consists of two sets of nine triplets with a quarter note at the end of each set. The fanfare continues with the trumpets and low brass playing between each other. The French horns then come in with the main melody, which contains two pickup sixteenth notes followed by four quarter notes, nine triplets, and two additional quarter notes. They continue with an eight note, two sixteenth notes, another two eight notes, and two more quarter notes."}, {"tag": "p", "text": "This is repeated again without the last quarter note. The whole melody is backed by a percussion and low brass beat, which is mainly composed of quarter notes and occasional eight note/two sixteenth notes beats. This is succeeded by another trumpet fanfare, which is followed by a repeat of the main melody again played by the French horns. Next is a string phrase followed by another trumpet fanfare-like part. Lastly, the horns play the primary melody for the third time, with the trumpets occasionally coming in with short phrases. The ending of the melody is played by the low brass and trumpets, who take turns on each phrase. The theme then fades out with a snare drum rhythm."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The piece appears solely in the soundtrack for The Phantom Menace. In the original version, the theme is contained in the seventh track called \"The Arrival at Tatooine and The Flag Parade.\" In the Ultimate Edition, the theme receives its own track, the thirty-first track, titled \"The Flag Parade.\""}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "The piece is used in the flag ceremony scene just before the start of the Boonta Eve Classic podrace in The Phantom Menace."}, {"tag": "h3", "text": "In the Expanded Universe"}, {"tag": "p", "text": "The composition also makes an appearance in the \"heroes vs. villains\" Assault Mode in Mos Eisley, and as General Grievous's theme in the video game Star Wars: Battlefront II. The piece is utilized again during the first cut scene in \"Chapter 5: Mos Espa Podrace\" of \"Episode I\" in LEGO Star Wars: The Video Game."}, {"tag": "h3", "text": "In other media and merchandise"}, {"tag": "p", "text": "The sheet music for the piece was published in the music book for The Phantom Menace, which was released by Bantha Music for the following instruments and editions: trumpet, piano, easy piano, clarinet, tenor sax, and alto sax.. The theme itself was played over the speakers at the \"Tomorrowland Terrace\" restaurant in Disneyland Park between showings of the Jedi Training Academy."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}