{"url": "Battle_of_Makem_Te_(Cold_War)", "categories": ["Category:Legends articles", "Category:Battles of the Cold War (Galactic Republic–Sith Empire)", "Category:Battles of Makem Te"], "nodes": [{"tag": "h1", "text": "Battle of Makem Te  (Cold War)"}, {"tag": "p", "text": "During the Cold War, a Republic Navy operation occurred over the planet Makem Te between the Galactic Republic and Sith Empire. Members of the Coruscant Aegis Squadron, supported by the Republic Navy, attempted to cripple the badly damaged Harrower-class dreadnought Overlord, which was defended by several ships of the Imperial Armada."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Imperial Armada's Overlord, a Harrower-class dreadnought commanded by Moff Jocend, led an illegal attack on the Galactic Republic border during the Cold War between the Republic and the Sith Empire. The Overlord was badly damaged during the attack, however, and was separated from most of its escorts. The ship attempted to hide from Republic forces in the upper atmosphere of the planet Makem Te with three Terminus-class destroyers."}, {"tag": "p", "text": "However, the Republic learned of the ship's location and sent a member of the Coruscant Aegis Squadron, supported by at least three Thranta-class corvettes, to cripple the ship and capture Moff Jocend."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Upon arriving, the Republic forces immediately began to attack the Overlord and its escorts. The three Imperial escorts each attempted to intercept the Republic fleet and suffered heavy damage doing so. The squadron member continued towards the Overlord, attacking Mark VI Supremacy-class starfighters and the escorts while nearing the warship. The hero was tasked with damaging four shield generators and twelve Laser cannons on the Overlord, as well as eliminating 75 interceptors if the opportunity arose. As the battle commenced three additional Terminus-class destroyers came to the aid of Overlord, one of which was destroyed directly after assisting. The battle ended minutes after beginning and the hero left Makem Te's atmosphere, a disabled Imperial warship orbiting the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Makem Te Assault was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. It appears as one of the first Space Combats available to Republic players, accessible after the player receives their ship and uses their holocomm to speak with Flight Commander Judin. In the Space Combat, players must destroy four of the Overlord's shield generators and then fourteen of the ship's sixteen turbolasers. The two-part daily mission \"Operation: Noble Gambit\" includes completing both Makem Te Assault and the Space Combat: \"Archenar Interception\"."}, {"tag": "p", "text": "There are also three bonus missions present in the battle. The first is taking out a total of 75 Mark VI interceptors or turrets on the defending ships, and another is destroying the Terminus class destroyer's engines (six in total) and shield generators. A third bonus mission, which can only be completed once a day, is to deal enough damage to the Overlord's bridge via proton torpedoes that the ship itself will be destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}