{"url": "The_Final_Trap", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "The Final Trap"}, {"tag": "p", "text": "The Final Trap is a comic strip written by Archie Goodwin and illustrated by Al Williamson. It was published by the Los Angeles Times Syndicate."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Darth Vader and the Emperor are growing impatient with the search for the Rebels and feel, even with the help of the full Imperial armada, that the search isn't producing expected results."}, {"tag": "p", "text": "While on their way back to Rebel base on planet Hoth, Han Solo and Luke Skywalker receive a Rebel distress signal from planet Verdanth, and after contacting the Rebel base they learn that the Rebels have intercepted an Imperial Probe Droid signal from planet Verdanth. The Imperial signal also indicates that the Probe is connected to Imperial High Command. The Rebels do not want to risk sending a squad of troopers to recover the Probe Droid, because they suspect a trap, so they have sent C-3PO and R2-D2 instead to scout the planet. Indeed the Rebel distress signal is from C-3PO and R2-D2. After a small argument, Luke Skywalker convinces Han Solo to diverge from their original heading of planet Hoth, to planet Verdanth to rescue C-3PO and R2-D2 and possibly to recover the Probe Droid. Upon arrival Luke Skywalker and Han Solo find C-3PO and R2-D2 to be under fire from the Probe Droid, which has been programmed to fire on all droids, but as soon as Luke and Han arrive, the probe stops firing. Luke decides to investigate the Probe Droid."}, {"tag": "p", "text": "Meanwhile, the Empire has been fully aware of the situation on Verdanth, of the droid first sent there, and has been waiting for the eventual human contact. When the Empire receives message from probe of human contact, Darth Vader enters a Cybernetic Chamber, which allows him to connect directly to the probe on planet Verdanth. When Luke Skywalker gets close enough to the Probe Droid, an Energy Shield surrounds him, and Darth Vader—using the Cybernetic Chamber—attacks Luke with the Force through to droid intent on probing Luke's mind for the location of the Rebel base. During Vader's attack Luke is unable to move, and Han's blaster is not strong enough to punch through the Energy Shield. In a daring move, R2-D2 approaches the Probe Droid, which causes the probe to drop shield and attempt to fire at R2 because of the probe's programming; this gives Han Solo a chance to fire. After the probe is destroyed, Luke seems to be a little groggy, but mostly fine."}, {"tag": "p", "text": "C-3PO, R2-D2, Han Solo and Luke Skywalker return to the Millennium Falcon to return to their trip to planet Hoth and to the Rebel base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}]}