{"url": "The_Force_Unleashed_(novel)", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends novels", "Category:The Force Unleashed"], "nodes": [{"tag": "h1", "text": "The Force Unleashed (novel)"}, {"tag": "p", "text": "The Force Unleashed is a Star Wars Legends novel written by Sean Williams that adapts the video game of the same name. It was first published in hardcover by Del Rey on August 19, 2008, and a paperback edition was published on August 25, 2009. A sequel, The Force Unleashed II, was published in 2010."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"The Sith always betray one another....I'm sure you'll learn that soon enough.\""}, {"tag": "p", "text": "The overthrow of the Republic is complete. The Separatist forces have been smashed, the Jedi Council nearly decimated, and the rest of the Order all but destroyed. Now absolute power rests in the iron fist of Darth Sidious—the cunning Sith Lord better known as the former Senator, now Emperor, Palpatine. But more remains to be done. Pockets of resistance in the galaxy must still be defeated and missing Jedi accounted for…and dealt with. These crucial tasks fall to the Emperor's ruthless enforcer, Darth Vader. In turn, the Dark Lord has groomed a lethal apprentice entrusted with a top-secret mission: to comb the galaxy and dispatch the last of his masters' enemies, thereby punctuating the dark side's victory with the Jedi's doom."}, {"tag": "p", "text": "Since childhood, Vader's nameless agent has known only the cold, mercenary creed of the Sith. His past is a void; his present, the carrying out of his deadly orders. But his future beckons like a glistening black jewel with the ultimate promise: to stand beside the only father he has ever known, with the galaxy at their feet. It is a destiny he can realize only by rising to the greatest challenge of his discipleship: destroying Emperor Palpatine."}, {"tag": "p", "text": "The apprentice's journeys will take him across the far reaches of the galaxy, from the Wookiee homeworld of Kashyyyk to the junkyard planet of Raxus Prime. On these missions, the young Sith acolyte will forge an unlikely alliance with a ruined Jedi Master seeking redemption and wrestle with forbidden feelings for his beautiful comrade, Juno Eclipse. And he will be tested as never before—by shattering revelations that strike at the very heart of all he believes and stir within him long-forgotten hopes of reclaiming his name…and changing his destiny."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The 2012 reference book The Essential Reader's Companion dates the events of The Force Unleashed and The Force Unleashed II to 3 BBY–1 BBY, placing them between the novels The Hutt Gambit (1997) and Lando Calrissian and the Mindharp of Sharu (1983)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}