{"url": "Battle_of_Malrev_IV_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Thrasybule sector", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Malrev IV  (Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Malrev IV occurred when Rogue Squadron was sent to search for the missing ship Starfaring. They were attacked by the native Irrukiine under the mental control of Cartariun, user of Sith magic."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Rogue Squadron was sent in the Malrev system to search for the missing Bothan ship Starfaring. The ship crashed on the planet Malrev IV. This former Imperial world was home to a Sith Temple used by the Devaronian Cartariun to control the native Irrukiine."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Upon arriving in-system, Dllr Nep heard a strange sound, which led the Rogues to the system's fourth planet and an ambush of TIE fighters, in which Wedge Antilles was shot down. The others landed and found the Starfaring and the survivors of its crew. During the first night, the group suffered a violent attack from the Irrukiine. The beasts were finally driven off by Rogue pilot Nrin Vakil who blasted the Irrukiine with his X-wing. As the Irrukiine were attacking, their master Cartariun healed Wedge in the nearby temple."}, {"tag": "p", "text": "Cartariun continued using his Sith magic to give nightmares to the Rogues, searching for one who might be malleable to his will. As the Irrukiine attacked the Rogues and Bothans again, Wedge managed to escape from Cartariun. Dllr, however, went to the temple and willingly handed himself over to Cartariun. The Sith magic has created a music that Dllr could not resist. Cartariun tried to corrupt Dllr, but when he resisted, he sent a squadron of TIEs on the Rogue Squadron X-wings. As Cartariun used Sith magic to direct the battle, Dllr was able to stun, only to be shot in the back by Girov Dza'tey, leader of the Bothans. Girov who had learned the power of the temple killed Cartariun to be the sole recipient of the Sith powers. Taking control of the Irrukiine, he sent more beast and TIEs in the battle."}, {"tag": "p", "text": "In the medical ward of the Starfaring, Rogue pilot Herian I'ngre who had suffered damages from the last battle received a message from the mind of Dllr, telling her to destroy the temple. As the Rogues were outnumbered by a fleet of TIE/IN interceptors, Herian was guided by Dlrr to an X-wing and heads for the temple. In the skies over the planet, the sudden arrival of Eiattuan Z-95 Headhunters led by Princess Isplourrdacartha Estillo turned the tide. Finally Herian fired proton torpedoes into the temple while flying the X-wing inside. The temple was destroyed, along with Herian, Dllr, and Girov."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the destruction of the temple, the Irrukiine stopped fighting and the Rogues were able to leave Malrev IV with the Starfaring. However, Rogue squadron had lost two pilots. Both Nep and I'ngre became Force ghosts following their deaths and looked on as Rogue Squadron departed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}