{"url": "The_Gathering", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Jedi culture"], "nodes": [{"tag": "h1", "text": "The Gathering"}, {"tag": "p", "text": "The Gathering was a rite of passage of the Jedi Order meant as a lesson to teach younglings how to overcome their personal fears or failings and to find a kyber crystal attuned to their Force presence in the Crystal Caves of Ilum. Upon retrieving the crystal, the youngling began the process of constructing his or her lightsaber, under the guidance of Professor Huyang."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Dated to the very dawn of the Jedi Order and passed down over centuries until the Clone Wars, the Gathering was performed in the Jedi Temple of Ilum. The ritual required Jedi younglings to trust their instincts, overcome inner obstacles, and find a unique kyber crystal attuned to their Force presence in the Crystal Cave of Ilum. For a thousand years, those who took part in the Gathering were ferried to and from Ilum on the Crucible, a starship from the era of the Old Republic."}, {"tag": "p", "text": "Escorted by a Jedi of a higher rank, such as a Jedi Master or Padawan, a group of six to eight younglings would travel to the planet of Ilum based on the world's solar cycle. As the weak star was only in the proper position every seventeen days, the trip was timed to align with the solar event. Upon arriving at the Temple, the younglings would endure their first test of skill, where they were entasked with clearing the entrance to the Temple, which was often blocked by fallen snow, ice, and other debris. Once inside, the younglings gathered at the heart of the Temple, where their group leader would lead them in a lecture on the nature of the kyber crystal, lightsabers, and their place in the lore of the Jedi. As the sun rose over the Temple, its light shined through a gap in the Temple's ceiling, where it was focused through a massive kyber crystal and melted the frozen waterfall covering the gates to the caves. Descending into the catacombs of the Crystal Caves on their own, they were encouraged to take great haste in the quest, for the waterfall would freeze over in a matter of hours. This was an intentionally false statement, as the waterfall could be shattered open with the Force. The fabrication was used to encourage a sense of seriousness and urgency within the younglings, and to assist them in breaking through the strange illusory effects of the caves."}, {"tag": "p", "text": "Once inside the labyrinth, the journey became more personalized to each individual youngling. This was a direct effect of the powerful vergence within the caves, which permeated the very stone and caused an intensification of the Force. The vergence exploited the deepest insecurities of those who entered, exposing an individual's weaknesses and shortcomings. If the test was completed successfully and the fears of the individual were overcome, a unique kyber crystal would appear to illuminate, glowing either blue or green or in some instances, another shade and would retain that hue from then on. Failure to overcome the test would result in an overwhelming sense of self-doubt and fear gripping the student, and potentially preventing them from ever finding a crystal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}