{"url": "The_High_Republic_Adventures_3", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The High Republic Adventures"], "nodes": [{"tag": "h1", "text": "The High Republic Adventures 3"}, {"tag": "p", "text": "The High Republic Adventures 3 is the third issue of the canon comic book series Star Wars: The High Republic Adventures. It was written by Daniel José Older, illustrated by Harvey Tolibao and Rebecca Nalty, and first published by IDW Publishing on April 7, 2021. It features the story \"Starlight,\" in which Zeen Mrala grows accustomed to life with the Jedi on the Starlight Beacon."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In the glory days of the Republic, the Jedi stand as guardians of galactic peace—until a powerful new adversary called the Nihil arrives. Zeen accompanies the Jedi to the Starlight Beacon, a glowing symbol of the Jedi and Republic. [sic] where she learns what it means to be a Padawan. Meanwhile, Krix and the Nihil fight their way through a Republic blockade to safety, and Krix begins to wonder who this strange man who helped him really is."}, {"tag": "p", "text": "Writer Daniel José Older, bestselling author of Star Wars: Last Shot, and artist Harvey Tolibao bring IDW into The High Republic, a massive publishing crossover spanning comics and prose!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the Gaze Electric and on the Starlight Beacon, Krix Kamerat and Zeen Mrala watch messages they have sent each other on a pair of matched holoprojectors. Zeen tells Krix how much she misses him and how she wishes she could tell him what has happened in person, but Krix is still angry that Zeen never told him she was Force-sensitive, because it means that he was wrong about knowing her better than anyone."}, {"tag": "p", "text": "It has been a week since Zeen arrived at the Beacon, and she still cannot believe she is surrounded by Jedi, people she was always taught she could not trust. However, they have been very kind, and she has spent a lot of time having fun with Lula Talisola and her friends, who have been extremely welcoming even though Zeen has just met them and they have known each other their whole lives. She knows this information will hurt Krix, but she finds it amazing to actually let herself feel the Force instead of pretending it is not there, since the truth is that she has never felt more at home with herself and more surrounded by people who care about her. She still hears the echoes of the destruction in Bralanak City, a place she still misses, as well as missing her best friend Krix."}, {"tag": "p", "text": "Zeen starts crying just as Lula comes in and asks her what is wrong. She admits that she is still processing what happened and asks Lula if she needs something. Lula has come to tell her that the Jedi Masters want to talk to her, but the Masters arrive just after her, asking if they are not interrupting. Yoda has delicious pastry treats. Avar Kriss says that they thought it was time to talk about Zeen's plans for the future."}, {"tag": "p", "text": "Krix says in his message that the Nihil have not treated him all that badly and the food has actually been pretty good, but none of that is the point. Aboard the ship, Zagyar escorts Krix to a meeting with the boss, Marchion Ro, who is displeased with Elder Tromak for not revealing the information he wants. Tromak insists that the Elders' scriptures prohibit revealing that information to outsiders, and the information can only be passed on to the next in line to the Council of Elders. Krix narrates in his message that all of that could change at any moment, because everyone he has ever cared about has abandoned him, and he blames Zeen for leaving him alone. Ro orders Krix and Tromak taken to the battle rink, as Krix vows to do whatever is necessary to survive and make sure he never winds up in this situation again."}, {"tag": "p", "text": "Krix asks Tromak what Ro wants from him, and the Gran explains that the Eye of the Nihil seeks the location of an ancient relic which was hidden by the Elders many years ago. It was divided into two pieces hidden on different planets, and the Elders swore never to reveal the locations to anyone, knowing whoever sought it out would be up to no good. Krix persuades Tromak to tell him the location so the information is kept safe, promising not to tell anyone. Agreeing, Tromak tells him the artifact is on the outskirts of the Kharvashark Ruins, on Vrant Tarnum in the Stygmarn system. As the two are pushed into the battle rink, Krix says there are two voices at war inside him: one that misses Zeen, and one which hates her for not telling him the truth. Inside the gladiatorial arena, the announcer commands the contestants to mount their bogaranth and start fighting."}, {"tag": "p", "text": "At Starlight, Estala Maru, Avar Kriss, Kantam Sy and Yoda debate what is to be done with Zeen while Torban Buck eats. Maru points out that Zeen is far too old to begin Jedi training, but Avar notes that they do not know the actual status of Trymant IV. Sy argues that Zeen could stay there temporarily, as she has proven herself a powerful ally and gets along well with Lula. Yoda agrees with Sy's points. Lula interrupts, suggesting to the Masters that they should ask Zeen what she wants to do, since her opinion is the most important. Farzala Tarabal adds that they should also ask the opinions of those with the next most important opinions, Zeen's friends: all of the Padawans and younglings she has met during her time on the space station."}, {"tag": "p", "text": "Aboard the Gaze Electric, an Ortolan pirate tells Tromak and Krix that one of them needs to ride the bogaranth. Tromak volunteers, though he is unlikely to survive, to Krix's surprise, although as he is hoisted up he says that he has lived several centuries already, and it is time for the younger generation to take over. The Ortolan then tells Krix that he gets to be the \"slime runner\": in charge of guiding the creature so it does not run amok. However, bogaranths are always very hungry, leaving a trail of slime everywhere, so if Krix does not want to get eaten, he will have to run. Just as the match begins, Ro orders it stopped, announcing that they have found Krix's holoprojector, meaning there is a traitor in their midst."}, {"tag": "p", "text": "Farzala, assisted by Bibs and Qort, regales an audience with the tale of how they, Lula and Zeen fought off the Nihil and dealt with the Emergence at Trymant. Kantam notes that the Padawans want their friend to stay, and Avar amusedly responds that every time she hears the story, it gets bigger and better. Maru states that they may not be allowed to train Zeen, but she can stay on a temporary basis while Trymant IV is recovering, and she could be useful since she personally knows two people in the Nihil camp. The only problem is that they do not know where to find them, but Yoda and Zeen may have an answer for that."}, {"tag": "p", "text": "Krix claims that the holoprojector belongs to Tromak, to his shocked denials. Ro asks if he is sure, and Krix lies that he saw Tromak using it late at night but thought that Ro knew about it. Ro orders Krix brought to his chamber. Tromak, as he is dragged away to be fed to the bogaranths, is furious about Krix's betrayal, shouting that he helped raise him."}, {"tag": "p", "text": "Aboard Starlight, Yoda explains about the holoprojectors he gave Krix and Zeen, and the Mikkian girl admits that he did reach out, and she responded because she missed him. Yoda tells her she has nothing to apologize for, as she may well save the day. On the Gaze Electric, Krix insists that the holoprojector was not his, but Ro sees through his lie. Ro explains that although he respects the \"little play\" Krix pulled, their real problem is that they found a transponder beacon inside, giving the Jedi their exact location."}, {"tag": "p", "text": "Maru notes that this attack was very different from the Nihil's usual style, and Yoda remarks that they had something strange aboard their cruiser, stating that they need to find out more. Avar says that based on all this, she suspects this group is on some kind of high-level secret mission. Farzala declares that they could sneak up on them and \"pummel\" them with laser cannons. Yoda notes that the transponder only has a short range, but there is still a way."}, {"tag": "p", "text": "Ro tells Krix that the girl has betrayed him once again, a sentiment backed up by one of his droids and Zagyar. He tells Krix that there is still a way he can redeem himself and help them, Zagyar adding that Krix will be able to help himself too. Zagyar says that they will let the Jedi think they've found them before springing their trap, and Ro tells Krix it will not work without his help, asking him if he will turn against the one who betrayed him to help them defeat the Jedi once and for all."}, {"tag": "p", "text": "Avar notes that there have been reports of Nihil attacks in the Bright Jewel system, and Buck says they could start looking at Ord Mantell to see if the Nihil show up. Kantam says that they need to find out what Yoda saw aboard the Spider Cruiser, and Yoda says that for the transponder to work, it would need to send a message when they are closer. Yoda says that they are putting a lot of pressure on someone so young, telling Zeen she should do only what she is comfortable with, and Lula asks her if she will help them stop the Nihil."}, {"tag": "p", "text": "Krix says that he will try. Zeen says she does not know."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In this issue, Estala Maru is depicted with brown hair and red eyes. However, in the Star Wars: The High Republic series from Marvel Comics, the character is depicted with grey hair and eyes."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}