{"url": "The_High_Republic_Adventures_5", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The High Republic Adventures"], "nodes": [{"tag": "h1", "text": "The High Republic Adventures 5"}, {"tag": "p", "text": "The High Republic Adventures 5 is the fifth issue of the canon comic book series Star Wars: The High Republic Adventures. It was written by Daniel José Older, illustrated by Harvey Tolibao, and published by IDW Publishing on June 16 2021. The issue contains the story \"Showdown on the Junk Moon\", the final part of the series' first story arc."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Nihil have launched an attack on Burundang. The Republic sends Yoda and his Padawan learners, along with other Republic and Jedi ships, to try to stop them from escaping. Zeen and Lula pursue Krix, hoping for a final confrontation between the two friends."}, {"tag": "p", "text": "Writer Daniel José Older, bestselling author of Star Wars: Last Shot, and artist Harvey Tolibao bring IDW into The High Republic, a massive publishing crossover spanning comics and prose!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Zeen Mrala flies her borrowed Jedi Vector over the junk moon of Quantxi, telling the autopilot to fly lower as she searches for her friend Krix Kamerat, hoping she can persuade him to come with her. She spots a commotion below: Krix chases a Junk Maven through the debris, yelling at his target to get back here. Seeing the Vector overhead and recognizing it as a Jedi ship, he fires his blaster at it, only to be horrified when he sees Zeen onboard the crashing starfighter."}, {"tag": "p", "text": "Elsewhere on Quantxi, Zagyar informs Marchion Ro that something is up with the Junk Mavens, as they appear to be summoning something. Ro orders that X-10 be told to prepare the starship, and that the Junk Mavens be wiped out with no survivors. However, Zagyar points out that it's too late for that, as the avian beings begin attacking the pirates."}, {"tag": "p", "text": "Padawans Lula Talisola, Farzala Tarabal and Qort track the signal from Zeen's holoprojector, only to spot the Nihil attack on the Junk Mavens. Farzala declares that they must act, and they ignite their lightsabers and leap into battle. Lula realizes the signal is coming from where a distant column of smoke is rising, and Farzala tells her to go while he and Qort handle the situation."}, {"tag": "p", "text": "Krix approaches the crashed Vector, and Zeen, regaining consciousness, is shocked to realize that he shot her down. He attempts to explain, but receives a transmission from Ro ordering him to meet him immediately. Struggling out of the wreckage, Zeen asks what's happening and shouts for Krix to help her, but he runs off."}, {"tag": "p", "text": "Jedi Masters Torban Buck, Kantam Sy and Yoda search for the wayward Padawans on the moon, noting the fighting in the distance. Yoda says that the Force will guide them, but the three encounter Elder Tromak, leading a bogaranth, who offers to help them. Yoda and Buck note that the Gran was on the \"bad guys'\" side during the battle on Trymant, and Tromak claims that he made a daring escape, offering to lead them to the Nihil encampment on the bogaranth that he stole. Buck and Sy ask about Tromak's people's hatred of the Jedi, and how dangerous the creatures are when hungry. Tromak concedes that they have their differences, but they also have a common enemy, and the bogaranth is no longer hungry due to his daring escape. Buck tells Sy to lead the way."}, {"tag": "p", "text": "As \"Buckets of Blood\" mounts up, Tromak speaks to Yoda, admitting that as much as he distrusts Force-users, he finds himself in need of their assistance. When Yoda talks about stopping the Nihil, Tromak explains that they are after something much more dangerous than Quantxi, something only he knew the location of until now. Yoda asks if it is related to the sacred artifact with the strange purple glow he found on their ship, and Tromak is horrified to realize that the Nihil already have part of the relic. Saying they have no time to waste, he asks Yoda to come with him to look for the relic after they drop off the others. Admitting that he does not truly trust Yoda, however, he asks him to leave his comlink behind, as the relic's location is a secret he has already divulged to too many. Yoda asks Tromak why he is trusting him with this, and the Gran says that their paths crossed on Dalna once, many years ago. Yoda says he will consider Tromak's proposal."}, {"tag": "p", "text": "Fighting the Nihil, Farzala wonders why the Junk Mavens are just shaking rattles instead of actively fighting, only for a Savrip to burst into the fight and begin attacking the pirates. He comments to Qort that that explains things. Lula comes upon the Vector crash site, and spots Zeen chasing after Krix in the distance. Igniting her lightsaber, she shouts at Zeen to be careful. Buck and Sy arrive at the fight, to Farzala's relief, and Kantam asks where their Padawan is. Farzala explains that Lula went to help Zeen, telling Kantam to go find her as they hold down the fight here."}, {"tag": "p", "text": "Zeen confronts Krix, but she is angry. As he begins to speak, she Force chokes him, saying that she doesn't want any more lies, promises or apologies, since he almost killed her and her friends. Lula arrives and stops her, saying that this is not their way, only for the girls to be startled by the arrival of a Nihil starship. As the ship opens fire, Lula deflects it, but Marchion Ro appears on the ramp and orders his gunners to hold fire. Offering his hand to Krix, he tells the boy to come quickly. Krix takes the offer as Zeen leaps for his abandoned blaster, firing a futile shot at the ship as Ro orders Zagyar to pull up."}, {"tag": "p", "text": "However, Zagyar cannot move the ship, and as Ro orders him to summon the Squall Spider, Zagyar compares it to a tractor beam. Lula and Zeen try to prevent the ship's escape with telekinesis, but they are growing weary when Kantam and Buck show up to help. Before the Jedi can pull the ship in, however, the Spider Cruiser arrives and seizes the smaller ship in its legs, to Zeen's dismay. The pirates escape into hyperspace."}, {"tag": "p", "text": "At the Republic Outpost on Ord Mantell, Buck talks to Kantam about baking while Lula and Zeen are relieved to see that Farzala and Qort are okay. Farzala points out that of course they are, as the girls are the ones who nearly got blown up, and the four hug each other. Lula asks if there has been any word from Master Yoda. Torban says that they found his comlink on the ground near the encampment, but that's all. Kantam says that Yoda sent one last message saying not to follow him, and they have to trust that he knows what he's doing."}, {"tag": "p", "text": "Elsewhere, Yoda and Tromak arrive in the Stygmarn system on course for Vrant Tarnum. Yoda advises Tromak to begin evasive maneuvers, and he realizes that someone left behind a network of protective drones. It is too late, as the drones gain a lock on their starship and shoot it down."}, {"tag": "p", "text": "At the Kharvashark Ruins, Marchion Ro exclaims that he has found the missing piece, and Krix asks what it is. Ro explains that it is an heirloom of sorts, something he has spent years looking for, which will change the galaxy forever. He says that Krix is probably wondering why he was brought along for such a momentous journey. Ro explains that Krix reminds him of himself at that age, and he needs someone he can trust to run the new Nihil outpost. Removing his helmet, Ro hands Krix another one which the boy comments looks like his. Ro explains that it used to be his, and, telling Krix it belongs to him now, asks if he can trust him."}, {"tag": "p", "text": "On the Starlight Beacon, Zeen asks if she will be sent away for what she did. Lula assures her not, and Kantam says that they are actually doing the opposite. They tell Zeen that no one expects her not to feel what she did, especially considering her lack of training, and it is what she does that matters. Kantam says that they cannot train her to be a full Jedi, but they can teach her to use her skills for good. Saying that they talked it over with the other Masters, Kantam tells Zeen that they agreed the best thing to do was to help her learn about the Force, especially since while the Nihil are in retreat, they clearly are not gone for good. Lula adds that she can remain on Starlight with them, asking Zeen if she will stay and help them fight the Nihil."}, {"tag": "p", "text": "Krix and Zeen's answers are the same. \"Of course. I'll do whatever needs to be done.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The original solicitation for this issue released by IDW stated that its events would occur during a Nihil attack on Burundang, a location first mentioned in Older's adult novel Last Shot. However, the final issue takes place entirely on Quantxi, the Junk Moon of Ord Mantell, with no mention of Burundang."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}