{"url": "Battle_of_Mandalore_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Mandalore", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Battle of Mandalore  (Yuuzhan Vong War)"}, {"tag": "p", "text": "In the year 29 ABY, a battle was fought on the planet Mandalore, between an attacking force of Yuuzhan Vong warriors and the Mandalorian inhabitants of the world. During the early portion of the Yuuzhan Vong's invasion of the galaxy, the Mandalorians' leader, Boba Fett, had officially aligned the Mandalorians with the extra-galactic aliens under the provision Mandalorian space be spared from their conquests; however, Fett understood that the Yuuzhan Vong would eventually turn on the Mandalorians and secretly instructed his people to act as covert saboteurs and intelligence gatherers, turning over the information they collected to the New Republic. The Yuuzhan Vong eventually uncovered Fett's deception, and launched an assault on Mandalore, bombarding the planet with singularity ordnance and landing warriors by the thousand."}, {"tag": "p", "text": "The Mandalorians made use of underground tunnel networks and their fierce combat skills to engage the Yuuzhan Vong. At the town of Bralsin, the Mandalorians clashed with more than a thousand Yuuzhan Vong warriors, slaying them in droves. Though large swaths of forested land was leveled, and close to one and half million Mandalorians were killed by the battle's end, the Mandalorians succeeded in driving the Yuuzhan Vong from their world, becoming the only people of the galaxy to defeat the invaders on their own. The aftermath of the battle left Mandalore severely scarred, and the planet's infrastructure destitute until the discovery of a lode of beskar iron ore that had been exposed by the Yuuzhan Vong's bombardment. The highly valuable metal led to a period of economic resurgence for the Mandalorians, allowing Mandalore to make a steady recovery from the devastation the battle had left in its wake."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When the Yuuzhan Vong set out from their home galaxy to conquer a new one, they sent ahead a scout by the name of Nom Anor to make preparations that would allow their invasion to proceed more easily. Understanding the potential the Mandalorians had as allies, Anor made contact under the alias of \"Udelen\"; he first approached the bounty hunter Goran Beviin, alone, contracting the mercenary for an assassination against a politician on Ter Abbes. Satisfied with the display of Mandalorian competence Beviin showed upon completing the assignment, Anor met with the reigning Mand'alor—the traditional leader of the Mandalorian clans—Boba Fett to contract ongoing Mandalorian mercenary assistance in his secretive goals. Anor's true nature was revealed in 25 ABY, when he gathered Fett and a small squadron of Mandalorian-piloted starfighters to witness the arrival of the Yuuzhan Vong fleet. Confronted with the truth of the Yuuzhan Vong's extra-galactic invasion, Fett negotiated the Mandalorians' continued support in exchange for immunity for the Mandalore sector."}, {"tag": "p", "text": "However, while the Yuuzhan Vong and the galaxy at large believed the Mandalorians to be allied with the invaders, Fett ordered the Mandalorian people to covertly gather intelligence on the aliens' bio-techonology and sabotage their efforts. Fett, himself, forged a secret relationship with the New Republic Intelligence agent Kubariet, after rescuing the Jedi Knight from a Yuuzhan Vong subaltern during their attack on Birgis. The subaltern was killed, and Fett promised to pass on what intelligence his people collected to the New Republic through Kubariet, so long as the Mandalorians were not publicly named as the source of the information. Despite these precautions, the Yuuzhan Vong eventually uncovered Fett's deception, and set out to wreak their vengeance on the planet Mandalore."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 29 ABY, Yuuzhan Vong forces from the already conquered world of Bandomeer launched an assault on Mandalore. Unlike other planets the Yuuzhan Vong had invaded with the intention to terraform them to their own specifications, the Yuuzhang Vong attacked Mandalore with the single purpose of destroying the Mandalorians. From orbit, the Yuuzhan Vong's warships dropped singularity ordnance indiscriminately, blowing massive craters in the surface of Mandalore. Large swaths of woodlands were flattened, including the forests that surrounded Mandalore's capital city, Keldabe. Whole settlements of domains built into the trunks and branches of ancient veshok trees were obliterated in their entirety, and the buildings that comprised Keldabe sustained significant damage during the attack. Once fertile farmland was poisoned and salted, in an attempt to render it unusable."}, {"tag": "p", "text": "The Mandalorians largely survived the orbital assault through the use of a network of underground tunnels that extended from beneath a number of their homes and structures, and into the mountains far away. When the Yuuzhan Vong deployed their warriors to the surface, the Mandalorians struck back, using the tunnels and their sheer martial ability to combat the Yuuzhan Vong. More than a thousand Yuuzhan Vong warriors engaged the Mandalorians in the small Keldabe suburb of Bralsin. Despite the area's poor defensive capabilities, the Mandalorians fought and defeated them in a massacre that would leave an imprint in the Force for more than a decade after. The Mandalorian soldier Goran Beviin, the first to make contact with the Yuuzhan Vong, killed several of their warriors at Bralsin with his beskad saber. Legions of Mandalorian supercommandos, native soldiers, and the Mandalorian Protectors led by Boba Fett, fought to protect Mandalore from the Yuuzhan Vong, eventually defeating and repelling the invaders. When the battle finally came to an end, close to one and a half million Mandalorians were dead, and though the Yuuzhan Vong death toll was higher still, Mandalore's population had been reduced by nearly a third."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Regardless of the severe loss of life, the Mandalorians became known throughout the galaxy as the only people to defeat the Yuuzhan Vong on their own. Having turned openly hostile against the Mandalorians, Boba Fett led the Mandalorian Protectors against the Yuuzhan Vong in defense of the galaxy, defeating the Yuuzhan Vong at Gyndine, liberating Tholatin from their control, and during the battle at Caluula Station, the Mandalorian Protectors made the Yuuzhan Vong fear the power of Mandalore."}, {"tag": "p", "text": "In spite of the Mandalorians' role in fighting the Yuuzhan Vong, when the war was over, Mandalore did not receive any reconstruction aid from the Galactic Alliance, the newly risen galactic government formed during the conflict from a restructuring of the New Republic. More than ten years after the war's end, Mandalore's population remained largely depleted, many of its farms laid fallow, and tracts of land were still barren and blackened. At the battlefield of Bralsin, the bodies of the dead Yuuzhan Vong were buried, though their bones often washed up following a heavy rain. Keldabe's damaged buildings were mostly repaired over time, though the hundred-meter-tall tower headquarters of the MandalMotors company retained battle scarring a decade after the Yuuzhan Vong's assault. This atmosphere gave birth to the kadikla movement, espousing the need to place Mandalore first and concentrate on its reconstruction. In 40 ABY, during a meeting of the clans at MandalMotors Hall in Keldabe, proponents of kadikla persuaded Mand'alor Boba Fett to recall two million Mandalorians from across the galaxy to rebuild the damage and revitalize the poisoned farms. At the Mand'alor's call, Mandalorians came by the hundreds, and upon approach to the planet, a pair of Mandalorians—one a geologist, and one a minerals engineer—discovered that the Yuuzhan Vong's singularity ordnance had exposed an enormous lode of beskar iron ore north of the city of Enceri. The beskar lode led to an era of economic resurgence for Mandalore, the Yuuzhan Vong's attack ironically strengthening the Mandalorian people."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Yuuzhan Vong's attack against Mandalore was first introduced to Star Wars canon via a mention in the Star Wars Insider article The History of the Mandalorians, authored by Abel G. Peña and published March 2005 as part of the Insider magazine's eightieth issue. The battle and it's aftermath were later mentioned in Karen Traviss' Star Wars: Legacy of the Force novels Sacrifice and Revelation, and alluded to it in her e-novella, Boba Fett: A Practical Man. Jason Fry and Daniel Wallace's reference book, The Essential Atlas, also makes note of the battle as part of the planetary entry for Mandalore, as does The Complete Star Wars Encyclopedia in its informational entry on Mandalore."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}