{"url": "The_High_Republic:_Out_of_the_Shadows", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Articles with an excess of redlinks", "Category:Star Wars: The High Republic young-adult novels"], "nodes": [{"tag": "h1", "text": "The High Republic: Out of the Shadows"}, {"tag": "p", "text": "The High Republic: Out of the Shadows is a young adult novel released on July 27, 2021. It was written by Justina Ireland and published by Disney–Lucasfilm Press as part of the Star Wars: The High Republic publishing campaign. It was announced at a High Republic New York Comic Con panel on October 8, 2020. A preview chapter was published with the novel The High Republic: Into the Dark."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The darkest secrets are the hardest to bring to light..."}, {"tag": "p", "text": "Sylvestri Yarrow is on a streak of bad luck with no end of sight. She's been doing her best to keep the family cargo business going after her mom's death, but between mounting debt and increasing attacks by the Nihil on unsuspecting ships, Syl is in danger of losing all she has left of her mother. She heads to the galactic capital of Coruscant for help, but gets sidetracked when she's drawn into a squabble between two of the Republic's most powerful families over a patch of space on the frontier. Tangled up in familial politics is the last place Syl wants to be, but the promise of a big payoff is enough to keep her interested..."}, {"tag": "p", "text": "Meanwhile, Jedi Knight Vernestra Rwoh has been summoned to Coruscant, but with no idea of why or by whom. She and her Padawan Imri Cantaros arrive at the capital along with Jedi Master Cohmac Vitus and his Padawan, Reath Silas—and are asked to assist with the property dispute on the frontier. But why? What is so important about an empty patch of space? The answer will lead Vernestra to a new understanding of her abilities, and take Syl back to the past... and to truths that will finally come out of the shadows."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sylvestri Yarrow, owner of the cargo hauler Switchback, is stressed out over a run of bad luck. Ever since her mother Chancey's death at the hands of Nihil pirates, Syl has been losing money faster than she can make it. The dissolution of the Byne Guild didn't help matters, although she knows that her copilot Neeto Janajana was a victim of their abusive indentures. The Switchback abruptly jolts out of hyperspace in the middle of the empty Berenge sector, leaving Syl, Neeto, and the ancient droid M-227 puzzled, assuming it's a glitch. However, the sudden appearance of pirate starships leaves Syl reminded of her mother's death, and Neeto has to persuade her to get into the escape pod by pointing out that if she dies, she can't warn anyone about the new tactic the Nihil appear to have come up with."}, {"tag": "p", "text": "Vernestra Rwoh is meditating in a garden on the Starlight Beacon when her Padawan, Imri Cantaros, interrupts her to show off his recently-completed new lightsaber. He also tells her there's a comm droid waiting for her outside. The droid, however, is glitching, and Imri asks to be excused because the numbers of people around are stressing his powerful empathic abilities. As Vernestra waits by herself, she encounters Padawan Reath Silas, who's recently arrived on the space station with his Master, Cohmac Vitus. Reath helps fix the droid, telling her he'll see her later. Vernestra finds herself on a call with her old Master, Stellan Gios, who says he wants her to report to Coruscant, as a Galactic Republic senator wants her help dealing with a situation in the Berenge sector."}, {"tag": "p", "text": "Reath has had an adventurous year since becoming Cohmac Vitus' Padawan, and after they have finished unloading their ship, Cohmac dismisses him so he can go eat while Cohmac goes to see Marshal Avar Kriss. In the cafeteria, Reath sits with Vernestra and Imri, learning about the Padawan's recent discovery of powerful empathic abilities he's having a hard time controlling when he uses them on Reath. Coming to think about romantic relationships after the two leave, Reath is reminded of Nan, the Nihil he met on the Amaxine station, before deciding he doesn't want to think about her and throwing himself into his food."}, {"tag": "p", "text": "Onboard the Gaze Electric, Nan watches a meeting between Marchion Ro and the Tempest Runners that she is not strictly supposed to be attending. She has spent the past year as one of the Eye of the Nihil's trusted spies."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Out of the Shadows was written by Justina Ireland as part of the Star Wars: The High Republic multimedia project. Announced at New York Comic Con on October 8, 2020, it was published on July 27, 2021. Ireland initially planned on a love triangle between Sylvestri Yarrow, her ex-girlfriend Jordanna Sparkburn, and Xylan Graf. When she began writing, however, Ireland discovered that neither Sylvestri nor she herself particularly liked Xylan, and dropped the idea less than halfway through the first draft."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The final version of the novel's prologue contains multiple differences from the version released as a preview in The High Republic: Into the Dark. Among the most notable, Sylvestri and her crew are now stated to be former members of the Byne Guild. The Berenge sector was originally referred to as a star system. The name of Sylvestri's blaster rifle and the doll it was named after were spelled \"Betty\" instead of Beti."}, {"tag": "p", "text": "When Reath Silas and Imri Cantaros meet in the cafeteria in chapter two, it is indicated they have never met each other before. This contradicts Into the Dark, which mentions in its first chapter that Imri is one of the friends Reath hopes to see again when he arrives on the frontier."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}