{"url": "The_High_Republic:_Tempest_Runner", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Future audiobooks", "Category:Canon audio dramas", "Category:Star Wars: The High Republic"], "nodes": [{"tag": "h1", "text": "The High Republic: Tempest Runner"}, {"tag": "p", "text": "The High Republic: Tempest Runner is an upcoming canon audio drama written by Cavan Scott set in the High Republic Era starring the Nihil Tempest Runner Lourna Dee. It is scheduled to be released on August 31, 2021 by Random House Audio."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In this Star Wars audio original, delve into the cutthroat world of one of the High Republic's greatest foes, the merciless Lourna Dee."}, {"tag": "p", "text": "The Nihil storm has raged through the galaxy, leaving chaos and grief in its wake. Few of its raiders are as vicious as the Tempest Runner Lourna Dee. She stays one step ahead of the Jedi Order at the helm of a vessel named after one of the deadliest monsters in the galaxy: the Lourna Dee. But no one can outrun the defenders of the High Republic forever."}, {"tag": "p", "text": "After the defeat of her crew, Lourna falls into the hands of the Jedi–but not before she hides her identity, becoming just another Nihil convict. Her captors fail to understand the beast they have cornered. Just like every fool she’s ever buried, their first mistake was keeping her alive."}, {"tag": "p", "text": "Lourna is determined to make underestimating her their last."}, {"tag": "p", "text": "Locked onto a Republic correctional ship, she's dragged across the galaxy to repair the very damage she and her fellow Tempest Runners inflicted on it. But as Lourna plans her glorious escape, she makes alliances that grow dangerously close to friendships. Outside the Nihil—separated from her infamous ship, her terrifying arsenal, and her feared name—Lourna must carve her own path. But will it lead to redemption? Or will she emerge as a deadlier threat than ever before?"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}