{"url": "The_High_Republic:_The_Great_Jedi_Rescue", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The High Republic young-reader books"], "nodes": [{"tag": "h1", "text": "The High Republic: The Great Jedi Rescue"}, {"tag": "p", "text": "The High Republic: The Great Jedi Rescue (previously titled The Great Disaster) is a young readers book in the Star Wars: The High Republic multimedia project. It was published on January 5, 2021 by Disney–Lucasfilm Press and contains stickers."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Meet the noble and wise Jedi of the High Republic!"}, {"tag": "p", "text": "When a disaster strikes in hyperspace, putting the people of Hetzal Prime in grave danger, only the Jedi of the High Republic can save the day!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Hyperspace collision"}, {"tag": "p", "text": "The Galactic Republic starship Legacy Run is ferrying settlers and goods along a major hyperspace route when the navigator reports an object in the hyperlane. Captain Hedda Casset takes manual control of the ship in an attempt to take evasive action. During the attempt to re-enter space, the ship tears apart due to the old state of the Legacy Run and its crowded compartments being loaded with people and cargo."}, {"tag": "p", "text": "Debris from the destroyed Legacy Run including cargo containers and passenger compartments begin drifting towards the farming planet of Hetzal Prime. With the objects due to crash on the planet, the planetary authorities order an evacuation call. However, there is not enough time to complete the evacuation. To the relief of the people of Hetzal Prime, the Jedi Order broadcasts a message telling them that help is on the way."}, {"tag": "h3", "text": "Jedi to the rescue"}, {"tag": "p", "text": "The Jedi dispatch a Longbeam starship, which deploys three Jedi Vector starfighters piloted by the Duros Te'Ami, the Ithorian Mikkel Sutmani, the human woman Nib Assek and her Wookiee Padawan Burryaga Agaburry. Te'Ami proposes shooting the wreckage before it hits Hetzal Prime. Through the Force, Burryaga senses that people are still trapped in a passenger compartment. On Hetzal Prime, Jedi Master Loden Greatstorm and his Padawan Bell Zettifar find armed guards blocking farmers from entering a starship hangar. The two descend from their Vector to help the locals."}, {"tag": "p", "text": "In space, the Jedi including Burryaga and Nib work together to secure the loose passenger compartment by using the Force to slow down the descending wreckage so that the Longbeam can lasso it with strong cables. Back on Hetzal Prime, Loden and Bell try unsuccessfully to convince the guards to let the evacuees into the starship hangar. A group of opportunistic pirates riding speeder bikes attempt to attack the evacuees but the two Jedi use their lightsabers and Force powers to deflect their blaster fire back onto their speeders, defeating them. Impressed by the Jedi willingness to risk their lives for strangers, the guards decide to open the gates to the evacuees."}, {"tag": "h3", "text": "Working together"}, {"tag": "p", "text": "Meanwhile, the Longbeam finishes securing the loose passenger compartment with retro thrusters. Jedi Master Avar Kriss, who is in charge of coordinating the rescue mission on Hetzal Prime, warns her Jedi comrades that another compartment full of hyperfuel is heading to the planets' suns. Though the Jedi are unable to stop the cargo container, Master Kriss convinces all of the Jedi to combine their Force powers telepathically to change the course of the fuel container. Using their combined telepathic Force powers, the Jedi will the hyperfuel container to shoot past the Hetzal Prime's three suns, saving the Hetzal system from a fiery cataclysm. Through the Force, Burryaga sense the relief of the Jedi and the people of Hetzal Prime."}, {"tag": "p", "text": "The passengers aboard the speeding wreckage were transferred to a Republic ship where they were checked by medical droids. These passengers were then brought to the new Jedi space station Starlight Beacon, the Republic and Jedi Order's new frontier space station. Burryaga and his fellow jedi who took part in the Hetzel Prime rescue mission take part in the space station's dedication ceremony. Before a cheering crowd, the Jedi raise their lightsabers and reiterate their vows to protect light and life, and to be the guardians of peace and justice throughout the galaxy."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}