{"url": "The_Holocrons_of_Fate", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "The Holocrons of Fate"}, {"tag": "p", "text": "\"The Holocrons of Fate\" is the third episode of season three of the animated television series Star Wars Rebels and the first episode after its TV movie premiere, Star Wars Rebels: Steps Into Shadow. It is the fortieth episode of the series overall. It first aired on October 1, 2016 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Maul returns to complete his dangerous plan, and the Ghost crew is caught in the middle."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The return of Maul"}, {"tag": "p", "text": "The episode opens with Kanan Jarrus and Ezra Bridger traveling aboard a CR90 corvette through hyperspace. Ezra is unhappy that his master Kanan is not telling him what he did with the Sith holocron. Kanan insists that it is safe. When Ezra suggests that they could use the holocron, Kanan reminds his Padawan that the secrets inside it almost destroyed him. When Ezra asks why Master Yoda sent them to Malachor, Kanan explains that Yoda had given them the chance to defeat the Sith, and that they had failed."}, {"tag": "p", "text": "One rebel pilot then informs them that they have reached their rendezvous point with a Sphyrna-class Hammerhead corvette, but that the transport is not responding. After exiting hyperspace, the rebels discover that the Hammerhead corvette has been attacked. After docking with the Hammerhead, Ezra and Kanan board the vessel and discover that a skirmish has taken place. In one chamber, Kanan and Ezra find an astromech droid and a wounded rebel crewman. The crewman warns the Jedi that a red blade is after them, and that the Ghost is in danger. Ezra and Kanan think it is another Inquisitor."}, {"tag": "p", "text": "On the bridge of the CR90 corvette, Ezra and Kanan contact Hera Syndulla by hologram. They quickly learn that the other Spectres have been taken prisoner by Maul and his repurposed tour guide droids. When Ezra accuses Maul of betraying them, Maul admits he betrayed the others but that he would have remained loyal to Ezra. When Kanan asks what he wants, Maul demands the Sith holocron that they obtained on Malachor. When Kanan claims that he doesn't have it, Maul threatens to kill his friends. Ezra and Kanan promise to bring back the Sith holocron. Maul then adds that Kanan also bring his Jedi holocron. Kanan begrudgingly agrees, despite Hera's protests, and Maul signs off stating that he'll see them at the rendezvous point."}, {"tag": "p", "text": "When Kanan reprimands Ezra for telling Maul about his holocron, Ezra defends himself on the grounds that Maul was on their side at the time. Ezra asks Kanan if his holocron is still onboard the Ghost, and Kanan confirms it, stating \"Where else would I keep it?\" When Ezra asks about the Sith holocron, Kanan assures his apprentice that it is safe, but that retrieving it will be a problem."}, {"tag": "h3", "text": "A captive audience"}, {"tag": "p", "text": "Meanwhile, aboard the Ghost, Maul inspects a painting done by Sabine Wren. He tells his captive audience – Hera, Sabine, Garazeb Orrelios, and Chopper – that he thought the ship was just a transport, but that he now realizes it is their home. When Zeb angrily asks whether he's planning to move in, Maul asks captain Hera for a tour of the ship. Hera gives Maul directions to the airlock, suggesting he show himself out. Maul then forces Hera to take him on a tour of the ship, against the protests of Zeb and Sabine. Maul addresses Sabine, telling the Mandalorian teenager that she above all should trust him, since he had once ruled her homeworld of Mandalore. When Zeb asks Sabine if this is true, she sighs and confirms that this was the case, \"unfortunately\"."}, {"tag": "p", "text": "Hera then takes Maul on a tour of the Ghost. Maul notes that Ezra and Zeb's cabin has a \"curious smell\", and that Sabine's cabin is quite colorful. He forces Hera to lead him into the next cabin, Kanan's quarters, which Maul considers a dull and dour chamber fit for a Jedi. When Maul demands that she show him Kanan's holocron, Hera feigns ignorance, saying she knows nothing about him. However, Maul uses the Force to read her mind, calling her out for lying and discovering Kanan's real name, Caleb Dume. After probing Hera's mind, Maul learns that Hera was the one who suggested that Kanan recruit Ezra as his apprentice. He also learns that Ezra stole the holocron when he first met the Ghost crew, and where Kanan keeps the artifact, retrieving it from its drawer."}, {"tag": "h3", "text": "Bendu's lair"}, {"tag": "p", "text": "On Atollon, Kanan and Ezra arrive at the dwelling place of the Bendu, travelling by speeder bike. There is no sign of the Force wielder, and Kanan begins calling out for him. As Ezra wonders who Kanan is calling to, behind the Jedi's back the Bendu grabs the sensor stick (or \"thumper\") Ezra had taken along to ward off the krykna. Ezra suggests that Kanan is hearing things, only to panic when a swarm of krykna approach. Kanan tells his apprentice to stay calm. Not trusting his master's words, Ezra ignites his green lightsaber. Kanan tells Ezra that his actions are only making things worse, and that he must learn to make peace with them."}, {"tag": "p", "text": "Suddenly, the krykna flee and Kanan senses Bendu's presence. The sensor stick, broken in two pieces, is thrown to the ground near the Jedi. The Bendu reveals himself to the two Jedi and asks whether they have come for a talk. Ezra can't believe what he is seeing. Kanan apologizes that they cannot chat, and nudges for Ezra to tell Bendu the purpose of their meeting. Ezra tells Bendu that they have come because a Sith called Maul wants the Sith holocron. Kanan adds that Maul also desires his Jedi holocron. Bendu does not know Maul, but is familiar with his kind, and points out that the convergence of the Jedi and Sith holocrons would be dangerous."}, {"tag": "p", "text": "When Ezra remarks that the holocrons are just libraries of information, the Bendu responds that they are more than that. If two powerful sources of information are united, they will grant clarity of vision but can also bring chaos. When Ezra stresses that they need the holocron to save their friends and request its return, the Bendu warns him that the holocron is a source of imbalance between him and his teacher. The Bendu tells Ezra he has hidden the Sith artifact in the nearby krykna nest, and that he and his master will have to work together to retrieve it. Kanan reaches out with the Force and hears the Sith holocron. Before entering the cave, Kanan confiscates Ezra's lightsaber and tells him to use his comlink instead, stating that the krykna would attack the second Ezra ignites the blade. Kanan promises to guide his apprentice through the cave. Ezra enters the cave, grumbling about not having his lightsaber. When Bendu asks, Kanan responds that Ezra must learn to solve his problems without relying on his weapon."}, {"tag": "h3", "text": "An escape attempt"}, {"tag": "p", "text": "Back on the Ghost, Maul is unable to open Kanan's holocron and loses his temper. Listening in the common room, Sabine remarks that \"someone\" is having a bad day. Hera suggests making his day worse. At Hera's signal, Zeb kicks Chopper into two of Maul's tour guide droids. The rebels then knock out their captors, take the droids' blasters and make their way down to the engine room via the central ladder, Zeb closing the trapdoor moments before Maul enters and finds the common room empty."}, {"tag": "p", "text": "On the lower deck, Sabine, Hera and Zeb hear Maul walking, and Zeb notes that he does a lot of clanking. Hera points out that the ex-Sith is half droid. Sabine states they can use that against him, and the three hide behind a closing door just before Maul comes down the front ladder and sees Chopper in the cargo bay. Sabine orders Chopper to activate the magnetizer, pulling Maul onto the cargo bay's ceiling. The rebels then attack him, but Maul breaks free of the magnetizer by using his lightsaber to deflect a shot into the astromech socket, deactivating it. Maul then hurls the rebels aside and locks Chopper in a store room. He angrily yells at Hera and Sabine that they will only stay alive so long as they are useful to him."}, {"tag": "h3", "text": "Ezra's trials"}, {"tag": "p", "text": "Back on Atollon, Ezra is navigating through the dark krykna nest. Kanan tells Ezra to keep to the left via comlink. Ezra instead goes right, and is soon surrounded by several of the spidery creatures and loses contact with Kanan. After telling the Bendu to safeguard their lightsabers, Kanan heads into the cave to assist Ezra, taking off his visor. Bendu remarks that either master and apprentice will regain their balance, or they will be eaten, as such is the way of things. Ezra, cornered by krykna, is rescued by Kanan, who pulls him up to a higher tunnel. When another krykna approaches, Kanan uses the Force to calm it down and send it away, to Ezra's astonishment."}, {"tag": "p", "text": "When Ezra asks his master how he did that, as even with his talent for connection Ezra can't do it, Kanan explains that his blindness has forced him to see things differently through the Force. As they venture deeper into the catacombs, Ezra apologizes for \"everything\". Kanan then reassures his apprentice that it was not his fault, and that he never blamed him. He tells Ezra that it is time for him to forgive himself, and Ezra startles Kanan by hugging him. Outside, the Bendu senses their reconciliation and smiles."}, {"tag": "p", "text": "Ezra and Kanan eventually find the Sith holocron inside a deep chamber, surrounded by several krykna that are tangled together. Kanan tells Ezra to stay calm, and the apprentice uses the Force to levitate the holocron over to them. The entangled krykna initially follow, but stop once the holocron is far enough away. Ezra takes the holocron, and Kanan tells him not to panic, calming another krykna that had come up behind them. After emerging, Bendu tells them that he senses that the imbalance between master and apprentice has been addressed."}, {"tag": "p", "text": "However, Bendu warns them that their true test has just begun. Since the darksider won't be able to open the Jedi holocron, he warns them that the task will fall to one of them. When Ezra states that this means the two Jedi will also get the power of the holocrons, the Bendu warns them that it comes with a price. Once a secret is known, he stresses that it cannot be \"unknown\"."}, {"tag": "h3", "text": "Confronting Maul"}, {"tag": "p", "text": "The two Jedi then travel on an A-wing trainer to the coordinates where Maul has arranged to meet them. Kanan reminds Ezra that he has to deal with the consequences of getting the Sith holocron back, and asks whether it will help them against Maul. When Kanan asks Ezra to open it up, the apprentice replies that he would rather listen to his master. When Ezra asks Kanan what their plan is, Kanan tells him that they will \"play it by year\". When Ezra asks whether Kanan is taking it lightly, his master replies that they must not give in to fear and despair."}, {"tag": "p", "text": "After arriving at the rendezvous point, a Mandalorian asteroid outpost, they land in the main hangar, next to the Ghost. There, they are greeted by Maul, who mockingly addresses Kanan as \"Master Jedi\", telling him to follow the sound of his voice. Kanan tells Ezra to take it easy with Maul. When Maul asks Ezra if he found the Sith holocron illuminating, Ezra demands to know that his friends are safe. Maul replies that their friends will be his guests until their business is complete. He orders his tour droids to escort Ezra to the command center. If he attempts to free his friends or if the tour droids are deactivated, he warns Ezra that his friends will die. Ezra replies, \"Good to know.\""}, {"tag": "p", "text": "Maul then leads Kanan down a corridor, while the tour droids guard the other Spectres in the Ghost's cargo hold. While walking, Maul confesses that he was not trying to blind Kanan, who retorts that Maul was only trying to kill him. Maul responds by stating that if you don't succeed, than try again, shoving the Jedi into an airlock. Kanan is sucked out into space, but manages to cling on to Maul's ship, the Nightbrother. Using the Force, he propels himself back into the hangar bay. After catching his breath, Kanan heads out to save his friends."}, {"tag": "h3", "text": "The two holocrons"}, {"tag": "p", "text": "Meanwhile, at the command center, Maul secretly orders the tour droids to terminate the prisoners. He then tells Ezra that he has lived up to his end of the bargain, and lies that his friends are safe. Maul tells Ezra to kneel on the floor, and they exchange holocrons. After settling down, Maul asks Ezra if he knows what will happen when they open both holocrons, and Ezra says that he knows that any question they ask will be answered. Maul is surprised that Ezra knows, and asks him what his question will be. When Ezra expresses his desire to destroy the Sith, Maul replies that he is seeking only hope. The two open the holocrons, which are drawn together and fuse, bathing the room in brilliant purple light."}, {"tag": "p", "text": "Back on the Ghost, the tour guide droids prepare to execute Hera, Sabine, Chopper, and Zeb with their blasters. Kanan intervenes just in time, beheading the droids with his lightsaber and using the Force to remove the other Spectres' binders. When Hera asks about Ezra, he tells them that the youth is with Maul and that the rebels need to go. Back in the command center, Maul exclaims that he sees nothing but oblivion and vows to go deeper. Meanwhile, Ezra sees something. At that point, they are interrupted by Hera shouting, and the light from the holocrons becomes even more brilliant. Kanan removes his visor, and sees Ezra and Maul in the holocrons' light. He tells Hera that he can see Ezra, and he's going to get him. Hera, mystified, incredulously repeats Kanan's assertion that he can see Ezra, and calls for him to come back."}, {"tag": "p", "text": "Kanan tells Ezra to look away, but Maul tells him to stay focused. While Maul tells Ezra to acknowledge his desire, Kanan warns his apprentice to heed Bendu's warning. Kanan tells Ezra to turn away before it is too late. The young Jedi is tempted by a vision of seeing the key to destroying the Sith. Maul says he can see \"him\", and Ezra sees twin suns. Kanan warns Ezra that it is not worth it. Ezra listens to his master and closes his eyes. Suddenly, the bright glow disappears and the holocrons separate, destroyed, as the rebels are knocked out by a shockwave. Sabine, coming to, asks where Maul is. Maul, taking the opportunity to flee, laughs with the knowledge that \"he lives\", before departing aboard the Nightbrother."}, {"tag": "p", "text": "Kanan and the other rebels attend to the unconscious Ezra, who has sustained a headache. Ezra, upon waking, asks Kanan if he can really see again. Kanan responds that he could see Ezra, but only through the light of the holocrons. When he asks Ezra what happened, the younger Jedi tells him that he saw images of places both unknown and familiar. He doesn't know if it was what he or Maul wanted to see. Kanan reassures Ezra that they will find out together."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}