{"url": "The_High_Republic_Adventures_1", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The High Republic Adventures"], "nodes": [{"tag": "h1", "text": "The High Republic Adventures 1"}, {"tag": "p", "text": "The High Republic Adventures 1 is the first issue of the canon comic book series Star Wars: The High Republic Adventures. It was written by Daniel José Older and published by IDW Publishing on February 3, 2021. It contains the story Collision Course."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Flaming destruction is coming to Trymant IV! A remnant of the Hyperspace Disaster appears in the sky, and Zeen and her best friend Krix have only minutes to get to the Elders of the Path and find safety! Meanwhile, Master Yoda, Master Baro, and a group of Padawans are racing towards the disaster for a daring rescue mission."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Above the planet Trymant IV, a calm spell at Republic Security Zone Monitoring Satellite 777B-Alpha is broken by the sudden Emergence of hyperspace debris, prompting the crew to call Starlight Beacon for help."}, {"tag": "p", "text": "Lula Talisola has a secret. She's a talented Jedi Padawan, at the top of all of her classes, but she doesn't feel she's ready for action. A student on the Padawan Academic Cruiser Star Hopper along with her best friends Farzala and Qort under Jedi Masters Torban Buck and Yoda, they're racing to the aid of the Trymant system as the only Jedi or Galactic Republic starship in range."}, {"tag": "p", "text": "Zeen Mrala has a secret. Along with her best friend Krix, she was raised by the Elders of the Path to believe that the Force is something that should never be sensed by anyone, let alone used. But Zeen is Force-sensitive herself. She swears that she will never use her abilities, and no one will ever find out about them, not even Krix. The duo is running to the meeting house, where the Elders will know what to do."}, {"tag": "p", "text": "As the Star Hopper arrives in the system, Yoda has the Padawans list down what they know about the situation: it's a delayed Emergence from the Great Hyperspace Disaster at Hetzal. Many of the pieces are bearing down on Trymant IV, the system's most densely populated planet, and Bralanak City, the planet's most densely populated area. Yoda and Buck prepare to handle the largest pieces of debris, while the Padawans race to their rescue speeders to handle the evacuation and the smaller chunks. Lula thinks to herself that she wasn't expecting to have to take on a planet-threatening disaster while only an apprentice, hopping into a speeder with Farzala. However, she admits to herself that Yoda is right: they have no choice but to leap into action."}, {"tag": "p", "text": "On Trymant IV, Zeen and Krix see a starship descending from the sky in a cloud of smoke, leading Krix to exclaim that they're saved. But Zeen is uncertain, because sometimes she can sense really bad things coming, like unpleasant static welling up inside of her, and the spider-like ship gives her that feeling. She tries to push the sensation away in keeping with the Elders' teachings, but her pet Cham Cham is also uneasy, possibly picking it up from her. As Krix tries to reassure Zeen that he'll never let anything bad happen to her, she notes to herself that she's been feeling that static all day, but the ship sends it into overdrive, even more than the falling debris."}, {"tag": "p", "text": "Lula pilots her rescue speeder down to the planet as Farzala calls for her to watch out for debris, sighing with relief when she narrowly dodges one large chunk. Zeen and Krix reach the meeting house, but as she calls for him to wait, they peer around a corner to see some armed and masked strangers standing guard. Amidst the intimidating figures, Krix spots a familiar face, Elder Tromak, and immediately concludes the strangers must be here to help even as Zeen tries to point out otherwise, reminding her that he told her he would keep her safe. But before they can get to the ship, they are stopped by one masked figure, who tells them this evacuation isn't for them and to have \"Good luck with the apocalypse though!\""}, {"tag": "p", "text": "Zeen reflects on her past: for the first ten years of her life, her commune moved constantly from planet to planet as if something was chasing them, and they were somehow unsafe, the only constants in her life being Krix and Cham Cham. Her parents disappeared into another commune when she was very young, since relationships between elders and acolytes are considered the most important to the Elders of the Path. But she can never tell Krix about her power, as close as they are. Zeen thought that living on Trymant, the longest she's ever stayed anywhere, would make her power fade since she was safe. But now she knows that nowhere is truly safe."}, {"tag": "p", "text": "Lula is still terrified as she and her fellow Padawans work to evacuate civilians, but everything seems to be going well until Farzala spots a piece of debris heading for a building with people on the roof. Shouting for Bibs and Qort to follow with the hover platform, Lula and Farzala hop into their speeder and manage to shoot down the fragment in time. They decide they need a bigger craft to evacuate people from the city, and Farzala has just spotted a likely ship."}, {"tag": "p", "text": "Zeen argues with the pirate about letting civilians evacuate onboard the large cruiser. Krix jumps in front of Zeen as the pirates raise their blasters before Tromak speaks up, insisting that they be allowed to live because they are acolytes of his community. The pirates are uncertain because \"he\" said to only bring Tromak, and Zeen expresses concern about the others who will die. The conversation is interrupted by the Padawans, led by Lula, who request the use of the pirate ship, although Bibs thinks this is not asking nicely because they already have their lightsabers out. The Nihil are disinclined to give \"sniveling Jedi kids\" their ship. Zeen and Krix are shocked to see Jedi, real Force-users."}, {"tag": "p", "text": "A firefight erupts as the pirates open fire on the Padawans, and Zeen is left thinking: the Elders say to beware the Force, but it is the source of the Jedi's powers, and they use their powers to help people. Zeen realized they are like her, and she could be like them. After deflecting the initial barrage, Lula retorts that they were asking nicely, and Farzala declares that they will take the ship. As the Padawans leap forward, Zeen and Lula together feel something with the Force. Lula deflects blaster bolts while Zeen senses a huge piece of debris falling directly towards them, and she leaps out and acts, reaching out to hold back the debris."}, {"tag": "p", "text": "Farzala, Qort and Krix are all shocked, but Lula reaches out to assist Zeen, who is having trouble, assuring her that \"We got you.\" Krix, a true believer in what the Elders say, is horrified as Tromak tells him they must leave, screaming that Zeen \"lied\" to him. Zeen tries to explain, but another figure arrives, a tall, masked individual descending from the pirate ship. He announces that they have the Jedi right where they want them as the pirates surround the Padawans and Zeen, commanding the assembled Nihil to \"Kill them all!\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The official plot summary names the Jedi Masters in charge of the Star Hopper as Yoda and \"Baro\", when no such character appears. Daniel José Older stated on Twitter that he thought it was a remnant of a rough draft."}, {"tag": "p", "text": "The preview included in The High Republic Free Digital Sampler has the Trymant system referred to as the \"Trymantian\" system. The final comic uses only the term Trymant system."}, {"tag": "p", "text": "The sampler preview has Taris as one of the locations noted on the Galactic Data File map. In the final version, Yavin is highlighted instead. The same map also misplaces Coruscant's location within the Core Worlds, placing it in the exact center of the galaxy in contrast to other maps which place it on the northern side of the Core."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}