{"url": "The_Home", "categories": ["Category:Legends articles", "Category:Kanz sector astronomical objects", "Category:Locations of the Sith", "Category:Outer Rim Territories asteroids"], "nodes": [{"tag": "h1", "text": "The Home"}, {"tag": "p", "text": "The Home was a large iron asteroid in a star system designated MZX32905, near Bimmiel. The name was a translation of what the sapient mynock-like indigenous species called it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The asteroid was greatly imbued with dark side Force energy, which aided in the evolution of its native creatures. These creatures eventually developed a fairly advanced civilization, and learned to tap into the dark side. Though they were powerful Force users, the creatures eventually became extinct due to an unknown cause. However, their inability to reproduce outside of the Home is thought to be a contributing factor."}, {"tag": "p", "text": "Many millennia passed, and eventually a mine was established as part of a large operation within the asteroid belt. Due to the inherent dark side energy in the asteroid, and the residual dark side energy of the extinct creatures, many strange things began to happen at the base. Force-sensitives began to report strange abilities and sightings, and many of the miners began channeling the ancient creatures, and believing they were the creatures themselves."}, {"tag": "p", "text": "Due to this and the fact that the ancient creatures had denuded most of the metal bearing ore lodes in the asteroid, the operation became less and less profitable. The administrator knew this, and being a Force-sensitive himself, he also knew of the dark side power of the asteroid. He quietly shut down the mine, and hushed up all of the reports of the strange incidents, with the rest of the mining operation remaining unaffected."}, {"tag": "p", "text": "The administrator, having learned all he could from the energies within the asteroid, departed the asteroid to seek out the Sith, and later returned as the Sith Lord Darth Vectivus. He built a habitat here, with a large mansion at the center of the asteroids, which had once been the sacred place of the ancient dark side wielding creatures."}, {"tag": "p", "text": "Unknown centuries later, Vectivus's habitat was used as a hiding place and study for the aspiring Sith Lumiya. It was here that she convinced Jedi Knight Jacen Solo to take up the mantle of Dark Lord of the Sith."}, {"tag": "p", "text": "The Home was later blown up by members of the One Sith, in an effort to prevent the Jedi from learning Darth Vectivus's Force phantom projection technique."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}