{"url": "The_High_Republic_Adventures_6", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Incomplete lists", "Category:Star Wars: The High Republic Adventures"], "nodes": [{"tag": "h1", "text": "The High Republic Adventures 6"}, {"tag": "p", "text": "The High Republic Adventures 6 is the sixth issue of the canon comic book series Star Wars: The High Republic Adventures. It was written by Daniel José Older, illustrated by Harvey Tolibao, and published by IDW Publishing on July 21, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "New story arc!"}, {"tag": "p", "text": "As the galaxy prepares for the Republic Fair, Qort and Farzala leave their Padawan friends to join Leox Gyasi and the crew of the Vessel on a secret mission for the Jedi. What could possibly go wrong? As it turns out: literally everything."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Farzala Tarabal remembers that when he, Qort, and Lula Talisola were younglings, they used to watch a holo of the ancient Jedi icon Master Tal Bota, a hero who frequently went on solo missions facing down dozens of Sith henchmen. He could even pull Star Cruisers out of the sky by himself, and they thought he was the greatest Jedi ever. Lula and Farzala used to argue over which one of them would be the new Master Bota, even though they both knew it would be her. But as children, it was all fantasy. Farzala reminisces that they never actually thought they would have to fight anyone for real."}, {"tag": "p", "text": "Onboard the Vessel, Farzala, Qort, and Master Obratuk are travelling to Nal Hutta on a secret mission. For the last few months, there have been nonstop battles with the Nihil, and then Qort and Farzala were fighting with their fellow Jedi and the Hutts against the Drengir, vicious plant creatures. The Hutts asked that a diplomatic envoy be sent to their capital city, nearly the only place in Hutt Space where they successfully fought the Drengir off. Farzala notes the Hutts wouldn't say why their presence was requested, but since Obratuk's specialty is peace negotiations, that's likely what the Galactic Republic thinks it will be."}, {"tag": "p", "text": "When pilot Leox Gyasi announces they've left hyperspace, Farzala wonders where their Republic escort is. Leox adds that they were told not to land, so he, Affie Hollow, and Geode will be keeping the starship at a hover. Affie explains that the escort is absent because Master Avar Kriss had them hold back on standby due to the secrecy of the mission. Noting their proficiency at under-the-scanners operations, Leox assumes that's why they were hired. Farzala accepts the explanation, but wonders why Obratuk didn't tell him and Qort about any of it. Affie quips that the reason is clearly because he is taking an excellent nap. Farzala and Qort unsuccessfully attempt to wake Obratuk, and Leox tells him to hurry up because they've arrived at Bilbousa, where an armed party is expecting their arrival."}, {"tag": "p", "text": "However, Obratuk is unresponsive to Farzala's efforts, and Leox guesses that the Parwan Master has fallen into a seasonal hibernation, which some members of the species do even when away from Parwa, and the planet has seasons several centuries long. A voice from outside calls that it's time for the \"Jedi scum\" to come out for the negotiations. Farzala leans out of the ship and promises they will be right off. Declaring they don't have a choice, Farzala says Qort will have to stay with Obratuk while he does the negotiations, saying his Huttese is pretty decent. Leox decides to accompany him, telling Affie and Geode to stay on the ship."}, {"tag": "p", "text": "As they board a skiff, Farzala is told he looks young to be a chief negotiator, and he responds to the Nikto in kind. The speaker, Ishnar, is however the chief muscle, and demands that Farzala and Leox hand over their weapons. Farzala is worried that things are already not going his way, but Leox reassures him he's doing great. As Ishnark asks Grok Grok to take them down, Affie, Geode and Qort see them off, Affie attempting to say \"May the Force be with you\" but getting the phrase wrong. Onboard the Vessel, Affie asks Qort why the Padawan wears a skull all of the time, but heads off to the cockpit after receiving no response. Qort and Geode are left alone, and the Padawan addresses the Vintian in their alien language before hugging him. A sudden thunk noise startles Qort."}, {"tag": "p", "text": "Farzala and Leox are brought to the palace of the Hutt Skarabda, who is the Hutt Clan's chief diplomatic envoy herself. Leox comments to himself that there usually seem to be more people around. Skarabda, an old friend of Leox, greets her guests before remarking that Republic forces have been working alongside her sister Myarga and the Jedi to defeat the Drengir, and they have come to negotiate a lasting peace between the Republic and the Hutts. Farzala agrees, but Skarabda cuts him off, demanding to know why their ship has armed all of its weapons systems and directed them at the Hutts and their forces. As Ishnar orders the Hutts' fighters scrambled, Farzala and Leox are shocked. As the ship opens fire, Farzala and Leox dodge. Leox says they have to get out of there, and when Farzala asks about the negotiations, as they flee, Leox is explaining why they cannot negotiate right now when they encounter a rancor. As Farzala wonders if Leox was going to end on death, Leox yells for him to run."}, {"tag": "p", "text": "Onboard the Vessel, Affie and Qort are held hostage by a trio of thugs, the leader exhorting them to stay nice and calm, and no one gets hurt. Another thug wonders where that \"rock\" has gone, while the droid Y-99 appears to be malfunctioning. The leader rhetorically asks if no one will fix the droid, while the other thug is still confused by Geode's disappearance. Gargo, piloting the Vessel, interrupts them to report that several Hutt starfighters are fast approaching, only to panic at the sudden appearance of Geode in the cockpit, causing him to flee. As Affie and Qort run for it, the thug leader yells for Gargo to get back in the cockpit, but the thug refuses with the \"evil stone thing\" in there. The transport sustains damage from a barrage of laser fire."}, {"tag": "p", "text": "In the stronghold, Leox leads Farzala towards an exit he remembers, but they run into a wall of guards. Farzala spots a window, but it is a tight fit and there are Drengir outside, explaining why they were told not to land. As the carnivorous plant breaches the palace, Ishnar yells for the \"saboteurs\" to stop, but the Nikto is seized by a vine. Farzala uses telekinesis to retrieve his lightsaber from the guard before attacking the Drengir vines, freeing Ishnar, and then closing the window. The Nikto is surprised to be saved despite having attempted to capture Farzala, but he says it is the Jedi way. As he and Leox are surrounded by guards, Farzala says he does not know why the Vessel fired on the Hutts, but that it was not their intention to do so. He promises to find out what is actually going on if he is allowed. Ishnar is grateful, but insists on the duty of investigating the attack, and says that Farzala and Leox will not be fed to the rancors, for now. Taking back Farzala's lightsaber, the Nikto orders them taken away."}, {"tag": "p", "text": "The Vessel is piloted away from Nal Hutta by Geode, escaping the Hutt Clan starfighters. The thugs are confused, Gargo stating that the elite attack squad appears to have been outflown by a \"creepy rock\" while gasping for breath. The green thug wonders where Affie and Qort have disappeared off to. Farzala reminisces that he knows the holostories about Tal Bota were mostly made up, but they always seemed so exciting, fighting evil enemies and bringing justice to the galaxy. The thug leader agrees that the other goon is now making sense, and since the prisoners' location is unknown, they will tear apart the ship to find them as Jabba said no one gets out of this alive. In hiding, Affie and Qort eavesdrop on the thugs. Farzala reminisces that the stories don't tell you that all being out there on your own really means is that you are alone, as he is heavily restrained in a Hutt detention cell."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The \"Galactic Data File\" page depicts the binding statues differently to the chained poses they are described with in The High Republic: Into the Dark."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}