{"url": "The_High_Republic:_The_Rising_Storm", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: The High Republic adult novels"], "nodes": [{"tag": "h1", "text": "The High Republic: The Rising Storm"}, {"tag": "p", "text": "The High Republic: The Rising Storm is a canon novel released on June 29, 2021. It was written by Cavan Scott as part of the multimedia project Star Wars: The High Republic. It was announced at a High Republic panel at New York Comic Con."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Following the dramatic events of Light of the Jedi, the heroes of the High Republic era return to face a shattered peace and a fearsome foe."}, {"tag": "p", "text": "In the wake of the Great Disaster and the heroism of the Jedi, the Republic continues to grow, bringing more worlds together under a single unified banner. Led by Chancellor Lina Soh, the spirit of unity extends throughout the galaxy, with the Jedi and newly established Starlight Beacon station at the vanguard."}, {"tag": "p", "text": "In celebration, the chancellor plans “The Republic Fair,” a showcase of the possibility and peace of the expanding Republic—a precept the Jedi hope to foster. Stellan Gios, Bell Zettifar, Elzar Mann, and others join the event as ambassadors of harmony. But as the eyes of the galaxy turn toward the Fair, so too does the fury of the Nihil. Their leader, Marchion Ro, is intent on destroying this spirit of unity. His storm descends on the pageantry and celebration, sowing chaos and exacting revenge."}, {"tag": "p", "text": "As the Jedi struggle to curb the carnage of the rampaging Nihil, they come face to face with the true fear their enemy plans to unleash across the galaxy. The kind of fear that even the Force cannot shield them from."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Prologue – Ashla, moon of Tython"}, {"tag": "p", "text": "Months after the dedication of the Starlight Beacon, Elzar Mann is still haunted by his vision of Jedi being killed by a mysterious cloud, including Avar Kriss and Stellan Gios. After receiving his vision onboard the Starlight Beacon, Elzar recalls that he had too many glasses of Kattadan rosé. While dancing with Avar, he leaned too close to her, causing them to have an argument. When he saw her again months later, she was more distant towards him, and Elzar reflects that he should have apologized to her and asked for her guidance. Elzar also reflects that he should have asked Stellan for advice, but reasoned that since Stellan is now a member of the Jedi Council, he would not have the time. Instead, Elzar decided to try to work out the meaning of his vision on his own."}, {"tag": "p", "text": "First, Elzar went to the Archives, and consulted countless holocrons. He even consulted the Ga'Garen Codex, which lead him to the Isle of Seclusion on Ashla, primary moon of Tython. Before heading towards the ocean, Elzar received a message from Rana Kant, informing him that he had been made a Jedi Master, as well as marshal of a Jedi outpost on Valo. This frustrated Elzar, as he believes that he is too troubled to be a marshal. Reaching the ocean, Elzar takes off his boots and outer robes and begins swimming. When he can no longer see land, Elzar dives underwater and asks for guidance from the Force. Getting no response, Elzar comes up for air and dives back down, again asking the Force to help him understand his vision. Elzar keeps diving back underwater, growing frustrated that he is not receiving answers. He dives back down again, and this time he receives another vision: him and fellow Jedi running from something in a thick fog. Elzar demands answers from the Force, and he continues to see images of Avar, Stellan, a Tholothian (possibly Indeera Stokes), as well as sensations of broken bones, cracking skin and screaming. He continues to demand the Force tell him \"where\". Elzar awakens to find himself back on the shore, and as he walks back to his Vector, he realizes that the Force has already answered his question with one word: Valo."}, {"tag": "h3", "text": "Chapter One – The Rystan Badlands"}, {"tag": "p", "text": "Udi Dis pilots the Squall Spider through the Rystan Badlands, using his Force sensitivity to safely maneuver past the asteroids, comets, and ship debris flying around. As Marchion Ro enters the bridge, Udi remembers his previous service as a Strike in the Nihil. Udi had spent the last few years onboard a Cloudship commanded by Scarspike, an abusive thug and poor tactical planner. After a failed attack on Mantero, Udi killed Scarspike by slitting his throat. This brought him into Ro's personal retinue, which upset Pan Eyta (who accused Udi of undermining the Rule of Three). However, due to the usefulness of the Paths provided by Marchion Ro, Eyta's concerns were ignored, and Udi was welcomed aboard the Gaze Electric, Ro's flagship. It was there that Udi learned of their current mission to Rystan."}, {"tag": "p", "text": "As Marchion asks Udi how much longer they will be in the badlands, Udi realizes he doesn't know how to address him. Marchion tells Udi that he can simply call him Marchion, which surprises him, as not even the Tempest Runners can address Marchion by his name. As they exit the ice field, Udi comments that it would have been easier to use a Path, but Marchion insists that he wanted to see Udi at work. Marchion comments that Udi is as impressive as his heritage would suggest (as Udi's Talortai species are naturally Force-sensitive). Udi reflects on how much he owes Marchion, who had helped him kick his decade-long reedug habit. Marchion comments that he is glad Scarspike is dead, and asks Udi if he's ever been to a tidally locked world. Marchion explains that one side is a desert constantly facing the sun, while the other side is a frozen wilderness. Marchion directs Udi to a small band of land towards the center of the planet's extremes, and as they land, Dis remarks that there is nothing there. Marchion tells Udi that he will be surprised by what they find."}, {"tag": "h3", "text": "Chapter Two – The Cyclor Shipyards"}, {"tag": "p", "text": "Bell Zettifar stands on an observation platform in the Cyclor Shipyards, overlooking the research vessel Innovator. He recalls his arrival at the shipyards, when Vam Targes, the ship's chief engineer and designer, had given him a tour. The Innovator is set to be a showpiece at the upcoming Republic Fair, part of Chancellor Lina Soh's Great Works. While impressed by the Innovator, Bell was even more impressed by the Cyclorrians, the insectoid species constructing the ship. Bell was so impressed with their work performance that he couldn't help but smile, as their enthusiasm for their work was infectious."}, {"tag": "p", "text": "Ember, Bell's charhound that he brought with him from Elphrona, gets up to greet Indeera Stokes, Bell's new master after the disappearance of Loden Greatstorm. As Indeera comments on the scale of the Innovator, Bell addresses her as Master, causing him to think of Loden. Indeera notices that he is distracted, and Bell reflects on how it feels weird having her as his master. Despite the fact that they've known each other for years, Bell feels that Indeera can never replace Loden. Bell lies and says that he was thinking about how excited the crowds will be seeing the Innovator, and Indeera asks him if he's looking forward to it. Bell replies that it will be good to see his friends Mikkel, Nib, and Burry."}, {"tag": "p", "text": "Indeera comments that Loden would have loved the Innovator, and Bell asks her what she thinks Loden would say. Indeera replies that he would compliment Bell on the shine of his holster buckle, as well as tell him to smile more. She tells Bell that Loden would also remind him how a Jedi faces the death of a loved one, and she reminds Bell that Jedi are allowed to love, as experiencing emotions is a part of life. She reminds him that Jedi are masters of their emotions, not slaves, and that he must eventually let go of the hurt Loden's loss causes him. She tells him that Loden will always be with him through the Force, and she asks Bell if he believes that. He replies that he does, hoping to fool her, who doesn't seek convinced."}, {"tag": "p", "text": "Hoping to change the subject, Bell suggests that they go and do something. Indeera's comlink beeps, and she activates it, hearing the voice of Stellan Gios. He asks if the Innovator will be ready to launch on time, and Bell answers for his master. He says that the Cyclorrians and Innovator are both marvels, and Stellan expresses excitement for the upcoming opportunity to see the Innovator for himself. Stellan tells Bell that Nib Assek has been singing his praises and is looking forward to seeing him again, causing him to blush. Indeera tells Stellan that the Force has blessed Bell, and Bell is surprised to discover that Indeera and Stellan know each other. As Stellan excuses himself, Bell asks Indeera what he is like. Indeera describes Stellan as one of the finest Jedi she's ever known, explaining that they first met on Caragon-Viner. Suddenly, they sense a disturbance in the Force, and head towards the Innovator."}, {"tag": "h3", "text": "Chapter Three – Safrifa"}, {"tag": "p", "text": "After successfully rescuing the son of a local marsh-lord from a rival clan, Ty Yorrick repairs her ship on Safrifa. Having been paid in novian ore, she plans to visit an armorer on Keldooine who will turn the ore into new saw blades. While reminiscing about a botched job on Alzoc III, she is approached by local Safrifan farmers, who compliment her ship. They ask for its name, and Ty replies that it doesn't have one, as she doesn't like forming attachments with things that can't get attached to her. The farmers offer her novian ore, explaining that a monster is destroying their crops and killing their children. They say that they have been laying traps for the past three weeks, but the monster has destroyed them. She asks the farmers where she can find the monster, and they reply that it lives in the Sorcan Swamp, a three days' hike from her ship. Despite feeling that the job isn't worth it, Ty decides to help the farmers."}, {"tag": "h3", "text": "Chapter Four – Rystan"}, {"tag": "p", "text": "Udi and Marchion land on Rystan, and meet with Kufa, Marchion's cousin. Kufa is pleased that Marchion has returned, and asks him to take off his mask so she can see his face. Marchion refuses, telling her to wait for them to reach the Shrine. Kufa tells him that the temperature will be colder at the Shrine, but it will be worth it for the chance to look upon the Leveler. Marchion asks her if she will take them to the Shrine, and Kufa asks who Udi is. Marchion introduces him as a friend, which pleases Udi. Kufa asks what species Udi is, and Marchion explains that he is a Talortai, a species strong in the Force. Udi explains that he is a navigator and pathfinder, causing Kufa to chuckle. Kufa tells Udi that he is welcome to join them, and thanks Marchion for the credits he sent her earlier. She explains that they will not be able to use her ship, the Open Hand, to reach the Shrine, and will instead have to ride slarga."}, {"tag": "p", "text": "They begin their journey on hoversled, but must soon travel on slarga-back. As they travel, the slarga seem to know where they are going, despite the fact that they are travelling in almost complete darkness. During the journey, Udi frequently uses the Force to make sure that Marchion and Kufa are still nearby, and he tries to stay alert in case they are attacked. After an hour, they dismount and continue on foot, eventually reaching a rocky outcrop. Kufa squeezes herself through a narrow opening, and Udi, drawing his wingblades, follows her inside."}, {"tag": "h3", "text": "Chapter Five – The Cyclor Shipyards"}, {"tag": "p", "text": "Bell and Indeera reach the flight deck of the Innovator, and explain to Vam that something is wrong. Indeera explains that they have felt a disturbance in the Force, and Vam gets frustrated that they can't be more specific. However, he knows to trust the Jedi, and orders a Cyclorrian to conduct a full systems sweep. Again reaching out to the Force, Bell realizes that the disturbance isn't coming from the Innovator. As a nearby alarm begins to go off, Vam explains that it is the hyperspace proximity alarm, an experimental system designed to predict the arrival of ships from hyperspace. However, Vam believes the calculation is in error, as it predicts the ship will come out of hyperspace extremely close to them. Just as the calculation predicted, a ship arrives in realspace, with the three lightning bolts on its nosecone identifying it as a Nihil Cloudship. Indeera asks if the Innovator is armed, and Vam replies that it is a scientific ship. When Vam states that there is only one ship, Bell replies that the Nihil never come alone."}, {"tag": "p", "text": "Onboard the Cloudship, Sarn Starbreaker asks if the Republic shipyard is aware of their presence. A Fluggrian tells him that she is picking up frenzied comm chatter, and that no Republic distress signals can get past their jammer. Pleased, Sarn orders the Nihil to begin firing at the shipyard. Having previously tortured a Republic security officer, Sarn knows that the Innovator is located in Hangar Twenty-Two, and looks forward to raiding it. He believes that this score will cause Pan Eyta to finally promote him to Cloud, and orders the Fluggrian to launch their fighters."}, {"tag": "p", "text": "After boarding his Vector, Bell speaks to Vam, who tells him that Nihil fighters are incoming. Vam also informs him that they can't make contact with the Core, as their transmissions are being jammed. As Bell reaches the battle, he successfully destroys a Nihil hopper. Indeera reminds him not to revel in his enemy's defeat, as it leads to the dark side. Despite his initial resentment, Bell knows that Indeera is right, and thanks her for her teaching. As the battle continues, Bell is saved by a Cyclorrian piloting a Z-29 Skyhawk, who asks if he wants them to focus on the fighters. Bell says he does, and he and Indeera head towards their new target: the Nihil Cloudship."}, {"tag": "h3", "text": "Chapter Six – Safrifa"}, {"tag": "p", "text": "The monster terrorizing the Safrifan farmers turns out to be a Drengir, which drags Ty towards its mouth. As she struggles to break free, Ty reflects on the growing Drengir crisis. Having initially dismissed the Drengir, Ty came to realize how dangerous they are, especially after hearing rumors that entire worlds had fallen to them. Ty also reflects on her time spent with Caratoo, who had taught her to define her limits. Ty only hunts sentient life-forms if they are trying to kill her, and she decides that the Drengir definitely qualifies. She pushes it with the Force, knowing that won't kill it. She continues pushing, eventually freeing herself by snapping the vines that have hold of her."}, {"tag": "p", "text": "As the Drengir attempts to overwhelm her mind, Ty leaps onto a tree branch. As Ty hangs upside-down, the Drengir latches onto the branch, trying to break it. Ty reaches out with the Force, trying to find her weapon. She eventually locates it beneath the Drengir and tries to call it to her. As the Drengir latches onto both her wrists, Ty is able to ignite her lightsaber. She uses the Force to control the blade, slicing the Drengir in two. The branch breaks, and Ty falls to the ground. Since Drengir can regenerate from even the tiniest piece, Ty begins to cut the Drengir into strips so she can burn them. Even though she knows it will be a long process, Ty is determined to uphold her promise to the farmers."}, {"tag": "p", "text": "Ty returns to the Safrifan village and receives her payment. A Kuranu approaches her, introducing herself as Mantessa Chekkat, and asks for her help."}, {"tag": "h3", "text": "Chapter Seven – Beneath the Golamaran ice flats"}, {"tag": "p", "text": "As he journeys through the tunnels beneath the Golamaran ice flats, Udi reflects on the history of the Talortai. He brushes the thoughts away to avoid running into Kufa, who had activated illumination drones when she entered the tunnel. Kufa had been asking Marchion questions for the first hour of their journey, and Udi is relieved that she has finally stopped. However, the silence doesn't last long, as Marchion asks Kufa how many of the faithful are left. Kufa replies \"not enough\", as she believes that the tide can no longer be turned. Marchion asks her why they are returning to the Shrine if she believes the war is lost, and she replies that she hasn't been in the tunnels for over a decade. Kufa asks Marchion if he is there to reopen the Hand, but he replies that it isn't his place, as he isn't a prophet."}, {"tag": "p", "text": "As they continue through the tunnel, Udi becomes more uneasy. He reaches out with the Force, and explains to Marchion that there's something missing. Marchion asks Udi what he feels, and Udi explains that he doesn't receive warnings from the Force like the Jedi do. He can merely sense vibrations, which allows him to pilot through meteor storms and comet fields. Kufa returns and tells them that they need to go back, having found something that she thought would be asleep. As they look into the darkness ahead of them, they hear several roars, each one louder than the last. Despite Marchion's protests, Kufa insists that they exit the tunnel, as the Leveler will still be there when they return. Marchion continues to protest, and Kufa explains that she is trying to protect him. She identifies the roaring creature as a cobonica, but Marchion still refuses to leave."}, {"tag": "p", "text": "Marchion turns to face the approaching creature, igniting his lightsaber. As Udi pulls out his wingblades, the cobonica attacks, lashing out at them with its furry tentacles. Udi gets wrapped up in a tentacle, but manages to cut himself free. His senses returned, Udi is able to predict where the tentacles will strike (although he isn't fast enough to avoid some of them). As they continue to battle the cobonica, Marchion manages to stab one of its eyes, causing it to go into a frenzy. Udi is grabbed by a tentacle and repeatedly slammed against the wall, and he sees Kufa reappear with a rifle. As she begins firing at the cobonica, it manages to grab her with another tentacle, knocking the rifle from her hands. As Udi realizes that all three of them are trapped by the cobonica (as Marchion has disappeared underneath it), he closes his eyes and welcomes his death."}, {"tag": "h3", "text": "Chapter Eight – The Coruscant Dawn"}, {"tag": "p", "text": "Stellan Gios and Nib Assek spar onboard the Coruscant Dawn. Nib yields as Stellan manages to pin her lightsaber, and they both disengage. Stellan explains to their audience that they were demonstrating an ancient form of lightsaber combat, as today, lightsaber battles are purely ceremonial. Rhil Dairo shuts off her cam droid T-9, telling Stellan that they have all the footage they need. Stellan explains that lightsaber history is one of his passions, and Rhil comments that she thought passion was forbidden by the Jedi Code. Stellan explains that the Jedi try to control their strong passions, as they can blind them to the truth and the Force. However, Stellan believes that all Jedi should have interests, as it would be dangerous to be complacent. He further explains that a Jedi's passions must never be greater than their mission. Rhil states that she has enough footage for now, and Stellan suggests that they check in with the Chancellor. Rhil is excited, but Nib thinks that Rhil should stay behind, as the Chancellor may be in session with the Senate. Rhil assures her that she will stop recording audio if the Chancellor is discussing sensitive matters, and reminds her that GoNet has been given full access to the ship."}, {"tag": "p", "text": "Stellan agrees with Rhil, which upsets her, as she doesn't like other people fighting her battles for her. Rhil reflects on her journalism career, and is excited that she is onboard the Chancellor's flagship and talking to a member of the Jedi High Council. She likes Stellan (whom she considers to be extremely handsome), Nib (whom she wants to get to know better), and Burryaga (whom she believes to be the sweetest soul she's ever met). Burryaga stops to let her pass when they reach the Chancellor's office, and Nib reminds Burry that they are supposed to act as if Rhil isn't there. Rhil thanks Burryaga for his gesture, and tells him that the galaxy could use more people like him."}, {"tag": "p", "text": "As they enter the Chancellor's office, they find her in a conference with Senator Noor of Serenno, Senator Vaadu of Phindar, Samera Ra-oon (the Valon in charge of organizing the Republic Fair) and Jedi Master Avar Kriss. As Norel Quo, Chancellor Soh's aide, prepares to eject them from the office, Chancellor Soh tells him that they can stay. She assures the conference attendants that any footage taken will be vetted for security purposes before it is released, and invites them to continue to speak freely. As the Chancellor invites the Jedi to join them, Stellan exchanges nods with Larep Reza, Soh's deputy. Rhil reactivates T-9's mics, and the conference continues."}, {"tag": "p", "text": "Samera tells Chancellor Soh that they have been having a slight holoprojector issue with the United in Song exhibit, but Norel interrupts, stating that he doesn't believe the Chancellor should worry about the specifics. Chancellor Soh disagrees, and says that she wants to know everything. Senator Noor asks about the Innovator, and Stellan replies that it is almost ready for launch. When Senator Vaadu inquires about its security detail, Stellan reminds him that Indeera and Bell are traveling with it. However, Vaadu asks if any Longbeams or Skyhawks will be with it, and Chancellor Soh tries to assure him that they are not necessary. Vaadu reminds her that the Nihil are still attacking, but Stellan points out that the attacks are lessening. Stellan explains that they believe the Nihil forces to be merely remnants of the fleet they fought in the Kur Nebula, but Vaadu continues to ask about the recent attacks on Quantxi and Salissia. Samera assures him that the Nihil will not pose a threat to the Republic Fair, as they will be stationing Longbeams at all major jump points into the system. Avar Kriss adds that there will be a squadron of Jedi Vectors on Valo, and Noor asks Avar if she will be there herself."}, {"tag": "p", "text": "Stellan interrupts (seemingly annoying Avar), saying that they are reviewing the situation daily. Noor claims that the Nihil would be hesitant to attack if the Hero of Hetzal is on Valo, and Avar replies that she is planning to attend. However, she is currently focused on combatting the Drengir. Vaadu confronts Chancellor Soh, reminding her that she assured the Senate the Drengir were being dealt with. Chancellor Soh assures him that the Jedi are handling the Drengir, and Senator Noor mutters under his breath. Avar asks Noor to speak his mind, and he replies that he wants to know if the rumors that the Jedi have allied with the Hutt Cartel are true. Avar confirms that they are working with certain factions of the Hutt Council, which Noor thinks is unwise. Avar replies that they believe it to be prudent, as the Hutts have just as much to lose as the Republic if the Drengir are not defeated. She also believes that after the Drengir are defeated, they could possibly forge a new treaty with Nal Hutta. While Senator Noor is opposed to treating with criminals, Avar states that she believes the Hutts can be persuaded to put their resources to good use."}, {"tag": "p", "text": "Chancellor Soh brings the conversation back to the Republic Fair. When Senator Noor again voices his concerns, Chancellor Soh interrupts him, reminding him that Jedi Master Elzar Mann has been assigned to the Valo temple. As Avar and Stellan assure the conference members that Elzar is a highly-capable Jedi, Senator Vaadu expresses concerns that any incidents at the Fair will benefit Senator Tia Toon, who is trying to push his Defense Force Program (DFP). As Senator Noor reminds the conference that the Senate has continuously voted down Tia's proposal, Chancellor Soh interrupts him, reminding him that the program doesn't fit with her administration's values. Vaadu reminds her that Senator Toon will be at the Fair, along with representatives from the SoroSuub Corporation, but Chancellor Soh assures him that they will not allow Senator Toon to use the Fair for political gain."}, {"tag": "p", "text": "Soh gives an impromptu speech, stating that the Fair must go on to send a message to the Nihil that the Republic is not afraid. She assures the conference that the Republic is united, unlike the Nihil. She states that the Republic will never live in fear of something that might happen, as if they did, their enemies would win without firing a shot. She ends the conference, and tells Larep that she thinks it went well. Larep is upset that Senator Toon was mentioned, as the Sullustan is a thorn in all their sides. Chancellor Soh reminds Larep that Senator Toon doesn't have much support, and that the Republic Fair will give them an opportunity to forge new relationships with the Duinuogwuin and Togrutas. Chancellor Soh states that they do not need the DFP, and that Senators Noor and Toon know it. Rhil decides to inquire more about Senator Toon and the DFP, but decides that now is not the time. Suddenly, Norel grows concerned. He tells Chancellor Soh they have received word that there has been an attack on Cyclor. As Stellan tries to contact Indeera and Bell on his comlink, he receives no response."}, {"tag": "h3", "text": "Chapter Nine – The Cyclor Shipyards"}, {"tag": "p", "text": "Onboard the Nihil Cloudship, the Fluggrian tells Sarn Starbreaker that the Jedi Vectors are approaching. Sarn is eager to face the Jedi, as he seeks revenge on them for foiling his raid on the Kiapene trading post on Mandrine. He asks the Fluggrian how many scav droids they have, and she reports that they have a full complement. Pleased, Sarn orders them to launch all five dozen."}, {"tag": "p", "text": "While flying his Vector, Bell Zettifar remembers heading to the training gallery on the Elphrona Outpost with Loden. Loden had told him they would be practicing with training remotes, which Bell found disappointing. When they reached the gallery, Bell was surprised to find over one hundred training remotes ready to go. Loden pulled out a blindfold, telling Bell that Jedi should never rely on their senses alone. Returning to the battle, Bell struggles to control his desire to get revenge on the Nihil, and comforts himself by reciting part of the Jedi Code."}, {"tag": "p", "text": "Suddenly, scav droids are launched from the Cloudship. Bell closes his eyes, telling Ember (who is onboard the Vector with him) that the Force will show them the way. He is able to sense gaps in their formation, and maneuvers through them. He recalls his fight with the training remotes in the gallery, and how he had destroyed all of the drones before they could fire. He had surprised both himself and Loden that day, just as he plans to surprise the Nihil. He begins corkscrewing the ship, preventing the scav droids from latching on to him. As he clears the swarm, a harpoon punches through Bell's Vector and lodges itself in his gut."}, {"tag": "h3", "text": "Chapter Ten – The Shrine beneath Golamaran"}, {"tag": "p", "text": "The tentacle holding Dis to the wall releases him, and he realizes that the rest of the tentacles are down. He goes over to Kufa, who is still stabbing the cobonica with a stalagmite. As he calls her name, she moves the stalagmite to stab him, barely missing. He yells at her, causing her to come to her senses. Realizing that the cobonica has been defeated, Kufa wonders where Marchion is. As the cobonica begins to jerk around, both Udi and Kufa prepare for another fight. However, Marchion appears from inside the cobonica, having used his lightsaber to cut himself out. While both Udi and Kufa are impressed, Marchion calls himself a fool, saying that he should have never allowed them to get ambushed. He pulls off his mask to clean it, and Kufa mentions his facial tattoo. Marchion dismisses her and asks about the cobonica, and Kufa assures him that they are highly territorial, meaning they are not likely to encounter another one. Marchion asks about Udi's injured wrist, but he demonstrates that the bones are already healing. However, one of his wingblades was damaged in the attack, and it is too unbalanced for him to effectively use. Kufa is grateful that they still have her blaster, but Udi doesn't understand why they need weapons if they're going to a shrine. Marchion ignores him and continues on."}, {"tag": "p", "text": "As they approach their destination, Udi stumbles into a wall, suddenly feeling like he's been punched. Marchion hurries over to him, asking if he can continue. Udi assures him that he can, and begins to walk towards a large frozen lake. They follow Kufa across the lake, squeezing underneath a large rock. As he stands up, Udi feels increasingly lightheaded, and wonders what is causing it. Marchion announces that they have arrived at the Shrine, and Kufa activates a nearby control panel. Udi begins to see visions of his home on Talor, including his father ordering his exile. He becomes confused, as his vision rapidly alternates between his reality in the Shrine and his past on Talor. Marchion asks what is wrong, and Kufa explains that he is being cleansed by the power of the Leveler. Marchion asks Udi if he wants to see what they came for, but Udi can't respond. Marchion drags him across the chamber as he continues to receive visions, including possible futures. His visions are happening so frequently, he is no longer able to distinguish them from reality."}, {"tag": "p", "text": "Udi states that he can't go on, but Kufa implores him to keep going. They enter a small chamber and find four droids inside. Instead of hands, the droids have long, curved blades, and Marchion encourages Udi to look closer. He sees what appears to be a shadow in the wall in front of the droids, and slips on a patch of black ice. This activates the droids, who announce in unison that the visitors have defiled the Shrine. Marchion tells the droids that they have come to pay their respects, but the droids reply that they are not welcome. Marchion ignites his lightsaber, and Udi states that he thought they had come to worship. Marchion explains that the Leveler isn't a god, and Kufa adds that it is \"balance\"."}, {"tag": "p", "text": "The droids move in to attack, and Marchion and Kufa quickly destroy one. Udi, despite not having his wingblades, also manages to destroy one. Suddenly, pain erupts from Udi's chest, and he realizes that he has been stuck by one of the droids. Marchion and Kufa destroy the last two droids, and Marchion asks Udi if he is still with them. Marchion pulls the blade out of Udi's chest, and Udi realizes that it won't be able to heal. Marchion asks Udi what happened to him, but Udi is unable to respond. Marchion walks over to Kufa, who is kneeling in front of the shadow. He remarks that the legends are true, and they both state that balance will come. Marchion kills Kufa and pulls out a comlink. He tells the person listening that he has found it, and orders them to follow his beacon. Marchion walks back towards Udi, thanking him for his service. Marchion explains that with his special gifts, Udi was the proof he needed. He then brings his foot down on Udi's head, killing him."}, {"tag": "h3", "text": "Chapter Eleven – The Cyclor Shipyards"}, {"tag": "p", "text": "Bell wonders why he is not dead and looks around his Vector. His head is filled with noise from the battle, including Indeera's voice and Ember's barking. He focuses on the harpoon, noticing thick barbs holding it in place. The harpoon hasn't completely sealed the breach in his hull, and Bell notices cracks in the hull exposing him to the vacuum of space. He continues to drift towards the Cloudship, knowing that the impact will detonate the Vector's power core. However, Bell knows it won't take out the Cloudship, so he uses the Force to activate his retrothrusters, bringing him to a stop. Bell considers piloting the Vector using the Force (as he is in too much pain to operate the controls), but knows he is too exhausted to do it."}, {"tag": "p", "text": "The Vector suddenly starts moving again, startling Bell, and Indeera tells him that the Cloudship is reeling him in. Bell hears a fragment of a conversation onboard the Cloudship, but believes himself to be imagining things. He sees metal shrapnel sealing the hole in his Vector, Indeera having used the Force to nudge them into position. Bell asks Indeera for help, but she replies that she is busy dealing with scav droids. She asks Bell if he can shoot the cable reeling him into the Cloudship, and he says that he'll try. As he moves to reach the controls, he slumps in his seat with pain. Ember barks, bringing him back into focus, and Bell tells her to keep barking. He manages to shoot the harpoon cable, but it doesn't snap, as it is made of a blaster-resistant metal."}, {"tag": "p", "text": "Bell reaches out to Indeera, believing that if they both fire at the cable, they'll be able to break it. He receives no response, and uses the Force to find her. He senses her aboard her Vector, which is covered in scav droids. Believing the fight to be lost, Bell blames himself. Suddenly, he has an idea, and grabs hold of the harpoon cable. He uses the Force to sense the layout of the Cloudship, eventually locating its power core. He fires at the power core, detonating it and destroying the Cloudship. As debris spins his ship around, Bell notices the harpoon cable floating in front of him, having been severed in the blast. He uses the Force to launch it towards Indeera's Vector, wiping the scav droids off her hull. As Ember continues to bark, Bell falls silent."}, {"tag": "h3", "text": "Chapter Twelve – The Coruscant Dawn"}, {"tag": "p", "text": "Onboard the Coruscant Dawn, Chancellor Soh asks if there is any word from Cyclor. Nib replies that they have received no word from Indeera or Bell, and Burryaga informs them that they have some footage from the shipyard. They send it to a projector droid, which shows them the footage from the hangar. Scav droids are streaming through a breach in the hangar and attacking the Innovator, but most are being destroyed by the Cyclorrians. Norel asks where the Jedi are, and Stellan asks if they can get footage from outside the hangar. Nib replies that they can't, as their signal is being jammed. Stellan asks where the nearest Temple Outpost is, and Burryaga replies that it is on Derra. Stellan contacts Master Tera Sinube, the marshal of the Derra outpost, on his comlink, and informs him of the attack on the shipyard. Tera replies that he is already aware of the attack, and has sent a group of Vectors led by Porter Engle. Stellan tells Tera that their communications seem to be down, and he replies that he will look into it."}, {"tag": "p", "text": "Shutting off his comm, Stellan turns to see Chancellor Soh talking to a number of officials, including Jedi Grand Master Pra-Tre Veter. Pra-Tre asks Stellan for an update, and he informs him that Master Sinube has sent Vectors to assist. Senator Tia Toon tells Pra-Tre that he is more concerned about the shipyard, as Sullust has invested heavily it. Senator Toon expresses frustration that the shipyard is only being defended by two Jedi, and Chancellor Soh reminds him that reinforcements are on the way. Tia points out that they are Jedi reinforcements, and he states that it is foolish to place their lives solely in the Jedi's hands. As he begins outlining his DFP proposal, Chancellor Soh interrupts him, stating that now isn't the time to discuss it. Senator Toon states that now that the Nihil have attacked a Mid Rim world, there is no telling where they will strike next. Chancellor Soh assures him that the crisis will pass just like it did on Hetzal, but this upsets him."}, {"tag": "p", "text": "Senator Toon expresses frustration, as he believes the Great Disaster should have been a wake-up call. Instead of using credits to build up a defense against the Nihil, Chancellor Soh spent them on the Republic Fair, which Tia declares to be folly. Chancellor Soh says that the Republic Fair will be a sign of solidarity and strength, but Tia declares it nothing more than a dangerous vanity project. Larep chastises Senator Toon for using the attack on the Innovator for his own political gain, but Tia replies that he thinks only of the people of the Republic. Nodding towards Rhil, Senator Toon states that he doubts their argument will make it into the recordings, as it doesn't fit the Chancellor's narrative. However, he states that he would happily talk to Rhil on the record."}, {"tag": "p", "text": "Nib cuts into the argument, telling them that they have received word from Cyclor. Porter Engle reports that they have restored communications, having destroyed the scrambler droids the Nihil dispatched. Grand Master Veter asks about the battle, and Porter replies that the Cyclorrians fought valiantly, having destroyed most of the scav droids and Nihil ships. Stellan asks about the Cloudship, and Porter reports that there is no sign of it. Chancellor Soh asks about Indeera and Bell, and Porter seems surprised to hear that Bell was present. Suddenly, he replies that he has found Bell, and it doesn't look good."}, {"tag": "h3", "text": "Chapter Thirteen – Beyond"}, {"tag": "p", "text": "Bell has no idea where he is, but he knows he doesn't want to die. He asks if that is selfish, but he receives no reply. He hears Ember's barking, and is pleased that she is giving him an anchor. Bell feels the Force ready to take him, and recalls listening to Yoda on the Elphrona Outpost, who told him that the Force would transform him. He doesn't want to go, as he feels he has so much more to offer the Jedi. His awareness shifts back to his Vector, where he hears battle sounds and Ember's barking. He continues to recall moments from his past, including finding his kyber crystal, being chosen as Loden's Padawan, falling from a cliff, and standing on Starlight Beacon listening to Avar Kriss' speech. As the Force continues to surround him, Bell hesitates to reach out, afraid that he might not like what he sees."}, {"tag": "p", "text": "He hears Indeera's voice (although he doesn't recognize it), and his Vector begins to travel towards the Innovator. He is pulled out of his ship by Cyclorrians, Indeera (whom he finally recognizes) and Porter Engle, and they rush him to a bacta tank. As he is submerged in the liquid, Bell reflects on how his near-death experience has changed him."}, {"tag": "h3", "text": "Chapter Fourteen – Lonisa City, Valo"}, {"tag": "p", "text": "Samera Ra-oon walks into the operations room and tells Elzar Mann there has been an incident, but stops once she realizes he is in a meeting with Stellan Gios. Assuring her that it's fine, Elzar continues talking with Stellan. Elzar asks about the Innovator, and Stellan replies that is it safe, as the Cyclorrians successfully fought off the Nihil with help from Engle's drift. Stellan informs him that Bell is also safe, and that he is being patched up on the Innovator. Stellan also informs Elzar that the Innovator is set to launch on schedule, as Vam Targes is only conducting minor hull repairs."}, {"tag": "p", "text": "As Elzar shares a smile with Samera, Stellan asks if someone else is present. Samera steps into the meeting, informing Stellan that they have stepped up security measures at the fair in response to the Nihil attack. Stellan replies that the Senate and Jedi Council have grown cautious, with Grand Master Veter assigning more Jedi, including Porter Engle, to Valo. Samera asks for more info on Porter, and Stellan tells her that he is one of the most respected Jedi in the Order. Pleased, Samera suggests assigning him as a special liaison for Regasa Yovet, the Togruta queen. The Nihil attack has spooked the Togruta ambassador, and he has threatened to advise the queen against coming to the fair. Stellan replies that Porter might not be the best choice, as he isn't the best diplomat. Elzar suggests selecting Avar as the Togruta liaison, and Stellan promises to discuss the matter with the chancellor."}, {"tag": "p", "text": "They conclude their meeting, and Samera states that Stellan seems haughty. Elzar explains that Stellan just sees things in black-and-white, and Samera replies that she thought all Jedi were like that. They hold eye contact, and Samera teases Elzar by saying that Stellan is easy on the eyes. Elzar asks her what the situation was when she interrupted his meeting, and she explains that Ambassador Tiss has asked for a three-fold security sweep of the regasa's suite. She explains that the presence of the Jedi is the only reason that Queen Yovet is visiting the fair, and tells Elzar not to let it get to his head."}, {"tag": "p", "text": "Elzar walks with Samera down Administration Plaza in Lonisa City, and he marvels at its beauty. As he walks, he reflects on how much he appreciates Samera. His interactions with her have allowed him to feel better since his vision on Starlight Beacon, and he is grateful that he followed the guidance of the Force on Ashla. When he first arrived on Valo, Elzar had looked around for danger, but thoughts of his vision diminished slightly every day. He has come to feel relaxed on Valo, and wonders how much of that is due to Samera. He looks over at her, admiring her hair and neckline. She catches him looking and he quickly looks up at the sky-islands floating above them, each representing a major planet of the Republic."}, {"tag": "p", "text": "Samera suddenly asks him if he has visited Onderon, and she clarifies that she was talking about the island. Elzar replies that while he hasn't visited Onderon, he has visited the Rhinnal island. He explains that he wanted to see the environmental controls to learn how they maintain the snow in the heat. Samera tells him that he needs to try the turbo-ski run, offering to take him after the opening ceremony. They hold eye contact again, and Elzar asks what they can do on the Onderon island. Samera explains that they can take a jungle safari, and Elzar hopes that there is no dangerous wildlife. Laughing, Samera assures him that only birds and Izizian monkeys can be found there, but they can find a hragscythe in the city zoo. Elzar suggests that they visit it after their ski trip, and Samera states that they could."}, {"tag": "p", "text": "Samera expresses surprise at the fact that they were able to pull off the islands, and Elzar tells her not to let her success get to her head. Elzar leans in close, and they lock eyes again. Suddenly, Elzar receives another vision, this time of himself as the marshal of a successful outpost, having dinner with Samera. Someone shouts for them to look out, and Elzar manages to pull Samera back from a hoverpod that almost ran them over. Upset at himself, Elzar reminds himself that he needs to focus on the job at hand. Realizing how close he is to Samera, Elzar takes a step back. As they enter the Hotel Republica, Samera steps ahead of him, and Elzar chastises himself. As they step into a turbolift, Samera states that the ambassador is waiting for them. Elzar is pleased that her tone has become more professional, as she is a coordinator and he is a Jedi."}, {"tag": "h3", "text": "Chapter Fifteen – Grizal"}, {"tag": "p", "text": "At the Nihil base on Grizal, Lourna Dee recalls Marchion Ro's instructions after the Battle of Kur: stay quiet. While Marchion had anticipated that the Jedi would not be ready for combat, they proved to be more than a match for the Nihil, giving hope to the people of the galaxy. In their down time, the Nihil had searched for a base that could serve as both a sanctuary and a fortress, and Zeetar (the new Tempest Runner after Kassav's death) had located the prison complex on Grizal."}, {"tag": "p", "text": "Pan Eyta enters Lourna and Zeetar's quarters, and is surprised to see that Zeetar has constructed a powersuit. The powersuit, complete with flame rifles and grenade launchers, allows Zeetar to tower over everyone on Grizal. Pan calls Zeetar a runt, and Zeetar mocks Pan for feeling threatened by him. They begin fighting, and Lourna breaks it up by yelling at them. Lourna chastises them, as they are supposed to be leading the Storm, not fighting like new recruits. While Zeetar apologizes, Pan seems unapologetic, and almost resumes the fight before Lourna blocks him."}, {"tag": "p", "text": "Relenting, Pan asks the other Tempest Runners why he was called back to Grizal, and Zeetar explains it's because he messed up. Lourna explains that they are referring to the attack on Cyclor, which left an entire Cloud dead and placed the Republic on high alert. As Lourna and Zeetar insult Sarn Starbreaker, Pan insists that the raid's failure was not his fault, as there were Jedi at the shipyards. Zeetar chastises Pan, as Marchion had told them to lay low. Pan counters by saying that they shouldn't listen to Marchion anymore, as the Nihil have grown beyond his influence."}, {"tag": "p", "text": "Marchion enters the room and greets Pan, having heard his tirade. Marchion hands Pan his helmet and compliments Zeetar's powersuit. Lourna asks if his mission was successful, and Marchion replies that it was. Lourna asks if Udi Dis served him well, but Marchion ignores the question, instead asking how the work on the Path-jumpers is going. Zeetar replies that it has gone well, and Marchion promises him that he will have a field test soon. Lourna informs Marchion that the other cells have been lying low, and Marchion asks Pan if he has followed his instructions. Pan tells Marchion that they need to talk, but before he can continue, Marchion activates a device which causes energy to surge through his helmet. Pan, who is holding the helmet, begins convulsing as the energy travels through him. As Pan begs him to stop, Marchion refuses, scolding Pan for refusing to see beyond his own greed. Marchion tells Pan that he regrets sparing him, as Kassav would have followed orders."}, {"tag": "p", "text": "As Marchion leaves the room, Lourna wonders if she should help Pan. She decides that he doesn't deserve to die, and crouches down in order to determine how to help him. Lourna asks Zeetar to grab the helmet with his powersuit, but he refuses, as it seems like Marchion wants Pan dead. Suddenly, Pan crushes the helmet with his bare hands, shutting off the energy flow. As Pan gets to his feet, Zeetar asks what Marchion meant when he said Kassav was sacrificed. Lourna explains that Kassav's death was a tactical choice, and Zeetar realizes that Marchion made the decision. Pan explains that while the Tempests do the work, Marchion reaps the rewards. Pan wonders what Marchion actually does, and Lourna replies that he provides the Paths."}, {"tag": "p", "text": "Pan questions if Marchion actually provides the Paths, and pulls out a holoprojector from his jacket. Lourna activates it, and a holo of Udi Dis appears. Udi looks high in the holo, and Lourna remarks that she thought he had straightened out. Pan explains that Udi had gone clean, but he slipped him some reedug (which one of his Strikes stole from the Reekriders) to loosen him up. In the holo, Udi tells Pan that he should be jealous of him, as Marchion had brought him onboard the Gaze Electric. Udi tells Pan that he knows Marchion's secrets because he trusts him, but Pan replies that it is more likely Marchion pities him. Udi counters by saying that he knows where the Paths come from, as he has seen her. Udi explains that the woman is older than him, and that the Paths come from her head. Pan shuts off the holo, and Lourna asks if they can trust Udi, as he was high on reedug. Pan states that Udi had no reason to lie, and begins to head towards the door. Lourna asks him where he's going, and Pan replies that he is going to take what is theirs. Pan proposes splitting their spoils three ways instead of four, and asks Lourna what she thinks."}, {"tag": "h3", "text": "Chapter Sixteen – Lonisa City Zoo, Valo"}, {"tag": "p", "text": "Elzar Mann stares at the hragscythe in the Lonisa City Zoo, recalling how he mind-tricked a Bonbrak to gain entry into the zoo before its opening. He uses the Force to search for threats, finding none (with the exception of the zoo's animal inhabitants). His comlink chirps, and Samera greets him by his title. Realizing he is late, Elzar tells Samera that he is on his way."}, {"tag": "p", "text": "Elzar arrives at the landing bay just as Chancellor Soh's shuttle arrives. He hurries to join Samera and the rest of the welcoming committee, which includes Valo Security Force Captain Idrax Snat, Lonisa City Mayor Nas Lariin, and the Mayor's son Jom. Chancellor Soh exits her shuttle, and introduces her son Kitrep. After greeting everyone, Chancellor Soh begins to head towards the waiting aircars, and Elzar falls in beside Stellan. Elzar teases him about his stole, which identifies Stellan as a new member of the High Council. In turn, Stellan asks Elzar where his gold-and-whites are, and Elzar replies that they are in the Temple where they belong. Stellan tells Elzar that he is worried about him, but Elzar tells him not to worry, as being on Valo has relaxed him. Stellan inquires about the preparations for the fair, and Elzar replies that they have been straightforward, which he credits to Samera. Elzar compliments Samera by saying that she doesn't appear to be fazed by anything, and Stellan comments that it sounds like Elzar wants to recruit her. Elzar clarifies that he doesn't think Samera is Force-sensitive, just talented."}, {"tag": "p", "text": "Elzar's comment reminds Stellan of Rana Kant, his old Master. Elzar notices Rana's lightsaber on Stellan's belt, and asks if it should be in the repository. Stellan replies that it will be, once he learns all his Master has to teach him. Elzar asks if Stellan felt his Master's death, and he replies that he knew long before the call came. Elzar apologizes for not being present for Stellan's elevation to the High Council, and Stellan forgives him, as Avar was there to pass on Elzar's congratulations. Stellan remembers finding Rana's lightsaber in his quarters, a reminder from her that even though Jedi come and go, the Order remains."}, {"tag": "p", "text": "As they reach the transports, Elzar realizes that Stellan is looking at Samera. Worried that he has not done a good enough job hiding his feelings for her, Elzar asks Stellan what Rana said about talent, hoping to distract him. Stellan tells him that Rana said the talents of others remind them of their place in the universe, and invites Elzar to step into their aircar. Before hopping in, Elzar notices a Jedi shuttle landing nearby. Recognizing it as coming from Starlight, Elzar runs off, hoping to great Avar Kriss. When he arrives at the landing pad, Elzar is surprised to see OrbaLin, Starlight Beacon's archivist, exiting the shuttle instead. OrbaLin asks if Elzar is there to help unload the artifacts for the Starlight Pavilion, and Elzar begrudgingly agrees. He asks where Avar is, and OrbaLin explains that she won't be coming to the fair, as she is busy dealing with the Drengir. Disappointed, Elzar begins helping OrbaLin with the artifacts, jealous that Avar is leading Jedi into battle while he will be gawped at by tourists."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Valo Republic Fair is said to be the first Republic Fair in a generation. However, in The High Republic: A Test of Courage, set a year before, twelve-year-old Avon Starros was said to have gone on rides at a Republic Fair when she was younger."}, {"tag": "p", "text": "Kotabi bond-twins Terec and Ceret are said to be from Sagamore, when the StarWars.com that first named them said they were from Kotab."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}