{"url": "The_High_Republic:_Out_of_the_Shadows_(audiobook)", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Star Wars: The High Republic audiobooks"], "nodes": [{"tag": "h1", "text": "The High Republic: Out of the Shadows (audiobook)"}, {"tag": "p", "text": "The High Republic: Out of the Shadows is the unabridged audio version of the canon young adult novel of the same name, written by Justina Ireland. It is narrated by Keylor Leigh and was released by Disney–Lucasfilm Press on July 27, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Another exciting adventure from the number one New York Times best-selling series!"}, {"tag": "p", "text": "The darkest secrets are the hardest to bring to light..."}, {"tag": "p", "text": "Sylvestri Yarrow is on a streak of bad luck with no end of sight. She's been doing her best to keep the family cargo business going after her mom's death, but between mounting debt and increasing attacks by the Nihil on unsuspecting ships, Syl is in danger of losing all she has left of her mother. She heads to the galactic capital of Coruscant for help, but gets sidetracked when she's drawn into a squabble between two of the Republic's most powerful families over a patch of space on the frontier. Tangled up in familial politics is the last place Syl wants to be, but the promise of a big payoff is enough to keep her interested…"}, {"tag": "p", "text": "Meanwhile, Jedi Knight Vernestra Rwoh has been summoned to Coruscant, but with no idea of why or by whom. She and her Padawan Imri Cantaros arrive at the capital along with Jedi Master Cohmac Vitus and his Padawan, Reath Silas—and are asked to assist with the property dispute on the frontier. But why? What is so important about an empty patch of space? The answer will lead Vernestra to a new understanding of her abilities, and take Syl back to the past...and to truths that will finally come out of the shadows."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}