{"url": "41st_Ranger_Platoon", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Grand Army of the Republic platoons"], "nodes": [{"tag": "h1", "text": "41st Ranger Platoon"}, {"tag": "p", "text": "The 41st Ranger Platoon was a clone trooper infantry platoon and strike team within the 41st Elite Corps that served the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The platoon participated in sabotage missions Separatist supply lines and installations, and later fought in the Battle of Kashyyyk in support of other 41st Elite Corps units. The platoon participated in the hunt for Jedi Grand Master Yoda after the implementation of Order 66 and the start of the Great Jedi Purge."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview and composition"}, {"tag": "p", "text": "The 41st Ranger Platoon was a clone trooper infantry platoon and strike team within the Grand Army of the Republic's 41st Elite Corps that served the Galactic Republic. As a platoon, the unit normally consisted of four squads for a total of thirty-six clone troopers. The unit was composed of a variety of clone soldiers, including standard clone troopers, clone specialists clone trooper officers, heavy weapons clone troopers, and Advanced Recon Force Scout Troopers. The platoon deployed All Terrain Reconnaissance Transports during its operations, and included an ARF trooper officer that led a patrol of reconnaissance walkers."}, {"tag": "h3", "text": "Equipment"}, {"tag": "h4", "text": "Phase I"}, {"tag": "p", "text": "The platoon was initially equipped with Phase I clone trooper armor that was painted with forest camouflage and dark green color combinations, and further customized with a green polarized lense. Clone sharpshooters in Phase I clone trooper armor were further equipped with an attached helmet macrobinoculars, and could be supplemented with a black left-shoulder pauldron. The unit's heavy weapons clone troopers were also additionally outfitted with a helmet-mounted visor, although they could also be stocked with a small, black right-shoulder pauldron, a clothed bag slung across the torso, and additional armor attachments. Clone trooper officers were provided with a rangefinder attachment to their helmets."}, {"tag": "h4", "text": "Phase II"}, {"tag": "p", "text": "Later equipped with Phase II clone trooper armor, standard clone troopers could either wear a forest camouflaged armor set, or sport additional dark markings on their shoulder armor and two dashes on the right side of the chest armor. Clone specialists continued the use of the attached macrobinoculars on their helmets, and could also be stocked with a left-shoulder pauldron. Specialists without the pauldron were denoted by two reflected diagonal dashes of dark green across their chest, along with dark green shoulder armor. Heavy weapons clone troopers were equipped with a clothed bag slung across their chest and torso, a small right-shoulder pauldron, and additional armor attachments, though they could alternatively have additional dark green markings added to their forest camouflaged armor on the chest, arm, shoulder, and leg armor. Clone trooper officers of the unit with Phase II were provided with rangefinders, as well as a gray kama and additional dark green markings on their shoulder and chest armor."}, {"tag": "p", "text": "The 41st Ranger Platoon's Advanced Recon Force Scout Troopers were provisioned with a modified set of Phase II armor, with green helmet markings denoting their affiliation to the 41st Elite Corps and the divisional markings on their legs demonstrating their affiliation to the 41st Ranger Platoon. Their armor was further painted in muddy green that faded into a shade of brown camouflage at the limbs, which then turned into a dirty white at the lower legs and feet. Their ARF helmet was outfitted with reinforced side flaps and sported an advanced comlink device with a projecting antenna."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "The soldiers of the unit were armed with various handheld weapons. The standard clone troopers were equipped with DC-15A blaster carbines, the clone specialists with Valken-38x snipers, the officers with DC-17 hand blasters, and the heavy weapons clone troopers with DC-15A blaster rifles or DC-15LEs, The unit's ARF troopers made use of DC-15A blaster rifles, grenades, and other explosives and weaponry. The ARF troopers of the unit additionally utilized RPC-2 Rocket Launchers that were stored aboard their vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 41st Ranger Platoon was active during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. During the war, the 41st Ranger Platoon was often dispatched to sabotage enemy supply lines and vulnerable installations, allowing them to draw attention away from Republic interests. By the time of the Battle of Mon Cala, Phase II clone trooper armor was adopted by the Republic Military, including the 41st Ranger Platoon."}, {"tag": "p", "text": "The platoon continued to serve late in the war, and participated in the Battle of Kashyyyk alongside other forces of the wider 41st Elite Corps presence on Kashyyyk and the Wookiee Army. ARF troopers of the platoon fought alongside Red Company at the beachfront of Kachirho City, while supported by HAVw A6 Juggernauts, Infantry Support Platforms, and All Terrain Attack Pods."}, {"tag": "p", "text": "Following the implementation of Order 66 and the start of the Great Jedi Purge, a patrol of 41st Ranger Platoon's ARF troopers were tasked with searching the battlefield for any clone survivors and any wounded Wookiees that could be executed. Once the patrol reached a downed Wookiee Oevvaor Jet Catamaran on the beach, an ARF trooper officer informed his fellow troopers that the Wookiees were dead, and ordered two troopers to move to the east while he and another went in the opposite direction. The 41st Ranger Platoon's ARF troopers helped hunt Jedi Grand Master Yoda after the implementation of Order 66, although they failed to stop him from escaping the planet in an E3-standard starship lifeboat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 41st Ranger Platoon was created for the video game Star Wars Battlefront II, which was originally released by Electronic Arts in 2017, but the platoon itself was only introduced into the video game as part of the \"Elite Corps Update\" on August 29, 2018. In this update, however, the 41st Ranger Platoon clone trooper skins for players were released as being the standard 41st Elite Corps appearance."}, {"tag": "p", "text": "Later, in a customization overhaul of the clone trooper appearances, a different appearance was created for the 41st Elite Corps, and the original appearance was spun-off as the newly-created 41st Ranger Platoon in an update on February 27, 2019. Shortly prior to the update's release, the 41st Ranger Platoon was originally going to be named the 87th Rangers, but the name was changed. With that same update, the coloring scheme of of the 41st Ranger Platoon's armor was slightly modified, adding dark green shoulder armor as well as differing dark green patterns to their camouflage and the modification of equipment."}, {"tag": "p", "text": "The 2020 reference book by Pablo Hidalgo and Jason Fry, Star Wars Complete Vehicles, New Edition retconned the 41st Ranger Platoon as being the AT-RT drivers that appeared in the 2005 prequel trilogy film, Star Wars: Episode III Revenge of the Sith by the divisional markings on the drivers seen in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}