{"url": "The_Hovel_on_Terk_Street", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 6"], "nodes": [{"tag": "h1", "text": "The Hovel on Terk Street"}, {"tag": "p", "text": "The Hovel on Terk Street is a 12-page comic that appeared in Star Wars Tales 6. It was written by Tom Fassbender and Jim Pascoe with art by Eric Powell, Drew Geraci, Keith Barnett, and Dave Stewart. The story takes place in 1 BBY. It was canonized in Unusual Suspects, an article in Star Wars Gamer 6."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Greedo is drinking alone in a cantina one night, musing over his lack of good luck, when he is approached by a woman named Nima Maas, an employee of the politician and Rebel sympathizer Temo Dionisio. With enough credits, she hires Greedo to track Temo down for her. Greedo sets to work, questioning cantina regular Kabe, who leads him to Wuher. Wuher tells Greedo that Temo was last seen with another local, Nok Derrick. Greedo finds Derrick at a nearby gambling den, but Derrick manages to get the jump on the Rodian, knocking him out and robbing him of his credits and blaster. Greedo is forced to buy a shoddy (and defective) blaster from a group of Jawas. He tracks Derrick to the titular hovel, where he's ambushed by a Gamorrean. In a brief scuffle, he kills the Gamorrean, snapping its neck. He then enters the hovel to find Derrick torturing Temo for information on the Alliance. Greedo intervenes, knocking Derrick out with a thermal detonator to the face before he frees Temo and flees the building as the detonator goes off. Outside, Nima is waiting, revealing that she is truly an Imperial agent, ordered to track down and execute Temo. Though Greedo is not happy about being used by the Empire, he decides to walk away to leave Temo to his fate, but Nima decides that Greedo knows too much and plans to execute him as well. Greedo, however, has one more trick literally up his sleeve. Out pops a small blade which he promptly throws into Nima's throat. At the end, Greedo leaves Temo to search for the Jawas that sold him his defective blaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "See also"}, {"tag": "p", "text": ""}]}