{"url": "The_Inquisitor%27s_TIE_Advanced", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Captured starships", "Category:Imperial starfighters", "Category:TIE Advanced v1"], "nodes": [{"tag": "h1", "text": "The Inquisitor's TIE Advanced"}, {"tag": "p", "text": "The Inquisitor's TIE Advanced was the personal TIE Advanced v1 prototype TIE fighter entrusted to the Grand Inquisitor in his mission to hunt down Jedi for the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This TIE Advanced was equipped with a cockpit access hatch, targeting sensors and solar collectors. Its special folding wings allowed it greater speed than the 1,200 kph of a standard TIE fighter. It boasted an armament of two laser cannons and could carry up to 20 missile shells. Unlike the production version of the v1, the Inquisitor's personal ship also had life support in the cockpit, allowing it to be flown without a flight suit if desired. Unlike most other TIE models, the v1 was outfitted with a hyperdrive and basic shields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "On the Empire Day celebration on Lothal five years before the Battle of Yavin, the Inquisitor used it to pursue rogue Jedi Padawan Kanan Jarrus and the Spectres after a \"terrorist attack\" in Capital City. Later, following the Inquisitor's death aboard the Sovereign, Jarrus and Ezra Bridger stole it to escape the exploding Star Destroyer and rejoin with their own transport."}, {"tag": "p", "text": "According to General Antoc Merrick, following the action at Mustafar, Capin Harinar and his crew had a merry time taking the ship apart."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2014, Hasbro made a toy of the Inquisitor's TIE advanced prototype as part of their Saga legends/Rebels line. There are 2 variants, one with green missiles and one with red."}, {"tag": "p", "text": "Star Wars Rebels: Head to Head gives the length of a TIE Advanced v1 as 3.57 meters, but Star Wars Rebels: Beware the Inquisitor! states that the Inquisitor's TIE measures 9.2 meters in length. This article assumes the former source correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}