{"url": "The_Imperial_March_(Martial_music)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Patriotic and military songs"], "nodes": [{"tag": "h1", "text": "The Imperial March  (Martial music)"}, {"tag": "p", "text": "\"The Imperial March,\" also referred to as the Martial Theme of the Empire, was played across Galactic Empire territory during its reign. It was most notably known as the martial theme of the Imperial Navy, where the piece was often played during graduation ceremonies. A jizz variation also existed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The melody of the Imperial March was known to former Jedi Padawan Ashara Zavros by around 3640 BBY. The young Anakin Skywalker also briefly hummed the melody when he had completed a podrace. The March's melody also appeared throughout the Clone Wars both as elevator music and a tune hummed by a rocket battle droid when he and his party were intercepting Jedi Master Plo Koon's escape pod. Later, the melody entered the use of the Galactic Empire as \"The Imperial March,\" where, as its nickname implied, acted as the martial theme for their Imperial Navy. As such, members of the Stormtrooper Corps and other Imperial personnel frequently hummed the musical piece during their battlefield operations. Because of its stance as the martial theme of the Imperial Navy, it played during various graduation ceremonies for the organization, including that of Imperial Navy cadet Han Solo in 10 BBY, as well as in recruitment and propaganda films, such as one Luke Skywalker watched during the events of the First Battle of Tatooine. In the aftermath of the Battle of Yavin, several musicians occasionally played the piece, as well as at least one statuette playing the piece whenever someone approached 12 meters of distance from it. In 11 ABY, the Imperial researcher Leonis Murthé hummed this piece when attempting to cut up via lightsaber one of his \"patients,\" a member of the Gulmarid species that were tortured by him."}, {"tag": "h2", "text": "Excerpt"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Piano version"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Known as \"The Imperial March\" out-of-universe, the musical theme was used in both the films (barring A New Hope) and the Expanded Universe of the Star Wars saga. Although it was normally an out-of-universe piece (see main article), there have been instances in the Expanded Universe where it was used as an in-universe music piece, most notably in A. C. Crispin's book The Paradise Snare. Although it was never given an in-universe name in this instance, Han Solo and the narration did refer to it as the martial theme of the Empire during the graduation ceremony."}, {"tag": "p", "text": "In Star Wars: Galaxies, the Imperial March is playable via jukeboxes, although it is unknown whether it was a true in-universe piece due to it also playing out-of-universe pieces such as the Star Wars Main Theme. Similarly, it was also referred to in-universe as the Imperial March by musician classes and in the description of the Darth Vader statuette in Star Wars Galaxies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}