{"url": "The_Journal_of_Master_Gnost-Dural", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:In-universe source material", "Category:Journals and memoirs"], "nodes": [{"tag": "h1", "text": "The Journal of Master Gnost-Dural"}, {"tag": "p", "text": "The Journal of Master Gnost-Dural was a book composed by Grand Master Satele Shan who pieced together key entries from the journal that Master Gnost-Dural, a Jedi Master famous in the Old Republic, kept. This book details Master Dural's experiences as a Jedi and maps his rise to Jedi Master and keeper of the Jedi Archives. It also provides insight into major events in the conflict between Jedi and Sith including; The Force Wars on Tython, the return of the Sith Empire, The Battle of Bothawui, The Battle of Alderaan, The Blockade of the Hydian Way, and The Sacking of Coruscant."}, {"tag": "h2", "text": "Chapter One, \"On the History of the Jedi Order\""}, {"tag": "p", "text": "The content of this journals first chapter contains entries set in the time frame where Gnost-Dural was a Padawan. Throughout this chapter, Dural voices his interest in the ancient Jedi Order on Tython. He reveals what he uncovers in the archives about the discovery of the Force on Tython and the conflict between the Tythonians, who intend to use the Force good and who has evil intentions. He also describes his disappointed after he gleens of the destruction on Tython and expresses his hopes that one day the Jedi will locate the ancient planet, so he can study the writings of the Order's ancient predecessors. In a comment later written into the journal, Satele Shan tells of how Gnost-Dural later helped tremendously in the locating of Tython. Towards the end of the chapter, Dural tells how the focus of his studies shifted to the system of governance within the Republic."}, {"tag": "h2", "text": "Chapter Two, \"The Return of the Sith Empire\""}, {"tag": "p", "text": "The second chapter of this journal tells of the return of the dreaded Sith Empire. The events take place after Dural has become a Jedi Knight. Dural first tells of a news-casted attack on a Republic ship (near the Tingel Arm region). He explains that at that point, no one knew who the attackers were or what they wanted, which left him very uneasy. In his next entry, he explained that these attackers were the Sith and that the attack he saw was not the only one. The Sith were attacking Republic vessels across the Galaxy. He related that these were the Sith, not Fallen Jedi proclaiming themselves to be Sith, but the remnants of the Sith species from Korriban. These Sith, he noted, were the descendants of survivors of the Great Hyperspace War. Not surprisingly, their very first strike, even before the attack near the Tingel Arm was on a Republic space station above Korriban. He tells that amazingly, a Padawan escaped this attack and returned to Coruscant to tell the Jedi Council of what transpired. Ironically, this young Padawan was Satele Shan, the Jedi who composed and commented in this journal. She tells in writing next to Dural's entry the story of her duel with Darth Malgus and how her Master, Kao Cen Darach, sacrificed himself so she could escape."}, {"tag": "h2", "text": "Chapters Three and Four, The Early Days of the Great War and The Battle of Bothawui"}, {"tag": "p", "text": "This group of entries is very disorganized and spread apart, just as the Republic military was at the time. Dural was called into combat and traveled to the Minos Cluster to defend the Republic. He also tells of the noble efforts of Belth Allusis in the Battle of Bothawui.Throughout these chapters, his entries are fairly vague and it is clear that some information is being withheld."}, {"tag": "h2", "text": "Chapters Five and Six, Studying the History of the Sith Empire, and The Mystery of the Sith Emperor"}, {"tag": "p", "text": "In these chapters, Dural tells of his mission to destroy the Dread Masters, a group of Sith who had mastered the art of Battle meditation to the point that they would inflict an awful, mysterious terror upon members of any given Republic cruiser. In order to avoid being compromised, they kept in constant motion in an Imperial dreadnaught that roamed the galaxy. With the help of an Elite Republic Special Forces Division team, Jedi Knight Jaric Kaedan infilitrated the dreadnaught and captured the Dread Masters. While they provided no information on the illusive Sith Emperor, the data aboard their vessel did. The data revealed that not even the Emperor's loyal subjects know who he is, only his Dark Council knows his true identity. The data also revealed that although Imperials did not and do not know who the Emperor is, they do know that he was a hero in the Great Hyperspace War and that he used the Dark side of the Force to increase his longevity. He has been commanding his armies from Dromund Kaas, the seat of the Empire. Jaric destroyed the vessel after he recovered the intel and falsely reported to the public that the Dread Masters were dead, trying to cover the Jedi Order's tracks. Dural wrote a report for the archives on the Sith Emperor based on the intel found in the Imperial dreadnaught. The Jedi Council not only read and approved his report, but they conferred upon him the title of Jedi Master."}, {"tag": "h2", "text": "Chapters 7-10, from the Battle of Alderaan to the Sacking of Coruscant"}, {"tag": "p", "text": "The last chapters of Dural's Journal detail The Battle of Alderaan, The Sacking of Coruscant, and the events after Treaty of Coruscant. Anyone familiar with The Sacking of Coruscant knows that in the attack, the Jedi Temple was totaled along with the Jedi Archives contained inside. This especially bothered Dural because of his special love for knowledge. Not suprisingly, he was selected to begin building the new Jedi Archives on the ancient planet of Tython."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The real-life version of this book is included in the Collector's Edition of Star Wars: The Old Republic. It tells of the events before the game and helps set the stage. It is written by Rob Chestney and was published by Chronicle Books in 2011. The book features artwork by Sperasoft Studios, Roman Artamonov, Fedor Losev, Lorenz Hideyoshi Ruwwe, Clint Young, and Arnie Jorgensen, as well as maps and diagrams by Michael Voigt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}