{"url": "The_Iteration", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Human clones", "Category:Males", "Category:Sith of the One Sith"], "nodes": [{"tag": "h1", "text": "The Iteration"}, {"tag": "p", "text": "The Iteration was a clone of the Human male Jedi Knight Jaden Korr. He was created at some point before 41 ABY by the resurgent One Sith order and was kept in suspended animation on the planet Korriban. The Sith intended to use the Iteration as part of a plot to allow them to infiltrate the New Jedi Order. In 41 ABY, on the orders of the Sith Lord Darth Wyyrlok, the Umbaran Sith agent Nyss Nenn awakened the Iteration, one of the many such \"blank slate\" clones available to the One Sith, and used an ancient Rakatan device called a mindspear to imbue some of Korr's memories into the clone."}, {"tag": "p", "text": "Nenn then placed the clone into stasis and departed Korriban with the clone, planning to track down the real Jaden Korr and to use another mindspear to transfer Korr's more recent memories into the Iteration. The clone could then take Korr's place within the Jedi Order and be activated by the Sith at a later date. Nenn and the Iteration tracked Korr to a Rakatan space station known as Mother, where both Korr and the Umbaran were killed, and the Iteration filled the mindspear with Korr's memories. However, the clone was defeated by Korr's apprentice, Marr Idi-Shael, who used the mindspear to transfer Korr's memories into the Iteration's mind before the latter was ready to accept them, resulting in Korr's consciousness overwriting that of the Iteration and taking control of the clone's body."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A tool of the Sith"}, {"tag": "p", "text": "At some point before 41 ABY, an Iteration was created by the One Sith organization residing on the Sith world of Korriban. Iterations were clones of Human individuals bred in cloning tanks, essentially blank slates filled with basic memories equivalent to that of an adolescent. That programming allowed the Iterations to operate until their basic memories were rewritten through the use of the Rakatan mindspear device, an ancient technology designed for memory transfer. The One Sith then used the Iterations to replace the person they \"iterated\" as the Sith cult's sleeper agents. In 41 ABY, one specific Iteration was chosen to replicate Jedi Knight Jaden Korr, whom the One Sith intended to replace in the New Jedi Order to do their bidding when they required it to do so. On the orders of the Chagrian Sith Lord Darth Wyyrlok, the Iteration's appearance was adjusted to match that of Korr. The Iteration was being kept in his cloning tank, which was filled with liquid and outfitted with machinery that provided life support and used electro-impulses to stimulate muscle development and growth. Soon, the Iteration was approached by the Umbaran Nyss Nenn, whom Wyyrlok had tasked to awaken the clone. With the assistance of the medical droid 1B-7, Nenn did as ordered, and the Iteration had his mind filled with the basic knowledge. Having never used his vocal cords, the clone had to adjust to speaking, after which Nenn inserted a mindspear containing the information on Korr's early life into his head."}, {"tag": "p", "text": "The Iteration's brain was subsequently filled with memories from Korr's life, ranging from the young Korr's time with his adoptive parents on the galactic capital of Coruscant up to his resolution of a crisis in 14 ABY involving a Sith cult that venerated the Dark Lord of the Sith Marka Ragnos. Because of those memories, the Iteration believed himself to be Korr, and he at first did not understand how he ended up wherever he was and was alarmed at not being able to sense the Force, as his connection to it was being blocked by Nenn's unique mental power. However, Nenn spoke a code word that activated the Iteration's programming, and the clone realized who he was and his designed purpose. Nenn stopped using his talent, letting the clone feel the Force again. The Umbaran then released the Iteration from his cloning tank, informing him that he was not irreplaceable and his mission could be delegated to another Iteration if required. Iteration had barely any time to adapt to walking when Nenn ordered two guards to escort the clone to the Umbaran's scout flyer. Nenn and his sister, Syll Nenn, then had the Iteration placed in a state of suspended animation in a stasis chamber aboard the flyer until his services were needed to iterate Korr. The Iteration continued to be kept in stasis as the Umbaran siblings tracked the real Jaden Korr and another clone of his, Soldier, the latest among a so-called Community of Force-sensitive clones produced as part of the late Grand Admiral Thrawn's secret project to create powerful Force-using servants for the Galactic Empire."}, {"tag": "p", "text": "Believing Soldier to be Thrawn's greatest creation—or the \"Prime,\" as they called him—the One Sith wanted to capture him for study. The Nenn siblings followed Soldier to the planet Fhost and later to a medical supply ship that the Community used to try to reach the entity known as Mother, which called to them with promises of refuge and salvation. In reality, Mother was a self-aware organic space station, created by the Rakatan Infinite Empire, that wanted to lure the clones to use them for its own needs. Nyss infiltrated the medical supply ship on Fhost, which Korr and his companions also pursued aboard the starship Junker, as well as Syll aboard the scout flyer. The chase culminated in a brief skirmish between the Junker crew, the Community clones, and the Umbarans in a remote star system. The fight resulted in Soldier and his surviving clone brethren escaping on the medical ship, pursued by Junker. Syll was killed in the fight, but Nyss had been able to extract the coordinates of the star system that Soldier planned to travel to from the medical ship's navicomputer before returning to the scout flyer."}, {"tag": "h3", "text": "Time to iterate"}, {"tag": "p", "text": "Pursuing Soldier and Korr, Nenn decided that it was time to awaken the Iteration. Upon doing so, Nenn tested a code word that momentarily shut down the clone before reawakening him again and escorting him to the scout flyer's cockpit. When the Iteration witnessed Syll's corpse still laying in the cockpit, he offered to take care of her body for Nyss, but the Umbaran, distraught after her death, ordered the clone not to touch Syll's body and carried her away himself. The Iteration and Nenn soon arrived in a star system filled with radiation coming from a pulsar, where the two spotted Junker flying on the outskirts of an asteroid belt. However, the Iteration did not feel Korr's presence aboard the ship, and Nenn believed that the Jedi had taken Junker's Starhawk shuttle, Flotsam. Nenn attacked Junker but stopped firing when the Iteration felt a dark side presence near one of the two planets in the system. There they found that the presence was coming from Mother, which consisted of a surface installation linked by a tether to a section out in space. Both the medical ship and Flotsam were docked with the station. The Iteration and Nenn also docked with the station and went aboard, taking the one remaining mindspear, which they intended to fill with Korr's more recent memories and transfer them to the Iteration. The pair descended through organic lifts to the planetary portion of the station, though the Iteration soon fell behind Nenn. When the Umbaran had found Korr, he contacted the Iteration by comlink and ordered the clone to lay in wait while he engaged the Jedi."}, {"tag": "p", "text": "However, when Nenn did not return after a while, the Iteration proceeded forward to find the Umbaran dead; Korr heavily injured and unconscious; and Marr Idi-Shael—Korr's Cerean apprentice—also neutralized. Willing to proceed with the One Sith's plans, the Iteration took the mindspear from Nenn's body and stuck it into Korr's brain, starting to fill it up with his memories. Idi-Shael awoke at that moment and tried to stop the Iteration, but the clone believed him to be nonthreatening, even going so far as to reveal his plans to him. The Iteration tried to kill the Cerean with his lightsaber, but Idi-Shael blocked the strike with a lightsaber of his own before trying to shoot the clone with a blaster. The Iteration easily disarmed his opponent of both weapons and prepared to strike again, but Idi-Shael surprisingly parried the blade with his bare hand and immobilized the clone by driving his fingertips into his throat, rendering him unconscious. Meanwhile, Korr had succumbed to his injuries, both from the fight with Nenn and from the insertion of the mindspear, and died. Hoping to preserve his Master's persona, Idi-Shael took the mindspear and stuck it into the Iteration's head as the clone came to his senses. Yet the clone was not ready for the transfer, resulting in the Iteration's memories and consciousness being completely rewritten with that of Korr, essentially killing the clone."}, {"tag": "p", "text": "Idi-Shael dressed the Iteration in Korr's clothes, severed three fingers from his right hand to match an injury that Korr had recently received, and hid Korr's dead body. When Korr awoke in the Iteration's body, he was unaware of what had happened, believing that he had been merely knocked out by Nenn. Korr and his companions teamed up with Soldier and the clone child Grace to try to escape from Mother, which possessed a consciousness of its own and was trying to kill them. Despite the station's hostility, the group managed to escape and destroyed Mother in the process. Not knowing that he was in the Iteration's body, Korr continued to act the same way that he had been before, but Idi-Shael was worried that the Iteration could have survived the transfer and was waiting for the One Sith to activate its programming. Korr continued to serve the New Jedi Order from inside the Iteration's body, participating in the Force psychosis crisis and the emergence of the Lost Tribe of Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Iteration was a nearly perfect clone of Jaden Korr, sharing his appearance as a tall man with brown hair and gray eyes. In order to match Korr's appearance, the clone's hair was cut short, his facial hair was styled in the same goatee, and he wore modern clothing. However, the Iteration, immersed with the dark side of the Force, had a much more violent and cruel look, with Marr Idi-Shael noting that the clone's eyes looked different from his Master's, despite being the same color. He also lacked a small scar on his right cheek, which Korr had acquired when he was a child, and Korr noticed its absence when he tried to shave after escaping from the space station Mother. Unlike Korr, who had recently lost three fingers on his right hand before his death, the Iteration originally had all of his digits. Yet Idi-Shael accounted for this discrepancy, severing three of the Iteration's fingers to match Korr."}, {"tag": "p", "text": "The clone shared Korr's memories up until the defeat of the Disciples of Ragnos and initially believed himself to be Korr as a result, but he soon learned his true identity. The Iteration had at least some sense of compassion, trying to be helpful toward Nyss Nenn by offering to take care of his sister's dead body, but the Umbaran did not accept his help. The Iteration did not find Nenn to be very talkative, while the Umbaran suspected that the clone was uncomfortable knowing that his mission required him to effectively die and become another person, even though the One Sith's programming was designed to make him accept his fate. The Iteration underestimated Marr Idi-Shael, revealing the mindspear's capabilities to him and believing that he would easily kill the Cerean, menacingly laughing as he tried to do so. However, Idi-Shael fought back and incapacitated the clone. As he realized what Idi-Shael was planning to do, the Iteration was horrified, since he was not ready for the memory transfer, which killed him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Iteration was Force-sensitive and was deeply immersed with the dark side as a result of being created by the Sith. He could sense the dark side aura of Mother and the lack of Korr's presence aboard Junker. However, his Force sense ability was limited, and he could not pick up his targets from far away, being unable to detect Korr aboard Mother. The clone could use telekinesis, using it throw Idi-Shael's blaster away when the man tried to grab it. The One Sith provided the Iteration with a red-bladed lightsaber, which he wielded in the fight against Korr's apprentice. The Iteration was also able to use the weapon to deflect blaster shots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Iteration was created by Paul S. Kemp for the 2011 novel Riptide. Jaden Korr, who dies and reawakens in the Iteration's body in Kemp's story, previously appeared in the Fate of the Jedi novel series, chronologically taking place after Riptide. By establishing that Korr inhabited the Iteration's body after its events, Riptide effectively retconned the Iteration's first physical appearance, as a vessel for Korr, to be the 2009 novel Fate of the Jedi: Abyss, written by Troy Denning. Riptide ended in a cliffhanger by mentioning the possibility, through Marr Idi-Shael's doubts, that the One Sith's plan had been successful and that the Iteration continued to live on, waiting to be activated at a later date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}