{"url": "The_Jundland_General%27s_campaign", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles of Tatooine"], "nodes": [{"tag": "h1", "text": "The Jundland General's campaign"}, {"tag": "p", "text": "Following a campaign against the Tusken Raiders launched by Saponza's Gang of the Alliance to Restore the Republic, the Tusken Raider known as the Jundland General launched a campaign against rebel forces and civilians."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Tatooine experienced an increased aggression from Tusken Raiders and began attacking moisture farms and the Rebel Alliance base, rebel forces launched a campaign against the Tusken Raiders, resulting in a cease of attacks by Tuskens."}, {"tag": "h2", "text": "The Tusken Raiders attack"}, {"tag": "p", "text": "Sometime after the Alliance's campaign against the Tusken Raiders, the rebel base was attacked by a large force of Tuskens. After the attack was repelled, rebel agent Saponza noted that the Tuskens had a better strategy, and began wondering what their goal was. The escalating aggression forced the rebels to build and upgrade their forces. Once scouts uncovered a Tusken enclave and the rebels sent their forces to attack, Saponza quickly noticed that the layout of the enclave was drastically different than others, noting that the \"Sand People\" were never that tactful. Colonel Jennica Pierce was able to reinforce the rebels with Wookiee warriors in their attack, and during the engagement, Saponza used the Strix to attack ground targets."}, {"tag": "h2", "text": "The Jundland General attacks"}, {"tag": "p", "text": "Immediately following the rebels' return to base they were instantly attacked by a large group of Tusken Raiders, easily avoiding detection, and were able to get close enough for a surprise attack. Saponza ordered his troops to get to their autoturrets and repel the attack. Following the intense battle, Saponza spoke with his partner, stating that the Sand People were never that smart. Worried, Saponza headed to the cantina in Mos Espa to gather information about Tusken activity while Saponza's partner continued to expand and upgrade their headquarters. Saponza returned, having learned that the rebel forces were fighting against a Tusken Raider known as the \"Jundland General\" operating from a village in the Jundland Wastes."}, {"tag": "p", "text": "Before Saponza could finish however, the rebel base was again attacked by a large Tusken Raider force. Rebel forces prevailed and survived the attack. While mustering up their forces to defeat the \"Jundland General\", Saponza told his partner that they should ensure that their base is upgraded to deter further attacks. After the rebels attacked a fortified enclave, Saponza noticed that there were no women or children, stressing that the rebels walked into a death trap and that the \"Jundland General\" needed to be defeated soon."}, {"tag": "h2", "text": "Defeat of the General"}, {"tag": "p", "text": "Colonel Pierce informed the Saponza and his unit that they needed to further expand and upgrade their forces to counter not only smugglers, cartels, or syndicates, but the Galactic Empire as well, stating that anti-Imperial operations would begin soon. Once the \"Jundland General\"'s base of operations was discovered, Saponza's rebels launched an attack on the fortification. Pierce stated that if the \"Jundland General\" was finally defeated, then many innocent lives would be saved. The rebels would eventually emerge victorious, with Saponza stating that the battle reminded him of the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}