{"url": "Battle_of_Maridun_(0_ABY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Rolion sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Maridun  (0 ABY)"}, {"tag": "p", "text": "The Battle of Maridun was a localized conflict between the Imperial forces stationed on Maridun and the local Amanin inhabitants. The battle was considered to be a religious takital by the local Amani, since the Imperials had crossed their sacred border. The battle was disastrous for the Imperials, with much of their forces wiped out."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A column of Imperial vehicles were bringing supplies to a nearby mining installation, when they unknowingly crossed a border to the sacred battlegrounds of the Amanin race. Subsequently, the local Amanin tribe declared them to be participants in the traditional battle-contests, and readied to wage war on the trespassers."}, {"tag": "p", "text": "Having fought off small hunting parties, the Imperial group reached their destination, only to find the entire community slaughtered and the mining equipment damaged. General Ziering ordered barricades to be set up, shielding the area from the open, grassy plains."}, {"tag": "p", "text": "However, several Amanin managed to sneak past the outer defenses during the night, and sabotaged one of the HAVw A5 Juggernauts, effectively cutting off communications with the outside world and blowing it up."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "The siege, day 1"}, {"tag": "p", "text": "The next day, construction on the barricades continued, and with General Ziering undergoing surgery to save his left eye,(which was damaged due to the Anamin attack the previous night) Commander Frickett was in charge."}, {"tag": "p", "text": "Captain Gage was sent out on patrol to assess the situation, but his squad came under attack by Amanin warriors, and all were killed apart from the captain and two soldiers, who were saved by covering fire from the remaining Juggernaut. As the smoke cleared, all could see the enemy's true strength, as thousands of Amanin lined up throughout the plains surrounding the camp."}, {"tag": "p", "text": "In a panic, Commander Frickett ordered all troops to open fire, to \"counter offense with an offense\" as per the textbook. Lieutenant Janek Sunber tried to warn of a trap, but his words went unheard, and Frickett stormed out into the plains, rallying his troops to follow him. The army quickly discovered that the Amanin had shown themselves merely to draw the Imperials out of their fortress to be ambushed in the tall grass. Many troopers were killed, including Frickett himself, and the second Juggernaut, under the command of Captain Bex, was overrun and disabled. The dead soldiers were stripped of their weapons and gear, giving the Amanin energy weapons to aid their fight."}, {"tag": "p", "text": "With half his fighting force gone, General Ziering used the opportunity to seek advice from his most promising subordinate, Lieutenant Sunber. Sunber suggested using a more defensive strategy against them, constructing three trenches and surrounding walls that point toward a redoubt, namely their remaining vehicle, the AT-TE cargo walker. A squad would occupy one trench, and when falling back would be protected by the squad in the next trench. This way, the Amanin would face an obstacle-course, coupled with fire from the retreating soldiers and the AT-TE's E-webs. Ziering accepted the proposal and promoted Sunber to Captain."}, {"tag": "h3", "text": "The siege, day 2"}, {"tag": "p", "text": "After setting up barricades and digging all the trenches, Sunber was ordered out to the first trench, with Gage being sent to the second. The plan worked suitably, until Captain Gage frantically ordered his troops to retreat, leaving Sunber's force vulnerable when the time came for them to pull back. Desperate, Sunber threw one of his thermal detonators towards the nearest Juggernaut-wreck. With the ensuing explosion providing cover, Sunber's men were able to retreat to the second trench."}, {"tag": "p", "text": "Coming up with a new idea, Sunber ordered his troops to drop down as the Amanin advanced, making them believe they were preparing for an attack. Instead, his force would split in two and head towards opposite ends of trench, trapping the Amanin in the middle. Having understood the Captain's intentions, General Ziering ordered all E-Webs to aim for the middle of the second trench. As the Amanin advanced, they were caught in the cross-fire, with devastating results."}, {"tag": "p", "text": "As the E-Webs provided cover, Sunber's troops made it to the last trench, and geared up for the final onslaught. When it came, the remaining forces under Ziering's command fought furiously, even when overrun by the Amanin. The General was hit by a spear, and in his dying moments promoted Sunber to the rank of Commander, bypassing the now useless wreck that was Captain Gage, who cowered behind a crate, having not fired a shot the entire battle."}, {"tag": "p", "text": "The defense of the AT-TE lasted until only a handful troops remained, and as they prepared to fight again, the leader of the Amanin appeared out of the mist, declaring them to be valiant fighters and worthy of peace with his people, having proved themselves in Takital—ritual battle on their sacred ground."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a result of the battle, nearly 90% of Ziering's army was lost, included Ziering himself, one commander, and at least one captain. Thus, Sunber had no credible witnesses to his promotion to Commander except Captain Gage, who refused to acknowledge his claim during an official hearing, due to jealously, leaving him once again as a Lieutenant."}, {"tag": "p", "text": "On the positive side for the Empire, the reward given by the Amanin chief, was that all captives taken from other tribes by his warriors, would be given to the Empire as slave laborers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}