{"url": "The_Hutt_Gambit", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The Han Solo Trilogy"], "nodes": [{"tag": "h1", "text": "The Hutt Gambit"}, {"tag": "p", "text": "The Hutt Gambit is a Star Wars Legends novel written by A. C. Crispin. It is the second volume of Star Wars: The Han Solo Trilogy, following The Paradise Snare and preceding Rebel Dawn. It was first published by Bantam Spectra on August 11, 1997, and the complete trilogy was reprinted in The Han Solo Trilogy (1998)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Here is the second novel in the blockbuster new trilogy that reveals the never-before-told story of the young Han Solo. Set before the Star Wars movie adventures, these books chronicle the coming-of-age of the galaxy's most famous con man, smuggler and thief."}, {"tag": "p", "text": "Once one of the Academy's brightest stars, Han Solo is now a fugitive from the Imperial Navy. But he has made a valuable friend in a former Wookiee slave named Chewbacca, who has sworn Han a life debt. Han will need all the help he can get. For the Ylesian Hutts have dispatched the dreaded bounty hunter Boba Fett to track down the man who already outsmarted them once. But Han and Chewie find themselves in even bigger trouble when they agree to lend their services to crime lords Jiliac and Jabba the Hutt. Suddenly the two smugglers are thrust into the middle of a battle between the might of the Empire and the treachery of their outlaw allies…a battle where even victory means death!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "Han Solo has been discharged from the Imperial Navy and is down on his luck. Not only has he failed in achieving his dream, he has a Wookiee claiming to have given him a life debt and won't stop following him, no matter how often he objects or attempts to flee. However, the Wookiee—whose name is Chewbacca—proves his worth to Solo when he saves him from an incensed Barabel after a game of sabacc. Chewbacca swore his life debt after Solo saved him from being mercilessly killed by Imperial slavers. Although Solo detests slavers more than anyone else in the galaxy—having seen in person what they do on Ylesia—he really wishes the Wookiee had left him alone. As far as Solo is concerned, he saved the Wookiee to repay Dewlanna for saving him nearly five years earlier, when Han Solo escaped Garris Shrike."}, {"tag": "p", "text": "Seeking work, Han Solo makes his way to Nar Shaddaa, the Smugglers' Moon. He and Chewbacca meet a number of smugglers and begin working for one of Han's old classmates, Mako Spince, as transport pilots. Solo also meets Shug Ninx, a master mechanic and owner of his famous Spacebarn. With Spince's help, Solo finds an apartment in the Corellian sector and comes closest to \"settling down\" as he ever has, insofar as a smuggler can \"settle down.\" However, a bounty was placed on Solo by Teroenza, and several bounty hunters come to Nar Shaddaa trying to collect, leaving Han and Chewbacca dodging attacks. Within only a few months, and after extensive experience flying, Solo seeks greater opportunities and eventually seeks a career with Jabba the Hutt and Jiliac."}, {"tag": "h3", "text": "Intrigue among the Hutts"}, {"tag": "p", "text": "Jabba and Jiliac are impressed with the young pilot's credentials and experience, and decide to hire him to smuggle spice around the Galaxy. Solo quickly proves his skill to the Hutts and is given tougher and more exciting assignments, such as the infamous Kessel Run. On his first Kessel Run, Solo's friend and old-time smuggler Roa accompanies him to avert any mishaps. Although the first Run was not terribly smooth, even Roa was impressed by Solo's natural piloting ability."}, {"tag": "p", "text": "Initially unbeknownst to Solo, Jiliac and Jabba are preparing to make their bid for supremacy among Hutts by targeting the Besadii clan's spice refining operation on Ylesia. The smuggler narrowly escapes a brutal pirate attack, the blame for which is laid upon the Besadii clan. Aruk the Hutt, clan leader of Besadii, and his offspring, Durga, are outraged at such claims. A Council was convened on Nal Hutta to discuss recent events, but the Besadii clan was not found guilty of any transgressions. It was at this time when Jiliac and Jabba decided Aruk needed to die."}, {"tag": "h3", "text": "New friends, new enemy"}, {"tag": "p", "text": "Han Solo had never been happier. By now, Chewbacca had proven himself a very capable and valuable partner in the smuggling trade. Solo established himself as one of the best smugglers in the galaxy, and became Jabba's favorite. However, the astronomical bounty offered for Solo from Teroenza was still available. In desperation, Teroenza contacted the most infamous bounty hunter in the galaxy: Boba Fett."}, {"tag": "p", "text": "In addition to smuggling and evading Imperial customs ships, Solo was living it up on Nar Shaddaa. He enjoyed two things above all: women and gambling. One such woman was an illusionist named Xaverri, who stunned audiences around the galaxy with her amazing magic acts. After seeing her perform, Solo became acquainted with her and their relationship became intimate. Taking a break from smuggling for several weeks, Solo and Chewbacca joined Xaverri, serving as stage hands and occasionally performing in her shows. Xaverri, who had strong sympathies to the smugglers, soon decided enough was enough. Solo and Chewbacca returned to their home on Nar Shaddaa."}, {"tag": "p", "text": "After a particularly enjoyable evening with Xaverri, Solo was returning to his apartment when he was shot with a toxic dart. The toxin, which was made on Ryloth, was a blue liquid and prevented any willful action on the smuggler's part and total obedience to whomever spoke. Terrified and unable to move, Solo knew that a bounty hunter had jumped him. That bounty hunter, unknown to him, was Boba Fett."}, {"tag": "p", "text": "Although Solo would not have agreed, what happened next could only have been the will of the Force. A professional gambler and entrepreneur named Lando Calrissian had dire need of a professional pilot and understood that Han Solo was the best. While seeking out Solo, he witnessed his capture at the hands of Boba Fett. Not only did Calrissian not wish to see a potential associate harmed, he also hated anything to do with bounty hunters. While Fett was busy with Solo, Calrissian sneaked up on the bounty hunter and jammed a blaster into his neck. Unable to resist, Fett was humiliated when the gambler injected the same toxin he had used on Solo. Calrissian also secured the antidote for Solo and freed him. However, they ordered the bounty hunter to leave entirely. After Fett unarmed himself, he was saved by both Calrissian's and Solo's conscience not allowing them to kill even a bounty hunter in cold blood. Then, Fett was coerced to fly clean through Imperial Space. Once the effects of the toxin wore off, Fett would swear revenge against Solo and Calrissian, for very few people outsmarted him and lived to tell the tale."}, {"tag": "p", "text": "Having garnered a new friend and valuable ally in Lando Calrissian, Han Solo was obliged to choose a ship as his own from the gambler's used ship lot on Nar Shaddaa in exchange for teaching Calrissian how to fly. Solo selected a worn, battered freighter that he christened the Bria, after his tragic first love, Bria Tharen. Calrissian kept the lot's prize for himself, however. It was that ship on which Solo taught Calrissian to fly, and the ship that stole Han Solo's heart: the Millennium Falcon."}, {"tag": "h3", "text": "Hutt war"}, {"tag": "p", "text": "On Ylesia, business was booming and the Besadii clan were making unprecedented profits. However, not everyone was pleased. After the death of Zavval, Aruk dispatched his nephew, Kibbick the Hutt, to act as overlord to Teroenza and the t'landa Til \"priests.\" Kibbick, however, was a bumbling idiot and completely inept. This further frustrated Teroenza, who entertained thoughts of seizing the Ylesian operation as his own. In addition to Aruk's refusal to fund Teroenza's exorbitant bounties on Han Solo and Bria Tharen, these factors prompted Teroenza to respond to an outstanding offer from the Desilijic clan."}, {"tag": "p", "text": "Teroenza gave in to his frustration and contacted Jiliac. The two gangsters exchanged views and came to agree that the best course of action would be to eliminate Aruk. Months earlier, Teroenza discovered that Aruk had an insatiable appetite for the nala tree frog and began shipping them by the tonne to Nal Hutta. Jiliac had obtained an ultra-secretive toxin that could not be detected. The toxin worked by creating an addiction to itself, and slowly, over many weeks, would rot the consumer's brain. Once the toxin was removed from the consumer's diet, he would die of shock from the loss of the addictive poison. By exposing the nala tree frogs to trace amounts of the poison, Teroenza would kill Aruk through his own gluttony. Jiliac and Teroenza agreed, and their plan worked."}, {"tag": "p", "text": "Teroenza's seemingly endless shipments of nala tree frogs to Nal Hutta were indeed exposed to the toxin and Aruk unknowingly became addicted to it. Even though he suffered a near-stroke and seizure as a result of the toxin, not even his son Durga suspected the cause. Aruk's physician advocated exercise and cautioned against uncontrolled gluttony. Aruk argued that a Hutt of his age and influence could do as he pleased. When Teroenza shipped one last case of nala tree frogs without the toxin, Aruk went into shock and soon died a most agonizing death as his brain hemorrhaged."}, {"tag": "p", "text": "Durga, unlike Kibbick, was very clever and understood immediately that Aruk's death had involved foul play, despite the fact that no physician could locate any foreign substances. Even so, Durga seized control of Besadii despite misgivings about his unusual birthmark that, according to Hutt legend, was an evil omen. Durga was quick to establish himself as rightful clan leader and, with the aid of Black Sun, set up a number of fatal \"accidents\" for his naysayers. With Besadii firmly in his grasp, he had Aruk's corpse frozen and sent to Coruscant. Durga intended to hire the best forensics team in the entire Galactic Empire discover the true cause of death."}, {"tag": "h3", "text": "The Battle of Nar Shaddaa"}, {"tag": "p", "text": "Throughout the galaxy, Rebel activity had reached an all-time high and Palpatine decided to put an end to it before it got any worse. One of the sectors targeted for Imperial retribution was the lawless expanse of Hutt Space, and Nar Shaddaa in particular. Moff Sarn Shild had been bribed by the Hutts for years but he denounced his corruption with the aim of rising through Imperial ranks. Despite the pleas of the Hutts, he was stalwart in his resolve to level Nar Shaddaa."}, {"tag": "p", "text": "Desperate to prevent such a disaster, the Hutts convened again on Nal Hutta and decided to offer anything to Shild to prevent the attack. Having superseded Besadii as supreme Hutt clan, Jiliac and Jabba selected Han to visit Shild on Coruscant because of his familiarity with Imperial military procedure. Reluctantly, Han Solo returned to Coruscant to meet with Shild. Upon his arrival, Solo was horrified upon discovering an old friend with Shild: Bria Tharen. To anyone unaware of her mission—including Solo—Tharen appeared to be Shild's mistress. Shocked and devastated at seeing her that way after all those years, Solo left Shild both unsuccessful and emotionally distraught. Unbeknownst to Solo, however, Tharen was working undercover for the Corellian Resistance and spying on Shild. She, too, was devastated at Solo's reaction."}, {"tag": "p", "text": "The one thing that Han Solo was able to accomplish on Coruscant was learning that Admiral Winstel Greelanx would be commanding the attack force. Again, Solo was sent to meet Greelanx and offer any bribe he could. Greelanx accepted an exorbitant bribe in the form of precious gems in exchange for his battle plans, allowing the defenders of Nar Shaddaa a fighting chance. Solo returned to Nar Shaddaa with the plans. Along with Mako Spince, Shug Ninx, and the others, Han Solo developed a plan to defend Nar Shaddaa from the Empire. His friend Xaverri even returned to assist their effort."}, {"tag": "p", "text": "Unknown to the smugglers, however, the Admiral received a mysterious priority transmission commanding him to retreat at the first believable opportunity and allow the smugglers to \"win.\" Greelanx was puzzled, but followed through. When the Empire did attack Nar Shaddaa, the smugglers' fleet was ready after numerous drills. Although the battle did not go as smoothly as practiced, the smugglers were able to defeat the Imperial forces. Despite grievous casualties, the smugglers won the day and Nar Shaddaa survived the wrath of the Empire."}, {"tag": "p", "text": "Following the battle, Solo delivered the gems to Greelanx. Before he could return, however, he witnessed, from inside an adjoining room, Greelanx's execution at the hands of none other than Darth Vader. Solo hastily returned to Nar Shaddaa, happy but shaken. Having won the battle, Solo and Chewbacca returned to smuggling, as had everyone else. The Bria was little more than flying scrap now, and the smuggler decided it was time to replace her. Lando Calrissian let Solo know about an upcoming sabacc tournament on Cloud City he would be attending. Solo decided he would go too, and maybe win enough to buy a new ship. Meanwhile, the Moff in charge of Hutt space, found himself in the midst of the biggest, and final, decision of his life. Moff Shild knows that the imperial loss at the Battle of Nar Shaddaa will not go over too well with Palpatine. So falling back on an old childhood memory, he tries to decide his own death. By blaster or by poison?"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}