{"url": "The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)", "categories": ["Category:Real-world articles", "Category:Guidebooks"], "nodes": [{"tag": "h1", "text": "The Jedi Path: A Manual for Students of the Force (real-life book)"}, {"tag": "p", "text": "The Jedi Path: A Manual for Students of the Force is a reference book on the Jedi Order and its history by Daniel Wallace. It was released on September 28, 2010."}, {"tag": "p", "text": "Although the book has 160 pages, at Celebration V it was revealed that pages 13-16 discuss the prophecy of the Chosen One and are missing, with the in-universe reason being that Darth Sidious tore them out."}, {"tag": "p", "text": "It contains multiple inserts placed there by different Jedi, such as Qui-Gon Jinn's Padawan braid and Thame Cerulian's Jedi credit."}, {"tag": "p", "text": "The book's in-universe history is that it is the third edition of a Jedi training guide, printed in 115 BBY, and survived the Great Jedi Purge in the possession of Darth Sidious. It was recovered by Squib salvagers near the remains of Byss, and given to Luke Skywalker."}, {"tag": "p", "text": "In September 2011, a trade edition of the book was released without the Vault or extra items. This version retained tattered edges, but the section on the Chosen One was marked through rather than torn out."}, {"tag": "p", "text": "On January 15, 2012 the book was re-released with additional content and illustrations in an enhanced e-book edition."}, {"tag": "p", "text": "The book was released again in August 2014 as part of a Deluxe Box Set with Book of Sith that included two art prints depicting figures from Sith and Jedi history, and again in September 2016 as Star Wars: Secrets of the Galaxy Deluxe Boxed Set with the Imperial Handbook and Bounty Hunter Code."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "With the push of a button, the doors of the vault open in a wash of light and Star Wars sound effects. The inner platform rises, revealing this exclusive edition of The Jedi Path."}, {"tag": "p", "text": "This ancient training manual, crafted by early Jedi Masters, has educated and enlightened generations of Jedi. It explains the history and hierarchy of the Jedi Order, and what Jedi must know to take their place as defenders of the peace in the galaxy—from mastery of the Force to the nuances of lightsaber combat."}, {"tag": "p", "text": "Passed down from Master to Padawan, the pages of this venerable text have been annotated by those who have held it, studied it, and lived its secrets. From Yoda and Luke Skywalker to Count Dooku and Darth Sidious, they have shaped the content of the book by leaving mementos tucked within the pages, tearing out pages, and adding their personal experiences as tangible reminders of the lessons they've learned."}, {"tag": "p", "text": "Through wars and rebellion, only a single copy of this manual has survived. It is now passed on to you."}, {"tag": "p", "text": "The ancient Masters who wrote the text: Fae Coven, Grand Master and head of the Jedi Council; Crix Sunburris, Jedi Ace starfighter pilot; Restelly Quist, Jedi Chief Librarian; Skarch Vaunk, Jedi Battlemaster and lightsaber expert; Bowspritz, Jedi Biologist and expert on the Living Force; Sabla-Mandibu, Jedi Seer and Holocron expert; Morrit Ch'gally, Jedi recruiter; Gal-Stod Slagistrough, Jedi leader of the Agricultural Corps."}, {"tag": "p", "text": "Jedi who added personal commentary: Yoda, Thame Cerulian, Count Dooku, Qui-Gon Jinn, Obi-Wan Kenobi, Anakin Skywalker, Ahsoka Tano, Darth Sidious, and Luke Skywalker."}, {"tag": "p", "text": "Removable features: A letter tracing the book's history, a severed Padawan braid, a metal Jedi Credit medallion, a Jedi starfighter patch, a burned poster of the Jedi Code, a map of the Jedi Temple, a diagram of a lightsaber sketched on the back of a napkin from Dex's Diner, and a note on the missing pages torn from the book by a Sith."}, {"tag": "p", "text": "Created in collaboration with Lucasfilm—along with an acclaimed Star Wars author and revered Star Wars illustrators—this volume provides new insights into the history and lore of the Jedi Order while introducing never-before-seen ships, creatures, characters, and details about how one trains to become a Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Just like a number of novels, reference books now considered Legends, the Jedi Code in regard of attachment and emotions was misunderstood and misinterpreted in Wallace's book, incorrectly using \"attachment\" in terms of love, fondness, affection, emotional bond - therefore, The Jedi Path: A Manual for Students of the Force is in conflict with George Lucas' vision on the Star Wars universe."}, {"tag": "p", "text": "On page 39, in a handwritten note Anakin Skywalker states that he \"never used a training saber.\" However, the 2001 young reader novel Jedi Apprentice Special Edition: Deceptions mentions that Anakin used a training lightsaber on loan from the Jedi Temple during his mission to the BioCruiser."}, {"tag": "p", "text": "There are at least three instances of writing in the margins attributed to Ahsoka Tano that it is impossible for her to have written; in these cases, the handwriting matches that of Anakin. These can be seen on pages 134, 142, and 151. These errors appear to be corrected in the trade edition."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}