{"url": "The_Last_Jedi_(novel)", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Articles that need plot summary", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "The Last Jedi (novel)"}, {"tag": "p", "text": "The Last Jedi is a novel by Michael Reaves and Maya Kaathryn Bohnhoff that was released on February 26, 2013. The book's original name was Jedi Dawn, but on March 2, 2011, Bohnhoff confirmed that the title had changed, saying, \"I noted that Jedi Dawn has already been used for another book and Michael really likes the title Last Jedi.\""}, {"tag": "p", "text": "An exclusive hardcover edition was published through the Science Fiction Book Club. The book was originally going to be the fourth Coruscant Nights novel, but it is now a standalone followup to the series.[source?]"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ever since Emperor Palpatine's Order 66--which called for the execution of all Jedi--Jax Pavan is the last Knight around to fight the dark side of the Force. Together with his droid I-5, Jax has eluded Vader time and again, all the while wreaking havoc against the Empire through the underground resistance on Coruscant. But now the Rebel's leader on the city-planet has been captured, and it's up to the Last Jedi to ride again...possibly for one final adventure."}, {"tag": "h2", "text": "Back cover"}, {"tag": "p", "text": "KNIGHT OF RECKONING"}, {"tag": "p", "text": "Order 66 has all but exterminated the Jedi. The few remaining who still wield the Force for good have been driven into exile or hiding. But not Jax Pavan, who's been steadily striking blows against the Empire—as a lone guerrilla fighter and a valued partner of Whiplash, a secret Coruscant-based resistance group. Now he's taking on his most critical mission: transporting a valued Whiplash leader, targeted for assassination, from Coruscant to safety on a distant world. It's a risky move under any circumstances, but Jax and his trusted crew aboard the Far Ranger, including the irrepressible droid I-Five, are prepared to pit their combat skills and their vessel's firepower against all Imperial threats—except the one Jax fears most. Reports have raced across the galaxy that the dark lord of the Sith has fallen in a duel to the death with a Rebel freedom fighter. But Jax discovers the chilling truth when he reaches out with the Force . . . only to touch the dark, unmistakable, and malignantly alive presence that is Darth Vader. And Jax knows that Vader will stop at nothing until the last Jedi has fallen."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Part One: Vaster than Empires"}, {"tag": "p", "text": "Aboard the ship Far Ranger, Jax Pavan, Laranth Tarak, Den Dhur and I-5YQ transport Thi Xon Yimmon, Cerean leader of the Whiplash resistance movement. They are en route to Dantooine, where Yimmon will be safe from the attacks that have taken place on Coruscant. They make a stop on Toprawa, where Jax and Laranth meet with Aren Folee of the Antarian Rangers. After continuing their journey, the ship is assaulted by Imperials at the Twins. Darth Vader and several stormtroopers board the dying ship during the battle. Laranth is killed, Yimmon is taken, and I-Five is nearly destroyed. Vader leaves with the Cerean, believing the fate of the survivors sealed, but Jax and Den leave with an escape pod, with I-Five's remains and the miisai tree that Laranth once gave to Jax. They are picked up by an escort of the Antarian Rangers and return to Toprawa. There they seek refuge in Mountain Home, a hideout used by the resistance there, and they meet several people. I-Five is refitted in the body of a DUM pit droid. Den and Jax are shaken by the previous events and contact Coruscant. After several days of staying on Toprawa they leave for Coruscant. There they have a meeting with the main members of Whiplash: Tuden Sal, Acer Ash, Dyat Agni, and Sheel Mafeen. Pol Haus is also present. After Jax meets with the Cephalon Aoloiloa, who warns him of events to come, he infiltrates the Imperial Security Bureau. Vader is present and he sees Jax, who is disguised. Jax quickly leaves after knowing Yimmon isn't there. Back at his ship, the Laranth, an Inquisitor is onto them."}, {"tag": "p", "text": "Part Two: Flight and Pursuit"}, {"tag": "p", "text": "Jax, Den and I-Five leave Coruscant in a rush. They make for Mandalore, where several Imperial ships have been seen. Jax meets with a Black Sun contact of Tuden Sal, Tyno Fabris. Jax negotiates with him and Prince Xizor and eventually learns of Kantaros Station in the Both system, where Yimmon might be. Meanwhile, Tuden Sal is planning to kill the Emperor but Haus disagrees with him. After withholding information, Sal removes Haus from Whiplash. Haus uses Mafeen to gather intel. Den and I-Five refit the droid in a new body and disagree with Jax's methods. The three leave for Kantaros."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}