{"url": "The_Last_of_the_Jedi:_Return_of_the_Dark_Side", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The Last of the Jedi"], "nodes": [{"tag": "h1", "text": "The Last of the Jedi: Return of the Dark Side"}, {"tag": "p", "text": "The Last of the Jedi: Return of the Dark Side is a Star Wars Legends junior novel written by Jude Watson. It is the sixth installment of the series Star Wars: The Last of the Jedi, and it was first published on December 1, 2006 by Scholastic."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Years ago, when they were both Jedi apprentices, Ferus Olin and Anakin Skywalker were rivals. Now their paths are about to cross again...."}, {"tag": "p", "text": "Abandoning the Jedi Order saved Ferus's life. As a result, he is the only one who can track down and save Jedi who have survived the rise of the Galactic Empire. He has rebellion on his mind, and hopes to bring about the fall of the Emperor."}, {"tag": "p", "text": "Only Darth Vader stands in his way. Ferus might not realize it, but his old rival is now his new deadly enemy."}, {"tag": "p", "text": "The thrilling new series from the New York Times bestselling author of Jedi Apprentice and Jedi Quest."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ferus Olin remains on the planet Samaria as a double-agent for Emperor Palpatine. His job is to send a message to the Resistance, and ask if they will disband. Meanwhile, Trever Flume, Astri Oddo and Lune Divinian, Raina Quill, Toma, Clive Flax, and Oryon all remain on the secret asteroid base where Garen Muln and Solace, two Jedi Knights, remain alive and well helping the Resistance fighters. Toma sets up a meeting with a Resistance member named Flame, and he can't decide who to send to speak with her because of his illness. Trever steals his ship, and meets with Flame on Samaria. Meanwhile, Darth Vader is busy showing his anger to Ferus because he reminds Vader of his past. That side of him is dead. In the end, Aaren Larker is out of office because of a no-confidence call by Bog Divinian. Bog is elected as prime minister, and Larker is killed by Vader. Trever believes Ferus betrayed him and Flame by sending them to Rosha, where there was an ambush."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}