{"url": "The_Last_One_Standing", "categories": ["Category:Real-world articles", "Category:Legends short stories"], "nodes": [{"tag": "h1", "text": "The Last One Standing"}, {"tag": "p", "text": "The Last One Standing is a short story written by Jude Watson and appearing in the Legacy of the Jedi/Secrets of the Jedi omnibus."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story begins with Obi-Wan Kenobi contemplating the death of Anakin Skywalker, though still feeling as if he was alive in some way. It moves on to show Obi-Wan monitoring the Lars homestead to protect the infant Luke Skywalker. However, when Owen and Beru Lars discover that the Sand People have stolen twenty of their moisture vaporators, Owen decides to gather together a group of fellow moisture farmers to battle the fearsome Sand People."}, {"tag": "p", "text": "Obi-Wan, not wanting Luke's protective \"father\"-figure to die as he surely would, decides to track the Sand People on his own. He eventually manages to track them down by following their tracks, while contemplating his memories of Anakin, and then a group of uli-ah back to their camp. Things go well there for a while, he manages to find the vaporators in the Sand People's tents and loads them onto a bantha."}, {"tag": "p", "text": "However, as he's about to leave, he is spotted by a lone Tusken Raider, who attacks him. Though Obi-Wan manages to disarm him easily, the Raider then howls, which alerts all the other males in the camp that they have an intruder. They all attack him, and Obi-Wan slowly starts to hate them, causing him to slip to the dark side slightly before he hears the voice of Qui-Gon Jinn, which brings him back to the light. Instead of murdering the entire clan as Anakin had done in the past, Obi-Wan instead chooses to cut their clothes off to reveal their skin—a taboo to the Sand People, which would usually result in the others of their tribe murdering them. This gives him time to escape on the bantha with the vaporators and causes him to become a legend for the Sand People."}, {"tag": "p", "text": "On returning to the Lars Homestead, Obi-Wan is met with an icy welcome, where Owen informs him that they did not need his help."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}