{"url": "The_Last_Resort_(starship)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:578-R space transports", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "The Last Resort (starship)"}, {"tag": "p", "text": "The Last Resort was a 578-R space transport owned and operated by the reclusive Arkanian Offshoot scientist Gorman \"Camper\" Vandrayk during the era of the Mandalorian Wars. During Vandrayk's years on the run from his former employer, the Arkanian biotechnology giant Adascorp, The Last Resort served as both the home and workshop for Vandrayk and his protector, companion, and fellow Offshoot, Jarael. The two lived together on The Last Resort in the Lower City of the planet Taris for years, disguising the vessel so thoroughly that most visitors never knew that it was actually a ship. In 3964 BBY, the arrival of Taris' two most wanted fugitives—Zayne Carrick and Marn Hierogryph, both hunted for involvement in the massacre of the Jedi class at Taris' Jedi Tower—at The Last Resort brought on the attentions of law enforcement, and the Offshoots were forced to raise ship with the fugitives and escape Taris. After helping Carrick, a former Padawan falsely accused of the murders of his friends, investigate the massacre, Vandrayk, Jarael, and Hierogryph rescued Carrick after he briefly turned himself into authorities, afterward going on the run in The Last Resort."}, {"tag": "p", "text": "Their travels later took them to the mining world of Vanquo, arriving around the same time as a Mandalorian attack on the planet in one of the first major offenses of the Mandalorian Wars between the Mandalorian warrior clans and the Galactic Republic. On Vanquo, The Last Resort was briefly stolen by Mandalorian \"runner\" Rohlan Dyre, but the group was able to regain control of the ship and later rescue Jarael, who had been mistaken for a Jedi and imprisoned on the Mandalorian-held Flashpoint Station. After this adventure, the Offshoots split with Carrick and Hierogryph, parting amicably with the Republic fugitives on the planet Ralltiir."}, {"tag": "p", "text": "Soon after lifting off, however, the elderly Vandrayk's health worsened—the cause of his illness later revealed to be allergens and molds festering in The Last Resort's circulation system, as the ship had sat in a trash pit for years without ever flying. When Jarael took the ship to the planet Arkania to seek medical treatment, she was discovered by Adascorp head Arkoh Adasca, who had The Last Resort tractor-beamed onto his flagship, the Arkanian Legacy. Adasca had Vandrayk healed and then forced him to finish the old project he had abandoned years ago, that of weaponizing the massive and incredibly powerful exogorth beasts in a bid to make Adascorp a galactic power. With the help of Zayne Carrick, Adasca's mad plot was foiled—retaining control of the exogorths, Vandrayk first ordered the beasts to kill Adasca and then took flight in The Last Resort, intending to lead the exogorths out into Wild Space so he could allow them to live as nature intended."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A 578-R space transport manufactured by Amalgamated Hyperdyne and Refuse Management, The Last Resort served as a vehicle, home, and workshop for Arkanian Offshoot scientist Gorman \"Camper\" Vandrayk, who lived in the ship for years with his protector and companion, Jarael. During The Last Resort's days sitting idly in the Lower City of the planet Taris, Vandrayk made many modifications to the ship's systems, including configuring a powerful rapid-fire laser cannon at the expense of The Last Resort's shields and hyperdrive. Vandrayk paid little attention to the ship's life support systems, allowing allergens and molds to build up in the Last Resort's air filtration system, which were released when the ship flew again. The ship also had a comm unit capable of broadcasting holographic messages. The Last Resort had a sizable cargo deck that also contained Vandrayk's workshop as well as several \"Camper special\" compartments that he used for smuggling sentients. Like all 578-R space transports, The Last Resort had a number of components and systems licensed by the Corellian Engineering Corporation, which made the ship easier to customize, as replacement parts were extremely easy to find."}, {"tag": "p", "text": "Living compartments were located on the upper deck, accessible from the main deck via only a single ladder that led into the ship's bridge—toward the front of the ship was the cockpit, which had four seats, two up front for a pilot and co-pilot and one on either side, along with flight controls and transparisteel viewports. The crew cabins were two separate rooms, each with a single bed, surrounding the ship's airlock and dorsal hatch. The cabins were connected on either side by a small crew lounge, which contained a hologame table, and the ship's engine room. On the lower level, The Last Resort had two boarding ramps toward the rear of the ship and a single trash receptacle in the center of the cargo deck. The Last Resort used a magnetic suction tube to quickly bring droids and other metal objects quickly onto the ship. The vessel featured a pair of engines located at the stern, mirrored by two floodlights at the bow. The Last Resort boasted a maximum speed of 800 km/h at sublight and was equipped with a Class 3 hyperdrive. Also equipped with a navicomputer, The Last Resort was normally crewed by two individuals but could be flown effectively with only one aboard. The Last Resort required a gunner to operate the ship's laser cannon. The 31.5-meter-long ship had room for ten passengers, 40 tons of cargo, and four months' worth of consumables. As a 578-R space transport, The Last Resort was valued at about 75,000 credits new and 28,000 used."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Junkyard days"}, {"tag": "p", "text": "Manufactured by Amalgamated Hyperdyne on the planet Corellia, The Last Resort was one of the last 578-R transports to leave the company's assembly yards before Amalgamated Hyperdyne's demise over civil suits relating to safety recalls. The ship eventually fell into the hands of Arkanian Offshoot scientist Gorman Vandrayk, who used The Last Resort in his flight from his former employer, the Arkanian bioengineering giant Adascorp—after Vandrayk refused to help Adascorp weaponize the massive space slugs known as exogorths, he broke his contract and went on the run, pursued by the company for decades. Vandrayk eventually added a passenger, a young Offshoot named Jarael, whom Vandrayk helped escape from the notorious slaving ring known as the Crucible. The pair settled in the Lower City of the planet Taris, bringing The Last Resort down in a barren junkyard known as Junk Junction. Parked on top of a disused clothing factory and unregistered with the Galactic Republic, The Last Resort became the home for the two Offshoots for several years, disguised so thoroughly with tents and awnings that most visitors never realized that it was a starship. Always very handy with machines, Vandrayk turned The Last Resort into his own personal junk-hauler and additionally placed booby traps in the massive piles of trash located on the approach to the ship."}, {"tag": "p", "text": "Known to the outside world as \"Camper,\" Vandrayk tinkered with the ship so extensively that by 3964 BBY he had forgotten what he had done to which systems. While Jarael dedicated herself to protect Vandrayk as he aged and his mental faculties diminished, the pair rarely left their home—what few visitors came to The Last Resort were usually criminals, as Vandrayk became known in underworld circles for refitting old escape pods to conceal wanted fugitives. The pair of Offshoots were content with their anonymity, but everything changed for them in 3964 BBY, when the two most wanted men on Taris showed up at The Last Resort: Zayne Carrick, a Jedi Padawan falsely accused of slaying his classmates at Taris' Jedi Tower, and his Snivvian \"accomplice,\" Marn Hierogryph, a self-styled \"crime lord\" who had had dealings with Vandrayk before and wanted his help to ship Carrick off-world. The fugitives' arrival attracted the attention of law enforcement and a group of pursuing Jedi Masters, prompting Vandrayk and Jarael to immediately dash up to the ship's cockpit and take to the skies. The ship had not flown in years and quickly lost power after leaving Taris' atmosphere, but Vandrayk was able to restore power just as Taris patrol craft closed in on the ship. Vandrayk evaded pursuit by flying The Last Resort into the system's asteroid belt."}, {"tag": "h3", "text": "Rescuing Zayne Carrick"}, {"tag": "p", "text": "Although Vandrayk had restored power to the ship and fixed the ship's thruster control, the Offshoot still had a lot of work to do, so the group decided to stay in the asteroid belt overnight and tackle the work in the morning. Noticing that the comm system was still working, Carrick flew The Last Resort clear of the asteroid belt and used it to contact the Jedi Enclave on the planet Dantooine, in the hopes that he would be able to convince Jedi Master Vandar Tokare of his innocence and inform him that it was actually the Taris Jedi Masters who had slain the students. Tokare did not believe Carrick's story, and the conversation was quickly terminated when Jarael knocked out Carrick with her shockstaff."}, {"tag": "p", "text": "With Carrick incapacitated, Jarael brought the ship back into the shelter of the asteroid belt—Carrick's \"stunt,\" as Jarael had called it, had attracted the attention of the Jedi Masters still pursuing them. Carrick still hoped to find out why the massacre had happened, and his search led The Last Resort to the rogue moon, an anomalous planetoid in the Taris asteroid field that was constantly bombarded by meteorites and also the last place Carrick, his classmates, and their Masters had all been together before the killings. Vandrayk dropped off Carrick and Jarael on the promontory where the Jedi had gathered, but with the ship's shields still not functioning, Vandrayk had to pull The Last Resort around to the other side of the moon so that they were not obliterated by asteroids. Carrick and Jarael managed to find the remains of a droid that might have seen what the Masters were doing on the rogue moon, but before they could hail The Last Resort, they were found."}, {"tag": "p", "text": "The Jedi Masters, along with a crew of Taris law enforcement, dropped in off a patrol personnel carrier and cornered Carrick and Jarael against a cliff wall. Before the pursuers could make a move, however, The Last Resort flew in and destroyed the personnel carrier with a single laser blast, giving Carrick and Jarael the opportunity they needed to board the ship and escape with the droid, T1-LB. Although Hierogryph had a clear shot on Carrick's former Master, Lucien Draay, Carrick told him to leave Draay behind and retreat to the asteroid belt. Once The Last Resort was ensconced deep within the debris field, Vandrayk began trying to retrieve T1-LB's memory data in the ship's cargo hold. Vandrayk succeeded in restoring the droid and even gave it the ability to speak, which it previously lacked—in the droid's memory, they found a recording of the Jedi Masters having a vision in which one of their Padawans was going to bring about the demise of the Jedi Order and the Galactic Republic, and their decision to slay their apprentices. The crew of The Last Resort did not have much time to dwell on this revelation, as they soon found themselves caught in a tractor beam from a new, unfamiliar starship. Hierogryph recognized their captor as the Oroko, personal vessel of pirate and bounty hunter Valius Ying, an acquaintance of Hierogryph's. Once The Last Resort was pulled into the Oroko's docking bay, Hierogryph began negotiating with Ying."}, {"tag": "p", "text": "Hierogryph found that the Republic's bounty only covered him and Carrick by name—since The Last Resort was unregistered and the two Offshoots had done such a good job covering their tracks over the years, the Republic did not know who they were. Hierogryph was able to arrange a deal that would allow him and the Offshoots safe passage aboard The Last Resort, which Ying would say was destroyed in the asteroid belt, in exchange for Carrick and the codes to Hierogryph's planetside storehouses. Although Carrick briefly tried to steal The Last Resort and escape himself, he eventually acquiesced and decided that he was going to turn himself in for the good of Vandrayk and Jarael. Surprised by Carrick's selfless act, the group decided to save him. Hierogryph bribed the Oroko's first mate to release The Last Resort in orbit around Taris, and the ship provided covering fire on the Taris Jedi Tower before Jarael swooped in to save Carrick from execution in the nick of time. The Jedi Masters could only watch as the pair escaped to The Last Resort, with Carrick having a final exchange of words with Draay from the ship's boarding dock as The Last Resort pulled away to leave Taris behind for good."}, {"tag": "h3", "text": "Mandalorian subterfuge"}, {"tag": "p", "text": "The Last Resort's next stop was the mining world of Vanquo, as the group had begun to run low on supplies. Knowing that the miners on the frontier world were apprehensive about the approaching Mandalorian warrior clans—who to that point had been at odds with the Republic, although war had not yet fully broken out—the crew of The Last Resort brought the ship down on a hill overlooking a mining camp, and then worked together to simulate a Mandalorian attack and convince the miners to raise ship and leave their supplies behind. The plan worked, but Carrick only had enough time to load a couple pallet-droids' worth of provisions onto The Last Resort before the Mandalorians attacked Vanquo for real. Jarael, who had wielded Carrick's lightsaber as \"Jedi Master Q'Anilia\" during the ruse, was mistaken for the real thing and swiftly captured by the invaders. Unarmed, Carrick, Vandrayk, and Hierogryph could do little to save her—instead, they decided to make for The Last Resort to regroup and find another way to save Jarael. T1-LB charged ahead carrying Vandrayk over his shoulder and, although beset by Mandalorians on its way back to the ship, the group managed to carve a path through the horde with the help of T1-LB's massive strength. Once the group reached the ship, however, one Mandalorian berserker overtook them and beat them aboard, attempting to steal The Last Resort."}, {"tag": "p", "text": "T1-LB grabbed a hold on The Last Resorts boarding dock as the ship flew away, with Hierogryph, Carrick, and Vandrayk clinging to him in turn. With the ship rising above the trees and a group of warriors firing on the ship as it gained elevation, the Mandalorian attempted to raise the boarding dock. T1-LB lifted them into The Last Resort in the nick of time, losing part of his arm in the process—Vandrayk immediately charged the cockpit, attacking the Mandalorian with Jarael's shockstaff and casting him into the cargo bay below. T1-LB then immobilized the Mandalorian after a brief fight, and the intruder was locked into a \"Camper special\" smuggling compartment as Vandrayk launched the ship into hyperspace, following the signal from a locator bracelet that Jarael wore toward Mandalorian Space. After hearing this, the Mandalorian finally spoke up; the would-be ship thief was Rohlan Dyre, the leader of the shock infantry on Vanquo and a \"runner\" who was on his own quest to find the truth behind the Mandalorian conflict with the Republic. Dyre revealed that the Mandalorians were taking Jarael to Flashpoint Station, a captured Republic scientific research station that was currently used to hold captured Jedi for experimentation by Demagol, a Mandalorian scientist who was attempting to discover the source of their Force talents."}, {"tag": "p", "text": "With Jarael a few hours ahead of The Last Resort, Carrick and Hierogryph were left with enough time to come up with a plan to save her. Once the ship reached Flashpoint, Carrick posed as a Jedi prisoner captured by Dyre at Vanquo, while Hierogryph and Vandrayk hid in a \"Camper special\" to avoid detection by a Mandalorian search team. Dyre took Carrick to meet Demagol, attacking the scientist once the three were alone—the unconscious Demagol was stowed in a storage closet while Carrick put on his armor and walked outside with Dyre. As Dyre chatted up the other Mandalorians on duty, Carrick used the Force to surreptitiously attach scavenged Vanquo mining charges, dropped from The Last Resort by T1-LB, to several stolen Republic ships. Once everything was set, Hierogryph, dressed as a Republic Navy officer, messaged Flashpoint Station from The Last Resort's cockpit. Hierogryph set off the charges, destroying several ships and causing great damage to the station's solar shielding, additionally claiming that the Republic had begun installing self-destruct features into all of its vessels should they be captured. The Mandalorians quickly fled, leaving Carrick and Dyre to go back to Demagol's bunker to free Jarael and a number of other captive Jedi. Unbeknownst to everyone else, Demagol overtook Dyre when the latter returned to collect the scientist from the storage closet, incapacitating the shock infantryman and switching places with him. Although the Jedi wanted \"Dyre\" to return with them to Republic space, Jarael had piqued Demagol's interest—he instead sneaked onto The Last Resort as the ship raised up from Flashpoint, hiding in a \"Camper special\" to avoid detection."}, {"tag": "p", "text": "With the madness on Flashpoint behind them, The Last Resort next traveled to the resort banking world of Telerath, in order to retrieve a large sum of money from one of Hierogryph's bank accounts that had been frozen after the Padawan Massacre—Vandrayk and Jarael were hoping to go back to a life of anonymity, and Hierogryph wanted to help them out with some cash. The crew put the ship down in a lot near the resort's music pavilion, and Vandrayk and Jarael ventured forth, with the former disguised as a \"Baron Hyro Margryph,\" hoping that the bankers would believe that the frozen account could be explained away as an error due to the similarity of \"Margryph\" to \"Hierogryph.\" Carrick and Hierogryph stayed behind in The Last Resort's cockpit to monitor the situation, which quickly went awry when the bounty hunting Moomo Brothers kidnapped their banker, a man named Arvan. Carrick and Hierogryph gave chase, discovering that Arvan was actually Arvan Carrick, Zayne's father, and that the Moomos had been hired by Taris Jedi Master Raana Tey to watch Arvan. Carrick and Hierorgyph rescued Arvan from the bounty hunters, bringing the banker back to The Last Resort, where he delivered to them their money."}, {"tag": "h3", "text": "End of the road"}, {"tag": "p", "text": "After getting a fresh infusion of cash from Telerath, Jarael and Vandrayk decided to part ways with the fugitives Carrick and Hierogryph. The Offshoots dropped off their friends at the planet Ralltiir, with Carrick and Hierogryph buying them several crates of supplies as a parting gift, including some desperately needed hyperdrive parts. The Last Resort had already lifted off and jumped to hyperspace before the Offshoots realized that they were in mortal danger—one of the supply crates contained an HK-24 assassin droid, sent by Adascorp to kidnap Vandrayk, which had sneaked aboard. The HK-24 emerged from its hiding place and attacked, and the Offshoots were only saved when \"Rohlan\" revealed himself and shot the droid to pieces."}, {"tag": "p", "text": "Vandrayk's health was failing, however, and Demagol was forced to use his medical skills to treat the aging Offshoot. Although Demagol's treatment helped, Vandrayk's delirium continued, and Jarael decided to look for medical help on nearby Arkania, homeworld of their species. Mindful of Adascorp's presence on the planet, Jarael parked The Last Resort a good distance away from the Perave system before hailing a passing spaceliner to pick her up and take her planetside. However, Adascorp discovered Jarael on Arkania, and corporate head Lord Arkoh Adasca manipulated her into giving him the location of The Last Resort, putting on a friendly face and promising to help Vandrayk. Vandrayk roused from his stupor in time to see Adasca's flagship, the Arkanian Legacy, arrive from hyperspace nearby with a holographic message from Adasca and Jarael—overwhelmed by seeing his companion and protector with his sworn enemy, the old Offshoot immediately passed out again."}, {"tag": "p", "text": "The Last Resort was tractor-beamed by the Arkanian Legacy and placed in the larger ship's starboard landing bay. Vandrayk recovered quickly once aboard the Arkanian Legacy, the cause of his illness revealed to be allergens festering in The Last Resort's long-disused circulation system. Once Vandrayk was restored to health, Adasca used Jarael as collateral to force Vandrayk to complete his exogorth project from decades before—once Vandrayk brought the beasts under Adascorp control, Adasca would be able to auction the beasts' destructive services off to the highest bidder, Republic or Mandalorian, effectively choosing the winner of the war and turning his corporation into a galactic power. With Vandrayk stationed on the exogorths' orbital control station in the Omonoth system, Adasca attempted to deal with the Republic and the Mandalorians, but Zayne Carrick, there as the prisoner of the Republic delegation, freed Jarael and caused a chaotic firefight aboard the Arkanian Legacy. Once Vandrayk received word that Jarael was safe, he used his remote starter to activate The Last Resort and chart a course to the station, while transferring the installation's controls into one of his own devices. Taking control of his ship, Vandrayk first ordered the exogorths to attack Adascorp starfighters and then, after a taunting transmission to Lord Adasca, the Arkanian Legacy itself. With Adasca dead, Vandrayk bade Jarael and Carrick goodbye, taking The Last Resort into Wild Space so he could remove the beasts' implants and allow them to be what nature intended again."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Last Resort was owned and operated by the reclusive Arkanian Offshoot scientist Gorman \"Camper\" Vandrayk, who used the ship as his vehicle, home, and workshop. Although Vandrayk lived in the ship for years, his upkeep of The Last Resort was haphazard—he allowed the vessel to fester in a trash pit for years, which stoked the growth of molds and allergens in The Last Resort's circulation system, and his extensive modifications to the ship briefly rendered it inoperable once it finally lifted off from Taris. Vandrayk was perfectly willing to sacrifice the ship's services as a vessel if it meant that he could have a place to live in peace, and he and his partner, Jarael, disguised the ship so thoroughly that most visitors to The Last Resort on Taris never knew that it was a starship. Jarael served as both protector and sole companion to Vandrayk during those years, and she served as both Vandrayk's co-pilot and as the ship's guardian on Taris. In addition, the fugitives Zayne Carrick and Marn Hierogryph lived on the ship for some weeks during their travels with the Offshoots, with Carrick leaving the loader droid T1-LB behind to help around the ship once they parted."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Last Resort first appeared in Star Wars: Knights of the Old Republic: Commencement, the first story arc of the Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2006. During the ship's appearances in the comic series, The Last Resort was illustrated by five different artists: Brian Ching, Travel Foreman, Dustin Weaver, Harvey Tolibao, and Bong Dazo. Although the ship was referred to alternately as the Last Resort and The Last Resort during its comic appearances, Miller clarified in his notes for Star Wars: Knights of the Old Republic Handbook that he intended for the article to be part of the ship's proper name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}