{"url": "The_Last_of_the_Jedi:_Underworld", "categories": ["Category:Real-world articles", "Category:Star Wars: The Last of the Jedi"], "nodes": [{"tag": "h1", "text": "The Last of the Jedi: Underworld"}, {"tag": "p", "text": "The Last of the Jedi: Underworld is the third in a series of young reader novels that chronicle the adventures of Ferus Olin following Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A disgraced Padawan returns to the captive Jedi Temple on Coruscant to redeem himself. Ferus Olin has heard rumors that the Empire holds imprisoned Jedi within the desecrated building. Olin and his street-kid partner, Trever Flume, must plunge into the depths of Coruscant's dark and dangerous underworld in order to free the Jedi Knights. The lower reaches of the city planet have become a perilous sanctuary from those fleeing the Emperor's wrath, and navigating its alleyways and corridors may be just as dangerous as a foolhardy mission to breach the temple."}, {"tag": "p", "text": "The thrilling new series from The New York Times bestselling author of Jedi Apprentice and Jedi Quest."}, {"tag": "p", "text": "Alternate Book Summary"}, {"tag": "p", "text": "Who are the Last of the Jedi?"}, {"tag": "p", "text": "As a Jedi apprentice, Ferus Olin had to leave the Jedi Temple in disgrace. Now he must return to redeem himself--and save the future of the Jedi Order. The Empire now controls the Temple and everything inside... including, it is rumored, an imprisoned Jedi. Ferus and his street kid partner, Trever, must plunge into the depths of Coruscant in order to free the Jedi, exposing themselves to a dark underworld where both thieves and refugees hide from the Emperor's wrath. Breaking into the temple isn't going to be easy... and surviving the underworld is going to be even harder."}, {"tag": "p", "text": "The thrilling new series from The New York Times bestselling author of Jedi Apprentice and Jedi Quest."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ferus Olin returns to Coruscant with his street kid partner, Trever Flume. He is shocked at what has been done to the Jedi Temple. Ferus has come to the Temple in search of a Jedi, who he believes to be Fy-Tor-Ana. Ferus and Trever sneak into the Temple, and run from stormtroopers in search of the room the missing Jedi is being held in. Ferus finds that Inquisitor Malorum has set up his office inside the former living quarters of Yoda. Ferus then overhears Malorum saying that Darth Vader is coming to the Temple. Ferus also sees that the Empire has taken every single lightsaber and stored them in a room together. He then overhears Vader telling Malorum that he and the Emperor plan to wipe out the lower levels of Coruscant, which he believes are the home of many rebellious people. Ferus, after being seen by Vader, flees the Temple with Trever. Vader does not seem to care."}, {"tag": "p", "text": "Ferus then seeks out the help of Dexter Jettster. He finds that Dex has moved out or been kicked out. Ferus meets a woman who tells him to go to the underlevels. Ferus goes there and finds Dexter living with several people who call themselves the Erased. The Erased are people who lived on Coruscant that became enemies of the Empire. Dexter tells Ferus that he talked to Fy-Tor. Dex tells him that Fy-Tor said to seek out Solace when he needed her. Ferus, Trever, and the rest of the Erased go out in search of Solace, but Dexter stays behind. During their search, the group is attacked by a gang of Coruscanti. During the fight, Trever finds a secret passageway. Later, the group travels down the passageway, and it leads them below the crust of Coruscant. They find a man who calls himself Guide, and he leads them down the passageway further. Ferus and the group then see a bunch of people who have been living down below the crust who have been worshiping Guide. Ferus then realizes that Guide is actually a woman, not a man, and that this woman is Fy-Tor-Ana. Fy-Tor-Ana has deserted her old name and taken on the name of Solace. Ferus then tells Solace about the asteroid that he is gathering Jedi at. Solace refuses to go with him, much to Ferus's shock. Ferus tells her that Vader probably knows Solace is down in the underlevels, and that Malorum and Vader plan to sweep the area completely. This still did not sell Solace. Then Ferus tells her about the lightsabers. Then Solace suggests that they go back to the Temple, finally deciding to go with Ferus. She wants to find out what the Empire plans to do with the Erased and everyone else in the underlevels, and she wants to steal the lightsabers back. She suggests using the new turbolift shaft that was built during the Clone Wars. Ferus, not being a Jedi at that time, did not know about this addition to the Temple. They agree to use this plan. Ferus, Solace, and Trever take off in Solace's makeshift spacecraft en route to the Temple."}, {"tag": "p", "text": "At the Temple, Solace's spacecraft was able to get them through the turbolift shaft. They decided to go to Malorum's office first. They find that Malorum's office has been cleaned out. Trever realizes that the Empire plans to blow the entire Temple up with a version of a sleeper bomb. They all raced through the Temple, trying to get to the core generator to shut the bomb off in time. They encounter attack droids, which they dispose of quickly. Trever finds the Generator and the bomb, and Ferus is able to shut the generator down. When they were sure the bomb would not blow up, Ferus cut it in half and disposed of it. The group then hears the sound of stormtroopers. They see Malorum at the head of the stormtroopers. He screams, \"Find them!\" Then the troopers storm through the halls, some on AT-RTs. The three run back to Solace's ship. When Ferus is sure Solace and Trever are in the ship, he starts to jump in, but then at least 50 stormtroopers appear. Ferus knows that if Solace waits for him, they will all be captured or dead. Ferus tells Trever, \"I'll be back!\" Trever and Solace do not want to leave Ferus there, but Ferus tells Solace that she must get Trever back to safety. Solace agrees and flees in her spacecraft. Ferus is captured by the Imperial forces."}, {"tag": "p", "text": "Ferus is taken to a jail cell, and Malorum enters to interrogate him. Ferus does not reveal the name of the Jedi he met on Bellassa, even though he knows it is Obi-Wan Kenobi. Malorum tells Ferus that he is being deported to a prison planet, and that if he does not reveal the name, he will be executed for crimes against the Empire."}, {"tag": "p", "text": "Solace flies back to her base under the crust. Trever is furious at her for leaving Ferus to die, but Solace assures him that they will go to retrieve him. She tells him that it's not over; they hadn't escaped completely. Solace then hears a scream and a laser shot. They then see a member of the Erased, Keets Freely, run over to them, with blood all over him. He collapses at Trever's feet. Trever realizes that Solace was right; it was not over. He grabs a weapon and readies himself for the fight against the stormtroopers…."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "On page 79, Padmé Amidala is misspelled Padmi Amidala."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Last of the Jedi: Underworld."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}