{"url": "The_Last_Command", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: The Thrawn Trilogy", "Category:The Essential Legends Collection", "Category:1993 releases"], "nodes": [{"tag": "h1", "text": "The Last Command"}, {"tag": "p", "text": "The Last Command is a Star Wars Legends novel written by Timothy Zahn. It is the sequel to Dark Force Rising (1992) and the final volume of Star Wars: The Thrawn Trilogy. It was first published in hardcover by Bantam Spectra on April 1, 1993, and it was later adapted into a comic book miniseries."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Heir to the Empire was a number-one New York Times bestseller and the science-fiction publishing event of the year. Dark Force Rising continued the gripping new adventures of Luke Skywalker, Princess Leia, Han Solo, and the other heroes of the most popular trilogy in movie history. Now the saga concludes with The Last Command, the climactic volume of a three-book cycle authorized by Lucasfilm Ltd. and written by Hugo Award–winning author Timothy Zahn."}, {"tag": "p", "text": "It is five years after the events of Return of the Jedi. The fragile New Republic reels from the attacks of Grand Admiral Thrawn, who has not only rallied the remaining Imperial forces but has driven the rebels back with an abominable new technology: clone soldiers."}, {"tag": "p", "text": "Hopes are dim as Thrawn mounts a final siege against the Republic. While Han and Chewbacca struggle to form a wary alliance of smugglers in a last-ditch attack against the Empire, Leia keeps the Alliance together and prepares for the birth of her Jedi twins. But the Empire has too many ships and too many clones to combat. The Republic's only hope lies in sending a small force, led by Luke, into the very stronghold that houses Thrawn's terrible cloning machines."}, {"tag": "p", "text": "There a final danger awaits. The Dark Jedi C'baoth schemes in his secret fortress, directing the battle against the rebels, nursing his insanity, and building his strength to finish what he had already started—the destruction of Luke Skywalker."}, {"tag": "p", "text": "An odyssey of fast-paced action, stunning revelation, and final confrontation, The Last Command spans a galaxy in flames—a tale that will conclude in this third and last installment as Good and Evil battle \"a long time ago, in a galaxy far, far away....\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After the victory in the Battle for the Katana fleet, Grand Admiral Thrawn puts the next stage of his plan to destroy the New Republic in action. Meanwhile, the insane Dark Jedi Joruus C'baoth is impatient to get Leia Organa Solo, her unborn twins and Luke Skywalker as his apprentices—the reward Thrawn promised him for his help. During the Battle at Ukio, C'baoth senses Organa Solo's presence over Filve and sends the Imperial battle group in pursuit of the Millennium Falcon. Using the Cracken Twist, Han, Leia, and Rogue Squadron escape."}, {"tag": "p", "text": "Meanwhile, Luke is trying to find Thrawn's cloning facilities. On Berchest, he meets with Talon Karrde. Skywalker convinces the information broker to sell information regarding the movements of the Imperial forces to the New Republic."}, {"tag": "p", "text": "At the same time on Coruscant, Mara Jade is recovering from the injuries sustained during the battle for the Katana fleet. During her stay at the Imperial Palace, Winter—Princess Leia's aide—was serving as her hostess. In a brief conversation, Jade identifies Winter as the Targeter—a code name she had used only briefly. This prompts Winter to check Jade's background suspecting she is an Imperial agent."}, {"tag": "p", "text": "At the same time, Luke had tracked the clones to the Inner Rim planet Poderis. The Imperial forces on the planet tried to capture him using Ysalamiri, but the young Jedi detects blank spots created by the creatures and leaps on a roof. Using a piece of cloth to fashion a protective wrapping for his hand, Luke cuts a groove with his lightsaber on the outside of the shield-barrier connected to the roof he was on and sticks his hand in it. Holding the lightsaber in front of him, Skywalker begins his descent by digging out a slanted path for his hand to follow. After going about 100 meters across the wall, he cuts a hole in the shield-barrier and goes back into the city. Reaching the spaceport, Luke gets off Poderis and after a little skirmish with the Chimaera he jumps to hyperspace. When his X-wing's power cells run out of charge, Skywalker decides to replace them on Honoghr, the Noghri homeworld. When he reaches the planet, the Noghri guide him to a place they call The Future of the Noghri. There he meets Khabarakh. While waiting for the power cells to be delivered, Nystao he experiences a vision of Leia and the twins being in danger. While Luke is on Honoghr, during a meeting of the Provisional Council Leia goes in labor. After 10 hours delivery, with Han by her side, she gives birth to Jaina and Jacen Solo."}, {"tag": "p", "text": "In the meanwhile, after an accidental meeting with his fellow smuggler Gillespee, Karrde sets a meeting of the top smugglers on Trogan. The meeting in Whistler's Whirlpool Tapcafe, which was attended by Brasck, Billey, Par'tah, Ellor, Dravis, Mazzic, Lishma, Gillespee, Niles Ferrier and others. The reason why Karrde called them was forming an alliance to find where the clones were being bred. At first, the smugglers want to stay neutral in the war but when the meeting was attacked by the Imperials, resulting in Lishma's death, they decide that the Empire needs to learn a lesson thus the Smugglers' Alliance is born. The attack on the meeting was actually arranged by Ferrier. He was trying to win Karrde's trust so he can betray him to the Grand Admiral. Thrawn, however, wasn't pleased since he didn't want to the smugglers turned against the Empire."}, {"tag": "p", "text": "Back at Coruscant, Leia is enjoying a few days away from politics after the birth of Jaina and Jacen. When Winter reveals her suspicions concerning Mara Jade, the Princess goes to Jade's quarters in the Palace. She directly asks Jade if she was a spy and Jade reveals that she was once the Emperor's Hand—a special agent receiving orders directly from Palpatine. Jade also tells Leia that she is going to kill her brother. After saying that perhaps she is not the one who wants Luke's death, Leia leaves. Frustrated, Jade tries to contact Karrde and finds that the network is down. When her danger sense warns her that she's in danger, Jade finds that the Imperial Palace is infiltrated. Barefoot, she tries to sneak behind the commandos Lando Calrissian, who is on Coruscant trying to convince the New Republic to help his Nomad City after it was almost destroyed by the Empire, he draws a blaster at her thinking she is up to something. With Calrissian's help, she figures out the real target of the Imperials—the Solo twins. Reaching out with the Force Mara warns Leia of the danger. Using her knowledge of the secret passages in the Palace, Jade helps Organa Solo in repelling the kidnapping attempt. The leader of the strike team Major Molo Himron identifies Jade as the Imperial agent who let them into the Palace, thus discrediting her in front of the New Republic leadership. Leia, however, didn't believe him. Organa Solo visits Jade, who is under house arrest, to thank her for her help. Just before leaving the Princess mentions by the way that Thrawn is using clones in his campaign. At the mention of this, Jade remembers a trip with the Emperor to a planet called Wayland where he had stored, among other useful technology, cloning technology. Jade offers to provide the coordinates of the planet and Organa Solo orders her not tell anyone about what she knows. During this conversation, Luke returns to Coruscant. Sensing his sisters shock in the Force following Mara's revelation Luke and Han hurry to meet Leia. Later that night Luke, Leia, Han, Chewbacca, Lando and Winter meet at Leia's office to discuss and decide what to do regarding the information provided by Mara. They decide that Luke, Han, Lando, Chewbacca, Mara, R2-D2 and C-3PO will go to Wayland."}, {"tag": "p", "text": "At the same time, Karrde on board the Wild Karrde is present during an attack on the Bilbringi Shipyards by Mazzic and Ellor. The attack results in the destruction of an almost finished Star Destroyer. The attack itself was the two smugglers' revenge for their friend's death. Just before the beginning of the raid, Karrde counts twenty-two asteroids which the Grand Admiral would later use to attack Coruscant. Unfortunately for the smugglers, the Grand Admiral is present during the attack and recognizes Mazzic and Ellor's styles. While discussing his plans concerning the smugglers, Thrawn is interrupted by the enraged Master C'baoth who had found out that the last kidnapping attempt had failed. He demands to fly to Coruscant to take his Jedi. Thrawn agrees to take him to the Galactic Capital after the special cargo is loaded onboard. C'baoth thinking that Thrawn intends to destroy Coruscant with Organa Solo and the twins still on the planet took control of the crew of the Chimaera. Thrawn manages to calm the insane Jedi down and, with the asteroids onboard, takes off to Coruscant."}, {"tag": "p", "text": "Back on Coruscant, Leia's chosen bodyguards arrive: ten Noghri, including Khabarakh, dressed in disguise as Jawas. The same night Luke and Lando broke Mara out of her quarters. They board the Millennium Falcon and leave for Obroa-skai—the last stop Mara and the Emperor had made before reaching Wayland."}, {"tag": "p", "text": "Later that night, Thrawn's forces attack Coruscant. Prior to the attack, C'baoth demands that he returns to the planet Wayland to wait for his wanted Jedi. Thrawn gives him the Draklor and puts it under General Freja Covell's command. After C'baoth sets off the Imperials launch the attack. Just before withdrawing his forces Thrawn orders the asteroids, which had been equipped with cloaking devices, to be launched. In addition to the twenty-two actual asteroids, Thrawn also stages 265 false launches. As the cloaked asteroids are undetectable to Coruscant's sensors, it is impossible for the New Republic to distinguish an actual asteroid launch from a false one. He lets the New Republic forces to disable one of the asteroids cloaking devices so they can see what's out there and then orders it destroyed. This way the Grand Admiral forces the Coruscanti to use the planetary shields permanently, meaning nothing can get in or out. This would ultimately have Thrawn win by starving his enemies into submission."}, {"tag": "p", "text": "During the attack, Leia helps Mon Mothma and General Garm Bel Iblis to heal the rift opened between them years ago when Bel Iblis had left the Rebellion to fight his own personal war against the Empire. With this cleared out, the general takes command of the defense of the New Republic capital. After the Imperial forces jump out of the system, Mara Jade's absence is discovered but Leia manages to convince Mon Mothma to keep it a secret and pretend that she is still their prisoner. Meanwhile, Ghent, the slicer who had stayed on Coruscant to watch over Mara while she was hospitalized, was able to break the pulse transmitter encrypt code that was used by Delta Source. Using the code Leia, Winter and Bel Iblis try to uncover the identity of Delta. By conducting pre-arranged conversations end relying on Winter's perfect recall, they successfully neutralize Delta Source."}, {"tag": "p", "text": "Meanwhile, Karrde had set a new base in a ancient fortress on the planet Hijarna. The coalition he was trying to build is crumbling thanks to financial problems. Karrde sets a new meeting to discuss the continuation of their operations with the other smugglers if he provides the credits to pay them. Mazzic, however, is captured by the Imperials and is brought before the Grand Admiral. Thrawn, using the flimsiness of the attack on Trogan, sowed doubt in Mazzic's mind that Karrde is behind the attack. Mazzic leaves the Grand Admiral's flagship determined to find out the truth and Ferrier is send to incriminate Karrde."}, {"tag": "p", "text": "Around that time, Mara manages to pinpoint the coordinates to Wayland. Jumping out of hyperspace, she confirms that this is the right planet. Setting down in the forests, the team happens upon a pack of garrals and thus have to hike all the way to Mount Tantiss. After a few hours of hiking, Mara asks Luke about the Emperor's final moments and Luke reveals that he was not the one who killed the Emperor. During the next several days, Luke helps Mara to sharpen up her abilities in the Force preparing her for whats to come when they finally infiltrate Mount Tantiss. The plan is to destroy the cloning facility that Thrawn is using for his military forces. From the Noghri that had followed them, Mara learns of Luke's parentage and the real reason why Palpatine wants him dead—to extract revenge on his murderer. At this moment, she decides that it has to be her reasons for killing Skywalker and not because of her dead Master. At this moment, C'baoth tries to force her under his control but his contact is abruptly ended."}, {"tag": "p", "text": "Meanwhile, the New Republic plans to snatch a crystal gravfield trap from the Empire and use it to clear Coruscant's space. New Republic Intelligence had located one on Bilbringi. To throw the Imperial Intelligence off the real target, the New Republic concentrates ships and personnel in a striking distance of the planet Tangrene where was located another gravfield trap."}, {"tag": "p", "text": "When the smugglers rendezvous at the fortress, Mazzic accuses Karrde of orchestrating the attack on Trogan to make them turn against the Empire. However, on board the Wild Karrde, Ferrier is exposed as the real traitor. After Karrde learns of the New Republic plans, he decides that his Alliance could obtain a gravfield trap and sell it to the New Republic. Falling for the feint set by the Republic, Karrde and his group targets the gravfield trap that is the Republic real objective. When the plans for the operation are made, Karrde goes to Coruscant to get back his second-in-command Mara. Getting in orbit around Coruscant he comms Leia and asks about Mara's arrest. When Leia answers, he insists on knowing why he can't land. Leia tells him about the siege Coruscant is under and the smuggler reveals that the number of asteroids they have destroyed matches the number of asteroids in total, meaning they can lower the shields. When Karrde mentions his time spent in the prison cells of the Chimaera, Leia orders that he is given a permission to land. With the mention of Karrde's rescue, Leia finally figures out how Thrawn is breeding the clones so fast and realizes that her brother's mission is endangered. After she explains that to Bel Iblis, he says that he'll try to convince Mon Mothma to send some ships to help Luke and Han. Knowing that the New Republic lacks the resources for two separate attacks, Leia decides to ask Karrde to take her to Wayland. She meets him at the spaceport and tells him where Mara is. During the conversation Mobvekhar, one of Leia's bodyguards, captures Borsk Fey'lya who is eavesdropping. Fey'lya begs Karrde to take the Princess to Wayland so Mount Tantiss can be destroyed. Sensing the counselor's anxiety, Karrde makes him pay him thus securing the credits to pay his allies. With Leia onboard Wild Karrde sets off for Wayland."}, {"tag": "p", "text": "As Luke's team draws near Mount Tantiss, he finds out that he can't sense the mountain in the Force. At first, Han suggests ending the mission thinking that it is a trap but Luke argues that the ysalamiri have been put there to confine C'baoth. When a group of MyneyrshI approaches them Skywalker asks two of the Noghri to accompany and help them do as much damage as they can. At the same time, a well armed group of Psadans attacks the main entrance. This proves to be a useful diversion. The team infiltrates the mountain through an air intake vent after Artoo deactivates the sensors."}, {"tag": "p", "text": "By that time, Leia and Karrde had arrived on Wayland. Karrde suggests using his pet Vornskrs Sturm and Drang to find Mara."}, {"tag": "p", "text": "Han and the others find the cloning chamber and Mara suggest going to the throne room saying that the Emperor had probably built in a self-destruct mechanism. If such mechanism exists, its controls would be in the throne room. While Luke and Mara make their way to the throne room Han, Lando and Chewie start setting the explosives just in case. After Luke and Mara had left Threepio warns Captain Solo that Artoo had found out where the Imperials keep C'baoth—the throne room itself. Han sends the droid to tell Lando and Chewie and goes after Luke."}, {"tag": "p", "text": "Meanwhile, Thrawn's forces and the New Republic clash in the Battle of Bilbringi. The Smugglers' Alliance ships get caught between the Imperial and New Republic forces. At first, Mazzic decides that Karrde had betrayed them but when they see the alignment of Imperial ships the smugglers figure out that its a trap for the New Republic Navy. After that, they decide to continue according to plan and use the New Republic attack as a diversion. Aves contacts Wedge Antilles and Antilles decides to help the smugglers out of the shipyards. This way, he gets the Rogues in the shipyards."}, {"tag": "p", "text": "Back in the battle in Mount Tantiss, Luke and Mara reach the throne room and face off C'baoth. The Dark Jedi had sent the Imperials from the Draklor, who he had put under his control through the Force, to destroy the ysalamiri in the mountain. Once his connection with the Force is restored, C'baoth attacks Mara with Force lightning. Luke intercepts them on his lightsaber. C'baoth reveals his extra card—a clone of Skywalker made from the hand he had lost at the battle of Bespin. The clone, Luuke, is armed with Skywalker's old lightsaber—the one he had lost at Bespin. While Luke and his clone duel C'baoth is trying to force Mara into serving him. Meanwhile, Han and Leia meet on their way to the throne room. Using the Emperor's private turbolift, Han, Leia, and Karrde reach the throne room in the middle of the duel. When Solo tries to shoot C'baoth, the insane Jedi Master goes berserk. To stop him, Luke suggests staying with him if C'baoth lets the others go. Karrde contacts Lando and tells him that C'baoth is on the loose and Calrissian decides to blow up the entire facility by overloading the power reactors. C'baoth, however, is not content with getting only one Jedi and Luke and the clone resume the duel. Luke leads Luuke into a trap where Mara, using Organa Solo's lightsaber, kills the clone thus fulfilling the Emperor's dying wish to kill Luke Skywalker. C'baoth then tries to bring the entire complex down, but Mara uses the same lightsaber which she used to kill Luuke to end C'baoth's life. The Dark Jedi disappears in a flash of light, just as the late Emperor did back aboard the second Death Star during the Battle of Endor. The explosion had made a huge hole in one of the walls and Karrde orders the Wild Karrde to come and pick them up."}, {"tag": "p", "text": "Back at Bilbringi, Chimaera receives a message from Mount Tantiss' garrison of the attack and that there are Noghri participating in it. Before Pellaeon can finish reading the report Thrawn's bodyguard, Rukh, betrays and kills the Grand Admiral by impaling him with his own dagger saying that this is a revenge for the Galactic Empire betrayal of the Noghri and the devastation of their homeworld. While Thrawn is himself avenged when Rukh is killed moments later, elsewhere aboard the Chimaera, Captain Pellaeon, aware that without the Grand Admiral's tactical brilliance the Imperial forces have effectively lost the battle, orders a withdrawal. With Pellaeon ordering all remaining Imperial forces in the Bilbringi system to retreat the Thrawn campaign is over with a triumph of the New Republic."}, {"tag": "p", "text": "The novel ends as Luke and Mara, back on Coruscant, establish an uneasy friendship. Luke gives Mara the lightsaber that he had retrieved from Wayland. Before Luke goes back to the negotiations between the New Republic and the Smugglers' Alliance, she calls him to wait for her. Together, they leave the Imperial Palace's roof."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}