{"url": "The_Last_of_the_Jedi:_The_Desperate_Mission", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Star Wars: The Last of the Jedi"], "nodes": [{"tag": "h1", "text": "The Last of the Jedi: The Desperate Mission"}, {"tag": "p", "text": "The Last of the Jedi: The Desperate Mission is the first in a series of young reader novels that chronicle the adventures of former Jedi Padawan Ferus Olin after the events of Order 66. The Desperate Mission follows Obi-Wan Kenobi during his exile on Tatooine after Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Empire has risen. The Jedi Order has been destroyed. As far as the Emperor is concerned, the Jedi are all but extinct."}, {"tag": "p", "text": "But on the remote planet of Tatooine, one Jedi Master remains: Obi-Wan Kenobi. Devastated by the loss of his fellow Jedi—and the betrayal of his former apprentice Anakin—Obi-Wan has been left with one last task: to watch over and protect a young child named Luke."}, {"tag": "p", "text": "When Obi-Wan finds out that a former Jedi apprentice has survived, he must make a painful decision: whether to stay on Tatooine or go on one last, desperate mission—right into the heart of the Empire."}, {"tag": "p", "text": "The thrilling new series from The New York Times bestselling author of Jedi Apprentice and Jedi Quest."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Obi-Wan Kenobi has lived for a year on the desolated Tatooine. He remains there to watch over Luke Skywalker; he and his sister, Leia, may be the last hope for the galaxy. One night after fulfilling his duty of watching Luke for the day he stops by a cantina, to see if he can pick up any news worth hearing. He only hears the usual gossip and exaggerations and begins to walk out the door. But at the last second he hears Ferus Olin's name mentioned. Ferus is running from the Empire (whereas Obi-Wan assumed he was dead), and Obi-Wan would love to help him, but is charged to stay and watch Luke. Troubled, he heads outside. He is confronted by Qui-Gon's ghost. After a brief conversation, Obi-Wan is convinced that his Master can watch over Luke long enough for Obi-Wan to help Ferus on the planet Bellassa. He receives a ride from Weasy, the pilot he heard the information from, and starts his desperate mission to find Ferus and revive the Republic."}, {"tag": "p", "text": "His search first leads to Belassa, where Ferus was born. He heads to Olin and Lands, where a nearby tailor named Mariana tells him that the company is shut down and the owners are not there anymore. Obi-Wan leaves and meets a boy in the alley, named Trever Flume. Later a squad of stormtroopers comes patrolling there, and Obi-wan is forced to hop on the nearest gravsled and ride for his life. Unfortunately that gravsled was the one that housed the street kid he met earlier, and forced to take over the vehicle learns that his name is Trever Flume. Eventually, his investigation leads him to the hospital that housed Roan Lands, Olin's partner in business. He eventually finds out where Olin lives and finds him. Soon after, two bounty hunters attack where they are hiding. They are identified as Boba Fett and D'harhan."}, {"tag": "p", "text": "After that, Ferus attempts to save the planet and succeeds, by surrendering himself, with help from Kenobi."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Clone troopers are erroneously written as stormtroopers during the Clone Wars and Battle of Geonosis."}, {"tag": "p", "text": "On the cover, Obi-Wan is holding his lightsaber from Episodes I and II even though the book is set after Episode III. In Episode III, Obi-Wan used his final lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the cover variations of The Last of the Jedi: The Desperate Mission."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}