{"url": "41st_Scout_Battalion", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Grand Army of the Republic battalions"], "nodes": [{"tag": "h1", "text": "41st Scout Battalion"}, {"tag": "p", "text": "The 41st Scout Battalion was an elite infantry and armor battalion within the 41st Elite Corps of the Grand Army of the Republic that participated in the Clone Wars, a pan-galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. In 19 BBY, it was decided that Jedi General Yoda would lead a battalion to support the Wookiees on Kashyyyk. The 41st Scout Battalion was then dispatched to the planet, where they participated in the Battle of Kashyyyk and later the implementation of Order 66, as part of the Great Jedi Purge."}, {"tag": "p", "text": "The battalion was characterized by the green camouflage Phase II ARF armor they wore, and utilized All Terrain Attack Pods, All Terrain Reconnaissance Transports, BARC speeders, HAVw A6 Juggernauts, and Infantry Support Platforms. The battalion was under the command of Jedi General Yoda, as well as Jedi General Luminara Unduli and Clone Commander CC-1004 \"Gree.\""}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 41st Scout Battalion was an elite infantry and armor subunit of the 41st Elite Corps of the Grand Army of the Republic. It was under the command of Jedi General Yoda, Jedi General Luminara Unduli, and Clone Commander CC-1004 \"Gree.\" As a battalion of the Grand Army, it was composed of four companies of 144 troopers each."}, {"tag": "p", "text": "The battalion was composed largely of clone scout troopers in green camouflaged clone trooper armor. The 41st Scout specialized in reconnaissance and warfare over difficult terrain, including overgrown floral locations. As such, members of the unit wore Phase II ARF armor for greater mobility and flexibility. Their helmet featured a sunshield, a wider visor, and its overall shape helped to secure wider vision while traversing jungle-rainforest environments. The battalion also utilized HAVw A6 Juggernauts, All Terrain Attack Pods, Infantry Support Platforms, and BARC speeders. When the battalion was deployed to the planet Kashyyyk, they were transported there via a Venator-class Star Destroyer."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars between the Galactic Republic and the Separatist Alliance following the Battle of Coruscant in 19 BBY, the Jedi High Council settled on sending an attack group to the planet Kashyyyk to reinforce the Wookiee Army against a Separatist invasion. It was decided that the 41st Scout Battalion of the 41st Elite Corps would be dispatched, and shortly after, the corps assembled at a staging area on Coruscant as equipment and vehicles were loaded onto a Venator-class Star Destroyer and Jedi General Yoda arrived to command the battalion."}, {"tag": "p", "text": "The 41st Scout arrived on Kashyyyk and took defensive positions in Kachirho, the capital city of Kashyyyk, and unloaded vehicles and equipment alongside the Kachirho Wookiee Militia. While on Kashyyyk, the battalion was led by Jedi Generals Yoda, Luminara Unduli, and Clone Commander CC-1004 \"Gree.\" Eventually, the Battle of Kashyyyk began and the battalion defended the beachhead against Separatist forces. Members of the battalion positioned themselves on the beach itself as well as city structures and the large trees surrounding the city. During the battle, Supreme Chancellor Palpatine of the Republic, secretly the Dark Lord of the Sith Darth Sidious, initiated the Great Jedi Purge by activating Order 66, a directive that labeled the Jedi as traitors."}, {"tag": "p", "text": "Commander Gree received the message from Palpatine in the command center, and he and another clone trooper moved into position to kill Yoda. Yoda, however, sensed the betrayal of Palpatine and the deaths of his fellow Jedi across the galaxy, and beheaded Gree and the trooper before they could fire their blasters. The two Wookiees beside Yoda, Chewbacca and General Tarfful, then helped Yoda leave the city, failing to stop him from escaping the planet in an escape pod."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 41st Scout Battalion first appeared, albeit unnamed, in the theatrical 2005 Skywalker saga film Star Wars: Episode III Revenge of the Sith. The name of the organization was first revealed to be the 41st Scout Battalion in Star Wars Battlefront II with an update on June 26, 2019, but was first announced in a community transmissions post for the video game on May 23. Like the 41st Ranger Platoon, the 41st Scout Battalion shares the number of its parent unit, the 41st Elite Corps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}