{"url": "The_Land_of_the_Gupins", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "The Land of the Gupins"}, {"tag": "p", "text": "\"The Land of the Gupins\" is the eighth episode of the first season of Ewoks. Written by Bob Carrau and directed by Raymond Jafelice, the episode originally aired on ABC on October 26, 1985."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "After rescuing Mring-Mring and Oobel, Wicket and his friends journey to the Gupin homeland."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Escaping the Reaps' lair"}, {"tag": "p", "text": "The episode opens with Paploo crossing a river and finding three Ewok children including Wicket Warrick, Teebo, and Kneesaa a Jari Kintaka playing with a four-legged beast. Paploo tries to scare the beast but the children laugh, pointing out that it Mring-Mring, the king of the Gupins. Mring-Mring transforms back into his bipedal form. Paploo is upset at being fooled and asks if they think he is a \"lurdo.\" The brown Ewok child says they would never think of that."}, {"tag": "p", "text": "Paploo dares Mring-Mring to transform again. He transforms into a giant bird that deflates like a hot air balloon before crashing into the forest. The Ewoks rush to find Mring-Mring only to discover that he has landed in a Reap's web. Paploo and Wicket rushed into the reap's web to save Mring-Mring only to be trapped by several Reap, which proceed to wrap them with web. Teebo and Kneesaa use a branch to untangle the web, catapulting Mring-Mring, Wicket, and Paploo out of the reaps' lair. Teebo and Kneesaa escape the reaps' lair and rejoin the other Ewoks and the Gupin, who have landed on a bush."}, {"tag": "h3", "text": "A brotherly reunion"}, {"tag": "p", "text": "The group also discover that they have also freed Oobel, the brother of Mring-Mring. The two brothers embrace each other. Mring-Mring introduces Oobel to Teebo, Kneesaa, Wicket and Paploo. Oobel thanks them for their rescue but spirals out of control and crashes to the ground. He tells Mring-Mring and the Ewoks that his flying powers have been failing him lately, causing him to fly into that Reap's nest."}, {"tag": "p", "text": "Mring-Mring tells Oobel that he still has not flown his wings and is an outcast. Oobel implores his brother to come back with him but Mring-Mring believes that he is a failure. Oobel tells Mring-Mring that the renewal ceremony is nearby. When the Ewoks about the renewal ceremony and the Juniper Chest, Oobel explains that the Juniper Chest is the center of Ewok life and holds the energy which allows them to fly and change shape."}, {"tag": "p", "text": "Oobel tries to transform into a bat but loses control. Mring-mring explains that when the chest is open, their Gupin powers are refreshed. Oobel warns that this time there may not be a ceremony since Uncle Mef has succeeded their Father as ruler. However, their cousin Punt has proclaimed himself as King."}, {"tag": "p", "text": "Oobel explains that after Punt assumed the throne, the Gupins came under attack from the Grass Trekkers, who forced their way inside the Gupin fortress. Punt was terrified and gave the Trekkers the key to the Juniper Chest. Oobel says this dooms the Gupins since their powers will be lost if they can't access the Juniper Chest. Oobel fears they will be defenseless and implores Mring-Mring to return."}, {"tag": "p", "text": "Mring-Mring says that he is wingless and is no match for an entire tribe of Grass Trekkers. Oobel reminds him of an ancient Gupin prophecy, which Mring-Mring dismisses as a fairy tale. When Wicket asks about the prophecy, Oobel says that the prophecy claims that one day a Gupin will be able to open the Juniper Chest without the use of the key and that this people will become their greatest King."}, {"tag": "p", "text": "Mring-Mring does not believe in the fairy tale but agrees to come back and retrieve the key. The Ewoks volunteer but Mring-Mring doesn't want them to go. Wicket reminds Mring-Mring that he saved his father Deej Warrick's life and that is good to repay his kindness. Paploo says that Mring-Mring is their friend. Teebo thinks they should consult the elders first."}, {"tag": "h3", "text": "Journey to the Gupin stronghold"}, {"tag": "p", "text": "The Ewoks sail on two canoes down a river which Master Logray says will take them to the grasslands. Kneesaa asks Oobel if he believes in the legend about the Gupin who can unlock the Juniper Chest without a key and become the greatest king. When Paploo asks what if he opens that chest, Mring-Mring says that he can become King of the Gupins. Paploo fancies being king but accidentally drops his oar. Paploo is forced to swim back to retrieve the oar much to the laughter of the other Ewoks."}, {"tag": "p", "text": "Shortly later, the travelers approach a waterfall. The Ewoks and Gupins tried to row backwards but the water current is too strong. Mring-Mring and Oobel save the Ewoks from danger by transforming into giant blankets which ferry the canoes to safety. They land the canoes in a grassy plain inhabited by long-necked grassland beasts."}, {"tag": "p", "text": "Paploo grumbles about traveling through the Endorian grasslands. However, Mring-Mring is impressed by their beauty. Before they can travel farther, they hear the movement of Grass Trekkers. They hide behind a bush and watched the massive beasts lumber by. The Ewoks are alarmed by the massive size of those creatures."}, {"tag": "p", "text": "Teebo uses his whistling skills to summon the help of several insectoid Makants, whom he convinces to help them get to the Gupin stronghold. Teebo invites the Ewoks and Gupin to ride on the Makants. The Makants are able to leap across the plain. They eventually reach a ditch. Across the ditch lies the Gupin stronghold and the Grass Trekker shrine, where the key lies. Mring-Mring, Wicket and Kneesaa travel with their Makant to warn the Gupins while Oobel, Paploo and Teboo head to the Grass Trekker nest to retrieve the key."}, {"tag": "h3", "text": "Retrieving the key"}, {"tag": "p", "text": "Teebo comes up with a plan which involves covering their Makant with grass to disguise him as a Grass Trekker. The disguised Makant, Ewoks, and Oobel  approach the Grass Trekker shrine. Oobel dismounts and distracts the Grass Trekkers guarding the shrine. As several Grass Trekkers converge on him, he leads them on a chase. Oobel and Teebo enter the shrine."}, {"tag": "p", "text": "Meanwhile, Mring-Mring  travels with the other Ewoks on their Makant mount to the Gupin stronghold. Mring-Mring explains that since his Father has died, they have lacked a strong leader. Meanwhile, Oobel and Teebo reach the heart of the nest, where they find the nest at the end of several tunnels."}, {"tag": "p", "text": "Elsewhere, Paploo is surrounded by several Grass Trekkers. However, a horn blows and the Grass Trekkers scatter. Inside the shrine,  Oobel finds the key chained to a stone. He breaks it with a stone and carries Teebo out. They find Paploo outside the shrine. The group realize that the Grass Trekkers are heading to the Gupin fortress. Oobel tells the Ewoks he knows a way that they can pass them unseen."}, {"tag": "p", "text": "They travel through a canyon while the Grass Trekkers advance on the forests. Meanwhile the other Ewoks and Oobel reach the gate of the fortress. After thanking the Makant, Kneesaa tells Mring-Mring that she and Wicket feel that a Gupin hero does exist. Wicket adds that if he can just believe in himself, Mring-Mring will find a way to save his people. Mring-Mring is impressed by their faith in him but doubts that he can live up to their expectations."}, {"tag": "h3", "text": "The renewal ceremony and siege"}, {"tag": "p", "text": "Just the, the Grass Trekkers approach the Gupin stronghold. Mring-Mring calls on the guards to open the doors. Meanwhile, Oobel and the other Ewoks return with the key. The guards refuse to left Mring-Mring in, claiming that Punt the Magnificent has barred all entrance. The guards tell them to leave since the renewal ceremony approaches."}, {"tag": "p", "text": "Kneesaa introduces herself as a Princess and says that she has come to save them from the Grass Trekkers. Mring-Mring adds that they have retrieved the key to the Juniper Chest. The guard orders that the doors be unlocked. The Gupins and Ewoks managed to enter before the Grass Trekkers can enter the fortress. Teebo is impressed by the lush beauty of the Gupin fortress."}, {"tag": "p", "text": "Punt the Magnificent demands the key from Mring-Mring. Mring-Mring hands Punt the key. Punt takes the key and tells Mring-Mring to go away, calling him an outcast. Oobel tells Punt that he was never meant to use the key. Mring-Mring convinced Oobel to calm down, telling him that every Gupin has the right to use the key."}, {"tag": "p", "text": "The Grass Trekkers begin banging on the gate of the stronghold. Paploo convinces the other Ewoks to find logs to reinforce the barricades. Punt the Magnificent climbs the steps to the Juniper Chest, claiming he is the rightful king. As the Grass Trekkers batter the gate, the Ewok add logs to the barricades."}, {"tag": "p", "text": "Punt tries to unlock the Juniper Chest but is unable to unlock the Juniper Chest. With the Grass Trekkers battering on the gate, Oobel urges Mring-Mring to have a goal at unlocking the Chest. While trying to force the key through the lock, Punt drops it, causing it to crash to the ground and shatter. Just then, the Grass Trekkers storm the fortress and begin tearing down tree houses and terrorizing the Gupins."}, {"tag": "h3", "text": "The prophesied king"}, {"tag": "p", "text": "Oobel carries his brother Mring-Mring up to the altar. Mring-Mring decides to try and uses his hand to unlock the Juniper Chest. The Chest opens, renewing Mring-Mring and causing him to sprout wings. The Chest also allows the Gupins to shapeshift into fearsome winged and four legged creatures which expel the Grass Trekkers from the stronghold."}, {"tag": "p", "text": "Wicket comments that the Gupins don't have to worry about the Grass Trekkers anymore. Oobel and the Gupins welcome Mring-Mring as their new leader, telling him that he is a born leader.  Mring-Mring demotes Punt to third-in-command next to Oobel for his greed and ambition. Punt relinquishes his crown to Mring-Mring, who invites the Ewok to celebrate with them. Even Punt joins the celebration"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}