{"url": "Battle_of_Mon_Cala", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Battles of the Clone Wars", "Category:Battles of Dac"], "nodes": [{"tag": "h1", "text": "Battle of Mon Cala"}, {"tag": "p", "text": "The Battle of Mon Cala, also known as the Battle of Mon Calamari or the Attack on Mon Cala, was fought during the Clone Wars on the aquatic world of Mon Cala. The battle was a result of a schism between the Mon Calamari and Quarren species who lived on the planet, as the Quarrens rebelled against the Mon Calamari with the support of the Confederacy of Independent Systems. The Grand Army of the Republic, Jedi Order, and the Gungan Grand Army came to the defense of the Mon Calamari to fight the invading Separatist Droid Army. The Mon Calamari and the Quarren reunified by the battle's end, and the Separatists were repelled."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, the King of Mon Cala, Yos Kolina was found murdered. This left his son, Prince Lee-Char to maintain peaceful coexistence between the Mon Calamari and Quarren. During this time, the Quarren Isolation League under Chieftain Nossor Ri believed that the prince was too young and wanted a Quarren king. During this time, the Separatist Alliance ambassador, Commander Riff Tamson started to stir up the arguments between the Mon Calamari and Quarren. Mon Calamari Guard Captain Gial Ackbar then asked the Republic to send Senator Padmé Amidala and her bodyguard, Jedi General Anakin Skywalker, to help mediate the dispute."}, {"tag": "p", "text": "However, the Quarren refused the Republic's intervention and ended the negotiations. Before leaving, Ri offered his condolences to the young prince on his loss. Amidala, Skywalker and Ackbar then contacted Jedi Council members Yoda and Mace Windu, informing them of the impending civil war between the Mon Cala and Quarren. Windu thus dispatched a regiment of SCUBA trooper under General Kit Fisto and Commander Ahsoka Tano. He also told Ackbar to prepare Mon Cala's military for the fight."}, {"tag": "p", "text": "Mon Cala's senator, Meena Tills then appointed Ackbar as the prince's personal protector, much to his chagrin. Tamson was then contacted by Count Dooku, who dispatched Trident-class assault ships and Aqua droids to bolster the quarren forces. Tamson told Dooku that Ri and the Quarren were with them completely. However, Dooku promised that Mon Cala would be his to control. The Separatist invasion was also advised by Senator Tikkes, a Quarren member of the Separatist Council."}, {"tag": "p", "text": "At Mon Cala city, the prince reassured his people that the Quarren would not attack them."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Battle for Mon Cala city"}, {"tag": "p", "text": "As the battle approached, Skywalker urged Ackbar to take the prince out of the war zone. However, the prince refused to leave his people and joined the troops on the front line, awaiting the Quarren assault. Tamson then led charge of the Quarren and the Aqua droids against the Mon Calamari at the city. The two native armies clashed in the middle of city."}, {"tag": "p", "text": "Republic reinforcements then arrived. Clone Captain Rex, Kit Fisto and Ahsoka Tano then deployed the SCUBA troopers from the gunships along with several OMS Devilfish subs to reinforce the Mon Calamari forces. Tamson tore his through the clones and Mon Calamari. Skywalker then briefly lost his helmet to a pair of Quarren soldiers. Tano then gave him his helmet back. Tano led Prince Lee-Char to safety, only for Aqua Droids to follow them into the tunnels. Tano let go of her sub, allowing it to crash into the Droids. Tamson then smashed through the tunnels attempting to get to the Prince before he was distracted by a group of Mon Calamari soldiers, which he killed shortly after. Amidala called for Skywalker to assist her in helping Senator Tills away from the battle, and told them of their location in the palace."}, {"tag": "p", "text": "Fisto then reported that the Separatist and Quarren forces were returning to their ships, a sign that the Mon Calamari and Republic had won that round. Fisto then noticed the Droids were amassing in the coral, and were most likely preparing for another assault. Unknown to them, Tamson was delivering reinforcements from his home planet in the form of secret weapons that were half-machine and half-monster, the seemingly invincible hydroid Medusas. These hydroids operated similarly to large jellyfish, with tentacles that shocked and killed anyone they touched. Ackbar reminded all forces to not fire until Prince Lee-Char gave the command. Upon firing, they noticed the true invincibility of the hydroids. Separatist and Quarren forces then attacked from the sides, essentially cornering the Mon Calamari forces."}, {"tag": "p", "text": "When asked where they could retreat, Prince Lee-Char said they should not. Ackbar then told the Prince that there was a time to attack and a time to retreat, and this was not a time to be brave. They then decided to retreat to the caves while Fisto held off the enemy. Fisto then allowed his sub to crash into one of the hydroids, causing it to explode. Tamson and Nossor Ri then searched the battle ground for survivors, but had a slight altercation due to Ri's inability to provide backup during the phase of the battle, so Tamson told him that if it was to happen again he would kill him where he stood."}, {"tag": "p", "text": "The Prince decided the best course of action was to attempt to escape in Senator Amidala's ship. While Fisto crates a diversion, the rest of the group stole a few subs to get to the surface faster. Tamson, however, has already set a trap and blew up the Senator's ship. While holding onto the ship's debris to take them to the bottom of the water, the group decided to split up to protect the Prince's whereabouts. Tano and Fisto took Clone Commander Monnk, another Clone, and the Prince while Skywalker took Captain Ackbar and Senators Amidala and Tills."}, {"tag": "h3", "text": "Republic Reinforcements"}, {"tag": "p", "text": "After realizing that clone forces would take too long to be sent as reinforcements for the troubled army on Mon Cala, Jedi Mace Windu, Obi-Wan Kenobi, Yoda, and Saesee Tiin decided they should contact the Gungans of Naboo for assistance. Master Yoda personally contacted them, to which Jar-Jar Binks argued that their longtime ally of Senator Amidala would need their help, which persuaded the Gungan Grand Army to join the fight."}, {"tag": "p", "text": "Skywalker's group then tore down the building which housed the sonar and tracking devices, leading Tamson to order his forces to prepare for an attack. Gungan forces then arrived on a Venator-Class Star Destroyer, turning the tide of the battle in favor of the Republic and Mon Calamari. Tamson ordered all reinforcements to the area where the Prince was, and had the Trident-Class ships create a vortex to disable many of the soldiers. Tamson himself then entered a fight with the Prince, while Tano and Fisto fought off Aqua Droids. Skywalker then worked with Ackbar to sever one of the legs of the Trident ship, causing the vortex to stop. All forces other than Tano and the Prince were captured by Droids and taken prisoner and interrogated to discover the location of the Prince."}, {"tag": "h3", "text": "Final Act"}, {"tag": "p", "text": "Although Senator Ri believed the battle had been won, Count Dooku reminded him that he had entered the war on the side of the Separatists, and Tamson's Karkarodon soldiers arrived, to which Dooku said to proceed as planned. As Skywalker, Fisto, Amidala, and Binks were interrogated under the threat of electrocution by Mon Calamari eels, Lee-Char and Tano snuck into a prison camp to tell the prisoners of the Prince's plan to unite all of the prisoners to revolt against the Separatists. Tamson then revealed to Ri his original plan to become the ruler of Mon Cala. After being captured, Lee-Char plead with Ri to join them against the Separatists, to which he had no response. Tamson announced he had ordered Lee-Char's public execution to take place. During the execution, a Quarren secretly told Captain Ackbar that the Quarren and Ri were with them, and handed him a weapon. The imprisoned Gungans, Mon Calamari, and clones then assembled and revolted, fighting back against their Separatist captors. Prince Lee-Char and Tamson entered single combat, where Tamson revealed he had assassinated the former King. The Prince was able to kill him with one of Tamson's own exploding knives."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath of the battle, Ri and the Quarren recognized and accepted Lee-Char as a strong and rightful ruler of the planet. Prince Lee-Char was then crowned King Lee-Char by Brother Lemcke."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}