{"url": "The_Lost_Stories,_Part_2", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars Adventures (2017) backup stories"], "nodes": [{"tag": "h1", "text": "The Lost Stories, Part 2"}, {"tag": "p", "text": "\"The Lost Stories, Part 2\" is a comic story featuring Emil Graf. The story was written by Cavan Scott, illustrated by David M. Buisán, and published in Star Wars Adventures 31 on March 18, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the Lost Library of Nelgenam, Emil Graf and his crew were under attack from the librarian droids. CR-8R \"Crater\" noted that their programming had been corrupted because of their time locked up in the library. As the droids continued to attack them, this reminded Crater of when librarian monks tossed out their prince for cracking a screen. When the librarian droids heard this, they increased their attack even more."}, {"tag": "p", "text": "But Graf had a plan. He took one of the memory spheres and smashed it in front of the droids. The librarian droids attacked Graf and he ran off.  Crater then took BB-00 \"Boo\" who was still tied to webs from the wreck-weavers. He launched Boo towards the librarian droids who destroyed them when he crashed into them."}, {"tag": "p", "text": "Graf thanked Crater for the help even though Crater felt sorry for the librarian droids. Graf felt defeated and believed it would be better to just go home. But his Kowakian monkey-lizard, Noni had other ideas. She climbed up on of the bookshelves and found a memory crystal at the top. Graf followed her up but Crater was worried about Graf getting hurt, he reassured Crater that he will be fine. Graf tripped and started to fall but was caught by Noni's tail."}, {"tag": "p", "text": "Noni and Graf had a difficult time getting the memory crystal out as Crater tried to help them from the ground. But then Crater and Boo were stunned from behind. They fell to the ground as Graf shouted to them. Then a hooded Tarinna appeared, ready to steal all the stories that Graf possesed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}