{"url": "The_Lost_Commanders", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "The Lost Commanders"}, {"tag": "p", "text": "\"The Lost Commanders\" is the third episode of the second season of the animated television series Star Wars Rebels and the first episode after its premiere TV movie, The Siege of Lothal. It is the eighteenth episode of the series overall."}, {"tag": "p", "text": "After premiering at New York Comic Con on October 8, 2015, it aired on Disney XD on October 14, 2015. The episode features the return of the clone troopers CT-7567 \"Rex,\" CC-3636 \"Wolffe,\" and CC-5576-39 \"Gregor\" from the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ahsoka Tano sends the Ghost crew to Seelos in search of an old friend -- one whose leadership and strategy skills could help the fledgling rebellion. But will this legendary commander be willing to join the fight?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Not long after the destruction of Phoenix Home, the Phoenix Cell, commanded by Commander Jun Sato and Ahsoka Tano, and the Spectres are on the run from the Empire. While the rebels discuss their next move, Ezra Bridger suggests the fleet seek shelter on a remote system. In response, Ahsoka suggests that the rebel crew of the Ghost seek out an old friend, who she describes as a great military commander whose knowledge of the Outer Rim would be invaluable in finding a base."}, {"tag": "p", "text": "Ahsoka gives Sabine and the crew of the Ghost the head of an old tactical droid, and send them to the Seelos system. Before leaving, she firmly tells Kanan Jarrus to trust her friend. When the Ghost drops out of hyperspace at Seelos, the ship's systems are damaged from re-entering realspace. Hera Syndulla stays behind with Chopper to repair the ship, while the rest of the crew searches the planet's surface for Ahsoka's friend aboard the Phantom, the Ghost's auxiliary shuttle."}, {"tag": "p", "text": "Sabine plugs in the tactical droid's head, which quickly detects something, causing it to say \"7-5-6-7\" repeatedly. In the distance, the crew spots a walker and flies towards it. As they approach the heavily-modified AT-TE walker, Kanan is overcome with foreboding. Landing the Phantom and disembarking, the four Spectres meet three old men who emerge from the walker. Kanan recognizes them as clone troopers and ignites his lightsaber, prompting Wolffe to exchange shots with the Jedi with his rifle. Rex immediately breaks up the fight between his comrades and Kanan before things get ugly. Ezra then informs the clones that they had been sent by Ahsoka, whose name Rex recognizes. Rex introduces himself and his comrades Wolffe and Gregor."}, {"tag": "p", "text": "Inside the walker, Ezra tries to convince Rex to join their fight against the Empire. Rex laughingly refuses, stating that his life as a soldier is over. Kanan, who mistrusts the clones due to his experiences during the Great Jedi Purge, wants to acquire intelligence regarding locations for the Rebel fleet to seek shelter and then immediately leave. However, Rex convinces the crew to stay for a while longer. As Wolffe voices his objections to helping the Rebels, Gregor invites the crew of the Ghost to join them in a hunt for joopas as payment for this intelligence."}, {"tag": "p", "text": "Ezra, confused about Kanan's intransigence towards the clones, tries to convince Kanan to trust the clones. Kanan painfully recounts the events of Order 66, when his clone trooper comrades suddenly turned on his master Depa Billaba and himself. Rex overhears the conversation and emphasizes that not all clones executed the order. He assures Kanan that he, Wolffe, and Gregor had already removed their control chips. Later, Kanan contacts Hera and confides his distrust of the clones. Hera reassures Kanan that not all of the clones were bad, and stressed that they saved millions of lives, including hers."}, {"tag": "p", "text": "On board Admiral Konstatine's Star Destroyer Relentless, the Imperial Security Bureau Agent Kallus orders the crew to dispatch a probe droid to investigate a coded transmission originating from the planet Seelos. Despite misgivings about the sanity of the clone source, Kallus still decides to investigate the lead."}, {"tag": "p", "text": "Back on Seelos, Garazeb Orrelios leads the hunt for the elusive joopa with the AT-TE in tow. As the sound of a joopa draws closer, Gregor laughingly reveals that Zeb is the bait, much to the shock of Kanan, Ezra, and Sabine Wren. After the joopa swallows up Zeb, the rebels and the clones work together to save Zeb, and they succeed in killing the joopa. Following the hunt, Kanan demands that Rex honor his side of the bargain and supply the information so that they can leave. However, Rex convinces the rebels to stay for dinner."}, {"tag": "p", "text": "Sabine, intending to download Rex's intel onto a data tape, enters the AT-TE's communications room and discovers that one of the clones contacted the Empire and withheld information about Ahsoka. Everyone, except the already-suspicious Kanan, is shocked by this revelation. Rex confronts Wolffe, who regretfully admits to alerting the Empire and hiding Ahsoka's communications because he wanted to protect his comrades from Imperial persecution for helping the Jedi. As Kanan orders Sabine to contact Hera in orbit to scan for incoming Imperial ships, she discovers an Imperial probe droid in the process of sabotaging the Phantom. The probe droid manages to damage the ship's engines before being destroyed by Rex with a well-aimed blaster shot. Unfortunately, the Phantom was damaged by the probe droid, leaving the rebels stranded on Seelos. As the crew investigates the wreckage of the probe droid, they ponder an imminent attack by the Empire."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}