{"url": "41st_Stormtrooper_Legion", "categories": ["Category:Legends articles", "Category:Grand Army of the Republic corps", "Category:Imperial Army legions"], "nodes": [{"tag": "h1", "text": "41st Stormtrooper Legion"}, {"tag": "p", "text": "The 41st Elite Corps, later redesignated as the 41st Stormtrooper Legion, was a legion of elite clones in the Grand Army of the Republic, composed of many variants of troopers, including AT-RT drivers, clone scout troopers and BARC troopers. Their legion color was alternately gray or marked with green camouflage. The 41st Elite was a division out of the 9th Assault Corps, under command of Jedi General Luminara Unduli and Clone Commander Gree."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though officially designated as the 41st Elite Corps, this battle group led by General Luminara Unduli and Clone Commander CC-1004 was a legion of elite clones from out of the 9th Assault Corps. The 41st Elite specialized in long patrols on alien planets, often operating in primitive and grueling conditions while forging alliances with indigenous populations. Seeing so many alien species even caused CC-1004 to become an expert on species and customs, taking on the name Gree to display his knowledge of obscure galactic species."}, {"tag": "p", "text": "The methodology of the 41st Elite caused the special unit to quickly become known as specialists in hostile terrain warfare, as well as alien recruitment and counter-insurgency experts."}, {"tag": "p", "text": "They maintained a large armory with gray-marked Phase II and camouflaged scout armor for jungle duty. With AT-RT drivers, clone scout troopers and BARC troopers, the 41st Elite Corps pioneered the use of AT-RTs, BARC speeders and Juggernauts, using them for reconnaissance and battles such as the Battle of Kashyyyk—where they worked in conjunction with the 442nd Siege Battalion's Infantry Support Platforms."}, {"tag": "p", "text": "A year into the war, Gree and the 41st Elite participated in the Battle of Dinlo, where they became pinned down by a large number of droid forces. Jedi General Tur-Mukan led a mission to evacuate the legion from Dinlo. The 41st Elite were then granted shore leave on Coruscant, partly as cover for Kal Skirata's black ops missions, and partly as a morale booster."}, {"tag": "p", "text": "One unit of the 41st Elite, Green Company, would see action on board the Republic Cruiser Tranquility when the cruiser came under attack from Separatist forces under the command of Asajj Ventress. At that time, the Tranquility carried the Viceroy of the Trade Federation, Nute Gunray, as prisoner on the ship. Ventress had been sent to either rescue Gunray or silence him, and the ensuing battle caused Green Company to lose eighteen men defending the cruiser."}, {"tag": "p", "text": "Later, Green Company and saw action in the brutal retaking of the planet Geonosis, after intelligence had revealed that Archduke Poggle the Lesser had built a new droid foundry there."}, {"tag": "p", "text": "In 19 BBY, the 41st Elite saw heavy action in the battle of Kashyyyk against the droid invasion force sent to seize the world. There, the clone troopers of the 41st Elite fought alongside Wookiee warriors and a small clique of Jedi to a near standstill against the Confederacy. While most of their men were transferred to Kashyyyk, a detachment of the 41st Elite was sent to assist in the Battle of Utapau."}, {"tag": "p", "text": "When Palpatine initiated Order 66, Commander Gree and his soldiers promptly turned on Yoda, however Yoda sensed their intent and killed Gree and his fellow clone trooper and managed to escape with the help of Chewbacca and Tarfful."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "The 41st was known to utilize AT-RT walkers, BARC speeders, and Infantry Support Platforms for anti-infantry and recon purposes, as well as AT-APs,  for artillery support, AT-TEs, and HAVw A6 Juggernauts as heavy missile platforms/troop transports."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}