{"url": "Battle_of_Mon_Cala/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars", "Category:Battles of Dac"], "nodes": [{"tag": "h1", "text": "Battle of Mon Cala"}, {"tag": "p", "text": "The Battle of Mon Cala, also known as the Second Battle of Mon Calamari, took place in 21 BBY during the Clone Wars, when the Quarren, backed by the Confederacy of Independent Systems, attempted to seize the planet Dac from the Mon Calamari people and the Galactic Republic. The Jedi Order intervened in the conflict, bringing reinforcements from the Grand Army of the Republic and the Gungan Grand Army. However, Separatist commander Riff Tamson proved to be a more formidable opponent than imagined and his quick thinking resulted in the capture of all Republic soldiers except Ahsoka Tano and Prince Lee-Char. However, the Quarren realized that Tamson and Count Dooku were plotting to take Dac only for themselves so they allied with the Republic and routed the Separatists, resulting in Tamson's death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 21 BBY, during the Clone Wars, tensions between the planet Mon Calamari's native people and Quarren inhabitants began to escalate. Although King Yos Kolina, allied with the Galactic Republic, mediated the disputes, General Grievous soon led a Confederate invasion of the Calamari system. The Republic proved unable to repel Grievous's forces during the Mission to Iceberg Three, and the further assassination of Kolina left Mon Calamari–Quarren tensions unchecked. While the Republic dispatched Jedi General Anakin Skywalker and Senator Padmé Amidala to Mon Calamari to settle the conflict, the Separatists sent their own envoy, the Separatist commander Riff Tamson."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "First Wave"}, {"tag": "p", "text": "However, Riff Tamson had already been given a secret task by the Confederacy's Head of State Count Dooku to take control of Dac using the Quarren as proxies. Tamson managed to win many of the Quarren including Chieftain Nossor Ri over to the Separatist cause by promising to crown a Quarren as King of of Mon Cala. In reality, Tamson planned to crown himself as king of Mon Cala seize control of Dac on behalf of the CIS. Following a failed peace conference between the Quarren and Mon Calamari, Tamson, backed by hordes of Quarren warriors and Aqua droids attacked the Mon Cala capital of Coral City."}, {"tag": "p", "text": "Lee Char along with Skywalker and Padmé met Ackbar and a squad of Mon Calamari soldiers fighting the Quarren. Upon seeing the prince, the Mon Calamari warriors' morale was boosted and they pressed on their attack, with help from Ackbar. Meanwhile, Lee-Char, Skywalker, Padmé and a group of Mon Calamari soldiers traveled through a tube in order to ambush the enemy from behind. However, their plan had to be abandoned when a giant portion of the wall broke off from a building and crashed into the tube the group were traveling; alerting the enemy to their plan."}, {"tag": "p", "text": "Riff Tamson, meanwhile, went straight to the front lines, killing Mon Calamari soldiers one by one in his search for Lee-Char. After a while, on the surface, a multitude of LAAT/i containing squads of clone troopers trained for underwater combat led by Jedi Ahsoka Tano, General Kit Fisto and clone commander Monnk while captain Rex stayed aboard a Venator-class Star Destroyer. They were here to reinforce the Mon Calamari. Once they were ready, they proceeded to dive into the water and went head-on into battle. Lee-Char was hiding behind a structure when Ackbar swam to him and encouraged him to fight, especially when the Mon Calamari troops were cheering for him. Padmé went in search of Senator Tills while Skywalker remained behind to counter the threat."}, {"tag": "p", "text": "In the mean time, Tamson spotted Lee-Char and charged straight at him, eluding the prince's blaster shots. Luckily for Lee-Char, Ahsoka intervened and knocked Tamson away, in time for Lee-Char to grab onto Ahsoka's speeder and drive away with Tamson in close pursuit. The Jedi and the prince entered a tunnel while Tamson followed them along the tunnel outside. However, a squad of aqua droids entered the tunnel from the other side in an attempt to cut Ahsoka and Lee-Char off but the Togruta Jedi let go of her speeder, causing it to ram into the aqua droids; destroying them as well as the speeder. Tamson continued to bang his head against the tunnel, hoping to shatter it and get at the prince. He managed to break through the glass, allowing only his head to pass through and emitting a ferocious roar that shook the tunnel. But a squad of Mon Calamari soldiers saw Lee-Char's predicament and swam to his rescue. They succeeded in distracting Tamson at the cost of their lives. After killing the Mon Calamari troops, Tamson swam away."}, {"tag": "p", "text": "Tano and Lee-Char regrouped with the rest of the Republic soldiers including Ackbar, Fisto, Skywalker and Amidala and watched as the enemy retreated into the Mon Calamari court. This baffled the Jedi as the Separatists had sufficient troops to overwhelm them. But they knew that they would attack again and so they readied themselves. Meanwhile on the surface, Separatist warships arrived, dispatching reinforcements in the form of Hydroid Medusa, biologically enhanced jellyfish from Karkaris. They had electrified tentacles that kill upon contact."}, {"tag": "h3", "text": "Second wave"}, {"tag": "p", "text": "As the Jedi predicted, the CIS launched another assault. But they were appalled to see massive Hydroid Medusa emerge from below the Council. Lee-Char had doubts about countering the threat to which Anakin replied that this was going to be tricky."}, {"tag": "p", "text": "Upon Lee-Char's orders, the clones and Mon Calamari soldiers fired at the behemoths. But it was all in vain as the Hydroid Medusa were not affected by it. They then retaliated by swinging their tentacles at the Republic soldiers, killing a clone and two Mon Calamari soldiers in the process. To add to their problems, Tamson, having the same plan Lee-Char had earlier, led a group of aqua droids and ambushed the Republic troops from behind. Unable to counter the threat, the Jedi planned a retreat, a move the others agreed on. This round was won by the CIS."}, {"tag": "p", "text": "Tamson, however noticed that the Quarren did not aid him during the second wave and confronted Nossor Ri about this. He felt that Tamson had everything under control but Tamson responded by angrily grabbing the Quarren's tentacles and threatening to kill him if he disobeyed an order from Tamson or Dooku again."}, {"tag": "p", "text": "Meanwhile, under the caves, Lee-Char began to feel that he failed Mon Calamari but Ackbar and Ahsoka lightened his spirits by telling him that he learned a very valuable lesson: \"learning how to fight another day.\" Meanwhile, Tamson, Ri and Dooku were planning their next attack inside the Mon Calamari capital. Dooku ordered all the slaves captured to be processed, including the women and children much to Ri's concern who from that moment on began to doubt his allegiance with the CIS. During the meeting, Dooku also stated that he was sending reinforcements."}, {"tag": "p", "text": "Back underneath the caves, the Jedi and Mon Calamari troops were in contact with Jedi Council members Yoda and Mace Windu. However, because the Republic were far beneath the sea, the transmission to the Jedi Council wasn't so strong and kept having interference. Kit Fisto inquired if reinforcements were being sent. But before Yoda or Windu could reply, the transmission got cut off. Ackbar speculated that the Jedi would send reinforcements since they knew the state of the battle. Anakin suggested that they all get back onto the ship in the surface and get the prince out of here because the enemy was hunting for them. Although Lee-Char objected, stating he would not leave his people, he finally relented when he realized that he was out of options."}, {"tag": "p", "text": "Back on Coruscant, the Jedi Council members were planning on sending reinforcements but the problem was that it would take days for the Republic to train and outfit a new detachment of Clone troopers for underwater combat. Yoda suggested they look for another race other than clones to which Obi-Wan Kenobi decided Naboo. It was then agreed they they would call on the Gungans for help."}, {"tag": "p", "text": "Back on Dac, the Jedi and the Mon Calamari watched as hordes of enemy troops swam by, taking along with them, prisoners. Kit Fisto then swam up ahead to steal a few aquasleds from a trio of Quarren while silently taking them out, avoiding the other enemies at the same time. He managed to rescue clone commander Monnk in the process. Using the Force, he sent down the mini-subs at the waiting Jedi. Ahsoka, Tills and Lee-Char took the speeder and sped up ahead. Kit Fisto, meanwhile rescued two other clones and they fired upon the approaching Quarren. Fisto managed to procure another speeder and sent it down to the remaining Jedi, Senator and Ackbar."}, {"tag": "p", "text": "All three boarded the speeder and raced up ahead towards the surface. However, Tamson had predicted the move and had already had a bomb pre-installed into the ship. As soon as the Republic and Jedi companions and their Mon Calamari allies were close to the surface, the bomb went off with the debris raining down on them. Any hope that they had of escaping was now lost. With their position known, Quarren troops and aqua droids rushed at them, although the debris crushed a number of them. Using the debris, the group swam to the bottom. Ackbar suggested splitting up as to hide Lee-Char. So Fisto, Tano, and Lee-char went one way, the two senators, Ackbar, and Skywalker went another way. They escaped just as the aqua droids came looking for them."}, {"tag": "p", "text": "Meanwhile, Yoda contacted the Gungan High Council and spoke with Boss Lyonie. Yoda asked for reinforcements to be sent to Dac to aide the Republic soldiers. Although Lyonie was hesitant at first, Jar Jar Binks, who was there and was Amidala's friend immediately dismissed Lyonie's thinking and suggested reinforcements to be sent immediately, believing Amidala would have and has done the same to them. Lyonie agreed and the Gungan Grand Army was sent to Mon Cala aboard a Venator-class Star Destroyer."}, {"tag": "p", "text": "Back on Mon Cala, Lee-Char, Tano, Fisto, Monnk, and another clone hid among some water plants. The group witnessed Mon Calamari slaves being led to slave camps under guard by aqua droids and Quarren soldiers. Kit Fisto informed Lee-Char that this was the future of both the Quarren and Mon Calamari. Lee-Char then devised a plan to let the Mon Calamari slaves know that he was alive in order to rekindle hope among his people. Meanwhile, Skywalker, Amidala, Tills, and Ackbar secretly swam towards the Mon Calamari central planetary scanner mast. They planned to destroy it so the enemy would be oblivious to any Republic reinforcements that might arrive. While Skywalker was crippling the scanner, the other three held off the approaching aqua droids, which were soon reinforced by the hydroid medusa."}, {"tag": "p", "text": "The fall of the scanners alerted Tamson who was told by his aqua droid lieutenant that the scanners were destroyed. Although Nossor Ri added that there was nothing on the scope prior to the attack, Tamson had all soldiers on high alert in case of reinforcements. He then led some Quarren soldiers in his hunt for Prince Lee-Char, leaving Nossor Ri and the aqua droid behind. In another area, Lee-Char acquired a horn and blew into it hard, alerting the slaves and the enemy as well. Lee-Char pleaded for them to have hope and assured them that they wouldn't be slaves for long. He managed to cheer up the slaves but he had to flee several Aqua Droids."}, {"tag": "h4", "text": "Gungan reinforcements"}, {"tag": "p", "text": "Meanwhile, the cruiser carrying the Gungan soldiers arrived at Mon Calamari and the Gungans led by Jar Jar dived into the ocean and reinforced both Lee-Char's and Skywalker's group. The tide had turned and the Republic fought with great power, using boomas to destroy the hydroid medusa. Nossor Ri contacted Tamson and informed him of the situation, suggesting a retreat. But Tamson had other plans. He used Dooku's reinforcements: a group of powerful trident ships. He ordered the tridents to revolve their legs in a circular motion as to create a massive whirlpool, scattering both his enemies and allies. Tamson himself then entered the fray and attempted to kill Lee-Char but Ahsoka and Fisto managed to fend him off."}, {"tag": "p", "text": "While Fisto took on Tamson, Ahsoka escaped with Lee-Char and ran into hiding. Ackbar and Skywalker swam up to one of the trident drills and Skywalker severed one of its legs, causing the massive ship to crash to the bottom. However, amid the distraction, both were surrounded by aqua droids and captured with Padmé, Tills and Jar Jar. Fisto was eventually overwhelmed and captured as well. Ahsoka attempted to boost up his spirit again, but Lee-Char had doubts. They soon moved out because of the advancing enemy troops. Meanwhile, the captured Jedi and senators were taken to Tamson where the senators were shackled to Mon Calamari crab droids while the Jedi were trapped inside separate cages compromising of four electric eel each bound together by shackles. Tamson began interrogating the Jedi about Lee-Char's whereabouts. Skywalker, however refused to tell so Tamson signaled a Quarren to jab the eels with his spear, causing it to discharge electric shocks, shocking both Jedi. Nossor Ri couldn't bring himself to watch so he looked away."}, {"tag": "h3", "text": "Counter-attack"}, {"tag": "p", "text": "Elsewhere, Lee-Char and Ahsoka were hiding from a squad of aqua droids. Ahsoka stated that the Gungans were the last of the Republic's reinforcements so there won't be anymore. Both suddenly ducked down as more guards arrived. There were prisoners among them too. Lee-Char then spoke about how Kolina would have fixed the problem. He said that while Kolina was King, the tensions between the two dominant species of Dac were a bit tense but it was respected. When Tamson arrived however, he turned the Quarren against the Mon Calamari resulting in the war. Hence, Lee-Char decided if the Separatists were to be routed, they would need help from the Quarren as well since together, they would outnumber Tamson's forces. But he needed Ackbar's help to do so, so both Ahsoka and the Prince planned to sneak into the prison camp where Ackbar and the rest of the prisoners were being kept."}, {"tag": "p", "text": "Back in the throne room, Tamson and Nossor Ri contacted Dooku and updated him with the situation. When Dooku stressed the importance of finding Lee-Char and killing him, Ri inquired if all this was necessary since they had already won the battle and could start rebuilding. But Dooku scoffed at the idea and sternly reminded Ri about the bigger war going on outside the planet, a war in which Ri had pledged his allegiance to the CIS. Ri complied but was shocked to learn that Tamson had brought his own forces of the same species to the planet. Pleased, Dooku ordered Tamson to continue their plan before cutting the transmission. Tamson and his soldiers left the room, leaving Ri to think twice about his allegiance to the Separatists before he also left."}, {"tag": "p", "text": "Near the prison camp, Lee-Char and Tano watched as the Republic slaves were being brought to the camp while avoiding an alerted aqua droid. The entryway to the camp was protected by a force field that could kill upon contact. When the slaves were led into the camp, the force field dissipated for a while, giving the duo enough time to sneak into the camp undetected. They ran into the prisoners who were glad to see him alive but had lost hope of winning the war. They were soon joined by Monnk who led them towards Ackbar and Tills. Lee-Char followed but not before assuring the slaves that their time of freedom would arrive very soon."}, {"tag": "p", "text": "Meanwile, Skywalker and Fisto continued to endure the shocks discharged by the eels. Tamson tried asking about Lee-Char again but they refused, so Tamson decided to try other ways to extract the information. He swam over to Padmé and bit her helmet, causing a small crack at its base, forcing water to flow into her helmet and slowly filling it. Knowing that time was critical for the Jedi now, Tamson continued interrogating them."}, {"tag": "h3", "text": "Capture of the prince"}, {"tag": "p", "text": "Back at the prison camp, Lee-Char was reunited with Ackbar and Tills, the former being injured. Lee-Char devised a plan of enlisting the Quarrens help in defeating Tamson. While Ackbar thought deeply over this, an aqua droid spotted Lee-Char and alerted the rest of the guards. Lee-Char planned to find Ri and rally him to join the Republic. Monnk was ready to marshal the remaining clones and Gungans. All of a sudden, aqua droids surrounded the group, chocking a Mon Calamari in the process. They proclaimed Lee-Char under arrest but Lee-Char demanded to see Tamson in person."}, {"tag": "p", "text": "Meanwhile, Tamson began to think that the Jedi really didn't know Lee-Char's whereabouts since Padmé's helmet was already half-full of water. An aqua droid soon contacted him and informed him of the prince and his demand to see Tamson, an order he gladly acknowledged. He ordered Lee-Char to be taken to the throne room where he'll be waiting. But Ri expressed his concern about meeting the prisoner in the throne room to which Tamson finally revealed his true intentions of crowning himself king and enslaving all citizens of Dac, including the Quarrens, much to the horror of Ri."}, {"tag": "p", "text": "When he protested that this was not part of their agreement with Dooku. Tamson laughed, saying that it was his own agreement with Dooku. He proceeded to leave but Skywalker shouted at him to save Padmé since Tamson already had the prince in his custody but he calmly refused and left. Ri, realizing that his allegiance to the CIS was a complete mistake, reluctantly followed Tamson to the throne room. The eels continued to shock Skywalker for some time. Fisto suggested they use the Force to create a bubble for her to breathe from and to expel the water from her helmet. However, another shock from an eel disrupted Skywalker's concentration and his hold on the bubble broke. But Jar Jar had his own plan. He spat some fluid from his mouth right at the crack at Padmé's helmet, preventing the water from entering it."}, {"tag": "p", "text": "Meanwhile, Lee-Char and Tano met Tano and Ri in the throne room where Tamson scheduled his public execution. Although Lee-Char attempted to change Ri's mind of his allegiance, it was in vain. Aqua droids arrived and ferried the captured Jedi and senators to witness the execution of Lee-Char by Karkarodon soldiers."}, {"tag": "h3", "text": "Change of sides"}, {"tag": "p", "text": "Three Karkarodon soldiers circled the cuffed Lee-Char while Tamson announced his execution. However, Ri, realizing that Tamson had gone too far, changed sides and secretly informed the Quarren that they were siding with the Mon Calamari and the Republic. One of the Quarren swam to Ackbar and informed him of Ri's decision before secretly handing him and his soldiers weapons. Tamson then gave the order to execute Lee-Char but Ri quickly swam forward, releasing a swarm of black ink behind his trail and grabbed Lee-Char before the Karkarodons could kill him."}, {"tag": "p", "text": "Ri then gave the signal to attack and all of a sudden, the Quarren turned against the aqua droids. As they freed the prisoners, including the Jedi and the senators, Tamson ordered for the droid reinforcements to arrive. All across the sea, the combined Mon Calamari, Quarren, Gungans, Clone, and Jedi forces battled the aqua droids and managed to take down one Trident ship by breaking its windows, causing water to leak in and short-circuit the battle droid crew and controls. Tamson, angered by the turn of events, killed a couple of the enemy soldiers using explosive knives."}, {"tag": "p", "text": "Finally, he confronted Lee-Char. Lee-Char tackled him but Tamson landed a few punches on him before throwing him across the water but not before Lee-Char grabbed one of his knives. Tamson revealed it was him who killed Lee-Char's father and the prince, angered, threw the knife at him, stabbing him deep in the shoulder. Although Tamson, unable to take the knife out, attempted to take Lee-Char head-on, Lee-Char shot the knife with his spear blaster, causing it to explode and kill Tamson. With the commander annihilated, the battle was won. Prince Lee-Char was then joined by his allies who praised him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the defeat of the Separatist forces, Prince Lee-Char was crowned the 83rd King of Mon Calamari with both the Mon Calamari and the Quarren accepting him as their ruler. Mon Cala remained loyal to the Republic for the duration of the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}