{"url": "The_Lost_One", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "The Lost One"}, {"tag": "p", "text": "\"The Lost One\" is the tenth episode of the Star Wars: The Clone Wars television series' sixth season. It premiered on the German TV network Super RTL on March 1, 2014 and was released in the US and Canada via Netflix on March 7, 2014."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"A Jedi mission finds a lightsaber belonging to the long-dead Master Sifo-Dyas, prompting Yoda, Obi-Wan Kenobi, and Anakin Skywalker to begin an investigation into his decade-old disappearance. This sparks Darth Sidious to order Darth Tyranus to clean up any loose ends that may lead the Jedi to discover the truth of the Sith conspiracy.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the moon of Oba Diah, Plo Koon examines a signal from a ship of a Jedi that was long presumed lost. Through a fierce sandstorm, Plo finds the spaceship and discovers the lightsaber of Sifo-Dyas. Plo communicates his discovery to the Jedi High Council where Yoda confirms the lightsaber to be that of Sifo-Dyas. Mace Windu remarks that Sifo-Dyas was on the council before the Invasion of Naboo, but, because he foresaw a Great Conflict and that the Republic needed to raise an army, his ideas were considered \"too extreme.\" Obi-Wan Kenobi reminds them that, during his chase for Jango Fett, he learned that it was Sifo-Dyas who ordered the creation of the clone troopers on Kamino. Yoda feels that more is going on here and wants to find the truth."}, {"tag": "p", "text": "Jocasta Nu says that Sifo-Dyas had died on Felucia during a diplomatic mission between mutual tribes of Jungle Felucians. The end of the mission was classified by the office of the Supreme Chancellor. While Kenobi and Anakin Skywalker travel to Felucia, Yoda questions Chancellor Palpatine about the file, who claims he has never heard of the Jedi Master and says that the file was handled by his predecessor Finis Valorum, since he was still a Senator at the time. Meanwhile, Darth Sidious chastises Dooku to tie up this \"loose end\" and Force chokes him as a warning."}, {"tag": "p", "text": "Before heading to Valorum, Yoda is told that the Felucians cremated Sifo-Dyas' body and that another Jedi was with him. Valorum explains that Sifo-Dyas was sent to negotiate with the Pykes regarding an underground war. However, the negotiations were postponed as Yoda ordered Sifo-Dyas to intervene in a conflict on Felucia. When asked about the other Jedi, Valorum says only his personal aide, Silman, accompanied Sifo-Dyas."}, {"tag": "p", "text": "Anakin and Obi-Wan travel to Oba Diah to confront the Pyke Syndicate regarding the situation. Lom Pyke reveals that a man named Tyranus had paid them to shoot down the ship and that for insurance, Silman was kept locked away by the Pykes. Having been imprisoned for up to ten years, Silman has lost his mind. He says the Pykes are not to be trusted, but is suddenly killed by Dooku before Silman can reveal who really killed Jedi Master Sifo-Dyas. Anakin and Obi-Wan engage Dooku in combat where Lom reveals that the man called Tyranus is really Count Dooku. Dooku then reveals to Obi Wan that he was telling the truth on Geonosis all along. Dooku kills Lom and duels Anakin for a short time before defeating him and managing to escape. On Coruscant, the Council deduces that Dooku was responsible for the creation of the clone army. Questioning why their enemy created an army for them, Yoda explains that this must really be the work of the Dark Lord of the Sith and that all they can do is \"play his game.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Dialogue from Palpatine and Valorum suggest the episode takes place ten years after the events of The Phantom Menace, though dialogue from Dooku indicates it is set several years after the events of Attack of the Clones, which was also stated in dialogue to be ten years after The Phantom Menace."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}