{"url": "The_Levers_of_Power", "categories": ["Category:Real-world articles", "Category:The Rise of the Empire"], "nodes": [{"tag": "h1", "text": "The Levers of Power"}, {"tag": "p", "text": "\"The Levers of Power\" is a short story by Jason Fry that was published as part of the compilation The Rise of the Empire. The story features Rae Sloane during the Battle of Endor."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As Imperial and Rebel forces clash on and above the Forest Moon of Endor, Admiral Rae Sloane commands from the bridge of the Star Destroyer Vigilance. At a time where the stakes could not be higher, Sloane works to protect the Death Star and ensure Imperial victory, all too aware of the uncertain future for the Empire that may lie in the aftermath of the battle."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "During the Battle of Endor, Admiral Rae Sloane serves at the helm of the Imperial Star Destroyer Vigilance. Recalling the late Commandant Pell Baylo's \"lesson\", Sloane remains stoic and expressionless to avoid unsettling her bridge crew. With the Alliance Fleet accelerating to launch an attack along the line, Sloane ordered Lieutenant Habbel to instruct Sapphire Leader Maus Monare to reposition their TIE fighters in a perimeter defense and to send targeting solutions to the turbolaser crew."}, {"tag": "p", "text": "Sloane resents having to work under the supervision of the Imperial Security Bureau loyalty officer Emarr Ottkreg. To avoid Ottkreg's presence, Sloane discreetly orders her executive officer Nymos Lyle to keep Ottkreg away from her. From the bridge of the Vigilance, Sloane watches the Alliance Fleet charging at the Imperial fleet Death Squadron. Ottkreg questions Sloane's order to assume defense position and advocates advancing and destroying the rebel fleet. However, Sloane counters that it is unnecessary to sacrifice the lives of Imperial pilots and proposes letting the rebels burn themselves out while the second Death Star picks them off one by one. The second Death Star promptly destroys a winged Mon Calamari cruiser."}, {"tag": "p", "text": "When Ottkreg disagrees, Sloane responds that she received direct orders from Admiral Piett, who in turned received them from Emperor Palpatine. With three rebel CR90 corvettes approaching, Sloane instructs Habbel to advise Sapphie Leader to intercept them if they maintain their current course but to await her orders. When Ottkreg questions her decision again, she has controller Springbuck activate the holotank, which displays the battlefield positions. Sloane and her bridge crew also observe that the Alliance ships are not retreating but are attacking the Imperial fleet; with Ottkreg claiming the rebels are making their final stand."}, {"tag": "p", "text": "While Ottkreg is confident in the power of the Death Star, Sloane and Habbel privately regard the superweapon as a grandiose waste of funds. After losing contact with the Endor garrison, Sloane orders her crew to hail them on priority channels. As Imperial fighters and turbolasers battle the rebel ships, Habbel informs Admiral Sloane that indigenes have attacked Imperial forces on Endor. Realizing that their true objective is to protect the second Death Star and the Emperor, Sloane orders Habbel to obtain a full sitrep from the Endor garrison. To her dismay, she learns that the Endor base has lost three bow deflector generators and one dorsal unit but that the shields are still holding."}, {"tag": "p", "text": "As the battle drags on, the Imperial fleet sustains casualties. Sloane loses six of her Sapphire pilots while several Imperial capital ships have been destroyed or heavily damaged. Despite this, the Imperial line is still holding. Sloane orders her crew to prepare for two scenarios. First, a mop-up operation to disable the remaining rebel ships. Second, a pursuit of the nearest concentration of enemy ships should they break off the attack and flee. Sloane receives news from controller Feldstrom that they have lost their reading on the Death Star's deflector shield. Shortly later, the Death Star's shield generator on Endor explodes."}, {"tag": "p", "text": "With Sapphire Leader requesting permission to pursue the rebel starfighters into the second Death Star, Sloane orders them to desist since they are too far behind. Despite Ottkreg's objections, Sloane recalls all TIE fighters. Ottkreg warns that Sloane's career is in danger but she counters that the Empire is in danger. Sloane orders the Vigilance to flank position on the Super Star Destroyer Executor, the flagship of the Imperial Navy. Despite her efforts to safeguard the Executor, a A-wing crashes into the massive warship's bridge, causing it to crash into the second Death Star and explode. Sloane and her crew watch in shock."}, {"tag": "p", "text": "After losing contact with the Emperor, Sloane assumes command as ranking Admiral and orders the surviving captains to recall their TIE fighters and form up on the Vigilance. Ottkreg protests but Feldstrom reports that there are power fluctuations emanating from the second Death Star. Having had enough of Ottkreg's defiance, Sloane shoots him dead with her pistol. With the rebel fleet accelerating away from the Death Star, Sloane orders all Imperial ships to travel to the Annaj system, where she believes the Alliance fleet is heading."}, {"tag": "p", "text": "Shortly later, the second Death Star explodes. While Lyle is downcast, Sloane tells her that they have only lost the battle but not the war. She reminds them that the Empire still exists and that there is a war to fight. She tells her crew that the next battle has begun."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}