{"url": "The_Maker_of_Zoh", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "The Maker of Zoh"}, {"tag": "p", "text": "\"The Maker of Zoh\" is the tenth episode of the first season of the animated television series LEGO Star Wars: The Freemaker Adventures. It is the tenth episode of the series overall. The episode premiered on Disney XD on August 8, 2016."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Freemakers travel to Zoh where they meet the Maker, who teaches Rowan how to build using the Force."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Finding the Maker"}, {"tag": "p", "text": "In Hyperspace, the B1-series battle droid Roger is relieved of the transmitting device, humbly admitting that he did not turn it off by himself. However, he thinks that he is not solely to blame for Naare being able to trail their movements. Knowing that going to Hoth or not will result in Naare finding the Kyber Saber crystals, Rowan decides to seek out the Maker of Zoh, explaining to the others in short detail about the individual. Rowan keys in the coordinates into the ship's computer, prompting Kordi, to tell her younger brother to explain a bit more. Rowan explains that Maz Kanata told him about the Maker. Roger adds that the Maker is a droid myth whispered in repair shops. Zander discovers that Zoh is an uninhabited garbage palace. At Rowan and Kordi's urging, the Freemakers set a course for Zoh."}, {"tag": "p", "text": "In Hoth's orbit, Naare and Graballa wait impatiently aboard the Rancor's Fist for the Freemakers. Graballa is impatient but Naare tells him to be patient. Meanwhile, the Freemakers arrive on Zoh with Kordi remarking that someone had rearranged the junk on that planet into beautiful, double helix structures. Shortly later, they are greeted by several rusted but intact droids led by the pessimistic N-3RO, who is hostile to the visitors. Roger tries to reason with the locals by telling them that his organic companions pose no threat. However, the droids are enraged when they hear about Roger's transmission pack and attempt to disintegrate the visitors apart from Roger. Before hostilities can escalate further, the droids are stopped by Jek-14, the former Sith clone who had switched sides and become an ally of the Jedi and the Rebel Alliance. Jek-14 identifies himself as the Maker of Zoh."}, {"tag": "p", "text": "Jek greets the Freemakers with hospitality and sets mouse droid Fixer to repairing the damage inflicted on N-3RO and the other droids during the scuffle. He allows the Freemakers to pick up junk from the junkyard. Despite Jek's hospitality towards the visitors, N-3RO is hostile towards the Freemakers with the exception of Roger since he is a droid. When Rowan relates his Jedi training and produces his lightsaber, Jek is initially reluctant to help since he had come to Zoh to escape the galaxy's troubles. However, Jek changes his mind when Rowan indirectly mentions Naare and his quest to find the Kyber Saber crystals. He agrees to complete Rowan's Jedi training. Meanwhile, Kordi and Zander decide to stay for a while longer to collect junk. Kordi's utterance of the word \"scrap\" puts N-3RO on his nerves."}, {"tag": "h3", "text": "N-3RO's conspiracy"}, {"tag": "p", "text": "While Graballa confesses to his cousin Jabba via hologram about his quest to retrieve the Kyber crystals, Naare gets a call from the Emperor who is growing impatient about the crystals. Naare tells the Emperor that she has collected six of the Kyber crystals but he is unimpressed. Both Naare and Graballa admit that they are growing frustrated with their superiors. On Zoh, Jek uses his creations to represent the light and dark sides of the Force, with Rowan doing the same to create a table. Elsewhere, N-3RO convinces his companion BL-OX, who is not as intelligent as him, that Jek is being corrupted by the outsiders. He claims that if they are not stopped, the Maker will leave them the second time for scrap. At N-3RO's bidding, BL-OX spread word among the other droids."}, {"tag": "p", "text": "Meanwhile, Zander, Kordi, and Roger were looking for junk but found that most of it was useless. When Roger accidentally toppled a crescent-shaped sculpture made out of scrap, Kordi expressed annoyance at the droid for almost endangering them. Roger retorted that it was only \"almost\" in his defense. Kordi and Zander then sent Roger back to the ship under the pretext of re-calibrating the calibrators. Roger realized that their statement made no sense and quickly deduced that the other Freemakers were trying to ditch him. When he turned round, he realized they had left. At that point, Roger was met by N-3RO who befriended him."}, {"tag": "p", "text": "When N-3RO asked Roger if he had any problems with his owners, Roger explained that they were only angry because he had almost crushed them by accident. Believing N-3RO not to be hostile, he added that the other Freemakers were angry that he had accidentally let the bad guys track them all over the galaxy. Roger also related another occasion where the Freemakers were angry when he burnt dinner by accident. N-3RO told Roger that his human masters did not and never would know how to appreciate droids. In an attempt to win Roger over, N-3RO took the battle droid for an oil bath. During the bath, he offered Roger the chance of staying in paradise with his droid community. N-3RO claimed that the Freemakers would scrap Roger once he had outlived his usefulness; something the droid refused to believed. N-3RO told Roger to stay in the oil bath while he secretly gave BL-OX orders to put the next stage of his plan into action."}, {"tag": "h3", "text": "N-3RO's revolt"}, {"tag": "p", "text": "Meanwhile, Rowan learned how to focus on the Force under the tutelage of Jek-14. Jek told the young apprentice that there would always be distractions but that he had to learn to ignore them. After a few attempts, Rowan managed to form a shape. Elsewhere in the junkyard, Kordi and Zander were exploring a hill when they encountered BL-OX, who claimed that he could lead them to a place where they could salvage better parts. Walking down the hill, BL-OX led the two siblings to place where they could salvage useful scrap. However, they quickly found themselves surrounded by N-3RO and his followers which included B2-series super battle droids and dwarf spider droids. The droids encircled Kordi and Zander while N-3RO ordered his followers to scrap them."}, {"tag": "p", "text": "Elsewhere, Rowan learned from Jek-14 how to use the Force to build objects. Using the Force, Rowan assembled a speeder bike. Jek then assembled his own speeder out of junk and followed Rowan for a race. Meanwhile, N-3RO denounced Zander and Kordi for corrupting the Maker's mind and prepared to crush them with a wrecked TIE fighter. At that point, Rowan and Jek arrived on their speeders. Rowan wanted to show his siblings what he had built. However, the two quickly discovered that N-3RO had gone mad. When Jek chastised N-3RO and ordered him to release Zander and Kordi, N-3RO responded that the intruders had corrupted his mind. N-3RO claimed they were protecting Jek before signalling for more droids to surround Jek and Rowan."}, {"tag": "p", "text": "At Jek's instruction, Rowan used the Force to build a box around his siblings and to turn the box into a winged speeder which took them to safety. However, the winged speeder quickly fell apart and Zander and Kordi fell out into the scrap heap. Rowan uses his new abilities to free his family and fight the droids but he and Jek are quickly overwhelmed by N-3RO and his followers. Believing that the Freemakers had corrupted the Maker, N-3RO ordered his droids to attack Jek and Rowan. The two fought back with their lightsabers. Rowan deflected a blast which struck a generator. Roger, who was drying himself, saw the explosion created by the blast. Meanwhile, Rowan and Jek were overpowered by N-3RO's droid followers."}, {"tag": "h3", "text": "Saved by the enemy of my enemy"}, {"tag": "p", "text": "N-3R0 and his followers bind the Freemakers and Jek-14 in chains. Deeming the Maker irreparable due to the visitors' interference, N-3R0 orders his droids to deactivate the organics by crushing a heavy metal object on top of them. Before they can carry out their \"deactivation\", Roger arrives on the scene and demands to know what is happening. N-3RO attempts to win Roger over to their side and to convince him to cast his former Human masters aside. Instead, Roger rebuffs the rogue droid and reaffirms his loyalty to the Freemakers. He explains that mistakes happen in families but that they love and forgive each other because they are family. When N-3RO demands to know whether he is choosing the humans over his fellow droid brethren, Roger simply states that he is both a droid and a Freemaker before reattaching his transmission pack."}, {"tag": "p", "text": "After some delay, Naare and Graballa arrive in their starships, having received the reactivated device's signal and attack the inhabitants. While Kordi remarks that Roger had brought more \"bad guys\" to fight the other \"bad guys\", Zander complimented Roger for thinking like a Freemaker. Jek-14 uses the Force to ferry his droids to safety while N-3RO attempts to drive the intruders away and is bombed by Graballa's starship Rancor's Fist. Rowan uses the Force to save his family from being crushed by a large boulder. He is then confronted by Naare and the two draw their lightsabers."}, {"tag": "p", "text": "Before Rowan can fight Naare, Jek tells the boy and his family to flee while he fends off the Sith agent Naare. Naare taunts him for being a failed Sith experiment but Jek retorts that it is better to be a failure than a Sith pawn. Eventually, he even succumbs to Naare's use of the Force and is seemingly buried under a pile of scrap and rubble. Meanwhile, the Freemakers escape into space and Rowan uses Roger's transmission pack to tell Naare and Graballa that the Freemakers will not be divided and that they will find the last Kyber crystal. The StarScavenger travels via hyperspace to Hoth and is followed by Naare's Eclipse Fighter and the Rancor's Fist."}, {"tag": "p", "text": "Back on Zoh, BL-0X attaches a restraining bolt to N-3RO, who had survived the assault on Zoh. When N-3RO demands to know what is going on, BL-0X states that the droids should not have listened to him and condemns him for betraying the Maker; whom they believe had perished. BL-0X adds that they will now never find another being like the Maker. In the background, a Force-strengthened arm arises from a nearby pile of debris; confirming that Jek-14 has survived his duel with Naare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}