{"url": "The_Making_of_%22The_Empire_Strikes_Back%22", "categories": ["Category:Real-world articles", "Category:Television documentaries"], "nodes": [{"tag": "h1", "text": "The Making of \"The Empire Strikes Back\""}, {"tag": "p", "text": "The Making of \"The Empire Strikes Back\" is a 1980 documentary on the making of Star Wars: Episode V The Empire Strikes Back created by Michel Parbot for Sygma Television. It saw very limited viewings and was considered mostly lost to the general public for several decades until released by a fan on Youtube in 2018."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "TV listings for the Sci-Fi Channel referenced a documetary titled The Making of the Empire Strikes Back diffused on November 22, 1994, and later dates, but it was identified as being another similar documentary, SPFX: The Empire Strikes Back."}, {"tag": "p", "text": "The documentary was cited on a blog post from Daniel Wallace published on June 22, 2005."}, {"tag": "p", "text": "The elusive documentary came under scrutiny as Star Wars fan Darth Neo reached to other fans on the originaltrilogy.com forum in February 2007. Darth Neo claimed to own a \"third generation copy\" (with supporting screenshots) of Gary Kurtz's own copy, but would not released it to public because of a promise not to do so. His intent was to gather information about it, and to publish it on a website dedicated to Star Wars rare artefacts. According to Jamie Benning (aka Jambe Davdar on originaltrilogy.com), creator of fan-documentaries Star Wars Begins, Building Empire and Returning to Jedi, Stephen J. Sansweet (Lucasfilm Head of Fan Relations at the time) acknowledged the existence of the documentary, and provided further details: it was a production from the United Kingdom, mostly made with a French crew, and probably only aired once; Lucasfilm only had one low-quality copy that was shown at an Australian convention."}, {"tag": "p", "text": "Footage from Parbot's documentary was used in European promotional material, according to Darth Neo. This included Telebingo, a Dutch show presented by Mies Bouwman, and Temps X, a French show. It also seems to share some footage with SPFX: The Empire Strikes Back, as Michel Parbot was credited on the other documentary as a cameraman."}, {"tag": "p", "text": "On January 5, 2012, the French fan website Mintinbox.net published a full dossier, the result of two years of research. The staff was able to obtain a copy of the documentary, and had also promised to their source not to release it, but provided a great number of screenshots nonetheless. More than a year later, Mintinbox announced that they had restored the documentary with the help of Kevin Sempé. They were able to present and show the documentary on Celebration Europe II's Collector Stage, on July 27, 2013."}, {"tag": "p", "text": "On September 29, 2018, Adywan, a member of the originaltrilogy.com forum, announced he acquired a copy of the documentary. He then published the video on Youtube for everyone to see on October 1."}, {"tag": "p", "text": "Some of the footage from the documentary was reused in 2020 in a behind the scenes video celebrating the 40th anniversary of Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}