{"url": "The_Mandalorian", "categories": ["Category:Cite web with invalid archivedate format", "Category:Real-world articles", "Category:Canon live-action television series", "Category:The Mandalorian"], "nodes": [{"tag": "h1", "text": "The Mandalorian"}, {"tag": "p", "text": "The Mandalorian is a live-action Star Wars television series developed by Lucasfilm. The series takes place about five years after the events of Star Wars: Episode VI Return of the Jedi and airs exclusively on the new streaming service by Disney called Disney+ which began on November 12, 2019. Jon Favreau is the writer and executive producer of the series. Directors include Dave Filoni, Deborah Chow, Rick Famuyiwa, Bryce Dallas Howard, and Taika Waititi."}, {"tag": "p", "text": "Season One episodes debuted on Fridays at 08:01 UTC (3:01 AM EST), with the exception of the first and seventh episodes of that season. After the first season's conclusion, an eight-episode behind the scenes series was released starting May 2020, titled Disney Gallery: The Mandalorian. On October 30 2020, the second season premiered on Disney+. Season Two episodes debuted on Fridays at 08:01 UTC (3:01 AM EST)."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "After the stories of Jango and Boba Fett, another warrior emerges in the Star Wars universe. The Mandalorian is set after the fall of the Empire and before the emergence of the First Order. We follow the travels of a lone gunfighter in the outer reaches of the galaxy far from the authority of the New Republic...."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "In 2005, George Lucas began developing a live-action TV series that would explore the criminal underworld of Star Wars. Producer Rick McCallum compared it to Deadwood and The Godfather, and hinted that it would involve bounty hunters. At the 2007 Toy Fair, a poster teased upcoming Star Wars projects, with the TV series represented by a picture of Boba Fett. After 50 scripts were completed, Lucas and McCallum felt that the show would be too expensive to produce with the current technology, and thus decided to put the project on hold. In 2012, Lucas sold Lucasfilm to The Walt Disney Company. Under Disney, a film centered on Boba Fett was reportedly planned to be produced as part of its Anthology Series."}, {"tag": "p", "text": "In September 2017, Lucasfilm head Kathleen Kennedy reached out to Jon Favreau for possible ideas for Disney+, for which the company looked to create original content. He expressed interest in doing something with the Mandalorians, having reflected on some concepts he had developed when he first heard that Disney gained control of the franchiose. In November, Favreu met with Kennedy and Carrie Beck to pitch his idea for the show. At the meeting, Kennedy told him that Dave Filoni was also interested in telling stories about Mandalorians. (Filoni had also talked with Kennedy about wanting to work in live-action; She then sent him visit the sets of some of the contemporary Star Wars films to study the productions.) Favreau was familiar with Filoni, having voiced the Mandolorian character Pre Vizla on Star Wars: The Clone Wars. A few days later, the three of them met again, this time accompanied by Filoni and Christopher Yost. A new TV series was announced by Disney CEO Robert Iger during a Disney quarterly earnings call on November 9, 2017."}, {"tag": "p", "text": "On May 10, 2018, in an interview with Anthony Carboni on the premier for Solo: A Star Wars Story, Favreau revealed that he was halfway done with writing a season of the upcoming live-action Star Wars series. As producer Kennedy recalled: \"I'd been talking to him, off and on, for a few years. He had this story, and suddenly the two of us realized, not only could this be told in the television space, but we could also push technology.” During an interview with Dan Casey of Nerdist at the premiere, Favreau confirmed the show would take place seven years after the Battle of Yavin and feature all-new characters. Favreau also revealed that even before he had the job, he had written four scripts to show Lucasfilm what the show would be and to ensure that his vision made it to the screen. As writing continued, he had many discussions with co-executive producer Filoni, who would give him feedback based on his experience working directly with George Lucas on The Clone Wars. Filoni would make sketches of Favreu's ideas, which would be given to the department. Reflecting on the writing process, Favreau told GQ Middle East, \"One thing [George Lucas] said to me was, 'remember, Jon, the real audience for all stories and all myths is the kids that are coming of age', because he's really a Joseph Campbell adherent.\" He also made a conscious effort to appeal to all types of Star Wars fans, telling Entertainment Weekly: \"Part of what's fun is to see if we could merge the worlds of the original trilogy, the prequels, the sequels, The Clone Wars, and what's been considered canon up to this point and what's been considered part of Legends.\""}, {"tag": "p", "text": "On August 6, 2018, The New York Times reported that Favreau's Star Wars series, which would be produced for Disney's new streaming service, was expected to cost around $100 million for 10 episodes. In an email to The New York Times, Favreau stated that the service would allow for the opportunity to tell stories that go for several chapters. On October 26, 2018, it was reported that the rumored Boba Fett film had been scrapped, with Lucasfilm instead focusing on The Mandalorian. On November 13, 2018, Pedro Pascal was reported to be in negotiations to play the lead role in the series. The next day, Gina Carano was announced to have joined the cast according to Variety. On November 30, Variety again reported that Nick Nolte had been added to the show's cast. On December 12, Lucasfilm officially announced the cast, confirming the casting of Pascal, Carano, and Nolte, along with Giancarlo Esposito, Emily Swallow, Carl Weathers, Omid Abtahi, and Werner Herzog."}, {"tag": "h3", "text": "Production"}, {"tag": "p", "text": "The series is mostly filmed on soundstages in Los Angeles, with occasional plate photography in various international locations. At the suggestion of Rob Bredow, it uses a new technology known as \"Stagecraft,\" with special effects that utilize a video game engine developed by Epic Games. ILM also opened a new London-based division, ILM TV, to work on The Mandalorian and other projects."}, {"tag": "p", "text": "Favreau described his role as showrunner: \"It's a lot like being a chef. You write the menu, you staff up with people who are great at what they do, you oversee and help guide the people who are actually cooking the food, working the line, and then at the end, you plate.\" He compared his work on the series to that of Iron Man (in that the release of the former would mark the launch of Disney+, whereas the latter marked the launch of the Marvel Cinematic Universe), noting that he didn't feel much pressure on either project. Director Bryce Dallas Howard described the production process as highly collaborative, with all the directors sharing an office, and the producers always open to ideas from the directors. During production, Favreau shared photos on his Instagram account. George Lucas visited the set during production as part of a birthday surprise for Favreau. While filming at a studio in Manhattan Beach, California, equipment was stolen from the set, prompting a police investigation."}, {"tag": "p", "text": "The first season wrapped filming in February 2019. Each episode of the season reportedly cost 15 million to make. Robert Iger viewed each Season One episode multiple times to give notes and track the show's progress. Members of the Star Wars costuming fan organization the 501st Legion also participated as extras since the producers did not have enough stormtrooper costumes."}, {"tag": "p", "text": "On April 2, 2019, a second season for The Mandalorian was reportedly ordered by Lucasfilm. When interviewed by Collider about his live-action remake of The Lion King, Favreau commented that he was writing the second season and that pre-production was underway."}, {"tag": "p", "text": "On April 21, 2020, Variety announced that a third season for The Mandalorian was reportedly in the works by Lucasfilm."}, {"tag": "h3", "text": "Music"}, {"tag": "p", "text": "On December 19, 2018, Ludwig Göransson was announced to be composing the music for the show. Göransson had previously composed the music for director Ryan Coogler's Black Panther; Favreau met him through Coogler, and discussed the project a year before production began on The Mandalorian. As Favreau told the Los Angeles Times, he wanted the music to be \"a little grittier, a little edgier and a little more tech-oriented, something that felt half-tech, half-classic.\" Göransson took his initial inspiration from a nature hike, going for an \"organic\" sound that made heavy use of woodwinds, combined with electronic instruments and orchestral music. The first season's soundtrack will be released in a limited 8-LP set, produced exclusively by mondoshop.com."}, {"tag": "p", "text": "Göransson also wrote the music for the second season of the show  The soundtrack of the second season is expected to release in November 2020."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "Favreau, Filoni, and most of the cast hosted a panel at Celebration Chicago on April 14, 2019, where the first footage premiered exclusively to fans in attendance. A few days later, the cast appeared on Good Morning America. On August 23, 2019, The Mandalorian's first trailer was released at the D23 Expo in Anaheim at a panel consisting of Favreau, Filoni, and cast members Pascal, Carano, Weathers, Waititi, and Ming-Na Wen. The show was the cover story for the September 2019 issue of Entertainment Weekly. On October 19, as part of their press day for Disney+, Disney showcased 27 minutes of footage for members of the press. A second and final trailer was released on October 28, 2019. The series debuted on November 12, 2019. On November 13, a premier was held at Hollywood's El Capitan Theater. Three episodes were screened at the event, and the cast and crew participated in a Q&A livestream."}, {"tag": "p", "text": "Following the success of the first season, Disney CEO Bob Iger revealed on February 4, 2020 that the second season would premiere on Disney+ in October 2020. He also suggested that characters may be introduced to the show that will receive their own spin-offs. According to Alan Horn, the CCO of The Walt Disney Company, if the series proves to be a success, there's the possibility of a film adaptation for either Disney+ or a theatrical release. On September 2, 2020, it was announced that the second season for the show would be releasing on October 30, 2020. The show was featured in the October 2020 issue of Entertainment Weekly."}, {"tag": "h3", "text": "Merchandise and tie-ins"}, {"tag": "p", "text": "The Mandalorian's merchandise line debuted as part of Triple Force Friday, which was held on October 4, 2019. An 8-episode series, Disney Gallery: The Mandalorian, premiered on May 4, 2020. It focuses on behind-the-scenes aspects of The Mandalorian. A Mandalorian publishing program began in fall 2020. On September 21, 2020, Lucasfilm announced the \"Mando Mondays\" marketing campaign, in which new Mandalorian merchandise would become available each Monday, beginning on October 26 through December 21. Elements from the show were incorporated into various video games, including Star Wars: Galaxy of Heroes, Minecraft Star Wars,, Fortnite, and The Sims 4."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "The series was one of the most-watched series of 2019. In July 2020, the first season was nominated for 15 Emmy Awards, including Outstanding Drama Series. That September, it ended up winning 7 of the nominations. In February 2021, the second season was nominated for a Golden Globe for \"Best Television Series (Drama)\"."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Seasons"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}