{"url": "The_Matter_of_Using_Toydarian_Territory_to_Aid_the_Shipment_of_Relief_Supplies_to_the_Citizens_of_Ryloth/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Stub", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "The Matter of Using Toydarian Territory to Aid the Shipment of Relief Supplies to the Citizens of Ryloth"}, {"tag": "p", "text": "The Matter of Using Toydarian Territory to Aid the Shipment of Relief Supplies to the Citizens of Ryloth was a diplomatic contention initiated when Senator Bail Organa and Representative Jar Jar Binks attempted to persuade King Katuunko and his Ministers to allow Toydaria to be used as a staging ground for sending aid to the starving troops and Twi'lek civilians on Ryloth. The Confederacy of Independent Systems intervened on the matter of their neutrality, sending Senator Lott Dod of the Trade Federation to persuade the Toydarian government to stay out of the war. After much debate, King Katuunko decided to send supplies to Ryloth, as long as the Separatists did not find out. The supplies reached the battle-torn planet successfully, and caused Katuunko to reconsider Toydaria's position in the war."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "On the Outer Rim Territories world of Ryloth, the forces of the Confederacy of Independent Systems was locked in combat against the Galactic Republic to stop the droid invasion of the Twi'lek's world. Jedi Master Ima-Gun Di and Captain Keeli led a campaign on the surface, allied with the Twi'lek freedom fighters lead by General Cham Syndulla. Up in space, Admiral Dao lead the Republic Navy against the Separatist fleet. However, both Dao and General Di ran out of food, medical supplies, and ammunition after fighting without any reinforcements. Dao's ships were all destroyed, but were fortunate enough to contact the Jedi High Council on Coruscant to send word of assistance. Grand Master Yoda and Masters Mace Windu and Obi-Wan Kenobi received the message, and in response asked Alderaanian Senator Bail Prestor Organa, who had just ran a successful supply mission on the Tantive IV to Toydaria to negotiate a supply base with their government. The Jedi also sent Gungan Representative Jar Jar Binks to assist Organa. However, the Confederacy of Independent Systems intercepted details of the plans and Count Dooku dispatched Trade Federation Senator Lott Dod to prevent any deal from being taken place."}, {"tag": "h2", "text": "The debate"}, {"tag": "p", "text": "After arriving on Toydaria, Organa and Binks faced the Toydarian royal guard, who denied them to leave the area as they were \"off-worlders\". Despite this, the Senator's were able to speak with the King and his minsters. However, shortly after their arrival, Lott Dod intervened in the negotiations right when Katuunko and the ministers were convinced to aid Ryloth. Dod pointed out that they would not be aiding civilians but soldiers, which went against there neutrality and such an action would anger the Separatist Parliament and cause damage to the Trade Federation which would mean they would have to pull out of important contracts with Toydaria."}, {"tag": "p", "text": "Although the request for aid was denied Katuunko decided that he would allow Bail Organa to send what supplies they had with them to Ryloth so long as the Federation was not to find out. However, the king unofficially expressed his interests in having his planet join the Galactic Republic to the Republic diplomats."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Organa and Binks would tell the news of Toydaria's reconsideration to the Jedi Council, who later sent Jedi Master Yoda to negotiate with Katuunko. The supplies sent to Ryloth breached the blockade of the planet, saving the citizen's live before starvation and low medically supplies could kill off most, despite Jedi Master Di's death. This would allow the Republic to start planning their liberation of the planet, which almost failed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}