{"url": "The_Making_of_The_Empire_Strikes_Back", "categories": ["Category:Real-world articles", "Category:Making of books"], "nodes": [{"tag": "h1", "text": "The Making of The Empire Strikes Back"}, {"tag": "p", "text": "The Making of The Empire Strikes Back is a book by J. W. Rinzler that chronicles the production of Star Wars: Episode V The Empire Strikes Back. It includes a foreword by Ridley Scott, director of Alien, Blade Runner and Gladiator. Released by Del Rey on October 12, 2010, this book celebrates the film's 30th anniversary and includes a large amount of never-before-seen material."}, {"tag": "p", "text": "On October 22, 2013, it was released in enhanced eBook edition, with bonus artwork and pictures that did not come in the print edition."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Internal flap"}, {"tag": "p", "text": "In this lavish thirtieth-anniversary tribute to the blockbuster film StarWars: Episode V The Empire Strikes Back, New York Times bestselling author J. W. Rinzler draws back the curtain to reveal the intense drama and magnificent wizardry behind the hit movie—without doubt the fan favorite of the Star Wars saga."}, {"tag": "p", "text": "Following his The Making of Star Wars, the author has once again made use of his unlimited access to the Lucasfilm Archives and its hidden treasures of previously unpublished interviews, photos, artwork, and production mementos. The result is a comprehensive behind-the-scenes, up-close-and-personal look at the trials and triumphs, risks and close calls, inspiration, perspiration, and imagination that went into every facet of this cinematic masterpiece. Here's the inside scoop on:"}, {"tag": "p", "text": "In addition, of course, are rare on-the-scene interviews with all the major players: actors Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, Peter Mayhew, and David Prowse; director Irvin Kershner; producer Gary Kurtz; effects specialists Richard Edlund, Dennis Muren, Ken Ralston, and Phil Tippett; composer John Williams; and many others. Punctuating the epic account is a bounty of drawings, storyboards, and paintings by Ralph McQuarrie, Joe Johnston, and Ivor Beddoes, along with classic and rare production photos. An added bonus is a Foreword by acclaimed director Ridley Scott."}, {"tag": "p", "text": "The Making of Star Wars: The Empire Strikes Back is a fittingly glorious celebration of an undisputed space-fantasy moviemilestone. Search your feelings, you know it to be true."}, {"tag": "p", "text": "J. W. RINZLER, executive editor at Lucasfilm Ltd., is the author of the New York Times bestseller The Making of Star Wars, as well as the London Times bestseller The Complete Making of Indiana Jones. Rinzler lives in Petaluma, California."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}