{"url": "The_Meadow_Picnic", "categories": ["Category:Real-world articles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "The Meadow Picnic"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"The Meadow Picnic\" is a theatrical motif written by John Williams for the score for the 2002 film Star Wars: Episode II Attack of the Clones and its respective soundtrack. The theme is used to represent Jedi Padawan Anakin Skywalker and Senator Padmé Amidala's picnic on the planet Naboo. The motif was performed by the London Symphony Orchestra. The theme is in the key of C major, has a tempo of 50 bpm, and has a time signature of 6/8. In total, the piece lasts four minutes and fourteen seconds."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "John Williams wrote the musical score for the 2002 film Star Wars: Episode II Attack of the Clones, as had been the case for the four previous Star Wars films. He used the London Symphony Orchestra and London Voices to perform the music. Only the orchestra was used for \"The Meadow Picnic\", the motif used to represent the romantic picnic Anakin Skywalker and Padmé Amidala had on the planet of Naboo. The Attack of the Clones soundtrack was released on CD April 23, 2002 and as an MP3 download on May 16, 2002."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "The motif starts off with slow, legato phrase by the violins, harp, and wind chimes, which is followed by a similar phrase played by the oboe. The flute then comes in with the theme's most prevalent melody. This is accented by short harp notes and chordal notes from the low strings. The melody is then repeated by the oboe."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The motif makes two appearances in the Star Wars Episode II: Attack of the Clones soundtrack. It is first featured at the beginning of the sixth track \"Anakin and Padmé\". The theme's main appearance is in it's own self-titled number eight track."}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "The piece appears only in Star Wars: Episode II Attack of the Clones. It makes two appearances in the film, one during the picnic on Naboo.."}, {"tag": "h3", "text": "In other merchandise"}, {"tag": "p", "text": "The theme's sheet music appears in the Attack of the Clones music book from Bantha Music. The book was released for the following instruments and editions: trumpet, piano, easy piano, clarinet, tenor sax, and alto sax. It was also featured in the Star Wars Episodes I, II & III Instrumental Solos music book which was released for the following instruments and ensembles: piano and easy piano."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}