{"url": "The_Menagerie", "categories": ["Category:Legends articles", "Category:Outer Rim Territories organizations", "Category:Sith states and governments"], "nodes": [{"tag": "h1", "text": "The Menagerie"}, {"tag": "p", "text": "The Menagerie was a Sith state that was located in the Grumani sector during the Republic Dark Age. It was led by the technology-hater Sith Lord Malakite, a member of a powerful Sith dynasty known as the Calimondra family. During the Second Charge Matrica, the Menagerie world of Skarpos was attacked and occupied by the rival Sith Lord Odion, who ruled the Odionate. Lord Malakite then assembled a force to retake Skarpos. During the Second Battle of Skarpos, the armies of the Menagerie, the Odionate, and the Daimanate were destroyed by an ancient Sith weapon known as the Helm of Ieldis, which was capable of driving sentient beings into a homicidal frenzy. Following the events on Skarpos, Lord Malakite's forces joined forces with the other Sith warlords in an attempt to defeat Lord Odion, who wanted to use the Helm to destroy the galaxy."}, {"tag": "h2", "text": "Politics and society"}, {"tag": "p", "text": "Like the other Sith fiefdoms that dominated the Grumani sector during the Republic Dark Age, the Menagerie was governed according to the personal beliefs and ideology of its ruling Sith Lord, in this case Lord Malakite. The technology-hating Lord Malakite gained a \"perverted\" reputation throughout Sith Space for using Sith alchemy to transform sentient beings and animals into vicious red-skinned Sithspawn known as \"Mutates\" who were used to fill the ranks of his armed forces. These creatures were the leftovers of centuries of Sith experimentation and had been reduced into vicious minions who only existed to served their Sith Lord's bidding. Malakite's military forces included \"Mutates\", winged Menagerie dragons, Night-Soarers, and a fleet of military starships. Since the Sith Lord eschewed modern technology in favor of pre-modern weapons and claws, Malakite devised a tactic of using overwhelming numbers to swarm opponents with superior technology. Besides fighting the Galactic Republic and the Jedi Order, Malakite also fought constant battles with other Sith warlords like Odion and Ayanos Bactra. Due to a high attrition rate, Lord Malakite was forced to implement a large-scale breeding program."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Menagerie was one of the break-away Sith states that was formed from the collapse of the Chagras Hegemony in 1040 BBY. Under the reign of Lord Malakite, the Menagerie gained a reputation as a breeding ground for vicious Sithspawn and monsters. In 1032 BBY, the Menagerie joined forces with the Odionate, the Daimanate, and the Sith Lord Lioko in invading and dividing up the Bactranate, a Sith fiefdom ruled by the Quermian Sith Lord Ayanos Bactra. Lord Malakite had responded to a request by the Calimondra family's ruling matriarch, Vilia Calimondra, who believed that Lord Bactra had outlived his usefulness to the Sith dynasty. Lord Malakite's territorial gains in the former Bactranate were formally recognized during a bequest convened by Vilia Calimondra."}, {"tag": "p", "text": "In 1032 BBY, the Sith Lord Odion's forces invaded and expelled the Menagerie from Skarpos, a barren desert world. Odion was looking for the Helm of Ieldis, an ancient Sith artifact capable of driving sentient beings into a homicidal frenzy. Unknown to Odion, the Jedi Knight errant Kerra Holt had infiltrated the ranks of his forces. Shortly later, Lord Malakite returned with an army to retake Skarpos. Malakite was followed by Odion's younger, the Sith Lord Daiman, who wanted to take the Helm for himself. During the ensuing three-way battle, Odion used the Helm to drive the three armies into a homicidal frenzy. Following the events on Skarpos, the Menagerie, at the urging of Vilia Calimondra, joined forces with the other Sith fiefdoms to stop Lord Odion's attempt to use the Helm to destroy the entire galaxy. Ultimately, Lord Odion was defeated by the Jedi Kerra and his second-in-command Beld Yulan."}, {"tag": "h2", "text": "Territories"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}