{"url": "The_Most_Honourable_Guild_of_Armourers", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Commerce and labor guilds and unions"], "nodes": [{"tag": "h1", "text": "The Most Honourable Guild of Armourers"}, {"tag": "p", "text": "The Most Honourable Guild of Armourers, or Armorer's Guild, was an association that gathered together the best weapons specialists in the galaxy. Procuring and selling a vast array of weaponry, the Guild became unparalleled in its field during the Imperial era. Given the patronage of bounty hunters such as Boba Fett, Imperial officers such as Abran Balfour, and noblemen such as Imal Valesovich, the Guild boasted a wealth of supplies and resources, and was even able to purchase a whole planet for itself, that of Epsi Nadir."}, {"tag": "p", "text": "Though upper class and exceptionally expensive, the Most Honourable Guild of Armourers stocked all kinds of weaponry, from standard issue blasters to ancient swords. The Guild also dabbled in rare ship parts and other machinery; if the Guild did not possess a particular item, either it was not being made or the Guild had not previously been aware of it. At any rate, the Guild would do their utmost to have a complete inventory at all times. Due to their enormous wealth and power, the Guild was able to operate without the attention and intervention of the Galactic Empire."}, {"tag": "h2", "text": "Equipment and merchandise"}, {"tag": "p", "text": "The Most Honourable Guild of Armourers, also known as the \"Armorer's Guild,\" specialized in the most rare and exotic types of weaponry. Though they would also stock more standard fare such as the BlasTech DL-18 blaster pistol, the most profit would be made off more obscure—and sometimes restricted—items of merchandise. The types of weapons varied, from common blasters and stokhli spray sticks to ancient, outmoded weaponry such as rail guns, and micro-missile guns. It was generally held that if the Guild did not stock an item, it was either no longer made, or it was unknown technology. In the latter case, the guild would eventually find the item."}, {"tag": "p", "text": "During the Imperial era, the Guild acquired such antiquities as a lightsaber and a suit of Mandalorian armor. Obscurities would generally fetch a very large amount of credits; the lightsaber brought in 250,000 credits, but even that didn't reach the reserve price. The Guild didn't just limit itself to weapons: limited edition items, such as the Kalld'n-class stardrive, were held or sought by the Guild. The Guild also specialized in procuring melee weapons, such as dueling swords and vibroblades. In obtaining rarities and obscurities, the Guild would sometimes commission third parties to scour the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial era, the Most Honourable Guild of Armourers had to avoid the ire of the Galactic Empire, who notoriously cracked down on weapons restrictions. To avoid any such laws or infractions, the Guild simply purchased the planet of Epsi Nadir, where they did the bulk of their business. Purchasing planetary waivers, the Guild could then legally sell their wares. To avoid dabbling in the bureaucratic regulations of other worlds, the products were classified as \"collectors items\" or \"historical artifacts.\" Following sale, the Guild would then request that all buyers register their purchases, but for a small bribe, the documents could be \"lost.\""}, {"tag": "p", "text": "The Guild was able to establish franchise deals with all the major armorers in the galaxy, right down to the smallest dealer. Due to the difficulty of reaching the Guildhouse in the Core Worlds for many customers, the Guild would send out a liner loaded with \"samples\" to the fringes of the galaxy. At the same time, the Guild would send out invitations to the more wealthy denizens of the galaxy who might be interested in what the Armourers had to offer."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Since they had a wealth of resources at their disposal, the Guild simply purchased Epsi Nadir during the Imperial era, so they could avoid the laws and regulations of the Galactic Empire. Guild business revolved around Epsi Nadir, where an auction house was built to showcase the abundance of merchandise collected by its members. The Guildhouse was located in the Core Worlds, making the trip there very expensive for many customers. To make things more complicated, the Guild would generally issue invitations and would not accept unwanted customers. Due to the concentration of bounty hunters and other such lethal characters, disturbances at Guild auctions were relatively low."}, {"tag": "h2", "text": "Membership and patronage"}, {"tag": "p", "text": "The Guild was made up of the galaxy's finest weapons specialists. Among the Guild's bounty hunting customers were Boba Fett, Dengar, Zardra, and Matt Talon, but the Guild also enjoyed the patronage of crime lords and wealthy recluses, as well as corporate executives and nobles, be they Imperial or planetary. Marshal Levnis and Moff Abran Balfour both made use of the Guild's acquisition departments for their hobbies. Count Imal Valesovich and High Lord Affric would use the Guild to procure rare melee weapons. The Guild's ability to bypass Imperial restraints was attractive to many, and gave the Armourers a monopoly on the market. Though Guild auctions were generally invitation-only, certain officials would accept princely bribes."}, {"tag": "p", "text": "The bounty hunter Dej Vennor purchased his droid IT-904 from a guild auction on Epsi Nadir."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Most Honourable Guild of Armourers was created by Simon Smith and Eric S. Trautmann, and was first mentioned in the West End Games sourcebook Galaxy Guide 9: Fragments from the Rim."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}