{"url": "The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Agents of Chaos duology"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Agents of Chaos I: Hero's Trial"}, {"tag": "p", "text": "The New Jedi Order: Agents of Chaos I: Hero's Trial is a Star Wars Legends novel written by James Luceno. It is the fourth volume of the Star Wars: The New Jedi Order series, following Dark Tide II: Ruin and preceding Agents of Chaos II: Jedi Eclipse. It was first published in paperback by Del Rey on August 1, 2000. Both Agents of Chaos novels were later collected in a hardcover omnibus from the Science Fiction Book Club."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Merciless attacks by invincible alien force have left the New Republic reeling. Dozens of worlds have succumbed to occupation or annihilation, and even the Jedi Knights have tasted defeat. In these darkest of times, the noble Chewbacca is laid to rest, having died as heroically as he lived—and a grief-stricken Han Solo is left to fit the pieces of his shattered life back together before he loses everything: friends, family, and faith."}, {"tag": "p", "text": "Refusing help from Leia or Luke, Han becomes the loner he once was, seeking to escape the pain of his partner's death in adventure…and revenge. When he learns that an old friend from his smuggling days is operating as a mercenary for the enemy, he sets out to expose the traitor. But Han's investigation uncovers an even greater evil: a sinister conspiracy aimed at the very heart of the New Republic's will and ability to fight—the Jedi."}, {"tag": "p", "text": "Now Han must face down his inner demons and, with the help of a new and unexpected ally, honor Chewbacca's sacrifice in the only way that matters—by being worthy of it."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Yuuzhan Vong War grows worse for the New Republic as the Yuuzhan Vong continue to advance toward Coruscant, the heart of the New Republic, with its latest capture of the information planet of Obroa-skai. And what's worse is that citizens of the galaxy are starting to side with the Vong, becoming a group known as the Peace Brigade. Seeing the Jedi as a threat, the Vong decide to unleash Priestess Elan and her aide/pet, Vergere, to pretend to be defectors from the Vong so she can get close to the Jedi and unleash a spore that will not only kill her but everyone around her, and she is ordered to do it against the Jedi."}, {"tag": "p", "text": "Meanwhile, Han Solo, with the loss of Chewbacca, separates himself from his family and friends and becomes a loner. Along the way, Han meets up with an old smuggler ally named Roa (whose wife, Lwyll, died because of the Vong) says he knows someone who is heavily involved with the Vong's plans, whose name, unknown to either Han or Roa, is Reck Desh, another past ally of Han's who was actually good friends with Chewbacca. So Han and Roa meet up with a contact at a space station at Ord Mantell named Fasgo, and Han gets into a fight with a mercenary named Bossk, an old enemy's of Han who hated Wookiees, therefore, he hated Chewbacca. Han, Roa, Fasgo and Bossk are transported to a prison but are freed by Boss Bunji, a smuggler who knew Han and said he owed him a great deal after saving his business with the death of Jabba the Hutt more than two decades earlier."}, {"tag": "p", "text": "However, around the same time, Elan and Vergere allow themselves to be captured by New Republic forces on Wayland, and feint attacks there and later on Ord Mantell are meant to prove that Elan and Vergere are indeed on the Republic's side now. However, at the Battle of Ord Mantell, Roa and Fasgo are captured by Vong forces, and Han escapes the space station of the planet with several other people and Droma, an alien whose species is called the Ryn, where it is revealed that Ryn are hated by the galaxy. After the feint attack at Ord Mantell, the refugee and New Republic survivors from the battle, including Han and Droma, board the Queen of Empire, a large pleasure yacht whose next stop is at Bilbringi. However, Elan and Vergere happen to have boarded the ship so that when it goes to Coruscant and Elan makes her false treaty with the New Republic and Jedi, she will kill all of the Jedi who meet with her using the spores."}, {"tag": "p", "text": "Meanwhile, Han and Droma began to form a mutual friendship. Later, the Vong's plans for defeating the Jedi become foiled when a spy for the Vong among the New Republic, who would later be revealed as Senator Viqi Shesh in the Republic, actually believed Elan and Vergere are actual defectors, like the rest of the Republic, and tips off the Peace Brigade. A certain team in the Brigade, lead by Reck Desh, invade the Queen of Empire to capture Elan and Vergere and bring them back to their masters, but when the Vong are quickly informed of it, a battle for the ship takes place between the New Republic and the Yuuzhan Vong. After Elan and Vergere are taken by Desh and his troops, the members of the Brigade strike team are killed by some of Elan's spores and when Han and Droma show up to save the two \"defectors,\" Han figures out Elan and Vergere are still on the Vong's side. Elan decides to use more of the spores to kill Han. Fortunately, Han is saved by a device on a survival tool that his youngest son, Anakin, gave him which was made by Chewbacca years earlier, which provides Han breathable air, thus saving him from the spores. Elan, therefore, dies by herself, having failed her mission to destroy the Jedi. As for Vergere, she gives Han and Droma some tears of hers that she states is able to heal Mara Jade Skywalker's disease that is slowly killing her from the inside, which of course was thanks to the Yuuzhan Vong, and Vergere escapes."}, {"tag": "p", "text": "After the battle at the Queen of Empire, Han vows that he will help Droma reunite with his family, who are one of the many refugees of the New Republic fleeing from the Yuuzhan Vong."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}