{"url": "The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Agents of Chaos duology"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Agents of Chaos II: Jedi Eclipse"}, {"tag": "p", "text": "The New Jedi Order: Agents of Chaos II: Jedi Eclipse is a Star Wars Legends novel written by James Luceno. It is the fifth volume of the Star Wars: The New Jedi Order series, following Agents of Chaos I: Hero's Trial and preceding Balance Point. It was first published in paperback by Del Rey on October 3, 2000. Both Agents of Chaos novels were later compiled in a hardcover omnibus from the Science Fiction Book Club."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A string of smashing victories by the forces of the sinister aliens known as the Yuuzhan Vong has left New Republic resources and morale stretched to the breaking point. Leia Organa Solo, estranged from her husband, Han, oversees the evacuation of refugees on planets in the path of the merciless invaders. Luke Skywalker struggles to hold the fractious Jedi Knights together, even while one of them undertakes a bold but reckless undercover mission."}, {"tag": "p", "text": "Manipulating their alliance with the amoral Hutts, the Yuuzhan Vong leave a cunning trail of vital information where New Republic agents are sure to find it—information the desperate defenders cannot afford to ignore: the location of the aliens' next target."}, {"tag": "p", "text": "Then Han Solo stumbles into the dark heart of a raging battle, thus beginning a furious race against time that will require every skill and trick in his arsenal to win…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo and Droma are looking for Droma's family across the galaxy. Leia Organa Solo, meanwhile, is trying the best she can to save refugees from the clutches of the Yuuzhan Vong. Seeing that the New Republic needs major help, Leia turns to the Hapes Cluster and tries to convince the people of Hapes and its star systems to join the New Republic in the war. As for the Jedi, the tears that Vergere gave to Han and Droma appear to have worked, at least suppressing the disease which is eating away at Mara Jade Skywalker."}, {"tag": "p", "text": "Meanwhile, Wurth Skidder, one of Kyp Durron's Jedi, allows himself to be captured by the Vong to understand them, and Skidder begins a relationship with one of the Vong's yammosks, which are the battle coordinators for the Vong's coralskippers. Here, it is also revealed that Roa and Fasgo are incarcerated with Skidder under the hand of Chine-kal. Fasgo dies after the yammosk discovers Skidder's true identity and mortally wounds Fasgo in its reaction. During Han and Droma's adventure to find Droma's family, they arrive at the planet Ruan. They free a group of droids from being destroyed by the Ag Corps in appeasement to the Yuuzhan Vong."}, {"tag": "p", "text": "The New Republic guesses at the Yuuzhan Vong's next attack, and they believe that their next attack would be either at Corellia or Bothawui. As for the Vong themselves, they establish a treaty with the Hutts, but the Hutts, who know that the Yuuzhan Vong cannot be trusted, are secretly passing the information to the New Republic about the Vong's attack strategies. Anakin and Jacen Solo travel to Centerpoint Station, to protect against the Vong's possible invasion of Corellia. Only Anakin can activate the Station since he was the one who shut it off several years earlier. When the time finally comes for the Vong's next attack, it turns out their target was neither Bothawui nor Corellia, taking the New Republic by surprise in attacking the planet of Fondor because of its shipyards. During the Battle of Fondor, the Hapes Cluster joins in to fight off against the Vong with the Republic, and the Hutts openly betray the Vong for the New Republic."}, {"tag": "p", "text": "Droma's family happens to be at Fondor at the time on an abandoned shipyard, and Han and Droma join into the battle. Wurth Skidder dies during Kyp Durron and Ganner Rhysode's boarding of the Crèche to rescue him, Roa, and the other captives. Unfortunately, the battle is effectively a victory for the Vong after Thrackan Sal-Solo fires a beam from Centerpoint Station to take out the Vong and wipes out most of the Hapan Fleet. Prince Isolder, in command of the Fleet, is disgraced by the Hapans, and blames himself after he ignored a warning from Leia when she had a vision of destruction after the Hapans joined the war. Sal-Solo is seen as a hero since the Vong were driven off with heavy casualties. As for Droma and his family, they and the rest of the refugees are shipped off to the planet Duro. It is also revealed that Senator Viqi Shesh in the New Republic is working for the Yuuzhan Vong, as she gets a visit from the Vong's own spy, Executor Nom Anor."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The working title for Jedi Eclipse was The Crooked Sky."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}