{"url": "The_New_Jedi_Order:_Dark_Tide_I:_Onslaught", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Dark Tide duology"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Dark Tide I: Onslaught"}, {"tag": "p", "text": "The New Jedi Order: Dark Tide I: Onslaught is a Star Wars Legends novel written by Michael A. Stackpole. It is the second volume of the Star Wars: The New Jedi Order series and the first installment of the Dark Tide duology. The novel was first published by Del Rey on February 1, 2000, and an audiobook version was also produced."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "It is a perilous time for the New Republic. Just when unity is needed most, mistrust is on the rise. Even the Jedi feel the strain, as rogue elements rebel against Luke Skywalker's leadership. When alien invaders known as the Yuuzhan Vong strike without warning, the New Republic is thrown on the defensive."}, {"tag": "p", "text": "Luke must wield all the awesome powers of a Jedi Master to defeat the gravest threat since Emperor Palpatine. As Leia Organa Solo and Gavin Darklighter lead desperate refugees in a fighting retreat from Yuuzhan Vong forces, Mara Jade Skywalker, Jedi apprentices Jacen and Anakin Solo, and Jedi Knight Corran Horn find themselves tested as never before by a faceless, implacable foe determined to smother the light of the New Republic forever beneath a shroud of darkest evil…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The alien Yuuzhan Vong have appeared throughout the Outer Rim, attacking different sectors mercilessly. Lando Calrissian's planet of Dubrillion is attacked and taken over. Luke Skywalker decides to deal with the Yuuzhan Vong's aggressiveness by mobilizing a select few Jedi for various reconnaissance missions. Luke and Jacen Solo go to Belkadan, Corran Horn and the arrogant Ganner Rhysode are sent to the planet Bimmiel to recover a group of missing scientists, and Anakin Solo accompanies Mara Jade Skywalker to Dantooine for the sake of Mara's rapidly deteriorating health."}, {"tag": "p", "text": "Luke and Jacen soon find the ExGal facility on Belkadan littered with the carnage of machinery, before discovering a Yuuzhan Vong outpost utilizing slaves as a means to grow their bioequipment. Corran and Ganner also find the group of scientists along with a Yuuzhan Vong outpost (also harboring slaves) whose inhabitants are searching for the remains of a Yuuzhan Vong that died and was recovered by the group of scientists. All the while on Dantooine, Mara is teaching young Anakin ways of the Force previously unknown to the youth. Jacen follows a vision he has, engages in and loses a battle to a Vong warrior on Belkadan, and is taken prisoner and placed in the Embrace of Pain prior to Luke's rescuing him. The two Jedi, sensing trouble on Dantooine, depart the planet. Their foresight serves them well, as they arrive just in time to rescue Anakin and Mara from Yuuzhan Vong warriors who have discovered them on the planet and are hunting the two."}, {"tag": "p", "text": "The Yuuzhan Vong, chasing refugees fleeing from the destruction on Dubrillion, arrive in force to the planet. The resulting \"onslaught\" sees the slaughter of hundreds of the Vong's primary slave invasion force, along with a New Republic victory, though is costly because they lose half of their refugees during the battle."}, {"tag": "p", "text": "On Bimmiel, Corran and Ganner attempt to rescue two captured scientists. Ganner escapes with the two, leaving Corran to narrowly defeat the two Yuuzhan Vong warriors that appear; Ganner is forced to rescue the dying Corran, who then survives. Shedao Shai, a male Yuuzhan Vong commander, is later notified of the killing of his kinsmen, Neira and Dranae and the stealing of his ancestor's remains. Shai, overcome by vengeance, vows that he will taste the blood of the Jeedai (Vong mispronunciation of Jedi) responsible."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The New Jedi Order: Dark Tide I: Onslaught erroneously states that Kyp Durron was sixteen years old when he first went to the Jedi academy; the novels I, Jedi and Dark Apprentice, which depict Durron's arrival at the academy, previously established that he was eighteen."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}