{"url": "The_New_Jedi_Order:_Traitor", "categories": ["Category:Real-world articles", "Category:Star Wars: The New Jedi Order"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Traitor"}, {"tag": "p", "text": "The New Jedi Order: Traitor is a Star Wars Legends novel and the thirteenth volume in the Star Wars: The New Jedi Order series. It was written by Matthew Stover and published by Del Rey in paperback on July 30, 2002. The Science Fiction Book Club released an exclusive hardcover edition that same year."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "From the depths of catastrophe, a glimmer of hope."}, {"tag": "p", "text": "After the capture of Coruscant, the mighty heart of the New Republic, a stunned galaxy fears that nothing can stop the Yuuzhan Vong. Still, that crushing defeat produces one small miracle: Jacen Solo is alive. Yet he can scarcely imagine himself in stranger circumstances."}, {"tag": "p", "text": "The young Jedi Knight is in the care of Vergere, a fascinating creature of mystery and power, her intentions hard to fathom, her cruelties rarely concealed. But this master of inscrutable arts has much to teach the young Jedi… for she holds the key to a new way to experience the Force, to take it to another level—dangerous, dazzling, perhaps deadly."}, {"tag": "p", "text": "In the wrong hands, the tremendous energies of the Force can be devastating. And there are others watching Jacen's process closely, waiting patiently for the moment when he will be ready for their own dire purposes. Now, all is in shadows. Yet whatever happens, whether Jacen's newfound mastery unleashes light or darkness, he will never be the same Jedi again…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story opens with Jacen Solo being tortured aboard a Yuuzhan Vong ship. He receives frequent visits from Vergere, who betrayed him to the Yuuzhan Vong after he killed the voxyn queen at the end of the Mission to Myrkr. Vergere begins showing Jacen that there is no dark side of the Force and that the \"dark side\" is rather the full power of the Force. During this time, Vergere helps the Vong shape Jacen into one of their own. This process is observed by Executor Nom Anor."}, {"tag": "p", "text": "Eventually, Jacen is sent to a Yuuzhan Vong seedship, the seedship being for the purpose of forming a new planet for the Vong to have as a home. Jacen is given the task of tending to the non-Yuuzhan Vong workers developing the ship into a planet, and he begins to have a belief that the cruel non-Vong workers need to die after the death of a Devaronian, which those workers caused, who was assisting Jacen in an assignment. At the beginning of his stay on the seedship, Jacen is implanted with a slave seed in his chest by Vergere to connect him with one of the dhuryam of the seedship. During the course of this bond, the dhuryam realizes Jacen cannot be broken and forced into doing work, so the dhuryam resorts to a mutual partnership with Jacen."}, {"tag": "p", "text": "Soon more Yuuzhan Vong forces arrive at the seedship in order to select one of the dhuryam for a World Brain. The dhuryam would then be able to have complete independence in controlling a Yuuzhan Vong-formed planet, in a ceremonial ritual. But Jacen refuses to join the ceremony. The dhuryam he is bonded to then allows him to take control of the immature amphistaffs and wear them as armor as he goes through the seedship and causes a great massacre that kills Yuuzhan Vong and non-Yuuzhan Vong alike, and further, he makes all the other slaves attack the Vong with immature weapons, which turns out to be as much a danger to them as it is to the Yuuzhan Vong. Jacen reaches the dhuryams and kills all of them save the one he is bonded to, for when he is about to kill that one, Jacen believes he sees his late brother Anakin telling him not kill the dhuryam because of their partnership (all appearances of Anakin Solo here are ambiguous as to whether or not they are real or illusion). Vergere convinces Jacen not to kill the last dhuryam, and he falls unconscious."}, {"tag": "p", "text": "When Jacen wakes up, he finds he is on the Yuuzhan Vong homeworld of Yuuzhan'tar, and thanks to Vergere, who aids him on his trek to the city capital, he realizes it was once Coruscant, now captured by the Yuuzhan Vong. Jacen learns that he can sense the Yuuzhan Vong in the Force, a result of the slave seed Vergere had implanted in him on the seedship to make him obey the Yuuzhan Vong. He uses this \"Vongsense\" to escape Yuuzhan Vong forces on Coruscant. After a confrontation with the Yuuzhan Vong, Jacen and Vergere travel underground on Yuuzhan'tar to get underneath what was once the old Jedi Temple that was destroyed after the fall of the Old Republic and the rise of the Galactic Empire. Vergere questions Jacen further as to who he is, while blinding him in the dark of the underground. Jacen states proudly that he is a Jedi, and Vergere tells him that it was all a game and that Jacen has lost. She reveals that he is surrounded by Yuuzhan Vong with Nom Anor. Jacen slips into unconsciousness and unleashes the dark side of the Force upon Vergere and the Yuuzhan Vong. When confronted by a wounded Vergere about it afterward, she argues that there is no difference between the light and the dark sides of the Force: they are both the same."}, {"tag": "p", "text": "Jacen, shocked at this revelation, leaves Vergere to discover who he is and chases after what he believes to be the spirit of Anakin. However, this is a hallucination and Jacen unwittingly enters a cavern beast. Inside the belly of the gargantuan animal, he hears a voice, crying for help. He tries to shut it out, believing it to be another hallucination. Then, to his horror, he realizes that it has a presence in the Force. He tries to rescue the girl crying for help, but to no avail. But when he unleashes the hate inside himself, he uses the dark side to rescue the child. This confuses him and draws his mind back to Vergere's teachings: that the dark side was simply the Force's unleashed potential. He discovers more survivors, refugees of the conquest of Coruscant. He assumes that they, too, were drawn in by illusions and false hopes. Through his confusion, though, he also finds anger and rage. The refugees have a rule: whoever arrives last in the beast would be sent to feed its ravenous hunger. The girl arrived last, and she was undergoing an execution. The survivors and, most enraging to Jacen, the girl accuse him of being the last and then try to send him on his way to the stomach. Enraged, he draws on the anger he feels and uses the Force to make the animal believe that humans are poisonous, triggering it to forcibly eject all of them. Bereft of their shelter, the survivors would most likely die from Coruscant's many dangers. Lost and confused, he leaves them and goes on."}, {"tag": "p", "text": "Jacen then arrives at the Solo's now ruined apartment and is saddened by how much things have changed, his home and his life now a perversion of its former self. Shortly after his arrival he is visited by what he thought to be (and may have been) Anakin's spirit. This also challenges his thoughts on the Force. The apparition of Anakin engages in the playful banter they had once shared, and Jacen tells him of the things he has done, and also his confusion. Jacen also asks Anakin whether he is real or an illusion. Anakin counters, asking Jacen if there is a difference, saying that life, like the Force, is all one and that there is no difference, akin to Vergere's earlier teachings. Jacen then thinks that Anakin really is an illusion and tries to shut him out, falling into a deep depression. Vergere arrives and wakes him, once again challenging Jacen's beliefs. They are soon joined by Nom Anor and his entourage of warriors, who confront Jacen, saying that they believe him to be an avatar of Yun-Yammka, offering him Anakin's lightsaber if he would convert to the Yuuzhan Vong religion. Jacen agrees, although Nom Anor is unaware at this time that he is lying."}, {"tag": "p", "text": "The rest of the story reveals that Ganner Rhysode has been searching for Jacen due to rumors of him being alive. On a New Republic camp ship that keeps refugees from the Yuuzhan Vong war, Ganner finally confronts Jacen and the Yuuzhan Vong forces and is captured. After Ganner's capture, he is sent to Yuuzhan'tar, and Jacen reveals he has not really converted to the Yuuzhan Vong ways and that he is simply acting. The Yuuzhan Vong do not know whether or not they can trust Jacen to be an avatar, and Nom Anor now knows that Jacen is acting. However, they still bring Jacen and Ganner to the Well of the World Brain where the Galactic Senate once met. Jacen and Ganner lock themselves in, their plan being that Jacen would destroy the World Brain that used to be the dhuryam he was partnered with at the seedship (after Jacen killed all the rest of the dhuryams, his partner was selected to be the World Brain on Yuuzhan'tar) while Ganner would then escape. However, Ganner tells Jacen he will sacrifice himself so that Jacen will be able to kill the World Brain in time. Ganner confronts all the Yuuzhan Vong warriors who come his way after Jacen gives him Anakin's lightsaber and kills nearly all of them in combat, but he dies himself from the wounds inflicted upon him. Meanwhile, Jacen does not kill the World Brain, but convinces it not to make things imperfect for the Yuuzhan Vong in order to teach them compromise in the course of their invasion of the galaxy. Vergere, in the meantime, manipulates Nom Anor into revealing the location of his personal escape ship that would let him escape in case trouble came to Yuuzhan'tar. Vergere betrays Nom Anor and lets biological lifeforms trap him while she and Jacen escape to become a third party of themselves in the Yuuzhan Vong War as they head back to the New Republic."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Traitor lists Jacen Solo as Jedi Knight in its Dramatis Personae. However, he is not Knighted until later in the series with The New Jedi Order: Destiny's Way. It could have simply been referring to all Jedi as Jedi Knights, however, he was promoted to apprentice Jedi Knight at the end of Young Jedi Knights."}, {"tag": "p", "text": "Jacen Solo's torture and Ganner Rhysode's Battle of the World-Well were included in Star Wars Insider's 20 Most Memorable Moments of the Expanded Universe."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}