{"url": "The_New_Jedi_Order:_Ylesia", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Legends eNovellas", "Category:Short stories republished with novels", "Category:Star Wars: The New Jedi Order"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Ylesia"}, {"tag": "p", "text": "The New Jedi Order: Ylesia, part of the New Jedi Order series, is an eBook novella by Walter Jon Williams, published in 2002 and set at the same time as Williams's novel The New Jedi Order: Destiny's Way, in between chapter 21 and chapter 22 of the book."}, {"tag": "p", "text": "The text of Ylesia was originally available as a 3.50USD download. It was also included in paper format as a bonus to Dark Nest I: The Joiner King.[source?] Due to an oversight by LucasBooks and Del Rey that left many readers expecting the story to be included within the mass market paperback edition of Destiny's Way, Ylesia was offered as a free download on StarWars.com on August 26, 2003."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "RIPE FOR THE PLUCKING"}, {"tag": "p", "text": "That's Jedi Knight Kyp Durron's opinion about the planet Ylesia, home base of the so-called Peace Brigade, a group of traitors dedicated to hindering the war efforts of the New Republic and hastening the ultimate victory of the merciless Yuuzhan Vong. Kyp's plan calls for a lightning-fast strike, backed with overwhelming force, to destroy the Brigade's offensive capabilities and teach prospective traitors that betrayal carries a heavy price. But young Jacen Solo, still bearing the scars of his imprisonment by the Yuuzhan Vong, has a better idea: a daring raid into the heart of Ylesia's capital, with the objective of capturing the Brigade's top leaders—-including the newly sworn-in President, Thrackan Sal-Solo, cousin to Jacen and his twin, Jaina."}, {"tag": "p", "text": "But unknown to the Jedi and the New Republic forces, Supreme Overlord Shimrra of the Yuuzhan Vong has dispatched reinforcements to the Ylesia system. Instead of a swift surgical strike, Jaina, Jacen, Kyp, and their comrades are about to find themselves locked in a desperate battle for survival, with the odds stacked against them and time running out…."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}