{"url": "Battle_of_Moorjhone", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Jospro sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Moorjhone"}, {"tag": "p", "text": "In the year 20 BBY, the planet Moorjhone was the site of a conflict between two Nightbrothers and the Galactic Republic. After killing an agent of the Rim Mining Company in a random act of violence, the recently resurfaced former Sith apprentice Darth Maul and his brother, Savage Opress, found themselves on the run from bounty hunters acting under the interest of Ja'Boag, the leader of the Mining Company who placed a large bounty on their heads. Darth Maul opted to tackle the issue directly by killing Ja'Boag, who operated out of the mining facilities on the desert planet Moorjhone. After infiltrating the main facility and attempting to assassinate the Gossam, Maul and Savage were intercepted by a Jedi strike team consisting of Salmara, Judd, and Dray, who froze Savage in carbonite and wounded Maul, who managed to limp away into the surrounding desert."}, {"tag": "p", "text": "Savage was stowed away as an ornament in Ja'Boag's office, while Maul eventually found himself in the company of natives who had recently found themselves ousted from their caves upon the arrival of the Mining Company. As the Day of Three Suns approached its next cycle, during which all life on the planet's surface would burn under the intensity of three suns, the natives found themselves desperate to reclaim their home in the caves. Darth Maul rallied the natives, who revered him as the \"Demon in the Light\", into conflict with the army of the Mining Company in an attempt to save his captured brother. Eventually, the 212th Attack Battalion of the Grand Army of the Republic led by General Obi-Wan Kenobi arrived and outnumbered the frail native forces, who were armed with primitive weaponry. Maul provoked the clone trooper forces into opening fire on the surrendering native forces (against the wishes of General Kenobi), providing a distraction for him to slip into the Mining Company base during the chaos."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "For millennia, the Moorjhoni clans had dwelled in the caves of their home planet, Moorjhone, which was part of a trinary star system (containing three stars). Every ten years, all three stars would rise in unison on the same side of the planet, destroying all life on the surface. The caves were a natural retreat from the harsh environment; however, the arrival of the Rim Mining Company under the leadership of the Gossam Ja'Boag prior to the Clone Wars forced the Moorjhoni to abandon their caves, which were reconfigured to the company's use. The Moorjhoni sought the strength to take back their caves to escape destruction from the next \"Day of Three Suns\"; the shaman of the clan foretold of an individual who would spare the Moorjhoni of that fate, one who walked in the light but had the \"face of a demon\"."}, {"tag": "p", "text": "Darth Maul, a former Sith apprentice who fell during the Battle of Naboo a decade prior, resurfaced on Lotho Minor in 20 BBY, being discovered by his long lost brother, Savage Opress of the Nightbrother clan. Maul quickly reacquainted himself with galactic society, cutting a bloody swath with his brother across the galaxy. During one of their acts of violence, a reporter for the Rim Mining Company was slain. Devastated, Ja'Boag placed a live bounty on their heads, leading to several skirmishes with bounty hunters, including one on the planet Paklan. Maul learned of Ja'Boag's identity during an interrogation session with a captured human bounty hunter, and sought to invalidate the bounty by traveling to Moorjhone and killing the man to prove a point. Around the same time, the Jedi Council organized an investigation of Maul's resurfacing and the Rim Mining Company's involvement; Jedi Master Obi-Wan Kenobi was tasked with tracing the brothers' location while Masters Salmara and Judd, along with Padawan Dray, were deployed to Moorjhone to question Ja'Boag as to his knowledge of Maul's existence."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Assassination attempt"}, {"tag": "p", "text": "Maul and Savage landed on Moorjhone prior to the arrival of the Jedi task force, and found themselves separated from the mining facility by a sizeable security force brought by Ja'Boag for his visit. Upon being approached by a soldier, Maul influenced the man into carrying a live thermal detonator into the rest of the forces, wiping out a majority of the perimeter defenses. The two killed some of the survivors with their lightsabers before moving into the facility itself, where they were met by Ja'Boag and a sizeable wing guard. Despite the wishes of his captain, Ja'Boag opted to confront the two directly. After mocking them for being foolish to dive headlong into enemy territory, Ja'Boag was flung into a nearby smelting pit, but was saved at the last second by Salmara, who recently arrived with the Jedi task force. Salmara offered the Nightbrothers a nonviolent surrender, to which Savage refused."}, {"tag": "p", "text": "Savage and Maul used a combined Force push to wipe out much of the security force before being attacked by Judd, wielding a saberstaff. During the scuffle, Salmara flung a container of the substance carbonite at Savage; ignorant to its contents, Savage swiped at the container with his lightsaber, which released its cargo on him, effectively freezing him in the substance. Enraged at his brother's defeat (and Judd's subsequent mocking of his metallic legs), Maul broke Judd's arm with one of his feet. Dray used this time to creep up on Maul and stab him through the pelvis with his lightsaber. This proved ineffective due to the robotic nature of Maul's lower half, and Maul countered by severing both of the child's hands with one swipe of his lightsaber. Maul then proceeded to flee, bringing down the escape tunnel entrance using the Force and fleeing to the outlying desert."}, {"tag": "h3", "text": "Rallying the Moorjhoni"}, {"tag": "h4", "text": "The Demon in the Light"}, {"tag": "p", "text": "After Maul penetrated the depths of the mining facility during the slaughter of the Moorjhoni people, he was confronted by Master Judd. Maul offered Judd an ultimatum: either stop Maul right there and then, which would perpetuate the massacre that was taking place outside before their final destruction in the Day of Three Suns, or save the clashing armies outside at the cost of letting him free his brother and escape. Judd chose the latter, vowing that the Jedi Order would inevitably track down and bring an end to Maul's bloody reign over the Outer Rim regardless of the events on Moorjhone. Judd threw himself into the center of fire outside, calling off the clone attack on the Moorjhoni forces. Meanwhile, Maul arrived in J'baog's control room, where he was confronted by Salmara and Dray, who were attempting to apprehend the Rim Mining Company president. Maul used the force to unfreeze Savage from his carbonite prison, who managed to take Salmara off guard and kill her in one swift move. Maul also started the lockdown process on the facility, with the intent of preventing any survivors of the massacre from finding refuge from the approaching inferno."}, {"tag": "p", "text": "It was at this time that the Moorjhoni saw Judd as the true \"Demon in the Light\"; as the beams of the three suns came down upon them, the Jedi Master, in the process of burning alive, used his remaining strength to telekinetically propel General Kenobi and several Moorjhoni through the closing blast doors, sacrificing his own life to save the Moorjhoni from complete destruction."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon being taken away from the planet, Ja'boag was forced by his Nightbrother captives into nullifying the bounty on their heads and transferring a large amount of credits into their account. After finding no further use in their hostage, Opress ejected Ja'boag from the ship's airlock, killing him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle on Moorjhone made its appearance in the Dark Horse Comics series Darth Maul: Death Sentence in 2012, part of the multimedia campaign surrounding the resurrection of the character Darth Maul."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}