{"url": "The_New_Jedi_Order:_The_Final_Prophecy", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: The New Jedi Order"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: The Final Prophecy"}, {"tag": "p", "text": "The New Jedi Order: The Final Prophecy is a Star Wars Legends novel and the eighteenth and penultimate volume in the Star Wars: The New Jedi Order series. It was written by Greg Keyes and published by Del Rey in paperback on September 30, 2003. The Science Fiction Book Club released an exclusive hardcover edition that same year."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As a beleaguered galaxy fights its way back from the brink of destruction, the Jedi's most fearsome enemy plots to end the war—and claim victory—with a final act of domination…."}, {"tag": "p", "text": "The troubles for the embattled living planet Zonama Sekot have just begun. As Luke Skywalker and Jacen Solo negotiate its place in the galactic struggle against the Yuuzhan Vong, one of its organic ships is taken by the alien invaders. Scientist Nen Yim is ordered to use the captive to find weak spots in Zonama Sekot's technology. But what Nen Yim discovers about the planet and its mysteries shocks her to the core. Clearly her people have gone terribly astray. For the peace-loving planet harbors not only the key to its own destruction, but the long-forgotten secrets of the Yuuzhan Vong themselves."}, {"tag": "p", "text": "Meanwhile, General Wedge Antilles, commanding one fleet in a three-pronged campaign to retake the Bilbringi system, is suddenly stranded deep in Yuuzhan Vong space, cut off from all contact. Wedge and his ships must rely on trickery and brilliant battle tactics if they are to survive long enough to ensure the success of one of the deadliest and most crucial missions the Galactic Alliance forces have ever seen…."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A subplot to the novel details Operation Trinity, including Wedge Antilles and Jaina Solo's involvements, such as her story in being captured by pirates."}, {"tag": "p", "text": "On Yuuzhan'tar, Nom Anor's underground Jedi heresy cult is steadily losing faith in him as Yu'shaa the Prophet because of his failed attempts at bringing Supreme Overlord Shimrra down. However, Nom Anor remembers from his late agent Ngaaluh that Shimrra greatly fears an alleged living planet known as Zonama Sekot. Therefore, as Yu'shaa, Anor declares to his Shamed followers that on the day of Shimrra's downfall, a great planet will appear in the skies of Yuuzhan'tar to herald the end of the traditional Yuuzhan Vong way of life for the betterment of the Shamed Ones. Anor's followers are pleased with this news, and coinciding with Anor's false prophecy, he learns that Master Shaper Nen Yim is examining the starship brought back from Zonama Sekot, and learns that the starship has biological components, like a Yuuzhan Vong ship, as well as mechanical components, like one of the galaxy's own starships. So Nom Anor, still in his guise as Yu'shaa, makes a deal with Nen Yim: after he contacts Tahiri Veila to rescue the both of them from Yuuzhan'tar, they will all go to Zonama Sekot to learn the nature of the planet. This also coincides with Yim's dealings with the priest Harrar, who is secretly against Shimrra's order, and also wants to go to Sekot to see if Yu'shaa's prophecy of it bringing Shimrra's order down is true."}, {"tag": "p", "text": "Tahiri, on the planet Mon Calamari, receives Yu'shaa's message to extract him and Nen Yim from Yuuzhan'tar and bring them to Zonama Sekot. Tahiri accepts, and takes Corran Horn with her. Despite short notice of Harrar's joining on the voyage to Sekot, all five of them escape the Yuuzhan Vong capital planet and go to the living planet via the ship that Nen Yim was studying that came from the latter world. Once they arrive on Sekot, the ship dies, and the five of them begin to study the planet, with the three Vong members formally renouncing their species' violent ways to defeat Shimrra. Tahiri and Nen Yim also realize that the memories implanted into the former by the late Mezhan Kwaad actually came from Nen Yim."}, {"tag": "p", "text": "Eventually, Nen Yim comes to realize the truth of Zonama Sekot's nature. However, Nom Anor realizes that if he can somehow find a way to kill Zonama Sekot and return to Shimrra's favor for bringing the living planet's end, he will be redeemed in the eyes of the traditional Yuuzhan Vong. So he then kills Nen Yim and travels into the planet's depths to sabotage its hyperdrive capabilities and end its life. But Yim lives long enough to tell Tahiri of Nom Anor's intentions, and dies in her arms. Tahiri, Corran and Harrar try to stop Nom Anor, who manages to sabotage the living planet. Nom Anor evades Tahiri and Corran, and gets into a brief confrontation with Harrar, ending with Harrar being knocked off a cliff, his fate being presumed dead. Then, as Sekot appears to be dying off, the Yuuzhan Vong escort vessels, whom Anor had earlier called via his creche-cousin Phaa Anor prior to his mission of sabotaging Sekot, arrive to take Nom Anor back to Shimrra so he can be promoted back into the traditional Vong society. Tahiri and Corran are saved by Luke Skywalker, Mara Jade Skywalker, Jacen Solo and Saba Sebatyne to be taken into a bunker. Here, it turns out that Sekot has managed to rid itself of Anor's machinations, and it heads for hyperspace. Its ultimate destination—Yuuzhan'tar."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}