{"url": "The_New_Jedi_Order:_Dark_Tide:_Siege", "categories": ["Category:Real-world articles", "Category:Canceled novels", "Category:Pages needing citation", "Category:Book stubs", "Category:Dark Tide duology"], "nodes": [{"tag": "h1", "text": "The New Jedi Order: Dark Tide: Siege"}, {"tag": "p", "text": "The New Jedi Order: Dark Tide: Siege by Michael Stackpole was going to be the second book in the Dark Tide Trilogy. Set in 25 ABY, it was to have detailed the New Republic planning for the next Yuuzhan Vong attacks following, with Corran Horn dealing with Shedao Shai's threats. A ship that would have appeared in Siege was used on the cover of The New Jedi Order: Dark Tide II: Ruin."}, {"tag": "p", "text": "When Siege was cut, the trilogy became the Dark Tide Duology, with Siege's major plot points being merged into the other two books. The extra book allowed Lucasfilm to stretch James Luceno's Agents of Chaos from one to two books."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an interview with the YouTube channel State of Star Wars, Stackpole elaborated on why Siege was cancelled. At the time that Stackpole was writing his then planned trilogy the license for the Star Wars franchise had recently shifted from Bantham Spectra to Del Rey and that, along with the release of The Phantom Menace, had, according to Stackpole, increased the amount of creative input from the publisher to the writers. This resulted in Stackpole receiving a 16-page revision memo for Dark Tide I: Onslaught with changes he did not agree with."}, {"tag": "p", "text": "In Stackpole's words: \"I knew that if I made the changes that were requested in that memo that the book would be horrible. And I wasn't going to have a book be horrible in the Star Wars universe and go out over my name\"."}, {"tag": "p", "text": "Thus, Stackpole, concluded that he did not want to work under these conditions for two more novels. He wrapped up the story arcs that he had planned in two books and essential plot points that were going to be in Siege were written into what would become Dark Tide II: Ruin."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}