{"url": "The_Odyssey_of_Star_Wars:_An_Epic_Poem", "categories": ["Category:Real-world articles", "Category:Future novels", "Category:Film novelizations"], "nodes": [{"tag": "h1", "text": "The Odyssey of Star Wars: An Epic Poem"}, {"tag": "p", "text": "The Odyssey of Star Wars: An Epic Poem is a forthcoming book by Jack Mitchell. It is scheduled to be published by Abrams Books on September 28, 2021. The book adapts the events of Rogue One: A Star Wars Story and the original trilogy in a style inspired by the Odyssey and Beowulf."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A thrilling retelling of the Star Wars saga in the style of classic epic poetry."}, {"tag": "p", "text": "“I look not to myself but to the Force,"}, {"tag": "p", "text": "In which all things arise and fall away.”"}, {"tag": "p", "text": "Journey to a galaxy far, far away like never before—through lyrical verse and meter. Like the tales of Odysseus and Beowulf, the adventures of Luke Skywalker, Han Solo, Princess Leia, Jyn Erso, Obi-Wan Kenobi, Darth Vader, and the Emperor are fraught with legendary battles, iconic heroes, fearsome warriors, sleek ships, and dangerous monsters. Beginning with Rogue One's rebel heist on Scarif to secure the plans to the Death Star and continuing through the climax of Return of the Jedi, author Jack Mitchell uses the ancient literary form of epic poetry to put a new spin on the Star Wars saga."}, {"tag": "p", "text": "Punctuated with stunning illustrations inspired by the terracotta art of Greek antiquity, The Odyssey of Star Wars: An Epic Poem presents the greatest myth of the 20th century as it would have been told nearly 3,000 years ago."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}