{"url": "The_Occupation", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "The Occupation"}, {"tag": "p", "text": "\"The Occupation\" is the fifth episode of the fourth season of the animated television series Star Wars Rebels. The episode premiered on Disney XD on October 30, 2017. It is also the sixty-fourth episode of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ezra and the Ghost crew return to Lothal, but find that the Imperial occupation has taken a much darker turn."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ryder's message"}, {"tag": "p", "text": "The Ghost drops out of hyperspace above Yavin, and Hera Syndulla tells Sabine Wren to transmit the clearance codes to Yavin 4. Ezra Bridger, napping, is jolted awake by a Force vision and falls out of his chair, shouting \"No!\" When the others ask what's wrong, he tells them that he saw Jho and heard Ryder Azadi on Lothal, and he thinks they're in trouble. Kanan Jarrus points out that Ezra has been having a lot of these moments lately, due to his anxiety about Lothal, and that it probably doesn't mean anything. Ezra retorts that they've been rarer lately, and not happening in the middle of briefings. He also states that his people were promised support. Hera reminds Ezra that Thrawn ambushed their fleet, and he sulks in his chair, while Sabine feels sad for him."}, {"tag": "p", "text": "When the Ghost lands at the Great Temple, the ship is met by Erskin Semaj, who informs Ezra that Mon Mothma wants to see him and the others. In the main briefing room, Mothma plays a message they received from Ryder two days before, in which the former governor states that his spies in the capital report that the Empire is testing a new kind of TIE Defender. The message then cuts out before Ryder can describe the fighter's reported abilities. Mothma, having witnessed the dangers of the TIE Defender firsthand, states that this is information that needs to be followed up on, and tells Ezra she knows how important Lothal is to him. She asks for volunteers, and Ezra asks when he leaves. Hera reminds him that all of the Spectres are going. Mothma reluctantly assents, noting that they work better as a team. She warns them that since the Empire has Lothal in a complete lockdown, there is no guarantee that the Alliance will be able to extract them. Ezra responds that he understands, but that he is going to help his people, which means he's there to stay."}, {"tag": "h3", "text": "Returning home"}, {"tag": "p", "text": "Later, as the Ghost rendezvouses with the Broken Horn in deep space, Alexsandr Kallus, entering the cockpit, notes that Cikatro Vizago is a criminal who can't be trusted. Sabine, exiting the cockpit, tells Kallus that they used to say the same thing about him. Ezra adds that Vizago has legitimate business on Lothal. Kallus asks Ezra who told him that, and he responds, \"Hondo,\" which prompts Hera to sigh in exasperation. Ezra reassures her that Vizago will get them through the blockade, as he needs the money. He meets Vizago at the airlock, who promptly asks if Ezra \"has them,\" and Ezra invites the crime lord to see for himself. Ezra shows him to the Ghost's cargo hold, where crates of puffer pigs await. Vizago, pleased with his payment, notes that Lando Calrissian made a fortune with his, and that the Mining Guild will pay handsomely for them. As the crates are loaded onto the Broken Horn, Rex asks Garazeb Orrelios why he's not helping. Zeb responds that he's not allowed, as he scares the animals, because they don't like his face. Rex responds that at least Zeb's is unique, and the Lasat asks if that's clone humor as Rex climbs up the ladder. In the cockpit, Hera tells Rex that he's in command of the Ghost while she's gone. As she leaves, Kallus, mistakenly assuming that Hera was talking to him, sits down in the pilot's seat and reminisces about how much trouble the Ghost caused him back when he was with the Empire. Rex corrects Kallus as to who Hera was addressing, and Kallus retorts that he's commanded Star Destroyers. The old clone responds that Kallus just answered his own question, and the ex-Imperial moves to the copilot's seat, letting Rex sit in the pilot's seat. The Broken Horn detaches from the Ghost."}, {"tag": "p", "text": "The Spectres are on the bridge of the Broken Horn in civilian disguises when Chopper rolls in. The astromech droid comments that he finds Zeb and Ezra's hats ridiculous, and Sabine threateningly asks him if she needs to paint him again. The starship drops out of hyperspace above Lothal, and the Spectres are shocked at the planet's heavily polluted appearance. Ezra is particularly affected, noting that it looks like the planet is dying. Vizago tells him that Lothal isn't exactly the planet he remembers, and to brace himself. The starship is contacted by an Arquitens-class cruiser, and Vizago transmits his clearance codes. One of the cruiser's pilots tells the officer in charge that there is something wrong with the thermal scan, and they are detecting multiple unregistered lifeforms aboard. The officer notes that they've found a smuggler, and orders an Imperial Security Bureau patrol to be alerted. He gives the Broken Horn clearance to land."}, {"tag": "p", "text": "The Broken Horn flies through a layer of pollution in Lothal's atmosphere, and Ezra is shocked to see that the plains have been burned. Two TIE fighters swoop in to escort the ship, and Hera asks how common this is. Vizago claims that it sometimes happens, but is swiftly forced to admit that this has never happened to him before. Upon landing at Jhothal, a gravity lock is placed on the ship, and a search crew approaches. Hera guesses that they were scanned on the way in, and Ezra points out that if the Empire doesn't find them, it won't have anything, and asks Vizago to stall them. The Spectres hurry out of the cockpit. The boarding party, comprised of stormtroopers and an officer, enters the cockpit to find Vizago, who claims that he doesn't know anything. Hiding in the hold amid the crates, which have been opened to release the pigs, Sabine wonders if this is a good idea, and Ezra responds that he's confident it will work. The Spectres herd the puffer pigs out of the hold, and Zeb, positioned in the corridor, is ordered to scare them. He quips that he has to put on his \"useful face,\" and frowns at the animals, frightening them into inflating. The Imperials, having arrested Vizago, are surprised by the sudden barrage of inflated pigs, and as the Spectres sneak past, Ezra tells the crime lord to come along. Vizago, in binders, makes to leave, but turns back to retrieve one last, uninflated pig, and becomes trapped when the animal swells up."}, {"tag": "h3", "text": "Lothal occupied"}, {"tag": "p", "text": "The Spectres sneak into the occupied town, which is full of Imperials. Realizing that Vizago is not there, Ezra guesses that he must have gone back for the pig. Kanan points out that the crime lord is good at weaseling his way out of trouble. Ezra suggests that they go to Old Jho's Pit Stop to get in touch with Ryder, and Zeb ominously responds, \"If he's still there.\" Hera decides that they will split up: Ezra, Sabine and Chopper will go to the cantina, and her, Kanan and Zeb will look for transportation. Spotting a wanted poster of himself, Ezra wonders why the Empire is still using an old picture of him, as he doesn't look like that anymore, and Sabine tells him that's a good thing. They pass by a large viewscreen, spouting Imperial propaganda, which then displays Sabine's wanted poster. Across the street, they see two civilians being stopped by a patrol for being out after curfew. As Ezra, Sabine and Chopper approach the cantina's entrance, Ezra suggests that Jho is fine, as the people wouldn't stand for it. Sabine, hearing the Imperial anthem coming from inside, asks him if he's sure about this. Ezra responds in the affirmative, reminiscing about how the Pit Stop was one place where it was clear that the Empire was unwelcome. The two rebels, stopping in the doorway, are greeted by Imperial officers and stormtroopers, the Imperial HoloNews playing, and an unfamiliar bartender, and Sabine quips that things have clearly changed. They turn to leave, only to see Chopper, outside, being questioned by a stormtrooper as to the location of two citizens he witnessed nearby. Sabine asks what they will do now, and Ezra decides that they'll get drinks."}, {"tag": "p", "text": "Sabine quietly asks Ezra if he's trying to get them killed, and he points out that if they'd walked in and walked out, it would have been suspicious, and it's unlikely that anyone will recognize them, as they reach the bar. Spotting a hologram of an Imperial pilot, Sabine points it out to Ezra, noting that he might. Ezra recognizes the pilot in the picture as Baron Valen Rudor, who the Spectres had encountered a few times, years before. The bartender turns out to be Rudor, who is flattered to be recognized. Ezra and Sabine pretend to be impressed to meet Rudor, and Sabine asks him what he's doing running a cantina. He explains that the Empire gave him charge of the bar recently, as a reward. Rudor notes that they don't get many civilians in the bar anymore and, vaguely recognizing Ezra from some of those long-ago previous encounters, notes that he looks familiar. Ezra responds, truthfully, that he used to come in when the cantina was run by Old Jho. A red-haired patron sitting in a booth by the wall lowers his drink and frowns when he hears the name. Rudor states that they must not have heard, and explains that there was an Imperial raid on a suspected rebel cell a few days before, and that Jho was caught by the ISB trying to help the rebels escape. Ezra assumes that Jho was captured, and Rudor smugly states that he was captured and executed."}, {"tag": "p", "text": "Meanwhile, Hera and Kanan walk in the street, and she notes that it's like a ghost town because of the fear. Kanan responds that everyone has a reason to be afraid, and then hears a stormtrooper patrol. He grabs Hera by the wrist and pulls her into a narrow alleyway, and they watch the troopers walk past. Kanan notes that it's been a long time since they've been alone together, and Hera responds that it was usually in situations like this. He states that he wishes he could see her, and Hera reaches up and removes his visor, telling him that he could always see her. They lean in for a kiss, only to be interrupted by Hera's comlink beeping. Zeb reports that he's found the rebels' speeders, and Hera asks how many. He responds that he thinks he's found all of them, but they have been confiscated by the Empire. Zeb notes that it's \"kinda convenient.\" Hera asks about stormtroopers, and Zeb responds that he said convenient, not easy. In the alley, Hera tells Kanan that they have to go. As he starts to follow her, Kanan sighs."}, {"tag": "p", "text": "In the Pit Stop, Rudor notes that it was a shame about Old Jho, since he was apparently loved by the community, but traitors must be dealt with. Sabine, noticing Ezra's difficulty in hiding his anger, tells Rudor they have to go and gets Ezra away from the bar, thanking the baron for their drinks. She warns him that he has to stay in control. Rudor, suspicious, orders the stormtroopers to stop Ezra and Sabine. At this point, the red-haired young man intervenes, recognizing Ezra as \"Oleg\" and telling him he's been looking all over for him. He suggests that Ezra forgot to pay for his drinks. Ezra and Sabine pretend to argue over credits, both assuming that the other had them, and the redhead offers to pay for them, telling Rudor to keep the change. Rudor notes that that's very generous, and says that he didn't catch the redhead's name. The redhead responds that that's okay, and tells Ezra that everyone's waiting to see him."}, {"tag": "p", "text": "Outside the cantina, Ezra asks their rescuer who he is, and the young man responds that it has been a while. Ezra quickly recognizes him as Jai Kell, and remarks that it's been a long time since their days at the Imperial Academy. Jai agrees, and explains that he's been coming to the Pit Stop on Ryder's orders for the past several days, watching for the Spectres. He pulls out a transmitter to call for a pickup, and Ezra tells Jai that the Spectres have it covered. There is an explosion, and Hera, Kanan and Zeb pull up in a speeder, and she tells the others to get in. However, the rebels are approached by two tanks, and they are forced to flee, leaving the speeder behind as it is destroyed by Imperial fire. Hera says that they need an exit strategy, and Jai leads them back inside the cantina. In the entrance, they are forced to avoid death trooper DT-L21 and his stormtroopers exiting, and Ezra claims that there are rebels outside who just blew up a speeder. The death trooper shoves Ezra aside as he runs past."}, {"tag": "h3", "text": "Sewer escape"}, {"tag": "p", "text": "The rebels head inside the empty cantina, and Zeb smashes the door control to delay the Imperials. Jai leads the Spectres to a sewer entrance, and explains that Jho kept up a network of tunnels beneath the town, which Ryder told him about once. Hera orders Chopper to scan the infrastructure to find them an exit, and the droid descends into the hole. The rebels enter the sewer, but Zeb is reluctant, asking if there's another way. A blast is heard at the door, and Hera quips that Zeb could always ask the Imperials. Zeb enters the sewer last, grumbling about the smell. Once the Imperials re-enter the bar, DT-L21 asks Rudor if he knew that the sewer entrance was unsealed, and the baron claims that he did not. The death trooper commander orders troops, and several probe droids, into the sewers to find the rebels. Jai doesn't know the way, and the rebels are soon lost. He does remember that the tunnels lead to a large junction outside of town. Ezra remarks, \"So much for our disguises,\" as the Spectres retrieve their weapons from the crates Chopper has been carrying on a rig. The probe droids catch up, and the rebels fight them. Kanan, noting that one droid is transmitting their position, decides that they have to split up. He, Hera, Chopper and Jai head one way, and Ezra, Sabine and Zeb flee the other way."}, {"tag": "p", "text": "Eventually, Kanan, Hera, Chopper and Jai come to a ladder, leading up to an entrance. Kanan wonders if this is it, and Jai offers to climb up and check. The hatch opens, and the rebels swiftly hide from sight as several stormtroopers shine lights down into the sewer. Kanan is forced to step into the light in the process of destroying an approaching probe droid, and the rebels flee as the stormtroopers, reporting the sight of rebels, enter the tunnel. Chopper sees a starbird painted on the tunnel wall, pointing to the hatch, and tries to alert the others, but quickly flees when he sees stormtroopers descending. Running through the tunnels, Sabine, Ezra and Zeb are pursued by a probe droid. As Zeb destroys that one, the third probe appears, and Ezra takes care of it. Zeb asks if Ezra knows the way, speculating that Ezra grew up in a sewer. Ezra points out that he's from the city, and is unfamiliar with the country sewers. Zeb asks what the difference is, and Ezra retorts that everything is different. He states that Saw Gerrera was right, and Lothal is lost. Sabine tells Ezra to forget what Saw said, reminding him that he said as long as the rebels are together, they haven't lost. She then notices something, which she calls Ezra and Zeb's attention to: a painting of her starbird symbol. Ezra points out that Ryder knows that the bird is Sabine's symbol, and deduces that he left it as a trail for the rebels to follow. The three head in the direction that the bird is pointing. DT-L21 is informed that the rebels have destroyed all of the probe droids, and he orders all troops sent to the rebels' last known coordinates and a squad sent to the junction outside of town. He follows a squad of stormtroopers into the tunnel."}, {"tag": "p", "text": "Eventually, the trail leads them to a larger tunnel, and they can't find any more starbirds. Running to the other end, they are forced to retreat when stormtroopers appear. They attempt to head back the way they came, only for Hera, Kanan, Chopper and Jai to emerge, pursued by more stormtroopers. Hera reveals that they were following the symbols as well, and Zeb notes that they seem to have followed them into a trap. As the rebels are surrounded, Chopper, in the center of the large tunnel, looks up to see another hatch, with the starbird painted on it, and draws the others' attention to it. Hera states that someone needs to get up there, and Ezra leaps up onto the ladder. Climbing, he slashes the control panel with his lightsaber, lowering the ladder, and drops back to the ground. Sabine leads the way up, followed by Zeb, Hera, Jai, Kanan and Ezra. Chopper is carried by Zeb. Kanan and Ezra sever the ladder to prevent the stormtroopers from pursuing."}, {"tag": "p", "text": "Sabine bangs on the hatch, but it won't open, and tells Hera when she asks that Ezra destroyed the control panel. Shortly, the hatch does open, and Ryder Azadi appears and greets them. The rebels climb out, shutting the hatch behind them. They evacuate into Ryder's U-wing, copiloted by Marida Sumar. Ezra thanks Ryder for his help, and he says that it's the least he could do. Ryder asks where the rest of their forces are, so they can deal with the new TIE Defender, and Ezra apologetically tells him that they were all that was sent. Zeb pessimistically notes that since Lothal is in a complete lockdown, he doesn't see how they are going to do this. However, Ezra finds the bright side in all of this, noting that rebellions always start small, with only a few people. Ryder wonders if they'll feel that way when they see the Empire's new fighter, and the U-wing departs."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}