{"url": "The_Obstacle_Course,_Part_1", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2020) lead stories"], "nodes": [{"tag": "h1", "text": "The Obstacle Course, Part 1"}, {"tag": "p", "text": "\"The Obstacle Course, Part 1\" is a comic story that was published as the lead story of Star Wars Adventures 1 on October 7, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the Outer Rim moon of Noaxson, Finn and Poe Dameron looked over terrain. The moon was dangerous because it became dark at random times and the surface would shift, changing the terrain. Rey walked out blindfolded, wondering what was going on. When Rey took off the blindfold, they revealed that they had made her a Jedi training obstacle course. R2-D2 had helped them design it. They wanted to help her train to be a Jedi and she thanked. BB-8 joined her on the course."}, {"tag": "p", "text": "As she reached a bridge, BB-8 used his grappling hooks to get across. The bridge was very weak and Rey attempted to carefully walk across. All of the sudden, the bridge broke but Rey leaped across and reached the otherside. But her problems were not done there as she fell in a hole and ended up in the bottom on a cave. When they hit the bottom of a cave, they landed next to a group of pirates who questioned who she was."}, {"tag": "p", "text": "Back at the Millennium Falcon, Finn was getting worried that Rey had not yet returned. Dameron told him that she would be fine but Finn still believed she was in danger. But then they were stopped by two pirates who took them into custody to be delivered to Algron."}, {"tag": "p", "text": "Meanwhile, Rey tried to explain that she was an archaeologist was was having problems with her starship. But Algron and the others did not believe and knew who she really was. They were going to contact the First Order who were willing to pay a lot of credits for her. Realizing she would have to fight her way out, she grabbed her quarterstaff and began to fight off the pirates. Behind her, BB-8 used his arc welder to repel the attacking pirates. Algron ordered his pirates to go to their ship and contact the First Order as Rey took a swing at him. Algron, who was also equipped with a quarterstaff, dueled Rey until she gave the decisive blow and knocked him out. Rey and BB-8 got out of the cave but they quickly realized that their only way to the Falcon was through the obstacle course."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}