{"url": "Battle_of_N%27zoth", "categories": ["Category:Legends articles", "Category:Battles of the Black Fleet Crisis"], "nodes": [{"tag": "h1", "text": "Battle of N'zoth"}, {"tag": "p", "text": "The Battle of N'zoth was the final battle of the Black Fleet Crisis, in which the New Republic implemented Operation Strong Hand against the Yevetha. In 16 ABY, the Yevetha had attacked and massacred all non-Yevethan colonies within the Koornacht Cluster during their Great Purge. Following a heated diplomatic offensive, the New Republic moved against the Dushkan League following the testimony by Purge survivor Plat Mallar and the beating of a captive Commodore Han Solo being released on HoloNet."}, {"tag": "p", "text": "After a series of battles, the New Republic Fifth Battle Group arrived over the Dushkan capital N'zoth in 17 ABY and demanded their surrender and an end to all hostilities. Defiant to the last, Nil Spaar mustered a war fleet including the former Imperial vessels of the Black Fleet. However, the surviving Imperial captives led by Sil Sorannan's Camp Pa'aal Squadron used a built-in slave circuit to hijack all Imperial vessels within the Yevethan fleet including Spaar's flagship Pride of Yevetha."}, {"tag": "p", "text": "With the Imperial ships in hyperspace en route for Byss, the remaining Yevethan warships refused to surrender. Despite being outnumbered five to one, they fought fanatically to the last forcing the New Republic to completely destroy the enemy fleet. With Yevethan military aggression halted, the New Republic fleet withdrew from the N'zoth system."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "In 16 ABY, the Yevethan Darama Nil Spaar opened communications with the dominant galactic government in the neighboring Core Worlds – the New Republic. Spaar himself arrived on the capital Coruscant supposedly to seek peaceful co-existence but actually to sow confusion and disruption prior to their planned Great Purge of all non-Yevetha in the Koornacht Cluster. Taking advantage of the Republic's lack of information on the Yevetha and Chief of State Leia Organa Solo's plans to seek an ally against the Imperial Remnant, Spaar sought to play into Solo's empathy for species subjugated by the Empire."}, {"tag": "p", "text": "Following the destruction of a Republic survey ship by a Yevethan patrol, Spaar initiated several political machinations that threw the Republic government into disarray. With the New Republic forced to withdraw its forces from the Cluster, Spaar returned to N'zoth and launched the Great Purge against all non-Yevethan colonies in the region. Due to the remote location of the Cluster and the division of the New Republic bureaucracy, Leia was unable to muster enough support for military intervention."}, {"tag": "p", "text": "However, two events changed Republic general sentiment. Firstly, Grannan pilot Plat Mallar's testimony of the Purge in the form of the Plat Mallar Tapes helped sway public opinion towards supporting retribution against the Yevetha. Secondly, the fleet shuttle Tampion was captured during a reconnaissance flight within the Cluster's borders. Among the passengers were General Han Solo—Leia's husband and the father of three young children—and Lieutenant Barth."}, {"tag": "p", "text": "The Viceroy continued his machinations against the Republic by claiming to an invoke an allegiance with the fictitious Grand Imperial Union. Attempting to use Solo as a bargaining chip, Spaar demanded that he persuade Leia to withdraw from the Koornacht Cluster permanently. When Solo refused, the Darama killed Barth right before his eyes. After the Battle of ILC-905 destroyed a Yevethan shipyard and several thrustships, Spaar personally beat Solo in a recorded transmission to the New Republic, demanding tersely that they leave Koornacht immediately."}, {"tag": "p", "text": "Unfortunately for the Dushkan League, the latter incident galvanized and outraged both the New Republic leadership and public who were now committed to supporting a military intervention against the League. Organa Solo, faced with a difficult decision, chose not to order a surrender or withdrawal but instead invoked an official declaration of war on the Yevetha. The New Republic then prepared for a pivotal confrontation, and sent the Fifth Fleet to engage the Yevetha fleet."}, {"tag": "p", "text": "Solo would later be freed by a group of Wookiees led by Chewbacca, who boarded the Pride of Yevetha and made their way to the cells. The Wookiees accepted the aid of a Fallanassi prisoner on board, who used her illusions to mask the group and to help the remaining prisoners escape. Spaar's breederies were damaged in the escape, infuriating the darama. Spaar was angered even more when he learned that Organa Solo had chosen to fight."}, {"tag": "h3", "text": "A Common Enemy"}, {"tag": "p", "text": "The full strength of the New Republic Fifth Battle Group arrived over the orbit of N'zoth. Running before the main body of the fleet were several reconnaissance stasis probes dispatched by Alpha Blue and the Navy. These stasis probes surveyed the expanses of the Yevethan military fleet in preparation for the battle. However, Primate Dar Bille had warning of the probes and ordered the fleet prepared."}, {"tag": "p", "text": "As the Yevethan and Republic fleets assembled in the surrounding space, Bille ordered the interdictor Splendor of Yevetha into position at the helm of the fleet to protect the flagship Super Star Destroyer Pride of Yevetha—formerly known as Intimidator. The Proctor of Defense Tho Voota commanded the Pride of Yevetha and its escort ships. In an attempt to reason with the Yevetha, the New Republic commander General Etahn A'baht demanded that the Yevetha surrender all occupied territory and free all hostages."}, {"tag": "p", "text": "Predictably, Spaar rejected these conditions and unleashed a barrage of verbal insults at his opponents to provoke them. However, the Yevetha were hit from a blow that no one suspected. For the war effort, Imperial prisoners from the Yevethan Uprising of 4 ABY had been dispatched to the ships of the Yevethan fleet. For more than a decade, these prisoners had been interned as skilled slave labor for Yevethan military projects on the moon Pa'aal."}, {"tag": "p", "text": "Over time, Sil Sorannan became the de facto leader of his fellow Imperial prisoners and formed a secret command group Camp Pa'aal Squadron, plotting to strike against their Yevethan overseers when the moment was right. Throughout those years, Sorannan and his shadow command adopted the Yevethan tactic of pretending to collaborate with the enemy until the time was right to turn the tables on them. They had secretly installed a built-in slave circuit in the Imperial-designed warships of the Dushkan League."}, {"tag": "p", "text": "With the Yevetha preoccupied against the New Republic, the moment had come. At the start of the battle, Sorannan and 512 other former Imperial prisoners crewed the Pride of Yevetha. While Nil Spaar verbally denounced his enemies, the Imperials staged their uprising and used the slave circuits to gain control of the Imperial starships in Yevethan hands. Armed with blasters and the element of surprise, the Imperials quickly gained the upper hand over the Yevetha."}, {"tag": "p", "text": "From the bridge of Intimidator, Sorannan informed the New Republic that he and Camp Pa'aal Squadron were rejoining the Empire, and the fleet entered hyperspace for the Deep Core. Though the Imperials and the New Republic were still officially enemies, the Imperials had less love for the Yevetha and were glad to help in their defeat. En route to their destination, Sorannan saw to it that Nil Spaar was deposited into hyperspace aboard an escape pod in revenge for his atrocities. As the escape pod lacked a hyperdrive, Nil Spaar was trapped in hyperspace, unable to revert to realspace—left for dead."}, {"tag": "h3", "text": "The Phantom Fleet"}, {"tag": "p", "text": "Due to the efforts of Camp Pa'aal Squadron, the New Republic now outnumbered the Yevetha five to one. Prior to the withdrawal of the Imperial ships, the Republic only outnumbered the enemy by three to one. All that remained now were 44 Aramadia-class thrustships and their D-type fighters. This left the Yevetha without a central fleet and without a leader."}, {"tag": "p", "text": "Undaunted, the Yevetha fleet continued to fight, although without Spaar and the Black Fleet, they were unable to best the New Republic. Despite efforts by A'baht to broadcast a second appeal of surrender to the individual commanders, the Yevetha continued their offensive. Fortunately for the New Republic, Jedi Master Luke Skywalker, who had been missing throughout the entire conflict to search for his mother with a Force-user named Akanah, had finally reappeared, accompanied by the Fallanassi Force Adepts."}, {"tag": "p", "text": "The Fallanassi aided the New Republic, using their Force powers to craft illusions of a Republic phantom fleet from the flagship Intrepid. This cut off much of the coordination with other Yevethan warships in the Koornacht Cluster. The Yevethan fleet was severely beaten by the Republic's ships, due mainly to the data gathered by the Republic at the preceding Battle of ILC-905."}, {"tag": "p", "text": "Three thrustships opened fire on the phantom elements of Task Force Token but inflicted no casualties. However, several Fallanassi on the Yevethan vessels died while remaining to create the illusion that there were still hostages onboard. In reality, all the hostages had been evacuated. These Fallanassi were killed during the ensuing fighting. Their deaths were felt by Skywalker and Wialu through the Force."}, {"tag": "p", "text": "With the Yevetha preoccupied with the phantom ships, A'baht launched several RZ-1 A-wing interceptors against the D-type fighter escorts. The Yevetha eventually penetrated the illusion when a senior Fallanassi, Wialu, who was creating the illusions, could not hold up under the strain, causing the illusions to disappear. The thrustships' superior deflector shields and spherical symmetry allowed them to absorb considerable damage and to focus their firepower on a smaller nature as opposed to the triangular and oval symmetry of the Republic vessels. However, the New Republic made up for this in numerical superiority."}, {"tag": "p", "text": "The Star Destroyer Yakez was destroyed when a pair of enemy warships battered her shields and caused the detonation of the forward batteries, tearing the starship apart. Six other warships ‒ Aboukir, Banshee, Fulminant, Garland Thunderhead and Werra ‒ were destroyed while the Endurance-class fleet carrier Ballarat was heavily damaged, destroying several nearby starfighters. While stationed aboard the cruiser Mandjur, Plat Mallar flew his shuttle on three rescue trip to save pilots; recovering a live one and two dead ones."}, {"tag": "p", "text": "Afterward, Mallar boarded the X-wing of his commanding officer, Captain Tegett (who was incapacitated) and joined the battle, eventually sacrificing his life ramming a Yevethan ship which was intending to ram Mandjur. His final act saved hundreds of lives, just as his desperate flight from Polneye guaranteed other worlds near Koornacht would not have to fear a second Great Purge. Near the end, the remaining thrustships launched fighters on kamikaze missions, damaging a number of Republic vessels. Despite the heavy losses, the New Republic fleet destroyed the entire Yevethan fleet present at the battle, ending the Black Fleet Crisis."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Following the complete military defeat of the Dushkan League, the New Republic disarmed the Yevetha and kept them under close watch. It is unclear how long the New Republic's close watch of the Yevetha continued, but active patrols were removed by at least 25 ABY. However, no one actually entered the N'zoth system in that decade, during which the Yevetha built up an even larger force than the Black Fleet, consisting of thousands of Aramadia-class thrustships."}, {"tag": "p", "text": "During the Yuuzhan Vong War (25 ABY – 30 ABY), the Galantos Guard made a deal with the extragalactic Yuuzhan Vong invaders. In exchange for what the Galantos believed to be protection from the extragalactic invaders, they informed the Yuuzhan Vong of the brutal Yevetha and the threat they may pose. Taking heed, the Yuuzhan Vong invaded the N'zoth system."}, {"tag": "p", "text": "The details of the battle may never be known, but if the Yevethan and Yuuzhan Vong tactics say anything, the Yuuzhan Vong destroyed every single ship in the system, and unleashed a horrible orbital bombardment on N'zoth that rendered the planet a molten wasteland. At the end of the conflict the Yevetha were either extinct or severely endangered."}, {"tag": "p", "text": "When the men of the Camp Pa'aal Squadron arrived at Byss, they discovered of the planet's destruction by the Galaxy Gun in 11 ABY. Without a clear authority, the remnants of Black Sword Command split up. Most of the warships defected to the New Republic while four Victory-class Star Destroyers joined the Imperial Deep Core warlords."}, {"tag": "p", "text": "Meanwhile, two Imperial-class Star Destroyers and the experimental warship EX-F joined Gilad Pellaeon's Imperial Remnant in the Outer Rim. However, the EX-F would meet its destruction during the climatic Battle of Anx Minor. The Intimidator left for the Unknown Regions. She was discovered in 21 ABY, wrecked and adrift near the Unknown Regions, with no clear evidence as to what she had encountered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}