{"url": "Battle_of_Naboo_(Imperial_Period)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the early Imperial campaigns", "Category:Battles of the Great Jedi Purge", "Category:Battles of Naboo"], "nodes": [{"tag": "h1", "text": "Battle of Naboo  (Imperial Period)"}, {"tag": "p", "text": "In 18 BBY, Queen Apailana of the planet Naboo broke off diplomatic ties with the Galactic Empire, leading the Empire to dispatch the 501st Legion to suppress the growing opposition on the world and retake Naboo."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Because of Queen Apailana's polite and subtle refusal to accept the New Order, the Empire harbored suspicions about her true allegiance."}, {"tag": "p", "text": "This state of unease kept up for one year, until Darth Vader found out that the Naboo were hiding Jedi refugees trying to escape the Great Jedi Purge. Vader ordered Apailana's execution on the charges of treason, but knowing her guards would expect the assassination attempt on her, he sent the 501st Legion, an elite group of stormtroopers, to deal with the Royal Naboo Security Forces."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Naboo's capital of Theed was immediately placed under siege by the 501st when the city would not surrender its queen, however, bold Naboo security guards defended their home with loyal soldiers and AAC-1 speeder tanks. The 501st Legion landed in the royal plazas and engaged the nearby Naboo soldiers, quickly securing their landing area."}, {"tag": "p", "text": "The Theed Royal Palace was well armed by a grid of powerful particle cannon turrets which were operated by a defense console grid near the palace gates; despite the opposition, Imperials succeeded in establishing a secure offensive surrounding the main gates."}, {"tag": "p", "text": "In order to buy time and prevent an escape by the queen, the 501st decided to surround the queen and her palace. Focusing all forces on three strategic locations, stormtroopers worked from right to left, and set up a line of defense. Commanders then managed to triangulate the exact position of the main defense grid console, thus allowing the Imperials a clear albeit difficult chance to neutralize the defense turrets."}, {"tag": "p", "text": "501st Legion stormtroopers, under support fire from a TX-130T fighter tank, worked their way onto the balcony where the auto-turret grid console was guarded. They saturated the area with grenades, killing the guards and destroying the console."}, {"tag": "h3", "text": "Death of the Queen"}, {"tag": "p", "text": "Imperial troopers skirmished with Naboo forces inside Theed Palace. Shortly after the deactivation of the defensive turrets, several Jedi Masters and Padawans the queen was previously suspected and accused of harboring broke free of the castle. The Jedi, though formidable, were outnumbered, surrounded by the elite Imperials, and ultimately exterminated, but not before they killed many of the stormtroopers that attacked them head on."}, {"tag": "p", "text": "Faced with no other choice, the queen and her small band of Jedi protectors attempted to flee in an act of desperation, driving themselves among the bulk of the Imperial forces; outmanned and outmaneuvered, the dwindling Jedi protectors were swiftly dispatched, and the queen was terminated."}, {"tag": "p", "text": "As seen in the journal entry of the retired clone trooper, a sniper hidden on a bridge shot the queen with a high powered sniper rifle; her escorts were surrounded and executed by stormtroopers thereafter."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The security and palace guards were taken prisoners and were said, like many of the Empire's captured enemies, to \"disappear\". They were in fact transported to the secret, under-construction Death Star for safekeeping. Most would join Rebel inmates and die fighting in the later Death Star Uprising."}, {"tag": "p", "text": "To cover up the incident, the Empire declared that terrorists had attacked Theed Palace and the 501st Legion had arrived to stop the chaos, the Queen being killed \"just before she could be saved\" amidst the intense assaults. The Royal Security Forces never got a say in the matter, however."}, {"tag": "p", "text": "An Imperial Officer overseeing the stormtrooper's efforts said that it would intimidate potential uprisers into submission, and that it would \"save countless lives\", but it ultimately would have the opposite effect."}, {"tag": "p", "text": "On Naboo, the Empire would proceed to install a puppet monarch and government (headed by Queen Kylantha) which would not be rebellious in any aspect. The Royal Naboo Security Forces was profoundly limited to a more individualized group of a select few bodyguards (allowed to be chosen by the monarch) who, it was believed, would never have enough strength to initiate another uprising."}, {"tag": "p", "text": "Nonetheless, the remainder of the security forces, along with other Naboo opposed to Imperial rule and supported by Gungan Rebels, were able to rise up against the disorganized Empire during the Uprising on Naboo in 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Naboo first appeared in the Pandemic Studios video game Star Wars: Battlefront II, which was released on November 1, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}