{"url": "Battle_of_N%27zoth_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Battle of N'zoth  (Yuuzhan Vong War)"}, {"tag": "p", "text": "A battle at N'zoth occurred during the Yuuzhan Vong War. In 28 ABY, the conflict was a result of intelligence passed to the Yuuzhan Vong by the Fia of Galantos, who feared the nearby Yevetha's new battle fleet."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 28 ABY, the Yuuzhan Vong invasion was in its fourth year. The Galantos Guard came across the Yuuzhan Vong and, informing the extragalactic forces of the threat posed by the proximal and potentially resurgent Yevetha—a deadly species who had been defeated years earlier—and their new fleet of Aramadia-class thrustships, appealed to them for protection from the Yevetha. The Yuuzhan Vong agreed to this, and invaded the Yevethan homeworld of N'zoth. Despite the Yevetha possessing a formidable fleet of several thousand thrustships, dozens of capital vessels and a large battle station, the Yuuzhan Vong entered the fray with vastly superior numbers, and routed the Yevethan forces."}, {"tag": "p", "text": "With the orbital component of the battle thus completed, the Yuuzhan Vong pounded N'zoth from orbit, reducing its surface to a cratered mess. Every piece of the Yevethan civilization was utterly expunged. The Yuuzhan Vong persisted in hunting down the Yevetha throughout the Koornacht Cluster, leaving seven thousand Yevetha still living by the end of the war."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Upon learning of the Yevethan threat from the Fia, Jedi Jaina Solo and two Chiss pilots, Miza and Jocell, traveled to N'zoth to scout out the Yevethan activity in the system, unaware of the carnage wrought by the Yuuzhan Vong. They discovered the remains of the fleet and a devastated N'zoth. A Yevethan survivor was thereafter encountered; this individual detonated his thrustship and killed Miza in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of N'zoth, or, rather, its aftermath, appears in The New Jedi Order: Force Heretic I: Remnant by Sean Williams and Shane Dix, released in 2003."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}