{"url": "The_Old_Republic:_Deceived", "categories": ["Category:Real-world articles", "Category:Old Republic novels"], "nodes": [{"tag": "h1", "text": "The Old Republic: Deceived"}, {"tag": "p", "text": "The Old Republic: Deceived is a book written by Paul S. Kemp. It is a tie-in to the Star Wars: The Old Republic online game. It was released on March 22, 2011. The paperback version, published on May 29, 2012, includes an introduction to Fate of the Jedi, including character portraits and the first chapter of Fate of the Jedi: Outcast."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Back cover"}, {"tag": "p", "text": "Our time has come. For three hundred years we prepared; we grew stronger while you rested in your cradle of power believing your people were safe and protected."}, {"tag": "p", "text": "You were trusted to lead the Republic, but you were deceived, as our powers of the dark side have blinded you…."}, {"tag": "p", "text": "You were deceived and now your Republic shall fall."}, {"tag": "p", "text": "—from The Old Republic: Deceived"}, {"tag": "h3", "text": "Inside flap"}, {"tag": "p", "text": "The second novel set in the Old Republic era and based on the massively multiplayer online game Star Wars: The Old Republic ramps up the action and brings readers face-to-face for the first time with a Sith warrior rival to the most sinister of the Order's Dark Lords—Darth Malgus, the mysterious, masked Sith of the wildly popular \"Deceived\", \"Hope\" and also \"Return\" game trailers."}, {"tag": "p", "text": "Malgus brought down the Jedi Temple on Coruscant in a brutal assault that shocked the galaxy. But if war crowned him the darkest of the Sith heroes, peace would transform him into something far more heinous—something Malgus would never want to be, but cannot stop, any more than he can stop the rogue Jedi fast approaching."}, {"tag": "p", "text": "Her name is Aryn Leneer—and the lone Knight that Malgus cut down in the fierce battle for the Jedi Temple was her Master. And now she's going to find out what happened to him, even if it means breaking every rule in the book."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel begins with Darth Malgus leading the attack on the Jedi Temple as it precedes the Sacking of Coruscant. During the Jedi-Sith battle in the Temple, Malgus ends up in a fight against Jedi Master Ven Zallow, and it ends with Malgus killing Zallow by impaling him on his lightsaber. Soon, all of the Jedi are killed and the Sith Empire begins its attack on Coruscant. The Jedi Temple is then destroyed, burying all of the dead in it. Malgus expects a full-scale bombardment on Coruscant, but what he learns from Darth Angral brings much contempt and disgust: the Empire was making a peace treaty with the Galactic Republic. Throughout the day, he secretly begins to suspect that his superiors, including the Sith Emperor, have brought doom upon the Empire by bringing about peace. Only through conflict can one's understanding of the Force be achieved and Malgus firmly believes this."}, {"tag": "p", "text": "On Alderaan, where the Jedi and Sith are trying to work out the peace treaty, the Jedi delegation sense through the Force the horrors committed by the Sith on Coruscant. Despite this, or rather because of it, as the Sith are using the capture of Coruscant as leverage in the peace talks, the negotiations continue, much to the chagrin of Jedi Knight Aryn Leneer who had sensed her Master Zallow's death in the Force. Aryn then secretly turns her back on the Jedi Order to go to Coruscant, find out who killed Zallow, and kill the murderer. To get to the recently-captured Coruscant, however, she enlists the help of former Republic soldier, now spice runner, Zeerid Korr. Zeerid, meanwhile, also needs to get to Coruscant in order to deliver a shipment of engspice on time for a criminal organization called The Exchange. Unfortunately for Zeerid, he is spied upon by the likes of former Imperial sniper Vrath Xizor, who is working for the Hutts, who are rivals of The Exchange. Knowing that Zeerid is supposed to deliver the engspice to Coruscant, Vrath arrives to Coruscant ahead of time from Aryn and Zeerid to tell Darth Malgus, now overseer of the Imperial blockade, of Aryn and Zeerid's arrival on Coruscant. Malgus heeds Vrath's provided information, and by the time Aryn and Zeerid arrive, Zeerid's ship, the Fatman, is attacked by the Sith fleet. It manages to get to Coruscant, but it is soon blown out of the sky. Aryn and Zeerid survive thanks to Aryn's use of the Force, and they land relatively safely to Coruscant's surface."}, {"tag": "p", "text": "Though Zeerid failed to deliver his shipment of engspice, he still agrees to help Aryn in her investigation as to who killed Zallow. They travel underground through the Works and follow the late Zallow's astromech droid companion T7-O1 to get to the underground recordings of the Temple by the time of the attack. Aryn learns that it was Malgus who killed Zallow, and vows to avenge her Master. Zeerid, meanwhile, wishes to find a spacecraft that can get him back to his home planet of Vulta so he can get to his daughter, Arra Yooms, before The Exchange reach her. Since The Exchange can very well kill Arra and her aunt, Natala, because of Zeerid's debts to them, and because Vrath Xizor learned of Zeerid's family by spying on him, Arra and Natala could very well be in danger."}, {"tag": "p", "text": "Soon, as Aryn returns to the destroyed Jedi Temple, she confronts Darth Malgus, who had been waiting for her since he learned that she was looking for him in vengeance for Master Zallow's death. Their fight is cut short before a clear winner can be determined when Zeerid arrives to pick Aryn up, as killing Malgus in vengeance will lead Aryn down a dark path. Aryn only agrees so that she can get a greater vengeance on Malgus by targeting his Twi'lek lover, Eleena Daru, so that he will know the pain that Aryn suffered when Master Zallow died. Both Aryn and Zeerid find their respective goals at a spaceport, where Aryn prepares to kill Eleena, but finds that killing her would disgrace everything that Master Zallow taught her. She again confronts Malgus just as Zeerid leaves with a ship of his own, which just so happens to be the ship owned by Vrath Xizor. Zeerid and Vrath get into a fight in the ship's cargo hold, and Zeerid wins the fight by beating Vrath to a bloody pulp. After Zeerid takes over the ship, the Imperial blockade allows him to leave under Malgus's permission after Aryn threatened to kill Eleena if he didn't let Zeerid go. Afterward, Zeerid kills Vrath by shoving him out of the ship's air lock so that he wouldn't be able to tell The Exchange or anyone else about Arra and Natala's relation to Zeerid."}, {"tag": "p", "text": "Malgus defeats Aryn in their second fight, but instead of killing her, he allows her to leave Coruscant after she spared Eleena's life. Malgus then kills Eleena after confessing his love to her, seeing her as a weakness to himself that he can no longer afford to worry himself over."}, {"tag": "p", "text": "In the aftermath, a peace treaty is signed between the Republic and the Empire, and the latter disbands its occupation of Coruscant. In his disappointment over how peace will reign through the galaxy as a result, Malgus intends to take over the Empire himself, starting by killing his political rival Lord Adraas. Zeerid, meanwhile, is able to buy a farm and prosthetic legs for his daughter Arra, who lives with her now while Natala has a place of her own. Aryn eventually finds Zeerid, telling him that she quit the Jedi Order so that she can be with him."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the paperback version (at least), the word 'kriffing' is misspelled 'kniffing' on page 280."}, {"tag": "p", "text": "James Luceno was originally the author before his back-story for Malgus was rejected by BioWare and Lucasarts and Paul S. Kemp was asked to write it. Part of Luceno's original outline for Malgus included him being a former slave and hardened in Gladiator combat. Luceno later re-worked that back-story into Darth Maul's history in his new novel Darth Plagueis. Some of Kemp's darker details of Malgus and the Sith were removed from the final version. Part of the content cut from the final story includes a scene where the triumphant Sith play a game of ball with the severed heads of the slain Jedi."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}