{"url": "The_Paradise_Detour", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "The Paradise Detour"}, {"tag": "p", "text": "The Paradise Detour is a comic strip written by Archie Goodwin and illustrated by Al Williamson. It was published by the Los Angeles Times Syndicate in 1983. It was collected in the trade paperback, Classic Star Wars Volume 3: Escape to Hoth."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Millennium Falcon experienced navigation computer problems and landed on a planet for repairs. While Han Solo tried to fix the ship, Luke Skywalker went off to explore."}, {"tag": "p", "text": "He saw a woman from his past, Tanith Shire, caught by some sort of monstrous plant. He freed her with his lightsaber, but she ran off into the forest and he gave chase. When he caught her, Luke saw she was not really Tanith Shire. They both fell into the river. When they got out, she told him her name was S'ybll, and that the air of her planet could be intoxicating. As they walked, Luke saw stormtrooper armor. He pulled out his lightsaber to slash it, revealing an empty suit. S'ybll explained she used it to scare off attackers, as this could be a dangerous planet. Seeing a damaged Lambda-class shuttle, Luke commented on how odd it was to have this near one's home, but S'ybll testily replied it had been there before her. Suddenly, they were attacked by something that looked like the Night Beast, which had previously plagued the Rebels. Running away, Luke slipped and fell. Then his mentor, Obi-Wan Kenobi, appeared to him and told him he must go protect his new companion, S'ybll. Luke then fainted."}, {"tag": "p", "text": "When he woke, there was a cloth over his eyes. S'ybll told him not to remove it, but he stood up upon hearing C-3PO trying to contact him on his comlink, which he thought he'd lost in the river. He thus saw S'ybll's true form, that of an old woman. She told him he was now under her spell. He tried to escape from her, but she entered his mind to drain his life force. She was a mind-witch, and had been casting illusions on him as distractions. She projected an illusion of Darth Vader. Luke realized that he must remain calm, and the illusion disappeared as Vader's phantom lightsaber passed through him. Angered, S'ybll tried to kill him by throwing a tree at him. Luke dodged, so S'ybll tried to hit him from multiple directions. Luke ran towards her, and her final attempt ended up killing her as she drained the last of her power. Luke rejoined his friends and they continued their journey to Echo Base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}