{"url": "The_Padawan_Path", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "The Padawan Path"}, {"tag": "p", "text": "\"The Padawan Path\" is the fourth episode of the first season of the animated micro-series Star Wars: Forces of Destiny. It was released on July 6, 2017. The episode takes place between The Clone Wars: Season Three episodes \"Hunt for Ziro\" and \"Heroes on Both Sides\" and focuses on Ahsoka Tano."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "On her way to a Jedi ceremony, Ahsoka leaps into action to stop a malfunctioning droid."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Having finished patrolling the streets of Coruscant, Ahsoka is heading to the Temple where Anakin and Yoda are waiting for her to start a ceremony."}, {"tag": "p", "text": "While hurrying to get to the temple, she hears someone in the crowd scream for help. Following the scream she sees a female Aleena and her child being attacked by a malfunctioning droid. She Force-pushes some crates to take down the droid, but this does not work, so she ignites her lightsabers. As the droid nears her, she spots water pipes running above the alley they are in and comes up with a plan. She sprints at the droid, slicing one of its legs, and then leaps and slices the water pipes above them. Water gushes out of the broken pipes, causing the droid to deactivate. After checking that the mother and child are all right, she remembers that she is late for the ceremony and hurriedly rushes to the temple."}, {"tag": "p", "text": "She arrives at the training grounds near the Great Tree, where Anakin and Yoda are waiting for her. While Anakin scolds her for being late, Master Yoda states that Ahsoka has been humble and brave, which he sees as a sign of maturity. As the ceremony begins, he tells her that she is on the right path to becoming a Jedi Knight, and gives her an extension to her Padawan braid."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}