{"url": "The_Path_Ahead", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "The Path Ahead"}, {"tag": "p", "text": "\"The Path Ahead\" is the seventh episode of the second season of the animated micro-series Star Wars: Forces of Destiny. It was released on March 19, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Struggling with his Jedi training, Luke is grateful for master Yoda's offer to join him on a sojourn through the trees and swamps of Dagobah, until he learns that Yoda will be riding in his backpack! Minding Yoda, Luke learns to trust what he feels instead of what he thinks he sees."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Dagobah, Yoda and R2-D2 are watching Luke Skywalker as he trains as a Jedi. Luke exclaims that he got it but Yoda disagrees. Luke then falls off a tree. Yoda tells him that he must concentrate. Luke protests that he was and tells Yoda that for a moment he could see a path through the trees. Luke admits he didn't want Yoda to miss it. Yoda points out that he missed the branch. Yoda surmises that Luke's mind is ahead of his body. Luke says he will give it another go and Yoda responds that he will come with him this time."}, {"tag": "p", "text": "Luke says it will be easier if he can follow Yoda but Yoda tells him that Luke will carry him instead. Luke is incredulous and says that he can't look out for himself. Yoda tells Luke to concentrate or they will fall. Yoda admits it will be worse for him then Luke while R2-D2 beeps. Luke carries Yoda in a backpack on top of a tree. When Skywalker asks where they should go, Yoda remarks that some paths are clear while others are perilous. He tells Luke that his mind and body must walk the same path before telling Luke to run."}, {"tag": "p", "text": "Empowered by the Force, Luke leaps and runs over the giant branches. Luke steps on a broken branch, and he and Yoda fall. R2-D2 squeaks in fright, but Luke manages to grab a trunk. Luke says it is enough for today, but Yoda tells him to close his eyes. Yoda then tells a blind Luke not to concern himself with what he sees but rather to see inside the trees and branches and to feel their air. Yoda covers Luke's eyes with his hands and tells him to run. Luke leaps over the branches and trees using the Force as his guide."}, {"tag": "p", "text": "When they come to a stop, Luke tells Yoda that he could see the branches in his head and could also see a path. Yoda smiles and tells Luke to trust what he sees and not what he thinks that he sees. Luke understands, and Yoda tells him that they will now climb the vines, which are more difficult than the trees. R2-D2 beeps as Luke whines about having to do more climbing. He asks Yoda if they are trying to get somewhere, and Yoda says, \"always.\""}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}