{"url": "The_Phantom_Clone", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:LEGO Star Wars: The Yoda Chronicles"], "nodes": [{"tag": "h1", "text": "The Phantom Clone"}, {"tag": "p", "text": "\"The Phantom Clone\" is the first episode of LEGO Star Wars: The Yoda Chronicles. It aired on May 29, 2013 on Cartoon Network."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "It is a time of grave peril as the Clone Wars rage through the galaxy with no end in sight. But the Sith, lead by the sinister Palpatine and his henchman Dooku have concocted a plan that may about the downfall of the Republic."}, {"tag": "p", "text": "General Grievous, in his Starfighter, ambushes two Z-95 Headhunters and confirms to Dooku that the plan is going perfectly while venturing to Coruscant. At the Jedi Temple, Yoda displays to Vaash Ti, Rako, Bobby and Bene the courage of Anakin Skywalker while C-3PO brags of his connection to Anakin when he suddenly feels a disturbance and a powerful threat through Force."}, {"tag": "p", "text": "Darth Sidious instructs a holographic Grievous to launch the attack and sarcastically adds 'a week from now' and then transforms back into Supreme Chancellor Palpatine in order to inform Yoda of a distress call from Obi-Wan Kenobi on Alderaan. Grievous calls back to make sure Sidious was being sarcastic and Sidious says to launch it now. He then transforms back into Palpatine but realizes that he's still chatting with Grievous. He ends up getting confused and frustrated with the transformations and gives up. Yoda puts C-3PO in charge of his Padawans and sets out with Mace Windu, R2-D2 and CC-2224 in a Republic Gunship to rescue Obi-Wan. As they leave, Grievous breaks into the Holocron Vault and attacks the students. The Republic Gunship looms over Alderaan and answers Obi-Wan's plea, only to discover that he sent no distress call. Admiral Ackbar announces the trap as Separatist ships fly in for the kill."}, {"tag": "p", "text": "Grievous steals the padawans' Lightsabers, and the children attempt to attack him. As Yoda, Mace, and R2-D2 attempt to hold off the invasion of Vulture Droids, Tri-Fighters and Star Destroyers, Admiral Gial Ackbar and Cody make the jump to lightspeed as the gunship splits in half, leaving Mace, Yoda and Artoo stranded in space. As Grievous escapes in his Starfighter, the padawans, ignoring Threepio's protests, jump onto their school bus and attempt to track their weapons through the force. Bene reveals her modified engines on the bus, which shoots the gang into lightspeed, hurling to Tatooine."}, {"tag": "p", "text": "Yoda and Mace splash into the murky water of Dagobah (Artoo has a parachute). As they set up camp, the two Jedi begin wondering who the hidden Sith Lord is, completely ignoring R2-D2's theory that it's Palpatine. Vaash Ti and the other land on Tatooine as Jabba the Hutt runs over C-3PO in his sail barge, and is holding the lightsabers. The gang pursues. As R2-D2 gives up, Lindo Calrissian and his son Lando land in the discoed-out Millennium Falcon and rescue the Jedi."}, {"tag": "p", "text": "C-3PO knocks on the doors of Jabba's Palace and begins insulting Bib Fortuna and Malakili, who then send the Rancor after him. The padawans infiltrate the palace, sneak past the Gamorrean Guards and get the lightsabers, which are non-operational because the Kaiburr crystals are missing. Bobby accidentally wakes Jabba, but luckily the padawans free Young Han Solo from a block of carbonite and meet up with C-3PO, who rides the rancor to safety."}, {"tag": "p", "text": "On Kamino, Grievous and Count Dooku use the Kaiburr crystals to form an all-powerful crystal, to power their cloning chamber. Darth Sidious thanks them through hologram, and the Sith Clones begin to form. The Disco Falcon speeds towards Coruscant, C-3PO contacts them through hologram, and Bobby fills Yoda in on what's happened. Lindo turns on the hyperdrive engine and make a rainbow jump to Lightspeed towards Kamino. As the Calrissians epart, Artoo and the Jedi break into the cloning chamber, but are stopped by Grievous. Luckily, Yoda force pushes Grievous into a pit and Mace battles Dooku. As Dooku gain the upper hand, Yoda grabs him and throws him at the Kaiburr crystal, deactivating the cloning chamber before the clones can activate - except for one."}, {"tag": "p", "text": "Jek-14 activates and begins rebuilding the palace as Yoda battles Dooku and Grievous regains consciousness and ambushes Mace. C-3PO senses that Artoo is in danger through the power of Wifi and the Padawans depart to Kamino. Outside, Grievous begins rusting in the rain and Mace rips his Blaster away from him. As Jek tortures a lightsaberless Yoda, Yoda grabs the blaster from Mace and fires at Jek, but the Sith Clone reflects them and sends the Jedi right back outside, knocking over Grievous as well. Dooku takes the crystal and begins reactivating the cloning machine as Jek prepares to finish the Jedi off. He force-chokes Yoda into unconsciousness but stops before he can kill him, which baffles everyone. Before anyone can ask, the school bus arrives and begins to detonate the cloning chamber with a giant laser cannon that Bene had added. Yoda and Mace jump on the ship, Artoo flies out of the palace with the crystal and the heroes escape the remains. Dooku and Jek hop in a Mandalorian Speeder and evacuate as the planet of Kamino collapses in a fantastic lightshow."}, {"tag": "p", "text": "Back in the Holocron Vault, Yoda congratulates the padawans with his own celebratory stickers, and reveals his intentions to hunt down Jek to the last brick. On Geonosis, Dooku reveals Jek to Darth Sidious. Grievous arrives from the ocean with a life tube and the Sith celebrate their 'victory'."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}