{"url": "The_One", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Males", "Category:Rakata", "Category:Unidentified political figures"], "nodes": [{"tag": "h1", "text": "The One"}, {"tag": "p", "text": "The One was the leader of a Rakatan tribe known as the Black Rakata, who settled on Lehon beneath the Star Forge. He favored barbarism and cannibalism, forsaking the civilized ways of the Elders, a faction of Rakata who worked to use the technology of old to restore order and help the survival of the ancient knowledge and traditions of the Infinite Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The One was raised in poverty without the guidance of elders, and so learned to rely on his own strength. When still young, he killed a Mandalorian who had been stranded on Lehon, a feat that earned him the respect of the others in his tribe. By the time he was an adult, he had earned such a reputation amongst his tribe that when he challenged the current chieftain, the chieftain surrendered his life without a fight and the One took command. The One soon led his tribe to conquer the other tribes on his island, killing those who stood in his way and uniting the rest."}, {"tag": "p", "text": "Soon, his armies had spread beyond the sea, conquering all islands within a month's sail and growing his army still more with every conquest. Word eventually reached him of the Temple of the Ancients, and he recognized the power it contained. Omens convinced him to set out to take the Temple, and gathering a thousand warriors he set sail. However, he soon discovered that the Temple was sealed to those who did not know the sacred words. After 20 years of unstoppable conquest, the One found himself at an impasse. Rebellion soon broke out amongst the conquered tribes, but the One, convinced that only the power within the Temple could bring unity to the Rakatan people, remained on the island, searching for a way in."}, {"tag": "p", "text": "Shortly after arriving, he was visited by Darth Revan, who also sought a way to enter the Temple. The One agreed to help him as long as he stole an ancient tome from the Elders, one that contained the sacred words needed to open the Temple doors. The presence of the Elders had been a surprise to the One, and their mastery of technology baffled him. He had trained rancors and other warriors to break through the Elders' defenses, but all had been killed. The One knew Revan could take the tome, for he had the Force, which the Rakata called \"strange magics.\" Revan visited the Elders and with their help entered the Temple, but never gave the secret to the tribe of the One."}, {"tag": "p", "text": "Years later, Revan returned, again in search of the Star Forge, and was brought before the One after he used the Force to kill several Rakatan warriors. The Rakatan chieftain again sought his help, but Revan sided with the Elders for a second time, and killed the One, since he was known not to negotiate easily."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The player also has the choice to exterminate the Elders for the One, earning dark side points. A few of the Black Rakata have studied the Elders' ritual to lower the temple's shield and aid you in entering it. The player can return to the One's village and kill him and his tribe if desired. If the player use the Elders databanks and claim that you are a slave of the Elders, the One will find out and the Black Rakata will be hostile."}, {"tag": "h2", "text": "Appearances"}]}