{"url": "The_Raich", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "The Raich"}, {"tag": "p", "text": "\"The Raich\" is the fifth episode of the second season of Ewoks. Written by Michael Reaves and directed by Dale Schott, the episode originally aired on ABC on September 27, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The magical cap"}, {"tag": "p", "text": "While searching the forest for Sparkle seeds, Wicket Warrick and Latara are pursued by a Zomba. Wicket leads Latara into a dead end tree trunk. Cornered, Wicket makes a stand against the Zomba and charges at the creature. He topples the creature only to discover that it was masked Teebo, who wanted to show his friends a costume he had made for the Shadow Night Festival."}, {"tag": "p", "text": "Latara is annoyed. An infatuated Teebo asks her out for a date but she rebuffs him. Latara is infatuated with another Ewok named Tak. Latara resumes looking for some sparkleseeds. Wicket admits that he doesn't have a costume but then spots a shiny golden cap on a dead tree trunk. Teebo warns Wicket that he read about a special magical cap in one of Master Logray's scrolls. Wicket is not deterred and climbs up the tree to retrieve the magical cap."}, {"tag": "p", "text": "Wicket's actions however awaken the tree, which turns out to be a gigantic monster known as the Raich. The Raich confronts the three Ewoks who flee out of the clearing. The creature demands the return of his cap, prompting Wicket to throw it back. However, the cap shatters in the Raich's claws, prompting him to roar in triumph."}, {"tag": "h3", "text": "Enchanting the animals"}, {"tag": "p", "text": "Meanwhile, Princess Kneesaa is riding her pet bordok Baga. Tonight will be her first night attending the Shadow Night Festival and she hopes that her costume is okay. While riding Baga, she plucks several Tala oats, which she gives to Baga. Baga is spooked by the appearance of the angry Baga, causing him to throw Kneesaa into a large flower. As Kneesaa calls for help, Baga is entranced by the Raich and follows the creature."}, {"tag": "p", "text": "Kneesaa resolves to save Baga and uses a grappling hook to extract herself from the tree. She soon encounters Wicket, Teebo and Latara, who are fleeing the monster. Kneesaa wants to go but Wicket tells her that this is a job for a warrior. Latara cautions that this is the attitude that got them into this mess. Teebo suggests that they seek Master Logray's advice. Kneesaa agrees but tells them to hurry up."}, {"tag": "p", "text": "Meanwhile, the entranced Baga leads the hungry Raich into the bottom of Bright Tree Village. An Ewok leads a pack of horned bordoks up a gangplank. The two creatures are startled by the Raich and flee towards the creature, which entrances them. Elsewhere, a pack of poultry break free of a cage and fly away. Wicket and Kneesaa dodge the flock. Kneesaa realizes that the animas are under a spell like Baga."}, {"tag": "h3", "text": "An old enemy"}, {"tag": "p", "text": "Logray discusses the situation with Chief Chirpa and surmises that the Raich is on the loose again. Chirpa says that no Ewok is foolish enough to set the monster free and would be branded a disgrace to their tribe. This startles Wicket and Kneesaa. Logray uses a spell to summon one of his scrolls."}, {"tag": "p", "text": "Consulting the scroll, Logray reads that the Ewoks in the past were troubled by a terrible forest creature called the Raich, which put a spell on the forest animals and led them away to be eaten. The only thing that could stop the Raich was a magical cap made by the two-headed Gonster of the Twin Hills. The Ewoks tracked the Raich to its lair. Following a long battle, the Ewoks defeated the Raich and placed a magical cap on it which transformed it into a harmless tree. Wicket and his friends discuss the situation. To save Baga, Wicket proposes that they seek the two-headed Gonster and get him to make a new magical cap."}, {"tag": "h3", "text": "A perilous quest"}, {"tag": "p", "text": "The young Ewoks travel in hang gliders to seek out the Raich. Teebo travels Latara, telling her he has been planning to built a new one due to the tattered state of his sails. Wicket leads them to the Twin Hills. While flying there, Teebo tells Latara that he heard that Tak asked Asha to go to the festival with him. This turns Latara against Tak and she vows to give him a piece of his mind. Teebo tells her to be careful with the glider as they dive. She instead decides to ask Big Bert to date her instead. They are tailed by a cloud-like creature known as a Hoosha."}, {"tag": "p", "text": "Meanwhile, the Raich feasts on several animals. Baga is kept in a cage with a chain round his neck. The monster is still hungry and approaches Baga. However, he thinks that the bordok is too skinny and forces him to eat hay."}, {"tag": "p", "text": "Elsewhere, the hoosha stalks the Ewoks and unleashes bolts of electricity. The Ewoks are forced to dodge the flying creature. The hoosha shoots down Teebo's glider, causing him and Latara to fall out. Wicket and Kneesaa catch them with their glider but the weight of the two extra passengers causes the frame to catch. As the glider descends, the hoosha opens its maw to greet the young Ewoks."}, {"tag": "p", "text": "Wicket convinces the other Ewoks to shift their weight to the left, dodging the hoosha. The hoosha fires bolts of electricity. Despite this, the Ewoks manage to land their glider on a hill. The Ewoks are safe but covered in sand. Latara grumbles but Kneesaa is relieved. The hoosha is about to finish them off. Wicket tries to stand his ground."}, {"tag": "h3", "text": "Customers of the Gonster"}, {"tag": "p", "text": "However the two-headed Gonster soon arrives and chastises the hoosha for scaring his customers. He fees the hoosha a treat and the creature flies away. The Gonster describe the hoosha as their pet. The cleanshaven Gonster says the Duloks paid him a top rate to get the hoosha off their hands. The mustached Gonster argues that it was the Dragon Riders of Poolok. Teebo recognizes them as the two-headed Gonster."}, {"tag": "p", "text": "When the Gonster asks what their errand is, Wicket tells them that they need their help to deal with a monster. The cleanshaven Gonster says that they have come to a right place, citing their motto \"Got a monster, call the Gonster.\" The mustached Gonster argues that it was \"No beast too mean for us to clean.\" The pair start to argue but Kneesaa pleads for them to help before the Raich eats her pet bordok Baga."}, {"tag": "p", "text": "This startles the Gonster with the cleanshaven one asking who is stupid enough to let him loose. Wicket admits that he removed the cap and that the creature tore it up. The mustached Gonster chastises Wicket for voiding the warranty. Kneesaa cries that she will never see Baga again. She asks if there is something they can do."}, {"tag": "p", "text": "The Gonster decide to help but proceed to argue about the hoosha being their pet. Teebo nearly falls over a log bridge but is helped by Latara. At the Gonster's hut, the two tell the Ewoks that it will take a while to stall the Raich. Wicket volunteers to go and stall the monster. Kneesaa offers to come. The Gonster tells the Ewoks to give a Dream flower potion to the Raich, which will put him to sleep. They tell the Ewoks that the Gonster resides at the edge of the Dead Forest. The hoosha is tasked with ferrying the Ewoks there. Wicket tells Teebo and Latara to stay and wait for the magic gap. Latara grumbles about having to miss the Shadow Night Festival."}, {"tag": "h3", "text": "Lair of the Raich"}, {"tag": "p", "text": "Wicket and Kneesaa ride the hoosha to the Dead Forest. Wicket spots the Raich's cave and tells the hoosha to take them down. He thanks the creature for the ride. The two Ewoks hide behind rocks while the Raich chomps on some meat and bones. Wicket says that he will put the dreamflower potion in his water."}, {"tag": "p", "text": "Baga begins stirring when Kneesaa approaches. Kneesaa whispers for him to be quiet and leads him away. Meanwhile, Wicket sneaks up behind the Raich. Before he can drop the potion into the bowl of water, the Raich drinks from it. Wicket tries to climb onto the bowl but ends up causing it to tip over. The water spills out onto the stony floor of the cave. The Raich corners him and grabs him.  Kneesaa tries to attack the Raich but Wicket tells her to run. She and Baga flee but the Raich captures them. He holds the three of them in his hands."}, {"tag": "h3", "text": "The new cap"}, {"tag": "p", "text": "While Latara waits impatiently at the Gonster's cave, the cleanshaven Gonster says they need dried wank's eye. Teebo fetches the ingredients but the mustached Gonster says that they did not use wank's eye but dorg's ear. As Teebo rushes to follow their instructions, the two-headed being argues. Teebo trips and tips over a jar of sparkleseeds. Teebo suggests sparkleseeds and Latara wants to add them to her costume."}, {"tag": "p", "text": "The cleanshaven Gonster says that those go at the end of the potion. The mustached Gonster says that without it the spell won't work. He tells the Ewoks to put the cap on the Raich and it may go to sleep again. The two heads then argue about their motto."}, {"tag": "p", "text": "As Latara and Teebo prepare leave on their repaired glider, the Gonster reminds them to pour sparkleseeds on the cap before they use. The cleanshaven one says one handful but the mustached one thinks it was two handfuls. As the Ewoks leave, the Gonster heads argue. Observing the argument from above, Teebo tells Latara that they make a pretty good team and invites her to the festival. Latara dismisses him as a \"lurdo.\""}, {"tag": "h3", "text": "Showdown with the Raich"}, {"tag": "p", "text": "Approaching the Dead Forest, they see a line of animals outside the Raich's cave. Realizing he has summoned more animals, they deduce that Kneesaa and Wicket failed to put it to sleep. Latara adds that they are in trouble and asks what they can do. Teebo says that they will get them out of it and proposes disguising himself as a Zomba. As he joins the queue, Latara warns him to be careful."}, {"tag": "p", "text": "The disguised Teebo infiltrates the cave where he finds Wicket and Latara tied up. Having eaten his full, the Raich goes to bed. Teebo frees his friends while the monster snores. They tiptoe through the cave with Baga but Baga steps on a branch, which awakens the Raich. The monster pursues them out of the cave. They flee with Latara, who passes Wicket the magic cap."}, {"tag": "p", "text": "Wicket stands his ground and dodges the monster. Latara and Teebo are chased up a tree by a Zakool that has been enchanted by the Raich. Under the Raich's spell, Baga charges at Kneesaa and she jumps out of harm's way. Wicket swings round a tree and manages to plant the magic cap on the monster. However, it doesn't work and the monster grabs the cap."}, {"tag": "p", "text": "Teebo recovers the cap and tells Latara that they forgot the sparkleseeds. Latara and Teebo debate about putting two handfuls but decide to use them all up to be safe. Teebo throws the magic cap to Wicket. Wicket charges at the Raich and uses a young tree to bounch onto the monster's head. He plants the cap on the Raich, turning it back into a tree. Latara and Teebo fall of their branches and land on a bush. The Zakool ceases being hostile and runs away."}, {"tag": "p", "text": "Meanwhile, Baga returns to his normal, docile self and Kneesaa embraces him. Kneesaa hugs Wicket, who says he is almost a warrior. Wicket wants to add something to his Belt of Honor. However, Latara warns him that they have to hurry for the Shadow Night Festival."}, {"tag": "h3", "text": "Shadow Night Festival"}, {"tag": "p", "text": "At Bright Tree Village, the Ewoks celebrate. Latara sulks that nobody asked her to go to the festial. She sees that Teebo is lonely and invites him to dance with her. Latara accepts her invitation and the two dance. Latara warns her that this isn't a date and tells him to put his mask back on."}, {"tag": "p", "text": "Meanwhile, Chirpa asks Logray if he learnt what was wrong with the animals. Logray says that before he could discover anything, the animals went back to normal. Chirpa says that if it were the Raich, their best warriors would have handled him. Wicket tries to tell the adult Ewoks about their adventures with the Raich but Kneesaa tells him to forget it."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "An animation error occurs in the episode; the first time Princess Kneesaa a Jari Kintaka talks to the Gonster, her eyes disappear during one frame, after she closed them."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}