{"url": "The_Power_at_Jakku", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: All-Stars"], "nodes": [{"tag": "h1", "text": "The Power at Jakku"}, {"tag": "p", "text": "The Power at Jakku is the eighth episode in the LEGO Star Wars: All-Stars television series. It debuted on November 10, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A female figure with brown hair enters a garage where Roger is working on an X-34 landspeeder. Roger asks if she wants to hear another story about heroes. He offers to tell her about the greatest hero of all: himself. Roger proceeds to read Chapter 482 from his autobiography From Trenches to Wrenches: The Roger Story: \"The Power at Jakku.\""}, {"tag": "p", "text": "Roger narrates that the Galactic Civil War was coming to an end but the Galactic Empire was not going down without a fight. The flashback opens with AT-AT walkers chasing New Republic soldiers through the battlefield. Star Destroyers crash into the deserts of Jakku. Leading a squadron of T-47 airspeeders, Lieutenant Valeria tells them to make sure that this is the Empire's last stand. Valeria destroys a TIE fighter but her airspeeder's stabilizer are hit by debris and the ship comes crashing down into the desert."}, {"tag": "p", "text": "Valeria grumbles that his is not what she had in mind. As she struggles to break out of her airspeeder's canopy, Valeria requests an \"evac.\" An AT-AT approaches her speeder and is about to crush it under its heavy magnetic foot. Speaking over the comlink, Kordi Freemaker tells Valeria to hold tight because the Freemakers are on the way. Using the StarScavenger's side cannon, Kordi blasts the AT-AT. Rowan then jumps down the cargo ramp and slices through one of the AT-AT's legs with his lightsaber, causing the walker to crash."}, {"tag": "p", "text": "Rowan then uses the Force to prise open Valeria's T-47 airspeeder's canopy. Valeria tells the Freemakers that they have got to help her get back into the fight. Rowan reassures her that they will be helping her to blast the Empire in no time. Two TIE fighters chase an X-wing. While Rowan levitates the T-47 airspeeder, Kordi fixes the cooling fin while Zander finds a power coupling. Roger watches as the Freemakers work on Valeria's T-47 airspeeder. Above, an Imperial Star Destroyer takes a hit and the Freemakers cheer."}, {"tag": "p", "text": "However, the Star Destroyer begins descending towards where they are. As the Freemakers scurry, Valeria says he speeder is not going anywhere without a stabilizer. Rowan sends Roger to find the stabilizer while the others hastily finish the repairs. Roger manages to find a stabilizer and narrowly avoids being crushed by the frontal section of the crippled Star Destroyer. Roger thinks he is using the Force and is the first Jedi droid."}, {"tag": "p", "text": "Roger then quickly realizes that Rowan was using the Force to hold back the Star Destroyer. He tells Roger to please hurry. Roger sights that he is not a Jedi and struggles with the prospect of accepting being a battle droid. Rowan tells Roger to hurry up. The two narrowly escape the crashing Star Destroyer, which generates a sandstorm. Roger passes the stabilizer to Kordi and Zander, allowing Kordi to repair Valeria's T-47 airspeeder. Valeria flies her T-47 airspeeder back into action and takes three airspeeders. The Freemakers then depart aboard the StarScavenger."}, {"tag": "p", "text": "Returning to the present, Roger explains this is how he singlehandedly stopped a Star Destroyer and finished off the evil Empire. The girl Moxie Freemaker is impressed and says she did not realize how her aunt Kordi, dad Zander, and uncle Rowan were such amazing heroes. Roger acknowledges they deserve some credit too. Kordi says more than a \"bit\" as she enters with two senatorial staff and a hooded lady. Moxie hugs her aunt but one of the staffers reprimands her for touching the senator. Kordi chastises him for touching her niece."}, {"tag": "p", "text": "Kordi hugs Moxie, who explains that Roger was just telling her about the Freemakers' exploits during the Battle of Jakku. Moxie says that she wished she could be a hero like her aunt. Kordi replies that is why she has come all the way from Hosnian Prime. She introduces the hooded lady as Princes Leia Organa, who invites Moxie to join the Resistance. Moxie is overjoyed to meet the Rebellion hero."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}