{"url": "Battle_of_New_Holgha", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Battle of New Holgha"}, {"tag": "p", "text": "A battle took place on the world of New Holgha three months into the extragalactic Yuuzhan Vong's attempt to overthrow the galaxy in 25 ABY. The governing New Republic, believing Mandalorian intelligence to be faulty due to the Mandalorians' public alliance with the alien Yuuzhan Vong, falsely deduced that the target of the invaders was Pedd 4, and withdrew most of New Holgha's defenses there. Resultantly, New Holgha fell to the Yuuzhan Vong with little resistance. Mandalorian leader Boba Fett encountered a Jedi Knight while assisting the Yuuzhan Vong on New Holgha, and recruited him to reliably pass on vital intelligence to the New Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 25 ABY, during the extragalactic Yuuzhan Vong's attempted conquest of the the galaxy, the marauding aliens attacked the Outer Rim world of Birgis. Maintaining a public image of collaboration with the Yuuzhan Vong, Mandalorian leader Boba Fett and his Mandalorian Protectors attempted to funnel intelligence on the invaders to the governing New Republic. Employing a pilot at Birgis to deliver the information, Fett hoped that the New Republic would be able to evacuate the site of a future Yuuzhan Vong conquest—the Outer Rim world of New Holgha, which would be attacked in three months' time."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The New Republic, however, believed that the Mandalorians had fed them misinformation, and relocated New Holgha's garrison to the Republic stronghold at the astronomical object Pedd Four, believing it to be the Yuuzhan Vong's actual goal. Left without any considerable defensive capability, and with its long-range defensive satellite sabotaged overnight, New Holgha fell without much resistance to Yuuzhan Vong forces fresh from the conquest of the nearby Vinsoth system."}, {"tag": "p", "text": "The Yuuzhan Vong assailed the planet's Five Holy Cities with magma weapons and took the opportunity to refuel one of their living miid ro'ik warships by using a dread weapon to scavenge raw materials from the planet's surface. Fett, watching the vessel consume trees, buildings, and New Holghan people, was uncomfortably reminded of his experiences inside a sarlacc creature in 4 ABY; he was dispelled from his unease, however, by a comlink transmission from the Yuuzhan Vong subaltern Bur'lorr. The subaltern had encountered and briefy combated a Jedi Knight, and tasked Fett and his fellow Mandalorians to run him down and capture him."}, {"tag": "p", "text": "Fett and the Protectors trailed the Jedi through the main marketplace of the Five Holy Cities and cornered him in an alleyway. Spotting the chance to convey intelligence to the New Republic through a more reliable channel, Fett passed more information to the Jedi Knight, who identified himself as Kubariet, and assigned his comrade Tiroc Vhon to escort Kubariet to safety. Bur'lorr arrived; demanding the location of his quarry, he was killed by Mandalorian Goran Beviin. The Yuuzhan Vong's dying shouts were quelled by nearby cannon fire and so did not alert any other Yuuzhan Vong in the area, but the Mandalorians' victory over the warrior was not without bloodshed; Protector Briika Jeban was injured by the claws of Bur'lorr's living armor, and died."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The loss of Jeban meant that her daughter, Dinua, needed a new parent, and so Beviin adopted her. After taking New Holgha as part of their empire, the Yuuzhan Vong attacked the Shaum Hii system. The Pedd system had also fallen to the Yuuzhan Vong by 27 ABY."}, {"tag": "p", "text": "Two weeks after the New Holgha campaign, Kubariet tracked Fett down to the world of Vorpa'ya in the Mandalore sector and arranged to keep the public image of the Mandalorian collaboration with the Yuuzhan Vong intact while the Mandalorians continued to ferry vital intelligence to the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of New Holgha first appeared in Karen Traviss' 2006 eBook Boba Fett: A Practical Man."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}