{"url": "The_Rebel_Thief", "categories": ["Category:Real-world articles", "Category:Star Wars Kids comic strips"], "nodes": [{"tag": "h1", "text": "The Rebel Thief"}, {"tag": "p", "text": "The Rebel Thief is a five part comic written by Ryder Windham and illustrated by Gary Erskine, and was published in issues #1-#5 of the magazine, Star Wars Kids. It tells the story of how the Rebel Alliance was able to finance replacement X-wings for the ones they lost at the Battle of Yavin."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo, while staying on Yavin 4, hears of a temple filled with ancient Sith treasure, not far from the main Rebel Base. With Chewbacca, he sets out to find the temple, without telling Leia Organa and Luke Skywalker. Q-7N, however, alerts Leia to their plan, and she, with Luke, sets out after them."}, {"tag": "p", "text": "Han reaches the temple, and while trying to take the treasure, is confronted by an ancient Sith battle droid. Chewbacca destroys the droid, and the two quickly gather the treasure and load it onto the Millennium Falcon. They take off, just as Leia and Luke arrive in a landspeeder. Leia assumes that Han has stolen the treasure for his own personal benefit, and orders his arrest, should he return."}, {"tag": "p", "text": "Meanwhile, Han and Chewbacca fly to Dennogra, home of Sprool the Trader. After landing at Zio Snaffkin Spaceport, Han wanders into a cantina, where he is confronted by an Aqualish bounty hunter. Han kills the bounty hunter, and declares, \"That's it for the entertainment folks! I'm looking for Sprool!\""}, {"tag": "p", "text": "Sprool, an Ithorian, quickly identified himself, and was invited onboard the Falcon to inspect the Sith merchandise. Han offered to sell one of the two crates of treasure, to which Sprool agreed. He then asked Sprool to take the second crate to Jabba the Hutt, to settle the bounty that was on his head. Solo received 500,000 credits from Sprool, and took it back to the Rebel Base on Yavin. Before Leia had him detained, he explained why he had taken the treasure, and presented the Princess with the credits for the new X-wings needed to replenish the fleet. Leia, confused, dismissed the guards and allowed Solo to go free."}, {"tag": "p", "text": "Back on Tatooine, at Jabba's Palace, Sprool presented the Hutt with Solo's second treasure crate. Jabba accepted, but refused to call off the bounty."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity errors"}, {"tag": "p", "text": "In this story Han claims he has returned his award money back to the Rebels.\nThis, however, contradicts with the early Marvel issues, where it was stolen by Crimson Jack."}, {"tag": "h2", "text": "Collections"}]}