{"url": "The_Quality_of_Mercy", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal articles"], "nodes": [{"tag": "h1", "text": "The Quality of Mercy"}, {"tag": "p", "text": "The Quality of Mercy is a Star Wars: The Roleplaying Game adventure that was published in Star Wars Adventure Journal 1 in February 1994. It was designed for four to six players and was set in the timeframe of the Galactic Civil War, between the Battle of Yavin and the Battle of Endor."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "Sometime between the Battle of Yavin and the Battle of Endor, an Alliance to Restore the Republic base on the second moon of Tiragga was struck by an outbreak of Direllian Plague. A group of Rebels traveled to the planet Kirtania to find the Araquian doctor T'Jaleq Kith'Araquia, one of the doctors who first identified the plague and its treatment."}, {"tag": "p", "text": "Their plan was complicated when they discovered the Galactic Empire had recently established a presence on Kirtania, and placed a bounty on Dr. Kith'Araquia's head, who fled into Kirtania's rainforest. The Rebels were mistaken for the thief Pierce Mantrell and hunted by bounty hunters in the employ of the Kubaz crime lord Schnil Hakoon. Hakoon eventually realized his mistake and provided supplies to the Rebels in return for them hunting down the real Mantrell, who had fled into the rainforest. The Rebels entered the rainforest to find both Dr. Kith'Araquia and Mantrell, accompanied by a Ho'Din named Kutu who was also searching for the doctor."}, {"tag": "p", "text": "Within the rainforest the Rebels discovered Imperial clearcutting operations to make room for an Imperial supply station, and sabotage by the native Araquia who were defending their homes. The Rebels rescued Mantrell from an attack by the native fauna, only for the thief to attempt to con the Rebels by fabricating a sob story about a sick daughter only Dr. Kith'Araquia could cure."}, {"tag": "p", "text": "Finally the Rebels discovered the Araquia saboteurs, and Dr. Kith'Araquia, just in time to assist them with a daring attack on the Imperials designed to drive their operations out of the rainforest. Unfortunately this backfired, and the Imperials destroyed the Araquia camp, but not before the Araquia are able to escape with the precious Shiarha Roots needed to cure the Direllian Plague. With the cure in hand, the Rebels are able to cure the plague on the second moon of Tiragga."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}