{"url": "The_Red_Ghost:_An_Ewok_Adventure", "categories": ["Category:Real-world articles", "Category:Ewok Adventure books"], "nodes": [{"tag": "h1", "text": "The Red Ghost: An Ewok Adventure"}, {"tag": "p", "text": "The Red Ghost: An Ewok Adventure is a 1986 children's book adaptation of the thirteenth episode of the Ewoks TV series, entitled \"Asha.\""}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "The Ewoks Paploo, Teebo, and Wicket Wystri Warrick are out collecting nuts and roots in their hang gliders when they stumble upon King Gorneesh and a band of Duloks running from something they call \"the Red Ghost.\" The Ewoks investigate and find a netted maramu, a victim of the Duloks' trophy hunting. However, when Teebo attempts to free the animal, a menacing-looking, red-furred Ewok appears with a korrina. The Ewoks fly away on their gliders."}, {"tag": "p", "text": "Back at Bright Tree Village, Wicket tells his friend Kneesaa about the encounter. She suspects that the \"Red Ghost\" may in fact be her long-lost sister, Asha, who was thought dead when a hanadak killed her mother, Ra-Lee. That night, Kneesaa heads out to find the Ewok she has convinced herself must be her sister. Wicket accompanies her."}, {"tag": "p", "text": "As the two youngsters journey through the forest, a light snowfall turns to a full storm, and the Ewoks lose their way. Wicket tries to get a better view of the valley from a ledge, but his weight is too great and he nearly falls, only to be saved by the red-furred Ewok he had encountered the previous day. Asha and Kneesaa recognize each other, and Asha leads the Bright Tree Ewoks to her home, a cave where she livs with a family of korrinas. Kneesaa tries to convince Asha to return home, but her sister insists that she must first stop the Duloks from harming the animals of the valley."}, {"tag": "p", "text": "The next morning, Wicket and Kneesaa find Asha in the midst of Gorneesh and his Duloks, once again on the hunt. She frees their quarry, defeats the Duloks, and orders them to never hunt again in the area. The Ewoks and the korrinas travel to Bright Tree Village, where Asha is reunited with her father, Chief Chirpa. The village then holds a celebration."}, {"tag": "h2", "text": "Appearances"}]}