{"url": "The_Rakata_and_the_Unknown_World", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Sith books and documents"], "nodes": [{"tag": "h1", "text": "The Rakata and the Unknown World"}, {"tag": "p", "text": "The Rakata and the Unknown World was a book written and published by the Dark Lord of the Sith Darth Revan sometime during the Jedi Civil War. In the book, Revan focused on the ancient Rakata species and their homeworld, known then as the Unknown World. Three millennia later, during the New Sith Wars, the book was one of the texts kept in the archives of the Sith Academy on the planet Korriban. The volume was studied by the Sith student Bane, who read the book extensively."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point during the Jedi Civil War, the Dark Lord of the Sith Darth Revan wrote a book titled The Rakata and the Unknown World. The volume focused on the Rakata, a species that had ruled the galaxy over 26,000 years beforehand, and their homeworld, which at the time was known as the Unknown World. Revan's book was featured in the archives of the Sith Academy on the Sith necropolis Korriban. However, during the second year of the war, Revan was captured by the Jedi Order, retrained in the Jedi ways, and redeemed."}, {"tag": "p", "text": "Nearly three thousand years after the Jedi Civil War's end, a Sith student named Bane found The Rakata and the Unknown World in the Sith Academy's archives and studied the book thoroughly. Bane was not as interested in the contents of the book as much as he was in its author, Darth Revan. The Sith student was curious about Revan's title of Darth, which had fallen into disuse with the emergence of the Sith Lord Skere Kaan's Brotherhood of Darkness. Bane eventually abandoned the Brotherhood's teachings and took the Darth title. Shortly after finding and learning from Darth Revan's Sith Holocron on the Unknown World, which had been renamed Lehon, Bane used Revan's teachings to destroy Kaan's Brotherhood and create a new Sith Order, limiting the Sith to only two: a Master and an apprentice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rakata and the Unknown World was created by author Drew Karpyshyn for the novel Darth Bane: Path of Destruction. It was used as a plot device."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}