{"url": "Battle_of_Nelvaan", "categories": ["Category:Legends articles", "Category:Battles in the Savareen sector", "Category:Battles of the Siskeen theater"], "nodes": [{"tag": "h1", "text": "Battle of Nelvaan"}, {"tag": "p", "text": "The Battle of Nelvaan took place at the planet Nelvaan in the third year of the Clone Wars. Following the siege of a rain-soaked planet occupied by the Confederacy of Independent Systems, High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker were contacted by Supreme Chancellor Palpatine and Jedi Master Mace Windu to investigate the Outer Rim world of Nelvaan after word supplied from Republic Intelligence indicated that General Grievous was currently stationed there. Departing immediately, Skywalker and Kenobi arrived at the planet via their Star Destroyer Integrity. A clone trooper informed Skywalker and Kenobi that no enemy forces were detected on the planet, save for a number of strange geothermal readings. Deciding that the readings were worth investigation, Skywalker, Kenobi, and a small force of clone troopers landed on the planet's surface via CR-20 troop carrier."}, {"tag": "p", "text": "While investigating, Kenobi and Skywalker were suddenly ambushed by a massive Horax, which Skywalker made short work of with the help of his lightsaber. However, a group of Nelvaanians appeared in the wake of the beast's death, and he and Kenobi were then escorted to the tribe's village, Rokrul, where they met with the village shaman Orvos. He revealed that Skywalker's killing of the Horax interrupted a young Nelvaanian's rite of passage trial, and also told of how the Nelvaanian adult males, each of whom embarked on similar quests, disappeared from their village, with only the \"Ghost Hand\" as a means of rescue. After Kenobi presented Skywalker's prosthetic arm to the villagers, they realized that he himself was the \"Ghost Hand\". He then underwent a trial where bruise-leech crawlers left geometric tracks over his body, and, the next morning, began his long journey to save the village and uncover why Nelvaan was shrouded in seemingly eternal winter and to find the missing Nelvaanian warriors—this was the final Jedi Trial Skywalker had yet to face."}, {"tag": "p", "text": "Following the Force, Skywalker uncovered a cave in the midst of a blizzard, where he experienced a vision of a Nelvaanian becoming mad with power; this was a prophecy of Skywalker's future as Darth Vader. Once he snapped out of his vision, Skywalker uncovered a CIS base containing a siphon generator that was powered by a geothermal crystal and kept the planet in its wintry state. A group of Skakoan combat engineers were stationed at the base, creating mutant Nelvaanians at the request of Grievous. Harvos, the only Nelvaanian captive who had yet to be altered, was placed in a tank and immersed in green liquid, slowly mutating him, but he managed to break free and assisted the young Jedi in freeing the mutant Nelvaanians. Skywalker then scaled the siphon generator and destroyed the crystal powering it, risking damage to his prosthetic arm in the process. As the planet's ice age came to a close, Skywalker clambered to the surface, killing off the Skakoans and their leader in the process. After Skywalker returned the Nelvaanian males to Rokrul, he and Kenobi departed the planet in the Integrity."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After defeating Separatist forces on a rain-soaked planet, High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker were dispatched to the Outer Rim world of Nelvaan after Republic Intelligence reported that General Grievous made frequent trips to, and was currently, there. They departed immediately and arrived over Nelvaan with several Venator-class Star Destroyers. Onboard the Integrity, Commander Cody reported to the two Jedi that there were no Confederate forces in the area, but there were strange geothermal readings from Nelvaan's surface. Debarking for the planet's surface in a CR20 transport, Skywalker, Kenobi, and a detachment of troops landed near an ice lake, before endeavoring into a forest. The two Jedi noticed that several of the planet's creatures were startled, and not by the Republic incursion. A giant horax suddenly burst through the trees, killing the clone troopers with ease. Skywalker, lightsaber at the ready, slashed into one of the creature's feet, before plunging his weapon into the horax's head. Once the dust of battle had cleared, however, a group of Nelvaanians emerged, incensed at Skywalker's actions."}, {"tag": "p", "text": "The Jedi were brought to the village of Rokrul on the Nelvaanian mounts. Upon arrival, Skywalker and Kenobi noted that there were only women and children—no men in sight. The chieftain, Tuzes-Adaz, led the Jedi into a cave where they met with an elder Nelvaanian, Orvos. It became evident to Kenobi, who could understand the Nelvaanese, that Skywalker had interrupted Tuzes-Adaz's son's rite of passage by slaying the horax. Translating Tuzes-Adaz's diatribe, Kenobi relayed to Skywalker that something plagued the Nelvaanian lands, and that the males had been sent out to confront it, only to never return. Tuzes-Adaz's son was to be the next to venture out into the wilderness, before Skywalker had intervened. Orvos then spoke, and although Kenobi was unsure of his translation, he informed Skywalker that he would have to \"journey into fire,\" a prospect that startled the young Jedi."}, {"tag": "p", "text": "That night, the Jedi joined the Nelvaanians in gathering around a camp fire for a ceremony conducted by Orvos. The elder began his incantation, in which he \"summoned fire,\" and attempted to divine the true meaning behind Skywalker's arrival on Nelvaan. Orvos threw some of his powders into the fire, and the smoke formed the figure of a hand—the Nelvaanese \"Holt Kazed\" of legend and prophecy was whispered around the fire, which Kenobi translated to \"Ghost Hand.\" Kenobi suddenly pulled Skywalker's right glove off, revealing the prosthetic replacement limb. This prompted recognition and shock from Orvos—Skywalker was determined (whether or not by fate) to be the one to venture out, and determine what was plaguing the land. In a continuation of the Nelvaanian ritual, Skywalker was taken back into Orvos' cave, where bruise-leech crawlers were applied to his torso, arms, and face. Skywalker questioned the necessity of the ritual, but Kenobi insisted that he respect the Nelvaanian ways. As the crawlers etched markings across Skywalker's body, Orvos instructed him on the path to choose, which was delivered in the form of cryptic sayings (metaphors) about the \"mother's cry\" (wind), \"mother's tears\" (rivers), \"mother's mouth\" (underworld cave) and \"her inner flame\" (subterranean forces)—metaphors for the heroic quest or journey, as these clearly referenced as well \"the Great Mother\" (the natural planet)."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Saddling his riding beast the next morning, Skywalker was approached by Kenobi, who informed him that his journey would serve as his final Jedi Trial, the Trial of the Spirit he had yet to face. Skywalker, confident, assured his former master that he would not fail in his task. As he moved deeper into the Nelvaanian wilderness, he remembered the first of Ovrvos' instructions: \"you must follow the wind, for it is the mother's cry.\" Doing so, Skywalker was led to a frozen river, which then followed in accordance with the next instruction, \"travel her tears; they are frozen with fear.\" This in turn led the young Jedi to a cave, which correlated with Orvos' third and final instruction: \"enter the mother's mouth, to awake her inner flame.\""}, {"tag": "p", "text": "Dismounting from his riding beast, Skywalker explored the cave on foot, narrowly avoiding dangerous steam vents. As he cleared the steam that enshrouded the cave, he noticed that the walls were covered with Nelvaanian markings, depicting their culture. Suddenly, Skywalker began to experience a powerful vision through the Force: The Nelvaanians were seen to be conducting their everyday lives, until an angular and insidious monster invaded, threatening their peace. One Nelvaanian warrior battled the beast, fighting it back towards its lair, but as he stood victorious, his arm was bitten off by the monster. It was soon replaced by an angular and dark arm that resembled the monster, which the warrior then used to conquer all variety of monsters and opponents. The arm became stronger with each victory, and when it defeated its final opponent, a horax, it began to spiral out of control, consuming the world and enveloping all the other Nelvaanians. It also claimed the warrior's loved one, and then corrupted the warrior himself, transforming him into a terrifying figure—a veritable monster himself—with a triangular mouthpiece. As the vision moved into its final stage, Skywalker heard Amidala's voice cry out his name, before he was sharply thrust back into reality."}, {"tag": "h3", "text": "The laboratory"}, {"tag": "p", "text": "When he awoke, Skywalker found himself on the edge of a large cavern, facing a gargantuan siphon generator of Confederate make, one which kept the planet shrouded in eternal winter. Climbing the cavern wall, Skywalker found himself in a Confederate installation, buried deep in the Nelvaanian rock. Clandestinely infiltrating the facility, Skywalker overheard several of its Skakoan overseers discussing \"experiments\" initiated by Grievous (who, intrigued by religious similarities with his own people, the Kaleesh, had originally lured the Nelvaanian warriors to the generator facility by making them believe that he was the prophesied figure from their own mythology). Anakin soon chanced upon several Nelvaan warriors, stored in tanks, mutated to greatly increased sizes, and with blaster cannons in replacing their right arms. The young Jedi then moved into the area in which the Nelvaanians were mutated—and watched on as the Techno Union scientists had an untainted Nelvaanian, named Harvos, prepared for the trans-formative process. As the Nelvaanian's tank began to fill with the chemicals, Skywalker leaped into action, dispatching the droids guarding the area, and the engineer responded by activating a squad of the mutant Nelvaanians. As they approached Skywalker and raised their weapons, the young Jedi pleaded for them to stop, as he did not wish to inflict any harm upon them."}, {"tag": "p", "text": "Nonetheless, the mutated warriors opened fire on Skywalker, and he was forced to defend himself, severing their weapons and sending them flying around the room with Force Pushes. Harvos, who was still being mutated at the time, was enraged by the plight of his fellow Nelvaanians, and broke out of the tank of his own accord. Tackling one of his mutated tribesmen, Harvos pulled a strapped-on device off the Nelvaanian's chest, pulling them out of their mind-controlled stupor. Harvos attempted to explain this to Skywalker, but he failed to catch on. Harvos demonstrated once more, and it was all the prompt the young Jedi needed to take his lightsaber to the devices, swiftly and surely subduing all of the mutants. His tribesmen freed, Harvos instructed them to run rampant through the Confederate base, while pointing out to Skywalker the crystal in the middle of an energy chamber powering the installation. Immediately understanding the Nelvaanian, the young Jedi set about his new task."}, {"tag": "h3", "text": "The siphon generator"}, {"tag": "p", "text": "Hurtling through the base, demolishing enemy droids as he went, Skywalker climbed to the top of the base's interior, and then leapt onto the main power generator's housing. Hanging upside down from the housing, he realized that he would not be able to strike at the crystal, as it was guarded by some sort of protective field. He was, however, able to put his robotic arm through the field, although it caused him a tremendous amount of pain. Summoning the crystal to his hand, Skywalker crushed it, and the resultant explosion destroyed his prosthetic replacement. Other explosions rocked all around the base, and Skywalker narrowly avoided death by nimbly leaping away to safety. By destroying the siphon generator, Skywalker instantaneously reversed the planet's climate, halting the winds, thawing the rivers, and allowing Nelvaan's sun to shine through the atmosphere once more."}, {"tag": "p", "text": "The enraged Nelvaanian warriors then rampaged through the facility, tearing battle droids apart with their bare hands, and freeing their comrades from captivity. Because they had been chemically enlarged, they had a significant advantage in the battle. The Skakoan combat engineers at the base fled for the safety of their Hardcell-class interstellar transport, which had been parked above the base on the surface. Emerging from a fault in the ground, Skywalker saw the Skakoan engineers fleeing towards their Hardcell-class transport. Incensed by what he had witnessed in the base, the young Jedi sent the Skakoans flying using the truncated stump of his arm and the Force, pushing them off ravines and away from their escape craft. However, struggling with an ounce of his life, the head Skakoan attempted to pull his blaster on Skywalker, but the young Jedi, hearing the click of the blaster, rounded on him with a Force choke, damaging his pressure suit and causing his body to decompress."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Nelvaanians, seeing their savior bereft of his \"ghost hand,\" pulled off their cannon-equipped replacement arms, mimicking Skywalker's new found disability. They then saluted him, chanting \"Holt Kazed\" repeatedly. Skywalker then touched their minds through the Force, convincing them to return to their village. Upon their return, their appearance startled the Nelvaanian women, but when Harvos' child recognized him, despite his gross mutation, the returned warriors were reconciled with their families. As the Nelvaanians celebrated that night, Skywalker opted to watch on, and Kenobi wished to discuss his experiences in the cave. The young Jedi vaguely deflected the question, however, and questioned whether or not the Nelvaanians would ever be able to recover. Kenobi believed that they would, as long as they accepted themselves for what they were. In completing his Trial of the Spirit, Skywalker had demonstrated that he was indeed fit to be a Jedi Knight."}, {"tag": "p", "text": "Following these events, Kenobi and Skywalker left the planet to a MedStar-class frigate orbiting the planet Belderone, where they resided for four days to check on their Twi'lek captive Fa'ale Leh. Onboard the frigate, Kenobi received a transmission from Jedi Masters Mace Windu and Yoda as well as Supreme Chancellor Palpatine, in which he was informed of CIS Count Dooku's location on the planet Tythe. Though Skywalker was reluctant to continue being separated from his wife Padmé Amidala, he nevertheless joined his former Master in the search. However, little did they know that the battle was a diversion by Palpatine (under the guise of Darth Sidious) to keep them away from the Core Worlds in advance of the massive Separatist invasion of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Nelvaan first appeared in the Star Wars: Clone Wars television series. Due to the battle happening prior to the Battle of Coruscant, the battle and the recapture of Tythe, which appeared in the novel Labyrinth of Evil by James Luceno, contradict each other since Kenobi and Skywalker go to Tythe before Coruscant, instead of Nelvaan (Dooku only pauses briefly at Nelvaan). Initially, Leland Chee retconned this by stating that the Nelvaan events occurred after Tythe, but this was overwritten by The New Essential Chronology, which fixed the events the other way around. Therefore, this article includes information from The New Essential Chronology, which integrates details from both Labyrinth of Evil and Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}