{"url": "The_Resistance_Within", "categories": ["Category:Real-world articles", "Category:Living Force adventures"], "nodes": [{"tag": "h1", "text": "The Resistance Within"}, {"tag": "p", "text": "The Resistance Within was a year one (31 BBY) Living Force adventure. It was part two of the Eye of the Sun trilogy, written by Morrie Mullins."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Shortly after the Metatheran Cartel revealed the existence of their jungle base, people started disappearing from Gadrin and Hedrett. Master Lanius Qel-Bertuk of the Almas Academy became aware of these disappearances at the same time he felt a disturbance coming from Cularin, and sent his administrative droid E1-6RA to Cularin to find somebody to look into the matter."}, {"tag": "p", "text": "E1 contacted the group of citizens who had recently been hailed as heroes for taking down a pirate ring, and they agreed to find the missing people. In the course of their investigation, they found a datapad in Shayne Gerrare's home and a piece of paper in Nim'Ri's office which both said Hiironi. Traveling to the Hiironi irstat, Mother Dariana let them know that a friend had approached her for a place where a sanctuary could be established, and she had pointed them to Cloud Mountain. Sensing a disturbance to the balance of nature to the mountain, she was willing to pass the same information along to the heroes."}, {"tag": "p", "text": "Following Mother Dariana's directions, they found some abandoned mines on Cloud Mountain. Traveling deep within the mines, and bypassing some security measures along the way, they found the people they were seeking at the end. The people who had disappeared had vanished of their own free will, to form a resistance against the Metatheran Cartel. They had wanted to be able to operate out of view from the public and the Cartel, so had set up a hidden base in the abandoned mines."}, {"tag": "p", "text": "The resistance let the strangers leave the base unhindered, but asked that they not reveal their location or what they were doing. The heroes returned to E1-6RA and let her know that the people who had disappeared were safe and left of their own free will, but could not discuss the nature of why they had done so, but reassured her that there was not a threat that Master Lanius needed to act upon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This adventure had several scenes calling back to various Lucas films. There was a turbocart chase through the Cloud Mountain mines reminiscent of Indiana Jones and the Temple of Doom. There was a magnetically sealed chamber which had walls that started to close upon the heroes, as in A New Hope. The amount of credits that Kris Wahl owed Polst was 1138, continuing the Star Wars tradition of referring to THX-1138. However, this was the only Eye of the Sun adventure which did not feature a creature attack, as most of the Star Wars films did."}]}