{"url": "The_Rise_and_Fall_of_Darth_Vader", "categories": ["Category:Real-world articles", "Category:Legends Young Readers"], "nodes": [{"tag": "h1", "text": "The Rise and Fall of Darth Vader"}, {"tag": "p", "text": "The Rise and Fall of Darth Vader is a young adult novel written by Ryder Windham. Scheduled for release in October 2007, it was released early in September of the same year. It re-tells the story of all six Star Wars films from the point of view of Darth Vader."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This is the legendary story of Anakin Skywalker as it's never been told before - through his eyes…"}, {"tag": "p", "text": "From rise to fall, from light to dark, and back again."}, {"tag": "p", "text": "Born a slave."}, {"tag": "p", "text": "Raised a Jedi."}, {"tag": "p", "text": "Feared by a Galaxy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The book begins with Darth Vader dreaming for the first time in years while aboard the Executor shortly before it departs for the second Death Star. Vader thinks about his son and his master and wonders if he is having a premonition of the future. He dreams of the experiences he had as Anakin Skywalker, reminiscing about his life."}, {"tag": "p", "text": "He and Shmi Skywalker are aboard a freighter being taken to Gardulla Besadii the Elder as slaves. Watto sees Anakin busy repairing a podracer and he says that he taught himself how to fix it. Watto is intrigued by this and takes Anakin and Shmi as payment for a lost bet."}, {"tag": "p", "text": "The story continues with Anakin's life on Tatooine, his participation in the Battle of Naboo, his life as a Padawan and his motives for turning to the dark side."}, {"tag": "p", "text": "Eventually, events end with his death during the Battle of Endor and his passing into the netherworld of the Force."}, {"tag": "p", "text": "Numerous passages from the book involving Obi-Wan would be lifted directly into The Life and Legend of Obi-Wan Kenobi, a similar biography of the Jedi master released the following year."}, {"tag": "p", "text": "Although most of the book references the six films, there are references to other works of Star Wars literature. These references include:"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the first printing of this book, Mos Espa is misspelled \"Mos Epsa\" on page 19."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "In Japan, the book was entitled 「ダース・ヴェイダー 光と影」, translating to \"Darth Vader: Light and Shadow\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}