{"url": "The_Rise_of_Skywalker_Adaptation_1", "categories": ["Category:Real-world articles", "Category:Future comics", "Category:Star Wars: The Rise of Skywalker"], "nodes": [{"tag": "h1", "text": "The Rise of Skywalker Adaptation 1"}, {"tag": "p", "text": "The Rise of Skywalker Adaptation 1 is the upcoming first issue of the comic series Star Wars: The Rise of Skywalker Adaptation, an adaptation of the film of the same name. The issue will be written by Jody Houser, illustrated by Will Sliney, and published by Marvel Comics. The issue was originally solicited for June 3, 2020, but, on April 1, 2020, Marvel Comics was forced to stall their publishing line due to the COVID-19 pandemic. Eventually, Marvel announced they would resume their publishing line on May 27, 2020, but did not mention a new release date for this issue."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"New York, NY— February 20, 2020 — Announced earlier today at ComicsPRO in Portland, Oregon, Marvel Comics will be putting the final chapter of the Skywalker saga to the page in a comics adaptation of Star Wars: The Rise of Skywalker. Writer Jody Houser (Star Wars: TIE Fighter) and artist Will Sliney (Star Wars: The Rise of Kylo Ren) will be teaming up to retell this epic story in STAR WARS: THE RISE OF SKYWALKER ADAPTATION #1. In addition to the shocking twists and turns that were present in the film, the five-issue limited series will also have brand-new story material for readers to enjoy!"}, {"tag": "p", "text": "\"'As a lifelong Star Wars fan, it was an honor to be asked to be a part of wrapping up the Skywalker saga with Marvel Comics,' Houser said. 'We have some fun plans to add scenes and material that weren't seen in the movie.'\""}, {"tag": "p", "text": "\"Relive Rey's quest, the Resistance's desperate last stand, and the return of an old enemy when STAR WARS: THE RISE OF SKYWALKER ADAPTATION #1 hits stands this June!\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}