{"url": "Battle_of_Nod_Kartha", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Occupation of Karthakk"], "nodes": [{"tag": "h1", "text": "Battle of Nod Kartha"}, {"tag": "p", "text": "The battle of Nod Kartha was a lengthy sortie which took place just prior to the Jedi assault on Geonosis in 22 BBY. The pirate Nym's Lok Revenants and the Mere Resistance led by Sol Sixxa had previously joined together to fight the Trade Federation activity in the Karthakk system prior to 22 BBY. The two spacers led their forces in battle against the mercenary Sabaoth Squadron commanded by Cavik Toth. To shut down Toth's Trihexalon production, Nym's and Sixxa's combined fleet staged an assault on the orbital defenses that surrounded the planet Nod Kartha in an attempt to locate and compromise a Trihexalon production facility on the planet's surface. The fleet was joined by Jedi Master Adi Gallia, who had been sent to scout Trade Federation activity in the Karthakk system."}, {"tag": "p", "text": "The allied spacers gathered their forces and emerged from hyperspace in range of Toth's Orbital Defense Cannons. One of the Mere cruisers, the Kethor, was disabled, and the resistance fighters became embroiled in a dogfight against the Trade Federation and Sabaoth Squadron forces. Eventually, the damaged cruiser rammed one of the Planetary Defense Platforms, which allowed the starfighters to breach the remaining defenses and descend upon the planet surface."}, {"tag": "p", "text": "A commando force disembarked from the Havoc, Nym's personal starfighter and infiltrated the deflector shield generator facility. Master Gallia defended the ground from the air while the commandos planted explosives on the generators. When they ran into trouble, Gallia landed and fought through B1-Series battle droids to ensure the detonation of the final charge. The facility subsequently went up in flames, which resulted in the deactivation of the Trihexalon factory's shield. The commando team returned to their fighters to eliminate the factory. Sol Sixxa sliced into the factory controls to open the main gate, although he was countermanded by droid slicers. In the Havoc, Nym disabled the droid transmitter and neutralized the solar towers which powered the facility. He then destroyed the reactor after Sixxa opened the blast door and exposed it, and the pilots flew back into orbit as the factory exploded."}, {"tag": "p", "text": "The crew of the remaining Mere cruiser, the Tritus, scanned the debris field, and ascertained they could salvage an Orbital Defense Cannon, but their efforts were hampered by the arrival of a Sabaoth destroyer. Nym and his wingmen escorted Mere Tugs to pick up the pieces while simultaneously engaging Trade Federation Tugs, which were also trying to capture the debris. Ultimately, the resistance fighters recovered the debris and fled the battle. They took the cannon to Lok, where it was later used to recapture Nym's base from a decade-long Trade Federation occupation."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Sabaoth Squadron bombed Point Modie on the planet Maramere with Trihexalon in the year 22 BBY, it alerted both the Mere Resistance and the Lok Revenants of Sabaoth Captain Cavik Toth's new chemical weapon, which was used during the occupation of the system. The leaders of the Mere Resistance and the Lok Revenants, Sol Sixxa and Nym respectively, became determined to make an end to the Trihexalon threat to their system. The two pirate groups were joined by Jedi Master Adi Gallia, who had been in the system working with Nym during the investigation of possible illegal weapon development by the Trade Federation. After Point Modie was attacked, Gallia informed the Jedi Order of the threat posed by Toth and that she planned to take action against him."}, {"tag": "p", "text": "The Trade Federation had indeed developed the illegal Trihexalon. Before Captain Toth took over the project, the Trade Federation had constructed a factory to produce Trihexalon on the planet Nod Kartha. The Federation installed defenses for the facility which included an impenetrable deflector shield projected from six separate shield generators in six separate bunkers, and a network of Planetary Defense Platforms in orbit. The pirates learned of the defenses and developed a plan that involved the use of two Mere cruisers to blast a hole in the orbital defenses. At the surface, Nym intended to land his personal ship, the Havoc, and lead a small commando force to set explosives in each of what they believed to be empty bunkers to disable the shield. With the shield down, Sixxa would then make his way to the factory's landing pad and locate its weak points on the factory's computers, in order to disable the factory. Meanwhile, Toth, having predicted that an attack was inevitable, deployed his forces accordingly."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Orbital defenses"}, {"tag": "p", "text": "Upon the arrival of the allied pirate ships, cannons in Nod Kartha's orbital defense network opened fire and Scarab-class starfighters prepared to attack.Captain Orsai attempted to move the cruiser Kethor into its planned attack position, and was almost immediately was hit by fire from an Orbital Defense Cannon. The Kethor was crippled and Nym ordered Orsai to abandon ship. Further troubling for the pirates was the realization that the defenses had been upgraded and the discovery that they did not have anything that could penetrate the shields of the Planetary Defense Platforms. Nevertheless, Nym formulated a plan and led his starfighters to engage the Scarabs. Early in, a Toydarian mercenary flying with Nym named Reti, earned the ace title when he made his fifth kill."}, {"tag": "p", "text": "A C-9979 carrier launched two waves of droid bombers at the incoming pirates. The first was sent after the damaged Kethor; the other headed toward the second Mere cruiser, Tritus. The allied starfighters attacked the bombers and prevented any further damage to the two cruisers. Just as the last bombers of the first two waves were destroyed, the carrier launched a third, also at the Tritus. Again the Revenant fighters were able to shoot down the bombers before they could do any harm."}, {"tag": "p", "text": "With the Mere cruisers safe from the bombers, the pirates refocused their attacks. Master Gallia led the attack against the Orbital Defense Cannons, which allowed the Tritus, who had previously been out of the cannon's range, to attack. After one cannon was destroyed, Sabaoth Squadron sprung their trap. Five of their frigates, escorted by Sabaoth fighters emerged from hyperspace behind the allied ships and effectively blocked their escape route. Tritus traded fire with the two frigates closest while the opposing squadrons engaged each other. Also arriving with Sabaoth Squadron was the bounty hunter Jango Fett, who had come for the bounty on Reti. Fett attacked and damaged Reti's ship, which prompted Reti to send his ship into hyperspace out of desperation. Fett left to pursue Reti, much to the vexation of Sabaoth Squadron."}, {"tag": "p", "text": "The battle continued and Gallia destroyed a second Orbital Defense Cannon, which allowed the Tritus to move in. Orsai contacted his allies and reported that the Kethor would not last long and that the crew was in the midst of an evacuation. Then, to the shock of his comrades, he announced his plan to pilot the Kethor into the nearest Planetary Defense Platform. Despite their protests, a dying Orsai rammed the Kethor into the Platform. The resulting explosion consumed both cruiser and Defense Platform, and the loss of one Platform compromised the shields on the others. The allied ships seized the advantage and destroyed two more Defense Platforms in short order. After a pause to consider the plight of Reti, it was decided that the destruction of the factory was more important and Nym led the starfighters to Nod Kartha's surface. Jinkins, Nym's chief engineer, suggested they scan the debris for recoverable pieces, soTritus remained in orbit to cover for them and commence a scan."}, {"tag": "h3", "text": "Surface"}, {"tag": "p", "text": "Near the factory, Nym landed the Havoc at a distance from the factory and set out with Sixxa and three other commandos on foot to infiltrate and set explosives in the six bunkers to bring down the deflector shield around the factory while Master Gallia covered them from the air in her Delta-7 fighter. Despite having reservations about Nym's plan, Gallia directed Nym to the first bunker. Sixxa sliced into the bunker and the commandos set their timed explosives. The demolition of the first bunker alerted Trade Federation forces in the area, which prompted underground barracks to open up and deploy units to stop the commandos. Gallia led the Revenant starfighters in the defense of Nym and his team from battle droids, Single Trooper Aerial Platforms, Armored Assault Tanks, Scarab-class starfighters, and Vulture droid starfighters. A Superfreighter and two landing craft also came during the fight and delivered more tanks. In spite of the onslaught, Nym persisted and his team destroyed four more bunkers in the same manner as the first, although Sixxa was delayed at the last bunker, as the droids had changed the codes. Gallia engaged the droid forces to protect the ground forces. The team ran into trouble in the final bunker when the commandos became trapped inside with a group of battle droids after they set their explosives' timers. Gallia landed her starfighter outside the bunker and took out two battle droids guarding the entrance, and then sliced open a hole in the door between her and Nym with her lightsaber. Everyone was able to escape out the bunker before it exploded with the droids inside. The factory was then left unshielded, but Gallia and Nym were temporarily knocked out."}, {"tag": "p", "text": "As dwan broke, Nym, Sixxa, and Gallia each returned to the air in their own ships. Nym was joined in the Havoc by Kole, who took to the position of gunner. Two Trade Federation Dropships were sent to the factory to deliver reinforcements. Nym ordered them to be taken out and he himself cleared the battle droids from the landing platform on top of the factory. His maneuver allowed Sixxa to land and enter the factory's control tower, wherein he searched the factory's computers for weaknesses in its structure."}, {"tag": "p", "text": "At that time, Sabaoth starfighters flew in to attack the allied forces. Soon after, several dropships approached, in order to deploy Armored Assault Tanks around the factory. Meanwhile, a Sabaoth destroyer arrived over the planet. Nym and company attacked the dropships and avoided the assault of the Sabaoth fighters. Sixxa eventually determined that the destruction of the factory's reactor core would devastate the facility. Ironically, the only way to open the doors to the reactor was to turn on the factory he had come to destroy."}, {"tag": "p", "text": "Upon receipt of Nym's approval, Sixxa activated the factory, which caused six solar towers to rise from the ground. Before the towers could unveil their reflectors, however, the droids overrode Sixxa's commands with a signal of their own. Jinkins detected the droids' signal coming from a transmitter in the factory's hangar. Nym flew into the hangar, destroyed the transmitter, and flew back out to rejoin the battle. The reactor's doors then opened to allow the concentrated sunlight that the towers were reflecting into the factory. Sixxa returned to his ship as the plant became fully operational."}, {"tag": "p", "text": "Nym was tasked with the destruction of the control boxes on the back of each tower so the highly concentrated beams of light would misalign with the factory and expose the opening to the reactor. As that occurred, a Hex Bomber attempted to land at the control tower, but it was easily destroyed. After all the control boxes were destroyed, Nym reentered the hangar and flew to the reactor's opening. Despite his expressed doubts, he was able to drop a bomb into the small opening to destroy the reactor and fly out the hangar again. The resulting chain reaction consumed the factory as the allied forces flew back in to space."}, {"tag": "h3", "text": "Return to space"}, {"tag": "p", "text": "During the surface battle, the Sabaoth destroyer Reaver arrived near the orbital debris field. Lieutenant Bella on the Reaver ordered a salvage operation to be conducted on four pieces of the wrecked Orbital Defense Cannons that could be salvaged to build a new one. Trade Federation Tugs were to be used to collect the parts and Vulture droid starfighters were also sent into the debris field."}, {"tag": "p", "text": "After the factory was destroyed, Kole was transferred back to his own fighter and Master Gallia was recalled by Mace Windu to a rescue mission. After farewells were exchanged between he and Gallia, Nym contacted Captain Juno on the Tritus, who reported that four salvageable parts of the Defense Cannons had been identified. Nym was glad to receive the report and planned to use the cannon to retake his base on Lok from the Trade Federation. He was not happy, however, when he learned that the parts were presently being salvaged for the Trade Federation, and that one of their tugs had already obtained a barrel. Nym ordered the Revenants to secure the Orbital Defense Cannon parts. As they moved in, the Revenants were surprised to be fired upon from the wreckage by what they believed were still active defensive turrets. In actuality, they had been attacked by Vulture droid starfighters that had clung to debris pieces in their walker mode. Nym took notice and informed the Revenants of the ruse. The pirates continued their attack and the tug carrying the barrel was destroyed."}, {"tag": "p", "text": "With her first tug destroyed, Lieutenant Bella contacted the Revenants and gave them a chance to surrender or be killed, but received no reply. Bella then ordered a commander to execute plan Beta-Three and three Sabaoth frigates jumped to hyperspace in response. Nym and Jinkins noticed the frigates' departure while they and the other Revenants destroyed more tugs sent to collect the cannon parts."}, {"tag": "p", "text": "The Revenants were destroying Trade Federation Tugs while Tritus moved to a more favorable position to launch its own tugs. Once in place, Captain Juno unleashed the tugs, which were numerically designated 1 through 4. Tug 1 was sent to the sent to the barrel, Tug 2 was dispatched to the capacitor, Tug 3 went to get the focus array, and Tug 4 moved to capture the casing. At the time of the Mere tugs launch, Sabaoth fighters were released from the Reaver to attack the pirate tugs. Revenant starfighters had to simultaneously defend the Mere tugs from the Sabaoths and prevent more Trade Federation tugs from collecting the cannon parts first, all the while having to avoid being shot down by more droid starfighters in their flight mode. Revenant forces eventually prevailed, and all four cannon parts were loaded onto the Tritus."}, {"tag": "p", "text": "Bella was furious that the pirates had obtained the cannon pieces, and threatened her subordinates' lives if the pirates were not killed. A large amount of Sabaoth fighters then took off from the Reaver. Nym, in the meantime, ordered the Revenants to cover the Tritus until it could leave. He also gave coordinates for the group to arrive at Lok's moon, Khons, where Nym wanted the Cannon installed."}, {"tag": "p", "text": "Shortly thereafter, Bella contacted the commander again to have their plan enacted at that moment. The three frigates then returned, and dropped from hyperspace right behind the Tritus. The ships used their tractor beams to prevent the Tritus from escaping and then opened fire on the trapped cruiser. The Revenant forces attacked and destroyed the Sabaoth frigates, but not before the Tritus' engines were damaged. As the Reaver's anti-capital ship turrets opened fire, Revenant starfighters began to jump to hyperspace. Tritus lingered while Juno reported the ship should get to Khons despite the engine damage. The last of the pirates escaped to hyperspace just before four Sabaoth fighters reached their position."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The engines of the Tritus did eventually fail before it reached Khons. Juno, however, was able to use the Mere Tugs to install the cannon pieces after Nym's forces removed the Trade Federation from the moon. Nym would go on to use the Cannon to great effect in retaking his base from the Federation. There, Nym went head-to-head against Bella in her personal transport. Nym was victorious in the dogfight, which was the last step in securing his base."}, {"tag": "p", "text": "Despite the loss of the Trihexalon plant, Cavik Toth was not finished. Having already gathered the Trihexalon he had, Toth amassed his forces to aid the Confederacy of Independent Systems at the Battle of Geonosis against the Galactic Republic. At Geonosis, Toth's forces were met by Jedi starfighters led by Master Gallia. The Jedi fighters were able to finish off the Hex missiles. With the arrival of the Lok Resistance and the Mere Resistance, the rest of Sabaoth Squadron was destroyed. Toth himself was killed in a dogfight with Gallia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Nod Kartha comprises four successive missions from the 2002 video game Star Wars: Jedi Starfighter. Reti's quote about Scarab starfighters is a reference to the previous game, Star Wars: Starfighter. In the final part, it is possible to destroy the Reaver, and if done, it will just be replaced by another Sabaoth Destroyer. Some of the losses may be attributable to game mechanics, as the bonus objectives for these missions consist of taking out superfluous forces. Also, the player's ship in these four missions is automatically chosen on the first play-through but may be substituted later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}