{"url": "The_Return_of_Ben_Kenobi", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "The Return of Ben Kenobi"}, {"tag": "p", "text": "The Return of Ben Kenobi is a comic strip written by Archie Goodwin and illustrated by Al Williamson. It was originally published by the Los Angeles Times Syndicate from May to July 1982, and later reprinted in Amazing Heroes magazine #27–30, in Classic Star Wars 10 and 11, on StarWars.com's webstrips section of Hyperspace, and most recently in Star Wars: Luke Skywalker, Last Hope for the Galaxy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "An unknown and ancient actor, recruited by Darth Vader, underwent plastic surgery to resemble Obi-Wan Kenobi. He also received Jedi training under Vader, and technological gimmicks were used to make the resemblance to Kenobi more than physical."}, {"tag": "p", "text": "The impersonator first appeared on the Expansion Region desert planet of Aridus, where he saved a Rebel Alliance agent from being apprehended by Imperial troops. Later, the Kenobi impersonator led the native reptilian Chubbits—whom Imperial colonists had long mistreated—in a rebellion against the local Imperial garrison. Hovertrains were ambushed while Imperial military and mining posts were raided. The Chubbits and their leader hit the targets then quickly disappeared."}, {"tag": "p", "text": "News of this reached the Rebel base on the jungle moon of Yavin 4, currently under siege by an Imperial fleet. The young Rebel pilot Luke Skywalker—who had witnessed his mentor's death on the first Death Star during a fight with Darth Vader and was curious about this mysterious reappearance—departed for Aridus with C-3PO on a transport."}, {"tag": "p", "text": "Having just landed on Aridus, they witnessed a group of poorly equipped Chubbits attacking a heavily armored Imperial hovertrain. Seeing his fellow rebels in trouble, Luke and C-3PO threw two bags containing proton charges from their transport at the hovertrain, destroying it. However, flying debris knocked Skywalker unconscious, as they were too close to the train. Luckily, the Kenobi impostor—who had been leading the Chubbits—arrived on the scene and tended to Skywalker."}, {"tag": "p", "text": "Skywalker was fortunate to have only a slight concussion resulting from the flying debris. He soon recovered, and he and his droid joined forces with the Chubbits and Kenobi, who he had not yet realized was an impostor. Later, they continued their journey through the deserts of Aridus on a locally built wind-runner. Later, the impersonator secretly contacts Darth Vader with an update."}, {"tag": "p", "text": "Continuing their insurgency against the Empire, the Chubbit rebels attacked an Imperial outpost and laid waste to it. Using technological gimmicks to substitute his lack of Force power, the Kenobi impostor won the admiration of the Chubbits and Luke Skywalker. Following the raid, the Kenobi impersonator contacted Lord Vader himself via a holoprojector. He informed his master that everything was going as planned and that Skywalker had joined him, not yet having realized that he was an impostor. As part of the plan, the impostor was to lead Luke to the Iron Tower, where Vader would be waiting. Then, Skywalker would be a prisoner of the Sith Lord."}, {"tag": "p", "text": "However, the impersonator began to have doubts about his mission. The respect shown by the Chubbits and the awe in Skywalker's eyes indicated to him that Obi-Wan Kenobi had been a great Jedi Master and that he was little more than a cowardly actor willing to serve under an oppressive Sith-led Galactic Empire."}, {"tag": "p", "text": "Later, he and Skywalker departed for the Iron Tower alone with their droffi steeds on a mission to destroy the automated power transformer and signal amplifier whose powerful ultra-strong frequency waves were crippling the nervous systems of the Chubbits. On their way, the duo defeated an Imperial patrol speeder."}, {"tag": "p", "text": "When they arrived at the Iron Tower, the pair split up as intended by Lord Vader. The Dark Lord of the Sith contacted the Kenobi impersonator and ordered him to lure Skywalker into his trap. However, having seen the Empire's true colors, he refused to obey the Sith Lord and pulled a control lever that started a power overload in the Tower's upper levels, destroying the structure and effectively shut down most of the Imperial operations on the planet."}, {"tag": "p", "text": "The resulting explosion severely wounded the Kenobi impostor, and he died in Skywalker's arms. Before he passed away, he informed Skywalker that he had destroyed the Iron Tower and confessed that he had merely been an impostor."}, {"tag": "p", "text": "Luke later relayed the details of what happened to C-3PO (who was sent to Luke via the Kenobi impostor just before the latter sacrificed himself). C-3PO then mentioned that Vader was seemingly killed in the Iron Tower's explosion, although Luke suspected that Vader might have survived and that they won't be rid of him as easily."}, {"tag": "p", "text": "Vader was knocked unconscious by the debris and left for dead, although he regained consciousness long enough to witness Luke Skywalker's ship fly away. He was later rescued by Jix, a former Imperial soldier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}