{"url": "The_Secrets_of_Long_Snoot", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "The Secrets of Long Snoot"}, {"tag": "p", "text": "\"The Secrets of Long Snoot\" is a short story in the anthology novel From a Certain Point of View. The story, written by Delilah S. Dawson, focuses on the point of view of Imperial spy Garindan ezz Zavor."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story opens with the Kubaz spy Garindan ezz Zavor (\"Long Snoot\") enduring an abusive xenophobic tirade from a human man, who denounces him as an opportunistic spy. Speaking in Kubazian, Garindan regards humans as a species who think of themselves as the center of the solar system. To spite the man, Garindan steals his leather bag of credits. While regarded as an outsider on Tatooine, Garindan comes from a respectable clan on Kubindi that is best known for breeding and farming a strain of succulent picolet beetle. His children are well-known senators, orators, and artists and he has several grandchildren in creches and academies."}, {"tag": "p", "text": "Yesterday, Garindan depleted his credits by paying for a garbled comm message from the planet Kubindi. Garindan learns from his daughter that his wife is dead and that the family is in trouble. Paying for the credits had thrown his plan to return and liberate his homeworld of Kubindi from the Galactic Empire in disarray. Garindan resolves to spend the next three standard days gathering enough information and credits to leave Tatooine and return to his homeworld, where he must bury his mate with full honors and regain control of his clan. Since his network is large, Garindan has arranged for an informant to supply the codes he needs to get home."}, {"tag": "p", "text": "Traveling through the \"smelly\" streets of Mos Eisley, Garindan meets with his human informant, who gives him the codes necessary to get pass the Imperial blockade of Kubindi. The informant tells Garindan that the codes are good for at least a few days and advises him to fly on a trading vessel and to avoid ships that the rebels would fly. Garindan returns to his hovel, which was once used to store beasts. Garindan regards the lingering odor of the beasts to that of the humans and other aliens. He regards beasts as having predictable, harmless and dependable odors. By contrast, humans and other sentient beings emit thousands of pheromones in their secretions, exposing their thoughts and feelings."}, {"tag": "p", "text": "Garindan reflects on how the Empire had exploited him and his people as spies during to the Kubaz species' ability to read body language, smell pheromones and weapons, and hear from long distances. The Empire had used diplomatic protocol droids to win the support of the Kubaz elders. Garindan had been one of the chosen students picked from the academy to study under the Empire as a diplomat and return to his mate and hive with new accolades. Instead, Garindan had been indentured and trained as a spy. He and fifty companions were put in manacles and forced to withstand propaganda, indoctrination, and reprogamming. Garindan had slipped away from his job and tried to return to Kubindi, only to find its orbit guarded by Imperial firepower. He resolves to take up a new job to buy himself enough credits to hire a ship with the intention of slipping through the Imperial blockade and telling his people how the Empire exploits them."}, {"tag": "p", "text": "This job involves Garindan helping the Empire to locate two fugitive droids and collecting the bounty. Garindan starts his day at Chalmun's Spaceport Cantina where he witnesses the arrival of Luke Skywalker and Obi-Wan Kenobi. Shortly later, Ponda Baba and Cornelius Evazan harass Skywalker only for Baba to have his arm chopped off by Kenobi. Garindan also observes Skywalker and Kenobi meeting with Han Solo and the Wookiee Chewbacca to discuss their passage to Alderaan. Since the droids are not with them, Garinda waits in a dark corner between the cantina and Han's junker ship. He soon catches the men walking by with C-3PO and R2-D2."}, {"tag": "p", "text": "Garindan alerts the Imperial authorities to the presence of the droids at Mos Eisley spaceport's Docking Bay 94. Garindan directs the stormtroopers to Docking Bay 94 where a gun battle ensues. Believing that he will be paid, Kubaz buys another drink at Chalmun's Cantina from the bartender Wuher. While chatting with the Devaronian Labria, Garindan receives the news that the droids escaped and hence the bounty is not awarded. Though Garindan is frustrated by the second setback, Labria hires Garindan for a job on behalf of Derrida the Ketton. He tells Garindan that Derrida needs a companion for a job against the Rebel Alliance and that the humans are not willing to take it."}, {"tag": "p", "text": "Resolving to return home and to expose the Empire's exploitation to his people, Garindan accepts the job. When Labria compliments Garindan's espionage skills and asks whether he is motivated by unscrupulous motives or the pure joy of destroying so many well-laid plans, Garindan replies that he is \"very far from home.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The story depicts Garindan as a victim of the Galactic Empire rather than an opportunistic spy. However, the 2013 digital card game Star Wars: Force Collection established Garindan as a greedy and hired Imperial spy. Lucasfilm Story Group's Matt Martin stated that he leans towards the depiction of Garindan from From a Certain Point of View, but until another there was a need to officially clarify it for another story it was still up for debate. The 2019 reference book Ultimate Star Wars, New Edition later supported From a Certain Point of View's version of his backstory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}