{"url": "The_Sims_4_Star_Wars:_Journey_to_Batuu", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:2020 computer and video games", "Category:Non-canon computer and video games", "Category:Star Wars: Galaxy's Edge"], "nodes": [{"tag": "h1", "text": "The Sims 4 Star Wars: Journey to Batuu"}, {"tag": "p", "text": "The Sims 4 Star Wars: Journey to Batuu is a downloadable content pack for The Sims 4 that serves as a video game adaptation of the world of Batuu and various characters and locations from the Star Wars: Galaxy's Edge park. It also includes quests and original NPC characters."}, {"tag": "p", "text": "Though the game is not considered canon, elements and names within the game are canon. As such, the game can be used as a source of canon information. Permanent NPCs that appear in every save file, such as Agnon, as well as items that are acquired in the game are considered canon. However, NPCs that are generated randomly using a variety of naming combinations are not considered canon."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Sims 4 Star Wars: Journey to Batuu is set on the remote planet on the edge of Outer Rim Territories, inspired by Star Wars: Galaxy's Edge at Disneyland Resort® and Walt Disney World Resort®. As a new visitor to Batuu, Sims will experience the authentic sights and sounds of the Star Wars universe, including the Millennium Falcon and DJ R-3X's interstellar hits at Oga's Cantina. They'll also embark on exciting missions, unite with iconic characters like Rey and Kylo Ren, and get their hands on their very own lightsaber and droid."}, {"tag": "p", "text": "In The Sims 4 Star Wars: Journey to Batuu, players will leave their homes to travel to the planet of Batuu where they'll have to make a choice on which faction to work with, as the actions their Sims take will lead to control of the Black Spire Outpost. Sims can choose to support Rey and Vi Moradi as part of the Resistance, pledge loyalty to the First Order under Kylo Ren or shift their focus to gaining credits with Hondo Ohnaka and the scoundrels. As Sims embark on exciting missions, they'll increase their reputation, unlock new artifacts and one-of-kind clothing, customize their own droids and create a coveted lightsaber. After players leave Batuu and return home, they can even bring back some of these items, like their lightsaber, to enjoy with other Sims they've already created."}, {"tag": "h2", "text": "Characters"}, {"tag": "p", "text": "Already established characters included in the adaptation include Vi Moradi, Lt. Agnon, Rey, Kylo Ren, Hondo Ohnaka, DJ R-3X, and First Order Stormtroopers. Chewbacca also appeared as part of a quest, though the player was unable to see him beyond the description."}, {"tag": "p", "text": "Travelers could also shop from the following vendors: Dok-Ondar in his Den of Antiquities, Savi in his workshop, and Mubo in his Droid Depot. Travelers could buy food and drinks from Oga's Cantina, the Milk Stand, and \"Cookie\" Strono Tugs, along with other restaurants."}, {"tag": "p", "text": "The game included new characters of various species, including Zabrak, Twi'lek, Abednedo, Human, Bith, and Mirialan. These characters were classified as either bartenders, vendors, scoundrels, lightsaber challengers, and Batuu citizens. Travelers could interact with these new characters as part of quests, asking them their opinions on Batuu, the Resistance, and the First Order."}, {"tag": "p", "text": "Players could complete missions to gain reputation with three factions: Scoundrels, the Resistance, and the First Order. Gaining Resistance reputation decreased First Order reputation, and vice-versa. a player's faction affected the Outpost."}, {"tag": "h3", "text": "Scoundrels"}, {"tag": "p", "text": "To gain reputation with the scoundrel faction the travelers spoke with Hondo Ohnaka and completed missions assigned to them. Gaining reputation with the scoundrel faction did not affect a player's reputation with the other factions. Missions from Hondo included gathering intel, acquiring a package for Hondo, and joining him on a mission."}, {"tag": "p", "text": "Players were able to accompany Hondo and Chewbacca on “business trip[s]” to either transport spice from Kessel to Takodana, or to transport Golden Lichen from Oga to Coruscant. Depending on how prepared the player was, greater rewards were possible with these trips."}, {"tag": "p", "text": "Hondo also sent players to Dok-Ondar to help him find some stolen antiquities around the outpost."}, {"tag": "h3", "text": "The First Order"}, {"tag": "p", "text": "To gain reputation with the First Order the travelers spoke with Lt. Agnon and completed missions assigned to them, eventually meeting Kylo Ren once gaining enough reputation. As players gained reputation they gained ranks in the First Order, and increased the First Order presence at the outpost. Gaining reputation also allowed players access to the First Order holo table, and First Order uniforms to wear."}, {"tag": "p", "text": "Missions for the First Order  included delivering supplies, resealing crates, checking IDs of Batuu citizens, patrolling, and other activities."}, {"tag": "h3", "text": "The Resistance"}, {"tag": "p", "text": "To gain reputation with the Resistance the travelers spoke with Vi Moradi and completed missions assigned to them, eventually meeting Rey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}