{"url": "The_Secret_of_Tet-Ami", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 13"], "nodes": [{"tag": "h1", "text": "The Secret of Tet-Ami"}, {"tag": "p", "text": "The Secret of Tet-Ami is a comic that first appeared in Star Wars Tales 13 and was collected in Star Wars Tales Volume 4 and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Live from the archaeological treasure trove on Carthas a TV Host called Kruy Mulacks presents his Holo show. The news journalist has come to Carthas as archaeologists begin to unlock the Temple of Tet-Ami. As Kruy Mulacks presents to his audience Jedi Master Mace Windu arrives at the site. He consults his holo-map and heads towards the temple. When he arrives he uses a key to open a passage that had been unbeknownest to the Archaeologists at the site."}, {"tag": "p", "text": "Mace heads into the temple and walks past some rusty figures. He looks at them quizzically and mutters to himself \"droids?\" Then he steps on a switch and the droids come to life. Luckily Mace has his lightsaber quick at hand and he makes short work of the droids."}, {"tag": "p", "text": "He then heads through some doors and is surprised to see a statue in his image. Mace then takes a box out of his bag. He takes out a green orb like object. Mace then places it on the statue's outstretched hand. The small orb then begins to hum and green light floods the room causing Mace to shield his eyes."}, {"tag": "p", "text": "When the green light fades Mace sees he has appeared on an ancient battleground and the Carthasians are being attacked by a beast-like species. Mace Windu fights with the Carthasians and finally after Four long days the Carthasians are calling victory and cheering their hero: Tet Ami. Then Mace is shrouded in green light and disappears again."}, {"tag": "p", "text": "He reappears back in the tomb as the Carthasian archaeologists break through. The green glowing orb falls to the floor, now a white glow emanates from it."}, {"tag": "p", "text": "When Mace returns to Coruscant he talks to Jedi Master Yoda about his experience. Yoda explains that it was centuries ago that the Jedi discovered the temple and they protected its secrets as it was a time paradox. The Jedi had waited until they were sure Mace Windu would become a Jedi as \"always must a Jedi start the job he finished!\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}