{"url": "The_Secret_Tales_of_Luke%27s_Hand!", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 8"], "nodes": [{"tag": "h1", "text": "The Secret Tales of Luke's Hand!"}, {"tag": "p", "text": "The Secret Tales of Luke's Hand! was an 8-page comic featured in Star Wars Tales 8. It was written by Henry Gilroy, with artwork by Dario Brizuela, lettering by Steve Dutro, and coloring by Cara L. Niece."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "It was 11 ABY, seven years after the Battle of Endor. At the Palace of the New Republic on Coruscant, a four-year-old Anakin Solo was having trouble sleeping. His mother Leia Organa Solo persuaded Han Solo to talk to Anakin, since he was unwilling to confide in his mother."}, {"tag": "p", "text": "When Han entered Anakin's bedroom, Anakin asked him why his uncle Luke Skywalker always wore a glove. Anakin told his dad that he knew that something had happened to Uncle Luke's hand. Han proceeded to tell his son that Luke had fought his father Darth Vader in Cloud City above the planet of Bespin. Luke's hand was cut off during the battle. However, it survived!"}, {"tag": "p", "text": "Thus begins the story."}, {"tag": "p", "text": "The story excited Anakin, who said that he wanted to be Luke's hand when he grew up. He asked his dad what happened to Luke's thumb, nearly beginning what could be a recursive series of parodies based around the appendages of major characters, but his dad told him that the story would be continued another night. It was past his bedtime."}, {"tag": "p", "text": "Han said goodnight to his son and left the room, only to be faced by his wife asking, \"The Emperor's Foot?\" Han replied, \"What? No harm done.\""}, {"tag": "p", "text": "Back in his room, Anakin was \"pitting\" his fingers against his toes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This story contradicts the Star Wars: Dark Empire comic series as it shows an intact Coruscant and a four-year-old Anakin Solo. In official canon, Anakin was just an infant, and Coruscant had been devastated during the fighting between various Imperial factions in 10 ABY after Thrawn's death the previous year. Nevertheless, the story is referenced in The Complete Star Wars Encyclopedia which has an entry for the Millennium Fist."}, {"tag": "p", "text": "Luke's severed hand was actually retrieved by agents of the Empire and used by the mad Dark Jedi clone Joruus C'baoth to generate a clone of Luke: Luuke Skywalker."}, {"tag": "p", "text": "Luke's lightsaber as seen in the comic, is green. The lightsaber Luke lost during the duel was blue."}, {"tag": "p", "text": "The Palace of the New Republic appears to be the old Imperial Palace."}, {"tag": "p", "text": "Anakin Solo \"asked his dad what happened to Luke's thumb, but his dad told him that the story would be continued another night.\" This is possibly a reference to the Star Wars parody \"Thumb Wars\"."}, {"tag": "p", "text": ""}]}