{"url": "The_Season_Scepter", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "The Season Scepter"}, {"tag": "p", "text": "\"The Season Scepter\" is the thirteenth episode of the second season of Ewoks. Written by Bob Carrau and directed by Dale Schott, the episode originally aired on ABC on November 1, 1986."}, {"tag": "p", "text": "The Season Scepter"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "From summer to winter"}, {"tag": "p", "text": "The episode opens with a butterfly–like creature being swallowed by a frog–like creature. However, the butterfly prevails and swallows the frog. Meanwhile, Kneesaa and Latara sit by the riverbank, wishing that the weather would not change and that they could sit here forever. Just then, Wicket swings on a vine and rides on a large lotus, splashing them with water. Their umbrella, which turns out to be a living creature, walks away."}, {"tag": "p", "text": "Wicket takes delight in having given them a fright. Latara lunges at him but falls into the river. Wicket laughs. Teebo attempts to help dry Latara by summoning a cool breeze with magic. At first it works and the breeze succeeds in drying Latara's fur. However, Teebo soon loses control of the spell and summons powerful winds that rip up trees. This is followed by a snowstorm. Latara tells Teebo to turn off the spell but Teebo is unable to reverse the spell. Wicket proposes that they find Master Logray. Teebo says this wasn't supposed to happen. Much of the forest moon of Endor is soon covered in snow."}, {"tag": "h3", "text": "Winds of winter"}, {"tag": "p", "text": "Meanwhile, Odra cackles with laughter at the Snow Palace. She tells the Snow King that she is pleased that she stole the Season Scepter. The Snow King wonders whether this decision was a mistake. Odra questions whether the Snow King is reconsidering his plan to freeze the Ewoks and take their Sunstar. The King vows to do anything for Odra, addressing her as the Duchess of Sleet."}, {"tag": "p", "text": "The Snow King uses the Season Scepter to summon more snow and ice, much to the delight of Odra. At Bright Tree Village, the Ewoks huddle in the cold. Believing that he brought about the snowstorm, Teebo is despondent. Wicket saves his sister Teebo's sister Malani from following of a wooden walkway. She asks why it is so cold. Latara blames Teebo for the snowstorm. Malani is angry with her old brother while Teebo groans."}, {"tag": "p", "text": "Kneesaa notices that Master Logray is not in his hut and points out that the village is not ready for a long, snowy season. Wicket decides to check the observatory. The four Ewoks find that Master Logray is not in the observatory. They find the Sunstar glowing inside its chest. The Leaf Queen pleads for Master Logray to say them from the terrible snow storms. Kneesaa recognizes the Snow Queen while Teebo trembles in fear. The Leaf Queen tells them to travel to the Sun King's palace and that the future of Endor is in their hands."}, {"tag": "p", "text": "Latara wonders whether the Leaf Queen intends for them to get there by flying leaf. Just then, a flying leave materializes outside the observatory. Latara blushes while Wicket thinks they should go. Kneesaa points out that the Leaf Queen sent for Master Logray and not them. Wicket replies that they can't find Logray and that the Queen needs their help. Teebo wants to make amends for what he has done. Kneesaa agrees to go but Latara is unwilling."}, {"tag": "h3", "text": "A perilous journey"}, {"tag": "p", "text": "The flying leaf carries the Ewoks away into the skies of Endor. Meanwhile, Chief Chirpa enters the observatory and finds the Sunstar glowing. He resolves to find Master Logray quickly. Elsewhere, the Ewoks survey the frozen landscape of Endor from their leaf. After seeing the Mimphs bogged down in snow, Teebo says he feels miserable. Kneesaa also notices the Strutters freezing on the ground. Teebo says he feels so horrible. Kneesaa says she has not seen so much snow and ice."}, {"tag": "p", "text": "Meanwhile, Odra and the bewitched Snow King watch the Ewoks traveling on their leaf. The Snow King vows to do anything for her. Odra expresses her desire for the Sunstar. The Snow King believes that the Ewoks must be traveling with the Sunstar. Odra convinces him that they need to get to the Ewoks before they reach his brother the Sun King. The King summons his Iceheads and orders them to bring the Ewoks to him."}, {"tag": "p", "text": "Wicket and his friends travel over mountains and canyons. Wicket hopes the leaf knows the way to the Sun King's palace. Teebo proposes using a potion to undo the spell but Latara is skeptical that he will succeed. Teebo tries and scatters golden dust. However, this cuts the giant flying leaf in half. The leaf temporarily separates before joining together again. Wicket advises Teebo to cool the magic for a while."}, {"tag": "p", "text": "Kneesaa sights several brown cylindrical buildings, which she believes to be the Sun King's palace. Latara doesn't think it is a palace. Two Iceheads then surface and ambush the Ewoks, causing Kneesaa to fall off. Kneesaa is captured by two Iceheads. Wicket and the others struggle with other Icehead boarders. Wicket thinks they should go back for Kneesaa but Latara asks about them. Wicket tells them not to worry and twists the end of the leaf, causing them to fly into a large snowy cave where they catch another stowaway, a snow monster."}, {"tag": "p", "text": "The Snow monster grabs the two Iceheads and dives with them into the snowy ground. The enraged snow monster chases the two Iceheads. Wicket is relieved they escaped out of trouble and thinks they should go back and rescue Kneesaa. However, the leaf narrowly avoids crashing into a rock and lands on the snow, carrying the Woks down a snowy hill.  The leaf takes them off a cliff and dumps the Ewoks near two trees."}, {"tag": "p", "text": "The three Ewoks survive the landing since their fall was cushioned by the snow. However, Kneesaa has been captured by the Iceheads. Wicket wants to pursue the Iceheads but the creatures trigger an avalanche, forcing the Ewoks to flee to safety. The three Ewoks are caught up in the avalanche and arrive outside the Sun King's palace."}, {"tag": "h3", "text": "Guests of the Sun King"}, {"tag": "p", "text": "Wicket, Latara and Teebo enter the Sun King's palace where they are greeted by the Leaf Queen, her brother the Sun King,  and her sister the Flower Queen. The Flower Queen is tense about her flowers but the Sun King is relaxed. Teebo blames himself for the winter storm. The Leaf Queen reassures Teebo that the snow storm was caused by her brother the Snow King. Teebo is relieved that it is not his fault."}, {"tag": "p", "text": "Wicket tells the weather deities that their friend Kneesaa has been carried away by ice creatures. Teebo then says it is probably his fault. The Sun King believes that Kneesaa has been taken to the Snow Palace. The Leaf Queen explains that their brother the Snow King as fallen in love with an evil Snow Sprite called Odra, the Duchess of Sleet. She tells them that Odra has frozen his heart, leaving him selfish and mean."}, {"tag": "p", "text": "The Flower Queen adds that the Snow King has stolen the Season Scepter,  which the Leaf Queen explains is a magical staff that controls the weather. She explains that they pass it to each other, causing the seasons to change. The Sun King grumbles that the Iceheads stole it from him. The lateback Snow King recalls that he was hanging out on the beech with some otter-like aliens. He recalls that the Ice Heads stole it and summoned the big freeze before leaving."}, {"tag": "p", "text": "The Leaf Queen says that they summoned Logray since only the Sunstar could melt the Snow King’s heart. Wicket says that Master Logray couldn't make it. The Sun King expresses surprise. The Leaf Queen asks if they have the Sunstone, which can reverse the wintry spell. Wicket says that they didn’t bring it with them. The Flower and Leaf Queens add that without the Sunstone, only the Season Scepter can reverse the spell. The Leaf Queen resolves to contact Logray before every creature on Endor is frozen."}, {"tag": "h3", "text": "Ending Odra's reign"}, {"tag": "p", "text": "Back at Bright  Tree Village, Chirpa searches for Logray only to find him buried beneath the snow while trying to help the animals. Chirpa asks him what is causing the terrible snows. Logray realizes that something has happened to the Season Scepter and says that they must contact the Leaf Queen."}, {"tag": "p", "text": "While flying on the flying leaf, Teebo asks Wicket if they should have told the Leaf Queen and her siblings where they were going. Wicket replies that they must save Kneesaa first. The Ewoks fly towards the Snow Palace, with the leaf ending near the edge of the cliff."}, {"tag": "p", "text": "Wicket spots a group of Icehead sentries walking in a circle outside the palace. Wicket says that they must get inside the Snow Palace in order to retrieve the Season Scepter and melt the Snow King's frozen heart. When Latara asks how, Wicket proposes that they disguise themselves as Iceheads and follow them inside the Snow Palace. The three Ewoks follow the guards into the palace while chanting \"snow-e-snow.\""}, {"tag": "p", "text": "Inside the palace, Latara asks what they should do. Wicket whispers for silence. The three Ewoks watch Kneesaa, who has been brought before the Snow King and Odra. When the King ponders what they should with Kneesaa who doesn't have the Sunstar, Kneesaa vows that they will never get it even if they freeze all of Endor. The King replies that they shall see."}, {"tag": "p", "text": "He uses the Season Scepter to free Kneesaa in a block of ice. Odra is pleased and proposes trading Kneesaa for the Sunstar. The enchanted Snow King adds not if they freeze the Ewoks first. He then fires a flare from the Scepter. Watching the events, Latara asks the boys how they will recover the Season Scepter. Teebo  comes up with the idea of an ice stick and says they should round up some equipment."}, {"tag": "p", "text": "While Odra ponders what they should do with the Sunstar, Wicket and Latara arrive with a cart offering to serve Ice-on-a-stick. When the Ice King asks who they are, Wicket claims that they are ice-on-a-stick peddlers. Teebo hides under the cart and Wicket instructs him to steal the Sceptre while they distract the Ice King and Odra."}, {"tag": "p", "text": "Odra recalls that she has encountered the Ewoks before. While Latara and Wicket service the King an ice-on-a-stick, Teebo attempts to grab Season Scepter only to discover that he has taken an icehead club. The King says he has gotten the Season Scepter and attempts to freeze them under Odra’s orders. However, he instead freezes the cart."}, {"tag": "p", "text": "The Snow King sends his Iceheads after the Ewoks. Teebo uses his Icehead club to knock down two Iceheads. Wicket pulls him to safety before the Ice King can freeze him. Odra chases Latara but she brushes past an Icehead, causing the Duchess to crash into the guard. Wicket pushes a cart into the path of the Snow King, causing him to fall backward and drop the Season Scepter."}, {"tag": "p", "text": "Teebo grabs it and uses the Scepter to fire a blast at Odra, causing the Duchess to lose her hair.  Teebo struggles to control the Season Scepter, which unleashes flowers and cause stalactites to drop around Latara, trapping her. He summons a bush, causing two Iceaheads to crash into it. Teebo struggles to control the seasons."}, {"tag": "p", "text": "The Snow King and Odra converge on him. The Snow King demands that Teebo hand over the scepter. Teebo calls for Wicket’s help. Wicket fires the Season Scepter at the Ice King, melting his heart and causing him to change back to his normal form. Odra shrinks into a tiny being before fleeing and vowing revenge. Latara dismisses the Duchess as a drip."}, {"tag": "h3", "text": "Victory and restoration"}, {"tag": "p", "text": "Freed from the spell, the Snow King laughs and says he feels much better. Wicket explains that he and Teebo melted his heart of ice. He pleads with the King to unfreeze Kneesaa. The King is shock that he did that and apologizes. He obliges and restores Kneesaa back to her normal form. Kneesaa embraces Wicket."}, {"tag": "p", "text": "The Snow King then uses the Season Scepter to restore Endor to its sunny season, ending the snowstorm. The Ewoks emerge from Bright Tree Village. The Snow King decides to return the Season Scepter to his brother, the Sun King. Kneesaa longs for a few more days of sun."}, {"tag": "p", "text": "Just then, Chief Chirpa arrives with Master Logray, the Leaf Queen, the Flower Queen, and the Sun King. Chirpa says they were a little late. The younger Ewoks are delighted to see their elders and the other weather deities. The Sun King is pleased with the \"little dudes\" while the Snow King says that they were very brave. Chief Chirpa is proud of what Wicket and his friends have done. When Wicket asks if he will get a trophy for his belt of honor, the Ice King gives him an icehead club."}, {"tag": "p", "text": "Wicket is grateful but Latara reminds them that she is still trapped behind the rocks. Wicket suggests that Chief Chirpa could rescue her, causing everyone to laugh and Latara to smile."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}