{"url": "The_Sleeper", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Aquatic creatures", "Category:Creatures of Dathomir", "Category:Culture of Dathomir", "Category:Force-sensitive creatures"], "nodes": [{"tag": "h1", "text": "The Sleeper"}, {"tag": "p", "text": "The Sleeper was an ancient creature native to the depths  of Dathomir. It had two large lavender eyes, a carapace-covered body, antennae, and four appendages, the upper pair resembling sickles with spear-like points while the lower appendages were tentacles. The Sleeper preferred to remain dormant in the subterranean pools below the Nightsister lair, emerging only when an aspiring Nightsister summoned it from the depths. The Jedi Knight Quinlan Vos and the bounty hunter Asajj Ventress encountered the Sleeper while training to assassinate the Sith Lord Count Dooku."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Sleeper was a large creature native to Dathomir. It was capable of movement on land and water, although its tentacles were better suited it for underwater travel. The Sleeper possessed a large, crustacean-like carapace covering over its body and had four appendages, two sickle-like legs and a pair of massive, blue tentacles. Its eyes were very complex, able to see five or ten more colors than a near-human. It was possible that it could also see in the Force as well. When in danger, the Sleeper was a formidable fighter. In a fight, the flat, teardrop-shaped scales beneath its eyes would turn from green to red, signaling the creature's intent to attack."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sleeper contained a substance that was a necessary ingredient for the Water of Life. As a rite of passage, a young Nightsister would lure the Sleeper from its slumber and force it to remove a piece of its body. This piece was then boiled with water from the pool that the creature came from along with other items to create the magical substance. Getting too close to the creature in combat was dangerous, as contact with this substance could cause powerful hallucinations."}, {"tag": "p", "text": "While training with the bounty hunter and former Nightsister Asajj Ventress in the ways of the dark side, Quinlan Vos encountered the Sleeper as a final test of his will. Only by fully giving into the dark side and subjugating the creature to his will could Vos prevail. After succeeding in this task, Ventress, as a test of Vos' commitment to killing Dooku, instructed Vos to kill the ancient beast."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sleeper first appeared in Dark Disciple by Christie Golden, a novel adapted from unused scripts originally meant for Star Wars: The Clone Wars The creature was first pictured in the non-canon book Jedi Academy: At Last, Jedi. However in the Galactic Zoology Today entry for the Sleeper included in the book, it is specifically noted that due to the hallucinogenic properties of the being, its true appearance is not known."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}