{"url": "The_Sims_4", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:2014 computer and video games", "Category:Non-canon computer and video games"], "nodes": [{"tag": "h1", "text": "The Sims 4"}, {"tag": "p", "text": "The Sims 4 is a Life simulation video game developed by Maxis and published Electronic Arts. It is the fourth main title in The Sims franchise. The title revolves around players creating and controlling or manipulating \"Sims\", or characters designed with unique appearances and personalities. Expansion packs for the game add new content and features, as do new updates. The Sims 4 features content from the Star Wars franchise, including special costumes and decorations added based on characters from the franchise, as well as a DLC expansion pack based on Star Wars: Galaxy's Edge."}, {"tag": "h2", "text": "Star Wars content"}, {"tag": "h3", "text": "October 2014 update"}, {"tag": "p", "text": "A content update on October 27, 2014, added costumes to the game as part of a Halloween-themed update. Female Sims, teen and older, could wear a themed Leia Organa with the appearances of Leia Organa, consisting of a fake hairpiece and a full outfit, each designed to mimic Organa's classic appearance in Star Wars: Episode IV A New Hope. Male Sims, teen and older, could wear a Rebellion flight suit, as well as a Darth Vader helmet and outfit. Children could wear a Yoda mask and outfit. A content patch in June 2016 made all teen and up costumes available for both genders. In December 2019, these costumes were also added to The Sims Mobile."}, {"tag": "h3", "text": "May 2015 update"}, {"tag": "p", "text": "In celebration of May 4th, Maxis released additional costumes in 2015. Female Sims, teen and older, could wear an Aayla Secura headpiece that also changed the entire body into her iconic blue skin color. Additionally, her full-body outfit was made available as well. Male Sims, teen and older, could wear headpieces and full outfits for Darth Maul and Boba Fett. Costumes made available in this content update were also converted for use by all genders in the June 2016 update. As with the 2014 update, all costumes from this update were added to The Sims Mobile in December 2019."}, {"tag": "h3", "text": "December 2019 update"}, {"tag": "p", "text": "Another content update was released on December 12, 2019, adding a cosmetic statue of Grogu from The Mandalorian to the game. Players were then able to place the statue on any lot in the world. This same content is also available in another title, The Sims Mobile."}, {"tag": "h3", "text": "Batuu DLC"}, {"tag": "p", "text": "On August 27, 2020, The Sims 4 Star Wars: Journey to Batuu, a DLC expansion for The Sims 4 was announced involving content from Star Wars: Galaxy's Edge. This expansion adds new in-game quests based on interactions with NPCs in the DLC, and also adds new content such as droids, lightsabers, starships, and new NPCs such as Rey Skywalker, Kylo Ren, Hondo Ohnaka, and Vi Moradi. The DLC itself takes place on Batuu, in Black Spire Outpost. It was released on September 8, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}