{"url": "Battle_of_Nyriaan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Jedi Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Nyriaan"}, {"tag": "p", "text": "The Battle of Nyriaan was a battle that was fought during the Jedi Civil War, near to the planet Nyriaan."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following a vision that he had of Nyriaan, the Sith Lord Darth Glovoc decided to travel there, aboard his flagship, the Interdictor-class cruiser Dying Sun. The Sun arrived at Nyriaan in 3956 BBY and carried out a detailed scan of the area surrounding the planet. However, the ship's active sensors were detected by the Galactic Republic, which sent a strike force to attack the cruiser."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Glovoc was concentrating all of his attention on Nyriaan and didn't sense the approaching Republic ships until it was too late. The resulting battle was very violent and the Sith succeeded in destroying three Republic cruisers and many Republic starfighters. However, the Republic forces inflicted heavy fire on the Dying Sun and fired many torpedos at it. The ship was crippled and eventually became caught in Nyriaan's gravity well. It broke up into several pieces, which then fell to the planet's surface. The Republic forces declared that they had been victorious in the battle and never investigated what the Dying Sun had been doing at Nyriaan, as they had assumed it had just been hiding there to avoid discovery."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A number of escape pods, from both the Dying Sun and the Republic ships, fell to the surface of Nyriaan, along with the fragments of the Dying Sun. Despite the damaged inflicted to the Sun, Darth Glovoc and a number of the crew members survived the crash. Glovoc put himself into stasis inside an oubliette and over the years, the descendants of the Sith survivors became inbred and depraved, worshiping the sleeping Glovoc as a god."}, {"tag": "h2", "text": "Sources"}]}