{"url": "The_Starship_Graveyard", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:The Legends of Luke Skywalker—The Manga"], "nodes": [{"tag": "h1", "text": "The Starship Graveyard"}, {"tag": "p", "text": "\"The Starship Graveyard\" is a story that was published in The Legends of Luke Skywalker—The Manga. The story was written and illustrated by Akira Fukaya and Takashi Kisaki, and published on January 14, 2020 by Viz Media."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Battle of Jakku"}, {"tag": "p", "text": "The comic opens with several Imperial officers eating in the mess hall of an Imperial-class Star Destroyer. The protagonist, who is an Imperial gunner admires the symmetry and orderliness in Imperial life. While chatting with a comrade about his marksmanship, their meal interrupted when a New Republic Starhawk-class battleship collides with their Star Destroyer. The Star Destroyer is caught up in a space battle with \"rebel\" forces above Jakku."}, {"tag": "p", "text": "The officer admires an orderly formation of stormtroopers. Vowing to protect the Emperor Palpatine's New Order, he dons an Imperial gunner's helmet and mans a laser cannon. The Imperial gunners are unable to shoot down New Republic starfighters since they are attacking from the Star Destroyer's blind spots. As the battle rages, the Imperial gunners are attacked by hologram images of Luke Skywalker, whom the protagonist regards as an extremely dangerous Jedi war criminal.  This psychological warfare demoralizes the Imperial crew."}, {"tag": "p", "text": "With the Star Destroyer's deflector shields collapsing and hull being breached, the Imperial gunner and his comrades flee in escape pods. The Imperials believe that Skywalker can bring down Star Destroyers. The Imperial gunner crash lands on the desert world of Jakku. After awakening, the gunner finds that his legs have been fitted with splints. He also watches his Star Destroyer plunging into the sandy desert."}, {"tag": "h3", "text": "The cloaked rescuer"}, {"tag": "p", "text": "Shortly later, the gunner encounters a cloaked figure who tells him that he shouldn't move because he broke his legs. The stranger had applied splints to his legs. When the gunner asks who the stranger is, the cloaked figure replies that he was the only one alive in the escape pod. As the cloaked man drags him on an improvised sled, the gunner thanks him for helping him and asks if the cloaked man can bring him to an Imperial Navy outpost. The cloaked stranger replies that he has no love for the Empire, leading the gunner to believe that the man is a rebel. The gunner dislikes the stranger's asymmetrical smile, which he regards as ugly."}, {"tag": "p", "text": "When the gunner asks the stranger what he wants with him, the stranger replies that they need companionship in the desert. The gunner travels with the man for what seems like days, leading him to believe that they are going round in circles. The gunner is haunted by nightmares of being tortured by rebels but the cloaked stranger tells him that he has a fever and encourages him to eat the last of the rations."}, {"tag": "p", "text": "While digging through the wreckage for goods to salvage, the cloaked stranger pulls the man behind a structure. The gunner thinks that the stranger is going to kill him but it turns out that the stranger was saving him from a sandstorm. The stranger says that he grew up in a desert but that the sandstorms were not as bad as on Jakku."}, {"tag": "p", "text": "The cloaked stranger brings the Imperial gunner to a stronghold that is inhabited by scavengers and scattered Imperial personnel. The hungry gunner eats a drumstick despite his yearning for nutrient cubes. Just then, everyone hears a loud explosion. The cloaked stranger carries the wounded gunner on his back. Outside, they discover that the Star Destroyer was destroyed in a reactor explosion, leaving a sea of liquid glass flowing through the desert towards the Imperial stronghold. The gunner thinks they should stay since the walls go at least 1,000 meters deep."}, {"tag": "h3", "text": "Skywalker to the rescue"}, {"tag": "p", "text": "The other scavengers and Imperials disagree, saying that the walls won't hold much longer. While the Imperial officer struggles with anxiety, the stranger fits himself with improvised shoes. Using the Force, the man is able to float over the liquid glass lake. As a result, the gunner realizes that the man is a Skywalker. The other scavengers and Imperials are unwilling to followed the cloaked man over the molten glass lake, believing that he is trying to kill them and steal their possessions."}, {"tag": "p", "text": "The cloaked man understands their fears but says there is no other solution. Despite their skepticism, the cloaked man urges them to trust him. The gunner realizes that the man is the Jedi Luke Skywalker and convinces the others to trust in him. Skywalker uses the Force to protect the scavengers and Imperials following him through the liquid glass lake. These also don improvised shoes. Skywalker's Force powers protect the travelers from danger."}, {"tag": "p", "text": "After Skywalker leads the travelers to safety, the gunner thanks his quick thinking for saving them. Skywalker also gives the gunner an Imperial homing beacon so that he can reunite with his Imperial comrades. The gunner asks Skywalker if he is part of the Rebellion. Before leaving, he asks Skywalker if he is really Skywalker but the Jedi walks away into the desert. The gunner comes to believe that they are all Luke Skywalker."}, {"tag": "h3", "text": "Breaking free"}, {"tag": "p", "text": "Due to the signal beacon, the Imperial gunner was picked up by the Imperial Army. However, he was interrogated as a deserted and treated as a traitor. He is tortured by an IT-O Interrogation Unit. The gunner realizes that the Empire were the ones who perpetrated torture and horrific mental probes for pressure. His Imperial Navy interrogator refuses to believe his claim that Skywalker was on Jakku."}, {"tag": "p", "text": "The enraged gunner breaks free from his restrains and attacks the IT-O Interrogation Unit, throwing it to the ground and smashing it. He grabs one of the droid's needles and stabs the Imperial interrogator, who denounces him as a rebel. The gunner counters that they are all Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}