{"url": "The_Star_Wars:_From_The_Adventures_of_Luke_Starkiller", "categories": ["Category:Real-world articles", "Category:Canceled content", "Category:Real-world books", "Category:Script drafts"], "nodes": [{"tag": "h1", "text": "The Star Wars: From The Adventures of Luke Starkiller"}, {"tag": "p", "text": "The Star Wars: From The Adventures of Luke Starkiller was the third draft of the script to the film that would become Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Above the planet of Utapau, stormtroopers led by Darth Vader (a Sith Lord and right hand of the Emperor) overtake a rebel spaceship, and conduct a search for the stolen plans to the Empire's \"Death Star\" battle station. A young rebel princess called Leia Organa is captured by the Imperials, but she refuses to reveal the whereabouts of the information. A young farm boy named Luke Starkiller has seen the space battle from Utapau's wasteland with his \"electrobinoculars\", but when he tells his friends at Anchorhead about it, they dismiss it as a fantasy. Luke is deeply impressed by (and jealous of) his best friend Biggs Darklighter who has graduated from the academy, becoming a startrooper cadet. Before the princess was captured, two robots named See Threepio (a tall \"Human Cyborg relations droid\") and Artoo Detoo (a short, beeping triped) abandoned the rebel ship, crashing in the Utapau desert. Artoo carries the Death Star plans and a message from Leia in his innards as the two \"droids\" are captured by \"Jawa\" scavengers and taken to the Lars homestead where Luke lives with his Aunt Beru and Uncle Owen. The Jawas peddle the robots to Owen, and Luke decides to apply to the academy now that they have two extra droids on the farm. When it turns out that his academy savings were spent on the robots, Luke wishes his late Jedi father were there. Cleaning Artoo, he stumbles upon the hologram message, in which Leia wants the droids delivered to Organa Major and says that she has been taken to Alderaan."}, {"tag": "p", "text": "Luke runs away from home with the droids in order to get help from General Ben Kenobi, a Jedi Knight his father had told him about. After being attacked by barbaric \"Tusken Raiders\", Luke is found by old Ben who claims he has become too old for adventures, proving his point by angrily cracking open his artificial arm. After some thought, Ben changes his mind, but since he has little Force left in him, he starts teaching Luke about the Force of Others as they leave with the droids for Mos Eisley spaceport. On Alderaan, Vader and his fellow Sith Lords feel something old awakening, strengthening the Force. After using his \"laser-sword\" to defend Luke against some creatures at a Mos Eisley cantina, Ben and his friends follow a furry \"Wookiee\" called Chewbacca to a nearby docking bay where they are introduced to a cocky starpilot named Han Solo who agrees to take them to Organa Major for a considerable amount of money. Han tricks some evil pirates—including Jabba the Hutt, the financier of his ship—into leaving the docking area, and as the heroes leave Mos Eisley, a furious Jabba is left behind. Aboard the ship, Ben feels that something horrible has happened, and when they reach Organa Major they find the planet destroyed by the Empire. Now they must rescue the princess from the Imperial city of Alderaan in order to find the rebels."}, {"tag": "p", "text": "At Alderaan, their ship is boarded by stormtroopers, but only Threepio is found since the others are hiding in scan-proof lockers. Luke and Han steal stormtrooper uniforms, and with Chewbacca posing as their prisoner, they leave for the detention area, where they wreak havoc and find the tortured Leia. The groggy princess takes command of the situation, and after getting past a \"Dia Nogu\" monster, they jump down a chute leading to a garbage masher from where they are saved by the droids. Using the Force and his laser-sword, Ben has managed to retrieve one of the Kiber Crystals, but he meets Vader on his way back, and a duel commences. As the others make it to the hangar, Ben slams down a blast door between Vader and himself, and everybody manage to escape in Han's ship. Four pursuing \"tie\" fighters are shot down, and the ship reaches the Masassi outpost on the fourth moon of Yavin, where the rebels plan an assault on the approaching Death Star (the plans inside Artoo give a \"thermal exhaust port\" as the station's weak point). Han leaves after receiving his money, while Luke claims a place in the battle as his reward. The attack has gone poorly for the rebels, when Luke approaches the target with the Kiber Crystal in his hand. Vader feels the Force in Luke and starts chasing him in his fighter, when suddenly, Han's ship turns up firing, causing the Sith Lord to collide with his wing man."}, {"tag": "p", "text": "As Vader's ship spins out of control, Luke fires a torpedo into the exhaust port and the Death Star explodes. At a ceremony back at the outpost, Luke, Artoo, Threepio, Han and Chewbacca are awarded gold medallions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}