{"url": "The_Star_Wars_Album", "categories": ["Category:Real-world articles", "Category:Legends reference books", "Category:Real-world reference books"], "nodes": [{"tag": "h1", "text": "The Star Wars Album"}, {"tag": "p", "text": "The Star Wars Album is a Legends reference book that focuses on the 1977 film Star Wars: Episode IV A New Hope, covering the film's conception, production, release, future, and lore. The book was first published in November 1977 by Ballantine Books."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The exclusive, behind-the-scenes story of the making of Star Wars — the most extraordinary film in motion picture history, including over a hundred exclusive photos, plus special effects secrets, interviews with George Lucas, Carrie Fisher, and Mark Hamill, the Anatomy of an Android, and a Star Wars Technical Glossary."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Star Wars Album was first published by Ballantine Books in November 1977, following the May 25 release of Star Wars: Episode IV A New Hope. A second printing of the book was published in April 1978."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The segment of The Star Wars Album called \"Star Wars Sequels\" announced that The Star Wars Holiday Special—only mentioned as a \"full-length feature film\"—was scheduled for a fall 1978 release with George Lucas attached as executive producer. The book also ponders if the sequel would have Luke Skywalker duel Han Solo for Princess Leia Organa's hand in marriage."}, {"tag": "p", "text": "Throughout The Star Wars Album, there are spelling discrepancies such as \"C3P0,\" \"Dia-noga,\" and \"X-fighter.\" The book also mislabels the 9000 Z001 landspeeder as a droid."}, {"tag": "p", "text": "The end of the book features a \"Star Wars Glossary,\" which includes a number of details that have since been retconned, including:"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}