{"url": "Battle_of_Onderon", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles of the Clone Wars", "Category:Battles of Onderon"], "nodes": [{"tag": "h1", "text": "Battle of Onderon"}, {"tag": "p", "text": "The Battle of Onderon took place for control of the planet Onderon in 20 BBY, the final year of the Clone Wars. Having instigated Onderon's secession from the Galactic Republic at the war's outset, King Sanjay Rash found his regime, which was being backed by the Confederacy of Independent Systems, challenged by a grass-roots group of rebels organized by the young insurgent Saw Gerrera, who hoped to restore the deposed King Ramsis Dendup to the throne. Seeing an opportunity to engage the Confederacy on another front, the Republic funded the rebels with credits and arms to combat Rash's occupational forces from the Separatist Droid Army, while the Jedi High Council sent a team of advisors to train the rebels. Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, Commander Ahsoka Tano, and Clone Captain Rex of the 501st Legion were covertly inserted onto Onderon and oversaw training sessions at the insurgency's jungle camp, though the training escalated into actual combat when a battle droid squad attempted to exterminate the rebels."}, {"tag": "p", "text": "The newly trained rebels eliminated the enemy droid squad and infiltrated the Separatist-occupied capital Iziz, conducting strikes on droid patrols throughout the city. Kenobi, Skywalker, and Captain Rex thereafter withdrew from Onderon, while Tano stayed as an advisor, working primarily with the rebels' core group: Saw, his sister Steela, and Lux Bonteri, the former senator of Onderon in the Separatist Parliament. As King Rash publicly portrayed them as terrorists, the rebels decided to make a show of strength, targeting Iziz's main power generator to extinguish the battle droids' recharging source while also proving they were capable of challenging the Separatists. Their attack went as planned, with public support rallying to them in opposition to Rash's sponsored occupation of Iziz. Steela was elected to replace Saw as the rebels' leader and oversaw continued offensives against the battle droid forces. Confederate Head of State Count Dooku subsequently sent Rash reinforcements under the command of the super tactical droid General Kalani."}, {"tag": "p", "text": "General Tandin and his royal guards sided with the rebels during Rash's attempted execution of ex-King Dendup, helping Steela and her insurgents rescue Dendup and pledging the Royal Onderon Militia to their forces. With Steela appointed by Dendup as their commanding general, the joint rebel and royal soldiers pulled out from Iziz, hoping to preserve civilian lives by isolating armed conflict to the eastern highlands. As full-scale fighting began, Kalani dispatched HMP droid gunships alongside battle droid battalions to strike a decisive blow against the rebel forces. The rebels used the mountain terrain against the Separatists and, despite heavy casualties, retaliated with a supply of rocket launchers—illegally provided by the Republic via the pirate Hondo Ohnaka—that could penetrate the droid gunships' ray shielding. Although Steela was lost in the battle, the rebels won out over the Confederate forces, which withdrew from Onderon once Kalani executed Rash on Dooku's orders. Dendup was thus re-installed as ruler of the liberated Onderon."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Rebellion on Onderon"}, {"tag": "p", "text": "Unhappy with King Sanjay Rash's rule and the occupation of Onderon by the Separatists' droid army, a group of rebels, including the former Onderonian senator Lux Bonteri, hid themselves in the jungles outside the Onderon capital. Lacking any hardware and supplies to directly fight the Separatist Droid Army head on, the rebels made contact with the Jedi Council petitioning for assistance. Most of the Council viewed the struggle as an internal affair, even mentioning that Onderon had officially sided with the Confederacy. Sending a Republic fleet would cause the Separatists to know that they sided with the rebels and retaliate. However Anakin Skywalker argued that the rebels just need guidance, with Mace Windu agreeing that the least the Jedi can do is to teach the rebels to defend themselves."}, {"tag": "h3", "text": "Jedi assistance"}, {"tag": "p", "text": "The Jedi Council sent an advisory team consisting of Anakin, Ahsoka Tano, Obi-Wan Kenobi and Captain Rex to the surface of Onderon. Meeting up with Steela Gerrera, she led them to the insurgents' hideout. The Jedi immediately began training the rebels in guerrilla warfare, although Obi-Wan made it clear that they cannot fight this war for the rebels. Rex trained the insurgents how to disable a tank, droidekas and droids efficiently."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Defense of the insurgent camp"}, {"tag": "p", "text": "The Jedi's insertion did not go unnoticed to the occupying Separatists, so the sent a group of recon droids to probe jungle sector S11. After one recon droid discovered the rebel's base, the Separatists sent a battalion of droids and a tank towards their hideout. The droid battalion caught the rebels in the middle of their training, and the battle began. Anakin, Obi-Wan, Rex and Ahsoka can do no more than protect the insurgents, however the rebels' ingenuity and training resulted in them defeating the two waves. Lux and Saw, having earlier did not work as a team to disable a tank, successfully disarmed the tank with Ahsoka's support. All the droids were defeated, providing a much needed morale boost for the minor victory. However Obi-Wan pointed out that the Separatists now knew of their position. The defense did prove though that the rebels were ready to engage the droids at Iziz."}, {"tag": "h3", "text": "Rebel strikes in Iziz"}, {"tag": "p", "text": "The rebels along with the advisors took advantage of the droids' dim intelligence and disguised themselves as traveling merchants to infiltrate Iziz. Once inside, Saw went off to gather any allies in the city while the rebels prepared a hideout. After establishing themselves in the city, the rebels begun targeting individual droid patrols and checkpoints, using EMP grenades and accurate sniper fire to help prevent civilian casualties. In a meeting within a safe house, the rebels decided they needed to win the support of the people. Anakin, Obi-wan, and Rex left the planet while Ahsoka remained behind to supervise the insurgents' activities."}, {"tag": "h4", "text": "Attack on the power generator"}, {"tag": "p", "text": "Despite their efforts, the rebels saw that their small attacks did nothing to change the civilians' opinion of them. Ahsoka and Lux believe that the civilians do not think that the rebels can win and therefore needed a bigger target. The rebels eventually decided on the city's main power generator, which was vital for the droids in the city to receive their electricity supply. Since nothing in their current arsenal could destroy a large generator, the rebels needed to hijack a tank."}, {"tag": "p", "text": "To draw out what they needed, a group led by Steela, Lux and Saw, accompanied by Ahsoka, ambushed a droid patrol. They left one droid alive long enough for it to call for reinforcements before destroying him. They were first however confronted by two droidekas, which gave the rebels trouble until Saw and Steela knocked them out by slowly rolling EMP grenades through their shields. After that, a tank finally showed up, accompanied by a group of super battle droids. Steela knocked out the droids with devastating sniper fire, while Saw and Lux knocked out the tank with an EMP. After restarting the tank, Steela left the tank to provide sniper cover while Saw and Lux continued with the tank. At the generator, Steela destroyed a majority of the droids guarding the entrance, and Saw destroyed the rest by running them over and the two gates at the entrance. While waiting for the main gun to recharge, a squad of commando droids attacked, inflicting no casualties. With all of the droids guarding the generator destroyed, Saw fired the main gun and destroyed the generator, plunging the city into darkness. The blackout caught the droid patrols off guard, allowing the rebels to easily massacre the droids in the city."}, {"tag": "p", "text": "Seeing that the rebels had succeeded, some civilians were given hope that they could win. The insurgents themselves were vitalized by the result and briefly celebrated their victory. Because of Steela's leadership skills during the attack, one of the female rebels elected her to be their leader. The group was unanimous with the decision, even Saw who congratulated his younger sister but was still visibly upset by it."}, {"tag": "h4", "text": "Separatist retaliation"}, {"tag": "p", "text": "King Rash saw that the rebels had grown bold with the attack on the power generator, and believed that his predecessor was behind the rebels' activities. Rash's demand for more droids was accepted by Count Dooku, who agreed to send Rash better battle droid reinforcements under the command of General Kalani, a super tactical droid. To draw the rebels out, the Separatists had put out the news that the former king, Ramsis Dendup, was to be executed soon. Steela wanted to put together a plan to save the king, but Saw instead decided to save Ramsis himself. He snuck over the palace wall, destroyed a battle droid guard and freed Ramsis, but his plan backfired when he found the palace had a one-way shield. Saw was captured and tortured into giving the rebels location, but refused to break."}, {"tag": "p", "text": "At the execution the next day, Steela, Lux and the rebels attacked in an attempt to free Saw and Ramsis, but were forced to surrender when a group of super battle droids and droidekas showed up and surrounded them. Before Ramsis was even executed, General Tandin, having been persuaded by Saw earlier, decided to defect from Rash's regime to the rebels' cause. He, along with the Onderon Guards of the Royal Onderon Militia, freed the rebels from facing execution. Tandin then took King Rash hostage, allowing the rebels and the royal guard to escape. Ahsoka then intervened and knocked over the droids with a Force Push and escaped with Tandin into the crowd. The droids tried to pursue, but were stopped by the angry crowd."}, {"tag": "h3", "text": "The rebels' final stand"}, {"tag": "p", "text": "The rebels escaped the city with Ramsis and the rebels in tow and took cover in the eastern highlands. Ramsis had Ahsoka and Lux deliver a holographic communicator to the city and he gave a speech to the citizens and told them that the rebels were patriots seeking to liberate them all."}, {"tag": "p", "text": "Desperate to rid himself of the rebels and regain power, Rash had Kalani readied a force of droids, tanks, and new HMP droid gunships to eliminate the rebels once and for all. Meanwhile, Steela, Saw, Lux, Ahsoka, and the other rebel leaders tried to figure out a plan to decisively defeat the Separatists. Saw wanted to lay siege to Iziz, but Steela was concerned this would endanger the civilians and destroy their reputation as liberators. She wanted to lure the droids into the highlands, where they would have the advantage of high ground and additional cover than on the flatlands surrounding Iziz."}, {"tag": "p", "text": "Once the droid forces reached the highlands, the rebel soldiers and the royal guard were waiting in ambush. At first, they managed to inflict heavy casualties on the droids, but when the gunships attacked, with their heavy armament and ray shields, they made it difficult for the rebels and they fell back to their camp. Anakin meanwhile, traveled to Florrum and managed to convince Hondo Ohnaka to deliver a shipment of rocket launchers to the rebels. These weapons allowed the rebels to take out the gunships. One gunship however crashed into area where Steela and Ramsis were standing and Steela was left clinging for life over a sheer cliff. Lux attempted to save her but nearly fell himself. He was saved by Ahsoka using the Force and tried to do the same for Steela. However, the gunship wasn't fully knocked out and shot Ahsoka in the left shoulder. Lux disabled the gunship with a laser blast to the gun. The wound to Ahsoka caused her to drop Steela to her death and they stood reeling in shock and horror. Even with the death of rebels' leader, the remaining droids were defeated, turning the tide of the battle against the Separatists on Onderon."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the rebels' victory in the highlands, Count Dooku ordered General Kalani to withdraw the remnants of the Separatist forces to Agamar, not long after Kalani shot King Rash to death. After the Separatists retreated from Onderon, a funeral was held for Steela Gerrera with thousands of Onderonians grieving the loss of the leader of the rebels. As the memorial was being held, Lux revealed to Ahsoka that the re-installed king of Onderon, Ramsis Dendup, has appointed him the new senator of Onderon, which, he states, will allow him to lead his people back to the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}