{"url": "The_Star_Wars:_Story_Synopsis", "categories": ["Category:Real-world articles", "Category:Canceled content", "Category:Articles with an excess of redlinks", "Category:Real-world books", "Category:Script drafts"], "nodes": [{"tag": "h1", "text": "The Star Wars: Story Synopsis"}, {"tag": "p", "text": "The Star Wars: Story Synopsis, also referred to as the first treatment of Star Wars, was the first step in the creation of the script for Episode IV. George Lucas wrote it in the spring of 1973 and gave it to United Artists for perusal on May 7, 1973. It was rejected on May 29, 1973, because of the projected budget of $3 million. It was then sent to Universal, which failed to make a decision in the ten days allotted. On July 13, the picture was offered to Twentieth Century Fox. They accepted, and moved forward (with an option to withdraw at any time) with Lucas to write a screenplay. One year after the completion of the treatment, in May 1974, The Star Wars: Rough Draft was finished."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Over the planet Aquilae, a group of starfighters flew toward a distant speck. The speck gradually resolved into an immense space fortress, which the fighters attacked."}, {"tag": "p", "text": "It was the 33rd century. Civil war had struck the galaxy, which was ruled by an Empire. A princess, fleeing the Empire, was traveling with her protector, General Luke Skywalker."}, {"tag": "p", "text": "Two bureaucrats posted to the space fortress prematurely evacuated to the surface of Aquilae, and discovered a store of aura spice, a precious substance. The spice, however, belonged to the princess and her General, disguised as farmers, and the two functionaries were taken hostage."}, {"tag": "p", "text": "They headed for Gordon, a starport. En route they encountered and destroyed an Imperial patrol and visited a temple. There a group of Rebel boys hoped to join them, but were refused. However, when dangerous creatures attacked the princess's camp that night, they arrived and proved their mettle. Skywalker then allowed them to come with them."}, {"tag": "p", "text": "They finally arrived at Gordon, and a fight broke out at a cantina. Skywalker used his lazersword to defend one of the boys. They made contact with the resistance, and were directed to a freighter to get off planet. However, an Imperial spy eavesdropped and the freighter became a trap."}, {"tag": "p", "text": "Eluding the ambush, they stole a fighter and shot their way out of Gordon. In orbit, they blended into the Imperial fleet, but as they headed toward Ophuchi, they were stopped and ordered to heave to for boarding. A firefight ensued, and they fled into an asteroid field. Eventually, the ship was hidden in an asteroid, and the Empire broke off their search. Nonetheless, the fighter was seriously damaged, and broke apart above Yavin."}, {"tag": "p", "text": "They encountered a tribe of aliens. The party was broken up, as Skywalker was attacked, and fell into a chasm; the princess and the bureaucrats ended up being captured by the aliens and sold to the Empire."}, {"tag": "p", "text": "Skywalker, however, had survived, and gained the trust of some of the aliens. He and the boy rebels attacked the Imperial outpost on the planet after being directed to it by an old farmer, but the princess had already been sent to the Imperial capital of Alderaan. A squadron of Devil fighters were present. The General trained the boys to fly them and they went to Alderaan, masquerading as Imperial rangers."}, {"tag": "p", "text": "The Rebels infiltrated the prison and freed the princess (the bureaucrats were along for the ride). They fought their way offworld and made it to Ophuchi, where the princess and her uncle, the planetary ruler, rewarded everyone. The bureaucrats realized then that their companions were \"demigods.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The plot and scenes of much of the synopsis are directly derived from Akira Kurosawa's The Hidden Fortress, more specifically being copied directly from the synopsis of the film in Donald Richie's 1965 book The Films of Akira Kurosawa, only realized as space opera. As such, the projected film would have been more like The Magnificent Seven in its relationship to The Seven Samurai than a fully original work. As Lucas began work on the actual scripts, however, the story began to diverge into a distinctive plot and universe."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The synopsis is the only source to hint that the Star Wars story had been set not only in the future (explicitly taking place in the thirty-third century) but within the Milky Way galaxy. In later story treatments of what would become the Star Wars franchise, the setting would be in a galaxy far, far away from the Milky Way, taking place a long time ago. The change was largely because, at the time the story treatment was being written, the Vietnam War was ongoing, meaning George Lucas could not directly do a story promoting the Vietcong's exploits and denouncing American involvement in the war akin to the film Apocalypse Now (which he had briefly worked on) due to the controversy that would have ensued."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}