{"url": "The_Star_Wars_Show", "categories": ["Category:Real-world articles", "Category:YouTube series"], "nodes": [{"tag": "h1", "text": "The Star Wars Show"}, {"tag": "p", "text": "The Star Wars Show is an Emmy Award–winning series of behind-the-scenes YouTube videos produced by StarWars.com that give official news regarding upcoming Star Wars media and events."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Star Wars Show first teased on May 10, 2016 and premiered on May 11, 2016., with an episode airing every Wednesday (unless interrupted by a hiatus) at 12 p.m. Pacific Time. The show is hosted by Andi Gutierrez and Anthony Carboni, who replaced former co-host Peter Townley in January 2017."}, {"tag": "p", "text": "On August 4, 2016, the first episode of The Star Wars After Show, a weekly series where members of Lucasfilm discuss weekly Star Wars happenings with the hosts of The Star Wars Show, aired on the Verizon YouTube channel."}, {"tag": "p", "text": "Beginning January 2020 the show moved from weekly to monthly episodes, with a new episode airing every last Wednesday of the month. The new show named This Week! in Star Wars focuses on the weekly news that were previously reported by the Star Wars Show."}, {"tag": "p", "text": "On December 16, 2020, show hosts Gutierrez and Carboni announced that The Star Wars Show would be taking a hiatus for an unspecified period but would still be appearing in the occasional videos. This episode hosted behind the scenes footage from Star Wars: Episode V The Empire Strikes Back, an interview with Dave Filoni, as well as clips from previous The Star Wars Show episodes."}, {"tag": "h2", "text": "Episodes"}, {"tag": "h3", "text": "Season One"}, {"tag": "h3", "text": "Season Two"}, {"tag": "h3", "text": "Miscellaneous"}, {"tag": "p", "text": "These episodes have not been placed in any season."}, {"tag": "h2", "text": "The Star Wars Show Extra"}, {"tag": "p", "text": "A miniseries called The Star Wars Show Extra first aired on May 30, 2018 with  Solo: A Star Wars Story Cast Pronounces Star Wars Words and Names! | The Star Wars Show Extra on the official Star Wars YouTube channel (backup link)"}, {"tag": "h2", "text": "The Star Wars Show Book Club"}, {"tag": "h2", "text": "Reception and accolades"}, {"tag": "p", "text": "In 2019, The Star Wars Show won a Daytime Emmy Award for an Arrested Development sketch with Ron Howard."}, {"tag": "p", "text": "In May 2021, The Star Wars Show won the Silver non-broadcast general award for entertainment, the Silver branded content general award for entertainment, the bronze non-broadcast general live events award for its coverage of The Star Wars Show Live! Celebration Chicago 2019, the bronze branded content general live experiences award for its coverage of The Star Wars Show Live! Celebration Chicago 2019, and the bronze branded content craft for the Star Wars: The Animals Strike Back."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}