{"url": "The_Star_Wars:_Rough_Draft", "categories": ["Category:Real-world articles", "Category:Canceled content", "Category:Articles with an excess of redlinks", "Category:Real-world books", "Category:Script drafts"], "nodes": [{"tag": "h1", "text": "The Star Wars: Rough Draft"}, {"tag": "p", "text": "The Star Wars: Rough Draft was written as a full rough draft by George Lucas in May 1974. The script was begun in the winter of 1973 as an expansion of the original The Star Wars: Story Synopsis. After being somewhat revised into The Star Wars: First Draft, it was considerably rewritten into the Adventures of the Starkiller, Episode I: The Star Wars (the second draft) over the summer and winter of 1974."}, {"tag": "p", "text": "From 2013 to 2014, Dark Horse Comics adapted the script as The Star Wars."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Jedi Kane Starkiller and his two sons, Deak and Annikin Starkiller, live on the Fourth Moon of Utapau. Their seclusion from the forces of the Galactic Empire is interrupted by the arrival of a Sith flying a Banta Four starfighter. The Jedi and his sons go to investigate, but the Sith gets a jump on them, killing Deak with a single blow. Their foe is no match, however, for a Jedi Master, and Kane avenges his apprentice. It is clear that the exiles must flee the Kessil system and they leave for their homeworld of Aquilae. Aquilae, a planet not yet controlled by the Empire, is ruled by the wise King Kayos and Queen Breha. Unfortunately, even as the Jedi arrive in system, the Galactic Emperor, Cos Dashit, plots with his advisors to annex it, one of the last of the Independent Systems. Spies on Alderaan, the gas giant capital of the Empire, leave to bring news of this to Aquilae's leadership."}, {"tag": "p", "text": "Meanwhile, Kane and Annikin arrive at Aquilae and contact the royal government at their Underground Fortress. Kane reunites with a fellow Jedi, Luke Skywalker, now a General in the Aquilaean military. Kane reveals to his friend the extent of his cybernetic replacements—only his head and arm remain flesh. Because of this, he believes that he cannot adequately train his remaining son, and asks Skywalker to train him as a padawaan learner. Not long after princess Leia, Kayos's daughter, leaves for Yuell to study at the Chatos Academy, a huge space fortress enters the Aquilaean system. The king leaves for Amsel to meet with his Senate and determine whether to go to war with the Empire. Kane goes to Gordon, a seedy starport, to meet with his friend Han Solo, a Ureallian. When the wounded Clieg Whitsun, one of the spies from Alderaan, arrives to warn the Aquilaeans of the Empire's plans of conquest, a decision is quickly made to resist. Annikin is sent to the Academy to secure the princess. The fortress is assaulted and damaged, and two droids aboard, C-3PO and R2-D2, prematurely evacuate, landing their lifepod in the Jundland Wastes."}, {"tag": "p", "text": "It transpires that the real reason for the invasion is the Aquilaean facility with genetics and biology, including cloning. Hoedaack tells Darth Vader that it is crucial to capture one of the royal family in order to control the planet, since its people have been ruled by them for 10,000 years. Without a puppet ruler, he explains, the Empire would get no cooperation stealing the biotic secrets of Aquilae. Simultaneously, King Kayos is killed by an Imperial ambush, and the Senate of Aquilae sues for peace. The two droids encounter Annikin and Leia returning from the Academy in the desert. They regroup at a hidden entrance to the royal fortress, and the Queen decides to send for help from the Ophuchi system. Luke, Annikin, and the royal children, including Leia's younger brothers Biggs and Windy, disguise themselves and leave for Gordon. At Gordon, the heroes are embroiled in a fracas in a cantina. Outside the cantina, they encounter Han Solo, and in the slums, Kane. It is decided to that to leave Aquilae they will have to escape on a Baltarian freighter, but a power source is needed for the microcases that will hold the young princes in hibernation to avoid detection. Kane sacrifices one from his own mechanical chest, giving up his life."}, {"tag": "p", "text": "The freighter, however, is a trap. The captain is none other than Valorum, one of the Sith Knights. The heroes are subdued and taken prisoner, and they are thrown into a cell. This proves as only a minor setback, as they succeed in overpowering their guards, leaving the ship and taking an Imperial starship. They take off, but are pursued by Imperial craft. The ship eludes the enemy by entering an asteroid field, and passing through into one of the Forbidden Systems. Unfortunately, their ship is critically damaged. Everyone climbs into life pods and they eject the wreck. The pods fall into the jungle planet of Yavin, home of the Wookees. Artwo and Annikin set out from their pod, looking for the others. They find a group of Yourellian trappers trying to capture Wookees. The trappers are routed, and one of the Wookees, Chewbacca, carries Annikin, who has been wounded in the fight, to his tribe's settlement. Artwo follows. As this is going on, everyone but Leia has gathered at the home of two anthropologists named Owen and Beru Lars. Meanwhile, after fighting Jommillia, Annikin is accepted by the tribe. Han and Skywalker take jetsticks and locate Annikin, Artwo and the Wookees. Because Han is able to speak the Wookee language, the heroes learn that Leia is imprisoned at the Mavassi outpost, an Imperial camp. Han, Skywalker, Annikin and the Wookees attack the Imperial base, but find that Leia has already been sent to Aquilae. A group of Imperial troops find Biggs and Windy, but are defeated."}, {"tag": "p", "text": "Annikin and Artwo fly an Imperial ship to the fortress, and Artwo accesses the computer. They find the location of the princess's cell. Annikin disables a stormtrooper and takes his armor. He is trapped by Imperial troops, and gassed into unconsciousness, and Vader ordered Valorum to execute him. Simultaneously, Skywalker commands a group of fighters piloted by Wookees, and the nine vessels head toward the fortress. Valorum has a last-minute change of heart. He cannot kill his prisoner, and releases him. Together they find the princess and let her out of her cell. The power fails as a barrage of hits from the Wookees damages the space station. The heroes, including Valorum, boarded life pods and escape as it explodes. The new Queen of Aquilae, Leia, rewards the heroes in the Palace of Lite. The droids are upgraded to class A-4, and Annikin is appointed Lord Protector of Aquilae."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Star Wars is based on Akira Kurosawa's Hidden Fortress and Lucas's political musings that also underlay his drafts of the screenplay to Apocalypse Now."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Though the jungle planet of Yavin is placed in the Forbidden Systems, the space fortress orbiting Aquilae is visible from it, making it seem that Yavin is in the same star system. The evidence is ambiguous, but it is hard to explain otherwise. Later drafts place Yavin in a distinct system."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Major elements of this script which were deleted in the later drafts found their way into the scripts of Episode I. Early versions of that script, for instance, named what would become Naboo, Utapau, which was merged with Aquilae in the second draft. The rescue and Jedi protection of a young princess, the blockade of an isolated system, the presence of a benevolent monarchy, and the arrival and combat with a Sith Lord on the moon of Utapau, as well as difficulties encountered getting off-world, all are related to scenes from the rough draft."}, {"tag": "p", "text": "The coronation of Leia at the conclusion of the script may have been contemplated for inclusion in the projected sequel trilogy. Gary Kurtz related, in a 1999 interview, that she would be crowned Queen of the surviving Alderaanians in Episode VII."}, {"tag": "p", "text": "Several elements from this draft were featured in Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}