{"url": "Battle_of_Onderon_(Great_Sith_War)", "categories": ["Category:Legends articles", "Category:Battles of Onderon", "Category:Battles of the Mandalorian Crusades during the Great Sith War"], "nodes": [{"tag": "h1", "text": "Battle of Onderon  (Great Sith War)"}, {"tag": "p", "text": "The Battle of Onderon was a last-ditch effort by the Mandalorian Crusaders to secure a victory in the final stages of the Great Sith War on behalf of the Brotherhood of the Sith."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following Ulic Qel-Droma's orders to divert the vast bulk of his Crusaders to the Onderon system, Lord Mandalore the Indomitable's fleet carriers took up holding orbits between the planet and its nearby moon of Dxun."}, {"tag": "p", "text": "Dropping down from behind the moon, the Mandalorian crusaders were first spotted by Queen Galia from her Royal Palace in the center of the walled city of Iziz. Sounding the alarm, King Oron Kira summoned the Beast Riders of Onderon's wilderness to meet the onrushing attack. After sending a message to the Galactic Republic requesting reinforcements, Oron and the other riders brought the fight back to the Mandalorians."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In the skies of above Onderon, the Beast Riders and the Mandalorians on their Basilisk war droids proved to be equally matched. After experiencing taunts from Oron Kira and his men, Mandalore then rallied his troops, fighting with unbridled ferocity. Just as it seemed as though the tide had turned in favor of the Mandalorians, Republic reinforcements in the form of elements of the Republic Swift Fleet commanded by Fleet Captain Vanicus arrived on the battlefront, lending critical firepower to the battle."}, {"tag": "p", "text": "Caught between the Republic forces and the Beast Riders, the Mandalorian forces were devastated, although Vanicus at first attempted crippling the enemy ships, a feat which proved impossible due to their deflector-shielding. The only course of action of victory or death. Calling a retreat to the moon of Dxun, Mandalore the Indomitable believed he could lose the Republic pursuit in its dense jungles. Unfortunately for Mandalore, while retreating, a Republic frigate fired upon his Basilisk war droid, and he crashed in the forests far away from the other Mandalorian troops. Rising from the wreckage, Lord Mandalore was immediately set upon by two large beasts of the moon, and was subsequently devoured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Initiating a full-scale search of the moon's jungles, the remaining Mandalorians scoured the landscape for signs of their leader, but came up empty-handed. However, one shocktrooper in particular happened across the remains of Mandalore the Indomitable's mask. Placing the mask on his own head, he became the next Lord Mandalore, Mandalore the Ultimate, whose legacy would affect the galaxy for decades to come."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}