{"url": "Battle_of_Ohma-D%27un", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Chommell sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Ohma-D'un"}, {"tag": "p", "text": "The Battle of Ohma-D'un or Defense of Naboo was a small-scale battle that took place roughly ten weeks after the Battle of Geonosis."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "When the planet Naboo lost contact with a Gungan colony on one of Naboo's moons, Ohma-D'un, the Republic sent a squad of four Jedi to investigate. This team consisted of Obi-Wan Kenobi, Anakin Skywalker, Master Glaive, and Zule Xiss. To stay unnoticed, the team flew to the moon in a single gunship."}, {"tag": "p", "text": "They quickly found what had become of the Gungan colony. Every single Gungan had died of a mysterious chemical weapon, which was created by the Separatist scientist Jenna Zan Arbor. The Jedi were infected by the poison, but luckily its effects took longer to work on non-Gungans."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "The Jedi soon encountered Ohma-D'un super battle droids, B2 super battle droids and the bounty hunter Durge, and attacked them. The clone troopers were all killed by Durge except for the single Advanced Recon Commando, designated Alpha-17, on the mission. During the Jedi's duel with Durge, he mentioned prisoners (spice miners), and Obi-Wan sent Anakin and the ARC trooper to free them."}, {"tag": "p", "text": "After that, Glaive was caught off guard, and was decapitated by the Separatist commander, Asajj Ventress. She then dueled with Obi-Wan, apparently using the Dark Side to re-animate dead Gungans to aid her. Meanwhile, Anakin and the ARC trooper successfully freed the prisoners, and destroyed the capsules of the gas that they were being loaded onto spice ships destined for Naboo. They then went back to Obi-Wan, and helped him defeat Ventress. However, the duo managed to escape, though Naboo was safe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}