{"url": "The_Trouble_with_Rathtars", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Resistance Rises"], "nodes": [{"tag": "h1", "text": "The Trouble with Rathtars"}, {"tag": "p", "text": "The Trouble with Rathtars was the second episode of the LEGO Star Wars: The Resistance Rises series."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo and Chewbacca are transporting a shipment of rathtars aboard the Eravana. The rathtars have broken out of their cage and Solo tells Chewbacca to put the creatures back. When Chewie protests that the rathtars are illegal goods, Han Solo stresses that they need the money. One of the rathtars gets sucked into the vacuum of space; prompting Han to remark that they had just lost a 100,000 credits. Chewie manages to drive the rathars back into their cage but another one manages to breach the command bridge through the ceiling. Chewie and the rathar wrestle with the controls, causing the ship to jump into hyperspace."}, {"tag": "p", "text": "The Eravana almost collides with lone First Order TIE/fo space superiority fighter Epsilon Nine upon emerging in the Tapani sector. The TIE fighter pilot pursues Han and Chewbacca's ship for entering a restricted area. Han pilots the Eravana and tries to outrun the TIE fighter while Chewbacca wrestles with the rathar. During the pursuit, Chewie and the rathtar find themselves manning the ship's turret cannon and use it destroy the TIE fighter. However, the TIE pilot manages to call for reinforcements and several more TIEs are dispatched from several nearby Resurgent-class Star Destroyers."}, {"tag": "p", "text": "After telling Chewie to buckle down, Han leads the TIE fighters on a pursuit. He manages to land the Eravana on a large asteroid. Two TIE fighter pilots emerge from their starfighters and tell Han to prepare to be boarded. Meanwhile, Chewie manages to calm the rathtars who settle down to sleep. Han manages to banter with the TIE pilots long enough to power up the Eravana's engines. The full blast of the freighter's engines destroys the two TIE fighters, leaving the pilots stranded. Having escaped the Imperials, Han then asks Chewie how he is coping with the rathtars. As soon as Han enters the cage, the rathtars awake and the two are forced to exit the cell."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}