{"url": "The_Truce_at_Bakura", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "The Truce at Bakura"}, {"tag": "p", "text": "The Truce at Bakura is a Star Wars Legends novel written by Kathy Tyers. It was the fourth novel published by Bantam Spectra, following Star Wars: The Thrawn Trilogy, and it was first printed in hardcover on November 1, 1993. The novel is set in 4 ABY, shortly after the events of Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Timothy Zahn's New York Times bestselling Star Wars trilogy reopened the door to George Lucas's dazzling universe, drawing millions of readers into the lives of the beloved movie characters and the struggle of the Rebel Alliance. Now, in The Truce at Bakura, Kathy Tyers takes readers back to the fateful days following the events in Return of the Jedi."}, {"tag": "p", "text": "No sooner has Darth Vader's funeral pyre burned to ashes on Endor than the Alliance intercepts a call for help from a far-flung Imperial outpost. Bakura is on the edge of known space and the first to meet the Ssi-ruuk, cold-blooded reptilian invaders who, once allied with the now dead Emperor, are approaching Imperial space with only one goal: total domination. Princess Leia sees the mission as an opportunity to achieve a diplomatic victory for the Alliance. But it assumes even greater importance when a vision of Obi-Wan Kenobi appears to Luke Skywalker with the message that he must go to Bakura—or risk losing everything the Rebels have fought so desperately to achieve."}, {"tag": "p", "text": "Even as the Alliance arrives, the aliens have almost overcome the Bakura Imperial garrison, whose desperate commander will accept help from any quarter—even Rebel—against an insidious foe that enslaves human minds to pilot their invincible machines of war and destruction."}, {"tag": "p", "text": "While marshalling the tattered Imperial forces, Luke, Han Solo, and Princess Leia must win the trust and cooperation of the Bakurans. For although Imperial Governor Nereus has granted the Rebels temporary amnesty there is the possibility of treachery among those whose first allegiance lies with the Empire."}, {"tag": "p", "text": "On the eve of the final explosive onslaught, Rebel and Imperial forces must finally come to terms with each other…or lose the entire galaxy to the hideous servitude promised by a victorious alien enemy."}, {"tag": "p", "text": "Capturing the sweep and excitement of the original Star Wars saga, The Truce at Bakura plants a seed of hope for peace, sees the formation of a timeless love, and stands witness to a Jedi's undying sacrifice to defend Humanity against an alien nemesis."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts after the Battle of Endor, with the arrival of an Imperial drone to the site of the second Death Star. Wedge Antilles investigates the drone, but is nearly killed trying to prevent the drone from self-destructing. Luke Skywalker, still convalescing from the Emperor's Force lightning, rescues Wedge and the Alliance seizes the drone for investigation."}, {"tag": "p", "text": "The drone contains a distress call for the Emperor from Governor Wilek Nereus of Bakura, which is under attack by the reptilian Ssi-ruuk. With Palpatine dead and the Imperial Navy scattered, the Empire will most likely not aid Bakura. Luke Skywalker, after receiving a vision from the spirit of Obi-Wan Kenobi volunteers to lead an Alliance task force to intercept the alien invasion and save Bakura. Han Solo and Leia Organa also accompany the force in hopes of possibly negotiating with either the aliens or the Imperials at Bakura, although Han also wishes to spend more time with Leia."}, {"tag": "p", "text": "The Rebels arrive at Bakura to find the planet under attack. From the bridge of the Flurry, Luke Skywalker helps repel the attack and an unofficial truce is established with Pter Thanas in orbit. After evading Ssi-ruuk vessels, Han, Leia, and Chewie meet up with Luke on the surface as part of a diplomatic entourage to the Bakuran Senate. Leia addresses the body, while Luke finds himself attracted to a Bakuran senator named Gaeriel Captison. Leia and Luke in return learn of Dev Sibwarra, a brainwashed Force-sensitive Human who aids the Ssi-ruuk, who seek to establish a beachhead in the larger galaxy in order to harvest a supply of beings whose life energies can power their entechment technology. The Ssi-ruuk themselves cannot sense the Force, but they know of it through Sibwarra."}, {"tag": "p", "text": "At a social dinner, Governor Nereus confirms the truce with Leia Organa, the lead Alliance diplomat, marking a historic first truce between the Empire and the Alliance. While Luke discusses tactics with Pter Thanas at the Imperial garrison, Leia struggles to find a way to cope with the revelation given to her on Endor—that Darth Vader, the being responsible for the death of thousands of beings, is actually her father. The problem is exacerbated when Anakin Skywalker's Force ghost appears to her, asking not for absolution, but for forgiveness. At the same time, she also engages in active diplomacy with the Bakurans, learning that Bakura \"joined\" the Empire only three years ago and that Bakura chafes under Imperial rule—as do some of the Imperials, notably ranking officer Commander Pter Thanas—though Imperial governor Wilek Nereus is too crafty to let dissension spread too far. Leia has to be careful not to attract unwanted Imperial attention for sedition and avoid diplomatic incidents such as the shooting of several Bakurans by Rebels in self-defense."}, {"tag": "p", "text": "On a personal level, Skywalker finds himself consistently distracted by one of Bakura's senators, Gaeriel Captison, and by the nascent attraction forming between them, despite her religious objections to the Jedi Order. Luke also encounters the aged and mentally infirm Eppie Belden and heals her mental damage with the Force. Princess Leia and Han Solo also struggle to find some time together and hash out their newly-formed relationship."}, {"tag": "p", "text": "However, the Ssi-Ruuk are not so easily defeated and continue to threaten Bakura. The Jedi Knight Skywalker especially intrigues Ssi-Ruuk because his control of the Force can enable the Ssi-Ruuk to enslave beings from a distance once he is enteched. Obi-Wan Kenobi appears to Luke and underscores the danger of the Ssi-Ruuk if they get into the greater galaxy with this technology."}, {"tag": "p", "text": "In the end, Nereus attempts to turn Skywalker over to the Ssi-ruuk in exchange for their retreat. Secretly, he has infected Luke with deadly parasites that will kill him and the Ssi-ruuk both when they hatch. Though the kidnapping succeeds, Skywalker fights the Ssi-ruuk off enough to save Gaeriel from capture. Luke, though taken prisoner, fights back and is able to free Sibwarra of his brainwashing. The two of them escape and sabotage the Ssi-ruuk flagship, whereupon Luke decides to take him on as an apprentice, but Dev is injured during the escape and later dies of his wounds."}, {"tag": "p", "text": "Meanwhile, Leia, talking with sympathetic Bakuran officials, is arrested by Nereus for sedition and locked away in a remote estate. Han Solo launches a daring, but foolhardy escape attempt while Chewie, joined by Threepio, prepares the Falcon for escape. Han manages to break Leia out of prison and they join the Alliance forces in orbit as the Ssi-ruuk attack. On Bakura, rioting breaks out as resistance forces launch an attack, coordinated by the now recovered Eppie Belden."}, {"tag": "p", "text": "Nereus brings Gaeriel Captison to him in an attempt to have her cede total control of Bakura to him. Nereus also reveals his sinister attack on Skywalker to her. They watch as the joint Rebel-Imperial force turns back the Ssi-ruuk, but, to Gaeriel's horror, Nereus then orders Thanas to attack the Rebels, decimating their forces. Surrounded, Han Solo prepares a suicide ramming move to allow the remaining Rebels to escape. At that point, Luke—who uses the Force to remove the parasites—uses the alien flagship to distract Thanas's fleet, and the Rebels escape. Thanas ultimately ceases fighting and surrenders."}, {"tag": "p", "text": "Back on Bakura, Nereus is overthrown by resistance cells and captured. Han, Leia, Luke and Chewie return to the planet, where Nereus, upon seeing Luke, attempts to attack them but is killed in the process. Bakura decides to join the Rebel Alliance and Commander Thanas defects as well. New Republic Intelligence later referred to the battle as the \"Bakura Incident,\" and believed that it would be best if the New Republic attempted to prevent widespread public knowledge of the Ssi-Ruuk, advice that was taken controversially at best. In addition, Skywalker finally makes his breakthrough with Gaeriel, though he must shortly leave her when the Alliance forces depart at the end of the novel, to continue the ongoing fight against the Empire."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In The Essential Reader's Companion, the events of The Truce at Bakura are dated to 4 ABY, between the events of the novels Hard Merchandise (1999) and Luke Skywalker and the Shadows of Mindor (2008). Material from The Truce at Bakura was further expanded upon in The Truce at Bakura Sourcebook (1996), by West End Games."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}