{"url": "The_Trickery_of_Vosdia_Nooma", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Rodian culture", "Category:Theatrical productions"], "nodes": [{"tag": "h1", "text": "The Trickery of Vosdia Nooma"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma, also referred to as Trickery, was a play commissioned, funded, and partially written by Rodian Senator Onaconda Farr. Ruris Plin and Hishinu Booj were the other authors of the play, with Booj also its director. Trickery starred Chooru Delb as titular character Vosdia Nooma, Deebo Chak as the main antagonist known as the Soldier, and Fosin Dreed in the \"Savior\" role as the Paladin. Beata Reesh and Huruni Hune also had roles in the play, and Farr himself made a holographic cameo in the opening night performance as the town's oracle. It was released in 22 BBY to Rodia's Equator City First Stage as well as those with Core to Mid Rim access tuned to signal RES23."}, {"tag": "p", "text": "Senator Farr initially created the play to explain his stance on the controversial Military Creation Act. Farr, who supported the movement, wished to expose, through Rodian Theater, the consequences of ignoring the offer for protection. As such, symbolism and allegory were extensively employed. Set during the Rodian feudal era in the town of Yusk, Rodia, the play details farmer Vosdia Nooma's ascension to become baron of the town. During this time, Trickery's antagonist appears and incites the farmers to rebellion. This eventually leads to all-out war and Nooma is presented with the opportunity to use the Paladin's own personal army for protection; Nooma refuses, however, and the townsfolk of Yusk suffer for it as the war rages on."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma was a four-act Rodian play produced in 22 BBY. The play was created at the command and expense of Rodian Senator Onaconda Farr for his political campaign, signifying Farr's pro-Military Creation Act stance. As such, the play was rife with symbolism and allegory pointing towards the effects of not backing the movement. Also included, although only fleetingly, were moments of Rodian humor."}, {"tag": "h3", "text": "Setting"}, {"tag": "p", "text": "Trickery was set in the Rodian's feudal era in the town of Yusk. Yusk itself was a major agricultural center on the planet Rodia. Main locations featured in the play included Vosdia Nooma's farm on the outskirts of Yusk and the town center."}, {"tag": "h3", "text": "Synopsis"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma begins its first act showing the community of Yusk. A Rodian individual named Vosdia Nooma, a farmer living on his farm outside of town, has his daughter poisoned by a bug-bite from a thistlenit. This act then draws the sympathy of the townsfolk. These people, ranging from the poor folk to the rich and influential, gather in Nooma's house; the farmer uses this opportunity to begin expressing his political ideals in small talk."}, {"tag": "p", "text": "At the start of act two, Vosdia Nooma becomes baron of the town of Yusk, through his skillful and charming manipulation of those sympathizers gathered under his roof. Once in the position, the new baron moved from his farm into the town center. He also chose a new cabinet; while they did not possess much in the way of governing skills or political ability, they were some of Nooma's closest and oldest friends. Meanwhile, a newcomer arrives to the town. Known only as \"the Soldier\", this man appears on rothback to the outlying farmers' fields, where he learns of the taxation imposed on the farmers. Finding the levels of grain serving as payment for the tax imposed \"appalling,\" the Soldier encourages the respective farmers to keep more for themselves and their families."}, {"tag": "p", "text": "The scene changes to some time after the farmers begin to hold back on their taxes. The people inside Yusk start feeling the pangs of hunger from the food shortages, and begin pleading to Baron Nooma to do something about it. Nooma, however, cannot, as he is unable to make the decision under pressure. He consults his cabinet, who also fail to come to a decision. This devolves into argument and eventually slapstick fighting, including a segment including powder-faced Lady Puffdove and three-eyed Lord Scufflemug. Nooma, towards the end of the second act, leaves the arguing members of his cabinet to take a stroll under the night sky. Once outside, he meets another character, known as \"the Paladin,\" riding on rothback."}, {"tag": "p", "text": "Trusting the man, Yusk's baron reveals the troubles occurring under his leadership. The Paladin recognizes this drama as being related to the works of the Soldier, once the Paladin's fellow infantryman. Knowing the Soldier's schemes, the Paladin offers his own personal army to help deal with the \"defectors\"; Nooma, unwilling to cope with the commitment, refuses and returns to his people. Acts three and four punctuate Baron Nooma's unwillingness to act with a violent war breaking out between the farmers, stirred to action by the Soldier, and the townsfolk. The Soldier's true intentions are shown as he eats the stockpiled grains while the people fight. Meanwhile, Vosdia Nooma searches for the Paladin, hoping to take him up on the offer for the army; he is unsuccessful, finding only a puddle of blood. He takes this chance to lament poisoning his daughter—contradicting what was shown in the opening act, that the poisoning was the result of an accidental thistlenit bite, and revealing the true trickery of Vosdia Nooma."}, {"tag": "h3", "text": "Characters"}, {"tag": "h4", "text": "Vosdia Nooma"}, {"tag": "p", "text": "Vosdia Nooma, the story's titular main character, begins as a farmer living among the agricultural center of Yusk. Eventually, through a series of events partially orchestrated through Nooma and partially fate, the former farmer becomes the baron of the town. Once in place, he selects a cabinet comprising those dearest to himself, without regard for their abilities or talents. This comes back later in the story as a hindrance as no one the baron selected can agree or decide on a solution to a crisis. This forces Nooma to leave their bickering, after which he finds the Paladin who offers advice and assistance on the problem; Baron Nooma rejects his offer, leading to the climax of the conflict in war between the farmers and the townspeople."}, {"tag": "h4", "text": "The Soldier"}, {"tag": "p", "text": "The Soldier is the story's main antagonist. Appearing after Vosdia Nooma's rule as baron starts, the Soldier approaches the farmers of the community and attempts to create conflict between them and those living in the city proper. This succeeds, and the Soldier watches as each portion of taxes is stockpiled rather than given as tribute. Eventually, the Soldier, seeing the infighting this withholding has caused among the townsfolk, takes the opportunity and incites the people to raid the town. This results in all-out war between the two parties; the Soldier sits back and reaps the rewards of his actions by engorging himself on the stockpiled food."}, {"tag": "h4", "text": "The Paladin"}, {"tag": "p", "text": "The Paladin, the \"savior\" of the play, enters the story towards the end of the second act. Here, he offers the struggling Vosdia Nooma a way to protect himself against the Paladin's former partner, the Soldier, in the form of a personal army. Knowledgeable of the Soldier's tactics, his offering is meant as protection against the coming war; Nooma refuses, however, afraid of committing, and the Paladin then leaves. When Nooma looks for the Paladin later during the war, he finds only a pool of blood."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "With the growing tensions caused by the Separatist Crisis, several senators and other galactic leaders felt that a dedicated army—separate from the Jedi Order, the protection at the time—was in the Galactic Republic's best interests. To achieve this, the Military Creation Act was proposed to Supreme Chancellor Palpatine. Senator Onaconda Farr was among those supporting the measure. To campaign towards that end, Farr commissioned a play, resulting in the work The Trickery of Vosdia Nooma. This work, containing large amounts of symbolism and allegory as well as bits of Rodian humor, graphically portrayed the results of not backing the Military Creation Act: large-scale death and destruction caused by the dissidents."}, {"tag": "h3", "text": "Production"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma was produced in 22 BBY for the pro-Military Creation Act ideals of Senator Onaconda Farr. Using technologies such as holoprojectors, the result was an incredibly graphic and realistic experience for the audience. Likewise, the symbolism contained within was blatant and clearly revealed Farr's pro-military stance. The play itself contained four acts and lasted a total of four hours."}, {"tag": "h4", "text": "Casting and credits"}, {"tag": "p", "text": "The cast, described as well-fitting by one reviewer, comprised several key individuals as well as extras in different scenes. Playing the title character Vosdia Nooma was Chooru Delb, whose acting in Trickery was enough to keep Delb remembered in popular theater for his ability to rise above the Rodian-influenced humor and symbolism to reach any audience. Starring as the antagonist of the story was Deebo Chak; new to the world of acting, one reviewer characterized Chak's gravelly-voiced Soldier as enough to make the four-hour production worth the time. Likewise, the Paladin's performance by Fosin Dreed also made the length of the play bearable. Beata Reesh and Huruni Hune too performed in the play. A cameo by Senator Farr accompanied the regular actors; he appeared holographically as Yusk's oracle."}, {"tag": "p", "text": "Ruris Plin, Hishinu Booj, and Onaconda Farr wrote the play. Booj directed the play, and Farr was responsible for commissioning and funding Trickery. Further credits to Onaconda Farr included Executive Producer and story."}, {"tag": "h3", "text": "Release and reception"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma opened in 22 BBY on 4:18. It played at Equator City on the planet Rodia. It also broadcast on signal RES23 for those who could access Core to Mid Rim shows."}, {"tag": "p", "text": "Drama editor Korvit Domesa wrote a review for the Life section of the HoloNet News in volume 531, number 52 of the publication. In it, Domesa reviewed the play piece-by-piece, and provided a detailed synopsis. Also in the review, Domesa mentioned several pitfalls in the work, including \"characteristically stilted\" dialogue and the transparency of the symbolism, as well as the intense graphic violence, typical to Rodian drama, presented in the third and fourth acts. To the latter point, however, the drama editor mentioned the means of conveying this violence through incredibly realistic means by the use of holoprojection were quite impressive; each decapitation and maiming was shown with great clarity. Another key point Korvit Domesa noted in the later portion of the play's acts was the side-story metaphors which were \"confusing\" and \"didn't go anywhere.\" Even with these criticisms, Domesa gave the work a 7.5 out of 10, citing its engaging ideas, its ability to spark discussion, and the acting talent of its stars."}, {"tag": "p", "text": "In about 1.5 ABY, the Theed Palace librarian, an individual who worked in the Theed Royal Palace on the planet Naboo, asked a spacer a number of multiple choice questions. For one of the questions, the librarian asked the spacer which drama the playwright Thalos Lorin was best known for, and included The Trickery of Vosdia Nooma as a possible, although incorrect, answer to the question."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trickery of Vosdia Nooma was mentioned by Pablo Hidalgo and Paul Ens in a mock-review for the play in the web-based HoloNet News created to provide backstory for the 2002 prequel film Star Wars: Episode II Attack of the Clones. In the review, several key moments in the play are discussed in length, helping set the scene for the review."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}