{"url": "The_Tragedy_of_Darth_Plagueis_the_Wise", "categories": ["Category:Legends articles", "Category:Literature"], "nodes": [{"tag": "h1", "text": "The Tragedy of Darth Plagueis the Wise"}, {"tag": "p", "text": "The Tragedy of Darth Plagueis the Wise was a \"Sith legend\" that was relayed to Anakin Skywalker by Palpatine, telling of his master, Darth Plagueis. Plagueis, the legend went, was \"so powerful and so wise he could use the Force to influence the midi-chlorians to create life,\" and even save others from dying. \"He became so powerful, the only thing that he was afraid of was losing his power. His apprentice, Sidious\"—though Palpatine did not name himself when first recounting the story to Anakin and referred to himself in the third person—\"killed him in his sleep.\""}, {"tag": "p", "text": "According to Palpatine, what made it a tragedy was that he could not save himself from death, despite being able to save others. When Palpatine told this story to Skywalker, Skywalker countered that it was only a tragedy for Plagueis, and for the apprentice it was a happy ending. Palpatine later revealed that he was the unnamed apprentice, and that Plagueis' ability had been real; this was one of the steps towards turning Skywalker to the dark side of the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally, the Tragedy of Darth Plagueis tale was intended to be told by Palpatine to Anakin Skywalker on his suite rather than at the Galaxies Opera House. During principal photography of Star Wars: Episode III Revenge of the Sith, which began on June 30, 2003, one of the onset changes that director George Lucas made was the alteration of Plagueis' \"legend\" from being staged in the suite to the opera house. At Celebration Orlando 2017, Ian McDiarmid revealed that the Tragedy of Darth Plagueis scene was his most evil from all the Star Wars scenes he filmed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}