{"url": "The_Triple_Dark", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "The Triple Dark"}, {"tag": "p", "text": "\"The Triple Dark\" is the third episode of the first season of the animated series Star Wars Resistance and aired on October 14, 2018 on Disney Channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Kaz and BB-8 uncover information on an imminent pirate attack and must find a way to stop it."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Luck"}, {"tag": "p", "text": "On a stormy day, a Sheathipede-class transport shuttle lands at Jarek Yeager's repair shop at the Colossus station. As Yeager guides the shuttle to land, Tam Ryvora warns that this guy better be paying for this rush job that he ordered. Neeku Vozo watches the landing and walks to Kazuda Xiono's quarters."}, {"tag": "p", "text": "Kazuda tells BB-8 that if he had known that he was not going home, he would have brought more stuff. Kaz removes a trophy of a starfighter from his pack and says this will have to do. Kaz asks BB-8 how to spy on the First Order, and what he is looking for. The droid beeps in Binary that he is a mechanic. Kaz counters that he is a spy."}, {"tag": "p", "text": "Neeku tells Kaz that they have a new job and is impressed by his fabulous possessions, particularly the starfighter trophy. Kaz says it is his lucky trophy because it reminds him of home. Neeku holds it and tells Kaz that he once had a pet named Lucky that reminded him of home, but that his pet died and that he ate it and found it supremely delicious. Neeku is about to say he had a stomach ache when Kaz snatches back the trophy and says he doesn't need to know anymore."}, {"tag": "p", "text": "Yeager gives Kaz his first assignment to cut his teeth as a mechanic. He tells Kaz not to screw it up, and that Tam and Neeku will supervise. Kaz grumbles that he is a pilot and only knows how to fly ships and doesn't know how to fix them. BB-8 beeps."}, {"tag": "h3", "text": "Working undercover"}, {"tag": "p", "text": "The client is a Neimoidian named Hallion Nark who tells Yeager to be careful with his ship because it is a classic. Yeager assures him that his team are experienced professionals. While working on Hallion's ship, Kaz asks Neeku if he has encountered anybody from the First Order. Kaz says he has seen a stormtrooper before, and wonders what they look like under those helmets. Neeku says he has never seen a stormtrooper and wouldn't want to know what lies under their helmets. He asks Kaz for the sub-loop spanner. Kaz remarks that the Neimoidian doesn't look like First Order but that he is still pretty shady."}, {"tag": "p", "text": "However, Kaz hands Neeku the wrong device and accidentally electrocutes him. Neeku is alright but a bit bruised, and says he asked Kaz to hand him the spanner. Kaz apologises and says that his mind was spying, before saying flying. Tam watches before walking away. When Hallion asks about Yeager's crew, Yeager reassures him that his ship is in good hands. Hallion tells him to hurry because he has to leave this station in an hour's time. Kaz presses a dashboard, causing everyone to hear a loud screeching sound. This annoys Tam and the astromech droid \"Bucket\"."}, {"tag": "p", "text": "Kaz tries to save face by claiming he was working on the feedback system. Hallion is visibly irritated, and Yeager asks him to wait over there. Hallion claims he has business and leaves. Tam asks Kaz if he has ever worked on a ship. Kaz claims he has a lot of experience working with new ships and not these \"cobbled-together mishmashes\"."}, {"tag": "p", "text": "Tam then asks Kaz where he is from. Kaz says that he used to work at a ship factory on Coruscant. Tam is skeptical and asks Kaz if he expects them to believe that he graduated from the Mechanic's Academy. Kaz claims that he is self-taught. Tam recognizes that and tells him to get her a new set of plasma bolts. Kaz goes to fetch the bolts. Kaz tells BB-8 that he is not cut out for this and is supposed to be spying."}, {"tag": "h3", "text": "Trip to the market"}, {"tag": "p", "text": "Later, Yeager brings a crate and tells everyone that it is payday. He gives Tam and Neeku several credit chips, but only gives one to Kaz. When Kaz asks if it is enough to pay for a meal, Neeku says it may be a meal. When Kaz questions his pay, Yeager says this is the harsh reality of life on the Colossus. Kaz asks Yeager what he talked to Poe Dameron about and for clues on the First Order."}, {"tag": "p", "text": "Yeager hands Kaz two credit chips and sends him to the \"Office of Acquisitions\" to get some new spare parts. Kaz jokes about being on a deep cover mission before leaving with BB-8. They follow Hallion. BB-8 says they should run Yeager's errand, but Kaz says that Poe gave him this job. Kaz tells BB-8 it is important that he start spying. BB-8 beeps, so Kaz tells him, \"Let's find the First Order.\""}, {"tag": "p", "text": "As they enter the Colossus marketplace, Kaz tells BB-8 they can still get the part and carry out their real mission. While walking through the market, Kaz spies on customers. He tries to tail a human lady but runs into a pole. Kaz also accidentally bumps into a grumpy Ithorian patron named Egdir."}, {"tag": "p", "text": "Kaz then spies on two Snivvians named Narb and Nod squabbling. Nod tells Narb that he is looking for a dead man. Narb demands what he is owed, but Nod warns him to speak softer since someone will hear him. Kaz is excited but BB-8 tells him they are not First Order. Kaz realizes they are betting on the races, but Nod then sees him eavesdropping and grabs him by the neck."}, {"tag": "h3", "text": "Unfinished business with Grevel"}, {"tag": "p", "text": "The Aleena Grevel recognizes Kaz as the kid who lost his Holo-darts. Grevel demands that Kaz pays him back. Kaz tries to placate him with a credit chip but Grevel takes that as an insult. The Snivvians close in on him. Kaz says that he just has to borrow some credits from his boss. Grevel doesn't buy it and Kaz and BB-8 take the opportunity to flee."}, {"tag": "p", "text": "Grevel sends the Snivvians after the kid. Narb and Nod Chase Kaz and BB-8 through the marketplace. Kaz bumps into a crate being carried by two droids but managed to turn a corner. The Snivvians bump into the crate. Grevel manages to trip Kaz by rolling over a barrel of loads and jumps on top of Kaz. The Snivvians take Kaz into Grevel's custody. BB-8 manages to hide in a corner. Grevel seizes Kaz's starfighter trophy, and he demands it back. Grevel says that the trophy is made out of pure aurodium, which he thinks will make up for more than what Kaz owes him plus interest. Kaz demands it back, but Narb taunts Kaz."}, {"tag": "p", "text": "Meanwhile, BB-8 sees the Klatooinian Bolza Grool walking by with a box of gorgs. BB-8 shocks Bolza, causing him to splash the contents of his box on Grevel and his Snivvian henchmen. While the Snivvians are distracted, Kaz takes the opportunity to break free. Kaz and BB-8 manage to hide in a crate while the pursuers run past."}, {"tag": "h3", "text": "Acquiring the compressor"}, {"tag": "p", "text": "However, their crate is then pushed by an Otoga-222 maintenance droid down a chute. The two land inside the Office of Acquisitons, where they are greeted by Orka and Flix who tell him they have a front door. Kaz says the chute is faster and requests a CX-19 compressor. He says he is a little behind schedule. Orka and Flix giggle and Orka asks if he brought the credits this time."}, {"tag": "p", "text": "Kaz brings out three credit chips and his trophy. Flix takes an interests in Kaz's priceless trophy and says it is worth a fortune. Kaz takes back his trophy. Orka tells Kaz that he could live well for months if he sold that. However, Kaz says that it is not for sale. He takes the CX-19 compressor only to be accosted by Tam, who chastises him for being late. Kaz says he was coming and tells her he has gotten the compressor. She drags him back to Yeager's repair shop."}, {"tag": "p", "text": "When Yeager asks where he was, Kaz says that it took longer than expected. Yeager tells him to install the compressor now. The Neimoidian Hallion reiterates that it is very important that he remain on schedule. He claims he has a very pressing meeting offworld and that he cannot be late. While Kaz is working, Tam asks if he is sure he can handle that. Kaz claims that he got it covered but Tam points out that he should turn it clockwise rather than anti-clockwise. Kaz teases that he was just testing her."}, {"tag": "h3", "text": "Trouble with Hallion Nark"}, {"tag": "p", "text": "Kaz eavesdrops on Hallion contacting an individual named Kragan Gorr on his comlink and telling him that he has checked with his sources and that they are all clear for a \"triple dark\". Kaz senses something suspicious and surprises Hallion from behind, causing his comlink to roll out under a grate. Kaz apologizes, but Hallion says to forget it because he needs to leave. To compensate Hallion for his lost comlink, Yeager deducts money out of Kaz's pay."}, {"tag": "p", "text": "After Hallion departs on the shuttle, Yeager tells Kaz he had just one thing to do. Kaz says that this is not his only job. Yeager counters that working here is only his cover and that he can't fake it. He tells Kaz to get his head on straight because he will be on his own if his cover is blown. When Kaz asks if people here don't like the Resistance, Yeager says that most people here don't know about the Resistance, and he tells Kaz that it's not the ordinary people he needs to be worried about."}, {"tag": "p", "text": "While chilling outside by the crates, Kaz tells BB-8 that the trophy is precious to him because it is from the first race he ever won. He says that his dad didn't want him to compete because he thought he wasn't ready, but that he proved him wrong. Kaz wants to learn how to be a spy and regards the trophy as a good luck charm. He says that he didn't think he would have survived this race without it."}, {"tag": "h3", "text": "The approaching storm"}, {"tag": "p", "text": "A Rodian man named Glem tells Kaz that a storm is approaching and that he better head inside. Kaz says that a little rain doesn't bother him, but Glem says that it is going to be a \"triple dark\". When Kaz asks what a triple dark is, Glem says that it is a type of storm that causes low visibility. He says that pirates sometimes use them for cover to attack the station. Kaz laughs, and recalls that Hallion wanted to leave before the storm came."}, {"tag": "p", "text": "Kaz says that he hoped that Hallion and his buddoes made it out alright. Glem laughs and tells Kaz that Kragan loves \"triple darks\". He adds that Kragan Gorr is a pirate. Kaz realizes that Hallion was a spy working for the pirates, and that was the reason why he wanted to get out of here so fast. He and BB-8 leave to warn the others only to run into Grevel, who is armed with an energy gun."}, {"tag": "p", "text": "Grevel says that Kaz had a chance to settle his debt with the trophy. At gunpoint, he demands that Kaz hands it over. He threatens to blast Kaz and his droid. At that moment, a group of starfighters and a modified Lambda-class shuttle descend from the stormy sky. Grevel panics while alarms ring. A loudspeaker tells residents to head to the nearest designated shelter and calls for platform defenses to deploy. The Colossus' hangar doors close as residents scurry to safety. The station deploys several anti-aircraft batteries."}, {"tag": "h3", "text": "Raiding the Colossus"}, {"tag": "p", "text": "Inside the pirates' modified Lambda shuttle, the Quarren pirate Kragan Gorr tells his pirates to \"ready the flake\", engage the power generators, and to go for their fuel depots. The Mirialan pilot Synara San says \"Let's trash this place!\" The pirate starfighters strafe the Colossus. One of the pirates is wearing stormtrooper armor from the \"Old Empire\"."}, {"tag": "p", "text": "Grevel tells Kaz that he is lucky the attack is happening, but warns that their score is not over. Kaz says that they are about to be vaporized and asks Grevel to let it go. Ace Squadron race to their starfighters and fire their engines. They are launched by catapult launchers. As the four Ace starfighters do a circle, one of the pirate ships takes out one of the anti-air batteries."}, {"tag": "p", "text": "Freya Fenris tasks the Aces with guarding the shield generator from the pirates. Torra Doza spots two pirate ships on the east side going for the fuel supply. As the pirates shower the deck with laser fire, BB-8 tries to open the blast door long enough for them to escape inside. However, Kaz and Grevel are knocked off the platform by a laser blast. Kaz and Grevel lands on the windscreen of the pirates' Lambda shuttle. Synara San tries to shake them off by pivoting the shuttle. Grevel struggles to hold on to Kaz."}, {"tag": "p", "text": "The pirates manage to shake them off, and the two land in a box next to BB-8 on the deck. As the blast doors close, Kaz manages to carry himself and BB-8 inside. Kaz also uses his trophy to hold the door open wide enough for Grevel to escape. However, the top part of the trophy is bent by the weight of the doors. Despite this, Kaz tells BB-8 that his trophy brings luck. As the battle rages, Kaz and BB-8 race through the corridors."}, {"tag": "p", "text": "Meanwhile, Freya has a \"sleemo\" on her six and asks Torra for backup. Torra, however, has an enemy fighter on her tail. Kaz realizes that the defenders are outnumbered by the pirates. He has an idea and tells BB-8 to follow him. Meanwhile, one of the pirate fighters takes out another anti-aircraft battery."}, {"tag": "h3", "text": "Kaz to the rescue"}, {"tag": "p", "text": "Returning to Yeager's repair shop, Kaz finds Hallion's comlink inside the train. However, it is too deep for him to reach. Meanwhile, Kragan tells his pirates to form on the east flank and take out the generator. BB-8 uses his grappling hook to retrieve the comlink, earning Kaz's praise."}, {"tag": "p", "text": "Eavesdropping on the pirates' communications, Kaz hears Kragan telling his pirates that the eastern side is open and to go for the power generator. Realizing that the comlink is patched into the pirates' communications, he uses one of Yeager's machines to create an ear splitting sound that interferes with their comms, jamming them and disorientating the pirates. This also jams Kragan's shuttle's intercom and locks its navigation system."}, {"tag": "p", "text": "This interference allows Yellow Ace to shoot down one of the pirate starfighters, which is being piloted by an individual wearing a stormtrooper helmet. The pirates begin to scatter. Kragan warns his underlings that the enemy is going to pick them off and orders a retreat."}, {"tag": "p", "text": "As the pirates retreat, Freya reports that the pirates are breaking off their attack. Torra Doza thinks that it was not due to their efforts. As the overhead speakers announces that Ace Squadron has driven back the pirates, Kaz switches off the generator. He tells BB-8 that he thinks that they just saved the station. BB-8 beeps in agreement when Kaz tells him that they make a good team."}, {"tag": "h3", "text": "The unsung hero"}, {"tag": "p", "text": "The Colossus opens its hangar bay doors and residents emerge from their shelters. When Team Fireball returns to the shop, they find Kaz working on the Fireball. When Tam asks if he was too busy to make it to the shelter, Kaz says he had work to do and no time to hide. Tam teases Kaz that he was so terrified that he could not move. Kaz tells her to see for herself, before firing up the Fireball's engines."}, {"tag": "p", "text": "The engines start to fire up but then give out, belching out black smoke. Tam asks Kaz if that is what they taught him at his mechanic's school. When Yeager asks Kaz if he was working on his skills, Kaz tells him that he was right that he has a lot to learn. Kaz tells him that there is a lot more than the First Order out here. He tells Yeager that Hallion was a pirate spy. Yeager does not believe him, and walks off responding that he'll see him later. Kaz tells him that is true, and asks BB-8 to tell, but the droid just beeps. As Yeager walks away, Kaz tells him that Hallion was a pirate friend or accomplice."}, {"tag": "h3", "text": "Smoke and mirrors"}, {"tag": "p", "text": "In space, three TIE fighters circle around a Resurgent-class Star Destroyer. Major Elrik Vonreg tells Kragan and his pirates via holoprojector that it would seem that Ace Squadron was more than a match for his pirates. Vonreg is gravely disappointed, and reminds Kragan and his pirates about their the bargain and the consequences of failure."}, {"tag": "p", "text": "Kragan tells Vonreg that their inside agent made a tactical error and displays a bound Hallion. Kragan reassures him that Hallion will be \"properly\" punished. Captain Phasma then joins the conversation and says that when Major Vonreg and Commander Pyre first proposed the idea of collaborating with pirates, she was skeptical. She says that they have done little to prove her wrong. Kragan vows to take care of them just like she asked. He adds that Imanuel Doza will soon be begging the First Order to take control of the Colossus. The camera focuses on Phasma's helmet before panning out."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}