{"url": "The_Test", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "The Test"}, {"tag": "p", "text": "\"The Test\" is the eighth episode of the first season of the animated television series LEGO Star Wars: The Freemaker Adventures. It is the eighth episode of the series overall. The episode premiered on Disney XD on July 25, 2016."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Freemakers meet Hondo who gives them a seemingly simple job that turns out to be much harder than they thought."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Escaping Naare"}, {"tag": "p", "text": "Naare starts her day on The Wheel in a cheerful, friendly mood—that is, until Roger tells her to come back later or tomorrow. With her blue lightsaber, she breaks into the Freemaker Garage to find the Freemakers on high ground, and Rowan reveals her true colors. \"The Jedi are all gone. Destroyed by people like me,\" Naare explains, Force-pushing Rowan off the lift. He struggles to regain balance as he, Roger, and his siblings escape in the StarScavenger, leaving Naare alone to regurgitate a scream of rage."}, {"tag": "p", "text": "Naare pursues them in her Eclipse Fighter. Now on the run with Naare in hot pursuit after losing the StarScavenger's rear deflector, Zander puts the pedal to the metal by attempting to lose her in traffic when via a hologram she delivers an ultimatum: surrender Rowan over to her and she may just spare their lives. Zander counterpoints by clipping the Eclipse fighter's wings off, allowing them to escape into hyperspace."}, {"tag": "p", "text": "Zander is visibly upset by the revelation and Roger adds to his sorrow that, from his own point of view, the Jedi were the true enemies of the Clone Wars. When Zander corrects Roger that the battle droids were the real villains, Roger overloads his processors. Kordi admits that she knew all along that Narre was evil from the start, but Rowan is saddened by the fact that she promised that she would train him to become a Jedi. The damaged quantum field regulator breaks away and the StarScavenger lands on the planet Takodana where they seek refuge in the castle of Maz Kanata."}, {"tag": "h3", "text": "Hondo's errand"}, {"tag": "p", "text": "After landing, Zander is brought by the Dowutin hunter Grummgar and another human gangster before their captain, the gangster Hondo Ohnaka, who demands that he pay for the minor damage done to his ship by the StarScavenger's crash landing. Before Hondo and his henchmen can harm Zander and Rowan, Maz Kanata reminds the pirates to behave. Kordi then talks her brothers out of trouble by offering to work for Hondo as compensation. As collateral, she proposes leaving the StarScavenger behind. Hondo accepts Kordi's deal and sends the four Freemakers to the third moon to retrieve something. A curious Rowan peeks into Maz's vault, but she refuses entry by saying that no one is allowed in there but her."}, {"tag": "p", "text": "Later, Kordi discusses their mission with her brothers and Roger. She explains that Hondo wants them to retrieve three golden orbs and suspects that their is a catch because he was unable to do it himself. Unable to use the StarScavenger, the Freemakers travel in their cramped Mini Scavenger. Back on the Wheel with her fighter badly damaged, Naare is ambushed by Graballa, Baash, Raam, Dengar and two other Tatooine rogues. She decides to form an alliance with the Hutt, who is also after the Kyber Saber crystals. In return for Graballa's crew repairing her ship, Naare agrees to share the proceeds from the crystal with Graballa, who wants to build his beach side resort and buffet. Though Naare does not know where the crystals are, she tells him that she knows where Rowan is."}, {"tag": "h3", "text": "Rowan's test"}, {"tag": "p", "text": "After an uncomfortable flight, the Freemakers and Roger land their Mini Scavenger on the third moon of Takodana. Rowan discovers the sinkhole where the golden orbs are but discovers that it is inhabited by many varactyls. They decide to wait until nightfall. Rowan is assigned to act as a \"snipe spotter\" while Roger is tasked with fetching the golden orbs directly. That night, the Freemakers fly their scavenger vessel over the sleeping varactlys and lower Roger into a pit. Out of greed, Kordi tells Roger to fetch more than three golden orbs. However, Rogers has slippery fingers and drops the orbs; waking up the varactyls."}, {"tag": "p", "text": "The varactyls toss the Freemakers' scavenger vessel like a soccer ball and rip Roger apart. Jumping into the pit, Rowan wields Naare's crimson lightsaber to fend off the creatures and it isn't long before he discovers that the golden orbs are eggs. He briefly toys with the dark side but decides to remain loyal to the light side. Realizing it is wrong to take the eggs, Rowan uses the Force to communicate with the varactyls and make peace with them. The following morning Kordi tells him that he is special, giving him the courage to confront Hondo with the truth. Meanwhile, Zander repairs Roger who talks about \"patting Zander on the back.\""}, {"tag": "h3", "text": "Confronting Hondo"}, {"tag": "p", "text": "Back at the castle, Hondo jokes about tossing several opponents through the air locks when he is confronted by the Freemakers. Rowan tells him the the \"golden orbs\" belong to the varactyls. One of Hondo's human crew explain that varactyl eggs make a handsome price on the black market. Displeased with the Freemakers, Hondo orders his men to break their heads. Before they can hurt the Freemakers, Maz expels Hondo and his two subordinates, no longer permitting them as tenants. She rewards the Freemakers with a new quantum regulator for a Class-D cargo container and a Kyber Saber crystal she found on Rodia, telling Rowan on his way out to look for the Maker of Zoh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}