{"url": "The_Story_of_the_Faithful_Wookiee", "categories": ["Category:Real-world articles", "Category:Miscellaneous television productions"], "nodes": [{"tag": "h1", "text": "The Story of the Faithful Wookiee"}, {"tag": "p", "text": "The Story of the Faithful Wookiee is an animated story that aired as part of the 1978 made-for-TV-film The Star Wars Holiday Special. It was produced by Nelvana and is notable for being the first appearance of Boba Fett, as well as having most of the original Star Wars cast voicing their respective characters."}, {"tag": "p", "text": "In the Holiday Special, the young Wookiee Lumpawarrump watches the cartoon while waiting for his father Chewbacca to return home for Life Day. In the cartoon, a mysterious figure (Boba Fett) befriends Luke and his friends. Soon, it is revealed that Boba was working for Darth Vader and the Empire. Chewbacca, who was not fooled, says (through C-3PO's translation) that the bounty hunter \"didn't smell right.\""}, {"tag": "p", "text": "The animation quality and graphics are generally considered to be good for their time (1978). However, Nelvana gave the Star Wars universe a unique interpretation. For example, R2-D2 is quite flexible for a droid, and Han Solo is nearly unrecognizable. The animation style, as well as some of these character models, were used nearly a decade later in the Star Wars: Droids animated series, which served as a spin-off of sorts to the segment. The Ewoks animated series also used these techniques."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo and Chewbacca have been on a mission to recover a mystical Talisman thought to be a powerful artifact. Chewbacca comes out of Hyperspace nearly colliding with the Rebel base, with bizarre internal visuals with Solo being hung upside-down and apparently unconcious. Luke, R2-D2, and C-3PO come out after him, in a Y-wing, to see what is wrong."}, {"tag": "p", "text": "When Chewbacca eventually lands on Panna, Luke following him crashes on its surface and is nearly eaten by a Panna dragon, when Boba Fett rescues them. They find the Falcon with Han, probably unconscious from the talisman, and Chewbacca, who carelessly throws the Talisman down the garbage chute. Luke faints due to the talisman and R2-D2 tells them that he was infected by a sleeping virus that only worked on humans."}, {"tag": "p", "text": "Boba Fett and Chewbacca then go to acquire the serum for that virus, located on Panna City to cure Luke and Han. Once they get into the city, which is occupied by Imperials, Boba instructs Chewbacca to stay behind while he gets the cure. Meanwhile, back on the Falcon, as C-3PO is caring for Han and Luke, with the upside-down positioning being recommended as a treatment technique to slow the disease's progress. As they occupy themselves with that task, R2 intercepts a transmission between Darth Vader and Boba Fett: Once away from Chewbacca, Boba contacts Darth Vader to inform him of the situation. He reveals that he and Vader are in a plan to reveal the location of the Rebels so that Vader can stop them, like he tried and failed."}, {"tag": "p", "text": "When they get back, the two humans recover and everyone learns of Boba's true allegiances. Boba ignites his jet pack, and blasts away, promising that he will meet them all again. Chewbacca then explains (through C-3PO's translation) his suspicions by saying that, \"the bounty hunter didn't smell right.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "During development of The Star Wars Holiday Special, director David Acomba showed George Lucas the 1976 Nelvana film A Cosmic Christmas. He decided to hire them for the project because he wanted a unique style of animation. Lucas then met with Nelvana and provided them with a story outline, which Clive A. Smith and Frank Nissen turned into storyboards. After approving their work, Lucas proceeded to work with Smith on streamlining the story.. The project was then developed under a relatively short time schedule, with the animators working from the video of the Joe Johnston/Ben Burtt costume test costume test. The color palette was chosen so that it would stand on black-and-white TVs, which were still common at the time."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "A few seconds of the segment were included in the Star Wars: Episode II Attack of the Clones \"Bucket Head\" web documentary (that premiered on StarWars.com), which was later released on the Attack of the Clones DVD. In the documentary, Jeremy Bulloch, who wore the suit for the Fett character in Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi, notes that Fett first appeared in the holiday special segment. Boba Fett uses a Sacros K-11 blaster, which is very similar to the WESTAR-34 blaster pistols used by his father Jango in Attack of the Clones."}, {"tag": "p", "text": "The complete segment was finally included in an official release as an Easter egg hidden in the Blu-Ray release of the Complete Star Wars Saga. Luke wears the same jacket he wears at the end of Star Wars: Episode IV A New Hope. Although Nelvana later worked on the Star Wars Droids and Ewoks animated series, Ken Stephenson, the uncredited animation director for the animated segment, was the only crew member of the Holiday Special to return to work on those two shows—of which he directed several episodes."}, {"tag": "p", "text": "On March 16, 2021, it was announced on Disney's website D23.com that the segment would be available on Disney+ starting April 2."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Although this story's exact timeline placement is unknown, it can be assumed that it is after the events of the Star Wars: Rebel Force series of books, but before the events of the Holiday Special. In this cartoon, Boba pronounces his name as Boe-ba. This is how Kaminoan Taun We says it as well. Jango Fett pronounces it as Bob-a. When animating C-3PO for his Star Wars: Clone Wars animated series in 2003, Genndy Tartakovsky paid homage to Nelvana's animation style by making C-3PO's eyes move as Nelvana did. The planet Nelvaan is also an homage to Nelvana. The band Unkle sampled several of Boba Fett's lines from the short for their songs Bloodstain and Unreal, which were on their debut album Psyence Fiction."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}