{"url": "The_Tree_of_Light", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "The Tree of Light"}, {"tag": "p", "text": "\"The Tree of Light\" is the sixth episode of the first season of Ewoks. Written by Bob Carrau and directed by Raymond Jafelice, the episode originally aired on ABC on October 12, 1985."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "When a storm passes over Bright Tree Village, Chief Chirpa sends Paploo, Weechee, Widdle, and Teebo to restore the Tree of Light, to protect them from the Night Spirit. To do this, Logray sends them with Light Dust to sprinkle onto the base of the tree, and a magic lantern to lead them to the tree. He also warns them of the imaginary and physical dangers they will face on the journey. Kneesaa, Wicket, and Latara also ask to go but are denied due to their ages or genders."}, {"tag": "p", "text": "Meanwhile at Gorneesh's hut, King Gorneesh is enjoying the foul weather for he worships the Night Spirit, and even though another Dulok, with three scratch marks on his stomach, claims he likes it too to agree with his king, he is shivering under a blanket. Scratch mentions how it must mean the Tree of Light is fading, but King Gorneesh says this year he will tear it down, for the previous year Scratch had failed. Although King Gorneesh does give Scratch the task of delaying the band of Ewoks, set on restoring the tree, to give the King enough time to destroy it."}, {"tag": "p", "text": "On the journey they enter a cave, scaring flying snakes away as they walked. Widdle eventually sees something behind him and, fearing a monster, runs away causing everyone else to run as well. After exiting the cave, they come to a rotten-looking rickety old bridge and carefully go across it one at a time. Widdle suddenly hears something, and again runs pass everyone, but this time, the lantern is dropped, and it rolls along the bridge away from everyone else. Suddenly Wicket, the one who made the noises and was sneaking up behind Widdle, comes out of the bushes, and grabs the lantern just before it falls off."}, {"tag": "p", "text": "Back on track, they decided to let Wicket join them on their quest, even though Wicket will probably get into trouble for it. They come across a maze that is attached to rumors saying that any who enter are bound to get lost, and Paploo mentions why they have the lantern, but Weechee ignorantly strides into the maze confident he won't need the lantern. Just then two Duloks, Scratch, and a younger one come out of some bushes. Scratch thinks they will pass the Ewoks in the maze but the young one thinks they will get lost. Scratch shrugs the doubts off and pulls out goggles that he has invented, designed to help them get through the maze."}, {"tag": "p", "text": "After hours of wandering through the maze, the Ewoks finally doubt Weechee knows where he is going. Weechee responds by asking Paploo to lead the group, to which he responds by playing a game to decide which way to go."}, {"tag": "p", "text": "Outside the maze, Kneesaa and Latara come to the entrance of the maze but Latara wonders if they should have disobeyed orders, but Kneesaa wants to prove they are brave and strong, so they continue into the maze."}, {"tag": "p", "text": "Weechee, angry at Paploo for claiming he can lead them out, taunts Paploo since he has not yet found the exit. Paploo again picks the wrong direction even though Wicket, who has been carrying the lantern, tries to warn him the lantern is pointing a different way. At the moment they all leave, Scratch and the young Dulok walk into the same room. The young one tries to warn Scratch about a rock, but Scratch trips and breaks his glasses anyway. Scratch says he has a backup plan, to capture the Ewoks in a net covered in Ganga sap. Right as the Duloks walk away, Kneesaa and Latara also arrive in that room. After a bit of sap drips onto the floor, Latara claims she thought she heard Teebo, and Kneesaa makes fun of her for having such a big crush. Latara gets excited and tries to follow the sound, running right into the Duloks, with Kneesaa right behind her. They both run from the Duloks who are chasing after them with the net. After a brief struggle, the Duloks end up stuck to their own net. After seeing this Kneesaa makes fun of Scratch by calling him a rakazzak. As Latara congratulates her, the boys, having heard the comotion, arrive asking what they are doing here. Kneesaa decides to tell the truth in that they are there to prove themselves. The boys agree that they have by catching the Duloks, and invite them to join. Wicket finally speaks up and gets the others to follow the lantern."}, {"tag": "p", "text": "Out of the maze, they come to a stop for they have reached the Valley of Floating Trees. They end up making make shift paddles and using a floating tree as a raft to get across the foggy valley. Kneesaa throws a rock off to see how far down it is, and Wicket claims no one has ever seen the bottom. They reach the other side and see the Mountain of Light. They think the trees are following them but then notice Gorneesh and his Duloks are controlling them. They ram the Ewoks' tree and tie them up. Gorneesh takes the vile of Light Dust from around Weechee's neck and return to their own tree. Wicket begins viciously tearing apart the ropes that are holding him with his teeth. He quickly unties Kneesaa, and they jump and secretly hang onto the Duloks tree as it floats to the mountain. Latara, Paploo, Weechee, and Widdle untie their ropes, but discover their oars to have been smashed by the Duloks. Weechee comes up with the idea of using their blankets as sails. Teebo stands at the top with the lantern to point them through the fog. They slam into the side of the mountain next to all of the Duloks trees."}, {"tag": "p", "text": "At the top the Duloks have tied ropes to the tree and are trying to pull it down. Kneesaa lures Gorneesh into a cave where Wicket attacks him, covering his eyes. Kneesaa comes at him and tackles him to the ground. They take the vile of Light Dust from Gorneesh's neck but Gorneesh comes to his senses and grabs her. Kneesaa throws the vile to Wicket who runs through the caves, Gorneesh chasing after him."}, {"tag": "p", "text": "The group of Ewoks finally reach the top to see the Duloks nearly pulling the tree down. Wicket runs out of the caves and Gorneesh orders his men to get Wicket. In the fiasco, the Duloks end up in a dog pile, and Wicket makes it to the tree trunk where he smashes the vile open and the Tree of Light is healed. The Duloks, having adjusted their eyes to the dark of the swamps, are blinded by the light that bursts from the tree. The desert-like top of the mountain suddenly grows grass and flowers all over. The Duloks run away, and the Ewoks congratulate Wicket. At the bottom of the mountain, Still tied up in the net, Scratch and the younger one, trying to warn Gorneesh that the Ewoks are coming, wonder why it is getting brighter. All of a sudden they are trampled by their fellow Duloks."}, {"tag": "p", "text": "Back at Bright Tree Village, Chief Chirpa awards Paploo, Teebo, Weechee, and Widdle four silver feathers for their bravery. He then goes on to prepare to punish Wicket, Kneesaa, and Latara, but doesn't because of their bravery displayed on the quest, and gives each of them silver feathers too, and the crowd goes wild."}, {"tag": "h2", "text": "Development"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}