{"url": "Battle_of_Ord_Ibanna", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Brema sector", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Battle of Ord Ibanna"}, {"tag": "p", "text": "The Battle of Ord Ibanna was a naval conflict between the Sith Empire and the Galactic Republic during the Great Galactic War. During their campaign to seize the Outer Rim Territories from the Republic, the Sith targeted the Brema sector in a concentrated effort to secure the region. The Imperial Armada and the Republic Navy eventually met in the sector over the world of Ord Ibanna, and the Empire's fleet took heavy losses during the ensuing battle. After the Imperial force's Sith commander was killed by Republic fire, tactical advisor Rycus Kilran assumed command of the fleet and led it to victory over the Republic forces."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following its return to the known galaxy in 3681 BBY, the Sith Empire launched a campaign to secure the entirety of the Outer Rim Territories in the early stages of the Great Galactic War. The Sith eventually came to target the Brema sector in the Outer Rim, and moved to seize it from their opponents: the Galactic Republic and its Jedi Order. The early efforts in the region were successful, due in part to the participation of Rycus Kilran—a talented, Force-deaf Imperial officer and tactical advisor in the Sith navy."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the campaign for the Brema sector, an Imperial fleet under a Sith commander came into conflict with Republic naval forces over the planet Ord Ibanna. The engagement resulted in heavy losses for the Imperials, which included the death of their Sith leader. Into the command vacuum stepped Rycus Kilran, who rallied the vessels of the Armada and led them to victory over the Republic."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, Kilran grew in notoriety and authority; the former tactical advisor was given a command of his own and continued to impress his Sith overlords and the Empire's Minister of War. Following the end of the Great Galactic War in 3653 BBY, Kilran was honored with the title of \"Grand Moff\" as recognition for his contributions to the Sith victory in the conflict."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ord Ibanna was introduced as background information for the LucasArts video game, Star Wars: The Old Republic. Information on the battle was released in Grand Moff Rycus Kilran's biography entry on The Holonet, an online database of The Old Republic information found on the game's official website. The biography page was posted on March 26, 2010. The battle later appeared in Moff Kilran's in-game Codex entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}