{"url": "Battle_of_Ord_Mantell_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Battles of Ord Mantell", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Battle of Ord Mantell  (Yuuzhan Vong War)"}, {"tag": "p", "text": "The Battle of Ord Mantell was a battle fought during the first year of the Yuuzhan Vong War. It marked the first use of a qworlth skaal during the war."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "As the Yuuzhan Vong moved into the Mid and Inner Rims, the Jubilee Wheel space station in orbit around Ord Mantell became a transit point for refugees fleeing the advancing front line. The Yuuzhan Vong decided to launch an attack on Ord Mantell, ostensibly in the hope that the projected death of countless refugees would do much to destabilize the already floundering New Republic. In reality, the battle was a ruse intended to trick New Republic leaders into trusting the would-be Yuuzhan Vong defectors Elan and Vergere. Prior to the battle, as part of her mission to earn the confidence of the New Republic Intelligence Service and gain access to the Jedi, Elan had warned the New Republic of the Yuuzhan Vong plan to attack Ord Mantell. By sacrificing some of their forces in an abortive attack on the system, the Yuuzhan Vong hoped to convince their enemies that Elan's information was accurate and therefore that her defection was genuine."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "With intel provided by Elan, the New Republic hoped to set a trap for the Yuuzhan Vong. The bulk of a task force commanded by New Republic General Yald Sutel hid behind Quatin, the fifth planet of the system. When the Yuuzhan Vong emerged from hyperspace, the New Republic task force moved in behind them and proceeded to engage. Both fleets were roughly evenly matched in terms of numbers and firepower."}, {"tag": "p", "text": "During the height of the battle, the New Republic's battlecruiser was overwhelmed and destroyed by enemy fire. In response, Sutel brought his flagship, the Imperial Remnant star destroyer Erinnic under the command of Imperial Vice Admiral Ark Poinard, into the battle. When the Erinnic attempted to engage the lone Miid ro'ik warship however, the Yuuzhan Vong vessel turned away and began to bombard the surface of Ord Mantell before proceeding to launch a qworlth skaal beast, at the Jubilee Wheel. Despite the efforts of New Republic star fighters, the beast, which was protected by the warship's dovin basals, caused severe damage to the station and was able to inhale a number of the stations inhabitants to be enslaved by the Yuuzhan Vong."}, {"tag": "p", "text": "Despite the damage wrought by the Yuuzhan Vong fleet, the New Republic and Imperial forces soon gained the upper hand. As the Yuuzhan Vong began to withdraw, Poinard determined that his ship was too badly damaged to attempt a pursuit. Sutel agreed and expressed his belief that seeing their battered ships limping home might give the Yuuzhan Vong pause."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The New Republic's victory at Ord Mantell temporarily helped reinforce the authenticity Elan's false defection. Her seemingly genuine intel helped to finally convince the Jedi to meet with her. Her plans unraveled however when she was intercepted en route to Coruscant by Peace Brigade members. The heavy cost of Elan's ruse, including the losses suffered at Ord Mantell, led to Supreme Commander Nas Choka punishing the Priest Harrar and Commander Tla, who had organized the plot, by sending them back to the Outer Rim."}, {"tag": "p", "text": "Han Solo, who was on the Wheel in his search for Reck Desh, was one of the few to escape the qworlth skaal's clutches. Piloting a stolen shuttle away from the Wheel with the help of the Ryn Droma, Solo was able to escape the battle and continue his hunt for the Peace Brigade member."}, {"tag": "p", "text": "Despite the New Republic victory, Ord Mantell would eventually fall to the Yuuzhan Vong. A number of refugees from the planet would end up on Gyndine which was subsequently attacked as well. Eventually the planet was liberated by Mandalorian forces under Mandalore Boba Fett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Essential Guide to Droids confuses the Jubilee Wheel and the Wheel space stations, mistakenly stating that Big Bunji was the Wheel's administrator and that the Wheel's Master-Com controlling intelligence aided Big Bunji against the Yuuzhan Vong assault."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}