{"url": "The_Unknown_Regions", "categories": ["Category:Real-world articles", "Category:Wizards of the Coast sourcebooks"], "nodes": [{"tag": "h1", "text": "The Unknown Regions"}, {"tag": "p", "text": "The Unknown Regions is a hardcover supplement to the Star Wars Roleplaying Game Saga Edition Core Rulebook by Wizards of the Coast. It was released on April 20, 2010 and was the last book in the Wizards Star Wars line."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"Far from the cityscape of Coruscant, beyond the fringe planets of the Outer Rim, lies a vast region of space called the Unknown Regions. The Unknown Regions are mysterious and uncharted. They are home to strange aliens, violent slavers, and the forgotten remnants of ancient civilizations that have lived in isolation for eons."}, {"tag": "p", "text": "\"This sourcebook gives players and Gamemasters everything they need to run and play in campaigns featuring scouts, exploration and adventure in the uncharted reaches of the Star Wars galaxy. The Unknown Regions allows Gamemasters to take their existing campaigns in bold new directions, or this book can be used to jumpstart a new campaign that focuses on exploring the unknown.\""}, {"tag": "h3", "text": "Back cover summary"}, {"tag": "p", "text": "\"Go beyond the Outer Rim\""}, {"tag": "p", "text": "There are places in the galaxy full of danger and mystery, places where the light from the Core Worlds simply does not shine. These are the planets of the Unknown Regions, a sector of unexplored space far beyond the Outer Rim. In this vast expanse, rich worlds wait to be discovered and alien landscapes wait to be explored. However, the Unknown Regions are far from uninhabited. Many frightening creatures prowl the expanse, and alien species bent on conquest and plunder lurk at the fringes of known space. The galaxy needs heroes who will risk everything to explore these new worlds and stop these threats from advancing."}, {"tag": "p", "text": "The Unknown Regions presents various options for both players and Gamemasters, including:"}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}