{"url": "The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Canon young-reader novels", "Category:Journey to Star Wars: The Force Awakens"], "nodes": [{"tag": "h1", "text": "The Weapon of a Jedi: A Luke Skywalker Adventure"}, {"tag": "p", "text": "The Weapon of a Jedi: A Luke Skywalker Adventure is a junior novel that was released as part of the Journey to Star Wars: The Force Awakens book series. The novel, written by Jason Fry, follows the adventures of Luke Skywalker between Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back. It was published by Disney–Lucasfilm Press on September 4, 2015, and comprises 192 pages. An animated comic adaptation of the novel was created by Nestlé as part of a licensed Star Wars–themed promotional campaign. The animation can be viewed on the Nestlé Comics website by typing a digital code featured on every box of Nestlé cereals. In 2017, a four-part comic adaptation written by Alec Worley and drawn by Ruairí Coleman was published in the German Star Wars Magazin."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "In this story, set between Star Wars: A New Hope and Star Wars: The Empire Strikes Back, Luke finds himself drawn to a mysterious planet, where he must use the Force to save a young girl—and survive in a dangerous duel against a strange new villain."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Author Jason Fry described getting the chance to write Luke Skywalker as \"a huge thrill and an awesome responsibility,\" noting that he felt that \"he's eluded some authors.\" He finished writing the book with a deeper appreciation of Skywalker than he had previously. There is also a new character in the book that he hopes fans will take a liking to."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Cornelius Evazan was stated to be an alien. However, the 2016 reference book Star Wars Character Encyclopedia: Updated and Expanded then revealed that Evazan was a human."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}