{"url": "The_Wooden_Wookiee", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Batuu stores"], "nodes": [{"tag": "h1", "text": "The Wooden Wookiee"}, {"tag": "p", "text": "The Wooden Wookiee was a booth inside the market in Black Spire Outpost on the planet Batuu. It was owned by the Wookiee male Lunacca, who sold carvings made from wroshyr wood. During their youth, Salju and her pet therii, Elee, visited The Wooden Wookiee and received a gift from Lunacca. Around the time that the First Order occupied Black Spire Outpost in about 34 ABY, Lunacca had closed The Wooden Wookiee in order to make a supply run to the planet Kashyyyk for more wroshyr wood."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Wooden Wookiee was a merchant's booth inside Black Spire Outpost's market on the Outer Rim Territories planet Batuu. The small outdoor shop was run by the Wookiee male Lunacca, who was a fourth-generation woodcarver. Lunacca sold various wroshyr wood carvings, including many of the cups used for specialty drinks at Oga's Cantina, as well as sculptures, wooden creatures, small trinkets, Wookiee shields, and other unique works of art."}, {"tag": "p", "text": "The Wookiee shields were made nearly indestructible by wroshyr tree sap. When not working the shop, Lunacca had The Wooden Wookiee closed, as he worked alone and did not have locals help with customer service during his absence. Most people on Batuu also did not have the strength to whittle wroshyr, and so every item made at The Wooden Wookiee was a creation of Lunacca's. However, the Wookiee did use a crew led by an individual named Schelhorn for wood shipments."}, {"tag": "p", "text": "The booth had the body of an R-series droid in its corner that was used as a furnace, and the shop was located in a corner of the market across from the Creature Stall and next to the outpost's historical obelisk. Its perimeter was formed using desks and tables, and the back of the booth had shelving for tools and products."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While Salju—the local mechanic—and her pet therii, Elee, were wandering the market sometime during their youth, Lunacca called them over to The Wooden Wookiee to hand them a wooden figure of Elee he had crafted for them as a gift. During the First Order's occupation of Black Spire Outpost around 34 ABY, the Ithorian collector Dok-Ondar had a table made of wroshyr wood, which his employee Julen Rakab recognized from The Wooden Wookiee due to its carvings, in his antiquities shop. Around the same time, The Wooden Wookiee was temporarily closed as Lunacca made a supply trip to the Wookiee homeworld of Kashyyyk for more wroshyr wood."}, {"tag": "p", "text": "Prior to leaving, Lunacca had partially carved several pieces, including sculptures of porgs, an Ithorian bust, a Wookiee bust, a loth-cat, the symbol of the Jedi Order, and a large avian creature, along with other creatures. While the Wookiee was absent, these items sat on display in the booth. The store was also featured in the Traveler's Guide to Batuu, written by author and explorer Eloc Throno at the same time of the First Order occupation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wooden Wookiee first appeared as a location within the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. Although the location is a merchant's booth in-universe, all of the items at the real-world location are merely props and are not available for purchase."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}