{"url": "The_Works", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:The Works locations"], "nodes": [{"tag": "h1", "text": "The Works"}, {"tag": "p", "text": "The Works was an industrial zone located in the Industrial District of Imperial City on the planet Coruscant. It was a vast, burned out district that was mostly abandoned. The sector was largely flat and was covered in gases, smoke, and vapors pouring from those factories that were still standing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Works was once a manufacturing powerhouse known throughout the galaxy. However, businesses which operated within The Works were eventually driven elsewhere due to the increasing cost of doing business on Coruscant, leaving the once-booming industrial sector neglected and abandoned. Most Coruscanti started to avoid this area due to the high range of criminal activity that went on here."}, {"tag": "p", "text": "At the start of the Clone Wars, Count Dooku arrived in the Coruscant tower located in The Works to inform his Sith Master, Darth Sidious, that the war between the Republic and Separatists had begun. The Dark Lord was pleased at the news, as it brought them a step closer to the completion of the Sith's plan."}, {"tag": "p", "text": "At the end of the Clone Wars, Sidious summoned Dooku back to The Works in response to Yoda's presence on Moraband. Initiating a ritual using Dooku's blood to draw on his Force-bond with his old Master and feeding it with Force lightning, Sidious was able to summon the power of dark illusion in an attempt to break Yoda's will."}, {"tag": "p", "text": "In the ensuing illusions, the Jedi Grand Master saw himself with Anakin Skywalker and a squad of clones on their way to The Works to apprehend the Sith Lords, the intent being to break Yoda's spirit. During the illusion, Sidious fought Yoda and attempted to force him to choose between saving Skywalker or killing Sidious. Yoda chose to save Skywalker, sacrificing himself. With this, the illusion ended and Sidious and Dooku's attempt to break Yoda failed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}