{"url": "The_Zillo_Beast_Strikes_Back", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "The Zillo Beast Strikes Back"}, {"tag": "p", "text": "\"The Zillo Beast Strikes Back\" is the nineteenth episode of Season Two of the Star Wars: The Clone Wars television series and concluded a two-part storyline started with the previous episode, \"The Zillo Beast.\" It aired on April 10, 2010 in the UK and on April 16 in the US."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Republic forces bring the Zillo Beast back to Coruscant for study. When it escapes, the Jedi must choose between saving millions of lives and destroying the Zillo Beast, the last of its kind."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Zillo Beast is transported to Coruscant for study. Mace Windu is skeptical and fears that the creature is too dangerous to have been brought to the planet, though Supreme Chancellor Palpatine assures him that determining the secret of its invulnerability will bring a closer end to the war. Windu brings his concerns to Obi-Wan Kenobi, who believes that, regarding what the Zillo Beast is capable of, bringing the creature to Coruscant is not worth the possible military benefits. When Windu explains that the Chancellor failed to heed his warnings about the danger, Obi-Wan suggests they let someone else try."}, {"tag": "p", "text": "Meanwhile, study of the Zillo Beast is taken under personal study by Doctor Sionver Boll, who has it sedated and restrained. As she explains to Palpatine, attempting to remove the creature's scales to examine them in order to synthesize a stronger armor would be extremely painful to it. Palpatine suggests that killing it would be the best option. Boll protests, stating that the Zillo Beast isn't only the last of its kind, it may also be sentient; Palpatine dismisses the possibility, stating that the giant beast is simply an animal; the beast growls at his comment and stares hatefully at the Chancellor. Palpatine orders the use of the Malastarian fuel to be used as a poison to quickly kill the beast and threatens to replace Boll if she doesn't have the stomach to do it."}, {"tag": "p", "text": "At the Senate, Anakin sees Obi-Wan talking to Padmé Amidala. He quickly guesses that she and Obi-Wan want him to talk to the Chancellor to discuss the fate of the Zillo Beast. Padmé points out that the beast was brought to Coruscant against its will and has no literal voice to defend itself. Reluctantly, Anakin agrees. When both he and Padmé meet with the Chancellor, the latter and Mas Amedda try justifying that killing the beast is for the greater good, to which Padmé challenges that killing the last of a species in secret and without discussion can be good for none; Anakin stays neutral and acknowledges both points of view: Palpatine remarks that Obi-Wan taught him well, though Padmé is less impressed that Anakin is taking Palpatine's side, not hers."}, {"tag": "p", "text": "Back in Boll's lab, she attempts to administer a small dosage of Malastarian fuel as a poison gas to euthanize the Zillo beast. Unfortunately, when a small amount was applied, the creature becomes agitated and aggressive, breaks free of its bonds, smashes its way out of the laboratory and starts rampaging across Coruscant, unhindered by all efforts to stop it. When it sees the Senate, it makes its way towards it, planning on getting revenge on Palpatine. The Chancellor, Padmé, Anakin, and R2-D2 evacuate to the former's escape shuttle, only to be caught by the beast just as they take off. Anakin comes up with a dangerous plan to free them by slicing off the front part of the shuttle, while Yoda and Aayla Secura distract the beast. But when the front half splits off, Anakin, Padmé, R2 and C-3PO fall out, while the Chancellor and a Senate Commando fall a level below, escaping a certain death thanks to Obi-Wan Kenobi and Mace Windu, who Force-grip the front half of the Chancellor's ships, interrupting its course. R2 manages to grapple himself to the side of the building, preventing C-3PO from continuing his fall, while Anakin helps Padmé up from slipping off the edge. The Zillo beast then attempts to crush Palpatine with its hand, only for R2 to quickly fly in and save the Chancellor, while the commando is crushed saving him. Gunships arrive and open fire; at Palpatine's orders, they fire flares first to get the Zillo Beast's attention, then when it roars at them, the gunships fire poison gas bombs straight into the monster's mouth. As the gunships continue to bomb the beast, the gas cloud begins to spread, though Anakin, Yoda and Aayla use the Force to protect themselves, Palpatine and Amidala from the gas. As all the Jedi look on in regret, the Zillo Beast, confused, in pain and dying, finally succumbs to the poison and falls from the roof of the Senate to its death below."}, {"tag": "p", "text": "The next morning, the body of the Zillo Beast is carted away. Anakin laments that it was sacrificed for their mistakes. Palpatine promises everyone that he'll make sure that sacrifice was not in vain. As he and the Jedi part ways, Palpatine gives new orders to Dr. Boll: clone the Zillo Beast."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Jedi Temple Archives feature on The Complete Season Two Blu-ray includes the deleted scenes \"Strategy in the Jedi War Room\" and \"Trapped in Palpatine's Shuttle.\""}, {"tag": "p", "text": "The Zillo Beast is deliberately meant to be a parody of the iconic Japanese movie monster Godzilla right down to a similar sounding name and promotional poster."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}