{"url": "The_Wrath_of_Darth_Maul", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends Young Readers"], "nodes": [{"tag": "h1", "text": "The Wrath of Darth Maul"}, {"tag": "p", "text": "The Wrath of Darth Maul is a Star Wars Legends junior novel written by Ryder Windham. It was first published in hardcover by Scholastic on January 1, 2012. It chronicles the origins of Darth Maul and adapts stories from several other titles, such as \"Restraint,\" \"End Game,\" and Star Wars Episode I Journal: Darth Maul."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Forged by rage"}, {"tag": "p", "text": "Taken as a child and trained in the ways of the Sith, he became the apprentice to the greatest evil the galaxy has ever known…."}, {"tag": "p", "text": "Honed by the dark side"}, {"tag": "p", "text": "After years of plotting in secrecy, he and his Master will take revenge on the Jedi Order—and the once-mighty Republic will tremble…."}, {"tag": "p", "text": "The savage story of Darth Maul has been shrouded in mystery—until now."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Wrath of Darth Maul is similar to other biographies written by Ryder Windham: The Rise and Fall of Darth Vader (2007), The Life and Legend of Obi-Wan Kenobi (2008), and A New Hope: The Life of Luke Skywalker (2009). In 2014, the four titles were collected in the digital compendium Star Wars: Lives & Adventures."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The 2012 reference book The Essential Reader's Companion dates the events of The Wrath of Darth Maul to circa 21 BBY, with flashbacks to 51 BBY, 48 BBY, 44 BBY, 41 BBY, 39 BBY, and 32 BBY. It is placed between the novels Republic Commando: True Colors (2007) and MedStar I: Battle Surgeons (2004)."}, {"tag": "p", "text": "The novel adapts scenes from other Darth Maul stories, such as \"Restraint\" (2011), \"End Game\" (2012), and Star Wars Episode I Journal: Darth Maul (2000)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}