{"url": "The_Wraith", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles that are known by a nickname", "Category:Aliases, nicknames, and pseudonyms", "Category:Assassins", "Category:FarStar crewmembers and personnel", "Category:Humans", "Category:Imperial Intelligence personnel", "Category:Males", "Category:Personnel of Moff Sarne's forces", "Category:Saboteurs", "Category:Spies"], "nodes": [{"tag": "h1", "text": "The Wraith"}, {"tag": "p", "text": "\"The Wraith\" was the codename of a Human male who served the Galactic Empire as a spy, assassin, and saboteur during the early years of the New Republic. Around 6 ABY, the Wraith successfully penetrated the New Republic Intelligence Service and caused the collapse of the Archive system, an effort to create a extensive network of intelligence gathering and data collation centers. The officer supervising the creation of the system, Major Breslin Drake, vowed to hunt the Wraith down for his actions, leaving the service of the New Republic to track him. The Wraith escaped into the Kathol sector in the Outer Rim Territories, where he entered the service of Moff Kentor Sarne, the local Imperial warlord. The spy operated as an assassin for the Moff's forces, eliminating Sarne's political enemies with a virulent poison harvested on the primitive planet Sebiris."}, {"tag": "p", "text": "In 8 ABY, after two years in service to Sarne, the Wraith was stranded on the planet Pembric II after the New Republic liberated the sector capital Kal'Shebbol and forced Moff Sarne to retreat into the wilds of the Kathol sector. The Wraith, under the alias Drenn, had been tasked by Sarne to infiltrate the organization of the local crime lord, Crev Bombaasa. Following the fall of Kal'Shebbol, the Wraith deemed his mission unnecessary and sought to rejoin Sarne, but Bombaasa had restricted travel off-planet. He spent several months working alongside Major Drake at the ThrusterBurn Tapcafe—the Wraith as a bouncer, Drake as the manager—after the latter had fallen afoul of Bombaasa during his search for the former. Neither knew of the other's identity or allegiance. The Wraith eventually made his way off Pembric II with the crew of the New Republic CR90 corvette FarStar when he assisted them in liberating a slicer named Gaelin from Bombaasa's clutches."}, {"tag": "p", "text": "Serving as part of the FarStar's technical crew, the Wraith planned to rejoin Sarne by giving the Moff's forces the location of the FarStar while it underwent resupply at the planet Galtea and assassinating the corvette's commanding officer, Captain Kaiya Adrimetrum. The FarStar managed to survive the subsequent ambush, but Adrimetrum was left comatose by the Wraith's poison, with only days to live. Drake suggested that they might find a cure for the poison on Sebiris, as his investigations into the Wraith's activities had led him to the planet where he suspected the Wraith had operated under the alias Klendost Petrivoor. During the expedition to the planet, the Wraith's identiy was compromised when the headman of a Sebiri village recognized him as Petrivoor. He fled the planet in a freighter that he had concealed on the surface sometime prior."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Intergalactic Man of Mystery"}, {"tag": "p", "text": "The Human male codenamed \"the Wraith\" was an undercover agent serving the Galactic Empire during the early years of the New Republic as a spy, saboteur, and assassin. Specialized training and the application of mnemiotic drugs were used to increase the Wraith's comprehension and skills in certain areas, including knowledge of planetary systems, first aid, survival, and security systems. Sometime prior to 6 ABY, the Wraith infiltrated the New Republic Intelligence Service and became aware of the Archive system, a network of intelligence gathering and data collation centers that the New Republic was establishing under the supervision of Major Breslin Drake. The Wraith penetrated one of the hidden Archive stations, which in turn placed all the other stations in jeopardy. The damage done to the system was irreparable, and Drake suspected that the Wraith was behind the breach. The Wraith, for his part, left New Republic space and traveled out to the Kathol sector, where he entered the service of the local Imperial warlord, Moff Kentor Sarne, who had withdrawn the sector from the Empire following the Battle of Endor."}, {"tag": "p", "text": "For two years, the Wraith served the interests of Moff Sarne as an assassin and saboteur. He conducted several political assassinations in the sector, and was always on the lookout for new poisons with which to execute his operations. The Wraith visited the primitive planet Sebiris several times; posing as an individual named \"Klendost Petrivoor,\" the Wraith traded flintlock slugthrowers with the native Sebiri inhabitants of a village in the planet's equatorial region. In return, the Wraith was allowed to harvest a virulent poison from the jungle. The poison decreased the victims' neurotransmitter levels, sending them into a deep coma and killing them after several days on life support."}, {"tag": "h3", "text": "Assassin, Bouncer, Saboteur, Spy"}, {"tag": "p", "text": "Several months prior to the New Republic's successful liberation of the Kathol sector capital, Kal'Shebbol, from Sarne's control in 8 ABY, the Moff's office assigned the Wraith to infiltrate the Bombaasa Cartel criminal organization—headed by the crime lord Crev Bombaasa—on the planet Pembric II. Posing as a native of Pembric II named \"Drenn,\" with familial ties to the planet, the Wraith was hired at Bombaasa's ThrusterBurn Tapcafe as a bouncer, and began working his way up through the organization. When word reached Pembric II that New Republic forces had ousted Sarne from Kal'Shebbol, the Wraith decided that his current mission was no longer relevant and that he needed to leave the planet and rejoin Sarne's forces. However, with the news that Kal'Shebbol was no longer under Sarne's rule, Bombaasa moved against the Imperial authority on Pembric II, purging the loyalists and installing a puppet government that left the planet under his control. Bombaasa also discouraged citizens from leaving the planet by introducing expensive exit passes and transit visas that were required to depart the system. With no access to the necessary resources, the Wraith was effectively trapped on-world. Shortly after Bombaasa took control of the system, Major Drake—who had left the New Republic following the Wraith's infiltration of New Republic Intelligence and had been actively hunting for him for several years—ran afoul of Pembric II's new bureaucratic procedures, losing his cargo and starship. While trying to get off-planet, Drake took a job managing the ThrusterBurn Tapcafe. Neither the Wraith nor Drake were aware of the other's identity while they spent time working together."}, {"tag": "p", "text": "Shortly after the fall of Kal'Shebbol, the New Republic CR90 corvette FarStar arrived in the Pembric system and inserted a covert team posing as illegal arms merchants onto the planet. The FarStar's crew did so in an effort to recruit a slicer by the name of Gaelin to help solve several technical difficulties that the corvette was experiencing. Spang, an engineer at the Tanquilla Beach shadowport, had advised the team to talk with Drake, who he saw as the primary resource for Gaelin's whereabouts. The FarStar team met with Drake in the ThrusterBurn while the Wraith was working, and while conversing with Drake, the New Republic delegation was taken into the tapcafe's rear casino to meet with Bombaasa himself. The crime lord was aware of the mission group's true allegiance, and the meeting escalated into a skirmish between the New Republic team and Bombaasa's bodyguards. Drake stepped in and assisted the New Republic crew, recognizing an emerging opportunity to leave the planet. Sensing the same opportunity, the Wraith—along with three other bouncers loyal to Drake—also helped the FarStar crew, although the spy remained at the periphery of the action. After helping the team to make a getaway from the ThrusterBurn, Drake revealed that Gaelin was being held prisoner by Bombaasa due to his technical expertise. He struck a deal to assist the New Republic in liberating Gaelin from Bombaasa's clutches in exchange for travel off-world for himself and his bouncers, including the Wraith."}, {"tag": "p", "text": "Splitting their combined numbers, one team including Drake successfully liberated Gaelin from his prison in a warehouse on the edge of the spaceport, while the other team retrieved their Aegis-class combat shuttle, which Bombaasa's Pembric Security Legion had impounded. The shuttle team landed the ship on the warehouse roof, extracting the warehouse team with Gaelin and returning to the FarStar."}, {"tag": "h3", "text": "The Man With The Poison Gun"}, {"tag": "p", "text": "On board the FarStar, the Wraith began planning a method to sabotage the vessel and then rejoin Sarne's forces. To assist Sarne, he arranged to join one of the corvette's maintenance crews to allow him access to the ship's systems while he came up with a plan to accomplish his goals. Shortly after leaving Pembric II, the FarStar put down on the planet Galtea for much-needed repairs, resupply, and shore leave. The Wraith took advantage of the situation and gained access to a transmitter, sending a coded message to one of Sarne's roving fleets. He transmitted the FarStar's current location and state of readiness, along with his intention to sabotage the vessel and assassinate Captain Kaiya Adrimetrum, the FarStar's commanding officer. As part of his plan to kill the captain, the Wraith subverted one of the K4 security droids that guarded the bridge, altering its command codes to take orders from him and installing a miniature dart gun, loaded with a dart coated in the poison that he had acquired from Sebiris, into a recessed cavity. Using his access to the bridge as a member of the maintenance teams, he installed a shaped charge—partially constructed from a thermal detonator—near a power conduit close to the captain's station which could be detonated with a burst transmission from an encrypted comlink. The resulting explosion was intended to both hinder the FarStar's response against the Imperial attack, as it would disrupt the power to the bridge, as well as cover the K4 security droid's assassination attempt."}, {"tag": "p", "text": "At dawn the next day, the Imperial fleet that the Wrath had contacted arrived. The FarStar launched to meet the incoming fleet in battle, fighting a holding action until a hyperspace jump could be plotted, as they were outnumbered three-to-one. During the battle, the Wraith slipped onto the bridge and detonated the shaped charge, cutting power to the command systems. At the same time, the K4 security droid fired the poison dart at Adrimetrum; the captain's subsequent collapse appeared to be the result of the power conduit explosion. Despite the Wraith's intentions, the crew managed to restore power to the bridge and withdraw from the engagement, jumping to a binary system several hours' travel from Galtea. Adrimetrum, in a coma from the poison-coated dart, was taken to the sick bay, where Doctor Akanseh found that her injuries were inconsistent with her condition. He could find no cause for her state, and was puzzled when she did not respond to bacta therapy."}, {"tag": "h3", "text": "Our Man Wraith"}, {"tag": "p", "text": "Lieutenant Jessa Dajus, the FarStar's Imperial tactical advisor, recalled that several of the Moff's political enemies had suffered similar maladies to the captain, and had all died within a few days. Dajus had come by the information as she had previously served under Sarne as an Imperial Intelligence colonel, and not a shuttle pilot as she claimed. Security Officer Kl'aal organized an investigation looking for evidence of foul play and sabotage; flight recorder logs provided by the K4 security droid on the bridge showed that the explosion near Adrimetrum's station did not coincide with a weapon hit, and that the log itself was missing two seconds from the droid's memory. While watching the recording, Adrimetrum was shown to absently swat at her neck just prior to the explosion. Further checks showed that the impact came from the position of the K4, and that the droid's memory buffers had been tampered with. Pieces of a thermal detonator and burned circuitry were also found in the vicinity of the destroyed power conduit. The evidence gathered by the investigation helped the medical staff to discover a puncture wound in Adrimetrum's neck and the presence of the poison in the captain's system that was decreasing her neurotransmitter activity. Aware of the development, Drake shared his suspicions of the Wraith being the individual responsible for eliminating the Moff's enemies, and his connection to the planet Sebiris, suggesting that they visit the world in search of a cure. He made his personal logs available to the crew, and the Wraith not only became aware that he was actively being hunted, but also that the man he had worked with on Pembric II had been tracking him for years."}, {"tag": "p", "text": "A mission to Sebiris was organized, with the Wraith volunteering to be part of the large, well-armed party. The group landed near the village that the Wraith had visited previously in order to acquire his poison, and lit a large fire in the clearing near their shuttle. Soon, five Sebiri—four hunters and the village headman—approached them and, after the headman made it clear that the aliens were not hostile, escorted the landing party to the village."}, {"tag": "p", "text": "The landing party relayed their captain's condition to the headman, who informed them that a cure could be found in the herbs growing near the stone temple not far from the village, which the Sebiri considered sacred ground. Although the headman was initially adamant that the landing party would not be allowed near the structure, the application of gifts including exotic foods changed his mind. He personally lead the party with twelve escorts to the sacred mound, where he gathered the herbs and presented them to the landing party. As this was occurring, the Wraith was in conversation with one of the hunters when the headman referred to him as \"Petrivoor,\" the alias under which Drake knew the Wraith operated. The Wraith, suddenly realizing that his cover had been exposed, immediately drew his blaster rifle and began firing. However, he did not aim for the New Republic crew or the Sebiri; rather, his shots struck the stone temple. Enraged at the desecration of the holy ground, the Sebiri began to howl. The Wraith shot the nearest Sebiri hunter, then took off into the jungle. Moving through the undergrowth with several Sebiri hunters in pursuit, the Wraith managed to reach the freighter that he had previously stashed on the planet. Launching into orbit, he made the jump to lightspeed before the FarStar—whose landing party extradited themselves from the situation and returned to the ship with the cure for Adrimetrum—could respond."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Wraith stood 1.5 meters tall, and had light brown hair. During his time posing as Drenn, he wore his hair long and free, coupled with a lengthy beard. A skilled undercover operative, the Wraith infiltrated both the New Republic Intelligence Service and a secure New Republic facility, and even posed as a native of Pembric II well enough to fool the actual indigenous residents. A ruthless assassin, he thought nothing of killing those whom he was ordered to eliminate, and favored using poisons to make their deaths look accidental. Had he been aware of Drake's identity and mission to hunt him, the Wraith would have killed him at the first available opportunity. Adaptable and resourceful, the Wraith traded with primitive species to acquire a virulent poison, and was able to create complex and technical plans—such as planning the assault on the FarStar and the concurrent attempt on Adrimetrum's life—with little notice and limited resources. He also possessed the foresight to hide a spacecraft on Sebiris in case he needed a fast getaway from the planet."}, {"tag": "p", "text": "Trained by the Empire, the Wraith was proficient in combat with expertise in both melee and unarmed combat, and thrown weapons. He was also skilled in the use of blasters, including blaster artillery and vehicle-mounted weapons, grenades, and projectile firearms. The Wraith could build a shaped charge for demolition work using a thermal detonator rigged to be triggered by a comlink signal. He was physically fit, able to run through a dense jungle on Sebiris while fending off the Sebiri who were native to the world. Technically adept, the Wraith was skilled in repairing ground vehicles, walkers, and computers, and he was able to program the latter as well. In addition, he was knowledgeable enough about droids to be able to reprogram a K4 security droid, altering its memory and implanting it with hidden protocols. Driving ground, hover, and repulsorlift vehicles was part of the Wraith's skill set, as was riding swoop bikes and domesticated animals and operating walkers. He was capable of flying starfighters, space transports, and capital ships—including navigating them through hyperspace—and operating the weapons and shield systems of the latter."}, {"tag": "p", "text": "The Wraith was knowledgeable about alien species and cultures, law enforcement protocols, and bureaucratic procedure, with an emphasis of the inner workings of the Imperial Military. A master spy, he could bargain or con his way to achieve his objectives, was a skilled forger, and could operate communications equipment. Through the use of mnemiotic drugs and specialized training, the Wraith had several skills artificiality enhanced. An example was his knowledge of planetary systems, as was his aptitude for survival. Operation of security equipment and application of first aid were also two of the Wraith's skills that were not naturally learned. While traveling with the crew of the FarStar, the Wraith armed himself with a heavy blaster pistol, and carried a comlink, droid toolkit, and a datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wraith first appeared in the fifth adventure of The DarkStryder Campaign, a roleplaying game supplement released by West End Games in 1995. Entitled Crisis, the Wraith is introduced as \"Drenn,\" a bouncer working at the ThrusterBurn Tapcafe. His role as an Imperial spy is briefly touched on in Breslin Drake's roleplaying capsule, and the adventure specifically states that he will play a major part in the following adventure, Traitor in our Midst. In that adventure, the gamemaster is directed to ensure that the Wraith, along with Drake, escapes Pembric II to join the crew of the FarStar. Traitor in our Midst assumes that both the Wraith and Drake are present aboard the FarStar, and details the Wraith's backstory and his connection to Drake. The spy acts as the main antagonist of the adventure, as everything the characters have to deal with is directly caused by him. Both adventures were written by Eric S. Trautmann and Paul Sudlow, and the Wraith's image in Traitor in our Midst was provided by Philip Tan."}, {"tag": "p", "text": "During Crisis, the Wraith is described as remaining on the edge of the action, and will follow Drake's lead. When devising a plan to liberate Gaelin, the gamemaster can use Drake to suggest splitting the team to cover the two main objectives—securing Gaelin and retrieving their impounded shuttle—if the players do not think of it. The adventure assumes that both objectives are implemented simultaneously, and this article reflects that assumption. However, it makes no assumption as to which mission in which the Wraith is involved. At the end of Traitor in our Midst, if the players have trouble communicating with the Sebiri, then the characters will have to try to find the herbs needed for the antidote without a guide. In the scenario, the gamemaster is instructed to skip the section where the Sebiri headman reveals that he knows the Wraith as Petrivoor and proceed straight to the battle sequence where the Wraith opens fire on the sacred stone temple. However, as that section proceeds with the assumption that the Wraith's identity has been compromised, and that the FarStar party headed into the jungle with a guide, this article assumes that the landing party was able to successfully communicate with the Sebiri."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}