{"url": "Battle_of_Orinda", "categories": ["Category:Legends articles", "Category:Battles in the Mid Rim", "Category:Battles of the Orinda campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Orinda"}, {"tag": "p", "text": "The Battle of Orinda was fought late in the Galactic Civil War about eight years after the Battle of Endor and seven months after the resignation of Admiral Daala."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the Imperial Starfleet, led by the Executor-class Star Dreadnought Reaper, under the command of Fleet Admiral Gilad Pellaeon, had successfully captured several of the New Republic planets in the Orinda campaign; the New Republic attempted a counterattack at Orinda, one of the planets captured by the Imperial Remnant one month earlier."}, {"tag": "p", "text": "A fleet under General Wedge Antilles and his flagship, the Executor-class Star Dreadnought Lusankya, was dispatched to Orinda to face off against the fleet of Pellaeon."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Battle of Orinda was one of the few known events where Executor-class Star Dreadnoughts fought one another."}, {"tag": "p", "text": "The turn of the battle in favor of the Remnant came with the arrival of another Star Dreadnought, the Dominion, commanded by Admiral Teren Rogriss, and six Immobilizer 418 cruisers. Between them and the Reaper they rapidly destroyed the New Republic fleet carrier Endurance with all starfighters aboard after her captain had held the starfighters in reserve for as long as possible. Antilles was prepared to order an abandon ship until his own fighters were able to push a hole in the Interdictor screen and allow Lusankya's retreat under heavy fire. No further attempt was made to recover Orinda from the Remnant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the victory, Orinda became the temporary headquarters of Admiral Gilad Pellaeon. The New Republic chose to leave Orinda in Imperial hands and instead fortified surrounding systems. The Battle of Orinda was one of the last Imperial victories against the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}