{"url": "Theelin/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Human and Near-Human species", "Category:Sentient species", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Theelin"}, {"tag": "p", "text": "The Theelin were a species of Near-Humans notable for their artistic talent, their colorful appearance, and their unfortunate and tragic history."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The original appearance of the Theelin is officially uncertain, as almost all known \"Theelin\" were not full-blooded specimens, but hybrids. It is possible that some aspects of these individuals' appearances were not from their Theelin genes, but from other Human or Near-Human ancestors; the differences could also be related to the very mutations that were plaguing the species. Most, however, had vividly colored hair and pale skin, sometimes with purple or reddish tones, and often mottled with colorful spots."}, {"tag": "p", "text": "While the half-Human, half-Theelin outlaw tech Shug Ninx had seemingly humanoid feet but three-fingered hands, other beings of Theelin blood had human-like five-fingered hands. Similarly, Rystáll Sant, a Human/Theelin hybrid who was part of the Max Rebo Band, had six small horns on the sides of her head, these were absent from other known Theelin, except Diva Arroquitas, Latts Razzi, and Darth Phobos. Sant also had reptile-like feet with thick nails on all sides, an attribute she shared with Diva Shaliqua and Phobos, while Razzi had feet with three forward-facing toes."}, {"tag": "h3", "text": "Mutation"}, {"tag": "p", "text": "Unfortunately for the Theelin, a series of mutations arose among their species during the last years of the Galactic Republic. These mutations led to genetic incompatibilities within their species, making it impossible to produce offspring. Even attempts to continue their species by cross-breeding with Humans and other Near-Humans could not stop the Theelin slide towards extinction, due to the high infant mortality rates such couplings suffered from. They inevitably dwindled in number—only a few million Theelin and part-Theelin remained by the time the Republic fell, and pure Theelin were presumed extinct by 10 ABY. Some of their greatest works were produced in these years, however, as an epitaph for a dying people."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Galactic Empire frowned upon Theelin of mixed blood, labeling them with derogatory names like \"half-breed\". Shug Ninx was turned away from Imperial service due to this prejudice."}, {"tag": "p", "text": "Theelin performers and artists created many of the Galactic Republic's greatest works of art. The Theelin Divas, an all-female religious order, were recognized by many scholars of music as the greatest singers in the galaxy."}, {"tag": "p", "text": "Because of the rarity of the Theelin, many female Theelin and part-Theelin were named \"Diva\" at birth, in hopes that they would develop the musical talent necessary to continue the traditions of the Diva order. Their rarity also led a Hutt named Ingoda to collect Theelin and part-Theelin slaves. Diva Funquita and the half-Human Diva Shaliqua were two of his slaves."}, {"tag": "p", "text": "Many Theelins were noticeable for their sense of fashion, having mixed their hair into various extravagant hairstyles. For instance, Darth Phobos made her blue hair styled so it resembled a mane, and wore a skin-tight top and purple dress made of a strange, organic-looking cloth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Theelin is misspelled \"Threelin\" in The Essential Guide to Characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}