{"url": "Theed/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Capital cities", "Category:Cities on Naboo", "Category:Galactic Empire cities", "Category:Galactic Republic cities", "Category:Theed locations", "Category:Trade Federation cities"], "nodes": [{"tag": "h1", "text": "Theed"}, {"tag": "p", "text": "Theed was the capital city of Naboo, a planet located in the galaxy's Mid Rim. Originally a farming village, the city was formally founded circa 832 BBY when King Jafan established the city as the planetary capital after uniting the planet's numerous city-states following a long civil war. Located on a sheer cliff over a vast floodplain, the city was home to the Royal House of Naboo's Royal Palace and the Royal House of Learning."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding"}, {"tag": "p", "text": "The city of Theed began as a farming village, established by the local Naboo along the fertile banks of the Solleu River. The area, criss-crossed by the river's many tributaries, was suitable to permanent construction and quickly grew in numbers. When King Jafan unified Naboo's many warring city-states, he established his capital on the steppelands, which by that time had been densely populated by settlers who had fled the bloody civil war Jafan had ended."}, {"tag": "p", "text": "As a result of Jafan's unification and the strict planning regimes and extensive rebuilding projects undertaken after the upheavals, the city took on a unified and harmonious architectural style of sandstone-like block buildings with green shingles on the roofs. A series of underground tunnels were built in the city's porous surface, all of which were meticulously maintained for generations. The sophisticated culture which emerged was suitable to the cultivation of politicians and statesmen, all of whom trained and studied the art of politics and public service in the city's many fine universities."}, {"tag": "h3", "text": "Elected monarchy"}, {"tag": "p", "text": "Following a long reign by a hereditary dynasty, the Monarch of Naboo became an elected official, and the world prospered. Theed had lost all vestiges of its simple past and instead bred generations of a leisure class which enhanced the city's arts and education, erecting monuments to rulers and philosophers, building museums and concert halls, and implementing policy to ensure all citizens would serve in the Legislative Youth Program during their years in academia. The city's governor was afforded the Prince or Princess of Theed."}, {"tag": "p", "text": "During the reign of King Bon Tapalo, Naboo entered a trade agreement with the Trade Federation and Damask Holdings, which changed Theed forever. A triple-domed Plasma Refinery Complex was erected on former parkland, and the Solleu was rerouted to accommodate its footprint. The Federation began mining the plasma out of the city land, bringing in substantial profits that helped the city expand. In 32 BBY, friction between the Federation and Queen Padmé Amidala culminated in an invasion of the planet and the placement of the city's population in POW camps. A Neimoidian Throne was constructed in the city as a sign of the occupation. When the Queen led her people to victory, she immediately began reconstruction efforts, seeing the completion of the massive Theed Spaceport and the Palace Courtyard before the end of her term."}, {"tag": "p", "text": "As the Separatist Crisis began to take hold in the Galactic Senate, the beloved former queen was appointed Senator of the Chommell sector. During this time, Queen Jamillia opened the city to refugees fleeing secessionist worlds that began joining the Confederacy of Independent Systems. As the world's populace became more restless, protests by disgruntled spice miners began to disrupt local life. When the Clone Wars erupted between the Galactic Republic and the Confederacy, Naboo managed to avoid the violence of the war, and Theed remained standing. In 21 BBY, Chancellor Palpatine returned to the city for the annual Festival of Light. He was the victim of a kidnapping attempt, although he was rescued by Anakin Skywalker."}, {"tag": "h3", "text": "Imperial era"}, {"tag": "p", "text": "The Clone Wars ended abruptly in 19 BBY, and the citizens of Naboo were shocked when Alderaan's senator Bail Organa arrived in Theed with the body of the beloved Senator Amidala. Apparently Amidala had been killed by a Jedi Knight during the Jedi Order's uprising against the Republic, but the story was simply a fabrication by Naboo native Supreme Chancellor Palpatine. After the funeral of the former queen, self-declared Emperor Palpatine of the newly formed Galactic Empire kept heavy scrutiny on Queen Apailana."}, {"tag": "p", "text": "Not long after the Empire rose to power, a battle erupted in the city when the Royal Naboo Security Forces and several Gungans attacked the newly built Imperial garrison in the city, bent on stopping Grand Inquisitor Malorum from learning the secret of the birth of Amidala's twins, Luke and Leia Skywalker. Ultimately, ex-Jedi Ferus Olin confronted Malorum and killed him in Theed's Plasma Refinery Complex, resulting in the retreat and destruction of the Imperial squadron. Afterwards the Theed Hangar, being used by the Imperials to store illegal explosives, was destroyed by Olin; consequently, Naboo escaped serious punishment by the Empire, which didn't wish to draw attention to the fact that they were breaking the law."}, {"tag": "p", "text": "The Empire did not stay quiet, though. As evidence emerged that Apailana had opened Theed to Jedi survivors, an Imperial assault led by the 501st Legion stormed the city intent on eliminating Queen Apailana and the several fugitive Jedi her court had been harboring. The stormtroopers swiftly occupied the city and slew the Queen and her Jedi protectors. To ensure that the next monarch would toe the line, the Empire installed Kylantha as the next queen and promoted the loyal Quarsh Panaka to Moff. Because Naboo was Palpatine's homeworld, and Theed in particular the Emperor's hometown, it also heavily celebrated Empire Day, during which the Imperial Executor, Darth Vader, frequently visited the city to give a speech about the founding of the Empire as well as present medals to Imperial officers. In addition, Imperial military parades occurred on the streets of the city for the holiday with statues of Palpatine being raised. After the Battle of Yavin, Theed was victim of a terrorist attack committed by the Mummers."}, {"tag": "p", "text": "Theed remained the capital of Naboo even during the Galactic Civil War, and was wrested from Imperial control after the Battle of Endor in 4 ABY by citizens tired of Imperial control. A game which originated in the city, called Theed quoits, was still played in 41 ABY by Grand Admiral Gilad Pellaeon of the Imperial Remnant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Theed's exotic appearance is drawn from Venice, Tulln, the Byzantine architecture of Greek churches, Istanbul, with its \"suave melody of gentle forms,\" and the sprawling horizontals of Frank Lloyd Wright's Marin County Civic Center, which is also the source of Theed's color.[source?]"}, {"tag": "p", "text": "Shots of Theed in the updated version of Star Wars: Episode VI Return of the Jedi are edited versions of shots used in Star Wars: Episode I The Phantom Menace. However, rather than re-filming the scene within the CGI models, they simply flipped the frames used earlier. The result is that the city of Theed in Episode VI is a mirrored version of that in Episode I. Shots of Theed in Star Wars: Episode III Revenge of the Sith also display the mirrored version of the city."}, {"tag": "p", "text": "A large building labeled \"University\" in Inside the Worlds of Star Wars: Episode I, published in October 2000, is labeled \"Hospital\" on a map printed in 2001's Secrets of Naboo."}, {"tag": "p", "text": "Theed is recorded in Seville, Spain in Attack of the Clones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}