{"url": "Battle_of_Orinda_(13_ABY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of the Imperial Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Orinda  (13 ABY)"}, {"tag": "p", "text": "The fourth battle of Orinda occurred during the Galactic Civil War between the Imperial Remnant and a dissident Imperial faction of hardliners, the Restored Empire, for the control of the Imperial capital Orinda and thus gain control over the Remnant."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 13 ABY, Feena D'Asta represented the Imperial Remnant during negotiations with the New Republic. The negotiations were interruped when they were attacked by stormtroopers of a the Restored Empire and D'Asta was killed during the ambush. Shocked by the death of Feena D'Asta and suspecting a New Republic betrayal, Admiral Gilad Pellaeon ordered the Imperial Navy to attack the Republic in retaliation, letting the Imperial capital Orinda insufficiently defended. Warlord Ennix Devian planned to attack the planet in order to kill Pellaeon and claim the title of Supreme Commander of the Empire."}, {"tag": "p", "text": "Meanwhile, Kir Kanos was reintroduced to Baron Ragez D'Asta and Feena D'Asta's clone. The baron's plan was to position his fleet behind the moons of Orinda in wait for the imminent hardliner strike, and to convince Devian that Feena survived the assassination \"attempt\" by bringing him face-to-face with her clone."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Restored Empire fleet entered the Orinda system and attacked the planet. This ancient but massive fleet was able to destroy the small defense fleet and Devian's ground forces landed on the planet. Devian and his stormtroopers entered the Imperial headquarters and eliminated most resistance. Zam Basdor revealed his treachery but he was personally shot in the head by Admiral Pellaeon. Pellaeon and his last troopers were surrending when Kanos, Mirith Sinn, Feena's clone, her \"father\" arrived in the base."}, {"tag": "p", "text": "After the reveal of the Feena clone to Devian and the mobilization of the dormant D'Astan fleet hidden in the system, a massive firefight erupted, killing General Vota and most of Devian's stormtroopers."}, {"tag": "p", "text": "Kanos pursued Devian to his shuttle, where he announced his intent to destroy the hardliner cause once and for all. Although Kanos managed to sever the warlord's weapon in the ensuing duel, Devian eventually gained the upper hand, bisecting Kanos's weapon and piercing him in the chest with his vibro-blade. Critically injured, Kanos used whatever strength he had left to overpower Devian and skewer him vertically through the left shoulder, putting an end to the hardliner plot."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although Kanos was critically injured by Devian's attack, he survived long enough for Mirith Sinn to transport him to one of Baron D'Asta's hidden safehouses in the D'Astan sector. Believing Kanos to be dying, Sinn said her goodbyes and returned to the galactic capital, speaking before the Chief of State, Leia Organa Solo, to posthumously pardon Kanos of his charges against the New Republic. She was unaware that Kanos had, in fact, been nursed back to health by D'Asta and his daughter and was living with them for several months."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}