{"url": "Battle_of_Orto_Plutonia/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Battles in the Sujimis sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Orto Plutonia"}, {"tag": "p", "text": "The Battle of Orto Plutonia took place on the planet Orto Plutonia in 22 BBY during the Clone Wars. Sometime during the war, the Galactic Republic built Glid Station on the planet to watch for any surprise Separatist invasions around the Pantora system. Due to the amount of military activity on the planet, Orto Plutonia's only indigenous species, the Talz, attacked the base, killing the clone troopers stationed there, and also assaulted the nearby Confederate base. High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker were dispatched to investigate the loss of contact with the base, and they subsequently discovered the Talz, whose presence on the planet had not yet been recorded. After meeting with the Talz's leader, Thi-Sen, the Jedi sought to establish a peaceful agreement between the Republic and the Talz, but Chi Cho, Chairman of the Pantoran Assembly, instead declared war on the planet's natives in an attempt to remove them from the planet."}, {"tag": "p", "text": "While the two Jedi remained near Glid Station with Pantoran Senator Riyo Chuchi to speak with the Pantoran Assembly and officially resolve the conflict, Clone Captain Rex and a group of clone troopers were tasked with protecting Cho from the Talz. After the Talz ambushed Cho and the clones, Cho became injured when a Talz threw a spear at him. Despite this, Rex fled the area with the other clones, bringing the incapacitated Cho along on his BARC speeder. Thi-Sen and the Talz pursued Rex and his team and trapped the clone troopers at a dead-end cliff overlooking a canyon, but Kenobi, Skywalker, and Chuchi landed at the battle site and halted the Talz's attack. To settle the conflict between the Pantorans and the Talz, Chuchi met with Thi-Sen, establishing an agreement that allowed the Talz to live in peace on the planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY, the Galactic Republic built Glid Station on the Pantoran world of Orto Plutonia to halt invasions around the Pantora system. Nearby, the Confederacy of Independent Systems maintained a base as well. As a result of the Republic and Confederate activity on the planet, the native Talz species became aggravated. The Talz attacked Glid Station and killed the clone cold assault troopers stationed there, though they did not only attack the Republic base; the nearby Confederate base became abandoned after the Talz besieged it as well. After losing contact with Glid Station, the Jedi High Council dispatched Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, as well as a group of clone troopers, to Orto Plutonia to investigate the loss of communication within the base. The two Jedi were accompanied to the planet by two Pantoran politicians—Riyo Chuchi, a senator representing the Pantoran moon of Pantora, and Chi Cho, the Chairman of the Pantoran Assembly."}, {"tag": "p", "text": "Upon landing on the planet's surface aboard an LAAT/i gunship, Kenobi and Skywalker met with Cho and Chuchi near Glid Station. Entering the station, Kenobi and Cho noticed the frozen corpses of clone troopers scattered around the command center of the base, and though Cho concluded that the Confederacy had attacked the base, Kenobi denied this upon seeing that the clones' helmets had been impaled upon spears driven into the floor. After Clone Captain CT-7567, nicknamed \"Rex,\" told Kenobi that his scouts had found a Confederate base nearby, Kenobi, Skywalker, Rex, and a group of clones went to the base, only to find it abandoned. Noticing destroyed battle droid heads on spears in a similar fashion to the clone helmets at Glid Station, Kenobi concluded that whoever had attacked the Republic base had assaulted the Separatist base as well. Inside the Separatist base, the two Jedi and Rex turned on a holoprojector to watch recorded logs to find out what had attacked the base. When one of the recorded logs revealed that a team of droids had been investigating the planet's southern canyon, Kenobi and Skywalker decided to investigate it and came across a Talz camp there. Meeting with Medcha Wanto, the scribe to the Talz's leader, Thi-Sen, the two Jedi were escorted into Thi-Sen's hut. Unable to communicate with the Talz, as the Talz could not speak or understand Basic, Skywalker drew a picture depicting two individuals shaking hands as a sign for peace. Thi-Sen understood what Skywalker was trying to say, and agreed to a meeting to discuss peace with the Republic."}, {"tag": "p", "text": "Returning to Glid Station, Kenobi and Skywalker told Cho and Chuchi of the Talz's presence on the planet, and that they wanted peace. While Cho insisted they should attack the Talz, the two Jedi told him they had organized a meeting with the leader of the Talz. Cho agreed to go with the two Jedi to the Talz, and soon the group left the station aboard Freeco bikes and BARC speeders to rendezvous with Thi-Sen near the abandoned Confederate base. Kenobi and Skywalker then entered the base with Cho and Chuchi and met with Thi-Sen. With the assistance of protocol droid C-3PO, Cho spoke to Thi-Sen and declared war on the Talz in an attempt to oust them from Orto Plutonia, despite Thi-Sen's desire for peace. When Cho ordered Rex and his men to mount up and follow him, Rex questioned the Chairman's order to Skywalker, and the Jedi Knight told the Captain that he and his men had to protect the Chairman. As Cho, Rex, and his men boarded separate Freeco bikes and BARC speeders, Kenobi and Skywalker remained with Chuchi. Upset about Cho's decision, both Jedi asked Chuchi if someone could override the Chairman's decision to fight the Talz. After Chuchi revealed that the Pantoran Assembly could do so, they boarded a gunship and returned to Glid Station to make contact with the Pantoran government."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The group led by Cho rode on their separate vehicles until they came into contact with three Talz warriors riding on narglatch mounts in a canyon. When they were in range, Cho ordered Rex and the other clones to open fire, and though Rex cited that the clones were only there to protect him, they were forced into battle when more Talz warriors appeared out of the snow, ambushing the group. The Talz began to attack Cho's team and killed a few clones in the process. When Rex was forced to dismount from his Freeco bike after colliding with a narglatch-mounted Talz, Cho followed Rex's lead and alighted from his vehicle. On Rex's order, the clones parked their vehicles around Rex, forming a protective circle for them to fight the Talz. However, Thi-Sen and other Talz warriors began to throw spears at Cho's group from their positions along the canyon. Even though Cho was being protected by his two Pantoran Guard members, a Talz warrior soon jumped over the clones' vehicle barricade and killed a guard with his spear. Before the warrior had the chance to kill Cho, however, the Chairman's other guard shot the Talz warrior."}, {"tag": "p", "text": "Thi-Sen's men continued to throw spears at the Republic group, and Thi-Sen soon sent a group of Talz warriors on narglatch mounts to finish off the struggling Republic group. Rex shot and killed a few ambushing Talz with his hand blaster, but he was unable to eliminate them all. He ordered Cho and his men to retreat, and although Cho denied the order, his last guard was soon killed, and the chairman himself was injured from a spear. A nearby Talz warrior attempted to toss another spear at the chairman, but the attack was stopped by Rex, who rammed the warrior with a BARC speeder. The clone captain placed the injured Cho on his speeder and departed the area, leading his men away from the battlefield. Noticing their retreat, Thi-Sen ordered his men to pursue the fleeing Republic group. Meanwhile, back at Glid Station, Kenobi, Skywalker, and Chuchi made contact with the Pantoran Assembly aboard an LAAT/i gunship. Through a hologram transmission, a representative of the Assembly told them that Cho's actions were out of order, and that Chuchi was to negotiate peace between the Talz and Pantorans. With the decision made, their gunship, along with three others, left the station to rendezvous with Cho and the clone troopers."}, {"tag": "p", "text": "As Rex and his clone group proceeded through the canyon, Thi-Sen's Talz warriors, who were riding their narglatch mounts, ambushed the Republic group, utilizing wooden clubs to knock various clones off their BARC speeders. Soon, the Republic group left the canyon and headed toward an ice bridge. The Talz continued to chase after Rex and his men and tossed spears at them from a distance. As both groups approached the ice bridge, the span itself collapsed, killing two clones and eliminating the Republic group's chance of escape. Rex and the remainder of his team immediately dismounted from their BARC speeders, and as the line of Talz on narglatch mounts approached the Republic group, Rex ordered his men to organize a defense of their position. The clones began to fire their blasters at the Talz and took out several of Thi-Sen's warriors."}, {"tag": "p", "text": "Before Thi-Sen and his men reached the clones, however, the Jedi's LAAT/i gunships approached the battle site and landed near Rex. Noticing the gunships, Thi-Sen's group halted their attack. Disembarking from their gunship, Kenobi, Skywalker, and Chuchi approached Rex, who reported their casualties to Skywalker: eleven of his men were dead and the rest had been injured, including Cho. After learning from Chuchi that she was to negotiate peace between the Talz and Pantorans, the disbelieving Cho died from his injuries. With C-3PO, Chuchi walked up to the Talz, who remained on their mounts. Slamming a spear to the ground as a sign for peace, Chuchi, using 3PO as a translator, spoke with Thi-Sen, who agreed to settle the conflict and placed his spear on the ground as well. Before departing, Chuchi transferred to Thi-Sen and his people the rights to Orto Plutonia, where they could live in peace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the peaceful resolution of the battle, Thi-Sen and his Talz soldiers departed. Both Kenobi and Skywalker congratulated Chuchi on her success in ending the conflict between the Pantorans and the Talz. Along with the clones, they boarded the LAAT/i gunships and left the site of the battle. After the battle, Confederate forces wished to eliminate the Talz who had destroyed their original base. In order to stop the Confederacy, Skywalker led a squadron of starfighters to destroy the Confederate XT Beetle Transports on the planet. Sometime after his death, Cho's title of Chairman of the Pantoran Assembly was given to the Pantoran Baron Notluwiski Papanoida."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Orto Plutonia was featured in \"Trespass,\" the fifteenth episode of the Star Wars: The Clone Wars television series' first season, which aired on January 30, 2009. Later in the same year, the battle was mentioned in author Jason Fry's Star Wars: The Clone Wars: Visual Guide Ultimate Battles and Star Wars: The Clone Wars – The Official Episode Guide: Season 1. It also received a brief mention in The Essential Atlas, which was co-authored by Fry and Daniel Wallace. In addition to featuring the Talz species, \"Trespass\" introduced two new characters to the series—Pantoran Chairman Chi Cho and Senator Riyo Chuchi. The battle additionally introduced the CK-6 swoop bike, also known as the \"Freeco bike.\" Cho, Chuchi, and the Freeco bike were subsequently given Databank entries on StarWars.com. The battle received its official \"Battle of Orto Plutonia\" name in a Hasbro set as part of the Star Wars: The Clone Wars toy line."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}