{"url": "Theen_Fida", "categories": ["Category:Legends articles", "Category:Anx", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Theen Fida"}, {"tag": "p", "text": "Theen Fida was a male Anx Jedi Padawan who served the Jedi Order and the Galactic Republic in the final decades of the Republic Classic era. The apprentice of Jedi Master Tsui Choi, Padawan Fida was killed during the Yinchorri Uprising of 33 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Anx, Theen Fida entered into the Jedi Order and was trained in the ways of the Force at the Coruscant Jedi Temple. Selected by the diminutive Jedi Master Tsui Choi to become his Padawan, Theen Fida constructed a orange-bladed lightsaber under his master's tutelage and learned much of the Force. When peculiar activity erupted in the Yinchorri system, the Master-Padawan team volunteered to travel to the planet Yitheeth to find the rumored Yinchorri command center."}, {"tag": "p", "text": "Alongside his master and Jedi High Council members Adi Gallia and Eeth Koth, Fida survived the crash of their diplomatic cruiser after it was shot down over the watery world of Yitheeth. Swimming to shore, the Jedi commandeered a wavespeeder to enter the capital city in search of the command center. Determining that it was not on the world, the group rendezvoused with Master of the Order, Mace Windu on the planet Yinchorr and led an extraction mission to rescue the other Jedi trapped there. While defending their transport Padawan Fida, along with Jedi Knight Lilit Twoseas, was struck down by the Yinchorri and died of an injury sustained to his abdomen. When the surviving Jedi made it to the cruiser, Fida's master carried his corpse aboard and it was transported back to the Coruscant Temple where it would be cremated per Jedi tradition."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}