{"url": "Theed_Royal_Palace/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Palaces", "Category:Theed Royal Palace locations"], "nodes": [{"tag": "h1", "text": "Theed Royal Palace"}, {"tag": "p", "text": "The Theed Royal Palace of the Royal House of Naboo was a magnificent edifice located on the edge of a cliff in the planet's capital city, Theed. Serving as the residence of the planetary monarch and the nerve center of the government, the ancient palace stood through the Galactic Republic's collapse and the birth of the New Republic several decades later."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the unification of Naboo circa 832 BBY, the city of Theed was established by settlers fleeing a revolution on their own planet. Led by King Jafan, the people erected a palace on the cliff side to serve as the seat of their new planet-wide government. During King Jafan's reign, the monarch began a tradition that each consecutive ruler would follow, adding a new building to the massive structure. Jafan's addition a massive tower containing the Turret Room and a small temple would be a place for future monarchs to pay homage to the past leaders of Naboo."}, {"tag": "p", "text": "In 65 BBY, King Bon Tapalo occupied the palace and was known for throwing raucous parties and indulging in nefarious business deals within the palace walls; he erected a tower alongside the palace in accordance with Jafan's tradition. One such meeting occurred deep within the central building, in a banquet hall set to receive the Muuns of the InterGalactic Banking Clan and Magister Hego Damask of Damask Holdings. The Muuns pitched a scheme to exploit the plasma rich planet and export the refined substance out of the star system in exchange for funding Tapalo's reelection campaign. Ultimately the deal was struck and Naboo ascended to the greater galactic plasma industry."}, {"tag": "p", "text": "In a similar fashion, King Ars Veruna continued to welcome corrupt guests into the palace, such as Black Sun Underlord Alexi Garyn and Gardulla the Hutt and her Bando Gora guards. During his reign, Veruna established an extensive library in a rear tower in hopes of garnering favor with his constituents.[source?] When the Naboo became disenchanted with Veruna's handling of the worsening relationship with the Trade Federation, the king was forced to abdicate and Padmé Amidala was elected as his successor. Bringing in reform, Queen Amidala scarcely ruled before the Trade Federation invaded the planet and forced the Queen to flee."}, {"tag": "p", "text": "As Federation Viceroy Nute Gunray took up residence in the palace in 32 BBY following his successful capture of Theed, Queen Amidala was returning to Naboo with two members of the Jedi Order to put an end to the occupation. Escorted by members of the Royal Naboo Security Forces and Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, Amidala forced her way into the main hangar alongside the Plasma Refinery Complex. From the hangar, Amidala and her soldiers were able to reach the base of the palace, using a little-known route to gain access to the spacious, ceremonial halls. Reaching the central tower, the queen and her escort use their ascension guns to scale the palace walls, avoiding the bulk of the Federation army patrolling the halls. As the group descended to the throne room level, the battle droids of the Trade Federation outnumbered them, and the Naboo were disarmed and escorted inside. Defenseless and seemingly at the mercy of Viceroy Gunray the arrival of Amidala's decoy, Sabé, turned the tide of the palace battle. Amidala was able to arm herself with pistol's concealed in the throne and her men made short work of the battle droids that remained in the room. With the Viceroy detained and after the destruction of the Federation's Droid Control Ship and their army of droids, the battle to retake the planet was over."}, {"tag": "p", "text": "In the days following the end of the occupation, the Republic shuttle Perpetuus arrived in Palace Plaza carrying several members of the Jedi High Council and recently elected Supreme Chancellor Palpatine. The Neimoidian of the Trade Federation were escorted out of the Palace and placed under Republic authority and transported off-world. The members of the High Council were quartered in the Turret Room during the week surrounding the funeral for Master Jinn, who had been slain during the fighting. A parade celebrating the unity between the Naboo and the Gungan societies was held in Palace Plaza at this time, at which time the Queen gave the Gungan leader, Boss Rugor Nass, the Globe of Peace."}, {"tag": "p", "text": "In the wake of destruction that had plagued Naboo, Amidala finished out her reign as Queen and was replaced by Jamillia in 25 BBY. Taking up residence in the palace, the complex remained in use through the reigns of Queens Neeyutnee and Apailana; both of whom ruled during the Clone Wars. When the war ended abruptly and the Republic was replaced with the Galactic Empire, Senator Bail Prestor Organa of Alderaan arrived at the palace with the body of Naboo's former queen and senator, Padmé Amidala. Amidala's body was carried out of the palace during a grand funeral procession attended by all of Theed and countless of the politician's friends and colleagues from across the galaxy."}, {"tag": "p", "text": "As the Empire tightened its grip on Naboo, Queen Apailana was discovered to be sheltering fugitives of the Empire, namely members of the now-outlawed Jedi Order. Sending down legions of stormtroopers to enforce martial law on the city, the Empire seized the palace and killed the queen. Installing the loyal Queen Kylantha in the palace, Naboo remained within the Empire for the duration of the Emperor's reign. When word of Palpatine's death reached the palace in 4 ABY, throngs of Naboo and Gungans swarmed Palace Plaza and the Palace in rebellion against the local Imperial garrison. Taking the palace and routing the Imperials, the Naboo went on to gain independence from the Empire shortly thereafter."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Exterior"}, {"tag": "p", "text": "The Royal Palace of Theed was a massive complex of sandstone-like blocks formed into towers and rotundas with cupolas covered in green tile. The largest structure in the city, it was the home of the planetary government and the destination of foreign diplomats and ambassadors. A central drum-shaped structure took up the majority of the complex, with a taller, narrower tower being the tallest point. Erected on a cliff face, the palace had several watch towers on the rocky face, placed to detect a rear attack from the valley below. Additions to the palace during each new administration was traditional and a way for the new monarch to curry favor with their constituents."}, {"tag": "p", "text": "The palace was surrounded by a vast garden complex. A pool in the garden was capable of being drained; it had a control for a nearby bridge. A security gate required a passcode for entrance and exit into the garden. A secret passage led through the garden to the Theed Hangar."}, {"tag": "h3", "text": "Interior"}, {"tag": "p", "text": "Filled with vast, cavernous corridors crafted by Naboo's own artisans, the Royal Palace was a showcase of the great sculptors and craftsmen of the planet. The main entrance to the complex was located at the terminus of Palace Plaza, a broad promenade which was crowned at the opposite end by the Palace Courtyard, erected in the aftermath of the Trade Federation invasion in 32 BBY. The Triumphal Arch stood halfway between the fountain-filled courtyard and the steps of the palace, which were lined with towering statues of famed philosophers who helped shape the constitution of Naboo's government."}, {"tag": "p", "text": "Within one of the lower rotundas near to the entrance was the nerve center of politics on Naboo; the throne room of the planet's monarch, a vaulted chamber with tall windows. The throne rested behind the desk of office with several chairs around which to accommodate members of the court. The throne was made not only for comfort, to reflect the calm serenity maintained on the planet, but also for function. Control panels on the armrests monitored incoming transmissions and several holdout pistols were kept securely in reach. Further back within the palace was the audience chamber of the Royal Advisory Council, a body of noblemen and women from the city who advised the monarch on social issues as well as more mundane aspects of politics."}, {"tag": "p", "text": "During the palace's early years, King Jafan began the tradition of expanding the original structure. Establishing a square turret on the rear of the palace, he included a temple to past rulers and a lavish residence hall to house dignitaries from off-world. Following the tradition, King Ars Veruna constructed a massive library during his reign over the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The interior scenes in The Phantom Menace and Attack of the Clones were shot in the Caserta Palace near Naples."}, {"tag": "p", "text": "The exterior design was directly inspired by the Marin County Civic Center in San Rafael, California which was designed by Frank Lloyd Wright. The building features round designs set into the hillside with characteristic blue domed roofs. Scenes from THX-1138 and Gattaca were also filmed there."}, {"tag": "p", "text": "In the video game Star Wars: Episode I Jedi Power Battles, Theed Palace and the Theed Palace hangar are directly connected by a spiral stairwell that leads off the Throne Room, contradicting several other sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}