{"url": "Theed_Spaceport/Legends", "categories": ["Category:Legends articles", "Category:Spaceports", "Category:Theed locations"], "nodes": [{"tag": "h1", "text": "Theed Spaceport"}, {"tag": "p", "text": "The Theed Spaceport was the primary spaceport servicing the planet Naboo and its plasma-exporting industry based in Theed. Major expansion of the spaceport began circa 65 BBY when the Royal House of Naboo entered into a trade agreement with the Trade Federation. These major additions saw completion following the Federation's invasion of the planet in 32 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Theed Spaceport, erected sometime after the city of Theed's founding circa 832 BBY, was located at the base of the massive cliffs atop which was built the Royal Palace. Able to service the relatively isolated planet with ease, the spaceport was targeted for expansion in 65 BBY when investors from the InterGalactic Banking Clan arrived on Naboo to aid in the reelection campaign of Bon Tapalo. Magister Hego Damask proposed that the spaceport be expanded by Outer Rim Construction and Assembly through funding by the Trade Federation. Despite initial hesitance, King Tapalo relented and approved of Damask's plan and the spaceport began to be expanded."}, {"tag": "p", "text": "Construction of the spaceport was slow over the decades, beginning near the Royal Palace and expanding along the ridge until it stretched to just underneath the Plasma Refinery Complex sometime after the 32 BBY invasion of the planet. Funding for the final expansion of the spaceport came from reparations paid by the Trade Federation after Viceroy Nute Gunray's illegal blockade."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Designed and constructed by Outer Rim Construction and Assembly, the spaceport at Theed was proposed to the Naboo by Damask Holdings and funded by the Trade Federation. In keeping with Naboo aesthetics the spaceport, located in the lowland floodplains at the foot of the massive cliff atop which Theed was built, would adhere to the natural curve of the cliffs. The spaceport platform's sweeping curves also took into account the flowing waters of the Virdugo Plunge, which were allowed to flow straight down past the spaceport through a large opening at the center of the platform; the waters were then rerouted underground after running through powerful, energy-creating turbines concealed in the platform."}, {"tag": "p", "text": "The spaceport was primarily a utilitarian spaceport dock, with a two-tier platform allowing for a variety of vessels to land - from YT-1300 light freighters and Action VI transports to large AA-9 Coruscant freighters and CR90 corvettes. Administrative buildings were located on the Palace-side of the platform adjacent to the air traffic control building. Aside the Virdugo Plunge was the rotunda which served as the main terminal building and the platform's power generator was directly below and connected with the Plasma Refinery Complex above. Stretching like cris-crossing fingers from the platform were several approach lanes that covered areas of reclaimed land. From the second level of the platform, multiple docking piers were erected to accommodate boarding rams from the many space liners that docked at the spaceport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Theed Spaceport first appeared in Star Wars: Episode II Attack of the Clones in 2002."}, {"tag": "p", "text": "According to the book: The Art of Star Wars Episode II: Attack of the Clones, the spaceport was originally envisioned as \"a destination for immigrants from throughout the galaxy\", including (as the original script detailed) an entire civilization of a dead world after their system's sun had imploded. However, it's not possible that the civilians would have been identified as Shadda-Bi-Borans, mainly because the species had become extinct many years ago."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}