{"url": "Battle_of_Orion_IV", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Tion Hegemony", "Category:Battles of Operation Strike Fear"], "nodes": [{"tag": "h1", "text": "Battle of Orion IV"}, {"tag": "p", "text": "The Battle of Orion IV took place during Operation Strike Fear early on in the Galactic Civil War."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As part of this operation the Rebel Alliance base on Orion IV was the third objective in the Sector."}, {"tag": "p", "text": "The procedure was to blockade the planet and then perform orbital bombardment against the planetary shield before the final overwhelming assault of the rebel installations by Imperial ground forces decimating all resistance."}, {"tag": "p", "text": "Several rebel pilots stationed on the base were captured during the battle, some newly acquired R-22 Spearheads were used for the base defense, but not in enough numbers to have had any influence on the outcome of the battle."}, {"tag": "p", "text": "The battle was one of the earliest known appearance of the Alpha-class Xg-1 Star Wings and the first Imperial-era AT-AT walkers (before their upgrade)."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Orion IV is seen in a cutscene of the game Star Wars: X-Wing, which also shows AT-ATs advancing. However according to the (by 5 years) later game Star Wars: Galactic Battlegrounds, AT-AT walkers were introduced to the Empire by Maximilian Veers only shortly before the Battle of Hoth, and clearly after the Battle of Yavin. In 2006, Star Wars: Empire at War showed Veers testing AT-ATs before the Battle of Yavin."}, {"tag": "p", "text": "Since Veers conducted tests of an experimental AT-AT model in Galactic Battlegrounds, these can be rationalized as earlier, pre-Veers models."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}