{"url": "Battle_of_Ossus_(Great_Sith_War)", "categories": ["Category:Legends articles", "Category:Articles with unconfirmed titles", "Category:Battles of Ossus", "Category:Battles of the Krath Holy Crusade during the Great Sith War", "Category:Duels", "Category:Evacuations", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Battle of Ossus  (Great Sith War)"}, {"tag": "p", "text": "The Battle of Ossus took place in the year 3996 BBY during the Great Sith War, and was one of the last major battles to be fought during that conflict. With Aleema Keto's destruction of the Cron Cluster through the use of Sith magic, an enormous supernova was on a direct course for the Jedi library world of Ossus. With the knowledge that the Sith-created supernova would force the Jedi to evacuate Ossus, the Sith Lords Exar Kun and Ulic Qel-Droma led an attack against the Jedi planet, intent on capturing the vast amount of Force knowledge and tomes that had been collected there over the millennia. Armed with a number of Mandalorian warriors, as well as their army of Krath soldiers, Qel-Droma and Kun stormed Ossus, taking advantage of the confusion and chaos surrounding the devastation headed for the planet."}, {"tag": "p", "text": "Following their initial invasion, both Sith Lords were involved with various skirmishes, until Ulic was confronted by his brother Cay, who was attempting to turn Ulic back to the light side. The two brothers eventually battled, and the resulting fight saw the death of Cay Qel-Droma at the hands of Ulic. Nomi Sunrider, devastated by having witnessed the death of Cay, managed to use her powers to strip Ulic from the Force. Finally realizing how he had allowed the dark side to manipulate him, Ulic repented and offered to lead the Jedi to Kun's hidden fortress on the jungle moon of Yavin 4."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Kemplex IX, a sabotaged ancient Sith device used to manipulate matter within the cores of stars caused the detonation of the nearby Cron Cluster stellar group, triggering a massive supernova shockwave in whose direct path lay the Jedi scholar world of Ossus."}, {"tag": "p", "text": "A large-scale planetary evacuation was called, with military, civilian, and Jedi personnel alike struggling to escape the planet before the nova-wave arrived. The Jedi Masters planet-side began a rescue operation focused upon salvaging as many relics, manuscripts, and other antiquities as possible from the enclave while there still was time. This would, in part, prove to be too tempting an opportunity for Exar Kun to pass up. Linking up with fellow Sith Lord Ulic Qel-Droma and reinforcements of Mandalorian and Massassi warriors, and redirecting Lord Mandalore the Indomitable's main battle group to Onderon, Kun launched a raid upon Ossus itself, intent on capturing the vast quantities of Jedi knowledge stored there."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "With the evacuation already reaching critical levels, the Sith and Mandalorian ships converged upon the planet, targeting numerous civilian and military transport craft and engaging the Jedi defenses long enough for Kun to slip beneath the screens and land in the enclave. Among his first targets of choice was the residence of Master Ood Bnar, himself attempting to preserve a cache of antique Jedi lightsabers from the oncoming destruction. Engaging Kun and his Massassi, Master Bnar realized that his true skills lay not in combat, but in the powers of the Force. Drawing upon it, the Neti Jedi Master sealed the cache, metamorphosing into a great tree and thwarting the incredulous Dark Lord. He would remain planted there until awakened during Luke Skywalker and Kam Solusar's mission to Ossus in 10 ABY."}, {"tag": "p", "text": "Not far afield, the Cathar Jedi Sylvar assaulted Kun near his ship, seeking revenge for her mate Crado's death at Kemplex IX, but was beaten by his elite Massassi guard."}, {"tag": "p", "text": "Meanwhile, Cay Qel-Droma sensed his brother Ulic's presence amongst the battling orbital and sub-orbital ships, and took the Nebulon Ranger to the skies in an effort to sway Ulic back to the light. Shot down by Mandalorian ships during the melée, Cay was forced to crash-land in the city, where the two brothers confronted each other for the very last time. Attempting to reason with him, Cay only succeeded in provoking Ulic's temper—the dark side surging within him, Ulic instigated a violent lightsaber duel, shearing off his younger brother's mechanical arm. Pleading with him, Cay tried to reach through to the Jedi deep beneath Ulic…but in one final surge of anger, Ulic slew his brother where he knelt."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a final act of punishment and retribution, Nomi Sunrider imprisoned Ulic beneath a wall of light side Force-energy. Ulic was forever cut off from the Force and captured by the Republic, thereby becoming the last casualty of the battle. The stage would now be set for the final showdown with Exar Kun at Yavin IV."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ossus first appeared in the issue The Sith War 5: Brother Against Brother of the Tales of the Jedi series of comics. The battle was conceived and written by author Kevin J. Anderson, and was drawn by artist Dario Carrasco, Jr. The cover art for Brother Against Brother, which featured a dueling Ulic and Cay Qel-Droma, was created by Hugh Fleming, a veteran Tales of the Jedi artist."}, {"tag": "p", "text": "Anderson used the Battle of Ossus to bring an end to Ulic Qel-Droma's reign as a Sith Lord, and continue the chain of events, begun during the writing of the Battle of Kemplex IX, which would see the fall of Exar Kun and the end of the Great Sith War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}