{"url": "Battle_of_Otavon_XII", "categories": ["Category:Legends articles", "Category:Battles of the early Imperial campaigns", "Category:Battles of the Great Jedi Purge", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Battle of Otavon XII"}, {"tag": "p", "text": "The Battle of Otavon XII was a skirmish which took place in 19 BBY and involved the Sith Lord Darth Vader. During the battle, Lord Vader supervised the construction of AT-AT's on Tremor Base, located on the planet of Otavon XII. At the start of the battle, the Ovoni rebels attacked the base and the stormtrooper soldiers present there. Vader then made his appearance and killed all of the Ovoni rebels present. After that, he spoke with the commander in charge of the mission, Crik, who was speaking with Vader about the schedule of the construction of the AT-ATs on the Tremor Base. Shortly after that brief conversation, a severely wounded clone soldier of the Empire came from the forest, saying that the Ovoni rebels had a Jedi Force with them. When Vader received that information he inmediately began a search for the Jedi present on the planet, although Crik didn't like the idea at all. Vader traveled through the planet's jungle in search of the Jedi, and he first encountered the Padawan Dendro who was with four Ovoni rebels. After Vader killed the four rebels, he dueled the Padawan and quickly killed him. When Vader finished that short duel, he found a native creature of the planet, a Sugati, who was in attack position, but before it could harm Vader, he discovered that it was weak-minded, and fooled it with a mind trick. After that he traveled over to a mount, where the Dendro's Master was hiding. When Vader found the Jedi, the two had a brief conversation, before fighting in a duel. In the fight, Vader cut off the Jedi's lightsaber, the Jedi responding by releasing a second blade. However, Vader then ignited a second blade too, the Dendro's lightsaber, to kill the Jedi Master behind the whole Ovoni operation, who, before dying, revealed his name: Hylon. Vader then returned to base, and found that it had been destroyed by Ovoni rebels and that the Jedis were just a merely distraction for him. Soon after the Emperor arrived and ordered Vader to stay and meditate on his failure there. The Empire later covered up the event and used footage of it for propaganda broadcasts."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 19 BBY, on the remote world of Otavon XII, the Sith Lord Darth Vader was assigned by Emperor Palpatine to protect an AT-AT manufacturing facility from anti-Imperial natives. The planet was chosen as a sufficient location for the construction of AT-AT walkers, an operation that was maintained in secrecy from the galaxy at large. During one attempt by Ovoni rebels to destroy the facility, they were taken by surprise by Darth Vader, who killed many of them while forcing the rest to retreat and hide within the jungle."}, {"tag": "p", "text": "Shortly after the Ovonis' failed assault, General Crik shared his worries about endless insurgent attacks with Vader, but the Dark Lord dismissed the general's fears and commanded him to focus on finishing the production of numerous AT-AT Walkers. At that moment, a wounded stormtrooper emerged from the forest and reported that the Ovoni had Jedi amongst them. Vader, ever intent on killing the remaining Jedi that survived Order 66, wasted no time in embarking into the jungle."}, {"tag": "h2", "text": "Discovery of the Jedi presence"}, {"tag": "p", "text": "A short time later, Vader discovered Jedi presence on the planet, and traveled across the jungle in search of the Jedi. He first surprised the Padawan Dendro and a group of rebels away from the base, when he killed the Ovoni rebels, he dueled with the Jedi Padawan Dendro, who Vader killed moments after the duel began. After that brief duel, he encountered a Sugati, a native creature of the planet, who was about to kill Vader, until he realized that those beasts were weak-minded, and easy to fool; for that Vader performed a mind trick to deceive the beast. After he traveled past that creature, he arrived at the location of Dendro's Jedi Master, on Mount Dijandi. Once Vader stepped onto the mountain, he had a brief conversation with the Jedi Master, which resulted in a duel. During the fight Vader managed to destroy the lightsaber of the Jedi, who in turn released another blade, but Vader countered this by releasing another lightsaber, belonging to the now deceased Padawan of the Jedi Master. Ironically, the Jedi was killed by the weapon of his own Padawan. Before Vader killed the Jedi Master, he revealed his name: Hylon, the man behind the entire Ovoni operation. After the duel, Vader traveled by foot across the jungle of the planet, until he arrived at Tremon Base."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "However, when he arrived back to the AT-AT plant, he found that the Ovoni had used Sugati to destroy the base, and that the Jedi Dendro and Hylon had merely been distracting him, sacrificing their own lives, allowing the Ovoni warriors to destroy the base, causing Vader to fail in his mission. Shortly after, the Emperor arrived at Tremor Base with two of his Royal Guards in a Theta-class shuttle. When he saw the disastrous outcome of the battle, he punished Vader by leaving him there on the planet to meditate on his failure."}, {"tag": "p", "text": "Despite the Sith Lord's failure, the Empire covered up the event and used footage of the battle for propaganda broadcasts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first appearance of the Battle of Otavon XII, including the Ovoni and the Sugati, was in the Jedi Purge comic series, Star Wars: Purge: The Hidden Blade, released on April 7 of 2010, written by W. Haden Blackman and pencilled by Chris Scalf. It is unknown what happened to Commander Crik in the aftermath of the battle, as the casualties of the battle were never mentioned in the comic, allowing for the possibility of the death of the commander."}, {"tag": "p", "text": "The Battle of Otavon XII made a brief appearance in the comic Dark Times—Fire Carrier 1, but the name of the planet was misspelled as Ovaton VII."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}