{"url": "Battle_of_Otoh_Sancture", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles of the War of the Gungan Tribes"], "nodes": [{"tag": "h1", "text": "Battle of Otoh Sancture"}, {"tag": "p", "text": "The Battle of Otoh Sancture was fought on Naboo between the Militiagungs under the command of Boss Gallo and bursas under the influence of Boss Rogoe. For some time, the War of the Gungan tribes had been raging, but Gallo had refused to take sides. Not willing to wait and see just who his fellow Boss would side with, Rogoe decided to have Gallo killed, and to accomplish that goal, he ordered the destruction of Otoh Sancture, Gallo's home city."}, {"tag": "p", "text": "Gallo was able to escape, and incensed, he established a new Otoh Sancture and raised an army. Marching with his forces, he slaughtered the bursas that had destroyed his city and destroyed their nests. In the aftermath of the battle, Gallo united with the rogue Captain Marsune, and together the pair united the other Gungan tribes against Rogoe, who was eventually killed at the Raid on Spearhead."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the planet Naboo's War of the Gungan tribes, Boss Gallo of Otoh Sancture was the only Boss to remain neutral, as he refused to take up arms against his fellow Gungans. Gallo's power was considerable, however, and the other Bosses became concerned about just who the neutral party would ally themselves with. Boss Rogoe of Spearhead, believed dead by the rest of the Gungan community, decided that it would be prudent to eliminate Gallo before he had the chance to align himself, and so he ordered the death of his fellow Boss."}, {"tag": "p", "text": "On the day of Otoh Sancture's Sacred Feast, Rogoe had his men dispatch wild bursas to attack the defenseless city. As per tradition, Gallo had ventured forth from the settlement to gather food for the Sacred Feast, and as a result, he was not present when the bursas attacked. The creatures left no building standing nor any civilian alive in their wake, turning Otoh Sancture into a desolate wasteland."}, {"tag": "h3", "text": "Gallo's flight"}, {"tag": "p", "text": "In horror, Gallo, mounted on his kaadu, fled the scene with the five nerfs he had gathered in tow. As he ventured through the swamps, he realized that he would need to revive his city somehow. On his journey, he was stopped by the rogue Captain Marsune, and his band of militiagungs. Gallo requested aid, but the captain refused, although he did give the Boss four glurrgs in exchange for the nerfs. Continuing through the swamp with his new acquisitions, Gallo spotted several militiagungs from Spearhead shepherding wild bursas. Conversing with the militiagungs, he discovered that it was Rogoe, alive and well, who had ordered the attack on Otoh Sancture."}, {"tag": "p", "text": "Outraged, Gallo resolved to wreak revenge on Rogoe for the massacre and told the Spearhead militiagungs of his intent before continuing on with his glurrgs. Coming to a resource-rich clearing near some old ruins, Gallo decided that he would rebuild Otoh Sancture in memory of his dead people. As he did so, he raised an army of his militiagungs and prepared a counterattack against the bursa herd."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Astride his kaadu, staff in hand, Boss Gallo marched with his newly raised army through the swamps toward the former location of Otoh Sancture. Crossing a river, they encountered several bursas, which they fought and killed. The path to the ruins of Otoh Sancture was blocked by several of the bursas' nests, and so Gallo and his militiagungs set about razing the makeshift structures. Once they got through, they were met with heavy resistance from the bursas. Eventually, they were able to slaughter all of the animals before demolishing the remainder of the herd's nests."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As soon as the final bursa nest was destroyed, Captain Marsune arrived at the site and pledged his allegiance to Gallo. Spurred on by the victory against the bursas, Gallo and Marsune were able to unite the various other Bosses, namely Copek, Tenko, Hantic, and Hoxie, against Rogoe, during the Battle of the Forest Cities. As a result, the War of the Gungan tribes entered its final phase, as the united Bosses routed Rogoe's militiagungs at the decisive Raid on Spearhead, which also resulted in Rogoe's death and the founding of Otoh Gunga on the ruins of Spearhead. Some three thousand years later, the Battle of Otoh Sancture and the events surrounding it were chronicled by Boss Rugor Nass, a distant descendant of Gallo's."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Otoh Sancture made its first and only appearance in the computer game Star Wars: Galactic Battlegrounds, which was published in 2001. It was, however, indirectly conceived by George Lucas, who, when outlining the origins of the Gungan people, stated that they had raised and maintained an army due to a past conflict with \"bear-like creatures.\" For the canceled The Essential Guide to Episode I, author Daniel Wallace had intended to identify the creatures as \"bursas,\" but as the book was not published, the information was not canon. It was later picked up by the creators of Galactic Battlegrounds, who featured it in the game's Gungan campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}