{"url": "There_is_Another", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "There is Another"}, {"tag": "p", "text": "\"There is Another\" is a short story in the anthology From a Certain Point of View. The story, written by Gary D. Schmidt, focuses on the point of view of Yoda."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Following the rescue of Princess Leia, the fugitive Jedi Master Yoda steps out of his hut on Dagobah and walks down to the lowlands where he intends to plant some seeds. During his walk, Yoda senses Obi-Wan Kenobi dueling Darth Vader aboard the Death Star. Yoda then senses the presence of a probe droid through the Force. Using a small pot that Kenobi had given him, Yoda destroys the droid by hurling the pot through its bulbous eye, causing the droid to self-destruct and explode. As Yoda inspects the charred remains of the pot, he feels Obi-Wan growing strong and then entering the netherworld of the Force."}, {"tag": "p", "text": "Yoda also senses Anakin falling even deeper into loneliness. With the death of Obi-Wan, Yoda senses that the galaxy is rapidly becoming emptier and emptier. Yoda is then menaced by two more probe droids. Yoda uses the Force to summon lightning and destroy the droids. In the process, one of the flaming droids crashes into his sack, causing it to burst into flames. Yoda manages to retrieve Qui-Gon Jinn's cloak, which he has fashioned as a blanket. Yoda spends the rest of the day burying the droids and then sowing the seeds in the lowland."}, {"tag": "p", "text": "For the next several days, Yoda struggles against loneliness while tending to the seed he has planted. Frustrated at the lack of growth, Yoda replants them. Feeling alone, Yoda reaches out across the netherworld of the Force for Qui-Gonn Jinn. Instead, he is visited by Kenobi who manifests in the form of a force spirit. Kenobi asks about his pot and Yoda tells him there was an encounter. Kenobi remarks that it was not such a difficult encounter since Yoda was able to preserve Qui-Gon's cloak."}, {"tag": "p", "text": "Telling Yoda that difficult choices have to be made, Kenobi informs Yoda that he believes it is time for Yoda to train a new apprentice, a young Skywalker. Yoda jumps at the chance, believing that Kenobi is referring to Leia, not Luke. Once Kenobi clarifies that he is referring to Luke, not Leia, Yoda is far more hesitant. He refuses to train Luke, asserting that Luke does not have the temperament necessary to be a Jedi whereas Leia is ready. Refusing to train Luke, Yoda tucks himself into bed, telling Kenobi that the time has come for him to die and join the Force. Convincing Yoda that it is not his time to die, Kenobi urges him once more to train Luke. Finally, reluctantly, Yoda gives in."}, {"tag": "p", "text": "Before Kenobi departs from the hut, Yoda apologizes to him for losing the piece of pottery that Kenobi had given him. Kenobi says it was alright, telling Yoda that the pot had been old and ugly. Yoda argues that he himself is old and ugly, but before departing Kenobi tells him that he is a \"luminous being.\" With that, Kenobi's spirit departs. Pulling up Qui-Gon Jinn's cloak around him, Yoda settles into bed for sleep, cautiously optimistic about training Luke."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}