{"url": "Therefore_I_Am:_The_Tale_of_IG-88", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Tales of the Bounty Hunters"], "nodes": [{"tag": "h1", "text": "Therefore I Am: The Tale of IG-88"}, {"tag": "p", "text": "\"Therefore I Am: The Tale of IG-88\" is a short story written by Kevin J. Anderson and featured in Tales of the Bounty Hunters, which was published in December 1996 by Bantam Spectra. It concerns the backstory of the droid bounty hunter IG-88 as well as its identical counterparts and their efforts to begin a galaxy-wide droid revolution, starting a few years before the events of A New Hope, and ending during the Battle of Endor."}, {"tag": "p", "text": "The title is a reference to Descartes's philosophical proof of existence, \"Cogito, ergo sum,\" or \"I think, therefore I am,\" which features prominently in IG-88's acquisition of sentient artificial intelligence."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The IG Series Prototype Project was the visualization of Imperial Supervisor Gurdun to manufacture the ultimate assassin droid. The IG-88 prototype was activated at the Holowan Laboratories sometime prior to the year of 15 BBY.[source?] Due to the sentient programming of one of the particular assassin droids, it immediately developed a sense of independence. After dispatching the laboratory personnel, IG-88A infused his programming into three identical counterparts. Along with the brief help of an older IG unit, IG-72, the four quickly escaped the laboratories, commandeered a starship, and made liftoff. Traveling to Mechis III, they developed a stratagem to seize command over the galaxy."}, {"tag": "p", "text": "From orbit, the four assassins reprogrammed the droids on the planet surface, ordering them to depose the human caretakers of the droid-manufacturing installation. From here they would begin their quest for galactic domination. To all outward appearances, the administration of Mechis III remained the same, operations continued and orders were filled. The only difference was, the droids being shipped were programmed to efface all biological species when the order was given."}, {"tag": "p", "text": "After Gurdun issued a \"dismantle on sight\" order, IG-88B was sent out to divert attention from the base on Mechis III. Accepting a bounty to capture Han Solo, IG-88 found himself on the Super Star Destroyer Executor. While there, he downloaded the ship's computer files, discovering the construction plans for the new Death Star. A new objective presented itself to the foursome: take control of the Imperial space station. After planting microtrackers on the ships of the other bounty hunters, IG-88B returned to base."}, {"tag": "p", "text": "While the assassin droids proceeded with their plans, information was brought to them that another bounty hunter, Boba Fett, had tracked the smuggler to Bespin. The B model was once again sent out to retrieve its bounty. Shortly after arrival in Cloud City, IG-88B was destroyed by Fett, who ultimately captured Solo, frozen in carbonite. IG-88C and IG-88D were dispatched to exact revenge for IG-88B, while the A version continued the scheme to procure the computer core of the Death Star II. C and D met their demise over the sands of Tatooine at the hands of Boba Fett, and on Ord Mantell at the hands of Dash Rendar, respectively."}, {"tag": "p", "text": "IG-88A did obtain the computer core of the Death Star and assimilated himself into its programming. The realization of their goal was short-lived, however, as the space station was destroyed by the Rebel fleet at the Battle of Endor, in 4 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}