{"url": "Theoretical_Serias_species", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified sentient species", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Theoretical Serias species"}, {"tag": "p", "text": "New Republic scout Korren Starchaser led an expedition to the Serianan system that uncovered evidence of an advanced sentient species. Starchaser found several bits of evidence for the species's existence: the planet Serias, which was located in the same star system, was inhabited, and the Serianan Belt contained runes in various sizes that, due to the asteroids' density, suggested that they had been created by beings with access to tools that required more power to operate than anything known to Starchaser's team. Starchaser also discovered five alien statues. The scout guessed that the creators of these artifacts were humanoids but not Humans. The team gathered the statues, logged the runes, and departed to analyze their data. Afterward, a team of alien xenoarchaeologists discovered the Serianan system's mysteries and began their own analysis. A followup visit by the New Republic Scout Service discovered the independent scientists as well as prospectors who sought to exploit the asteroids. A later group of spacers was kidnapped by pirates and brought to a base that resembled one of the Serianan statues."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "After scout Korren Starchaser, a member of the New Republic Scout Service, uncovered evidence of a sentient species in the Serianan system, he and his team analyzed the artifacts left behind by these beings to ascertain details about their creators. Based on the size of runes discovered within a large cavern in the Serianan Belt of asteroids, Starchaser surmised that their makers were humanoids but non-Human, and in fact quite different from Humans."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The runes discovered by the New Republic scouts suggested that their makers were spacefaring beings with advanced technology. Some of the runes were as large as several scout ships placed end to end, and others were only visible to certain sensors, which indicated that their creators had access to construction methods unknown to the galaxy during the time of the New Republic. Similarly, the mineral content of the asteroids was incredibly dense, which made it difficult to carve; that fact led Starchaser to suggest that the species's tools required far greater energy output than anything known to his team."}, {"tag": "p", "text": "The makers of the Serianan runes also created statues of alien buildings with domes, stairways, and doors. The sculptures were constructed from the same minerals as the asteroids, but the density of the statues was lower than the surrounding rock, a fact that allowed an average humanoid to lift one with ease. The statues were 0.5 meters tall and one meter wide; they were rust orange in color and completely opaque. The five examples discovered by the New Republic team resisted attempts to scan them to determine whether they were hollow. A sixth sculpture was in the possession of pirates who inhabited a nearby base shaped like one of the statues. The statues joined to form a ring of about two meters in width."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "New Republic scout Korren Starchaser led a team to the Serianan system. There, his team discovered that the planet Serias, a terrestrial world, was inhabited. However, the team also found runes carved into the sides of the asteroids that made up the Serianan Belt. The team devoted the remainder of the expedition to cataloging the runes and exploring a large cavern in one of the asteroids, which the team named the Gulch. In the depression, they found more runes as well as five stone statues sheltered in a niche in the rock. The team collected the statues and copied down the runes for further analysis. Starchaser decided to keep the expedition under wraps and to avoid contact with the inhabitants of Serias until he could bring the artifacts and writing to the attention of Maxina Sensis, a xenoarchaeologist who worked at Daxis Outpost in the Jandolhoon system. By following that procedure, Starchaser hoped to prevent the Serianan system and its inhabitants from being exploited by outsiders."}, {"tag": "p", "text": "Nevertheless, word reached Starchaser that his find had been leaked. That led to fear that Imperial remnant factions might claim the find. Meanwhile, after initial analysis of the Serianan artifacts, Sensis advocated sending another expedition to gather more data. In the interim, a group of independent, non-Human archaeologists arrived at the Serianan system and investigated the runes there. They made considerable progress into deciphering the writing and the history of its creation, as well as the relationship between the runes and the statues. However, the newcomers' procedures were not as secretive of those of the New Republic scouts, and prospectors learned of the asteroids and came to exploit them."}, {"tag": "p", "text": "The New Republic Scout Service dispatched another group to follow up on the earlier research in the Gulch. There, they encountered the non-Human team of scientists. The two factions allied with one another to keep the interloping prospectors from the find and to share data."}, {"tag": "p", "text": "Later, a group of spacers traveled to the Serianan system to search for the missing alien statue at the behest of their patron. En route, they were stopped and kidnapped by pirates, who brought them to their hidden base. The structure resembled a massive replica of one of the Serianan sculptures. The captives investigated the connection between the pirates, the statues, and their creators. They also found the missing Serianan statue, stole it, escaped, and brought the statue back to their patron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The details surrounding the discovery of the Serianan runes and statues are detailed in the article \"Scouts' Dispatch,\" which was published in Star Wars Adventure Journal 8 in November 1995. The article, written by Peter Woodworth, consists of an in-universe report from New Republic scout Korren Starchaser. The piece fails to establish the veracity of Starchaser's suppositions about the makers of the runes and statues he discovers. The Adventure Journal issue includes two adventure seeds for gamemasters of Star Wars: The Roleplaying Game to use; this article assumes the scenarios play out as described."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}