{"url": "Ther-das", "categories": ["Category:Legends articles", "Category:Arcona", "Category:Duelists", "Category:Males", "Category:Zulirian Swordmasters members"], "nodes": [{"tag": "h1", "text": "Ther-das"}, {"tag": "p", "text": "Ther-das was an Arcona weapons expert and the leader of the Zulirian Swordmasters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native of Cona, Ther-das studied ancient weaponry in the Lerct Historical Institute. However, during his second year of study, he became a salt addict. He was expelled from Lerct and placed in a recovery program."}, {"tag": "h3", "text": "Wrestling with addiction"}, {"tag": "p", "text": "Ther-das then traveled to Zuliria and joined the ancient weapon department of the Zuliria Museum of Antiquities. In a few years, he managed to exorcise his addiction through hard and tenacious work, although two almost-overdoses of sodium weakened his body."}, {"tag": "p", "text": "He was promoted to the post of acquisition director of the Zuliria Museum, obtaining excellent pieces from all over the galaxy for the Museum. At the same time, he was re-accepted on Lerct and eventually got his degree on ancient weapons one year ahead of his own schedule."}, {"tag": "h3", "text": "Changing occupation"}, {"tag": "p", "text": "However, Ther-das became bored with his studies and acquisitions, and tried to get a more active role on his passion. He practiced fencing with facsimiles of ancient Arcona weaponry and then cleaned his body of any last residue of his previous addiction."}, {"tag": "p", "text": "Meeting some people with similar interests, Ther-das and his new associates decided to create the Zulirian Swordmasters, an organization of ancient blade-lovers. He met mute Curdik in Zuliria and, noticing his remarkable skill, offered him a membership. He also met religious scholar Kaltor Naklian, an expert in the traditional rantok blade of his people, and convinced him to join the team as well."}, {"tag": "h3", "text": "Recruiting"}, {"tag": "p", "text": "Ther-Das also met Togorian master smith Mlatar Thon Gra, who had traveled to Zuliria looking for his missing mate. Ther-Das became Mlatar's friend because of their common love towards swords, and the Arcona helped him in his search. They eventually discovered that Thon Gra's mate had been killed, and with no reason to return to his native world, Mlatar accepted Ther-Das' offer to join the Zulirian Swordmasters."}, {"tag": "p", "text": "Then there was Cene Gilvent, an Ocsin aficionado and co-worker Ther-Das met at the Museum, who was initially rejected because of her heterodox fighting method combining a dozen different martial arts; but she was eventually accepted in the Swordmasters."}, {"tag": "p", "text": "Ther-Das was elected leader of the Swordmasters because of his knowledge and drive. His best friend in the team, Naklian became his second-in-command."}, {"tag": "h3", "text": "Vigilante action"}, {"tag": "p", "text": "As time went on, the group members discovered that they were gifted \"swordsmen\" and combatants. Less than one year after being founded, they altered their original mission from \"collecting\" to using their knowledge to become vigilantes. They have shown a trend to attack unarmed enemies."}, {"tag": "p", "text": "In Teloc Ol-sen, the Swordmasters met a Rebel cell, with one of the Rebels using the vibroblade. Zulirian Swordmaster Kaltor Naklian challenged this rebel to a duel and, when he refused, Naklian simply killed him. The Rebels tried to counter attack, but the Swordmasters simply massacred them. They have since been considered a threat to the Rebel Alliance, deserving reports written by Tura Raftican and other Rebels."}, {"tag": "h2", "text": "Personality"}, {"tag": "p", "text": "Ther-das had a very determined personality, as shown in his drive to overcome his salt-addiction and in his pursuit of his studies. An expert swordmaster, with a focus on ancient Arcona weapons, Ther-das was a formidable opponent in a duel."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}