{"url": "Theta-class_T-2c_shuttle", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cygnus Spaceworks products", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Theta-class T-2c shuttle"}, {"tag": "p", "text": "The Theta-class T-2c shuttle, also known as the Theta-class shuttle, was a model of shuttle used by the Galactic Republic and later, the Galactic Empire. Emperor Palpatine ordered Grand Vizier Mas Amedda to inform Captain Kagi to prepare his Theta-class for immediate takeoff to rescue Darth Vader on Mustafar following a duel there against his former Jedi Master Obi-Wan Kenobi. The shuttle would also be used to transport a number of incarcerated Imperial senators in the aftermath of a mass arrest by Imperial Intelligence. In the early days of the Empire, a Theta-class shuttle transported Palpatine and Vader to a desert world in the Mid Rim, and later transported Palpatine and Vader to the Inquisitorius Headquarters in order for Vader to take command of the Inquisitorius. During the Berch Teller campaign, Moff Wilhuff Tarkin asked the captain of the Liberator for a Theta-class for transport to the Goliath."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Theta-class T-2c shuttle, also referred to as the Theta-class shuttle, was a type of shuttle constructed by Cygnus Spaceworks on special order by Supreme Chancellor Palpatine of the Galactic Republic during the Clone Wars, and as such, were never available for public purchase. The shuttle could reach speeds of 2,000 kilometers per hour, were 18.5 meters in length, were equipped with a Class 1 hyperdrive, were outfitted with one laser cannon and two quad laser cannons, were crewed by at least two pilots, and could accommodate at least four passengers. It had two landing gear legs and a ramp that opened up to the front of the ship for entry and exit. The shuttle also carried at least one medical capsule."}, {"tag": "p", "text": "The shuttle had two side wings that folded at a degree downward, and raised up in landing position. The shuttle also possessed a central fin, which housed the shuttle's ray shield generator, with the side wings being able to vent heat collected by the shield. The cockpit of the shuttle was located at the front of the vessel, and had a reinforced window to protect high-level passengers. A second gunner station was located in the cabin."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Theta-class primarily served as a transport for high-ranking individuals, which included the Supreme Chancellor and later Emperor Palpatine. The shuttle was also used by the highest ranking officers of the Galactic Empire's navy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, Supreme Chancellor Palpatine, secretly the Dark Lord of the Sith Darth Sidious, submitted a special order to Cygnus Spaceworks for the production of the Theta-class shuttle. As a result, the vessel was never available for public purchase. Nearly immediately following the establishment of the Galactic Empire with Palpatine as its Emperor and the Great Jedi Purge, Palpatine sensed that his newly christened Sith apprentice, Darth Vader, was in danger when dueling his former Jedi Master Obi-Wan Kenobi, and ordered Grand Vizier Mas Amedda to inform Captain Kagi to prepare his Theta-class shuttle for immediate takeoff to Mustafar. Palpatine was able to rescue Vader, and brought him to the Grand Republic Medical Facility on Coruscant for medical treatment."}, {"tag": "p", "text": "One day after the formation of the Empire, Imperial Intelligence conducted a mass arrest of senators, resulting in the incarceration of sixty-three senators, and a number of these senators were loaded into a Theta-class shuttle. During the early days of the Empire, Palpatine utilized the Theta-class to drop Vader off in a desert world in the Mid Rim so that he could begin his quest to locate a kyber crystal. In the early days of the Empire, a Theta-class T-2c shuttle transported Palpatine and Vader to the Inquisitorius Headquarters in order for Vader to take command of the Inquisitorius. The shuttle was eventually incorporated into the Imperial Navy, although it would be continuously used by high ranking officers. In 14 BBY, during the Berch Teller campaign, Moff Wilhuff Tarkin asked the captain of the Venator-class Star Destroyer Liberator for a Theta-class T-2c shuttle for transport to the Goliath."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Theta-class T-2c shuttle first appeared in Star Wars: Episode III Revenge of the Sith. It was designed as an homage to the Lambda-class T-4a shuttle that first appeared in Star Wars: Episode VI Return of the Jedi. The Theta-class T-2c shuttle's tri-wing design was made less angular with a less aggressive cockpit to soften the obviousness of the villain's transport. Though portrayed primarily in CGI in Episode III, the boarding ramp was made as a practical effect and shot against a greenscreen in the scene where Palpatine emerges with Anakin Skywalker's charred body on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}