{"url": "Third_Galactic_War", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Articles with conjectural titles", "Category:Battles of the Third Galactic War", "Category:Conflicts of the Outer Rim Territories", "Category:Sith Wars"], "nodes": [{"tag": "h1", "text": "Third Galactic War"}, {"tag": "p", "text": "A third Galactic War broke out across the galaxy between the reconstituted Sith Empire and the Galactic Republic, Jedi Order, and the Eternal Alliance."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "In the heat of the second Galactic War, both the Empire and Republic were unexpectedly attacked by the mysterious Eternal Empire from Wild Space. A temporary fragile alliance between the two superpowers was subsequently created, represented by Dark Council member Darth Marr and the Republic war hero who would become known as the Outlander. During a search for the former Sith Emperor in Wild Space, Darth Marr's flagship was suddenly ambushed by the Eternal Empire's Eternal Fleet, and both Marr and the Outlander were captured and taken to the capital planet of Zakuul, where Marr was killed by the Emperor and the Outlander was imprisoned in carbonite. After assassinating his father, the new Emperor Arcann launched a full scale invasion of the galaxy, conquering the Empire and the Republic and turning them into puppet states to Zakuul."}, {"tag": "p", "text": "Many years after the conquest, the Eternal Empire was overthrown by the Outlander (now known as the Alliance Commander), taking Zakuul in the name of the new Eternal Alliance. After a pyrrhic victory in wiping out the last of the Eternal Empire's followers, the Commander decided to work more closely with the Galactic Republic."}, {"tag": "h2", "text": "Onslaught of the Empire"}, {"tag": "p", "text": "In 3628 BBY, the Sith Empire discovered that Jedi Master Gnost-Dural, long thought dead, was hiding in a secret Jedi Colony on Ossus. Sith Emperor Vowrawn promptly ordered an invasion of the planet, under the command of Darth Malgus and Dark Council member Darth Malora, starting the Third Galactic War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}