{"url": "Battle_of_Parmel", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Battle of Parmel"}, {"tag": "p", "text": "The Battle of Parmel was a battle fought during the Zaarin insurrection at Parmel system. It was the second conflict between the rogue forces of Demetrius Zaarin and his former masters of the Galactic Empire. Zaarin's forces tried to intercept a group of pilots, including Darth Vader and Maarek Stele, before they could reach Coruscant and prevent Zaarin's coup d'etat."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Having discovered Zaarin's treachery, Darth Vader rushed to Coruscant to prevent Zaarin's attempted coup. He had hand picked five elite pilots, including Colonel Maarek Stele, to assist him in flying six prototype TIE/D Defenders. Stele was designated Delta 1, while Vader flew Delta 6. The TIE Defenders were the fastest fighters usable to reach the Parmel system. There, they must rendezvous with the Nebulon-B2 frigate Osprey and use it in order to go to Coruscant as rapidly as possible."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "However, upon exiting hyperspace they found instead Alpha-class Xg-1 Star Wings and an Immobilizer 418 cruiser, named Harpago. The superior Defenders easily fought off the attack from the Star Wings, as they waited for the arrival of the Nebulon-B2 frigate Osprey."}, {"tag": "p", "text": "Once the Osprey arrived, the Harpago launched several waves of TIE/sa Bombers. Again, Vader and Delta squadron easily fought them off. Then, once the bombers were dispatched, Delta targeted the Harpago. The onslaught of torpedoes proved too much for the cruiser, which was destroyed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Finally, with Zaarin's forces destroyed, Delta group boarded the Osprey, and headed to Coruscant to stop Zaarin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was first featured in the 1994 LucasArts video game Star Wars: TIE Fighter, in which players fly as Maarek Stele. The battle is depicted in the mission \"TIE Defenders,\" the fourth mission of the game's seventh tour of campaign, \"Treachery at Ottega\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}