{"url": "Third_Battle_of_the_Pakuuni_system", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Battles in the Pakuuni sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Third Battle of the Pakuuni system"}, {"tag": "p", "text": "A third battle occurred in the Pakuuni system during the Battle on the Frontier campaign of the Galactic Civil War, between the Galactic Empire and the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "With the space station NL-1's construction completed and inspected by then Vice Admiral Thrawn, there were just the finishing touches to make the station fully operational. His Victory-class Star Destroyer Stalwart stayed on station for the last critical steps of the station construction effort. Two System patrol craft designated Ranger arrived not longer after the previous enemy engagement. The Stalwart was soon to depart the system to bring reinforcements to aid the arrival of relief for the battle-weary pilots of the frigate Ludwick. Knowing that the Rebels were likely to stage one last effort to disrupt Imperial control of the Pakuuni sector, members of the Secret Order tasked their pilot, Maarek Stele, to be alert for any craft carrying high priority targets in the hope to gather more information about Rebel activity."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In the absence of a Star Destroyer, patrol frequency increased and pilots aboard the Ludwick anticipated additional enemy activity. Sure enoughm the Rebels attacked, starting with the arrival of the assault transport Thunder, accompanied by B-wings, the rebels' more advanced assault craft. Escorting assault gunboats, TIE bombers and interceptors moved to intercept, followed by the launch of a suspicious shuttle from the Rebel assault transport. Maarek Stele, piloting an assault gunboat, inspected and disabled the shuttle Electra, which was revealed to be carrying Rebel advisors. During the battle, more Rebel forces arrived aboard the Rover group, along with A-wings and X-wing fighters. Transport Shark, dispatched to capture Shuttle Electra, succeeded in its mission even amidst the heavy fighting. The Rebel onslaught heavily taxed Imperial pilot abilities, and inflicted heavy damage to station NL-1 and patrol craft Ranger. Despite this, Imperial starfighters wrestled the upper hand from the imposing rebels, just as the Stalwart arrived with the frigate Gaarni, CR90 corvette Stallion and supplies aboard bulk freighters Sivaa to relieve the Ludwick."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thrawn oversaw the repairs of NL-1, anxiously wanting the station fully operational and prepared for any further Rebel attack, keeping everyone involved on a hasty schedule. With the Station fully installed, operational and reinforced, the Rebels and the Pakuuni pirates had been completely driven off and the Imperial control over the sector, allowing intergalactic trade to flourish and benefit the Empire. For his efforts, Stele was awarded the Medal of Progress."}, {"tag": "p", "text": "Stele was also given the next rank in the Secret Order of the Empire for capturing the Rebel officers, allowing more information about Rebel activity in the sector. However, he would not follow through with what they would find. Instead, he was transferred to Admiral Zaarin's frigate Shamus to help him acquire new Hyperdrive technology."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in Star Wars: TIE Fighter as the sixth mission of the third battle. This article assumes \"Medium\" difficulty. On \"Hard\" difficulty, Y-wings, two more assault transports under the group Taxel and a shuttle called Clipper are included in the Rebel attack."}, {"tag": "p", "text": "Oddly enough NL-1 in this mission is an XQ1 Platform, all other missions show it as an XQ3 Platform."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}