{"url": "Third-generation_design_Dark_Trooper", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Dark trooper models"], "nodes": [{"tag": "h1", "text": "Third-generation design Dark Trooper"}, {"tag": "p", "text": "The third-generation design Dark Trooper was a model of Dark Trooper combat droid used by the Imperial remnant of Moff Gideon. The black and silver-plated droids were humanoid in shape and featured a pair of red photoreceptors. A platoon of third-generation dark troopers were held in a cargo bay of Gideon's light cruiser in cold storage. After a skirmish on Nevarro caused the destruction of an Imperial base, a comms officer reported to Moff Gideon, who was overseeing rows of deactivated dark troopers with a group of scientists, that a homing beacon was installed on the Razor Crest. After tracking the Razor Crest to Tython, Gideon had four dark troopers deployed to the planet's surface to kidnap a Force-sensitive alien child known as Grogu from his guardian, the Mandalorian Din Djarin. The droids succeeded and returned to Gideon's light cruiser with the youngling. While rescuing his foundling, Djarin destroyed one of the droids by piercing the droid's unarmored neck with a beskar spear. The remainder were subsequently blown out of the airlock and into space, but returned to the cruiser via their rocket boosters, and almost managed to re-take it single-handedly. Mere seconds before they were able to breach the bridge blast doors, however, the Jedi Master Luke Skywalker arrived and destroyed them all."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dark troopers were equipped with two rocket boosters, one in each foot. Dark trooper armor was capable of withstanding blaster fire, exposure to a flamethrower, and several strikes from whistling birds, but were still vulnerable to lightsaber strikes, allowing the Jedi Luke Skywalker to destroy an entire platoon with his lightsaber with relative ease. Their unarmored neck also was a weak point, which Din Djarin exploited after staggering the dark trooper with whistling birds. Dark troopers also possessed extreme strength. A single dark trooper was able to pry open the doors to its containment area and could easily pick up Djarin and toss him about. Two dark troopers were able to work together to severely damage a set of blast doors through repeated strikes, and a single dark trooper was capable of severely damaging a wall of Gideon's light cruiser by repeatedly striking Djarin's beskar helmet, but was unable to cave-in the helmet itself. Aside from armor and brute strength, dark troopers also wielded large blaster rifles which they could aim with precision accuracy, as seen when a dark trooper fired several shots at Djarin all of which hit him, but glanced off his beskar armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The third-generation design Dark Trooper first appeared in \"Chapter 12: The Siege,\" the fourth episode of the second season of the Disney+ live-action series The Mandalorian, which originally aired on November 20, 2020. It was first identified as a dark trooper in the audio description available for the episode on Disney+. Its full name of third-generation design Dark Trooper was revealed in its Sideshow Collectibles figure.In \"Chapter 16: The Rescue,\" they were realized with stunt actors in a full-body suit and then augmented with CGI. According to the production team, it was the better option for bringing the scene to life and to fit with the style of Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}