{"url": "Thirsty_Bantha", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Pages needing citation", "Category:Cantinas", "Category:Mos Entha locations"], "nodes": [{"tag": "h1", "text": "Thirsty Bantha"}, {"tag": "p", "text": "Thirsty Bantha was a cantina run by the former bounty hunter Robb in the city of Mos Entha on Tatooine, around the time of the Galactic Empire. It was frequented by locals of all sorts, ranging from Imperial stormtroopers to moisture farmers. The cantina was named after the non-sentient bantha creature. Robb's initial hope for the cantina was to provide himself with a more relaxing life than afforded to him by his previous career choice. This proved difficult, as the cantina did not produce enough revenue to run smoothly. Robb was forced to borrow credits from the Devaronian loan shark Varak'Cha to keep his business afloat. When Robb failed to pay back the loan, he was given a fifteen-day deadline to produce the money, lest something bad happen to the cantina."}, {"tag": "p", "text": "Robb was able to enlist the help of his old Human friend Nia Adea, who handled all customer interaction in Thirsty Bantha, and provided Robb with her recipe for the drink additive flavor syrup. With Adea's assistance, Robb significantly boosted Thirsty Bantha's popularity and made a tidy profit, enough to repay Varak'Cha."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in a back alley near the center of the city Mos Entha on Tatooine, Thirsty Bantha was named for the non-sentient bantha creature. It was a relatively small cantina, and the building itself was built in a style resembling other Mos Enthan structures. It consisted chiefly of two rooms, separated by a short flight of stairs. The outermost room was occupied by the entrance area, where customers waited in line to be seated, and which also held the bar. The inner room contained all the establishment's tables and a stage for musical acts. The walls and floor of the cantina were made from a brown stone, and were utterly unembellished. Drinks of several colors were served in Thirsty Bantha: green, purple, blue, orange, and yellow."}, {"tag": "p", "text": "Although initially somewhat plain and moderately decorated, the cantina received a number of upgrades over time. Customer capacity was increased from two tables to six when Nia Adea began supervision of the cantina, and a number of aesthetic aids and entertainment products were installed to increase customer satisfaction. Two droids were purchased to help mix drinks. With their aid, at least two new drink varieties were added to the cantina's repertoire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Thirsty Bantha was owned and operated by the Besalisk Robb, who sought a quieter life after making a career as a bounty hunter for several years. His initial business plan of both preparing and serving all drinks on his own made for mediocre revenue, and he was eventually forced to borrow money from the local Devaronian loan shark Varak'Cha."}, {"tag": "p", "text": "Unable to pay back the loan, Robb was threatened and physically assaulted by the Devaronian, and was given fifteen days to scrape together the credits. However, unbeknownst to Robb, his old friend, the Human Nia Adea, had witnessed the exchange with the loan shark. She presented herself and offered to help him raise the money needed. They implemented a division of labor: Robb would prepare the drinks, while Adea waited the tables. Additionally, Adea entrusted Robb with her recipe for flavor syrup, intended to make beverages taste better."}, {"tag": "p", "text": "Adea's assistance turned things around financially for Thirsty Bantha. As the cantina grew in popularity, Robb increased the establishment's capacity by adding several more tables, as well as implementing several upgrades to increase customer satisfaction and boost efficiency. An air conditioning system and a water cooler were installed, all the tables were replaced with models that enabled patrons to play holochess, potted plants were spread around to enhance the aesthetic aspect of the cantina, and a helper droid was employed to help prepare drinks faster. Six days after Adea's arrival, Thirsty Bantha was visited by the local Hutt crime lord Wunda, who demanded to be served large amounts of drinks. After spending the entire day in the cantina, he left without paying."}, {"tag": "p", "text": "The cantina continued to grow in financial terms, and additional tables were added, along with a lugjack machine, improved lights, and a second helper droid. A Bith band was also hired to play music during opening hours. At the end of the fifteen days, Varak'Cha returned to the cantina to collect his credits. As Robb handed him the money, Adea made an insulting facial gesture at the loan shark, provoking him enough to push her violently. As the Devaronian was about to exit Thirsty Bantha, he was greeted by Wunda, whom Varak'Cha owed money. Wunda's Gamorrean guards promptly appropriated the funds and gave them to the Hutt. With the cantina back on its feet financially, Adea left to pursue other interests."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Before Nia Adea's arrival, the cantina's only employee was Robb. The low popularity of Thirsty Bantha meant that it was only frequented by Jawas at first, but thanks to Adea's makeover, several other groups of patrons began frequenting the establishment: local moisture farmers, Gamorreans, Twi'lek smugglers, Rodian bounty hunters, and even Imperial stormtroopers. Regular customers included Wunda, Olaf, Tikkit, Mogrugg, Jac'Ril, Neelir, and Dave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thirsty Bantha serves as the setting for the THQ Wireless-published iPhone game Star Wars: Cantina. It does not appear and is not mentioned in any other Star Wars product."}, {"tag": "p", "text": "The exact chronological placement of Star Wars: Cantina is unclear, but seeing as the game makes veiled references to the first Death Star and Han Solo, this article assumes it is set sometime in the Rebellion era."}, {"tag": "h2", "text": "Appearances"}]}