{"url": "Tho_Voota", "categories": ["Category:Legends articles", "Category:Males", "Category:Officers", "Category:Yevetha"], "nodes": [{"tag": "h1", "text": "Tho Voota"}, {"tag": "p", "text": "Tho Voota was a Yevethan nitakka who served during the Black Fleet Crisis as of defence for the spawnworld, an immediate subordinate of the ruling viceroy charged with the protection of the planet N'zoth."}, {"tag": "p", "text": "Appointed to his post after the execution of his predecessor Kol Attan, Tho Voota was based aboard the flagship Pride of Yevetha. This caused tensions with Dar Bille, who was the viceroy's second as well as the flagship's primate. Although they shared the vessel's bridge, there was no clear chain-of-command between them, and their rivalry led to situations where they openly contradicted each other's orders."}, {"tag": "p", "text": "During the Battle of N'zoth, Tho Voota initially wished to hold the flagship back in a defensive orbit, but he was overruled by the Viceroy Nil Spaar, who agreed with Dar Bille that they should advance to confront the New Republic Fifth Fleet. Then, when Dar Bille ordered the Splendor of Yevetha ahead of the flagship, Tho Voota responded by commanding the two ships to be kept at a slow speed in order to allow the rest of the fleet to form up around them."}, {"tag": "p", "text": "Shortly after this, a group of Imperial prisoners aboard the Pride of Yevetha, led by Major Sil Sorannan, seized control of the ship. Tho Voota was presumably killed or captured during their takeover."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tho Voota appears briefly in Tyrant's Test, the concluding novel of the Black Fleet trilogy."}, {"tag": "p", "text": "Confusingly, The Complete Star Wars Encyclopedia states that \"he commanded the Interdictor cruiser Splendor of Yevetha\". This may be a garbled reference to the orders he issues to Splendor in the novel, but could be interpreted to mean that he had formerly been the commanding officer of Splendor before his promotion to higher rank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}