{"url": "Battle_of_Pengalan_IV", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles in the Inner Rim", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Pengalan IV"}, {"tag": "p", "text": "The Battle of Pengalan IV took place during the Clone Wars."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "A full division of clone troopers was sent to Pengalan IV aboard the Sea Legacy to destroy a diamond boron missile facility in the city of Tur Lorkin. These missiles were designed to shoot down Galactic Republic starfighters."}, {"tag": "p", "text": "With them was Joram Kithe, nicknamed \"Dodge\" because of his cowardice, yet resourceful accountant of the Republic. His charge was to evaluate the clone troopers' military value to help determine if the Republic would purchase more clones. He never envisioned that he would have to help lead the actual military strike."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "A battle ensued at arrival on the planet, in which a majority of the clone trooper platoon was wiped out. In the chaos Joram's gunship was shot down upon their retreat, leaving him and the few remaining clone troops to destroy the facility on their own. Joram noticed that these clones behaved differently than other clone troopers. They were less apt to blindly take orders like others he had seen. Having trouble keeping up with the clones (they all looked alike), Joram gave them all nicknames based on an event surrounding each individual clone or their job during the mission (i.e. one trooper once lost a tooth so he named him \"Tooth\", or \"Digger\", who was one of the clones that dug holes for the clone troopers that didn't survive the crash landing.) Other clone nicknames included Mapper, Spots, Spade, Wrench and Hash."}, {"tag": "p", "text": "After the nicknames were assigned, the platoon leader, Tooth, suggested a plan to infiltrate the missile facility. Under Tooth's leadership, the group was able to get inside, obtain disguises, identicards, and fingerprints of Separatist agents. Tooth was able to create a diversion, which allowed Joram and another team of troopers to destroy the facility. In the melee, Tooth and several other clone troopers fell to the Separatist defense. The remaining clones and Joram were able to secure transport off the planet from a spaceport in Tur Lorkin."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "During the escape, Digger revealed to Joram that his platoon of clones were 'not regulars.' He described his platoon to be 'a little more self-reliant than the others. To be capable of more initiative.' Digger informed Joram that there were more out there like them in case the Republic needed troopers for more specialized missions. Joram was supposed to assume the platoon was normal and write a 'glowing report of the clone trooper's military value. To help persuade the powers that all troopers perform like elites."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}