{"url": "Third_battle_of_Suurja", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Ojoster sector", "Category:Battles of the Mandalorian Wars"], "nodes": [{"tag": "h1", "text": "Third battle of Suurja"}, {"tag": "p", "text": "During the Mandalorian Wars in 3964 BBY, a battle occurred at the Outer Rim world of Suurja between the Galactic Republic and the Mandalorian Neo-Crusaders. As the Mandalorians advanced toward the Core Worlds, Republic Navy Captain Saul Karath attempted to halt their advance at the Jebble-Vanquo-Tarnith line, where Suurja was located. Two previous clashes at Suurja not long before were inconclusive—in a similar fashion, this battle also ended without a clear victor."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the year 3964 BBY, the Galactic Republic was embroiled in a major, galaxy-spanning conflict known as the Mandalorian Wars. Invading Mandalorian legions from the fringes of known space conquered many systems on the edges of Republic control and put the Republic on the defensive, starting at the edges of the Outer Rim. The Mandalorians swiftly progressed toward the Core Worlds, forcing Republic Navy Captain Saul Karath to establish a defensive cordon known as the Jebble-Vanquo-Tarnith line. The barrier was the site of heavy fighting in the weeks to come, although the Mandalorians were not able to break through the Republic defenses. One of the worlds along the line was Suurja, an agrarian planet with a population of 16 million colonists. About four months after the Mandalorians' capture of the Republic Flashpoint Stellar Research Station, the Neo-Crusaders set their sights on Suurja. Two previous clashes at Suurja between the Republic and Mandalorians were inconclusive, but both sides were still ready to fight."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Republic naval forces, commanded by Saul Karath, soon battled the Mandalorians again for Suurja. However, similarly to the first two battles, neither side was able to obtain a conclusive advantage."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the battle ended without a clear victor, both the Republic and Mandalorian forces were still strong enough to fight again. Within the next few weeks, the Republic and the Mandalorians engaged in another battle at Suurja. This and the other battles of Suurja were reported upon in an edition of the Taris Holofeed news report from the nearby world Taris. In the release, Republic defense official Catronus Steffans was quoted as optimistically saying that the stalemate at Suurja represented a success of Karath's defensive cordon, and that it heralded an upcoming Republic pushback."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The third battle of Suurja garnered its first, and thus far only, mention in The Taris Holofeed: Prime Edition, a short postscript to the 2006 comic Knights of the Old Republic 0. A short summary of this and other battles of Suurja is given, written by John Jackson Miller, in the style of an in-universe news report."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}