{"url": "Battle_of_Pesitiin", "categories": ["Category:Legends articles", "Category:Battles in the freestanding subsectors of the Expansion Region", "Category:Battles of the Caamas Document Crisis"], "nodes": [{"tag": "h1", "text": "Battle of Pesitiin"}, {"tag": "p", "text": "The Battle of Pesitiin was a skirmish during the Caamas Document Crisis, orchestrated by Moff Vilim Disra to thwart Admiral Gilad Pellaeon's planned peace negotiations with the New Republic, fought between Pellaeon's flagship Chimaera and several ships of the Cavrilhu Pirates, hired by Disra. Disra intended for Pellaeon to conclude that General Garm Bel Iblis, who he had attempted to contact for the negotiations, had sent the ships and that the New Republic had no interest in a peace treaty."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "While Pellaeon was waiting in the remote Pesitiin system for Bel Iblis, a group of Cavrilhu warships with Corellian Defense Force markings entered the system. The ships shifted into an attack formation in which their ray shields overlapped for superior protection, but left their particle shielding weak. Pellaeon was immediately suspicious of the true nature of the fleet, and allowed the \"Corellian\" ships to make two passes against the Chimaera, hoping that the Computerized Combat Predictor could be used to analyze their tactics and reveal their true identity."}, {"tag": "p", "text": "Pellaeon then enacted the second stage of his battle plan, utilizing his Preybird fighters and the Chimaera's proton torpedo launchers in a variation on the A-wing Slash. The Preybirds were sent toward the enemy's Kaloth Battlecruiser in parade-flight formation, and numerous proton torpedoes were launched along the same vector. The Preybirds then split apart in a saggery-blossom maneuver, and as the battlecruiser's gunners attempted target the fighters, the torpedoes impacted its bow and destroyed the ship. Some of the torpedoes detonated prematurely, severely damaging a Corellian Gunship."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The fact that the enemy fleet was so completely fooled by the A-wing Slash, a tactic which Bel Iblis himself had invented, proved to Pellaeon that the Corellian General was not his attacker, but that someone opposed to the peace negotiations had wanted Pellaeon to think that he was. Pellaeon therefore was determined to wait for Bel Iblis at Pesitiin. While Bel Iblis ultimately never would come to Pesitiin, another prominent New Republic official would."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}