{"url": "Thom_Hudd", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Alliance Military officers", "Category:Humans", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Thom Hudd"}, {"tag": "p", "text": "Thom Hudd was a human male thief who served the Alliance to Restore the Republic as a lieutenant during the Galactic Civil War. He served on the starship Auric under Commander Lina Graf and took part in a mission where the ship was attacked by a group of TIE fighters and forced to make an emergency landing on the Imperial-controlled volcanic planet of Mustafar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Thom Hudd once heard a story he called the \"the Curse of the Nameless,\" which shared its name with entities mentioned in tales the Jedi Order had known of. During the Galactic Civil War against the Galactic Empire, Hudd joined the Rebel Alliance as a lieutenant under Commander Lina Graf aboard the Auric. During a mission, the Auric was forced to crash-land on Mustafar. There, Hudd saw a castle that was something out of a nightmare. After the Auric crashed,  Hudd, Graf and the rest of the crew were able to escape it before the lava finished the ship."}, {"tag": "p", "text": "Hudd was against the idea going inside the castle due to the presence of Lava Troopers there. He then came under attack by several larva creatures. Hudd and the crew met the larva's parent, a Mustafar beetle. After XM-G3 killed the beetle, Hudd told the crew about what happened on Bray during the Clone Wars. The crew was then confronted by the lava troopers."}, {"tag": "p", "text": "As Graf and G3, and  held off the lava troopers, Hudd, CR-8R, and Skritt ran towards the castle's entrance. There, Hudd picked the lock. Once inside, Hudd found a statue and attempted to steal it. He was confronted by several security droids, screamed in fear, and went missing. By the time Graf and her crew got there, there was no trace of Hudd, just the statue on the floor. Vaneé told Graf that Hudd had become one of Sith Lord Darth Vader's latest victim."}, {"tag": "p", "text": "After Graf escaped, Hudd was tortured by Vaneé with a torture web."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thom Hudd first appeared in the 2018 canon comic Star Wars Adventures: Tales from Vader's Castle 1, written by Cavan Scott and illustrated by Derek Charm. The idea of Hudd being a thief was derived from the original flashback story for the series' fifth issue, which involved a thief breaking into Vader's fortress. Hudd was named and partially modelled after Tom Huddleston, the co-author of Star Wars: Adventures in Wild Space, a seven-part Star Wars young reader novel series in which Scott worked previously."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}