{"url": "Tholme", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tholme"}, {"tag": "p", "text": "Tholme was a male Jedi Master who trained Quinlan Vos."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tholme was a member of the Jedi Order and became a Jedi Master prior to the First Battle of Geonosis, taking on Quinlan Vos as his Padawan learner. At some point after the outbreak of the Clone Wars, Tholme fought in a military engagement between the Grand Army of the Republic and Confederacy of Independent Systems, having been assigned to partake in the battle by the Jedi High Council. His apprentice wished to accompany him, but the Council had assigned him to another mission. During the battle, Tholme engaged in a duel with the Sith apprentice Asajj Ventress, an agent of the Confederate leader Count Dooku. Though a close match, it was Ventress who prevailed, and Tholme was killed. Vos became enraged after learning of his master's demise."}, {"tag": "p", "text": "In 19 BBY, Vos fell in love with Ventress after she had been expelled from her service to Dooku, whom the pair had been ordered to assassinate by the Jedi Council. Unaware that Ventress had killed Tholme, Vos would later uncover the truth after being captured by Dooku who claimed that Ventress acted against his orders to kill Tholme in an attempt to lure Vos to the dark side."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tholme wielded a green-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In official Star Wars canon, the character of Tholme was first referenced in the 2015 novel Dark Disciple. He originated in the Star Wars Legends continuity, being created by noted author John Ostrander for the Star Wars: Republic comic book series; the character first appeared in a 2001 story arc entitled Darkness. In the Legends continuity, Tholme survived the Clone Wars and did not die until later, with his funeral pyre being erected on the planet Anzat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}