{"url": "Thorgeld_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Core Worlds star systems", "Category:Northern Dependencies star systems"], "nodes": [{"tag": "h1", "text": "Thorgeld system"}, {"tag": "p", "text": "Situated in the Core Worlds, the Thorgeld system contained the planet Thorgeld I. During the Galactic Civil War, the crew of the light freighter Dorion Discus visited the planet, shortly after which the freighter was confronted by the Imperial Customs Frigate Assessor. After the smuggler Roark Garnet unsuccessfully attempted to bluff the crew's way out of a customs inspection boarding, the Dorion Discus engaged the Assessor in combat before finally escaping the system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Thorgeld system was located in the Northern Dependencies portion of the Core Worlds. The first orbital position of the system was occupied by the terrestrial planet Thorgeld I."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The crew of the light freighter Dorion Discus—which included the smuggler Roark Garnet; the bounty hunter Tantos Dree; the retired Imperial captain Jackson Farseeker; and Farseeker's granddaughter and Garnet's daughter, Jill—visited Thorgeld I at some point during the Galactic Civil War. Shortly after the Dorion Discus had left the planet, the Imperial Customs Frigate Assessor confronted the freighter in the Thorgeld system and ordered it to stand by for customs inspection boarding."}, {"tag": "p", "text": "In order to stall for time while a hyperspace jump out of the system was being calculated, Garnet contacted the Assessor and claimed that the Dorion Discus could not be boarded, bluffing that his starship was carrying important cargo for the Imperial base on Markon IV. However, the crew of the Assessor did not fall for Garnet's bluff and fired a warning shot at the smuggler's vessel in response. The Dorion Discus subsequently engaged the Imperial frigate in combat before finally escaping the Thorgeld system for hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Thorgeld system was first indirectly mentioned in the 1987 rulebook for the first edition of West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, named the system and placed it in grid square L-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}