{"url": "Battle_of_Qretu_5", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Inner Rim", "Category:Battles of the Bacta War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Qretu 5"}, {"tag": "p", "text": "A battle at the planet Qretu 5 was the result of a punitive strike conduced by Rogue Squadron against one of the off-world bacta-producing colonies of Thyferra."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Xucphra Corporation's retaliation against Halanit induced Rogue Squadron to change its strategy to prevent Chief Operating Officer Ysanne Isard from further striking against innocent worlds. A list of viable targets was compiled, and the off-world Thyferran Q5A7 Bacta Refinement Plant on Qretu 5 was selected. The scope of the mission was to destroy the industrial facilities and to take away as much bacta as possible: the remainder was to be destroyed. The bacta requisitioned would then be given to traders in exchange of arms, munitions and spare parts. In this way, Ysanne Isard would be deprived of being able to retaliate for fear of alienating or antagonizing the traders."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Rogue Squadron and its allies used the ring of asteroids surrounding the planet to enter the atmosphere discretely, and then arrived undetected at the bacta refinery by flying a low-level approach. Rogue Squadron made the first run, using proton torpedoes and laser fire to hit the ground targets. While Tal'dira's Twi'lek squadron of Chir'daki starfighters was preparing to begin its run, a group of eight TIE/LN starfighters piloted by Thyferran Home Defense Corps pilots joined the battle, but were soon shot down by Rogue Squadron and their allies. Having cleared the area of enemy forces, a convoy of independent smugglers' freighters led by Mirax and Booster Terrik landed at a nearby spaceport, loaded their ships with bacta, and established contact with the local civilian population in anticipation of reparation claims."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}