{"url": "Battle_of_Qu%27mock", "categories": ["Category:Legends articles", "Category:Battles in the Kathol sector", "Category:Battles of the DarkStryder Campaign"], "nodes": [{"tag": "h1", "text": "Battle of Qu'mock"}, {"tag": "p", "text": "The Battle of Qu'mock was a small engagement fought between the New Republic corvette FarStar, and the forces of the Qektoth Confederation in the Qu'mock system."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After recovering two Imperial officers from a damaged assault shuttle, members of the FarStar crew became infected with a new biochemical agent developed by the Qektoth Confederation. On the advice of former Confederation member Drigor Tarrens, the FarStar was directed to a research facility in the Qu'mock system that might have information on the agent. The crew of the FarStar hoped to use the information to develop a cure with the help of the Uukaablians."}, {"tag": "h2", "text": "Infiltration"}, {"tag": "p", "text": "The FarStar entered the Qu'mock system with a moon in between them and the Space Station. Relying on a stealth approach, a combat team left the corvette in an Aegis-class combat shuttle. The New Republic force encountered little resistance entering the hangar bay on the station as the majority of the crew were preparing for an evacuation. Making their way through the station, the team rescued a prisoner, Fasha Dansun. After a firefight with several Confederation guards, the team retrieved the relevant files on the biochemical agent from the station's main computer."}, {"tag": "h2", "text": "Arrival of the Qektoth Confederation"}, {"tag": "p", "text": "In space, a new contact dropped out of hyperspace. The Qektoth Confederation had sent one of their Qektoth Attack Cruisers, the Scourge, to attack the New Republic vessel. It appeared that the Confederation knew that the New Republic would be attempting a raid on their facility, as they also prepared their station to be destroyed by their own biochemical agent."}, {"tag": "p", "text": "In space, the FarStar and the Scourge engaged in battle. The crew of the FarStar soon found that the Attack Cruiser was armed with bio-energy weapons that could pass through the shields of the New Republic vessel. On the station, the boarding party found themselves sealed in the science labs, and the biochemical agent began to spread through the station. Covering themselves in a gray-green goo that temporarily negated the effects of the biochemical agent, the team had to use the access ladders to reach the hangar bays after finding that the turbolifts had been locked down. Reaching the hangar bay, they discovered that the hangar bay entrances had been magnetically sealed with blast doors."}, {"tag": "p", "text": "The boarding party were rescued by the arrival of Drigor Tarrens, piloting a Helix-class light interceptor. Using his knowledge of Confederation command codes, he opened the blast doors, allowing the Aegis combat shuttle to leave the station. The two ships formed up and began to attack the Qektoth Attack Cruiser. Tarrens explained that the massive amount of energy required to power the craft's experimental weapons meant that the ship's shields could only protect the ship from one fire arc. The Helix interceptor and the Aegis combat shuttle proceeded to attack the Cruiser from multiple angles."}, {"tag": "p", "text": "The Attack Cruiser was briefly joined by a HT-2200 medium freighter from the station, which focused its attacks on the Aegis combat shuttle. Shortly after the medium freighter entered the battle, the space station exploded, damaging all ships within range. Presumably, all capable craft withdraw from combat following the destruction of the station."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, the data was taken to Uukaablis and, with the help of the Uukaablians, a cure was developed. All infected personnel were treated and recovered from the biochemical agent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The outcome of the battle is never explicitly stated, although it is known that the FarStar, the Aegis shuttle, and the Helix interceptor survived since the characters piloting them make further appearances at either the end of the adventure, or in subsequent ones. The fate of the Scourge is never revealed, possibly to allow Gamesmasters running the Campaign to include it as an enemy in future adventures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}