{"url": "Three_Against_the_Galaxy", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 3"], "nodes": [{"tag": "h1", "text": "Three Against the Galaxy"}, {"tag": "p", "text": "Three Against the Galaxy is a 22-page comic featured in Star Wars Tales #3. It was written by Rich Hedden, pencilled by Rick Leonardi, inked by Mark Lipka, lettered by Steve Dutro, colored by Dave McCaig, and edited by Dave Land and Peet Janes. It takes place in 4 ABY, post-Return of the Jedi. It was canonized in Unusual Suspects, an article in Star Wars Gamer 6."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ever since the death of Jabba the Hutt, one of his elite guards, Grissom, a Gamorrean, has been jumping from planet to planet, job to job, and is currently settled in as a pitfighter on Otunia. As he sits in the cantina on Otunia, a woman named Arista enters and gets into a scuffle with a perverted Gran. She bumps into Grissom, and the Gran demands that Grissom get him a drink. The Gamorrean punches the Gran to the ground, just as Lorn Kabul's police force come in and take him away."}, {"tag": "p", "text": "One week later, Lorn Kabul speaks with his daughter Arista, who complains about the tracking device he's protectively attached to her ankle. Suddenly Lorn's brother Seth comes in and tells Lorn that the Cerilian Trade Agreement needs his immediate attention. Later, Seth speaks to Imperial Moff Harsh, promising to kill Arista and Lorn with a charge in the mines where they're to visit tomorrow, taking over Kabul Industries for himself, and that he will be much friendlier with the Empire than Lorn is."}, {"tag": "p", "text": "The next day, Lorn and his daughter Arista oversee the mining operation on Otunia, which Grissom is involved in. Grissom then notices the charge left by Seth Kabul and tossed it down a service ladder, though that doesn't do a lot of good, as the cave crumbles down on top of all in attendance regardless. Grissom comes out from under a mine cart and picks up an unconscious Arista before finding a nearly-dead Lorn Kabul. He asks Grissom to take Arista off Otunia, and to give her a ring which he holds out to him, and dies. Grissom navigates his way out of the mines, out into the harsh desert of Otunia."}, {"tag": "p", "text": "Two days later, Seth Kabul tells one of his Weequay underlings to find Arista with a tracking unit, used to detect her ankle bracelet. They find her later that night, alone, in a small outcropping of rocks. As they get near to her, Grissom, from a higher position, throws several boulders down onto Seth's men. Grissom is chased by a Weequay on a skiff, but the skiff is shot down by a Jawa armed with some kind of rocket launcher. The Jawa introduces himself as Tek, and takes Arista and Grissom back to his cave to remove her tracking device."}, {"tag": "p", "text": "While doing so, Tek says that he has a bounty on his head for 12,000 credits after a farmer was killed using his sand blaster on rocks, causing the blaster to explode, and so the farmer's family put a bounty on his head. Grissom deduces to himself that 12,000 credits would be enough money to get them off Otunia, and takes Tek in, claiming the sizable bounty. However, Grissom and Arista rescue Tek from the detention center later that night and head off to the Kabul Estate, now under ownership of Seth Kabul, where a Lambda-class shuttle and several stormtroopers are stationed."}, {"tag": "p", "text": "As Seth finishes up a meeting with Moff Harsh, Arista walks in carrying a blaster, and Seth acts delightfully surprised to see her. Grissom enters from behind him, nearly scaring him to death, as Arista points to the mines through the window, which abruptly explode due to several charges being placed throughout them by Tek earlier. As Seth turns around to say she'll never escape, he discovers that she's escaped. Arista, Grissom and Tek bribe a space freighter pilot with their 12,000 credits and get passage off Otunia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}