{"url": "Thrawn:_Treason", "categories": ["Category:Real-world articles", "Category:Star Wars: Thrawn (novel series)"], "nodes": [{"tag": "h1", "text": "Thrawn: Treason"}, {"tag": "p", "text": "Thrawn: Treason is a canon novel written by Timothy Zahn. Published on July 23, 2019 by Del Rey, it acts as the sequel to the 2018 novel Thrawn: Alliances, as well as the final installment in the Thrawn novel series. Set before the finale of Star Wars Rebels, Thrawn: Treason features Grand Admiral Thrawn crossing paths with Director Krennic as well as the return of Eli Vanto."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Grand Admiral Thrawn faces the ultimate test of his loyalty to the Empire in this epic Star Wars novel from bestselling author Timothy Zahn."}, {"tag": "p", "text": "\"If I were to serve the Empire, you would command my allegiance.\""}, {"tag": "p", "text": "Such was the promise Grand Admiral Thrawn made to Emperor Palpatine at their first meeting. Since then, Thrawn has been one of the Empire's most effective instruments, pursuing its enemies to the very edges of the known galaxy. But as keen a weapon as Thrawn has become, the Emperor dreams of something far more destructive."}, {"tag": "p", "text": "Now, as Thrawn's TIE defender program is halted in favor of Director Krennic's secret Death Star project, he realizes that the balance of power in the Empire is measured by more than just military acumen or tactical efficiency. Even the greatest intellect can hardly compete with the power to annihilate entire planets."}, {"tag": "p", "text": "As Thrawn works to secure his place in the Imperial hierarchy, his former protégé Eli Vanto returns with a dire warning about Thrawn's homeworld. Thrawn's mastery of strategy must guide him through an impossible choice: duty to the Chiss Ascendancy, or fealty to the Empire he has sworn to serve. Even if the right choice means committing treason."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Prologue"}, {"tag": "p", "text": "The Chiss Expansionary Defense Fleet warship Steadfast under the command of Admiral Ar'alani is on a secret mission to track the movements of an Imperial Star Destroyer deep inside alien territory. The Steadfast has cloaked itself in dark mode, rendering itself invisible to the Star Destroyer's sensors. Ar'alani summons her senior officers including Mid Commander Tanik, Captain Khresh, and Lieutenant Eli Vanto for a briefing."}, {"tag": "h3", "text": "Departing Lothal"}, {"tag": "p", "text": "Following Captain Hera Syndulla's failed raid against the TIE/d \"Defender\" Multi-Role Starfighter assembly line on Lothal, Governor Tarkin informs Grand Admiral Thrawn that his TIE Defender project is facing competition from Orson Krennic's Stardust project and instructs him to rendezvous with the Emperor Palpatine to plead his case."}, {"tag": "p", "text": "Commodore Karyn Faro delivers her communications report to Grand Admiral Thrawn, apologizing that she was unable to find a pattern. The two talk about the capture of Syndulla and the threat posed by her rebel comrades. Faro confides that she is uncomfortable with leaving for Coruscant in the midst of a rebel insurgency on Lothal. Faro express concern that Governor Arihnda Pryce does not know how to deal with Kanan Jarrus and his team. Thrawn agrees and opines that losing the TIE Defender program will be worse than losing Syndulla."}, {"tag": "p", "text": "Commander Hammerly informs them via comlink that Tarkin has dispatched a new set of coordinates to meet him aboard the Star Destroyer Firedrake in the Sev Tok system. After resetting their course, Thrawn and Faro discuss the abrupt change in venue with Faro describing it as \"cloak-and-blade.\""}, {"tag": "h3", "text": "The Gralloc wager"}, {"tag": "p", "text": "Aboard the Firedrake, Governor Tarkin and Grand Admiral Balanhai Savit discuss the upcoming meeting with Director Krennic and Grand Admiral Thrawn to discuss funding for the competing Stardust and TIE Defender projects. The four senior Imperial officials meet in the Firedrake's command conference room where they are joined by the Emperor via hologram."}, {"tag": "p", "text": "Director Krennic informs them that the Stardust project has been held up by grallocs, larger cousins of the mynocks which have attacked power cables and couplers at the equipment transfer point. To resolve the dispute between Thrawn and Krennic's rival projects, Tarkin convinces the Emperor to restore funding to his Defender program if Thrawn is able to resolve the gralloc problem. Krennic agrees provided that Thrawn can destroy the grallocs within a week; a proposal that Thrawn accepts."}, {"tag": "p", "text": "Following the meeting, Director Krennic meets with his lieutenant Brierly Ronan and briefs him about their meeting with Thrawn, Tarkin, and the Emperor. Unwilling to have the funding for Stardust jeopardized, Krennic has arranged for Ronan to join Thrawn aboard the Chimaera and tasks him with preventing Thrawn from eliminating the grallocs within a week. Krennic emphasizes that he wants to gather enough information so that he can take the credit for resolving the gralloc problem himself."}, {"tag": "p", "text": "Later, Savit meets with Thrawn and confides that Tarkin is playing him against Krennic. After exchanging greetings with Ronan, Savit passes Thrawn the information on the grallocs. Commodore Faro shows Ronan to his quarters. She asks Ronan about his encrypted data card. Ronan responds that Director Krennic ordered that his card be encrypted for security reasons. When Ronan asks how Thrawn worked out the location of the Stardust transfer station, Faro explains that Thrawn calculated Admiral Savit's command area and Tarkin's recent travel trajectory."}, {"tag": "h3", "text": "Hunting grallocs"}, {"tag": "p", "text": "The Chimaera arrives at the Kurost transfer point where supplies are shipped to the Star Dust's location. Aboard the Chimaera's bridge, Thrawn, Ronan, Faro, and the bridge crew discuss dealing with the threat posed by the grallocs. After conferring with chief weapons officer Lieutenant Pyrondi, Thrawn decides to first use ion cannons to drive away the grallocs."}, {"tag": "p", "text": "Since the grallocs are able to dodge the ion blasts, Thrawn dispatches his TIE Defender squadron under the command of Captain Benj Dobbs against them. The TIE Defenders spend two hours pursuing grallocs but are unable to take them down. While Ronan thinks Thrawn's methods are not working, Thrawn reveals that he was merely baiting the grallocs. With Lieutenant Fentaugh's Defender acting as bait, Captain Dobbs is able to shoot and kill one of the grallocs, which is then dissected aboard the Colossus."}, {"tag": "p", "text": "Later, Grand Admiral Savit briefs Moff Haveland about Thrawn's operation against the grallocs. Despite Thrawn capturing a gralloc, Savit reports that the Allanar N3 light freighter AL6-KM44 was prematurely driven into hyperspace and presumed lost. Haveland despises Thrawn, believing that Thrawn's successes were due to a secret adviser. Following the conversation, Savit ponders on the whereabouts of the missing Imperial officer Eli Vanto."}, {"tag": "h3", "text": "Missing in action"}, {"tag": "p", "text": "Meanwhile, Eli Vanto reflects on his first meeting with Admiral Ar'alani a year ago. After joining the Chiss Expansionary Defense Fleet, Vanto was \"demoted\" to the rank of lieutenant. While learning Cheunh, Vanto is assigned work aboard the Steadfast's analysis department."}, {"tag": "p", "text": "After being summoned to the bridge, Vanto meets the Chiss navigator Vah'nya, a 22 year old Chiss woman who is Force-sensitive and employed as an ozyly-esehembo aboard Chiss ships. Commander Tanik informs Vanto that the Chiss Fleet have been tracking what appears to be a ship that was hit by a salvo. Vanto is unable to offer much help but speculates that the pursuer had been lying in wait for the ship. While Admiral Ar'alani and her command crew discuss the situation, Vanto senses that something is going on out there."}, {"tag": "h3", "text": "Following the trail"}, {"tag": "p", "text": "Faro, Thrawn, and Ronan observe the dissection of the fallen gralloc. Ronan thinks the dissection is a waste of time since he claims that his data card has all the information they need. Thrawn declines the offer, aware of the discrepancy between Haveland's data and their own. Thrawn is interested in the gralloc's organic propulsion system, which is fueled by Clouzon-36. When Thrawn asks about a ship record and manifest listing, Ronan refuses to hand the information to the Chimaera's analysis group, claiming that it is highly confidential."}, {"tag": "p", "text": "As they are walking down the corridor, Ronan questions Faro's loyalty to her commanding officer. In an attempt to sow doubt, he reveals information suggesting that Thrawn blocked her appointment as commander of Task Force 231. While Faro defends Thrawn, she is troubled by Ronan's revelation."}, {"tag": "p", "text": "While tracking the missing Allanar N3 light freighter AL6-KMM4, Faro discovers that the ship was mainly carrying replacement parts and a package of blosphi extract, which are mostly sold as low-cost rations for Wookiee slaves. After tracking the vectors of several missing freighters, Thrawn and Faro deduced that these missing freighters had been stolen and not devoured by the grallocs as purported."}, {"tag": "p", "text": "Tracking the missing freighters, they find the corpses of the dead crew aboard a derelict space station. Examining food and oxygen use records, Thrawn deduces that twelve of the crew members are missing. Most importantly, Thrawn and Faro work out that alleged gralloc attacks are being used to cover up the theft of 28 ships ferrying supplies to the mysterious Stardust project. When Thrawn asks if they are on the same vector the Allanar disappeared, Faro admits that the Chimaera traveled through a different part of space since they entered the vector farther out on the edge than the Allanar. To Ronan's surprise, Thrawn does not humiliate her for her error but instead decides to backtrack along the precise vector this time."}, {"tag": "h3", "text": "Reunion amidst battle"}, {"tag": "p", "text": "Traveling through space, Vanto spots the Chimaera in the distance. Before he can transmit a coded message to the Chimaera, the Chimaera jumps into hyperspace. While traveling back to the transfer point, the Chimaera stumbles upon the wreckage of the Allanar N3 freighter. Thrawn, Faro, and Hammerley also detect a cloaking device and gravity well nearby which is hiding an asteroid observation post. Hiding beneath the asteroid is an armed Grysk warship."}, {"tag": "p", "text": "Under Thrawn's orders, Commodore Faro deploys the TIE Defenders and two TIE fighter squadrons in a Marg Sabl maneuver. He also instructs Lieutenant Pyrondi to bombard the enemy ship with turbolaser fire. Exiting hyperspace, the Steadfast deploys plasma spheres to draw away the Grysk warship's laser fire. Observing the Chimaera and its starfighter's Marg Sabl maneuver, Vanto realizes that Thrawn wanted to distract the Grysks from his TIE fighters."}, {"tag": "p", "text": "Thrawn's starfighters take out the Grysk warship's electrostatic generator nodes and laser defenses. To help Thrawn, Admiral Ar'alani orders her crew to belay the plasma spheres and to fire the Breachers at the enemy ship's laser sites. The Grysk warship's laser cannons take out two of the Breachers but four of the Breachers hit their targets, burning through the ship's hull. Thrawn's Defenders and TIEs then take out the Grysk warship's hyperdrive and thrusters, destroying the ship."}, {"tag": "p", "text": "Following the battle, Ar'alani and Eli receive an invitation from Thrawn to meet him aboard the Chimaera. Before leaving, Ar'alani orders her crew to salvage the debris from the Grysk warship. After exchanging pleasantries aboard the Chimaera, Thrawn, Eli, and Ar'alani board the Grysk warship where Major Carvia and four stormtroopers have captured two Grysk prisoners. There is a tense exchange between Ar'alani and one of the Grysks, who derides Carvia as a human hireling and boasts that he is the Lifeholder, Deathbringer, and Seeker of Conquest."}, {"tag": "p", "text": "Major Carvia informs Thrawn and Ar'alani that they found the bodies of five humans and eighteen beings of an unidentified species, who had all been stabbed multiple times. Carvia reports that they also found a young Chiss girl who survived the massacre. Ar'alani wants vengeance against the Grysks but Thrawn does not believe in executing prisoners. In private, Ar'alani confides with Eli than she feigned anger in order to mislead their Grysks prisoners into thinking that there was tension between her and Thrawn."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "Meanwhile, Grand Admiral Savit and Director Krennic receive news about Thrawn's recent battle but much of the information is patchy. Savit is supportive of Thrawn's TIE Defender programme and butts heads with Krennic, who is defensive of his Stardust project. Having heard no word from Ronan, Krennic and Savit contact Grand Moff Tarkin's office for more information."}, {"tag": "p", "text": "Tarkin confirms that the TIE Defenders acquitted themselves well in the recent battle but is unsure about the identity of the belligerents, believing them to be pirates. Following their meeting with Krennic, Savit issues orders for Captain Rasdel to activate his spy in Tarkin's office and to arrange a meeting with Captain Gilad Pellaeon of the Harbinger to discuss his new pirate-hunting mission."}, {"tag": "h3", "text": "The Chiss girl"}, {"tag": "p", "text": "Meanwhile, aboard the observation post's medcenter, Thrawn, Vanto, and the Imperial and Chiss forces examine the remains of dead human crew from the missing freighters and a client alien race of the Grysks. Thrawn and Vanto deduce that the Grysks killed their subordinates and prisoners as a self-destruction tactic in the face of defeat. Admiral Ar'alani tends to a seven year-old Chiss girl and has woken up from a state of unconsciousness. Discussing the thrusters of the freighter and Grysk warship they destroyed, Thrawn and Vano deduce that there is a third cloaked Grysk warship in space."}, {"tag": "p", "text": "The Chiss girl introduces herself as Un'hee and tells them that she was kidnapped by the Grysks two years ago. As a five-year old, Un'hee had been enslaved by the Grysks and forced to work as a navigator due to her Force-sensitivity. Thrawn believes that the alien clients of the crew protected Un'hee by pretending that she was dead. Admiral Ar'alani believes they can use Un'hee's knowledge of hyperspace routes to track down the remaining Grysks."}, {"tag": "p", "text": "Thrawn and Ar'alani conclude that the two Grysks allowed themselves to be captured in order to ascertain that Un'hee was dead. Since they have two Chiss navigators including Vah'nya and Un'hee, they think that the Grysks will target them. Un'hee confirms that she was the only Chiss navigator in Grysk captivity and that the Grysks also employ individuals from other species as navigators. Thrawn and Ar'alani agree that they need to protect their two navigators. Their situation is complicated by Ronan's demand that he be allowed to visit the observation post."}, {"tag": "h3", "text": "Ronan's interference"}, {"tag": "p", "text": "After two unsuccessful attempts, Ronan manages to bully a stormtrooper into letting him take a shuttle to the asteroid observation post. There, he encounters Admiral Ar'alani, Un'hee, Vah'nya, and Commander Vanto; the latter of whom he regards as a deserter. Thrawn is displeased that Ronan disobeyed his orders to remain aboard the Chimaera. Ronan fears that Thrawn has brought the Chiss to subvert the Stardust project."}, {"tag": "p", "text": "To test whether the Grysk prisoners have some way of communicating with their people, Vanto proposes sending them back with two shuttles to the Chimaera. The Grysks would be in one shuttle while the other is a decoy. Ronan thinks the plan is folly but Thrawn proposes sending an Imperial code with the ships. As the Chiss women speak, Vanto tries to explain their \"flush-trap-operation.\" However, Ronan is hostile towards Vanto, regarding him as a deserter."}, {"tag": "p", "text": "Vanto theorizes that the Grysks have a comm center from which they using a triad to communicate with their bases. Vanto offers his services as a translator but Ronan rejects it, prompting Admiral Ar'alani to refuse to have any dealings with him. Swallowing his pride, Ronan reluctantly accepts Vanto's services. Thrawn allows Ronan to be privy to their \"flush-trap-operation.\""}, {"tag": "h3", "text": "The flush-trap operation"}, {"tag": "p", "text": "Under Thrawn's orders, the two Grysk prisoners are transported back to the Chimaera aboard a shuttle, which is to be drawn into the Star Destroyer by a tractor beam. Thrawn's plan is to bait Grysk forces in the vicinity. Ronan doesn't like Thrawn's plan. When Vanto fobs off his questions about the Chiss, Ronan tells Vanto that the Emperor fully supports Director Krennic's Stardust project and that the rest of the political structure on Imperial Center will be irrelevant once it is operational."}, {"tag": "p", "text": "As part of Thrawn's plan six TIE Defenders escort the shuttle. Just as Thrawn expects, a second cloaked Grysk ship opens fire on the convoy. Under Thrawn's orders, the Chimaera's turbolasers blast the cloaked ship but it manages to escape into hyperspace. Though the Grysk warship escapes, Captain Dobbs and his TIE Defenders manage to locate a cloaked gravity well projector. Thrawn and Faro conclude that the Grysk have developed a new hyperspace sensor system. Thrawn orders Faro to prepare the Chimaera for a voyage to Grysk forward base and communications center."}, {"tag": "h3", "text": "A test of wills"}, {"tag": "p", "text": "Following the skirmish, Ronan is angry that Thrawn failed to trap the Grysk warship. Thrawn responds that this is merely the first phase of the battle and that the second phase will soon commence. Regarding Ronan as an obstacle to his plans, Thrawn issues orders for him to be returned to the Chimaera. However, Ronan counters that he has a mandate from Director Krennic and Governor Tarkin which supersedes Thrawn's orders."}, {"tag": "p", "text": "To defuse the situation, Thrawn instead orders the stormtroopers to escort Lieutenant Vanto back to the shuttle. However, Ronan points out that Vanto is still facing charges of desertion. Thrawn counters that Vanto is on loan from Admiral Ar'alani due to his expertise with data crunching. Ronan protests, unwilling to let sensitive Imperial data fall into the hands of someone he regards as a traitor."}, {"tag": "p", "text": "An exasperated Thrawn calls Ronan a fool and explains that a stolen ship masquerading as an accidental misfire has taken its cargo to a secret station. The Grysks have attacked and destroyed the way station and intercepted the cargo ship. Thrawn explains that humans are missing from the station and those from the ship have been murdered. A chastised Ronan realizes that Thrawn is right and backs down. He allows Vanto to work through the data on the condition that Commodore Faro supervises him. Thrawn also agrees to allow Ronan to set up Vanto in Faro's office."}, {"tag": "h3", "text": "Thrawn's loyalties"}, {"tag": "p", "text": "Later, the navigator Vah'nya uses telepathy, which the Chiss call the \"Second Sight\", to probe Un'hee's mind for information on how she uses the Force, which the Chiss call \"Third Sight\", to navigate Grysk ships through space. Thrawn and Ar'alani watch the proceedings, intending to use Vah'nya's telepathic abilities to  probe Un'hee's mind for the location of the Grysk base. When Ar'alani questions Thrawn about his loyalties, he reassures her that his true loyalties lies with the Chiss Ascendancy. Thrawn also reassures her that he has a plan to \"eliminate\" Ronan so that he does not cause trouble for their plans."}, {"tag": "p", "text": "After Vah'nya separates her mind from Un'hee's mind, the navigator tells Thrawn that she can take them to the Grysk forward base. However, Vah'nya is uncomfortable with serving aboard the Chimaera. Ar'alani assures her that Vanto will be aboard the Chimaera but that he will be working on a separate mission. At Vah'nya's insistence, Ar'alani reluctantly agrees to accompany her aboard the Star Destroyer."}, {"tag": "h3", "text": "Uncovering a conspiracy"}, {"tag": "p", "text": "Aboard the Chimaera, Vanto, Ronan, and Thrawn go through the data on the missing ships. Vanto finds that 28 of the 41 missing ships vanished along suspicious vectors and believes that those 28 ships were most likely stolen. Vanto also notices that three of the ships carried foodstuffs and a large amount of blosphi extract, which is used to feed Wookiee slaves working on Stardust. Other items include TRL-44 cylinders, Klymtra spark collimators, Boorian synchronization grids, and Thorilide shock absorbers."}, {"tag": "p", "text": "Ronan notices that the stolen ships carried the enough components for eight complete turbolasers. Ronan and Thrawn realize that someone  in the Esaga sector is manipulating the shipping records in order to steal Imperial technology. Ronan realizes that the stolen ships originated from three worlds in the Esaga sector, which is ruled by Governor Haveland, who convinced Director Krennic that Stardust should funnel most of its supply chains through her territory."}, {"tag": "p", "text": "Thrawn realizes that Haveland arranged for a small number of freighters to be lost to the grallocs in order to accustom Stardust's overseers to such losses. Once the pattern has been established, Thrawn deduces that special ships can disappear under supposedly identical circumstances. Seeking to get rid off Ronan, Thrawn assigns Ronan to investigate the Aloxor system, one of the three systems where the freighters are originating from."}, {"tag": "p", "text": "Ronan thinks this is a matter for the Imperial Security Bureau (ISB) to investigate but Thrawn suggest that the local ISB has been compromised. When Ronan proposes sending Vanto instead, Thrawn responds that Ronan is the only person that Director Krennic will listen to and that he must be a direct witness to the plot. Vanto also agrees to come along and Thrawn outfits the two of them with civilian clothing."}, {"tag": "p", "text": "While walking on the bridge of the Chimaera, Ronan witnesses Chiss navigator Vah'nya flinch reflexively and a moment later a member of the bridge crew stumbles, revealing Vah'nya's Force-sensitivity. For the moment, Ronan resolves to find incriminating evidence about Governor Haveland."}, {"tag": "p", "text": "Thrawn assigns a pair of Death troopers to escort Ronan and Vanto. Meanwhile, Krennic briefs Grand Admiral Savit about Ronan's report about a danger to the Kurost transfer point. Savit is unable to lend forces to defend the transfer point because the Third Fleet is currently engaged in hunting down pirates. Krennic tells Savit that Ronan warns that at least two alien factions are interested in the transfer point. Savit claims Ronan is being paranoid but Krennic speaks up for his Assistant director. Savit reluctantly agrees to send a ship to each of Krennic's staging areas."}, {"tag": "h3", "text": "A tense alliance"}, {"tag": "p", "text": "After some arguing with Thrawn, Admiral Ar'alani allows Commodore Faro to remain aboard the bridge of the Chimaera while the navigator Vah'nya guides the crew with the Force on the condition that she takes up position at the weapons station. Faro orders the bridge crew to leave in order to avoid hindering Vah'nya's efforts to track down the Grysk forward command base."}, {"tag": "p", "text": "While discussing the theft of Imperial ships and supplies bound to Stardust, Thrawn and Faro realize that the grallocs were a ruse for chosen ships and crew to pretend that they had been damage and travel via hyperspace to a mobile observation post to transfer their cargoes to the thief's ships. Based on their interrogation of the Grysk prisoners, Thrawn and Faro also realized that the Grysks had intercepted the ship's communications, captured the observation post, and ambushed the crew of the missing Allanar N3. They also deduce that the escaped Grysk ship was a supply ship commandeered by the aliens."}, {"tag": "h3", "text": "Mission to the Aloxor system"}, {"tag": "p", "text": "Eli and Ronan travels with the death troopers Pik and Waffle to a spaceport town called Tiquwe on the planet Aloxor. At the advice of Waffle and Pik, Ronan reluctantly changes out of his Imperial uniform into civilian clothes. They decide not to reveal themselves to the local Imperial authorities since they are not sure if they can trust them."}, {"tag": "p", "text": "While traveling through the streets of the spaceport town, the four are attacked by a dirty faced woman named Sisay and a man named Skulk. After subduing them, the Imperials learn from Sisay that Grand Admiral Savit has been benefiting from the movement of smuggled goods through Aloxor. Eli poses as a friend of Nightswan and claims that the Hutts want to deal with Savit."}, {"tag": "p", "text": "Eli tells that Assistant Director Ronan can secure an audience with Savit. When Sisay asks what is Eli's plan, he suggests smuggling \"Snick\" aboard one of the ships heading to the Stardust project. Realizing that Eli is referring to him, Ronan reminds Eli that his name is Ronan. Sisay and Skulk agree to help \"smuggle\" Ronan aboard the transport ship."}, {"tag": "h3", "text": "An unlikely ally"}, {"tag": "p", "text": "Together with Sisay and Skulk, the four Imperials travel to the Tiquwe spaceport where they meet a slicer named Mole, who works for Parpa. Sisay hires Mole to forge Imperial identity data cards for the four of them to infiltrate the transport ship. Mole promises to have it done in a few hours. However, Eli's plan runs into trouble when Sisay demands that the undercover Imperials show the Hutt tattoos on their bodies which prove that they work for the Hutts."}, {"tag": "p", "text": "Sisay thinks that the visitors' presence is linked to the presence of an Imperial Star Destroyer above their town. Before Sisay and her gang can subdue the undercover Imperials, they are defeated in physical combat by Mole, who reveals himself as the Imperial Security Bureau agent Dayja. Sisay tries to shoot Vanto but is instead shot dead by Dayja. Dayja reveals that he was sent by ISB Colonel Wullf Yularen to help Thrawn."}, {"tag": "p", "text": "Dayja leads Ronan, Eli, and the disguised Death troopers to a smuggling freighter called Brylan Ross. They discover that the freighter has been transporting smuggled Clouzon-36, control, and power cables. Before they can leave Aloxor, they are caught in the the tractor beam of the Star Destroyer orbiting the planet, which is under the command of Governor Haveland."}, {"tag": "p", "text": "Fearing that elements in Coruscant and the ISB are also involved in the smuggling conspiracy, Dayja decides to conceal his ISB identity. However, he convinces Ronan to don his uniform in order to use his authority as assistant director to convince the Empire about the conspiracy. Dayja also agrees to buy Vanto, Pik, and Waffle enough time to escape back to the Tiquwe spaceport."}, {"tag": "h3", "text": "Pursuing the Grysk warship"}, {"tag": "p", "text": "In space, the Chimaera approaches two Grysk ships that have been fused together by short pylons. Using sensors, Faro determines that the conjoined ships are an improvised booby trap with the hostages and Grysk client species being used as bait. Admiral Ar'alani realizes that a cloaked Grysk warship is hiding nearby using the conjoined ships as decoys. In response, Thrawn orders Pyrondi to deploy the tractor beams in a slingshot maneuver."}, {"tag": "p", "text": "Under Thrawn's orders, the tractor beam projectors grab onto several TIEs and fling them at the conjoined Grysk ships. The fighters' mission is to gather information the Chimaera cannot obtain without the active sensors; provoke the cloaked ship into revealing its locations; and to be in a position to attack the conjoined trips. Ar'alani reminds Thrawn that their mission is to capture alien prisoners and rescue the Grysks' captives. Faro notices the cruisers have moved. She believes that the Grysks' presence in Imperial space means that they have set their sights on the Empire."}, {"tag": "p", "text": "While Thrawn reflects on the Grysks' apparent lack of art, Navigator Vah'nya informs him that the Chiss child navigator Un'hee called the Grysk client species Scratchlings and is terrified by them. Thrawn and Vah'nya vow to find and destroy the enemy. Ar'alani notices that the conjoined Grysk ships have two triad poles anchored on long tethers stretching to both sides. The conjoined ship rotate slowly to ensure that the tethers remain taut."}, {"tag": "p", "text": "By calculating the trajectory of the conjoined ships' rotation, Thrawn and his team are able to work out the location of the cloaked Grysk warship. After issuing an ultimatum to the enemy, Thrawn orders Major Carvia to prepare a stormtrooper boarding party. Rejecting Thrawn's ultimatum, the Grysks move their conjoined ships closer to the Chimaera, exposing the third triad pole and the cloaked Grysk warship. The Chimaera and TIE fighters blast the cloaked warship. The Grysks try to escape in a stolen supply ship but are destroyed."}, {"tag": "p", "text": "The Imperial boarding party avoid Grysk booby traps. They also rescue eight humans and a Dashade from their Grysk captors. When the Grysk try to kill their prisoners with an explosive cylinder and blasters, Thrawn orders his troops to open fire, resulting in the deaths of the enemy and two of the prisoners being wounded."}, {"tag": "h3", "text": "Questioning the rescued"}, {"tag": "p", "text": "Thrawn and Faro interrogate the liberated crew members, who are facing charges of piracy and theft of Imperial property. A male prisoner named Bleary tells Thrawn that the Grysks would question them about the Empire, threatening their lives, their families, and clan totems. He recalls that the Grysks would use their Scratchling subordinates to spook them."}, {"tag": "p", "text": "Bleary confesses that the Dashades Maliss and Sorath were the bosses behind the theft of Imperial supplies and hired them for the job. He recalls that Sorath hired them to run the way station, collect cargoes from the smuggling freighters, switch the suff and the crews to new freighters and dump the original ones. He explains that they had a schedule for moving the station to different places."}, {"tag": "p", "text": "Bleary then tells them that the Grysks discovered and captured them, killing Maliss. Sorath led the crew in resisting the Grysks but were eventually forced to surrender, leaving twelve alive. Bleary thinks that Sorath wanted to strike a deal with them. However, the Grysks were more interested in the prisoners. Bleary admits to transferring eighteen pieces of cargo."}, {"tag": "p", "text": "Bleary also tells Thrawn and Faro that Westerli and Yimmer suggested that they should be working for the Grysks; hinting at the aliens' skills of persuasion. Thrawn issues orders for the rescued crew to be put under close watch. After talking about bribing Sorath with blosphi extract, Thrawn tells Faro about his next plan to destroy the main Grysk command centre in the local region in order to deliver \"complete and total destruction.\""}, {"tag": "h3", "text": "Savit's prisoner"}, {"tag": "p", "text": "Meanwhile, Grand Admiral Savit receives news from Governor Haveland and the Star Destroyer Captain Lochry about the capture of a smuggling ship and two prisoners including a man claiming to be assistant director Ronan. Governor Haveland claims jurisdiction over Ronan and Mole but Savit ignores her demands. He then arranges with Captain Lochry for them to rendezvous at the Sev Tok system to pick up Ronan."}, {"tag": "h3", "text": "Returning to the Chimaera"}, {"tag": "p", "text": "Eli, Pik, and Waffle depart Aloxor and return to the Steadfast. However, Grand Admiral Thrawn is away pursuing a Grysk supply ship. Pik wants to return to Aloxor, contact the local governor, and get someone to send a ship to hunt down the Chimaera. Eli disagrees and reminds the Death troopers that Thrawn issued them with orders to protect him. The two men decide to remain aboard the shuttle but allow Eli to leave."}, {"tag": "p", "text": "First Officer Khresh tells Eli that Thrawn and Ar'alani went to find the Grysk forward base and that the seven-year old Navigator Un'hee is the only one who knows how to find it. Khresh introduces Eli to Un'hee. Vanto manages to convince Un'hee that Navigator Vah'nya and Admiral Ar'alani trust him. The child agrees to help Eli and tells him to stand beside her in front of the memory wall."}, {"tag": "p", "text": "Following Un'hee's Force probe, Eli reports to First Officer Khresh. When Khresh says that he envies the Empire's navigational methods, Eli responds that it is not his Empire anymore. Using Un'hee's coordinates, Vanto believes that they will be there within an hour."}, {"tag": "h3", "text": "Dealing with Grysk doomsday devices"}, {"tag": "p", "text": "While examining the conjoined Grysk warships, Faro and Hammerley detect the presence of several Grysk nitrogen cylinders. Ar'alani recognizes that they are doomsday devices that the Grysks left behind to destroy all evidence within the next four hours. Thrawn returns to the Chimaera to convene a meeting of all senior officers to deal with the situation."}, {"tag": "p", "text": "Working together, Thrawn and his bridge crew manage to detach the Grysk ships from the triad poles before the nitrogen bombs can destroy the cylinders. After neutralizing the threat of the booby traps, Admiral Ar'alani contacts Captain Khresh of the Steadfast, ordering him to intercept and contain one the two floating ships. Ar'alani tells him to leave the second ship as bait for the Grysks. Eli requests an audience with Thrawn due to a complication to the plan."}, {"tag": "h3", "text": "Thrawn's plan"}, {"tag": "p", "text": "Grand Admiral Thrawn contacts Grand Admiral Savit by hologram and confirms that he sent Ronan to investigate irregularities in the Stardust shipping operation including theft and destruction of Imperial property, manipulation of records, consorting with pirates, and treason. With Governor Haveland seeking Ronan's extradition, Thrawn convinces a reluctant Savit to rendezvous at a system whose coordinates he is sending him."}, {"tag": "p", "text": "Savit orders Captain Boulag to suspend the anti-piracy campaign in the Esaga sector and to dispatch the Star Destroyers Harbinger, Stormbird, and Misthunter to the helm's coordinates."}, {"tag": "p", "text": "Meanwhile, Thrawn discusses his plans with Lieutenant Eli, Admiral Ar'alani and Commodre Faro in the Chimaera conference room. Eli vouches for Captain Dobbs and his TIE Defender squadron's loyalty to Thrawn. Thrawn tells the officers that the TIE Defenders are integral to his plan. Thrawn then tasks Lieutenant Vanto with briefing Captain Dobbs and his pilots in the TIE ready room."}, {"tag": "h3", "text": "Moment of the truth"}, {"tag": "p", "text": "Savit has his prisoner Ronan brought to the Firedrake's hangar bay only to discover that Thrawn wants to meet him on the bridge of the Star Destroyer. Savit had initially intended to send Ronan and Mole away on a shuttle and have them killed in order to hide his criminal activities. There, Thrawn confronts Savit about his role in funneling supplies for the Stardust project into the hands of smugglers. Thrawn tells Savit that he did not want them to know that the grallocs were drawn to Clouzon-36, which was used to lure them to the chosen freighters."}, {"tag": "p", "text": "Savit initially denies any wrongdoing until Thrawn presents him with encrypted records of his accomplices, spaceports, and financial transactions. Thrawn points out that the encryption was reserved solely for use by the twelve grand admirals; something that no governors and moffs have access to. Confronted with the evidence, Savit tells Thrawn that he thinks Stardust to be a colossal waste and that he was funneling material that would be useful to the Imperial Navy."}, {"tag": "p", "text": "Shortly later, Commodore Faro arrives aboard the Chimaera and demands Savit's surrender. Faro also transmits evidence of Savit's illicit activities to the commanders and officers of the Third Fleet. She appeals to them to join the Chimaera in demanding that the Grand Admiral surrender himself for a board of inquiry. However, the Misthunter and Stormbird move to support the Firedrake."}, {"tag": "h3", "text": "Battle with the Grysks"}, {"tag": "p", "text": "As the Steadfast approaches the Grysk forward base, Lieutenant Vanto is on the bridge of the Chiss warship with Admiral Ar'alani, Mid Commander Tanik, First Officer Khresh, and Navigator Vah'nya. Before the battle commences, Vah'nya requests a word with Vanto, telling him how the Grysks probed Un'hee's mind and broke her. She warns Vanto of the danger posed by the Grysks; how a handful are able to subjugate the hearts and souls of billions of beings. Vah'nya begs Vanto to kill her and her fellow Navigators should the Grysk win the battle in order to prevent the aliens from using them as weapons. Vanto agrees before returning to his station."}, {"tag": "p", "text": "Two Grysk warships exit hyperspace, carrying several starfighters. Admiral Ar'alani turns the ship to face them and warns the Grysk Hegemony to depart Imperial space. The Grysk commander mockingly asks if the Chiss are serving the Empire and tries to brush off the recent Grysk defeats including the loss of two warships. Ar'alani responds that Chiss interrogation methods were useful in locating the Grysk command base."}, {"tag": "p", "text": "As the Grysk starfighters approach, the Chiss crew deploy their plasma spheres, which disable their missiles and cause them to explode. Under Ar'alani's orders, First Officer Khresh uses the Steadfast's tractor beam projectors in an attempt to slow down the charging enemy fighters and missiles. One of the Grysk fighters crashes into the hull of the Steadfast. Ar'alani sends her crew to capture the pilot and study the ship's weaknesses."}, {"tag": "p", "text": "While conversing with Vah'nya, Vanto realizes that the Grysks have not committed their warships to the battle because they are trying to drain the Steadfast's defenses. Vanto also tells her that he regards the fleet as his family now. Observing the space battle, Vanto and the Chiss officers realize that the surviving Grysk starfighters are returning to their warships to inform newer reinforcements about their enemy's defenses. Senior Commander Cinsar comes up with a plan to neutralize the Grysk barrier generators with their acidic Breacher missiles, disabling the starfighters."}, {"tag": "h3", "text": "Clash of the Grand Admirals"}, {"tag": "p", "text": "Grand Admiral Savit is confident of victory since his Star Destroyers outnumber the Chimaera. However, Thrawn reminds him that Captain Gilad Pellaeon and the Harbinger are absent from the battle. Savit is confident that Pellaeon is loyal to him. Ronan steps into the argument. When Thrawn asks him whether Savit's crimes deserved to be examined, Ronan thinks that it is not worth getting many good men and women killed. Ronan is unconcerned about the loss of a few turbolasers but Thrawn reminds him about the principles of broken faith and treason. Thrawn is determined to bring Savit to justice."}, {"tag": "p", "text": "Still believing he has the upper hand, Savit orders Captain Rasdel of the Misthunter to launch an ion cannon attack on the Chimaera. Rasdel is initially hesitant but Savit reminds him that his crew's lives are at stake and that the Chimaera has already launched TIE fighters. Rasdel complies with his commander's orders."}, {"tag": "p", "text": "In response, Commodore Faro orders Lieutenant Pyrondi to launch six counter-bursts to intercept the Misthunter's ion blasts. Aboard the Firedrake, Savit orders Captain Lochry of the Stormbird to launch its ion blasts and to deploy a squadron of TIE fighters. To counteract Savit's attack, Commodore Faro deploys several TIE fighters into the path of the ion volleys as decoys. While firing at Savit's Star Destroyers, Faro has Pyrondi use tractor beams to retrieve the disabled TIE fighters. Faro anticipates that Savit will now deploy TIE fighters now that his non-lethal attacks have failed."}, {"tag": "h3", "text": "Savit's downfall"}, {"tag": "p", "text": "As expected, Savit deploys a squadron of twelve TIEs to meet the Chimaera's six TIEs. Ronan tries to reason with Savit but the Grand Admiral is determined to beat Thrawn on the battlefield. Thrawn tells Savit that he has mentored Commodore Faro. Examining Savit's collection of musical instruments, Thrawn remarks that Savit performs his creations in tandem with other performers."}, {"tag": "p", "text": "As Savit's TIEs fly out to meet the Chimaera's TIEs, the Chimaera deploys several proton torpedoes in their path in order to rattle Savit's TIEs. Before any damage can be done, Faro neutralizes the torpedoes with the Star Destroyer's turbolaser blasts. However, the Stormbird's TIEs sustain debris damage. Two of the TIEs lose control but are plucked to safety by the Stormbird's tractor beam projectors, which had received the coordinates from the Chimaera."}, {"tag": "p", "text": "Still determined to beat Thrawn, Savit orders Captain Boulag to move the Firedrake towards the Chimaera and to prepare turbolasers. In response, Commodore Faro orders Lieutenant Watkin's TIE fighters to take out the Firedrake's portside turbolaser cannons. The Firedrake rotates its starboard side to face the Chimaera."}, {"tag": "p", "text": "Aboard the Firedrake, Savit learns that four rogue TIE pilots serving Thrawn have departed from their cradles. Savit attempts to dispatch a second squadron only to learn that Thrawn's people have disabled the remote auto-lock mechanism. The four rogue TIE pilots disable the Firedrake's starboard turbolasers. A cloaked Grysk gravity well projector also crashes into the Firedrake's aft racks, taking out its strike fighter capability."}, {"tag": "p", "text": "Savit tries to order the Stormbird and Misthunter to attack the Chimaera with turbolasers. However, Thrawn's shuttle has grappled to the hull above the Firedrake's short-range transmitter, jamming his outgoing signals. Savit tries to order Hangar Master Llano to send TIEs and shuttles to communicate with the other ships only to discover that he has lost control of Hangar Control."}, {"tag": "p", "text": "Savit orders Captain Boulag to attack the Chimaera but he refuses to obey the Grand Admiral's orders. Over the intercom, Captain Pellaeon of the Harbinger supports Commodore Faro's calls for Grand Admiral Savit to submit to an official inquiry and implores Captains Lochry and Rasel to support him. Enraged, Savit tries to shoot Thrawn with his blaster but Ronan blinds him with his cape."}, {"tag": "p", "text": "Savit tries to shoot Ronan but is stunned by Major Dayja Collerand or \"Mole\", who has also stunned two stormtroopers. Exploiting an Imperial regulation decreeing that all blasters on capital ship bridgs be set on stun, Major Dayja relieves Savit of duty and turns over the Firedrake's command to Captain Boulag. Dayja invites Thrawn and Ronan to testify against Savit at a board of inquiry. However, Thrawn has unfinished business with the Grysks."}, {"tag": "h3", "text": "TIE Defenders to the rescue"}, {"tag": "p", "text": "At the edge of Imperial space, the Steadfast battles with Grsyk starfighters. The Steadfast's lasers and plasma spheres try to intercept as many of the enemy missiles as they can. The Steadfast manages to take out several Grysk fighters with acid Breacher bombs. The Steadfast also exchanges fire with one of the Grysk warships, inflicting damage to its hull. While the Chiss have gained the upper over the first ship, the Grysks still have a second warship lying out there."}, {"tag": "p", "text": "Under Admiral Ar'alani's orders, Lieutenant Vanto uses the captured Grysk gravity well-generator to transmit a beacon to twelve waiting TIE Defenders. Using Vanto's intelligence on the first warship's laser clusters, missile tubes, and electrostatic barrier nodes, the TIE Defenders take out the second Grysk warship's defenses before jumping into hyperspace. They then resurface beneath the second warship, ambushing the second wing of Grysk fighters. They then return for a third attack on the second warship. Following more surgical strikes on the two Grysk warships, the enemy forces blow up their ships rather than risk capture."}, {"tag": "p", "text": "Following the battle, Ar'alani asks Vanto what he promised Navigator Vah'nya. Vanto admits that he promised to kill her or the other navigators to prevent their capture by the Grysks. He explains that he and the navigators would have fled into an escape pod laden with explosives and then detonated it, killing as many of the enemy as they can in a last stand. Impressed, Ar'alani tasks Vanto with investigating the histories, genetics, and family flow of their pool of navigators in order to identify a pattern for recruiting future navigators. As Vanto sees to the returning TIE Defenders, Ar'alani addresses him as Lieutenant Commander."}, {"tag": "h3", "text": "Bittersweet victory"}, {"tag": "p", "text": "Later, the Chimaera arrives in the space debris field. Knowing Thrawn's passion for art, Ar'alani and her crew had recovered two pieces of artwork from the remains of the Grysk warships. Ar'alani is also impressed with Vanto's performance and promises to give him a good report. Thrawn then has Commodore Faro summon Assistant Director Roanan to the bridge."}, {"tag": "p", "text": "When Ronan arrives, Thrawn informs him about the success of the TIE Defenders in eliminating the Grysk task force. Thrawn is also aware that Captain Boulag is returning Grand Admiral Savit to Coruscant for an inquiry with the Misthunter as escort. Captain Lochry and the Stormbird have been dispatched to lead operations against Savit's pirate accomplices."}, {"tag": "p", "text": "Thrawn and Ronan then talk with Director Krennic and Governor Tarkin via hologram. Fearing that Thrawn's TIE Defender program will divert funding from Stardust, Ronan claims that Thrawn failed his part of the bargain on the grounds that he did not destroy the grallocs harassing the shipping vessels. Ronan minimizes Thrawn's contact with aliens and says that his final report will describe it in detail. Thrawn does not rebut Ronan's report, leading Tarkin to rule in Krennic's favor. Tarkin promises Thrawn that he will restore funding once Stardust has been completed."}, {"tag": "p", "text": "Thrawn warns Tarkin that an enemy could potentially find their way aboard Stardust and manages to convince Tarkin to assign Lord Vader to oversee the project until the first shakedown cruiser. Having received news that the situation on Lothal has been \"critical\", Thrawn announces that he has to return. Tarkin assigns Captain Pellaeon of the Harbinger to escort Thrawn to Lothal. Commodore Faro returns to the bridge to rendezvous with Pellaeon but not before giving Ronan a \"death stare.\""}, {"tag": "h3", "text": "Ronan's choices and Faro's reward"}, {"tag": "p", "text": "In private, Thrawn warns Ronan that he can hide his contempt for the Emperor from Director Krennic but not Darth Vader. Thrawn offers Ronan three choices: returning to Director Krennic; resigning from Stardust and traveling far away; and traveling with Admiral Ar'alani to the Chiss Ascendancy. Despite realizing the threat of the Grysks, Ronan initially refuses on the grounds that he is loyal to the Empire and wants to see Stardust operational on schedule. However, he recalls Vah'nya's Force sensitivity and changes his mind. Thrawn makes arrangements for Ronan to accompany Vanto aboard Ar'alani's shuttle. In secret, Ronan seeks to gain evidence of Thrawn's \"treason.\""}, {"tag": "p", "text": "Admiral Ar'alani disagrees with Thrawn's plan to have Ronan travel with her into the Unknown Regions. Thrawn responds that he is taking a gamble. Ar'alani warns him of the growing chaos in the Chiss Ascendancy being a prelude to a coming war."}, {"tag": "p", "text": "Later, Thrawn speaks with Commodore Faro, admitting that he recommended that she be removed from consideration as commander of Task Force 231 because he believed that she was a better candidate as the commander of the more powerful Eleventh Fleet. Faro also confides that she sent positive reports on Thrawn's efforts to Tarkin in order to counter-balance Ronan's negative reports. While Faro looks forward to her new command, Thrawn explains that she will be leaving the Chimaera at Lothal for Coruscant and orientation on her new command."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "The Emperor speaks with Grand Admiral Thrawn via his private comm display, discussing Grand Admiral Savit's treason. Thrawn admits that Admiral Ar'alani's Chiss force breached Imperial space in order to warn of an unknown threat against the Empire. While Lord Vader believes that the Grysks only threaten the Chiss Ascendancy, Thrawn counters that the Grysk presence in the Kurost sector proves that they have an active interest in the Empire. Thrawn warns that the Grysks were close to the Stardust project but the Emperor is confident they only stumbled upon one of Krennic's many supply lines."}, {"tag": "p", "text": "Thrawn warns the Emperor not to underestimate the threat posed by the Grysk, pointing out that the Grysks at the asteroid station were exploring new ways of suborning Imperial citizens. The Emperor reiterates that Stardust belongs to him and questions Thrawn's loyalty, doubting Thrawn's profession of loyalty to the Empire. Due to the threat of the Lothal resistance group and the young Jedi Ezra Bridger, the Emperor tells Thrawn that they will discuss his \"loyalty\" at another time."}, {"tag": "p", "text": "He tells Thrawn that he is sending the Grand Admiral instructions on a chamber that is to be constructed aboard the Chimeara; made from material from the Lothal Jedi Temple. The Emperor asks Thrawn to persuade Ezra to join him. He also orders Thrawn to return to Coruscant for a \"long, long talk\" once the \"business\" on Lothal is finished."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}