{"url": "Battle_of_RS-32", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Battle of RS-32"}, {"tag": "p", "text": "This battle of RS-32 was a battle fought during the Zaarin insurrection for the control of RS-32."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After repelling a Rebel attack on Rope 17 and ZA-13, which included Mag pulse warheads, Imperial High Command wanted more information about the weapon and hoped to be able to use it in the near future. Command also feared that Rogue Grand Admiral Zaarin may also have access to the weapon as well."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "3 TIE Defenders, one of which piloted by Maarek Stele arrived first and engaged the Z-95 Headhunter/Legends and Escort shuttle TT-109. When the defenses were removed, the TIE Defenders then launched their heavy rockets that broke through the station's shields forcing it to launch T-wings, which were soon shot down, and a transport Blue, which carried Officers and was disabled by Stele. The station called for reinforcements, which arrived firstly as X-wings, two Modified corvettes Rampart, A-wings and finally B-wings. The reinforcements however were held of by Maarek Stele, as assault transport Leopard boarded and captured the platform, while Escort shuttle Sigma 1 arrived to board the Blue and capture it and programmed the transport to Victory-class Star Destroyer Sceltor. By the time the reinforcements were finished of two more transports from Omega and Lambda boarded RS-32 to bring more troops to the platform."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the mission was a success, Zaarin had used the opportunity to destroy ZA-13, along with most of the remaining TIE Advanced facilities. This was a serious setback for the Empire's manufacturing capabilities. Even worse, was that Zaarin had successfully tracked down the strike team that was leading the attack on RS-32 and sprung a trap."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was first featured in the 1994 LucasArts video game Star Wars: TIE Fighter, in which players fly as Maarek Stele. The battle is depicted in the mission \"Capture Mag Pulse Weapon\", the fifth mission of the game's eighth tour of campaign, \"Strategic Warfare\"."}, {"tag": "p", "text": "This article assumes completion of all \"Primary\" and \"Secondary\" and \"Bonus\" goals completed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}