{"url": "Thranta_Rider", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Sentient species", "Category:Thranta Riders"], "nodes": [{"tag": "h1", "text": "Thranta Rider"}, {"tag": "p", "text": "Thranta Riders, also known as wing riders, were humanoid sapients who tamed flying thrantas and rode them, performing aerial circus-like shows around the world of Bespin. They liked to paint or tattoo themselves with complex patterns."}, {"tag": "p", "text": "During the New Jedi Order era, Jacen Solo fell down from Cloud City while being hunted by some Black Sun followers. If not for one of the Thranta Riders that saved him, he would have fallen down and been crushed from the pressure."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The mysterious sentients known as the Thranta Riders were smooth-skinned humanoids with four limbs: two arms ending with four-fingered hands, and two legs ending with two-toed feet. Their bodies were lanky and bony, with all their muscles outlined. The riders usually went naked, showing their smooth skin on which no hair grew. Their skin was of a natural ochre yellow hue, but they used to paint it with other colors, including red, pale yellow, blue, pale purple and green. They breathed the same air as Human beings and were capable of shedding tears as a response to an emotional state of sorrow."}, {"tag": "p", "text": "Many of them were dolichocephalic, with the head much longer than it was broad, while others had more Human-like cranial proportions. Though they lacked fleshy external ears, the thranta-riding people had ear holes on the sides of their head, which were left exposed. Their faces sported two forward-facing eyes, some of which were almond-shaped with yellow irises, while others were black and globulous, with no apparent iris. In the middle of their elongated visage, they had two tiny pug-like holes as a nose, and some individuals sported a long, pointed chin. The Riders had high-pitched, singing voices that came in handy to communicate with their domesticated thrantas. At least one known individual had shining ebony teeth that resembled polished gemstones."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A mysterious race, the Thranta Riders were discreet about their obscure yet fascinating culture. They usually remained silent, and, as such, only a few lucky visitors ever got a glimpse of their secrets. Even the Councilman Po Ruddle Lingsnot, who when he was part of the ruling bureaucrats of Cloud City, knew little about them. Lingsnot barely mentioned the Riders in his report describing the city, devoting a single paragraph and two brief side notes to them. One of the few details known about their intimate culture is that they referred to each other as \"Air Brother.\" The Riders would often paint or tattoo themselves with complex skin patterns and whorls of colors that made them look like optical illusions. Prior to going into a battle, they would apply war paints different from the regular ones. Although they usually wore no clothes at all, some of the Thranta Riders were noted for wearing fur loincloths and puttees."}, {"tag": "p", "text": "Their lives revolved around the breeding and keeping of thrantas, which they trained to perform \"sky rodeo\" spectacles, a combination circus, air show, and rodeo. In the skies around Cloud City, the Riders performed once per month, displaying their unique acrobatic feats to the public. The alien riders would leap out into the open sky, only to be caught again by their thrantas swooping down below them. Each of the Air Brothers shared a bond with his mounts, to the point where thrantas viewed their trainers as “head thranta” of their herd and guarded him from potential threats. Wranglers communicated with their thrantas through whistles or high-pitched electronic noise emulators, with different pitches or brief musical phrases being used as the signals for particular tricks."}, {"tag": "p", "text": "Despite their general secrecy toward strangers, the Riders were compassionate enough to assist those in danger. When the trainee Thranta Rider M'kim saw Jacen Solo, a young Jedi apprentice, fall from a Cloud City platform, he did not hesitate before swooping down and catching him. M'kim also expressed deep sorrow by the memory of other people falling. They were also willing to accept members of other species in their midst. Where this happened, the Riders would defend their new Air Brother as if he or she had always been one of them. When fighting became necessary, the Thranta Riders wielded wooden, club-like maces to beat off the attackers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Corellian entrepreneur Lord Ecclessis Figg commissioned the building Cloud City around 400 BBY, he ordered a group of young thrantas to transplanted from their native Alderaan to Bespin's atmosphere. Figg's wife being an Alderaanian, he wished to give her the thrantas as a gift to remind her of her homeworld. With the thrantas, Lord Figg also brought several Riders so they could take care of the flying creatures. By 27 BBY, the Riders and their mounts had become a popular attraction thanks to their monthly performances of sky rodeo. That year, a shape-shifting Shi'ido employed by the Twi'lek Dark Jedi named Reess Kairn traveled to Bespin and insinuated himself into a troupe of Riders. However, the bounty hunter Aurra Sing, who had been hired to eliminate Kairn and his minions, located the changeling impostor and hopped on an airhook in order to kill him. When the Shi'ido cried for help to his new Air Brothers, the Thranta Riders drew their clubs and prepared to fight Sing. One of them successfully threw the bounty hunter off her vehicle, but another was killed when Aurra Sing dropped down on his thranta to stop her fall. In spite of their efforts, the Riders could not stop the bounty hunter, and the Shi'ido was murdered."}, {"tag": "p", "text": "Over five decades later, in 24 ABY, the trainee Rider M'kim saved the life of a young Human by catching him out of the sky when he fell off Cloud City. That Human was none other than Jacen Solo, an apprentice to Jedi Master Luke Skywalker, who was chased by Black Sun agents and plummeted into the atmosphere while trying to escape them. Solo and M'kim then became friends, and the latter provided vital information Czethros—a cyborg who was one of the more powerful lieutenants in the Black Sun at the time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As part of the concept art designed by Ralph McQuarrie but ultimately not used for The Empire Strikes Back, the Thranta Riders were known as \"What-Nots.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}