{"url": "Thrawn_Ascendancy:_Lesser_Evil_(audiobook)", "categories": ["Category:Real-world articles", "Category:Future audiobooks", "Category:Canon audiobooks", "Category:Star Wars: The Ascendancy Trilogy"], "nodes": [{"tag": "h1", "text": "Thrawn Ascendancy: Lesser Evil (audiobook)"}, {"tag": "p", "text": "Thrawn Ascendancy: Lesser Evil is the upcoming unabridged audiobook of the canon novel of the same name. It will be published by Random House Audio on November 16, 2021."}, {"tag": "h2", "text": "Pulblisher's summary"}, {"tag": "p", "text": "The fate of the Chiss Ascendancy hangs in the balance in the epic finale of the Star Wars: Thrawn Ascendancy trilogy from bestselling author Timothy Zahn."}, {"tag": "p", "text": "For thousands of years The Chiss Ascendancy has been an island of calm, a center of power, and a beacon of integrity. Led by the Nine Ruling Families, their leadership stands as a bulwark of stability against the Chaos of the Unknown Regions."}, {"tag": "p", "text": "But that stability has been eroded by a cunning foe that winnows away trust and loyalty in equal measure. Bonds of fidelity have given way to lines of division among the families. Despite the efforts of the Expansionary Defense Fleet, the Ascendancy slips closer and closer toward civil war."}, {"tag": "p", "text": "The Chiss are no strangers to war. Their mythic status in the Chaos was earned through conflict and terrible deeds, some long buried. Until now. To ensure the Ascendancy's future, Thrawn will delve deep into its past, uncovering the dark secrets surrounding the ascension of the First Ruling Family. But the truth of a family's legacy is only as strong as the legend that supports it. Even if that legend turns out to be a lie."}, {"tag": "p", "text": "To secure the salvation of the Ascendancy, is Thrawn willing to sacrifice everything? Including the only home he has ever known?"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}