{"url": "Thrawn_Trilogy_audiobook_releases", "categories": ["Category:Cleanup", "Category:Legends articles", "Category:Legends audiobooks", "Category:Real-world articles", "Category:Star Wars: The Thrawn Trilogy"], "nodes": [{"tag": "h1", "text": "Thrawn Trilogy audiobook releases"}, {"tag": "p", "text": "There have been three different mass-market audiobook editions done of Timothy Zahn's Thrawn Trilogy as well as several more niche-market or foreign language adaptations."}, {"tag": "h2", "text": "Original abridged versions (1991-1993)"}, {"tag": "p", "text": "These versions were part of Random House Audio's line of abridged adaptations of the Bantam EU novels. They were performed by original trilogy actors Denis Lawson (Heir to the Empire) and Anthony Daniels (Dark Force Rising and The Last Command)."}, {"tag": "h3", "text": "Collected editions"}, {"tag": "p", "text": "The original abridged versions were re-released in one package as the Star Wars Audio Boxed Set on September 1, 1994. This release contained an additional cassette adapting Zahn's short story Hammertong: The Tale of the \"Tonnika Sisters\" which was not sold separately. Both plain packaging and a box adorned with a 3-D model of the Millennium Falcon were offered for this set."}, {"tag": "p", "text": "The original abridged versions were re-released again in one package as the Thrawn Trilogy Omnibus in 2000. This version did not include the Hammertong cassette."}, {"tag": "h2", "text": "G.K. Hall Edition (1995)"}, {"tag": "p", "text": "Some websites list an eight-cassette adaptation of Heir to the Empire released in March 1995 by G.K. Hall Audiobooks and read by Jim Frangione under ISBN 0783811004. No copy of this adaptation has been confirmed to exist, and whether this edition was ever actually produced is unknown."}, {"tag": "h2", "text": "Books on Tape unabridged editions (1995)"}, {"tag": "p", "text": "In 1995 Books on Tape released unabridged versions of the trilogy recorded by Larry McKeever."}, {"tag": "p", "text": "Each book was sold individually as a set of 11 to 13 cassettes. They are available at various libraries, but used editions only rarely appear for sale. Most likely, these were only made available to libraries and subscribers to Books on Tape's rental service and were never intended to be sold outright, explaining their scarcity."}, {"tag": "h2", "text": "Talking Book Publishers unabridged English-language editions for the blind (1992-2013)"}, {"tag": "p", "text": "These editions were recorded by Chuck Benson for the North American audience and by Hayward Morse in the United Kingdom. They are available on cassette and as downloads for the DAISY player used by the books-for-the-blind program."}, {"tag": "p", "text": "Under the special copyright law governing adaptations for the blind, Talking Book is not required to obtain permission from the original publisher to adapt the book, but the resulting editions are only available for borrowing through libraries and may only be used by the blind. These are legal products but not licensed Star Wars products. Sale of the cassettes to the public or the use of the recordings by non-blind individuals violates the law allowing for their production. Because these editions are not created with the involvement of Lucasfilm and its licensees and are not legally available for sale, they are often excluded from timelines and indexes of Star Wars collectibles."}, {"tag": "p", "text": "It is possible that more editions for the blind exist, which adapt the translations of the Thrawn Trilogy into other languages and were created under the law of the European Union, China, or other places."}, {"tag": "h2", "text": "20th Anniversary Edition unabridged editions (2011-2012)"}, {"tag": "p", "text": "As part of the 20th anniversary of Heir to the Empire, new unabridged audio versions were performed by Marc Thompson. A CD release of the new Heir to the Empire edition also took place but was only released to libraries and did not make it to the retail market."}, {"tag": "h2", "text": "German-language original audio dramas (2012-2014)"}, {"tag": "p", "text": "In Germany, Universal Music's IMAGA division was licensed to produce audio drama adaptations of the trilogy, which were sold on CD. These are full-cast, staged audio dramas using an original script based on the German versions of the books, not just audiobooks in which the book's text is read."}]}