{"url": "Thrawn%27s_guard", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Death trooper units"], "nodes": [{"tag": "h1", "text": "Thrawn's guard"}, {"tag": "p", "text": "A death trooper squad was assigned by Emperor Palpatine as the personal guard of Grand Admiral Thrawn, who was in command of the Imperial Seventh Fleet. They notably participated in the Battle of Atollon in which they attempted to capture the rebel leadership. Some time after the battle, the Spectres undertook a mission to Lothal to gain intelligence on the new TIE/D Defender Elite and infiltrated the Lothal Imperial airfield. When Thrawn arrived to watch a flight demonstration of the Defender Elite, the Spectres were exposed when trying to steal its flight data recorder. Thrawn ordered his death troopers to secure the fighter, but it was too late as it was already in the air. They were also present during the liberation of Lothal where Thrawn, the Chimaera, and Ezra all went missing into hyperspace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Seventh Fleet's commander, Grand Admiral Thrawn, was assigned by Emperor Palpatine a squad of death troopers that acted as his personal guard. Following Thrawn's meeting with Governor Wilhuff Tarkin, Thrawn and two of his guards accompanied him to LothalNet comm tower E-272. There, they helped to capture Fulcrum rebel Agent, ISB Agent Alexsandr Kallus. Thrawn's guards took Kallus aboard the Chimaera during the battle of Atollon, where they watched over him."}, {"tag": "p", "text": "Thrawn's guard joined him and his ground forces when he began his ground assault on Chopper Base. They ventured into the caves where they fought Captains Rex Garazeb Orrelios, Jedi Kanan Jarrus and other rebel troopers. Thrawn's guards surrounded the surviving rebels as Thrawn offered Captain Hera Syndulla and General Jan Dodonna to surrender. However, Thrawn's guard and Imperial forces came under attack by the Bendu's storm. Thrawn's guards worked in tandem with the remaining AT-AT in bringing down the Bendu. However, the Rebels and their leaders were able to make their escape. Thrawn's guard accompanied him to Bendu. There, they watched as Thrawn attempted to shot Bendu, but he disappeared into thin air."}, {"tag": "p", "text": "In 1 BBY,[source?] Thrawn's guard accompanied him and Governor Arihnda Pryce to Lothal's Imperial airfield to watch Commander Vult Skerris's test flight of the new TIE/d \"Defender\" Multi-Role Starfighter Elite starfighter. However, when they found Ezra Bridger at the airfield, Thrawn ordered his guards to secure the Elite. Unfortunately, Sabine Wren was able to commandeer it and rescue Bridger before the death troopers surrounded him. Two of Thrawn's guards were with him when he ordered the Chimaera to bombard Lothal's Capital City. However, they were taken out Commander Bridger. After this Ezra and Thrawn both went missing into hyperspace when, under orders form Ezra, the young rebel Mart Mattin transmitted on frequency zero. This resulted in a group of purrgil emegering from hyperspace. The Imperial fleet was taken out and the purrgil attached to the Chimaera, resulting in the ship, the purrgil, Thrawn, Ezra, and the entire crew disappearing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}