{"url": "Thrawn%27s_fleet", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Incomplete lists", "Category:Imperial fleets", "Category:Thrawn's fleet"], "nodes": [{"tag": "h1", "text": "Thrawn's fleet"}, {"tag": "p", "text": "After the Battle of Endor, with the death of Emperor Palpatine, and Darth Vader, the Galactic Empire went into chaos. Moffs, Admirals, and Generals became warlords and carved their own territory and made their splinter kingdoms. The Imperial war machine, was disabled with all of the warlords seizing whatever resources they could get their hands on."}, {"tag": "p", "text": "In 8 ABY, the return of Grand Admiral Thrawn, one of the last of the Grand Admirals, returned from his adventure from the Unknown Regions maintaining Empire of the Hand. Thrawn was able to gather up a large some fleet that could threaten the New Republic. With the New Republic's capture of Coruscant, Thrawn would be elected Supreme Commander of the Imperial Fleet by the Imperial Ruling Council on Orinda."}, {"tag": "p", "text": "The fleet would participate in many battles. Notably when Thrawn attacked Sluis Van shipyards, and up until the Battle of Bilbringi with the death of Thrawn. The remains of the fleet would flee to the Unknown Regions, when Thrawn's protégé, Captain Pellaeon would take command."}, {"tag": "p", "text": "During Operation Shadow Hand, with the resurrection of Palpatine, the fleet, still underneath the command of Pellaeon would be ordered to capture the planet Duro, there, much of the fleet would be destroyed."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Beginnings"}, {"tag": "p", "text": "Roughly five years after the Battle of Endor, the Battle where the Empire had been defeated by the Rebel Alliance and the Emperor killed, Thrawn returned from the Unknown Regions of the galaxy. On his return from the Unknown Regions, for the second time in his life, Grand Admiral Thrawn was a high ranking officer of the Imperial military, holding the position of Grand Admiral. Described by such historians as the young Devaronian history student Pollo Tipn as one of the most capable and cunning soldiers the Emperor commanded, Thrawn's tactical abilities saw him rise to the position of Grand Admiral despite being a Chiss, and despite the Emperor's xenophobia. Having had command of ships prior to the Battle of Endor, as a Grand Admiral, the defeat and scattering of the Empire saw Thrawn's access to a large fleet removed. Thrawn, however, still attempted to retain a number of ships, and to ensure he was able to take control of the Imperial Remnant, the Remnant of the Empire, as Grand Admiral and leader."}, {"tag": "p", "text": "Despite the fact that a number of commanders and warlords considered themselves above him in terms of importance, tactical prowess and ability, Thrawn was able to gather a fleet small in comparison with that of the Empire prior to the Battle of Endor, however large enough so as to be regarded as the new leader of the Empire, accepted by the Moffs, the governor's of Imperial sectors, and the Ruling Council, the Council composed of numerous Imperial Advisors. The core of Thrawn's fleet, which he was beginning to build, was his personal armada, built around his flagship Chimaera and five other Imperial-class Star Destroyers."}, {"tag": "h3", "text": "Beginning the offensive"}, {"tag": "p", "text": "The first beginnings of the campaign involved a number of Imperial missions to the planet Bimmisaari, to capture the pregnant Leia Organa Solo, the sister of Jedi Knight Luke Skywalker and a member of the ruling body of the New Republic at the time, the Provisional Council. Thrawn, unknown in both name and position to the New Republic at the time, began mobilizing the Imperial Remnant, and his fleet. The first combat a member ship of Thrawn's fleet saw was on the planet Nkllon, where the Judicator attacked the mobile mining facility, Nomad City. This facility was owned by the human Lando Calrissian, friend to Organa Solo and a former General in the Rebel Alliance during the Battle of Endor. During the Raid on Nomad City, the outpost was raided and the Empire stole fifty-one mole miners, large mining devices."}, {"tag": "p", "text": "Criminal boss Talon Karrde rescued Luke Skywalker from searching Imperial forces, before subduing him and imprisoning him in their base on the planet Myrkr. Han Solo, husband of Leia and former criminal, and Lando Calrissian attempted to find Karrde, and were tipped off by a member of his organization as to the location of the base on Myrkr. After Skywalker's escape from his imprisonment, the Chimaera came out of orbit above the planet at the same time that a member of Karrde's organization gave pursuit. Landing craft were dispatched by the Chimaera to Karrde's camp. Patrols were sent to capture Luke Skywalker and Mara Jade, member of Karrde's group. Planning from Karrde's group, Han and Lando allowed Skywalker and Jade to be rescued, the Empire and the Chimaera not taking them prisoner."}, {"tag": "p", "text": "The next time the fleet saw action was in the first major battle of Thrawn's campaign, the raid on the planet Sluis Van, in an attempt to gain a number of ships for his cause. Using a cloaking device from the Empire's private storehouse on the planet Wayland, Thrawn cloaked his warships and the mole miners stolen from Nkllon and infiltrated the shipyard. Using the mole miners to burn into the command centers of the ships, Thrawn would have been able to steal the entire fleet from the New Republic, however Calrissian activated the mole miners thrusters, using a control code, to render the ships Thrawn was trying to steal inoperable. Of Thrawn's fleet, five of the six Imperial Star Destroyers of were present at the battle. The ship missing from the engagement was the Judicator, being refitted after the strike on Nkllon. These five ships were supported by a close support squadron of twelve Strike-class medium cruisers, and a picket line of twenty-two Carrack-class light cruisers, with thirty TIE squadrons deployed in the fighter screen."}, {"tag": "h3", "text": "The main offensive"}, {"tag": "p", "text": "After the Battle of Sluis Van, Han Solo discovered former Rebel General Garm Bel Iblis and his private militia. Part of the ships in Bel Iblis' militia were made up of those from the Katana fleet, a fleet of ships supposedly lost for some time. The Empire, however, wished to expand their ships, as Thrawn had procured the technology to be able to grow clones. Needing ships to be crewed by the clones, Thrawn jumped at the chance to gain such ships. Reaching the man who knew the location of the ships, Hoffner, first, the Empire were able to make their way to the location of the Katana fleet. The New Republic, however, eventually learnt of the location, and so were able to reach the location too. Finding the Empire already there, the Battle for the Katana fleet ensued, with the Judicator participating as part of Thrawn's personal Armada, in addition to the Imperial-class Star Destroyer Peremptory. With the Empire's benefit of having reached their first, they managed to move most of the ships before the New Republic had arrived. The New Republic's tactical victory saw the Judicator, in terms of Thrawn's personal armada, driven off, and the Peremptory destroyed."}, {"tag": "p", "text": "This saw Thrawn's fleet expanded, allowing the incoming clones to have a great deal of ships they were able to crew. With these new ships, Thrawn stepped up his campaign a gear, launching a three pronged attack on the planets Crondre, Ando, Filve and Ord Pardron. A great majority of the ships in Thrawn's fleet participated, the Imperial-class Star Destroyer Bellicose attacking Ando, Filve being attacked by the Judicator and Crondre the Nemesis, an Imperial-class Star Destroyer from Thrawn's personal Armada. Thrawn's flagship, the Chimaera, attacked the planet Ukio, in addition to the attack. With the main aim of the three pronged attack being to exhaust the New Republic base on Ord Pardron, so it could be easily taken, the attacks were a success. Insane clone of a long dead Jedi Master, Joruus C'baoth, had been calling for Thrawn to capture Leia Organa Solo and her unborn twins for him so he could \"train\" them. After a strike team sent to the New Republic capital of Coruscant failed, Thrawn agreed to take the fleet there in person. Launching an attack on Ord Mantell to ensure the Republic failed to anticipate the attack on Coruscant, Thrawn took the Chimaera and another Imperial-class Star Destroyer in his personal Armada to Coruscant. In addition to the other ships, this made a strong attack force on the New Republic capital."}, {"tag": "p", "text": "Laying siege to Coruscant, using asteroids orbiting the planet to stop ships daring to enter or leave, Thrawn and his fleet were able to cut off Coruscant from the rest of the galaxy. Having launched a successful second attack on Calrissian's Nomad City, attack on Generis and on Xa Fel, the next major battle was the Battle of Bilbringi. All of Thrawn's personal Armada participated in this battle, in addition to the two Immobilizer 418 cruisers Sentinel and Constrainer. Despite, at first, the battle seemingly going well for the Empire, it soon turned around. The assassination of Thrawn at the hands of his Noghri bodyguard Rukh saw the Empire leaderless, and Thrawn's second in command, Captain Gilad Pellaeon, gave the order to retreat. This saw the end of the Thrawn campaign, with the Chimaera, the former flagship, now being under the control of Pellaeon."}, {"tag": "h2", "text": "Key ships of the fleet"}, {"tag": "h3", "text": "Thrawn's personal armada"}, {"tag": "p", "text": "Thrawn's personal armada consisted of six Imperial-class Star Destroyers. The first, Chimaera, was the flagship and prime ship of Thrawn's personal armada and, indeed, Thrawn's fleet in general. Commanded by Thrawn himself, with Pellaeon as his deputy, the Chimaera saw action in numerous battles of the campaign. Death's Head, under the command of Imperial Captain Harbid, saw action at such battles as the assault on the New Republic base of Ord Pardron, the Siege of Coruscant and the Battle of Bilbringi, where it made its last appearance. The third ship in Thrawn's personal armada, Inexorable, saw action at the battles of Bpfassh, Sluis Van and Bilbringi. The Captain of the Inexorable wasn't known."}, {"tag": "p", "text": "The fourth ship in the fleet, Judicator, was under the command of Captain Brandei, and saw action in three battles of the campaign. Having been one of the only ships in Thrawn's personal armada to have seen action at the Battle of Endor, Judicator first saw action under Thrawn with the attack on Nomad City. Judicator was also present at the Battle for the Katana fleet, where Captain Brandei became incensed at the New Republic for the destruction of the Peremptory. The final battle Judicator saw in the campaign was, like many of the fleet, the Battle of Bilbringi. The penultimate ship in Thrawn's personal armada, the Nemesis, saw action only at Sluis Van and Bilbringi. The final ship in Thrawn's personal armada, the Stormhawk, saw action in exactly the same battles as the Nemesis."}, {"tag": "h3", "text": "Other Imperial-class Star Destroyers"}, {"tag": "p", "text": "Three other Imperial-class Star Destroyers were part of the main fleet yet not of Thrawn's personal armada. The first, the Bellicose, was Captained by Imperial captain Aban. The three pronged attack on Ukio saw the Bellicose strike at the world of Filve."}, {"tag": "p", "text": "The second ship in such a category was the Peremptory. It was destroyed by Han Solo in the battle for the Katana fleet. The final ship, the Relentless, was Captained by Imperial captain Dorja. This ship too, along with the Judicator, saw action at the Battle of Endor. The Relentless was first part of the battle over New Cov tangling with three of Bel Iblis's dreadnaught cruisers. Later, it would assist in the diversionary attacks necessary to take Ukio. The ship's final appearance was at the Battle of Bilbringi, where the Thrawn campaign came to an end."}, {"tag": "h3", "text": "Victory-class Star Destroyers"}, {"tag": "p", "text": "Two Victory-class Star Destroyers were a part of Thrawn's fleet, neither seeing much action under Thrawn. The Adamant, the first of the two, was dispatched to the planet Abregado-rae to intercept Mara Jade. It saw very little combat under Thrawn, however remained as a part of the fleet."}, {"tag": "h3", "text": "Interdictor-class Star Destroyers"}, {"tag": "p", "text": "Three Interdictor-class Star Destroyers were a part of Thrawn's fleet, none of them being a part of Thrawn's personal Armada. Commanded by Imperial Lieutenant Dezon, the Constrainer was first used in Thrawn's first attempt to capture Luke Skywalker, who he felt was a vital part of the New Republic. This attack was unsuccessful, however the Constrainer saw action again in the attempt to capture Talon Karrde on Myrkr, however was unsuccessful in that venture too. The final battle the Constrainer participated in was the Battle of Bilbringi, and the defeat of Thrawn's fleet."}, {"tag": "p", "text": "The second Interdictor-class Star Destroyer was the Rampart, a cruiser in the Imperial Navy. The third, and final, was the Sentinel, which participated too in the Battle of Bilbringi."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The armada was mainly used by the Grand Admiral as a personal flying column for planetary conquests and long-range strikes, as at the planets Sluis Van or Ukio, which could also combine with other forces in campaign warfare, and serve as the centrepiece of larger fleet formations for major set-piece battles."}, {"tag": "p", "text": "All in all, Thrawn's armada can perhaps be compared for its size and significance to Darth Vader's Death Squadron—albeit without a Super Star Destroyer command ship. His amassed fleet was noted as being only a small portion of the Empire's once unimaginably vast war fleet, which made its great success against the New Republic all the more astounding."}, {"tag": "p", "text": "Nevertheless, many details still remain unclear. Even the armada's operational designation is unknown, and while Chimaera had apparently been serving for the previous five years as command ship for the remnants of the fleet deployed at Endor, it is uncertain what relationship this armada bore to that once-larger formation; Captain Brandei of the Judicator was likewise a veteran of Endor, but during the intervening years, at least one of the Star Destroyers in the squadron, Inexorable, had apparently been serving with the Grand Admiral in the Unknown Regions."}, {"tag": "p", "text": "Needless to say, Thrawn's front-line fleet was not limited to a half-dozen Star Destroyers. Other Imperial-class and Victory-class Star Destroyers are known to have operated in direct support of the armada, and as tactics required, the ships of the armada could be intermingled with additional forces. For example, in a series of synchronized strikes against planets near Sluis Van, in the preliminaries to the assault on the shipyard described above, the ships of the armada were grouped with other Star Destroyers and then temporarily reorganized into three battlegroups of four, with each Star Destroyer being escorted by a dedicated task force of approximately five smaller ships."}, {"tag": "h3", "text": "Naval"}, {"tag": "p", "text": "Imperial-class Star Destroyers, Victory-class Star Destroyers, Carrack-class light cruisers, Strike-medium class cruisers, Immobilizer 418 cruisers, Lancer-class frigates. Star Galleon-class frigates and Interdictor-class Star Destroyers served as primary warships for the fleet."}, {"tag": "p", "text": "After the Battle for the Katana fleet, Dreadnaught-class heavy cruisers (179) were added to the fleet."}, {"tag": "p", "text": "At least four Golan II Space Defense Platforms were used by the fleet. More could have been used as well. Thrawn did at least have another one the was equipped with cloaking technology."}, {"tag": "p", "text": "Thrawn was able to have access to three starship manufacturing facilities, these included; Yaga Minor shipyards, Ord Trasi shipyards, and Bilbringi shipyards."}, {"tag": "p", "text": "TIE/LN starfighters, TIE/sa bombers, TIE/IN interceptors were the primary starfighters used by the fleet. Scimitar assault bombers would later be used in the fleet."}, {"tag": "p", "text": "F7 \"Landing Brick\" Drop-Ships would be used notably, along side Lambda-class T-4a shuttles, Gamma-class assault shuttles, Beta-class assault shuttles and various other forms of assault shuttles."}, {"tag": "p", "text": "Imperial Naval troopers would be used as well, notably guarding, maintaining military bases, and Star Destroyers."}, {"tag": "p", "text": "The 181st Imperial Fighter Wing, Black Wing Squadron, Cloak Force, and Scimitar assault wing served within the armada, with the 181st Wing and Black Wing serving at the Battle of Bilibringi."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "With Thrawn being Supreme Commander, Thrawn was able to gather up a large armed force of Imperial Army."}, {"tag": "p", "text": "All Terrain Armored Transports, All Terrain Scout Transports, and All Terrain Personal Transports served as primary walkers for the fleet. LAVr QH-7 Chariots, HAVr A9 Floating Fortresses, and Swift Assaults 5, PX-4 Mobile Command Bases, S-1 FireHawke Heavy Repulsortanks, Imperial-class 1-H Repulsortanks, HAVw A5 Juggernauts, Repulsor Scouts, and 74-Z speeder bikes, and and armored transport carriers were also used."}, {"tag": "p", "text": "Imperial Army troopers would be used to guard planets underneath Thrawn's control."}, {"tag": "p", "text": "With Thrawn commanding the Stormtrooper Corps, he was able to command the remnants of the 501st Legion during his campaign."}, {"tag": "p", "text": "Storm commandos, alongside Noghri Death Commandos were used on specialized missions."}, {"tag": "p", "text": "Stormtroopers, Land assault troopers and Biker Scouts were used for conquests, and guarding planets. During the attack on Sluis Van Shipyards, Zero-G Assault Stormtroopers were used to board the battleships. Radiation zone assault troopers were used to attack the radioactive surface of Qat Chrystac."}, {"tag": "h3", "text": "Intelligence"}, {"tag": "p", "text": "Although Imperial Intelligence was disbanded, with the supposed death of Director of Imperial Intelligence Ysanne Isard, Imperial Intelligence still existed, and was used heavily by Thrawn."}, {"tag": "p", "text": "Major Molo Himron was handpicked by Thrawn to go to Coruscant with his Imperial commandos to capture Leia Organa Solo's twins. Their secondary objective was the neutralize Mara Jade who defected to the New Republic."}, {"tag": "p", "text": "Before Thrawn began striking at New Republic bases, Thrawn learned of Delta Source, an audio intelligence recording devices installed with the trees within the Imperial Palace on Coruscant."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "After discovering the Mount Tantiss on Wayland, Thrawn made use of the cloaking technology, and spaarti cloning cylinders."}, {"tag": "p", "text": "The cloning cylinders made use for building up Thrawn's army, since his fleet was short on soldiers."}, {"tag": "p", "text": "The cloaking devices at Thrawn's disposal were used heavily, at least several starships were cloaked, and Thrawn would use the cloak on asteroids in order to use them as a siege weapon for his retaking of Coruscant."}, {"tag": "p", "text": "During the Thrawn Crisis, Thrawn's fleet utilized several siege platforms stationed above the planet Qat Chrystac. It deployed Imperial Radiation Troopers down below the planet's surface in order to destroy the secret New Republic base."}, {"tag": "p", "text": "Torpedo Spheres were used within the fleet."}, {"tag": "p", "text": "During the Battle of Woostri, Thrawn used attack cruisers with cloaking devices to do a surprise attack on the planet."}, {"tag": "p", "text": "At the Imperial shipyards at Bilbringi system, crystal gravfield trap was kept there by Thrawn. Shield barriers were also kept there as well for defense purposes."}, {"tag": "p", "text": "Ysalamir was used heavily by Thrawn's forces to combat force-sensitives."}, {"tag": "p", "text": "During Raid on Nomad City, Plasma-Jet Mole Miners (51) were stolen, they would be used to hijack New Republic ships at Sluis Van Shipyards."}, {"tag": "h2", "text": "Known officers"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Chimaera along with Inexorable, Death's Head, Stormhawk and Nemesis appear together in mission 6:2 of Star Wars: X-Wing Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}