{"url": "Battle_of_Remitik", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles in the Wazta sector", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Remitik"}, {"tag": "p", "text": "A battle was fought in 3 ABY in the Remitik system during the Galactic Civil War. In preparation for the upcoming Battle of Hoth, the Empire attacked and destroyed a small Rebel repair yard located near Remitik. When Rebel forces tried to retreat from Hoth, they were ambushed there by the Imperial forces. In the ensuing battle, all Rebel forces were destroyed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 ABY, the Galactic Empire finally discovered the location of the elusive Rebel Alliance's new base of operations, the icy planet of Hoth. As most of the Imperial armada prepared to attack there, a small force was sent to the nearby Remitik system on a separate assignment. The mission was twofold: the first objective was to destroy a small Rebel repair yard located there, but the main objective was to ambush any Rebel forces retreating from Hoth and destroying them."}, {"tag": "p", "text": "Since most of the capital ships were relocated to Hoth, the Remitik strike team had to rely on Assassin-class corvettes as carrier ships for TIE fighters. Among the pilots chosen for the assignment was a pilot with the callsign Alpha 2, who had been previously only undergoing training in flight simulators and was excited to embark on their first actual combat assignment."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Empire's Assassin-class corvette Prowler 1 was the first to arrive in the area, and it immediately launched its complement consisting of three TIE fighters from Alpha Squadron. The Rebel repair yard's defenses consisted of only two active T-65 X-wing starfighters from Red Squadron. Alpha Squadron eliminated the two Rebel craft and proceeded to attack the repair yard itself, which consisted of four Class-A cargo containers—one used for storage, one as crew quarters and two as working area—floating in space. At the time, a number of Rebel ships were also undergoing repairs there, including three BTL Y-wing starfighters from Gold Squadron, three RZ-1 A-wing interceptors from Blue Squadron and two Lambda-class T-4a shuttles from Lambda Squadron."}, {"tag": "p", "text": "All nine craft were disabled and non-operational. As Alpha Squadron moved in to attack the Rebel base, Imperial corvette Prowler 2 also entered the system, followed by Rebel shuttle Lambda 3, carrying technicians. After quickly dispatching of its pursuer, Prowler 2 launched a wing of TIE/sa bombers from Beta Squadron. Imperial forces first eliminated the disabled Rebel fighters, then the shuttles and finally completely destroyed the repair yard itself. They then prepared to ambush any Rebel craft retreating from the Battle of Hoth, which was raging at the same time."}, {"tag": "p", "text": "The wait was not long, as Rebel craft started entering the area one by one, most of them heavily damaged and with their deflector shields down. Four BFF-1 bulk freighters, Liber 1 through Liber 4, carrying a cargo of grain and supplies, were destroyed by the TIE fighters. Three CR90 corvettes carrying Rebel troops and wounded personnel—the Hornet, the Typhoon and the Warrior—followed suit. The capital ships were being assisted by six Lambda-class shuttles as well as three Y-wings and three X-wings that made attack runs on Imperial corvettes, while three A-Wings engaged the TIE Fighters."}, {"tag": "p", "text": "The Empire eventually responded by sending its corvettes Prowler 3 and Prowler 4 into battle, which launched another wing of TIE bombers, Delta group, as well as TIE interceptors from Gamma group. When the Rebel fleet was nearly wiped out, A-Wings from Rogue group attempted to turn the tide of the battle. Alhough they proved to be a challenge for the Imperial fighters, they were destroyed as well as the rest of the Rebel forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in the 1994 demo version of the Star Wars: TIE Fighter video game. The battle is unique to the demo and does not appear in the full game. The main objective of the mission is the destruction of the Rebel repair yard, the secondary objective is the destruction of all Rebel starships entering the area, and the bonus objective is the elimination of A-wings from Rogue group."}, {"tag": "p", "text": "This article assumes 100% completion of the demo, meaning that all Rebel ships were destroyed. The survival or destruction of other Imperial craft excluding Alpha 2, the player character, is completely random and largely dependent on the player's performance, therefore the rate of Imperial casualties is hard to determine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}