{"url": "Thull_Yularen", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Educators", "Category:Humans", "Category:Judicial Forces officers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Thull Yularen"}, {"tag": "p", "text": "Thull Yularen was a Human male who served in the Judicial Forces of the Galactic Republic and later taught at the Anaxes Citadel on the planet Anaxes. He believed that military cadets should aspire for perfection and be sufficiently trained. Yularen's service became an inspiration for his son, Wullf, who later had an extensive military career of his own."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Thull Yularen was a Human male whose family, which hailed from the planet Coruscant, possessed sizable influence in the waning years of the Galactic Republic. Yularen served as a member of the Republic's Judicial Forces, working in the organization for a substantial amount of time. After leaving the Judicial Forces, he established himself as a renowned naval instructor at the Anaxes Citadel on the planet Anaxes."}, {"tag": "p", "text": "Yularen's son, Wullf, showed an early interest in his father's career. In their estate in Anaxes's Sirpar Hills, the elder Yularen imparted his knowledge to his son, answering Wullf's questions about historical naval engagements and the like. Wullf Yularen went on to serve a distinguished career that included stints as an admiral in the Republic Navy and as an intelligence operative in the Imperial Security Bureau of the Galactic Empire, the Republic's successor state."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an instructor, Yularen expected the cadets under his charge to achieve perfection, knowing that military personnel who lacked sufficient training were destined to fail in the line of duty. He was regarded as a legend for his service in the Judicial Forces and on Anaxes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Thull Yularen, albeit unnamed, was first mentioned in Wullf Yularen's biography in Star Wars: The Clone Wars – The Official Episode Guide: Season 1, written by Jason Fry and released on October 29, 2009. Fry later included the character—and identified him by name—in The Essential Guide to Warfare, a reference book published on April 3, 2012. Yularen originally had a larger role in the book; several sections cut from the final draft were attributed as in-universe writings of his."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}