{"url": "Battle_of_Restuss", "categories": ["Category:Legends articles", "Category:Battles in the Chommell sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Restuss"}, {"tag": "p", "text": "The Battle of Restuss was a major battle of the Galactic Civil War primarily fought in the city of Restuss on the swamp moon of Rori between forces of the Galactic Empire and the Alliance to Restore the Republic. The battle erupted at least a year after the Battle of Yavin in 1 ABY, and continued until at least the time of the Battle of Hoth in 3 ABY. The battle was largely sparked by the development of an Imperial research project called the Star Core. Devised by Galactic Emperor Palpatine, the handheld device was designed to power a Death Star scale operation. The Rebellion, eager to claim the Star Core for themselves, established a base north of Restuss in preparation for a major assault on the city. The Empire responded by evacuating the city of its civilian population, and building up a base of their own south of the city. In preparation for a large battle, both the Empire and Rebellion oversaw missions to other parts of the galaxy, eliminating ground forces, fighting for control in various star systems, and mining for resources from asteroids in the Kessel system and deep space. After much preparation, both sides finally engaged in a full scale battle in the streets and skies over Restuss. During the climactic battle, the Star Core unexpectedly detonated, resulting in mass devastation to the city. With Restuss in ruins, the battle continued, but neither side achieved a clear and decisive victory. With the Star Core destroyed, both sides struggled to maintain control over the ruins so that they could salvage the remains of the Imperial research project. The battle resulted in increased hostilities between Imperial and Rebel forces in other parts of the galaxy, including Naboo, Corellia, and Talus. The battle also saw the use of new technology, including Crusader armor manufactured by the Black Sun crime syndicate."}, {"tag": "h2", "text": "The prelude"}, {"tag": "p", "text": "Restuss was the second of two major cities built on Naboo's swamp moon of Rori during the time of the Galactic Republic. Its history was mired in tragedy, as Restuss was originally used as a quarantine zone for those affected by the Brainworm Rot Plague. When the plague was finally vanquished, the Republic ordered that the city remain quarantined, out of fear that the disease might somehow resurface. This angered the citizens of Restuss, prompting an unarmed revolt. Huge portions of Restuss, including the hospital and detainment center, were razed to the ground in the ensuing riots. The Republic reluctantly lifted the quarantine, and Restuss was rebuilt around a small starport, which served as the town's primary meeting place and financial center."}, {"tag": "p", "text": "With the rise of the Galactic Empire, Restuss served as little more than an isolated artist's retreat, largely removed from Naboo politics. The populace rarely discussed the raging Galactic Civil War between the Empire and the Alliance to Restore the Republic, but when they did, they discussed it as though the conflict was taking place in some far distant corner of the galaxy. All that would change however, when at least a year after the Battle of Yavin in 1 ABY, the Galactic Empire started using a secret research facility in the city of Restuss to develop an energy cell capable of powering a Death Star scale installation. This power supply, known as the Star Core, was devised by Galactic Emperor Palpatine and was designed to be small enough to fit in the palm of a hand."}, {"tag": "p", "text": "Operatives of the Rebel Alliance, conducting reconnaissance in the Naboo system, discovered the facility used by the Empire to develop the Star Core. The Rebellion recognized the unimaginable energy supply the Star Core could provide, and concocted a plan to not only deprive the Empire of this power, but to claim it as their own. The Rebellion hoped that possession of such a power source could be used as leverage to convince undecided or frightened star systems to join their cause. With this in mind, the Rebellion began construction of a small base north of Restuss, which they planned to build up in preparation for a larger offensive on Restuss. When the Empire learned that information regarding their secret project was in the hands of the Rebel Alliance, they issued an encoded Imperial Directive calling on Imperial forces in the Naboo system to report to their small base south of the city."}, {"tag": "p", "text": "Sensing the buildup in military tensions, the Galactic Empire ordered a civilian evacuation of Restuss. East of the city, outside the main metropolitan area, a new spaceport was constructed which served as a safe haven for some of the city's residents and visitors. Marles Jacobe of the Corellia Times traveled to this spaceport, and interviewed spacers on their thoughts about the military buildup and evacuation. News of the escalating situation reached as far as the Outer Rim Territories. Even citizens in Mos Eisley were not immune from an Imperial draft which threatened to send them to the front lines of Restuss. In Naboo's capital city of Theed, an Imperial stormtrooper eagerly awaited the opportunity to be shipped to Restuss, and show off the might of the Emperor. Meanwhile, volunteers on both sides of the conflict flocked to Rori to assist either the Empire or Rebellion in building up their bases on the opposite sides of Restuss. In preparation for the major Rebel offensive, Lieutenant Pofko tasked loyal weaponsmiths with manufacturing rocket launchers and E-11 carbines for the Imperial Army. Lieutenant Ingri of the Rebel Alliance similarly commissioned the manufacturing of these same weapons for their Rebel troops. However, the scope of the oncoming battle was not just limited to the isolated city of Restuss. A Zabrak Imperial lieutenant named Wholding and a Nautolan lieutenant of the Alliance named Romer sent miners to the Kessel system and deep space to harvest asteroids for obsidian ore and organometallic gas. These raw materials were then used to aid in the construction of their respective bases outside the city."}, {"tag": "p", "text": "To secure the space above Rori, Lieutenant Wulf of the Imperial Navy tasked a pilot with crippling the Alliance Fleet in the Corellian system, so that Imperial capital ships could be successfully mobilized. The Empire succeeded in this objective, but the Rebellion was not willing to let go of their superiority over Corellia so easily. When Imperial spies learned that the Rebellion was preparing to bring in reinforcements from the Karthakk system, Lieutenant Wulf tasked his loyal pilot with preemptively destroying at least fifteen of their T-65 X-wing starfighters and Z-95 Headhunters before they ever had the chance to enter hyperspace and reach the Corellian system. Despite the Empire's success in this endeavor, a Twi'lek lieutenant of the Alliance named Grollo dispatched a pilot of her own with disrupting the Imperial fleet above Corellia. When they succeeded in doing so, she also dispatched the pilot to destroy fifteen TIE/LN starfighters in the Yavin system before they could be sent as backup to the contested war zone above the Core World."}, {"tag": "p", "text": "Meanwhile, the Empire and Rebellion entered what they both believed to be an exclusive deal with the Black Sun organization. However, the unscrupulous crime syndicate instead used the escalating conflict as an opportunity to profit from both sides. With the recent advances they made at the Death Watch installation on Endor working on Mandalorian technology, the Black Sun managed to create two new series of armor. To hide the fact that they were playing both sides, the Black Sun created a version for both the Empire and Rebellion, but made sure that the armors were different enough so that battlefield inspections would not reveal their origins. The suits of armor, reminiscent to those worn by the Mandalorians, was known as Crusader armor. The Black Sun sold the Mark III series to the Empire, and the Mark II series to the Rebellion. The latter made use of the the Mark II helmets for their Rebel Elite Commandos. Through the form of a commendation program, officers on both sides distributed this armor to soldiers who had proven themselves to their respective faction. To limit the effectiveness of a Rebel ground assault, Lieutenant Gregor ordered the killings of numerous members of the Alliance Army and Alliance Special Forces throughout the galaxy, before they had a chance to be sent to the front lines of Restuss. To increase their chances of victory, Lieutenant Olvog likewise ordered attacks on members of the Imperial Army, and even a number of dark troopers, which the Rebellion feared would be put to use in the streets of the beleaguered city. Ultimately, these peripheral conflicts culminated in the completion of the Rebel and Imperial military bases to the north and south of the city. With tensions reaching a critical point, and both sides primed for battle, the march to Restuss would soon begin."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In preparation for a climactic battle, Imperial and Rebel forces began assembling in and around their respective bases. Both sides were about to commence a large invasion of the city to gain full control of Restuss, and secure the Star Core for their own purposes. Soon enough, both factions were given the call to march into the city. As the two opposing forces advanced toward the city, the skies above Restuss erupted in turmoil as Imperial TIE fighters and TIE/sa bombers engaged the Rebel's T-65 X-wing starfighters in a pitched battle. Imperial Lambda-class T-4a shuttles could also be seen participating in the skirmish low above the city. Meanwhile, as the Imperial and Rebel ground forces entered the deserted streets of Restuss, the two opposing forces encountered one another. Suddenly, the once peaceful city of Restuss was now witness to a violent conflict between the opposing factions of the Galactic Civil War. The Battle of Restuss had truly begun. In addition to the sizeable number of Imperial ground forces, the initial stage of this battle saw the use of many All Terrain Scout Transports and at least one All Terrain Armored Transport. Despite the Rebel's lack of similar walkers during the battle, they were nonetheless successful in holding their own against the better equipped Empire."}, {"tag": "p", "text": "Although one faction was gaining a tactical advantage in the battle, it was a moot point. Neither side was truly succeeding in securing the powerful Star Core, and the battle would soon take a dramatic turn for both sides. The Star Core, still in development and highly unstable, somehow detonated during the course of the battle between the Imperial and Rebel forces. Suddenly, there was a blinding flash, and a wave of energy pushed through the entirety of the city. The blast wave was slightly warm, as it passed through the many soldiers of Restuss. While the blast wave itself did not appear to harm the combating forces, the same could not be said for the city itself. When the blast subsided, and the view suddenly cleared, witnesses of the battle saw the once pristine and beautiful architecture of Restuss transformed into a massive heap of charred ruins. The massive blast caused by the Star Core had left all of Restuss, including the great theater, city hall, and even the starport to burst aflame in smoldering ruins. Despite the tremendous destruction that was just witnessed, the surviving Imperial and Rebel forces resumed battling one another. Imperial reinforcements in the form of stormtroopers, officers, and Urban Assault dark troopers were deployed by Imperial transport crafts landing in the middle of the war zone. The Rebellion likewise relied on an influx of Rebel troopers, special forces, and elite commandos brought in by their own GR-75 medium transports, and at least one other type of transport ship. The battle even saw the arrival of an Emperor's Hand, a lightsaber wielding Force-sensitive agent named Aralina Silk. However, she ended up getting killed by a group of fighters, only to have her Jinsu Razor lightsaber fall into the hands of a Force-sensitive member of the group. The Battle of Restuss had already seen heavy losses on both sides, the destruction of Restuss, and the apparent loss of the Star Core. However, the battle had only just begun."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the destruction of Restuss, soldiers on both sides of the conflict were awarded the Imperial and Rebel Medals of Resolution for their part in the initial stage of the battle. The more prestigious Imperial and Rebel Grand Medal of Resolution was awarded to soldiers of the faction which had achieved a greater tactical success during the initial stage. However, neither side had yet won the battle itself. With both the Empire and Rebellion failing to yet secure the Star Core, the Battle of Restuss merely transformed into a protracted, smaller scale conflict between the opposing forces of the Galactic Civil War. Indeed, despite the devastation wrought by the Star Core, the Rebel Alliance was still confident that not all was lost. The Nautolan Captain Redding ordered Rebel soldiers to clear the streets of Imperial troops and Urban Assault dark troopers, so that salvage teams could safely search rubble for material related to the Imperial research project. A Force-sensitive Human named Stoer Kilos, who had witnessed the explosion, expressed doubt that the Star Core should be recreated, if it were even possible to do so. He did not believe much of the project would be salvageable, and that trying to recreate it would be a dangerous prospect. After all, if the Star Core were at full power, it could have wreaked devastation to the entire moon of Rori itself. Nevertheless, Kilos decided to enlist his services to the Rebel cause, and reported to the Chiss named Captain Voldez in the Rebel base near Restuss."}, {"tag": "p", "text": "From this base, Captain Voldez oversaw plans to destroy antennae around Restuss, placed by the Imperial Army to coordinate their troops and spy on the Alliance. She also oversaw the elimination of key Imperial officers behind the conflict in Restuss, including a Zabrak Imperial Intelligence officer named Admiral Grot. Before he could relocate to a new safehouse, Alliance spies pinpointed his location, and a small team of Rebel commandos used gas to drive the Admiral out from his building. Despite being accompanied by a contingent of stormtroopers and Urban Assault dark troopers, the vicious Zabrak was defeated by a Rebel soldier under the employ of Captain Voldez. When the soldier reported back to Voldez, news was received that Admiral Grot had somehow survived the attack. The incredulous Rebel soldier vowed to find Grot again, so that he could be fully eliminated. Meanwhile, the Bothan Captain Klork oversaw the disruption of Imperial Army supply convoys moving collected research material from the rubble of Restuss to their base. Captain Klork tasked fellow Rebels with ambushing their supply specialists, and stealing the research material. To track down this lost research material, the Imperial Army placed survey arrays around the ruins of Restuss. Captain Klork saw to it that the Rebels hack into these systems, in order to gain control of them, and find the research material for themselves."}, {"tag": "p", "text": "From their base south of Restuss, the Galactic Empire oversaw plans to counter these Rebel initiatives. Captain Exov recognized the Rebel's attempts to hack into their sensor arrays, and ordered Imperial troops to recapture them. He also saw to it that the Empire cripple the Rebel supply lines, and secure their valuable resources in order to strengthen the Imperial Army. The female Imperial Zabrak named Captain Roth wanted to ensure that the Rebellion would not get their hands on the leftovers of the failed Imperial experiment in Restuss. She tasked Imperial troops with eliminating many of the Rebel soldiers and elite commandos patrolling the ruins of the devastated city. Much like the Empire, the Rebellion had made use of antennae throughout Restuss to spy on the Empire and coordinate troop movements. To limit their capabilities, Captain Okto oversaw the destruction of this hardware. Imperial scout troopers were among those responsible for taking out these antennae arrays. The Empire soon learned that a Mon Calamari captain of the Rebel Army, named Vrinko, was responsible for overseeing the fast paced construction of these Rebel antennae arrays. Vrinko was hiding in a well guarded building in Restuss, but was about to relocate. Captain Okto ordered an Imperial soldier to defeat the Mon Calamari before he could make a break for it. The Rebel captain was guarded by a number of Rebel troops and elite commandos. However, this was not enough to stop the Imperial soldier from critically injuring Vrinko in combat. To the Empire's dismay, Captain Okto received reports that Vrinko had actually survived. After being resuscitated by Rebel medical staff, the embattled Mon Calamari returned to the front lines. Not willing to give up, Captain Okto gave the Imperial soldier a second chance to kill the captain for good."}, {"tag": "p", "text": "The seemingly perpetual battle saw the use of a number of unique weapons, including the C-M Dead Bolt pistol, C-M Frag Storm heavy shotgun, C-M \"Reaper\" sniper rifle, Crusader M-XII pistol, Crusader M-XIII carbine, Crusader M-XIV rifle, Crusader M-XX heavy rifle, Crusader Templar sword, and Nova Edge sword. These weapons were primarily distributed on both sides by commendation officers, however at least one munitions dealer was known to sell the highly sophisticated weapons technology to multiple parties. For betraying the Empire, an undercover Imperial operative tricked this dealer into meeting at an undisclosed location, and killed them. Following the destruction of Restuss, both Imperial and Rebel forces intensified their efforts to oppose one another. To achieve this, both sides identified what they believed to be important strategic locations, including the Weapons Development Facility on Naboo, the Tactical Training Facility on Corellia, and the Weapons Depot on Talus. The Battle of Restuss ultimately led to further conflicts at these three installations. As part of a propaganda initiative, Emperor Palpatine called on all artists to complete a masterpiece glorifying the Galactic Empire. The best work of art would be selected by Emperor Palpatine himself. In response to this contest, the Alliance challenged sympathizers with creating artwork which best represented the ongoing efforts of the Rebellion. In the end, a painting titled The March to Restuss was selected. In a restricted palette of orange and black, this painting depicted a group of Rebel troopers triumphantly marching into the ruins of Restuss. The soldiers could be seen holding up a banner emblazoned with the Alliance Starbird, while a trio of Imperial TIE fighters flew away in the distance. This painting was displayed and freely distributed by a woman in Mos Eisley named Navari Trik."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Restuss first appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Phase 1 of the battle made its debut on June 27, 2006 with the release of Chapter 1.1. With the first phase of the battle, the streets of Restuss were emptied of non-player characters, a refugee camp was added east of the city, and Rebel and Imperial bases were added north and south of the city. According to an archived Galaxies forum post backed up on a player discussion board, the Lead Designer who went by the alias Helios SOE clarified that the purpose of the first phase was for players to build up these Rebel and Imperial bases by completing missions given by various NPCs at those locations. Each base would go through three stages of construction, and the faction which accomplished the most quests would succeed in completing their base first. With both bases complete, the Battle of Restuss would be kicked off in Phase 2. Because completion of this phase depended on the player's input, the results of Phase 1, and the start of Phase 2 varied from server to server."}, {"tag": "p", "text": "Nevertheless, Phase 2 was carried out in virtually the same exact way on each server, as a special Player versus Player event. On the day of this event, players of each faction gathered in their respective bases, and marched towards one another. The players would then battle one another in combat. Depending on which faction performed better in combat, the players who participated in the event would be awarded a specific badge. The faction which performed better during the Phase 2 PvP event were awarded the Grand Medal of Resolution, while the other was awarded the lesser Medal of Resolution. On one server, the Galactic Empire may have earned the Grand Medal, whereas the Rebel Alliance may have earned the Grand Medal on another. Once again, because the results of Phase 2 varied from server to server, the canonical results of this phase of the battle cannot be definitively determined in the Star Wars Legends continuity. Regardless, Phase 2 ended in the same way, with a tremendous explosion that left the city of Restuss in ruins. From this point forward, Phase 3 of the Battle of Restuss began, with the ruins of Restuss being turned into a PvP zone."}, {"tag": "p", "text": "Players of each faction could continue to accept quests from their respective bases to carry out certain tasks, such as destroying antennae, capturing sensor arrays, and killing NPCs of the opposing faction throughout the ruins. Players of each faction could accept a mission to kill either Captain Vrinko or Admiral Grot. While players could technically \"kill\" these NPCs, it was later revealed in the quest dialogue that they both survived, thus allowing the players to repeatedly accept this quest and kill the officers of the opposing faction endlessly. By completing these types of quests, players would receive commendations which could be turned in to commendation officers in exchange for various items, such as specific weapons or Crusader armor. Phase 3 of the Battle of Restuss continued until the game's closure in 2011. Therefore, a final victor of the battle could never be determined, as control over the city would perpetually exchange hands between Imperial and Rebel forces throughout normal gameplay. While the cause of the massive explosion during the Battle of Restuss was clearly pinned on the Star Core, the exact catalyst remains unclear. A demo video of the Battle of Restuss shown during the 2006 E3 Electronic Entertainment Expo shows the Star Core detonating at almost the exact same time as the destruction of an Imperial AT-AT, implying that the two events were related. However, AT-ATs were not seen during all, if any of the Phase 2 events on the actual servers, and could only be definitively seen in a Legends source as a screenshot in the Restuss Event Preview 1 feature."}, {"tag": "p", "text": "On May 16, 2008, Sony Online Entertainment announced a \"Create a Painting Contest.\" From Monday, May 19, 2008 to Friday, June 6, 2008, players could submit their own artwork for the chance for it to be nominated, voted on, and included in the game as a decorative house painting. From the Rebel category, the three finalists included a painting titled The March to Restuss by Guillemette of Bria, Rebel With a Cause by Heslo Oop'ikan, and Behind Imperial Lines by Hazaz. Players could then vote on these three paintings on the Star Wars Galaxies official message boards from Monday, June 23, 2008 to Monday, June 30, 2008. At the end of the vote, The March to Restuss emerged victorious, and was added to the game on July 29, 2008 as part of Game Update 5, where players could freely obtain the painting from Navari Trik in Mos Eisley. Certain illustrations depicting events of of the Battle of Restuss were released in various expansions of the Star Wars Galaxies Trading Card Game. In the Champions of the Force set released on August 19, 2008, three cards named after specific Battle of Restuss quests were released. One card from the Squadrons Over Corellia expansion released on December 16, 2008, and two cards from the Agents of Deception expansion released on June 24, 2009 pertaining to the Battle of Restuss were also introduced. With the closure of Star Wars Galaxies in 2011, a tribute to the battle was depicted in the Star Wars Galaxies Memory Book. Restuss was also recognized by the Guinness World Records as the largest Player versus Player zone in Star Wars Galaxies. According to the record entry, which is featured in the Guinness World Records 2008: Gamer's Edition, the battle zone was 800 meters in diameter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}