{"url": "Thustra/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Galactic Republic planets", "Category:Sumitra sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Thustra"}, {"tag": "p", "text": "Thustra was a planet located within the Thustra system, Sumitra sector of the galaxy's Expansion Region. It was also the homeworld of a Near-Human race known as the Sephi. Until the advent of the Clone Wars, Thustra was a member world of the Galactic Republic, and was thus represented in the Galactic Senate by a senator. By 21 BBY, approximately nine months into the civil war, the Sephi betrayed the Republic and joined Thustra with the rebellion of the Confederacy of Independent Systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, it was ruled by King Alaric and represented in the Galactic Senate by Alaric's nephew, Navi. The Sephi, following the lead of Alaric, had lost faith in the Galactic Republic and were making moves to join the Confederacy of Independent Systems. Supreme Chancellor Palpatine ordered Republic forces to land on the planet in 21 BBY, claiming that he believed a small show of force would urge the Sephi to remain loyal to the Republic. This force was led by Jedi Generals Tyffix and Tyr, along with their Padawans, Cal and Pix. Without provocation, their forces were attacked at night, using suicide bombers. Tyffix, Tyr, and many clone troopers were killed in the attack, leaving the inexperienced Padawans in command."}, {"tag": "p", "text": "Back on Coruscant, Palpatine consulted with Jedi Master Yoda, making clear his well-founded fears that if Thustra were to secede, the entire sector would leave the Republic as well. Yoda had been friends with Alaric for over two hundred years, and believed he would be able to reason with the King. He soon arrived on Thustra and took Cal with him to the palace to meet with Alaric, while Pix and Commander Clutch were ordered to remain where they were no matter what. Once in the palace, Yoda and Alaric quickly began to discuss their differences, with neither willing to admit their side was wrong. Yoda firmly believed that the Clone Wars were merely a part of history, and that the Republic would exist for much longer, and Thustra should not leave due to this. Alaric believed that the Senate had become so fully obsessed with personal gain that it no longer had the interests of the galaxy at heart, and that Thustra must look after itself for the time being. He then ordered Yoda and Cal to be held prisoner, to prevent further conflict."}, {"tag": "p", "text": "Senator Navi and his aide, Moje, had been recalled from the Senate to Thustra by Alaric, who knew that Navi was corrupt and had forsaken his own people. Navi, however, didn't want Thustra to secede, and set in motion a plan to ensure Republic domination of the planet. He sent Moje to speak with Cal, who was impatient with Yoda's methods, and the aide convinced the young Jedi that he must try to escape the palace or be executed. At the same time, Navi flew to meet with Pix and Clutch, and told them that Alaric had already executed Cal and Yoda and that they must mount a preemptive strike against the assembling Sephi forces. Thus Cal attempted to flee the palace at the same time that Pix led the clones against the Sephi military, giving the appearance that the Republic was attempting to assassinate Alaric and take over the planet. In response, the palace guards attacked Cal, and though Yoda attempted to calm the Padawan, Cal was killed in the battle, shot in the back by a guard. Yoda asked Cal to allow him to ease his pain, but the dying Padawan instead blamed Yoda for all that had happened, and died."}, {"tag": "p", "text": "Yoda then confronted Alaric in his greenhouse, where the king was lamenting the turn of events. As the capital of Thustra fell around him, Alaric pulled a blaster from beneath his robes. He told Yoda that his death would galvanize his people, and that they and the entire sector would never give up if he was killed by the Republic. Yoda asked him not to, but the king shot at the Jedi Master, who deflected the blaster bolt into the king's chest. As the king died, he begged Yoda to remember their friendship as it had been, not as it had become."}, {"tag": "p", "text": "Subsequently, Navi was arrested for his part in the events, and though Moje escaped, he was placed on a wanted list. Thustra was lost to the Republic, and the loss dealt yet another staggering blow to the fragile galactic government."}, {"tag": "p", "text": "Many years later, Thustra was later conquered by the Yuuzhan Vong during their early advances."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}