{"url": "Thurlow_Harris", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Blue Squadron personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Thurlow Harris"}, {"tag": "p", "text": "Thurlow Harris was a Human male starfighter pilot who served in the Alliance to Restore the Republic during the early Galactic Civil War. The son of a Rebel captain, Harris spent much of his life in his father's shadow and witnessed many battles during his youth. Harris completed his Alliance training at the pilot training center on Kolaador, and was one of three pilots sent from Kolaador to Tatooine when Anchorhead Base was attacked by the Galactic Empire. Harris helped to incapacitate an Imperial-class Star Destroyer in orbit of Tatooine, but his group arrived too late to prevent the destruction of Anchorhead Base. Harris was later stationed at the Alliance's main base in the Great Temple on Yavin 4 when it came under assault by the Empire's Death Star battlestation. As part of Blue Squadron, Harris fought in the subsequent Battle of Yavin, in which Rebel forces destroyed the Death Star. He was captured soon after, however, when he returned to his homeworld of Centares to spread news of the Alliance's victory. After being tortured by the Dark Lord of the Sith Darth Vader, Harris revealed that Luke Skywalker was the pilot responsible for the Death Star's destruction. He was subsequently killed by the bounty hunter Mala Mala."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel pilot"}, {"tag": "p", "text": "Born around 20 BBY on the planet Centares in the Maldrood sector of the Mid Rim, Thurlow Harris grew up in a galaxy controlled by the Galactic Empire. His father became a captain in the Alliance to Restore the Republic, so Harris had seen many battles by the time he was twenty years old. Harris followed his father into the fledgling Rebellion early in the Galactic Civil War and undertook training as a starfighter pilot at the Alliance's pilot training center on Kolaador, alongside another recruit known as Rookie One."}, {"tag": "p", "text": "In 0 BBY, Rebel agents acquired the plans to the Empire's Death Star battlestation, a superweapon capable of destroying a planet. Pursued by the Dark Lord of the Sith Darth Vader, Princess Leia Organa of Alderaan entrusted the stolen plans to the droids R2-D2 and C-3PO, who escaped her ship as it was boarded by Imperial forces, landing on the Outer Rim world of Tatooine. Realizing that the plans were no longer aboard the vessel, Vader ordered his forces to begin searching Tatooine. When the Imperial search uncovered the Alliance's Anchorhead Base, the Rebels called for assistance from Kolaador. In response to the distress call, Harris, Rookie One, and Commander Ru Murleen were dispatched to Tatooine in T-65 X-wing starfighters."}, {"tag": "p", "text": "The three Rebels arrived in the Tatoo system to find an Imperial-class Star Destroyer in orbit around Tatooine, coordinating the attack below. As the Star Destroyer launched TIE/LN starfighters against the incoming Rebels, Murleen led Harris and Rookie One in strafing runs to weaken its defenses. When the deflector shields protecting the bridge fell under the Rebel assault, Rookie One fired proton torpedoes at the unprotected command tower, crippling the vessel and allowing the Rebel flight group to proceed to the surface."}, {"tag": "p", "text": "As the Rebels approached Anchorhead Base, it came under attack from three TIE fighters. Arriving too late to prevent the base's destruction, the Rebels pursued the TIE fighters into Beggar's Canyon to stop them from reporting the arrival of the X-wings. After all three enemies were eliminated, the Rebels were joined by the X-wing of Captain Merrick Simms, and Murleen instructed Harris and Rookie One to accompany Simms while she attacked the Imperial supply lines. With enemy ground forces moving into Mos Eisley, Simms led Harris and Rookie One to the spaceport town, where they engaged All Terrain Scout Transports and Imperial landing craft until the arrival of a TIE fighter group forced them to withdraw. With Harris struggling to outrun a TIE/IN interceptor as the Rebels fled into space, Simms led the two rookies into a nearby asteroid field, where they lost their pursuers before making a hyperspace jump to rendezvous with the Alliance Fleet."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "Harris was later assigned to the Alliance's main base on the moon Yavin 4, but soon found himself in battle once more. The stolen Death Star plans were eventually delivered to the Rebel base, but the Empire dispatched the Death Star itself to destroy the moon. Analysis of the plans revealed a weakness in the battlestation which General Jan Dodonna formulated a plan to exploit; a direct proton torpedo hit on a small thermal exhaust port would trigger a chain reaction in the Death Star's main reactor and destroy the battlestation. Harris was assigned to Blue Squadron, a group of four X-wings led by Simms and including Murleen and Rookie One; Harris received the call sign Blue Four. Blue Squadron was charged with attacking the Death Star's superlaser directly in an attempt to both damage it and divert attention away from Red and Gold Squadrons while those groups attacked the exhaust port."}, {"tag": "p", "text": "As Blue Squadron approached the Death Star, a Star Destroyer in its support fleet launched TIE fighters to intercept them. The group battled their way through the incoming TIEs, with Harris getting at least one kill. During the fight, three of the Imperial fighters were able to get on Simms' tail. Harris tried to go to his wingmate's aid, but he was unable to get a lock, leaving Rookie One to destroy the TIEs and save the flight leader. After making it past the perimeter, Blue Squadron commenced strafing runs on the Death Star's turbolaser batteries and cleared the way for the Alliance forces to enter the narrow trench leading to the exhaust port. Though the initial attempts failed, Red Squadron pilot Luke Skywalker finally made a direct hit on the exhaust port and destroyed the Death Star. The Rebels took heavy losses but Harris narrowly survived the battle."}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "Following the Battle of Yavin, Lord Vader became obsessed with taking revenge against the Rebel pilot responsible for the Death Star's destruction and hired bounty hunters to track the pilot down. Believing Vader to have been killed during the battle, Harris thought that the Rebels would soon win the Galactic Civil War and returned to his homeworld of Centares in 0 ABY to spread news of the Alliance's victory. There he was captured by a group of bounty hunters including the Sephi Mala Mala, her droid Fordee and the Human siblings Brazzo and Selle. Vader arrived on Centares soon after to oversee Harris's interrogation and, with the aid of Ban Papeega and a torture droid, tortured Harris in the former Museum of the Old Republic until he revealed Skywalker's name before losing consciousness. Flying into a rage, Vader, who had been born Anakin Skywalker and was Luke Skywalker's father, ordered the bounty hunters killed to prevent Skywalker's name from reaching Emperor Palpatine. Vader dispatched a stormtrooper to execute Harris, but Mala Mala intercepted and killed the trooper. Going to Harris, the bounty hunter inquired what he had revealed that had caused Vader to turn on her partners. After he admitted betraying Skywalker and the Alliance, Mala Mala killed him with a blaster shot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Thurlow Harris was a Human male with brown hair, brown eyes and light skin. With his father serving in the Rebel Alliance, Harris was exposed to the Galactic Civil War at an early age and saw many battles during his youth. Harris chose to follow his father's example by joining the Alliance, but he struggled to escape his father's shadow. Although he became a skilled pilot, Harris lacked the confidence and mental control of more experienced pilots. Following the Alliance's victory at the Battle of Yavin, Harris was overjoyed and confident that the Rebels would soon win the war. Harris always believed he would be strong and not reveal anything if he was ever captured by the Empire, but his resolve failed when Darth Vader personally had him tortured following his capture on Centares. After revealing Skywalker's name, Harris was ashamed and could not forgive himself for betraying the Alliance. He ultimately welcomed his death when Mala Mala came to kill him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thurlow Harris was created by Vincent Lee for the 1993 LucasArts video game Star Wars: Rebel Assault, and his backstory was expanded in the game's manual. Harris is a non-player character in the game, who serves in the same squadron as the player's character, Rookie One. Harris's appearance in the game was modeled on footage of LucasArts artist Jon Knoles."}, {"tag": "p", "text": "Rebel Assault depicts Harris, as part of Blue Squadron, taking part in a trench run at the Battle of Yavin which contradicts the battle as depicted in Star Wars: Episode IV A New Hope. The trench run in the game is almost identical to that of the movie—only the persons involved are different. The game depicts Blue Squadron attempting a trench run with Simms entering first while Rookie One joins Murleen and Harris in providing cover. As they negotiate the long trench, the group is pursued by three TIE fighters, including a TIE Advanced x1 such as the one used by Darth Vader in the movie. The TIEs open fire, killing Harris and forcing Murleen to pull out, echoing the fates of Biggs Darklighter and Wedge Antilles in the movie. Simms finally reaches firing range but his torpedoes impact on the surface, leaving Rookie One next to make an attempt, mirroring Garven Dreis's failed attempt. In the game, it is Rookie One's shot that is depicted as destroying the battlestation, as opposed to Skywalker's."}, {"tag": "p", "text": "In December 2006, Leland Chee, keeper of Lucasfilm's Holocron continuity database, commented on the StarWars.com Message Boards that Rookie One's trench run was non-continuity, leaving it unclear whether the scene depicting Harris's death was canon. Harris received an entry in The Complete Star Wars Encyclopedia (2008) which mentions his participation in the Battle of Yavin but did not clarify whether he survived the battle, and The Essential Guide to Warfare (2012) later confirmed that Blue Squadron were assigned to attack the Death Star's superlaser while Red and Gold Squadrons attacked the trench. In September 2013, the Star Wars Blog article The Not-So Magnificent Seven by Greg Mitchell confirmed that Harris survived the battle. The article established that a previously unidentified Rebel pilot whose interrogation and death soon after the Battle of Yavin were depicted in the 1999 comic book Vader's Quest 1 by Darko Macan is Harris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}