{"url": "Thunderstrike", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Alliance to Restore the Republic starships", "Category:CR90 corvettes"], "nodes": [{"tag": "h1", "text": "Thunderstrike"}, {"tag": "p", "text": "The Thunderstrike was a CR90 corvette utilised by the 61st Mobile Infantry of the Alliance to Restore the Republic. The vessel was commanded by Captain Micha Evon, more commonly known as Howl, until his death at the Battle of Hoth. Soon after, Rebel trooper Hazram Namir unofficially took charge of the ship until its demise at the Siege of Inyusu Tor, where the corvette was ambushed by the Galactic Empire. The Thunderstrike was also escorted by the Braha'tok-class gunship Apailana's Promise."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early use under the Rebellion"}, {"tag": "p", "text": "The CR90 corvette Thunderstrike began serving the alliance's 61st Mobile Infantry sometime before the Galactic Civil War. Its Captain was Micha Evon, more commonly known as Howl, who led the Sixty-First. At some point the Thunderstrike got its own escort, a Braha'tok-class gunship called the Apailana's Promise, which could carry two X-wing starfighters into battle for the Sixty-First. During a mission to Allst Prime, the Thunderstrike was in orbit whilst the Sixty-First soldiers fought on the ground. The Thunderstrike caused extreme damage when it bombarded the Shield around the Crucival transmitter tower."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Thunderstrike served the Sixty-First well through the Alliance's advancement into the Mid Rim and the Mid Rim Retreat when the Alliance ran back out again. During the Attack on Haidoral Prime, the Governor Everi Chalis defected to the Sixty-First and was held in one of the Thunderstrike's airlocks. Following the Coyerti campaign, it suffered three separate attacks in the Metatessu sector and was leaking a trail from its Hyperdrive. In order to get the repairs it and the Apailana's Promise attacked an Imperial heavy freighter. During the raid, the Thunderstrike shot occasionally at the freighter to keep it in an unstable condition. The battle was cut short by the addition of an Imperial Gozanti Cruiser but the Thunderstrike received the supplies it needed."}, {"tag": "h4", "text": "Infiltrated the Elochar Sector"}, {"tag": "p", "text": "The Thunderstrike and the Apailana's Promise then rendezvoused to a Flotilla in the Elochar sector where they could get the repairs they needed. Howl meanwhile had gone to Echo Base on Hoth with Chalis to see the Alliance High Command. The engineers began repairs immediately and the soldiers went on patrols or shore leave to other ships. Captain So-Hem of the Sixmoon invited Sixty-First soldiers to visit his ship. A short while later the Trumpet's Call was over taken by Imperial spies. The Light freighter arrived to the flotilla with no life support and a lot of dead rebels and unconscious infiltrators. The Thunderstrike blindly took the spies in and when they regained mobility, they stormed into the bridge killing Howl's second in command Lieutenant Sairgon and the Naval Officer Commander Paonu. Sairgon, luckily, had sent a warning out to the flotilla and the ships retreated. The Sixty-First soldiers then regained control of the Thunderstrike and fled the system."}, {"tag": "h4", "text": "Operation Ringbreaker"}, {"tag": "p", "text": "Howl had died in the Battle of Hoth during the commotion in the Elochar Sector and Chalis and First Sergeant Hazram Namir came back with the bad news. Commander Tohna transferred from being in charge of the Apailana's Promise to being in charge of the Thunderstrike. The Thunderstrike was repaired fully on Ankhural where the Sixty-First devised a plan to take out Kuat Drive Yards. It was called Operation Ringbreaker. The Thunderstrike dropped off and picked up troops of the Sixty-First from Mardona III and then Obumubo before delivering a pay load to the Dockyards of Najan-Rovi. It then did its job for the attacks on Nakadia, Naator, Xagobah and the Kuliquo belt asteroid mines. It then came to Sullust where the soldiers took Inyusu Tor. But when the Thunderstrike came to pick them up, it was shot down by ambushing TIE Fighters of Vixus Squadron. TIE Bombers then ravaged the Thunderstrike shortly after a team came and rescued Commander Tohna from the wreckage."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Imperial forces led by Prelate Verge were determined to wipe out the Sixty-First after stranding them on Sullust. But in the Siege of Inyusu Tor, their plan backfired when Namir, now Captain of the company, used the factory's lava against the ground troops and the Imperial-class Star Destroyer Herald took internal damage from an Ion mine causing it to retreat. After the battle, the soldiers re-grouped and the Sullustan resistance took Pinyumb with the help of the Cobalt Laborers' Reformation Front. The Thunderstrike was then scavenged and its batteries drained by Quartermaster Hober. The Apailana's Promise was back having fended off the Herald for most of the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Thunderstrike first appeared in Battlefront: Twilight Company, a novel written by Alexander Freed and published in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}