{"url": "Thyrsian", "categories": ["Category:Legends articles", "Category:Human and Near-Human species", "Category:Inner Rim species", "Category:Thyrsians"], "nodes": [{"tag": "h1", "text": "Thyrsian"}, {"tag": "p", "text": "The Thyrsians were a subspecies of the Near-Human Echani originating from the Inner Rim world of Thyrsus, defined by their differing culture and almost polar-opposite appearance to the Echani. Thyrsians were also known for their role in the development of the Force pike. The Sun Guard Sith cult arose from the Thyrsians."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Thyrsians shared few obvious physical similarities with their Echani, though the two subspecies were widely considered cousins due to the Thyrsian appearance being a diametric contrast to that of the Echani; with the species known for their dark hair and skin, rather than the white skin and eyes that defined the Echani."}, {"tag": "p", "text": "It was believed that the Echani were the result of Arkanian experimentation with the Human genome, a theory also applied to the Thyrsians as a subspecies."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Thyrsus had long been culturally distinct from the rest of Echani society, maintaining their own stubbornly independent beliefs and traditions that often ran in direct contrast to Echani culture. Thyrsian society was patriarchal, eschewing the female council that governed the Six Sisters. In combat, Thyrsian warriors were known to favor heavy armor and weapons, such as the Force pike, over the light armor and weaponry favored by the Echani. As with all Echani, Thyrsians were regarded as excellent warriors, and excelled at reading even the smallest cues of body language through the Echani's kinetic communication style."}, {"tag": "p", "text": "The Thyrsians were known as a spiritually restless people. Thyrsians followed a monotheistic solar religion, differing from the lunar religion of the Echani, and Thyrsian military units often wore emblems of the stylised red suns of Thyrsus on their armor. Over one hundred years before the Imperial Period, the Sun Guard developed a fixation on a prophecy of a messiah figure known as \"the son of suns\", attracting the attention of the Order of the Sith Lords, who exploited a widespread belief among the Thyrsians that the Sith were the subject of the prophecy to convert the Sun Guards into Sith cultists under the command of Darth Plagueis, and later Darth Sidious."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though nominally part of the Six Sisters, a confederation of six worlds dominated by the Echani, the Echani population of the sun-baked world of Thyrsus differed in appearance from their Echani cousins, and were considered by Echani Command to be stubbornly independent. Thyrsians first emerged onto the galactic stage in 1154 BBY, waging a war of independence against Echani Command during the Bengali Uprising. Though Bengali returned to Echani rule less than a century later, the Thyrsian Sun Guard continued to wage a string of crusades against the Echani until Thyrsian independence was confirmed with the Pact of Almera in 899 BBY. After the cessation of hostilities between the two Echani cultures, the Sun Guard warriors that evolved from the ranks of the Thyrsian special forces largely abandoned Thyrsus and soon became military rivals of the similarly seminomadic Mandalorians, and the two would clash in numerous battles and wars. Most famously, the two warrior cultures participated in the battle for Sintheti in 402 BBY, when the two groups were hired by rival claimants to the Horned Throne, with the battle between the two lasting for three years."}, {"tag": "p", "text": "The Sun Guard eventually fell under the influence of the Order of the Sith Lords. During and after their service to Darth Plagueis, Darth Sidious used the Sun Guards as sentries, mercenaries and assassins. Darth Sidious later ordered Count Dooku to task his executor Asajj Ventress with the elimination of the cult. During the Clone Wars, rogue factions within the Sun Guard were hired by various peoples conquered by the Confederacy of Independent Systems-aligned planet Emberlene, resulting in the destruction of the world."}, {"tag": "p", "text": "Thyrsian society was divided by the rise of Emperor Palpatine. Most Thyrsians were strong supporters of the Emperor, and saw the Royal Guard as the successors to the Sun Guard, with many Thyrsians winning renown as elite members of the Imperial Army and cloning templates for the Empire's Stormtrooper units. Force-sensitive Thyrsians, particularly members of the Sun Guard, became candidates for the Imperial Shadow Guard. However, many Thyrsians contended that the Sith had misled them, and sought to revive the Sun Guard."}, {"tag": "p", "text": "Thyrsus became an isolationist world after the Emperor's demise, with the Thyrsians resisting the entreaties of various Imperial warlords as well as the New Republic."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}