{"url": "Battle_of_Rishi_(Clone_Wars)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Rishi  (Clone Wars)"}, {"tag": "p", "text": "A battle was fought in 21 BBY on the planet Rishi during the Clone Wars. After Confederate Geonosian warriors captured Rishi's Exonium mines, the Galactic Republic sent the clone trooper division Green Company to repel the invaders. Without a Jedi General's leadership, Green Company's clone troopers could not defeat the Geonosians, who had heavily entrenched in the mines. However, Jedi Master Kit Fisto soon arrived and formulated an attack plan, which involved him using his lightsaber to deflect clone sharpshooter 2242's blaster shots into the enemy. Using this strategy, Fisto and 2242 managed to kill all Geonosians who guarded the canyon leading to the mines, allowing Green Company to initiate an assault on the mines themselves."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 21 BBY, during the Clone Wars, in order to get the Exonium mineral needed for their sonic weapons, the Confederacy of Independent Systems invaded the planet Rishi and captured its Exonium mines. In response, the Galactic Republic sent the clone trooper division Green Company to repel the Separatists and protect the native Rishii. Since no Jedi General was initially available to lead the clone troopers, and because the Separatist's elite Geonosian warriors had heavily entrenched in the mines, the clones were ordered to await Jedi Master Kit Fisto's arrival before attempting an attack. In the meantime, the Rishii Chieftain Gwarrk assumed command of Green Company."}, {"tag": "p", "text": "Gwarrk, however, was desperate to reclaim the Exonium, which was needed for the Rishii to prepare food. To this end, he ordered the Republic forces to initiate an attack. The clones followed Gwarrk's order but faced heavy opposition from the Geonosians that guarded the canyon leading to the entrance of the mines. At that moment, however, Fisto finally arrived and ordered all troops to pull back. Gwarrk insisted on another direct assault, but Fisto told him that it would only result in the Republic's defeat. Instead, the Jedi Master ordered the clones' commander to provide him with the company's best sharpshooter and keep the rest of the troops ready for battle."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Fisto headed toward the canyon, while clone sharpshooter 2242, nicknamed \"Cooker\" for his tendency to hit the Confederate battle droids in the power cells, took position above it. After Cooker had informed Fisto that he would have no line of sight with the enemy from that position, the Jedi Master finally revealed to the clone all of his plan's details, which involved Cooker aiming for Fisto's shoulder and firing continuously. As the Geonosians attacked Fisto with sonic blasters, the Jedi Master ordered Cooker to open fire and—using a combination of his acrobatic skills and the Force—started moving throughout the canyon, deflecting Cooker's blaster shots into the Separatists with his lightsaber."}, {"tag": "p", "text": "Seeing Fisto fighting the enemy alone, Green Company's commander ordered the clone troopers to board their LAAT/i gunships and head out to assist the Jedi. By that moment, however, all Geonosians in the canyon had been killed by Fisto's and Cooker's combined efforts. Fisto then noticed the massive doors to the mines opening and hoped that this meant a surrender. This proved not to be the case, as the Separatists revealed an LR1K sonic cannon and attacked Fisto with it, knocking him to the ground. At that moment, Cooker contacted Fisto, asking the Jedi to stay down. Demonstrating his sniping skills, Cooker fired a single shot that destroyed the cannon. The Republic forces—along with some of the Rishii warriors—then arrived and attacked the mines, forcing the remaining Geonosians to flee."}, {"tag": "p", "text": "Afterward, Gwarrk acknowledged that Fisto was very powerful, to which the Jedi replied that two factors had made this victory possible—the power of mind and Cooker's help."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Rishi was depicted in the 2009 Free Comic Book Day's comic The Clone Wars: The Gauntlet of Death, written by Henry Gilroy and illustrated by Ramón K. Pérez."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}