{"url": "Tia_Organa", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Character stubs", "Category:Females", "Category:House of Organa", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Tia Organa"}, {"tag": "p", "text": "Tia Organa was a female Human who was a member of the Organa family of Alderaan and the sister of Bail, Celly, and Rouge Organa, and the adopted aunt of Leia Organa."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of House Organa, Tia Organa grew up on Alderaan with her brother and sisters. Several years before the Clone Wars began, Organa was set to marry a nobleman of House Vandron. Despite this, Organa had begun having an affair with her brother Prestor Organa's friend and companion, Halagad Ventor. During the affair, Organa joined her brother and Ventor on a manka cat hunting expedition at the Okonomo Retreat when the mad geneticist Zeta Magnus infiltrated the Retreat building and infected all of the revelers, including Ventor's parents, with a hive virus. Driven mad by the virus, the partygoers were held under a cannibalistic sway and began a mad frenzy of devouring each other before ultimately being consumed by Magnus. When the hunting party received word of the tragedy, Ventor abandoned Organa and left her pregnant and alone. The scandal rocked the political world in Aldera City, and the alliance between House Organa and House Vandron came to an end. She later gave birth to a son, whom she named Nial Organa."}, {"tag": "p", "text": "Organa had a number of pittins whom she spoiled, treating them like they were her own children. They included All-Terrain Attack Vehicle, Taffy, Winkie, and Fluffy."}, {"tag": "p", "text": "Tia Organa was present on Alderaan in 0 BBY when Grand Moff Wilhuff Tarkin ordered the destruction of the planet. When the Death Star fired on Alderaan and destroyed it within seconds, Organa perished along with her son and all other Alderaanians present on the world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tía is the real-world Spanish word for aunt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}