{"url": "Battle_of_Ringo_Vinda", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Ringo Vinda"}, {"tag": "p", "text": "The Battle of Ringo Vinda, also known as the Ringo Vinda campaign, was fought at Ringo Vinda during the Clone Wars. Separatist Admiral Trench captured the planet's orbital graving docks, prompting a Republic effort to retake the world."}, {"tag": "p", "text": "Republic forces, including the 501st Legion and at least one other unit, advanced on Trench's command center, but they lost their momentum when clone trooper Tup abruptly executed Jedi General Tiplar due to a malfunction in his behavioral modification biochip causing him to carry out Order 66 prematurely. The incident led Separatist forces to kidnap Tup on the orders of the Sith Lord and Separatist Head of State Count Dooku, but Jedi General Anakin Skywalker, Clone Captain Rex and ARC trooper Fives were able to rescue him before the Separatists could take him out of the system. The Republic subsequently sent Tup to Kamino for examination, while their forces continued to blockade the Separatists above the planet."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Unexpected betrayal"}, {"tag": "p", "text": "The Battle of Ringo Vinda took place over and on the large circular space station controlled by the Separatist Alliance that surrounded the entire planet. The battle raged for several rotations with neither side gaining or losing any ground. Galactic Republic commanders included Jedi Generals Anakin Skywalker and the twin Jedi Masters Tiplee and Tiplar, leading their respective units. Separatist forces were commanded by the Harch Admiral Trench and the super tactical droid Commander Kraken. At one point during the battle, clone trooper CT-5385 \"Tup\" of Skywalker's 501st Legion went missing for five rotations, with his disappearance reported by Skywalker, though he eventually reappeared."}, {"tag": "p", "text": "In a desperate bid to end the destructive battle, Generals Skywalker, Tiplee and Tiplar led a massive assault on the space station. Fighting their way through the corridors, the Republic forces, made up of the 501st Legion and Clone Commander Doom's men, were led by the Jedi Generals as they fought droidekas and BX-series droid commandos, in addition to standard B1-series battle droids. Several of the troops used blast shields as cover. Eventually, the Republic forces regrouped in a large room, in preparation for their assault on Trench's command center. Skywalker laid out a plan for each of the three Jedi to take one of three hallways leading to a large area before the command center, with Tiplee on the left, Tiplar on the right, and himself and Clone Captain Rex heading down the middle. As Doom's men had been severely depleted, Skywalker ordered ARC trooper Fives and Tup to take ten of their best men and join Tiplar's group."}, {"tag": "p", "text": "As the groups were preparing to depart, Fives noticed that Tup was acting odd and asked him if he was alright, noting that it was strange for him to be experiencing an attack of pre-combat nerves. Tup caught sight of Tiplar ordering her troops to follow her and became momentarily hostile, but was snapped out of his strange mood by Fives talking to him. He said he was fine and it was just a headache, before leading his friend in running to catch up with their group, which had already left. The assault progressed down the hallways and into the large open room, as starfighter combat raged outside the space station. Trench ordered his droid forces to hold their ground, as the Republic advance pressed them back. However, as the fighting raged, Tup began to feel unwell, hitting his head in an attempt to clear it, before he became fixated on Tiplar as she fought several DSD1 dwarf spider droids. Removing his helmet, Tup muttered the phrase \"Good soldiers follow orders\" before running up to Tiplar. Fives, watching, was unable to stop his friend, and Tiplar had just enough time to turn in surprise before she was shot in the head, dying instantly. The cause, unbeknownst to any of the witnesses, was a malfunction in Tup's secret \"inhibitor\" chip, which had been implanted in all of the clones in order to ensure their compliance with carrying out Order 66, the Sith's secret plan to destroy the Jedi Order."}, {"tag": "p", "text": "Fives tackled Tup to the ground while Tiplee, horrified, leapt down to recover her sister's body. Skywalker, noting the Republic forces had lost their momentum, ordered a retreat. He then tasked Fives with ensuring that Tup made it safely back to Republic lines so they could find out what had happened. Skywalker was among the last to leave the room, with the blast doors sealing behind them to delay the droids from pursuing. Trench, witnessing the incident from his command post, reviewed a holographic recording of the killing before contacting Separatist leader Count Dooku. The Admiral informed Dooku of the Republic retreat, and that their forces had nearly overrun his post before Tiplar's murder had forced them to fall back. Trench noted that he had made a study of clone troopers over the years of the war, and Tup's behavior when he killed Tiplar was unlike anything he had ever seen before, as he had seemed unable to help himself. Dooku became alarmed, and thanked Trench for his report. Back on Serenno, Dooku immediately contacted his Sith Master, Darth Sidious, and reported Tup's actions as an apparent failure of the clone programming. Sidious ordered Dooku to capture the clone for examination so they could determine if what had transpired was a threat to their plans."}, {"tag": "h3", "text": "The mystery deepens"}, {"tag": "p", "text": "Skywalker, Tiplee and their forces retreated back to the room where they had initially planned their assault, sealing doors and setting up turrets behind them to delay the droid forces. While Tiplee mourned her sister, Skywalker, Rex and Fives attempted to interrogate Tup. Clone medic Kix had examined Tup and could not figure out what was wrong with him. Rex spoke to Tup, who was dazed and confused by his surroundings, asking him if he knew what he had done. Tup's only response was to repeat \"Good soldiers follow orders\" until he saw Tiplee, who had approached in the meantime, whereupon he started saying \"kill the Jedi\" and lunged at her, so she Force-threw him into the wall behind him. Skywalker decided that they had to get Tup to a proper medical bay."}, {"tag": "p", "text": "Onboard Skywalker's flagship, a more in-depth examination of Tup in the Venator-class Star Destroyer's medbay failed to produce any answers. Tup woke up, confused as to why he was restrained, and became agitated and horrified when Fives told him he had killed Tiplar, causing a medical droid to sedate him. Kix, looking over the data, stated that it appeared that Tup had simply had a mental breakdown, but Rex and Fives were both skeptical since the clones had been engineered to handle that kind of stress. Taking the conversation into the hallway, Skywalker noted that there were rumors of the Separatists attempting to develop anti-clone weapons and viruses, meaning it was possible this was an attempt at biological warfare. Kix recommended that Tup be transported to Kamino, which had the facilities necessary to do a full investigation to find out what was wrong. Tup was loaded onto a Rho-class transport shuttle, which departed the Star Destroyer with an escort of ARC-170 starfighters."}, {"tag": "p", "text": "However, before it could jump into hyperspace, the shuttle and its escort were attacked by a force of B2 super rocket troopers and buzz droids, carried aboard HMP droid gunships. The droids swiftly destroyed the escort and attacked the shuttle, neutralizing its pilots. When the artificial gravity failed, the troopers and medical officers in the hold armed themselves and put on breath masks. However, when the super battle droids boarded, the clones were swiftly overwhelmed. The droids cut Tup's restraints and transferred him to a pod before departing the wreckage. The delirious clone was subsequently transported back to Trench's command post. Trench reported the capture to Dooku, who ordered Tup sent to him. Trench ordered Tup be sent on the next shuttle out of the space station. When Commander Kraken expressed concern over the Republic blockade, Trench ordered him to see to the delivery personally."}, {"tag": "p", "text": "When contact was lost with the shuttle, Skywalker, Rex, and Fives set out in an Eta-class shuttle and discovered the wreckage. Fives noted that the attack made no strategic sense, and Skywalker suggested the droids must have been after Tup. Donning a spacesuit, Skywalker and the clones searched the shuttle and found that Tup had been taken. Rex and Fives wondered if the abduction was proof that the Separatists were responsible for his condition. Tracking Tup's locator, Skywalker, Rex, and Fives returned to the shuttle, following the signal to a large hangar in the Separatist-controlled part of the station. The shuttle dropped them off before leaving, and the three spacewalked to the edge of the hangar, where they saw Tup being transferred to a Maxillipede shuttle, with a large number of battle droids standing guard."}, {"tag": "p", "text": "Rex expressed concern about the number of droids, noting that while Skywalker was likely to be able to handle the dozens of droids by himself, he doubted that either he or Fives would survive the battle to witness it. Fives suggested that they use grappling lines to hitch a ride on the shuttle. When the shuttle departed the hangar, Rex and Fives both grappled on with their lines, with Skywalker hanging on to Rex. The droid pilots noted that the shuttle had experienced some drag as a result, which Kraken found improbable. Skywalker, Rex and Fives subsequently stormed the hold, fighting the droids guarding Tup. Kraken eventually noticed the noise and exited the cockpit, attacking Skywalker before the Jedi severed the droid's arms and demanded to know what he knew. When Kraken stated that he was programmed to resist intimidation, Skywalker beheaded him as Rex destroyed the pilots and took control of the ship. Skywalker then looked at Tup, who had been strapped to another gurney, and Fives, asked how his friend was doing, said that he appeared to be dying."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Republic sent Tup on another ship to Kamino, this time succeeding. Fives persuaded Rex to allow him to come along, as he was concerned for his friend. The examination of Tup failed to produce any tangible results, as Doctor Nala Se, who suspected the true cause of the clone's ailment, was under instructions to cover up the biochips' existence from the Jedi, including Jedi Master Shaak Ti. The Jedi speculated that a Separatist conspiracy was responsible for Tup's actions, something that his several-day disappearance earlier in the battle lent credibility to. In a desperate attempt to save his friend, Fives persuaded medical droid AZI-3 to perform a level 5 atomic brain scan, which Nala Se had claimed Tup could not survive. The scan revealed an apparent tumor, actually the control chip, which Fives had AZI-3 remove. However, Tup died almost immediately afterwards. After the discovery, Fives went rogue and removed his control chip from his own head to prove their existence, eventually persuading Shaak Ti to allow him to plead his case about the danger of the chips to Supreme Chancellor Palpatine."}, {"tag": "p", "text": "However, on route to Coruscant, Fives was drugged by Nala Se, and was subsequently framed for attempting to assassinate the Chancellor, who was truly Darth Sidious. Seeming to have gone insane, Fives was forced to go on the run, while attempting to inform the Senate and Jedi Council that every clone had these chips which programmed them with clone protocols for the Grand Army of the Republic, including Order 66. However, in the process of trying to get them to listen to his case, he was shot and killed by Commander Fox of the Coruscant Guard. His dying words were to his friend, Captain Rex. Due to the effects of the drug he had been administered, Fives was not able to convince either Rex or Skywalker, who were both present, about the truth of the chips. Skywalker's skepticism was only reinforced by Fives' claim that Palpatine was involved, since Skywalker trusted the Chancellor and did not believe him capable of such a conspiracy. Rex, however, harbored lingering suspicions about the truth of Fives' claims, which ultimately saved him and Skywalker's former Padawan Ahsoka Tano when Order 66 was finally issued."}, {"tag": "p", "text": "Commander Kraken was rebuilt by the Separatists, and later participated in the Invasion of Scipio."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ringo Vinda first appeared in the Star Wars: The Clone Wars Lost Missions episode \"The Unknown.\" It was first identified as such in Commander Doom's Databank entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}