{"url": "Battle_of_Rodia_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Rodia", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Battle of Rodia  (Yuuzhan Vong War)"}, {"tag": "p", "text": "A battle occurred on Rodia during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Yuuzhan Vong invaded Rodia on their march to the Galactic Core, using the planet to cut into the Corellian Run which was a major galactic trade route that stretched from the Core to the Outer Rim. Rodia was a major member of the New Republic and was as a result, targeted by the Yuuzhan Vong."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "To further the conquest of Rodia, the extragalactic alien invaders inserted a Yammosk into the planet's mantle. The Yuuzhan Vong forces then brutally massacred countless Rodians and destroyed the cities of Rodia. Those Rodians that managed to flee Rodia found themselves refugees from persecution."}, {"tag": "p", "text": "Shortly after the battle, the Master Shaper Taug Molou began a series of experiments to forge the Rodian captives into deadly warbeasts to further the Yuuzhan Vong cause. The Master Shaper had been partly inspired by the violent attitude of the Rodian species. He would take his Rodian experimental subjects apart on a cellular level, reassembling their genetic code with bits from other creatures. This experiment resulted in the creation of the Vagh Rodiek—mindless warbeasts that moved on crab-like legs with sharp half-meter long scythes of bone in place of arms. Their natural head-spines were also mutated into razor-sharp quills. While this conflicted with the protocols of the Shaper caste, the Vagh Rodiek's effectiveness in combat caused this heresy to be overlooked. Later, Warmaster Tsavong Lah himself arrived on the planet to oversee the \"breaking\" of the Rodians."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}