{"url": "Tian_Chyler", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic members", "Category:Bespinites", "Category:Females", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Security Bureau personnel"], "nodes": [{"tag": "h1", "text": "Tian Chyler"}, {"tag": "p", "text": "Tian Chyler was a Human female who served the Alliance to Restore the Republic. Initially a member of the Galactic Empire's Sub-Adult Group, Chyler was selected by her superiors for training from the Imperial Security Bureau. After completing her training, she was tasked with rooting out Rebel Alliance sympathizers within Imperial Center's law enforcement community. She did so skillfully, and was given a more important role: the infiltration of Bespin's mining guilds, to investigate the possibility of any unregistered Tibanna gas mining."}, {"tag": "p", "text": "Posing as a Corellian official fleeing from Ando, Chyler soon discovered that Bespin's Cloud City harbored a considerable amount of under-the-table mining. Reporting her findings to the Sith Lord Darth Vader, she was promised a promotion by her superiors in the Bureau. Unfortunately for Chyler, an uprising amongst Aqualish miners led her to be reprimanded for not being able to keep the employees in check. She never received her promotion, and, growing frustrated with the Empire, she defected to the Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "From the Sub-Adult Group to the Bureau"}, {"tag": "p", "text": "Cousin of the famous swoop racer Kimmi Chyler, the Human female Tian Chyler was a member of the Imperial Sub-Adult Group, part of the Commission for the Preservation of the New Order, where she displayed a streak of ruthlessness and pragmatism that attracted the attention of the Sub-Adult Group leaders. They, in turn, sent her to the Imperial Security Bureau for training. Although most who made the transition from the Sub-Adult Group to the Imperial Security Bureau were dismissed as zealots, Chyler's results silenced her detractors. Once she had completed her training, she successfully infiltrated Imperial Center's law enforcement community, tracking down and ferreting out Rebel spies."}, {"tag": "p", "text": "Her superiors were pleased, and they noticed that she had a particular skill for blending in with her surroundings. Chyler was subsequently tasked with a more significant mission: investigating unregistered Tibanna gas mining operations on Bespin. During her mission, she would be working with several other Bureau agents. She was instructed to masquerade as a Corellian mining official from Ando who had been able to escape the Imperial occupation of the world. Chyler was to claim that she was seeking sanctuary at Cloud City alongside Andoan officials and Aqualish workers. Cloud City was more than happy to receive them, and put them to work in the Cloud City Miner's Guild, though Alliance sympathizer Willrow Hood was suspicious of Chyler's background and motives."}, {"tag": "h3", "text": "Cloud City"}, {"tag": "p", "text": "In short order, Chyler and her colleagues were able to discover the full extent of Cloud City's unregistered mining operations. In 3 ABY, Chyler herself passed the information onto Lord Darth Vader, who in turn used the information to blackmail Baron Administrator Lando Calrissian into helping him capture the Rebel commander, Luke Skywalker. Calrissian complied, but Vader was unable to successfully capture the Rebel. Shortly afterward, his troops took over Cloud City, and Calrissian was forced to flee. The Bureau was satisfied with Chyler's work, and prepared to offer her a promotion, but unfortunately for the prolific agent, the Aqualish miners chose to revolt, causing a great deal of fuss at the gas platforms."}, {"tag": "p", "text": "The upstart Aqualish were subsequently executed by the Empire, but Chyler was denied her promotion and received a reprimand for failing to keep the miners in check. She was left at her post on Cloud City as an undercover agent to root out Alliance sympathizers, but was never again considered by the Bureau for promotion. Chyler grew frustrated, and as the Alliance started to gain the upper hand in the Galactic Civil War, she decided to defect, contacting A'roFilter employee Willrow Hood, who she suspected of having Rebel connections. Hood was initially wary of Chyler, as he had believed for some time that she had Imperial ties, but he eventually came to trust her, and she provided information about Cloud City's defenses to the Alliance that proved vital during the Battle of Bespin in 4 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tian Chyler was looked upon as an exception to the informal rule that Sub-Adult Group members who transitioned into the Imperial Security Bureau were fanatical zealots. The streak of ruthlessness that ran through her attracted the attention of her superiors, fast-tracking her career. Chyler was particularly adept at infiltration and working undercover, and her ability to blend in with her surroundings was a constant asset. When her advancement hit a dead end after her aiding Lord Vader in 3 ABY, her frustration reached such a level that she was willing to throw away the doctrines and teachings that had been drilled into her since she was a child, and join a force in opposition to Emperor Palpatine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Tian Chyler first appeared in the 1997 Special Edition re-release of Irvin Kershner's Star Wars: Episode V The Empire Strikes Back, but was unnamed for her appearance. The \"Special Edition Limited\" set of the Star Wars Customizable Card Game identified the character as \"Chyler,\" an agent for the Imperial Security Bureau from Star Wars: The Roleplaying Game. \"Chyler\" is an anagram of Cheryl (Kallenbach), the wife of a Decipher employee. In 2007, Timothy Carlsson, writing as \"yoda's waiter,\" elaborated on the character's story through StarWars.com's Hyperspace feature, \"What's The Story?\" Carlsson's entry, which was published in the Databank, made a number of Expanded Universe connections, to such elements as the Battle of Bespin, alluded to in The Truce at Bakura, Ando from Galaxy Guide 4: Alien Races, and the Sub-Adult Group from the Imperial Sourcebook."}, {"tag": "p", "text": "Carlsson initially named the character \"Sana Robben,\" with Chyler being an alias, but this was changed by the StarWars.com staff. Also exorcised from the entry was Chyler's homeworld, which Carlsson had identified as Coruscant. An element that Carlsson opted to cut out was an alluded to rivalry between the Sub-Adult Group and the Imperial Security Bureau; he ultimately felt that the plot thread did not make much sense. He consciously chose not to elaborate on Chyler's character, as he felt that \"kind of like James Bond,\" the character's actions were more important than their origins."}, {"tag": "p", "text": "His idea to have Chyler ferret out Alliance sympathizers amongst the Imperial Center law enforcement community was loosely inspired by James Ellroy's The Big Nowhere. Instead of unregistered Tibanna gas operations, Carlsson had originally focused on Cloud City's failure to pay tribute to the Empire in order to remain neutral. This was inspired by Sweden's tributary shipping of iron and ore to Nazi Germany during World War II."}, {"tag": "p", "text": "The character's first name of \"Tian\" was provided by Ian Tapley, author of Olana Chion and Antidar Williams Databank entries. The name itself was a tuckerization of Tapley's first name, and the initial of his surname."}, {"tag": "p", "text": "In his \"What's The Story?\" submission for Willrow Hood, Benjamin Christopher Norton Dawe chose to explain how Chyler defected by involving her in Hood's backstory."}, {"tag": "p", "text": "The Star Wars Galaxies Trading Card Game expansion set, The Shadow Syndicate, introduced the character Kimmi Chyler, a famous swoop racer active during the Galactic Civil War. The subsequent expansion, The Price of Victory, included a Tian Chyler card which revealed that the two characters are cousins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}