{"url": "Tibannopolis", "categories": ["Category:Legends articles", "Category:Cities on Bespin", "Category:Galactic Empire cities", "Category:Galactic Republic cities"], "nodes": [{"tag": "h1", "text": "Tibannopolis"}, {"tag": "p", "text": "Tibannopolis was the second largest city on Bespin, after Cloud City. It was one of Bespin's several tibanna gas mining operations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The city was constructed in close orbit around the gas giant, and its builders hoped it would one day rival Cloud City in terms of both gas mining and popularity. Its inability to compete on these terms caused its citizens to gradually abandon it during the ferocious Clone Wars."}, {"tag": "p", "text": "Left to float aimlessly, the city was often plundered by inhabitants of other colonies whenever they found useful materials. What remained of the city sprawl became little more than a ghost town in the clouds. Over the years, its repulsorlifts continued to operate, but the failure of a power regulator caused the entire platform to list slightly to one side."}, {"tag": "p", "text": "The bounty hunter Boba Fett once met with Aurra Sing in order to get his Firespray-31-class patrol and attack craft, Slave I, back from Sing. Fett wanted the ship since it had belonged to his father, Jango Fett, and arrived in a cloud car. The cloud car came in handy when Sing broke the deal and flew off, and Fett managed to get aboard after chasing her down."}, {"tag": "p", "text": "After the Imperial occupation of Cloud City, Tibannopolis lay almost completely uninhabited. Strangely enough, it was one of a relatively few colonies left operational when its mining operation failed to gain a profit."}, {"tag": "p", "text": "The Force-sensitive Streen came to depend on Tibannopolis as a refuge, in between his prospecting of Bespin's gases, in the time frame around the famous Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The Jedi Academy Sourcebook, Tibannopolis is repeatedly spelled \"Tibannoplis.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}