{"url": "Tides_of_Terror", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 14"], "nodes": [{"tag": "h1", "text": "Tides of Terror"}, {"tag": "p", "text": "Tides of Terror is a 10-page comic featured in Star Wars Tales #14 and collected in Star Wars Tales Volume 4. It was written by Milton Freewater Jr., pencilled by Adriana Melo, inked by Fabio Laguna, colored by Chris Blythe and lettered by Steve Dutro."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A few months after the Battle of Geonosis, Jedi Knight Aayla Secura and Jedi Master Kit Fisto were stationed on Kamino. While there, the Jedi found several dead Clone troopers. After examination by the Kaminoan scientists, they determined that the troopers had been infected by a nano-virus. After visiting master cloner Sayn Ta, they concluded that there was a traitor in the facility. Fisto and Secura tracked down the traitor and were confronted by a group of super battle droids that had been presented to the traitorous Kuma Nai by the Confederacy of Independent Systems."}, {"tag": "p", "text": "Fisto hurled his lightsaber into the starship of the fleeing traitor causing it to explode. The blast knocked Secura from the landing platform into the ocean. She tried swimming to the surface, but was held down by a sinking battle droid. Fisto dove in after her and being amphibious, was able to breath for the both of them. Aayla climbed back onto the platform and was grabbed by Kuma Nai, who held the nano-virus injector to her arm. Aayla freed herself from his grasp and managed to push the injector into Kuma Nai's own arm, killing the Kaminoan instantly."}, {"tag": "p", "text": "When Fisto saved Aayla it marked a significant point in their lives by arousing a relationship between the two that was always there. Similar to the relationship of Obi-Wan Kenobi and Siri Tachi, it strained the limits of the Jedi Code."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}