{"url": "Tierfon_Yellow_Aces/Legends", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Tierfon Yellow Aces personnel"], "nodes": [{"tag": "h1", "text": "Tierfon Yellow Aces"}, {"tag": "p", "text": "The Tierfon Yellow Aces were a BTL Y-wing starfighter training squadron in service to the Alliance to Restore the Republic, with a service history dating back prior to the Battle of Yavin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Yellow Aces, based out of the Tierfon Rebel Outpost, were primarily a training squadron where most recruits were sent so that they might get some combat experience without having to face extremely difficult situations. Their missions, while technically \"active,\" were not of the most hazardous variety. Often they were given light hit-and-fade missions typically assigned to a more experienced squad. After proving their competence, the next step up from Tierfon was \"full active\" duty on a high-security system base."}, {"tag": "p", "text": "It was the first unit of such famous starfighter pilots as Wedge Antilles, Wes Janson, and Jek Tono Porkins. Nozzo Naytaan, Dak Ralter, Tomer Darpen and Kissek Doran, father of Kell Tainer, were also pilots in the squadron."}, {"tag": "p", "text": "During one early strike mission prior to the Battle of Yavin, the squadron targeted an Imperial freighter with a strong TIE fighter escort intending to steal a badly needed shipment of food and fuel. During the mission, Doran suffered a panic attack and tried to escape the engagement in his Y-wing. In order to prevent the runaway fighter from compromising the mission and potentially leading to the complete destruction of the squadron, Janson was forced to shoot down Doran's ship, ultimately killing him. The takedown of a fellow Alliance pilot served as Janson's first official kill."}, {"tag": "p", "text": "Flying a T-65 X-wing starfighter, Naytaan led the Yellow Aces on a relief mission to Clak'dor VII."}, {"tag": "p", "text": "After the destruction of Alderaan and the true threat of the first Death Star was realized, Tierfon's status was boosted to \"full active.\" But the fighter contingent on the base was significantly reduced, with other less protected bases in need of greater fighter cover. Among those in need of immediate help was the Great Temple on the fourth moon of Yavin. The squadron was disbanded when elements of the Yellow Aces were cobbled together along with pilots from other groups to form Red Squadron for the assault on the Death Star."}, {"tag": "p", "text": "During the Yuuzhan Vong War, a squadron of volunteer pilots from Taanab led by Janson was named the Taanab Yellow Aces in honor of his old unit; that squadron fought with distinction during the Second Battle of Borleias."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}