{"url": "Battle_of_Sagma", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Illisurevimurasi sector", "Category:Battles of the Listehol Campaign"], "nodes": [{"tag": "h1", "text": "Battle of Sagma"}, {"tag": "p", "text": "The Battle of Sagma was a military engagement fought at the planet Sagma in 18 BBY between the forces of the Galactic Empire and the Sikurdian pirates. It was part of the Listehol Campaign, an Imperial effort to free the Listehol Run and Shaltin Tunnels from the threat posed by pirates and slavers. Admiral Wullf Yularen and Captain Bannidge Holt led the Imperials to victory during the fighting."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 18 BBY, the newly created Galactic Empire conducted the Listehol Campaign, a military effort to drive Sikurdian pirates, along with Zygerrian and Tervig slavers, out of the hyperlanes known as the Listehol Run and the Shaltin Tunnels."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As a part of the Listehol Campaign, Imperial forces engaged those of the Sikurdian pirates at the planet Sagma. Led by Admiral Wullf Yularen and Captain Bannidge Holt, an Imperial fleet consisting of Invincible-class Dreadnaught Heavy Cruisers—originally intended for the government of the Corporate Sector region—and a few Venator-class Star Destroyers housing squadrons of TIE/LN starfighters managed to withstand the swarms of pirates during the battle and attained victory."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Imperial victory at Sagma, Yularen's fleet proceeded to besiege the world of Zygerria. Two Imperial Army soldiers who participated in the Battle of Sagma, Captain Ganig and Sergeant Stecker, were made famous and honored as heroes by the Commission for the Preservation of the New Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Sagma was first mentioned in \"Picutorion Viewed From the Top,\" a short story published by West End Games in the 1989 Imperial Sourcebook and reprinted in the text's 1994 second edition. The battle was later referenced in The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart, and released in 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}