{"url": "Battle_of_Ryloth_(First_Order%E2%80%93Resistance_war)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the First Order–Resistance war", "Category:Battles of Ryloth"], "nodes": [{"tag": "h1", "text": "Battle of Ryloth  (First Order–Resistance war)"}, {"tag": "p", "text": "In 34 ABY during the war between the First Order and the Resistance, a battle was fought on Ryloth after the latter organization established their new base on the planet."}, {"tag": "p", "text": "After General Leia Organa went to an old friend, Ambassador Yendor of Ryloth, for aid, the Resistance was allowed to set up in a Ryloth Defense Authority cave base. However, the First Order arrived in Ryloth's capital of Lessu, and someone there eventually betrayed the Resistance. In the fighting, at least 1 pilot and Yendor's daughter, Hahnee Brethen, were killed. After Organa and Rey fought side by side, the Resistance general informed Yendor that Hahnee had died. While he initially intended to die while directing a cannon, Organa learned about the Resistance pilot's death, so Yendor took control of the fallen pilot's X-wing starfighter. After the Resistance escaped Ryloth, Commander Poe Dameron believed it showed that the Resistance was at risk wherever it gathered."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following their loses in the attack on the Resistance fleet and the Battle of Crait, the Resistance had lost the majority of its forces, although its leader, General Leia Organa, and several other members survived the battles and traveled in the Millennium Falcon. At least three other Resistance groups, Team Colossus, Black Squadron, and Inferno Squad, also survived by being elsewhere. Aboard the Falcon, Organa realized the starship could find refuge on the Outer Rim world of Ryloth. While Lieutenant Kaydel Ko Connix initially guessed there was an old rebel stronghold there, Organa clarified that they would be going because of an old ally and friend, as she hoped Ambassador Yendor would help them. While the Falcon was low on fuel, they were able to make the jump to lightspeed and arrive near the planet. When they were contacted by Lessu command, Rey, a Jedi apprentice and a new member of the Resistance, claimed the Falcon was carrying medial supplies for the southern region, although operations were then taken over by the Ryloth Defense Authority (\"RDA\")."}, {"tag": "p", "text": "RDA One, piloted by Yendor's daughter Hahnee Brethen, guided the Falcon to a Ryloth Defense Authority base built into a cave. Once inside, Charth Brethen informed the Resistance that they were at risk of joining the war for helping and that the decision to help had come from Yendor. After the crew of the Falcon was able to eat, Organa, Rey, and C-3PO were brought to Yendor. While he did not want Ryloth to be involved, Organa told him all they wanted shelter, foodstuff, and communications, and she revealed that they had very few ships left. While he understood that Chancellor Drelomon and General Ishel would be opposed to the idea, and he believed the First Order would attack them if their actions was discovered, Yendor believed that helping the Resistance refugees was the right thing to do. Sometime after he agreed, however, the First Order arrived in the capital city of Lessu for what appeared to be unrelated reasons, and they gave the Ryloth shipping guild 5 standard days to tithe to them before the shipping lanes were blockaded. Despite having less time to stage a mission out of the planet and Yendor fearing that Drelomon could betray the Resistance, Organa stuck to the plan of having their other ships arrive."}, {"tag": "p", "text": "Organa's few reinforcements, Commander Poe Dameron in a Hutt's starfighter, Black Squadron, Inferno Squad, and the individuals the groups had gathered, were able to arrive. After breaking up a fight between pilot Pacer Agoyo and ex-Imperial officer Teza Nasz, the Resistance planned out their next move in Yendor's library, which had become their war room. There, they decided to split their forces, as Shriv Suurgav would lead a group to Bracca to obtain starships, Corellian Team One would head to Corellia to an auction of a list of First Order subversives and prisoners, and Corellian Team Two would also head to the planet to rescue prisoners in Coronet City. After they had began their tasks, Rey asked Organa how the missions were going, as the Force gave her a feeling she could not explain. After speaking about the crews's progress, however, Rey still had the feeling, but she then realized that the First Order had arrived."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "After metal doors covered the windows, Yendor ordered that the alarm be sounded, although a  proximity alarm had also began. Hahnee was the first to enter war room's door and revealed that they had been betrayed in Lessu. On Corellia, Suralinda Javos of Team One needed to contact Connix on Ryloth to locate Wedge Antilles, a veteran of the Galactic Civil War and member of Team Two. Suralinda was given Team Two's coordinates, but Connix also warned her that they were evaluating Ryloth, which concerned Commander Dameron. However, while he felt like he should be protecting Organa and helping his friends on that world, he understood that he needed to complete his current mission. A message via Ryloth was also sent to Team Two, informing them that the other Corellian group had lost their ship."}, {"tag": "p", "text": "During the initial attack, one of Phantom Squadron's X-wing pilots was also killed, although, according to what Organa saw, Hahnee was the first to fall, having been shot in the chest. While Organa witnessed it, Yendor was unaware of his daughter's death, as he and other RDA fighters were holding the First Order back at the hangar's south end so Organa and the rest of the command base could escape. Doing what came naturally to her, Organa took Hahnee's rifle and fired at the incoming enemies. Although her opponents took shelter, she understood the weakness of her position and that her close to empty weapon would not hold for long. However, Organa was only working to hold long enough for her allies to make it to their ships. She called for Rey's help and fought side by side with her. Eventually, the attack on their position ended, although Organa believed it was more likely that the enemy was looking for an alternate route. She also believed they would wait and attack as the Resistance left the cave. After Chewbacca informed them that it was all-clear, Organa, with Rey covering her, was able to make it aboard the Falcon."}, {"tag": "p", "text": "With everyone in their ships and accounted for, Organa believed it was time for the Resistance to escape. Her anger at whoever in Lessu betrayed Yendor resurfaced, and Organa believed she needed to be one who told Yendor about his daughter's death, with the General also thinking Hahnee's death was her fault. Speaking to him with her comlink, she learned Yendor was having two men activate a secret cannon, which he hoped would give covering fire. After learning his daughter had died, he was informed that Charth's two children were safe. Yendor intended to die directing the cannon, but, after learning about the death of the Phantom Squadron pilot, Organa offered for him to pilot the leftover X-wing, which he agreed too. After this, Organa ordered Nien Nunb and Connix to the Falcon's turrets. In the cockpit, Rey explained the X-wings could led the other ships, and Organa agreed to her plan. Soon enough, the Falcon was airborne and leaving Ryloth."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By the time they were in the united Corellia teams were aboard ships and escaping the planet, they received word about the evacuation, so Dameron asked a new ally, Nifera Shu of the Collective, for a new location for the Resistance's forces. While they did set up at this safe house, Dameron believed Ryloth showcased that nowhere was safe for the Resistance. He believed they needed to scatter throughout the galaxy to grow their movement and that, eventually, they would rise up and destroy the First Order. Ultimately, in 35 ABY, the Resistance and citizens' fleet triumphed over the Final Order, an organization led by the resurrected Galactic Emperor Sheev Palpatine that the First Order had joined, in the Battle of Exegol. Following this victory, the people of the galaxy began to rise up against the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ryloth first appeared in Rebecca Roanhorse's 2019 novel Resistance Reborn and its audiobook adaptation."}, {"tag": "p", "text": "During the novel, it describes some of the Resistance's advertises in the battle as simply being enemies. For these characters, this article does not assume whether they are part of the First Order or another faction, as they could have been from Lessu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}