{"url": "Battle_of_Ryloth", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Battles of the Clone Wars", "Category:Battles of Ryloth", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Battle of Ryloth"}, {"tag": "p", "text": "The Battle of Ryloth, also known as the Ryloth campaign, was a major battle that broke out on the planet Ryloth during the Clone Wars. The battle pitted the Galactic Republic and its ally, the Twi'lek Resistance, against the Separatist Droid Army of the Confederacy of Independent Systems. The battle resulted in the liberation of Ryloth after the retaking of Lessu, in what became known as the Battle of Lessu. Years later, the recapturing of the capital would be named the Hammer of Ryloth in songs."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ryloth was invaded and blockaded by the Confederacy of Independent Systems' droid army under Techno Union Foreman Wat Tambor. The Separatist ground forces attacked the Republic garrison under the command of Jedi General Ima-Gun Di and Clone Captain Keeli. The Republic troops were aided by the Twi'lek resistance forces under Cham Syndulla, but supplies started to run dangerously low and their heavy weapons began to go offline. Di contacted Admiral Dao, who was commanding two cruisers in the system, but fleet was also running low on fuel, ammunition and supplies. Di ordered Dao to contact the Jedi Council immediately. Dao made contact with Masters Yoda, Windu and Kenobi to inform them he would not be able to re-supply the Outer Rim garrison, but Dao's transmission was cut short as his flagship was destroyed by the blockade, killing the admiral and his crew. With Dao's death and the annihilation of his fleet, General Di and the Outer Rim garrison were cut off, alongside the supply routes."}, {"tag": "p", "text": "The Jedi Council requested the Senate send Naboo Representative Jar Jar Binks with supplies to Toydaria, which was near to Ryloth, to resupply the Twi'leks and the remnants of the Republic garrison. The Council also requested that Alderaan Senator Bail Organa accompany Binks and speak with the Toydarian king about hosting a Republic weigh station. However, this information was intercepted by TX-20 and relayed to Count Dooku, who dispatched Trade Federation Senator Lott Dod to prevent Binks and Organa from negotiating an alliance with the Toydarians. Although King Katuunko officially refused Organa's request to aid the Republic supply efforts, he allowed Organa and Binks to discreetly complete their mission, provided that Dod and the Trade Federation would never learn of it. As Binks distracted Dod and the other guests at a dinner party, Organa quietly loaded blockade runners with supplies and sent them to Ryloth."}, {"tag": "p", "text": "General Di, Clone Captain Keeli and their troops prepped their last gunship to evacuate the resistance fighters' families, but the gunship proved too small to accommodate everyone. Di and his men opted instead to use the gunship as a bomb, blocking a mountain pass and forcing the droid army into a choke-point while Syndulla and his people fled through the mountains. Master Di and his men made a valiant last stand against the droids, sacrificing themselves for the Twi'leks' escape. As the Republic garrison fell, Organa's blockade runners narrowly reached the Twi'leks, renewing their hopes and allowing them to continue their resistance."}, {"tag": "h3", "text": "The occupation"}, {"tag": "p", "text": "After the annihilation of the Republic garrison, Ryloth became completely occupied by the Separatist Droid Army, with Wat Tambor overseeing the occupation from the city of Lessu. He dispatched his forces to pillage, ravage and rob the Twi'lek villages of anything of value, and also sent TX-20 to capture the city of Nabat and its inhabitants. Once there, TX-20 and his battle droids installed a battery of five proton cannons and used the captured Twi'leks as a living shield to protect them."}, {"tag": "p", "text": "While Tambor tightened his grip, the Twi'lek resistance continued to harass Tambor's forces, though at heavy cost. Syndulla was able to maintain a secret hideout and manage a network of spies to report on Tambor's activities."}, {"tag": "p", "text": "Ultimately, the Galactic Senate would answer the Twi'leks' plea to liberate their planet from Separatist occupation, sending Jedi Generals Mace Windu, Obi-Wan Kenobi and Anakin Skywalker with the Republic Army to free Ryloth from the Separatists."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "The blockade"}, {"tag": "p", "text": "Skywalker, along with his apprentice Commander Ahsoka Tano, Admiral Wullf Yularen, and Clone Captain Rex and his forces, were sent to break through the Separatist blockade under the command of Captain Mar Tuuk. General Skywalker dispatched his apprentice and Blue Squadron to engage the blockade's droid fighters. On their attack run Tano and her squadron initially broke through the droid fighters, but Captain Tuuk outflanked them by summoning surprise reinforcements. Skywalker and Yularen called back Blue Squadron, but Tano disobeyed direct orders and pressed her attack. Tuuk's forces successfully broke through the Republic lines, launching suicide runs against the Resolute, Defender, and Redeemer. Tano reluctantly called a retreat, losing all but two members of her squadron in the battle. Admiral Yularen was severely injured when a droid fighter impacted with the bridge of his command ship. After Tano's broken squadron returned to Resolute and the Redeemer was destroyed, Skywalker retreated into hyperspace, then contacted Masters Windu and Kenobi to inform them of his lack of progress and the casualties. Windu warned Skywalker that if he could not break the blockade the invasion would have to be postponed. Skywalker recognized that they could not afford to postpone the invasion any longer, and assured them he would break the blockade. Skywalker impressed upon his apprentice the critical urgency of their mission, but Tano insisted there was no way to blast through the blockade with the one remaining battleship."}, {"tag": "p", "text": "Heeding the words of his apprentice, Skywalker evacuated the Defender's crew and hatched a plan to use the Defender, which was beyond repair, to ram into the droid command ship, with only himself and R2-D2 piloting the cruiser. Skywalker placed Ahsoka in command of the Resolute and their remaining forces, urging her to devise a strategy by which to finish off the remainder of the blockade. After Skywalker departed with the Defender, Tano and Rex discussed a maneuver to entrap the remaining droid forces and send BTL-B Y-wing starfighter/bombers to finish them off. Though Rex and one of the bridge officers questioned the viability of this tactic, Ahsoka impressed upon them the critical urgency of the situation. Yularen, still recovering from his injury, concurred with her bold and unorthodox strategy."}, {"tag": "p", "text": "As Skywalker arrived at Ryloth, he hailed Captain Tuuk and offered to surrender himself, his crew and his ship to the Separatist forces in exchange for delivery of relief supplies to the Twi'leks. When the droids' scans indicated only Skywalker onboard, Tuuk flatly rejected Skywalker's offer, but Skywalker quipped that the captain could still have his ship, then powered the cruiser's impulse engines and abandoned the battleship with R2 as it plunged toward the droid command ship. The firepower of all the Separatist frigates was insufficient to destroy the Defender, and it slammed into the droid command ship, destroying it as Tuuk fled in an escape pod. Ahsoka then deployed her stratagem, confident that the droids would never realize the deception until it was too late. As the Resolute followed Ahsoka's plan, it rotated ninety degrees on its axis, exposing its bow and drawing enemy fire to create cover for the emerging bombers. The droids were slow to take the bait, but eventually concentrated all firepower on the Resolute as Ahsoka launched her bombers to destroy the frigates. Tambor attempted to contact Tuuk, but realized the blockade had been broken when he learned that Tuuk had fled. Ahsoka made contact with Masters Kenobi and Windu, who were both accompanying the Republic's invasion fleet, confirming that they may begin their landing on Ryloth. Skywalker and his forces then completely secured the space around Ryloth."}, {"tag": "h3", "text": "Landing at Nabat"}, {"tag": "p", "text": "As the Republic forces made their descent, General Kenobi, Commander Cody, and the troopers of Ghost Company were sent in by General Windu to secure the landing area near the city of Nabat. As Kenobi and his troopers made their way to Nabat aboard their gunships, the droid commander TX-20 received orders from Tambor, who was now the emir of Ryloth, to repel the Republic's landing. TX-20 assured Tambor that the proton cannons would prove sufficient, and that the Jedi would not risk a ground assault with Nabat's inhabitants acting as a living shield. As Kenobi and his gunships closed in, Kenobi and Cody made clear that they would not use rockets or detonators in the city. TX-20 opened fire on the gunships and assault ships, destroying the right engine of one of the assault ships. Windu and Commander Ponds contacted Kenobi, informing him that they could not risk landing the larger transports until Kenobi had destroyed the cannons. Finally Kenobi and his gunships successfully landed on the outskirts of Nabat."}, {"tag": "p", "text": "Kenobi and Ghost Company were greeted with heavy fire from the outer defenses, which they subdued by tossing droid poppers into the machine gun nests. Kenobi sent Cody and his \"best men\" to scout ahead and report on the droids' plans. Cody, along with troopers Wooley, Waxer, and Boil split into two teams: Waxer and Boil found a young Twi'lek girl called Numa hiding in the ruins, while Cody and Wooley located the cannons and discovered that the battle droids were using Nabat's survivors as hostages. Meanwhile, TX-20 dispatched recon droids to ascertain the clones' plan of attack. Cody and Kenobi informed Windu of the weaponry and hostage situation, and Windu made clear that moving the hostages out of harm's way was top priority. Kenobi assured him that he would still be able to take out the cannons. Upon learning that Kenobi was leading the attack, TX-20 unleashed a captured herd of starving Gutkurr upon the clones. As Kenobi and Cody were preparing to commence their attack, Waxer and Boil had decided to bring Numa with them and were late for the rendezvous. As they received a message from Cody, they came under attack by two Gutkurrs, but escaped through the tunnels in Numa's home. As Kenobi, Cody and their troopers moved their positions forward, they came under attack by the Gutkurrs, which ate and killed several of the troopers before Kenobi use a mind trick to lure them away from his troopers and trap them in an alleyway. Kenobi and Cody then regrouped Waxer, Boil and Numa emerging out of a tunnel. Kenobi asked Numa to show him any tunnels through which he could sneak past the droids and free the prisoners, and ordered Cody to create a diversion."}, {"tag": "p", "text": "As Cody, Wooley and the remainder of Ghost Company prepared to attack the droids, Kenobi, Waxer, Boil, and Numa made their way through the tunnels to the Gutkurr's cages. Kenobi waited while Cody and his men attacked the droids, leaving only a few guards and the gun crews left. As TX-20's battle droids and tanks took on the clones, Kenobi, Waxer and Boil freed the prisoners. With the prisoners were safe, Kenobi, Waxer and Boil seized control of one of the cannons, using it to destroy all the others. TX-20 learned that Kenobi had freed of the prisoners and turned his tank around, destroying the cannon Kenobi was using and holding him and Numa at gunpoint. However, the liberated Twi'leks rallied, ripping TX-20 out of his tank and tearing him to pieces."}, {"tag": "p", "text": "With the proton cannons destroyed and the prisoners released, General Windu and his transports were then free to land. As Kenobi and Windu regrouped, they recognized that they would have to take the capital in order to free the rest of Ryloth. Kenobi and his forces continued liberating other villages from the droids, eventually securing the Jixuan desert and Ryloth's southern hemisphere."}, {"tag": "h3", "text": "Battle of Lessu"}, {"tag": "p", "text": "On the march to liberate Lessu, General Windu and Commander Ponds' forces came under attack by a group of AATs while exposed on a cliffside. The droids forced the Republic forces to halt briefly, but were overtaken by Windu's Lightning Squadron. Windu lost 32 men in the attack, including command crews of three walkers. Windu attended a hologram conference with Chancellor Palpatine, Senator Orn Free Taa of Ryloth, Grand Master Yoda, and Admiral Yularen. Anakin Skywalker also briefly joined, informing the group that his forces had the remains of the Separatist fleet in retreat. Windu lamented that his forces would be unable to capture Ryloth without reinforcements, leading him to seek out and recruit the resistance fighters led by Cham Syndulla. Palpatine and Taa warned Windu that Syndulla was a political radical and untrustworthy. Yularen reported that there were no Republic reinforcements available, wherein Windu insisted they could not win without Syndulla's help."}, {"tag": "p", "text": "In Lessu, Tambor and his tactical droid TA-175 observed as Windu and his forces moved towards Lessu. Despite TA-175's suggestion that they prepare for evacuation, Tambor refused, knowing full well that Windu lacked the troops to take Lessu. Tambor ordered his forces inside the city and to secure the bridge. Dooku learned from TA-175 of Tambor's \"pitiful job\" of protecting the Separatists' investment on Ryloth, though Tambor insisted that the droid exaggerated as he had not yet been defeated. Recognizing that Tambor was no match for Windu, Dooku ordered him to retreat with what valuables could be taken and to destroy everything else on Ryloth as a message demonstrating \"the cost of a Republic victory.\" TA-175 prepared Hyena bombers for a fire-bombing campaign and Tambor's shuttle for evacuation. Tambor still refused to leave, sending the bombers to destroy every village within range. Ponds noticed how they destroyed the villages after the droids pulled out of them. The bombers completely incinerated at least two of Ryloth's villages."}, {"tag": "p", "text": "Windu and two of his troopers encountered Syndulla and his men after the latter took out a droid patrol. Syndulla was initially skeptical of Windu's overtures and hesitant to join forces, fearing another possible occupation by the Republic; but upon learning that the Separatists were bombing Twi'lek villages, he softened his position and requested an audience with Taa. Taa promised him that once the Separatists were expelled, the Republic would also leave as long Syndulla did not pursue political power. Syndulla agreed to these terms and organized his fighters to retake the capital. Meanwhile, Skywalker and Ahsoka were in the air, chasing down and destroying as many of the bombers as they could."}, {"tag": "p", "text": "As the Republic pressed onward towards Lessu, Tambor gathered the remaining valuables. Dooku, growing increasingly impatient with the Emir, ordered him to leave immediately before the Republic arrived, and also ordered TA-175 to bomb the capital after he and Tambor had left. Tambor refused to leave, waiting for his last two MTTs filled with Twi'lek treasure. As the Republic moved into the outskirts of Lessu, Tambor then had city inhabitants brought outside the city walls, hoping their presence would slow down Windu."}, {"tag": "p", "text": "As Windu and Syndulla searched for a way across the energy bridge, Syndulla spotted the two MTTs en route. Windu, despite the risk of being scanned and discovered, took two of his troopers to infiltrate an MTT in order to cross the bridge. After destroying one of the STAPs, Windu and his two troopers hid inside one of the MTTs. Windu then ordered Syndulla and Ponds to commence the attack as soon as the bridge was activated. The battle droids scanned the cargo on the bridge, and discovered Windu and his men. After subduing the droids, Windu pushed his two troopers across the bridge as it was being turned off by the droids. As he fell, Windu was able to jump on one of the STAPs and ride it to other side of the bridge, then held off the battle droids as Stak and Razor ascended to the control room."}, {"tag": "p", "text": "Syndulla, Ponds and their forces commenced their attack, charging towards the bridge to Lessu. Stak and Razor reached the control center and took out the droids and the commander stationed there. They were then able to turn the bridge on and hold it against a few droid reinforcements, including a pair of commando droids. Syndulla and his men fought the battle droids as Windu pursued Tambor, who was skulking away toward his ship with an escort of two super battle droids. However, TA-175 evacuated without Tambor and informed Dooku, who ordered the immediate bombing of the capital. As Windu subdued the super battle droids, Tambor attempted to negotiate, despite the fact that he was in no position to. He then laughed as they would all die for the glory of the Separatist Alliance, but the four Hyena bombers sent to bomb the capital were destroyed by Skywalker and Tano. Syndulla then demanded that Tambor unconditionally surrender, and the Skakoan quickly agreed."}, {"tag": "p", "text": "The Republic forces, as well as the resistance forces, were then joined by Senator Taa to throw a parade in honor of the combined victory over the Confederacy."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "After the successful collaboration between local fighters and Republic forces, Republic High Command experimented with sending commando squads to Separatist-occupied worlds and coordinating with local fighters. A degree of success was achieved on worlds like Aridus and Tynna, but this policy drew controversy in that the Republic was exposing civilians to punishment by Separatist forces."}, {"tag": "p", "text": "Padmé Amidala later told Chiss Expansionary Defense Fleet Commander Thrawn about Ahsoka Tano's maneuver during the campaign. During his time as Grand Admiral in the Galactic Empire, Thrawn employed that very maneuver against species such as the Grysk."}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, the people of Ryloth—now classified as a protectorate, pillaged for slaves and spice by their Imperial overlords—would remember Windu's exploits during the Battle of Lessu, immortalizing both his and Cham Syndulla's name in songs, where the battle was referred to as \"The Hammer of Ryloth.\""}, {"tag": "p", "text": "Chopper's Y-wing bomber was later left as a war memorial near the Syndulla residence in the Tann Province."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Ryloth first appeared in the newsreel of the Star Wars: The Clone Wars episode \"Jedi Crash.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}