{"url": "Tiingilar/Legends", "categories": ["Category:Legends articles", "Category:Mandalorian food"], "nodes": [{"tag": "h1", "text": "Tiingilar"}, {"tag": "p", "text": "Tiingilar was an intensely spicy casserole made by members of the Mandalorian culture, using a blend of meat, vegetables, and potent spices. Tiingilar's spices gave the dish a pungent scent, enough to burn an individual's nasal passages. This effect was known as hetikles, or \"noseburn,\" when translated from the Mando'a language to Galactic Basic Standard. Prized by Mandalorians, it was one of four qualities sought after in Mandalorian cooking, and made tiingilar a favored dish of many Mandalorians."}, {"tag": "p", "text": "Shortly after the Galactic Republic's transformation into the Galactic Empire in 19 BBY, a large bowl of tiingilar was served during a family dinner at the Skirata clan's Mandalore residence. The Jedi-turned-Mandalorian, Bardan Jusik, used the dish in a demonstration of casual Force usage for a young Venku Skirata, before the tiingilar was eventually eaten by the other individuals in attendance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tiingilar first appeared in Star Wars canon in the Republic Commando novel, Order 66, written by author Karen Traviss and published September 16, 2008. The dish was later mentioned in the massively multi-player online roleplaying game, Star Wars: The Old Republic, created by BioWare and released December 20, 2011."}, {"tag": "p", "text": "Following the acquisition of the Star Wars franchise by The Walt Disney Company, tiingilar was brought into the new, rebooted official Star Wars canon via a detailed appearance in The Official Black Spire Outpost Cookbook, written by Chelsea Monroe-Cassel and Marc Sumerak. In addition to providing an at-home recipe for how to make the Mandalorian dish, the Black Spire Outpost Cookbook finally provided a canonical image of tiingilar after more than a decade without one."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}