{"url": "Battle_of_Ryloth_(Diversity_Alliance_Crisis)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Ryloth", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of Ryloth  (Diversity Alliance Crisis)"}, {"tag": "p", "text": "A battle took place on Ryloth in 24 ABY between the New Republic and the Diversity Alliance."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In response to allegations that the Diversity Alliance was stockpiling weapons for a war against Humans and keeping Human slaves, an inspection team led by Jedi Master Luke Skywalker, the Chadra-Fan senator Trubor and the Twi'lek Kur was dispatched to Ryloth to investigate. Accompanying them were the Wookiee Sirrakuk and the Chironian Lusa, both of them former Diversity Alliance members. Upon arriving they were greeted by the Devaronian Kambrea, one of Nolaa Tarkona's subordinates. She then took them on a tour of a large city on Ryloth. During the tour, the inspection team was escorted by Diversity Alliance soldiers."}, {"tag": "p", "text": "However, after the tour, Skywalker insisted on visiting the ryll mine where it had been alleged that the Diversity Alliance was keeping Human slaves. Unfortunately, the Humans had been replaced by zealous Twi'lek workers from the surrounding cities. Despite this, Lusa, Sirrakuk and Cilghal insisted on visiting the loading dock."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "There, Kambrea claimed that the crates there were food and medicinal supplies for alien colonies which she claimed that the New Republic had abandoned. Knowing they were actually storing weapons, and in frustration, Sirrakuk smashed open a crate marked \"medical supplies\", exposing the weapons inside. In response, Kambrea ordered her troops to open fire and a gun battle ensued."}, {"tag": "p", "text": "During the battle, Kambrea was crushed by a wall of crates, thus killing her. Unfortunately, this only fired up the Diversity Alliance soldiers and they fought back with increased ferocity. During this fight, the Chadra Fan senator Trubor was shot dead. In response, Kur stood up and made a speech stating that he was sickened by the senseless killing and that the Diversity Alliance's quest for revenge against Humans for the crimes of the New Order had led to nowhere but bloodshed. Hearing this, many of the Diversity Alliance troops surrendered. Thus, the battle was over."}, {"tag": "h2", "text": "Appearances"}]}