{"url": "Timeline_10:_The_Exar_Kun_War", "categories": ["Category:Real-world articles", "Category:Galactic Timeline"], "nodes": [{"tag": "h1", "text": "Timeline 10: The Exar Kun War"}, {"tag": "p", "text": "Timeline 10: The Exar Kun War is the tenth in the series of in-universe videos, providing backstory for the Star Wars: The Old Republic video game. The video is presented in the form of a record entry made in the Jedi Archives by Jedi Master Gnost-Dural."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The stories of Exar Kun's fall to the dark side and his campaign of destruction against the Republic have been told as warnings to Jedi Padawans for generations. After witnessing the return of the Sith Empire, Master Gnost-Dural has realized a new relevance to Exar Kun's role in history."}, {"tag": "p", "text": "BTC 347 – Decades before the outbreak of the Mandalorian Wars, a promising Jedi named Exar Kun began exploring the secrets of the Force. Despite the warnings of his Masters, Kun didn't hesitate to experiment with the dark powers of the ancient Sith. After being confronted by the spirit of the fallen Sith Lord Freedon Nadd, Exar Kun harnessed the power of the Sith Temples on Yavin 4 and embarked on a campaign to destroy the Republic and the Jedi Order. After aligning with the Krath Cult and fellow fallen Jedi Ulic Qel-Droma, Exar Kun's armies managed to destroy the Jedi library on Ossus, but that was to be his final victory before being betrayed and defeated. Centuries later, the Jedi have learned that Exar Kun's campaign took place even while the ancient Sith Empire remained in exile on Dromund Kaas. Jedi Master Gnost-Dural now asks, if Exar Kun's rise to power was encouraged by the spirits of the ancient Sith, what might this suggest about their support for the resurrected Sith Empire?"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This timeline incorrectly depicts Cay Qel-Droma with two normal arms when he was killed by Ulic. However, by this time, Cay had a prosthetic right arm."}, {"tag": "p", "text": "The timeline also suggests that the Jedi Council of this era consisted of a human male, an elderly human female, and a Chagrian male."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}