{"url": "Tilnes", "categories": ["Category:Legends articles", "Category:Crystalline moons", "Category:Galactic Republic moons", "Category:Rocky moons", "Category:Thaere sector moons", "Category:Tilnes locations"], "nodes": [{"tag": "h1", "text": "Tilnes"}, {"tag": "p", "text": "Tilnes was a moon of Cularin with underground crystal mines. Though it had an atmosphere, Tilnes was barely capable of sustaining life due to the fact that for two months a year, its orbit around Cularin took it too close to Morasil, one of the Cularin system's suns. Only hardy grass and yri worms were native to the moon."}, {"tag": "p", "text": "The moon's rich crystal resources were not known until a meteor impact uncovered a deposit. The crystals were good for power foci for T-32S light blasters, while others were suitable for the building of lightsabers. Initial attempts at settlement of Tilnes ran into troubles during the passage close to Morasil. Eventually, underground settlements were created to hide from the high radiation. The Verga Mer Mining Company (VMMC) established the first of these around 62 BBY, the success of which granted them a charter, and they remained the largest mining firm on Tilnes. Miners from that and other companies met in The Underground, a cantina which was considered \"politically neutral ground\"."}, {"tag": "p", "text": "The nature of the moon's crystal deposits, radiation exposure, and seismic activity combined to send out pulses that interfered with the operation of droids (All the originally sent droids had left, except for advisor S-4QD). The mining of Tilnes became a task completed by a \"purely organic workforce,\" which became a positive selling point in drawing workers to the mines. The possitive results of this measure during the first two years encouraged Verga Mer to set higher goals, which would never be reached. Nevertheless, the operation had no difficulty finding investors from Cularin and from other systems, and Verga Mer became an important economic power in the surrounding systems."}, {"tag": "p", "text": "A large crevasse known as Kaernor's Smile was one of the most distinctive features of Tilnes. The disturbing dreams and power failures associated with the canyon kept all mining operations from coming close to it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}