{"url": "Timeline_12:_The_Great_Hyperspace_War", "categories": ["Category:Real-world articles", "Category:Galactic Timeline"], "nodes": [{"tag": "h1", "text": "Timeline 12: The Great Hyperspace War"}, {"tag": "p", "text": "Timeline 12: The Great Hyperspace War is the twelfth in the series of in-universe videos, providing backstory for the Star Wars: The Old Republic video game. The video is presented in the form of a record entry made in the Jedi Archives by Jedi Master Gnost-Dural."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Over the millennia, the Galactic Republic has faced no greater threat to its existence than the brutal invasion instigated by Sith Lord Naga Sadow. It was a time in history when the original Sith Empire had reached the height of its power, and the Republic was poorly prepared for a conflict of such magnitude. Master Gnost-Dural looks back at the Great Hyperspace War and identifies the controversial decision that drove the Sith into exile and set the stage for the Empire's campaign of vengeance against the Republic. While the war went well for the Sith at first, Naga Sadow's apprentice had his own plans: betray his master. Without experienced command, the Sith were driven back to their territory by Republic forces. This time, the Supreme Chancellor ordered a search for Sith to prevent future devastation."}, {"tag": "p", "text": "BTC 1347 – When two hyperspace explorers stumbled onto the remote world of Korriban, they never could have guessed the chain of events they were setting into motion. Over the previous centuries, the Sith Empire had grown in size and strength, and Korriban was the very heart of its dominion. The reigning Sith Lord, Marka Ragnos, had just died, sparking a brutal power struggle between rivals Ludo Kressh and Naga Sadow. The explorers' arrival marked the first contact between the Republic and the Sith Empire, and it created at an opportunity to end the power struggle. Naga Sadow seized the moment and rallied the Sith for a pre-emptive strike against the Republic under his leadership. The ensuing series of battles saw the Republic nearly destroyed, but Naga Sadow's machinations ultimately backfired, and the Republic drove the Sith back to Korriban. The Supreme Chancellor then directed Republic forces to ensure the Sith never returned… by annihilating their civilization entirely—a move which would ultimately come back to haunt the Republic centuries later…"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}