{"url": "Time_travel", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Physics", "Category:Time"], "nodes": [{"tag": "h1", "text": "Time travel"}, {"tag": "p", "text": "Time travel was a form of transportation through time into the past or the future. Although some beings sometimes wished they could travel back in time to change mistakes they made in their lives, such a thing was still widely thought to be impossible, even during the height of the New Republic. A hypothetical device for allowing so was known as a time machine."}, {"tag": "p", "text": "Access to the World Between Worlds made time travel possible through many of the doors and pathways to the past, present and future. However, the mystical Force realm's existence was mostly unknown, and only a few Force-users could enter it. In 0 BBY, Jedi Padawan Ezra Bridger entered the World Between Worlds through a portal in the Lothal Jedi Temple and rescued the former Jedi Ahsoka Tano from being killed by Darth Vader during the mission to Malachor, which had occurred three years before, by pulling her through a portal. During their time there, Bridger briefly considered rescuing his master Kanan Jarrus, who had died during the rescue of Hera Syndulla, by pulling him through a portal. However, Tano talked him out of it by pointing out that rescuing Jarrus would mean that all of the other Spectres present, including Bridger, would have died in the explosion of the Imperial gas refinery, causing a paradox. After being attacked by Darth Sidious, Bridger and Tano returned through the same portals they had entered, emerging on Lothal and Malachor respectively, three years apart."}, {"tag": "p", "text": "Luke Skywalker, when asked by C-3PO how the latter could help him, sarcastically suggested that the droid could help by altering time far enough into the future to bypass the harvest season so he could join the Imperial Academy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Time travel was first mentioned, sarcastically, in Star Wars: Episode IV A New Hope. It first appeared in Star Wars canon in the second issue of the 2016 comic book series Star Wars: Doctor Aphra."}, {"tag": "p", "text": "The non-canon LEGO Star Wars Holiday Special has time travel as a major part of its plot, as Rey Skywalker is guided to a Jedi Temple on the planet Kordoku. There, she finds a portal which sends her on a journey through time to meet many important figures from galactic history."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}