{"url": "Battle_of_Sanrafsix_(Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Sanrafsix  (Galactic Civil War)"}, {"tag": "p", "text": "In 5.5 ABY, during the Galactic Civil War, the New Republic and the Eriadu Authority, a faction of former Imperials, fought a battle at the planet Sanrafsix in the Outer Rim Territories, as the New Republic strove to eliminate the threat of the Eriadu Authority's leader, Warlord Sander Delvardus. The battle followed a New Republic victory at Sullust, in which Delvardus failed to take control of that planet. At Sanrafsix, New Republic forces defeated those of the Eriadu Authority, with legendary Imperial starfighter pilot Shea Hublin dying in the fighting."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A New Republic campaign took place during the Galactic Civil War to stop the threat of Imperial Warlord Sander Delvardus, who controlled the faction of former Imperials known as the Eriadu Authority, which occupied a large area of the galaxy, including the Seswenna sector. When Delvardus and his forces were mauled during their attempt to retake the planet Sullust in 5.5 ABY, skilled Imperial starfighter pilot Shea Hublin came to the aid of Delvardus; Hublin had previously left Delvardus's campaigns after the Warlord had stated he wanted to invade the Core Worlds of the galaxy."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "After Sullust, the New Republic launched a series of merciless assaults against the Eriadu Authority. The first occurred at the world of Sanrafsix in the Outer Rim Territories, where Hublin's TIE Series starfighter squadron engaged flights of T-65 X-wing starfighters. During the dogfighting, Hublin's squadron continued to take losses until Hublin was the last one left. He soon died after the X-wings destroyed his TIE, but not before he changed his comm unit to an open channel and stated that Eriadu would endure."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following its victory at Sanrafsix, the New Republic also scored wins at Kabal, Clak'dor VII, and Sluis Van. In response to the New Republic advances, Delvardus fled to the Deep Core as his Eriadu Authority was thrashed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The fighting at Sanrafsix was first mentioned in 2009's The Essential Atlas, by Daniel Wallace and Jason Fry. It was later mentioned in The Essential Guide to Warfare, released in 2012 and written by Fry and Paul R. Urquhart."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}