{"url": "Time_of_Suffering/Legends", "categories": ["Category:Legends articles", "Category:Battles of Naboo", "Category:Civil wars", "Category:Conflicts of the Mid Rim"], "nodes": [{"tag": "h1", "text": "Time of Suffering"}, {"tag": "p", "text": "The Time of Suffering was a two hundred-year long internal war among the disparate city-states of Humans that inhabited the planet of Naboo. Having started around 1000 BBY, the conflict ended circa 800 BBY, with the rise of King Jafan and the second foundation of Theed. The monarch subsequently established the Great Time of Peace."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 1000 BBY, the great New Sith Wars were being brought to an end, and the pan-galactic government known as the Galactic Republic moved on to a new age of peace. However, the small planet of Naboo was not part of the Republic at that time, and its Human inhabitants were divided into rival city-state, despite having had an elective monarchy for over two thousands years."}, {"tag": "h2", "text": "The conflict"}, {"tag": "p", "text": "While the wider galaxy was entering a global state of peace, the Naboo city-states engaged in a war against each other around 1000 BBY. In spite of that on-off conflict, representatives of the Galactic Republic approached the Naboo with an offer to join, which they accepted in late Spring of 868 BBY. Around 800 BBY, King Jafan ascended to the throne and managed unite the disparate city-states, establishing the Great Time of Peace. The small city of Theed was also made the new capital of Naboo."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thanks to an influx of farmers, engineers and artisans, Theed observed its second foundation. With the new Royal Palace placed at its heart, it grew into one of the most beautiful cities in the galaxy. In memory of the Time of Suffering, the later rulers of Naboo would bear the ceremonial scar of remembrance, a red slash that bisected their white-painted lower lip."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}