{"url": "Timeline_11:_Rebirth_of_the_Sith_Empire", "categories": ["Category:Real-world articles", "Category:Galactic Timeline"], "nodes": [{"tag": "h1", "text": "Timeline 11: Rebirth of the Sith Empire"}, {"tag": "p", "text": "Timeline 11: Rebirth of the Sith Empire is the eleventh in the series of in-universe videos, providing backstory for the Star Wars: The Old Republic video game. The video is presented in the form of a record entry made in the Jedi Archives by Jedi Master Gnost-Dural."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In the years following the Great Hyperspace War, the Sith exiles on Dromund Kaas faced a daunting future on a harsh world. The guidance of the Emperor and the Sith Lords were critical, but Republic Intelligence has stolen historical records that indicate the resilience and determination of the early Imperial Military were no less crucial to the Empire's reconstruction. Master Gnost-Dural has identified one Imperial Military Leader in particular whose story exemplifies the strength that runs throughout every level of Imperial Society."}, {"tag": "p", "text": "BTC 1251 – Following the destruction of their ancient civilization on Korriban, the Sith exiles sought to rebuild their Empire amid the jungles of Dromund Kaas. The man who eventually earned the distinction of the being the Empire's first new Grand Moff, Odile Vaiken, emerged as a critical figure in these dark years. While the Emperor and the Sith Dark Council were preoccupied with long-term strategies, Vaiken recruited non-Force users to form the new Imperial Military. This nascent but efficient army courageously battled the powerful native creatures on Dromund Kaas to carve out the space for a secure civilization. In later years, as the new Sith Empire grew in size and strength, Vaiken went on to establish the foundation for the modern Imperial navy and set the standards for constructing a fleet that would one day emerge from exile and crush the Republic. For common Imperial citizens, Vaiken became a model for their highest aspirations, proving that even non-Force users would play a vital role in restoring the Sith Empire to prominence and power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": "|pl=Timeline 11: Rebirth of the Sith Empire\n|ru=Хронология 11: Возрождение Империи ситов\n}}"}]}