{"url": "Till%27in", "categories": ["Category:Legends articles", "Category:Jedi Masters of the Jedi Order", "Category:Jedi Researchers", "Category:Kel Dor", "Category:Males"], "nodes": [{"tag": "h1", "text": "Till'in"}, {"tag": "p", "text": "Till'in was a male Kel Dor Jedi Master who served the Jedi Order and the Galactic Republic during the Cold War with the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Kel Dor, Till'in was trained in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master."}, {"tag": "p", "text": "At some point, Till'in was stationed at the Order's enclave on the planet Haashimut. It was Till'in who was forced to explain to Theron Shan that he was not Force-sensitive therefore could not remain in the Jedi Order."}, {"tag": "p", "text": "Following the Great Galactic War and the resurgence of the Sith Empire, Master Till'in returned to the ancestral Jedi homeworld Tython with the rest of the Order and helped rebuild during the Cold War, residing at the Temple there. While still accepting assignments, Master Till'in had business on Raxus Prime when he came across a young Force-sensitive Human adolescent named Fia. Frightened by his appearance, Fia shot at the Jedi Master; an action she would later regret as the Jedi approached her and asked her to join the Order. Taking her to Tython, Fia would constantly apologize for attempting to kill him, much to his annoyance."}, {"tag": "p", "text": "A respected archaeologist, Master Till'in made a camp outside the ruins of the ancient fortress city Kaleth and used his considerable knowledge of ancient technology to analyze the bizarre programming of the ancient Tythonian War Droids protecting the ruins. He hired a traveling Padawan to collect memory cores from the droids. These cores revealed that the droids were activated thousands of years ago by the dark side forces of the Force Wars as a last effort just before their own demise to eliminate the light side forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}