{"url": "Tim_Dry", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Articles with unencyclopedic tone", "Category:Star Wars production staff"], "nodes": [{"tag": "h1", "text": "Tim Dry"}, {"tag": "p", "text": "Tim Dry is a mime artist who portrayed J'Quille and a Mon Calamari officer in Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "Tim Dry studied Mime and Physical Theatre with Desmond Jones for four years and also worked with Lindsay Kemp (tutor to David Bowie and Kate Bush)."}, {"tag": "p", "text": "Throughout 1978 and 1979, Tim and fellow artist Barbie Wilde toured their own mime show in leading fringe theater venues and festivals throughout the UK. In 1980, Tim and Barbara formed a rock/mime/burlesque/music troupe named Shock with Sean Crawford, Carole Caplin, Robert Pereno, and LA Richards. They traveled the world, made some records, got much press attention, and found themselves in the vanguard of the New Romantic cult of the early '80s, alongside Boy George, Duran Duran, Adam Ant, and Spandau Ballet."}, {"tag": "p", "text": "Tim and Sean then created a robotic mime-and-music duo called Tik and Tok. They toured with Gary Numan, worked with Vangelis, were supported by a fledgling Depeche Mode, got much more press coverage, and released five singles and a well-received album. They appeared on innumerable TV shows (including The Royal Variety Show, 1983) and had featured roles in Return Of The Jedi and cult sci-fi/horror flick Xtro."}, {"tag": "p", "text": "After Tik & Tok disconnected from each other, Tim moved into mainstream acting. He has been featured in over 90 TV commercials in the UK and Europe, as well roles in film, TV, and Off-West End Theatre. An odd twist of fate led to him co-presenting a food-and-drink series for Channel 4 named \"Feast\" in 1997. Tim is also an award-winning photographer/digital image maker, whose work has been exhibited in Hamburg, Berlin, New York, The National Portrait Gallery, Gallery 286 in London, The Association of Photographers Gallery, and twice at The Royal Photographic Society in Bath. His portrait subjects include Mick Jagger, The Mediaeval Baebes, Joan Collins, Steven Berkoff, and author Rupert Thomson."}, {"tag": "p", "text": "Tim Dry has written an autobiography titled Falling Upwards - Scenes From A Life and has recently completed a new book entitled Continuum -The Star Wars Phenomenon As Experienced From The Inside, in which he recounts being in one of the biggest-grossing movies of all time."}, {"tag": "h2", "text": "External links"}]}