{"url": "Tinian_I%27att_Azur-Jamin", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:Druckenwell residents", "Category:Females", "Category:Humans", "Category:Impersonators", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Tinian I'att Azur-Jamin"}, {"tag": "p", "text": "Tinian I'att Azur-Jamin was a Human female who was the heiress of I'att Armament until she later became a bounty hunter during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the industrial planet of Druckenwell, Tinian I'att was the heiress of I'att Armament, and was in love with Force-sensitive Daye Azur-Jamin, a Second Undersupervisor at the company. Her grandparents, Strephan and Augusta I'att, as well as her protector, the Wookiee Wrrlevgebev were killed by Imperials following a demonstration of the newly-developed armor-protective field for Moff Eisen Kerioth. Daye helped her escape, but the two were separated and she believed that he was killed. From that point on, she pledged her life to bringing down the Empire and was willing to risk her life, believing that when she died she would be reunited with Daye once more."}, {"tag": "h3", "text": "Bounty hunter"}, {"tag": "p", "text": "After escaping Druckenwell, she was picked up by Chenlambec, a Wookiee bounty hunter, and the two became friends. She was appointed his Hunt-apprentice. Though small and not physically strong, Tinian's life at I'att Armaments meant that she was very knowledgeable about various forms of weaponry, explosives, and armor. She was also fluent in Shyriiwook and served as Chenlambec's translator. She stayed with him for three years before the events surrounding Bossk and Lomabu III, becoming a skilled resistance fighter and Hunter herself."}, {"tag": "p", "text": "Shortly after the Battle of Hoth, the two made a plan to capture Bossk, a Trandoshan bounty hunter, for desperately needed credits, and at the same time save a slave colony of Wookiees on Lomabu III from Imperials. Tinian's life at her family's armament factory saved both her and Chenlambec, when she was able to sniff out foreign explosives aboard the ship she was using to save the Wookiee colony. She and Chenlambec managed to capture Bossk and were awarded roughly 37,000 credits. They also took the Hound's Tooth, Bossk's ship, though sometime thereafter, Bossk managed to escape from his captivity and steal the Hound's Tooth back from the two of them."}, {"tag": "h3", "text": "Reunion"}, {"tag": "p", "text": "After the Battle of Endor, Tinian was reunited with Daye. They married and had a son, Tam. During the Yuuzhan Vong War, Tinian helped the Jedi scout out incoming Yuuzhan Vong forces, working with Daye and the Wookiee Lowbacca in Hutt Space. Shortly after the Battle of Fondor, the invaders thrust towards Nal Hutta and Nar Shaddaa, and Daye was captured on Nal Hutta. Although Tinian and Lowie escaped successfully back into the New Republic, Daye was only eventually rescued after the end of the conflict."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kathy Tyers based Tinian on Lady Firebird, protagonist of her first novel, Firebird. The character's name, \"Tinian,\" comes from Tine éan, Gaelic for \"fire\" and \"bird,\" respectively. Both Tinian and Lady Firebird were named after Igor Stravinsky's Firebird Suite."}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia is the first source to explicitly state that she took Azur-Jamin's last name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}