{"url": "Timira_City", "categories": ["Category:Legends articles", "Category:Cities on Kamino", "Category:Cloning facilities", "Category:Galactic Empire cities", "Category:Galactic Republic cities"], "nodes": [{"tag": "h1", "text": "Timira City"}, {"tag": "p", "text": "Timira City was a Kaminoan city located on the planet Kamino. Like Tipoca City, Kamino's planetary capital, Timira City was the site of a major cloning facility that produced the Galactic Empire's stormtrooper clones. Shortly after the onset of the Galactic Civil War, Timira City became the secret location of a clandestine project initiated by the Sith Lord Darth Vader. With the death of Galen Marek, Vader's former secret apprentice, the Sith Lord sought to create a new version of his fallen disciple via cloning."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Clone Wars concluded in 19 BBY with the ascension of Darth Sidious, Dark Lord of the Sith, as emperor of the Galactic Empire, the New Order swiftly proceeded to implement total Sith control over the known galaxy. Kamino, the planet responsible for the creation of the Emperor's clone army, was ironically subjugated by the native Kaminoans' own creations in the name of the Empire. By 1 BBY, almost two decades after the Declaration of a New Order, Kamino was a heavily guarded world protected by military assets such as Imperial warships and a large stormtrooper garrison. The garrison force included an Imperial battalion, filled with enlisted troopers, led by Commander Cody, a first generation clone of Jango Fett and a veteran of the Clone Wars. On a lesser note, the stormtroopers who guarded Timira City regarded it as a miserable assignment, which ultimately had a negative impact on the troop morale."}, {"tag": "p", "text": "Due to the planet's importance, Kamino's cloning facilities, the Empire's most valuable possessions on the ocean-covered world, was naturally subjected to a heavy presence of Imperial scientists and troopers; Timira City was no exception. Although the Empire vastly expanded its cloning program beyond Kamino, the original source of the clone army, Kamino still retained much of its importance as a clandestine site for the Imperial cloning operation, which thus earned the planet its sizable military garrison. Clones were still produced en mass to serve as soldiers, but no longer as the defenders of the Old Republic. Instead, they were grown and programmed to become the faceless enforcers of the Galactic Empire. In Timira City, Imperial scientists endeavored to improve the Kaminoan method of cloning, and eventually created the highly experimental \"accelerated cloning process.\" With this new procedure, the growth rate of clone subjects was immensely hastened to the point where they could reach adulthood in a mere few weeks. However, the accelerated cloning process was wrought with imperfections, and was thus responsible for the creation of extremely unstable clones, none of which were able to survive for very long."}, {"tag": "p", "text": "The known genetic source material for the accelerated clones came from two subjects: Boba Fett and Galen Marek. The side-effects caused by the flaws in the accelerated cloning process notwithstanding, the selection of Fett and Marek as templates also contributed to the creation of failed experiments. The fact that Boba Fett was not conceived by natural process, but was rather himself a clone, undermined the process; clones bred from a clone source were exposed to even greater risks of genetic anomalies. As for Galen Marek, the fact that his blood was Force-sensitive made it almost impossible for a stable clone to be created from his genetic material. Although the exact nature of the instability was unclear, it was believed that the Force was responsible, and thus a Force-sensitive had never been successfully cloned in the past."}, {"tag": "p", "text": "Hence, Timira City was the location of entire stocks of psychologically deranged Fett clones and aberrant freaks bred from the Marek template. The individual responsible for the inclusion of Marek's DNA as a genetic source material was none other than the Sith Lord Darth Vader, Marek's former master. Through painstaking efforts, Vader endeavored to create the ultimate apprentice and assassin: a new version of Galen Marek; a clone who possessed all of the original apprentice's strengths, but none of his weaknesses. Over the course of six months, Vader occasionally visited Timira City in order to personally oversee the progress of his secret experiment, only to be disappointed by a variety of imperfect clones. In spite of a laboriously slow rate of improvement, each clone was psychologically flawed in one way or another, mostly due to the emotional attachments that they inherited from Vader's deceased apprentice. As a result, the clones were eventually driven into a state of madness, and thus none of them were deemed suitable to replace Marek at Vader's side."}, {"tag": "p", "text": "Eventually, however, one clone in particular had proven stable enough for Darth Vader to hope that the project would finally become a success. But like the others who came before, the clone was unable to resist the controlling influence of his progenitor's memories, the imprints used to train the clone. After developing an obsession with Juno Eclipse, the female Human whom Galen Marek fell in love with prior to his death, the clone escaped from his creator's custody and embarked on a single-minded quest to find Eclipse. But despite the loss of a wayward clone, Vader was greatly pleased by the ultimate outcome of another clone subject. Unlike all of his precursors who preceded him, this clone successfully compartmentalized all of Marek's memories, which enabled him to distinguish himself as a unique individual, separate from the person whom Galen Marek had been. The clone came to hate his genetic donor so much to the point where he was immensely proud of rising above the weaknesses that destroyed Marek. As a sign of his approval, and in order to prove that Marek was truly dead, Darth Vader revealed the preserved corpse of Galen Marek to the clone that he regarded as his new apprentice. Marek's body, hidden in a secret location within Timira City, confirmed what the clone already knew to be true: that he was indeed a clone and the real Galen Marek perished during his final stand against the Sith."}, {"tag": "p", "text": "Not long after Darth Vader finally deemed the project a success, Kamino was suddenly besieged by the entire rebel fleet. By this time, Boba Fett returned to Kamino with Juno Eclipse as a hostage, in accordance with instructions from Vader. Due to Eclipse's presence on Timira City, Vader anticipated the arrival of the rebels, followed by the renegade clone who became known as \"Starkiller\", Galen Marek's Sith codename. Vader was confident that his Imperial forces were more than capable of defeating the fledgling Alliance in battle, but nevertheless he prepared for the inevitable confrontation with Marek's clone. In order to guarantee his own survival, however, he ordered his Dark Apprentice to remain hidden and to avoid intervening unless absolutely necessary; Boba Fett was also retained as a contingency asset in case Starkiller came too close to killing Vader."}, {"tag": "p", "text": "Vader's plan, however, apparently backfired. With the aid of Starkiller and the leadership of Jedi General Rahm Kota, the Rebel forces breached Kamino's naval defenses and stormed Timira City itself. The Rebel soldiers ultimately subdued the Imperial garrison, though not without sustaining severe casualties to their own numbers. Meanwhile, Starkiller fought and ultimately overpowered Vader in a lightsaber duel. Though he was tempted to kill his creator, Starkiller reluctantly relented and allowed Kota to arrest the defeated Sith Lord; neither Boba Fett or the Dark Apprentice intervened. Hence, the Assault on Kamino was secured as the Alliance's first major victory against the Empire in the Galactic Civil War."}, {"tag": "p", "text": "As the Rebels evacuated Kamino with their valuable hostage, they crashed the massive wreckage of Star Destroyers into the ocean, intending to destroy all of Timira City and its cloning technology with the resulting tsunami, which was successful. Unknown to the Rebels, and even Starkiller, Boba Fett secretly pursued them in Slave I as they moved to transfer Darth Vader to the secret Rebel base on Dantooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}