{"url": "Tion_Medon/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic bureaucrats", "Category:Males", "Category:Pau'ans"], "nodes": [{"tag": "h1", "text": "Tion Medon"}, {"tag": "p", "text": "Tion Medon was a male Pau'an and the Master of Port Administration of Utapau. A gaunt, gray-skinned humanoid, Tion Medon wore elaborate red robes and carried an ornate staff of office. He assisted Obi-Wan Kenobi during the late Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of the tall, thin Pau'an species, Tion Medon had an unsettling appearance to some, with glassy, sunken black eyes and a mouth of crooked teeth. However, appearances were deceptive, as Tion Medon was an accommodating, helpful being. As Port Administrator of his sinkhole sanctuary of Pau City, Tion welcomed guests, offering them his services."}, {"tag": "p", "text": "Longevity came naturally to the Pau'ans, and Tion Medon had been Master of Port Administration for Pau City for more than 200-standard years by the time of the Clone Wars. Tion was a descendant of Timon Medon, who was credited with unifying Utapau. Like all Pau'ans, Tion preferred darkness to sunlight, and raw meat to cooked."}, {"tag": "p", "text": "In the final weeks of the Clone Wars, Tion Medon was forced to accommodate General Grievous and his associates in his sanctuary. Grievous threatened to destroy Medon's city if he did not assist, or if he were to bring in aid from the Galactic Republic. Medon had no choice but to allow the Separatists to use his sanctuary as their base of operations."}, {"tag": "p", "text": "Fortunately for the Administrator, help arrived of its own accord, in the form of Jedi Master Obi-Wan Kenobi. Despite General Grievous's threats, Tion Medon welcomed Kenobi to the spaceport, and discreetly divulged helpful information pertaining to the Separatist presence on Utapau. Kenobi, sent by the Jedi Council to track down General Grievous, was able to seek and destroy the Separatist Supreme Commander with Tion Medon's help."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tion Medon was played by Bruce Spence."}, {"tag": "p", "text": "Initially, it was undecided how Medon was to be realized on the screen -- whether a practical makeup effect or a computer-generated character. In the end, the Utapauns were created using both methods, but Medon was designed to be a flesh-and-blood performer wearing makeup."}, {"tag": "p", "text": "Medon had an additional scene in the script, in which an IG-100 MagnaGuard questions him about the presence of Obi-Wan Kenobi. This scene was ultimately left out of the final cut, but Medon's line, \"He didn't say,\" originally a response to the droid, is directed at Lampay Fay in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}