{"url": "Tion_Hegemony/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:New Republic sectors", "Category:Outer Rim Territories sectors", "Category:Tion Cluster", "Category:Tion Hegemony"], "nodes": [{"tag": "h1", "text": "Tion Hegemony"}, {"tag": "p", "text": "The Ancient & Honorable Union of the Tion Hegemony, also called the Caluula sector, was a sector in the Tion Cluster, on the edge of one of the galaxy's spiral arms. It contained a total of twenty-seven star systems."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The Tion Hegemony of the Imperial Period was divided into two quite different regions: the first region was a cluster of ancient, averagely-wealthy systems at the head of the Desevran Trace, linking the Hegemony to the Perlemian Trade Route. This region was known as the Livien Worlds for their connection to the Xim-era Livien League, and included Folende, Livien itself, and the sector capital of Desevro."}, {"tag": "p", "text": "The second region was the Back Spiral, a string of systems beyond the Indrexu Spiral nebula along the Tion Trade Route. These worlds were mostly poor and had little to do economically or culturally with the Livien Worlds. The Livien Worlds even lacked a hyperlane connecting them to the Back Spiral in their sector."}, {"tag": "p", "text": "The entire sector contained 175 inhabited planets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Tion Hegemony had been the heart of the Kingdom of Cron and Xim's empire tens of thousands of years before the Battle of Yavin. The capital planets of Xim's empire were Argai, Xim's homeworld, and Desevro, former capital of the Livien League."}, {"tag": "p", "text": "Once the heart of a proud pre-Republic civilization during the Expansionist Era, the Hegemony had become a poorly administered backwater in the time of the Galactic Empire's rise. The Hegemony was dominated by the noble House of Tion. The sector was near Republic planets such as Falang Minor, Ossus, Haashimut, Rhen Var, and Sembla."}, {"tag": "p", "text": "During the Cold War, an outbreak of the Rakghoul plague spread across several worlds in the Tion Hegemony, including the planet Kaon. The infection killed large numbers of civilians and transformed many people into rakghouls, which caused the Tion Hegemony to descend into chaos. Around that same time, an individual was sent to look for valuable artifacts on Orma and discovered a relic from the height of the Tion Hegemony."}, {"tag": "p", "text": "The Hegemony was the scene of numerous battles during the Clone Wars, when it was dominated by the Separatists. In fact, the Separatist cause could be said to have originated in the Tion Hegemony, as Dooku's first headquarters was on the grim planet of Raxus Prime."}, {"tag": "p", "text": "In retaliation for the Cluster's Separatist allegiance, the Galactic Empire divided the area into new sectors after the war, carving the Allied Tion, the Indrexu and the Keldrath sectors out of a shrunken Tion Hegemony. The Tion Hegemony was allowed a nominal independence, which was seen as humiliating."}, {"tag": "p", "text": "During the Galactic Empire, the Hegemony was generally left to its own devices, until a heavy Rebel presence was discovered shortly after the Battle of Turkana took place and Operation Strike Fear raided some of its systems. In 2 BBY the long lost treasure hoards of Xim were discovered on the planet Dellalt."}, {"tag": "p", "text": "The Hegemony joined the New Republic shortly prior 24 ABY and was represented in the New Republic Senate by Thuv Shinev."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A galaxy map depicting the various destinations of the Star Tours travel agency is seen in the queue of the Star Tours attraction at Disneyland Paris and Tokyo Disneyland. The map erroneously suggests Dagobah is in the Tion Hegemony, which is contradicted by many Legends sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}