{"url": "Battle_of_Scrim_Island", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Battle of Scrim Island"}, {"tag": "p", "text": "A battle was fought on Scrim Island during the Batonn insurgency, a sub-conflict of the larger Batonn sector insurgency. After the Batonn insurgents captured the Imperial garrison on Scrim Island in the planet Batonn, Fleet Admiral Jok Donassius dispatched Admiral Durril to take back the island. However, Donassius underestimated the ingenious tactics of the Batonn rebels and his One Oh Third Task Force sustained considerable damage. Admiral Thrawn and Commander Eli Vanto infiltrated Batonn and obtained intelligence on the Scrim Island insurgents' tactics and their leader Nevil Cygni. Using this information, Thrawn's Ninety-Sixth Task Force neutralized the insurgents' defenses and forced their surrender."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Imperial Era, the Outer Rim world of Batonn hosted an Imperial garrison on Scrim Island, which lay 300 kilometers west of Batonn's main continent. Batonn was also home to several mines including the Creekpath Mining and Refining complex near Paeragosto City on the main continent. Prior to 2 BBY, dissatisfaction with the rule of the Imperial Governor Restos led to the emergence of a planetary insurgent movement, led by Nevil Cygni. Using his pseudonym \"Nightswan\", Nevil had harried Imperial shipments of tibanna gas, iridium and doonium metals, and Wookiee slaves."}, {"tag": "p", "text": "Nightswan found his nemesis in the form of the Imperial Navy's Chiss rising star Admiral Thrawn. After being frustrated by Thrawn on numerous occasions, Nightswan engineered the Battle of Scrim Island in a final attempt to destroy the skilled tactician, whom he regarded as a threat to his plot to bring down the Empire. The Batonn insurgents overran and seized control of the Imperial garrison on Scrim Island. They captured a hundred hostages including Imperial Navy troopers, technicians, and some civilian workers. They also seized control of the island's deflector shield, shoreline defenses, and three of its ion cannons. The insurgents also obtained a turbolaser cannon."}, {"tag": "p", "text": "Five days later, Fleet Admiral Jok Donassius convened a meeting of the Imperial admirals and governors in the Batonn sector. After briefing them about the situation on Scrim Island, he gave Thrawn command of the mission. When Thrawn insisted on studying the situation on Scrim Island in further detail, Donassius ordered that the island be captured or destroyed in order to protect the Empire's reputation. Thrawn disagreed and the Scrim Island operation was instead assigned to Admiral Durril of the One Oh Third Task Force. Thrawn's Ninety-Sixth Task Force was instead dispatched to pacify the Sammun insurgents."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "First assault"}, {"tag": "p", "text": "Durril commanded the 103rd Task Force's assault on Batonn from the Imperial Star Destroyer Judicator. The Judicator and its escort Imperial light cruisers and frigates bombarded Scrim Island but were unable to pierce through the deflector shield. Since Durrill had exposed his forces' capabilities, the insurgent commander on Scrim island ordered the ion cannons on the western and southern shorelines to bombard the Judicator. With the Judicator damaged, Durril ordered his escort ships to bombard the western and southern ion cannons but the insurgents expanded their shield."}, {"tag": "p", "text": "As the escort ships continued firing in vain, the ion cannon on the northern shoreline struck the frigate and cruisers on the Judicator's portside flank, damaging their sensors and turbolaser targeting and control systems. Instead of adjusting to his opponents' tactics, Durril continued his ineffective attacks. While the northern ion cannon bombarded the escort ships, eight small freighters took off from the eastern edge of the shield and headed to the main continent. Seven freighters flew under low cover to avoid detection while the eighth rose into space. While Durril's task force was immobilized by ion damage, a turbolaser cannon to the north of the western ion cannon fired a barrage which struck the Judicator's starboard superstructure."}, {"tag": "p", "text": "The Judicator was struck by three turbolaser salvos. The four undamaged starboard escort ships fired at the weapon but their shots dissipated when the insurgent commander closed the shields again. The insurgent commander then retracted the shields over the eastern shorelines to bait the Imperials. While the Imperial ships redirected their fire towards the eastern shorelines, the western ion cannon struck the ships, immobilizing them. With the escort ships immobilized, the Scrim island insurgent commander then bombarded the turbolaser cannon at the Judicator, damaging its hull and weapons. The ion cannons then fired at the weakened escort ships, preventing them from assisting the Judicator."}, {"tag": "p", "text": "Unknown to Durril or the Batonn insurgents, the space battle was being watched by Thrawn and Commander Eli Vanto. Taking advantage in a loophole in Donassius' orders, Thrawn dispatched Commander Karyn Faro and the Ninety-Sixth Task Force to deal with the Sammun insurgents. He and Vanto then used the captured smuggler freighter Slipknot to approach Batonn and monitor the battle. Posing as a weapons smuggler, Vanto managed to secure coordinates to meet with the insurgent leader on Batonn. Thrawn also transmitted a distress signal on behalf of the 103rd Task Force. Thrawn also secretly detached Captain Brento's light cruiser Shyrack from the Ninety-Sixth and used the ship to monitor the seven freighters' movements."}, {"tag": "h3", "text": "Studying Nightswan"}, {"tag": "p", "text": "Eli and Thrawn flew the Slipknot to the coordinates where the freighter was waiting. Posing as the smuggler \"Horatio Figg\", Vanto followed the freighter to a Nomad starship, a traveling ship–repair shop that was common during the Clone Wars. At Thrawn's instruction, Vanto donned an oversized Imperial officer's tunic to create the impression that he was a toughened gun dealer who had murdered an Imperial officer and stolen his uniform. Thrawn also outfitted Vanto with a hold-out blaster that was designed to explode when Vanto activated the title closest to the center of his chest. Thrawn remained aboard the Slipknot to engineer their escape."}, {"tag": "p", "text": "Upon disembarking, Vanto was searched by three armed insurgents who confiscated his hold-out blaster, which played into Thrawn's plan. The insurgents brought him to their leader who identified himself as Nightswan. Nightswan recognized Vanto and told the Imperial officer that he knew that Thrawn had sent him. Nightswan claimed that the Empire was corrupt, dangerous, and ultimately self-defeating and that he was helping to bring its downfall. When Vanto disagreed, Nightswan replied that the Empire had no other officers with Thrawn's caliber and added that he had engineered the Battle of Scrim Island in order to bring about Thrawn's political demise."}, {"tag": "p", "text": "Realizing that Nightswan did not know that Thrawn was not commanding the 103rd Task Force, Vanto flattered his captor. Nightswan revealed that one of his contacts in the Thrugii asteroid belt had seen Thrawn with the Jedi General Anakin Skywalker during the Clone Wars. Meanwhile, Thrawn started a radiation leak in the Slipknot's engine compartment. Believing it to be a typical Imperial ruse, Nightwan ordered his men to override the ship's controls. Nightswan then questioned Eli about Thrawn's interest in his capabilities as a commander."}, {"tag": "p", "text": "Before they could continue, the Slipknot exploded. Thrawn had in fact engineered the radiation leak to create a distraction that would allow the two of them to escape. He then ejected himself out of the ship's escape pod. Realizing this was Thrawn's signal, Eli used his fake insignia plaque to detonate his hold-out blaster. Eli then fought his way back to the hangar and escaped with Thrawn aboard one of the insurgents' freighters. Upon returning to the space around Batonn, Thrawn and Vanto found that Bento had evacuated the battered 103rd Task Force including the damaged Judicator."}, {"tag": "p", "text": "After returning to Thrawn's Imperial Star Destroyer Chimaera, Thrawn attended a hologram conference with Donassius and the other commanders. Despite the failure of Durril, Admiral Kinshara and Commander Faro had succeeded in pacifying the insurgents on Denash and Sammun. Donassius ordered the humiliated Durril to bring the 103rd Task Force to the Marleyvane shipyards for repairs. After learning that Thrawn had gathered intelligence on the Batonn insurgents, Donassius assigned Thrawn the task of taking back Scrim Island."}, {"tag": "h3", "text": "Second assault"}, {"tag": "p", "text": "Thrawn commanded the Galactic Empire's second assault on Scrim Island. Thrawn commanded the Ninety-Sixth Task Force, which consisted of the Chimaera and three light cruisers Shyrack, Flensor, and Tumnor, and two frigates. Based on the intelligence he had gathered during their undercover mission, Thrawn devised a strategy to break the siege of Scrim Island. To trick the insurgents into underestimating his forces, Thrawn ordered the three light cruisers to descend into Batonn's atmosphere and bombard Scrim Island. While the ships exchanged fire with three ion cannons, their sensors and weapons were disabled by a fourth cannon."}, {"tag": "p", "text": "Though the three cruisers had lost their primary weapons and main drives, their communications, secondary weapons, and auxiliary drives still remained intact. Thrawn ordered the light cruisers to activate their auxiliary drives and shift positions. With the insurgents' fourth cannon breaking down, the Chimaera moved behind the three partially disabled cruisers and shifted closer to the surface. This new position prevented the insurgent commander from firing his ion cannons at the Imperial ships but the Chimaera was still unable to fire its turbolaser at the ion cannons. As the Imperial ships descended towards the surface, Thrawn ordered the Chimaera's turbolaser crew to bombard the waters around Scrim Island, generating tsunamis that overwhelmed the insurgents' ion cannons and turbolaser emplacement."}, {"tag": "p", "text": "The frigates relayed reports of the tsunami waves to Thrawn. Thrawn then ordered the insurgents to lower their shields and surrender. The Scrim Island commander accepted Thrawn's terms and lowered the shields. He and his men also complied with Thrawn's orders to leave their weapons in the building and await the arrival of assault boats. The Imperial hostages on Scrim Island were presumably liberated. Thrawn also ordered Commander Faro to tractor the three light cruisers back into space so that they could initiate repairs. Vanto also reported the pacification of the Scrim Island insurgents to the galactic capital Coruscant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "While the Battle for Scrim Island was over, Thrawn warned that the \"war for Batonn\" had not yet been won. Thrawn's prediction was proven right. In fact, Nightswan had engineered the events on Scrim Island in order to distract the Empire while he regathered his forces and weaponry at the Creekpath Mining and Refining complex, which was protected by a deflector shield. While Nightswan had expected the Empire to withdraw, Vanto had managed to trace the freighters' shipping vectors to the Creekpath facility. As a result, Imperial forces and the allied Batonn Defense Force blockaded the complex, leading to the events of the Siege of the Creekpath Mining and Refining complex."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}