{"url": "Tipoca_City/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Capital cities", "Category:Cities on Kamino", "Category:Galactic Empire cities", "Category:Galactic Republic cities", "Category:Tipoca City locations"], "nodes": [{"tag": "h1", "text": "Tipoca City"}, {"tag": "p", "text": "Tipoca City was the capital city of Kamino and the site of a major cloning facility. It was also where the bounty hunter Jango Fett, the template for the clone army, lived for a time. Jango's clone \"son\" Boba Fett lived here with him."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kamino's capital, Tipoca City, consisted of a network of stilt structures that spanned more than a hundred kilometers along Kamino's western equator and was considered by many to be the heart of Kaminoan society. The millions of Kaminoans who occupied Tipoca worked either with the cloning program or with the bureaucracy. No Kaminoans took residence within the city, nor was there any public space. Nearly all Kaminoans who worked within the city lived in numerous satellite cities situated around the capital. Constant traffic ran to and from Tipoca, as workers, bureaucrats, and many others traveled to and from their homes. The only living space in the city was the quarters of the prime minister and the military staff, and a group of apartments for cloning scientists. The scientists resided in Tipoca in alternating shifts of three months each before returning to their homes and families."}, {"tag": "p", "text": "Aside from the governmental and clone manufacturing functions, Tipoca City also served as the seat of both the Kamino Space Traffic Control and the Kamino Planetary Defense Forces. Most of the Space Control's data came from the huge communication towers that dominated much of the city's skyline. Largely due to the cloning facilities importance to Kamino, the Planetary Defense Forces were coordinated from Tipoca. The city relied on passive measures (in form of energy shielding) and more \"pro-active\" turbolaser emplacements. Because the defensive shields provided little protection against troop invasions, the KPD also retained thousands of Kaminoan soldiers in the barracks."}, {"tag": "p", "text": "Tipoca City's architecture was influenced by two primary architectural styles originating from Alderaan and Kashyyyk. The concept for the city being built on stilts was derived from the Alderaanian Oversea style. Middle-period Krorral, previously used by the Wookiee Gkrur clan on Kashyyyk and colonies of the moons of Alaris was adopted in the form of the sweeping and centralized dome structures. An additional appeal of the Krorral element was that the rain-sloughing nature of the architecture bore numerous similarities to the first Kaminoan land colonies. Most all of these buildings where accented by high power lightning rods, dotting most platforms, even minor ones. If a rod was damaged, however, and lightning struck the rod, a fundamental design flaw would prompt the lightning rod, and usually the whole platform it stood on, to explode."}, {"tag": "p", "text": "Places in Tipoca City included Cargo Platform C-22, Security Sector Six, the Central Armory, and Level Nine."}, {"tag": "p", "text": "The clone military education complex was where the Galactic Republic's Grand Army was trained."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The city was established after Kamino's climate changed and the entire planet flooded. During the First Battle of Kamino, Tipoca City was the prime target of the Separatist forces intent on destroying the Republic Army. The city escaped disaster, but was later damaged in another battle of the Clone Wars, as well as a clone rebellion during the Imperial Period. Due to the declining Kaminoan economy, it remained a run-down shadow of its former elegance.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tipoca City first appeared with the release of Star Wars: Episode II Attack of the Clones and its tie-ins."}, {"tag": "p", "text": "The designs of Tipoca City draw inspiration from numerous sources, including massive offshore oil derricks and the retro curved science fiction cities of pulp magazines. For the city's interior, the designers crafted a clean, ultramodern and antiseptic environment of shimmering white, recalling the stark color palette of George Lucas' first feature film, THX-1138. Very little of Tipoca City was actually built full-scale. Jango Fett's apartment module and the landing platform were realized as sets, but most of the tour of the clone facility was realized through the use of miniatures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canonical appearance"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}