{"url": "Tionese_War", "categories": ["Category:Legends articles", "Category:Battles of the Tionese War", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Tionese War"}, {"tag": "p", "text": "The Tionese War was a war fought between the young Galactic Republic and the Honorable Union of Desevro & Tion from 24,000 until around 23,900 BBY. The Tion Cluster had become a largely-disunited backwater in the thousand years that had followed the defeat of Xim's empire, and the Cluster's leaders saw a rapid conquest of the Republic and the acquisition of its technology as their salvation. The Union attacked the Republic without warning, and the Republic was initially unprepared for the Tionese invasion and suffered multiple defeats. However, its superior industrial might and the aid of the Jedi Order allowed it to eventually subjugate Tionese space after a century-long conflict."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "In the thousand years that had followed Xim the Despot's downfall in the final battle of his wars with the Hutt Empire, his empire had fragmented into a multitude of warring kingdoms. Living under the ever-present menace of the Hutts, the Tionese civilization had suffered technological and cultural stagnation. They had additionally experienced a devastating Hutt invasion of their colonies in the Kiirium Reaches when the Hutts had attempted to pre-empt a Tionese alliance with the growing Republic. This conflict, known as the Devouring, rendered the Kiirium Reaches uninhabitable and transformed them into a desolate stretch of space that became known as the Ash Worlds."}, {"tag": "p", "text": "In 25,000 BBY, a number of Core Worlds unified to create the Galactic Republic. Republic scouts moving rimward up the Perlemian Trade Route soon encountered Tionese ships. Following the first contacts between Republic traders and Tionese aristocrats, the Tionese learned of both the Republic's superior technology and its lack of a powerful military. The rulers of Desevro saw the Republic as a wealthy but weak target ripe for conquest, and persuaded the rest of the Tionese states to form a loose confederation with the goal of conquering the Republic."}, {"tag": "p", "text": "The Republic ignored warnings from the Jedi Order (then based on Ossus) about the build-up of Tionese war-fleets that utilized reverse-engineered Republican technology, and so the Republic was caught completely unaware when the Tionese launched their offensive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The initial Tionese assault down the Perlemian Trade Route met little resistance. The Tionese seized Abhean, Roche, Lantillies, and Tirahnn before the Republic mounted a serious effort to construct its own warfleet. Tionese raiders destroyed the shipyards of Axum and Perlemia with a new weapon - pressure bombs - before unleashing pressure bombs upon Alsakan and Coruscant itself."}, {"tag": "p", "text": "After a last-ditch counterattack repelled the Tionese offensive, new Republican warships were launched from shipyards at Corellia, Rendili and Humbarine. Nearly a century of offensives and counteroffensives up and down the Perlemian followed. Republic agents managed to steer the Hutts into attacking the Tionese border, and eventually the Jedi joined the war, leading Republic forces in the hope of saving galactic civilization from sinking into barbarism."}, {"tag": "p", "text": "With the Republic's overwhelming industrial might fully committed to the struggle, defeat for the Tion was only a matter of time. Believing that their culture would be annihilated, the Tionese resorted to sneak and suicide attacks, devastating even isolated colony worlds in the Divide. One such attack on Okator VIII in the final months of the war left only one survivor."}, {"tag": "p", "text": "These tactics served only to enrage the Republic, whose leaders embraced a doctrine of total war. Key Tionese worlds were pounded with pressure bombs, and eventually Desevro itself faced destruction under the guns of the Republic Navy. Desevro's attempt at unconditional surrender was ignored. The Republic's leaders were committed to making an example of the planet in order to intimidate the rest of the Tion into surrendering, and Desevro was blasted into a wasteland."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The war with the Republic was the Tion's swansong as a galactic power. The worlds of the now-defunct Union, (with the exception of Desevro, which remained bitterly and proudly independent), joined the Republic by approximately 23,900 BBY as a member sector with Tion as its capital. In just a few centuries, the Tion became simply another sector of the Republic."}, {"tag": "p", "text": "Horrified by the sterilization of Desevro, the Jedi subsequently broke with the Republic, although the Order agreed to defend the Republic's frontier from their bases near the Tion, watching the cluster from fortress worlds like Falang Minor."}, {"tag": "p", "text": "Though the Republic was triumphant, its military's fanatical conduct of the war led the Core regions to regard a centralized military as a threat to the Republic's stability. Despite objections from both the Jedi and many Rimward systems, the standing military was downsized; the bulk of the Republic's military forces were reassigned to local sector governments, a centralized federal navy would not be re-established until 15,000 BBY."}, {"tag": "h2", "text": "Known battles"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}