{"url": "Battle_of_Sepan_8", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles of the Sepan campaign"], "nodes": [{"tag": "h1", "text": "Battle of Sepan 8"}, {"tag": "p", "text": "The Battle of Sepan 8 was a battle during Admiral Harkov's campaign to end the Sepan Civil War. After learning that the Dimok and Ripoblus were meeting to negotiate an alliance against the Galactic Empire, Harkov led his forces in an attempt to capture the leaders of both sides."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Up until this point, the Dimok and the Ripoblus had been fighting a 40-year civil war with each other across the Sepan System. When the Galactic Empire deployed Admiral Harkov to forcefully end the war in an attempt to restore order in the system, the Dimok and Ripoblus set aside their differences and agreed to form an alliance with each other in an attempt to drive away the Imperial force. They agreed to meet above Sepan 8 in Lambda-class T-4a shuttles. This possible alliance worried the Imperials, so Harkov was sent to capture the leaders in order to prevent the alliance and in order to blackmail the two factions into ending the war without further objection."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Harkov sent four Alpha-class Xg-1 Star Wings from Nu Squadron to intercept the Dimok and Ripoblus fleets meeting above Sepan 8. Maarek Stele flew as Nu 2. Their mission was to disable shuttles Keydon and Phantele before the meeting could commence. The Imperials first cleared out the Ripoblus Delta-class JV-7 escort shuttles and Dimok Z-95 Headhunters who were patrolling the area. Once this was done, the Imperials attacked the two shuttles and disabled them. Two Imperial Delta-class DX-9 stormtrooper transports from Omega Squadron then hypered into the area to capture the leaders. Gunboats from Tau Squadron arrived to escort the transports."}, {"tag": "p", "text": "Desperate to prevent the capture, the Dimok deployed more squadrons of Z-95s from the Nebulon-B2 frigate Manus Ferre to destroy Omega Squadron. The Ripoblus sent in more squadrons of escort shuttles as backup. The Dimok called in various capital ships, including the Light Calamari Cruiser Falaricae to provide additional support. Despite fierce resistance from both factions, Stele and his wingmen decimated the enemy squadrons and Omega Group was able to extract all of the prisoners. The shuttles Keydon and Phantele were then destroyed. Stele held off the enemy forces while the transports made off with their prizes. Before leaving, he inspected two Dimok cargo ferries, Glaive and Godendag, escorted by CR92a Assassin-class corvette Runka that were confirmed to have been carrying Imperial arms. He then destroyed the ferries to prevent them being used in the war."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite the success of the attack, the prisoners that the Imperials had captured were not in fact the leaders of the Ripoblus and the Dimok, but the children of the respective leaders. They were to be exchanged as hostages in order to keep the opposite factions in line as part of a new treaty. This treaty was made to make both sides set aside their differences and join forces to resist against the Imperials. The children were held by the Imperials but may or may not have been sent home following the war's end. The alliance was short-lived as the Imperials broke the system's will to resist after a series of bloody skirmishes left the Ripoblus and Dimok militaries effectively defeated."}, {"tag": "p", "text": "Stele's discovery of more Imperial arms among the two factions further added to fears that an Imperial traitor was selling arms to various groups for personal profit. The Imperials were determined to discover who this traitor was, but it was not until after his betrayal that Admiral Harkov revealed his disloyalty to the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The conflict is described in the game Star Wars: TIE Fighter. It is Battle 2 Mission 4 in the game. The player takes the role of Maarek Stele who is assigned as one of the Gunboats in Nu Squadron. The player has the option of inspecting the Cargo ferries and modified corvette as part of the secondary objectives. The bonus objectives, which are hidden from the player are to inspect the capital ships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}