{"url": "Tipoca_City", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Capital cities", "Category:Cities on Kamino", "Category:Galactic Republic cities", "Category:Tipoca City locations"], "nodes": [{"tag": "h1", "text": "Tipoca City"}, {"tag": "p", "text": "Tipoca City was the capital city of the watery planet Kamino, and home to several million Kaminoans. The city was a network of stilt structures built over 150 kilometers at Kamino's equator. It served as a major military base for the Grand Army of the Republic during the Clone Wars, and was the location of the Kaminoan cloning facilities that created the army prior to the war."}, {"tag": "p", "text": "The city was also the main fighting ground during the Battle of Kamino, which saw the Republic's enemy, the Confederacy of Independent Systems, launch an assault on the city to cripple the Republic's production of clone troopers. At the time of the Clone Wars, Prime Minister Lama Su controlled Kamino from the city. Early on into the Galactic Empire's reign, Kamino's cloning facilities, including those at Tipoca City, were shut down."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "The capital city of Kamino, Tipoca City, was a network of stilt structures that held the city above the massive ocean covering the world. The city was distributed over one hundred and fifty kilometers near Kamino's equator. At the core of one of its larger domes, Tipoca City held an immense fusion generator in its heart, powering the city by extracting hydrogen from seawater. The generator was secured by insulator plating. A network of power processing units surrounded the generator, as well as exhaust vents. The central hub contained extensive cloning facilities and offices for members of Kamino's Ruling Council."}, {"tag": "p", "text": "Each large dome was designed with a streamlined outer shell used to shed water and wind during storms, with hatches on the sides that could be opened for maintenance or repair. Located near the top of the main dome which housed the fusion generator was a Kaminoan Planetary Defense substation, utilized by Kamino's defense network, and several static discharge towers to secure the city during electrical storms. Several turbolaser turrets were located around the top of the dome as a defense mechanism."}, {"tag": "h3", "text": "Amenities"}, {"tag": "p", "text": "Near the fusion generator were expansive troop barracks, as well as the Ha Zurh Library and Records Office, containing the city's records and a swath of information. The library was maintained by a droid librarian. At the bottom of all of the domes are support pylons which hold up the cities and supply seawater to the fusion generator and to desalination plants where salt was removed from seawater and the water was distilled and purified. At one such plant was a storage tank filled with untreated water, compressor units and tanks used for condensation or evaporation. At the tops of other domes were communications towers designed to warn Kamino Space Control of incoming spacecraft. Outside of the domes were extensive training grounds and rainwater collection ducts. Every room in the city was fitted with emergency access hatches in case they were to flood."}, {"tag": "p", "text": "Domestic apartments located inside the city were sparsely furnished, occasionally designed with furniture designed to descend from the ceiling on stalks, connecting to electromagnetic floor markings."}, {"tag": "p", "text": "The Tipoca City Military Complex was the largest portion of Tipoca City's structure, containing the Central Armory, a DNA room, the Egg Lab, an embryo room, and the Genetic Records Hall. All of these rooms contributed to the cloning facilities that Tipoca City was prized for. Weather vanes hung off the bottom of a part of the facility, designed to monitor outside conditions to provide storm warnings, or adjustments to atmosphere systems within the buildings. The facility also contained combat rooms and quarters for the clones during any stage of their training. The Military Complex also had many training rooms. One such room was the Citadel Challenge, used to train clone cadets to become clone troopers and potentially Advanced Recon Commandos."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "At some point, the entire planet of Kamino was flooded, forcing its inhabitants, the Kaminoans, to seek higher ground and eventually build entire cities on stilts using off-world materials. Kaminoans also developed intricate cloning technology to become the the galaxy's foremost expert cloners. Tipoca City became the capital and largest producer of clones."}, {"tag": "h3", "text": "Fall of the Republic"}, {"tag": "h4", "text": "Engineering a clone army"}, {"tag": "p", "text": "Approximately one decade prior to the First Battle of Geonosis, Jedi Master Sifo-Dyas secretly contacted Kamino and commissioned a clone army to be bred for the Galactic Republic, in the guise of a request from the Galactic Senate. This happened due to Sifo-Dyas' premonition that a great conflict was going to start in the near future. In secret, the fallen Jedi Count Dooku, under his given Sith name Tyranus, hired the Mandalorian Jango Fett on one of the moons of Bogden as the clone template for the Kaminoans to use."}, {"tag": "p", "text": "Fett would spend most of his time living in Tipoca City with his cloned son, Boba Fett, in their apartment located in the military complex. Fett also taught his \"son\" how to fish on one of the outside platforms in the city."}, {"tag": "h4", "text": "The arrival of Obi-Wan Kenobi"}, {"tag": "p", "text": "Over ten years later, Jedi Knight Obi-Wan Kenobi traveled to Kamino in search of the individual who killed the bounty hunter Zam Wesell, and the believed mastermind behind the plot to assassinate Senator Padmé Amidala. Kenobi's friend, the Besalisk chef Dexter Jettster, had identified a poisonous saberdart of Kaminoan origin which led Kenobi to find the world."}, {"tag": "p", "text": "Kenobi was greeted by Taun We, who took him to Prime Minister Lama Su. Kenobi was told to inform Master Sifo-Dyas that the clone army he requested was in full production, however Sifo-Dyas had been dead for almost a decade. Taun We took Kenobi to Jango Fett, the bounty hunter responsible for the assassination plot, and Zam Wesell's killer. Kenobi subtly interrogated Fett, who gave the information that he had been hired by Tyranus, however Tyranus' true identity was unknown."}, {"tag": "p", "text": "Jango and Boba attempted to escape Tipoca City, but Kenobi intercepted them and they briefly dueled. The Fetts escaped to Geonosis, with Kenobi having placed a homing beacon on the ship's hull."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "An aborted invasion"}, {"tag": "p", "text": "With the galaxy on the brink of war between the Republic and the Confederacy of Independent Systems, Grand Master Yoda traveled from Coruscant to Kamino, ultimately taking command of the battle-ready clone units in Tipoca City. During the early days of the Clone Wars, the Separatists planned to attack the cloning facilities of Kamino in an effort to hinder the Republic's war effort. However, the attack was thwarted by the efforts of several novice clones, including CT-1409 \"Echo\" and CT-5555 \"Fives,\" who were serving in an outpost on the Rishi Moon."}, {"tag": "h4", "text": "The assault on Tipoca City"}, {"tag": "p", "text": "Despite the Republic's initial success in protecting the Kaminoan cloning facilities from a direct attack, the Separatists remained committed to shutting down the production of clone troopers in Tipoca City. In 21 BBY, the Battle of Kamino commenced with a space battle between the Confederacy of Independent Systems Navy and the Galactic Republic Navy, commanded respectively General Grievous and Admiral Wullf Yularen, while Asajj Ventress infiltrated Tipoca City with the support of Trident-class assault ships."}, {"tag": "p", "text": "Jedi Generals Obi-Wan Kenobi, Anakin Skywalker, and Shaak Ti were the leading Jedi in the Republic's defense of Tipoca City. Kenobi discovered Ventress' hidden assault ships, and they attacked the city shortly after, drilling into Tipoca City's domes, allowing battle droids to enter the city. Clone Commander \"Colt\" was among the earliest casualties, dying at the hands of Ventress who had entered the city. Her objective was to retrieve a sample of clone DNA, while Grievous attacked the clone barracks."}, {"tag": "p", "text": "Despite the Separatists' coordinated efforts to overrun the Republic garrison, Tipoca City's defenses held and Ventress was unable to escape with Fett's DNA samples, which the clones recovered while during the assassin's lightsaber duel with Skywalker. Meanwhile, another duel of lightsaber combat took place between Grievous and Kenobi, and Shaak Ti led a group of troopers to defend Tipoca City's main hangar. Skywalker and Kenobi were able to force their opponents to retreat to a flight pod. The final assault ships were destroyed, and the Confederacy retreated from Tipoca City."}, {"tag": "h4", "text": "Secrets on Kamino"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, CT-5385 \"Tup\" suddenly killed one of his Jedi Generals, Tiplar, which was attributed to a premature activation of Order 66 in the inhibitor chip in Tup's brain. Unable to diagnose Tup's symptoms, clone medic CT-6116 \"Kix\" advised the Jedi to send Tup to Kamino where he could be examined by the the scientists in Tipoca City, including Doctor Nala Se who designed the clones as Kamino's Chief Medical Scientist. The ARC trooper Fives accompanied Tup on his return to Kamino, and was instructed by Shaak Ti to remain in Tipoca City while the Kaminoans ascertained the cause of Tup's actions at Ringo Vinda."}, {"tag": "p", "text": "Fives and Tup were separated while the medical droid AZI-345211896246498721347 operated on Tup. Shaak Ti, still stationed on Kamino, wished to perform an atomic brain scan on Tup. However, Nala Se wanted to terminate and perform an autopsy. Se reported to the Prime Minister, who then both secretly report to Count Dooku. They discussed the real reason Tup killed Tiplar, which was a premature activation of Clone Protocol 66. Dooku then ordered them to terminate the clone, perform an autopsy and give the inhibitor chip to him."}, {"tag": "p", "text": "Meanwhile, Fives convinced AZI-3 that his duty to save a patient overrode all orders, and so they performed an atomic brain scan on Tup, discovering a \"tumor\" which was in fact the inhibitor chip. Nala Se denounced AZI-3's claim, and referred to the chip as a virus. AZI-3 extracted the chip, Tup woke up, and only a few moments later died after declaring a mission in their dreams to be a nightmare. The chip was then ordered by Supreme Chancellor Sheev Palpatine to be sent to the Grand Republic Medical Facility for analysis. However, before this could happen, Fives and AZI-3 switched the sample out with another."}, {"tag": "h4", "text": "The plot behind Order 66"}, {"tag": "p", "text": "Fives and AZI-3 continued to sneak around Tipoca City, where AZI-3 made the discovery that the \"tumor\" in Tup's brain was not in fact a tumor, but rather an implant. Nala Se and Shaak Ti continued their hunt for the fugitives, catching them in the Genetic Records Hall; however, they escaped into a maze of emergency access tunnels. Later, there was a confrontation in the city, where Fives and AZI-3 discovered that all of the clones had the chips implanted in them. Fives revealed to Nala Se and Shaak Ti that he had the chip removed, which AZI-3 backed up by showing them the chip."}, {"tag": "p", "text": "Shaak Ti had Fives taken to Coruscant, where he could recount his story to Chancellor Palpatine. Nala Se protested, but Shaak Ti's orders stood. While on Coruscant, Fives attacked the Chancellor, who revealed his involvement in the conspiracy behind the chips, and a planet-wide manhunt for Fives took place, ending in the clone's death. Not long after his death, Order 66 was activated in the clone troopers, which resulted in the almost complete extinction of the Jedi Order."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "Following the initial execution of Order 66 against the Jedi, a contingent of clone shock troopers was sent to Kamino. Security was also tightened across the planet as even Republic Military personnel were required to provide clearance codes before gaining entry past Kamino's defense perimeter. Clone Sergeant \"Hunter,\" the commanding officer of Clone Force 99, was surprised to see the Coruscant Guard in Tipoca City. A mandatory assembly was held in Tipoca City's staging area where the clones and their creators gathered to witness the Supreme Chancellor's speech. With the Clone Wars ended through the destruction of Grievous on Utapau, and the Jedi accused of treason and consequently purged from the galaxy, Palpatine declared himself Galactic Emperor. With the exception of Clone Force 99, the clones in Tipoca City celebrated the Emperor's announcement of the Republic's reformation as the First Galactic Empire."}, {"tag": "p", "text": "At The time, the original clones' fighting ability deteriorated due to their advanced aging process..After Extensive Experiments with Human Recruits in secretive Imperial Military Installations, The Empire decided That Kamino was to be stripped of its cloning duties and all active Imperial Military Personnel in Tipoca City where to be relocated elsewhere. The New Recruits where being actively trained by Clone Commandos, such as Gregor and Scorch. The Cloning facilities on Kamino where then shut down shortly after."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The millions of Kaminoans who lived and worked in the city were either affiliated with the cloning industry or the government, as there was no public space within the massive domes. The two professions were closely interlinked, with the government overseeing the cloning space. Homes and recreation were only located in satellite cities nearby Tipoca. Cities like Tipoca were built with materials and construction droids from off-world suppliers. Repair work and construction occurred in a lull between the planet's rainy seasons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}