{"url": "Tiss%27sharl", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:Xappyh sector planets"], "nodes": [{"tag": "h1", "text": "Tiss'sharl"}, {"tag": "p", "text": "Tiss'sharl was a planet in the Xappyh sector, located in the Outer Rim Territories. It was home to the Tiss'shar, a species of intelligent therapods."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3704 BBY, the hyperspace explorer Freia Kallea connected the nearby Morellian Trail to the Spurs of Celanon as part of the super-hyperlane that came to be known as the Hydian Way. This opened up this region to the rest of the galaxy, and the space that included Tiss'sharl was explored between 3000 and 1000 BBY."}, {"tag": "p", "text": "Though most of the planet was temperate, the Tiss'shar themselves hailed from the humid, dangerous jungle continents of Tiss'sharl. The planet was ruled by the Tiss'sharl League, a consortium of the leaders of the businesses that posted the highest profits in the previous five local years; both locals and offworlders were eligible. The head of the League was the President. The material needs of the planet's natives were served by the corporations for which they worked. Tiss'sharl came under the undisputed authority of the League around 1,000 BBY; the rule of the League provided stability and abundance for the Tiss'shar, though it also eventually fostered the cutthroat politics that characterized it during the Imperial era."}, {"tag": "p", "text": "Because of its focus on business, Tiss'sharl was fully integrated into the Galactic economy, with large import and export sectors, and the planet usually enjoyed a trade surplus due to the recognized quality of its technological products. Tiss'sharl sold diatium power cells to the Jedi Council and later Tagge Company blaster cartridges to the Galactic Empire."}, {"tag": "p", "text": "The government of Tiss'sharl was notoriously violent and treacherous, with double-dealing and political assassinations being commonplace. Under the New Order, the planet was as loyal to the Empire as could be expected given the native political traditions, and it was of sufficient importance that the Imperial representative served more as a liaison than a governor, a situation also found, for example, as Tapani sector. It seems that the liaison was typically a Moff, which may have accorded Tiss'sharl the status of a sector capital, although it seems that at least some holders of this liaison position held other responsibilities in the surrounding volume of space."}, {"tag": "p", "text": "Following the death of Moff Giiedt, about eight months after the Battle of Yavin, he was replaced as liaison by a military officer, Commander Demmings, who also served as captain of the Star Destroyer Reprisal, then the command ship of Lord Darth Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}