{"url": "Tipping_Points", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Tipping Points"}, {"tag": "p", "text": "\"Tipping Points\" is the fifth episode of the Star Wars: The Clone Wars television series' fifth season. It aired on October 27, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"As a full-scale revolt embroils Onderon, the rebels strike a decisive blow against the planet's Separatist-aligned king. Unfortunately for the rebels, such victory comes at a high price.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "To prepare for the upcoming battle, Ahsoka Tano and Lux Bonteri sneak into the capital city, where Ahsoka deposits a holographic communicator in the midst of a market square. Through the device, former king Ramsis Dendup addresses his people personally, telling them about Sanjay Rash and the Separatist's lies about him being the instigator of the \"terrorist movement\" to solidify their hold on Onderon, and convincing them that the rebels are true patriots striving to liberate them all. This speech has the effect of stirring the people's resentments against the droid occupation forces ... much to the misfortune of an unlucky battle droid squad who happens to witness the speech. This event quickly sparks a movement among the citizens of Iziz, who all rise in revolt against Rash's regime. In order to salvage what's left of their power, Kalani suggests to take out the rebels and Dendup in one stroke, thus dealing the rebellion a mortal blow, and sends out a squadron of four droid gunships and a large droid force to the rebels' hideout."}, {"tag": "p", "text": "Ahsoka and Lux return to the new rebel camp in the Onderon highlands, where they have long since been joined by General Akenathen Tandin and the loyal fractions of the Onderon military forces. While debating about a decisive strike against the occupation forces, Steela successfully overrules her brother Saw's rash proposal to attack them in Iziz itself, instead proposing to draw them out into the highlands to lessen the endangerment to the civilians. Impressed by Steela's dedication and cautiousness, Dendup entrusts Steela with the command of both forces for the battle, appointing her general on the spot. Before they leave the base to implement their plan, Steela wastes no time planting a firm kiss on Lux, \"just in case.\""}, {"tag": "p", "text": "When the droid host arrives, the Onderon rebels and military forces await them. Initially they are able to inflict heavy losses on the ground and armor forces, but then the gunships attack, and their heavy armament and ray shields force the rebels into retreat. Ahsoka contacts Obi-Wan and Anakin and informs them of the dramatic change of events, but Obi-Wan still expresses reluctance to let the Republic openly intervene on behalf of the Ondorians. Angry about this decision, Anakin finally hits upon another idea: informally send a third party to Onderon to aid the rebels in their plight ... and the first choice he can think of is the pirate Hondo Ohnaka."}, {"tag": "p", "text": "Therefore, Anakin travels to Ohnaka's base on Florrum in order to hire him for an illegal delivery of heavy weapons to the rebels, and after much ironic but good-natured banter, Ohnaka agrees to the deal and delivers a pack of shoulder-fired rocket launchers to the rebels, before making a discreet retreat when a group of commando droids makes its appearance in the rebel camp. After finishing the droids, Steela, Ahsoka, and Lux take up the launchers and deliver a few of them to their compatriots, whereupon Saw uses one to take down one of the gunships to the rebels' jubilation. Immediately thereafter, however, Steela is informed that a droid gunship and two BX commandos are attacking the hideout in order to get to Dendup."}, {"tag": "p", "text": "Steela, Ahsoka, and Lux arrive just in time to save the king from the droids. On the nearby battle field, Saw shoots down the last of the enemy gunships, but the damaged unit careens, out of control, right into the rebel camp. Steela is trapped on a collapsing rock on the edge of a cliffside, broken loose by the droid's impact, and while trying to jump to safety, she is caught hanging from the cliff. Lux rushes to save her, but nearly falls off himself. Ahsoka uses the Force to float him to safety, but as she tries to do the same for Steela, the not yet fully disabled gunship wounds her with a laser blast, causing Ahsoka to inadvertently drop Steela to her death."}, {"tag": "p", "text": "While the rebels grieve over the loss of their brave leader, Steela's life was not lost in vain, however: With the rebellion growing beyond any hope of containment, Count Dooku decides to evacuate the remnants of his forces from Onderon, and Rash is summarily executed by Kalani, having outlived his usefulness. Later, on the steps of the royal palace, Steela is given a public memorial in full honor of her struggle for freedom. Lux reveals to Ahsoka that Dendup, reinstated as Onderon's king, has appointed him the official senator of Onderon and that he finally intends to lead its people back to the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Throughout the insurgency on Onderon, the rebels tactics are very reminiscent of the Mujahideen in the Soviet-Afghan War. The combat debut of the separatist gunships are also reminiscent of the combat debut of the Soviet attack gunship, the Mil Mi-24 “Hind”, which was introduced during the Soviet-Afghan War and help inflicted heavy casualties amongst the Mujahideen fighters. Finally, the subsequent arms delivery by Hondo Ohnaka is reminiscent of Operation Cyclone, which was conducted by the CIA to supply arms to the Mujahideen during the War.[source?]"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}