{"url": "Battle_of_Sessal_Spire", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Battles of Dreypa's rebellion"], "nodes": [{"tag": "h1", "text": "Battle of Sessal Spire"}, {"tag": "p", "text": "The Battle of Sessal Spire occurred in 2974 BBY during Dreypa's rebellion on the planet Kesh. After being routed at the Battle of the Marisota Floodplain, the Sith Lord Remulus Dreypa ordered his forces to retreat to Sessal Spire, a volcano overlooking the Southern Ocean. They were pursued by an army sent by the Lost Tribe of Sith under Grand Consort Iliana Hilts."}, {"tag": "p", "text": "Following the collapse of negotiations, Dreypa used his amulet to awaken several hibernating Leviathans, reptilian Sithspawn that devoured the life energies of other beings. The Leviathans quickly wiped out much his former allied army and the Tribal army. Shortly later, the Doomed—the descendants of ancient stranded Jedi and Dark Jedi who had landed on Kesh following the Hundred-Year Darkness—attacked Dreypa's Leviathans but were also overcome by the Sithspawn."}, {"tag": "p", "text": "During the battle, two former enemies Sith anarchist Parlan Spinner and the Sith princess Takara Hilts joined forces after Spinner rescued her mother Iliana from being devoured by a Leviathan. They were subsequently joined by the last surviving member of the Doomed—Kaliska who revealed the existence of a hidden Jedi starship beneath the Tribal capital Tahv. Prior to her death, she convinced the Sith to destroy it in order to prevent Dreypa from escaping offworld."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following the Battle of Corbos, the surviving Dark Jedi were exiled to Korriban where they developed the first Sith Order. A group of these Dark Jedi led by Sith Lord Remulus Dreypa attempted to return to the Galactic Republic and seek revenge against their Jedi adversaries. However, they and their Jedi pursuers ended up on Kesh, a remote and primitive world that was home to the humanoid and purple-skinned Keshiri species. The arrival of these Force-users triggered the Great Calamity which devastated much of Kesh and gave rise to legends about the Skyborn and the Destructors. Eventually, Dreypa's Dark Jedi allies turned against him and imprisoned him within his own oubliette, a stasis casket capable of keeping individuals in suspended animation for millennia. Dreypa's former Dark Jedi allies then made peace with the Jedi and founded the Doomed, a Force-sensitive community dedicated to protecting the Keshiri and finding balance in the Force."}, {"tag": "p", "text": "Meanwhile, Dreypa remained in suspended animation for four thousand years until he was freed by the Sith outcast Parlan Spinner. Spinner was a member of the Lost Tribe of Sith, another group of Human Sith who had become stranded on Kesh during the Great Hyperspace War in 5000 BBY. Spinner hoped to use Dreypa as an ally against the Tribe, which he disliked for mistreating him. Spinner brought Dreypa back to the port town of Eorm on the main continent of Keshtah Minor. Using his dark side powers, Lord Dreypa seized control of Eorm and raised a rebel army with the aim of overthrowing the Lost Tribe's leadership in the Sith capital Tahv. Dreypa also planned to returned to the stars and seek revenge against the Jedi and the Republic."}, {"tag": "p", "text": "In addition, Lord Dreypa had planned to use the Sith princess Takara Hilts, daughter of Grand Lord Varner Hilts, as a hostage in negotiations with the Tribe. However, she and the Doomed leader Kaliska had managed to escape their captors and also brought Eorm's entire herd of uvaks, winged reptilian beasts, to Eshkrene. They then brought all members of the Doomed to Keshtah Minor in order to stop Dreypa from endangering the Keshiri."}, {"tag": "p", "text": "Dreypa's forces clashed with the Tribe's army at the Battle of the Marisota Floodplain. Despite their initial successes, Dreypa's forces were decimated by the Tribe's air force, the Skyborn Rangers. Dreypa and his surviving followers retreated to Sessal Spire, a volcano situated at the edge of a peninsula on the southwestern coast of Keshtah Minor. The Tribe's forces led by Grand Consort Iliana Hilts, the wife of Lord Hilts, pursued Dreypa and Spinner to the crater of Sessal Spire. After Iliana rebuffed Dreypa's attempts at seduction, Dreypa used the dark side to summon several hibernating Leviathans from the crater."}, {"tag": "h3", "text": "The Massacre"}, {"tag": "p", "text": "Lord Dreypa's Leviathans immediately attacked both his former allies and the Tribe's forces. They used their tentacles to grab many sentient beings and trapped them on their blister traps, where their life energies were drained by the monsters. The Leviathans also absorbed the knowledge and memories of their prey. Dreypa's former ally Parlan Spinner and his pursuer Iliana Hilts were forced to scatter. When Spinner attempted to reason with his former ally, Dreypa retorted that his \"so-called\" allies had betrayed him centuries ago and that the Leviathans were the only help he needed. Shortly later, the Doomed arrived on their uvak steeds and proceeded to bombard Dreypa's Leviathans with arrows. The Doomed's leader Kaliska rallied her forces, reminding them to target the Leviathans' blister traps and to avoid close quarters. She also exhorted them to remember the \"tales of old\" and reiterated that they had been born to fight against Dreypa."}, {"tag": "p", "text": "Spinner attempted to flee the fighting but was intercepted by his nemesis Takara Hilts who used her uvak to knock him down. Takara confronted Spinner with her lightsaber while Spinner fought back with several Keshiri glass daggers. The two Sith also taunted each other with Takara denouncing Spinner as a traitor while Spinner mocked Takara for being a \"slave\" to her parents. Eventually, Takara gained the upper hand over the outlaw and was about to execute him with her lightsaber when she was interrupted by the screams of her mother. Her mother Iliana had been captured by a Leviathan and was in the process of being drained of her energies."}, {"tag": "p", "text": "Driven by his secret affection for Takara, Spinner chose to help his enemy save her mother. He punctured the Leviathan's blister traps with his daggers and used Takara's lightsaber to kill the beast. When questioned by Takara, Spinner justified his actions by claiming that he had dreams for himself which did not involve the Leviathans destroying his planet. While Iliana survived her ordeal, she had been drained of a significant proportion of her life force. As a result, she had aged been aged thirty years older. Spinner and Takara then quickly evacuated from the battlefield the debilitated Iliana on the back of an Uvak."}, {"tag": "p", "text": "Meanwhile, Lord Dreypa regained the upper hand through his mastery of Force lightning and the high reproductive rate of his Leviathan minions. Many of the Doomed and their Uvak steeds were slain or devoured by his Leviathans which drained the life energies and knowledge of their defeated foes. Through the Force, Dreypa learnt about the identity of the Doomed—that they were the descendants of the Jedi and Dark Jedi that had imprisoned him within his oubliette millennia earlier."}, {"tag": "p", "text": "Dreypa was also confronted by a Rodian member of the Doomed, who denounced Dreypa as his ancestors' \"Great Shame\" who had to be \"put right.\" Dreypa vowed vengeance against the Doomed and sought to find what they were hiding from him."}, {"tag": "h3", "text": "The Last Hope"}, {"tag": "p", "text": "Following the awakening of the Leviathans, Dreypa's former allies along with their Sith pursuers and all members of the Doomed except Kaliska were killed by the Sith Lord's Sithspawn. Kaliska managed to escape the battle and rejoined Parlan Spinner, Takara and Iliana Hilts. Kaliska urged Spinner and Takara to combine forces with the Tribe's forces. However, Spinner was sceptical that the Tribe would support Kaliska since she was as \"freakish\" to them as the Leviathans. Iliana was unable to lead the Tribe's forces since she had been greatly weakened by the Leviathans. Unwilling to abandon her mother to the Leviathans, Takara wanted to bring her mother back to Tahv so that she could be treated by the Tribe's Force sages."}, {"tag": "p", "text": "Sensing potential in Takara, Kaliska urged the Sith princess to lead the Tribe's forces. She warned that if Dreypa was not stopped, he would threaten the wider galaxy. Spinner then questioned Kaliska whether she was hiding anything that could be used against Dreypa from the Sith. Based on Kaliska's comments, he deduced that the Doomed had a means of leaving Kesh and traveling to the stars. Cornered by both Spinner and Takara, Kaliska reluctantly admitted that the Doomed were aware about the existence of a single Jedi starship called the Last Hope, which was hidden beneath the Keshiri burial cairns under Tahv's Circle Eternal, the residence of the Grand Lord and his family. The Doomed's ancestors had preserved the Last Hope so that they could leave Kesh and return to the wider galaxy in the future."}, {"tag": "p", "text": "Kaliska feared that Dreypa would learn about the existence of the Jedi starship and succeeded in convincing Spinner and Takara to destroy the vessel. Due to his familiarity with the catacombs, Spinner was selected to carry out this task. Takara also convinced Spinner to take her mother on the uvak and return to Tahv. While Kaliska was reluctant to trust Spinner, she reluctantly agreed to escort Spinner and ensure he carried out the task. At that moment, the party was attacked by a Leviathan. Spinner, Iliana and their uvak managed to escape the scene but Kaliska was captured and devoured by the beast. Through her death, Dreypa learnt about the existence of the Jedi Starship and ordered his Leviathans to move towards Tahv."}, {"tag": "p", "text": "Dreypa was unwilling to enslave what he regarded as \"sorry henchmen\" and allowed the Leviathans to feed on Kesh after he had gone. At that point, Dreypa was interrupted by Takara who challenged him to a lightsaber duel. Takara vowed that she would kill him and asserted that the planet belonged to the Tribe. Dreypa retorted that the Tribe had sent its best after him and taunted Takara by saying she was the only survivor. Takara responded that the Tribe had freed themselves from the Sith in the past and vowed to break him. The two Sith fought and Dreypa gained the upper hand through his superior mastery of the Dark Side of the Force. He took Takara prisoner, intending to use her as a bargaining chip when dealing with Spinner."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Battle of Sessal Spire was a stepping stone for Remulus Dreypa's assault on Tahv. News of the events at Sessal Spire reached Tahv through Thought-criers. Due to the threat of Dreypa and his Sithspawn, the Tribe's leadership summoned all able-bodied residents in Tahv including Sith, Keshiri, and slaves to prepare for the defense of their city. Meanwhile, Parlan Spinner and Iliana Hilts managed to return to Tahv on their uvak. Iliana was brought to the Tribe's Force Healers but they were unable to reverse the ageing effects of Leviathans. Iliana was despondent because she was unable to lead the Tribe's forces due to her debilitated state. Grand Lord Varner Hilts comforted his wife by reminding her that a \"smart Sith\" would be able to convince the others to fight for her. He convinced her to \"act the part\" of a strong leader."}, {"tag": "p", "text": "Meanwhile, Spinner entered the catacombs beneath the Circle Eternal and managed to find the Jedi Starship Last Hope. However, he reneged on his earlier promise to destroy the vessel and instead took the starship on a ride above Kesh. For the first time, Spinner was able to see the planet Kesh from orbit as well as the surrounding space. Before the Sith rebel could take the Last Hope on a hyperspace journey to Coruscant, he was contacted by Lord Dreypa who delivered an ultimatum. Unless Spinner handed the ship to him, he threatened to harm Spinner's love-interest Takara Hilts. He ordered Spinner to meet him at Tahv, which set the stage for the Siege of Tahv. Ultimately, Spinner decided to save the Tribe and played an instrumental role in Dreypa's demise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While not officially named, the Battle of Sessal Spire was the third conflict of Dreypa's rebellion, which devastated parts of Keshtah Minor in 2974 BBY. It first appeared in John Jackson Miller's Lost Tribe of the Sith—Spiral 4, the fourth comic issue of the Spiral comic story, which was released on November 14, 2012."}, {"tag": "h2", "text": "Appearances"}]}