{"url": "Battle_of_Sevarcos", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Sevarcos"}, {"tag": "p", "text": "In the months following the Battle of Endor, a battle occurred in a spice mine on the planet Sevarcos. The New Republic fought with Imperial forces at the mine. While the Empire seemed to be winning, three slaves Greybok, Palabar, and Hachet turned the tide of the battle by releasing three imprisoned rancors. The rancors rampaged through the Imperial forces, allowing the New Republic to claim victory and liberate the slaves."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, the Galactic Empire dispatched many alien slaves to toil in a spice mine on the planet Sevarcos. The mine was guarded by Imperial soldiers and at least one Zygerrian slaver. Conditions at the mine were harsh and brutal with many slaves suffering injuries and ailments. Discipline was harsh and one attempted escapee, the Wookiee Greybok, had one of his arms amputated as punishment. The mine was also guarded by rancors, who were forced to march in the outer canyons to keep the slaves from attempting to escape."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Following the Battle of Endor, the Rebel Alliance established a new galactic government called the New Republic. As the Galactic Civil War spread across the galaxy, New Republic soldiers saw action on numerous worlds including Sevarcos. The fighting eventually spread to this particular spice mine and many miners were wounded or killed during the bombardment. Imperial forces clashed with the New Republic forces and managed to gained the upper hand."}, {"tag": "p", "text": "Amidst the fighting, three slaves debated their next move. While the Weequay Hatchet proposed escaping their Imperial slavers while they still had the chance, Greybok urged his comrades to aid the New Republic soldiers. The Quarren Palabar agreed with Greybok and argued that if they escaped, the Empire would come after them. Greybok proposed freeing the three rancors housed inside the corral. Deciding to aid their New Republic liberators, Greybok charged into the fray. He encountered an Imperial soldier in mechanized battle armor and threw him into a crevasse."}, {"tag": "p", "text": "Putting his plan into action, Greybok used a large rock to smash the lock of the gate open. This caused the electric corral fence to short-circuit. After the gate opened, the rancors charged out and attacked the Imperials. One of the rancors caught Greybok and flung him to the ground. At that point, Greybok was attacked by a Zygerrian slaver who proceeded to torture him with a blaster called a needler. Before the slaver could kill him, Hatchet came to Greybok's rescue and bludgeoned the Zygerrian to death with a rock."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Greybok's actions turned the tide of the battle in favor of the New Republic. As Greybok and his companions watched, New Republic soldiers rounded up the slavers and threw the spice canisters into the fire. The big rust-red rancor was killed but the smaller gray-green and rust-red ones managed to escape the battlefield. When Hatchet asked one of the New Republic soldiers what would happen to the slaves, the female soldier replied that they were free and kicked a stormtrooper helmet aside. Greybok, Hatchet, and Palabar then decided to explore the galaxy as freed men. The three former slaves would late take part in the liberation of Kashyyyk, which ended the Imperial subjugation of the Wookiee species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Sevarcos first appeared in an interlude chapter in Chuck Wendig's 2015 novel Aftermath. It was told from the point-of-view of the Wookiee Greybok."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}