{"url": "Tishra_Kandia", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Officers of the First Order"], "nodes": [{"tag": "h1", "text": "Tishra Kandia"}, {"tag": "p", "text": "Tishra Kandia was a human female intelligence officer of the First Order. She served aboard the Star Destroyer Steadfast, dealing with evidence and accounts of Resistance activity. In 35 ABY, Kandia analyzed a necklace taken from the Jedi Rey for Supreme Leader Kylo Ren, which she identified as originating from the planet Pasaana."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tishra Kandia was a human female who served the First Order as one of its top intelligence officers. During the war between the First Order and the Resistance, she was stationed on board the Resurgent-class Star Destroyer Steadfast, where she was tasked with processing captured evidence and firsthand accounts of Resistance activity."}, {"tag": "p", "text": "In 35 ABY, she received a necklace to process from Supreme Leader Kylo Ren, who had snatched it from the neck of the Jedi Rey via their Force-bond. Kandia was able to pin down the origin of the necklace as being the Forbidden Valley on the planet Pasaana in the Middian system."}, {"tag": "p", "text": "She brought the necklace back to the Supreme Leader and reported this information to Ren and Allegiant General Enric Pryde in one of the Steadfast's corridors. Ren then ordered Pryde to prepare his starship and alert any First Order forces in that area to begin searching for Rey. The Steadfast was later destroyed during the battle of Exegol."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tishra Kandia had fair skin, brown hair and brown eyes. She took Kylo Ren's order to find any clues to Rey's whereabouts seriously, and left no stone unturned, making her one of the only intelligence officers who did not baulk at Ren's orders to expend resources on finding the Jedi."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Kandia wore a gray officer's uniform including a cap. She carried two code cylinders which were coded to allow her access to the analysis lab on board the Steadfast."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tishra Kandia was portrayed by Amanda Hale in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. Her surname was revealed in the film's credits while her first name was first used in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. The 2020 junior novelization of the film by Michael Kogge lists Kandia as one of the officers present during the scene in which Ren presents the head of the Resistance sympathiser Boolio to the Supreme Council; however, as Kandia is visibly not present in that scene during the film this article assumes the junior novelization to be incorrect."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}