{"url": "Tjulan_Kwaad", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Domain Kwaad", "Category:Males", "Category:Yuuzhan Vong shapers"], "nodes": [{"tag": "h1", "text": "Tjulan Kwaad"}, {"tag": "p", "text": "Tjulan Kwaad was a Master Shaper of the Yuuzhan Vong, the head of Domain Kwaad, and the lord of Domain Yim. However, his domains suffered humiliation by events that occurred on the moon Yavin 4 in 26 ABY. One of the Master Shaper's subordinates, Mezhan Kwaad, and her respective adept, Nen Yim, committed heresy by violating the sacred laws governing the shaper caste and utilizing unorthodox methods in their biological experimentation. To his chagrin, Kwaad's domains subsequently fell into disrepute, and, when Yim contacted him later that year to ask for aid, Kwaad was unwilling to help her. Only a short time after Yin's plea, however, Kwaad sent Master Shaper Kae Kwaad to her aid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tjulan Kwaad attained the rank of Master Shaper and the position of both the head of Domain Kwaad and the senior master of Domain Yim. Elderly at the time of the Yuuzhan Vong War of the galaxy, he was a staunch adherent to the laws which governed the shaper caste, and was thus deeply angered by the events which occurred on the moon of Yavin 4 in 26 ABY. One of Kwaad's subordinates, Mezhan Kwaad, had been tasked with experimenting on a captive Jedi. Along with her adept, Nen Yim, Kwaad had performed heresy while carrying out her mission, ignoring the strict guidelines of the shaping protocols in order to conduct unorthodox experiments. As the shaping protocols were sacred the the Yuuzhan Vong gods, their violation was a severe transgression usually punishable by death. The two shapers had been discovered by other Yuuzhan Vong, and Mezhan Kwaad had been killed. The entire affair had come to light shortly thereafter, and Domains Kwaad and Yim were both disgraced, a source of acute embarrassment for Tjulan Kwaad."}, {"tag": "p", "text": "Kwaad was contacted by Adept Nen Yim a short time after the events on Yavin 4, who had been spared execution as a heretic by Warmaster Tsavong Lah due to her exclusive knowledge of the Jedi and had been subsequently transferred to the worldship Baanu Miir. Yim, who had made contact with Kwaad by a villip, a Yuuzhan Vong organic communications device, petitioned the old shaper for aid. Yim revealed that the Baanu Miir was dying, and asked the senior master for a shaping protocol which could prevent the death of the ancient vessel. Kwaad was unwilling to provide the knowledge of protocols which were beyond the level of those to which Yim already had access, not only due to orthodox shaping procedure, but especially due to the fact that it was Yim who had asked. Before long, as Yim pressed the issue, Kwaad became enraged. He blamed Yim for what he believed to have been the fiasco on Yavin 4 and, when she attempted to appeal to him on the level of saving those aboard the Baanu Miir, Kwaad curtly reminded the adept that everything died."}, {"tag": "p", "text": "The Master Shaper was not interested in continuing the conversation. Yim's continued attempts to secure his aid for the sake of the worldship's inhabitants—whom Kwaad believed were useless for the war effort anyway—were ignored, and Kwaad ended the transmission. Several minutes later, however, Kwaad contacted the adept by villip again and informed her that he would send a Master Shaper to the worldship. The reason Kwaad gave the adept for his action was that a Master Shaper would prevent Yim from bringing more shame to his domain."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tjulan Kwaad was unwilling to compromise with Yim to save members of his species for several reasons. Firstly, the Master Shaper felt anger towards the adept due to her part in disgracing the Kwaad and the Yim and for not reporting the actions of Mezhan Kwaad. Secondly, the Master Shaper believed that the laws of the shapers were not to be defied. Finally, Kwaad felt that those present on the Baanu Miir were not worth saving, not only because of their lack of worth in terms of the war effort, but also due to his belief that they were all fated to die anyway. Kwaad was also prone to anger and had little patience for sophistry."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tjulan Kwaad appears only in Greg Keyes' The New Jedi Order: Edge of Victory II: Rebirth, for one chapter, during which he interacts with Nen Yim, a predominant Yuuzhan Vong character in The New Jedi Order series. His dialogue reveals some of the consequences of the events of the previous novel, such as the embarrassment of Domain Kwaad."}, {"tag": "p", "text": "Kwaad's sudden turn from his initial response to Nen Yim's requests is unexplained, though the more likely alternative to the reason the Master Shaper gives—that Yim should not be left unsupervised—is that he is ordered by either Supreme Overlord Shimrra Jamaane, or coerced by the true power behind the Yuuzhan Vong, Onimi, who controls Jamaane by means of the Force, to contact the adept again. The \"Master Shaper\" whom Kwaad sends is, in fact, a disguised Onimi, who uses the pseudonym \"Kae Kwaad\" to observe Yim's heresy. It later transpires that Yim is required by Shimrra Jamaane—as the puppet of Onimi—to undertake secret, heretical research into advanced Yuuzhan Vong technology."}, {"tag": "p", "text": "The Master Shaper's words also raise the question of the relationship between the Kwaad and the Yim. While he claims that Mezhan Kwaad was his subordinate, Tjulan Kwaad also refers himself as the leader of Domain Yim. He later states that Yim disgraced \"our domain,\" and refers to the \"Yim crèche\" suggesting that the Yim are perhaps a subsidiary domain of the Kwaad."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}