{"url": "To-phalion_Base", "categories": ["Category:Legends articles", "Category:Imperial research facilities"], "nodes": [{"tag": "h1", "text": "To-phalion Base"}, {"tag": "p", "text": "To-phalion Base was a hidden Imperial research facility in the Iast system. The Vorknkx Project was the last known objective of the base. The goal of the project was to create a working cloaking device for starfighters. The base was destroyed by traitorous Imperial forces under the command of rogue Grand Admiral Demetrius Zaarin."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The interior of the asteroid base consisted of a number of research stations and a hangar bay which was large enough to house a Starfighter squadron, some Lambda shuttles and a CR90 corvette. On the outside layer it consisted of 12 laser batteries and an Anti-warhead launcher. It also had 8 asteroid static defenses, 4 of which were Asteroid Laser Batteries and the other 4 were Asteroid Warhead Launchers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early History"}, {"tag": "p", "text": "To-phalion Base was formally an Asteroid mining facility established by the Galactic Empire. When the mineral deposits became exhausted the asteroid's hollowed out interior was reformatted to make room for research facilities."}, {"tag": "h3", "text": "Vorknkx Project"}, {"tag": "p", "text": "To-phalion Base become the new home for the Vorknkx Project and its testbed a CR90 corvette when its original research station was attacked by Zaarin's forces and had to be evacuated. Grand Admiral Thrawn witnessed a demonstration to see the results of the progress of the project. He learned that the cloaking device was unstable when used in conjunction with hyperdrive engines."}, {"tag": "h3", "text": "Zaarin's Attack on To-phalion Base"}, {"tag": "p", "text": "Zaarin, however, managed to slip in some of his spies into the base and revealed the location to his forces. Still wanting his hands on the cloaking device, he then sent an attack consisting of three waves. The first wave consisted of TIE Defenders and Muurian transports. Thrawn anticipated this and was planning a trap for Zaarin but he needed time."}, {"tag": "p", "text": "He then sent a squadron of TIE Avengers one of which had Thrawn's best pilot Tan Maarek Stele who had protected the Vorknkx project before and had experience in fighting Zaarin's forces. While the fighting was going on, one of Zaarin's spies stole a shuttle Lambda 3 and made an unauthorized launch to escape with project data. He also sabotaged the base's targeting systems to prevent himself from being fired on. However, Maarek got close enough to inspect the shuttle and then destroyed it. The remaining transports and TIE Defenders were quickly dispatched."}, {"tag": "p", "text": "However a second attack was made and it was also revealed that the spy also sabotaged the defenses, resulting in all the asteroid static defenses suffering shield failures. The next attack consisted of Assassin-class corvettes called Z-Rok, Assault Gunboats and Assault transports. Both the corvettes and the transports contained troops indicating Zaarin's intentions to steal the cloaking technology. The attack was also thwarted by Maarek Stele. Thrawn also arrived in the Nebulon-B frigate Maru Ki to secure the area."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Zaarin, adamant on acquiring the technology, took control of the operation himself. Bringing his flagship the Glory into the Iast system, he began attacking the Maru Ki until it was badly damaged prompting the ship to reach hyperspace and Thrawn to leave the ship in a shuttle. Zaarin attempted to kill Thrawn by ordering some of his forces to attack the two shuttles but thanks to Stele he escaped alive to his ship, the Grey Wolf, which came with two Strike-class medium cruisers, Daring and Ebolo. It was also supposed to be with Interdictor Corvus but was delayed, and as a result they were unable to trap the Glory. What was worse was that To-phalion Base's shields had failed against the assault and the Vorknkx launched from the hangar, only to be hijacked by Zaarin's spies and the corvette entered the hangar bay of the Glory. To-phalion base was then destroyed in the process and the Glory jumped into hyperspace. What Zaarin didn't know until too late was that Thrawn had planted a tracking device on the corvette allowing him to pursue Zaarin's forces and ultimately destroy them by allowing him to try to escape with the Vorknkx with its cloaking device activated and its hyperdrive engines engaged causing Zaarin to perish in a horrific explosion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}