{"url": "Tivoche_Bilure", "categories": ["Category:Canon articles", "Category:Articles with an excess of redlinks", "Category:Character stubs", "Category:Bartenders", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tivoche Bilure"}, {"tag": "p", "text": "Tivoche Bilure, also known by the nickname \"Midnight,\" was a Corellian human male. He served as bartender at the Lodge on the planet Vandor in the time of the Galactic Empire. While working there, he came to know Han Solo, Chewbacca, Lando Calrissian, and other visitors to the Lodge with stories to tell. Bilure wrote a book to recording the stories he witnessed and heard from his patrons."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Tivoche Bilure was born on Corellia and grew up in an overcrowded, working-class neighborhood in Coronet City that never received any attention from the authorities. His family never had the money to buy enough food. As a boy, he tended mobile furnaces at the Coronet City shipbreaking yards. Bilure worried about growing old and developing Shipbreaker's Cough like his father, and spending his life working hard for credits, but never having enough. Unwilling to live that life, Bilure saved up his money and signed up to work for passage aboard the bulk freighter Rampaea Horizon. After working off the price of his ticket, he continued working for wages and studied each planet the Horizon stopped at from a datapad to decide if he wanted to stay there. When the ship landed on Vandor, Bilure knew without researching beforehand that this was the right planet for him, citing the clean air and wide sky."}, {"tag": "h3", "text": "Settling on Vandor"}, {"tag": "p", "text": "After Tivoche Bilure settled on Vandor he took a wide variety of jobs to earn a living. He would visit the Lodge in Fort Ypso and connect with people looking to hire workers. His first job involved riding a speeder bike to round up kod'yoks and skinning the creatures using a laser knife. He later came to regret this because of how small the kod'yok herds became. His next position involved climbing Big Rock to help set up a comm repeater. When the Empire arrived on Vandor, Bilure took a position laying conveyex tracks across Spinnaker Raider territory. Bilure and his work crew had to lay down the tracks three times, as the Spinnakers tore up the track each time they finished. The third time, the Spinnakers attacked the workers as soon as they arrived. Bilure hid under a kod'yok skin and was the only one survive the attack. While returning to the base camp, Bilure was attacked by a TIE Fighter pilot who mistook him for a raider."}, {"tag": "p", "text": "One night when Bilure was at the Lodge, the owner, Tibbs Ospe, needed someone to help refire the slug feeder for the slug furnace. Bilure was able to do the job thanks to his experience with mobile furnaces as a boy. Every time he visited the Lodge thereafter, Tibbs found odd jobs for him help out with, until he offered Bilure room and board if he stayed around to help out. One night, a party of skinners came into the Lodge just as the last barkeep's shift ended, so Bilure stayed up overnight to take care of the guets. After hearing Bilure's talent for talking with the visitors, Tibbs offered him the position of overnight bartender full time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tivoche Bilure was first mentioned in Jason Fry's 2018 replica journal book Solo: A Star Wars Story: Tales from Vandor. When questioned about the veracity of Bilure's stories, Fry stated \"Personally, I wouldn't trust anything Midnight tells you.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}