{"url": "Battle_of_Siskeen", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Hunnoverrs sector", "Category:Battles of the Siskeen theater"], "nodes": [{"tag": "h1", "text": "Battle of Siskeen"}, {"tag": "p", "text": "During the Outer Rim Sieges, a battle took place on the planet Siskeen, a key holding of the Confederacy of Independent Systems in the Hunnoverrs sector. As the fighting throughout the Outer Rim Territories developed, the Galactic Republic advanced in six major theaters—the theater where the Corellian Run ends was dubbed Siskeen as it was an important stronghold in that region—and was able to make a progress in all its campaigns."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the third year of the Clone Wars, the Galactic Republic gained momentum against the Confederacy of Independent Systems. Intensifying its industrial efforts and giving Supreme Chancellor Palpatine more power to direct the war effort, the Republic was able to renew its military forces, eject the Separatists from their Core and Colonies bases and drive its enemy back to the Mid Rim and Outer Rim Territories. In an effort to defeat both the Galactic Republic and the Jedi Order, the Separatists created the Morgukai Shadow Army, a military force built of Morgukai clones, on the Outer Rim world of Saleucami in 19 BBY. Dooku, the Head of State of the Confederacy of Independent Systems, scheduled the deployment of Morgukai assassins against Republic and Jedi personnel with the soon-to-be completed marshaling of the Outer Rim forces on Siskeen, Xagobah, Clak'dor VII and Sluis Van, to achieve a crucial victory. Before the clones could be brought off-world, however, the Republic intervened and besieged the planet, resulting in a five-month long battle."}, {"tag": "p", "text": "Siskeen, a world of the Hunnoverrs sector in the Hutt-controlled part of the Outer Rim Territories, was a Separatist holding and a renowned key world towards the end of the war. The planet was located at the end of the Corellian Run, alongside Separatist strongholds like Tellanroaeg, Ryloth, Tythe, Llanic and Ragmar V. Republic fleets from Excarga and Rothana, initially tasked to repel enemy units on the Corellian Run, chased the Separatists to Siskeen and Tellanroaeg, resulting in a battle."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "While its fleet besieged Siskeen, the Republic was able to make a progress in all six campaigns throughout the galaxy, gaining advantage in the Outer Rim Sieges. When the fighting intensified in the Outer Rim, the main thrust against the remaining Separatists forces came in six war theaters, which were dubbed Siskeen, Mygeeto, Serenno, Felucia, Yag'Dhul and Praesitlyn after major Separatists worlds in those regions."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the start of the Great Jedi Purge, the deactivation of the Separatist Droid Army and the proclamation of the Galactic Empire, the Clone Wars ended."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Siskeen was first mentioned in The Essential Atlas, a 2009 reference book by Jason Fry and Daniel Wallace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}