{"url": "Tivik", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Humans", "Category:Males", "Category:Partisan members"], "nodes": [{"tag": "h1", "text": "Tivik"}, {"tag": "p", "text": "Tivik was a human male who served as an informant for the Alliance to Restore the Republic, and operated on Jedha as one of Cassian Andor's underground contacts to the insurgent group led by Saw Gerrera. During a secret mission on the Ring of Kafrene, Tivik informed Andor of the Galactic Empire's secret superweapon, the Death Star, and was killed as Andor escaped stormtroopers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tivik worked as an informant for the Alliance to Restore the Republic, proving useful as an intelligence contact for Cassian Andor, albeit a nervous one. He worked as one of Andor's underworld connections to Saw Gerrera's insurgents on Jedha, serving among the men in Gerrera's militia. At some point he injured his right arm, necessitating the use of a sling fashioned from a scarf."}, {"tag": "h3", "text": "Rendezvous with Captain Andor"}, {"tag": "p", "text": "Tivik was assigned to Jedha as one of Captain Cassian Jeron Andor's informants, and learned of Bodhi Rook's defection from the Empire and the existence of a planet killer, the Death Star. He sent Andor an oblique message, recalling him from Corulag for a rendezvous at the Ring of Kafrene, and joined a team heading to the Ring to steal ammunition."}, {"tag": "p", "text": "Tivik met with Cassian Andor in the alleyways as he was preparing to leave with his team, but Andor kept him talking until he revealed what he knew from Jedha. They were accosted by two stormtroopers, whom Cassian shot dead, but the brief firefight alerted more Imperial forces. Tivik fretted over his injured arm, unable to climb onto the rooftops as Cassian intended. Cassian, knowing the Empire would capture him and interrogate the information from him, killed Tivik with a blaster bolt to the back. The man fell onto the ground and Cassian made his escape back to Yavin 4."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Cassian reported back to Base One, and was debriefed by General Airen Cracken. He relayed the details of his meeting with Tivik, justifying neutralizing the man to prevent him from being taken into Imperial custody. Armed with Tivik's information about the Death Star, the Rebel Alliance went on to steal the battle station's plans from Scarif, and ultimately formed a plan to destroy the superweapon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tivik was a human male with a soft, round face and hard eyes. His breath carried the scent of cinnamon. He was a small man capable of making himself appear smaller to avoid suspicion."}, {"tag": "p", "text": "He worked as an unscrupulous source of information for the Alliance, responding well to pressure, and was a true believer for the cause. Despite this, Tivik was also an abject coward who sought to escape the moral responsibilities he assigned himself, making him a maddening individual to work with. He was nervous and irritable during his meeting with Cassian Andor on the Ring of Kafrene, and became distressed while informing Andor about the \"planet killer.\" He expressed the fear that the Rebellion was falling apart, angry over how little the Alliance had done to help Saw Gerrera. He twitched throughout the meeting, looking ready to bolt at any moment, and displayed even more terror than the nervousness Cassian usually knew him for."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tivik was created for the 2016 anthology film Rogue One: A Star Wars Story, and was portrayed by English actor Daniel Mays."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}