{"url": "Titterbug", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural spelling", "Category:Insectoid sentient species", "Category:Sentient species of Endor", "Category:Titterbugs"], "nodes": [{"tag": "h1", "text": "Titterbug"}, {"tag": "p", "text": "The Titterbugs were a species of sentient insectoids who lived on the Forest Moon of Endor. They were small beings with four legs, two arms, and—at least in some members—an orange carapace. Their heads were large in relation to the rest of the body, the site of two large eyes, a wide mouth, two antennae, and a full head of hair. Titterbugs recognized some members of their kind as princesses, and in 3 ABY, one such Titterbug was considered as a potential wife for Vork, prince of a tribe of Gorphs who lived on Endor."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Titterbugs were a species of sentient insectoids who stood roughly 0.33 meters tall. A Titterbug's body was divided into three segments: a head, a thorax, and an abdomen. Six limbs grew from this bottommost section; members of the species stood upright on four segmented legs with two toes per foot, while another two limbs with three fingers served as fine manipulators. At least some Titterbugs had an orange carapace with reddish-brown markings."}, {"tag": "p", "text": "The thorax supported a thin neck, upon which was perched a large, wide head. At least for some members of the species, the face was pale from the chin to just above the upper lip. A Titterbug could purse his or her mouth into a small opening or a wide grin that bared large, pale teeth. The remainder of the head was colored the same hue as the carapace of the body. Titterbugs had two large, yellow eyes with black pupils, and at least some members of the species sported eyelashes. Titterbugs had hair; reddish brown was one possible color. Two jointed, black antennae poked from the hair atop the head."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Some Titterbugs had high-pitched voices. The species included at least one princess among their ranks, and she indicated her status by wearing a gold-colored crown. They had relations with other groups, such as the rotund species known as Gorphs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3 ABY, a princess of the Titterbugs was selected as a candidate to marry Vork, the prince of a rotund species known as Gorphs. His mother, Queen Slugga, had expressed a desire to find a princess who was wealthy and well-bred. At the Gorphs' grotto, that Titterbug joined other candidates, including the princess of the Mudgubs, just outside the audience chamber. The Mudgub princess was brought through the doors first, but soon enough, the Titterbug princess was picked up and carried into the chamber by a pair of bouncing Gorph guards. Prince Vork seemed pleased with her, but Slugga did not. She ordered the princess thrown into a large hole in the grotto's floor known as \"the pit.\" Despite her fate, the Titterbug princess giggled the whole time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Titterbugs were created by writer Paul Dini for the Nelvana Ewoks animated television series. Their only appearance, \"Princess Latara,\" first aired on September 20, 1986. In the cartoon, only one Titterbug character appears on screen. Although she has no lines, her laugh is provided by an uncredited voice artist."}, {"tag": "p", "text": "No source has definitively established a Titterbug homeworld, making their origins unclear. Geonosis and the Outer Rim Worlds implies that only Ewoks and Yuzzums are native to the Forest Moon. \"Castaways of Endor\" adds only Duloks to this list and implies that all other sentients on Endor have been introduced from other worlds. According to \"Endor and the Moddell Sector,\" such introductions were relatively common due to the dual navigational hazards of a massive gravity shadow and a shield of space debris that crashed countless starships on the moon. Still, the notion that the Titterbugs were one of these \"castaway\" species—or that they were native to Endor—is not definitively supported by available source material."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}