{"url": "Battle_of_Skye", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Battles in the Varada sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Skye"}, {"tag": "p", "text": "The Battle of Skye, also known as the Battle of Marat V, was a conflict during the Clone Wars on the planet Skye."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The conflict took place during Halagad Ventor's temporary apprenticeship to Jedi General Obi-Wan Kenobi. The genetic terrorist Zeta Magnus threatened the planet with total destruction, but was foiled in his plot by Kenobi, Ventor, and Anakin Skywalker."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, Skywalker discovered the 13 year old S'kytri Kharys, who proved strong in the Force. Skywalker wished to bring the girl back for training, but Kenobi and Ventor believed she was too old to start on the path of the Jedi and refused to take her. However, Skywalker promised Kharys that he would return one day to train her. Following the end of the Clone Wars, Skywalker kept his promise and came back to Skye to take Kharys as his student, except when he did, he was no longer Anakin Skywalker, but Darth Vader, a Sith Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When this battle was first mentioned in Marvel Comics' Star Wars Annual 1, it was before The Empire Strikes Back had been released and the revelation of Darth Vader and Anakin Skywalker being one in the same had yet to be revealed. As a result, the retelling of the battle during the comic referred to Vader and Skywalker as two separate apprentices of Kenobi who had come to Skye. However, this apparent inconsistency was retconned in 2007's Aliens in the Empire. The S'kytri in the story, while recognizing Luke Skywalker's last name as the same as one of the Jedi Knights who had saved them, also mention that Kenobi's \"other\" pupil besides Vader had been someone who had worn Luke's lightsaber. Using this as reference, Aliens in the Empire had Ventor and Skywalker trading Concordance of Fealty vows before this mission, effectively switching lightsabers before the battle. When Luke believes that they are referring to his father as the one who had wielded the lightsaber, the S'kytri are actually referring to Halagad Ventor, who was wearing Anakin's lightsaber while on the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}