{"url": "Toborro", "categories": ["Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Cyborgs", "Category:Males", "Category:Supreme Moguls"], "nodes": [{"tag": "h1", "text": "Toborro"}, {"tag": "p", "text": "Toborro was a Hutt crime lord who lived during the Cold War and the resulting Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Toborro had at some point lost his left arm and a finger on his right hand. However, Toborro had rose high up into the Hutt Cartel, eventually becoming the Supreme Mogul, succeeding Karagga the Unyielding, who was killed during the siege of his palace on Nal Hutta a year earlier. As the new head of the Hutt Cartel, Toborro was paranoid and ruthless, with no tolerance for failure from his subordinates, and ever watchful for betrayal by his allies."}, {"tag": "p", "text": "Believing it to be his mandate and his destiny, Toborro sought to establish the Hutt Cartel as a dominant superpower and end the Sith Empire and the Galactic Republic, believing them to be \"lesser factions\" only fit to be slaves. The campaign was to begin on Makeb, an independent world on the border between Hutt Space and the Galactic Republic. Makeb was the only source in the galaxy for isotope-5, a rare mineral with tremendous gravity-warping properties that could be harnessed as a power source, even in small quantities. To that end, he purchased the loyalty of the InterStellar Regulators, the mercenary militia hired by Makeb's population as its defense force, to subjugate the planet. Toborro personally oversaw the operations from his palace on the surface and had no compunction with ordering the elimination of the entire planet's population to achieve his ambitions."}, {"tag": "p", "text": "Recognizing that the deep-core drilling would spell Makeb's doom, Toborro instituted \"Project Failsafe\", involving the construction of a massive starship, \"the Ark\", at a mesa known the Giant's Spear. The ship would carry Toborro, his chosen retinue, and his entire supply of isotope-5, while leaving Makeb to its fate. Republic special forces, acting at the behest of Makeb Business Council leader Shalim Avesta and his resistance movement, discovered the truth of the project at the Hutt Embassy in Talaos City, Makeb's capital, and proceeded to take control of the Ark for evacuating Makeb's citizens. After the loss of the Ark and the destruction of much of the Regulators' arsenal, Toborro unleashed isotope-5 war droids against the city of Tarlam, swearing to slaughter Makeb's people until Avesta and the Republic surrendered the Ark."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "Realizing that Toborro was mad, the Hutt Cartel leadership formally shunned him and negotiated with the Republic to escape from Makeb. Now on his own, Avesta demanded that Toborro surrender the isotope-5 fuel rods required for the Ark to fly. Toborro insanely declared that he held the ultimate power, his fortress would withstand Makeb's destruction, and that when his enemies were dead, only he would remain."}, {"tag": "p", "text": "Toborro's former chief scientist and engineer, Dr. Juvard Illip Oggurobb, had defected shortly before the remainder of the Cartel leaders, and revealed that he had installed a secret entrance into Toborro's palace, one that not even the Hutt leader knew about. The Republic forces entered the palace through the secret entrance and faced Toborro in his throne room. The fuel rods were held by an advanced isotope-5 droid, \"Toborro's Glittering Fury\". Despite the power of the advanced droid, the Republic forces did destroy it. Enraged, Toborro set his entire supply of isotope-5 ablaze, intending to destroy himself and his enemies in one fell swoop. Ultimately, Toborro was destroyed as his palace collapsed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During the Hutt invasion of Makeb, Toborro became paranoid about his rule and started to lose all sanity. As the invasion was nearing to an end, Toborro felt that the leading members of the Cartel were going to betray him. Because of this and several events, Toborro proved to lose all sanity, which Dr. Oggurobb mentioned and commented on and added that Toborro was an “inbred imbecile,” during the plot to get into Toborro's Palace."}, {"tag": "p", "text": "Prior to the invasion, at some point, Toborro lost his left arm and a finger on his right hand, which he replaced with a prosthetic claw and a prosthetic finger. Toborro also wore a type of clothing around his neck and a red-colored wrap around his right arm, something not common for Hutts to wear, however which was not the case for another Hutt leader by the name of Oruba, who wore a cap and a wrap around his torso. Toborro appeared to have dark purple skin and red eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Toborro first appeared in Star Wars: The Old Republic: Rise of the Hutt Cartel, an expansion added in 2012 to the Video game Star Wars: The Old Republic."}, {"tag": "p", "text": "The manner of Toborro's death is determined by the actions of the player. The light side choice is to simply leave Toborro to his fate, and he is killed by a series of explosions from behind his throne. The dark side option is to bring about Toborro's death personally by bringing the ceiling down on his head, crushing him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}