{"url": "Tobyl", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Coruscant Security Force officers", "Category:Galactic Alliance individuals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Tobyl"}, {"tag": "p", "text": "Tobyl was a Human male living on the planet Coruscant during the Second Galactic Civil War between the Galactic Federation of Free Alliances and the Confederation. He served as a police officer with the Coruscant Security Force along with his partner, Jat'ho. In 41 ABY, they were part of a Galactic Alliance Guard operation to capture GAG Captain Lon Shevu and Jedi Ben Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tobyl was a Human male police officer in the Coruscant Security Force during the Second Galactic Civil War between the Galactic Federation of Free Alliances and the Confederation. In 41 ABY, Tobyl and his partner, Jat'ho, were part of an operation to capture Galactic Alliance Guard Captain Lon Shevu and Jedi Ben Skywalker. After the fight, the two officers were conducting crowd control and guarding a medwagon with two wounded GAG agents when they were approached by Jedi Knights Jaina Solo and Leia Organa Solo. Needing the medwagon to pursue the GAG doomsled carrying Skywalker, Jaina told Tobyl and his partner that she was investigating their sergeant, Qade, and needed the medwagon to pursue her investigation. She also insisted that no report be written, although Tobyl was at first hesitant. Solo utilized a mind trick to convince the two officers of her story. Believing her, Tobyl and Jat'ho let her pass, and she took the medwagon. The two officers, meanwhile, returned to their crowd control duties."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tobyl was handsome, with bright white teeth, and sported a two-day growth of beard stubble at the time of the operation to capture Ben Skywalker and Captain Lon Shevu. He was younger than his partner, Jat'ho, yet reacted with more cynicism than Jat'ho toward supposed subversive activities of the Galactic Alliance Guard. When using mind tricks on Tobyl, Jaina Solo noticed that he was weak-minded, allowing her to convince him that she was GAG and allowing her to take the medwagon. In his performance ratings, Tobyl had not received the best of reviews, and the promise of a note of commendation from Jaina Solo encouraged him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tobyl first appeared in Invincible, a novel written by Troy Denning and published on May 13, 2008 as part of the Star Wars: Legacy of the Force series. The entry for Tobyl in The Complete Star Wars Encyclopedia, which was published on December 9, 2008, incorrectly lists Tobyl as a member of the Galactic Alliance Guard instead of the Coruscant Security Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}