{"url": "442nd_Siege_Battalion", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Grand Army of the Republic battalions"], "nodes": [{"tag": "h1", "text": "442nd Siege Battalion"}, {"tag": "p", "text": "The 442nd Siege Battalion was a clone trooper battalion in the Grand Army of the Republic, that served during the Clone Wars between the Galactic Republic and Confederacy of Independent Systems. Troopers of the battalion were equipped with Phase II clone trooper armor that featured green markings, and utilised vehicles such as the Infantry Support Platform and All Terrain Reconnaissance Transport. Adept at besieging enemy strongholds, they were deployed to the Trade Federation world of Cato Neimoidia in 19 BBY, during the final hours of the war."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 442nd Siege Battalion was an armor battalion of clone troopers in the Grand Army of the Republic, composed of four companies with 144 troopers in each. Members of the 442nd sported phase II clone trooper armor, decorated with bright green markings, and were typically equipped with DC-15A blaster carbines. Proficient in besieging enemy fortifications, they were equipped with vehicles such as All Terrain Reconnaissance Transports and Infantry Support Platforms that also featured green-colored markings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 442nd Siege Battalion was created to serve the Grand Army of the Galactic Republic during the Clone Wars, against the secessionist Confederacy of Independent Systems. In the year 19 BBY, they were deployed to the planet Cato Neimoidia in battle against the Separatist forces there. Alongside Jedi General Plo Koon and his wingmate Captain Jag, the battalion secured a victory for the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 442nd Siege Battalion has so far not appeared in any Star Wars media, aside from in merchandise created by Hasbro Inc. A 6-inch figure of a 442nd clone trooper was released in late 2016 with three other troopers: one from the 212th Attack Battalion, one from the 501st Legion, and a clone shock trooper. The set was originally released via Entertainment Earth. The figure's description on the site is as follows: \"Crush Cato Neimoidia! These lean mean green biological fighting machines were sent to crush the Trade Federation stronghold during the final hours of the Clone Wars.\" The 442nd clone trooper armor coloring is an exact recolor of the 212th Attack Battalion's markings. Hasbro previously released a version of the trooper in the Star Wars: The Saga Collection line; however, this falls under the Legends continuity."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}