{"url": "Tobas_Grell", "categories": ["Category:Legends articles", "Category:Galactic Republic senators", "Category:Males", "Category:Rift Alliance members", "Category:Sarkhai"], "nodes": [{"tag": "h1", "text": "Tobas Grell"}, {"tag": "p", "text": "Tobas Grell was a male Sarkhai Senator who represented his homeworld in the Galactic Senate of the Republic during the Cold War. The father of Jedi Nadia Grell, Grell was assassinated by agents of the resurgent Sith Empire as the Galactic War began at the close of the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Sarkhai native of his species' homeworld, Tobas Grell spent his younger years traveling the isolated planet exploring ruins of past civilizations lost in the dense jungles. Marrying a young woman named Maykia, Grell ended his career as an explorer when his wife became pregnant with their daughter Nadia. When his wife died in childbirth, Grell dedicated his life to his daughter and ascended to a high rank in the Sarkhai royal court to ensure that she would be well cared for. During this time Grell's daughter began demonstrating Force-sensitivity and he was forced to defend her from the superstitions of his peers and co-workers."}, {"tag": "p", "text": "When Sarkhai joined the Galactic Republic Senate, Grell was appointed as Senator for the Sarkhai planetary government. While on Coruscant, Grell and his delegation were approached by the Rift Alliance at the height of the Cold War with the Sith Empire. The Alliance, a coalition of disillusioned worlds, were successful in gaining Grell's support and funding from Sarkhai. In an attempt to mend the gap between the Alliance and the Republic, the Jedi Order arranged a meeting with Alliance leaders but did not foresee and assassination attempt by the Sith Empire."}, {"tag": "p", "text": "While the assassins were nearly successful, Grell and the other leaders were protected by the Barsen'thor of the Jedi Order who was aided by Grell's daughter, Nadia. The Alliance took advantage of the Jedi Order's protection and were able to free Balmorra. Following the successes at Balmorra, Grell spoke with the Jedi Master and told him of the situation on Attis Station, a secret installation of the Alliance's, despite the others wanting to keep it secret. Revealing his daughter's Force-sensitivity to the Barsen'thor, Grell continued to aid the Jedi in his quest to consolidate the Alliance and keep them aligned with the Republic."}, {"tag": "p", "text": "On the eve of a renewed war, Grell and the Rift Alliance were tasked with mustering an army to push back the Empire. After much research, they went to Belsavis in order to awake the sleeping army called the Esh-kha. While the Barsen'thor was planetside awaking them, Grell was on the orbital station where he would be the victim of an abduction. Followed by the Barsen'thor and his daughter Nadia, the Sith Lord Stark executed the Senator while torturing him for information about the Rift Alliance's plans."}, {"tag": "p", "text": "Having feared such a thing may occur, Senator Grell left a will with the Jedi Order before his death. At least one subject was concerning the Institute of Xenozoology, while the final part of his will concerned his daughter. Requesting that his ally the Barsen'thor of the Jedi Order take his daughter under his tutelage, Grell hoped that Nadia would grow to become a Jedi Knight. In line with Sarkhai law, Nadia Grell inherited her father's seat in the Senate as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}