{"url": "Togorian/Legends", "categories": ["Category:Legends articles", "Category:Feline sentient species", "Category:Mid Rim species", "Category:Togorians"], "nodes": [{"tag": "h1", "text": "Togorian"}, {"tag": "p", "text": "The Togorian people were a feline warrior species native to the planet Togoria. They were known for their association with the Mandalorians, and the unique cultural divisions between their sexes. Both male and female Togorians were also noted for their strong sense of honor."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "As a species, they were large bipeds, with retractable claws on their hands and feet. Female Togorians were up to 2.2 meters tall, while adult males ranged up to 3.0 meters. They were covered in gray-white to black fur, often with more colorful spots or stripes. They had extremely dense bone tissue, allowing them to endure greater physical trauma than beings with similar physiques."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Togorians evolved as nomadic hunters of creatures like the bist and etelo. In turn, flying reptiles called liphons preyed upon the Togorians. Primitive Togorians noticed that slightly smaller flying reptiles, mosgoths, were also targeted by liphons who attacked their nests and stole their eggs. Togorians began camping near the mosgoths for mutual protection, eventually domesticating them as mounts. Soon, a rift in their society developed—while males wanted to continue their lifestyle as nomads, females wanted the comfort and safety of permanent camps. In other species, the conflict would have led to one lifestyle winning over the other, but both male and female Togorians were too stubborn."}, {"tag": "p", "text": "Eventually, the males continued their nomadic ways, riding their mosgoths and hunting, and competing in contests of prowess. Meanwhile, the females stayed in villages with pre-pubescent children, with those communes eventually growing into cities. While the males continued to hunt in the wilderness, the females tended domesticated herds and developed technology. Males would visit their mates for about a month each year, but the sexes lived completely separate lives otherwise. Whether in spite of the separation of the sexes, or because of it, Togorians were monogamous, and devoted to their chosen mates."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Togorians were first discovered by galactic society when the Mandalorians tried to conquer Togoria. When the Togorians united to defend their planet, the Mandalorians were so impressed with the Togorians' fighting tactics and techniques that they recruited them. These Togorians were among the first non-Taung or non-Human people to join the Mandalorian ranks. When the Mandalorian Neo-Crusaders were defeated, some Togorians turned to mercenary work, bounty hunting, and joining space pirate colonies organized and controlled by the Hutts."}, {"tag": "p", "text": "In 32 BBY, a band of Togorian pirates used their bulk freighter and decoy space cruiser to lure the Scimitar, the Sith Lord Darth Maul's Sith Infiltrator, into a trap. Maul was on his way to Tatooine to complete an important mission given him by Darth Sidious—to first track, then eliminate the two elusive Jedi ambassadors to Naboo, Qui-Gon Jinn and Obi-Wan Kenobi, before capturing Queen Amidala and returning her to her homeworld, where she would be constrained to sign a treaty with the Trade Federation, making its invasion and occupation of the planet \"legal\". It was then, as Maul came out of hyperspace above Tatooine, that the Togorians attacked. After the ambushers aboard the pirate cruiser were sent to search, plunder, and retrieve Maul's ship, they found it devoid of passengers, and their captain commanded them to return to the freighter; indeed, the Zabrak assassin had jettisoned his personal escape pod to evasively infiltrate and attack the occupants of the larger pirate vessel, killing all on-board including its captain. Darth Sidious was adamant regarding Maul's critical clandestine mission, that there were to be no witnesses to Maul's presence in Tatooine space. One lingering pirate assailant, Hela-Tan, viciously fought with Maul even as the Sith Lord, having at last recovered the Scimitar, was executing his escape from the pirates' docking bay, to continue his mission to Tatooine. The pirate succeeded in administering a brutal wound to Maul's leg before the Togorian himself was sucked into space by the explosive blast of the Togorians' Sith-sabotaged freighter, which had detonated upon its bridge crew's ignition of its engines."}, {"tag": "p", "text": "During the Clone Wars Togorians aided General Grievous in the Battle of Togoria. In the final days of the Galactic Republic, a Togorian Jedi youngling escaped Order 66."}, {"tag": "p", "text": "During the Imperial era, they were ruled by a male hereditary monarch, titled the \"Margrave of Togoria\". The Margrave lived like any other nomad, save only that it was a great honor to be allowed to pitch a tent in his camp. Either his wife or a close blood relative governed the female population from the city of Caross, which was effectively the planetary capital."}, {"tag": "p", "text": "Males rarely left their homeworld, though a few were pirates and mercenaries, or were unwillingly forced offworld to search for a missing mate. Since the only offworlders they met were smugglers, pirates, or slavers, they considered most of them no better than rossorworms. They found droids and Imperial stormtroopers (or \"Metal Men\" and \"White Shells\", as they called them) particularly objectionable. Offworlders on Togoria found trespassing outside Caross would be returned to the females of Caross to be dealt with. On a second offense, they were staked out for the liphons to eat. Despite this, male Togorians could be amiable towards offworlders, especially those not dependent upon technology. Han Solo and Mammon Hoole were among those who were honored by the Togorians. Solo was once invited by the Margrave to stay on Togoria and hunt with the males, while Hoole even pitched his tent in the Margrave's camp (though the Shi'ido sentientologist may have been taking the form of a Togorian at the time.)"}, {"tag": "p", "text": "Female Togorians, on the other hand, were willing to deal with outsiders. They stereotypically enjoyed luxury, though not to the point of decadence, and tended to be acquisitive, industrious, and cunning. Females who could afford it often rewarded themselves with a few years on resort planets such as Bespin or Ord Mantell. The females had developed fairly high technology on their own, showing expertise in solar energy. By the Imperial era, they had almost enough technical expertise to develop their own starships."}, {"tag": "p", "text": "Offworlders had difficulty negotiating with Togorians in order to gain access to their planet's natural resources, so their trade was limited. Female Togorians were, however, a valuable market for comlinks, datapads, small droids, and other small electronics and luxuries. Mastercrafted scimitars or \"sc'rath\" produced by male Togorians fetched high prices on offworld weapons markets. Both sexes, however, preferred to walk or ride mosgoths rather than ride vehicles."}, {"tag": "p", "text": "Han Solo's friend Muuurgh and his mate Mrrov were Togorians, as well as the Jedi Bhixen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}