{"url": "Tofen_Vane", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Aces", "Category:Confederacy of Independent Systems individuals", "Category:Force Adepts", "Category:Humans", "Category:Males", "Category:Royalty"], "nodes": [{"tag": "h1", "text": "Tofen Vane"}, {"tag": "p", "text": "Tofen Vane was a Force-sensitive Human male from Valahari and a member of the House of Vane that sided with the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tofen once podraced against Republic hero Anakin Skywalker, but later joined the Confederacy of Independent Systems after his father, Harko Vane, died in what looked as Republic attack—which was secretly orchestrated by Count Dooku as part of winning Valahari and the House of Vane, of which Dooku was an old friend, over to the side of the Separatists—and become a hero of the war himself."}, {"tag": "p", "text": "When Tofen proved highly successful and relentless in his pursuit of the Republican forces, Anakin engaged him in a dogfight to try and talk some sense into him. Both shot each other out of the sky and crash-landed on a nearby moon, and in their following confrontation, Anakin finally managed to raise first doubts in Tofen. But even after his mother, Elodore Vane, confronted her son with concrete evidence that Dooku was responsible for his father's death, Tofen refused to give up his determination to fight the Republic."}, {"tag": "p", "text": "In the subsequent Battle of the Veil Nebula, Tofen engaged Anakin in a dogfight once more. However, during their battle the thrusters of Tofen's fighter were critically hit and finally burned out, setting his fighter aflame. Anakin desperately towed the burning fighter aboard a Republic cruiser and raced to save Tofen's life, but his burns were too severe. Before expiring in Anakin's arms, a repentant Tofen asked Anakin for justice for his father's death. Soon afterward, the Count was gracelessly banished by Elodore Vane."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tofen Vane is modeled on Manfred von Richthofen AKA the \"Red Baron,\" a famed pilot of World War I. Vane is piloting a red craft much like the Red Baron, while his uniform displays decorations similar to those of the Imperial German Luftstreitkräfte."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}