{"url": "Togruta/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Enslaved species", "Category:Expansion Region species", "Category:Mammalian sentient species", "Category:Togruta"], "nodes": [{"tag": "h1", "text": "Togruta"}, {"tag": "p", "text": "Togrutas were a carnivorous humanoid species from the planet Shili. The species exhibited head-tails which were similar to those of Twi'leks. Unlike Twi'leks, a Togruta's Head tails are part of their Montral and ran parallel to the head as opposed to behind, making it appear as though they were wearing a headdress. Togruta were also distinguished by montrals, large hollow horn-like projections from the top of their heads, that gave the species a form of passive echolocation. In order to protect themselves from dangerous predators, and to hunt their own prey, Togruta banded together in tribes and relied on their natural pigmentation to disrupt and confuse slow-witted beasts. Togruta worked well in large groups, and individualism was seen as abnormal within their culture, although it was also a necessary quality in leaders."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Togruta had rusty skin tones ranging in hue from blue to red to green, with white pigmentation on their faces, and greyish lips. While not all had this feature, white stripes also adorned various parts of their bodies, including their chests, legs, backs, arms and montrals, which included the horns to the lower head tails (not to be confused with the Lekku of Twi'leks). The pattern of stripes varied from individual to individual. This red and white pattern was a phenotype left over from their ancestor's camouflage that helped them to blend in with their natural surroundings, especially the red-and-white turu-grass which dominated Shili's scrublands. They possessed many humanoid features."}, {"tag": "p", "text": "Their heads bore two montrals, with three, and on rare occasions, four big head-tails, whose stripes were darker than those of the montrals. Togruta had the ability to sense the proximity and movement of physical objects around them by means of their hollow montrals, which detected space ultrasonically. Young Togrutas' montrals and posterior head-tail did not fully grow until adolescence, when their montrals became curved and their third head-tail grew to the length of their two main head-tails."}, {"tag": "p", "text": "As predators, Togruta had sharp canine teeth, which they used to painlessly kill thimiars, their primary prey, causing the creatures' post-mortem death spasms. This gave outsiders the false impression that Togruta were venomous. However, Togrutas did nothing to dispel this misconception and even took advantage of the intimidating presence it gave them."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "Togruta had a strong sense of unity and togetherness. On their native homeworld of Shili, they relied on each other and would band together to take a stand against the massive monsters that hunted them, such as the akul. It is said that the creatures of Shili most often attacked in groups, which was even more reason for the native Togruta to work together. While most of Shili was covered in the scrublands where the Togruta hunted their herbivorous prey, the Togruta lived in small communities in the forest valleys, where the canopies kept them out of sight."}, {"tag": "p", "text": "Togruta were known for their habit of not wearing shoes; they believed that the land was spiritually connected to them, and wearing shoes cut themselves from a bond with the land. In the pack, every able Togruta was expected to contribute his or her own share, as any food attained was distributed equally. Togruta were also known for their belief that those who could not keep up should be left to fend for themselves, because that is nature's way. Other sentient species found this particular belief quite barbaric. Those within a pack who led had a difficult time with fulfilling their goals because of the risk of becoming individualistic. As hunters, the Togruta showed off the pelts and teeth of their game as a sign of pride and maturation. Special pride was taken in the teeth of akul that a Togruta had taken down as an individual. These teeth often were made into jewelry such as an akul-tooth headdress or a necklace, which also incorporated metals, stones, and pearls found on Shili. Other Togruta, such as Shaak Ti, wore the Togruta sash with their Jedi apparel. Togruta spoke the Togruti language, which had a few elements of Basic."}, {"tag": "h3", "text": "Personality"}, {"tag": "p", "text": "Togruta were tranquil and silent, though when the situation called for it they were true warriors. Their fidelity to their beliefs was legendary, as was their happiness within large groups. Togruta, not surprisingly, excelled at teamwork and the ability to associate with different cultures. To an extent, Togruta had an aversion to isolation and made efforts to have friends around for companionship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Togruta were discovered by 25,000 BBY.[source?] At some point in their history they established a major pacifist colony on the planet Kiros. During the Old Republic era, the species orchestrated the Togruta Uprising, an event later pacified by Grand Moff Kilran. Togruta as a whole possessed a special affinity for the Force, though they had slightly less than the normal number of midi-chlorians. It was believed that this affinity was produced from their heightened spatial awareness imparted by their montrals and their role as hunters. Their sense of spiritual connection with the land also heightened their connection with the environment, thus leading to a greater ability to feel the Force. The species had contributed members to the Jedi Order practically since its beginning. A majority of the Togruta species within the Jedi Order were females, though males were not unheard of."}, {"tag": "h2", "text": "Togruta in the galaxy"}, {"tag": "p", "text": "One of the earliest known Togruta in the Jedi Order was Jedi Master Raana Tey, a member of the Jedi Covenant, who participated in the Padawan Massacre of Taris early in the Mandalorian Wars."}, {"tag": "p", "text": "During the Clone Wars one of the most well known Togruta was Shaak Ti, a member of the Jedi High Council, who participated in many of the battles during the war. Ti was one of the few survivors of the First Battle of Geonosis and helped save Anakin Skywalker, Obi-Wan Kenobi, and Padmé Amidala from execution. Shaak Ti also protected Supreme Chancellor Palpatine, though she was unable to prevent his capture by General Grievous. Ti survived Order 66 and went into exile on Felucia where she trained her apprentice Maris Brood. Another Togruta Jedi during the Clone Wars was Ahsoka Tano, the Padawan of Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "Other Togruta padawans during the Clone Wars were Ashla, a member of the Bear Clan trained by Yoda, Deran Nalual, a Padawan that survived the initiation of Order 66, and Codi Ty, a male Togruta who saved a number of younglings from General Grievous, though he was expelled for seeking vengeance."}, {"tag": "p", "text": "Records indicated that there were no known Togruta within the early New Jedi Order, though at least one youngling survived the Massacre at Ossus along with Asaak Dan, a male Togruta Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}