{"url": "Togruta", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Expansion Region species", "Category:Mammalian sentient species", "Category:Togruta"], "nodes": [{"tag": "h1", "text": "Togruta"}, {"tag": "p", "text": "Togrutas were a sentient humanoid species, characterized by their colorful skin tones, large montrals, head tails, and white facial pigments. They hailed from the planet Shili, in the Expansion Region. Although Shili was their homeworld, they also had a colony of some 50,000 individuals on the planet Kiros, and in the Expansion Region. Some well known Togruta included the Jedi Master Shaak Ti, Jedi Master Jora Malli, Supreme Chancellor Kirames Kaj, and Padawan Ahsoka Tano."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Native to the Expansion Region planet Shili but later found throughout the galaxy, Togrutas were a species of sentient humanoids whose skin spanned a vast array of colors, including, but not limited to, orange, green, red, white, and yellow. These characteristics were a result of evolution; Togruta coloration was helpful as a method of camouflage from predators. Unlike most humanoids, Togrutas were known to have multiple stomachs, however, their most notable features were the large organic head formations upon their heads; two large cone-like horns called montrals atop their skull, and three lekku, also known as headtails, that sprouted downward. Both a Togruta's lekku and montrals tended to grow until they reached maturity, with females generally having longer lekku than the males. A Togruta's montrals allowed them to sense the movement of objects around them through echolocation, and could sense up to 82 feet."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Togruta's habitats were usually in mountainous and elevated areas. One instance of this was the Togruta immigrants on the colonies on Kiros, which were built on the cliffs. These homes were built in the pursuit of art and beauty. Togruta spoke Galactic Basic Standard and their native language, Togruti."}, {"tag": "p", "text": "A government of the Togruta was established on Shili, and could be led by a queen. A queen of the Togruta government on Shili was also bestowed the titles of Regasa of Shili, Supreme Huntress of the United Tribes, and Ruler of Togrutas. The government consisted of the Togruta military and the Togruta guard. The Royal Togruta Fleet consisted of many Togruta warships, and the military forces were additionally bolstered by the intelligence services and the security council. The Togruta maintained a royal court, and the government employed the position of ambassador and multiple ministers. Conversely, the Togruta on the artisan colony on Kiros built their society without weapons, choosing instead to pursue art and beauty rather than war."}, {"tag": "p", "text": "Shili was known to produce famously melodramatic holovids. One of the signs in Shili's zodiac system was called Ai. Its traits were wisdom, charisma, and exceptional virility. The constellation representing that sign was formed from blue dwarf stars, and a being born under Ai also had the sign Genry on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "High Republic Era"}, {"tag": "p", "text": "During the High Republic Era, the Togruta on Shili were presided by the monarchial government led by Elarec Yovet, the Togruta queen. By this time, the Togruta were not members of the Galactic Republic, and Jedi Master Stellan Gios believed that the only obstacle in the Togruta declaring an open conflict against the Republic was the Togruta's respect for the Jedi Order. Jora Malli was a Togruta who was a Jedi Master, serving within the Order's Jedi High Council, although she was killed during the Battle of Kur. Supreme Chancellor Lina Soh's achievements in diplomacy brought forward a Togruta delegation, with Regasa Elarec Yovet, to visit the Republic Fair as part of Soh's Great Works."}, {"tag": "p", "text": "Following the Nihil attack on Valo during the Republic Fair, the Royal Togruta Fleet and military personnel responded to the crisis, bolstering Republic forces and driving back the Nihil. In the aftermath, Regasa Yovet sought to create an alliance with the Republic and potentially establish stronger ties, despite opposition in the Togruta government."}, {"tag": "h3", "text": "Fall of the Republic Era"}, {"tag": "p", "text": "Eventually, in 40 BBY, the Togruta Kirames Kaj was the Supreme Chancellor of the Galactic Republic. Several Togruta were part of the Jedi Order in the time following the Invasion of Naboo, including Jedi Master Shaak Ti and the Jedi Initiate Ashla. Shaak Ti was placed as the overseer of Republic clone trooper training on Kamino."}, {"tag": "p", "text": "During the Clone Wars, the Togruta were brought at the forefront of the conflict at one point with the Battle of Kiros and subsequent Battle of Kadavo. These battles were effects from the Zygerrian Slave Empire's efforts to expand slavery operations with the support of the Confederacy of Independent Systems. Zygerrian and CIS forces occupied the neutral artisan colony on Kiros and enslaved the 50,000 Togruta inhabitants, including Governor Gupat Roshti. Grand Army of the Republic forces later arrived to the deserted Togruta settlement, destroying the Separatist Droid Army forces and defeating the Zygerrian commander. The Jedi Generals Obi-Wan Kenobi and Anakin Skywalker undertook a mission to Zygerria in an effort to locate the missing Togruta colonists. They were assisted by Skywalker's Togruta padawan, Ahsoka Tano, who had taken part in many pivotal and climactic battles of the war including the Battle of Christophsis, the Second Battle of Geonosis, and many other conflicts. Eventually locating the missing Togruta on the Zygerrian slave processing facility, the Republic mounted an operation that liberated a number of the colonists. In the aftermath, Togruta Governor Roshti decided to join the Republic."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Following the transformation of the Galactic Republic into the Galactic Empire, Togruta Jedi were hunted down and killed. With the rise of the Empire came the rise of resistance groups, including the Partisans and the resistance group on Raada. Several Togruta were part of these groups, with Ahsoka Tano leading the Raada resistance and eventually joining the resistance movement led by Alderaanian Senator Bail Prestor Organa. Eventually, Organa's movement joined with other rebel cells and networks to form the Alliance to Restore the Republic, which was composed of many species including Togruta and fought in the Galactic Civil War."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "During the later stages of the war between the Rebel Alliance and the Empire, the Alliance transformed into the New Republic. Togruta continued to serve in the New Republic during the war, with the Togruta Auxi Kray Korbin serving as an advisor to New Republic Chancellor Mon Mothma."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}