{"url": "Todo_360/Legends", "categories": ["Category:Legends articles", "Category:Masculine programming", "Category:Second-degree maintenance droids"], "nodes": [{"tag": "h1", "text": "Todo 360"}, {"tag": "p", "text": "Todo 360, known as Todo for short, was a techno-service droid in the employ of the Duros bounty hunter Cad Bane. He helped Bane steal a holocron from the Jedi Temple with the help of Cato Parasitti, a female bounty hunter. He was destroyed in a ventilation shaft that lead to the communications room of the temple as a decoy for his master to get the holocron. Todo was later rebuilt by Anakin Skywalker, escaped, and rejoined Bane. He assisted Bane in capturing C-3PO and R2-D2 to extract data concerning the Senate Building's floor plans."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Finding a holocron"}, {"tag": "p", "text": "The droid accompanied Bane to Coruscant, where Bane secretly installed a small bomb in the droid's back in preparation for his raid on the Jedi Temple. Right when the bomb was installed in Todo 360, a doorbell rang. Though he tried to protest, proclaiming he was not a butler droid, Bane ordered him that he is what Bane says he is. Todo opened the door where Cato Parasitti was waiting. Both Todo and Bane flew to the Jedi temple undetected while Cato Parasitti, disguised as the Jedi Ord Enisence, gave Todo the coordinates of the weak point in the temple's shield. Arriving at the shield, he made a hole for both Bane and himself to go through."}, {"tag": "p", "text": "As they entered through the ventilation shafts, Todo 360 managed to deactivate the first fan but failed to find and turn off the second fan. As a result, the security system activated the first fan sending both Bane and Todo 360 back to the first fan. The fan was deactivated when Cato Parasitti deactivated both fans, allowing them to go further into the Jedi Temple. After Cato Parasitti, now disguised as Jocasta Nu deactivated the first set of lasers, Todo 360 and Bane worked together to deactivate the 2nd set of lasers. Though they were successful, Bane could hear the approaching footsteps of Anakin Skywalker and Obi-Wan Kenobi. Using Todo 360 as bait, Bane sent Todo 360 down to the communications room."}, {"tag": "h3", "text": "Destroyed"}, {"tag": "p", "text": "Expecting no one to be at the communications room, Todo 360 broke through the access hatch, finding Mace Windu, Yoda, Kit Fisto and Aayla Secura in the room. Todo then made up an excuse of testing the access hatch. Meanwhile, Obi-Wan and Anakin were behind him in the hatch. At that moment, unbeknownst to him, the back of Todo 360 started beeping and Mace Windu sensed the bomb on his back ticking. Windu then Force pushed Todo in to the ventilation shaft. Obi-Wan and Anakin too, tried to run from the bomb. Todo 360 wailed helplessly before the bomb exploded. With the distraction of Todo 360's destruction, Cad Bane successfully managed to steal and escape with the holocron."}, {"tag": "h3", "text": "Rebuilt, and ready to serve"}, {"tag": "p", "text": "After his destruction, he was rebuilt by Anakin Skywalker in hopes of finding out more about Bane, but the plan went wrong, and Todo escaped from the Jedi. He then came back into the possession of Bane. Bane had been hired by Jabba Desilijic Tiure to obtain floor plans to the Senate Building. Once Bane determined that he could get the information from Padmé Amidala's protocol droid, C-3PO, he instructed Todo to separate him from his counterpart, R2-D2. Todo approached the duo and proceeded to advertise a nearby droid spa. R2-D2 quickly entered the spa, and Todo pushed C-3PO into a nearby RGC-16 airspeeder, piloted by HELIOS-3E. The two flew off and brought C-3PO to Bane. Bane and J0-N0, an 8D smelter droid, tortured C-3PO until they realized that he did not have any useful information. Todo and HELIOS-3E tracked down R2-D2, and after a brief chase, captured him and extracted the information. They partially wiped the memories of the droids and dumped them on the street. Bane would later be hired by the Hutt Ruling Council to free Ziro Desilijic Tiure from prison."}, {"tag": "h3", "text": "Testing the new recruits"}, {"tag": "p", "text": "Under the pretense of interviewing him for a job, Bane lured Davtokk, a fellow bounty hunter, to Keyorin around 21 BBY to test the abilities of his new posse by pitting Davtokk against them. Bane sent Todo to guide Davtokk to the proper meeting place, though the latter refused, offering a tip for the droid's master. Later, after Davtokk had been apprehended by Robonino, Shahan Alama and Aurra Sing, Todo was at Bane's side as he emerged from the shadows and ended Davtokk's life."}, {"tag": "h3", "text": "Hunting for Ziro"}, {"tag": "p", "text": "After Cad Bane freed Ziro from prison, he and Todo brought him to Nal Hutta and presented him to the Hutt Grand Council. Obi-Wan Kenobi and Quinlan Vos arrived not long after, hot on Ziro's trail. With the help of Sy Snootles, Ziro escaped, but was quickly followed by the Jedi. Todo and Bane overtook the Jedi and learned from Ziro's mother that he and his girlfriend had taken her starship and gone to Teth. When Todo and Bane arrived on Teth, they found Ziro's corpse and were themselves found by Kenobi and Vos. The two factions attacked each other, the Jedi in an attempt to bring Bane to justice, and Bane in the hopes of receiving a million credit reward for each Jedi. In the ensuing fight, Todo at one point saved Bane's life by tugging at Vos's braids. Shortly after, he snatched his lightsaber and swung it at Kenobi, who dodged and stole it from him. Todo 360 and Bane gave up the fight and fled in the Xanadu Blood, with Todo taking care to retrieve Bane's hat from where it had fallen when it had been knocked off."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Todo 360 was a techno-service droid, and was proud of it. He was often angry declaring that he was not meant to do menial tasks, such as collecting money and answering doors. He was also sarcastic, making quips about Cato Parasitti's remarks to him and ironically thanking C-3PO and R2-D2 for the memories that Todo and Bane stole from them. Todo was extremely loyal to Bane even though the Bounty Hunter had blown him up without remorse whilst stealing a Jedi Holocron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Todo was voiced by Seth Green in \"Holocron Heist,\" the premiere of Season Two in the Star Wars: The Clone Wars television series. Todo 360's ironic farewell of \"thanks for the memories\" in the episode \"Evil Plans\" to C-3PO and R2-D2 is a nod to the 1938 hit song of the same name made famous in The Big Broadcast of 1938 and as actor-comedian Bob Hope's signature song."}, {"tag": "p", "text": "Todo was manufactured on the planet Vertseth. The planet's name is a nod to Seth Green, \"vert\" being \"green\" in French."}, {"tag": "p", "text": "The pet droid T0-D0 in the Star Wars: Clone Wars Adventures video game has a personality and model based on Todo 360."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}