{"url": "Tognath", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Insectoid sentient species", "Category:Mammalian sentient species", "Category:Oviparous species", "Category:Sentient species", "Category:Tognath"], "nodes": [{"tag": "h1", "text": "Tognath"}, {"tag": "p", "text": "Tognath were a sentient species that were native to the planet Yar Togna. The Tognath had a striking look thanks to their insectoid and mammalian characteristics; another factor was their having both an endo- and exoskeletons. They also possessed a very primitive nervous system, which provided them with immunity to most pain (a helpful trait in combat). The mercenaries Edrio and Benthic \"Two Tubes\" were members of this species."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "An ancient species who evolved on the high-gravity volcano world Yar Togna, the Tognath were humanoid beings with both insectoid and mammalian characteristics. Tall and gaunt, the Tognath were a distant genetic relative of the Kel Dor and Gand species; though scholars could not determine whether this relationship was evolutionary or the result of experimentation. Their skin was fleshy and pallid, with a hairless exoskeleton helping to resist the atmospheric pressure of their homeworld. Their compound eyes had no lids, and their vocal cords helped to produce a deep, low voice that was nearly impossible for other species to hear without assistance."}, {"tag": "p", "text": "Tognath larvae were hatched from a clutch of eggs that were nurtured in a suspension jelly. While in that jelly, two or more eggs (not necessarily from the same parent) were sometimes grafted together, thus creating a bond that continued throughout the life of the eggmates. When the parasitic larvae emerged, they latched onto one of their parents to feed directly from the bloodstream of their sire for six months. After attaining the nutrient-support necessary, the larval Tognath were taken to a nursery tree where they would spin a cocoon within which they would undergo metamorphosis. For months, the Tognath youth would grow both an endoskeleton and an exoskeleton within the safety of their cocoon, dulling their already less-sensitive nervous system. When a young Tognath emerged from their cocoon, they looked like a smaller version of their adult form."}, {"tag": "p", "text": "Tognath almost universally opted to enhance their biological functions with cybernetic modifications. Because of their dulled pain receptors, grafting metal into their flesh was an easy process. Many opted to augment their poor hearing and balance with tech and add special lenses to their eyes, as well as breathing apparatus to process the oxygen content in a planet's atmosphere."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "On the high-gravity world Yar Togna, Tognath dwelled in houses propped up on stilts over the lava channels that covered their homeworld. Coalescing around the main mountain range of their world so as to access the natural springs there, Tognath lived and worked in a tumultuous environment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The breathing apparatuses that the Tognath wear are based on gas masks used in the First and Second World Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}