{"url": "Together_Again", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Together Again"}, {"tag": "p", "text": "\"Together Again\" is the eighth episode of the seventh and final season of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ahsoka bargains for the sisters' freedom and makes a startling discovery."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ahsoka's gambit"}, {"tag": "p", "text": "Back in their detention cell in the Pyke stronghold, Rafa and Trace Martez think of plans for another escape attempt. Ahsoka Tano suggests they look at how they got there in the first place, and Rafa says that they are in this situation because Ahsoka convinced Trace to dump the spice, and if they had followed her original plan they would be back on Coruscant counting their money. Ahsoka retorts that Rafa's plan was the problem, and Trace agrees. Rafa is very upset that her sister has sided with Ahsoka against her. When they have finished arguing, Ahsoka says she has a plan, but says its better they don't know what it is. Rafa is skeptical, but Ahsoka says they need to trust each other if they're going to get out."}, {"tag": "p", "text": "Pyke guards summon the three prisoners to Marg Krim's throne room. Krim tells them that they have to make a choice: to pay their debt, or watch their friends die slowly. Ahsoka says she wants to make a deal... alone. To the Martez sisters' horror, Ahsoka tells Krim that they hid the spice off-world but she doesn't know where. She suggests the Pykes send them to retrieve the spice, giving them one rotation to return or Ahsoka will tell them the location of their family. Krim asks what she will get out of the deal, and Ahsoka replies just a small percentage of the value of the spice shipment. Krim agrees, and tells the Martezes they have one rotation to return the spice, or he will torture the information out of Ahsoka, and kill her, them and their family. As they leave, Rafa turns to Ahsoka and says \"I won't forget this.\""}, {"tag": "p", "text": "Once they have left, Fife tells Krim this is a deception. Krim agrees, but says he doesn't have much choice, and his life depends on the return of the spice as much as theirs. Fife asks if \"he\" will find out, and Krim replies that \"He knows. He always knows.\""}, {"tag": "p", "text": "Trace and Rafa board the Silver Angel and take off, watched by the three Mandalorians. Ursa Wren tells Bo-Katan Kryze that she did not scan the Jedi on the ship. Bo-Katan tells the other two to keep watch and let her know as soon as Ahsoka leaves the citadel."}, {"tag": "h3", "text": "Spice pickup"}, {"tag": "p", "text": "Refueling the Silver Angel at the Orondia Refueling Station, Trace and Rafa discuss what just happened. Trace cannot understand why Ahsoka threatened to give their family up to the Pykes as she knows they have no family. Rafa says that was the point: that Ahsoka gave herself up to release them, and that they have to help her escape or she will hold it over Rafa's head if she escapes on her own."}, {"tag": "p", "text": "Trace and Rafa fly to a Pyke loading facility, where Rafa calls ahead and tells them they are a transport on the way for a spice pickup. A Toong spice worker responds that he has no record of their shipment, and Rafa says she will clear up the mix-up when they arrive."}, {"tag": "p", "text": "They land, and the Toong reiterates he has no authorization to give them the spice. Rafa bluffs and tells him it is a rare \"special request\" order from \"up top\". As the Toong runs to look for his boss, Rafa orders the other workers to load the spice."}, {"tag": "p", "text": "The Toong confirms there is no mention of spice on the ship's manifest and his manager says this is highly irregular. Rafa demands to see the manager, and is yelling at the Toong when the manager, a Trandoshan arrives. He demands to see the manifest, and grabs Trace, causing Rafa to hit him with a pipe to no effect. Trace fights with the Toong, while Rafa takes on the much stronger Trandoshan. As they fight on a loading gantry, the Trandoshan holds Rafa up to throw her to her death, but she grabs onto the frame and disconnects the gantry, sending the manager plummeting to his death below. The sisters board their ship, now loaded with spice, and take off back to the Pyke stronghold."}, {"tag": "h3", "text": "A secret meeting"}, {"tag": "p", "text": "The guards place Ahsoka back in her cell. As soon as they leave, she uses the Force to open the door and sneak out. She makes her way to a refinery where the Pykes are processing the spice, then locates an armory and loads up with some thermal detonators."}, {"tag": "p", "text": "Ahsoka makes her way through the refinery, placing detonators on the silos. She hears Marg Krim's voice, and looks up to see the Pyke leader speaking to a hologram of Maul, assuring him that they can proceed as planned despite the delay. Maul says that although the Pykes are a small piece of the mechanism he has designed, their failure jeopardizes everything. Krim responds that the Republic is cracking down on his operations, and had recently raided a shipment on Coruscant. Maul asks if the Jedi were involved, and Krim says none of his men made it out, which Maul says means that they were. He tells Krim that if there are any more delays, Crimson Dawn would love to take over their operations. Through the hologram, Maul senses Ahsoka's presence. She notices this and ducks out of sight just in time. Before Maul can do anything more, a guard arrives and tells them the prisoner has escaped."}, {"tag": "p", "text": "Ahsoka makes her way to the control room where she accesses the transmission log, which reveals that Maul is on Mandalore. The Pykes return and surround Ahsoka, who uses the Force and her Jedi training to fight them off, although she is eventually outnumbered and overwhelmed. Krim asks if the other two were Jedi as well, which Ahsoka denies. He says the Jedi Council will regret sending her here, and they stun her and return her to the cell."}, {"tag": "h3", "text": "Perfect timing"}, {"tag": "p", "text": "Ahsoka had been cuffed and brought before Krim, where he thanks Ahsoka for her perfect timing, saying her execution will restore the Pykes' reputation. Trace and Rafa enter, saying they have returned the spice. Krim says he knows they are working for the Republic and the Jedi Ahsoka. The sisters are shocked to learn Ahsoka is a Jedi, and demand to know why she kept it from them. As they argue, the detonators explode, shaking the room and stunning the Pykes. Ahsoka, Rafa, and Trace race to the landing platform and board the Silver Angel, but are pursued by three Pyke patrol ships. Ahsoka says she is sorry for not telling them she was a Jedi, and Rafa says she might as well use her powers and skills to shoot down their pursuers. Ahsoka takes control of the gun, shooting down two ships, but several hits from the last one destroys the cannon and rear deflector shields. Trace pilots the ship around to fly towards the last Pyke ship head on, and it swerves to dodge them, crashing into a mountain."}, {"tag": "p", "text": "The Silver Angel heads into space, followed by a Mandalorian Kom'k-class fighter."}, {"tag": "h3", "text": "Home at last"}, {"tag": "p", "text": "The Silver Angel arrives at Coruscant, travelling down the Underworld portal to Trace Martez's repair shop. Ahsoka begins to tell Trace and Rafa that she doubts the Pykes will look for them as they think Ahsoka was on a mission for the Jedi. Rafa asks if Ahsoka is going to arrest her for spice smuggling, but Ahsoka says she's not a Jedi anymore. Trace can't understand how anyone could and would walk away from being a Jedi, and Ahsoka replies it is complicated. Rafa says even though Ahsoka doesn't think of herself as a Jedi, she acts like one, or how Rafa would want them to be. Trace also thanks her, saying they got in over their heads, and Ahsoka had saved them and she considers her a friend."}, {"tag": "p", "text": "Bo-Katan enters the workshop with the other two Mandalorians. Ahsoka tells the Martez sisters to back away, and Bo-Katan removes her helmet, telling her not to worry as Death Watch is gone. She tells Ahsoka they have a common enemy, and activates a hologram of Maul. She says they need Ahsoka's help, and she has five minutes to decide. Trace says she can help the Mandalorians like she has helped them, but Ahsoka is reluctant, saying she is afraid of the path it may lead her down—back to the Jedi. Rafa says maybe that is who she is meant to be, and Ahsoka agrees, leaving her bike with the sisters \"just in case\", then boards the Mandalorian ship."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}