{"url": "Tohno", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Females", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Tohno"}, {"tag": "p", "text": "Tohno was a Human female who served as a Jedi Padawan in the waning years of the Galactic Republic. Before the Clone Wars erupted, Tohno trained under a Jedi who taught her in architecture and engineering. When the war began, she served the Galactic Republic as a commander in the Grand Army. She was assigned by Jedi Masters Mace Windu and Oppo Rancisis to accompany Obi-Wan Kenobi and his Padawan Anakin Skywalker to the planet Zaadja."}, {"tag": "p", "text": "Tohno was instructed to infiltrate a Separatist facility and plant explosives to destroy the base. While Kenobi and Skywalker used their command of clone troopers created to create a diversion, Tohno successfully penetrated the facility. However, one of the Geonosian sentries alerted the base to her presence. As she made her way to the generator room, Skywalker took an infantry gunship in an attempt to evacuate her. Tohno managed to convince Skywalker to return to Kenobi and the clones so that she could complete her mission. As she was fighting the guards, Tohno threw her lightsaber at her dropped pack of explosives, sacrificing herself to ensure the destruction of the Separatist facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tohno, a Human female, was born during the final decades of the Galactic Republic. She was trained in the ways of the Force by the Jedi Order, eventually coming under the tutelage of a Jedi Master. During her time under her Master's instruction, Tohno studied architecture and engineering. When the Clone Wars were initiated in 22 BBY, Tohno and her Master served the Galactic Republic in its Grand Army. Sometime during the early stages of the war, her master was killed, leaving her without a mentor to continue her training."}, {"tag": "p", "text": "When the Separatist Droid Army began expanding its ranks with a seemingly endless supply of droids. One of the many installations which had begun providing the Separatists with soldiers and war matériel was the manufacturing facility that had been established on the planet of Zaadja. Approximately eighteen months after the Battle of Geonosis, the Republic developed a number of plans aimed at destroying as many of these factories as possible. One of these plans called for a strike against the Geonosian plant on Zaadja. Obi-Wan Kenobi, Anakin Skywalker, and Tohno were sent along with an army of clone troopers to gain control of the manufacturing world."}, {"tag": "p", "text": "The Republic's order of battle was developed and approved by Masters Mace Windu and Oppo Rancisis; to act as a diversion, Kenobi and Skywalker were tasked to lead a large scale attack against the Separatist forces on the planet, while the primary mission was given to Tohno. Her task was to infiltrate the Geonosian facility which was acting as both the planet's headquarters and the droid factory, and destroy it using military-grade explosives. Tohno was chosen for the mission because of her previous non-Force studies which had centered on architecture and engineering, skills that allowed her to understand and analyze the unique buildings of Zaadja and determine where best to place explosives for the greatest amount of damage. Once the first phase of infiltration was successful, the second phase of her mission called for her to get inside and determine the most vulnerable pathways and tunnels, then set explosives in positions that would bring the entire structure down swiftly."}, {"tag": "p", "text": "Tohno managed to infiltrate the fortress successfully, but soon discovered that an entire nest of Geonosians was waiting for such an infiltration to take place. Using the Force to conceal her movements, she managed to get past the majority of the nest, but she was seen by a sentry before she could set the explosives. Skywalker, who had sensed that Tohno was in danger, reassured her that he was inbound to her position with a infantry gunship. Tohno, however, ordered Skywalker and the other Republic forces to remain outside of the droid factory—despite the fact that her success in the mission would mean her own death. Although Skywalker continued to press for permission to come to her aid, Tohno convinced him that he needed to let her go in order for the mission to be successful. Skywalker reluctantly obeyed her, and although she was eventually overrun by the Geonosian guards, Tohno was able to set off the explosives which she had brought with her by using her lightsaber. Tohno sacrificed herself to ensure the destruction of the Separatist fortress."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Human female Tohno wore a set of brown Jedi robes with a red cloak. She owned a lightsaber containing a green crystal. She had green eyes, red hair, and light-colored skin. During the mission to Zaadja, the Human female Tohno demonstrated her wisdom of the Force through her interactions with Anakin Skywalker, who was allowing his emotions to guide his actions. Near the end of the mission, when Tohno was discovered by the enemy, she remained calm and collected throughout the ensuing confrontation and fought the enemy with great skill; during the fight, she warned Skywalker not to give into his emotions and to stay where he was. She believed that Skywalker's duty was to his clone troopers and the future of the Republic, not to her."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "During the mission to Zaadja, Tohno used her expertise at engineering and architecture to successfully infiltrate the Separatists' base. She also demonstrated her skills with a lightsaber, disabling hordes of enemies inside the Separatist facility on Zaadja. Tohno also possessed the Force talent of telekinetic lightsaber combat. Her infiltration of the droid factory during the mission to Zaadja allowed her the opportunity to utilize that talent when she was confronted by several large groups of Geonosians. During her final stand in the Zaadja factory, Tohno used the Force to hurl her lightsaber at her pack of remaining explosives, causing a chain reaction which destroyed the entire compound."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tohno was created by Randy Stradley for the standalone comic Forever Young, the sixty-seventh issue of the Star Wars: Republic comic series. She was drawn by Brandon Badeaux. Tohno was mentioned in The Complete Star Wars Encyclopedia's entry on the planet Zaadja."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}