{"url": "Battle_of_Starkiller_Base", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the First Order–Resistance war", "Category:Battles of Ilum", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Starkiller Base"}, {"tag": "p", "text": "The Battle of Starkiller Base, also referred to as the attack on Starkiller Base, the raid on Starkiller Base or the assault on Starkiller Base, was the first major battle fought between the First Order and the Resistance during the war between the two factions."}, {"tag": "p", "text": "The battle was fought in 34 ABY with First Order TIE fighters and Resistance T-70 X-wing starfighters. The goal of the Resistance fighters was to disable and destroy the Starkiller Base superweapon in order to prevent the First Order, which was charging its primary weapon, from destroying the Resistance base on D'Qar and continuing a reign of terror."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During their search for Luke Skywalker in 34 ABY, the First Order sought to use Starkiller Base to destroy the Resistance and cripple the New Republic. They first tested the weapon on the capital of the New Republic, Hosnian Prime, and four other planets in the Hosnian system. They were successful, destroying the planets and a New Republic fleet."}, {"tag": "p", "text": "On Takodana, Kylo Ren realized that the scavenger and Resistance ally Rey was Force-sensitive. During the Battle of Takodana, he captured her and took her to Starkiller Base for interrogation. However, the interrogation backfired when Rey ended up probing Kylo's mind and discovering his fear of never becoming as great as his grandfather, the infamous Imperial enforcer Darth Vader, forcing him to leave to seek out his master Snoke's guidance. He then returned to attempt to continue the interrogation, but Rey had already escaped via manipulating the stormtrooper tasked with guarding her into releasing her. This angered Kylo enough that he destroyed the interrogation room in a rage-fueled tantrum, causing two patrolling stormtroopers to back away when they noticed the commotion."}, {"tag": "p", "text": "By tracking the path of the weapon's energy beam, the Resistance traced it to its origin. Jessika Pava designed a recon pod that was piloted by Temmin Wexley to scout the superweapon. The pod was towed to and from Starkiller Base by Wexley's wife, Karé Kun, in her X-wing. The First Order were able to track the X-wing back to D'Qar."}, {"tag": "p", "text": "At the same time, members of the Resistance's J-Squadron were tracking their captured member Jo Jerjerrod. By tracking the coordinates of a captured TIE/vn space superiority fighter, they arrived at Starkiller Base and landed, sneaking into the base."}, {"tag": "p", "text": "Finn had given Starkiller Base's blueprints to the Resistance, which revealed that the superweapon drained the energy of the sun in order to charge its primary weapon, and that it required a thermal oscillator to sustain the energy on the planet. If this thermal oscillator was destroyed, it would destabilize the planet's core and implode the base. However, they would need to do it before Starkiller Base fully charged its primary weapon. Finn, Han Solo, and Chewbacca volunteered to disable Starkiller's defensive shield from the inside."}, {"tag": "p", "text": "Han Solo piloted the Millennium Falcon to Starkiller Base accompanied by Chewbacca and Finn. Their objective was to disable the shields and allow the X-Wing squadron to strike, although Finn's main objective was to rescue Rey. Flying through the shields at lightspeed, the Falcon made a rough landing on Starkiller Base at the edge of a cliff."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "The ground assault"}, {"tag": "p", "text": "Han, Chewbacca, and Finn snuck into the main base and captured Captain Phasma, whom they forced to disable the shields before disposing of her in a garbage chute. They reunited with Rey, who had already escaped on her own. Upon leaving the base and seeing the aerial assault, Han, Chewbacca, Finn, and Rey realized the Resistance squadrons needed assistance and decided to create an opening by planting thermal detonators inside the base."}, {"tag": "p", "text": "When Han pointed out that there was no way to enter the oscillator in order to plant the bombs, Finn offered to find a way to open a doorway via a conventional junction as his previous experience working on Star Destroyers had given him knowledge in this area. He and Rey then approached a parking area where they commandeered a lone snowspeeder and set off towards the junction as Han and Chewie headed for the nearest structure. A single stormtrooper in the area spotted their snowspeeder and attempted to shoot them down. After his shot went awry, he then reported in the incident."}, {"tag": "p", "text": "As Finn and Rey raced to the junction, they were pursued by three other snowspeeders. After briefly exchanging fire with the enemy, Rey ordered Finn to head towards the trees. There, Rey asked Finn to switch places, which led to Finn taking command of the blaster while Rey flew the speeder. With one shot Finn was able to eliminate one of their pursuers from the fight. A short while later, a second shot from Finn was able to take out the second of their pursuers. As they approached a cliff, Finn's engagement with the last of their pursuing party led to him dropping the blaster into the snow, leaving them almost defenseless. Thanks to Rey's expert manuevering however, they were able to jump between cliffs and leave the last of their pursuers overturned in the snow. Finn and Rey then continued onwards to their target."}, {"tag": "p", "text": "Upon arriving at the junction, Rey quickly went to work. Within a very short span of time she managed to rig the junction properly, leading to a service hatch opening upon the complex Han and Chewie were sneaking within. Han and Chewie then planned a proper strategy to make maximum use of the explosives at their disposal before getting to work."}, {"tag": "p", "text": "Han then confronted Kylo Ren on a bridge over a large pit, pleading with his son to reject Snoke and return to the light side of the Force. However, Ren refused and impaled his father with his lightsaber. Han lovingly stroked his son's face before he plummeted down a shaft as Finn, Rey, and Chewbacca looked on. Kylo Ren felt weakened and horrified by his actions. An enraged Chewbacca injured Ren with his bowcaster and proceeded to shoot down several stormtroopers. Chewbacca then detonated the explosives, which created an opening for the base's thermal oscillators."}, {"tag": "h3", "text": "The aerial assault"}, {"tag": "p", "text": "With the shields down, Blue Squadron and Red Squadron, led by Poe Dameron as Black Leader, commenced their assault. All starfighter squadrons locked their S-foils in attack position to initiate the strike on Starkiller Base's thermal oscillator. General Armitage Hux, seeing the fleet from outside, ordered to dispatch all TIE fighter squadrons. The X-wing starfighter squadrons successfully executed one bombing run of the thermal oscillator, hitting it directly but causing no damage towards it, but then the TIE fighters were upon them. During the battle that ensued between the opposing fighters, a heavy cannon emplacement launched a missile that destroyed an X-wing fighter. With ten minutes left until the weapon became fully charged, half of the Resistance fleet had already been destroyed. The thermal detonators, triggered by Chewbacca, activated in the base, and a new hole to the oscillator was visible to the fighter squadrons. Red Four and Red Six covered Poe while the rest of the squadron focused on firing on the target. As the squadrons soared through the trenches of the base with the First Order TIE fighters and turbolasers trying to block the assault, Ello Asty's X-wing was shot down."}, {"tag": "h3", "text": "J-Squadron and Jerjerrod"}, {"tag": "p", "text": "J-Squadron was able to locate Jerjerrod during the infiltration. They fought a number of stormtroopers, and stole a Griffin-class light shuttle to escape. The officer Wanten, who had been tracking them, tried to intercede but was killed by the shuttle. After rendezvousing with the X-wing fleet, Commander Dameron let the shuttle take the lead back into hyperspace."}, {"tag": "h3", "text": "Duel with the Knight"}, {"tag": "h4", "text": "Kylo Ren vs Finn"}, {"tag": "p", "text": "Finn and Rey exited the base, but were followed by Ren, who caught up with them in the forest despite being weakened by the injury he suffered from Chewbacca's bowcaster. Rey angrily called Ren a \"monster\" for murdering his own father and tried to shoot him with her blaster, but Ren knocked her out by Force pushing her into a tree. Finn, horrified, rushed over as Ren furiously called him a \"traitor\". Failing to wake her, Finn ignited Anakin Skywalker's second lightsaber. Ren claimed that the lightsaber rightfully belonged to him, but Finn challenged him to \"come and get it\" before attacking him. Despite Finn's attempts to hold his own against Ren, he was easily overpowered. Ren stabbed him in the shoulder with his lightsaber's crossguard blades and slashed him across the back, incapacitating him, but not before receiving a shoulder wound. With the duel seemingly over, he reached out for Anakin Skywalker's saber and tried to seize it with a Force pull."}, {"tag": "h4", "text": "Kylo Ren vs Rey"}, {"tag": "p", "text": "All of a sudden, and without prior warning, Skywalker's weapon flew out from the snow, and not into Ren's hand, but into that of Rey's. Ren was initially taken aback, evincing a degree of surprise and stepped rearward as the saber flew past him. Rey used telekinesis to pull Skywalker's lightsaber into her hand and proceeded to attack the Knight with a brutal barrage. Ren initially held the advantage, drawing on his rage to ignore the pain. Ren became so impressed with Rey that he tried to tempt her, complimenting her strength in the Force and offering to complete her training if she would join him. This backfired, however, as it only served to reassure Rey of her own power: recalling Kanata's words on reaching the light within, she begins to draw on the Force to hone her attacks, and the tide of the duel shifted in her favor. Ultimately Rey overpowered Ren and dealt him a severe wound to his face. By this point Kylo had taken too many wounds to continue standing, but he still struggled in vain to rise again. Before either could continue the duel, the planet ruptured between where they were standing and they were separated from finishing their fight."}, {"tag": "h3", "text": "Final actions"}, {"tag": "p", "text": "Poe ordered his squadron to cover him as he entered the hole of the oscillator. A pursuing TIE fighter did not clear the gap, leaving Poe to circle in the interior of the unguarded structure, firing volley after volley of torpedoes into the oscillator, destroying it thirty seconds before it finished draining the sun to charge the weapon. This caused a chain reaction which destroyed the base and leveled the entire planet's terrain. Inside the main base, chaos reigned as General Hux departed the command center and First Order officers realized all hope was lost and evacuated. Hux, meanwhile, reported to Supreme Leader Snoke, who ordered him to rescue Ren and flee the base, as he wished to complete Ren's training. Rey returned to Finn, despairing that he would not wake up and that they would be trapped on the rupturing planet to meet their doom. However, Chewbacca promptly arrived with the Millennium Falcon to rescue them."}, {"tag": "p", "text": "Phasma was able to escape from the trash compactor, and soon made her way back to the computer terminal to erase its history, preventing anyone from knowing that it was her that lowered the shields. She soon discovered that Lieutenant Sol Rivas had accessed the terminal, and in doing so learned about Phasma's treason. Phasma, wanting to eliminate any loose ends, pursued Rivas to a TIE fighter facility, where he stole a TIE fighter. Phasma approached pilot TN-3465, who was unable to join the ongoing dogfight due to her droid, BB-K8, performing a data update on her fighter. Phasma approached TN-3465 and ordered her to follow Rivas in a two-seat TIE/sf space superiority fighter, eventually following Rivas to the nearby Luprora. The Millennium Falcon and the remainder of the Resistance fleet managed to escape Starkiller Base as it erupted into a star. With the mission complete, they entered hyperspace to return to D'Qar."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, Organa sent a coded transmission to all Resistance squadrons stating that the battle of Starkiller Base was won. Organa also told the squadrons to report in immediately and await further instructions. Around the same time, R2-D2 rebooted and proceeded to merge his part of the galactic map with the piece found by BB-8. Chewbacca and Rey left for Skywalker's location on Ahch-To, while Finn was put into a medically induced coma to heal his injuries from Ren."}, {"tag": "p", "text": "After Phasma located Rivas, she killed him along with TN-3465 and BB-K8 to ensure no witnesses knew of what she did before returning to First Order space, where First Order vessels were regrouping."}, {"tag": "p", "text": "Surviving First Order defense force pilots, such as Poldin LeHuse, were re-integrated into the fleet. They expressed a desire for vengeance and to prove themselves after failing to save the superweapon."}, {"tag": "p", "text": "Whilst aboard the Star Destroyer Retribution, Zay Versio and Dio watched Starkiller's explosion, before reporting to Shriv Suurgav that her mother Iden was dead but she made it count. Zay ordered Suurgav to contact the Resistance and tell them that the war was just beginning."}, {"tag": "p", "text": "The Resistance victory was ultimately pyrrhic, as destroying Starkiller Base was not close enough to undo the complete annihilation of the Hosnian system and consequentially the New Republic by the First Order prior, thus serving as a pathway for the latter to claim dominant control over the galaxy. Also in the aftermath, its members had to evacuate from D'Qar as a result of the First Order knowing their location, and ultimately was pursued and largely decimated before ultimately escaping the First Order with the help of Skywalker."}, {"tag": "p", "text": "According to the Resistance spy Vi Moradi, even four months after the base's destruction, the majority of the galaxy wasn't aware that Starkiller Base had been destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first footage of the battle was shown in the first The Force Awakens teaser trailer on November 28, 2014."}, {"tag": "p", "text": "Part of the initial bombing run was re-filmed at Bad Robot Productions in order to show more cockpit scenes. Dameron's run into the breach in the oscillator was done as a deliberate homage to the Death Star trench run, but without a Force-sensitive character."}, {"tag": "p", "text": "The 2017 reference book Star Wars: On the Front Lines states that the Battle of Starkiller Base takes place 30 years after the Battle of Yavin. Star Wars: Galactic Atlas dates the battle in 34 ABY, thirty four years after the Battle of Yavin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}