{"url": "Tol_Skaros", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Dark Jedi", "Category:Males", "Category:Whiphids"], "nodes": [{"tag": "h1", "text": "Tol Skaros"}, {"tag": "p", "text": "Tol Skaros was a Force-sensitive male Whiphid who lived during the time of the Galactic Empire. He worked as an enforcer for the Hutts and later became an independent bounty hunter. After encountering the Dark Jedi Thaum Rystra, Skaros became Rystra's apprentice and learned how to use the dark side of the Force."}, {"tag": "p", "text": "In 3 ABY, Rystra sent Skaros to the planet Dalicron-4 to capture the Force-sensitive child Caeleb. After interrogating Caeleb's grandfather, the Jedi Gel, Skaros learned the location of the house where the boy lived. He went there and killed Caeleb's parents, but before he could capture Caeleb, he was attacked by a group of agents the Alliance to Restore the Republic had sent to find the child. Skaros entered personal combat with two of the agents, the Trandoshan Goort and the Human Garek Tolas, and they eventually killed him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Apprentice to Thaum Rystra"}, {"tag": "p", "text": "Tol Skaros was a Force-sensitive Whiphid who lived during the time of the Galactic Empire and worked as an enforcer for the Hutts. He later became an independent bounty hunter and regularly carried out assignments for the Empire. After the Dark Jedi Thaum Rystra found Skaros, he offered to make the Whiphid his apprentice. Skaros agreed, and Rystra trained him to use the dark side of the Force. Rystra wanted Skaros to be prepared to fight other Force-users, so he instructed him in various fighting styles that were used by the Jedi, as Skaros refused to learn how to use a lightsaber like most Dark Jedi did until he was skilled enough to construct one himself. Using the money that he had earned while working as a bounty hunter, and some additional contributions from Rystra, Skaros purchased various weapons that would aide him in fighting experienced Force-users. He also obtained several cybernetically-enhanced Nek battle dogs and three stolen Viper probe droids."}, {"tag": "h3", "text": "Confrontation on Dalicron-4"}, {"tag": "p", "text": "Rystra was himself the apprentice of the Sith spirit Valik Kodank and wanted to resurrect her to a physical form. He believed that he could achieve this by using the Force energy of Caeleb, a Force-sensitive child who had been referred to in an ancient prophecy as the \"Child of Light.\" Caeleb lived with his family on the planet Dalicron-4 in the Outer Rim Territories, and Rystra decided to send Skaros there to capture the child. Caeleb's parents were both trained to use the Force, so Rystra believed that the assignment would give Skaros some useful combat experience against fellow Force-sensitives."}, {"tag": "p", "text": "Rystra contacted Skaros' starship, a Z-10 Seeker, via a holoprojector. He gave his apprentice the coordinates of Dalicron-4 and ordered him to kill Caeleb's guardians, and then return with the child. Before flying to the Dalicron-4 settlement of Dalia, Skaros promised Rystra that he wouldn't fail to complete the mission. Skaros landed his ship in the settlement's landing field and then traveled to a farm where Caeleb's grandfather, an elderly Jedi named Gel, lived. Skaros interrogated the old man to try and force him to reveal Caeleb's location. Gel attempted to resist Skaros but didn't have the strength to succeed. Skaros pretended to have captured Gel's granddaughter Jhara and threatened to feed her to his battle dogs if the Jedi didn't tell him where Caeleb was. Gel gave in and told Skaros where Caeleb lived with his parents in a house that was sited beneath a tree, where the ancient Jedi Master Duumas had created a \"bubble\" that was devoid of the Force. Skaros then departed the house, leaving Gel fatally injured."}, {"tag": "p", "text": "With his probe droids and battle dogs, Skaros traveled in a skiff toward Caeleb's house. He stopped near the building, and after observing the family through a set of macrobinoculars, he tapped a code into his wrist comlink. After receiving two beeps in reply, Skaros moved his skiff closer to the house and attacked Caeleb's parents. Skaros commanded his battle dogs to attack Caeleb's mother, while he attacked Caeleb's father himself. The man fought Skaros with a green-bladed lightsaber but lacked Skaros' combat expertise, and when the battle dogs killed his wife, he was overcome with grief and was dispatched by the Whiphid."}, {"tag": "p", "text": "A short time before Skaros arrived on Dalicron-4, Gel had sent message to the Alliance to Restore the Republic, requesting that Caeleb be placed in the care of Luke Skywalker, an Alliance commander and Jedi. The Alliance sent the crew of the YT-1300 light freighter Lazy Katarn to Dalicron-4 to find Caeleb, and Gel had sent Jhara to meet them. Jhara and the Alliance agents arrived at Caeleb's house just as Skaros finished off the boy's father, and they approached the Dark Jedi. Skaros was alerted to their presence when one of his probe droids shot Jhara, and he shouted an order at his battle dogs and prepared for combat while the probe droids attacked the agents. The Trandoshan Goort and the Human Garek Tolas attacked Skaros, while the rest of the agents engaged in combat against the probe droids and battle dogs. Skaros attempted to keep the fight within the confines of the Force bubble, but he was eventually killed by Goort and Tolas."}, {"tag": "p", "text": "The agents then took Caeleb and left Dalicron-4 with him. Rystra later traveled to the scene of the battle and observed the body of his apprentice through a pair of macrobinoculars. Four months later, Rystra kidnapped Caeleb and traveled with the child to the moon Nar Shaddaa, where he met with representatives of the Pamorjal Freeman's League, a resistance group that opposed the actions of mega-corporations on the planet Pamorjal. The team of Alliance agents who had defeated Skaros were again tasked with finding Caeleb and began tracking Rystra, who planned to slow them down by persuading the Freeman's League to attack the agents. Rystra told the representatives that the agents had killed Skaros and warned the League to be cautious."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Skaros stood 1.6 meters high, the average height for a Whiphid. He was covered in thick, white fur and had black-colored eyes. He was completely loyal to Thaum Rystra and was eager to perform any task that Rystra set for him. Skaros was also very ruthless and had considerable combat experience."}, {"tag": "p", "text": "Skaros wore armor and carried various pieces of equipment to assist him in his assignments, including a wrist comlink, which he could use to contact people, and a set of macrobinoculars, which he could use to view things from a distance. He was armed with a quarterstaff and a vibrodagger."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tol Skaros was created by Lee Pickler in Child of Light, a supplement to the Star Wars Roleplaying Game. In the supplement, the players role-play as the group of Alliance agents who fight Skaros. The way their battle is fought can vary, depending upon the actions of the player characters. If any of the players reveal themselves to be Force-sensitive, Skaros asks them to meet him in honorable combat and claims that it is unfair if all the player characters fight him at the same time. Soulsaber, the second adventure in the Child of Light saga, confirmed the canon set of events during the fight, revealing that it was Goort and Tolas who killed Skaros."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}