{"url": "Tolan_Nokkar", "categories": ["Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Moisture farmers", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Tolan Nokkar"}, {"tag": "p", "text": "Tolan Nokkar was a moisture farmer who lived on Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Early in the Galactic Civil War, Tolan Nokkar lived in a village of moisture farmers, located in the Western Dune Sea of the planet Tatooine."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the village was attacked and taken over by a tribe of Tusken Raiders led by a Tusken King. Most of the villagers were killed but Tolan Nokkar and a few of the villagers managed to escape. They established a refugee camp in the Dune Sea, not far from the village."}, {"tag": "p", "text": "Circa 1 ABY, Tolan Nokkar encountered a spacer in the camp. Nokkar begged the spacer to kill the Tusken King. The spacer headed to the pillaged village and fought the Tusken King and other Tuskens who would get in the way. The spacer succeeded and returned to Nokkar. Tolan Nokkar was thankful and gave the spacer 20,000 credits pooled together by the surviving villagers as a reward. Tolan Nokkar and other survivors thus planed to move back into the village as soon as they drove the remaining Tusken Raiders away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tolan Nokkar was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Due to the nature of some characters in Galaxies, Tolan Nokkar's appearance was randomized during each server reset. Therefore, the canonical species and gender of Nokkar remains unidentified. Species Nokkar could appear as included, but were not necessarily limited to, Aqualish, Sullustans, and Zabrak."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}