{"url": "Tolo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Core Worlds species"], "nodes": [{"tag": "h1", "text": "Tolo"}, {"tag": "p", "text": "The Tolos were one of two sentient species native to the Core Worlds' Panto system. Having evolved on the planet Toloran, they worked together with the amphibious Lomins of the system's first planet, Pantolomin, to create a system-wide tourist resort. On the Tolos' homeworld, they offered a range of recreational winter activities."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Tolos were a sentient species native to Toloran, the second planet in the Panto system, and part of the Dolomar sector in the Core Worlds. Their homeworld was a cold planet, covered in snow and mountains, and they shared it with non-sentient ice dragons. The Tolos worked together with a second intelligent species native to the star system, the amphibious Lomins of Pantolomin. Together, the two species established the entire system as a multi-tiered tourist resort for beings from across the galaxy."}, {"tag": "p", "text": "Numerous winter activities were offered on the Tolos' homeworld, including repulsor skiing, hover sledding, and wilderness survival camps. Tourists could also travel on the Snow Nara ice barge through ice floes and on hunting expeditions for ice dragons. These activities complemented the underwater tours and casinos available on Pantolomin, and the zero-gravity activities available on the system's third planet, Atloran. The Tolos shared representation with the Lomins on the system's tourism board."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tolos were created by Bill Slavicsek for the roleplaying game sourcebook Dark Force Rising Sourcebook, published by West End Games in 1993. This information was later republished in The Thrawn Trilogy Sourcebook in 1996. Slavicsek never described the Tolos, and despite an additional mention in the Pantolomin article appearing in issue 124 of The Official Star Wars Fact File, they are still without an official description."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}