{"url": "Tol_dosLla", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Government figures", "Category:Humans", "Category:Males", "Category:Ukians"], "nodes": [{"tag": "h1", "text": "Tol dosLla"}, {"tag": "p", "text": "Tol dosLla was a Human native of the planet Ukio. The eldest son of Gol dosLa, the Ukian Overliege, dosLla served as the spokesman for the government. A capable and renowned politician, dosLla was expected to succeed his father. In 9 ABY, Imperial Grand Admiral Thrawn waged a military campaign against the New Republic. Late in his campaign, Thrawn targeted Ukio, intent on capturing it and acquiring its food production and processing facilities for his military forces. Following a brief engagement against the planet—in which Thrawn effectively employed cloaking technology to fool the Ukians into believing that he possessed a superweapon capable of firing through a planetary shield—dosLla negotiated Ukio's surrender to Thrawn. Despite being overmatched, dosLla was able to successfully demand guarantees of safety for the Ukian people and their land during the Imperial occupation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tol dosLla was a Human native of the planet Ukio, an agricultural world in the Abrion sector of the Outer Rim Territories. DosLla was the eldest son of the Ukian Overliege, Gol dosLa, and by 9 ABY, he served as the spokesman for him. A capable politician, dosLla was considered to be the next in line for the position of Overliege."}, {"tag": "p", "text": "In 9 ABY, during the military campaign propagated by Imperial Grand Admiral Thrawn against the New Republic, Ukio was one of the targets selected by Thrawn. The Grand Admiral wanted Ukio's extensive agricultural production and processing facilities to supply his military forces, and devised a strategy to render Ukio defenseless. Staging feints against a number of other worlds, Thrawn stretched the local New Republic forces thinly across the region. With the New Republic engaging Imperial forces in multiple systems, Ukio was left defenseless. Leading a task force into the system headed by his flagship, the Imperial II-class Star Destroyer Chimaera, Thrawn demanded that Ukio surrender to the Empire."}, {"tag": "p", "text": "Initially, the Ukians did not respond to Thrawn's ultimatum, issuing a distress call to the New Republic base at Ord Pardron, which provided for their local defense. Due to Thrawn's feints, however, Ord Pardron was unable to respond. Despite this, the Ukians felt secure, as they had a planetary shield that surrounded their world. Thrawn expected this, and had already tasked a pair of freighters with civilian registries to insert several cloaked cruisers below the planetary shield by guiding them in under tow. Using careful positioning and calculated timing—along with the Force powers of the clone Dark Jedi Joruus C'baoth—Thrawn created a ruse that made it appear that turbolaser fire from the Chimaera was penetrating the planetary shield and striking at targets on the surface. In reality, the Chimaera's fire was dissipating harmlessly on the shield, and the cloaked cruisers—positioned directly in line with the Chimaera's turbolaser fire—were firing the devastating shots from within the atmosphere."}, {"tag": "p", "text": "With the destruction of two Ukian military air bases, dosLla contacted Thrawn on behalf of the Overliege to request a cessation to the orbital bombardment and to discuss their terms of surrender. Thrawn, wishing to take the planet with its defenses intact, ordered dosLla to recall all military forces, lower the planetary shield and allow his forces to take control of the shield generators and all ground-to-space weapons. Despite these changes, as long as the Ukian people behaved, Thrawn assured them that their societal and political structure would remain untouched. Suspicious, dosLla inquired about forced conscription and war-level taxation. Since Thrawn had attained cloning facilities on the planet Wayland, he had no need for conscripts and assured dosLla that Ukio's young people would not be called upon. He also told dosLla that, instead of war-level taxation, Ukio's contribution to the war effort would come from supplying Imperial forces with food from their extensive agriculture industry."}, {"tag": "p", "text": "Despite knowing that Thrawn's changes were the first steps in transforming Ukio into a supply depot for the Empire, dosLla knew that he had no alternative but to comply with the Grand Admiral's demands, since failure to do so would lead to the destruction of Ukio and its society. Defeated but defiant, dosLla informed Thrawn that they were lowering the planetary shields as a gesture of good faith, but before the shield generators and weapons were turned over, he wanted guarantees regarding the safety of the Ukian people under Imperial rule. Thrawn, knowing that allowing the Ukian people to surrender with dignity would stall the inevitable resistance to their control, informed dosLla that a representative would be dispatched to discuss terms from the Overliege. With no objections, dosLla ordered the shield lowered so that Imperial forces could take up preliminary defensive positions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Well known as a capable and effective politician, Tol dosLla was respected across Ukio. He possessed an agreeable nature, and was very soft spoken. However, he was not afraid to speak his mind, and used his gentle nature to talk individuals around to his way of thinking; this was a strategy that dosLla used on several occasions during his career. DosLla was chosen as the representative of the Overliege to negotiate Ukio's surrender to Imperial forces led by Grand Admiral Thrawn in 9 ABY. Despite facing overwhelming firepower—and the belief that Thrawn had somehow developed turbolaser capabilities that were able to fire through an intact planetary shield—dosLla was strong enough in his negotiations to demand assurances regarding the safety of the Ukian people and their land."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "DosLla was knowledgeable about the Ukian bureaucracy, and had an understanding of other alien species and languages. He was very knowledgeable about the business of agriculture, and was experienced in valuing the price of foodstuffs and obtaining the best price for them."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "DosLla always carried a datapad that contained the harvest production schedules."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tol dosLla first appeared in The Last Command, the third book of the Thrawn Trilogy, written by Timothy Zahn. He subsequently appeared in the first issue of the comic book adaptation of the The Last Command. DosLla also gained a small capsule entry in the The Last Command Sourcebook, published by West End Games, which was reprinted in The Thrawn Trilogy Sourcebook."}, {"tag": "p", "text": "Despite Ukians being described in The Last Command Sourcebook as hairless, green-skinned and red-eyed, the depiction of dosLla in The Last Command 1 portrayed him as a Human with light skin, brown hair and a beard. As other Humans, such as the Rebel scout Janse and the Imperial scout trooper Oberk, are known to have been born on Ukio, this article assumes that dosLla is a Human of Ukian nationality."}, {"tag": "p", "text": "DosLla's name has also been misspelled in various sources; both his first appearance in The Last Command and the comic issue The Last Command 1 spelled his name as \"Tol dosLla.\" However, the name was spelled as \"dosLa,\" without the second \"l,\" in The Last Command Sourcebook. This spelling extended to the name of Gol dosLa, the character's father. The Complete Star Wars Encyclopedia, published in 2009, used the double \"l\" spelling, effectively canonizing that name as the correct spelling. Since no mention was made of his father in the Encyclopedia, his father still retains the dosLa surname."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}