{"url": "Tol_Cressa", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Tol Cressa"}, {"tag": "p", "text": "Tol Cressa was a male who served as the Supreme Chancellor of the Galactic Republic during the Mandalorian Wars. The Chancellor worked to restore the Republic from the devastation that was brought by the Great Sith War and Jedi Civil War. Cressa was still in office by 3946 BBY, when he organized a successful liberation of a sector that had seceded from the Republic under the leadership of rogue G0-T0 infrastructure planning system droids."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tol Cressa, a male, rose to the office of the Galactic Republic's Supreme Chancellor during the era of the Old Sith Wars. In 3963 BBY, around the outbreak of the Mandalorian Wars, Cressa had commissioned the Jedi Master Raana Tey to a special assignment. During the last stages of the battle of the Outer Rim planet Taris, Cressa began an investigation into how the ecumenopolis gained such a quick entry into the Republic. Three years before Cressa's investigation, Taris was admitted into the Republic thanks to the efforts of Lhosan Industries Chairman Jervo Thalien and Haydel Goravvus, who bribed other senators in order to secure admission into the Republic. After the death of Admiral Jimas Veltraa during the battle, the Chancellor overruled renaming an Interdictor-class cruiser after Veltraa. During the Mandalorian occupation of Taris, Cressa assigned Tey to locate and aid Goravvus, who became the planet's senator after Taris became a Republic world. Goravvus was leading the Tarisian resistance efforts against the Mandalorian Neo-Crusaders."}, {"tag": "p", "text": "Following the Mandalorians' devastation of the planet Duro in 3962 BBY, Cressa, relenting to Republic citizens' feelings, named the Jedi Knight Revan—whose Jedi faction was operating with the Republic's forces under the guise of a mercy corps,—as the commander of the Republic's military forces. In 3955 BBY, one year after the end of the Jedi Civil War, Cressa commissioned the Telosian Restoration Project, which was an effort to restore the planet Telos IV from its destruction during the Jedi Civil War."}, {"tag": "p", "text": "During the Dark Wars, a series of conflicts that included the Sith Triumvirate's assassination campaign against the Jedi Order, Cressa also authorized the G0-T0 infrastructure planning system droid project in order to aid in the rebuilding of other worlds and infrastructures that were devastated during the Great Sith War—which was between the Republic and Sith Lord Exar Kun's Sith Empire—and the Jedi Civil War. The G0-T0 droids controlling the 400100500260026 territory, which consisted of sixteen planets ruled by the droids, seceded from the Republic, cut off HoloNet communications, and blocked traffic in and out of the Gordian Reach sector. In 3946 BBY, Cressa organized a successful recapture of those planets, which were under the control of the G0-T0 droids."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During the Mandalorian Wars, Tol Cressa was willing to promote the Jedi Knight Revan to the rank of commander of the Republic's military due to the desire of the Republic's citizens. He also wished to express his disgruntlement with the Jedi High Council, which had taken a stance of inaction in the Mandalorian Wars. In the time period after the Jedi Civil War's end, Cressa was regarded as being a legendary Chancellor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Tol Cressa was first mentioned in the twelfth issue of the Star Wars: Knights of the Old Republic comic series, with his background also expanded on in The New Essential Guide to Droids. However, the Chancellor was not identified until the release of the Knights of the Old Republic Campaign Guide, which mentioned him by his surname. He was later given an entry in The Complete Star Wars Encyclopedia. Cressa was given the first name \"Tol\" in The Essential Guide to Warfare, which also expanded on his role in the Mandalorian Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}