{"url": "Tolga", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Enforcers", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Tolga"}, {"tag": "p", "text": "Tolga was a Rodian thug who worked as an enforcer for a crime lord. He almost apprehended the smuggler Blaine Hansom but the interference of Platt Okeefe thwarted his capture. He later had a chance for revenge against Okeefe when he teamed up with the bounty hunter Boddu Bocck. However, he was again thwarted by outside inference when a young boy, Darrik, shot at him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tolga was a green Rodian who initially worked as an enforcer for a crime boss, and in that capacity, he tried to track down the smuggler Blaine Hansom. He found him in a cantina hiding out from the local Imperial presence and would have apprehended him if not for the interference of Platt Okeefe and Tru'eb Cholakk. The pair took pity on the inexperienced smuggler and forced Tolga to let Hansom go free."}, {"tag": "p", "text": "After his employer's demise, Tolga was taken on by the bounty hunter Boddu Bocck as an apprentice. While his skills were lacking compared to Bocck and his associate Beylyssa, Tolga provided some extra firepower for the more professional pair."}, {"tag": "p", "text": "Tolga was present on Cloud City in 0 ABY when Major Birket of the Imperial Security Bureau sought out Bocck. He insulted the major, who swiftly swung his walking stick up to the Rodian's throat, a small blade extending from the end. The major hired the bounty hunters to apprehend Platt Okeefe and Tru'eb Cholakk and to rescue the boy Darrik, who was traveling with Okeefe. Okeefe and the boy were already en route to Bespin, and Bocck assigned Tolga and Beylyssa to capture them while he traveled to Tatooine to apprehend the Twi'lek."}, {"tag": "p", "text": "After arriving on Bespin, Okeefe left her ship and Tolga trailed her. He kept watch as she met up with her supplier, Mussat Nasrabi, at his casino, The Floating Fish. Okeefe then descended to the lower levels of the city to obtain her cargo of tibanna gas. While she tried to slice a lock, Tolga crept up behind her and prepared to shoot her with his blaster. However, his plan was foiled when Darrik shot him, alerting Okeefe to his presence. Together, the two escaped Bespin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tolga wore a blast vest with a number of insignia on it. As a bounty hunter, he used a heavy blaster pistol, but he was not particularly skilled in his craft; Major Birket considered him to be only a low level enforcer whose skills were less developed than either of his sometime-partners, Bocck and Beylyssa. He had a nasally voice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tolga first appeared in the Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded, in a short pick-a-path adventure to introduce the reader to role-playing. There, he was one of the player's protagonists. He later reappeared in Imperial Double-Cross, a book-length a pick-a-path adventure, where the reader plays as Darrik. As such, a canonical set of events has not been determined, yet both Tolga and Beylyssa must be defeated (with a number of possible ways) for the adventure to continue. It is possible for Tolga to die in some of the outcomes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}