{"url": "Battle_of_Sullust_(Republic_traitor)", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars", "Category:Battles of Sullust"], "nodes": [{"tag": "h1", "text": "Battle of Sullust  (Republic traitor)"}, {"tag": "p", "text": "The Battle of Sullust took place during the Clone Wars, at which Sullust seceded to the Confederacy of Independent Systems. A traitor amidst the Republic allowed the Separatists to defeat their forces."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Less than a month after Sullust seceded at the beginning of the war, the Galactic Republic dispatched an invasion force to retake the planet. Launched from Eriadu, the task force, composed of clone troopers and numerous local planetary defense forces, was commanded by Jedi Knight Rees Alrix. Sometime during the battle, a Republican turned traitor, which led the battle to turn against the Republic."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Due to a treachery in their midst, the Republic took heavy casualties and lost the battle for Sullust. Despite their defeat, the Republic succeeded in recapturing much of the Sluis sector. The Separatist victory at Sullust allowed the planet to remain one of the Confederacy's most prized holdings until the end of the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As regards to the Battle of Sullust, The Clone Wars Campaign Guide stated that Sullust seceded to the Confederacy at the beginning of the war and that the battle took place less than a month after the planet's secession. This likely disputes with The New Essential Chronology, which stated that for a year into the war, Sullust remained a loyal member of the Galactic Republic, serving as a fortress world along the CIS border, until eventually it seceded to the Confederacy–leading the Republic to send a task force in an attempt to reclaim the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}