{"url": "Battle_of_Svivren", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Svivreni sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Svivren"}, {"tag": "p", "text": "The Battle of Svivren was a skirmish between the Galactic Empire, the Svivreni resistance and the Black Nebula taking place just before the Battle of Endor."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 4 ABY, Dequc, a crime lord, wanted to negotiate with other scoundrels to create a new crime syndicate, the Black Nebula. At that time, the Galactic Empire had been unable to deal with crime and rebellion in the planet Svivren; Cevva Xuz, a criminal linked with the Rebel Alliance, thrived in Svivren with the Svivreni resistance. Dequc decided to visit Svivren and make operations there. However, Emperor Palpatine sent Mara Jade, one of the Emperor's Hands, to the planet Svivren with the specific goal of murdering Dequc, as Dequc was more protected in his previous headquarters."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Jade contacted the local Imperial garrison, led by General Touno, and identified herself as an Imperial operative, requesting their help to apprehend Xuz. This was a feint, as she really intended to go after Dequc while the Imperials and the Rebels were fighting. Touno assigned several stormtroopers and Captain Strok (who was secretly an agent of the Black Nebula) to arrest Xuz. As Strok was in Dequc's payroll, he notified his real employer, and Dequc left, leaving behind a decoy. From the middle of the street, Strok asked for Xuz's surrender. Xuz's Rebel forces answered by firing against the stormtroopers. Meanwhile, Jade executed Dequc's decoy. The battle took the lives of several stormtroopers and civilians. Jade then piloted a ship and left Svivren. Strok had to leave the planet soon afterward."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although she thought her mission was successful, Mara Jade later discovered that her target was a decoy and Dequc was still alive. She eventually executed him several months later after the death of The Emperor, her master, at the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}