{"url": "Tolwar_Wartol", "categories": ["Category:Canon articles", "Category:Chemists", "Category:Males", "Category:New Republic Senators", "Category:Orishen"], "nodes": [{"tag": "h1", "text": "Tolwar Wartol"}, {"tag": "p", "text": "Tolwar Wartol was a male Orishen senator of the New Republic. Prior to the Battle of Jakku, he was a political rival of Chancellor Mon Mothma, whom he regarded as weak and indecisive. He also had dealings with the Black Sun and Red Key Raiders crime syndicates. Wartol actively sought to undermine her leadership at every opportunity. After Mothma exposed his machinations and sabotaged his attempt to delay sending military forces to Jakku, Wartol conspired to assassinate her by bombing her office. His plan was ultimately foiled by the former Imperial loyalty officer Sinjir Rath Velus. Wartol was arrested by the New Republic authorities as the Battle of Jakku drew to a close."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Tolwar Wartol was once a chemist on his pastoral homeworld of Orish. During the Age of the Empire, the Orishen were enslaved by the Galactic Empire, who strip-mined Orish and drained the planet's surface of its natural nutrients, destroying the pastoral haven. Wartol helped create the chemical weapon that destroyed the Imperial occupation but also poisoned his world from the ground to the atmosphere. After the Empire abandoned the doomed planet and Wartol believed this a triumph. Wartol and the surviving Orishen relocated to a skeletal framework of tubes and stations that orbited that poisoned former homeworld."}, {"tag": "h3", "text": "New Republic senator"}, {"tag": "p", "text": "Following the Battle of Endor, he became his people's senator in the New Republic's Galactic Senate, and used his survivor's spirit as part of his campaign. By 5 ABY, Wartol had become the main political opponent of Chancellor Mon Mothma. Wartol brought a survivor spirit to politics and claimed that he understood the importance of sacrifice in order to preserve life and freedom. Wartol's pugnacious leadership style at one point secured him a popularity rating of 61%. Prior to the Battle of Jakku, Wartol was viewed as a potential opponent of Chancellor Mothma in the upcoming elections."}, {"tag": "p", "text": "Despite his righteous political image, Wartol harbored a seedy underbelly. He had connections to the Black Sun and Red Key Raiders crime syndicates.\nWartol used his criminal connections to exert an influence over his five senatorial colleagues Ashmin Ek of Anthan Prime, Rethalow of Frong, Dor Wieedo of Rodia, Grelka Sorka, and Nim Tar, who caucused with him on many issues. In addition, Wartol also spied on Senator Leia Organa and her husband Han Solo, using a listening device implanted inside the couple's nanny protocol droid T-2LC (\"Elsie\"). Using the listening device, he eavesdropped on Chancellor Mothma and Princess Leia's meeting with Temmin Wexley and Sinjir Rath Velus discussing the latter pair's discovery of Imperial forces above Jakku."}, {"tag": "h3", "text": "Political warfare"}, {"tag": "p", "text": "Seeking to score political capital against Chancellor Mothma, Senator Wartol broke the news on HoloNet and accused her of keeping secrets and being soft. When Mothma tried to rally the Senate to vote to send military forces to Jakku, Wartol and his criminal allies managed to coerce Ashmin Ek, Rethalow, Dor Wieedo, Grelka Sorka and Nim Tar into voting against Mothma's motion. Black Sun and Red Key bribed the first three syndicates and kidnapped Nim Tar's child and Solka's pet jerba. Wartol wanted to use the crisis to undermine Mothma's leadership while the crime syndicates wanted to prolong the Galactic Civil War. Wartol also secretly sent Senate Guards to prevent Temmin and Sinjir from leaving Chandrila to search for Norra Wexley and Jas Emari."}, {"tag": "p", "text": "As the New Republic was making preparations to transfer the Senate to the Mid Rim world of Nakadia, Tolwar traveled on his personal yacht with Chancellor Mothma. During the hyperspace journey, Mothma confronted him about his role in manipulating the five senators into opposing Mothma's bill and spying on Senator Organa. A defiant Wartol denied the accusations and boasted that the Chancellor's scheduled re-vote on sending military forces to Jakku would be defeated on Nakadia. However, Chancellor Mothma managed to delay the vote by smuggling a pta fruit aboard the yacht. As a result, the Nakadian authorities did not allow them to land until they had completed a thorough biosecurity search of his yacht."}, {"tag": "p", "text": "While Wartol was preoccupied, Chancellor Mothma's agents Sinjir, Temmin, Han Solo, Jom Barell, and Conder Kyl managed to convince the five senators to change their votes by rescuing Nim Tar's child and offering to pardon them. After finally landing, both Senator Wartol and Chancellor Mothma addressed the press about the new vote. As the two senators entered the Quarrow Senate house, Mothma feigned a sprained ankle. Wartol saw through her ruse and taunted her about losing her vote a second time. Due to the efforts of Sinjir and the other agents, Mon Mothma's bill passed and the Senate decided to dispatch the New Republic Defense Force to Jakku, setting the stage for the Battle of Jakku."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "Seeking revenge, Wartol planted a bomb in Chancellor Mothma's office on Chandrila. While paying a \"courtesy visit\" to deliver pta fruits, Sinjir caught Wartol trying to remotely detonate the bomb. Wartol revealed his blaster and fought with Sinjir. During the struggle, Wartol managed to trigger the bomb. After being subdued by Sinjir, a defiant Wartol admitted responsibility for his actions and dared Sinjir to shoot him with his blaster. However, Sinjir responded that he would be tried for his crimes before attending to the bombing. The conversation was recorded by a tech gauntlet worn by Sinjir's boyfriend Conder. Chancellor Mothma was not in her office but her Adviser Auxi Kray Korbin was killed during the explosion. The disgraced Wartol was subsequently arrested by local security forces."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tolwar Wartol was a male Orishen, distinguished by nose-slits, a bisected lower jaw, X-shaped irises in deep-set kaleidoscopic eyes, and thick skin plates. He also bled purple blood. He was widely regarded as a charismatic leader who was full of zealous anger. Wartol's worldview was shaped by an oppressive Imperial subjugation of his homeworld Orish. Wartol was a staunch advocate in violent resistance and was willing to achieve his goals by any means necessary. Prior to becoming a New Republic Senator, Wartol was an Orishen resistance leader who drove the Empire from his homeworld by poisoning it. Despite the devastation of his homeworld, Wartol regarded it a victory."}, {"tag": "p", "text": "Wartol was a hawk and hardliner who despised what he perceived as Chancellor Mothma's \"spineless and indulgent\" leadership. Wartol's hatred for Mothma led him to take every opportunity to bring about her political downfall. Wartol was an aggressive politician whose charisma and angry rhetoric at one point secure him a 61% popularity rating over Chancellor Mothma. Despite his self-righteous image and rhetoric, Wartol had secret dealings with the Black Sun and Red Key crime syndicates. He used them to bribe and blackmail five senatorial colleagues into sabotaging Mothma's resolution to send military forces to Jakku. Wartol's hatred for Mothma led him to attempt to prolong the Galactic Civil War."}, {"tag": "p", "text": "Wartol took personal offense when Chancellor Mothma delayed the vote by smuggling a pta fruit to Nakadia. With his pride humiliated and his plot to prolong the war foiled, Wartol sought revenge against the Chancellor and tried to kill her. Wartol also despised the former Imperial Sinjir Rath Velus for having once served the Empire. Wartol viewed himself as a martyr during his attempt to kill Chancellor Mothma and was willing to die for his assassination attempt. However, Sinjir had little patience for Wartol's misplaced sense of honor and warned him that he would face justice instead for his criminal actions."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Tolwar Wartol was a chemist who developed a chemical weapon that poisoned his homeworld Orish during a successful attempt to expel the Empire. He also wielded a fat-barreled snub-chambered Kanjiklub-made blaster, which was similar to that used by criminal elements. Wartol knew how to fight and shoot but was no match for Sinjir's combat prowess. Wartol was also a fiery, zealous speaker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tolwar Wartol first appeared as a minor antagonist in Chuck Wendig's 2017 novel Aftermath: Empire's End, the final installment in Star Wars: The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}