{"url": "Tom_DeFalco", "categories": ["Category:Real-world articles", "Category:Editors"], "nodes": [{"tag": "h1", "text": "Tom DeFalco"}, {"tag": "p", "text": "Tom DeFalco (born June 26, 1950) is an American comic writer and editor, well-known for his association with Marvel Comics and Spider-Man."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tom DeFalco was born in Queens, New York City, New York, where his family owned a supermarket. His introduction to comic books came when, aged five, an older cousin read an issue of Batman to him."}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "While in college, DeFalco \"wrote for a few local newspapers, a weekly comic strip and did a few short stories,\" and after graduation \"got in touch with the various comic book companies\", which led to him beginning his comics career as an editorial assistant with Archie Comics in summer 1972. During his tenure with Archie Comics, he \"initiated and developed the Archie Comics Digest Series, which is still being produced today and remains the company's most profitable publishing series\". Learning fast, DeFalco was soon writing for the flagship title Archie as well as for other titles including Scooby-Doo and Josie and the Pussycats."}, {"tag": "p", "text": "He later joined Marvel Comics, with whom he would spend the next twenty years of his career. One of his earliest non-Archie credits was as writer, however, was with the \"Distinguished Competition,\" on the final (8th) issue of DC's aborted \"Swords and Science\" title Starfire (Oct 1977) and a back-up Cain story in House of Mystery before moving to Marvel, where he wrote a couple of issues of The Avengers and the final five issues of Machine Man."}, {"tag": "p", "text": "DeFalco was the chief designer and author for Dazzler, and later became one of the most popular writers for the Spider-Man comic book series while at the same time rising through the editorial ranks. While writing Dazzler, he penned a couple of issues of Marvel Team-Up, before taking over from Dennis O'Neil as editor of that title, as well as assuming editorial duties on Ghost Rider, What If...? and the Spider-Man titles, which he edited throughout the early 1980s."}, {"tag": "h3", "text": "GI Joe and Hasbro"}, {"tag": "p", "text": "DeFalco worked closely with toy manufacturer Hasbro in the early 1980s, heading the creative team that \"produced the backstory and dossiers that served as the basis for the relaunch of the phenomenally successful GI Joe toy line and animated television show,\" in 1985. As part of this relaunch, Marvel produced a comic entitled G. I. Joe: A Real American Hero in June 1982. DeFalco personally edited the first six issues (handing over to Denny O'Neil in January 1983), as well as assorted issues of G.I. Joe series' throughout the 1980s. The core - Real American Hero - series would run for 155 issues over the next 12 years."}, {"tag": "p", "text": "DeFalco was also \"part of the creative team that introduced the Transformers to the American public\" in 1984."}, {"tag": "h3", "text": "Spider-Man and Star Wars"}, {"tag": "p", "text": "In August 1983, DeFalco wrote the first four issues of the third series of Red Sonja and after shedding his Spider-Man editorial duties he took over from Roger Stern as writer of The Amazing Spider-Man. The two collaberated on April-May's #251-2 (the Secret Wars crossover issues), before DeFalco took over fully with #253, for a two year run, chiefly in collaboration with artist Ron Frenz. Concurrent with editing Jim Shooter's Secret Wars, DeFalco was dealing with Spider-Man's \"black costume\" in the pages of Amazing."}, {"tag": "p", "text": "DeFalco and Frenz were both removed from Amazing Spider-Man by then Spider-editor Jim Owsley, under the orders of Marvel Editor-in-Chief Jim Shooter. Issue #285 (Feb 1987) was their final issue, after which Owsley assumed writing duties. While writing Amazing, DeFalco continued editing various comics, including several of Marvel Star Wars titles."}, {"tag": "h3", "text": "Editor-in-Chief"}, {"tag": "p", "text": "After co-writing two issues of Fantastic Four (#301-2; April-May 1987) with Roger Stern (DeFalco would return to writing the title between 1991 and 1996), DeFalco took over writing duties on Thor from Walt Simonson with #383 in September, before succeeding Jim Shooter as Editor-in-Chief effective from comics cover-dated November 1987. He served from 1987 to 1994, making him one of the longest serving individuals to hold that post. The only Editors-in-Chief with longer service than him were Stan Lee (1941–1942, 1944–1972) and Shooter (1978–1987)."}, {"tag": "h3", "text": "Actions as Editor-in-Chief"}, {"tag": "p", "text": "As with several others who held the post, DeFalco became one of the public faces identified with a number of controversial decisions taken by Marvel in the period, and he is sometimes held responsible for them in fan circles. He was a key member of the management team that took Marvel public, and under his leadership, Marvel's net profits from publishing rose by over 500%. Under DeFalco's guidance, Marvel entered a phase of expansion that provided an opportunity for an army of \"new talent\" to enter the comic book industry, and released a number of new titles with original characters. After clashing with the company's upper management, DeFalco was fired in 1994. During the year following his departure, Marvel decided to distribute its own comics and sales on most of Marvel's core titles sagged. At the same time, the company's finances entered a crisis point amidst accusations that owner Ronald Perelman had strip-mined the company for his own gain. Initially the position of overall Editor-in-Chief was scrapped in favor of breaking the line into five sub-sections with their own group editors. In late 1995, the post was restored and filled by Bob Harras."}, {"tag": "p", "text": "During his tenure as Editor-in-Chief, DeFalco had continued to write as well, with noted runs on Thor (where he created the New Warriors with artist Ron Frenz) and the spin-off Thunderstrike, as well as Fantastic Four."}, {"tag": "h3", "text": "Return to Spider-Man"}, {"tag": "p", "text": "His dismissal from the position of Editor-in-Chief coincided with a run on The Spectacular Spider-Man (#215-229 Aug 1994 - Oct 1995), after which he returned to The Amazing Spider-Man in January 1996 for a couple of years (#407-439). During this time he helped co-write the controversial and much maligned Spider-Clone Saga which revealed (temporarily, at least) that Peter Parker was a clone of the original that had been active since 1975. Peter would be replaced by the original Spider-Man under the alias \"Ben Reilly\". However, following several changes of creators and fan reaction, this was soon reversed."}, {"tag": "h3", "text": "Other"}, {"tag": "p", "text": "DeFalco is also the author of over a dozen graphic novels, several hundred comic book stories, several dozen cyber-comics, three novels and six children's books, including the best-selling Dorling Kindersley guides to Marvel comics characters. These include: Spider-Man: The Ultimate Guide, Avengers: The Ultimate Guide, Fantastic Four: The Ultimate Guide and Hulk: The Incredible Guide. For Titan Books he has compiled three volumes in their \"Comic Creators On...\" series of essays and thoughts on Marvel characters (Spider-Man, the Fantastic Four and the X-Men, between 2004 and 2006)."}, {"tag": "p", "text": "DeFalco has personally created and developed over three dozen characters that have all been licensed for television, toys, t-shirts, posters, trading cards and other merchandise, and has written Khan for Moonstone Books. DeFalco also created Spider-Girl, who currently has an ongoing monthly series which only sells satisfactory in the \"direct market\", but does well in the collected digest format."}, {"tag": "p", "text": "In August 2008, DeFalco will once again return to the character of Spider-Man in a new comic strip for Amazing Spider-Man Family, Mr. and Mrs. Spider-Man, which will serve as the definitive continuity of the MC2 Spider-Man universe"}, {"tag": "h2", "text": "Star Wars works"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}