{"url": "Battle_of_Susevfi", "categories": ["Category:Legends articles", "Category:Battles of the Invid crisis", "Category:Duels", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Susevfi"}, {"tag": "p", "text": "The Battle of Susevfi was a battle during the Galactic Civil War by the New Republic against both the Invids and Jensaarai on Susevfi in 11 ABY in order to rescue Mirax Terrik Horn."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In order to track down his wife kidnapped by former Moff Leonia Tavira, Jedi Knight Corran Horn infiltrated one of Tavira's pirate squadrons, the Khuiumin Survivors, as Jenos Idanian. He then haunted the Invids on Courkrus, disguising himself as a Jedi Knight. Tavira dispatched five Jensaarai to apprehend Horn. They were quickly defeated, particularly thanks to the arrival of Jedi Master Luke Skywalker. The Jedi learnt from the Jensaarai that Tavira's base was on Susevfi."}, {"tag": "h2", "text": "Infiltration on Susevfi"}, {"tag": "p", "text": "Horn, Skywalker, Ooryl Qrygg and Elegos A'Kla departed for Susevfi after entrusting Jacob Nive, the leader of the Khuiumin Survivors, with the secret of Horn's identity and offering him a pardon and a chance for the Survivors to start over, if they kept the captured Jensaarai guarded with an ysalamir. The other ysalamir kept the Jensaarai from sensing the Jedi's presence when they landed on Susevfi."}, {"tag": "p", "text": "On landing, the four proceeded to the governor's palace, where they knew Mirax was being held. They attacked it, powering through the stormtrooper guards, and Horn was able to use the Force to locate Mirax's cell. Skywalker pulled her out of the Force-induced trance she had been put in, and Horn was overjoyed to be reunited with his wife."}, {"tag": "h2", "text": "Duel the Jensaarai"}, {"tag": "p", "text": "As there were too many stormtroopers alerted for them to fight their way back to the spaceport, the group decided to fight their way up the tallest tower of the palace to the landing pad and try to find a ship to flee in. Tavira fled from the top of the tower, but on their way up, Horn's group encountered the Jensaarai, led by their Saarai-kaar. The Saarai-kaar seemed convinced that she was meant to confront Horn, and the two dueled. Horn's lightsaber failed on contact with her cortosis armor, and as she stood over him, he projected into her head the image of Nikkos Tyris, the Anzat whom he had seen kill his grandfather in his earlier dream and whose distinctive lightsaber style the Saarai-kaar shared. Mirax was able to stun her, and with Skywalker having defeated the other Jensaarai, the last threat remaining was Tavira."}, {"tag": "h2", "text": "Space battle"}, {"tag": "p", "text": "Having lost control of the situation on the moon, Tavira fled in a shuttle before her enemies could reach her and returned to the Imperial II-class Star Destroyer Invidious, intending to use it to destroy the palace in order to prevent Horn's escape. However, the Star Destroyer was intercepted by Rogue Squadron, the Khuiumin Survivors and Mirax's father, Booster Terrik, aboard the Star Destroyer Errant Venture. As the two sides fought in orbit, Horn used a powerful mind trick to frighten Tavira into believing that a large New Republic fleet, including the Executor-class Star Dreadnought Lusankya and the recently destroyed superweapon, the Sun Crusher, was arriving in the vicinity. Believing that the Jedi had lured her into a trap, Tavira fled into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Errant Venture, Rogue Squadron, and the Survivors helped secure Susevfi and an agreement was reached that allowed the Survivors to become the word's security force. Horn and the others confronted the gathered Jensaarai prisoners and learned their history. They realized they had not learned enough of the Sith ways to become devotees of the dark side and believed themselves to be heirs to the true Jedi tradition. Horn and Skywalker were able to get through to the Saarai-kaar and convince her that the Jensaarai were not wholly correct in their outlook on the Force and invited them to join the New Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}