{"url": "Tomark_II", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:Alliance to Restore the Republic planets", "Category:Ividal sector astronomical objects", "Category:Mid Rim planets", "Category:The Slice planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Tomark II"}, {"tag": "p", "text": "Tomark II, also known as Tomark, was a Mid Rim world located in the Ividal sector. During the Galactic Civil War, it was the site of the Rebel Alliance starfighter base known as Chiron Base, from which attacks on Galactic Empire convoys were carried out."}, {"tag": "p", "text": "By 0 BBY, the Empire considered Tomark one of its priority targets for its Death Star superweapon. At some point during the conflict, Captain Amarith dispatched a team of Rebel agents on a mission that took them from Tomark II to the planet Ando."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Tomark II, also referred to simply as Tomark, was a terrestrial world that occupied the second orbital position in the Tomark system, a part of the Ividal sector in the Slice portion of the Mid Rim. It was situated at a distance of several hours' hyperspace travel from the planet Ando, located in the Lambda sector."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A Rebel base"}, {"tag": "p", "text": "During the Galactic Civil War, Tomark II was the site of Chiron Base, a Rebel Alliance facility housing a squadron of starfighters used for hit-and-run attacks on Galactic Empire convoys. Tomark II's galactic location made the world ideal for staging such operations from."}, {"tag": "p", "text": "The Galactic Empire eventually came to suspect Tomark of housing an Alliance Military facility, and by 0 BBY, it and several other worlds with unconfirmed potential Rebel presence were listed as priority targets for the Imperial Death Star superweapon in an Imperial Military report entitled \"IMQ-54544-XX-07 Security Clearance Black DS-1 Orbital Battle Station.\""}, {"tag": "h3", "text": "Departing on a mission"}, {"tag": "p", "text": "At some point during the Galactic Civil War, the Empire initiated a secret operation known as the Ando Project. Unaware of the operation but nevertheless worried by the unusual increase in Imperial activity on Ando, the retired Aqualish Rebel operative Koral-tae contacted the Human Captain Amarith of Chiron Base for help. In response, Amarith summoned a team of the Tomark II facility's resident agents for a mission briefing."}, {"tag": "p", "text": "However, since the captain suspected the presence of traitors at the base, the only verbal instructions she gave to the team were to use her personal space yacht, the Gambit, to leave Tomark II, using the hyperspace coordinates present in the yacht's navigation computer. In addition, Amarith provided the Rebel agents with a holovid, which contained information on their mission and which the team was only to view when its starship was already en route to its destination. Subsequently, the Rebel agents boarded the Gambit and departed Chiron Base, leaving Tomark II for Ando, the destination of their mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tomark II first appeared in \"The Ando Project,\" a roleplaying game adventure authored by Chris Doyle for use with West End Games' Star Wars: The Roleplaying Game and published in the November 1996 Star Wars Adventure Journal 11. The illustrations in the adventure, done by Matt Busch, depict a Mon Calamari as one of Chiron Base's Rebel agents dispatched from Tomark II, however, this article does not treat that as a canonical fact with respect to the Star Wars Legends continuity."}, {"tag": "p", "text": "In \"The Ando Project,\" the player-characters follow the trail of the Ando Project from Ando to an Imperial facility on the moon Uridia. If, after investigating—and possibly sabotaging or even destroying—the facility, the characters manage to escape it and leave the Uridia system, they return to Chiron Base on Tomark II, where they submit their mission report to Captain Amarith and may be commended, depending on their actions on Uridia."}, {"tag": "p", "text": "The 2009 reference book The Essential Atlas placed the Tomark system, and therefore Tomark II, in grid square Q-14. On a map included in the 2012 reference book The Essential Guide to Warfare, the Core Worlds astronomical object Thomork was mislabeled as \"Tomark,\" a proper noun which the 2014 Star Wars: Imperial Handbook: A Commander's Guide also introduced as a shortened designation for Tomark II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}