{"url": "Tomb_of_Ajunta_Pall", "categories": ["Category:Legends articles", "Category:Korriban tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Ajunta Pall"}, {"tag": "p", "text": "The tomb of the first Dark Lord of the Sith Ajunta Pall was constructed by the Dark Jedi Exiles within the Valley of the Dark Lords on Korriban."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "The first of a long line of Dark Lords of the Sith species and the head of the Sith Empire, Ajunta Pall was entombed within the heart of the holy Valley of the Sleeping Kings, later known as the Valley of the Dark Lords of Korriban. While Pall remained buried with his legendary sword, suits of armor, and loyal retainers, the surface of Korriban and the Sith Empire itself suffered. Under the leadership of Dark Lord Naga Sadow, the Empire was utterly ruined during a costly war with the Galactic Republic. As Sadow retreated and a portion of the Empire fled to Dromund Kaas, the Republic's leader Supreme Chancellor Pultimo ordered the destruction of Korriban and saw to the bombing of the Valley of the Dark Lords. The tomb lay buried under sand and rubble for millennia as the spirits of the Sith seethed under the surface of the ruined world."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "Several millennia after the fall of Pall's Empire, Darth Revan returned to the known galaxy with as the head of an Empire and took up residence on Korriban during the Jedi Civil War. When Revan was captured by the Jedi Order and realigned with the light side of the Force, he returned to Korriban in the guise of an acolyte and infiltrated the rebuilt Sith Academy there. During his stay, he explored Pall's tomb fighting through the many tuk'ata which guarded the entrance, as well as some droid protectors. Upon discovering the sarcophagus at the heart of the tomb, Revan was confronted by the spirit of Ajunta Pall. Challenging Revan to select his sword from a group of three weapons on the chamber wall, Revan correctly identified the Dark Lord's ancient weapon and convinced the spirit to put aside its hatred and rejoin the light."}, {"tag": "p", "text": "During the Dark Wars just a few years after the disappearance of Revan his old ally, Meetra Surik returned to Korriban in search of the Lost Jedi; in her search she noted that the tomb of Ajunta Pall had been badly damaged by intense sandstorms and its entrance blocked. Millennia would pass and the tomb would go on hidden under sand and debris as the Sith were driven from the galaxy and the Jedi Order maintained a strict quarantine of the planet."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "p", "text": "When the True Sith Empire returned to Korriban at the beginning of the Great Galactic War, teams were sent into the Valley by Darth Thanaton to excavate the tombs and ruins and restore the Valley to its prestigious existence. Teams entered the tomb of Ajunta Pall and cleared out the rubble as they searched for ancient artifacts and tools of power. By the time of the Cold War, the Sith had largely cleared the hallways of the tomb's three levels and Sith Lord Spindrall had taken up residence in the facility, overseeing the Trials of blood for those apprentices sent to him from the nearby Academy."}, {"tag": "p", "text": "Much to the chagrin of the Empire, the tomb came to house a nest of the quick-to-reproduce k'lor'slugs, a pesky and vicious creature which infested the tomb and the surrounding valley. Tomb looters took advantage of the k'lor'slug plague and rushed into the tomb to steal as many artifacts as they could as the Sith were distracted with their infestation problem. Sergeant Cormun of the Imperial Army led a team into the tomb to kill off the vermin, planting and detonation explosives among the unhatched eggs at the heart of the nest. Within the tomb, a military datapad containing information on Imperial Edict 936 which authorized the use of deadly force against mercenaries looting the tombs and the recovery of stolen artifacts by the same. During the same era, the Emperor's Wrath retrieved one specific Sith blade from the tomb as requested by Overseer Tremel during his training days, and used it to destroy both the droids and the k'lor'slugs inside the tomb."}, {"tag": "p", "text": "By the time of the Galactic Civil War, archaeologists tested Pall's tomb to see if he had in fact been one of the first Dark Lords and discovered that his tomb was one of the oldest burial sites on Korriban."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A stone structure at the heart of the Valley of the Dark Lords, Ajunta Pall's tomb was not located in the cliff faces of the valley like many other tombs. A squat building which stood alone in the shadow of the Sith Academy, the tomb's exterior walls were inscribed with ancient ruins and spells put there by the original members of the Sith Empire."}, {"tag": "p", "text": "Composed of at least three distinct levels, the entrance to the tomb opened into a large central hall with several passageways and cells leading off of it. Stone pillars supported the ceiling while artifacts used by the Dark Lord and his Empire were placed around the cells and halls. One such room served as an armory and contained ancient weapons protected by several droids; one such Sith sword was retrieved by the Emperor's Wrath during the Cold War."}, {"tag": "p", "text": "In an area of the tomb known as the sacrificial chamber Lord Spindrall set up a training area where his acolytes trained in the shadow of towering statues and alters during the Cold War. Spindrall, considered as a hermit and an outsider by many of his peers, was known to spend his days deep in meditation when not instructing his apprentices in the truth of the Sith Code. At the time, the other chambers were filled with scaffolding and excavation equipment used by the Empire in reconstructing the tomb and clearing away debris."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tomb of Ajunta Pall was first featured in the roleplaying video game Star Wars: Knights of the Old Republic and later revisited in its sequel, Star Wars: Knights of the Old Republic II: The Sith Lords."}, {"tag": "p", "text": "The tomb appears in Star Wars: The Old Republic, a massively multiplayer online roleplaying game (MMORPG) by BioWare released on December 20, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}