{"url": "Tomb_of_Naga_Sadow", "categories": ["Category:Legends articles", "Category:Korriban tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Naga Sadow"}, {"tag": "p", "text": "The Tomb of Naga Sadow was a Sith tomb that was built at the behest of the Sith Lord Tulak Hord in the Valley of the Dark Lords on the planet Korriban. Centuries later, it was to be the tomb of the reigning Dark Lord of the Sith, Naga Sadow, but the Great Hyperspace War saw the collapse of the Sith Empire, and Sadow died on the moon Yavin 4. Nonetheless, the structure remained known as the Tomb of Naga Sadow."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The tomb was built for Naga Sadow in the Valley of the Dark Lords, though he never occupied it, as the Sith Lord spent his remaining years in exile on Yavin 4.\nIt housed an ancient Rakatan Star Map built when the Infinite Empire conquered Korriban.\nDuring the Jedi Civil War, the nearby Sith Academy used the tomb as a final testing ground for their students."}, {"tag": "p", "text": "Revan entered this tomb twice; once when he was on his journey to find the Star Forge, but on his second visit—when he had his mind wiped by the Galactic Republic—he confronted and killed the Sith Academy's leader, Uthar Wynn, and redeemed Yuthura Ban, Wynn's Sith apprentice. In 3951 BBY, the Jedi Exile Meetra Surik tried to enter the tomb, but was unable to get inside, as the entrance was blocked by a rockfall. The tomb housed two terentateks, a few wraids, and the remains of Shaela Nuur."}, {"tag": "p", "text": "There were also many items that Revan found there, including Sadow's poison blade, a fire and ice grenade, and a ceremonial Sith lightsaber—which Revan was required to find as part of the final test."}, {"tag": "p", "text": "During the Great Galactic War, the Sith retook Korriban and by the time of the Cold War, both Imperials and Sith thrived in the valley. The tomb was guarded by several ancient droids. Many Sith acolytes went there to complete several tasks assigned by their overseers. Overseer Harkun sent a promising acolyte there to retrieve an ancient map for Lord Zash. However, first the acolyte had to release, by gathering ancient rods, the ancient servant of Tulak Hord, an infamous Dashade called Khem Val, who was also imprisoned in the tomb. When the acolyte released him, after killing countless other rival acolytes, the Dashade attacked the acolyte, enraged, after hearing that his master, Tulak Hord, had died hundreds of years earlier. However, he was defeated and so promised to serve the young Sith. They then retrieved the map, but first had to defeat an ancient guardian beast, a Terentatek Mauler. Later on, a promising warrior was sent by Lord Baras to the tomb to retrieve an ancient lightsaber. There, using the help of a Twi'lek prisoner, he opened a secret chamber inside the tomb, terminated Naga Sadow's ancient droid guardians, and retrieved the lightsaber from his \"grave\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A glitch can occur when in the terentatek room. If the player pulls the lever and runs into the room with the fire and ice grenades before defeating the terentateks, he/she cannot be followed by them. He/she can then attack them without fear of being attacked themselves."}, {"tag": "p", "text": "Rakatan-style monuments can be found in a couple of the rooms, such as the obelisk as monument to Naga Sadow and the stones which contained the special grenades."}, {"tag": "p", "text": "This tomb appears also in Star Wars: The Old Republic, a massively multiplayer online roleplaying game (MMORPG) by BioWare released on December 20, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}