{"url": "Tomb_of_Ludo_Kressh", "categories": ["Category:Legends articles", "Category:Korriban tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Ludo Kressh"}, {"tag": "p", "text": "The tomb of Dark Lord of the Sith Ludo Kressh was constructed by the Sith slaves of the Sith Empire within the Valley of the Dark Lords on Korriban."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Death of Kressh"}, {"tag": "p", "text": "Located within a cave in the upper Valley of the Dark Lords, the tomb of Sith Lord Ludo Kressh was prepared for the death of the Sith Lord circa 5000 BBY. Upon Kressh's death during the attack on Korriban during the Great Hyperspace War, the Sith Lord's body was recovered and interred within the heart of the tomb. Soon after the Sith Empire was utterly ruined by the Republic as Naga Sadow retreated and a portion of the Empire fled to Dromund Kaas. The Republic's Supreme Chancellor Pultimo ordered the destruction of Korriban and saw to the bombing of the Valley of the Dark Lords; the tomb lay buried under sand and rubble for millennia as the spirits of the Sith seethed under the surface of the ruined world."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "p", "text": "During the Dark Wars just a few years after the Jedi Civil War, the former Jedi Knight Meetra Surik traveled to Korriban in search of the Lost Jedi. During her quest she discovered the cavern in which the tomb was located, fighting through nests of shyracks and hssiss in order to enter the crypt via a carved bridge spanning a deep chasm. Guarded by a terentatek, the tomb emanated dark side energies and areas were cursed so as to project illusions into the minds of intruders in order to make them go mad. As Surik explored the caves and the tomb, she noted the dead terantatek which Jedi Knight Revan had killed on his quest to rescue Thalia May from the caves. While Revan had been ignorant to the tomb's existence, Surik was able to enter it and discovered several Jedi corpses. Determining that the Jedi had been driven mad and killed each other, Surik guarded herself from the traps and opened herself to the Force. Inside the antechamber she had a memory of Darth Malak recruiting her and several other Jedi to the Mandalorian Wars; Surik refused to follow him to the dark side, and Malak and the Jedi who joined him, including Bastila Shan, attacked her, but were soon cut down. Deeper into the tomb, she was attacked by shyracks before she faced another memory, this time from the battle of Dxun. In the vision she met some of the Galactic Republic soldiers who served her, all of whom told her that they had to cross a minefield to fight the Mandalorians. Surik walked through the minefield herself, and defeated the Mandalorians on the other side. She encountered a vision of Kreia later on with Atton Rand, Bao-Dur and T3-M4. Inside the burial chamber, she fought a vision of Darth Revan, and, after exploring Ludo Kressh's sarcophagus, she escaped the tomb, this time more powerful and more aware of how her decisions made her who she was."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}