{"url": "Ton-Falk-class_escort_carrier", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Carrier classes", "Category:Galactic Empire starship classes", "Category:Ton-Falk-class escort carriers"], "nodes": [{"tag": "h1", "text": "Ton-Falk-class escort carrier"}, {"tag": "p", "text": "The Ton-Falk-class escort carrier, also known as Imperial escort carrier, was a transport ship designed to carry Imperial starfighters."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A standard Imperial chute system provided for rapid deployment of TIE Series starfighters and an onboard hangar allowed for minor repairs. The escort carrier was the smallest vessel that could carry a full wing of starfighters (6 squadrons of up to 72 craft). The ship also carried six shuttles, and could carry four more for each fighter squadron removed."}, {"tag": "p", "text": "Armament included ten Taim & Bak H8 dual laser cannons and one Krupx VL-6 warhead launch system. Though a capital ship, it was poorly armed and protected relative for its size, so it stayed to the rear of battle for its own safety while allowing its TIE fighters to engage the enemy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Designed and built by Kuat Drive Yards, the Ton-Falk-class escort carrier allowed the Imperial Navy to overcome the hyperdrive deficiency of its primary starfighters in the early years of the Galactic Civil War. The need for them was seen following the Battle of Ton-Falk, and the craft was named for that pivotal battle."}, {"tag": "p", "text": "Being purpose-built, escort carriers were much more economical to deploy than an Imperial Star Destroyer. Higher priority convoys often had an escort carrier, along with an EF76 Nebulon-B escort frigate and CR90 corvettes."}, {"tag": "p", "text": "It was also common for escort carriers to perform mini-hyperdrive jumps within a system, dropping off a squadron of starfighters with each exit. This tactic made it difficult for Rebel Alliance or pirate pilots to predict where the next attack would come from.\nIn addition to the Empire, some ships were appropriated by the Rebel Alliance as well and added to their navy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The escort carrier bears a name very similar to that of the Imperial escort carrier featured in Star Wars: Rogue Squadron III: Rebel Strike. Wedge Antilles's unfamiliarity with the name used by General Crix Madine for the starship in the latter game suggests that neither the Storm Commando vessel seen in Rebel Strike nor the standard Imperial Navy starfighter transport seen in TIE Fighter and its sequels were generally deployed (at least in operations Antilles might have been familiar with) prior to the raid at Bakura."}, {"tag": "p", "text": "The Corporate Sector Authority Picket Fleet was said to make use of an imperial-acquired escort carrier design, which likely refers to this class as the Ton-Falk designation did not exist yet."}, {"tag": "p", "text": "It was designated as the Ton-Falk-class in 2014's roleplaying game sourcebook Stay on Target."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}