{"url": "Tomer_Darpen/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance Starfighter Corps personnel", "Category:Alliance to Restore the Republic members", "Category:Diplomats", "Category:Humans", "Category:Males", "Category:New Republic Intelligence personnel"], "nodes": [{"tag": "h1", "text": "Tomer Darpen"}, {"tag": "p", "text": "Tomer Darpen, sometimes known as Ejector Darpen, was a Human male from Commenor who was a career diplomat serving with the New Republic Diplomatic Corps and later New Republic Intelligence. He initially served as a pilot during the early years of the Galactic Civil War as a member of the Tierfon Yellow Aces, a starfighter squadron which was equipped with Y-wings, prior to the Battle of Yavin. Dispatched to the newly-rediscovered planet of Adumar in 13 ABY as part of a diplomatic mission and head of the local NRI office, he was tasked with assisting the delegation, led by General Wedge Antilles, in swaying the government into allying itself with the New Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The Human male Tomer Darpen was a native of Commenor. While serving a brief stint with the Tierfon Yellow Aces, he earned the nickname \"Ejector Darpen\" after an involuntary exit from a damaged BTL Y-wing starfighter that he had managed to crash-land on the low-gravity moon that his unit was using as a base at the time. Wes Janson, who served alongside Darpen in the Yellow Aces, recalled that he was always one step above being an outright black marketeer, and figured that he had \"gone smuggler\" after mustering out of the unit. Darpen transferred to the New Republic Diplomatic Corps soon after, where his talents for persuasion and manipulation could be put to more productive use."}, {"tag": "h3", "text": "Diplomatic career"}, {"tag": "p", "text": "Eventually, his career path brought him into New Republic Intelligence, where he would meet Janson, now a major, again on Adumar in 13 ABY, where he was part of a four-man team of renowned pilots, led by General Wedge Antilles and including Colonel Tycho Celchu and Major Derek \"Hobbie\" Klivian. The team had been sent to negotiate the newly-rediscovered planet's entry into the New Republic through aerial duels with the pilot-obsessed Adumari. Unknown to the delegation, however, Darpen was misleading the pilots about circumstances on Adumar that bordered on and even crossed into outright lying."}, {"tag": "p", "text": "During this time Darpen was also serving as the regional head of Intelligence on Adumar and, though he didn't reveal this role, he frequently clashed with General Antilles on how the negotiations, which turned out to be little more then public demonstrations of skill and \"honor\", should take place. Antilles deplored the immoral pandering to the Adumari version of heroism or of how they purchased \"honor coupons\" with other peoples' blood. However Darpen would insist, frequently and vehemently, that the delegation use the tactics of Turr Phennir and his pilots from the 181st Imperial Fighter Wing who were serving as the Imperial delegation to Adumar. Prior to this the members of Red Flight had been using powered-down lasers and simulated \"paint\" missiles to conduct practice duels with a variety of Cartannese flightknives, a local variant of a starfighter squadron, a tactic which, while at first ineffective, soon drew the attention of a number of Adumari pilots. Included among them was the eldest son of Cartann's reigning monarch, though no one knew it at the time."}, {"tag": "p", "text": "Realizing that his control of the situation was slipping from his grasp after Antilles refused to fly alongside the Cartannese air force during Perator Pekaelic ke Teldan's war to forcibly unite his world's nations, Darpen tricked the ruler into believing that Antilles and his pilots wanted an honorable death in combat to avoid the shame of having to refuse. Despite having to run a gauntlet of hundreds of armed would-be assassins and the pursuit of thirty Cartannese Blade-32s, Red Flight managed to escape and made their way to an apartment being used by NRI agent Iella Wessiri, who was next on Darpen's list of people to kill in order to save face. With the help of former sludgenews journalist Hallis Saper, who had found out about Darpen's many deceptions while performing her duty as mission documentarian, the pilots were able to convince Iella to abandon her post and turn against Darpen, who had been her superior."}, {"tag": "p", "text": "After the brief civil war that occurred subsequent to the New Republic delegation being smuggled into the Yedagon Confederacy and the attempted Imperial invasion, the diplomat was arrested and given a choice between New Republic and Adumari justice, choosing the former. To help him with this choice, Antilles and Celchu put blasters to his head; Antilles then told the man to pick an option before Celchu had a sudden finger spasm."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During his time with the early Rebel Alliance, Tomer Darpen was known to be a gambler and profiteer. Considered barely above being a smuggler and outright con man, Darpen was always running a floating sabacc game, was known to always have liquor, as well as any number of \"rare\" items, available for sale in addition to any number of other schemes. A barely adequate pilot, it was not known if Darpen ever had any kills to his credit before he transferred out of the Yellow Aces. Deceitful and manipulative by nature, Darpen was a natural candidate for New Republic Intelligence, which he became a part of in concurrence with his Diplomatic Corps service. Darpen was a skilled liar who possessed few scruples; he was not afraid to sacrifice the lives of men who were perhaps the greatest starfighter pilots in the galaxy just to save his own career. Darpen was also something of a coward, preferring to mask his deceptions within deceptions and playing his cards very close to his chest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tomer Darpen was created by Aaron Allston for the novel X-Wing: Starfighters of Adumar. He was later given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}