{"url": "Tomb_of_Kujet", "categories": ["Category:Canon articles", "Category:Structure stubs", "Category:Dathomir locations", "Category:Palaces", "Category:Zeffo tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Kujet"}, {"tag": "p", "text": "The Tomb of Kujet, also known as Kujet's Tomb, was a Zeffo palace on Dathomir that served as the burial site of the Zeffo Sage Kujet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built as a secluded seat of power for the Zeffo ruler Kujet, the great structure was a fortress designed for sacrifice and death. Kujet's rule was notable for their ruthless nature, and embrace of the dark side of the Force. While promising their followers great power, Kujet would cast his enemies into the great pits that lined the throne room of the Dathomir Palace."}, {"tag": "p", "text": "Kujet massacred a great number of rebel forces in the halls of his palace, their bodies frozen in perpetual screams of agony, clawing at the walls in an effort to escape. After Kujet's death, his body was entombed inside a vertical sarcophagus and murals depicting the brutality of his reign lined the tomb. In his hands, Kujet held one of the few remaining astriums, a relic Kujet greatly coveted."}, {"tag": "p", "text": "Centuries after the tomb was abandoned and lost to history, the Nightsisters of Dathomir continued to feel the darkness of the place, avoiding its haunted ruins. When Jedi Master Eno Cordova attempted to unlock the tomb's secrets, he was repelled by the evil pall that hung in the air, and abandoned his search. After the Clone Wars and the fall of the Jedi Order, former Jedi Taron Malicos infiltrated the palace and succumbed to the malignant energies of the tomb. Forming a legion of sycophants from the Nightbrothers that occupied the ruins, Malicos attempted to convert the Padawan Cal Kestis to darkness, but was ultimately struck down in the halls of the ancient palace by Kestis and the Nightsister Merrin. Before leaving, Kestis, who had been plagued by visions of his dead Master Jaro Tapal while in the ruin, retrieved the Astrium from Kujet's corpse in his quest to unlock the Zeffo vault on Bogano."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tomb of Kujet first appeared in the 2019 video game Star Wars Jedi: Fallen Order, developed by Respawn Entertainment. The tomb was designed for the player to experience Kujet's brutal reign through visual storytelling. Explorations led designers to a visual language which combined towering Brutalist statues with Rodin-style murals, along with clean lines and angular walls reminiscent of ancient Egypt. Concept art for the tomb was done by George Rushing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}