{"url": "Tomb_of_Darth_Bane", "categories": ["Category:Canon articles", "Category:Moraband locations", "Category:Sith tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Darth Bane"}, {"tag": "p", "text": "The tomb of Darth Bane was the burial place of Darth Bane, the ancient Dark Lord of the Sith who created the Rule of Two and died almost a millennium before the Clone Wars."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The tomb of Darth Bane was located in the Valley of the Dark Lords on the planet Moraband, the ancient Sith homeworld, and was part of the largest structure in the valley. A colossal statue of Bane in his Sith armor was erected at the far end of the massive burial chamber. Bane's stone sarcophagus served as a secret entrance to a chamber used by the ancient Sith to sacrifice Jedi."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Death of Bane"}, {"tag": "p", "text": "After the end of the Jedi-Sith War, Darth Bane was the sole surviving Sith. He created a new Sith philosophy, the Rule of Two, mandating that only two Sith—a master and an apprentice—could exist at any given time. Bane took on an apprentice of his own, Darth Zannah, and began passing on his knowledge. After Bane's rumored death by his apprentice, his remains were placed into a sarcophagus. Bane was the last Sith Lord to be buried in the Valley of the Dark Lords on Moraband prior to its abandonment."}, {"tag": "h3", "text": "Yoda's Mission to Moraband"}, {"tag": "p", "text": "During the Clone Wars in 19 BBY, the Grand Master of the Jedi Order Yoda traveled to Moraband in order to discover the secrets of immortality. After entering tomb of Darth Bane, Yoda encountered a vision of the ancient Sith Lord. The Sith specter attempted to convince the Jedi Master to turn to the dark side but Yoda refused him. Bane's spirit disappeared into the sarcophagus and Yoda continued on his journey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tomb of Darth Bane made its first appearance in \"Sacrifice,\" an episode in the sixth season of the animated television series Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}