{"url": "Tomb_of_Tulak_Hord", "categories": ["Category:Legends articles", "Category:Korriban tombs"], "nodes": [{"tag": "h1", "text": "Tomb of Tulak Hord"}, {"tag": "p", "text": "The tomb of the famed Dark Lord of the Sith Tulak Hord was constructed by the Sith of Korriban within the Valley of the Dark Lords during his reign as leader of the Sith Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Death of Hord"}, {"tag": "p", "text": "Carved into the rock face of the upper valley, the tomb of Sith Lord Tulak Hord was prepared for the death of the Sith Lord circa 5300 BBY. Upon Hord's demise his body was interred and the tomb sealed. Following the Empire's failed invasion of the Galactic Republic circa 5000 BBY, the Valley and Hord's tomb were utterly ruined during the costly war with the Republic. As Sith Lord Naga Sadow retreated and a portion of the Empire fled to Dromund Kaas, the Republic's leader Supreme Chancellor Pultimo ordered the destruction of Korriban and saw to the bombing of the Valley of the Dark Lords. The tomb lay buried under sand and rubble for millennia as the spirits of the Sith seethed under the surface of the ruined world, waiting for the Empire to return."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "Several millennia after the fall of the Empire, Darth Revan returned to the known galaxy as the head of an Empire and took up residence on Korriban during the Jedi Civil War. When Revan was captured by the Jedi Order and realigned with the light side of the Force, he returned to Korriban in the guise of an acolyte and infiltrated the rebuilt Sith Academy there. During his stay, he explored Hord's tomb fighting through the many tuk'ata which guarded the entrance, as well as some droid protectors. The academy's former Headmaster Jorak Uln had taken up residence by that time after being overthrown by his apprentice Uthar Wynn. He kidnapped Sith students such as Mekel, and brought them to the tomb to be tortured and die. When the redeemed Revan explored the tomb, he was knocked out by Jorak Uln and taken to the burial chamber where Revan allowed himself to be tortured instead of Mekel by not answering Uln's questions correctly. Grateful, Mekel helped Revan kill Jorak Uln, and Revan convinced Mekel to turn back to the light and abandon the Sith."}, {"tag": "p", "text": "During the Dark Wars just a few years after the disappearance of Revan his old ally, Meetra Surik returned to Korriban in search of the Lost Jedi; in her search she noted that the tomb of Tulak Hord had been badly damaged by intense sandstorms and its entrance blocked. Millennia would pass and the tomb would go on hidden under sand and debris as the Sith were driven from the galaxy and the Jedi Order maintained a strict quarantine of the planet."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "p", "text": "When the True Sith Empire returned to Korriban at the beginning of the Great Galactic War, teams were sent into the Valley to excavate the tombs and ruins and restore the Valley to its prestigious existence. Teams entered the tomb of Tulak Hord and cleared out the rubble as they searched for ancient artifacts and tools of power. By the time of the Cold War, the Sith had largely cleared the hallways of the tomb and discovered the ruined atrium which lay behind the main wall of the Valley."}, {"tag": "p", "text": "Much to the chagrin of the Empire, the tomb came to house a nest of the quick-to-reproduce k'lor'slugs, a pesky and vicious creature which infested the tomb and the surrounding valley. Tomb looters took advantage of the k'lor'slug plague and rushed into the tomb to steal as many artifacts as they could as the Sith were distracted with their infestation problem. Rebellious slaves staged assaults on Sith teams working in the tomb, forcing the Academy to dispatch Sith troopers to patrol the tomb and protect the workers. The archaeologist Ephran Zell took it upon himself to investigate the atrium's different facilities during the Cold War era. Stationed at the entrance to the tomb, he tasked a passing acolyte to enter the chambers housing the Red Engine and the Archives of Hord to unlock all of the Sith's secrets. Simultaneously the acolyte was commissioned by Lord Zash to recover a special text hidden in the tomb and divided between three tablets in three different chambers. Later a promising warrior had to bring back the shards of an ancient Sith tablet scattered throughout the tomb for his new master, Darth Baras."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A sprawling complex set deep in the northern cliffs of the upper Valley of the Dark Lords, the tomb of Tulak Hord had its entrance in the main valley across the way from the tomb of Naga Sadow. The entrance to the tomb was simple and small, opening into a series of hallways stemming from a central antechamber. The hallways ultimately emptied out into a large open-air atrium which housed several statues and monuments to Hord, along with the entry ways to his Archives and the Machine Vault. Within the Archives, Sith Lord Sundar had taken up residence with several acolytes during the Cold War until he was slain by an acolyte from the academy. The nearby Machine Vault held the massive Red Engine created by Hord himself to hold his darkest secrets. The Machine hung from the ceiling over an alter which required the blood of the chamber's beasts in order to activate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Knights of the Old Republic there is also the non-canon dark side option of answering Jorak Uln's questions correctly, thereby causing Mekel to be tortured and killed. The player character then has the option to loot the remains."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}