{"url": "Battle_of_Talay", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Dufilvian sector", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Battle of Talay"}, {"tag": "p", "text": "The Battle of Talay was one of the earliest battles of the Great Galactic War between the Sith Empire and the Galactic Republic. Occurring sometime between 3681 BBY and 3680 BBY, the Empire launched its first incursion into the galaxy's Mid Rim, but was met with defeat. Broysc, a military officer who would later become a Moff, commanded the Imperial forces during the conflict at Talay only to watch the battle conclude in a Republic victory."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Sith Empire returned from hiding in the Unknown Regions of the galaxy in 3681 BBY. Their return sparked the Great Galactic War with the Galactic Republic, which began with the Imperial subjugation of the Outer Rim Territories through coercion, swift and strategic strikes, and massive invasion forces. In these early years the primary Imperial war strategy was focused on securing the Outer Rim before moving toward the Galactic Core of the Republic. Despite that plan, at some point prior to 3680 BBY, the newly instated commanding officer Broysc would be among the first to attempt to penetrate the Republic worlds of the Mid Rim."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In his first command capacity, Broysc led his forces to Talay, a planet in the Dufilvian sector. The incursion was unsuccessful, and the Sith forces were overcome by Republic defenders."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In spite of the loss of his first command engagement, Broysc retained his officer status and ultimately earned the rank of Moff by 3653 BBY. However, the promotion did not reflect an improvement in command ability, and Broysc's incompetence was only amplified as he descended into dementia throughout the Cold War. The aging Human's addled mind was no longer able to properly reconstruct and recall the events of his earlier life, including the Battle of Talay. While harassing his former subordinate Malavai Quinn, Moff Broysc insisted that Quinn was responsible for the loss at Talay decades prior. Regardless of the Moff's insistence, Quinn had not yet been born when the battle occurred, making it impossible for him to have participated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Great Galactic War's Battle of Talay was first mentioned in Star Wars: The Old Republic, a video game from BioWare and LucasArts that was released in 2011. The battle is referenced in-game by Broysc during a cutscene of a holocommunication with the Moff. The conversation is included as part of the Sith Warrior's quest storyline for companion Malavai Quinn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}