{"url": "Battle_of_Talus", "categories": ["Category:Legends articles", "Category:Battles in the Corellian sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Talus"}, {"tag": "p", "text": "The Battle of Talus occurred during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "With direct orders from the Emperor himself, Imperial Special Forces had established a head hunter squadron on the planet of Corellia. Their mission was to seek out and destroy a secret Rebel base on the nearby Talus. Long rumored to be just a reconnaissance post, the Imperials had learned that the base instead acted as a launching point for Rebel sabotage efforts in the Corellian system and was harboring one of the last known Jedi Knights, Rachi Sitra. At the Imperial Academy on Raithal, a week-long briefing was held about an upcoming operation in the Corellian system. The Academy was even attacked by Alliance forces, who tried to disrupt the planning, but were repelled."}, {"tag": "p", "text": "At the Imperial headquarters on Corellia, an attack was being planned on the base. Onyx Squadron, a group of TIE bombers, was going to escort a flight of landing craft to land near the Rebel base. It was hoped that a sudden strike, carried out in secrecy, would disable the Rebel operations. However, the Rebel spies managed to acquire the plans for the operation. A lone operative in a Z-95 Headhunter landed near Imperial outpost and was able to sneak in through an unguarded entry point previously scouted by Rebel agents. Inside the outpost, he was able to download the planning documents for the upcoming operation and, after a quick firefight with Lieutenant Jeffren Brek, made a hasty escape with the information. Having analyzed the data, the Rebels concluded that they could not properly defend the facility and prepared to evacuate all personnel."}, {"tag": "h3", "text": "Initial assault"}, {"tag": "p", "text": "The quickly assembled Imperial strike force traveled to Talus, where Onyx Squadron laid down a barrage that allowed the transports to land beside the Rebel facility. Imperial troops disembarked and immediately engaged the Rebel defenders. However, the Imperials were caught by a surprise when a group of Jedi, led by Rachi Sitra, joined the fight. The Imperials had already engaged the Rebels at the base, but the band of Jedi was too much for their forces. The combined troops of the Rebel Alliance and their Jedi supporters had successfully defended their base on Talus, and the Imperials were forced to retreat back to the Imperial outpost. The defenses available to the Rebel base were severely underestimated, and the Imperials considered themselves lucky to conduct a successful retreat."}, {"tag": "h3", "text": "Garrison attack"}, {"tag": "p", "text": "While the Imperial forces were forced to fall back, the retreat was in good order. The damage to the troops and facilities at the Rebel base had thinned the ranks of the defenders there. It was the unexpected presence of the Jedi, both their numbers and their tenacity, which doomed the operation. However, before the troops could get a night's rest, the blaring of alarms throughout the Imperial outpost signaled a Rebel counterattack. Barn Sinkko, who only recently arrived at the outpost, had jumped into the fray and began organizing the defenses. The Rebel attack force, led by captain Coret Bhan, consisted of Rebel commandos, supported by heavy troopers and Y-wing bombers. All available Imperial soldiers rushed to defend the outpost, while Snopel made sure that they were deployed correctly. The defense of the barracks and armory of the Imperial outpost was successful. As Imperials began to make headway against the Rebels, captain Bhan gave the order for the Alliance forces to fall back. The Rebels quickly escaped back to their base, while the Imperials were in no shape to pursue them."}, {"tag": "h3", "text": "Second assault"}, {"tag": "p", "text": "The next morning the Imperials saw the arrival of reinforcement troops and TIE/LN starfighters to bolster the upcoming second assault. A coordinated assault was planned, including two squadrons of TIEs operating in concert with troops on the surface of the moon itself. Later that same night, the operation began. The TIEs had detected a group of transports evacuating from the Rebel base and gave chase, but the ground troops reported that most of the Alliance personnel on Talus had already escaped."}, {"tag": "p", "text": "In a battle against the escorting Y-wings, the TIE fighters managed to hit several the Rebel transports, forcing them down in a remote part of Corellia. A landing craft was redeployed and headed for the location of the evacuated Rebels. The troops on Talus reported that the Rebel base was sparsely defended and was already in Imperial hands. The evacuees in the shuttles remained as the only Rebel presence in the Corellian system. One group of grounded rebels, which included Luke Skywalker, put forth a stable defense, but the Imperials pressed on and prevailed. Skywalker and his companions were able to escape in a hastily-repaired Y-wing before they could be chased down. Another group, led by Rachi Sitra, was confronted by the troopers led by none other than Darth Vader himself. The fight was fierce and brutal, with heavy casualties from both sides, but eventually Sitra provided a distraction long enough for the remaining forces to escape into the wilderness and eventually to reach a local spaceport."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Only a handful of Rebels and Jedi were apprehended during the mission. Despite the crash landing and attack of the Dark Lord, most of the Rebels and Jedi survived. Even though the Rebel base on Talus was destroyed, key personnel have been evacuated and soon reconnected with the main Alliance forces. With the destruction of the Rebel base on Talus and the victory over the escaping Alliance troops on Corellia, the entire system was thought to be cleansed of Rebel presence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle is featured in both Light Side and Dark Side scenario campaign of Squadrons Over Corellia, the second expansion of the Star Wars Galaxies Trading Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}