{"url": "Tonin", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Masculine programming", "Category:R2-series astromech droids", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Tonin"}, {"tag": "p", "text": "Tonin (\"Little Atton\" in an Aldivian dialect) was an R2-series astromech droid owned by Gara Petothel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Gara Petothel, under the guise of Lara Notsil, destroyed Atton Repness's smuggling ring aboard the training frigate Tedevium, she was assigned Repness's former X-wing and astromech droid—both of which were top-of-the-line. After wiping the droid's memory, she renamed him Tonin, which meant \"Little Atton\" in an Aldivian dialect. Tonin was a silver-white droid with blood-red trim, and he had all the latest tools and upgrades found in late-model R2 units."}, {"tag": "p", "text": "Tonin had a unique personality, and he developed an attachment to Petothel. When she was forced to flee Wraith Squadron, Tonin went with her. She modified his systems to disguise her true intentions—to sabotage Iron Fist. Tonin worked toward Petothel's objective while she performed her duties as one of Zsinj's intelligence officers. He took control of a large number of MSE-6-series repair droids, and directly sliced into Iron Fist's main computers."}, {"tag": "p", "text": "Tonin came to the conclusion that he was smarter than Iron Fist's computers, and he may have been correct. In his role as \"king of the droids,\" Tonin managed to gather valuable intelligence on Iron Fist and take control of vital systems. At the end of the Battle of Vahaba, Tonin modified Iron Fist's navigation computer data to strand the ship in the Selaggis system. He then ordered his army of mouse droids to disable the warship's hyperdrive system. As Zsinj's engineers worked to restore hyperdrive capability, Tonin joined the Project Chubar escapees in fleeing the Battle of Selaggis."}, {"tag": "p", "text": "Tonin and Petothel were last known to be on Corellia, where they intended to use a stolen Sentinel-class landing craft to start a shipping business with Kolot, an Ewok pilot who Petothel rescued from the Iron Fist."}, {"tag": "h2", "text": "Appearances"}]}