{"url": "Battle_of_Taral_V", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Battles in the Calamari sector", "Category:Battles of the Galactic War"], "nodes": [{"tag": "h1", "text": "Battle of Taral V"}, {"tag": "p", "text": "As the peace from the Treaty of Coruscant began to dissolve in 3641 BBY, the Jedi Master and Republic Fleet Admiral Oteg was contacted by the spirit of the long-dead Jedi Meetra Surik. Surik implored Oteg to rescue a vital Jedi prisoner from the Maelstrom nebula, as the prisoner possessed information on the Sith Emperor himself. To that end, Oteg gathered an elite strike team of troopers, Jedi, and other Republic-allied individuals to attack the Imperial fortress on the planet Taral V to recover a computer designed by the Gree species that would allow the Republic fleet to navigate the Maelstrom."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the aftermath of the Sith Lord Darth Angral's campaign of vengeance against the Galactic Republic, as well as other proxy conflicts, the tenuous peace brought about by the Treaty of Coruscant began to fracture. Both the Republic and the Sith Empire began preparing for war. It was around this time that the Jedi Master Oteg, a former member of the Jedi Council and a Fleet Admiral of the Republic Navy, received a visit from the Force ghost of Meetra Surik. Surik had been killed over three centuries earlier during a failed attack on the Sith Emperor, and ever since she had been lending her strength to her ally Revan as the Emperor fed off of Revan's strength and knowledge."}, {"tag": "p", "text": "Surik gave Oteg knowledge of Revan's predicament, and asked that the Jedi Master rescue him from his prison in the unnavigable Maelstrom nebula. To reach the prison, Surik told Oteg to recover an astrogation computer on Taral V—a computer designed by the mysterious Gree species. To that end, Oteg gathered an elite strike team of Jedi, Republic troopers, and other Republic-allied individuals to retrieve the computer."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Using a stolen Imperial shuttle, the strike team landed on Taral V near the main Imperial fortress. They then made their way up to the fortress' security outpost, fighting through the various Imperial soldiers, jurgorans, gundarks, and Imperial commandos that crowded their path. Handler Gattan and his pet vine cats were killed in the process, and strike team's assault on the security outpost saw them destroy several Imperial war droids and eliminate over a dozen defenders. Captain Shivanek's futile last stand and death enraged his pet jurgoran Ripper, forcing the strike team\nto kill the large creature before deactivating the fortress' outer defenses. They then proceeded further up the path and crossed the bridge to main fortress."}, {"tag": "p", "text": "Within the fortress the strike team engaged a number of Imperial troops and additional jungle animals. After crossing a heavily defended bridge they moved into the fortress proper. After defeating Doctor Zharen and Lord Hasper they fought a power war droid at the entrance to the internal corridors. The strike team then confronted Kilran via hologram. The Imperial Moff declared his intention to bombard the fortress from orbit, but the strike team continued their mission despite this obstacle."}, {"tag": "p", "text": "Fighting through additional Imperial soldiers and Sith Warriors the strike team reached the center of the fortress where they faced General Edikar and a group of turrets. The general was defeated, and the team confronted an Imperial researcher in possession of the Gree computer. The computer was handed over, but only after the strike team agreed to allow Imperial forces mapping the Maelstrom to evacuate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}