{"url": "TopWorld", "categories": ["Category:Real-world articles", "Category:Living Force adventures"], "nodes": [{"tag": "h1", "text": "TopWorld"}, {"tag": "p", "text": "TopWorld was a year one (31 BBY) Living Force adventure. It was part one of the Between the Worlds trilogy, written by Morrie Mullins. The adventure premiered in March 2001."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "When the mysterious alien Nirama came into control of the organized crime within the Cularin system, he abolished the slave trade within the system. Slavery was a lucrative business, and this decision, along with some others, was unpopular with segments of the Cularin underworld who felt that potential profits were going to waste."}, {"tag": "p", "text": "In 31 BBY, Nirama became aware that the forces within his Organization opposed to his leadership were coming together. Looking to nontraditional resources to investigate the situation, he called upon a group of people who had recently been proclaimed heroes on the planet Cularin for their roles in uncovering the illegal activities of the Metatheran Cartel. Bringing them to his asteroid base under the guise of being new recruits, he asked the heroes to go undercover and try to get recruited by the conspirators and find out some information on them."}, {"tag": "p", "text": "Convinced that Nirama was the lesser of two evils, with him being fairly nonviolent and opposed to slavery, the heroes agreed to become Nirama's spies. Put in guard uniforms, they were told to patrol the Red Sector. Though weapons were illegal on the asteroid, Nirama gave them hold-out blasters for emergency use. Having a lot of down time between their patrols, the spies spent much of their time in the Hutt's Tail cantina. There they met an old Twi'lek named Vel Pastar, who seemed to be fine with Nirama's policies, but was gauging the spies' answers to his own questions to see if they might be worth recruiting."}, {"tag": "p", "text": "That night, the spies were awoken in the middle of the night by a number of individuals dressed all in black, with black hoods. The hooded individuals escorted them to a storage facility in a part of the Red Sector which was not used during the night shift. Conducted on opposite sides of a wall of boxes, the spies had a conversation with the leadership of the anti-Nirama faction under the gaze of 60 people on catwalks. Finding out the conspiracy was calling itself the Cell, the spies managed to convince the Cell of their conviction to join, so the Cell moved on to testing their skills."}, {"tag": "p", "text": "The recruits were taken to an abandoned restaurant called Mokada's Place. With around 300 Cell members watching, the recruits were first tested as a group by being faced with a juvenile rancor named Bender. The recruits realized the rancor just wanted to play and were able to subdue it. Then the recruits were tested individually on the skills they claimed to be best at. After the tests, the spies were returned to their quarters."}, {"tag": "p", "text": "The next day, when they stopped in the Hutt's Tail, the spies received a note saying \"You're in.\" Late in their shift, they were assaulted by a group of Trandoshan Cell members who had discovered that the recruits were spies. In defending themselves from the Trandoshans, some of the spies used their hold-out blasters, and Nirama's personal security arrested them quickly after the fight was through."}, {"tag": "p", "text": "Soon after their arrest, they were taken before Nirama. They told him what they had learned about the Cell and about Bender's location, earning his favor. Those Cell members who had been used to test the spies were soon found dead. Nirama sent his spies home, putting out rumors that they were being punished by putting them to work throughout the system, something which he often did. As they left, he let the heroes know that he would like the option to call upon them again soon."}, {"tag": "h2", "text": "Appearances"}]}