{"url": "Topato_stew", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:The Official Black Spire Outpost Cookbook recipes", "Category:Soups and stews"], "nodes": [{"tag": "h1", "text": "Topato stew"}, {"tag": "p", "text": "Topato stew, also called topato soup, was a type of stew made from the fruit topato that was consumable by humans and Artiodacs. This aromatic, stove-simmered light green broth could be served in bowls with a garnish of black seeds and minced green herbs. While at Kat Saka's farm on the Outer Rim planet Batuu around 34 ABY, the farmer Shari offered some topato stew to her former colleague, Julen Rakab, which he accepted."}, {"tag": "p", "text": "The mother of the chef Strono Tuggs taught him how to make topato stew after witnessing his growing passion for cooking. He was fond of the classic soup, and served it from his traveling diner, Tuggs' Grub, while it was stationed in Docking Bay 7 Food and Cargo on Batuu. Tuggs included a recipe for topato stew in his cookbook The Official Black Spire Outpost Cookbook at some point after the Battle of Takodana in 34 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Topato stew first appeared in the new Star Wars canon in A Crash of Fate, a 2019 young-adult novel written by Zoraida Córdova. The dish was first pictured and first identified as topato soup in the recipe book Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, which was authored by Chelsea Monroe-Cassel and Marc Sumerak, released later the same year. The out-of-universe recipe for topato stew uses olive oil, minced clove garlic, medium yellow onions, green salsa, chicken broth, potatoes, baby spinach leaves, heavy cream, salt, and pepper. In the Star Wars Legends continuity, topato soup first appeared in Fate of the Jedi: Conviction, a 2011 novel written by Aaron Allston."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}