{"url": "Toong/Legends", "categories": ["Category:Legends articles", "Category:Outer Rim Territories species", "Category:Spacefaring species", "Category:Toong"], "nodes": [{"tag": "h1", "text": "Toong"}, {"tag": "p", "text": "The Toong were an anti-social species of aliens from the planet Toong'L. In comparison with many other humanoids, their heads were disproportionately large for their bodies. Their home planet, Toong'L, was devastated by a collision with a poisonous comet shortly before 32 BBY, and the surviving Toong were forced to relocate to the neighboring planet of Tund."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Toong spoke the language Toongese. The Toong had long gangly legs, no neck, and bulbous bodies. Their eyes were high on their pointed forehead, and their cheeks were jowled. Toong could store food in their cheeks, much like the rodents they were assumed to have evolved from."}, {"tag": "p", "text": "Toong exhibited severe nervousness and agoraphobia. Weak-willed and frightened of confrontation, Toong almost always gave in to an aggressor when threatened. Toong only truly felt safe when around immediate family. They, however, were not cowards; they simply dreaded interaction with other sentient creatures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The species was barely beginning their first steps toward exploring their home system when they were discovered by the Galactic Republic. The appearance of other sentient life, with technology far more advanced than their own, threw the Toong homeworld into utter chaos. As a result, a world war triggered. This came as a shock to the first contact specialist who had observed the species and documented them as being peace-loving and outgoing. It took weeks to re-establish contact with the Toong. It took the intervention of the Jedi and the first contact specialist from Coruscant to stop the massive warfare that was threatening to doom the species."}, {"tag": "p", "text": "After joining the Old Republic, the Toong began rapidly advancing their technology. Reluctantly leaving their own system, the Toong scattered colonies throughout the galaxy. Perhaps the most famous of these was Ben Quadinaros. As a podracer pilot, he competed primarily in the Pouffra Circuit but he also had one disappointing attempt at the Boonta Eve Classic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}