{"url": "Battle_of_Taul", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Taul"}, {"tag": "p", "text": "The First Battle of Taul took place between the Galactic Empire and the Rebel Alliance on the misty swamp world of Taul."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Empire had largely ignored the swampy world of Taul and was unaware of the existence of a small Rebel base there. The Empire discovered the Rebel presence by chance. One of the probe droids sent out by the Empire in search of the Rebel base on Hoth was dispatched to Taul. When the Empire lost contact with the droid, they sent the Victory-class Star Destroyer, the Dominator to investigate the matter."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Dominator arrived out of hyperspace in the morning local time, and immediately began dispatching troops to the surface of the planet. Due to the conditions of the battlefield, the Empire did not use heavy walkers, but deployed battle skiffs, attack droids, swamptroopers, and repulsorlift-equipped spacetroopers instead. The repulsorlift-based battle platforms and troops made it easier for the Imperials to traverse the swampy terrain."}, {"tag": "p", "text": "The Rebels were better equipped for the conditions, and the Imperials suffered from various technical problems with their battleskiffs and spacetroopers. The battle went stalemate for a while with heavy causalities on both sides."}, {"tag": "p", "text": "Realizing that they probably would not stand a chance in the end, the Rebels initiated an evacuation process, and the battle developed into a desperate chase for the Rebel leaders, Krendan, Maidtha Fait, and Warl Thimbus and their respective squads before they could reach their transports."}, {"tag": "p", "text": "Eventually, the Imperials managed to infiltrate the Rebel command center and destroy its shield generator which allowed the Dominator to initiate a planetary bombardment, laying the Rebel base to waste."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Empire emerged victorious, but at great costs. In addition, several Rebel transport ships managed to escape the surface of the planet. These were pursued by the Dominator. Before the departure of the Star Destroyer, a team of Imperial troops were dispatched to the planet to find and destroy any possible remaining Rebel survivors. The operation developed into a skirmish."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}