{"url": "Torture/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Society and culture", "Category:Torture"], "nodes": [{"tag": "h1", "text": "Torture"}, {"tag": "p", "text": "Throughout the galaxy, any practice by which severe pain and/or suffering was inflicted on a being, whether physical or mental, was considered torture."}, {"tag": "p", "text": "Torture was used for such purposes as obtaining from the subject or a third party information or a confession, or as punishment for an act an individual had or was suspected of having committed. Other motives were simple revenge or the sadistic gratification of the torturer. Torture also served as a way of intimidating or coercing individuals, or for discriminatory reasons of any kind. Occasionally, torture was the adverse byproduct of medical or scientific research, studies, or procedures, and usually occurred without the consent of the victim. Torturous methods could be initiated at the directives of heads of state or other individuals or groups. Since Force-sensitives could sense the reactions of loved individuals, torture could be used as a means to manipulate them, even from a considerable distance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Torture was widely considered as a gruesome and unethical practice by most cultures in the galaxy. Despotic governments and heads of states often coerced prisoners into revealing sensitive information through the use of intimidation and torture, and the known examples varied from a galactic level (the reigns of the Galactic Empire\nand Darth Krayt's Galactic Empire) to the sectorial (the New Sith Empire and the Corporate Sector Authority) to the system- or planet-wide, which included everything from royal houses (like Queen Sarna's monarchy on Drogheda  and the Doan Royal House of Doan) to elites (like the Krath in the Empress Teta system, the Tundei of Abregado-rae and the Absolutes on New Apsolon) to single dictators like Dictator-Forever Craw of Targonn."}, {"tag": "p", "text": "Torture was also utilized by gangsters and criminal organizations; one notable example was the Hutt crime lord Rokko, whose invention and enjoyment of various forms of torture was the stuff of many a con being's nightmare. To bounty hunters like Boba Fett, Aurra Sing and Feskitt Bobb, torture was a useful tool for locating their prey."}, {"tag": "p", "text": "The Galactic Republic was founded on the principles of law and justice, and torture was against the bylaws of the Galactic Senate. Torture droids were also illegal by the laws of the Republic. However, beyond the Republic's boundaries, there were planets with much lower moral codes, where sentients tortured other sentients for power or greed."}, {"tag": "p", "text": "After Palpatine, a former senator from the planet Naboo, assumed the position of galactic Emperor, the Imperial Senate approved his call for more freedom in the treatment of the enemies of the Empire (\"in times such as these, extreme measures can be called for\" - Imperial Inquisitor Malorum). Under Imperial rule, there was intense demand for torture droids and torture equipment of all kinds, and torture droids were invented behind the curtain of Imperial secrecy. This was in strong contrast with the Rebel Alliance, who would never resort to either torture or interrogation droids."}, {"tag": "p", "text": "After the fall of the Empire, the resulting New Republic took a firm stand against the use of torture, but apparently, some members of the New Republic Intelligence Service would simply ignore this; certain members of the organization, like Heol Girdun, would routinely resort to torture during interrogation sessions. In addition, torture equipment and droids were still manufactured in secret, and were often used by criminals and Imperial Remnant worlds. Many remaining Imperials like Admiral Natasi Daala, Imperial Guard Carnor Jax, Moff Leonia Tavira, Admiral Ysanne Isard, Grand Admiral Thrawn, and the sadistic scientist Leonis Murthé also perpetuated Palpatine's Imperial tradition."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the central government of the New Republic was unable to coordinate an effective response to the invasion. The result was that the government was reorganized into the much more centralized Galactic Federation of Free Alliances (\"The Galactic Alliance\"). This new government was strong enough to drive back the Vong, but would also take many political and military decisions away from individual star systems. Five years into the new regime, the new government's methods had become increasingly dictatorial; in the face of growing protests and violent terrorist groups, a covert branch of intelligence called the Galactic Alliance Guard (GAG) was created. Tasked with finding and eliminating those who threatened galactic peace and order, the members of the GAG would not only subject a suspect to torture, but also arrest her or his entire family and make them watch. After the defeat of Darth Caedus, the leader of the GAG, who had also elevated himself to the position of president of the Galactic Alliance, the GAG was formally disbanded."}, {"tag": "p", "text": "During the reign of Darth Krayt more than a century later, the agency in charge of torture was Sith Intelligence and Assassination."}, {"tag": "p", "text": "Torture varied in both method and purpose between species and cultures. One notable example was the Yuuzhan Vong, who glorified pain not only as a motive for action, but also as a state of living. The Vong warrior caste derived perverse pleasure from their own pain and from the pain of others."}, {"tag": "p", "text": "Curiously, the Trandoshan first name Flayss meant fate, specifically fate of death by slow torture."}, {"tag": "h2", "text": "Methods"}, {"tag": "p", "text": "There was no set standard as to what could or could not be used for torture. Victims were usually held in place with restraints (for example with binders, shackles, ropes, or restraints that were part of the torture mechanism itself) or rendered immobile by other means (like the Geonosian containment field), to lessen any potential opportunity for escape. Sometimes, the person was stripped of most of their clothing; a member of a hairy species might have their fur shaved off, or an avian species their plumage plucked out). The victim might also be imprisoned within a cold, dark cell, adding to their misery. The torturer would often taunt and mentally abuse the victim both during and after the ordeal."}, {"tag": "p", "text": "Physical torture methods ranged from a beating with nothing more than fists and boots, to the use of sophisticated custom-designed devices such as the IT-O Interrogator droid. Other types of torture could include sensory manipulation, sleep deprivation, uncomfortable extremes of heat and cold, loud noises, radiation, or any other means that inflicted physical pain."}, {"tag": "p", "text": "Psychological torture used non-physical methods to cause extreme mental suffering. Torture was sometimes combined with a false display of sympathy or affection from the torturer, such as expressed regret for having to put the victim through the procedure, and/or tending to their injuries. A similar way of manipulation was through sexual seduction."}, {"tag": "p", "text": "Some people utilized their torture skills as an occupation, and were paid to glean desired info out of their contracted victims. Others, like the Sith Lords Scourge (of the New Sith Empire) and Darth Maladi (of Darth Krayt's Galactic Empire) were experts in the field. Lord Scourge viewed effective interrogation as an art. He knew what questions to ask and in what order, when to ratchet up the intensity and when to pull back, how to use the threat of pain and the reward of mercy to control his victims, how to use multiple sessions over several days when necessary in order to achieve the desired results. In his mind, the ultimate failure was to push his victims too far and accidentally kill them; one could get no answers from corpse."}, {"tag": "p", "text": "Some bounty hunters, like Boba Fett, would gladly torture their bounties if they were paid to or as necessary to extract information."}, {"tag": "h3", "text": "Blows"}, {"tag": "p", "text": "During the Clone Wars, the Jedi Master Obi-Wan Kenobi was captured by the Sith Lord Darth Maul and his brother, Savage Opress. The two beat Kenobi viciously, before Maul produced his lightsaber, informing Kenobi that he would make sure he stayed awake long enough to feel every single cut, and that his death would be \"beyond excruciating.\" Fortunately for Obi-Wan, he was able to escape before Maul could finish the job."}, {"tag": "p", "text": "The Mandalorian Walon Vau performed physical torture upon a group of captured terrorists, in the days just after the first anniversary of the start of the Clone Wars. Vau, along with a team of Mandalorians, clone troopers, and Jedi Knights, was assigned to destroy a Separatist spy and terror network on Coruscant. They captured group of Separatist terrorists, M'truli, Gysk and Farr Orjul, and took them to a soundproof apartment. There Walon Vau proceeded to beat information out of them, to the point that the walls were splattered with blood. Jedi Master Arligan Zey knew how the prisoners were treated, but chose to turn a blind eye to it, whereas Jedi Knight Etain Tur-Mukan helped Vau finish his job by torturing Orjul with her own psychic powers."}, {"tag": "p", "text": "During the Black Fleet Crisis more than 35 years later, Han Solo was being held captive by Nil Spaar. To intimidate the President of the New Republic, Han's wife Leia Organa Solo, Spaar brutally beat, kicked and hurled about a bound Han for nearly twenty minutes, while Leia was watching via a holotransmission. Han's blood was smeared on the walls and the floor, and even on Spaar's arms."}, {"tag": "h3", "text": "Bone breaking"}, {"tag": "p", "text": "One way to torture the victim was to break one or more of the bones in her or his body. The bounty hunter Aurra Sing used this method to tear information out of people to find the location of her bounty, Jax Pavan. When the young Rebel Deena Shan was confronted by Imperial Captain Red Rishyk, Rishyk decided to toy with her before killing her and got the idea of breaking every single bone in her body. Fortunately for Deena, Rishyk was killed before he could make good on his threats."}, {"tag": "h3", "text": "Branding"}, {"tag": "p", "text": "Branding involved using red-hot metal to burn the victim's flesh. The same effect could be achieved by lasers. During the Clone Wars, Darth Maul intended to exact revenge on Obi-Wan Kenobi by torturing him with his lightsaber, stating \"I will make sure you stay awake long enough to feel every single cut. Your death will be beyond excruciating.\" However, Obi-Wan managed to escape before Maul had the chance to do what he intended."}, {"tag": "p", "text": "When Princess Leia Organa was forced to fight Darth Vader on Mimban during the Galactic Civil War, Vader merely toyed with her, repeatedly slashing her skin with his lightsaber, leaving several black scorch marks on her body."}, {"tag": "h3", "text": "The Burning"}, {"tag": "p", "text": "The Burning was a form of torture involving the use of a blaster set at low power, to scorch the flesh of an individual's body, leaving only blood-smeared bone. Usually, the interrogator would begin with a leg; immobilizing the victim, then continuing the process with other parts of the victim's body, burning off the flesh, inch by inch. Other prisoners were usually made to watch, as part of a psychological torture meant to break their will."}, {"tag": "p", "text": "Jedi historian Tionne Solusar fell victim to an act of violence very similar to The Burning. During the Second Galactic Civil War, the Galactic Alliance Guard was ordered by Colonel Jacen Solo to kill every Jedi at the Jedi Praxeum on Ossus. To draw other Jedi out of hiding, Master Solusar was held fast by Major Salle Serpa, who fired his blaster several times, burning away the lower part of her leg and most of her arm. Tionne fell to the ground writhing in pain, as the helpless Jedi trainees looked on. Then, as a literal \"insult to injury,\" Serpa fired another blaster shot at the stump that was Tionne's brutalized arm, searing off even more flesh and bone."}, {"tag": "h3", "text": "Chemical torment"}, {"tag": "p", "text": "In 980 BBY, Darth Bane was subjected to chemical-induced torture by Princess Serra, who believed him to be responsible for the death of her father, Caleb. Serra kept Bane imprisoned in a closed-down prison and torture facility called the Stone Prison, where she injected various compounds into his bloodstream via the veins in his neck, making his body convulse in seizures."}, {"tag": "p", "text": "Almost ten years before the Battle of Naboo, Jedi Master Tahl was kidnapped by the Absolute Balog, injected with a paralyzing drug that kept her conscious, but immobilized, and put in a sensory deprivation device. She was still alive when her love, Qui-Gon Jinn, arrived to rescue her, but the damage to her inner organs was severe, and he was unable to save her."}, {"tag": "p", "text": "Imperial torture devices were often equipped with diagnostic scanners that would anticipate a prisoner's loss of consciousness, with chemical injectors keeping her or him awake and conscious during every second of the ordeal."}, {"tag": "p", "text": "The Imperial Moff Kentor Sarne was fond of using exotic and painful pharmaceuticals to torture his prisoners. The liquid was injected into the victim's body with a hypo syringe, making the prisoner feel like the blood was boiling in their veins."}, {"tag": "p", "text": "Imperial Intelligence employed many kinds of interrogation drugs, like Xebonica and Mangoriza, to tear information from the prisoner."}, {"tag": "p", "text": "Technology could be used for locating pain stimulators and damping the victim's endorphins, making the slightest scratch feel like agony. A victim could also be injected with pain-enhancing drugs. Bavo Six was a powerful liquid chemical notable for being used in the large syringes of IT-O interrogation droids. The serum could lower pain thresholds, stimulate cooperation and trigger hallucinations."}, {"tag": "p", "text": "Torture could be combined with truth drugs and/or chemicals designed to break the victim's will. OV600 was a peculiar type of truth serum which caused the victim's flesh to break out in a painful rash if the drug detected the tendencies of lies. Another powerful truth drug was skirtopanol, whereas loquasin had the peculiar effects of compelling the victim to talk, but the drug alone could not force the victim to say what the interrogators wanted—the victim could just as well talk, or even sing, about something else."}, {"tag": "p", "text": "Titroxinate was a potent neurotoxin which could be used both as a biological weapon, and as a torture method."}, {"tag": "p", "text": "After Cade Skywalker was captured by the Sith, he was taken to Darth Maladi's laboratory, where he was tortured for a whole day, being injected with lethal ixetal cilona again and again, to see if he was able to heal himself."}, {"tag": "h3", "text": "Cutting"}, {"tag": "p", "text": "When the Sith Lord Scourge sought information on his fellow Sith Lord Darth Nyriss in 3954 BBY, he tortured her adviser Sechel by cutting off some of Sechel's facial tendrils, and threatened to take one of his eyes as well."}, {"tag": "p", "text": "During the Clone Wars, Obi-Wan Kenobi and Alpha-17 were presumed dead after an explosion during the Battle of Jabiim. They had actually been captured by the Dark Jedi Asajj Ventress, and transported to her stronghold on Rattatak. There she tortured them to obtain information about Republic troop movements. One of her methods was cutting Kenobi and Alpha with a knife again and again. When bounty hunter Boba Fett was searching for Starkiller during the Galactic Civil War, he interrogated a mechanic and threatened to torture him with a fusioncutter if he didn't give him the information he wanted. The terrified mechanic revealed everything. Black Sun associate Zekka Thyne would sometimes kill those who displeased him, slowly with a vibroblade, a weapon which he was a real artist with."}, {"tag": "p", "text": "In 1 BBY, a mysterious epidemic broke out on the Imperial prison barge Purge. In the ensuing chaos, Kale and Trig Longo came across the body of a dead guard who had been tied to the bars by two, now dead from disease, inmates. The two prisoners had somehow managed to lure the guard close enough to the detention cell to bind him, and then tortured him to death by stabbing, slashing and mutilating him with the crude, sharpened instruments still clutched in their dead hands."}, {"tag": "p", "text": "When Leia Organa Solo was captured by the Intendant Nom Anor during the Yuuzhan Vong War, she was hit across the legs again and again with a heavy, sharp object. During the Second Imperial Civil War, Imperial Knight Antares Draco was captured by the Sith Lord Darth Havok. Deep in the dungeons on Korriban, Draco was subject to the torture inflicted by his former Master, who hoped to extract information from his captive. Havok used the Force to cut Draco's body with shards of transparisteel in between healing periods in a bacta tank, keeping Draco from dying before he could tell them the secrets Havok was seeking. Draco refused to talk, firm in his conviction that he would rather die."}, {"tag": "p", "text": "Another presumably more painful and terrifying variant consisted of cutting out the victim's inner organs one by one, while the victim was conscious. Grand Lord Darish Vol of the Lost Tribe of Sith had seen, and sometimes committed, deeds such as \"evisceration of the body.\" A similar method involved cutting off flesh or body parts; for example, the female Sith Lord Darth Zannah killed the healer Caleb by cutting him to pieces with her lightsaber. Burra Stone, who took great pleasure in torturing his victims and was the most feared interrogator in the Empire, once threatened to pull every hair from an Imperial steward's body—from the inside, and was utterly serious about it. When the mysterious being Abeloth visited the Lost Tribe of Sith on Kesh in 44 ABY, she sent out a Force shock wave that destroyed Kesh's city of Tahv and killed millions of citizens; the ones closest to her imploded, the ones who were farther away were \"turned inside out and chunks were ripped from their bones,\" the rest were killed by a wind filled with glass shards which melted as they pierced flesh, spreading \"white-hot, painful death.\""}, {"tag": "h3", "text": "Deprivation"}, {"tag": "p", "text": "To soften up the victim and break down their resistance before the actual torture session, the victim could be deprived of sleep (sleep deprivation was considered to be a cardinal factor in a successful interrogation) or be kept waiting without food or water for long periods of time. One could also be tortured by being deprived from touching the Force, as was the case with Miko Reglia, who was broken down by a Yammosk."}, {"tag": "p", "text": "Torture could also be combined with long periods of solitary confinement, which to some people could be harder to endure than the torture itself, because the mental anguish of loneliness and isolation would eat away at the mind and the spirit."}, {"tag": "p", "text": "After Imperial Grand Moff Bertroff Hissa was found guilty of treason against the Empire, Supreme Prophet Kadann sentenced him to a painful and unusual punishment. Hissa would be starved, and then, at the brink of insanity, served a meal of parasite-infested biscuits. The parasites would then slowly eat him from the inside out, until he was dead. However, Hissa ended up being killed before the punishment was carried out."}, {"tag": "h3", "text": "Electric shock"}, {"tag": "p", "text": "In 29 BBY, while being a prisoner of the Twi'lek Kh'aris Fenn, Jedi Master Tholme was introduced to Fenn's droid AX/RX, which tortured the Jedi Master through powerful electric jolts. Fenn ordered the droid to keep torturing Tholme until he was oblivious, but Tholme used the Force to drop his vital signs, making the droid believe he was unconscious, before throwing the Jedi in a cell."}, {"tag": "p", "text": "During the Clone Wars, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, along with Anakin's Padawan Ahsoka Tano and clone trooper Captain Rex, were captured by the Muun Overseer Juhm after a failed attempt to free Juhm's slaves from captivity, on Gwori. As a reminder to the slaves that they were firmly under the overseer's control, the four were placed against shocker sticks, torture devices which delivered electrical shocks through restraints on the victim's feet and hands."}, {"tag": "p", "text": "This wasn't the only time the three Jedi were tortured with electricity. Kenobi and Skywalker suffered torture via electricity when they taken hostage by Hondo Ohnaka during the war, and Ahsoka Tano was at one point captured by the bounty hunter Cad Bane. The Duros managed to electrify the young Jedi into unconsciousness, then placed the Jedi in stun cuffs. After confiscating Tano's Padawan braid, he then proceeded to shock her repeatedly to increase her master's sense of urgency. Ahsoka was also electrically tortured during their Mission to Zygerria. She was shocked several times via a slaving collar, a device used by Zygerrian slavers to keep the slaves in line."}, {"tag": "p", "text": "Anakin had previously been forced to watch his wife, Padmé Amidala, being tortured by Doctor Nuvo Vindi. Amidala and her fellow Senator Jar Jar Binks had been captured while searching for a secret Separatist bio-weapons lab on Naboo. When Anakin entered Vindi's lab, he found Vindi torturing his captives with electricity, forcing Anakin and his clone troopers to surrender. Anakin managed to break free and save the hostages, while Vindi ran off with the Blue Shadow Virus bomb."}, {"tag": "p", "text": "After Ahsoka's encounter with Cad Bane, Bane hunted down Jedi Master Bolla Ropal in order to unlock the information in the Kyber memory crystal stolen from the Jedi Temple. Ropal was defeated during the battle and imprisoned in the cell blocks of Bane's Munificent-class frigate, where he was placed within a magnetic containment field. Ropal's droid captors attached mind limiters and pain pulsers to his body and injected him with a full dose of the drug X-C33. Bane demanded that Ropal assist him in opening the holocron, but Ropal refused, and was electrically shocked several times. After one final refusal from Ropal, Bane ordered the MagnaGuard overseeing the torture to electrocute the Jedi at full power. Ropal died, and his limp body was dropped to the floor."}, {"tag": "p", "text": "Also during the Clone Wars, the Jedi on Coruscant received a holo-transmission from General Grievous, in which the general showed his victory over the Jedi by having one of his MagnaGuards torture Jedi Master Eeth Koth. After the transmission ended, Koth was put in electric bindings and tortured by T-series tactical droid TV-94, who wore a wrist gauntlet that controlled the energy field used to torture the Jedi."}, {"tag": "p", "text": "General Kalani was a super tactical droid sent by Count Dooku to handle the local rebellion on the planet Onderon during the Clone Wars. After one of the rebels, Saw Gerrera, was captured, Kalani had Gerrera tortured with a sophisticated electroshock machine in order to interrogate the rebel."}, {"tag": "p", "text": "Shortly after the declaration of the Galactic Empire, the smuggler Schurk-Heren was shackled to a table and electrically shocked by Haka Hai's men, to make him reveal where he hid the contraband he had promised to sell Hai. When Schurk-Heren passed out, they proceeded to treat one of his companions, the Nosaurian Bomo Greenbark, the same way, but Bomo escaped by pretending to also be unconscious, and then using his horns to break the chains holding him."}, {"tag": "p", "text": "One week after the Battle of Endor, the Rebel pilot Ten Numb was captured by the sadist Imperial General Weir, who tortured the Rebel with electricity from a live wire. Numb soon broke and supplied Weir with all the information he wanted, including sizes and secret locations of military forces."}, {"tag": "p", "text": "Three years later, Talon Karrde mentioned a renegade band of Twi'leks who used to torture their prisoners by running electricity through a vat of bacta. When the victim was at the brink of death, the electricity was turned off, allowing the bacta to heal the prisoner, only to face a new round of the same torture."}, {"tag": "p", "text": "The force pike, or electro-jabber, was a spear with a vibrating power tip moving at extreme speed. At lowest setting, the spear would deliver excruciating electrical shocks, higher settings could result in paralysis and death, and at maximum setting, it could slice through everything from flesh and bone to thin durasteel plating. The weapon could be used for self-defense, but also as a torture device. The Emperor's Royal Guards used the force pike mainly as a ceremonial weapon, but sometimes for other reasons; torture was one of them."}, {"tag": "p", "text": "Similar electric torture devices were shockprods and high-voltage electroprods."}, {"tag": "p", "text": "The neuronic whip consisted of a thin strand of wire attached to a handle with a switch on it. By activating the switch, electricity would course through the wire. Anything coming into contact with the electric whip would suffer a debilitating neurological overload; repeated lashings could result in permanent brain damage. Since the whip rarely caused physical harm, it was often used by slavers."}, {"tag": "h3", "text": "Flames"}, {"tag": "p", "text": "Sometimes, fire was utilized as a form of painful execution. In 22 BBY, an unidentified clone trooper was briefly tortured before being killed when he fell into a molten smelting inside of the cyborg General Grievous's castle on Vassek. Shortly before the Battle of Yavin, Imperial forces tricked a group of resistance leaders fighting the Galactic Empire (presumably members of the Rebel Alliance) into entering a building which was then closed from the outside, before the soldiers torched the building. 7.5 years later, several members of Wraith Squadron planned to hit the Binring Biomedical Product facility on Saffalore, only to discover that the entire facility was a trap. Suddenly, a trap door dropped the Wraiths into an incinerator. They escaped after blasting the wall with explosives, but many of them sustained nasty burns and other serious injuries."}, {"tag": "p", "text": "The Ewoks were cunning warriors who didn't think twice about cooking an enemy alive over open flames."}, {"tag": "h3", "text": "Force-augmented torture"}, {"tag": "h4", "text": "Force lightning"}, {"tag": "p", "text": "Force lightning was a well known Force ability associated with Sith and the dark side of the Force. The attack channeled Force energy down the user's limbs, hurling arcing bolts of electricity from the wielder's hands. Force lightning caused unbearable pain, while slowly diminishing the victim's life. It was also nearly impossible to deflect. When the electricity hit the victim, it felt like searing every nerve back into its individual cells, skewering each of them on white-hot needles."}, {"tag": "p", "text": "In 3998 BBY, the Arkanian Jedi Arca Jeth was captured by King Ommin of Onderon. With the assistance of the Sith Lord Freedon Nadd's spirit, the king attempted to torture Arca to the brink of death with a lightning-based attack, believing that the Jedi Master would be forced to call upon the dark side of the Force to save himself. At that point, Ommin planned to destroy Arca's body and raise the fallen Jedi as a dark side spirit."}, {"tag": "p", "text": "In 3956 BBY, the Dark Lord of the Sith Darth Malak captured Jedi Bastila Shan. In order to force her into accepting the dark side, he relentlessly tortured her for a week through the use of Force lightning. She eventually fell to the dark side and became his apprentice, although she was later eased back to the light side by a redeemed Revan."}, {"tag": "p", "text": "During the Battle of Alderaan in 3653 BBY, a Zabrak Jedi engaged in personal combat with the Sith Lord Darth Malgus. Malgus attacked the Zabrak with Force lightning, burning the Jedi's flesh and blasting dark holes in his body, until the Zabrak dropped to the ground in defeat, screaming. The Sith took a moment to observe the look of failure in the Jedi's eyes before impaling him with his lightsaber."}, {"tag": "p", "text": "In 31 BBY, Jedi Master Quinlan Vos embarked on a mission to the Twi'lek planet Ryloth, in search of his missing apprentice, Aayla Secura. When Quinlan confronted Aayla's uncle Pol Secura, who had taken her and was feeding her glitteryll (a powerful memory-reducing narcotic), he tortured the Twi'lek man with Force lightning. Just as Pol confessed about where the supply of glitteryll was coming from, he was accidentally Force pushed from a balcony by Aayla."}, {"tag": "p", "text": "In 20 BBY, having been bested in a duel and telekinetically bashed by Darth Sidious, Darth Maul pleaded mercy from his former mentor; he knew how cruel Sidious could be, and he desired a quick, painless death. But Sidious smiled, saying that there was no mercy, and unleashed a burst of Force lightning on Maul. He paused to prolong Maul's suffering with \"assurances\" of being spared, for he had \"other uses\" for the Zabrak. Sidious' chuckling was drowned by continued crackling of lightning and Maul's howls of agony. Decades later, when the Jedi Knight Luke Skywalker refused to join Sidious, the Emperor tormented Skywalker with Force lightning, beginning with an agonizing but non-lethal barrage, working his way gradually upwards in lethality in order to maximize the Jedi's suffering."}, {"tag": "p", "text": "In 137 ABY, Princess Marasiah Fel was taken captive by the Sith and taken to XoXaan's Temple's Chambers of Persuasion, where she was tortured and interrogated by Darth Havok. She resisted Havok's torture, which included Force lightning attacks."}, {"tag": "h4", "text": "Force net"}, {"tag": "p", "text": "A Force net was an unusual Sith technique where the user would summon dark side strands of energy that would wrap around the target and ensnare it in an unbreakable mesh. The technique was used by Lost Tribe of Sith High Lord Sarasu Taalon to torture and attempt to kill Ben Skywalker during the Battle in the Fallanassi village on Pydyr in 44 ABY. Taalon was slowly constricting the net, with the intention of slowly, painfully chopping his victim into tiny squares of meat and bone. An unsuspecting Taalon was killed by Sith apprentice Vestara Khai before the net could do any permanent damage to Ben."}, {"tag": "h4", "text": "Memory Walk"}, {"tag": "p", "text": "The Sorcerer of Tund Rokur Gepta developed a Force ability called Memory Walk, in which the subject was forced to relive all the worst memories and horrors of their life, everything from the merely embarrassing ones to the painful ones, but would not experience anything but the fear. The victim was forced to relive their nightmares over and over again, for days or weeks, until their will and resolve were utterly crushed. A few years before the Battle of Yavin, Lando Calrissian was captured and tortured by Gepta, who subjected Lando to his unique torture method. Fortunately for Lando, he was able to escape."}, {"tag": "h4", "text": "Mind Shard"}, {"tag": "p", "text": "Mind Shard was a Force power that allowed a Force-user to mentally splinter an opponent's mind, causing him or her excruciating pain."}, {"tag": "h4", "text": "Sith poison"}, {"tag": "p", "text": "Poisons were a tool, often implemented for a number of reasons during torture sessions. This was the case with Sith poison; a dark side-infused toxin created through the arts of Sith alchemy. Once introduced to the bloodstream of a Force-sensitive individual, the poison wears away their resistance to the dark side of the Force. The victim suffers extreme anguish while being consumed by the dark side, over a prolonged period of time. Ulic Qel-Droma was administered a Sith poison by Lord Satal Keto, while being tortured by specialized droids, and interrogated about his intentions on Keto's homeworld."}, {"tag": "h4", "text": "Sith sorcery"}, {"tag": "p", "text": "Sith sorcery granted its masters an affinity for a power that subjected victims to bouts of utter terror, anguish, and despair. By influencing a person's mind, the sorcerer could make a victim relive their worst fears or nightmares, to such an extreme that the victim would be driven to madness in a desperate attempt to escape the horrors, only to feel them inside their head and mind instead, as the power attacked all aspects of the victim's sensory perceptions."}, {"tag": "p", "text": "At one point, this technique was used by the female Sith Lord Darth Zannah, which left the Anti-Republic Liberation Front member Cyndra in a permanent catatonic state. Darth Maul may have applied it to counter the telepathic efforts of an Iktotchi, killing him within seconds and leaving him with a terrified, tormented expression on his face. Darth Wyyrlok was another master of this art."}, {"tag": "h4", "text": "Other Force abilities used for torture"}, {"tag": "p", "text": "Even some proponents of the light side resorted to torture on occasion. Jedi Knight Etain Tur-Mukan tortured the terrorist Farr Orjul mentally by projecting her own fear of being devoid of any direction into his mind by way of denial. Ignoring his gasping, squealing, panting, and sobbing, she tortured him for an hour, before Orjul broke down and revealed everything. Etain justified her actions by claiming that she did it all without anger, which a Jedi wasn't supposed to feel, and that being serene made her actions acceptable."}, {"tag": "p", "text": "Immediately after the capture of Archduke Poggle the Lesser during the Clone Wars, Jedi Knight Anakin Skywalker learned that a supply ship carrying Padawans Ahsoka Tano and Barriss Offee had been taken over by brain worm-infested clone troopers. Skywalker attempted to use a mind trick on the Archduke to make him talk, but Poggle informed him that mind tricks wouldn't work on Geonosians. An angry Skywalker told Poggle that he didn't need mind tricks to make him cooperate, and used the Force to choke and levitate Poggle until he finally explained that the brain worms were vulnerable to cold temperatures. Skywalker's fellow Jedi were curious as to how Skywalker had managed to get Poggle to cooperate, but he didn't elaborate."}, {"tag": "p", "text": "Around 18 BBY, Skywalker, who had now become the Sith Lord Darth Vader, embarked on a mission to Vohai, in search of new cloning technologies. On Vohai, Vader was attacked by the Emperor's Hand Sa Cuis, who was easily overpowered by the Dark Lord. Vader then tortured Cuis via Force choke, bringing him to the brink of death again and again, in an attempt to force Cuis to reveal who sent him. He was subsequently killed by Darth Vader when he refused to reveal his employer."}, {"tag": "p", "text": "When Princess Leia was tortured by Vader in order to learn the location of the hidden Rebel base, she was injected with mind-altering drugs that made her very susceptible to suggestion. Using his own psychic powers, Vader made her believe that she was in unbearable pain—that her skin was on fire and her flesh being torn apart."}, {"tag": "p", "text": "Three years after the Battle of Yavin, Darth Vader again tortured Leia Organa, as well as Han Solo and Chewbacca, on Cloud City. While the torture was not augmented by the Force, Vader knew that their anguish would reach Luke Skywalker through the Force and draw him to Bespin where he could be captured and delivered to Emperor Palpatine. Han was subjected to the scan grid, Chewie to sonic torture and searing lights. Leia, like Han, went through an ordeal with a torture machine, though the details are unknown."}, {"tag": "p", "text": "After the assassination attempt on his daughter, Jacen Solo sought out Allana's great-grandmother Ta'a Chume. Demanding answers, he pressed his thumbs into the base of her skull, shooting charges of Force energy through her brain, while at the same time expanding his own Force presence into her mind, more and more. After getting the information he wanted, he violently poured Force energy into her head and kept pushing hard into her mind with his own presence, until he sent her into a coma."}, {"tag": "p", "text": "In 40 ABY, bounty hunter Ailyn Vel was caught by the Galactic Alliance Guard. Believing her to be a Corellian terrorist, Jacen Solo used the Force to repeatedly slam her head into the table where she was sitting while attempting to enter her mind. This was far more than Ailyn could endure, and she died while being questioned."}, {"tag": "h3", "text": "Mental anguish"}, {"tag": "p", "text": "One of the many torture methods of the Yuuzhan Vong involved a type of psychological torment where the Vong would feign the prisoner's execution again and again by repeatedly drawing the victim to within centimeters of the Sharp teeth of a yammosk."}, {"tag": "h3", "text": "Rack"}, {"tag": "p", "text": "A rack was a torture device that stretched or disjointed the victim. The Embrace of Pain was one such device. During the Mandalorian Wars, \"Doctor\" Demagol used a rack in his experiments on Jedi."}, {"tag": "h3", "text": "Sensory deprivation"}, {"tag": "p", "text": "When Jedi Master Qui-Gon Jinn was held captive by scientist Jenna Zan Arbor, he was kept floating in a chamber of vapor without sight or sound, while at the same time being slowly drained of blood."}, {"tag": "h3", "text": "Sonic torture"}, {"tag": "p", "text": "Sonic torture involved bombarding the victim with a chaotic blare of loud sounds. After Whiplash leader Thi Xon Yimmon was captured by the Galactic Empire, his cell was repeatedly barraged with a cacophonous blend of arrhythmic and atonal sounds. In addition, his cell was continuously bathed in a harsh, white light, adding to his misery. The Wookiee Chewbacca was subjected to sonic torture and searing lights after being captured by Darth Vader on Bespin in 3 ABY."}, {"tag": "h3", "text": "Stoning"}, {"tag": "p", "text": "When an elderly Abyssin lost the species' ability to heal quickly, they were expected to voluntarily exile themselves to die in the desert. If they refused, they were brutally stoned by their tribe, and were only allowed to rejoin them if they were able to regenerate after the ordeal. Otherwise, they were ritually and regularly stoned until they died or wandered off to die in the desert."}, {"tag": "p", "text": "In Gungan society, the punishment for vandalism was strict, and the perpetrator could be sentenced to exile, caning or even being stoned to death."}, {"tag": "h3", "text": "Suffocation"}, {"tag": "p", "text": "In year 1 BBY, a mysterious epidemic broke out on the Imperial prison barge Purge, and Imperial Corrections Officer Vesek was one of many who was sent to the infirmary after contracting the virus. Captain of the Guard Jareth Sartoris, desperate to escape the ship, used the opportunity to attempt to force the access codes to the escape pods out of the helpless Vesek. When Vesek refused to give him the codes, Sartoris lost patience and pinched Vesek's nose shut until his face went white and he had no pulse. Vesek only survived the torture thanks to the interference of doctor Zahara Cody."}, {"tag": "p", "text": "During the Rescue Mission to Dibrook during the Yuuzhan Vong War, Kaye Galfridian and her troops discovered a group of hostages trapped in a gelatinous gas chamber inside the Yuuzhan Vong Shaper research facility. As Kaye and the soldiers watched in horror, poisonous gas was pumped into the chamber, slowly choking the life out of the prisoners. The would-be rescuers only managed to get one of the victims out before Kaye's stepmother, Nina Galfridian (who had noticed that the prisoners had been implanted with surge-coral, just like the attacking thralls at the facility), ordered the troops to pull back. Nina, knowing that there was no hope for the prisoners, then used the Heart of Artorias to blow up the compound, killing every thrall and Yuuzhan Vong inside."}, {"tag": "h3", "text": "Voodoo"}, {"tag": "p", "text": "During the Clone Wars Battle of Dathomir, the Nightsister Talzin used a lock of Count Dooku's hair to create a magical voodoo doll in the Count's likeness. She used it in conjunction with her magic to torture Dooku to the point of near-death. Dooku only survived thanks to the interference of General Grievous."}, {"tag": "h3", "text": "Watching"}, {"tag": "p", "text": "A prisoner could be made to watch other victims being tortured, particularly their own friends or family. Jedi Knight Ben Skywalker suffered in this manner, watching his friend Lon Shevu be tortured to death by Sith apprentice Tahiri Veila. During the onset of the Swarm War, Leia Organa Solo was made to watch what she was led to believe was her husband being tortured. Leia watched in horror as Han's torturer, having at his disposal an entire table full of torture devices, cut off Han's ear and scarred his face with a laser scalpel, all because her interrogator did not believe her statements. Eventually she discovered that Han was perfectly safe; the camera she was watching employed trick photography to give the impression of Han's torture. When they met each other shortly after, Han indeed had both ears and no other scars, much to her relief."}, {"tag": "p", "text": "During the Clone Wars, scientist Bant'ena Fhernan was taken captive by the Separatists and forced to develop a bioweapon for General Lok Durd. When she tried to commit suicide rather than do as she wished, Durd beat her nearly unconscious and said that if she tried again, her mother would die in screaming agony, and he would strap Bant'ena to a chair with her eyelids taped open and make her watch a holorecording of her mother's death a hundred times over. If she tried again and succeeded, her entire family and close friends would all die in screaming agony."}, {"tag": "h3", "text": "Whipping"}, {"tag": "p", "text": "Zygerrian slavers used shock whips for interrogations and to keep rebellious slaves in line. When Obi-Wan Kenobi was captured during a Mission to Zygerria during the Clone Wars, he was chained to a wall while a sadistic guard whipped his back to make him talk."}, {"tag": "p", "text": "In 19 BBY, the former Jedi Dass Jennir was hired by Ember Chankeli to rid Telerath of Ken-Kiba's spice runner gang, who operated on the planet. The gang had an ally of Jennir, an elder man named Fish, whipped, in order to force him to reveal Jennir's whereabouts. Fortunately for Fish, Jennir was able to rescue him."}, {"tag": "h3", "text": "Worms and insects"}, {"tag": "h4", "text": "Artery worms"}, {"tag": "p", "text": "A torture method favored by the Nightsisters of Dathomir involved force feeding or injecting the victim with liquid containing artery worms. Burrowing through the victim's veins, the worms would feed off the arteries. A Nightsister would survive after a day of torment; others would die, unless they were given a potion containing witch blood, which would rid the victim of the worms, provided they hadn't reached their heart."}, {"tag": "h4", "text": "Bloodslugs"}, {"tag": "p", "text": "The Lyran bloodslug was an omnivorous parasite used as a form of torture and punishment by the crime lords of Lyran IV. This slug could grow from one to six centimeters long. In its dormant state, it could take nourishment by eating wheat and grain, burrowing through piles of grain by exuding a trace amount of a powerful, toxic acid. If they got close enough to a sleeping (or restrained) person, they would use their venom to burrow into the person's body, and start feeding off the victim's viscera, slowly draining the victim of blood over a period of several weeks. The host would slowly go insane from the pain, and eventually die."}, {"tag": "h4", "text": "Lava fleas"}, {"tag": "p", "text": "In their larval state, Mustafar lava fleas were worm-like borers about half a meter in length. The worms fed on the mineral-rich rock dust from the inner caverns of Mustafar, using acidic enzymes to break down the rock into needed nutrients. There were disturbing reports of the acid-filled pre-flea worms being used as a ghastly form of torture."}, {"tag": "h4", "text": "Muscle maggots"}, {"tag": "p", "text": "Muscle maggots were burrowing insects that entered their victims through their muscle tissue, causing extreme pain and anguish. The Dark Jedi Asajj Ventress used these insects on Obi-Wan Kenobi in her stronghold on Rattatak. There, Ventress tortured Kenobi in order to obtain information about Republic troop movements."}, {"tag": "h4", "text": "Piranha beetles"}, {"tag": "p", "text": "Emperor Palpatine himself was quite fond of torturing those of his subordinates who had earned his displeasure, such as Death Star I engineer Bevel Lemelisk. The Emperor subjected Lemelisk to numerous tortures, the first of which was having Lemelisk blinded and consumed by piranha beetles, ultimately resulting in Lemelisk's death. However, to capitalize on his suffering, the Emperor would preserve Lemelisk's mind, and after each of his \"deaths,\" would transfer his essence into that of a preexisting clone body. Lemelisk was forced to endure seven of these grueling punishments in all."}, {"tag": "h4", "text": "Other creatures"}, {"tag": "p", "text": "Jabba the Hutt used a kind of bloodsucking worm as a form of torture of prisoners in his palace."}, {"tag": "p", "text": "After Imperial Grand Moff Bertroff Hissa was found guilty of treason against the Empire, Supreme Prophet Kadann sentenced him to a slow and painful death. Hissa would be starved, and then, at the brink of insanity, served a meal of parasite-infested biscuits. The parasites would then slowly eat him from the inside out, until he was dead. Hissa was killed before the sentence was carried out."}, {"tag": "p", "text": "Aleema Keto owned a pet of an unknown species of serpentine constrictor, and used the beast to kill dissenters to the rule of her Krath government. Aleema often used this pet as a torture and execution device. It secreted a yellow mucus from its quills."}, {"tag": "h2", "text": "Technology"}, {"tag": "h3", "text": "Agony Inducer"}, {"tag": "p", "text": "The Agony Inducer was a small, circular device that could be attached to the ear. Small buttons could be pressed to cause the victim pain. A short time after the Battle of Yavin, the bounty hunters Remel Fud and Dafi used an agony inducer on the smuggler Jaxxon in order to force him to tell them the location of Aduba-3."}, {"tag": "h3", "text": "Analysis grid"}, {"tag": "p", "text": "Shortly after the Battle of Endor, the Zeltron female Dani was captured by the Nagai agent Den Siva, who subjected her to weeks of mental torture and clinical study before she was rescued. Eager to study the make up of her species, Siva subjected Dani to the analysis grid, a device designed to detect the physiology of a species, by firing coherent beams of energy through a specimen."}, {"tag": "h3", "text": "Carbon freeze"}, {"tag": "p", "text": "Carbonite was a metal alloy that was mixed with Tibanna gas, compressed, and flash-frozen, encasing materials for transport in an incredibly strong metal alloy. The freezing of living subjects in carbonite was used as a form of torture; the process was excruciating, and the victim was placed in a form of stasis hibernation, while still experiencing a form of consciousness."}, {"tag": "h3", "text": "Dreypa's Oubliette"}, {"tag": "p", "text": "In the days of the old Sith Empire, torture was known to be a common practice, so much so that ancient Lords of the Sith constructed terrible devices and chambers for which their torturous methods could be carried out. One such prison was Dreypa's Oubliette, crafted by a Sith Lord of the same name. When a victim of Dreypa's was placed inside the oubliette, they would endure what was described as a living death, being subjected to such torment for as long as they were held captive. Lord Dreypa intended this prison to contain a rival Sith named Karness Muur, and the powerful talisman within his possession, but Dreypa's plan never came to fruition."}, {"tag": "h3", "text": "The Embrace of Pain"}, {"tag": "p", "text": "The Embrace of Pain was an organic, rack-like restraint used to torture prisoners. A victim was kept face down in restraint bands, and tortured while the creature would read the electrochemical outputs of the victims nerve impulses and evaluate her or his brain chemistry. The resultant data was used to keep the pain at constant and optimum levels. The device had a number of different methods for inducing pain, including stretching of ligaments and joints, acid, electric shocks, sharp devices, needles, thorns, and injected biotoxins. In at least one case, the victim was stripped naked, and all of his hairs pulled out. When the victim was at the brink of dying, the Embrace would tend to the prisoner's body by lowering them to the floor and letting them sleep for a time, while tending wounds and injecting the prisoner with enough water and nutrients to keep them alive."}, {"tag": "h3", "text": "Nerve disruptor"}, {"tag": "p", "text": "The Agonizer-6 nerve disruptor was an Imperial torture and interrogation device resembling a small, three-legged droid. A built-in droid brain would closely monitor life indicators like heartbeat, nerve functions and respiration to keep the her or him alive until interrogation was complete. The disruptor pushed the victim into her or his limits, physical as well as mental. Microfilament injectors caused pain and dispensed truth drugs, while stimulators worked on sensitive nerve clusters, causing aches, tingling, pain or uncontrollable spasms. Nerve stimulation was also used to induce altered states of mind, ranging from euphoria, relaxation, and bliss, to fear, panic, and uncontrollable terror. Emotional states could be artificially enhanced, eventually destroying the victim's mental defenses and break their will. In 0 BBY, Rebel Alliance member Barid Mesoriaam was captured by the gangster Jabba the Hutt, and tortured for days for information on the alliance."}, {"tag": "h3", "text": "Scan grid"}, {"tag": "p", "text": "The scan grid was a rack-like device originally designed to analyze metals, gathering data by emitting electrical charges. When Han Solo was tortured by Darth Vader at Bespin, Vader utilized Cloud City scan grid which had been heavily modified with additional tools designed for torture, including microsurgical vibroscalpels, an electroshock assembly, diagnostic scanners and chemical injectors. The scanners would anticipate loss of consciousness while the chemical injectors kept the victim awake, forcing Han to endure every measure of pain without passing out."}, {"tag": "p", "text": "According to Director of Imperial Intelligence Ysanne Isard, Vader created the design himself. Earlier during the war, Lieutenant Zuud of Imperial Intelligence used the same, or a similar, device to torture the rebel agent Jorin Sol, and Isard herself would use yet another version called the Inducer to torment Corran Horn several years later. Whereas the original only worked on the pain receptors, the Inducer stimulated the receptors for heat and cold as well, making it feel like one's flesh was burning and the bones were chilled to absolute zero."}, {"tag": "h3", "text": "Slaving collar"}, {"tag": "p", "text": "The slaving collar was a neck brace used to control slaves and other prisoners. It could be equipped with shock panels that delivered electrical charges at the slavemaster's command."}, {"tag": "h3", "text": "Spineray"}, {"tag": "p", "text": "Spinerays were biologically engineered Yuuzhan Vong creatures used for stimulating the nervous system, both for medical purposes and as a means of torture. The tracer spineray was mainly used to evaluate the condition of organic tissue and for determining an organism's physiological balance, but also served a purpose as a tool for inflicting pain to selective nerve arrays. Inflicting pain was more often the domain of the provoker spineray, which would target and incite individual nerve endings, issuing pain to certain receptors with micromillimeter precision."}, {"tag": "p", "text": "The spineray would attach itself to the victim's neural pathways and trigger the body's pain receptors. It could also feel when the person tried to lie or resist, increasing the pain and making it feel like every nerve ending and organ were on fire."}, {"tag": "h3", "text": "Torture chair"}, {"tag": "p", "text": "This interrogation and torture device made a victim's muscles jitter and spasm. The seizures were not painful so much as they were maddening. Admiral Natasi Daala used such a chair. A most effective interrogation and torture technique was to have this machine create an unrelenting facial tick that would cause the victim to blink over and over for hours on end."}, {"tag": "h3", "text": "Torture droids"}, {"tag": "h4", "text": "AX/RX"}, {"tag": "p", "text": "Kh'aris Fenn owned a torture droid with the designation AX/RX, capable of inflicting pain through powerful electric shocks. The droid was tasked with torturing Tholme after the Jedi Master was taken captive by Fenn."}, {"tag": "h4", "text": "BL-39 interrogator droid"}, {"tag": "p", "text": "The BL-39 interrogator droid was a direct successor to the Imperial torture droid IT-O. Following the decline of the Galactic Empire after the Galactic Civil War, a private company, Aratech, purchased the schematics for the IT-O. High demand from law enforcement agencies and local governments, resulted in the design being adapted to a civilian model."}, {"tag": "p", "text": "The droid used many components from modern medical droids, and was capable of extracting information from the reluctant with minimal pain or physical injury. During the reign of Darth Krayt's Galactic Empire, Moff Nyna Calixte made use of these droids in her duties as the Director of Imperial Intelligence."}, {"tag": "h4", "text": "EV supervisor droid"}, {"tag": "p", "text": "The EV supervisor droid was manufactured by MerenData, and planned as a manager droid that could oversee and increase the efficiency of droid labor. During production, the EV motivators for the supervisor droids were mistakenly swapped for MDF motivators, contraband hardware designed for torture droids. MerenData didn't notice the error until after hundreds of faulty droids had gone out. The manufacturer blamed it on industrial sabotage, but others attributed it to a fatal combination of malicious intent and stupidity. The mix-up also exposed that MerenData were building illegal droids for the House of Tagge. According to several industry surveys, production lines where the droids were employed boasted a high efficiency rating, and the faulty models were outperforming the standard EV units at droid worker motivation."}, {"tag": "p", "text": "But then the stories trickled in. The MDF Motivator had given the corrupted droids a rather malicious personality, along with a tendency to utilize painful forms of discipline. The combination of the MDF motivator's sadism and the EV's power of positive management lead to catastrophe. In a hotel on Indu San, the slowest droids were given oil baths set on fire. Worker droids on Eriadu were having their feet melted to the floor to prevent them from leaving their stations. A report in Cynabar's Droid Datalog described how an EV-droid supervisor working in an automated bulk freighter mistreated the droid crew so badly that an angry astromech droid blew it out the airlock. The droids' brutality extended to the rare cases where they were tasked to supervise organics; on Kadril, employees were prodded with high-voltage electroprods."}, {"tag": "p", "text": "MerenData panicked, and made every effort to recall the corrupted droids, but some of them found homes with owners unfazed by their sadistic personalities. One example was certain pirate groups in the Outer Rim who modified their EV droids to serve as torture droids and slave pen supervisors."}, {"tag": "p", "text": "EV-4D9"}, {"tag": "p", "text": "One example was EV-4D9, employed by the crime boss Ploovo Two-For-One. One of its previous owners had noticed the droids habits, and enhanced its brutality even more by a little bit of programming, processors from an older torture droid and adding a few pain tools, including a thermal drill, an arc welder, a plasteel cutter and three solution injectors that could by loaded with a variety of pain- and truth-serums. The droid eventually came into the ownership of Lotas, a bounty hunter employed by the crime boss."}, {"tag": "p", "text": "EV-9D9.2"}, {"tag": "p", "text": "Yet another unit was EV-9D9.2, which took over as chief of interrogation on the assembly moon of Telti. This droid was a second generation administrative droid descended from the prototype EV-9D9. When the New Republic mechanic Cole Fardreamer, who was turned over to EV-9D9.2 after a run-in with Dark Jedi Brakiss in the latter's droid factory, experienced first-hand why the droid was said to be twice as ruthless as its predecessor. Cole managed to escape with the help of R2-D2 and C-3PO, who rallied the other droids against EV-9D9.2."}, {"tag": "p", "text": "EV-9D9 (Eve-Ninedeenine)"}, {"tag": "p", "text": "The most notorious EV droid was EV-9D9, former head of automated security on Cloud City, and supervisor of the droid pool at Jabba the Hutt's palace. Even though she left a series of broken droids in her wake, victims of her sadistic streak, it is unknown whether she ever harmed any organic beings."}, {"tag": "h4", "text": "IT-O"}, {"tag": "p", "text": "Interrogation droids were used almost exclusively by the Galactic Empire and other tyrannical governments. After the Empire rose to power, most droids programmed to cause harm to organic creatures were outlawed, but interrogation droids remained legal, and their existence was not a well-kept secret; rumors of their horrifying techniques and cruelty spread throughout the Empire. Many of the sadistic tendencies shared by Imperial Inquisitors and ISB agents were programmed into the droids, and as a result, Imperial torture droids tended to have decidedly sadistic temperaments."}, {"tag": "p", "text": "The IT-O (Eyetee-Oh) was a series of Imperial torture droids developed by the Department of Military Research during the reign of the Galactic Empire. A product of military research and the ISB, it was manufactured solely by Imperial factories, though the droid was originally devised by the ancient Sith as an instrument to torture their prisoners (and not necessarily for information). Its reputation was spread far enough that many prisoners confessed as soon as one floated into their cell. High Inquisitor Mox Slosin, one of the Empire's most efficient interrogators, provided keen insight during the development of the droid. The look of the droid was designed to give it an aura of menace. The glossy black globe moved about on small repulsorlifts, dotted with pain-producing equipment, all linked to each other and adapted from top-of-the-line medical droids and assassin droids. It also contained an audio and videorecording unit. Combining sophisticated medical science and psychiatric modules with interrogation and torture programs, the droid would monitor all body functions searching for weaknesses to exploit, chemical as well as physical, in order to apply maximum pain with minimal damage. Precise stimulation of nerves assured that the victim was feeling excruciating pain while being kept conscious. Some of the equipment and program modules were modified assassin droid parts, linked to medical droid diagnostic and operating modules."}, {"tag": "p", "text": "Use of the droid was carefully controlled by ISB, though IT-O models did also get into the hands of senior Moffs, military intelligence and CompForce, the near-fanatical military arm of COMPNOR. The droid was especially popular among the Imperial Inquisitors, and the Inquisitorius was secretly manufacturing the model on its own. Stormtrooper garrison commanders were also known to make use of them, though generally only under the guidance of a senior officer. The Death Star was stocked with IT-Os, exclusively to the domain of detention personnel and security. Few others could bear to watch them in action."}, {"tag": "p", "text": "The IT-Os had much of the same programming and equipment as a medical droid, and were programmed with expertise in psychology, medicine, surgery and human biology. They were capable of monitoring vital signs to prevent the onset of unconsciousness or catalepsy, even bringing the victim back from the brink of death, only to endure further torture. Its medical equipment and programming could be used if the session went too far before any valuable information could be squeezed out of the victim. The droid was also equipped to bring a victim only to the brink of physical damage. After the victim submitted to the ordeal, the IT-O would evaluate her or his truthfulness, based on heart rate, muscle tension and voice patterns.\nThe torture droid's painful equipment included:"}, {"tag": "p", "text": "The droid was also equipped with a vocabulator producing speech; this had seldom been required, as the devices dotting the black sphere spoke for themselves. The droid was still perfectly capable of interrogating a prisoner on its own, speaking in a flat, emotionless monotone. When working with a living, organic assistant, the droid would often keep quiet, allowing the victim to hate and fear the droid, while seeing its living companion as a source of potential mercy."}, {"tag": "p", "text": "The use of torture droids was ostensibly forbidden in the modern Imperial Remnant. Even so, Moff Drikl Lecersen, who served on the Council of Moffs of the Imperial Remnant, kept an IT-O as part of his collection of antiques, and few knew that it was still functional and had been used by the Moff more than once. One such incident occurred when Lecersen was visited by the Minyavish Tiyuu'cha Mahlor, whose species had been exiled from their homeworld, Qaras, by the rebelling Jessar slave population. Mahlor had uncovered evidence of Lecersen's involvement in the Freedom Flight movement and attempted to blackmail the Moff. Realizing that Mahlor might be in possession of sensitive information, the Moff had him tortured by the IT-O interrogator for hours, until Mahlor revealed everything he knew, at which point Lecersen had the Minyavish painlessly killed."}, {"tag": "h4", "text": "IT-904"}, {"tag": "p", "text": "IT-904 was once an Imperial interrogation droid that was purchased at an auction by the bounty hunter Dej Vennor. Vennor had the droid extensively modified, augmenting it with additional armaments and upgrading its memory and processing capability. Unlike most other IT-droids, the IT-904 was fiercely independent and was highly sarcastic when dealing with organic lifeforms of all kinds."}, {"tag": "h4", "text": "IT-1"}, {"tag": "p", "text": "The IT-O was inevitably succeeded with new models with more refined torture equipment, like the IT-1, which was one of the available tools used for interrogation in the Death Star, along with IT-O."}, {"tag": "h4", "text": "IT-3"}, {"tag": "p", "text": "Yet another IT model was the IT-3, which was especially popular with Ysanne Isard, Director of Imperial Intelligence. The IT-3 incorporated even more manipulators and injectors than its predecessor, and had a glossier shine, presumably so that victims could see in their reflection exactly what was done to them during interrogation. In addition to the tools of its predecessor, the droid had three power shears and a trio of syringes. An additional syringe contained Sith poison. Unlike its prototype, the droid could and would speak Basic while performing its grisly work, in a motherly, soothing voice, intended to be far more unnerving than a torture droid that remained silent. Most IT-3s were dismantled after Coruscant was liberated from the Empire after the New Republic came to power."}, {"tag": "h4", "text": "IT-O 26"}, {"tag": "p", "text": "The IT-O 26 served the Empire on board the Star Destroyer Desolator. The tools at the droid's disposal included knives, twin hypodermic needles, and a grasping claw delivering electric shocks. The droid's shiny surface allowed the victim to see their own reflection during the torture."}, {"tag": "h4", "text": "IT-O9"}, {"tag": "p", "text": "Many decades before the Battle of Yavin, the IT-O9 served the crime lord Riboga the Hutt, hovering near his throne whenever he was entertaining his unsavory guests. After the end of his regime of crime in the Cularin system, it was employed by the SoroSuub Corporation, which had no official need of interrogator droids, and had the droid reprogrammed as a quality control agent."}, {"tag": "h4", "text": "Krath torture droids"}, {"tag": "p", "text": "In 3996 BBY, while reigning as Emperor over the Empress Teta system before the Battle of Yavin, Lord Keto, kept dissidents in line with the regular use of torture droids. Although their technology was seemingly antiquated, Keto's son Satal found them nonetheless effective when he became co-ruler of Empress Teta. Some droids could be modified from their primary functions to serve as torture droids. Satal Keto, co-leader of the Sith-inspired Krath, used ordinary medical droids and modified them to perform surgical tortures on individuals. Ulic Qel-Droma was a victim of Keto's torturous ways. When Ulic attempted to infiltrate the Krath, Lord Keto had the Jedi restrained in the dungeons of the Krath's Iron Citadel, where Krath torture droids administered excruciating punishments to him."}, {"tag": "h4", "text": "SD-XX"}, {"tag": "p", "text": "Dubbed \"Double-X,\" SD-XX, was Darth Caedus's personal security droid during the Second Galactic Civil War. At the end of the war, the droid had been given new assignments as a torture droid. Equipped with a wide array of needles, probes and electrodes hidden inside its fingers, \"Double-X\" was tasked with torturing Ben Skywalker to find the Jedi's hidden base. After the droid failed to get any information out of Ben, SD-XX was sent to hunt him down after Ben escaped."}, {"tag": "h4", "text": "Sith torture droid"}, {"tag": "p", "text": "During the reign of Darth Krayt, Darth Maladi, head of Sith Intelligence and Assassination, often used torture droids which appeared as mechanical jellyfish with tentacles consisting of knives, probes, and other devices."}, {"tag": "h4", "text": "T0-D Interrogation droid"}, {"tag": "p", "text": "Yet another torture droid employed by the Galactic Empire was the wheeled T0-D Interrogation droid. It was equipped with two claws and tool mounts, as well as a stun baton and a sonic stunner. The latter creates waves of sonic energy that assaults the victim's aural receptors, creating high-frequency vibration that penetrates the brain, causing the victim great pain. Not even deaf people were immune to it."}, {"tag": "h2", "text": "Resistance"}, {"tag": "p", "text": "Resistance to torture was often associated with interrogation, although the term also applied to brainwashing, endurance and coercing. Technically, interrogation was asking questions. Interrogation usually accompanied torture, with torture itself being the result of the individual's reluctance or outright refusal to cooperate. To make it even harder to resist, the victim's head could be fitted with a scrambler to reduce their resistance to questions."}, {"tag": "p", "text": "Tolerance for pain would help, bur according to the Sith Lord Scourge, this was useful only against \"the simplest and least effective interrogation method.\" (Scourge did not elaborate on the details of the more effective methods, but loosely described them as knowing how to counter techniques for interrogation resistance, or learning their tricks by understanding how their mind worked.)"}, {"tag": "p", "text": "Many people would resort to desperately babbled lies, evasions and half-truths in a desperate attempt to escape the pain, and therefore, information gathered through torture was often unreliable or even worthless. Even so, interrogation through torture was viewed as an effective means of gleaning information from the reluctant, but there were still those who were incapable of breaking, in spite of the extreme anguish."}, {"tag": "h4", "text": "Strength of will"}, {"tag": "p", "text": "Shortly after the rise of the Galactic Empire, the smuggler Schurk-Heren was imprisoned and electrically shocked by Haka Hai, who was hoping to pry the location of some mysterious contraband out of Schurk-Heren. Hai admitted that he didn't expect him to break, and the smuggler lived up to his expectations."}, {"tag": "p", "text": "In 0 BBY, while a captive aboard the first Death Star, Princess Leia was tortured by Darth Vader in order to learn the location of the hidden Rebel base. Leia was introduced to an IT-O torture droid, and pain was inflicted through needles, pressure points, fire-knives and electro-shocks. Vader also employed mind-altering drugs and subliminal suggestion in his sessions with the Princess, which made Leia believe that her skin was on fire and her flesh being torn apart, causing the same reaction the real thing would. Leia maintained her resistance, even when she was near dying from the pain. It was only under threat of destroying Leia's homeworld of Alderaan by Grand Moff Wilhuff Tarkin did Leia relent, and expose the location of the decoy rebel base on Dantooine. Tarkin then obliterated Alderaan anyway, saying that Dantooine was far too remote for an effective demonstration of the Death Star's power. Shortly after the battle of Yavin, when Leia was once again taken captive by the Empire, the Pau'an interrogating her didn't even bother inflicting pain, as he had read her file, and knew she'd rather die before she talked."}, {"tag": "p", "text": "While on a mission for the Rebel Alliance, Han Solo was captured by the information broker Jib Kopatha. Desperate to know the location of the Rebel fleet to escape Darth Vader's wrath, Kopatha left Han to his own personal torturer, Choba. Choba was surprised when Han proved to be stronger than the other victims he'd had on his table, and never got the chance to finish the job, as Han was rescued by Chewbacca and the smuggler Sheel Odala."}, {"tag": "p", "text": "Another example was Han and Leia's fellow Rebel Mirith Sinn, who refused to reveal anything while being tormented by Carnor Jax's men in order to make her disclose the location of the former Emperor's Royal Guard Kir Kanos. Other Rebels who managed to pass the ordeal were Dirk Harkness and Jai Raventhorn."}, {"tag": "p", "text": "In 137 ABY, Princess Marasiah Fel was tortured and interrogated by Sith Lord Darth Havok. She resisted Havok's torture, which included Force lightning attacks."}, {"tag": "p", "text": "Many soldiers were trained in interrogation resistance, but if the interrogator also knew the techniques, the interrogator might know how to counter them, making it harder not to break."}, {"tag": "p", "text": "One technique to help a person withstand torture was called \"drawing inward\"; this involved breathing techniques, and the visualization of mental images. This drawing inward also separated mind from body, and helped the individual either remain oblivious to the pain to come, or relive the pain from previous moments, thereby ignoring the present torment. Other ways involved putting one's focus elsewhere, which could be everything from strong feelings like hatred, dedication to one's cause, or pleasant things like the warmth of the sun. The Mandalorian mercenary Kal Skirata taught his clone troopers a technique of resisting interrogation by shutting out reality to become someone else who wasn't in your terrible situation. One way to achieve this was to visualize putting the pain and fear in a box, or concentrating on its physical reality so minutely it fragmented and ceased to register; another method was to imagine you were somewhere else. One could also focus on the next moment one could bear to think about, like the next meal, second, or step, time after time until the ordeal was over."}, {"tag": "p", "text": "The Jedi of the Galactic Republic were taught to absent the mind from the body when exposed to extreme stimuli. The Cerean Whiplash leader Thi Xon Yimmon, had been tortured once during his youth, and used this technique to deal with it, although he was not a Jedi."}, {"tag": "p", "text": "Mandalorians were trained to endure torture, as were Imperial agents, whereas the Zabraks were known for their incredible willpower, being able to endure intense physical pain and torture without breaking their resolve. The Chalactan Adepts, a philosophical-mystic order of Chalactans, went through training which made them resistant to all forms of mental manipulation and brainwashing, including by torture."}, {"tag": "h4", "text": "Force resistance"}, {"tag": "p", "text": "Many Force-users were able to endure pain through mental focusing techniques, which made them appear somewhat stronger than others in terms of handling pain. One of the methods was a kind of mind trick, another way was setting up a Force block in one's mind. Both the Jedi and the Matukai were capable of withstanding enormous amounts of pain. The Jedi Master Revan was tortured by the Sith Lord Scourge for months, but never revealed any useful information. Scourge was eventually convinced that torturing Revan was an unproductive waste of time and resources. The Jedi Master Yaddle went through a torture session with the warlord Tulak without even screaming once. Alek Squinquargesimus was skilled at using his Jedi powers to block out pain, which impressed \"Doctor\" Demagol greatly while experimenting on Jedi during the Mandalorian Wars."}, {"tag": "p", "text": "The Zabrak Jedi Master Eeth Koth had an outstanding talent for Crucitorn, a Jedi technique for transcending physical pain that went far beyond the Zabrak ability to withstand torture. The technique made the user capable of ignoring the debilitating effects of the pain and focus despite great physical trauma."}, {"tag": "p", "text": "When the Jedi Yuledan was tortured by the Yuuzhan Vong, he used the Force and his own strength of will to prevent himself from revealing information to the Vong. Initially, he was successful, but eventually, the agony inflicted upon him by a spineray became too much to bear, and he gave the Vong the information that they sought."}, {"tag": "p", "text": "In rare instances, a Force-user's pain control could be circumvented by another Force-user. This was the case of Jedi Master Shylar, who was tortured to death by the Sith Lord and former Jedi, Count Dooku."}, {"tag": "h2", "text": "Droids as victims of torture"}, {"tag": "p", "text": "Droids could feel pain in their own way if a pain-stimulator button, a tiny device connected by a single wire, was added to their central circuits. This technology was supposedly restricted, and typically installed in droids meant to interact with organics at the most personal level. This was supposed to give them a deeper understanding of organics. Droids equipped with the pain-stimulator would react to pain through pain transmissions and sine waves of pain and despair. They could even be tortured to the point where they stopped functioning. It was also possible to torture information out of a droid.[source?]"}, {"tag": "p", "text": "Droids were also capable of taking pleasure from the pain of other droids. One notable example was EV-9D9, who existed for bad feelings and enjoyed experimenting with her fellow droids. She took great pleasure from their suffering and despair, and each squeal of despair from her victims was like a surge of fresh current through her circuits. She would record the sensations, playing them back over and over, calling up associative memory files of flavor, texture and shifting densities of sensory input."}, {"tag": "p", "text": "An 8D8 smelting operator droid worked as a droid torturer in Jabba the Hutt's palace, where his job was to make sure that every droid and slave knew their place. 8D8 would use red-hot brands to melt the casings of lazy or obstructive droids, or sometimes just for fun, like with the power droid that C-3PO and R2-D2 saw when they ended up inside 8D8's torture lair after being acquired by Jabba the Hutt. During EV-9D9's career at Jabba's palace, 8D8 assisted her in the torture and dismantling of the other droids in Jabba's labor pool. The 8D8s were one of the most mean-spirited droids in service in the galaxy."}, {"tag": "h2", "text": "Cultural significance"}, {"tag": "h3", "text": "Abyssin"}, {"tag": "p", "text": "Abyssin could heal quickly and regenerate any body part, but when an elderly Abyssin lost these regenerative abilities, they were expected to voluntarily exile themselves to die in the desert. If they refused, they were brutally stoned by their tribe. If the elder was able to regenerate after the ordeal, they were allowed to rejoin the tribe; otherwise, they were ritually and regularly stoned until they died or gave in to tradition and wandered off to die in the desert."}, {"tag": "h3", "text": "Colicoids"}, {"tag": "p", "text": "Colicoids were cannibalistic, emotionless and vicious beings. Those unfortunate enough to be caught in the middle of their feeding frenzy, risked being eaten alive; if given the chance, the Colicoids would pounce on the victim, quickly stripping bones of meat and flesh, slicing and dicing her or him like filleted fish."}, {"tag": "h3", "text": "Devaronians"}, {"tag": "p", "text": "Though Devaronians were not generally malevolent, their tradition of severe capital punishment kept them from being accepted into the New Republic. Criminals found guilty of a capital crime were thrown alive into a nest of ravenous quarras, rending her or him to pieces in a public execution."}, {"tag": "h3", "text": "Ebruchi"}, {"tag": "p", "text": "The Ebruchi were cruel pirates who enjoyed the pain and suffering of others, and showed no kindness unless they gained something in the process. When a lone starship or a small convoy passed through their territory, the Ebruchi would usually just intercept their prey, but when confronted with enigmatic enemies, they used a different method. Pretending to be friendly, the strangers would be invited to meet aboard the Ebruchi command vessel for a feast and an exchange of information. The ambassadors were then seized as hostages, either to wring out an hefty ransom, or torture the prisoners to learn the location of hidden treasure."}, {"tag": "h3", "text": "Entuurans"}, {"tag": "p", "text": "The Humans of the planet Entuur valued pain and suffering, which could partially explain the sadistic tendencies of the Entuuran High Inquisitor Mox Slosin, one of the Empire's most efficient interrogators. During the years of the rebellion, a report from the Task Force on Alliance Security described him as perhaps one of the most sadistic and cruelest beings in the Empire's service. In his mind, torture was an art form, almost a game, where the challenge was to traverse the line of the victim's pain and endurance without killing the person. Still, occasionally his enthusiasm would drive him too far, and his subjects died during \"overly sensitive\" interrogations."}, {"tag": "h3", "text": "Ewoks"}, {"tag": "p", "text": "The Ewoks were a good-natured species who valued community, friendship and family. But although they may look cute, they were cunning, ferocious warriors, and an Ewok tribe wouldn't think twice about cooking its enemy alive over open flames. They were also known to eat their enemies' roasted flesh."}, {"tag": "h3", "text": "Geonosians"}, {"tag": "p", "text": "The bloodthirsty civilization of the Geonosians enthusiastically encouraged public executions in gladiatorial arenas, where condemned individuals would die a gruesome death from the sharp teeth of savage beasts, or at the hands of their fellow prisoners. Thousands of Geonosians would congregate in the execution arenas to watch, and the vicious animals were goaded by the static pikes of picadors."}, {"tag": "h3", "text": "Gungans"}, {"tag": "p", "text": "Gungans were not tolerant of anyone who threatened their peaceful culture. They had very strict laws, and would go to the extremes to punish anyone who had committed even a minor crime. Vandals were given a sentence of exile or caning, even being stoned to death."}, {"tag": "h3", "text": "Hutts"}, {"tag": "p", "text": "Undisputed lords of the underworld, most Hutts were vicious megalomaniacs who considered their species to be beyond morality as perceived by lesser beings. Combined with the fact that many Hutts were leaders of the vast Hutt Empire(s), it was hardly surprising that many Hutts enjoyed torturing sentients to gain their own ends. Hutts were the most notorious gangsters in the galaxy; most of them took great pleasure in torturing their enemies, and more than a few of them liked to find new \"sport\" in these activities."}, {"tag": "p", "text": "Hutt Matriarch Tassaa Bareesh of the Bareesh Clan had a torture chamber in her palace, where unruly slaves were punished."}, {"tag": "p", "text": "The notorious Hutt crime lord Jabba Desilijic Tiure enjoyed the cruelty of torture, such as imprisoning victims in a room with bloodsucking worms, or execution by feeding them to the rancor, sacrificing them to the sarlacc in the Great Pit of Carkoon, having them thrown out the airlock, or tying them up in Tatooine's Valley of the Winds, where the sand tides would throw the sand deposits and small stones around with such velocity that they would cut into the victim's skin, slashing them to death; this method was known as the Teeth of Tatooine. His architect Derren Flet was executed when Flet failed to provide adequate space for the countless dungeons where Jabba's enemies suffered slow, painful deaths."}, {"tag": "p", "text": "Another feared Hutt crime lord was Rokko the Hutt, notorious for being one of the most vengeful gangsters of Coruscant's underworld. His invention and enjoyment of various forms of torture was the stuff of many a con beings's nightmare. The gangster Durga the Hutt was also fond of using torture as a tool. When he learned that his parent, Aruk, had been poisoned to death, Durga's entire household staff was rigorously interrogated. Durga oversaw each session personally, and at least six members died. Other Hutt gangsters using torture as a means to an end were Grappa, Zonnos, Riboga, and Bogga."}, {"tag": "h3", "text": "Nightsisters of Dathomir"}, {"tag": "p", "text": "The Nightsisters of Dathomir prided themselves in ruthlessness and barbarism, and a propensity for violence and cruelty was drilled into their early training. A Nightsister was encouraged to impose her will on those weaker and constantly test her power, and would earn the respect of her fellow sisters by being at least as powerful as them, or, even better, making them fear her by being twice as ruthless. The ones who failed to learn ruthlessness were cast out, or, more commonly, would not survive. According to the Dathomiri Nightsisters, the weak were meant to serve."}, {"tag": "p", "text": "The dark side Force witches would gladly torture their slaves or prisoners to punish them or keep them in line. The same thing went for the weak ones. Occasionally Nightsisters painfully executed individuals, if for no other reason than it suited their desires at the time. One method was to inject the victim, or force them to drink a liquid containing artery worms. The worms would burrow through the victim's veins and feed on their arteries. A Nightsister would survive the treatment after a day of torment; others would not, unless they were given a special potion containing witch blood, which would rid the victim of the worms, provided the worms hadn't reached their heart."}, {"tag": "h3", "text": "Mandalorians"}, {"tag": "p", "text": "The life of the Mandalorians revolved around battle and war, both as a culture and as a source of pride and honor. Often working as mercenaries, assassins, and bounty hunters, Mandalorians were proven to be ruthless adversaries, known for their tough pragmatism and brutality. In battle, they would do whatever was necessary to reach their objective. While it is unknown exactly how common the use of torture was among these feared warriors, at least some Mandalorians had no qualms about implementing torture as a means to an end. Notable examples were the mercenary and assassin Kal Skirata and mercenary Walon Vau. Apparently, the bounty hunter Rav Bralor shared their attitudes; after the Kaminoan cloner Ko Sai was captured by Skirata during the Clone Wars, Bralor casually asked him what information he was going to beat out of Sai. The Mandallian Giant Feskitt Bobb employed a special torture method called the Burning, to apprehend his quarries. The clone commando RC-1136 (\"Darman\"), who was trained by Kal Skirata, went as far as saying that torture had to be done, and did not make you a bad person."}, {"tag": "p", "text": "Right after the Battle of Naboo, the Mandalorian Silas was tortured by Count Dooku for information on Jango Fett. As a Mandalorian, Silas was trained to withstand torture, but Dooku's methods were too much for him to endure. After telling everything the Count wanted to know, he was killed through an ultra-lethal injection."}, {"tag": "h3", "text": "Skrillings"}, {"tag": "p", "text": "Skrillings devoured uncooked, spoiled meat, that would have made others deathly ill. As a result, they often lived near the torture chambers of unscrupulous despots, or anywhere else where a steady supply of corpses and other carrion could be found."}, {"tag": "h3", "text": "Tal Nami"}, {"tag": "p", "text": "The Tal Nami had an intense dislike of villainous traders, and any dealer who was caught trading unfairly was punished by having their feet tied to the roots of an egoa tree, and their arms tied to the branches of the tree, a tree which grew at a rate of one meter a day. The Tal Nami would even travel light-years to track down a villainous trader."}, {"tag": "h3", "text": "Tofs"}, {"tag": "p", "text": "The Tofs were hedonistic warriors who would wage war and wreck entire civilizations just for the sake of their amusement. Vandalism and torture was part of this lifestyle."}, {"tag": "h3", "text": "Tusken Raider lifestyle"}, {"tag": "p", "text": "Adolescent Tusken Raiders had to undergo ritual blood rites, in which they were obligated to capture and torture a lifeform for weeks before ascending to adulthood. The Tusken emerged more esteemed if the victim was sentient."}, {"tag": "h3", "text": "Vagaari"}, {"tag": "p", "text": "The Vagaari were feared throughout the Unknown Regions. They had a near-total lack of empathy, and the Vagaari Empire thrived on cruelty and terror. Males and females had separate roles within their society, and Vagaari females made up the castes responsible for torture."}, {"tag": "h3", "text": "Yuuzhan Vong"}, {"tag": "p", "text": "The Yuuzhan Vong glorified pain as a motive for action and as a state of living. The Vong warrior caste derived perverse pleasure from their own pain and from the pain of others."}, {"tag": "p", "text": "When Jedi Knight A'Sharad Hett was captured by Yuuzhan Vong scouts, they imprisoned him and placed him in their Embrace of Pain. Hett was relentlessly tortured and subjected to biological experiments, replacing both his cybernetic eye and arm with biological Yuuzhan Vong components."}, {"tag": "p", "text": "During the first stages of the Yuuzhan Vong invasion, Jedi Knight Miko Reglia was captured at Helska IV. There, he was introduced to a yammosk and subjected to \"mind-breaking,\" where the Vong would feign his execution by drawing him in to within centimeters of the yammosk's voracious teeth, over and over again. Each pseudo-execution replayed in his mind nearly as vivid as the actual act."}, {"tag": "p", "text": "In the midst of the Yuuzhan Vong War, the Yuuzhan Vong Commander Shedao Shai made use of the Embrace of Pain to inflict pain on himself and others, including Caamasi senator Elegos A'Kla."}, {"tag": "p", "text": "When Jedi Knight Tahiri Veila was captured by the Vong, she was subjected to a painful shaping project by the Master Shaper Mezhan Kwaad and her assistant Nen Yim, who attempted to make Tahiri closer to the Yuuzhan Vong, creating a new personality for her: that of Riina Kwaad."}, {"tag": "p", "text": "Later in the war, several Jedi were assigned to destroy the cloning facility at Myrkr, including Anakin, Jacen and Jaina Solo, and Tenel Ka, Tahiri Veila, and Zekk. The Jedi were captured and tortured, and one of them, Ulaha Kore, almost died. The Yuuzhan Vong commander Duman Yaght showed particular sadism against the Jedi by repeatedly inflicting pain upon the already injured Ulaha, and by forcing Jaina Solo to choose which of her brothers was to be tortured."}, {"tag": "h3", "text": "Zanibar"}, {"tag": "p", "text": "The frightening Zanibar used live subjects for their ceremonies, ritual sacrifices that no victim ever returned from. Judging from what Kir Kanos saw when traveling to Xo to rescue Mirith Sinn, the hapless prisoner was restrained and kept hanging upside down, before being carved up with sharp axes and spiky sickles."}, {"tag": "h2", "text": "Regimes and organizations"}, {"tag": "h3", "text": "The Absolutes"}, {"tag": "p", "text": "During the reign of The Absolutes, the dissidents of New Apsolon were imprisoned and subjected to \"reclassification,\" which was the government's term for torture. Prisoners were often kept waiting without food or water for long periods to break down their resistance, before being \"reclassified.\" Separate rooms were designed for different forms of torture. One chamber had screens where the prisoners had to watch other victims being tortured, sometimes their own friends or family."}, {"tag": "h3", "text": "Corporate Sector Authority"}, {"tag": "p", "text": "The Corporate Sector Authority often resorted to torture and intimidation to coerce unwilling prisoners into revealing information. They had many of the same tools as the Galactic Empire at their disposal, like energy prods, interrogation and truth drugs, nerve disruptors and torture droids. The Authority's penal colony was Stars' End, a facility located on Mytus VII, where in the main tower, the doomed prisoners were confined in stasis booths until removed for interrogation or execution. The interrogation facilities were located in the top levels of the tower. Over time, Stars' End developed a reputation in some Imperial circles for effectiveness in its interrogation techniques."}, {"tag": "p", "text": "When the Trianii colony world Fibuli was annexed by the Authority, some Trianii tried armed resistance. The ones captured by the invaders were brutally interrogated by the Corporate Sector Authority's Security Police (\"Espos\"), who were seeking their ringleaders. One of the methods used was The Burning. Among those who were captured and put in Authority custody was Atuarre's mate, the resistance fighter Keeheen, and their son Pakka. The Authority was no respecter of age and convention, and used methods of interrogation on Pakka, which had left the cub unable to speak when his mother finally managed to rescue him. Keeheen was subjected to countless torture sessions, but refused to help the Authority with the subjugation of his people, and was sent to Stars' End, where his life consisted only of countless interrogations and cycles of dreamless sleep in a stasis booth. He was eventually rescued, and reunited with his wife and son. Pakka began to speak a few week after the family's return to their homeworld Trian. His speech was rare and halting, but he was beginning to get over his trauma."}, {"tag": "h3", "text": "Doan Royal House"}, {"tag": "p", "text": "Many centuries before the battle of Yavin, the planet Doan was ruled by the Doan Royal House. A vast dungeon complex, called the Stone Prison, was built into the rock several kilometers below their castle, and was used to make political opponents vanish. The prisoners were shielded from detection by scanners, and could disappear forever, spending the rest of their life in shackles, tortured for information or sadistic pleasure."}, {"tag": "p", "text": "In response to public pressure from the Galactic Senate, the Stone Prison was eventually closed down. More than forty years later, in 980 BBY, Princess Serra used the prison's facilities to torture the Sith Lord Darth Bane, believing him to be the one who killed her father."}, {"tag": "h3", "text": "Galactic Alliance Guard"}, {"tag": "p", "text": "The Galactic Alliance Guard (GAG) was formed in the wake of growing protests and violent terrorist groups opposing the increasingly dictatorial methods of the Galactic Alliance. The new, secret police force was a covert branch of the Galactic Alliance Intelligence Service, and was tasked with finding and eliminating those who threatened galactic peace and order. In the beginning, this was meant to be the terrorists, whose attacks were mostly coordinated from Corellia. Later, the GAG would expand its mandate to target anyone their leader, Darth Caedus, viewed as a threat to galactic peace and his own power."}, {"tag": "p", "text": "The organization would soon become feared across the entire galaxy. Caedus gave those under his command leave to use any method necessary to identify the enemies of the Galactic Alliance and force them to reveal their comrades. Not only would a suspect be subjected to torture, but to gain even more information, her or his entire family would be arrested and made to watch. Even expressing a negative opinion about the Galactic Alliance was enough to be tortured. Caedus himself personally conducted the most vicious interrogations. The GAG was formally disbanded after the defeat of Caedus."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "During the reign of the Galactic Empire, torture was elevated to an art form. The Imperial regime had many tools at its disposal, like energy prods, interrogation and truth drugs, nerve disruptors, racks and torture droids."}, {"tag": "p", "text": "According to rumors, Emperor Palpatine himself kept private detention centers in Coruscant's lower levels, with IT-O torture droids to tear information from the reluctant. When Pollux Hax, chief of the Emperor's propaganda dissemination section, wrote an article about the wonders of Imperial Center (a report commissioned by Palpatine himself), he claimed that the Emperor had no need for such \"barbaric practices,\" and had \"no need to keep secrets.\" In reality, there existed several secret torture chambers close to the solid surface of the planet, disguised as nondescript, run-down buildings."}, {"tag": "p", "text": "The Emperor himself viewed torture as a useful tool; after the Empire's ultimate weapon (the Death Star) was destroyed, Palpatine summoned the chief engineer, Bevel Lemelisk, to meet with him personally. There, Lemelisk was locked in a cage and eaten alive by hungry piranha beetles as the Emperor blamed him for the weapon's design flaw. After finally succumbing to what he thought was his death, Lemelisk awoke the next day in a clone body, with all memories intact. Palpatine told him that though his talents were quite useful, failure of any sort was intolerable. All in all, he would be executed seven times, every execution just as painful, from being lowered inch by inch into a vat of molten copper (which Palpatine told Lemelisk was what the smelter preferred that day), being flushed out of an airlock and crushed by hard vacuum, to being sealed in a room where acid mist gored and dissolved his flesh."}, {"tag": "p", "text": "Torture wasn't exclusive to Palpatine or Imperial umbrella organizations; many Imperial officers also utilized the painful art form. Notable examples were Admiral Natasi Daala, General Sk'ar,Captain-Supervisor Grammel and Leonia Tavira. Imperial Grand Admiral Pitta was a zealous anti-alien bigot and defender of Human High Culture. His three Imperial dungeon ships—the Apocahk, the Angrix and the Azgoghk—searched the Outer Rim territories, depopulating alien homeworlds and dooming the hapless inhabitants to slavery and vivisection. The chief scientist Leonis Murthé aboard the Azgoghk used the alien prisoners for his personal studies, experimenting with new ways to kill and investigating how long he could make a being scream."}, {"tag": "p", "text": "Several people joined or defected to the Rebel Alliance after witnessing how the Empire treated its prisoners. One notable example was Zevulon Veers, member of the Empire's Sub-Adult Group battalion and son of Imperial soldier Maximilian Veers. When Zevulon's commanding officer, Ivo Laibach, tortured an elderly man suspected of supporting the Alliance, he helped the man escape and defected to the Rebel Alliance. Another example was the medic Ahleazah, who did her best to relieve the pain and suffering of her fellow beings after being forced into the Empire's medical corps. Eventually, she managed to escape, and served the Alliance as a medic and healer."}, {"tag": "h4", "text": "ISB"}, {"tag": "p", "text": "COMPNOR (the Commission for the Preservation of the New Order) was a vast and influential umbrella organization, designed to maintain support for Emperor Palpatine's New Order and to indoctrinate the youth of the Empire. An important part of its structure was ISB (Imperial Security Bureau), the Empire's law-enforcement division, which provided protection for the Imperial populace - in the form of surveillance, investigation, interrogation and reeducation. As an organization created to increase the Emperor's knowledge of political events, one of ISB's tasks was to uncover beings or activities that might obstruct Palpatine's plans. The people caught who were suspected of withholding information were sent to Interrogation, one of ISB's branches. Apparently, few people really knew what happened to the suspects, since no one really wanted to know. \"Facilitation\" was an ISB euphemism for torture."}, {"tag": "p", "text": "The former Imperial Navy officer Dav Kathis experienced firsthand that use of torture wasn't utilized only by COMPNOR's ISB subdivision. Kathis was kidnapped by a group of COMPNOR thugs who erroneously believed he was supplying information to the Rebel Alliance, and when the group finally realized that they'd caught the wrong person, Kathis was nearly dying from the torture and interrogation sessions."}, {"tag": "h4", "text": "Imperial Intelligence"}, {"tag": "p", "text": "A rival to ISB, Imperial Intelligence had its own branch of Interrogation, and Rebels or other enemy agents caught by the organization were usually sent to Interrogation to undergo thorough questioning, using drugs, psychology and mental and physical torture. Imperial Intelligence (Intel) had many sophisticated torture devices at its disposal, including pain tables, nerve inductors, sensory deprivation chambers, sensory overload chambers, selective neurotoxins, truth drugs and IT-O torture droids. However, Imperial Intelligence members were not so fanatically dedicated to the New Order as their counterparts in ISB, and Interrogation was said to be somewhat less bloodthirsty than ISB and therefore slightly less effective in breaking a Rebel's will. Unless the Rebel suspect was believed to hold vital information, interrogation would be light compared to what it could have been, but many of the prisoners would be subjected to brainwashing through neuroprogramming and image surgery. Subconscious instructions and posthypnotic commands could be programmed into a prisoner's subconscious through the use of hypno-imprinting and hypno-indoctrination. The technique was used on many captured Rebel agents, who were then released, and found their way back to the hidden Rebel bases. The hypno-imprinting forced these Rebels to spy for the Empire without knowing that they were betraying the Rebel Alliance. A suicide command could be implanted into the Rebel's mind, activating if the brainwashing was discovered by their fellow Rebels."}, {"tag": "p", "text": "When the Rebel mathematician Jorin Sol was betrayed by the Jabiimi resistance fighter Tal Hesz, he was taken into Imperial custody, and tortured personally by Darth Vader. After giving Vader the logarithms used for rendezvous points of the Rebel fleet, he was taken to the Imperial base on Kalist VI, and tortured by the Imperial Intelligence Lieutenant Zuud. When Jorin was finally rescued, he had been brainwashed and given a special mission: \"Destroy the Rebellion from the inside.\""}, {"tag": "p", "text": "The Director of Imperial Intelligence, Ysanne Isard, was known for her masterful interrogation skills and was able to extract full and true confessions out of most subjects before day's end."}, {"tag": "h4", "text": "The Inquisitorius"}, {"tag": "p", "text": "The Inquisitorius was a secret division of Imperial Intelligence, consisting of Force-trained agents called Imperial Inquisitors. These agents performed various tasks for Intelligence, including surveillance missions and intelligence-gathering, but were most often called upon to assist with interrogation of prisoners; though Force-sensitive, many Inquisitors learned only basic Force powers suited for interrogation. Intelligence would rarely call upon the Inquisitorius, but did so when all other methods of interrogation failed, including drugs and torture. With their potent Force-skills and powerful techniques of manipulation, Imperial Inquisitors rarely failed to break the victim's will. They were ruthless and effective even when not using the dark side of the Force, and few could withstand an interrogation session with an Imperial Inquisitor."}, {"tag": "p", "text": "The agents were also charged with seeking out other Force-users, either turning them to the will of the Emperor, or eliminating them. They specialized in scouring the Galaxy for all types of Force-sensitives, from surviving Jedi to adepts to primitive shamans, and every student of the Force not aligned with the Emperor. Inquisitors were enlisted by the Emperor himself to destroy the last remnants of the Jedi Order, and would seek out, track down and capture Jedi who escaped the Great Jedi Purge. The captured Jedi were faced with an ultimatum—usually along with torture—to turn to the dark side and join Palpatine's New Order, or be destroyed. The Inquisitors were known for their ruthlessness, and could torture an entire village of innocents to draw one Jedi into a trap. The best Inquisitors had everything from starships to money at their disposal, including sophisticated torture instruments."}, {"tag": "p", "text": "The Citadel Inquisitorius was the central base of operations for much of the Inquisitorius. The citadel was a towering black spire jutting from a position nestled in the mountains of the planet Prakith. There, the High Inquisitors were given assignments and came to confer with others of their order. Housed within the spire were a number of torture chambers and detention blocks used to detain and torture the most dangerous and strong-willed prisoners. Many citizens on Prakith whispered that the screams of the Jedi brought to the citadel echoed across the mountains for days at a time."}, {"tag": "p", "text": "High Inquisitor Antinnis Tremayne was a former Jedi Knight who was seduced by the dark side. The most feared and respected High Inquisitor in the Outer Rim, he was a master of manipulation and his interrogation skills were formidable. He was disarmingly polite and composed, unnerving his subjects. He believed the victim, as an intelligent subject, could be convinced that they were better off to confess, rather than stubbornly resisting to the point where torture was necessary. Cordial and friendly, he wanted his victims to know how much he regretted that fate had brought them together like this, and often took some time explaining that when two ideologies intersected, one must give way, and it would not be Tremayne's. Quiet and calm, he reassured his victims that they would break. Often, his mere presence was enough to break the will of those who had resisted all other approaches. He had failed to break only one victim; the Jedi Corwin Shelvay. After losing a lightsaber duel with Shelvay, he chose metal cybernetics for his damaged face and arm, to enhance the fear in those he interrogated."}, {"tag": "p", "text": "Another notable Inquisitor was Loam Redge, who derived great pleasure and joy from his work, and finding, torturing and destroying Force-sensitives was his highest priority. He was good at his vocation, and when he was at his busiest, he looked as though he was enjoying a private joke."}, {"tag": "p", "text": "Stratagems of the Inquisitorius was a book on torture and interrogation, used by the Inquisitorius."}, {"tag": "h4", "text": "Department of Punishment"}, {"tag": "p", "text": "Also around 0 BBY, the Galactic Empire commissioned the Department of Punishment, a government agency dedicated to the relentless torture of detained Rebels and Imperial criminals. The department was run by the infamous Master Torturer Vengnar Heiff, who rather than use devices to torment his captives, used his massive reptilian claws to brutally slash and gore them. The very nature of Heiff's methods garnered him the nickname the butcher, and the majority of his peers sought to remain in good standing with him because of it. The screams could be heard throughout the Ithorian herdship Tafanda Bay as the Master Torturer tore apart his helpless victims."}, {"tag": "h4", "text": "School of Torturers"}, {"tag": "p", "text": "Yet another testament to the Empire's tradition of extracting information the painful way was the School of Torturers, a training facility on Coruscant."}, {"tag": "h3", "text": "The Krath"}, {"tag": "p", "text": "Four millennia before the Battle of Yavin, Lord Keto was the ruler of the Empress Teta system, sharing the power with the Carbonite Guild. Both were arrogant and ruthless, and Keto kept dissidents in line with the regular use of torture droids. When Aleema and her cousin came to power after the coup in 3996 BBY, they kept the tradition of using torture droids going, to crush any resistance from those who were unwilling to accept them as their rulers. The Sith sorceress Aleema also liked to feed dissenters to her pet, a serpentine constrictor with quills that wrapped itself around the victim."}, {"tag": "h3", "text": "The Lost Ones"}, {"tag": "p", "text": "The Lost Ones were a Coruscant street gang who were at one point led by the Ortolan Trunks Bibo. One of the few things in life that Bibo took pleasure in was torturing new gang members, and the Lost Ones' gartro rookery ritual, devised by Bibo himself, was notorious in Coruscant's underworld for its needless cruelty."}, {"tag": "h3", "text": "Sith"}, {"tag": "p", "text": "Many members of the order of the Sith utilized torture as a tool; notable examples included Darth Malak, Darth Zannah, Darth Sidious and his apprentice Darth Vader, Vergere, Darth Caedus and his apprentice Tahiri Veila, Darth Krayt, Darth Maladi and Darth Havok. Sith were also known for torturing Jedi with physical agony to try and corrupt captive Jedi to the dark side of the Force."}, {"tag": "h4", "text": "Sith Intelligence and Assassination"}, {"tag": "p", "text": "During the reign of Darth Krayt, the agency in charge of torture was Sith Intelligence and Assassination. The Devaronian Sith Lord Darth Maladi presided over this \"branch of government,\" and was herself an expert in the ways of torture."}, {"tag": "p", "text": "One of her victims was the Jedi healer Hosk Trey'lis, who was interrogated by Maladi in her laboratory, and was made to reveal the identity of Cade Skywalker. Lady Maladi used torture droids to implement brutal punishments on the Bothan Jedi until she finally gleaned from him Skywalker's name."}, {"tag": "h4", "text": "Sith training"}, {"tag": "p", "text": "The life of a Sith apprentice, one aspiring to attain the rank of Sith Lord, was laden with mental and physical torture. This relentless \"training\" was designed to mold the apprentice into an individual who was strong, calculating, and determined."}, {"tag": "p", "text": "In 3956 BBY, the Jedi Bastila Shan was captured by Darth Malak. In order to force her into accepting the dark side, he relentlessly tortured her for a week through the use of Force lightning. She eventually fell to the dark side and became his apprentice, although she was later eased back to the light side by a redeemed Revan."}, {"tag": "p", "text": "During the tenure of Lord Skere Kaan's Sith Brotherhood of Darkness, the students of the Sith academy on Korriban were subjected to rigorous training exercises that many of them felt were along the lines of torture. The practice of covering the students' training sabers with microscopic Pelko bug barbs, was implemented in lightsaber training exercises. The barbs secreted a venom which when introduced to an individual's bloodstream, caused numbness and severe pain, similar to the feeling an actual lightsaber strike induced. Students were to practice their combat techniques daily, and many sessions often ended with students severely injured, as though they had participated in actual combat."}, {"tag": "p", "text": "After Galen Marek became Darth Vader's secret apprentice, his new master spent years personally training Starkiller (the codename Galen now went by), in the ways of the Sith. Starkiller's training was harsh and unforgiving: Vader subjected the boy to rigorous physical tests bordering on torture."}, {"tag": "p", "text": "After Jacen Solo was captured by the Yuuzhan Vong, Vergere, who years later was revealed to be one of the Sith, held him trapped in the Embrace of Pain for weeks, forcing him to give into the pain and understand the strength gained from it when it was fully embraced."}, {"tag": "p", "text": "The Embrace of Pain was used again by the Sith Lord Darth Caedus, who in 40 ABY used it to torture his own cousin, Ben Skywalker aboard the Anakin Solo. Hoping to forge Ben into a Sith apprentice, Caedus took Ben to the lower levels of the Star Destroyer, where he secretly had his own personal Embrace of Pain installed. Ben was subjected to Vong biotoxins injected via organic needles that caused immense pain and swelling. Ben was subsequently rescued by his father, Master Luke Skywalker, but his recovery was painstaking; the injections continued to cause him agony, and swelling from his wounds took weeks to heal."}, {"tag": "p", "text": "Dread Lord Darth Krayt had previously experienced the Embrace of Pain after completing his apprenticeship with XoXaan on Korriban and being captured by the Yuuzhan Vong. As Dark Lord of the Sith, Krayt would use the Embrace as part of the training for certain members of the new Sith Order, including Darth Nihl, in order to push them towards the dark side. One of Nihl's ordeals in the Embrace was so painful that it drove him to slaughter an entire village. Krayt would also have the Embrace of Pain installed in the underlevels of the Temple of the Sith."}, {"tag": "h3", "text": "The Tundei"}, {"tag": "p", "text": "During the early years of the New Republic, the nominal government of Abregado-rae was usurped by the Tundei regime. After a relative golden age of smuggling and piracy, the new regime of the planet was extreme in their persecution of lawbreakers, and would torture those who were even suspected of armed violence or trafficking contraband. Political dissidents also became victims of torture."}, {"tag": "h2", "text": "Torture in the name of science"}, {"tag": "p", "text": "During the Mandalorian Wars, the Mandalorian scientist Demagol used the conquered people of the Outer Rim as subjects for his grisly studies. He was particularly interested in finding a biological base for Jedi powers. Initially, Jedi were kidnapped for this purpose, before hostilities with the Galactic Republic surfaced, and a number of Jedi captured on Suurja poured into his lab on Flashpoint Station, to serve as new research subjects. Demagol's methods of research included the rack, irradiation, electroshock and vivisection. Some of his test subjects died."}, {"tag": "p", "text": "When the Arkanian Offshoot Jarael was captured by Mandalorians while impersonating a Jedi, she was taken to Flashpoint, where other Jedi were being tortured and tested by Demagol. After arriving she met with Squint, a Jedi who had also been made into a prisoner. Upon seeing that he had a new test subject, Demagol wanted to study Jarael immediately. Squint, however, protested and insisted that he go in Jarael's place since he had already discerned that she was not a Jedi, and knew that there were trials only a Jedi could survive."}, {"tag": "p", "text": "Roughly ten years before the Battle of Naboo, Jedi Master Qui-Gon Jinn was captured and brought before the famed scientist Jenna Zan Arbor, who was studying the traits of Force-sensitive individuals (with hopes of genetically engineering Force sensitivity into normal beings). Her \"experiments\" included phlebotomy and torture, designed to test Qui-Gon's endurance."}, {"tag": "p", "text": "The scientist Leonis Murthé was fond of experimenting on living beings, finding new ways to make them die and experimenting with how long he could keep them screaming. Active during the reign of the Galactic Empire and years afterwards, the doctor eventually admitted that he gave up any science pretense long ago, and was simply doing it for his own personal pleasure."}, {"tag": "p", "text": "Dr. Cornelius Evazan, also known as \"Doctor Death,\" was a notorious man posing as a medical doctor in order to use his patients as subjects for unauthorized and often fatal experiments. Evazan had the death sentence in twelve star systems, and was wanted for murder, medical malpractice, practicing medicine without a license, assault, and torture."}, {"tag": "h2", "text": "Secret locations"}, {"tag": "h3", "text": "Anakin Solo"}, {"tag": "p", "text": "During the Second Galactic Civil War, Darth Caedus had the Embrace of Pain installed in a secret hangar bay on board his command ship, the Anakin Solo. There, he used the Embrace to torture his cousin, Ben Skywalker, hoping to turn him to the Dark side of the Force."}, {"tag": "h3", "text": "Lusankya"}, {"tag": "p", "text": "In 1 ABY, when the Executor-class Star Dreadnought Lusankya was commissioned for use by the Galactic Empire, it was taken to Coruscant and buried underneath Imperial City. While stationed there, a section of the Lusankya was used as a private corrections facility by the Director of Imperial Intelligence, Ysanne Isard. To thwart any potential escape attempts, the prison was fitted with a rotating artificial gravity generator. Prisoners believed they were right-side up, but in truth, were upside down, so that any attempts to dig themselves to freedom would only lead them deeper within the prison."}, {"tag": "p", "text": "Isard used the dreadnought's facilities for her Imperial intelligence-gathering needs, usually including torture and interrogation. Captives were tortured to collect secrets, and selected prisoners were turned into sleeper agents. Isard was ruthless during interrogation sessions, employing multiple methods as required—torture, drugs, and psychological conditioning—to learn what she desired."}, {"tag": "p", "text": "Alderaan native Tycho Celchu was also sent to the Lusankya, having been captured during a failed spy mission to Coruscant. Isard tried to condition Celchu and turn him into one of her agents, but the methods were too extreme and left him catatonic. The Corellian pilot Corran Horn was imprisoned within the bowels of the Lusankya, where he was tortured by Isard for vital New Republic secrets. When Isard realized that Horn would reveal nothing, she had him placed in the general population of the prison, from which he would later escape."}, {"tag": "h3", "text": "Secret bunkers"}, {"tag": "p", "text": "During the reign of the Galactic Empire, several secret interrogation chambers existed close to the solid surface of Imperial City. The constructions were disguised as nondescript, run-down buildings, but in reality, they were sealed bunkers protected by strong metal walls. The inside of the bunkers were a showcase of tools designed to induce pain: racks, bed platforms with manacles and electrical rods, pain-inducing drugs and serums, interrogation droids, and so on."}, {"tag": "p", "text": "After the New Republic's capture of Coruscant, EVS-6962, a construction droid under the supervision of Wedge Antilles, inadvertently uncovered a secret Imperial Interrogation Center during its routine tear-down assignments."}, {"tag": "h2", "text": "Consequences"}, {"tag": "p", "text": "The mere threat of torture was often enough to cause the most determined resistors to cooperate. Mandalorian Protector Mirta Gev was one such individual. While under the custody of the Sith Lord Darth Caedus and his apprentice Tahiri Veila, Gev was threatened with disfigurement; Lady Veila intended on misshaping Gev's face, if she refused to disclose who it was that cut off Lord Caedus's arm. Mortified by the threat, Gev relented, and told everything she knew."}, {"tag": "p", "text": "Threats of torture could also force an individual to torture others. Doctor Akanseh was an accomplished surgeon and a great philanthropist who was captured by Moff Kentor Sarne after the Battle of Endor. Moff Sarne confiscated Akanseh's private medical suite, and forced the doctor to work for him as an interrogator. Akanseh tried to carry out his duties in his own manner. Rather than resorting to torture, he attempted to convince his subjects to trust him enough to disclose the information willingly. He knew that if he couldn't obtain the information in this manner, the prisoner would be turned over to Imperial interrogators and their savage droids, or worse, Akanseh might be forced to perform the act himself. Once, while interrogating a stubborn resistance fighter, Sarne decided to drop in for a spot inspection to make sure the doctor was performing accordingly. Akanseh was forced to chemically torture the prisoner, or face the same fate himself if he didn't produce results soon. After being freed by New Republic forces, Akanseh joined the crew of the FarStar corvette, who were tasked to hunt down Moff Sarne. Deeply regretful of his service as Sarne's interrogators, he hoped to make up for what had done."}, {"tag": "h3", "text": "Temporary effects"}, {"tag": "p", "text": "The pain inflicted on the victim during the actual torture section would often linger for a long time, days or hours, after the ordeal was over. The victim might feel that it hurt to breathe, to wear clothes, to swallow. Other temporary effects included dizziness, fatigue, extreme physical or mental exhaustion, numbness, shivering, a raw or hoarse voice (due to the victim's screams), slurring, confusion, a nasal quality to the voice (due to a broken nose), temporary loss of memory (for example, the Rebel Dirk Harkness had difficulties remembering his own name after being tortured by COMPNOR), catatonia and blackout."}, {"tag": "h3", "text": "Physical injuries"}, {"tag": "p", "text": "Burns, cuts, puncture wounds, gouges and bruises were common effects of torture. Eyes glued shut, a black eye or two, split lips, swollen eyes, a broken nose and swollen lips were common facial injuries. More serious effects included disfigurement, broken bones, broken teeth, calcification of the skeleton, an elongated spine (from the rack), permanent brain damage, loss of limbs, and loss of one or more appendages and outer organs, like eyes or ears."}, {"tag": "h3", "text": "Mental damage"}, {"tag": "p", "text": "Wounds and burns could be cleaned up with sufficient bacta treatment, and body parts could be replaced by cybernetics. Mental damage would take considerably more. Torture could seriously harm the victim mentally. If they were lucky, they would only relive the ordeal in their nightmares; many individuals were badly traumatized, sometimes to the point of being unable to speak. This was the case with many of the citizens who were introduced to the IT-O Interrogator droid after being unlucky enough to be rounded up by the Imperial Security Bureau. Some torture victims succumbed to madness or were brainwashed. During an experiment by the Imperial commander Rezi Soresh to create the perfect assassin, the \"winner,\" X-7, was tortured and brainwashed to the point of not remembering his real name or his past, and didn't recognize the person staring back at him when he looked in the mirror. During the reign of the Galactic Empire, it was rumored that the Emperor's Shadow Guard, mute, ruthless Force-wielding warriors, were Jedi Knights captured and tortured by Darth Sidious, their minds so broken that they could not even speak."}, {"tag": "p", "text": "Some victims were tortured into insanity. Other were so broken mentally that they simply existed as mindless shells. Victims of torture could also suffer from mental suffering like catatonia, paranoia and egomania. About a millennium before the Battle of Naboo, the Gen'Dai bounty hunter Durge became a victim of unspeakable torture at the hands of the Mandalorians, who turned his species' natural longevity against him, finding ways of inflicting pain throughout his scattered nerves. Unable to die, his already dangerous psyche was pushed further past the brink of sanity."}, {"tag": "p", "text": "Curiously, some torture victims would come to respect and admire their tormentors. Jacen Solo bonded with Vergere this way, after she tortured him for weeks. Vergere was old and experienced, and serving her own agenda, and had been able to manipulate Jacen's growing psyche. This was a case of a psychological phenomenon in which hostages would grow strangely attached to their captors. Sometimes, captives even grew to love their warders, particularly if the warder was skilled enough in manipulating people."}, {"tag": "p", "text": "Prior to the Battle of Endor, the Rebel Alliance hero Tay Vanis was captured and tortured by Darth Vader, who left him a mindless shell of a man. After Vanis was found by his fellow Rebels, his droid LE-914 (\"Ellie\") destroyed both herself and her master, as an act of mercy killing."}, {"tag": "p", "text": "Mental post-torture traumas could be treated, at least to a certain degree, by placing the victim in hypno-trance and administering anti-trauma deprogramming."}, {"tag": "p", "text": "Sometimes, torture would be the catalyst in a Force-user's descent to the dark side. This was the case of Kam Solusar, who was tortured by the Dark Jedi Sedriss QL until he submitted. After the fall of the Galactic Republic, Jedi Knight Halagad Ventor was captured by the Empire, and tortured by Darth Vader himself. As Vader broke down Ventor's mental shields, Ventor told him everything he wanted to know, and was consumed by the dark side."}, {"tag": "p", "text": "Sith were known for torturing Jedi with physical agony to try and corrupt captive Jedi to the dark side. During the quest to find the ancient Star Forge, Jedi Knight Bastila Shan and soldier Carth Onasi were captured by Admiral Saul Karath and tortured into revealing Jedi secrets. Later, when Bastila was freed, she was then confronted by Darth Malak, and tortured with needles and relentless barrages of Sith lightning. Malak tortured Bastila for days, until she, unable to withstand the assault any longer, gave into the dark side, and became the Dark Lord's new apprentice."}, {"tag": "p", "text": "In year 23 ABY, the Jedi apprentice Lowbacca, along with his fellow apprentices Jacen and Jaina Solo, was kidnapped and taken to the Shadow Academy. There, he was locked in a room where he was repeatedly exposed to high-pitched, ear-piercing sound, flashing, blinding lights, and jets of near-freezing water at extremely high pressure. The only way to stop his suffering would be to smash the sonic generator, which was incredibly heavy and reinforced, so the only way to destroy it would be to call upon the dark side of the Force. Eventually, Lowbacca could no longer endure, and smashed the generator in a fit of rage and horror."}, {"tag": "h3", "text": "Suicide"}, {"tag": "p", "text": "Often, if the opportunity arose, the victim would gladly kill themselves rather than getting tortured. One incident was the Cerean grifter Toh Revo Chryyx, who somehow managed to stop his own heart before he could be delivered to the feared Hutt crime lord Rokko the Hutt. Majordomo Ob Fortuna strangled himself to death with a length of cable rather than facing his former employers in the Bounty Hunters Guild."}, {"tag": "p", "text": "During the days of the Old Republic, Republic Intelligence agents were issued tiny pellets containing a fast-acting poison. The tablets were insurance in case she or he was captured with no hope of escape, as a quick way out before the agent could compromise the Republic; Intelligence agent Hallena Devis kept hers in a snuff container in a wallet in her pants."}, {"tag": "p", "text": "Suicide was also a standard trick for members of the Rebel Alliance during the Galactic Civil War. When the Rebel Bria Tharen and her Red Hand Squadron were tracked down by the Empire during the operation to secure the Death Star plans, she committed suicide by swallowing a lullaby—Alliance Intelligence slang for suicide pill—knowing that she would more than likely be tortured if captured. According to Imperial documentation, another Rebel method was having an affide crystal hidden under a waterproof barrier in a false tooth. The crystal could be pried loose with the tongue, releasing the poison. Leia Organa Solo was taught how to will herself to die, through what was said to be the most difficult mind-act there was, especially for someone young and healthy."}, {"tag": "p", "text": "The infamous bounty hunter Boba Fett had ways to ensure that those of his prisoners who were worth more alive than dead couldn't kill themselves before he could collect the bounty. If the person attempted to injure themselves, they would be restrained; if they tried to starve themselves, the victim would be brutally force-fed."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Shortly before the outbreak of the Clone Wars, Shmi Skywalker, mother of Anakin Skywalker, was captured by Tusken Raiders and tortured for weeks. She died in the arms of her son, moments before he was able to successfully rescue her."}, {"tag": "p", "text": "During the reign of the Galactic Empire, death during interrogation was not entirely uncommon. One example was Von Longo, a prisoner on the Imperial prison barge Purge, who died during interrogation at the hands of Captain of the Guard Jareth Sartoris. During the Rebellion, several Rebels were tortured to death, including Shanda Dok, Tev Matthews and Ten Numb."}, {"tag": "p", "text": "During the Yuuzhan Vong War, several Jedi suffered the same fate, like Swilja Fenn and Yabeley."}, {"tag": "p", "text": "In 40 ABY, bounty hunter Ailyn Vel was led to Coruscant, where she hid in a Corellian community and was caught during the Galactic Alliance Guard's raids. Believing her to be a Corellian terrorist, Jacen Solo interrogated her. When she did not provide information, he used the Force to repeatedly slam her head into the table where she was sitting while attempting to enter her mind. The punishment was far more than Ailyn could endure, and she died while being questioned."}, {"tag": "p", "text": "Sometimes, another person would end the hapless torture victim's life, or kill a torture victim to be, as an act of compassion and mercy and/or to silence them before they could spill any secrets. During the Rebellion, the Rebel and doctor Aurin Leith was part of a team ordered to keep Gebnerret Vibrion, the head of a Rebel cell imprisoned by the Galactic Empire on Selnesh, from spilling any secrets, either by freeing him or killing him. Aurin was unhappy with the prospect of killing Vibrion, since it conflicted with her medical oath to \"do no harm,\" but eventually agreed to give Vibrion a dose of conergin to knock him out if it became necessary for the others to kill him. Luckily, the team managed to rescue Vibrion."}, {"tag": "p", "text": "During the Clone Wars, Hallena Devis worked as an agent for Republic Intelligence, but eventually decided to quit her job; a key factor for her decision was having had to make sure torture victims got killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Torture has been a part of Star Wars from the very beginning. In the rough draft of Star Wars: Episode IV A New Hope, Darth Vader tortures Princess Leia with powerful electroshocks. In the incarnation of the second draft of A New Hope, Leia is replaced by Deak Starkiller, brother of Luke Starkiller, who would become Luke Skywalker in later drafts. When the heroes find him inside his cell, there's a strange yellow glow in his eyes. In the third draft, Vader steps into Leia's cell, the door slams shut and \"her screams can barely be heard.\" The IT-O torture droid didn't appear until the fourth draft."}, {"tag": "p", "text": "In the movie, the door to Leia's cell slams shut before the viewer gets see what actually happens to Leia. In the Star Wars radio drama, the interrogation session was vividly depicted in a psychologically intense scene which was so chilling that it prompted some complaints from a concerned listener."}, {"tag": "p", "text": "For Star Wars: Episode V The Empire Strikes Back, director Irvin Kershner originally filmed more shots of Han Solo being tortured, which showed the machine in operation with spikes and needles and electronic things going, and flashes of electricity everywhere. It was cut because the filmmakers were afraid that this would be too intense for children. Some of Han's screaming off-screen was also taken out for the same reason. According to the director, everyone felt that the cut material was too much for a film of this type."}, {"tag": "p", "text": "In The New Jedi Order: Destiny's Way, chapter fourteen, Mara Jade Skywalker describes a phenomenon in which hostages \"sometimes grew strangely attached to their captors. Sometimes captives even grew to love their warders, particularly if the warder was skilled enough in manipulating people.\" This is known as the Stockholm syndrome."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "Titles set in bold means that the word torture, including inflections and compounds, is mentioned."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}