{"url": "Battle_of_Teth", "categories": ["Category:Canon articles", "Category:Canon articles with Legends content", "Category:Cleanup", "Category:Battle stubs", "Category:Battles in the Baxel sector", "Category:Battles of the Clone Wars", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of Teth"}, {"tag": "p", "text": "The Battle of Teth, also known as the battle on Teth, the assault at the B'omarr Monastery, the battle at the Teth Monastery, or the rescue of Rotta, took place on the Hutt-controlled planet of Teth between the Galactic Republic and the Confederacy of Independent Systems. The battle, one of the earliest of the Clone Wars, was waged as the Grand Army of the Republic attempted to save Rotta, the infant son of crime lord Jabba the Hutt, from the Confederacy; the Separatists planned to kill the Huttlet and pin the blame on the Jedi Order, thus bringing Jabba and the Hutt Clan onto the side of the Confederacy. Jedi General Anakin Skywalker and his Padawan, Ahsoka Tano, were able to rescue the Huttlet from Teth and managed to bring him to Tatooine, the planet upon which Jabba based his operations."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the First Battle of Geonosis, Dooku's Separatist Droid Army seized control of the major hyperspace lanes, separating the Republic from the majority of its newly commissioned clone army. To secure routes in the Outer Rim Territories, Dooku, at the behest of Darth Sidious, made a deal with Ziro the Hutt, uncle of Jabba the Hutt, to kidnap Jabba's son Rotta in order for him to become head of the Hutt Clans. Thus Dooku sent Admiral Trench, General Whorm Loathsom, and assassin Asajj Ventress to delay Jedi Generals Anakin Skywalker and Obi-Wan Kenobi on Christophsis. After Ventress fought with Skywalker and Kenobi, Loathsom and a tactical droid brought in reinforcements in order to continue delaying the Jedi while she moved on to the next part of Dooku's plan."}, {"tag": "p", "text": "Ventress then went to Tatooine, where she attacked the Khetanna and kidnapped Rotta. She took him to a monastery on Teth. Jabba's guards climbed onto one of the skiffs, then went to Jabba's Palace to inform him of this. Jabba sent out a call for help to the Republic, the Confederacy and his bounty hunters. Palpatine decided that the Jedi must help Jabba in order to gain access to the Hutt's space lanes in the Outer Rim to move their troops. Despite Mace Windu's reservations in dealing with Hutts, Windu believed there was more to the kidnapping. Windu, knowing that General Grievous had their forces stretched thin, could only spare Kenobi and Skywalker."}, {"tag": "p", "text": "Yoda sent Padawan Ahsoka Tano to Christophsis with orders for Kenobi and Skywalker to make contact with them. Yoda and Windu were then informed that two scouts had found Jabba's bounty hunters at an abandoned monastery on Teth. Yoda then arrived with reinforcements, ending the battle on Christophsis. He sent Kenobi to negotiate a treaty with Jabba while Skywalker and his new apprentice, Ahsoka Tano, rescued his son. Despite Skywalker's reservations about Jabba, Skywalker, Tano, and Captain Rex organized their troops and went to Teth."}, {"tag": "p", "text": "Jabba's bounty hunters were beheaded and had their heads returned to him at his palace. Kenobi went to Tatooine, where he assured Jabba that Skywalker would bring him back his son. However, Jabba said if they did not, Dooku and his Droid Army would. He told Kenobi that he had one planetary rotation to bring back his son alive. After Kenobi left, Dooku spoke with Jabba, telling him that he was being deceived by the Jedi, who were really behind his son's kidnapping. At first, Jabba did not believe Dooku and demanded that he bring evidence of his claims. Dooku assured Jabba that he would, instructing Ventress and 4-A7 to get the data he needed."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Skywalker traveled to Teth, where he was informed by Windu's scouts that at least two battle droid battalions were holed up at the monastery. Skywalker, Tano, Rex, and the rest of Torrent Company took the gunships and AT-TEs to land on Teth. They were forced to land below the monastery in order to avoid the dwarf spider droids' artillery fire. Skywalker and his forces used their extension cables to climb the side of the cliff. As they climbed, Skywalker and his men were able to defeat the battle droids' outer defenses. Upon arriving at the monastery, they found a droid caretaker, 4-A7, who told them where the battle droids kept their prisoner. Skywalker and Tano made their way through the Separatist defenses and found Rotta, who was sick. Ventress and 4-A7 managed to record Skywalker and Tano stuffing Rotta into a backpack, with Skywalker saying he hated Hutts. Ventress sent the recording to Count Dooku, who ordered her to rescue the Huttlet. Dooku then showed Jabba the recording, convincing him that the Jedi had kidnapped his son. Dooku told him that his droid army was planning to rescue his son. When Jabba asked Dooku what he wanted in return, Dooku asked if he would consider allying the Hutt Clans with the Confederacy."}, {"tag": "p", "text": "A clone sergeant reported to Rex that all remaining battle droids had been destroyed. Skywalker then contacted Master Kenobi about Rotta. He informed Kenobi of Rotta's medical condition and the Separatist involvement. However, Skywalker, R2-D2 and his forces came under attack by Ventress' reinforcements. Kenobi told them that he would bring Republic reinforcements to the planet. Skywalker, Tano, Rex and their forces retreated into the monastery, sealing the doors. Tano convinced her master that they had to get Rotta back to his father breathing by finding a way out. Skywalker left with Ahsoka and Rotta, while Rex and his men stayed behind to hold back the enemy forces. After Ventress cut the locks, the droids stormed the monastery, subduing the clones. As Ventress ordered her troops to lock down the monastery, Rex attempted to shoot her but was stopped. Ventress then Force choked Rex and demanded that he reveal where Skywalker went. When Rex refused, Ventress used a mind trick to make him contact the Jedi Knight. However, Rex ended up alerting Skywalker instead by using his first name. Skywalker was then convinced that Ventress was here to kill Rotta."}, {"tag": "p", "text": "As Skywalker and Tano moved to rejoin Rex, Rotta spotted a ship at another landing platform. Skywalker decided they would go for it, using a can-cell to get there. Tano briefly dueled with Ventress before her master came back for her. Once there, they found 4A-7, who exposed himself as a Separatist spy. Skywalker and Tano took the ship and left. Following this, Kenobi, Cody and their reinforcements arrived and rescued Captain Rex and Torrent Company from Ventress' battle droids. Kenobi confronted Ventress, engaging her in a lightsaber duel. The two fought through the monastery. During that time, Skywalker attempted to land on Admiral Yularen's ship. However, Separatist vulture droids destroyed the cruiser's hangars, forcing Skywalker to take the ship to Tatooine. Kenobi and Ventress sensed that Skywalker was gone. Kenobi offered Ventress a chance to surrender, but instead, she escaped onto a vulture droid. Following this, Kenobi rejoined Rex and his forces in finishing the battle."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After escaping, Ventress contacted Dooku and Jabba, telling them that the battle was lost and lying that Skywalker had killed Rotta. Despite this, Dooku convinced Jabba to let him take of care of Skywalker. Due to Dooku's lies, Jabba refused to accept any communications from Chancellor Palpatine and the Jedi. Naboo Senator Padmé Amidala tried to broker a treaty with the Hutts through Jabba's uncle, Ziro. However, Amidala learned that Ziro was conspiring with Dooku in order to take control of the Hutt clans. Ziro took her prisoner, but she was saved by her protocol droid, C-3PO, who alerted Commander Fox, and his Coruscant Guard."}, {"tag": "p", "text": "As Skywalker and Tano prepared to land on Tatooine, they came under attack by MagnaGuards in Rogue-class Porax-38 starfighters. Despite destroying them, Skywalker and Tano were forced to crash-land in the Dune Sea. Skywalker sensed that Dooku was coming to finish the job, so he sent Ahsoka and R2 to take Rotta to Jabba's Palace. Skywalker was found by Dooku and dueled him in order to distract the Sith Lord. However, Dooku anticipated this and had prepared his MagnaGuards for it. Skywalker was able to subdue Dooku and leave him in order to rescue his Padawan before she was killed by Jabba. As Skywalker entered the palace, Jabba told him that his son was not here. Skywalker threatened Jabba, despite telling him that he would die. Fortunately, Tano arrived with his son, alive. Still furious, Jabba ordered them to be executed. As his henchmen pulled out their blasters, Jabba was contacted by his uncle Ziro, but it was actually Amidala who revealed Ziro's part in Dooku's scheme. Jabba, seeing he had been deceived, then allowed the Republic access to to his space lanes and asked that Dooku be brought to justice."}, {"tag": "p", "text": "Despite the setback, Darth Sidious assured Dooku that the engines of war had turned in their favor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}