{"url": "Torpedo_Sphere/Legends", "categories": ["Category:Legends articles", "Category:Battlestations", "Category:Galactic Empire starship classes", "Category:Loronar Corporation products", "Category:Torpedo Spheres"], "nodes": [{"tag": "h1", "text": "Torpedo Sphere"}, {"tag": "p", "text": "The Torpedo Sphere was a massive mobile battlestation manufactured by Loronar Defense Industries, a subsidiary of Loronar Corporation."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Torpedo Sphere was constructed by Loronar Corporation, under their subsidiary imprint Loronar Defense Industries. It was designed to accomplish one objective; to neutralize and knock out a planet's planetary shields. Planetary shields prevented the use of soldiers in invading a planet, unless the shields could be taken down first. Planetary shields also protected planets from orbital bombardment from Star Destroyers. The Torpedo Sphere was produced to overcome these obstacles. Torpedo Spheres were not available for sale, but cost 327,830,000 credits to construct."}, {"tag": "h2", "text": "Design"}, {"tag": "h3", "text": "Layout"}, {"tag": "p", "text": "Measuring 1,900 meters in diameter, the Torpedo Sphere was a massive, nearly spherical, mobile battlestation with an equatorial trench. The outer hull of the Torpedo Sphere was covered with thousands of dedicated energy receptors that were programmed to scan and analyze power emissions from a target planet's shield, looking for a weak point to exploit. All planetary shields suffered from power fluctuations like any mechanical device, and the Torpedo Sphere's DERs constantly scanned to find a weak spot of around a twenty percent power drop."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "Each Torpedo Sphere was armed with five hundred proton torpedo tubes, arranged in an inverted cone in the center of the vessel's equatorial trench. The tubes were designed to fire simultaneously in a single salvo. Because all the tubes had to be calibrated and coordinated to fire by teams of technicians, the launchers could not be automatically fire-linked, and therefore could not be synchronized to fire at targets less than planet-sized. It was possible to link up to fifty tubes together using fire-link controls taken from other weapons to target and fire at normal starships. The tubes were surrounded by a ring of ten heavy turbolaser batteries."}, {"tag": "p", "text": "To accomplish its primary mission, the Torpedo Sphere arrived in orbit of a target planet, and scanned the shields to determine its weak point and to locate the deflector shield generators. A hundred heavy weapon technicians took several hours to calibrate and coordinate the proton torpedo launchers once the weak spot had been identified, and fired the salvo at a target of no more than six square meters to open a hole in the shield. The hole was, in actuality, a power surge that barely lasted for a few microseconds, and the turbolaser batteries fired through the hole to destroy the planet's shield generators. If the turbolasers failed to fire in time to take advantage of the shield weakness, the entire process had to be started over. The hardest part of the Torpedo Sphere's mission was to determine the location of the target planet's shield generators. On board sensors were unable to penetrate the shield to locate the shield generators on the surface; as such, technicians aboard the Sphere analyzed the shield's power waves to determine where the power was entering the shield from to determine the location of the generating source. At least two Loronar DS-13 projector deflector shield generators were employed to shield the vessel."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "Torpedo Spheres could reach relative speeds of 930 kilometers an hour, and were equipped with a Class 3 hyperdrive, with a Class 18 as a back-up. The Sphere's sublight drives were located in the equatorial trench at the rear of the vessel, directly opposite to the proton torpedo launchers. The hyperdrive was located just above the sublight engines. The navigation computer was a Sienar Fleet Systems model."}, {"tag": "p", "text": "Each vessel had a cargo capacity of 3.8 million metric tons, and carried consumables for a duration of four years. Torpedo Spheres did not carry any supporting starfighters, instead relying on an escort of a Star Destroyer or other capital ships. It did, however, have hangar space to carry cargo shuttles, Lambda-class T-4a shuttles, and MT/191 drop-ships."}, {"tag": "p", "text": "The reactor core chamber was a huge metallic Sphere with coolant conduits and heat sinks. A metallic platform ran around the reactor wall some one hundred and fifty meters above the actual reactor, which was a twenty-meter Sphere covered in coolant coils. Ultraviolet purple light emanated from ports along the reactor's sides. The entire core was warm and unpleasant to be in due to the radiation being emitted from the core."}, {"tag": "h3", "text": "Command and control"}, {"tag": "p", "text": "Torpedo Spheres required a crew of 63,275 to operate; 61,245 regular crew and 2,030 dedicated gunners. If needed, the Torpedo Sphere could be operated by a skeleton crew of only 20,415. In addition to the crew, 8,540 troops were transported aboard. The main bridge was located at the tip of the Torpedo Sphere's northern pole. The front of the bridge was dominated by a huge viewport which offered the command crew an actual view of target, and a tactical display off to the starboard side depicted battle information. Systems operations was located on the port side, and two crew pits were located just in front of the viewport where technicians analyzed and updated tactical and systems operation data. Computerized console seats were available for the Sphere's captain, first officer, and tactical officer on a raised command platform located in the center of the bridge, and a holobooth to send and receive holocomm transmissions was located at the port rear. Across from the bridge on the starboard side was the navigation nook, which was dedicated to operating and maintaining the sublight and hyperspace engines. At the rear of the bridge were two separate rooms, the general meeting room for conferences equipped with a small holoprojection unit, and the captain's office. Twenty-four technicians were required to operate the bridge at full capacity, with another eight technicians manning the navigation nook. Twelve stormtroopers were assigned to the bridge as security. The captain commanded the day shift, while the first officer ran the night shift."}, {"tag": "p", "text": "Torpedo Spheres had a dozen separate hangar bays, located along the Sphere's equatorial trench. Each hangar had a sixty-meter opening to space which was sealed with a magnetic field to prevent the atmosphere from escaping. Each hangar had enough space for four mid-sized shuttles to land, and lower storage bays were accessible by a pair of vehicle lifts. Two walls were studded with power cell rechargers, and each bay was sealed off from the rest of the Sphere with a pair of blast doors. Two cargo skiffs were assigned to each bay to help to move cargo. The bay's control room was located fifteen meters above the hangar floor, accessible by a turbolift. A transparisteel viewport overlooked the hangar, and the technicians in the control room were responsible for the activation of the magnetic field, the opening of the blast doors, and the vehicle lift controls."}, {"tag": "p", "text": "Crew quarters were a collection of five separate areas. In the center was a communal circular chamber that housed a mess hall, along with consumables storage and droid-staffed kitchen. Four corridors ran off the central chamber leading to crew quarters. Each spoke contained four separate crew quarters with refreshers, clusted around a central common area. Five crew sprawls were referred to as a Crew Cluster."}, {"tag": "p", "text": "Twenty security stations were scattered around the Sphere with barracks and sanitary facilities for Imperial Navy troopers and stormtroopers. The armories were stocked with blasters, blast helmets and blast vests, and offices for security personnel. The command station was located in the center of the security station, and the computer system was tied into the Sphere's holocam network. Technicians working in the computer pits controlled the Sphere's blast doors and security features. Generally, the security stations were manned by twenty-four soldiers and twelve security technicians. Some of the security stations were reserved for use by the Imperial Security Bureau."}, {"tag": "p", "text": "Gun-metal gray corridors provided access throughout the Sphere with glowrods spaced fifteen meters apart. Clusters of turbolifts were set every one hundred meters, with blast doors every twenty. Maintenance Access Shafts ran throughout the volume of the Sphere. They were typically two hundred and fifty meters long, and twenty meters in diameter. Each access hatch from the maintenance bays was flanked by pair of ladders up and down the shaft."}, {"tag": "p", "text": "Torpedo Spheres contained one hundred and twenty DER targeting control rooms. Each control room contained four computer stations dedicated to targeting and launching the Sphere's primary weapons. Two computers were dedicated to targeting and tracking the energy output of the target planet's planetary shields. The third computer analyzed the information collected by the other computers and saved the information onto the system database, which was the fourth computer. The computers were linked to their own dedicated power generators, which were located in separate rooms off the control room. A holoprojector dominated the center of the room, displaying a hologram of the target planet. Each DER targeting control room was connected to four torpedo launching stations, for a total of four hundred and eighty in the Sphere. The launching stations were responsible for the targeting and firing of the proton torpedoes. Maintenance hatches in both locations linked to the torpedo launch tubes that ran from the outer rim of the Sphere to the torpedo storage center. A retractable ladder in the tube allowed manual access from the control room down the tube."}, {"tag": "p", "text": "Turbolifts from the launching stations led to the loading area of the torpedo storage centers. At one end of the chamber was a cluster of twenty-five launch tubes. And the other end was a set of retractable blast doors leading to the torpedo storage. The storage chamber took up most of the storage center, which was made up of quadruple strength walls containing six racks loaded with thousands of proton torpedoes. The strengthened walls were to prevent collateral damage from an accidental explosion. Twenty-five B1-series worker droids staffed the storage center, and were responsible for retrieving and loading the proton torpedoes into the launch tubes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early Galactic Civil War"}, {"tag": "p", "text": "The Torpedo Sphere was a precursor to the Death Star, and it was rumored that the Yaga Minor weapons range was the location for early tests of the Torpedo Sphere prototype. In the Imperial Navy Order of Battle, a torpedo line was comprised of two Torpedo Spheres. Two torpedo lines and a pursuit line constituted a bombard squadron, with three bombard squadrons and a light squadron making up a system bombard. Two system bombards and two force escorts equalled a bombard fleet. Despite this organization, around 0 BBY only six Torpedo Spheres were in service, though the Empire had laid down hundreds more. Due to the fact that it was a mobile, spherical battlestation, members of the Alliance took to calling them \"pocket Death Stars.\" The Imperial superweapon known as the two-wave gravshock was housed in the shell of a Torpedo Sphere."}, {"tag": "p", "text": "During the Galactic Civil War, an Alliance team hijacked the Field Secured Container Vessel Black Ice and took it to the Mortex sector HQ at Fangol. Unfortunately, automated systems aboard the Black Ice broadcast a distress signal that called Imperial forces to Fangol. Over the course of a week, the Imperial forces blitzed the Alliance base in several waves until a Torpedo Sphere arrived in orbit. The Black Ice was used to ram and destroy the Torpedo Sphere."}, {"tag": "p", "text": "During the Galactic Civil War, a Torpedo Sphere was undergoing an upgrade at the Tallaani Shipyards. It was temporarily disarmed, and only had a crew of 1,200 security personnel—eight hundred navy troopers and four hundred stormtroopers—were aboard, along with 13,000 work crew personnel. Various factions, including the Justice Action Network and the Pelagia Freedom Force, worked to destroy the Torpedo Sphere. The incident gave the Empire the justification it needed to take a stronger hand in ruling the Tapani sector. Starlyte Station, a space station in orbit of Tshindral III, was constructed in the same spherical pattern as the Torpedo Sphere."}, {"tag": "h3", "text": "Post-Endor"}, {"tag": "p", "text": "By the time of the Battle of Endor, a Torpedo Sphere was being used defensively to guard the major shipyards at Corellia. A few months after Endor, this Torpedo Sphere was commandeered by Grand Admiral Danetta Pitta, who bribed the Corellian Diktat to become the protector of the Corellian sector. Pitta took the Torpedo Sphere as his flagship, and it engaged the forces of Grand Admiral Josef Grunger at the Battle of Tralus. Pitta was winning the battle through masterful use of the Torpedo Sphere's combat capabilities, and in a fit of spite, Grunger rammed his own flagship, the Executor-class Star Dreadnought Aggressor, into the Torpedo Sphere, destroying both vessels. Another Torpedo Sphere was stationed at Chasin at the time of the Imperial Civil War, and was destroyed when the captain of the Vengeance-class dreadnought Javelin rammed his ship into it during the fighting."}, {"tag": "p", "text": "In 10 ABY, New Republic historian Arhul Hextrophon recognized that, due to Super Star Destroyers and Torpedo Spheres, it had been impossible to estimate the power of the average Sector Group in the past. He made this observation in a guest lecture at the Brionelle Memorial Military Academy on Chandrila shortly after the Battle of Calamari."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}