{"url": "Tosche_Station/Legends", "categories": ["Category:Legends articles", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Tosche Station"}, {"tag": "p", "text": "Tosche Station was a power and distribution station located outside the town of Anchorhead on Tatooine. It was the power source of a number of surrounding cities, via dozens of sturdy underground cables. It stocked useful supplies for the local moisture farmers such as power converters. The station also provided services such as vehicle repairs and equipment recharging."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The station was named after its owner Merl Tosche, who rarely visited. Tosche's frequent absence meant that the station was usually managed by Laze \"Fixer\" Loneozner. As a result, it became a popular gathering place for local youths such as Luke Skywalker and Biggs Darklighter."}, {"tag": "p", "text": "Fixer spent most of his time at Tosche Station working on building an illegal podracer from spare parts, which he then planned to sell in Mos Espa to earn money for his wedding with his girlfriend Camie."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Luke came to Tosche Station to tell Biggs that he saw a battle taking place above Tatooine, and was subsequently ridiculed."}, {"tag": "p", "text": "After the Battle of Yavin, Tosche Station was run by the Bothan Cuan Talon. Circa 1 ABY, the Station warehouse manager Janus was killed by Desert Demons after his speeder bike broke down in the desert. In the meantime, spacers hired by Imperial Commander Barrezz as well as Rebel Captain Bastra approached Cuan as they were both looking for a droid recently acquired by Janus from Jawas. At the same time, wild creatures dug up and damaged the underground power cables, causing a blackout in the city of Bestine. Fixer was forced to hire hunters to destroy the creatures in the area to make way for repairs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tosche Station was supposed to appear in Star Wars: Episode IV A New Hope, but was cut from the film. The scene was, however, released in the deleted scenes of the special features of the Blu-Ray release of the original trilogy. The scene shows Luke Skywalker telling his friends, including Biggs Darklighter and Fixer, about a space battle he saw above the planet."}, {"tag": "p", "text": "The filming location is locally known as Sidi Jemour, on the Island of Djerba, Tunisia."}, {"tag": "p", "text": "In older sources such as the comic Star Wars 31 and Star Wars Insider 35 and the original script to Episode IV A New Hope, it is spelled \"Toshi Station.\""}, {"tag": "p", "text": "The station also appears in the training mission in the 2001 video game Star Wars: Rogue Squadron II: Rogue Leader and the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}