{"url": "Battle_of_Thila", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Illisurevimurasi sector", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Thila"}, {"tag": "p", "text": "The Battle of Thila was a conflict in 0 ABY during the Galactic Civil War, during which the Rebel base on Thila was destroyed."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Sometime after the Rebel evacuation of Yavin 4, Supreme Prophet Kadann led Grand Admiral Afsheen Makati to the Rebel base on the planet Thila. While in orbit, Kadann overheard Makati's first officer mocking his glittering robes, the uniform of the Secret Order of the Emperor. He lashed out at Makati with Force Lightning and chided \"Learn to rein in your subordinates, dear Admiral.\""}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Prior to the battle, Chewbacca had been readying Wedge Antilles's T-47 airspeeder. Unfortunately, Wedge jumped the gun as the Imperials began their attack and launched his airspeeder, only to find, thanks to fellow pilot Wes Janson, that the Wookiee had launched as well, hanging on to the speeder for dear life. During the fighting, Chewbacca leapt from Wedge's T-47 onto an enemy TIE Fighter, broke through the hatch and tossed the TIE pilot from his cockpit. The Wookiee then flew the fighter back to the hangar bay, following the completion of the battle. Despite the successful evacuation of Thila Base, Wedge found himself in the precarious situation of having both Chewbacca and Han Solo notably irritated with him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The chronological placement of this battle is uncertain. In writing Star Wars: Empire: The Wrong Side of the War, Welles Hartley mistakenly jumped to the conclusion that the Thila base had remained completely unchronicled by the expanded universe (having only been mentioned in The Movie Trilogy Sourcebook). Thus, one must infer that after the Ambush at Thila, the Rebels must have decided that the last place the Imperials would ever look for the new Rebel base would be in a location where a previous Rebel base had been."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}