{"url": "Tosinqas", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Males", "Category:Xexto"], "nodes": [{"tag": "h1", "text": "Tosinqas"}, {"tag": "p", "text": "Tosinqas was a male Xexto bounty hunter who lived during the last years of the Galactic Republic. In 22 BBY, the Xexto took part in a hunt for the criminal Rotar Lopani. Tosinqas found and killed Lopani on the planet Brentaal IV. However, Jedi Knight Reeft—also dispatched to capture Lopani—appeared on the scene. Tosinqas attacked Reeft and was bisected by the Jedi's lightsaber blade."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tosinqas was a male Xexto who lived during the waning years of the Galactic Republic. He became a bounty hunter in the Bounty Hunters' Guild and was active shortly before the start of the Clone Wars. In 22 BBY, officials of the Circarpous sector put a bounty of 8,000 credits on the thief Rotar Lopani. Tosinqas took the job and found Lopani in a crowded market on the planet Brentaal IV."}, {"tag": "p", "text": "However, the officials of Circarpous also asked for help from the Jedi Order, which dispatched Jedi Knight Reeft to capture the thief. Tosinqas attacked Lopani from above, falling several stories down on the subject and killing him. After that, Reeft, who was also present, activated his lightsaber and surprised Tosinqas, who attacked the Jedi. Tosinqas was cut in two by the Jedi's weapon and killed. Reeft took both the bodies of Lopani and Tosinqas and brought them to the Republic's capital planet, Coruscant. The incident later led to controversy between the Republic, the Jedi Order, and the Bounty Hunters' Guild."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a member of the Xexto species, Tosinqas had four arms. As a bounty hunter, he chose to kill Lopani instead of capturing his target alive. Tosinqas was shocked when Reeft activated his lightsaber, and his reaction to attack the Jedi led to his death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tosinqas was first mentioned in an article of HoloNet News Vol. 531 53, which was released in 2002. In 2007, when author Sander de Lange wrote a background story for the Xexto character Niai Fieso through the StarWars.com Hyperspace feature \"What's The Story?,\" he tried to find Xextos existing in the Expanded Universe and found Tosinqas. He ultimately used the bounty hunter in a different entry, which was never published. Fieso's entry was published, an entry in which de Lange chose to use another Xexto, Freon Drevan, instead of Tosinqas. In 2008, Tosinqas was mentioned in Reeft's entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}