{"url": "Battle_of_ThonBoka", "categories": ["Category:Legends articles", "Category:Battles in the Centrality", "Category:Battles of the early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Battle of ThonBoka"}, {"tag": "p", "text": "The Battle of ThonBoka was a battle in 3 BBY between the Oswaft and the Centrality, a client state of the Galactic Empire and the Renatasian Confederation inside the ThonBoka, a sack-shaped nebula that was home to the gigantic spacefaring Oswaft species. The Centrans had known of the species for generations but the aliens had not come to Palpatine's attention until just prior to Lando Calrissian's arrival in Dela III, the financial hub of the Centrality."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Fueled by his mistrust of a sentient alien species capable of hyperspace travel and functionally superior to a fighter craft, Emperor Palpatine issued orders to exterminate the Oswaft. The Empire and the Centrality blockaded the entrance to the sack-shaped ThonBoka with five hundred capital ships. Carrack cruisers were modified to contaminate the \"interstellar plankton\" drifting into the nebula, with the intent to starve the entire Oswaft race into extinction. The only Oswaft that had traveled outside the nebula was a young adult named Lehesu, who had befriended Lando Calrissian. Determined to save his species, Lehesu used a transceiver given to him by Calrissian's robot ally Vuffi Raa to contact the Millennium Falcon and plead for help."}, {"tag": "p", "text": "Calrissian penetrated the blockade, using a ruse that he was a trader plying his wares to the very ships that were his obstacle. Though the Falcon was inspected, no one below the rank of Admiral was informed of the reason for the blockade, so no one suspected that the ship's real cargo was the ordinary waste carried in its trash and toilet recyclers. After working his way to the front of the blockade, Lando made a break for the mouth of the ThonBoka. Inside, he contacted Lehesu and the massive Oswaft Elders. He taught them to play Sabacc, and the group began making plans."}, {"tag": "p", "text": "However, other Oswaft went to negotiate with the picket fleet. As the Empire's goals were complete extermination, the Empire merely destroyed the negotiators; in the process, the Oswaft \"shouted\" at the unshielded cruiser Courteous, destroying it with their maser voice-streams. The fleet, seeking retribution, raised their shields and entered the Nebula, but were called back by the leader of the Centrality, Rokur Gepta. He wanted to destroy Calrissian, a long enemy of his, personally."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "At the suggestion of Lando Calrissian, the Oswaft counterattacked. The Oswaft excreted heavy metals from their pores and then used their natural ability to hyperjump, leaving decoy Oswaft between the enemy cruisers. The Imperials fired on the decoys, resulting in massive friendly fire casualties. The Oswaft also \"shouted\" at the Imperial starfighters, destroying them with their powerful masers."}, {"tag": "p", "text": "At the same time, Klyn Shanga of the Renatasian Confederation hunted Lando and Vuffi Raa with his starfighter squadron, believing Vuffi Raa responsible for the betrayal of their world to the Empire. The gambler and his droid fought off the fighters, destroying several."}, {"tag": "p", "text": "After the Imperial fleet's forces had been reduced by 11%, the battle ceased as Rokur Gepta arrived in the Wennis, his command ship. Gepta then demonstrated the power of his life-destroying weapon, the electromagnetic torpedo, by destroying the surviving Oswaft Elders and many other Oswaft. The Sorcerer of Tund offered Calrissian an ultimatum: engage Gepta in personal combat, or Gepta would destroy all life in the nebula."}, {"tag": "p", "text": "Calrissian and Vuffi Raa (who was allowed to participate because Gepta believed he could reprogram the droid to betray his master) faced off against the Sorcerer of Tund in the vacuum of space. After much maneuvering and several ploys, Gepta was distracted by his former ally Klyn Shanga. Shanga had realized that his real target was not Calrissian's companion Vuffi Raa, but rather Gepta's advisor Osuno Whett."}, {"tag": "p", "text": "Shanga forced Whett's pinnace to crash into Gepta's unshielded command ship, destroying both ships. While Gepta stared, Calrissian landed a stray shot on his ankle. The Sorcerer's form withered, but he managed to shoot Vuffi Raa before vanishing, leaving an apparently empty space suit. Calrissian searched the space suit and found an injured snail-like creature where his shot had landed. He discovered Rokur Gepta was not a humanoid, but a small, nasty alien known as a Croke from the planet Crakull in the Unknown Regions that Lando had once visited. Calrissian squeezed the alien until the last Sorcerer of Tund was little more than a stain on his gloves."}, {"tag": "p", "text": "At that, the battle renewed, but for only a moment; out of nowhere, a multitude of fifty-kilometer self-aware droids appeared, demanding on all channels that the combatants \"Cease fire immediately or be destroyed!\" They were a race of sentient droids known as the Silentium and they were led by The One (the creator of Vuffi Raa) and The Other. These had come for their offspring."}, {"tag": "p", "text": "The Imperial/Centran fleet, faced with thousands of gigantic ships, retreated from their genocidal mission. Vuffi Raa's progenitors repaired the damage Gepta had dealt to him and departed with him into the Unknown Regions after playing a game of Sabacc with Calrissian. As a reward for his efforts, Lando departed the ThonBoka with a hold filled with valuable Oswaft-synthesized gemstones."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It is unclear what the exact classes of many of the Imperial ships involved in the battle were."}, {"tag": "p", "text": "There were noted to be 500 large capital ships in the blockading fleet. The cruiser Respectable, which was the first Lando visited, had a docking bay that is more than 200 meters long from the stern bulkhead to the closing hangarbay doors. The size of the hangar and the closing doors implies that it may have been a Venator-class Star Destroyer or some variant. This is also supported by the naming convention used for the cruisers seen in the battle, which seems more Republic than Imperial."}, {"tag": "p", "text": "As this is early in the Expanded Universe, the term cruiser may be used in the sense Han Solo used it in Episode IV - an Imperial-class Star Destroyer. At least one Star Destroyer, the Eminence, was present during the battle."}, {"tag": "p", "text": "Lando does not note the three other cruisers he visits were any different from the Respectable. One source has a large number of Carrack-class light cruisers in the blockade, but it is unclear if these were included in the capital ship count. The size of the cruisers compared to the size of the Oswaft means that if most of the cruisers had been Carracks the tactics used by the Oswaft in the battle should have had limited effect. The Carrack cruisers should have been able to shoot a part of an Oswaft that another cruiser was not necessarily behind."}, {"tag": "p", "text": "Dreadnaughts are also mentioned in the battle. While an illustration shows several ships that are apparently Dreadnaught-class heavy cruisers, there is one curious piece of phrasing in the book. The fifty-kilometer Rest are referred to as dwarfing the late Oswaft Elders and even the largest dreadnaughts in the fleet. This implies the largest dreadnaughts were larger than the kilometer-plus Elders and presumably also ISDs like the Eminence."}, {"tag": "p", "text": "Another curious case was the Wennis. It dated to approximately 78 BBY, and seems to have been an unknown type of large Republic battle cruiser that resembled a Star Destroyer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}