{"url": "Toryn_Farr/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance Military officers", "Category:Chandrilans", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Toryn Farr"}, {"tag": "p", "text": "Toryn Farr was a Human female who served as a chief communications officer in the Rebel Alliance during the Galactic Civil War. In 3 ABY, she was stationed in Echo Base on the planet Hoth."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Toryn Farr and her sister Samoc were raised on the planet of Chandrila within a family that was loyal to Mon Mothma. Opposed to the Galactic Empire, Farr's family enlisted the help of Chandrilan authorities and staged a transport crash, in which a number of children were supposedly killed, including the Farr sisters. The girls were taken offworld and they joined the Rebellion. Farr's sister, Samoc, became a skilled pilot and the two were stationed in Echo Base. As Chief Controller of Echo Command, Farr's primary duties included monitoring space surrounding Hoth and relaying orders to troops and vessels in the field."}, {"tag": "p", "text": "During the Battle of Hoth, she commanded the base's ion cannon when to fire on Imperial ships in orbit. Most notably, she gave the command which disabled the Imperial I-class Star Destroyer Tyrant, allowing the first GR-75 medium transport, the Quantum Storm, to escape through the blockade, which served as the opening shots of the engagement."}, {"tag": "p", "text": "Toryn was among the last Rebels to abandon Echo Base, leaving her station only after Princess Leia Organa ordered the final evacuation. After broadcasting the evacuation code signal to the surviving soldiers and pilots still engaging the Imperial assault force, she was the final person to leave the command center. Toryn escaped on the last transport to leave Hoth, the Bright Hope."}, {"tag": "p", "text": "Prior to boarding the transport, Toryn was stunned to see a large number of badly wounded soldiers still lying on the flight deck before the ship. Among the wounded was her sister, Samoc Farr, a talented snowspeeder pilot. Knowing her sister had been shot down led her to the realization of how truly horrific the battle outside had been."}, {"tag": "p", "text": "Toryn was instrumental in buying the wounded just enough time to board the transport before invading snowtroopers descended on the hangar. However, the time it took to load all the wounded onto the ship would prove to be the undoing of the Bright Hope, as it was quickly disabled during its blockade run before being able to make the jump to hyperspace."}, {"tag": "p", "text": "Crippled and drifting through space with little hope of escape, Toryn assumed command of the survivors and implemented a plan to save as many Rebel lives as possible. Three escape pods holding eighteen of the most valuable personnel to the Rebel cause were launched back to Hoth, in the hopes they might survive."}, {"tag": "p", "text": "Before the Imperials were able to capture the survivors of the Bright Hope, the ship was boarded by the bounty hunters Zuckuss and 4-LOM. They masqueraded as rescuers, when they were actually responsible for firing on the Bright Hope and preventing its escape. The truth behind their facade was to take the Rebels and use them as bait to capture Han Solo, and later, turn him in to Darth Vader."}, {"tag": "p", "text": "Following a brief melee, Toryn convinced the bounty hunters to take all ninety remaining Rebels on board and deliver them to the Rebel underground on Darlyn Boda. Before evacuating the ship, she dutifully erased all computer records on board, preventing vital information from falling into Imperial hands, including the names of many personnel who served at Echo Base."}, {"tag": "p", "text": "After spending a month on Darlyn Boda following her escape from Hoth, Toryn finally rejoined the Rebel fleet at the secret rendezvous point. For her brave efforts in assuming command to rescue the survivors of the Bright Hope, she was promoted to the rank of Commander in a ceremony led by General Carlist Rieekan aboard the EF76 Nebulon-B escort frigate Redemption."}, {"tag": "p", "text": "She was also given command of a group of Alliance Special Forces, with her first mission being to rescue the eighteen members of the Bright Hope who were jettisoned back to Hoth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Toryn Farr was played by Brigitte Kahn. A woman who looks similar in appearance to Farr is featured in A New Beginning, but there was no indication that this particular controller was the same character."}, {"tag": "p", "text": "Farr introduced the Raid Battles during the limited-time Operation Hoth Defensive Event in the 2013 card game app Star Wars: Force Collection. She was assigned Jobin's line. The Event was optional for players."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}