{"url": "Toryn_Farr", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Alliance Fleet officers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Toryn Farr"}, {"tag": "p", "text": "Toryn Farr was a human female who served as a communications officer in the Rebel Alliance during the Galactic Civil War. Toryn and her sister Samoc Farr joined the Rebellion at a young age and became the best in their areas. Three years after the Battle of Yavin, she was stationed in Echo Base on the planet Hoth and was tasked with monitoring anomalies in Hoth's atmosphere. At one point, Farr entered a betting pool and betted against Han Solo having success in courting Princess Leia Organa. At one point, Farr noticed a signature she thought was a Star Destroyer, but the ship passed right by Hoth without deviating from its flight path."}, {"tag": "p", "text": "After the Galactic Empire discovered their base, she coordinated the defense and evacuation of the planet from the control room. As the first Alliance transport, the Quantum Storm, prepared to depart, Farr communicated with ion control and calculated the vector to fire on to cover the transport. She watched triumphantly as the Star Destroyer Tyrant was disabled and the Quantum Storm escaped. Farr had to watch her friend Sunsbringer be injured and evacuated, but she remained in the command room to help the transports escape. She saw Princess Leia arrive in the room and told her that she was already supposed to have been evacuated, but Organa responded that she should have already been evacuated as well. Solo arrived soon after to help Organa leave, with the Princess ordered Commander Chiffonage to use the last remaining comm station to order the total evacuation. Farr watched as Chiffonage directed all troops from Sector Twelve to the south slope."}, {"tag": "p", "text": "Farr then ran for the last transport and succeeded in evacuating Hoth aboard the Bright Hope, the last transport to leave before Imperial forces swarmed the base. She met her sister, injured but alive, outside the ship and gratefully hugged her as they left."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Toryn Farr first appeared in the 1980 movie Star Wars: Episode V The Empire Strikes Back. She was portrayed by Brigitte Kahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}