{"url": "Tosche_Station", "categories": ["Category:Canon articles", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Tosche Station"}, {"tag": "p", "text": "Tosche Station was a power station and repair shop on the outskirts of Anchorhead on the desert world of Tatooine, owned by Merl Tosche and operated by Laze Loneozner. During the time of the Galactic Civil War, Loneozner was friends with Luke Skywalker and Biggs Darklighter, who, prior to becoming a member of the Rebel Alliance, spent time at the station with Lonezner, his girlfriend Camie Marstrap, and other youth from Anchorhead. After witnessing a battle between the Rebel Alliance and the Galactic Empire in the skies over Tatooine, Skywalker told his friends about what he had seen, but they did not believe it had been a battle. It was at Tosche Station that Darklighter informed Skywalker that he was defecting from the Empire to join the Rebel Alliance."}, {"tag": "p", "text": "After the Battle of Yavin, Skywalker reminisced he never picked up the power converters he mentioned before he left Tatooine."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A power station and repair shop, Tosche Station was located just outside of the city of Anchorhead on the Great Chott salt flat of Tatooine. The station was owned by Merl Tosche but he seldom visited, instead allowing his employee Laze \"Fixer\" Loneozner to run the shop."}, {"tag": "p", "text": "The station consisted of three buildings; the main building housed recharge facilities, a sales office, and game room. Next to the main building was a spare parts garage and repair shop. Behind the main building was the reactor building, which held a fusion generator from an in-system space barge. The reactor generated energy which was transmitted via underground power conduits to buildings in Anchorhead as well as nearby moisture farms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Merl Tosche owned Tosche station, but rarely visited. Customers appeared infrequently, giving Loneozner free reign of the station. Loneozner spent most of his time at the station with his friends, including his girlfriend Camie Marstrap, Luke Skywalker, Biggs Darklighter, Windy, and Deak. Loneozner secretly worked on building a podracer in the spare parts garage, which he intended to sell at Mos Espa, using the profits to fund his wedding to Camie."}, {"tag": "p", "text": "In 0 BBY, Skywalker went to the station to tell his friends about a battle he saw raging between two ships high above Tatooine. It was at this time that Biggs Darklighter informed Skywalker that he intended to abandon his newly assigned post on the Imperial starship Rand Ecliptic and join the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tosche Station was originally going to appear in Star Wars: Episode IV A New Hope, but was cut from the film. The scene was, however, released in the deleted scenes of the special features of the Blu-Ray release of the original trilogy. The scene shows Luke Skywalker telling his friends about a space battle he saw above the planet."}, {"tag": "p", "text": "The location and layout of the station were made canon, as well as the station's owner, Merl Tosche, when it was included in the 2016 version of Star Wars: Complete Locations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}