{"url": "Battle_of_Theed", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Battles of Naboo", "Category:Battles of Operation: Cinder"], "nodes": [{"tag": "h1", "text": "Battle of Theed"}, {"tag": "p", "text": "The Battle of Theed, which occurred over and on the planet Naboo, was fought between the forces of the Alliance to Restore the Republic and the shattered Galactic Empire during the Galactic Civil War in 4 ABY, twenty days after the Battle of Endor. The battle was part of Operation: Cinder, a posthumous Contingency order from Emperor Palpatine to render his homeworld and countless other planets uninhabitable in the event of his death."}, {"tag": "p", "text": "After the Empire launched weather-altering satellites into orbit, Lieutenant Shara Bey led Princess Leia Organa and Naboo's queen, Sosha Soruna, in N-1 starfighters to destroy the satellites. Their mission was a success, in part due to the timely arrival of General Lando Calrissian and the Alliance Fleet."}, {"tag": "p", "text": "The Imperial forces who survived the Alliance Fleet's intervention retreated to the surface of Naboo, where Organa, defected members of Inferno Squad, and Alliance forces defeated the Imperial troops by activating Theed's ion pulse weapon. The remaining Imperial forces were subsequently taken prisoner."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following a stream of Rebel successes in the aftermath of the Battle of Endor, Princess Leia Organa arrived on Naboo. Accompanied by her pilot, Lieutenant Shara Bey, Organa hoped to enlist the aid of Queen Sosha Soruna in forming a new galactic government."}, {"tag": "p", "text": "The Empire, however, had its own plans in place for the system as part of Operation: Cinder, which sought to create chaos by destroying key planets across the galaxy. Following up the successful destruction of Vardos, Captain Lerr Duvat's part of the plan involved using weather-disrupting satellites to create powerful storms, which would destroy the surface of Naboo."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Fight in orbit"}, {"tag": "p", "text": "With the system seemingly clear of all enemy presence, Duvat's Star Destroyer Torment began jamming sensors and communications on the Naboo's surface, and deployed its climate disruption arrays to begin razing the planet's surface."}, {"tag": "p", "text": "These actions were immediately noticed on the surface, however, Naboo had no military forces to defend itself from the attack. Desperate to provide some measure of defense for the planet, Soruna, Bey, and Organa seized three N-1 starfighters that had been mothballed within the sealed hangar of the Theed Royal Palace. The three then personally flew the starfighters to engage Imperial forces in orbit. Meanwhile, Soruna's head of security, Captain Korro, organized the evacuation of Theed."}, {"tag": "p", "text": "Despite the courage and skill of the three pilots, they were quickly overwhelmed by the sheer number of Imperial fighter craft. Fortunately for the rebels, the Alliance had learned that Naboo was Operation: Cinder's next target, and had deployed forces to intercept the attack. Two large rebel ships, the cruiser Restoration and the Mellcrawler II, jumped into the system. Accompanying them was a small fleet of starfighters, including Danger Squadron and defected members of Inferno Squad."}, {"tag": "p", "text": "The reinforced rebels reengaged the Imperial forces, destroying the remaining satellites. The starfighters then engaged the Torment, weakening its defenses before the Restoration dealt it a critical blow. However, before going down, the ship deployed its ground invasion force in an attempt to capture Theed and salvage the battle."}, {"tag": "h3", "text": "Battle for Theed"}, {"tag": "p", "text": "Responding to this counterattack, Organa, now accompanied by many Rebel troopers and Danger Squadron, returned to Theed to defend the city. Heavily outnumbered and outgunned on the ground, however, the rebels had little hope of defeating the invasion force conventionally. However, before the Clone Wars, the Naboo queen had installed a powerful ion pulse weapon which, if activated, would disable on electronics, including blasters and vehicles, outside the palace. It was quickly decided that this device was the rebels' best chance of stopping the invasion."}, {"tag": "p", "text": "However, the storms created by the climate disruption arrays had damaged Theed's power grid, preventing the weapon from charging. Rebel troops fought their way to the city's power stations, engaging in tense urban warfare against Imperial forces, which included AT-ST and AT-AT walkers. Despite this powerful opposition, rebel forces were able to successfully restore Theed's electrical power."}, {"tag": "p", "text": "At this point, the core of the Imperial forces, backed by an AT-AT walker, were overrunning the rebels, pushing them back along Theed's main boulevard. However, Organa and a group of rebel troopers managed to hold the entrance to the palace until Del Meeko managed to activate the ion pulse, disabling all Imperial weapons. Now defenseless, the surviving Imperial soldiers surrendered and were taken prisoner."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Alliance's victory in the battle secured the aid of the Royal House of Naboo. The defected Inferno Squad soldiers, Iden Versio and Meeko, initially reluctant to help the rebels, decided to join the Alliance in an effort to stop other worlds from suffering the same fate as Vardos. The victory at Naboo convinced them of the good they could do as part of the Alliance, Organa said that they had hope and hope was the reason they were going to win. And shortly after the battle, Inferno Squad was reformed as a New Republic Defense Force unit. With Commander Versio at the helm, the unit would go on to be a critical asset for the New Republic."}, {"tag": "p", "text": "After the battle, Soruna made a donation of chromium to the New Republic. In the following months after the Battle of Theed, the Empire launched three more invasions of Naboo. The Imperial Navy deployed three attack forces to wipe out the New Republic presence in the system, however, the attempts were foiled by Corona Squadron, an X-wing squadron of the New Republic Defense Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Theed was depicted in the 2015 Marvel comic book Shattered Empire 3, written by Greg Rucka. It was released on October 14, 2015. The battle was based around an Imperial remnant carrying out Emperor Sheev Palpatine's last orders of destroying different Imperial worlds using weather-altering satellites. It was again referenced in the fourth and final issue of the series, Shattered Empire 4. The battle also appears in Star Wars Battlefront II as a playable level in the campaign which was released on November 17, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}