{"url": "Battle_of_Thustra", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Sumitra sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Thustra"}, {"tag": "p", "text": "A battle took place on the planet Thustra during the early stages of the Clone Wars, between the armed forces of the Galactic Republic and the rebellious Sephi people. Through their ambition to follow the example of the Separatists, a faction of the Sephi increasingly lobbied for their homeworld to be declared an independent state from the Republic. The response from the ruling galactic power was the dispatch of a Jedi-led clone task force. But with Thustra under military occupation, the secessionist faction used the situation to incite more of the Sephi to supporting rebellion."}, {"tag": "p", "text": "The Sephi's discontent with Republic rule soon turned into hostility and open acts of defiance. Through a combination of guerrilla warfare and terrorist tactics, the subversives tried to weaken the Republic occupation force through attrition. Despite the fact that such aggression clearly constituted as acts of treason and war, the government on Coruscant hoped to find a resolution to the dilemma that resulted with Thustra's continued allegiance to the Galactic Republic. Yoda, the Grand Master of the Jedi Order and the leading member of its ruling body, personally undertook the assignment as an emissary of the Republic."}, {"tag": "p", "text": "Upon Yoda's arrival on Thustra, however, the Grand Army and its Jedi officers were in a desperate situation. Two Jedi Generals, Tyffix and Tyr, were murdered by a terrorist surprise attack. Their deaths left the young Commanders Cal and Pix in charge of the occupation. Yoda, with Cal at his side, departed for the capital city of Thustra in a final attempt to negotiate a cessation of hostilities between the Republic and the Sephi; Padawan Pix and Commander Clutch were ordered to remain behind in command of the occupation force."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Months after the First Battle of Geonosis, the Sephi government of the planet Thustra switched its allegiance to the Confederacy of Independent Systems, and thereby joined the rebellion against the Galactic Republic. In response to the Sephi's act of treason, the Grand Army of the Republic dispatched an armed force of clone troopers under the command of Jedi Generals Tyffix and Tyr. It was hoped that a significant display of military might and the threat of force would be sufficient at dissuading the Sephi from further acts of treachery. Instead, however, the Sephi attacked the Republic's military outpost on the day when the Jedi and their clone forces arrived."}, {"tag": "p", "text": "Republic forces were almost immediately overrun by the natives. Much of its defense grid had been destroyed, particularly in the southern perimeter. A suicide bomber crashed a Sephi flyer into the Republic command center, and thus killed Tyr and Tyffix. With both Generals dead, command of the Republic forces fell to their respective Padawans, Commander Pix and Commander Cal. As the situation deteriorated, Pix sent a distress call directly to Coruscant, the capital world of the Galactic Republic. The message was received in the Republic Executive Building where it was observed by Grand Master Yoda, Master Mace Windu, Master Oppo Rancisis and Supreme Chancellor Palpatine."}, {"tag": "p", "text": "Due to the fact that the Sephi rebellion was supported by Thustra's own ruler, King Alaric, Windu believed that appeasement was unwise; Thustra had to be subdued by the application of force, rather than just the mere threat of it. Palpatine was absolutely adamant that Thrusta could not be allowed to withdraw from the Republic as the cost would be too great. Given Alaric's influence within his own region, the Chancellor pointed out that the entire Sumitra sector was capable of seceding from the Republic if Thustra was allowed to do so. As an old friend of the King, Yoda hoped to convince Alaric to renew Thustra's loyalty to the Republic."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Shortly after arriving on Thustra, Yoda traveled to the Sephi capital city with only Cal accompanying him. Pix, who remained behind to command the Republic's armed forces, was under strict instructions to not move against the Sephi, so as to not undermine Yoda's negotiation attempt. Although Alaric was willing to speak with the Grand Master of the Jedi Order, neither of the two old friends were able to sway the other from their views. Alaric, who argued that the Republic was broken and corrupt, insinuated that the Republic could eventually betray the Jedi who defended it. However, Yoda remained resolute in his allegiance to the Republic, thus leaving the two at an impasse."}, {"tag": "p", "text": "After the King placed the Jedi under house arrest, Senator Navi of Thustra, a loyalist but corrupt politician, moved to manipulate the Republic into restoring order on Thustra through military force. First, he provided Cal with information that would enable the Jedi to escape from the palace. Navi then informed Pix that Yoda and Cal had been executed on King Alaric's orders. The young Jedi Commander was convinced by the Sephi Senator's deception and, as Navi predicted, retaliated with an all-out attack on the Sephi capital. In order to ensure a Republic victory, Navi provided Pix with the most recent Sephi troop movements, as well as information on Alaric's palace."}, {"tag": "p", "text": "At the same time, Moje, an aide to Senator Navi, discreetly circulated rumors of a Jedi plot to assassinate Alaric, and thus incited even greater anti-Republic sentiment amongst the Sephi. Commander Pix, along with Commander Clutch at her side, personally led the clone troopers into battle against the Sephi forces that stood between the Republic's army and the capital of Thustra. While Pix and Clutch commanded the ground forces during the firefight, the Republic launched an aerial bombardment on the Sephi, resulting in many enemy casualties, including Commander Dekluun."}, {"tag": "p", "text": "Meanwhile, Cal and Yoda were attacked by the King's palace guards, resulting in Cal's death. Yoda moved to confront his former friend alone, only to discover that Alaric decided to die as a martyr in order to further incite the Sephi to rebel against the Republic. Although his goal was achieved, Alaric, in his dying moments, begged Yoda to remember their friendship as it was in the past, rather than what it had become due to the Clone Wars."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "On Coruscant, Senator Navi attempted to use the situation on Thustra to his advantage in order to gain support from his fellow delegates in the Galactic Senate. However, he was caught by surprise when Yoda, Pix and Clutch entered the rotunda of the Senate Building where they revealed the Sephi politician's duplicity to the other senators. Navi was arrested and charged with treason, but the Republic's withdrawal from Thustra enabled the Sephi to secede from the Galactic Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}