{"url": "Tournament_on_Serenno/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Tournament on Serenno"}, {"tag": "p", "text": "A tournament on Serenno served as a test between the best bounty hunters in the galaxy to see who would earn the honor of kidnapping Supreme Chancellor Palpatine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the supposed death of Obi-Wan Kenobi, he disguised himself as Rako Hardeen, a marksman from Concord Dawn. He joined forces with Moralo Eval and Cad Bane and escaped the Republic Judiciary Central Detention Center and stole a ship that took them to Nal Hutta. There, the trio got new outfits and Kenobi, disguised as Hardeen, went to get a new ship while Bane and Eval got blasters. Bane attempted to leave Hardeen behind but due to Hardeen placing a tracking device on the ship, the ship was shot down, leaving the two other hunters to rely on Hardeen to get them off the planet. Hardeen bought a new ship and they flew to Orondia where they were attacked by Anakin Skywalker and Ahsoka Tano where a showdown started, leaving Anakin injured and the bounty hunters to get away."}, {"tag": "h3", "text": "The contestants"}, {"tag": "p", "text": "While picking out the team to assist Count Dooku and Moralo Eval in their plot to kidnap Chancellor Palpatine, they needed the best so they brought in twelve of the best bounty hunters in the whole galaxy. Although twelve of them came, only five would emerge from the Box alive."}, {"tag": "h2", "text": "The tournament"}, {"tag": "p", "text": "When arriving on Serenno, Bane, Eval, and Hardeen were welcomed by Count Dooku who asked Eval to ready the contestants for the challenge. Hardeen and Bane, along with ten other bounty hunters named Sixtat, Embo, Twazzi, Mantu, Jakoli, Kiera Swan, Onca, Bulduga, Derrown, and Sinrich were chosen to compete in the Box, a structure designed by Eval to test the hunters. The number of contestants was brought down to eleven due to Bane shooting Bulduga to take his hat. The hunters were deprived of their weapons and together, the eleven entered the Box."}, {"tag": "h3", "text": "The first task"}, {"tag": "p", "text": "On entering the box, the floor opened up allowing Dioxis, a poisonous gas, into the room. Hardeen warned everyone to get back and as the eleven were backing away, Sixtat tripped over a rising platform and got back onto it saying it was every man for himself. The platforms continued to rise higher towards the ceiling, nearly crushing Twazzi. Hardeen volunteered to go down and scout the area due to his helmet's ventilation being able to protect him for a little while. Hardeen found the hole into the floor and jumped down and found a tunnel that lead to the next room. He called for the others to follow and the other ten did so, allowing the first task to take no casualties."}, {"tag": "h3", "text": "The second task"}, {"tag": "p", "text": "The eleven hunters entered a second darkened room where Eval congratulated them for surviving the first task but said that the second test would take a few. Soon ledges in the wall started to swing out with lightsaber resembling swords sticking out. The hunters did their best to avoid them but Onca, the brother of the late Bulduga, was caught between several walls and came close to being stabbed through the head all though the sword stopped several inches in front of him. Another ledge however began to poke out with a sword at the end, killing Onca instantly. Hardeen noticed a pattern to the ledges and told everyone to follow him, however two more hunters were downed in the competition. Sinrich was strangled by Embo for stealing a bounty from him earlier that year and when Kiera Swan was about to jump onto a ledge she was stabbed through the back by a sword. The other eight hunters made their way out of the room and on to the next room, thanks to Hardeen."}, {"tag": "p", "text": "Count Dooku and Moralo Eval who were watching from Dooku's palace were amazed by Hardeen and Eval wanted to see what would happen when Hardeen wasn't the reason for the others survival."}, {"tag": "h3", "text": "The third task"}, {"tag": "p", "text": "The eight remaining hunters climbed into a room where ray shields were covering the walls. A button to deactivate the shields was on the other side of the shields and an electrolytic serum sample in a syringe that would allow the taker to pass through the shields was put in the middle of the room which would be fatal to all but one of the contestants. The hunters went to examine the room but soon platforms began to rise up and the hunters climbed onto them. The Rodian Jakoli turned to run for the platform but the ray shields covered the floor which electrocuted him. More platforms rose up to the button and Derrown was discovered to be the one who could take the serum. The Parwan took it and went to deactivate the shields as the platforms began to fall and the shields closed in. Mantu was hit in the shoulder by the shields and fell but managed to grab another platform to stay away from the shields. The platform Mantu was using for footing began to go down and he fell. Hardeen tried to grab him but Mantu hit the shield and was electrocuted. With the shields about to close in on the survivors, Derrown deactivated the shields and the last six proceeded to the next room."}, {"tag": "p", "text": "Dooku, becoming more impressed by Hardeen every task began to think about putting Hardeen in charge instead of Eval, much to Eval's anger."}, {"tag": "h3", "text": "The fourth task"}, {"tag": "p", "text": "The survivors, made up of Hardeen, Cad Bane, Twazzi, Embo, Sixtat, and Derrown made it to a room with a floor covered with flamethrowers and only the six standing on a platform above the fire. Eval came into the room to explain the next task was to test sniper skills. He let a target go around the room that had to be hit three times and gave the survivors a sniper which Sixtat took. Sixtat shot the target twice and missed the final shot and the platform collapsed under him, sending him falling to the flames. Hardeen took the sniper and fired at the targets, hitting each one. Eval raised a new platform higher up with Derrown, Embo, Cad Bane, and Twazzi on it and Hardeen's platform was turned into a single line and he was told to shoot five targets. Hardeen succeeded in hitting four but the gun ran out of power, much to Eval's happiness. Eval attempted to drop Hardeen to the flames but he was saved by Bane, who told Eval if he wanted to kill Hardeen he should do it like a man. Dooku agreed with this and dropped Eval onto the floor of the room and removed all of the flamethrowers except for the ones lining the room. Eval attempted to fight unfairly, calling in probe droids and bringing up a maze in the floor and attempting to burn Hardeen. Hardeen escaped and got the upper hand in the fight. Dooku told Hardeen to finish Eval but Hardeen spared him. Dooku was disappointed in Hardeen, but still congratulated the hunters for surviving the box, and decided to put Cad Bane in charge and along with Bane and Hardeen, Embo, Derrown, and Twazzi became the team to kidnap Palpatine."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The true purpose behind the challenge was not to assemble an elite team of bounty hunters. In actuality, it was a diversion from Dooku's real plan to kidnap Palpatine. Dooku suspected that the Jedi would attempt to infiltrate his conspiracy, and the challenge was a means of exposing any Jedi spies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}