{"url": "Battle_of_Thyferra", "categories": ["Category:Legends articles", "Category:Battles of the Bacta War", "Category:Battles of Thyferra", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Thyferra"}, {"tag": "p", "text": "The Battle of Thyferra marked the end of the Bacta War between Rogue Squadron and the Thyferran government, which was backed by Ysanne Isard."}, {"tag": "p", "text": "Having collectively resigned their commissions in the New Republic Defense Force, Rogue Squadron waged a campaign for several months to undermine Isard's rule, remove her monopoly on bacta, and free the prisoners held on Isard's flagship, the Lusankya. The campaign ended with the Battle, which achieved all of the objectives except the last, and Isard, unknown to Rogue Squadron, escaped."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Although Rogue Squadron's hit-and-fade tactics had been highly effective against Isard's bacta convoys and processing stations, Wedge Antilles and Tycho Celchu knew that sooner or later they would have to directly confront Isard's superior forces. To that end, their objectives were to augment their own forces as much as possible, while reducing Isard's."}, {"tag": "p", "text": "Both objectives were furthered during the Second ambush in the Graveyard, when the sudden appearance of the Thranta-class War Cruiser Valiant allowed Rogue Squadron to destroy the Victory II-class Star Destroyer Corrupter (thus killing Isard's most aggressive commander, Ait Convarion), and add the Valiant to its forces. Prior to the battle itself, Antilles recruited a large fleet of smuggler freighters to participate in the final campaign, and bribed Captain Sair Yonka to desert Isard and bring his ship, the Imperial II-class Star Destroyer Avarice with him."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Phase One: Yag'Dhul"}, {"tag": "p", "text": "Having exposed Talon Karrde's employee, Melina Carniss, as a spy for Isard, Rogue Squadron allowed her to inform Isard of the location of Rogue Squadron's base of operations at Yag'Dhul. Isard immediately dispatched the Lusankya and the Virulence to destroy the space station."}, {"tag": "p", "text": "Just as the Lusankya arrived, Rogue Squadron entered hyperspace at the edge of the system, bound for Thyferra. Lusankya's commander, Captain Joak Drysso, deployed his fighters and prepared to destroy the station. Booster Terrik, in command of the station, trapped the Lusankya using a gravity well projector and the station's heavy-lift tractor beams. He then locked over three hundred proton torpedo targeting systems onto the ship. In reality, the actual launch systems had been mounted on the freighters, but the bluff was enough to give Drysso pause. At that moment, the Virulence wedged itself between the Lusankya and the station, breaking the target locks. Drysso ordered the ship to immediately retreat back to Thyferra, leaving its fighters behind."}, {"tag": "p", "text": "Unplanned by either Booster or Wedge, Pash Cracken's Ace Squadron then arrived, completing the illusion that the New Republic had set a trap. The Virulence's captain, Lakwii Varrscha, immediately surrendered. In one stroke, the Rogue forces had deprived the Lusankya of its fighter complement, and Isard of her last remaining Imperial II-class Star Destroyer."}, {"tag": "h3", "text": "Phase Two: Thyferra (Space)"}, {"tag": "p", "text": "Rogue Squadron rendezvoused with its allied freighters, which then jumped to Thyferra. The squadron's X-wings had just begun to engage the interceptors of the Thyferran Home Defense Corps, led by Erisi Dlarit, when the Lusankya arrived back. The battle was complicated by the arrival of the Valiant and the Avarice (re-named the Freedom). The two capital ships engaged the Lusankya, while the Rogues unleashed massive salvos of proton torpedoes and concussion missiles, using the freighters as launch platforms slaved to the starfighters' telemetry. The Lusankya's bow shields were overwhelmed. The Lusankya shifted its fire to the freighters, hoping to take them out of the fight."}, {"tag": "h3", "text": "Phase Three: Thyferra (Ground Assault)"}, {"tag": "p", "text": "At the same moment as the Rogue forces arrived, Elscol Loro and Iella Wessiri led a force of Ashern and Zaltin rebels in an assault on Isard's palace. When they managed to penetrate the defenses, Isard escaped in Fliry Vorru's personal shuttle Thyfonian (or so it appeared). Vorru was left behind and captured, to be returned to Kessel."}, {"tag": "h3", "text": "Phase Four: Thyferra (Space)"}, {"tag": "p", "text": "It was at this time that Isard commanded the Lusankya to cover the escape of the Thyfonian, before both were lost in the battle. By this time, Rogue Squadron and the freighters had run out of missiles, and the Freedom was badly damaged. Captain Drysso disobeyed Isard's order to flee, believing he would win the battle and take her place on Thyferra. When the Virulence reappeared, he thought that he finally had the reinforcements he needed to win the battle."}, {"tag": "p", "text": "However, the Virulence was now under the command of Booster, and it contained three New Republic A-wing interceptor squadrons, including Ace Squadron. The assault on the Lusankya was redoubled, and fighters began taking out whole sections of the ship with their strafing runs. Drysso threatened to ram the ship into Thyferra, but he was executed by Lieutenant Waroen, who then surrendered the ship and her crew to Rogue Squadron."}, {"tag": "p", "text": "Outbound from Thyferra, Isard also ordered Erisi's TIE squadron to cover her exit. Corran Horn engaged Erisi one-on-one, and shot her down over one of Thyferra's moons. He then engaged Isard's shuttle, and, with Tycho's help, managed to destroy it before it entered hyperspace. This ended the battle."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Rogue Squadron was disappointed to find that the prisoners on board Lusankya, including General Jan Dodonna, had been evacuated to another location before the battle. It would be several years before they were finally found and liberated."}, {"tag": "p", "text": "In recognition of his contribution to Isard's downfall, Ooryl Qrygg was made janwuine, an honor in Gand culture which allowed him to refer to himself in the first person."}, {"tag": "p", "text": "Rogue Squadron was invited to rejoin the New Republic military."}, {"tag": "p", "text": "Through negotiations mediated by Talon Karrde, the New Republic reluctantly allowed Booster to keep ownership of the Virulence. The ship was renamed the Errant Venture."}, {"tag": "p", "text": "As temporary captain of the Lusankya, Wedge performed an impromptu marriage of Corran Horn and Mirax Terrik."}, {"tag": "p", "text": "Xucphra Corporation was disbanded, and Zaltin Corporation became the dominant Human faction on Thyferra."}, {"tag": "p", "text": "Isard was believed dead. It was not until after the Thrawn campaign that she re-appeared, revealing that she had not been on the shuttle, which was remotely controlled, and had survived the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}