{"url": "Trace_Martez", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Coruscanti", "Category:Females", "Category:Humans", "Category:Mechanics", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Trace Martez"}, {"tag": "p", "text": "Trace Martez was a human female pilot and mechanic who, along with her older sister Rafa, lived on Level 1313 on the planet Coruscant during the waning days of the Galactic Republic. During the Clone Wars, Trace met the former Jedi Padawan Ahsoka Tano when Tano, having difficulties with a broken-down Joben T-85 speeder bike she had purchased, crash-landed on the platform of Trace's repair shop."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Early in the Clone Wars, Trace lived with her sister, Rafa, along with their mother and father on the other side of the Level 1313 underworld portal. While in the underworld, the two sisters heard stories about the Jedi and grew to admire them."}, {"tag": "p", "text": "During the early stages of the Clone Wars, Cad Bane and his group of fellow bounty hunters managed to successfully free Ziro the Hutt from his imprisonment within the Republic Judiciary Central Detention Center. This culminated in the group being chase into the Coruscant underworld by the Jedi where Bane and his group jumped between oncoming speeders, which drew the attention of crowds of people, including the Martez family. Eventually, Bane shot the engine of a transport ship, sending it spiraling out of control and towards a populated landing platform. The Jedi managed to steer it away from the heavily populated area, but instead sent it crashing into the side of the same Underworld portal where the Martez family lived. Seeing the oncoming danger, Trace and Rafa's parents rushed to evacuate them from their home; however, before their parents could escape along with them, the transport crashed into the portal wall, killing both of the Martez sisters' parents."}, {"tag": "p", "text": "In the aftermath of Ziro's escape, the Jedi came back to inspect the collateral damage that had been caused by the transport's crash. A green-skinned Jedi soon came over to the grieving sisters and simply told them that she needed to make a choice, but that they shouldn't worry as the Force would be with them before departing. This left Trace and Rafa embittered against the Jedi Order both for their role in the death of their parents and their attempt to comfort the sisters."}, {"tag": "p", "text": "Orphaned, the two sisters began to dream of leaving Coruscant to \"escape from the war.\" In order to accomplish this goal, Trace attempted to earn as much money as she could by working as a mechanic within the repair shop she had inherited from her parents and began slowly piecing together a Nebula-class freighter that she named the Silver Angel. On the other hand, Rafa won a laundromat gambling to use as a front for her shady business dealings such as being lent money from the shady moneylender named Pintu Son-El."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Trace was a human female with tan skin, brown eyes, and had curly brown hair with both sides of her head shaved."}, {"tag": "p", "text": "Trace was very friendly, as she was willing to help Ahsoka Tano fix her speeder bike for free, despite having said earlier that she would like to be paid if she fixed the bike. Trace also had a sense of morality and responsibility as she was bothered by Rafa making shady dealings with criminals, though Trace knew that her sister was only doing it so the two of them could survive. Unlike Rafa, Trace was very trustworthy to individuals whom she befriended, such as Ahsoka. When Trace found out Ahsoka lied to her about being a former Padawan, Trace was hurt and angry, but quickly forgave Ahsoka and still regarded her a friend."}, {"tag": "p", "text": "Trace could also be naïve and impulsive. On a mission to deliver spice to the Pyke Syndicate, she heard that the Pykes might damage her beloved ship, the Silver Angel. So, she decided to dump the spice instead of losing her ship. As a result, this put her, Rafa, and Ahsoka at risk of breaking their deal with the criminals, a consequence she had not considered before dumping their shipment."}, {"tag": "p", "text": "Trace once admired the Jedi Order, but after they accidentally caused the death of her parents and did very little to comfort or help her and her sister afterwards, Trace became resentful of the Jedi. However, Trace did not completely hate the Jedi and viewed Tano as an archetype of how true Jedi should act. She had a hard time comprehending why someone would leave the Order."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Trace had limited skills in piloting for she only had experience with speeders and maintenance vehicles. As a result, Trace was not prepared to successfully pilot her ship, the Silver Angel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trace Martez first appeared in the Star Wars: The Clone Wars episode \"Gone with a Trace.\" She is voiced by Brigitte Kali. Among the design options for Trace, artist JP Balmet presented to Dave Filoni a design which ultimately became that of Trace's sister Rafa."}, {"tag": "p", "text": "While the episode story arc that ultimately featured the Martez sisters was in development in 2012 before The Clone Wars was cancelled, Trace and Rafa didn't exist. Instead, Ahsoka would have met a young mechanic named Nyx Okami, who filled the Martez sisters' role as the one who owed money to Pintu Son-El."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}