{"url": "Tracked_Mobile_Base", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic vehicles", "Category:Crawlers", "Category:Galactic Empire vehicles", "Category:Shielded ground vehicles"], "nodes": [{"tag": "h1", "text": "Tracked Mobile Base"}, {"tag": "p", "text": "The Tracked Mobile Base (TR-MB) was a heavily armored Imperial prototype vehicle that could carry a commander and six stormtroopers into battle, and function as a mobile command center."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The TR-MB was an extension of the project that created the Battlefield Holographic Control Interface. The BHCI was an advanced command-and-control interface that provided a commander with a full, interactive view of the battlefield from the security of an orbiting starship."}, {"tag": "p", "text": "The TR-MB, introduced in 3 ABY, was a prototype ground unit that placed a BHCI in a mobile ground unit, closer to the battlefield. General Brenn Tantor, the foremost user of BHCI technology, made use of it during his final battle on Abridon when he destroyed a Rebel base and foiled Beri Tulon's attempt to defect. However, when ordered to destroy a refugee camp by Grand General Malcor Brashin, the supervisor of the BHCI project, Tantor refused. Brashin sent Tantor to Kalaan, where he was imprisoned. The TR-MB traveled with him."}, {"tag": "p", "text": "With aid from several stormtroopers who had long served under him, Tantor escaped and defected to the Rebellion, taking the TR-MB with him. The Rebels modified it, adding a set of shields to the vehicle for extra protection. Tantor used the TR-MB as a mobile command post when rescuing Tulon from Tarkin Detention Facility on Ruul and his subsequent capture of the computer facility on Sounder Flats."}, {"tag": "p", "text": "By that time, Rebel technicians had managed to reverse-engineer a BHCI unit for Tantor's use from orbit, which he preferred. Nevertheless, the TR-MB was later used when Tantor seized the shipyards of Sayan and destroyed the Imperial presence in the Abridon city."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}