{"url": "Toydaria", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Galactic Republic planets", "Category:Rocky planets", "Category:Swamp planets", "Category:Toydaria locations", "Category:Toydaria system planets"], "nodes": [{"tag": "h1", "text": "Toydaria"}, {"tag": "p", "text": "Toydaria was the homeworld of the Toydarian species, located in Hutt Space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A planet of the Toydaria system located in Hutt Space of the Mid Rim, Toydaria was a temperate world of forests and swamps, with mats of algae covering large portions of the planet's surface. The atmosphere was typically foggy, and carried a greenish hue. N'Omis flowers grew on the planet."}, {"tag": "p", "text": "Toydaria was the homeworld of the Toydarians, who created muck nests and lived in the atmosphere of muck lakes. Members of the species lived in clans, where a clan bell would signify a noble family, and during the last decades of the Galactic Republic and Galactic Empire, Toydaria was governed by a feudal monarchy, the Toydarian kingdom, and was dominated by the Toydarian royalty. It exported consumables and labor, while importing other consumables and technology. Some Toydarian cities on the surface of Toydaria were large enough to be visible from space. Monsoons also large enough to be visible from space could form on the world."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ryloth campaign"}, {"tag": "p", "text": "In the last decades of the Galactic Republic, the neutral Mid Rim planet of Toydaria was governed by a monarchy. During the Clone Wars, a galactic war between the Republic and the Confederacy of Independent Systems, King Katuunko of Toydaria, who was the current monarch, refused to support either factions, therefore making his planet strategically interested by the two warring governments. However, after a diplomatic mission conducted by both Senator Bail Organa and Junior Representative Jar Jar Binks and opposed by Senator Lott Dod of the Trade Federation, which involved the Republic using Toydarian soil as a staging area to send relief supplies to the war-torn Twi'leks of Ryloth with permission from the Toydarian king, Katuunko decided to support the Republic."}, {"tag": "h3", "text": "Death of King Katuunko"}, {"tag": "p", "text": "Later on in the war, Separatist leader Count Dooku ordered his new assassin Savage Opress to capture King Katuunko alive, otherwise he would be severely punished. However, the mission went downhill after Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker intercepted Opress on Toydaria, resulting in him killing Katuunko out of rage, angering Dooku in the process and being severely punished with Force lightning."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Toydaria first appeared in \"Supply Lines\", an episode of Star Wars: The Clone Wars that first aired on September 24, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}