{"url": "Toydaria/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Swamp planets", "Category:Toydaria locations", "Category:Toydaria system planets"], "nodes": [{"tag": "h1", "text": "Toydaria"}, {"tag": "p", "text": "Toydaria was a large, muddy planet located in the Toydaria system of Hutt Space, and home to the mind trick-resistant Toydarians."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Toydarian homeworld was covered with nutrient-rich muck-lakes, which supported clouds of bugs and mats of algae and a number of predators including dangerous grabworms. Monsoons and fungal diseases ravage the planet, and can often kill off growing stocks of agriculture. Sustenance for the food on Toydaria was so great that on average every 30 standard years depending on weather cycles, shortages would occur and the Toydarians would steal or even poison their neighbor's food supply, under the belief that if they couldn't have it, no one should."}, {"tag": "p", "text": "Toydarians considered other planets as bland and odorless."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Toydarians evolved as omnivorous, eating from succulent algae to fish, and survived by flying virtually everywhere, only landing on the relative safety of algae mats. Toydarians originally lived off the nutrients but later resorted to farming for food."}, {"tag": "p", "text": "Toydaria had been a vassal planet of Nal Hutta and trades with other worlds of Hutt Space. Toydarian spas were visited by the Hutts who also hunted grabworms for sport (but otherwise were annoyed by the stinging insects)."}, {"tag": "p", "text": "Because there were so many Toydarians flying around on their home world, the use of speeders was illegal. Only a few craft were allowed to fly in the planet's atmosphere, like Hutt caravels; traffic was only allowed to land or take off in specified areas to avoid collisions. To help travel around their world, Toydarians created a light-rail system that took them from city to city. Very little galactic-level technology was incorporated on Toydaria because most Toydarians preferred to live in below galactic-standard villages."}, {"tag": "p", "text": "Toydaria was neutral during the galaxy-wide Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Around this time, Toydaria was ruled by King Katuunko, who, despite his neutrality, entered into an agreement with the Galactic Republic to allow them to use Toydaria as a base to deliver supplies to the besieged Twi'leks of Ryloth during the Battle of Ryloth, following a visit by Senator Bail Prestor Organa and Representative Jar Jar Binks, and then to build a base on his territory, following Jedi Grand Master Yoda's mission on the coral moon of Rugosa. Later during the war, around 21 BBY, Katuunko was sought out by Count Dooku, who wanted to force the Toydarian monarch to join the Confederacy through the use of his new apprentice, Savage Opress. However, Opress accidentally killed the king following an engagement with Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "During their invasion of the galaxy, the Yuuzhan Vong landed on Toydaria as part of their advance into Hutt Space. However, they encountered heavy resistance from the Toydarians, who had gained assistance from smugglers and the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Toydaria received its first in-universe appearance in \"Supply Lines\", the third episode of the third season of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}