{"url": "Tracene_Kane", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:HoloNet News personnel", "Category:Humans", "Category:Journalists"], "nodes": [{"tag": "h1", "text": "Tracene Kane"}, {"tag": "p", "text": "Tracene Kane was a female human who worked as a journalist on Chandrila during the Galactic Civil War. She was close friends with her cameraman, a Trandoshan named Lug, who perished during a battle at Binjai-Tin on the planet Nag Ubdur in 5 ABY. Tracene and her new Sullustan colleague Birt later recorded Chancellor Mon Mothma's press statement regarding the discovery of Imperial forces on Jakku prior to the Battle of Jakku."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Dawn of the New Republic"}, {"tag": "p", "text": "Tracene Kane was a female human journalist who lived during the Age of the Empire and the rise of the New Republic. Following the Battle of Endor, Kane joined the Queen of the Core Network, a HoloNet news network that had emerged with the rise of the New Republic. She and her colleague, the Trandoshan cameraman Lug, interviewed Olia Choko, the public relations representative for Chancellor Mon Mothma and the new Galactic Senate, which was then based on Chandrila's Hanna City."}, {"tag": "p", "text": "Prior to the interview, Kane assured Olia that she would trend well because she was pretty and an alien. Choko then got Kane and Lug to position their camera behind Hanna City's cityscape and the stormtrooper helmet exhibit in the city circle. After Lug had positioned the camera, Kane commenced the new story with the announcement that this was the first day of the Queen of the Core Network. During the interview, Choko was struck in the face by a Xan man named Geeska Dotalo, who expressed frustration at the chaos, crime and famine caused by the fighting between the New Republic and the Galactic Empire on his homeworld of Gan Moradir."}, {"tag": "p", "text": "When Kane told Lug to cut the filming, Choko told them to continue shooting the altercation. After listening to Dotalo's plight, Kane offered him a position as Gan Moradir's representative in the Galactic Senate and fetched another New Republic official to attend to Dotalo's needs. Kane and Lug continued filming as Choko confronted the New Republic Corporal Camerand Argell and chastised him for parading Imperial prisoners of war. She forced Agrell and his commanding officer, Commander Rohr, to end the humiliating parade."}, {"tag": "p", "text": "Kane commended Choko for her work and then proceeded to ask whether the protestor, the orphans, and the parade of prisoners were danger signs for the nascent New Republic. Choko responded that the New Republic was a democracy and that they would try to get things right. Unlike the Empire which valued order over everything else, Choko reiterated that the New Republic was committed to the greater good. Choko then joined a procession of New Republic senators marching towards the old Chandrila Senate house. After Choko bid Kane farewell, Kane jokingly told Choko to \"knock 'em dead.\""}, {"tag": "h3", "text": "War correspondent"}, {"tag": "p", "text": "Tracene Kane and Lug were later embedded with the New Republic Thirty-First, which was involved in the fighting at the city of Binjai-Tin on the planet Nag Ubdur in 5 ABY. Kane covered a mouth with a white cloth due to the stench of rotting bodies. Lug, whose species were accomplished hunters and warriors, was unperturbed by the carnage. The two worked with a cam droid to film a collapsed wall. When Kane asked Lug to look for someone to interview, the Trandoshan recommended Commander Norwich but Kane suggested a common soldier."}, {"tag": "p", "text": "When Kane asked Lug about her hair and said that she was going for a battle-frizzled look, he reassured her that it was fine. About ten klicks away lay Imperial forces. Lug soon returned with a young Kupohan New Republic soldier named Private Rorith Khadur. Khadur recounted the fighting at Govneh Ridge and described how he and his men had discovered that Imperial forces had massacred the population of the Ubdurian city of Binjai-Tin. Kane watch Lug comfort the soldier and give him a zlagfiend tooth as a token."}, {"tag": "p", "text": "Kane and Lug then proceeded to upload their story on a nearby guild tower. However, the embattled Imperial forces launched a TIE fighter suicide attack on the New Republic positions. Khadur lost one of his arms during the fighting while Lug was crushed to death by a stricken TIE fighter. Kane was distraught by the death of her friend and gave a broadcast in his honor."}, {"tag": "h3", "text": "Prelude to Jakku"}, {"tag": "p", "text": "After Temmin Wexley and Sinjir Rath Velus reported that the Empire had relocated to the Inner Rim world of Jakku, Tracene Kane and the Sullustan cam-operator Birt met for an exclusive interview with Chancellor Mothma. Before Mon Mothma issued her press statement, she took the time to chat with Miss Kane. When Kane told the Chancellor that she had been out in the field covering the war, Mothma asked why she had returned to cover politics. Kane replied that she could not look at war any longer. Mon agreed and remarked that war could seem like a present dream after looking too long into the abyssal eye of the political machine."}, {"tag": "p", "text": "While Birt operated the hovering cam, Tracene listened as Mothma read her prepared statement. Mothma announced that she had yesterday learnt about the possibility that the Empire had retreated to Jakku. She also announced that the New Republic Defense Force had sent a scout ship Oculus under the command of Ensign Ardin Deltura and probe droids to investigate the Imperial presence. Mothma also mentioned that she was aware of the information leakage. The Chancellor then ended her speech by announcing that she had convened an emergency session of the Galactic Senate to mobilize the New Republic military."}, {"tag": "p", "text": "Following Mothma's press statement, Tracene assured the Chancellor that she did fine. She also denied that Mothma sounded apprehensive. When Kane asked whether it was hard to be under siege from every direction, Mothma responded that the New Republic would persevere like the Rebel Alliance before them."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tracene Kane was a tall, thin human woman with long dark hair coiffed up like a wave. She wore a necklace around her neck that resembled a flock of birds chained together. She had a broad, practiced smile. Kane had a good sense of humor and respected Olia Choko, for her selfless service to the New Republic and the greater good. Kane took good care of her hair and at one point wanted to give it a \"battle-frizzled look.\" She was a close friend of the Trandoshan cam-operator Lug and was visibly distraught when he died while covering a battle on Nag Ubdur. Tracene was so troubled by her wartime experience that she returned to covering political news under HoloNet News. She encouraged Chancellor Mothma during one of the Chancellor's most challenging hours."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tracene Kane was a minor point-of-view character who first appeared in Chuck Wendig's 2015 novel Aftermath and its 2016 sequel Aftermath: Life Debt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}