{"url": "Trade_Federation_Dropship", "categories": ["Category:Legends articles", "Category:Dropship classes", "Category:Trade Federation vehicles"], "nodes": [{"tag": "h1", "text": "Trade Federation Dropship"}, {"tag": "p", "text": "The Trade Federation Dropship was a dropship used by the Trade Federation during the later years of the Galactic Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Trade Federation Dropship was a long craft, about the length of a Trade Federation Superfreighter. The Dropship was equipped with deflector shields but lacked armament."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Dropships were used by the Trade Federation to deliver its forces to battlefields. Dropships were used individually, in groups, or alongside larger C-9979 landing craft. Dropships could deploy tanks, infantry, or a combination of both. A common tactic used against Dropships was to destroy them before they could deploy any forces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Trade Federation Dropships were sent to Lok in 32 BBY to ensure the retrieval of pirated cargo and later as part of the assault of the pirates' base. During that same year, the Trade Federation utilized these ships several times during their occupation of the planet Naboo against forces resistant to the occupation. Several Dropships were aboard the Droid Control Ship Vuutun Palaa when it was destroyed in the Naboo Space Battle."}, {"tag": "p", "text": "Ten years later, in 22 BBY, a large number of Dropships were deployed to protect a trihexalon factory during the Battle of Nod Kartha. Not long after, three Dropships were refueling at Lok when the pirate Nym came to reclaim his base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dropship is very similar in appearance to a concept drawing of what would become the C-9979 found in The Art of Star Wars Episode I: The Phantom Menace, where it is deploying early concept versions of the Multi-Troop Transport."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}