{"url": "Trade_Federation", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems-aligned governments", "Category:Confederacy of Independent Systems organizations", "Category:Conglomerates", "Category:Galactic Empire-aligned governments", "Category:Galactic Republic-aligned governments", "Category:Imperial organizations", "Category:Trade Federation"], "nodes": [{"tag": "h1", "text": "Trade Federation"}, {"tag": "p", "text": "The Trade Federation was an interstellar shipping and trade conglomerate during the waning years of the Galactic Republic, one so powerful that it had its own representatives in the Galactic Senate. Viceroy Nute Gunray secretly allied with the Sith Lord Darth Sidious to invade the peaceful planet of Naboo and cause a crisis in the Republic government, although his occupation was thwarted by Queen Padmé Amidala and her forces. Escaping imprisonment, Gunray pledged his droid forces to the Confederacy of Independent Systems, and the Federation fought Republic and Jedi armies throughout the Clone Wars. Gunray and his fellow Separatist Council members were betrayed by Sidious, who had them killed by Darth Vader at the end of the war, and the Trade Federation was nationalized by the newly-formed Galactic Empire."}, {"tag": "p", "text": "The Federation would often force planets into exclusive contracts, which in several circumstances gave them the ability to blockade planets and control system politics."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early Foundations"}, {"tag": "p", "text": "The origins of the Trade Federation could be traced back to the Galactic Republic's efforts to encourage economic development in its outlying star systems. By creating Free Trade Zones around those systems, the government effectively helped increase the flow of travelers and merchandise. However, that newfound prosperity also attracted pirates and plunderers of all kinds who preyed on the trade caravans. At the time, the Outer Rim Territories of the galaxy were a mostly lawless frontier, outside of the general jurisdiction of the Republic. Consequently, a number of major commercial, financial, manufacturing, and shipping companies united to ensure their own protection. Together, they formed the Trade Federation, a new organization meant to combat pirates, arbitrate disputes between its internal factions, and present a united front to promote mercantile interests before the Republic's bureaucracy."}, {"tag": "p", "text": "Over time, the Trade Federation grew in size, prestige, and power, amassing a large fleet of battleships  and earning representation in the Galactic Senate of the Republic. Eventually, it came to a point where the Federation laid down its own law on and around the trade routes, exerting undue influence over neighboring systems and extorting enormous \"protection\" fees. In effect, the Free Trade Zones became free only for the mega-corporations affiliated with the Trade Federation, while independent traders were forced to pay heavy tolls and follow oppressive regulations."}, {"tag": "p", "text": "The power struggle between the Republic and the Federation raged on for decades. In the year 33 BBY, it was decided to hold a summit on the Outer Rim planet Eriadu to try and put an end to the dispute. However, the Eriadu Conference, as it came to be known, turned into a fiasco when the radical political group known as the Nebula Front appeared. Although the Front failed to assassinate Finis Valorum, then Supreme Chancellor of the Galactic Republic, they did manage to kill the Trade Federation's directorate, including several key Kuati executives. As a result, the Neimoidians jumped into the power vacuum, anointing one of their own, Nute Gunray, the new Viceroy of the Trade Federation."}, {"tag": "p", "text": "Under the leadership of the Neimoidians, who were known for their business skills and cutthroat dealings, the Federation became one of the wealthiest corporate organizations in the galaxy, and came to control a large portion of interstellar shipping passing through the Outer Rim Territories. It was given representation in the Galactic Senate of the Republic, and used its influential seat to lobby for greater power. Its ultimate goal was to control all galactic trade routes, ports, and freighters, and was willing to do anything to increase profits and avoid Republic taxes. The Federation maintained exploratory craft during the last decades of the Republic; Everi Chalis's mother attempted to sell her six-year-old daughter to the captain of one such craft, though the captain refused as Everi was too small, but gave her a packet of nectrose crystals instead. Baktoid Armor Workshop approached Poggle the Lesser of the Geonosians to design droid foundries on behalf of the Trade Federation. The company also maintained droid manufacturing facilities on worlds including Akiva."}, {"tag": "p", "text": "The Federation was keen to protect its profit margins; after the agricultural scientist Leo Leonis and his wife Tepha created genetically modified crops for the planet Chrona, the company let their inventions rot in warehouses for the benefit of its own profits. Within a year new crops were distributed, and the Republic settled the court case in the Federation's favor, despite testimony from Leonis himself."}, {"tag": "p", "text": "As of 34 BBY, the Trade Federation was a monolithic organization expanding its reach into the Outer Rim by utilizing loopholes in the Republic's Free Trade Zone legislation, and continued to increase its sway in the Senate. Galactic industrial conglomerates such as the Federation were responsible for an economic upswing for senators, lobbyists, and entrepreneurs on Coruscant who placed themselves in the service of such groups. Determined to monopolize the Free Trade Zones, the Federation caught the attention of several lommite mining concerns in the Seswenna sector, and embroiled itself with the troubled King Veruna of Naboo."}, {"tag": "h3", "text": "Association with the Sith"}, {"tag": "p", "text": "Prior to the Invasion of Naboo, the Federation came into contact with the Sith Lord Darth Sidious, who had a vested interest in the organization's projects and operations for his future plans. In fact, Gunray's rise to power had been puppeteered by Sidious. The Sith promised the Federation power and money in return for accepting his orders, so the corporation secretly allied with Sidious. Using its manufacturing might, the Federation began construction of its own droid army after enduring pirate attacks. By manipulating the wording of the legislative response to those attacks, they created a massive army in secret after Sidious ordered them to make such a force."}, {"tag": "p", "text": "After allying with Sidious, the Federation attempted to establish mining facilities in the Kellux system, beyond the sanctions of the Republic, but their droid defenses were waylaid by a pirate faction which utilized electrostatic field generators to render the droids inoperable. Sidious sent his Sith apprentice, Darth Maul, to assist the stranded Federation allies, and the Zabrak arrived in time to destroy a squadron of orb-wings and board the captured Federation battleship over Kellux. He fought and killed the pirates, and cut down the surviving Neimoidians to prevent word from returning to Sidious."}, {"tag": "p", "text": "In response to Prop 31-814D, a Senate law which enabled taxation of the Free Trade Zones, and while following the orders of the manipulative Sith Lord Darth Sidious, the Trade Federation fleet blockaded and invaded Naboo with its droid army. The invasion served as a pretext for Naboo's Senator, Sheev Palpatine—secretly the public guise of Sidious himself—to be elected Supreme Chancellor. During this period of time, the Trade Federation was headed by Viceroy Nute Gunray, who oversaw the invasion and installed himself in the Theed Royal Palace until Queen Padmé Amidala ended his occupation."}, {"tag": "p", "text": "Viceroy Gunray was arrested by Republic officials and sent to answer for his crimes, although he evaded imprisonment after multiple trials and retained his position as head of the Federation. Nevertheless, it was the Federation and political leadership of Valorum that took most of the blame for the so-called \"debacle at Naboo.\" Some members of the Federation demanded the disbandment of its army of battle droids following the failed invasion, as an attempt to placate an angry Republic. This was decided against, however, and the Federation instead retreated away from Neimoidia and towards their Purse Worlds so they could continue their plans away from prying eyes. The Federation's monopoly on Outer Rim shipping was broken due to the events of the Naboo invasion, and groups such as Eriadu Mining and Shipping prospered while the Separatist Crisis grew. The factories on Geonosis designed on behalf of the Federation still secretly operated under the surface, mass-producing battle droids to increase the Federation's armed forces, after Count Dooku negotiated for the deal to continue."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "A decade after the war on Naboo, the Trade Federation pledged support to the Confederacy of Independent Systems, becoming a major military benefactor during the Clone Wars. Publicly, however, the Federation denied all links to the Confederacy of Independent Systems, while maintaining a seat in the Republic Senate and officially taking a neutral stance in the conflict. Publicly, the Trade Federation also distanced itself from Nute Gunray, calling him \"an extremist\" and stating that his views did not represent the Federation's positions; however, this was merely a sham and Gunray was still secretly the head of the Federation. During the Clone Wars, the Trade Federation was often used by the Confederacy and the Sith as a puppet to drive more systems to their causes, though this was staunchly denied."}, {"tag": "p", "text": "When the Battle of Ryloth occurred, the Republic dispatched Senator Bail Organa and Representative Jar Jar Binks to request use of the planet Toydaria as a staging ground. Upon intercepting the transmission Count Dooku contacted Lott Dod of the Trade Federation to join the negotiations. During the negotiations, Dod stressed that Toydarian involvement with Republic supplies would jeopardize their neutrality, allegedly putting the Trade Federation at risk of attack by Separatist warships."}, {"tag": "p", "text": "While the Federation was neutral, Gunray's position on the Separatist Council gave the CIS access to use of Federation fleets. After Cad Bane had stolen a holocron, Gunray loaned the Federation fleet to assist him in killing Bolla Ropal and escaping the Republic. In the end the Federation fleet was destroyed, to Gunray's dismay."}, {"tag": "p", "text": "The Federation was an investor in a developing Geonosian droid foundry, which would produce new battle droids for the Separatist. The Federation had equity alongside in the factory, alongside the InterGalactic Banking Clan who helped finance the factory with collateral of Federation holdings (if not also to finance other war projects)."}, {"tag": "p", "text": "The Trade Federation blockaded the moon Pantora, claiming they were trying to suspend all trade after Pantora had not paid its debts. In actuality, the Federation was working alongside the Separatist Alliance to force the planet into the CIS. Federation officer, Sib Canay arranged for one of Chairman Papanoida's children to be held aboard his ship. Trade Federation involvement was uncovered by Ahsoka Tano and Senator Riyo Chuchi. Immediately following this, Dod issued a statement to the Senate that Sib Canay had arranged the kidnapping in his own accord, due to the Separatist ideology of Nute Gunray-reaffirming the neutrality of the Federation and attempting to distance themselves from endorsement of CIS idealism."}, {"tag": "p", "text": "One member of the Mandalorian Ruling Council was somehow affiliated with the Trade Federation. During a planetary supply crisis, Prime Minister Almec strongly refuted not relying on mega corporations like the Federation or Corporate Alliance."}, {"tag": "h3", "text": "Nationalization and legacy"}, {"tag": "p", "text": "Sidious betrayed the Federation leaders by having them killed by Darth Vader at the end of the war on the volcanic world of Mustafar following the Outer Rim Sieges, and the corporation was nationalized by the newly formed Galactic Empire, while its accounts were plundered by Imperial financier and former Federation employee Arsin Crassus."}, {"tag": "p", "text": "During the era of the Galactic Empire, the Trade Federation was vilified by many; Leo Leonis considered its epoch to be a bad dream, and instructors such as Tralls taught a version of the crisis on Chrona that suggested the Federation engineered a famine. Zare Leonis took issue with this version of events, although agreed that the Federation had ruined his family's work, and he was glad the company was no longer in business."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "A wealthy corporate organization, the Trade Federation was led by a Viceroy; as of 32 BBY, Nute Gunray held this position, and directed the Invasion of Naboo. The Federation also maintained a seat in the Galactic Senate of the Republic, where it was represented by Senator Lott Dod. Other positions were that of financial officer and diplomat. The Trade Federation armaments committee was part of the Federation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trade Federation was inspired by both the British East India company and the 17th-18th century VOC (Vereenigde Oostindische Compagnie), better known in English as the Dutch East India Company. Especially the latter had its own fleet (one that rivalled most countries'), the right to wage its own wars, negotiate treaties and hold colonies, and a near-monopoly on the extremely lucrative spice trade. The company, considered to be the first ever transnational corporation, would be worth around $7.4 trillion in modern-day dollars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}