{"url": "Trade_Federation_Superfreighter", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems starship classes", "Category:Freighter classes", "Category:Trade Federation starship classes", "Category:Trade Federation Superfreighters"], "nodes": [{"tag": "h1", "text": "Trade Federation Superfreighter"}, {"tag": "p", "text": "The Trade Federation Superfreighter, or TF Superfreighter, was an armed freighter used by the Trade Federation around the time of the Invasion of Naboo. This model was an advanced version of the Trade Federation Freighter also in use at the time. The class would continue to be used during the lead-in to the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Trade Federation Superfreighter was an elongated, white-hulled vessel boasting powerful deflector shields and a reinforced hull. It was armed with two laser cannon turrets, and usually escorted by Scarab starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The pirate captain Nym engaged several Superfreighters during his attacks against Trade Federation forces in the Karthakk system prior to the Invasion of Naboo in 32 BBY. His pirate crew disabled a Superfreighter above Lok, then looted its cargo after the vessel crash-landed on the planet's surface."}, {"tag": "p", "text": "Later, Vana Sage led an assault against a freighter convoy over Naboo, during which Reti infiltrated a Superfreighter and reprogrammed its complement of Scarab fighters to assist Sage's pilots. This aided greatly in breaking the blockade, allowing Vana and her team to continue their mission planet-side."}, {"tag": "p", "text": "The Federation continued to use the Superfreighters in its trading fleet up to and including the Clone Wars. A number of Superfreighters were involved in the project to produce Trihexalon on the planet Nod Kartha by the mercenary Sabaoth Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Superfreighters first appeared in the 2001 video game Star Wars: Starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}