{"url": "Trade_Federation_base", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Naboo locations", "Category:Trade Federation military bases", "Category:Unidentified locations"], "nodes": [{"tag": "h1", "text": "Trade Federation base"}, {"tag": "p", "text": "A base established by the Trade Federation was disabled and attacked by the Royal Naboo Security Forces early in the Invasion of Naboo. The base had extensive defenses and was controlled by the Trade Federation comm web through Comm 4, an orbital satellite."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Trade Federation installation was sequestered in the frozen glaciers of the planet Naboo. The base primarily consisted of six platforms covered in laser turrets, missile launchers, and other buildings. The base's command center was protected by a deflector shield generator. Nearby lay the headwaters of the Andrevea River, and passage further downriver was blocked off by a wall and water-based mines. C-9979 landing craft could land on a landing platform. The base also included a garrison of droid starfighters, and had a command staff of Neimoidians and droids. Commands from the Central Control Computer were rerouted through the orbital communications satellite Comm 4. If the Trade Federation comm web was disrupted, the base would hibernate."}, {"tag": "p", "text": "The Trade Federation took over several settlements in the area and installed laser turrets near them. In one such settlement, in a canyon alcove near the control center, a building was burnt out and revealed the advanced bomb technology it held. During his squadron's attack on the base, Lieutenant Gavyn Sykes found the technology and picked it up."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Trade Federation Droid Army invaded Naboo in 32 BBY, the base was established. During the course of the invasion, the Naboo resistance came up with a plan to strike back at the Trade Federation and free their people who were being held in slave camps. The plan involved knocking out Comm 4 to temporarily cut off the installation from the Central Control Computer, thereby shutting down the base. After destroying Comm 4, the Naboo pilots descended from orbit and began their sorties against the base. The Federation defenses unexpectedly reactivated and commenced firing on the Naboo ships. A C-9979 landing craft took off at the same time. Several droid starfighters took off to engage the Naboo pilots. Moving towards the command center, the pilots left most of the base in ruin. Upon reaching the command center, Lieutenant Sykes blew up the shield generator protecting it. He was then ordered to land his N-1 starfighter and steal a gunboat in order to head down the river and liberate Federation slave camps. His wingmen left the base before enemy reinforcements arrived."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The base appears in a mission from the 2000 LucasArts video game Star Wars: Episode I: Battle for Naboo. The player's objective is to destroy every Federation target. Picking up the upgrade fulfills the mission's bonus objective."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}