{"url": "Trade_Federation_Droid_Army/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Military units", "Category:Separatist Droid Army units", "Category:Trade Federation organizations"], "nodes": [{"tag": "h1", "text": "Trade Federation Droid Army"}, {"tag": "p", "text": "The Trade Federation Droid Army, also referred to as the Federation Army, was the droid army created and maintained by the Trade Federation during the last decades of the Galactic Republic. As the name suggested, it was made up of battle droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the years following the Stark Hyperspace War, the Trade Federation became increasingly threatened by pirate and mercenary attacks on outlying trade routes. This led to petitions to the Galactic Senate to allow the Federation to arm its transport vessels to ward off such assaults. The armaments of the Federation were continually increased, but still its Neimoidian overseers did not feel safe. In addition, Viceroy Nute Gunray had entered into a clandestine pact with Darth Sidious, the result of which was the creation of a military force for the Trade Federation."}, {"tag": "p", "text": "Baktoid Armor Workshop, Haor Chall Engineering, and the Colicoid Creation Nest were all contracted to produce battle droids and war machines for the Trade Federation, many of whose designs were based on existing technology used by the Federation. For instance, the Trade Federation ore barge was used as the basis for its C-9979 landing craft, while the B1-Series battle droids that would comprise the Federation's infantry force were updates of the Hunter-killer droid. Even Neimoidian designs had been incorporated, and the droideka was made in the image of its Colicoid creators."}, {"tag": "p", "text": "The earliest recorded assembly of the Trade Federation Army was in the hangar arm of the battleship Acquisitor, prior to the Eriadu Trade Summit. Here, representatives from Baktoid Armor and Haor Chall presented their designs to Viceroy Gunray and his aides. As well as landing craft and battle droids, Armored Assault Tanks, Multi-Troop Transports, Platoon Attack Craft, and Single Trooper Aerial Platforms were displayed, though at this point, the Federation had not yet contacted the Colicoids."}, {"tag": "p", "text": "This army was built up in secret, though B1 battle droids were revealed to the galaxy during the Eriadu Summit, when one was responsible for the deaths of members of the Trade Federation Directorate. The Army was first deployed during the Invasion of Naboo, though tests were carried out in the Karthakk system, where Nym and his Lok Revenants fought against droid forces on Lok and Eos."}, {"tag": "p", "text": "The Invasion of Naboo served as a turning point for the Federation. Their secret army was fully revealed, and used to subjugate Theed and other Naboo cities. However, this show of force soon turned sour when Queen Padmé Amidala rallied her followers in a desperate counterattack against the Naboo occupation. While the Gungan Grand Army engaged the Droid Army on the Great Grass Plains, Amidala forced Nute Gunray to sign a treaty, effectively ending the occupation. To add insult to injury, the Droid Control Ship in orbit was destroyed by Anakin Skywalker, rendering the entire army useless. The droids were loaded back onto their transports and removed from the system, while Gunray and his cohorts were sent to Coruscant for trial."}, {"tag": "p", "text": "The Supreme Court decreed that the Droid Army be downsized, although Gunray himself was never convicted, and continued to fight for control of his army. Despite the Republic's mandate, the Federation managed to retain much of its armed forces. Further, the Federation began to not only rebuild but also improve its army in secret, utilizing droid factories on many worlds to greatly expand its military. When the Confederacy of Independent Systems was formed, the Trade Federation forces became part of the Separatist Droid Army, fighting alongside droids from the Commerce Guild, the Techno Union, and other major corporate organizations."}, {"tag": "h2", "text": "Composition"}, {"tag": "p", "text": "The true composition of the Trade Federation Droid Army remained unknown, due to its creation and deployment under a shroud of secrecy. Droid forces were hidden within the cavernous hangar bays of Lucrehulk-class battleships and could be assembled from constituent parts that appeared innocuous enough to be overlooked by Republic customs officials. To invade worlds such as Lok and Naboo, the Federation loaded its droids into landing craft, which would make the trip from the Battleship to the planet's surface. From there, Multi-Troop Transports, Trade Federation dropships, and Platoon Attack Craft transported B1 battle droids from the landing zone directly into combat."}, {"tag": "p", "text": "Prior to advancements made during the Separatist Crisis, the Droid Army was slaved to a Central Control Computer, commonly held aboard a specialized Droid Control Ship situated in orbit above target worlds. Ground-based control computers were also deployed to broadcast backup signals. Core ships could also dock in landing pits to broadcast such signals from the ground. Control Computers encrypted to command Vulture droid starfighters in control ships and battleships had an approximate operational range of sixteen thousand kilometers. The destruction of the Control Computer would cause all droid forces to shut down, and it was also known for control broadcasts to be intercepted or overwritten with enemy encryption, causing confusion in the Droid Army."}, {"tag": "p", "text": "The invasion force launched against the city of Theed consisted of thirty-three Multi-Troop Transports—each carrying one hundred and twelve battle droids—and three hundred and forty-two Armored Assault Tanks, as well as additional droid starfighters and infantry."}, {"tag": "p", "text": "The Naboo invasion force included a wide variety of droids, including the Beetle droid, Energy Pummel, and Bio Cannon. These forces were used against both the Naboo and the Gungans."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Droid Army, at least by the time of the Clone Wars as part of the Separatist Droid Army, was composed of nine levels in its command structure."}, {"tag": "h3", "text": "Squad"}, {"tag": "p", "text": "A squad consisted of eight battle droids. Because of their droid status, and thus being either directed remotely or otherwise programmed prior to an engagement, the squads never required an officer for the droid squads, although organic squads were led by a sergeant."}, {"tag": "h3", "text": "Platoon"}, {"tag": "p", "text": "A Platoon consisted of seven squads, and by extension, 56 battle droids."}, {"tag": "h3", "text": "Company"}, {"tag": "p", "text": "A Company consisted of two platoons, of which they were transported via either an MTT or a Troop carrier. As such, they were overall complemented by 112 battle droids, in addition to support droids. These were generally led by a battle droid officer, and were the lowest command chain for droid officers."}, {"tag": "h3", "text": "Battalion"}, {"tag": "p", "text": "A Battalion consisted of seven troop-carrier companies (either MTT or troop carriers), as well as a squadron of 24 AATs. The overall droid count was at 784 battle droids, in addition to support droids, and were commanded by a battle droid officer."}, {"tag": "h3", "text": "Vanguard"}, {"tag": "p", "text": "Vanguards were designed to break through heavy defenses, and thus were primarily composed of 11 MTT companies and a squadron 18 AATs. As such there were 1,232 battle droids in addition to support droids, and were commanded by a battle droid officer."}, {"tag": "h3", "text": "Regiment"}, {"tag": "p", "text": "A Regiment consisted of four battalions and a single vanguard, composed of 4,368 battle droids as well as various support droids and commanded by a battle droid officer. In addition their numbers were the total force carried aboard one C-9979 landing craft."}, {"tag": "h3", "text": "Division"}, {"tag": "p", "text": "A Division consisted of five regiments, and were carried into battle via a section of five C-9979 landing craft. As such, they possessed a total of 21,840 battle droids in addition to support droids."}, {"tag": "h3", "text": "Corps"}, {"tag": "p", "text": "A Corps consisted of five divisions, and were carried into battle via a squadron of 25 C-9979 landing craft. As such, they possessed a total of 109,200 battle droids in addition to support droids."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "An Army consisted of two corps and represented the total surface force carried aboard a Luchrehulk-class battleship. A single army was commanded by the battleship's captain, and was composed of 218,400 battle droids, as well as support droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Droid Army in the Battle of Grassy Plains was entirely computer-generated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}