{"url": "Trade_Federation_Research_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Scientific facilities"], "nodes": [{"tag": "h1", "text": "Trade Federation Research Station"}, {"tag": "p", "text": "A research station was operated by the Trade Federation some time after the Invasion of Naboo. It was used to research the next generation of battle droids. The facility was effectively destroyed following a raid by the Royal Naboo Security Forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Trade Federation research facility was built on an island. The buildings were surrounded by a high wall and guarded by three laser turrets."}, {"tag": "p", "text": "A hangar for aerial vehicles was on a nearby island."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Security Forces raid"}, {"tag": "p", "text": "After acquiring intelligence on the facility, a contingent of the Royal Naboo Security Forces led by Lieutenant Gavyn Sykes raided and seized the facility. While the commandos downloaded the data, Sykes used his N-1 starfighter to defend them, as the Trade Federation did not take the raid lightly. The Federation sent a C-9979 landing craft full of battle droids to retake the station. A number of droid starfighters engaged Sykes while scores of B1-Series battle droids on STAPS harassed the defenders. Eventually, the overwhelming forces drove the commandos to call for an evacuation. A Consular-class cruiser landed on the remains of the station and recovered the commandos and the data. Droid starfighters pursued the fleeing ship until it reached escape velocity."}, {"tag": "p", "text": "When the data was analyzed, it was found that the Federation was building an advanced battle droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The research station appears in the 2000 video game Star Wars: Episode I: Battle for Naboo during the first bonus mission. The mission is unlocked after acquiring all bronze medals during the campaign or through the use of cheat codes."}, {"tag": "h2", "text": "Appearances"}]}