{"url": "Trade_Federation_Basic", "categories": ["Category:Legends articles", "Category:Alphabets", "Category:Trade Federation", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Trade Federation Basic"}, {"tag": "p", "text": "Trade Federation Basic was an alphabet and writing form of Basic. The numbering system was used by the Trade Federation to identify individual battle droids. It was originally adapted from the written form of Pak Pak, the main language of the Neimoidians, when the latter were forced to learn Basic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The so-called Trade Federation Basic alphabet found its origin in the writing system of the Neimoidians, a Near-Duros species from Neimoidia. Unlike their Duros ancestors, who spoke a phonetic language, the Neimoidians had developed the Pak Pak, a new language made of modulated croaks. Because of that, the old Durese syllabary had become unusable, which prompted them to create a new writing system that could accurately express the sounds of Pak Pak. When the Neimoidians started with the wider galactic community, they realized their language was unspeakable by most offworlders, and they started learning Galactic Basic Standard while still using their own alphabet to transcribe it. A form of that alphabet existed as early as of the Cold War between the Galactic Republic and the Sith Empire, around 3643 BBY."}, {"tag": "p", "text": "In 350 BBY, the Neimoidians were among the founding members of the Trade Federation, a shipping corporation and cartel. As centuries went by, their influence in the Federation became stronger and stronger, and their idiosyncratic script ended up being endorsed throughout the organization. Because of that, it was dubbed Trade Federation Basic from then on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}