{"url": "Trade_Federation_Viceroy", "categories": ["Category:Legends articles", "Category:Stub", "Category:Trade Federation", "Category:Viceroys"], "nodes": [{"tag": "h1", "text": "Trade Federation Viceroy"}, {"tag": "p", "text": "The Trade Federation Viceroy, sometimes referred to as the Commanding Viceroy, was the leader of the Trade Federation, the chairbeing of the Trade Federation Directorate, and, as a Neimoidian, head of the Neimoidian Inner Circle in the years prior to the Invasion of Naboo. The symbol of the Viceroy around the time of the Battle of Naboo was a three-pointed tiara, but it would change over time. The Viceroy also held absolute control over the Trade Federation as well as the Neimoidians, the latter due to operating under a hive mind, being unable to think for themselves. Because of this, were the Viceroy either killed or otherwise incapacitated, the Neimoidians and Trade Federation would cease any operations. This was especially prevalent during the Invasion and later liberation of Naboo, where Queen Amidala effectively ended the war by forcing Nute Gunray into signing a new treaty."}, {"tag": "p", "text": "Hask was the Viceroy as of 44 BBY. He was succeeded by Nute Gunray, who held the position until his demise in 19 BBY. Sentepeth Findos served as Acting Viceroy very briefly following Gunray's death, until the Federation was nationalized by the Galactic Empire shortly after the Declaration of a New Order where he and the Federation would-be a puppet to the New Order, however, he would remain the leader of the Trade Federation until it was dissolved with the Imperial Senate in 0 BBY."}, {"tag": "p", "text": "During the Federation's militarization, the Viceroy acted as commander of their military."}, {"tag": "p", "text": "Gunray, as Viceroy, assumed control of Naboo during the Federation's occupation of the planet, temporarily replacing the Monarch, Governor, and captain of Security."}, {"tag": "h2", "text": "Known Viceroys"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}