{"url": "Trade_Federation_Droid_Army", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Separatist Droid Army units", "Category:Trade Federation organizations"], "nodes": [{"tag": "h1", "text": "Trade Federation Droid Army"}, {"tag": "p", "text": "The Trade Federation Droid Army, also known as the Trade Federation army, was a private, automated defense force maintained by the Trade Federation to protect its valuable shipments from piracy. It was used by the Trade Federation to invade the planet Naboo and was later incorporated into the Separatist Droid Army during the Separatist Crisis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As the Trade Federation's private security force, the Trade Federation Droid Army protected Federation forces from pirates and kept valuable Federation cargo safe, despite the galaxy being ostensibly at peace, and the army also acted as the Federation's own military forces. As Viceroy of the Trade Federation, Nute Gunray had the capacity to command the army."}, {"tag": "p", "text": "Few in the Galactic Senate had any real understanding of how powerful their battle droid army was, and those who did know were paid handsomely to look the other way, resulting in peaceful civilizations and worlds without military defenses becoming easy targets for invasions by the Trade Federation."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Trade tensions"}, {"tag": "p", "text": "During the final decades of the Galactic Republic, the Trade Federation, a wealthy interstellar trade and shipping conglomerate, was allowed to maintain a private, automated defense force. The Federation had initially hired mercenaries to protect itself, but it moved to using battle droids for their cheap price, their lack of a need for food or living quarters, and the fact that droids would not rebel against them over working conditions. By 32 BBY, the Galactic Senate had passed legislation, Prop 31-814D, that forced the Trade Federation to pay taxes in the previously untaxed Free Trade Zones. As a result, the Trade Federation decided to retaliate by blockading the Mid Rim world of Naboo and force the people of Naboo to sign a treaty legitimizing the military operations."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "Seeking to settle the trade dispute, Supreme Chancellor of the Republic, Finis Valorum, sent an envoy to the blockade. The envoy, consisting of the Radiant VII and a pair of Jedi ambassadors, Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi, was initially welcomed by the Federation, but after Viceroy Nute Gunray learned of the identities of the ambassadors and at the behest of Darth Sidious, the Federation Droid Army attacked the Jedi and destroyed the Radiant VII. After the Jedi discovered the Federation Droid Army being loaded unto landing craft, they decided to split up and stowaway on separate transports."}, {"tag": "p", "text": "The subsequent Invasion of Naboo saw the deployment of the Federation Droid Army to the planet's surface by landing craft. After grouping their forces, the Army captured the capital city of Naboo, Theed, and captured Queen Padmé Amidala. The Droid Army then established prison camps throughout the city, including Camp Four and secured the Theed Hangar and Theed Royal Palace."}, {"tag": "p", "text": "As Amidala, her security staff, and the Jedi managed to escape to Tatooine and then to Coruscant, the Trade Federation Droid Army secured control of the entire planet, and began searching for the rumored underwater cities of the Gungans. When Amidala and her companions returned to Naboo, they regrouped with the Gungans and assembled their forces. The Naboo gathered their forces as well as the leaders of the underground resistance that had taken arms agains the Trade Federation, while the Gungans assembled their Grand Army."}, {"tag": "p", "text": "In the ensuing Battle of Naboo, the Droid Army was split on three fronts; one battle in the Great Grass Plains against the Gungan Grand Army, one in Theed against a strike force of Naboo Security Forces as they attempted to capture Gunray, and another in orbit above the planet against Bravo Flight, who sought to destroy the Droid Control Ship that would disable all battle droids. By the end of the battle, the Federation Droid Army was deactivated when the control ship, the Saak'ak, was destroyed and Gunray was captured."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "A decade later by 22 BBY, the Trade Federation and its army were still active and were integrated into the Separatist Droid Army along with the droid army of the Techno Union and the resources of the InterGalactic Banking Clan, Corporate Alliance, and the Commerce Guild, who would wage war against the Galactic Republic, resulting in the pan-galactic Clone Wars."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The main infantry of the Trade Federation's armies was the B1-series battle droid. The Trade Federation also employed the use of OOM-series battle droids–OOM command battle droids, OOM pilot battle droids, and OOM-series security droids–and droidekas. For cleanup of destroyed army droids, the Federation utilized the PK-series worker droid. The droid laser turret was also used by the Federation."}, {"tag": "h2", "text": "Vehicles and machinery"}, {"tag": "p", "text": "The Trade Federation Droid Army was equipped with a variety of ground and space vehicles. It made use of platoon attack craft, Multi-Troop Transports, Armored Assault Tanks, and Single Trooper Aerial Platforms for ground operations. The droid army was often used with the Trade Federation military's fleet of space-capable vehicles, such as their C-9979 landing crafts and Variable Geometry Self-Propelled Battle Droid, Mark I starfighters. Using Lucrehulk-class LH-3210 cargo freighters and a Droid Control Ship, they were able to blockade entire planets and deploy their army."}, {"tag": "h2", "text": "Weapons and equipment"}, {"tag": "p", "text": "The common weapon used by the battle droids of the Trade Federation's army was the E-5 blaster rifle. Comlink booster packs were worn on the backs of many B1 battle droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trade Federation Droid Army first appeared in the theatrical 1999 film, Star Wars: Episode I The Phantom Menace. It was first identified in Ultimate Star Wars, a canon reference book released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}