{"url": "Battle_of_Tralus_(Second_Galactic_Civil_War)", "categories": ["Category:Legends articles", "Category:Battles in the Corellian sector", "Category:Battles of the Second Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of Tralus  (Second Galactic Civil War)"}, {"tag": "p", "text": "The Battle of Tralus was the opening battle of the Second Galactic Civil War. Formulated by Admiral Vara Karathas, head of the Corellian Defense Force, and Wedge Antilles under the name Operation Noble Savage, the raid was designed to destroy the Galactic Alliance's beachhead in the Corellian system while maintaining a minimal loss of lives."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "With the failure of Operation Roundabout as a sufficient show of force in the Corellian system, Admiral Matric Klauskin chose to attack and occupy the Corellian world of Tralus to save face. This action occurred, however, under secret manipulations by the Sith, and amounted to a disproportionate response on the part of the Galactic Alliance. The incident served to enrage the citizens of Corellia and push the crisis towards an all-out war. With the assassination of Five World Prime Minister Aidel Saxan aboard Toryaz Station, diplomatic attempts to end the occupation of Tralus were halted. It then fell to Admirals Karathas and Antilles to dislodge the Galactic Alliance presence on Tralus."}, {"tag": "p", "text": "Conventional fighting on Tralus would have caused excessive civilian casualties, so Karathas' original plan was to turn what would have been a public opinion disaster into an asset. Teams of commandos would be sent into Rellidir to disable the deflector shield surrounding the Navos Center for the Performing Arts, the GA's command post, although success on their part was not considered necessary for the plan. Then, YT-5100 Shriek-class bomber would assault the shielded region and, by extension, the command post. They would be closely followed by Galactic Alliance starfighters. These starfighters would actually be units of the Corellian Defense Force, serving to reinforce the bombers and blame the civilian deaths on the Galactic Alliance. Fortunately, Antilles devised a far less wanton battle plan which was eventually put forward."}, {"tag": "h2", "text": "The battle ensues"}, {"tag": "p", "text": "\"Panther Flight\"—Wedge Antilles and a disguised Han Solo—streaked into Tralus's atmosphere, down a Rellidir street and blowing a hole into the underground hangar of the Terkury Housing Complex, a building encased within the shield. Blasting their way out of the hangar and into the shield, the two pilots were pursued by elements of the Second Fleet, under the command of Duros Admiral Tarla Limpan. The fighters in pursuit included Wedge's daughter, Syal Antilles, piloting one of the GA's new Aleph-class starfighters on an initial deployment. Meanwhile, a concerned Leia Organa Solo watched from the Galactic-class battle carrier Dodonna. Concerned for her husband and allies' lives, she secretly communicated with Han via a secreted datapad affixed to his controls to ensure his survival. Ironically, her own daughter, Jaina Solo, had assumed command of Hardpoint Squadron, and was docked at the Rellidir beachhead."}, {"tag": "p", "text": "After a pitched battle where Syal Antilles nearly managed to shoot Han down, the two Shriek-bomber pilots successfully dropped a payload of spotter droids, usually used for weapons training. The droids' low-powered training lasers successfully opened a hole in the shields. Missiles launched from the orbiting Corellian fleet—of the order of hundreds—streaked over the land towards the Rellidir facility. The facility was almost completely destroyed, despite the best efforts of modern Alliance starfighters."}, {"tag": "p", "text": "The Alliance forces were hastily withdrawn as citizens of Tralus streamed out of their homes and started joining their countrymen in attacking Alliance forces with their own civilian blasters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}