{"url": "Tragedy_of_Darth_Plagueis_the_Wise", "categories": ["Category:Canon articles", "Category:Literature", "Category:Sith culture"], "nodes": [{"tag": "h1", "text": "Tragedy of Darth Plagueis the Wise"}, {"tag": "p", "text": "The Tragedy of Darth Plagueis the Wise was a so-called \"Sith legend\" that recounted the murder of Darth Plagueis by the hand of his own apprentice, Darth Sidious. Toward the end of the Clone Wars, Supreme Chancellor Sheev Palpatine recounted that tale to the troubled Jedi Anakin Skywalker on his private box at the Galaxies Opera House in hopes of luring him to the dark side of the Force. In fact, Palpatine was none other than the public persona of Darth Sidious, and he only framed the tale of Plagueis' murder as an old legend so as to avoid suspicion when in reality, he had only recently murdered his master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tragedy of Darth Plagueis first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy."}, {"tag": "p", "text": "The tale was originally intended to be told by Palpatine to Anakin Skywalker in his office rather than at the Galaxies Opera House. During principal photography of Revenge of the Sith, one of the onset changes that director George Lucas made was the alteration of Plagueis' \"legend\" from being staged in the office to the opera house, as Lucas had already shot several scenes at the office. In Celebration Orlando 2017, Ian McDiarmid revealed that the Tragedy of Darth Plagueis scene was his most evil from all the Star Wars scenes he filmed."}, {"tag": "p", "text": "While developing the story of the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the sequel trilogy, director J.J. Abrams felt that the scene of the Tragedy of Darth Plagueis, his favorite from the prequels, served like the greatest setup to bring back Emperor Palpatine in the movie, given the scene's highlighting on Palpatine's obsession for cheating death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}