{"url": "Battle_of_Udnil_II", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Airam sector", "Category:Battles of Imperial Fleet Operation: Clean Sweep"], "nodes": [{"tag": "h1", "text": "Battle of Udnil II"}, {"tag": "p", "text": "The Battle of Udnil II was a space battle between the Alliance to Restore the Republic and the Galactic Empire that took place when Rebel starfighters mounted a bold assault on the Imperial-class Star Destroyer Tormentor as it rendezvoused with a supply convoy in the Udnil system, near the second planet."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Tormentor was taking delivery of ten Class-A cargo containers and rendezvousing with Munro Group, a small convoy of BFF-1 bulk freighters, when a Rebel force consisting of Gold Squadron, flying Y-wing attack starfighters, and Red Squadron, flying X-wing superiority starfighters, dropped out of hyperspace, probably in the gravity well of Udnil II or near it. Munro Group exited the system almost as quickly as they entered it as the Rebels began their audacious attack."}, {"tag": "p", "text": "The Imperial-class warship, however, was not without its own starfighter defenses. A dozen TIE Avengers, at the time considered to be among the best starfighters in the galaxy, moved to intercept the attack fighters and destroy the Rebels before they could inflict too much damage on the Tormentor or its convoy, including the Heavy Lifter Bellboy. To defend themselves against the fast, well-armed TIEs, the Rebels may have called in elements of Blue Squadron, which was equipped with agile A-wing interceptors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Attack on Imperial-class Star Destroyer Tormentor\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side, both sides have conflicting mission objectives, and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Imperial Fleet Operation: Clean Sweep, using the default craft assigned to the player."}, {"tag": "h2", "text": "Appearances"}]}