{"url": "Battle_of_Turkana/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Galactic Civil War", "Category:Battles of Turkana"], "nodes": [{"tag": "h1", "text": "Battle of Turkana"}, {"tag": "p", "text": "The Battle of Turkana was a conflict in 1 BBY during the Galactic Civil War between the Galactic Empire and the Rebel Alliance. A fleet of Imperial-class Star Destroyers under the command of Captain Xamuel Lennox was dispatched to investigate reports of a Rebel task force massing above the Outer Rim planet Turkana. After confirming the Rebel presence, Lennox launched TIE squadrons to target the Rebel warships. Admiral Gial Ackbar, commanding the Rebel fleet from aboard the MC80 Star Cruiser Independence responded by launching Y-wing and X-wing squadrons to intercept."}, {"tag": "p", "text": "The Alliance had only recently acquired the X-wing after members of the Incom Corporation design team defected upon learning that the Empire planned to nationalize the company. The presence of the advanced new starfighter took the Imperial forces by surprise. The X-wings overwhelmed the Imperial fighters before launching their proton torpedoes at the Star Destroyer fleet, causing severe damage to two ships. Lennox issued the order to retreat, leaving several Rebel capital ships damaged but none destroyed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the founding of the Alliance to Restore the Republic in 2 BBY, the fledgling Rebellion had begun growing its military forces for their war against the Galactic Empire. While the support of the Mon Calamari gave the Alliance access to top-of-the-line capital ships, they had to make use of older, easily obtainable starfighters such as the BTL Y-wing and Z-95 Headhunter. This changed in 1 BBY when Incom Corporation learned that the Empire planned to nationalize the company in an attempt to prevent production of their new advanced starfighter, the T-65 X-wing. Many of Incom's design team defected to the Alliance, taking the plans and prototypes for the X-wing with them and wiping the data from the company's computers. With help from governments sympathetic to the Rebellion, the Alliance set about producing X-wings in sufficient numbers and rolling them out to the fleet."}, {"tag": "p", "text": "Shortly after acquiring the X-wing, the Rebels were secretly massing their forces in orbit of Turkana, a lightly populated planet in the Pakuuni sector of the Outer Rim. The task force, under the command of Admiral Gial Ackbar aboard the MC80 Star Cruiser Independence, consisted of a total of seven Mon Calamari Star Cruisers, two EF76 Nebulon-B escort frigates, two CR90 corvettes, four GR-75 medium transports and one Golan Ribbon tanker capable of refueling the other ships. The fleet was equipped with both Y-wings and the new X-wing starfighter."}, {"tag": "p", "text": "Imperial Intelligence learned of the presence of the warships, with initial estimates placing the Rebel strength between four to six capital ships, along with three to eight support vessels. In response, the Imperial sector governor dispatched a fleet of ten Imperial-class Star Destroyers under the command of Captain Xamuel Lennox to Turkana with orders to locate and eradicate the Rebel forces. With Lennox's Star Destroyer Tyrant serving as lead vessel, primary support was provided by the Accuser, under the command of Captain Firmus Piett."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Imperial assault"}, {"tag": "p", "text": "After a patrol of TIE interceptors pinpointed the Rebel fleet's location, Lennox gave the order to attack, bringing his task force out of hyperspace and using Formation Besh, Attack Pattern Tartarus to ensure the Rebels could not escape the system. Having caught the Rebel forces unprepared, the Star Destroyers moved to engage the Rebel cruisers with long-range turbolasers while Lennox ordered the Tyrant, Accuser and Flanchard to launch their TIE wings. The TIE bomber squadrons were dispatched to target the engines of the enemy ships, while the TIE interceptors and TIE fighters were tasked with providing cover for the bombers by targeting any Rebel fighters that came their way."}, {"tag": "p", "text": "Ackbar was quick to respond to the threat and his knowledge of Imperial tactics, gained while previously enslaved by the Empire's Grand Moff Wilhuff Tarkin, proved crucial. The admiral instructed the Rebel fleet to take evasive maneuvers and ordered the new X-wing fighters to be deployed. Less than a minute after the battle began, three squadrons of Y-wings and, to the surprise of the Imperials, two squadrons of X-wings launched, including Red Squadron from aboard the Independence."}, {"tag": "h3", "text": "Rebel retaliation"}, {"tag": "p", "text": "Although Piett alerted Lennox to the X-Wing's capabilities, Lennox dismissed Piett's warning and did not modify his tactics, believing that the Empire's superior numbers would win out in the end. Ultimately, however, the X-wings proved a match for the TIE fighters and interceptors, with similar maneuverability and speed. The X-wings' onboard shields also allowed them to absorb weapons fire without damage; an ability lacked by the Imperial fighters. Although the Rebel fighters suffered some losses, they inflicted far more damage on the TIE squadrons. Among the Rebel pilots involved in the battle was Wedge Antilles of Red Squadron, who managed to land three kills before he was forced to eject from his X-wing."}, {"tag": "p", "text": "With the TIE fighters and interceptors occupied fighting the X-wings, the Rebel Y-wings were able to evade the Imperial fighters and pick apart the TIE bombers. Piett, realizing that Lennox's failure to adapt had already cost them the battle, directed the Accuser towards the bombers and fired on the attacking Y-wings, destroying many and allowing for a lone TIE bomber squadron to reach one of the MC80 Star Cruisers and deliver its payload, disabling the cruiser's sublight drive."}, {"tag": "p", "text": "As the X-wings, having already wiped out the TIE fighters and interceptors, proceeded to join the Y-wings in targeting the remaining bombers, Piett responded by ordering all Star Destroyers to enter Formation Aleph, Attack Pattern Abbadon, closing to full weapons range. However, with no remaining starfighter screen to protect the Imperial capital ships, the X-wings fired their proton torpedoes at the bridge shields of the Ajax and Formidable, causing serious damage to both Star Destroyers. Having failed to destroy a single Rebel capital ship, despite inflicting damage to several, Lennox was forced to issue the order to retreat and the Imperial forces jumped to hyperspace and regrouped at Pakuuni."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, Piett submitted a mission report in which he blamed the defeat on Lennox's inability to adapt to the threat of the X-wing fighters. Piett's report recommended utilizing the agile TIE interceptor in larger numbers when facing X-wings in battle and the use of tractor beams to slow down the Rebel fighters, making it easier for Imperial gunners to acquire a lock on the small targets. Finally, Piett recommended that Lennox be removed from command of Imperial Navy forces in the Pakuuni sector. Piett later became admiral of the Dark Lord of the Sith Darth Vader's Death Squadron, in which Lennox served as captain of the Tyrant."}, {"tag": "p", "text": "Along with his report, Piett submitted a plan for an Imperial counterattack campaign entitled Operation Strike Fear, which he volunteered to lead. Operation Strike Fear was a major offensive which targeted Alliance bases in an attempt to spread fear of the Empire and quell further resistance. Starting with the assault on Brigia, Operation Strike would torment the Rebellion for some time until the destruction of its command ship, the Star Destroyer Invincible."}, {"tag": "p", "text": "Having led the Alliance to its first victory against the Imperial Navy at Turkana, Ackbar went on to become commander of the Alliance Fleet. The X-wing became an essential part of the Alliance arsenal, playing a crucial role at their victory over the Empire's Death Star battlestation at the Battle of Yavin. The X-wing's success ultimately led the Empire to rethink their reliance on superior numbers and develop more capable starfighters, including the TIE Defender."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Turkana was created for the 1993 Totally Games video game Star Wars: X-Wing in which it appeared during the opening cutscene. The battle was not formally named in X-Wing but was identified as the Battle of Turkana in Admiral Ackbar's biography in the 2002 reference book The New Essential Guide to Characters by Daniel Wallace. The battle was subsequently mentioned in The New Essential Chronology (2006) and Ackbar's entry in The Official Star Wars Fact File Part 9 (2014). The most detailed description of the battle to date came in the form of a post-mission report by Captain Piett which appears in Wallace's 2014 reference book Star Wars: Imperial Handbook: A Commander's Guide. Although described as a Rebel victory in The New Essential Guide to Characters, The New Essential Chronology and The Official Star Wars Fact File, The Essential Atlas (2009) shows the battle as a draw on the map entitled \"Flashpoints in the Galactic Civil War.\" The same map misspells Turkana as \"Turkhana.\""}, {"tag": "p", "text": "Originally released on floppy disk in 1993, X-Wing was re-released along with its expansion packs in 1994 as Star Wars: X-Wing Collector's CD-ROM and was later included in the X-Wing Collector Series in 1998. The cutscene depicting the Battle of Turkana changed in each version of the game, with higher quality versions of several scenes. This resulted in some changes to the number of ships shown on each side of the battle. The number of Star Destroyers shown changed from six in the original release to five in the Collector's CD-ROM and ten in the Collector Series. Likewise the Rebel fleet was originally shown to include six Mon Calamari Star Cruisers, but the Collector Series version shows seven, along with two Nebulon-B frigates and two CR90 corvettes. Imperial Handbook later confirmed the later numbers and established that the Rebel fleet included four GR-75 transports, only two of which are seen on screen at the same time in the Collector Series release. The Collector Series also significantly increased the number of Imperial fighters shown in the battle."}, {"tag": "p", "text": "The X-Wing cutscene features a shot based on footage from Star Wars: Episode V The Empire Strikes Back, in which Lennox talks to Cabbel during the Battle of Hoth. Imperial Handbook confirmed that Lennox was in command of the Imperial fleet during the battle. However, the Hoth Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game states that Cabbel was a recent graduate from the Officer's Candidate School at the time of the Battle of Hoth, which took place in 3 ABY, more than three years after the Battle of Turkana."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}