{"url": "Tralus/Legends", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Planet stubs", "Category:Confederation planets", "Category:Corellia system planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Tralus locations"], "nodes": [{"tag": "h1", "text": "Tralus"}, {"tag": "p", "text": "Tralus was the sister planet of Talus in the Corellian system. Together, they were known as the Twin Worlds. Both shared the same orbit around Centerpoint Station. Tralus was quite hospitable to most sentient beings of the galaxy due to its many climates."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Tralus was home to farmers and miners, but it was also associated with the Solo family: Thrackan Sal-Solo was born and raised here, and Han Solo's father Jonash seemed to have spent his earliest childhood on Tralus."}, {"tag": "p", "text": "Only weeks after the Battle of Endor, an underground Imperial base on Tralus, the headquarters of General Weir, was discovered and destroyed by Rogue Squadron, but only after Weir had tortured Ten Numb to death."}, {"tag": "p", "text": "In 6 ABY, it was the location of the battle between rival warlords Josef Grunger and Danetta Pitta."}, {"tag": "p", "text": "During the First Corellian Insurrection, the Tralus and Talus Liberation Party advocated independence for both worlds. In the Second Galactic Civil War, it was the location of the opening Battle of Tralus. It was later blockaded. Sadras Koyan was its head of state."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the cancelled novella Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon, both Tralus and Talus were named after the twin commanders of the Thirteenth Battalion of Zhell, who died fighting against Mhu'anThul."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}