{"url": "Tralus_and_Talus_Liberation_Party", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Political factions", "Category:Resistance groups", "Category:Terrorist and anarchist groups"], "nodes": [{"tag": "h1", "text": "Tralus and Talus Liberation Party"}, {"tag": "p", "text": "The Tralus and Talus Liberation Party, colloquially referred to as the TraTaLibbers, or the TTLP, was a political movement active in the Corellian system during the Galactic Civil War and the First Corellian Insurrection. They advocated that the Double Worlds Tralus and Talus separate from the Corellian government and rule themselves independently."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Galactic Civil War, the Tralus and Talus Liberation Party was in conflict with Corellian local authorities, namely the Corellian Security Force and the Federation of the Double Worlds, as well as with the Aa'kuan anarchists on Talus. Another similar movement was the Two Worlders."}, {"tag": "p", "text": "After the Battle of Yavin, the Talus and Tralus Liberation Party acquired evidence that the Prime Minister of Talus Hagrin Zeed was involved in various criminal activities. They first blackmailed the politician but then considered to publicly reveal Zeed's wrongdoings. The Talusian government therefore designated the TTLP as a terrorist organization. Circa 1 ABY, the Talusian Minister of Protocol Haleen Snowline hired a spacer to murder TTLP members and retrieve the incriminating evidence."}, {"tag": "p", "text": "The same year, the Liberation Party wanted to create an alliance with the Rebel Alliance. The TTLP shipped weapons, medical equipment and valuable artifacts to a Rebel weapons depot on Talus in order to obtain Alliance support. Around the same time, TTLP soldiers were involved in the robbing of Aqualish graves on Talus. They were eventually stopped when the the Aqualish Omkoo hired a spacer who fought several TTLP soldiers at an ancient Aqualish gravesite and retrieved all stolen Aqualish artifacts."}, {"tag": "p", "text": "The Tralus and Talus Liberation Party was still active in 18 ABY, during the Starbuster Plot, but the TraTaLibbers were not involved in the conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}