{"url": "Training_Camp_IMIIF-138", "categories": ["Category:Legends articles", "Category:Imperial military bases", "Category:Sirpar locations"], "nodes": [{"tag": "h1", "text": "Training Camp IMIIF-138"}, {"tag": "p", "text": "Training Camp IMIIF-138 was an Imperial training facility on Sirpar. It was commanded by Captain Strelk, and its most notorious instructor was Sergeant \"Slag\" Jankar."}, {"tag": "h2", "text": "A literal mudhole"}, {"tag": "p", "text": "The IMIIF-138 was situated in the hot and humid jungle terrain on the equator of Sirpar, and was home to the 19016th training company, which were supported by 200 droid units, 40 of which were E2-I6 instruction models. The weather conditions were extreme changing in an instant from a boiling hot sun to pouring rain, which caused the camp to be eternally muddy."}, {"tag": "p", "text": "The camp was delimited by a security fence, and contained among other things an indoctrination center, an obstacle course, an exercise area, a firing range, an infirmary, an armory, a mess hall, a machine shop, a garage, barracks and its own power plant."}, {"tag": "p", "text": "The computer network of the camp was large, but out of date, and thus susceptible to slicing. Terminals were found in all administration buildings, the indoctrination center, the armory, and the power plant. While authorization was needed to access the network, slicing it was possible if one was skilled in computer programming. The network was once sliced by unknown Rebel agents, acting upon a tip given by Tal Pak and Vassk, who had infiltrated the camp disguised as recruits to locate the location of vital starship spare parts."}, {"tag": "h2", "text": "Life in the camp"}, {"tag": "p", "text": "The recruits would be awakened one hour before dawn and were given 10 minutes to shower, dress, and make their beds. Those who were tempted by skipping the shower would be severely abused by Jankar, who often likened them to banthas. Those who were sloppily dressed were forced into spending an extra hour each night ironing their clothes. Recruits who failed to make their beds had to sleep outside."}, {"tag": "p", "text": "The day would start with conditioning training, such as calisthenics, long-distance running, and obstacle courses. Those who did not do well would be called \"Private Hutt\" and subjected to extra training."}, {"tag": "p", "text": "After lunch recruits had weapons instruction, being drilled in how to assemble blaster rifles and spending several hours practicing at the shooting range where they shot at holographic targets. Shooting exercises were continued after lunch when recruits would stage mock battles in the jungles outside the camp, using blasters set on stun."}, {"tag": "p", "text": "After dinner Imperial indoctrination sessions took place, during which trainees would sit though hours of Imperial propaganda and lectures given by COMPNOR instruction droids. The indoctrination classes typically involved holographic recordings of the \"devastation and atrocities committed by the Rebel terrorists\". After indoctrination sessions, the trainees would receive instruction in map reading, handling of equipment and so on."}, {"tag": "h2", "text": "Known personnel"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}