{"url": "Trandoshan_ale", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Ales"], "nodes": [{"tag": "h1", "text": "Trandoshan ale"}, {"tag": "p", "text": "Trandoshan ale was a type of amber ale served in the Outlander Club on the planet Coruscant and in Ronto Roasters in Black Spire Outpost on the planet Batuu. When trying to hid the fugitive Skelly from the Galactic Empire in 11 BBY, fugitive Jedi Kanan Jarrus shut him in a backroom of the Asteroid Belt cantina and claimed he was a Wookiee who had drunk too much Trandoshan ale."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Trandoshan ale was a type of amber-colored ale that shared its name with the Trandoshan species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, Trandoshan ale was being served at the Outlander Club on the planet Coruscant and was kept in a tall tube on the counter behind the club's central bar."}, {"tag": "p", "text": "When the Jedi-in-hiding Kanan Jarrus needed to prevent a pair of Imperial stormtroopers from finding the demolitions expert Skelly during a conflict on the planet Gorse in 11 BBY, he hid him in a closet in The Asteroid Belt cantina and pretended he was a Wookiee who had drunk too much Trandoshan ale. Jarrus claimed the ale was strong enough to take the finish off of a landspeeder, and the retching sounds made by Skelly were enough to put the troopers off entering the bathroom."}, {"tag": "p", "text": "Trandoshan ale could also be purchased from Bakkar, the proprietor of the Ronto Roasters eatery in Black Spire Outpost on the planet Batuu. At some point after the Battle of Takodana in 34 ABY, the Artiodac chef Strono Tuggs mentioned in his cookbook The Official Black Spire Outpost Cookbook that patrons of Ronto Roasters might want a Trandoshan ale or drink from one of Jat Kaa's astromech droid drawn-coolers after eating there, but suggested that the drinks at Oga's Cantina were superior."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trandoshan ale was first mentioned in A New Dawn, a novel by John Jackson Miller released in 2014. It is not clear if Jarrus' claims about the ale in the novel are accurate. The 2019 reference book Star Wars: How Not to Get Eaten by Ewoks and Other Galactic Survival Skills then retconned one of the drinks visible in the 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones, as being Trandoshan ale."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}