{"url": "Battle_of_Umbara/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles in the Ghost Nebula", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Umbara"}, {"tag": "p", "text": "The Battle of Umbara took place during the Clone Wars on the planet Umbara. The planet's native species withdrew from the Galactic Republic following the murder of their representative on the Galactic Senate, Mee Deechi. Fearing the complete loss of the Umbaran system to the Separatist cause, the forces of the Galactic Republic, led by Generals Anakin Skywalker, Obi-Wan Kenobi, and Saesee Tiin, engaged both the Confederacy of Independent Systems and their Umbaran supporters on the shadowy world. After a massive air-to-ground assault and subsequent landing on the planet, the clone trooper forces of the Grand Army of the Republic established a foothold on Umbaran soil and prepared for a massive invasion of the planet's capital city. For this portion of the battle, General Skywalker was replaced by the revered and somewhat infamous Jedi, Pong Krell. However, the Republic forces were ignorant to General Krell's obsessive personality, which led him to sabotage the Republic's war efforts for self-gain."}, {"tag": "p", "text": "Kenobi led the 212th Attack Battalion as the main attack force against the Umbara capital city, while Krell \"led\" the 501st Legion with Captain Rex to capture an airbase as preparation for the assault on the capital city, encountering heavy resistance from the humanoid Umbarans while trekking across the treacherous Umbaran landscape, full of exotic and dangerous wildlife and littered with minefields. Displaying his brash and strict style, Krell often ordered his men to push on despite the overwhelming odds against them, which in reality was an effort to cause as many clone casualties as possible. Despite their misleading under Krell, the clone forces persevered and captured the airbase, due in part to a stealthy infiltration by Fives and Hardcase, who acquired two Umbaran starfighters for use as air support. An unauthorized strike against the Separatist fleet was launched from the newly converted airbase by the clones Jesse, Hardcase, and Fives using the stolen Umbaran starfighters. They successfully destroyed one of the main Separatist supply ships at the cost of Hardcase's life."}, {"tag": "p", "text": "After Rex and his men refused to execute the \"defective\" clones, Krell displayed his true colors by purposely leading the forces of the 212th Attack Battalion and the 501st against each other, resulting in many clones lost to friendly fire, including Waxer. The survivors of the ordeal came to the realization that Krell was unfit for military command and resorted to arresting the rogue Jedi. Upon confronting Krell in his converted command tower in the airbase, Krell accused the clones of treason before attacking them with both of his double-bladed lightsabers and jumping out of the tower, fleeing into the Umbaran jungle. Rex and his men pursued, and were picked off one by one by Krell, who was using the jungle's foliage as means of hiding. The young and idealistic clone Tup tricked the general into tripping over the appendage of a native stationary vixus beast, which promptly attacked and disoriented Krell. The rogue general was then subdued and taken back to the airbase a prisoner, where he was executed by the clone Dogma for his crimes against the Republic. Shortly after, the capital city was taken by General Kenobi and the 212th Attack Battalion, ensuring victory for the Republic forces and ending the battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the early days of the Clone Wars, the planet Umbara and its native Umbaran people were loyal to the Galactic Republic, being represented in the Galactic Senate by Senator Mee Deechi, a militarist politician who supported expansions for the Grand Army of the Republic. Late in 21 BBY, the second year of the war, Deechi was murdered by a fellow politician, Representative Lolo Purs, who sought to cover her tracks as the culprit of the poisoning of Senator Onaconda Farr. The Umbarans subsequently withdrew their support of the Republic and allied themselves with the Confederacy of Independent Systems, bringing their advanced combat technology to the Separatists. Because the Confederacy began tightening their grip over important supply routes, the Republic and the Jedi Order in retaliation launched a campaign to retake the Umbara system, strategic because of its location on the Great Kashyyyk Branch. The Republic sent Jedi Master Pong Krell, Jedi Knight Anakin Skywalker and Jedi High Council members Obi-Wan Kenobi and Saesee Tiin as commanders for clone trooper detachments from the Grand Army."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "The northern landing"}, {"tag": "p", "text": "Spearheaded by Z-95 Headhunters, Republic forces launched a blitz attack on the Separatist blockade fortifying Umbara. After quickly punching a hole through Separatist defenses, the Republic forces consolidated for a ground assault on the Umbaran capital. While Generals Obi-Wan Kenobi and the 212th Attack Battalion/Legends took command over the southern front and attacked the local militia headquarters, Anakin Skywalker and the 501st Legion were given control over the northern front with the intention of flanking Separatist reinforcements and providing support for Kenobi. Upon reaching the atmosphere, the ground forces were deployed in a squadron of gunships guarded by a wing of Headhunters."}, {"tag": "p", "text": "A large number of AT-RT scout walkers were deployed from the gunships, and they charged the Umbaran militia, clearing the way for the clone infantry to land. The Umbarans employed tanks which utilized electric current-based weaponry; however, the scout walker's agility allowed them to easily outmaneuver several of the tanks and take them out from the side. Skywalker and his men touched down after a rough landing, losing at least one gunship to surface fire. The attack force proceeded onward to claim a ridge to the north that was viable as a potential staging area for Republic forces. The clone forces charged straight into the Umbaran's frontlines, forcing the enemy militia to fall back. However, the clones encountered a bizarre form of Umbaran fauna: a carnivorous, tentacled creature known as the vixus. The creature grasped several clones with its tentacular appendages and dragged one into its gaping maw. ARC-5555 nicknamed \"Fives\" who was in the grasp of the creature, tricked it into swallowing a thermal detonator, destroying the monster from the inside."}, {"tag": "p", "text": "After securing the landing zone, the clone forces entrenched themselves on the ridge. As they rested, the Umbaran insurgents regrouped themselves for an ambush on the clone camp; by distracting the tired clones with millicreep assassin droids, the Umbarans circled around the camp and attacked the clones from the rear. In response, General Skywalker authorized a carpet bombing of the ridge, and ordered his men to fall back to the south, losing at least one AT-RT walker in the process. Upon reaching the fallback zone, two BTL-B Y-wing starfighters led by Commander Odd Ball carpet bombed the ridge, wiping out the last of the Umbaran resistance in the area."}, {"tag": "p", "text": "As the clone forces regrouped for the imminent attack on the Umbaran capital city, General Pong Krell arrived, relaying an order from the Jedi Council requesting Skywalker's return to Coruscant, an order which apparently originated from Supreme Chancellor Palpatine. Skywalker reluctantly followed the order, leaving Krell to lead the 501st in the interim. Krell then ordered his men to march on the capital. Along the way, they were attacked by a pair of banshees, which Krell killed so that the battalion could resume marching onwards. When Krell and the 501st reached the outskirts of the Capital, Krell ordered the troops to launch a full frontal assault instead of using preemptive surprise attacks. Captain CT-7567 nicknamed \"Rex\" complied with the order and then led his troopers and AT-RTs onto the main road to assault the capital. As the 501st marched along the road, they ran into a minefield, killing troopers Oz and Ringo. ARC trooper Fives was able to find more mines and a way through them. The 501st were soon ambushed by the Umbaran militia, but held their ground, although they were too exposed to hold out for long. Captain Rex then ordered the 501st to retreat in order to gain a better fighting position. They were then able to rejoin Krell and the rest of the 501st. Together they were able to repel the Umbarans. After that, Krell criticized Captain Rex for giving up the road. Rex and Fives were able to convince the general that they did what was best for their men. After Krell gives Rex a dubious compliment, the Umbarans launch a counterattack on the 501st."}, {"tag": "h3", "text": "Capturing the airbase"}, {"tag": "p", "text": "Krell and the 501st continued to hold their positions despite the relentless attacks of the Umbaran militia from both ground and air. The 501st could not break through to support General Kenobi's battalion. Kenobi then contacted Krell, ordering him to take out an airbase being used as a supply base for the capital. The 501st regrouped and proceeded to the airbase."}, {"tag": "p", "text": "When the 501st got within distance of the airbase, Rex suggested that they try and scout for another way in. Krell, knowing the urgency of Kenobi's situation, ordered the captain to take the battalion through a gorge single file. Rex's men started to criticize Krell's orders and tactics knowing that their casualties would be high but he was able to convince them to go through with it. As he started the attack, Rex divided his men into three groups, with Fives, Hardcase, and himself being in charge of these groups. As the 501st made their way through the gorge, they were attacked by caterpillar tanks which they subdued with their rocket launchers and thermal detonators. The 501st then resumed their advance towards the airbase before being forced to retreat by enemy fire from spider cannons. Krell then ordered Rex to push the attack; his men tried using rocket launchers on the spider cannons, but to no avail."}, {"tag": "p", "text": "Rex then ordered Fives and Hardcase to acquire a couple of Umbaran starfighters and use them against the tanks. However, Krell ordered Rex to launch a full-scale attack. Rex and his men then continued to hold their ground against the tanks. The two troopers passed the sensor fence surrounding the airbase by climbing a tree. After Fives and Hardcase made it over, Fives blew up the tree to distract the Umbarans. Fives and Hardcase were then able to get into a couple of starfighters and successfully destroyed the tanks, with Krell gazed upon the destruction with a love of war, contrary to Jedi ideals. Krell then sent clone sergeant CC-1119, nicknamed Appo, and the rest of the battalion in to take the airbase. The 501st was successful in taking the airbase. The battalion then rounded up the prisoners and held the base before moving on to aid Kenobi in taking the capital."}, {"tag": "h3", "text": "Attack on the supply ship"}, {"tag": "p", "text": "After Krell and the 501st conquered the airbase for the Republic, the Umbarans then stepped up their attacks, trying to retake their airbase. The Jedi made sure that all security measures were reconfigured and that the battalion stayed on alert to anything, while ARC trooper Fives worked on examining the Umbaran starfighters. Krell was then contacted by Kenobi, who congratulated him on taking the airbase, though the latter wanted to wait until the battle was over to celebrate. Kenobi then informed Krell that his battalion was being pushed away from the capital by long-range missiles and that the capital was being resupplied by a Separatist supply ship within orbit, guarded heavily by the Separatist armada—which outnumbered the Republic vessels. Krell, however, stated that they would have to take the capital regardless of these missiles and said that he would meet Kenobi and his battalion at the rendezvous point. Kenobi's transmission was then lost. Krell then ordered Rex to ready the battalion to move out in 12 hours to advance on the capital; the captain then asked Krell if he should try and get a message through to Kenobi to coordinate their attack in light of the recent threat. Krell knew, however, that like himself and his battalion, Kenobi had his hands full and asserted that they needed to throw everything they have at the capital. Rex told Krell that they would be walking into a blast zone, but the Jedi disagreed and ordered him to prepare his troops."}, {"tag": "p", "text": "After Rex briefed his troops, ARC trooper Fives told Rex that they have broken the Umbaran access codes and that they can use the captured starfighters to infiltrate the supply ship and destroy it, thus cutting off supplies to the capital. Rex told Krell of this plan, but Krell does not wish to waste men on this plan knowing they will need everyone to help take the capital. Despite Krell's orders, Fives decided to go through with the mission despite the risk of court-martial so he, Hardcase, and CT-5597 nicknamed \"Jesse\" went to a hangar and train themselves at flying the captured starfighters, though Hardcase was still having trouble at flying the craft. Krell was soon informed of this. Fives told Krell that it's just a safety drill, but Krell however does not believe it. After Hardcase accidentally shoots the hangar door apart, Krell comes down. Hardcase then figures out how to fly the starfighter. When Krell demands to know what happened, Fives and Hardcase tell him that it was an enemy booby trap and that they were lucky they got in control before the starfighter went haywire. Krell then orders the starfighters to be locked down, despite Hardcase's objections. After Krell left, Jesse and Hardcase volunteered to fly with Fives, regardless of the consequences. Fives told them his plan knowing how when General Skywalker was a kid, he blew up a ship by hitting its reactors from the inside. Rex was then conducting a perimeter sweep when Fives, Jesse and Hardcase tell him that they intend to go through with their plan. Rex reluctantly gives them permission to do so, but tells them that if they get caught, he won't be able to help them."}, {"tag": "p", "text": "Fives, Jesse and Hardcase then commandeered the captured starfighters and made their way into orbit towards the supply ship. When they got there, they were in the middle of a space battle between the Republic and Separatist fleets. When Krell found out about this, Rex told him that it was merely a reconnaissance mission. Meanwhile, the rogue troopers then make their way through the battle towards the supply ship. The battle droids then saw that the fighter pilots were clones and the tactical droid in charged was informed of this. When the droids start closing the doors, Hardcase shot them but damages his fighter. The tactical droid then ordered the defenses to increase and the reactor's ray shields to be activated. Just when the rogue troopers make their shot on the reactors, the ray shields came up. The rogue clones then came under ground fire from the droids. Hardcase then leaves his fighter and takes one of his missile pods into the reactor room and tells Fives and Jesse to get out. Just as Fives and Jesse leave, Hardcase rams the missile pod into the reactors, thus destroying the supply ship. After Fives and Jesse land they were taken to see Krell. Though Krell knew it was a brave act, they disobeyed his orders. Rex tried to take the blame for this mission, but Fives insisted that it was his idea. Krell told Fives and Jesse that they will be court-martialed and executed."}, {"tag": "h3", "text": "Execution"}, {"tag": "p", "text": "After the event in which Fives, Jesse, and Hardcase (who had sacrificed himself to destroy the supply ship) disobeyed Krell's orders, Rex tried to talk Krell out of court-martialing Fives and Jesse and told him there was no need and that the troops felt Krell was putting their lives in danger needlessly. Krell only replied that the the court-martial was needed to show the clones who is in charge. After a short lived talk, Krell decided that the execution of Fives and Jesse will be more effective than court-martialing them. He ordered Rex to prepare a squad for execution. Shocked, Rex tried again to reason with the general, only to be yelled at. Doing as he was told, Rex retrieved Fives and Jesse from their prison cells. Rex told them that he tried to reason with Krell with no success. He and the other troopers set them up along the wall of the airbase. Dogma, the leader of the execution, asked Fives and Jesse if they would like to be blindfolded; with no response, Dogma took it as a no. As the execution team prepared to fire, Fives stopped them and said that what they are about to do is wrong and that they should not listen to Krell's order for execution. The troops begun to wonder if Fives was right, but not caring at all, Dogma ordered them to fire. The troopers fired but purposely avoided hitting Fives and Jesse. Dogma began to question why the troopers didn't kill Fives and Jesse, only for Rex to step in and tell him that their actions in destroying the supply ship was heroic and that if all clone troopers in the 501st legion were rewarded with execution for heroic actions, then one day they would all face a similar fate. The troopers then untied the two clones."}, {"tag": "p", "text": "Up in the tower, Krell was furious to hear that the clones didn't killed Fives and Jesse and reprimanded Rex for it. Soon an incoming message came through and a clone trooper reported that the Umbarans have stepped up their defenses and had recently ambushed a clone platoon and seizing clone armor and weapons, and have disguised themselves as clone troopers. Krell put the execution on hold and ordered Rex and his men to prepare to march on the capital and reminded him to tell his men that the enemy has now disguised themselves as clone troopers."}, {"tag": "h3", "text": "Krell's treachery"}, {"tag": "p", "text": "Soon after, Rex prepared to lead the forward platoon through the briar fens of the Umbaran wilderness. He warned them to stay alert, since the Umbarans may use the captured Republic supplies to create confusion. When Rex and the rest of his men came under fire from the disguised Umbarans, the troops then set up their mortars and opened fire on the enemy. The firefight between both sides continued, with Krell watching with contempt, until Rex discovered that the \"disguised\" Umbarans were actually clones. Rex then ordered his men to stop firing, telling them to take off their helmets to see that they were all clones. Both sides revealed themselves to be clones. Rex then found the 212th battalion platoon leader, Waxer, who was mortally wounded in the firefight. Rex asked Waxer who gave the order to attack them who told Rex that Krell told his platoon that the Umbarans had stolen clone armor. Waxer dies soon after. Rex then rounded up his men and the remnants of Waxer's platoon. Rex told them that they are going to arrest Krell for treason against the Republic. Rex then told them that if anyone did not wish to do this, to step out of the line. All of Rex's men and the surviving 212th stepped forward to arrest Krell."}, {"tag": "p", "text": "Rex and the 501st, along with the remainder of Waxer's platoon prepared themselves to arrest Krell. Along the way, Rex freed Fives and Jesse from their imprisonment and gave them back their armor and weapons. Rex and his men then proceeded to the control tower to confront Krell. Rex then stated that General Krell was relieved of his command, but Krell told Rex that he and his men were committing mutiny. Krell then admitted he did tell his men to kill each other. Just as the clones closed in on him, Krell subdued them, killing some of them with his double bladed lightsabers and then escaped into the jungle, demonstrating a new-found passion for the dark side and for violence. Rex ordered his men to go into the jungle and find him. Dogma, remaining loyal to Krell, tried to stop his brothers, calling them traitors. After Rex convinced him to stand down, Dogma was taken to the brig. When Rex and the rest of his troops marched in the thick of the briar fen, Krell subdued one of the squads. Krell, using the force, taunted Rex and his men, saying that he has been using them all along, laughing at them. Tup then had Rex lure the corrupt Jedi Master over to him. When Tup managed to lure Krell's attention from the rest of the clones, the general then ran into a vixus. Although Krell was able to free himself from the vixus' grasp, he was stunned by Tup, and the troops placed a pair of binders on his hands and was taken into custody."}, {"tag": "p", "text": "When Rex questioned Krell about his actions, he admitted that he has turned traitor and told Rex that he foresaw that the Jedi would lose the war, and that a New Order will arise, and that in exchange for betraying the Republic, he would become Count Dooku's new apprentice. This surprised Dogma, since he was one of Krell's most loyal troopers. Rex then discovered that Krell had sabotaged the airbase's communications and that the 212th Attack Battalion/Legends had manage to take the capital. Unfortunately the Umbaran forces were on their way to retake the airbase. Captain Rex then ordered the troops to prepare for a full scale attack. When Fives warns Rex that if Krell is freed, he would undermine the Republic's foothold. So Rex decided to execute the fallen general. Rex and Fives then went down to the brig and released Dogma. Rex then told Krell to face the wall and get down on his knees. Krell taunted Rex that he was afraid to pull the trigger. Just when Krell finished his last taunt, Dogma took one of Fives' pistols and shot Krell for betraying every one of his men. Rex then got word that Kenobi and the 212th had all sectors secured and that all remaining Umbarans had been defeated, marking the end of the invasion on Umbara."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Umbara secured, the Republic was able to retake the Separatist stronghold. However, Rex didn't feel like celebrating and instead wondered what the point of the war was and what would happen to the soldiers when it ended. The fall of Krell near the end of the battle demonstrated that even Jedi could fall to the dark side if they fall to despair with the way the war was going."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Umbara was featured in a four-part series starting from \"Darkness on Umbara\" and ending at \"Carnage of Krell.\" It is the third major battle featured through multiple episodes in the series, the first being the Battle of Ryloth from Season One, and the second being the Second Battle of Geonosis that appeared in Season Two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}