{"url": "Trandosha", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles to be expanded", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:Mytaranor sector planets", "Category:Trandosha locations"], "nodes": [{"tag": "h1", "text": "Trandosha"}, {"tag": "p", "text": "Trandosha, also known simply as Dosh, was an arboreal planet located in the galaxy's Mid Rim and the homeworld of the Trandoshan species. It was orbited by Wasskah, a verdant moon, and was positioned in the same star system as Kashyyyk, the homeworld of the Trandoshans' fierce rivals, the Wookiees. The feared Trandoshan bounty hunter Bossk hailed from Trandosha."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Also known simply as Dosh, Trandosha was a planet located in the Kashyyyk system, a single-star system positioned in the Mid Rim's Mytaranor sector. It was located in grid square P-9 on the Standard Galactic Grid. Trandosha was orbited by Wasskah, a verdant moon, and neighbored the planet Kashyyyk, which shared the same system."}, {"tag": "p", "text": "A temperate world of thick jungles and forests and plains, Trandosha was a hunter's paradise. It had a greenish hue when viewed from space, and large, white clouds loomed over the planet's marbled surface. Trandosha was the homeworld of a species of hound known as the Trandoshan hunting hound, which had a squarish muzzle, as well as a species of jellyfish known as the Doshian jellyfish."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Trandosha was the homeworld of the Trandoshans, sentient reptilian humanoids who were renowned for their hunting prowess and allied their world with the Galactic Republic. They had a fierce rivalry with the Wookiees, a sentient species that was native to the neighboring world of Kashyyyk. Trandosha's culture was built around predation and supremacy, ideals that did not always mesh well with the precepts of the Jedi Order and made Trandoshan Jedi rare. Trandoshans from Trandosha included Bossk, one of the most feared bounty hunters in the galaxy;\nhis sister, Doshanalawook, who worked to liberate Wookiees from captivity under the alias of Chainbreaker; the salvage ship captain Gha Nachkt; the big-game hunter Garnac; and the pilot Feresk Tssat."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Trandosha's sunbaked plains were known as the Scorch. There, Trandoshans enjoyed basking in the sun's rays and mothers routinely laid their nest-eggs. The planet was also the location of a diner that was visited by J-4X and a droid repair technician following the founding of the Resistance in the year 28 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Dosha,\" the Trandoshan homeworld, was the main setting of the original script for \"Padawan Lost,\" the twenty-first episode of the animated television series Star Wars: The Clone Wars' third season, but this locale was later changed to Wasskah, Trandosha's moon. Although not visited, Trandosha can still be seen in the episode's final version, as well in the following episode, \"Wookiee Hunt,\" both of which aired on April 1, 2011. Trandosha traces its origins to the 1996 Star Wars Legends short story \"The Prize Pelt: The Tale of Bossk,\" written by Kathy Tyers and featured in the anthology book Tales of the Bounty Hunters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}