{"url": "Transfer_essence", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Control powers", "Category:Dark side powers", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Transfer essence"}, {"tag": "p", "text": "Transfer essence, also known as essence transfer or transfer life, was a radical dark side Force power used to transfer a person's consciousness into another body, or in some cases an inanimate object. Ancient Sith Lords and other powerful darksiders used this technique to cheat death again and again, haunting their tombs and possessing those who stumbled across their sarcophagi in order to continue their reign of terror. In more recent eras, masters of this dark side art had used advanced cloning technology to assure their immortality."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The power enabled the wielder's spirit to survive the death of their organic body by usurping control of a suitable receptacle. If the invading consciousness was powerful enough, it could override and expel the mind of the target body. However, it was nearly impossible to overcome a spirit already residing in a body, and the practitioner's own body disintegrated in the attempt. If the target resisted the possession attempt, or if the user failed in their attempt to bond with the object, their disembodied spirit, with nowhere else to go, was consigned to Chaos. Given the power's inherent difficulty, its unpredictable nature, and the unspeakable consequences of failure, most would-be practitioners in the modern era chose to have their bodies cloned by trained technicians and kept in a hidden safe-house, unconscious in stasis tanks until they were needed. The clones, lacking life experiences or a sense of self, were each little more than a blank slate, upon which the original could imprint their consciousness with ease."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "Among the earliest Sith Lords to use this technique was Karness Muur, a Lord of the Sith Empire, who bound his spirit to the Sith artifact that bore his name, the Muur Talisman. The talisman allowed Muur not only to cheat death, but also to take possession of whoever wore the Talisman, unless the wearer's willpower was strong enough to resist him, as was the case with Celeste Morne."}, {"tag": "p", "text": "The Sith Emperor Vitiate was one of history's most powerful practitioners of this art. Not only did he reign for over 1000 years using a multitude of different bodies he called Emperor's Voice, he also imparted some of his essence into several hundred, maybe thousand individuals he called his Children of the Emperor. His skill in this power was so great that he could continuously exist without a host without succumbing to chaos or madness, could inhabit a host's mind without displacing the original personality for extended periods of time, and even maintain complete control over several thousand bodies at once. Also unlike Sidious, Vitiate seems to have been able to limit the amount of premature degeneration which would usually be caused by powerful dark side energy, to the point where his last known body seems to have aged at the same rate as an ordinary human with little to no dark side degeneration. This might have been caused by Vitiate using the bodies of individuals already powerful with the Force, while Sidious used empty clone bodies."}, {"tag": "p", "text": "Unlike his spiritual descendants, Exar Kun, Dark Lord of the Sith during the era of the Great Sith War, used this power not to suborn another body or possess an object but to anchor his spirit to the Massassi Temples on Yavin 4. When his apprentice Ulic Qel-Droma betrayed him to the Jedi, Kun called all of his Massassi followers into the Temple of Fire, then used their life force (and the alchemical apparatus left by his predecessor Naga Sadow) to abandon his body, drawing on the remarkable focusing energies of the Massassi Temples to anchor himself to the physical world. Kun's spirit remained in hiding on Yavin IV for over four thousand years, slowly driven mad by his bodiless existence and the unthinkable isolation of the jungle moon. His spirit was finally vanquished by the students at Luke Skywalker's Jedi academy, seven years after the Battle of Endor."}, {"tag": "p", "text": "In 3643 BBY, Darth Zash attempted to use this power on her apprentice Darth Nox. Zash had spent years searching for relics of the ancient Sith Lord Tulak Hord to aid her in the ritual, but was foiled when the Dashade Khem Val interceded to protect Nox, his master. Instead of stealing her powerful apprentice's body, she was inadvertently trapped in Khem Val's body with both of their consciousnesses vying for control."}, {"tag": "p", "text": "Darth Bane learned this power after acquiring Darth Andeddu's holocron. The gatekeeper of the holocron refused to teach this power to Darth Bane, so Bane decided to rip the information out of the holocron, absorbing it directly into his mind. He later attempted to transfer his essence into his apprentice, Darth Zannah, during their final duel, but her willpower was strong enough to repel the invasion, thus proving her worth to carry on Darth Bane's legacy. However, some of Darth Bane's consciousness still lingered within Zannah."}, {"tag": "p", "text": "Set Harth, a Dark Jedi from the era of the New Sith Wars, learned this technique from Darth Andeddu's holocron after taking it from the Stone Prison on Doan; he used the power to shuttle his consciousness through a series of cloned bodies in much the same manner as Darth Sidious, nearly a millennium later. However, Set Harth's clones were provided by discreet third-party technicians, and never displayed degradation of the kind the Emperor experienced. Nevertheless, Harth tended to discard them around their 30th year. Unconfirmed reports suggest that he persisted to at least the Yuuzhan Vong Invasion —if true, he must have gone through dozens of clones over the intervening centuries."}, {"tag": "p", "text": "Darth Plagueis was aware of the concept of transfer essence. However, he deliberately avoided using it, as he intended to maintain his own body in complete immortality. Unfortunately for Plagueis, he ultimately never discovered a way to cheat death before his assassination at Darth Sidious' hands in 32 BBY."}, {"tag": "p", "text": "Cronal also became aware of this ability after intense study of various dark side sites as well as knowledge imparted on him by Darth Sidious. However, he had no intention of using the ability to transfer his mind to a clone but rather use it to take over a living sentient body through Pawns. He later attempted to accomplish this feat in order to place his mind in Luke Skywalker's at the Battle of Mindor."}, {"tag": "p", "text": "Darth Sidious was the most prolific practitioner of this esoteric technique in the modern era, surviving his first death at the hands of Anakin Skywalker, and another at the hands of Anakin's children, by transferring his spirit into fresh clone bodies. However, Sidious's strength in the dark side of the Force caused each clone to degenerate at an accelerated rate, forcing him to take new clone bodies periodically. The clones' rate of degeneration was increased further by sabotage. Additionally, he used this power to torture Bevel Lemelisk after the destruction of the first Death Star, and during perceived lack of progress on developing the second. In total, Lemelisk was killed and resurrected seven times—usually when one of the Imperial engineer's superweapon designs failed. Each time, Lemelisk died in agony, only to awaken in a fresh clone. His last words, when faced with a New Republic firing squad in 16 ABY, were \"At least make sure you do it right this time.\""}, {"tag": "p", "text": "The Hutt crime lord Durga Besadii Tai claimed to know transfer essence and implied that he'll use it on Lemelisk should he fail on the Darksaber. However, Lemelisk wasn't sure if this was true, or even if he was skilled at it to Palpatine's level, fearing that the result will be botched."}, {"tag": "p", "text": "Perhaps the most unusual examples of this technique in practice occurred in 18 BBY, and again in 12 ABY, when Jedi Knight Callista Ming made use of the power to transfer her soul into the mainframe of the Imperial battlestation Eye of Palpatine. She was able to \"inhabit\" the gunnery computer of the dreadnought for some three decades before swapping her essence with the willing Cray Mingla, although this came at the cost of her ability to use the light side of the Force."}, {"tag": "p", "text": "This incident differs from nearly all other reported examples of spirit transference in several ways. First, Callista was able to use this predominantly dark side ability, usually applied by powerful Sith Lords, to transfer her consciousness into an inanimate object, despite her commitment to the light side of the Force. Nor did she require alchemical apparatus or additional life energy. Second, rather than becoming a disembodied shade, Callista became part of the Eye's gunnery mainframe, acting more like a self-aware computer program than a manifest presence. Thirdly, once she transferred her spirit into the body of Jedi trainee Cray Mingla, she could only touch the dark side of the Force. This was unusual, since both Callista and Cray were Force-sensitive. Since she remained committed to the Jedi way (even going so far as to help Luke Skywalker train new Jedi at the Yavin IV academy), she was essentially cut off from the Force, unlike Sidious, Set Harth, or Exar Kun. As none of the Sith had any compunctions about using the dark side, this \"handicap\", if they possessed it, was essentially meaningless."}, {"tag": "p", "text": "The dark side entity Abeloth utilized an ability similar to transfer essence, whereby she took control of various people and made them avatar bodies for herself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars Roleplaying Game, this ability was represented by the skill Transfer Essence. Unlike the ability described above (such as in the example of Emperor Palpatine), the Transfer Essence skill required the player to make a conscious effort while still living and had a maximum range of 10 meters. Furthermore, a target who successfully resisted possession was forevermore immune to further attempts by that character. Activating the ability was extremely taxing, and if the first few attempts failed, the character's consciousness was dragged screaming into the yawning abyss of Chaos. Even if they successfully usurped control of another character, that character had a chance to reassert itself whenever the possessor called particularly heavily on the Force. The ability exemplified by Palpatine, however, had no range limit and functioned even if death caught Palpatine by surprise, as it did aboard the Eclipse."}, {"tag": "p", "text": "The object transfer version of the skill required that the player also have ranks in the Alchemy skill (the in-game representation of the dark art of Sith alchemy) and expend the life force of other willing beings in order to power the transfer (as with Exar Kun and the Massassi). To take ranks in either Transfer Essence or Alchemy, the player had to possess the Sith Sorcery feat, which allowed the player to call upon the spirits of long-dead Sith Lords to improve their offensive and defensive capabilities as well as their skill with the dark side of the Force. However, the ability lasted only for a short time, and each use allowed the Sith Lords a chance to escape their imprisonment in Chaos by possessing the player character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}