{"url": "Battle_of_Vanahame", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Battle of Vanahame"}, {"tag": "p", "text": "The Battle of Vanahame was a battle during the New Sith Wars which occurred on the planet Vanahame in 1032 BBY. Earlier, Sith Lord Odion had acquired the Helm of Ieldis, an ancient Sith artifact from the planet Skarpos. The Helm was capable of converting negative emotions like grief and angst into dark side energy that was capable of driving sentient beings into a homicidal frenzy, even through hyperspace. Following a successful test demonstration on Skarpos, Odion returned to the cloister—a planet-sized mega orphanage—on Vanahame where he intended to use the Helm to harness the emotions of the thousands orphans and unleash it on the entire Grumani sector."}, {"tag": "p", "text": "Odion's nihilistic bid for galactic domination drew opposition from the other Sith Lords in the Calimondra family who dispatched a combined fleet to stop him. Odion's plans were ultimately foiled when the captive Jedi Knight Kerra Holt successfully convinced his General Beld Yulan about the sanctity of life. While Odion was able to unleash the Helm on his Sith \"family\" and selected targets within the Grumani sector, Yulan switched back on the lights and freed the children from their bubble prisons. This immediately ended the Helm's homicidal frenzy and caused it to overload, killing Odion in the process. With the death of Odion, his Sith family including his estranged brother Daiman quickly invaded the Odionate and carved up his territories. Meanwhile, Kerra and Yulan freed the orphans on Vanahame. Yulan evacuated the orphans on Vanahame into Republic space while Kerra vowed to liberate their parents from the other Sith Lords."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following his successful demonstration of the Helm of Ieldis on Skarpos, Odion flew his warship Gravedigger to Vanahame, a moon which served as a transit base within the Odionate and a planet-sized mega orphanage known as a cloister. Due to Odion's hypersensitive Force powers and his abusive childhood, Odioon had imprisoned all the children in his realm within a series of cloisters where they would be indoctrinated into pliable workers and soldiers for his nihilistic cause. However, Odion now had new plans for his captives. Having witnessed how the Helm was able to convert his foe Jedi Knight Kerra Holt's grief into dark side energy which drove three entire armies on Skarpos into a homicidal frenzy, Odion now intended to utilize the negative emotions of his child captives and unleash them on the entire Grumani sector."}, {"tag": "p", "text": "For Odion, he was approaching his goal of galactic domination; one where he was the sole sentient being in the universe. Odion's Sith family—the powerful Calimondra family—ruled a series of fiefdoms within the sector. His estranged younger brother and fellow Sith Lord Daiman had witnessed the devastating effects of the Helm on Skarpos and had warned the family matriach Vilia Calimondra. In a rare moment of common purpose, the rival Sith Lords assembled their warships and set on a hyperspace course for Vanahame in an attempt to stop Odion from harnessing the full powers of the Helm. Despite their traditional animosity to each other, these Sith Lords realized the dangers of the Helm to the galaxy. In an attempt to reason with her grandson, Vilia tried to communicate with Odion by intercom but he ignored her. According to his own twisted nihilistic worldview, Odion had no family or friends but rather enemies would have to be killed so that he could end the pain of existence."}, {"tag": "p", "text": "Odion's Novitiates had installed a series of subspace links which would provide live feeds of the Helm's effects on locations within Odion's targeting range. His Claimer Beld Yulan asserted that Odion and his followers should be albe to see the Helm's effects elsewhere within his realm. Odion also had a captive Kerra bound to a frame where she would be forced to watch the killing and bloodshed wrought by the Helm being broadcast life. Odion attempted to goad Kerra by asking if she wanted to hear her parents' last words on the holorecorder but she declined, asking that she would rather see his enemies come for him."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "Heart of Darkness"}, {"tag": "p", "text": "At a signal, Odion ordered the staff manning the Cloister to switch off all the lights in the Cloister for the first time. The child captives lived a highly-regimented and spartan lifestyle within their bubble prisons in the cloister. Their entire lives functioned according to a daily circadian rhythm based on artificial light frequencies. Inmates had no contact with each other and were only able through the top of their bubble capsules. In that very hour, the children had just woken up from their daily sleep cycle and were having breakfast in anticipation for their morning holo-tutorial schedules. Among these children was the Duros Jeeree Kayl who had come to find his comfort zone in the monotonous daily schedule."}, {"tag": "p", "text": "Since the lights had never been switched off before, the sudden descent into pitch-black darkness plunged all the children into a state of panic and fear. Many of them started crying, creating the necessary surge of negative emotions like anguish and fear which were needed to power the Helm. While Odion and most of his Novitiates took pleasure in the children's plight, Kerra and his traditionally loyal second-in-command General Beld Yulan expressed disquiet and disgust. Yulan commented to Kerra that frightening the children was the worst form of torture devised by an adult mind."}, {"tag": "p", "text": "Odion taunted Kerra that she was missing out on \"joy\" by rejecting the Sith path. He also added that if she had known what was coming, she would have given into the dark side of the Force and accepted his nihilistic religion. However since she was still a lightsider, Kerra could only watch in captivity. Meanwhile, Kerra attempted to convince Yulan about the errors of serving the Sith and urged him to destroy the facility. When Yulan asked if she was willing to die to save people she did not even know, Kerra responded thast she wanted to live and also save the kids. Kerra succeeded in reasoning with Yulan by arguing that the only thing that separated droids from peoople was that people could accomplish something even in death. She succeeded in convincing him to save the children in the cloister to prevent a repeat of the tragedy that killed his beloved children."}, {"tag": "p", "text": "As Odion's Novitiates prepared for an apocalyptic end of the galaxy, Yulan managed to leave the chamber by feigning that he wanted to go down to the cloister to add his misery to the children. Yulan deceived Odion into believing that he wanted to die downstairs with the children so that he could add more energy to the Helm's powers. Odion had also planned to shut down the life support after harnessing the life energies of the people down there. Odion granted this request to reward Yulan for his devotion to his nihilistic ideology."}, {"tag": "h3", "text": "Unleashing Pandemonium"}, {"tag": "p", "text": "With the Helm of Ieldis fully charged up by the energies of Odion's child captives, Odion unleashed his powers during a ceremony. He began with a rousing statement of his beliefs before exhorting his Novitiates to \"end the pain\" by killing each other in a murderous frenzy. Meanwhile, Odion used the Helm to unleash a wave of homicidal killings throughout the Grumani sector with unknown numbers of sentients being killed or wounded in the ensuing anarchy. The Helm also had an effect on his Sith family's invasion fleet in hyperspace. Several warships began to fire on each other and Daiman was forced to fight off several maddened crew on his flagship with Force lightning."}, {"tag": "p", "text": "Kerra was able to escape her bonds and grabbed a red lightsaber, intending to kill Odion while he was seated on his throne. However, she was attacked by Wayman, who had earlier befriended her when she infiltrated the Odionate while pretending to be an enthusiastic Sith devotee. After she refused to yield to Odion, Wayman punched Kerra, causing her to drop her lightsaber. Odion expressed his sadistic enjoyment of the ongoing killings within the wider Grumani sector and his throne room on Vanahame."}, {"tag": "p", "text": "Meanwhile, Yulan entered the control room which controlled all the lights within the Cloister. The two men operating the lights were caught unaware, being more preoccupied with the screaming coming from the frightened children and the ensuing uproar occurring upstairs. When one of the operators tried to tell Yulan to leave, Yulan shot him in the head with a blaster pistol. He then confronted the remaining operator, a Human man named Murl, and ordered him to step away from the controls at gunpoint. Yulan quickly switched back on the lights which immediately ended the state of fear and panic among the cloister children."}, {"tag": "h3", "text": "Saving the Galaxy"}, {"tag": "p", "text": "Yulan's actions of restoring the lights in the cloister had an immediate impact on the Helm. Odion was about to unleash all the powers in the Helm on the entire galaxy which would bring the deaths of trillions of sentients, allowing him to reach his nihilistic goal of being the sole being existing in the universe. However, the Helm's powers suddenly stopped as the emotions within the cloister changed from despair to relief, ending the Force-induced murderous frenzy within seconds. Wayman was taken by surprise by his master's sudden shock and Kerra took the opportunity to impale him with her lightsaber, killing the Novitiate."}, {"tag": "p", "text": "By the time Odion had realized what had happened in the cloister, Yulan had by then thrown the other switch which released all the children from their bubble prisons. Immediately, the emotions within the Cloister changed from fear and misery to joy as the child captives celebrated their freedom. This sudden surge in positive emotions caused the Helm of Ieldis to overload, creating a firestorm which breached a hole in the sealed throne room and setting Odion alight. This Force-induced fire was created by a surge of life and happiness which proved too much for Odion to cope."}, {"tag": "p", "text": "As Odion was burning in flames, he begged Kerra to save his life by removing the Helm and taking him to Jubalene where his burns could be treated. He feared the arrival of his enemies and the collapse of the Odionate at the hands of his Sith rivals. Kerra however was unmoved by his parleying since he had tried to destroy everything that existed. She also mentioned that her parents' death meant something to her and added that his death would have also have a meaning for her. Out of desperation, Odion tried to save his life by mentioning that he could help her find her younger sibling if she only agreed to spare him."}, {"tag": "p", "text": "However, Kerra by then had come around to the view that all the children in the cloisters throughout the Odionate were her brothers and sisters. Due to the lack of records available, it was very had to find lost family members who had been processed into the cloister system. The sibling would have grown up not knowing the identity of its parents and his or her relationship to Kerra. Instead, Kerra refused to bargain with Odion and let him burn to death."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the death of Odion, Kerra was immediately rejoined in the throne room by Yulan, who had completely renounced his Sith ways. He was now surrounded by several small children who had come to adopt him as their de-facto father. Meanwhile, Odion's Sith relatives took advantage of the power vacuum within the Odionate to annex as much territory as they could. Due to the centralized nature of governance within the Odionate, the death of its titular leader meant that there was no successor who could fill this vacuum. Odion's estranged younger brother took the largest stake within the former Odionate, seeing an opportunity to expand his own empire."}, {"tag": "p", "text": "Following the events on Vanahame, Kerra and Yulan rescued as many orphans as they could from the cloisters they could reach. However, they were unable to reach all twelve of the planet-sized orphanages since the other Sith Lords had already annexed other parts of the former Odionate. Kerra and Yulan subsequently landed on an unknown terrestrial planet with green fields and hills where they had organized an airlift operation to evacuate the children to safety. While Kerra and Yulan were unable to reunite all the children with their parents, Yulan agreed to ferry the liberated children to the Galactic Republic. Meanwhile, Kerra agreed to free their parents and bring them to the Republic where they could be reunited."}, {"tag": "h2", "text": "Appearances"}]}