{"url": "Transportation_Ministry_data_breach", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Battles of Lothal", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Transportation Ministry data breach"}, {"tag": "p", "text": "Five years before the Battle of Yavin,[source?] a data breach occurred at the Transportation Ministry's headquarters on the planet Lothal's Capital City. This data breach was perpetrated by Merei Spanjaf, a slicer who was the girlfriend of Zare Leonis, an Imperial cadet and secret rebel sympathizer. Leonis was looking for his sister Dhara Leonis, a cadet at Lothal's Academy for Young Imperials, who had disappeared the previous year under suspicious circumstances. Due to their close friendship, Spanjaf agreed to help Leonis find his sister."}, {"tag": "p", "text": "Spanjaf had developed a computer program which allowed her to access the insecure top levels of the Empire's data network on Lothal. However, she was still unable to access any classified information on Dhara. At her school, the Vocational School for Institutional Security (V-SIS), Spanjaf met a classmate named Jix Hekyl who put her in touch with Yahenna Laxo, a crime boss who ran the Gray Syndicate, a local crime syndicate. Laxo agreed to supply Spanjaf with three snooper programs in exchange for employing her services as a courier. After learning from her father, Gandr Spanjaf, that government institutions were vulnerable to physical intrusions, she hatched a plan to infiltrate the Transportation Ministry's headquarters, which was a back door to the Imperial data network on Lothal."}, {"tag": "p", "text": "Disguised as a Phelarion School student, Merei entered the Transportation Ministry headquarters under the guise of doing fundraising activities. Feigning a toilet break, Merei planted the snoopers at various locations throughout the building. This data breach brought Merei closer to her goal of finding information about Dhara. With the aid of Zare and the rebel infiltrator Dev Morgan, Merei obtained an Imperial decoder, which allowed her to access Dhara Leonis' file. After creating a fake Imperial Security Bureau account, Merei discovered that Dhara had been forcibly inducted into a secret Imperial program known as Project Harvester."}, {"tag": "p", "text": "Despite Merei's best efforts, her data breach did not go unnoticed. While two of the snooper programs had deleted themselves, Imperial data security experts had managed to freeze the third snooper since it had been loaded onto a network terminal with a faulty chronometer. Merei's problems multiplied when she learned that her mother, Jessa, had been put in charge of the Imperial team charged with investigating the breach. With Jix's help, Merei attempted to elude the Imperial investigators by tampering with her school photo, attempting to delete her repeater service account, and framing the Gray Syndicate. Following the arrest of her friend Jix, Merei and her parents were forced to flee offworld into hiding with the help of Old Jho and the Spectres."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, Merei Spanjaf and Zare Leonis were recent migrants to the planet Lothal whose parents had come to take advantage of the new employment opportunities offered by the Galactic Empire. Merei and Zare were close friends at the Junior Academy of Applied Sciences in Lothal's Capital City where they played on the school's grav-ball team. However, their disillusionment grew after witnessing the Empire's increasingly exploitative policies towards Lothal and the massacre of farmers in the Westhills."}, {"tag": "p", "text": "Leonis' disillusionment reached a climax with the suspicious disappearance of his sister Dhara Leonis, a star cadet at the Academy for Young Imperials. Zare and his mother, Tepha Leonis, disbelieved the official Imperial claims that Dhara had run away, and suspected that the Empire was covering up her true fate. The following year, Zare embarked on a plan to infiltrate the Imperial Academy in order to learn the fate of his sister. In his investigation, he was supported by Merei, who was a skilled slicer and wanted to be an information-security expert."}, {"tag": "p", "text": "While studying at the Vocational School for Institutional Security, Merei spent her free time penetrating the Imperial data network on Lothal. Despite her slicing skills with the datapad, Merei was unable to penetrate the data network due to the increasingly stringent security measures. From a classmate named Jix Hekyl, Merei learned that she could use snoopers, programs that recorded information and transferred it to an outside source. With Hekyl's help, Merei got in contact with a criminal syndicate called the Gray Syndicate. The Syndicate's boss Yahenna Laxo agreed to supply her with three snoopers in return for her services as a courier. Knowing that her parents Gandr and Jessa Spanjaf were information security contractors working for the Empire, Merei kept her activities a secret from them."}, {"tag": "h2", "text": "The breach"}, {"tag": "h3", "text": "Going undercover"}, {"tag": "p", "text": "After learning from her parents that Imperial institutions on Lothal were vulnerable to physical intruders and that the Transportation Ministry's database was connected to the entire Imperial data network, Merei decided to infiltrate the Transportation Ministry's headquarters on Lothal and plant her snoopers there. To enter the building, Spanjaf decided to impersonate Kinera Tiree, a student at the prestigious Phelarion School who was the daughter of the education minister Fondana Tiree. Spanjaf would claim that she was visiting the Transportation Ministry to sell raffle tickets to raise funds for charity. To perpetuate this ruse, Merei bought three network drives, a book of flimsi receipts, and a second-hand T-shirt from Phelarion School."}, {"tag": "p", "text": "During a free period in her school day, Merei put her plan into motion and visited the Transportation Ministry. Posing as Kinera, Merei entered the reception and claimed that she was selling raffle tickets to raise funds for Clone Wars veterans. Using her \"mother's\" senior position in the Imperial bureaucracy, Merei convinced the receptionist to let her set up a stall in the cafeteria without needing an appointment or pass. After several minutes of \"waiting\" in the cafeteria, Merei headed to various locations throughout the building and planted the network drives containing her snoopers."}, {"tag": "p", "text": "She planted the first network drive on a sink in the men's bathroom. After heading to a break station and helping herself to a cup of caf, she planted her second drive on the industrial carpeting beside the counter. Merei then returned to the cafeteria, where she planted the third drive under a table before walking out of the room. Before she could leave the Transportation Ministry, she was greeted by a female civilian who bought a raffle ticket from her. The woman agreed to buy five tickets (amounting to a total of 15 credits) after learning that the winner would get a free vacation at Boranda followed by a full day at Old City Spa, a new datapad, and other trinkets. After selling more tickets to the woman's colleagues, Merei pocketed nearly 100 credits."}, {"tag": "h3", "text": "Stealing secrets"}, {"tag": "p", "text": "With the aid of the snoopers, Merei got the access codes of an Imperial personnel manager and a systems coordinator. The coordinator's access code enabled Merei to let the personnel manager create new IDs with full security clearance. Putting the next stage of her plan into action, Merei created a fake Imperial Security Bureau (ISB) inspector account with full access to the Imperial data network. Merei shared this news with her boyfriend Zare while visiting the Imperial Academy on Visiting Day. When Zare expressed concerns that she would get caught, Merei assured him that she had switched the snoopers off once she had used them. Once dormant, they were almost impossible to find and would erase themselves by the end of the week."}, {"tag": "p", "text": "Using her fake ISB inspector account, Merei was able to view more files, including those of Zare and her former classmate Beck Ollet, who had been arrested following an attack on an Imperial mining facility. However, when Merei tried to access Dhara's records, she found that she was unable to access the missing cadet's file without a ZX-5 access disk, a military-grade decoder. Merei overcame this predicament with the help of Zare and Dev Morgan, a rebel infiltrator at the Imperial Academy. Working together, Zare and Morgan stole the decoder from the Imperial Headquarters on Lothal. After using the decoder to intercept an Imperial convoy, Morgan's rebel comrades passed the decoder to Merei."}, {"tag": "p", "text": "Having procured the decoder, Merei was able to access Dhara's confidential special assessment file. She quickly learned that Dhara had been identified as Force-sensitive by the Grand Inquisitor, who enrolled her in Project Harvester. This secretive project was run from a secret installation connected to the Arkanis Academy. Merei relayed the news to Zare, who was elated to learn that his sister was still alive."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By breaching the Transportation Ministry's database, Merei helped Zare Leonis come closer to his goal of finding his sister Dhara. However, Merei's troubles were far from over. Despite Merei's best efforts, the data breach was noticed by the Imperial authorities, who contracted her mother, Jessa, to lead the investigation. While two of the snooper programs had deleted themselves, the third had been loaded into a network terminal with a faulty chronometer. As a result, the snooper's timer never went off, and Jessa's team was able to freeze it and preserve its code. This small piece of evidence enabled Jessa to begin tracing back to the source of the transmissions."}, {"tag": "p", "text": "To obstruct the Imperial investigation, Merei decided to change her profile photo and tried to delete her account at Bakiska's, her repeater service. To prevent the witness at the Transportation Ministry from recognizing her, Merei decided to switch her V-SIS photograph with that of another girl named Hestia Tarleton, a student at the Young Ladies' Seminary of Lothal Settlers. With the help of Jix, Merei changed her photo but was unable to delete her Bakiska's account. Merei's problems were further compounded by Laxo calling in her services as a courier in order to pay for the snoopers."}, {"tag": "p", "text": "Following a failed attempt by Merei and Jix to delete her Bakiska's account with a pulse-mag, Laxo decided to punish Merei by forcing her to lead a bounty hunter to apprehend Holshef, a fugitive she had befriended while working for the Gray Syndicate. Before Laxo could carry out his punishment, Merei contacted her mother and framed the Gray Syndicate as the culprits behind the Transportation Ministry data breach. She pretended to be a hostage of the Gray Syndicate, whom she claimed wanted the authorities to end their investigation into the breach. As a result, Laxo and the entire Syndicate were massacred during a raid by the Imperial authorities. While Merei temporarily escaped the authorities' attention, she was burdened by the guilt of causing the deaths of several innocents."}, {"tag": "p", "text": "Despite Merei's efforts to delete the Gray Syndicate's data using her pulse-mag, Merei was unable to escape Imperial justice. Following the arrest of Jix and Hestia, Merei realized that it was only a matter of time before the Imperial authorities identified her as the real culprit behind the Transportation Ministry's data breach. With the help of the Ithorian bartender Old Jho, Merei and her parents along with Leonis' family escaped offworld with the help of Dev Morgan's rebel cell. After rescuing Zare and Dhara from Arkanis, the Spanjafs and Leonises went into hiding on Garel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Transportation Ministry data breach first appeared as a secondary plot in Jason Fry's 2015 junior novel Servants of the Empire: Rebel in the Ranks, a companion piece to the Star Wars Rebels TV series. The data breach was told from the point of view of Merei Spanjaf, the second protagonist in the Servants of the Empire junior novel series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}