{"url": "Traps_and_Tribulations", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Traps and Tribulations"}, {"tag": "p", "text": "\"Traps and Tribulations\" is the fourteenth episode of the animated micro-series Star Wars: Forces of Destiny' second season. It was released on May 4, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Luke and Leia (with the aid of a lightsaber) help Kneesaa and Wicket stop a rampaging Gorax by resetting the Ewok's traps."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the Battle of Endor, Princess Leia Organa tells her brother Luke Skywalker that without the support of the Ewoks the ground battle would not have gone so well. The two are then joined by a distressed Wicket W. Warrick and Kneesaa, who tell them that they need help to reset their traps. Leia and Luke follow the Ewoks and encounter a giant Gorax."}, {"tag": "p", "text": "The Ewoks and rebels flee. The Gorax corners Luke and Leia at the edge of the forest, overlooking a swamp. Wicket and Kneesaa have reached the safety of the trunk trap, which turns out to be an improvised battering ram held together by thick ropes. Leia tells Luke they need to get the trap working. Luke tells his sister to help the Ewoks set up the trap while he serves as a distraction."}, {"tag": "p", "text": "After Leia leaves, Luke uses his green lightsaber to slice through a trunk that the Gorax hurls at him. Luke also uses his Force powers to run circles around the giant. Leia helps the Ewoks to cut through the ropes holding the trunk trap. Luke lures the Gorax towards the trunk. With Leia and the Ewoks having trouble cutting through the ropes, Luke lends Leia his lightsaber. After Leia cuts the rope, the giant trunk swings into the Gorax, throwing it into the swamp. The Ewoks cheer as Luke thanks Leia and retrieves his lightsaber."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}