{"url": "Trapper_(clone_trooper)", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Advanced Recon Force troopers", "Category:Members of the 212th Attack Battalion"], "nodes": [{"tag": "h1", "text": "Trapper  (clone trooper)"}, {"tag": "p", "text": "\"Trapper\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Trapper served alongside Jedi General Mace Windu,  Clone Commander CT-411 \"Ponds,\" and \"Hawkeye\" on Malastare where they encountered the Zillo Beast. Then, as a member of the 212th Recon Division, he joined Jedi General Obi-Wan Kenobi, Clone Commander CC-2224 \"Cody,\" \"Boil,\" and \"Waxer\" during the Second Battle of Geonosis."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Malastare"}, {"tag": "p", "text": "In 21 BBY[source?] Trapper served under Clone Commander \"Ponds\" at the Battle of Malastare. After a successful field test of an experimental superweapon called the electro-proton bomb, Trapper was part of a search party in the aftermath of the battle with Ponds, Jedi Master Mace Windu, and fellow clone trooper Hawkeye. They discovered the Zillo Beast, and Trapper escaped with Ponds and Windu after Hawkeye was killed."}, {"tag": "h3", "text": "Service on Geonosis"}, {"tag": "p", "text": "As part of the Republic's second offensive on Geonosis, Trapper served in the 212th Recon Division. Trapper was deployed alongside Jedi General Obi-Wan Kenobi, but as they made their way to Point Rain, their gunship was shot down. Trapper and Kenobi were the only survivors, and were rescued by troopers Boil and Waxer and eventually rejoined the fight."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trapper first appeared in the Star Wars: The Clone Wars episode \"The Zillo Beast,\" which aired on April 3 and April 9, 2010,  in the UK and USA respectively. Like all clone troopers in the series, he was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}