{"url": "Transport_714", "categories": ["Category:Legends articles", "Category:Multi-Troop Transports", "Category:Naboo vehicles", "Category:Trade Federation vehicles"], "nodes": [{"tag": "h1", "text": "Transport 714"}, {"tag": "p", "text": "Transport 714 was a Trade Federation Multi-Troop Transport used during the Invasion of Naboo. A STAP, in pursuit of an escaping speeder, crashed into the transport. The impact disabled the transport and caused it to sink into the Solleu River during the initial hours of the Invasion."}, {"tag": "p", "text": "A young colo claw fish, orphaned and starving, made many attempts to crack the hull of the MTT, breaking several of its teeth on the MTT's armor, and marring the craft considerably. The colo interrupted efforts to salvage the craft. Eventually, the craft was recovered by Gungan divers, repaired by the Naboo Resistance, and was retrofitted to accommodate human troops."}, {"tag": "p", "text": "During the Second Battle of Theed, the craft was used by the Naboo Resistance to transport several passengers undetected to the entrance of a secret passage in the cliff wall below Theed. There, Queen Amidala, Sabé, Captain Quarsh Panaka, Mett Habble, R2-D2, Qui-Gon Jinn, Obi-Wan Kenobi, Anakin Skywalker, and several RSF troops and pilots disembarked to begin secretly infiltrating the city in an attempt to capture Theed Royal Palace and the Neimoidian Viceroy Nute Gunray. Several Resistance members were left to guard the transport, to ensure its use as a fall back point and escapecraft in case the mission had gone awry."}, {"tag": "p", "text": "Shortly thereafter, the Gungan Grand Army had begun to divert the Trade Federation Droid Army away from the city. PDA-2 contacted the MTT, puzzled by its presence below the cliff after receiving reports of it sinking into the river. PDA-2 remote piloted the transport to a repair bay in the Royal Hangar. The Resistance members contacted Panaka to update the rendezvous point, then began assaulting the B1-Series battle droids inside the repair bay. They eventually unloaded to intercept Gode Takrab's counterfeit peace treaty. The battle was soon won, eliminating the need to utilize the craft for escape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Transport 714 is a recurring element in the roleplaying adventure, Peril on Naboo. This article based on the guided overview of the adventure, although the adventure allows for alternate paths. If the heroes don't escape Theed in a speeder along the Solleu River, an NPC will volunteer information about the MTT during the planning session with Amidala. The heroes may also fail to fool PDA-2, or may disable the craft instead of allowing it to be moved."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}