{"url": "Trauma/Legends", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Cleanup", "Category:Advanced Recon Force troopers", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Trauma"}, {"tag": "p", "text": "\"Trauma\" was the nickname of a ARF clone trooper commander in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, he fought alongside the Jedi Halsey and his Padawan Knox at the planet Devaron's Temple of Eedit. Although the Republic forces were holding their ground, the sudden appearance of Savage Opress immediately turned the tide of the battle: The Zabrak began slaughtering every ARF trooper who lay in his path. Trauma and the others including the Jedi were slaughtered by Opress causing the Republic defeat on Devaron."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Trauma was the nickname of a Clone trooper in the Grand Army of the Republic. At some point, Trauma became a Advanced Recon Force trooper and also became a clone trooper commander. Around 21 BBY .Trauma was deployed to defend the Temple of Eedit on Devaron .Unfortunately Trauma was in a republic Consular-class when it was shot down by droid artillery and were force to retreat back to the temple,along with his Advanced Recon Force troopers, Jedi Master Halsey and his Padawan, Knox. Trauma and the others were able to hold back the Separatist forces and held the upper hand in the battle. However, Sith Lord Count Dooku sent his new apprentice Savage Opress to finish the battle and destroy the Republic forces. Upon arriving on Devaron, Opress began mercilessly slaughtering all the ARF troopers. Trauma, witnessing this, ordered all his troops to charge at Opress. Opress simply rampaged through the clone ranks, butchering all who got in his way. Even though he was shot in the stomach, the magic from the Nightsisters saved him. Trauma was about to shoot Opress when he was uppercut by the Zabrak and was thrown behind him, killing him. Ultimately, the two Jedi were also killed by Opress, and the battle was lost by the Republic."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Trauma wielded a DC-15S and two DC-17 hand blasters. He wore ARF trooper gear, a pauldron, and a kama. His armor sported green and red markings. During the Battle at the Temple of Eedit, he appeared to have his DC-15S's fold-able stock unfolded at the rear of his gun."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}