{"url": "Trask_Ulgo", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:House Ulgo", "Category:Humans", "Category:Males", "Category:Republic Navy officers"], "nodes": [{"tag": "h1", "text": "Trask Ulgo"}, {"tag": "p", "text": "Trask Ulgo was a Human male who was born into the Alderaanian House Ulgo on the planet Alderaan. By the height of the Jedi Civil War between the Galactic Republic and the Sith Empire, he had attained the rank of ensign with the Republic Navy. During the year 3956 BBY, Ulgo was an officer stationed aboard the Hammerhead-class cruiser Endar Spire, where he was the bunkmate of the amnesiac former Sith Lord Revan. However, Ulgo believed that Revan was simply a new recruit, and since the two worked opposite shifts during normal duty, they did not interact with each other."}, {"tag": "p", "text": "That year, their vessel fell under attack from the Sith Empire over the planet Taris, due to the presence of the ship's Jedi commander, Bastila Shan. Shortly after the attack began, Ulgo enlisted Revan's aid in finding Shan both to help her escape and so that they could fight their way off the cruiser. After Ulgo and Revan battled through many Sith troopers and discovered that Shan had already evacuated the ship, they eventually came across a Sith Lord named Darth Bandon. Knowing that the Sith could kill both of them, Ulgo sacrificed himself by holding off Bandon so that Revan could escape the doomed warship. Ulgo's sacrifice allowed Revan to leave the ship in the last remaining escape pod along with a Republic officer named Carth Onasi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving the Republic"}, {"tag": "p", "text": "A Human male named Trask Ulgo was born into House Ulgo, an Alderaanian noble family that was embroiled in a rivalry with House Organa on the planet Alderaan. Eventually, Ulgo joined the Navy of the Galactic Republic and had attained the rank of ensign by the height of the Jedi Civil War, which was fought between the Republic and the Sith Empire, led by Darth Revan and Darth Malak, two Jedi–turned–Sith Lords. By 3956 BBY, Ulgo served as an officer aboard the Hammerhead-class cruiser Endar Spire. That year, he was assigned to the same quarters as a Republic recruit who was actually the amnesiac former Sith Lord Revan, although Ulgo was unaware of his bunkmate's identity. Ulgo and Revan worked opposite shifts while onboard the cruiser, and they did not have opportunities to interact with each other. During the time Revan and Ulgo were bunkmates, the Endar Spire was placed under the command of Bastila Shan, a Jedi whose skill in battle meditation was essential to the Republic's war effort."}, {"tag": "p", "text": "Under Shan's command, the Endar Spire was ambushed by a Sith fleet commanded by Darth Malak in space over the planet Taris. While the rest of the cruiser's crew and complement of Republic troops attempted to fend off the boarding parties of Sith troopers and Dark Jedi, Ulgo returned to his quarters within the ship's command module to obtain his bunkmate's aid in protecting Shan and escaping the ship. Before Ulgo arrived, Revan was roused into consciousness by the battle and the Endar Spire's shuddering as it was wracked by laser cannon fire from Sith interceptors. Ulgo explained the situation to Revan and stated that it was their duty to ensure that Shan evacuated the ship. After collecting Revan's gear, they fought their way toward the bridge through several groups of Sith forces in the ship's corridors, until they stumbled upon a short duel between a Jedi and a Dark Jedi. Although the Jedi was victorious, she was killed by an explosion shortly after defeating the Dark Jedi, leaving Ulgo and Revan to continue on to the bridge."}, {"tag": "p", "text": "The pair eventually arrived at the bridge and defeated the Sith troops holding the position, although they found that Shan had already evacuated and was headed to the ship's escape pods. Reasoning that the Sith would destroy the ship once Shan escaped, Ulgo decided that their only option was to flee to the planet as well. However, before Ulgo and Revan could make it to the pods located on the ship's starboard side, Ulgo heard a noise behind a door and opened it, revealing Malak's apprentice, Darth Bandon. Upon seeing the Sith, Ulgo realized that there was little chance that they could survive a battle with the double-bladed lightsaber-wielding Sith Lord. In order to save Revan, he charged into battle with Bandon and closed the door behind him to ensure that he could buy his comrade enough time to escape the ship. Bandon ultimately overcame and killed Ulgo, although Revan and another Republic officer named Carth Onasi used the last escape pod to evacuate the ship before it was destroyed."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Later that year, after having been retrained in the ways of the Force and sent out by the Jedi Council in search of the a Sith-controlled device known as the Star Forge, Revan encountered Darth Bandon once again, in the underwater Hrakert Station on the planet Manaan. Along with his companions, Revan bested Malak's apprentice and his two Dark Jedi followers in a duel, which resulted in the death of Ulgo's killer. Ultimately, Trask Ulgo's sacrifice on the Endar Spire allowed Revan to defeat Malak and the Sith Empire, which Revan had once controlled, as well as hold off invasion from another Sith Empire for almost three centuries."}, {"tag": "p", "text": "Ulgo's sacrifice in confronting Bandon was admired centuries after his death, and his family became quite powerful on his homeworld of Alderaan. Bouris Ulgo, the self-proclaimed King of Alderaan and head of House Ulgo during the Alderaan Civil War, revered Trask Ulgo greatly. Peema Ahuff, the curator of the Royal Museum of Alderaan, believed that Ulgo's sacrifice was an act of martyrdom and that he remained one of Alderaan's noblest sons. Ahuff also linked Ulgo's sacrifice to Revan's defeat of Malak."}, {"tag": "p", "text": "In 3643 BBY, Peema Ahuff acquired the preserved head of Darth Bandon from a smuggler with the intentions of presenting the head to Bouris Ulgo as a peace offering in order to improve relations between Ahuff's House Alde and the king."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During his time serving in the Republic Navy, Trask Ulgo was dedicated to the Republic cause and took his duty seriously. Due to his sense of duty, Ulgo was outraged by cowardice and disloyalty. Despite the fact that the odds were against the Republic forces on the Endar Spire, he still believed that he should locate and aid his Jedi commander rather than simply evacuate the ship. Ulgo also held the combat skills of both the Jedi and the Sith in high regard, believing that common soldiers would merely impede combat fought between Jedi and Sith. When he and Revan encountered Darth Bandon on the Endar Spire, Ulgo stayed behind to hold off the Sith and buy his companion the time necessary to escape the dying ship. Ulgo had fair skin, blond hair, and blue eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Trask Ulgo was trained in the use of various types of armor as well as in the use of melee weapons, blaster pistols, blaster rifles, and heavy weaponry. Ulgo also had knowledge of close-quarters combat tactics and the cortosis-weave design used in the Republic's melee weapons to make them resistant to lightsaber strikes. He had some training in first-aid and in overriding the security systems present in doors and storage containers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While on the Endar Spire, Trask Ulgo wore a standard suit of Republic armor and carried a blaster pistol. When the Sith forces attacked the ship, Ulgo also had access to a medpac and a vibroblade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trask Ulgo first appeared in Star Wars: Knights of the Old Republic, a 2003 video game produced by BioWare. While every other party member with understandable speech in the game has a credited voice actor, Ulgo's voice actor was not identified in the game's credits. Ulgo serves as the player's first party member, with much of his dialogue serving as a tutorial to show the player how to use game controls. After the Endar Spire portion of the game, he is removed from the party selection screen, with his portrait later being filled by Bastila Shan. If the player removes Ulgo's standard clothing in the equipment screen, his appearance will not change, although it will change normally if his clothing is replaced with a different set of armor."}, {"tag": "p", "text": "When the player confronts Darth Bandon later on in the game, the player may choose to accuse Bandon of killing Ulgo, although Bandon does not confirm that he killed Ulgo. Ulgo's death was ultimately confirmed in Darth Bandon's entry in the 2008 Knights of the Old Republic Campaign Guide, published for Wizards of the Coast's Star Wars Roleplaying Game. The Complete Star Wars Encyclopedia, also released in 2008, misidentified Ulgo as a corporal first class."}, {"tag": "p", "text": "In Knights of the Old Republic, the player could encounter Selven, a bounty hunter who killed all the members of the Ulgo family on Taris and who was rumored to have been hired by the Organa family. However, the game did not explicitly connect the Ulgo family to Trask Ulgo. In 2010, an article for Bouris Ulgo released through The Holonet, an online database with information relating to the Knights of the Old Republic MMORPG sequel, Star Wars: The Old Republic, hinted at the relationship between House Ulgo and Trask Ulgo in Aurebesh text that translated to \"for Trask.\" When Star Wars: The Old Republic was released in 2011, the relationship between House Ulgo and Trask Ulgo was confirmed in \"Payment Due,\" a bonus quest for members of the Smuggler class."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}