{"url": "Traut", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Traut"}, {"tag": "p", "text": "Traut was a Human male smuggler who worked with Platt Okeefe and Tru'eb Cholakk. He was in Platt's team that raided the Galactic Research Academy in order to find a safe heaven for smugglers. There, the group met two children Zak and Tash Arranda and a Shi'ido named Mammon Hoole. Together, they escaped from stormtroopers and reached the planet Dagobah. On Dagobah, they met The Children, the descendants of the late members of the science expedition. When Zak found a creature called Yoda, Traut and another smuggler were assigned to find Yoda. After a brief fight with the native spiders, Traut was wounded. He was taken by The Children, who were in fact cannibals. The Children cut Traut's arm and leg off and made a stew with it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Traut was married and carried a silver promise ring with him as a symbol of his marriage. Twelve months after the destruction of Alderaan, Traut, together with a few other smugglers, decided to establish a new base of operations to avoid Imperial entanglements and competition with other smugglers. As such they infiltrated the planet Koaan, home to the Galactic Research Academy, a huge repository of scouting data. There, they stole data on the planet Dagobah, not yet processed by the Academy's databases. However, they also picked up Mammon Hoole and his Arranda wards."}, {"tag": "p", "text": "Flying to Dagobah in Okeefe's Last Chance, the smugglers found the old scouting base and made contact with some locals known as \"The Children\". Okeefe's ship also sunk into the Dagobah swamp and so they were temporarily stranded on the planet until they could get it out. It was then that the Arranda's revealed there were being hunted by the infamous bounty hunter Boba Fett who had followed them to the planet. The smugglers split into several groups to hunt Fett, and Traut went with Zak Arranda and another smuggler. In the swamp they were attacked by Knobby white spiders. in the fight, Traut received a head wound and had to be returned to the Shelter by some of the Children."}, {"tag": "p", "text": "Traut was left alone with the Children while the other smugglers continued hunting. When they returned, they found the Children had amputated his arm, claiming it had been poisoned by the spiders and endangered the rest of his body. A hint of the truth was revealed when Zak found his promise ring in a serving of stew. By the time Platt Okeefe returned to the village, Traut's leg had also been amputated. Zak realized the Children were cannibalistic when Traut's finger floated to the top of another bowl of stew. This caused the Children to lock him up."}, {"tag": "p", "text": "However, he eventually managed to escape, and the smugglers fought off Boba Fett and were able to flee the planet. They took the Children with them, entrusting them to the Rebel Alliance to be rehabilitated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Traut's final fate is unresolved in Galaxy of Fear: The Hunger."}, {"tag": "h2", "text": "Appearances"}]}