{"url": "Trauger_gas", "categories": ["Category:Legends articles", "Category:Acids", "Category:Compounds", "Category:Culture of Socorro", "Category:Weaponized gases"], "nodes": [{"tag": "h1", "text": "Trauger gas"}, {"tag": "p", "text": "Trauger gas was a toxin created by the underground volcanic activity of Socorro. Extreme underground pressure resulted in steam vents of trauger gas on the planet's surface. Though uncommon in most open desert areas on Socorro, such vents were frequently seen in the planet's polar regions. In the wake of these expulsions of steam, the Trauger compound remained as an invisible and odorless gas. It consisted of four stages of matter, including plasma gas. Combined with water, this gas created a remarkably potent acid. Inhabitants of Socorro often kept maps of known trauger gas emissions, and even enclosed ships were warned to avoid these areas."}, {"tag": "p", "text": "In its gas form, trauger gas was capable of killing most living creatures within minutes. In addition to the physical damage caused by exposure to trauger gas, victims would often suffer nausea, vertigo, respiratory failure, convulsions, muscle impairment, blurred vision, or even cardiac arrest."}, {"tag": "p", "text": "In its acid form, trauger gas was even more harmful upon contact. Capable of liquefying the most resistant of metals, contact with a living being was known to cause severe nerve damage and usually resulted in the loss of any limb it came into contact with."}, {"tag": "p", "text": "Few were brave enough to attempt to collect this dangerous gas, but those who did earned top credits selling it to eager assassins. Under the best of circumstances, those who dealt with trauger gas for extended periods of time were plagued by respiratory problems and slight deformity."}, {"tag": "p", "text": "Trauger gas got its name from a bounty hunter named Trauger. While pursuing a bounty on Socorro, Trauger threatened to kill an Ibhaan'I woman if a member of the tribe would not lead him to his bounty. The woman's son, Oceke, agreed to aid Trauger if he would let his mother go. Instead, Oceke guided Trauger to a field of gas. The gas emissions killed the bounty hunter immediately. From then on, the Ibaan'I called the gas \"traugi'ha\"; Trauger gas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}