{"url": "Traval-Pacor_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire star systems", "Category:Mid Rim star systems", "Category:New Republic star systems", "Category:New Territories star systems", "Category:Star systems with shipyards"], "nodes": [{"tag": "h1", "text": "Traval-Pacor system"}, {"tag": "p", "text": "The Traval-Pacor system, also known as the Traval-Parcor System, lay in the Mid Rim's Pacor sector. By 1 BBY, it was the site of the Traval-Parcor System Institute of Technology, which was attended by the Ho'Din Yansan. The Galactic Empire used a shipyard in the system to produce Imperial-class Star Destroyers in 4 ABY. Eight years later, the New Republic triumphed over the Imperial Remnant in a battle fought within the system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Traval-Pacor system, also known as the Traval-Parcor System, was located in the Pacor sector, a part of the New Territories portion of the Mid Rim. It was linked by hyperlanes to the Baltizaar, Corthenia, and Iridonia systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Ho'Din former ecology student Yansan enrolled in the Traval-Parcor System Institute of Technology at some point by 1 BBY. Upon his graduation, Yansan went on to become an extremist starship saboteur."}, {"tag": "p", "text": "The Traval-Pacor system fell within the borders of the New Republic by 12 ABY. That year, it was the site of a confrontation between the naval forces of the Imperial Remnant and the New Republic, which resulted in a victory for the latter faction."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Traval-Pacor system housed the Traval-Parcor System Institute of Technology, which the extremist Yansan attended in order to learn all he could about technology and various devices. Shortly before the Battle of Endor in 4 ABY, the Traval-Pacor system was the site of a civilian-operated Class II shipyard. The output of the facility was limited to Imperial-class Star Destroyers used by the naval forces of the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Traval-Pacor system was first mentioned in Alliance Intelligence Reports, a 1995 sourcebook for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed it in grid square K-7. Although the system was referred to as the \"Traval-Parcor System\" in Alliance Intelligence Reports, The Essential Atlas introduced the name \"Traval-Pacor system,\" which saw continued usage in later sources."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}