{"url": "Tre_Sana", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Information brokers", "Category:Males", "Category:Spacers", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Tre Sana"}, {"tag": "p", "text": "Tre Sana was a Lethan Twi'lek male and a resident of the planet Kalimahr in the Tython system during the height of the Infinite Empire's reign; an empire that Sana and the rest of the system's residents were ignorant to. A criminal and a rogue, Sana was an outcast whose flesh had been manipulated by Je'daii Master Dam-Powl's alchemy to become an informant. Circa 25,793 BBY, Sana came into information revealing the plans of the Stargazers, to which he alerted the Je'daii and assisted them in finding and eliminating."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born within the Twi'lek community on the planet Kalimahr, the red-skinned Tre Sana was born with an additional lekku sprouting from the back of his head, making him something of a freak among his fellow Twi'leks. Shunned and harassed for his abnormal number of brain-tails, Sana became a criminal to survive, murdering his first sentient at the age of seventeen outside a bar. Gathering a sizable following over the next few years, Sana and his gang moved their operations to the planet of Shikaakwa where his big time operation became just another gang in the streets of the corrupt planet. There his empire was destroyed by the Nine Houses, but his life was spared because of a perceived usefulness in his spying abilities. Two of the houses hired him as a messenger in exchange for his life, ordering him to take messages which could not be written down or transmitted and deliver them in person. During this time he encountered the Cathar Je'daii Master Dam-Powl who performed an arcane form of alchemy on Sana's brain to make his mind impenetrable, even by a Je'daii, in order to keep him alive. In exchange for the alteration to his brain, Sana was promised fortunes and a new identity if he served as an occasional informant for the Je'daii Order."}, {"tag": "h3", "text": "Stargazer Uprising"}, {"tag": "p", "text": "Contacting Master Dam-Powl in 25,793 BBY in regards to whispers of a group calling themselves the Stargazers and their desires to leave the Tythan system, Sana met with Je'daii Ranger Lanoree Brock on Kalimahr and promised to assist her in the hunt for the leader of the group, her brother Dalien Brock. Taking her to see the corpulent socialite Kara in the city of Rhol Yan, Sana helped the Je'daii escape the apartment after stunning the obese woman and leaping out of her skyscraper to land on Brock's Peacemaker cruiser and heading for the planet Nox. While keeping himself closed off to her, Sana and Brock developed a mild camaraderie as the two braved the perils of Greenwood Station together in their search for the crime boss Maxhagan and the hidden labs of Pan Deep. When they gained entrance to the hidden labs underneath the city, Sana was injured when the pair were captured by Stargazers and brought before Dalien Brock. Leaving the pair for dead after completing the Gree technology being constructed there, Sana and Brock escaped to the surface to find the domed-city of Greenwood Station being destroyed by attacking forces from rival stations. Fleeing across the toxic wastes outside the city, Sana became dangerously ill after breathing the atmosphere and was confined to the Peacemaker during their journey to the planet Sunspot."}, {"tag": "p", "text": "Resting aboard the ship on Sunspot when Brock went out in search of her brother, Sana realized something was wrong when the Stargazer ship departed and Brock did not return from the mines she was searching. Taking the droid Ironholgs with him, they discovered Brock severely injured in the mines with a blaster hole in her chest from where her brother had shot her. Carrying her back to the ship, Brock was able to use her knowledge of Force alchemy using Alchemy of flesh to meld one of her experiments, a living piece of her own flesh, into the blaster wound and heal herself. Still recovering from exposure on Nox, Sana accompanied Brock to Tython as she attempted to catch up to her brother and the Stargazers. Chasing him into the Old City, the pair went in without any backup from the Je'daii, as a series of violent Force storms were plaguing the world. Avoiding traps set by the Je'daii at every turn, the pair was eventually ambushed by a Stargazer who fired a series of blaster shots at Brock. Screaming for her to get out of the way, Sana pushed Brock aside and took a blaster bolt to the neck, putting him into a coma. Brock left Sana in the tunnel for several hours as she hunted her brother, and after finding him and slaying him, returned to tend to Sana's wounds. Transporting him to the Temple of Science, Anil Kesh, Sana was tended to by healers with far superior skills to Brock's own."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}