{"url": "Trayus_Core", "categories": ["Category:Legends articles", "Category:Malachor V locations"], "nodes": [{"tag": "h1", "text": "Trayus Core"}, {"tag": "p", "text": "The Trayus Core was the innermost sanctum of the Sith Trayus Academy on Malachor V. The core was a claw-like altar—suspended above a massive geyser of dark side energy—stabilized by three bridges that connected to the rest of the Trayus Academy. It was created by the mysterious Sith Empire. The Trayus Core survived the Battle of Malachor V and remained unused until a later time. During the Jedi Civil War, Darth Revan used the Trayus Core on captured Jedi to test their spirit, if they last its powers of the Dark Side, they were killed, if they fell they became Dark Jedi and sent to Korriban."}, {"tag": "p", "text": "After the war the Trayus Academy had once again been abandoned, being guarded only by Revan's Sith Guards. When Kreia arrived on Malachor V, the guards left by Revan led her to the Trayus Core and made her fully embrace the power of the Dark Side, completing her fall to the Dark Side and transforming her into Darth Traya the Lord of Betrayal. Later, it was within the Trayus Core that Darth Nihilus and Darth Sion defeated and exiled their master, Darth Traya, seeking to take her power and rule the Sith themselves. After the deaths of Nihilus and Sion, however, the Jedi Exile Meetra Surik discovered Jedi Master Kreia, who once again wore the mantle of Darth Traya, meditating in the Trayus Core moments before their final battle in which Traya was killed."}, {"tag": "p", "text": "The Trayus Core emitted so much Force-based energies that it allowed Traya to center herself there, so much so that she was able to predict the fate of Surik's companions, except for that of Bao-Dur, HK-47 and T3-M4, even going so far as to reveal the eventual fate of the Republic itself. When the Mass Shadow Generator was reactivated, the Trayus Core collapsed into itself as Malachor V and the rest of the Academy was destroyed around it, dispersing the dark side energies contained within."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}