{"url": "Treason/Legends", "categories": ["Category:Legends articles", "Category:Stub", "Category:Articles needing additional sources", "Category:Crime"], "nodes": [{"tag": "h1", "text": "Treason"}, {"tag": "p", "text": "Treason was the crime of acting against a legitimately recognized government or an official of that government. The definition of treason varied based on the type of government. In an Imperial or dictatorial government, even merely speaking against the government or its policies could be considered treasonous behavior. Traitor was the formal term for an individual that had committed treason."}, {"tag": "p", "text": "Though some governments treated all treason equally, others made a distinction between it and high treason, very serious treason that was almost always punished by death, even in non-Imperial governments. Such treason typically involved a direct betrayal or attack on a state official. In addition, at least in the case of the Empire, the charge of high treason generally necessitates that the one charged with the crime ends up punished in person by the state official in question, due to the seriousness of the charge."}, {"tag": "p", "text": "In certain cases, a distinction was made between the crime of treason and that of sedition, the act of simply speaking against the established order, but not actually acting. In many cases, however, even simply speaking against the established government was described as \"treason.\""}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Under the Galactic Republic"}, {"tag": "p", "text": "As a group of Jedi Masters discussed the possible forcible removal of Supreme Chancellor Palpatine from office, Obi-Wan Kenobi stated that such an action was treason and Mace Windu replied that he wasn't afraid of words and that the real treason would be failure to act."}, {"tag": "p", "text": "When Obi-Wan Kenobi told Anakin Skywalker that the Jedi High Council agreed to his appointment as Palpatine's personal representative because they wanted him to spy on him, Skywalker described such an action as both a violation of the Jedi Code and treason, but Kenobi said it was not treason and might be the only way to save the Galactic Republic."}, {"tag": "p", "text": "Later, Palpatine told Skywalker he was concerned the Jedi Order was plotting treason against him and to overthrow the government. Then, when trying to convince him to join the dark side of the Force, he told him \"Turn your back on treason.\""}, {"tag": "p", "text": "When the Jedi arrived to arrest him, he declared \"It's treason, then,\" before engaging them in a lightsaber duel. Palpatine, while attempting to attack Mace Windu with Force lightning, then tried to claim that the Jedi Master was a traitor to the then-recently arrived Skywalker, while Windu likewise shot back that the Supreme Chancellor was in fact the actual traitor."}, {"tag": "p", "text": "In 20 BBY, several members of the Jedi High Council believed that Padawan Ahsoka Tano had committed sedition against the Republic due to her being implicated in a terrorist bombing of the Jedi Temple, as well as the murder of several clones in an escape from the military base she was being held in, and expelled the young Togruta from the Jedi Order so she could be tried at a Republic military court. She very nearly avoided a conviction and possible death sentence before the real perpetrator was revealed. All charges against Tano, including sedition, were dropped, but the Council's lack of faith in her shook Tano to the core, and she left the Temple after refusing reinstatement."}, {"tag": "h3", "text": "Under the Galactic Empire"}, {"tag": "p", "text": "Although not always directly referred to as such, the Galactic Empire considered the very existence of the Rebel Alliance treason against it and vigorously pursued anyone involved with it as traitors."}, {"tag": "p", "text": "In addition, the Senate, due to holding Senators sympathetic to the Rebel Alliance and/or possessing anti-Imperial sentiments was noted to have been \"dangerously close\" to treason via their puffery."}, {"tag": "p", "text": "Raygar was an archaeologist who accidentally fired at Galactic Emperor Palpatine's personal shuttle. The unusual step was taken of charging him with high treason, of which he was convicted. Palpatine then carried out his punishment personally."}, {"tag": "p", "text": "Journalists were often targeted by the Galactic Empire for committing treason for writing articles unfavorable to the Empire or its policies. Some of these later became members of the Erased. The penalty for treason under the Empire was often death."}, {"tag": "p", "text": "In 5 ABY, following the formation of the New Republic, Sate Pestage attempted to defect from the Galactic Empire and became wanted by them for high treason. He was assassinated for his treason."}, {"tag": "h3", "text": "Under the New Republic"}, {"tag": "p", "text": "In 9 ABY, Admiral Gial Ackbar, commander of the New Republic Defense Fleet was arrested and charged with treason against the New Republic. However, this ultimately turned out to be a machination of Grand Admiral Thrawn of the Galactic Empire."}, {"tag": "p", "text": "Following the end of the Yuuzhan Vong War in 29 ABY, members of the Peace Brigade, a force of galactic citizens that collaborated with the Yuuzhan Vong invaders, were arrested and charged with crimes of treason and war crimes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Much of the speech prosecuted by the Galactic Empire as \"treason\" is, in fact, what is traditionally considered by real-life courts as \"sedition.\" The term \"sedition\" does appear with the Expanded Universe and the Galactic Empire, in fact, has a branch named Sedition, but the term appears far less frequently than \"treason.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External link"}]}