{"url": "Tredway", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Tredway"}, {"tag": "p", "text": "Tredway was the wife of the Jedi Knight Axton Tredway. They had two children together, Erling and Dena. During the Great Jedi Purge, Axton was hunted down and killed by Darth Vader. Despite her husband's death, she continued on, rejuvenating her family's mining operation on 24 Tredway"}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Following her husband's death, Tredway allied her business with the Galactic Empire. Despite their role in the death of Axton, she had children and a mining business to protect and could not afford to oppose the Imperials. Thanks to her efforts the Tredways became very wealthy and the mining business prospered. However, unknown to her, her children began allying themselves with rebel groups against the Empire. Her daughter Dena began secretly working with Rebel Alliance leader Mon Mothma and her son Erling organized a peaceful resistance to the Empire throughout the Sil'Lume asteroid belt."}, {"tag": "p", "text": "Concerned for the safety of the business and the jeopardizing of her Imperial contracts, she threatened to disown Erling if he would not disband his peaceful resistance movement. However, Erling refused, and in 0 ABY, Erling was arrested for treason by Governor-General Sebastian Parnell. No longer satisfied to put up with the Tredway family and their history of rebellion against the Empire, Parnell ordered a massacre of 24 Tredway. Tredway and her entire staff were executed by the Imperials and then stacked neatly in a pile in her office, a threat to any others who would dare oppose the Empire."}, {"tag": "p", "text": "A short time later, Luke Skywalker and his companions, Gideon Smith and Sidney Shortfang landed on 24 Tredway to investigate the aftermath of the massacre. After searching Tredway's offices, they discovered the Imperial slaughter. Gideon Smith identified the bodies as Tredway and her staff, and the Rebels quickly left. Sometime later, Skywalker and his allies were able to rescue Dena and Erling from the Imperials, ensuring that Tredway's children would survive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tredway was created by Troy Denning and appeared in one of the role-playing strands of the 1990 West End Games role-playing supplement Jedi's Honor. Although it is possible to read through the adventure without discovering Tredway's death, if the reader does not discover her death before going to Tol Ado to rescue Erling, their rescue mission will be a failure, as Erling will refuse to go with them. However, if they have discovered her death, Erling will be filled with a desire for revenge and agree to escape with the Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}