{"url": "Treat_Williams", "categories": ["Category:Pages needing citation", "Category:Cite web date argument usages with incorrect date formats", "Category:Real-world articles", "Category:People stubs", "Category:Star Wars: Episode V The Empire Strikes Back actors"], "nodes": [{"tag": "h1", "text": "Treat Williams"}, {"tag": "p", "text": "Richard Treat Williams is an American screen actor who has starred in such feature films as Deep Rising (1998), Dead Heat (1988), Flashpoint (1984), Prince of the City (1981), and Hair (1979), and such television series as Heartland (2007) and Everwood (2002–2006). Born in Rowayton, Connecticut, on December 1, 1951, Williams graduated from Kent School, the same preparatory high school as fellow actors Ted Danson and Seth MacFarlane, and film director Peter Farrelly. In his career Williams has been nominated for two Screen Actors Guild Awards, one Emmy Award, and three Golden Globe Awards."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Empire Strikes Back"}, {"tag": "p", "text": "Treat Williams visited the exclusive set at England's Elstree Studios during the 1979 filming of Star Wars: Episode V The Empire Strikes Back, to visit actress Carrie Fisher (Princess Leia Organa), according to the now-defunct StarWars.com Hyperspace feature \"Photoreceptor.\" According to actor John Morton (Dak Ralter), Williams, who was in London at the time, decided that it would be fun to appear in the film as an extra, and did so with the blessing of the film's production staff. Donning the tan fatigues of a Rebel soldier, Williams appears in the film at some point during the interior Echo Base scenes on Hoth, according to Morton. During his stay on the set, Williams befriended actor Harrison Ford (Han Solo) and posed for photographs with Fisher. Williams was uncredited for his role in the film."}, {"tag": "p", "text": "Following Williams' appearance in The Empire Strikes Back, the online Star Wars fan community has made efforts to pinpoint the actor's exact role in the film. Dating back to at least 2003, fans, particularly among autograph collectors, have linked Williams to several characters from the film whose names were established canonically through Decipher, Inc.'s Star Wars Customizable Card Game, including Jess Allashane, Jerrol Blendin, and Jeroen Webb. However, neither of the aforementioned characters were portrayed by Williams."}, {"tag": "p", "text": "Norwegian author and television personality Arve Juritzen, who appeared in The Empire Strikes Back as an extra to portray a Hoth Rebel soldier during the Battle of Hoth, has previously autographed the Jess Allashane SWCCG card for fans, suggesting that he, in fact, portrayed the Allashane character. In any event all external Hoth scenes, including the Battle of Hoth, were filmed in Finse, Norway, concluding on March 11, 1979, whereas filming at Elstree Studios in England, where Williams visited the set, did not begin until March 13, after the Norway shots were completed. Moreover, the extras assigned to play Hoth Rebel soldiers during the battle were all Norwegian locals. Given that Allashane is depicted as appearing during the external Hoth scenes filmed in Norway, this character would not correspond to Williams. Meanwhile, the Jerrol Blendin character, a Cloud City Wing Guard, was portrayed by stuntman Jim Dowdall, while the character Jeroen Webb, an Echo Base Rebel officer, was played by British actor Norwich Duff."}, {"tag": "p", "text": "Very few official Lucasfilm products have addressed the matter of Williams' presence on The Empire Strikes Back set, and none have definitively stated that the actor actually appeared in the film. To date, only the now-defunct StarWars.com Hyperspace feature \"Photoreceptor\" (2004) and the 2010 behind-the-scenes book The Making of The Empire Strikes Back, written by author Jonathan W. Rinzler, have officially released black-and-white photographs of Williams, dressed as a Rebel soldier, posing with Carrie Fisher on the Echo Base set, with accompanying captions confirming Williams' identity."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}