{"url": "Treek", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Alliance individuals", "Category:Ewoks", "Category:Females", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Treek"}, {"tag": "p", "text": "Treek was a female Ewok mercenary who managed to leave her homeworld of Endor by commandeering a starship whose crash-landing she had witnessed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Treek was from the Forest Moon of Endor, homeworld to her kind, the Ewoks. Her chief had told Treek to stay in their village where she would cook and raise children like the other Ewok women but instead she became an adventurer journeying across her world."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The female Ewok found her companion to be a good leader and, her travels to exciting planets and destruction of their enemies to be a good life. Treek considered herself highly attractive by her kind's standards, claiming that the men would endlessly try to gain her favor although she wanted none of it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Treek is listed as the newest player's companion in the MMORPG Star Wars: The Old Republic as of Game Update 2.3 and can be acquired by players of both factions. If Treek is a Republic player's companion, she will tell the player, during conversations, about her soft and more benevolent story whereas if she is an Imperial player's companion, she will tell about a more brutal and dark past."}, {"tag": "h3", "text": "Empire"}, {"tag": "p", "text": "On her travels across Endor, she saw wonders such as the Blurrg's Isle, the Desert of Salma and Lake Greetac and she also claimed to hunt mighty beasts. In the Sagreb Swamps, Treek fought and defeated single-handedly a whole tribe of Duloks who had accused her of trespassing, later claiming their ears for her necklace."}, {"tag": "h2", "text": "Appearances"}]}