{"url": "Treibeiu", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Almas residents", "Category:Females", "Category:Humans", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Treibeiu"}, {"tag": "p", "text": "Treibeiu was a Human female Jedi Knight who served the Jedi Order during the Clone Wars. Treibeiu was stationed at the Almas Academy, a Jedi academy located on the planet Almas, and, in about 20 BBY, in the aftermath of an incursion made by the Chevin slaver Phylus Mon into a Sith fortress situated on Almas, Treibeiu discovered the dismembered corpses of three Jedi whom Mon had slain. Treibeiu subsequently helped to oversee a search effort to locate the missing Jedi Constanten, Valiri, and Vorlocca, and she briefed a band of freelance agents who had been assigned to look for the Jedi inside the fortress."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Treibeiu was a Force-sensitive Human female who served the Jedi Order during the latter years of the Galactic Republic. Treibeiu attained the rank of Jedi Knight, and, amid the strife of the Clone Wars, she was stationed at the Almas Academy, a Jedi training facility situated on the planet Almas in the Cularin system. Circa 20 BBY, the Chevin slaver Phylus Mon and a band of his affiliates made an incursion into a Sith fortress located on Almas. Mon and his minions attacked and defeated a band of Jedi who were standing guard next to the fortress, and roughly two and a half hours after the confrontation, Treibeiu ventured to the north entrance of the fortress and stumbled across the dismembered bodies of the Jedi Tresten Agai'i, K'kur, and Milak Sonloam, who had been killed in the confrontation. Treibeiu and several other Jedi quickly put up a tent over the corpses, and they used the camp as a base from which to monitor the area surrounding the fortress while they investigated the raid on the citadel."}, {"tag": "p", "text": "The Jedi Constanten, Valiri, and Vorlocca were reported absent in the aftermath of the attack, and the Almas Academy dispatched several rescue teams to look for the missing Jedi inside the fortress. Treibeiu remained on site next to the fortress to assist with coordinating the search effort. As she waited, a violent sandstorm erupted. When the Heroes of Cularin, a band of freelance agents who had been hired to assist with the investigation, landed in a shuttle near to the fortress entrance, Treibeiu approached the vessel and hammered on the hull until the agents let her in. She then introduced herself and informed them that she was there to escort them to the fortress. Using the Force to clear a path through the sandstorm, Treibeiu led the agents to the tent next to the fortress entrance. When they arrived there, she used the Force to project an illusion to show the agents the dismembered bodies that she had found at the site to aid them with their mission. Treibeiu then answered several questions from the freelancers regarding their mission, and she provided them with a map of the portion of the fortress that they had been allocated to search. The agents subsequently entered the fortress."}, {"tag": "p", "text": "Several hours later, Treibeiu came back on watch to stand guard outside the fortress once more, and she received orders that the agents were to be retrieved and returned to the Almas Academy as soon as possible. The agents emerged from the Sith citadel shortly thereafter, and Treibeiu arranged for them to be transported back to the Academy aboard a shuttle."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Treibeiu had a rough, hard-featured face and a high-pitched, pleasant-sounding voice that stood in contrast to her gritty physical appearance. She had a serious demeanor and resolutely served the Jedi Order. When dealing with others during her role as a Jedi, she was quick to get down to business."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As one of the most skilled illusionists based at the Almas Academy, Treibeiu possessed the ability to project images into the minds of others. She was also able to use the Force to temporarily hold back sandstorms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Treibeiu made her first and only appearance in Star Wars canon in A Mon Alone, a 2004 roleplaying adventure written by Morrie Mullins that forms part of the Living Force campaign. During the adventure, the player-characters roleplay as the Heroes of Cularin, and they have the opportunity to interact with Treibeiu and to ask her various questions regarding their mission into the Sith fortress."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}