{"url": "Tree_of_wisdom", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hapes Consortium", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Tree of wisdom"}, {"tag": "p", "text": "The trees of wisdom, or Selab trees, were small trees native to Selab, a planet in the isolated Hapes Cluster. Eating the fruit of wisdom trees bestowed increased intelligence on elderly beings; however, some individuals believed the trees to be only a myth. In 8 ABY, Leia Organa was presented with a tree of wisdom as a gift from the Hapes Consortium, part of an attempt to entice her to marry Prince Isolder and become the next Queen Mother of the Cluster. She demurred, although the contact led to the opening of the Hapan borders. The Consortium later gifted a tree of wisdom to the Pesktda Xenobotanical Garden on Garqi, but it was burnt down during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The trees of wisdom, or Selab trees, were a species of small, gnarled tree native to Selab. They gave off a nutty scent, and produced fruit with a brown, ruddy peel. Eating the fruit could greatly increase the intelligence of elderly people."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The trees of wisdom grew on Selab, a planet in the Interior Region of the Hapes Cluster. However, with the isolationist Hapes Cluster closing its borders to the galaxy in 3100 BBY, many individuals came to regard the trees of wisdom as only a legend. This was disproved in 8 ABY when a tree of wisdom was included in the gifts presented to Chief of State Leia Organa as an incentive for her to marry Isolder, the son of the Hapan Queen Mother Ta'a Chume. The tree was accompanied by twin, floating lights, which regulated its day/night cycle. Organa stored the tree, along with the other Hapan gifts, in her room, but ultimately chose to marry former smuggler Han Solo instead of Isolder."}, {"tag": "p", "text": "Following that incident, the Hapan Cluster slowly reopened its borders. They eventually gifted a stunted tree of wisdom to the Pesktda Xenobotanical Garden on the planet Garqi. The garden included several other exotic botanical specimens, including a grove of bafforr trees from Ithor. In 25 ABY, during the Yuuzhan Vong War, it was discovered that the Vonduun crab armor worn by the extra-galactic invaders, the Yuuzhan Vong, was allergic to bafforr pollen. In order to hide such a militarily significant discovery from the Yuuzhan Vong, the Garqi Resistance burned the entire Xenobotanical Garden, including the tree of wisdom."}, {"tag": "p", "text": "Later that same year, Organa visited the Hapes Cluster hoping to enlist the Hapans' aid in the war against the Yuuzhan Vong. While addressing an assembly of Hapan representatives, she recalled their earlier gifts, specifically referring to her tree of wisdom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dave Wolverton created the trees of wisdom for his novel The Courtship of Princess Leia, published by Bantam Spectra in 1994. While it was unclear in the book whether the tree's fruit was able to boost intelligence, an entry in the Star Wars Encyclopedia in 1998 confirmed it. James Luceno referenced the tree in his novel The New Jedi Order: Agents of Chaos II: Jedi Eclipse, published by Del Rey in 2000. The trees were again mentioned in Geonosis and the Outer Rim Worlds, published by Wizards of the Coast in 2004. The Courtship of Princess Leia and Agents of Chaos II: Jedi Eclipse referred interchangeably to the tree as a \"tree of wisdom\" and a \"wisdom tree,\" while Star Wars Encyclopedia and The Complete Star Wars Encyclopedia, published in 2008, only used the former name. Geonosis and the Outer Rim Worlds referred to it as a \"wisdom-tree.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}