{"url": "Battle_of_Yavin", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Battles of the Galactic Civil War", "Category:Battles of Yavin"], "nodes": [{"tag": "h1", "text": "Battle of Yavin"}, {"tag": "p", "text": "The Battle of Yavin, also known as the Battle of the Death Star, the assault on the Death Star, the attack on the Death Star, or the Miracle of Yavin, was a major battle of the Galactic Civil War that led to the destruction of the first Death Star. It was a crippling blow to the Empire and one of the Rebel Alliance's first major victories."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Scarif, Jyn Erso managed to steal detailed plans and design specifications for the Imperial battle station known as the Death Star and transmit them to the Alliance Fleet above; these plans soon made their way to Princess Leia Organa. Imperial forces under the command of Darth Vader soon captured Princess Leia and the crew of the Tantive IV."}, {"tag": "p", "text": "Princess Leia was taken prisoner aboard the Death Star by Darth Vader. The Princess was rescued from captivity by an unlikely alliance of the smuggler Han Solo, Jedi Master Obi-Wan Kenobi, a young farmboy from Tatooine named Luke Skywalker, and Solo's First Mate, the Wookiee named Chewbacca. The group, which also included Rebel Alliance droids R2-D2 and C-3PO, in possession of the Death Star plans, fled to the Rebel base on Yavin 4—closely pursued by the battle station."}, {"tag": "p", "text": "Before Organa arrived, Mon Mothma was evacuated aboard a shuttle, as General Dodonna considered her the core of the rebellion. During her time away, she composed a contingency plan: surrender to Emperor Palpatine."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "An analysis of the plans identified a weakness in the battle station, placed there by Imperial scientist Galen Erso: a small thermal exhaust port leading to the main reactor. A proton torpedo fired into the port would cause a chain reaction that would destroy the battle station."}, {"tag": "p", "text": "General Jan Dodonna briefed the rebel pilots on the plan. The Death Star's defenses were designed for a direct, large-scale assault. By using small, one-man starfighters, the Rebels would slip through the Death Star's main defenses, maneuver down a narrow trench leading to the exhaust port, and fire proton torpedoes into the exhaust port."}, {"tag": "p", "text": "With the Death Star approaching, Y-wings from Gold Squadron and X-wings from Red Squadron and Green Squadron were dispatched to carry out the attack plan. A total of 30 ships were deployed in the assault on the Death Star: 8 Y-wings from Gold Squadron as well as 22 X-wings, 12 from Red Squadron and the rest from Green Squadron. The starfighters weaved through the turret emplacements, destroying many as they passed. Red Six (Jek Tono Porkins) was the first to be destroyed in the volley of turret fire. The deployment of Imperial TIE fighters, including one piloted by Lieutenant Iden Versio, devastated the Rebel attackers, destroying them far faster and more efficiently than the station's weapon emplacements had been able to. Red Four (John D. Branon) was the first to be shot down by the incoming TIEs."}, {"tag": "p", "text": "During the battle, Rebels in the temple, including pilots who were left behind watched the battle from the command center, along with Fighter Boss Nera Kase. She tallied the Rebel starfighter losses as they occurred during the battle."}, {"tag": "p", "text": "Some time into the battle, Imperial officer Jude Edivon aboard the Death Star identified the threat of the Rebels' attack strategy, and attempted to warn her superiors of the danger. However, Grand Moff Wilhuff Tarkin ignored the warning and refused to evacuate. Meanwhile, Darth Vader himself decided to lead a squadron of TIE fighters to destroy the remaining Rebel fighters. This would be the only Imperial squadron launched during the battle."}, {"tag": "p", "text": "The first attack run was performed by a trio of Y-wings from Gold Squadron. The three Y-wings, led by Gold Leader Jon Vander with Gold Two Dex Tiree and Gold Five Davish Krail escorting, attempted to make a shot on the exhaust port but were shot down by Darth Vader. A second trench run was performed by a trio of X-wings from Red Squadron flown by Red Leader Garven Dreis, Red Ten Theron Nett, and Red Twelve Puck Naeco. Darth Vader picked off Nett and Naeco, but Dreis was able to fire off a shot at the exhaust port. However, his proton torpedoes missed their mark, only scratching the surface. Before being shot down by Darth Vader, Dreis ordered another attack run."}, {"tag": "p", "text": "Following the final command of Red Leader, Red Five Luke Skywalker led the final attempt with Red Two Wedge Antilles and Red Three, Luke's old friend Biggs Darklighter, as wingmen. Rushing down the trench at full throttle, they found themselves being tailed by Darth Vader and his fighters."}, {"tag": "p", "text": "Vader personally damaged Antilles' fighter, forcing him to disengage, and destroyed Darklighter's X-wing, forcing Skywalker to attempt the shot on his own. In this dire moment the Rebel leaders were concerned when the young pilot deactivated his targeting system for the attempt, but Skywalker assured them that nothing was wrong; he was advised by the spirit of Kenobi to rely on the Force instead for his attack. For his part, Vader sensed this power himself and found firing on the fighter unusually difficult, with his single hit only putting R2-D2, who was serving as the fighter's astromech droid, out of commission. When Vader prepared to finally shoot down the enemy, one of his wingmen was suddenly shot down from above beside him. The source of that attack was the Millennium Falcon diving out of the nearby star's light. Han Solo and Chewbacca, believed to have abandoned the Rebels prior to the assault, unexpectedly returned to assist Skywalker in his most desperate moment."}, {"tag": "p", "text": "Momentarily distracted by the intervention, Vader's remaining wingman collided with his ship, and both spiraled out of control. The TIE fighter pilot flew into the side of the trench and knocked Vader away from the Death Star, and this allowed Skywalker to fire his shot. With the aid of the Force, the torpedoes shot along the trench and entered the shaft perfectly, as the two surviving X-wings, the lone surviving Y-wing and the aging freighter made for Yavin 4. The surviving rebel pilots included Skywalker, Antilles and Gold Three Evaan Verlaine. On the Overbridge, unaware of his impending doom, Grand Moff Tarkin continued to examine the battle as the technicians counted down the moments until firing commenced. Mere seconds before the superlaser could obliterate the moon, the torpedoes struck the reactor and the station exploded, killing all aboard and saving Yavin 4."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Skywalker, Solo, and the surviving Rebel fighters returned to Yavin, where they held a celebration ceremony and awarded the pair with medals for their achievement in saving the Rebellion."}, {"tag": "p", "text": "Mothma, having heard of the victory, permanently discarded her contingency plan to surrender to Palpatine."}, {"tag": "p", "text": "Nal Hutta Kal'tamok reported that the Grand Hutt Council knew of the Alliance's victory."}, {"tag": "p", "text": "Darth Vader, one of the few Imperial survivors of the battle, was recovered in his damaged TIE Advanced x1 by Imperial pilots Ciena Ree and Berisse Sai."}, {"tag": "p", "text": "Iden Versio, who was outside of the Death Star's explosion, managed to pilot her damaged TIE Fighter to Yavin IV, where she ejected before it crashed into the jungle. There, she patched her wounds and stole a transport from the Rebel Base during the festivities."}, {"tag": "p", "text": "Nearly all blame on the defeat was placed on Tarkin and his overconfidence. He had assumed that the station would not need an escort, and had launched no TIEs. The only group had been the single squadron Vader had launched on his own authority. Regardless, Tarkin was no longer alive to defend himself, and the Empire would never engage the rebels without exploiting their larger numbers compared to their opponent again. The destruction of the Death Star was a major blow to the Empire and represented the threat that was the Alliance to Restore the Republic."}, {"tag": "p", "text": "Cassio Tagge was given the rank of Grand General, as the Emperor had taken note of his argument against using the Death Star as the sole weapon of the Empire, and his awareness of the degree of the rebel threat. Vader was chastised and personally reminded by the Emperor about how he alone was alive to bear the blame of the destruction and failure of the Death Star. He was then ordered to act upon the will of Tagge."}, {"tag": "p", "text": "Thane Kyrell and the other Imperials stationed at the abandoned Rebel base on Dantooine during the battle were cut off from communication with Coruscant after the Death Star was destroyed. Unconfirmed rumors spread through the ranks that the new weapon was gone. Early on, these rumors were dismissed as an Imperial trap to lure the Rebels out of hiding."}, {"tag": "p", "text": "The destruction of the Death Star caused chaos within the Imperial ranks, leading to deliberate oversights on internal investigations and the rapid promotion of many young officers and lieutenants such as Ciena Ree to replace the higher-ranked officers killed on the Death Star. Additionally, according to Everi Chalis, the destruction of the Death Star convinced Palpatine that \"incompetence at the highest ranks was to blame for the destruction of his Death Star, and from there began a culling.\" Among the officers killed during the culling were Moff Coovern and Minister Khemt; other, less public deaths also occurred, while Chalis was exiled to Haidoral Prime. Darth Vader carried out at least some of the killing personally."}, {"tag": "p", "text": "Shortly after the battle, the Rebels were forced to leave the site of their victory, fleeing the Empire once again. According to the Wild Space cartographer Emil Graf, in the days after the battle, the rebels' evacuation was briefly interrupted by an Imperial Star Destroyer which threatened to destroy the base before the evacuation could be completed. The rebels managed to disable the crew of the Star Destroyer, however, they soon discovered that its weapons were primed to fire at the base within minutes. Thanks to Verlaine's efforts, the ship misfired at its intended target, with the evacuation being resumed. Some time later, the Imperials regained control of the Destroyer."}, {"tag": "p", "text": "As the Rebel evacuation was nearly complete, Imperial troops lead by Colonel Brenna landed on the moon and engaged in a skirmish with the remaining Rebels at the base, lead by Major Shin, with the hopes of obtaining the Rebel data banks that had not yet been evacuated."}, {"tag": "p", "text": "To capitalize on the Empire's weakness following the destruction of the Death Star, the Rebels began to conduct dozens of raids against Imperial targets to weaken the now-vulnerable Empire. In addition to attacks carried out on the shipyards of Kuat and a supply base on Imdaar, a Rebel team composed of Leia Organa, Han Solo and Luke Skywalker assaulted and destroyed the Empire's largest armament factory on Cymoon 1, severely undermining Imperial military production."}, {"tag": "p", "text": "Six years before the destruction of the Hosnian system, an unofficial political faction in the New Republic's Galactic Senate known to admire the Galactic Empire's rule, the Centrists, questioned the official New Republic historical accounts of the Battle of Yavin and the Galactic Civil War. They believed that the Death Star was destroyed by an Imperial traitor and not by Luke Skywalker and the Rebel Alliance."}, {"tag": "p", "text": "Some time during the New Republic Era, the Ithorian cartographer Gammit Chond created a collection of maps that used a calendar system dating all events in reference to the Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Yavin first appeared in the 1977 film Star Wars: Episode IV A New Hope. It was heavily based on the battle scenes in the 1955 epic war film The Dam Busters."}, {"tag": "p", "text": "The timeline of Star Wars is most often based upon this event, where events are dated as happening so many years \"Before the Battle of Yavin\" (BBY) or \"After the Battle of Yavin\" (ABY)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}