{"url": "Tresk_Im%27nel", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Bothans", "Category:Diplomats", "Category:Jedi Knights of the New Jedi Order", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Tresk Im'nel"}, {"tag": "p", "text": "Tresk Im'nel was a male Bothan, who joined the Bothan Diplomatic Corps when Coruscant was captured by the Rebel Alliance. He became part of the diplomatic staff of Counselor Borsk Fey'lya, a preeminent Bothan, but grew concerned over the appropriateness of Bothan politicking to the fledgling Republic. This led him to seek a new role: he attached himself to a diplomatic team that was persuading old Imperial planets to join the Republic."}, {"tag": "p", "text": "Im'nel later realized that his effectiveness as a diplomat was due, in part, to latent Force-sensitivity. Cognizant of the importance of restoring the Jedi Order to the galaxy, Im'nel reluctantly left his diplomatic post, and began training at the Jedi Praxeum on Yavin 4. As a member of the New Jedi Order, he then worked independently for ten years, before helping defend the galaxy from the rampant Yuuzhan Vong. Im'nel was one of Jedi survivors of this war."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Diplomat"}, {"tag": "p", "text": "Tresk Im'nel was a male Bothan, a member of the Im family and Clan Onel. He was alive during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. When the Alliance wrested control of Coruscant, the galactic capital, from the Empire, Im'nel joined the Bothan Diplomatic Corps. He journeyed to Coruscant to join the diplomatic staff of Counselor Borsk Fey'lya, a preeminent Bothan politician; however, Im'nel soon grew disillusioned with the ambitious Councilor's methods. While recognizing that Fey'lya's acts were merely typical Bothan politics, he nevertheless worried that the fledgling New Republic was not robust enough to withstand such manipulative tactics. In response to this, Im'nel arranged to join a diplomatic team that focused on bringing former Imperial worlds into the New Republic fold. In his mind, this was work he could be proud of, helping to building a stronger Republic that could withstand internal strife."}, {"tag": "p", "text": "Im'nel was incredibly successful at his diplomatic endeavors; he possessed an ability to intuitively address ambassadors' fears and desires. A product of many years of training, Im'nel at first thought nothing of his special skill. However, over time, he realized it went beyond the ordinary; at a meeting with Councilor and Jedi Knight Leia Organa Solo, the Bothan's suspicions were confirmed: his skills were due to latent Force talents. Although reluctant to leave his work in the Diplomatic Corps, Im'nel recognized the importance of restoring the Jedi Order to the galaxy. Leaving his career as a diplomat, Im'nel promptly journeyed to the Jedi Praxeum on Yavin 4 to receive training from Luke Skywalker's academy."}, {"tag": "h3", "text": "Jedi Knight"}, {"tag": "p", "text": "After graduating from the Academy as a Jedi Consular, Im'nel worked for ten years as a solo operative, carrying out the work of the New Jedi Order. The contacts he'd forged during his time as a diplomat enabled him to call in many favors during his work. Im'nel ceased his independent work when the Yuuzhan Vong invaded from beyond the galaxy, choosing to work alongside other Jedi to help protect the Jedi Order and the New Republic. Although many Jedi fell during the long war, Im'nel was one of the survivors, joining many others at the Conclave on Zonama Sekot at the conclusion of the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A member of the Bothan Diplomatic Corps, Im'nel was a principled Bothan who was disillusioned by the Bothan political methods employed by Borsk Fey'lya. He sought more fulfilling work, and so Im'nel arranged to join a diplomatic team focusing on persuading Imperial worlds to join the New Republic. He was very successful in his diplomatic endeavors, possessing an ability to intuitively address ambassadors' fears and desires that was later discovered to be the product of his Force-sensitivity. After becoming a Jedi Knight, Im'nel used his skill as a diplomat to aid his work as a Jedi."}, {"tag": "p", "text": "Im'nel could read and write Galactic Basic Standard, and was an eloquent speaker, able to inspire confidence in those around him. He also had some proficiency in forgery and computer use."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Im'nel was a Force-sensitive, and had his affinity with the Force affirmed by Organa Solo. After received Jedi training, Im'nel became proficient in several Force powers, including the ability to enhance his senses and to communicate telepathically. Im'nel also received vague impressions of the presence of the Force, including emanations of the dark side. The strength of these impressions was relative to the strength of the Force emanation."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Throughout his career as both a diplomat and a Jedi, Im'nel owned a second-hand translator droid. He also commonly carried with him a datapad, multi-channel comlink, code cylinder and credit chip. He also carried a hold-out blaster as a side-arm, which was later complimented with a lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "J.D. Wiker created Tresk Im'nel for the article, \"Tresk Im'nel, Bothan Noble,\" published on the Wizards of the Coast website in 2002. In addition to a short biography, this article provided roleplaying statistics showing Im'nel's progression from a beginner Noble to a Jedi Consular. In 2003, the component parts of Im'nel's name were included in the Galactic Campaign Guide, which explained the structure of Bothan nomenclature. That year, author James Luceno mentioned Im'nel in The New Jedi Order: The Unifying Force, the final book of the The New Jedi Order series, as part of a list of surviving Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}