{"url": "Trespass", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Trespass"}, {"tag": "p", "text": "\"Trespass\" is the fifteenth episode in Season One of the Star Wars: The Clone Wars television series. It is the fifteenth episode of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "While investigating the disappearance of a clone security force, Anakin and Obi-Wan get caught in the middle of an escalating conflict between the furry territorial inhabitants of a desolate ice world and the greedy representatives of a nearby moon."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A force of Republic clone troops under the guidance of Obi-Wan Kenobi, Anakin Skywalker and Captain Rex lands on the iced-up planet of Orto Plutonia to investigate the disappearance of a local clone trooper force. In their company are also C-3PO and R2-D2, along with a party of Pantoran dignitaries which include Senator Riyo Chuchi and Chairman Chi Cho, who uses his political leverage over the Jedi to get what he wants. Despite Orto Plutonia being an ice world apparently devoid of sentient life, Chi Cho vehemently declares that, since it is within the boundaries of the Pantora system, Plutonia is technically considered Pantoran territory. Obi-Wan tells Chairman Cho that the decision would be for the Galactic Senate decide."}, {"tag": "p", "text": "Obi-Wan and Rex check out the local Republic base to find all clone troopers dead, but the consoles untouched. Soon they find a nearby Separatist base, but the droid crew there has also been destroyed, raising suspicion that a third party is behind both killings; the only clues to their identity are a footprint in the snow and a brief image on a holographically recorded distress call."}, {"tag": "p", "text": "Back at the Republic base, Riyo Chuchi voices her doubts about Separatists being responsible for the raid, since the evidence is inconsistent with that theory, but Chi Cho stubbornly refuses to give in to such a violent enemy, no matter who it may be."}, {"tag": "p", "text": "Anakin and Obi-Wan follow their clues to a nearby canyon, where they spot light reflections. Soon afterwards, they do meet primitive but sentient inhabitants, the Talz. Despite the language barrier, Obi-Wan and Anakin manage to make clear that their mission is for peace, and they arrange a meeting between the Pantorans and the Talz. When they deliver the news, Chairman Chi Cho arrogantly refuses to believe that the Talz can be considered a sentient race and calls them trespassers and animals, stating that Pantora hasn't found a slight bit of life on the planet in all their history. Riyo Chuchi tries to mediate, telling that it is for the Senate to decide this matter, but to no avail."}, {"tag": "p", "text": "Upon arrival at the meeting place, the Talz chieftain, Thi-Sen, politely asks that the Galactic Republic leave them in peace and withdrawal all presence from Orto Plutonia. However, Chi Cho still refuses to accept the Talz as sentients and arrogantly declares Plutonia as sovereign Pantoran property, deliberately provoking a war. In order to gain sanctity for his actions, he declares this to be an internal affair of Pantora. Anakin and Obi-Wan appeal to Riyo Chuchi to find a way to resolve this political matter diplomatically. She contacts the Speaker of the Pantoran Assembly, who grants her the authority to negotiate peace and declares the Chairman out of order."}, {"tag": "p", "text": "However, this solution comes a bit too late; while returning to their base, Chi Cho and his escort are ambushed by a Talz war party, forcing them to fight. Chairman Cho is severely weakened by a spear in his back. Anakin, Obi-Wan and Senator Chuchi arrive just in time to save Cho, Rex and the remaining escort from being overrun, but even with his last breath, Cho insists on killing the Talz for the 'good' of his people as his final command. Chuchi politely declines, informing him of the Assembly's decision. Dumbfounded that he was overruled and that his people prefer peace, claiming that he died for them, Chi expires. Senator Chuchi pursues a peaceful approach and manages to cease hostilities, conceding sovereignty of Plutonia to the Talz. As she and the Jedi board a gunship, Obi-Wan requests that to maintain peace, she should make it last."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Dave Filoni stated in an interview that the visuals for Orto Plutonia's environment were black and white photocopies that George Lucas made of the Badlands, saying that the stark contrasts were what he was looking for in depicting the ice planet. Ralph McQuarrie's paintings for Hoth concepts were then applied to the design process for the episode, but without the blue saturation of color. The stylized ice landscapes were patterned after McQuarrie's original vision of an ice planet. The snow in the episode is a very much a part of the emotional tone of the story. Joel Aron developed the different densities and types of snow to parallel the moods of the story, including the moment that, when Chuchi \"buries the hatchet\" with the Talz leader, the blizzard breaks and the snow drifts very gently down."}, {"tag": "p", "text": "The music that plays at the end is The Battle of Christophsis, albeit played more soberly and solemnly."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}