{"url": "Trest", "categories": ["Category:Legends articles", "Category:Bespin locations", "Category:Casinos", "Category:Cloud City locations"], "nodes": [{"tag": "h1", "text": "Trest"}, {"tag": "p", "text": "The Trest was a casino in the floating settlement of Cloud City, one of that city's three largest along with the Royal Casino and the Pair O'Dice. The gambling tables attracted rich tourists, criminals, and even good citizens turned desperate by the Galactic Empire. The Trest was frequented by various species, such as Anxs, Biths, Dugs, Humans, Ithorians, Mon Calamari, Rodians, Snivvians, Sullustans, Toydarians, Trandoshans, Twi'leks and even Jawas. The gamblers could enjoy a variety of food and drinks, such as the Colt 45 favored by the businessman Barpotomous Drebble."}, {"tag": "p", "text": "The Trest was itself an elaborate complex complete with restaurants and floor shows. The main gambling chamber included many tables and a drink bar serving the patrons and the gamblers. A central pillar and the bar was decorated with boarded facing. The room had an overall bluish hue and the two type of illuminants provided yellow light. One type of the illuminants were placed above every table, providing light for card-playing or eating. The other type was designed in a line-dot rhythm, and it ran along all the walls, above the bar and along the stair steps. Private chambers, like the Ecclessis Figg Room shared the same design except for the purple hue in the room. The corridors between the rooms were white and designed in the style of public corridors of Cloud City."}, {"tag": "p", "text": "A year after the Battle of Yavin, the professional gambler Lando Calrissian visited the Trest and won a sabacc game against Drebble. Minutes later, Calrissian was invited to the casino's Ecclessis Figg Room to play against the Baron Administrator of the city, Dominic Raynor. In the first match, Raynor won his opponent's shuttle, the Cobra, but in the return match, Calrissian won the entirety of Cloud City."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trest casino was first mentioned in the first edition of West End Games' roleplaying sourcebook, the 1989 Galaxy Guide 2: Yavin and Bespin written by Jonatha Ariadne Caspian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}