{"url": "Tri-Wing_S-91x_Pegasus_Starfighter", "categories": ["Category:Canon articles", "Category:Incom Corporation products", "Category:New Republic starfighter classes", "Category:Resistance starfighter classes"], "nodes": [{"tag": "h1", "text": "Tri-Wing S-91x Pegasus Starfighter"}, {"tag": "p", "text": "The Tri-Wing S-91x Pegasus Starfighter was a class of New Republic Light Assault Starship that was manufactured by Incom Corporation. It was equipped with two engines, a pocket for an R2 series astromech droid, at least two frontal laser cannons, and a cockpit for a pilot and two passengers. The Tri-Wing S-91x Pegasus Starfighter was active by the time of the New Republic Era used by the New Republic and the Resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The Tri-Wing S-91x Pegasus Starfighter was a collaboration between the car maker Porsche and Lucasfilm Ltd., who teamed up specifically to create this starship as part of the marketing and promotion for Star Wars: Episode IX The Rise of Skywalker. Its design was revealed in a video published by the car maker, and was stated to appear in  future Star Wars media."}, {"tag": "h3", "text": "The Designer Alliance team"}, {"tag": "p", "text": "The combined effort was marketed as The Designer Alliance, as the team consisted of seven members from Porsche and Lucasfilm, with the team being led by Lucasfilm Vice President Executive Creative Director Doug Chiang and Porsche Vice President Style Michael Mauer. Team members included Lucasfilm's Amy Beth Christenson, Ryan Church along with Porsche's Salar Vakili, Doeke de Walle, Emiel Burki, Fabian Schmoelz,Tobias Benedini, and Sophie Tillema, and the alliance first met at Porsche headquarters in Weissach, Germany. Later meetings included meetings in the Porsche Museum in Stuttgart and in Skywalker Ranch in San Francisco California, with the design phase of the project lasting six weeks."}, {"tag": "h3", "text": "Design and production"}, {"tag": "h4", "text": "Initial criteria"}, {"tag": "p", "text": "After meeting in Porsche Headquarters and a tour of the Porsche Museum, Doug Chiang led the design brief for the team. They started with identifying how to create a blend between an X-wing starfighter, a BTL Y-wing starfighter, and a U-wing and mix it with the Porsche Taycan with the goal of creating a new class of vehicle. Overall, the project was to blend Porsche's design pathos of .... and the simplistic design criteria of George Lucas which was overall the design principles of the Star Wars saga. There were several key design specifications for the new vessel, which included in-universe specifications. It was going to be a New Republic Light Assault Starship manufactured by Incom Corporation, it was going to have a maximum of four engines or a minimum of two, its crew was going to vary from two to five, a large cargo door for other passengers, along with two entry doors into the vehicle. According to Doug Chiang, for the  starship to have personality, they were going to design a \"good guy ship.\" As a result, the starship could not be dark colored similarly to Darth Vader."}, {"tag": "h4", "text": "Process underway"}, {"tag": "p", "text": "To begin the design process, the team started with a blue sky iteration and after two weeks, both Doug and Michael were meant to define the direction. After that, in a week and a half, the team planned to work together as a whole to determine the design direction. The schedule then called for a hero design and 3D modeling two and a half weeks after the previous checkpoint."}, {"tag": "p", "text": "Because a focus of the starship was to be a \"sports car spaceship,\" the design shapes needed to be streamlined and a big engine to demonstrate power. The design process for the engines began with thinking how the engines were going to be arranged and were first added to the ends of the wings. With this, the design team realized that the closer the engines were to the cockpit, the craft looked more like the sports orientation of the vehicle and looked more automotive."}, {"tag": "p", "text": "Four weeks before the deadline, the team used video conference calls and technology to coordinate and lock down on a proportional design package for the vehicle. After Dough Chiang advised the team that the wings could be configured in different ways to demonstrate more power. As such, the concept artists worked extensively on different designs, with Ryan Church using Porsche's four fender shapes that he turned into wings, while another artist designed the wings to move separately and independently like a bird. Another concept designer observed insects and assembled the wings in different positions and angles, and designed them to be rotational."}, {"tag": "p", "text": "After some time, the members of Porsche travelled to Lucasfilm headquarters to determine the final design of the starship and used two days to go more in depth into the styling and details of the ship. With the various designs printed out, the team began physically cutting and pasting design features to assemble new designs. Initially, the cockpit designs were wider, but were later forgone in favor of a more compact space and putting the pilot in the middle with two co-pilots behind. This allowed for a narrow cabin, similarly attributed to that of a jet fighter plane or Formula 1 car. The way the pilots sat in the vehicle had to be Porsche-inspired and have a \"sporty\" vehicle. Two weeks before the deadline, the final design language of smaller and wider proportions was put in place. The collage of designs that were cut and pasted was given to Rene Garcia, a Concept Modeling Supervisor at Lucasfilm, to render the final digital model of the craft."}, {"tag": "h3", "text": "Marketing and release"}, {"tag": "p", "text": "On December 13, 2019, the ship was revealed citing its inspirations as being the Porsche products 911, Taycan, and 918 Spyder."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}