{"url": "Trever_Flume", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Humans", "Category:Males", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Trever Flume"}, {"tag": "p", "text": "Trever Flume was a Human male from the world of Bellassa, who helped Obi-Wan Kenobi and Ferus Olin in their quest to find survivors of Order 66 in the aftermath of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Orphaned on Bellassa"}, {"tag": "p", "text": "A captain on the army of the Republic, Trever's mother was killed in the Battle of T'olan, during the Clone Wars. In the first months of the Galactic Empire's existence, the Imperials removed the governor of Bellassa from office, to institute a state of martial law. An uprising followed, and the deaths of many Bellassans ensued. When the Empire tried to take over a planetary defense plant on Bellassa, a group of protesters from the capital city of Ussa decided to peacefully occupy the plant. Trever's father and elder brother, Tike Flume, were among the protesters. When the Empire blew up the plant, Trever lost his father and brother in the explosion."}, {"tag": "p", "text": "Over the next few months Trever, now an orphan, became involved in the black market of Bellassa, and was very talented in controlling most of it. Ferus Olin, a leader of the rebel group The Eleven, helped Trever on many occasions,such as letting him sleep in the back room of Olin/Lands until he was forced into hiding from the Imperials. Trever met Obi-Wan Kenobi during one of his thefts of Imperial uniforms. It was Trever who led Kenobi to the other members of the Eleven who helped him locate Ferus. The Eleven also used his stolen Imperial uniforms to infiltrate the Bellassan detention facility and rescue another member of the Eleven, Roan Lands."}, {"tag": "h3", "text": "Adventures with Obi-Wan"}, {"tag": "p", "text": "After rescuing Roan, Ferus and Obi-Wan fled Bellassa. Little did they realize until they left the system that Trever hopped on board too. The trio landed in the Red Twins Spaceport, where they encountered the bounty hunters Boba Fett and D'harhan, who were working for the Inquisitor Malorum. After a brief scuffle, the three of them escaped again and found themselves at the planet Acherin. Here they met Raina Quill and Toma, two commanders of a resistance movement on the planet. Once again, they fled the planet, this time with Raina and Toma. They dropped the two commanders off on an asteroid, hidden from Imperials because of an atmospheric storm, and headed for Ilum, where a Jedi named Garen Muln was known to have been hiding. Trever stayed on Ilum with Ferus, while Obi-Wan went off to deal with some business on Polis Massa."}, {"tag": "p", "text": "While Ferus went into Ilum's Crystal Caves alone, Trever waited outside to keep an eye out for Imperial forces, who were no doubt in the area. While waiting for Ferus, Trever discovered some Imperial stormtroopers scouting the area for lifeforms. They left their ship abandoned and Trever decided to sneak on board, looking for anything worth stealing. However, he heard them returning to their ship, and when they spotted him, he was forced to steal the entire ship altogether. By the time Ferus returned with Garen, more Imperial forces pinned them down, but Trever used his ship to cover them until they were able to board. They fled the area and landed somewhere safe until Obi-Wan returned to pick them up."}, {"tag": "p", "text": "After rejoining Kenobi and stopping in the Nixor Spaceport to pick up supplies donated on behalf of Roan Lands, the group returned to Raina and Toma on the hidden asteroid. Ferus's plan of turning the asteroid into a safe haven for Jedi was starting to take shape. After returning Obi-Wan to Tatooine, Ferus and Trever headed for Coruscant, where another Jedi was reported to have been being held here. Ferus thought that Trever might want to go on his own from this point on, seeing what he could do to the black market of the capital, but Trever felt that he would rather be Ferus's partner in rescuing the surviving Jedi of the galaxy."}, {"tag": "h3", "text": "Mission on Coruscant"}, {"tag": "p", "text": "Ferus and Trever flew into the Jedi Temple, and discovered that there were no Jedi; it was just a trap, and the Empire had been spreading rumors just to bring Jedi to the Temple. Ferus and Trever then sought out the help of Dexter Jettster, but found that his diner had been destroyed and Dex had been evicted or had run away. Ferus tracked down Dex and found that he had been living with a group of people who call themselves The Erased. Dex tells Ferus that he met a Jedi named Fy-Tor-Ana. She had told Dex that if he ever needed her help, he should find Solace. Ferus, Trever, and the rest of The Erased found Solace and realized that she was Fy-Tor-Ana herself. Ferus convinced Solace to go to the Temple with him and they did. However, they encountered stormtroopers at the Temple and Ferus was captured. Solace and Trever were able to escape. When they returned to Solace's underground base, Trever was furious at Solace for leaving Ferus to die. Solace then told him that it was not over, and they would go back to rescue Ferus. Solace then heard a tremor through the Force. Then a bloodied member of the Erased, Keets Freely, ran over to them and collapsed at Trever's feet. The two discovered that the base was under attack by stormtroopers. Trever realized that Solace was right; it was not over. He readied himself for the fight."}, {"tag": "p", "text": "Later, after hours of fighting, Trever saw the Bothan Oryon, who he had thought to be dead. They helped save Solace from stormtroopers, and they found Keets, who they also thought to be dead. They escaped and went to Dexter's hideout, and they discovered that Ferus was being held on a prison world called Dontamo. They flew there and found Ferus with his old friend Clive Flax escaping Imperial starfighters. They found out that Malorum was going to Naboo to investigate Padmé Amidala's death and burial. Ferus decided he had to stop him, and Trever, Solace, Clive, Oryon, Keets, and Curran Caladian, another member of the Erased who Trever had at first thought dead but later found him at Dex's hideout, joined him."}, {"tag": "h3", "text": "Journey to Naboo"}, {"tag": "p", "text": "The group traveled to Naboo and found, with the help of Captain Gregar Typho, that Malorum was going to interrogate Ryoo Thule, the maternal grandmother of Padmé Amidala, because she was the one who oversaw Amidala's burial, as was custom on Naboo. When the group got there, Ferus found her body on the ground, and he pursued him. The others, including Trever, got in boats to keep up with Ferus. Malorum eventually escaped, and the group was saved by several Gungans. With the help of Boss Rugor Nass's forces, and the army of Queen Apailana, the group defeated Malorum and helped, however temporarily, to rid the planet of Imperial presence."}, {"tag": "h3", "text": "Return to Bellassa"}, {"tag": "p", "text": "After Ferus accepted an invitation, Trever accompanied him with others to Coruscant and camouflaged themselves to rescue Roan Lands and Dona Telamark. While passing through a crowd, Trever, Oryon, and Solace proceeded to Bellassa where Dona and Roan were probably imprisoned. They were able to get help from The Eleven and were able to escape the planet. After the destruction of the secret base, Trever's memory was partially erased because his knowledge of Darth Vader could put him in great danger. He eventually became the adopted son of Clive Flax and Astri Oddo where he would start a new life on Belazura."}, {"tag": "p", "text": "In 12 BBY, Trever, along with his adopted parents, was probably killed after one of the Imperial factories was blown up by the Imperials themselves."}, {"tag": "p", "text": "Later, Divinian realized the brainwashed Imperial assassin X-7 might be Flume, his death having been faked and his skills honed to those of an assassin. He didn't know if this was true, but he let X-7 (and himself) believe it in X-7's last moments of life when he died in an Imperial warehouse on Belazura, even after nearly killing Div to escape his past."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}