{"url": "Tria_Blue", "categories": ["Category:Legends articles", "Category:Aquatic vehicles", "Category:Luxury vehicles", "Category:Ubrikkian Industries products"], "nodes": [{"tag": "h1", "text": "Tria Blue"}, {"tag": "p", "text": "Tria Blue was the individual name of the modified Ubrikkian BBK Repulsorsub, built under contract and owned by Guther Bartyn. He named the ship after Tria Bartyn, his popular ancestor, in an attempt to gain popularity. C. 29 BBY, the Menahuun sneaked into the docked ship, killed its guards and tried to blow it up."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Guther Bartyn was the descendant of the Bartyn family, de facto owners of the planet Lamaredd. As such, he was Administrator of the local mines owned by Outer Rim Oreworks; owner of the greatest business, Bartyn Gourmet Delicacies, and of part of many others; mayor of the capital city Bartyn's Landing; and a consumate bureaucrat with expensive tastes. Bartyn was disliked among his citizens, unlike some of his predecessors such as \"Benevolent\" Tria Bartyn."}, {"tag": "p", "text": "Being an aficionado to sailing in the extensive oceans of Lamaredd —although he mostly relaxed in open sea while subordinates did sail—, Bartyn signed a private contract, GBX-005, with Ubrikkian Industries to buy a customized repulsorlift speeder yacht — with an estimate value of 2.9 million credits. Ubrikkian delivered a yacht indeed, with a modified Ubrikkian BBK Repulsorsub to be used as a escape pod and proton hydrotorpedoes as weapons."}, {"tag": "p", "text": "In an attempt to increase his popularity, Bartyn named the ship Tria Blue. This however was not a widely accepted move, as he himself had changed little: Citizens knew that Bartyn did not like being interrupted when he was onboard the Tria Blue."}, {"tag": "p", "text": "Around 29 BBY, Bartyn was visited by a Neimoidian dignitary. They decided to have a race around the planet, each in his own boat. As Bartyn was an abysmal captain, he hired a specialized crew to take care of the details — including doing every single job onboard."}, {"tag": "p", "text": "Soon after this event, several boats suffered the attacks of unseen creatures identified only as \"goblins\". These were really the Menahuun, a believed-extinct native sentient species. Worried about the security of the Tria Blue, Bartyn docked it in a private berth near the Center Sphere District of Bartyn's Landing and, in an unpopular move, staffed it with security agents from the spaceport. The dockmaster, Howe Walwahd, felt little sympathy for Bartyn and would care little should his boat had been destroyed."}, {"tag": "p", "text": "Two Menahuun scouts sneaked in the Tria Blue, killed all the guards and placed their mutilated bodies in the entrance as a warning. The explorers then prepared an explosive to destroy the boat. They were found at this point by the recently-hired Security Chief's Seconds, who were investigating the area at request of Bartyn's proxy Mix Liddell."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "The 70-meter long Tria Blue was an aquatic speeder requiring a crew of five: One pilot, one navigator, one gunner and two engineers. It could reach 400 kmh even carrying the crew, 45 passengers and 2,000 kilos of cargo. It did hover using speeder technology but it could not increase the altitude."}, {"tag": "p", "text": "The vehicle was armed with proton hydrotorpedo launchers and dual turbolaser cannons. It also had a escape BBK Repulsorsub for emergencies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}