{"url": "Battle_of_Yerej", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles in the Tungra sector", "Category:Battles of Rebel Alliance Operation: Quick Strike"], "nodes": [{"tag": "h1", "text": "Battle of Yerej"}, {"tag": "p", "text": "The Battle of Yerej was a space battle fought between the Alliance to Restore the Republic and the Galactic Empire when the Nebulon-B frigate Meteor and its complement of snubfighters attacked the Imperial factory Drekker, a crystal-manufacturing facility in the Yerej system."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "The Victory-class Star Destroyer Inexorable responded to the attack on the space factory, launching TIE/sa bombers to assault the Meteor and TIE/IN interceptors to escort the strike force upon entering the system. The factory Drekker deployed its own fighter screen, consisting of two full flight groups of TIE/LN starfighters. Planning for difficulty, the Imperials arranged that if the battle shifted to the Rebels' advantage, then two flight groups of Delta-class DX-9 stormtrooper transports could enter the battle and launch proton torpedoes at the Meteor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As players can participate in the mission \"Attack on Imperial Factory Drekker\" in the computer game Star Wars: X-Wing vs. TIE Fighter on either the Rebel or the Imperial side, both sides have conflicting mission objectives, and victory is not essential to access the next set of missions, the battle itself is considered canon but the canon outcome is unknown."}, {"tag": "p", "text": "The ships listed in this article are those found in the battle Rebel Alliance Operation: Quick Strike, using the default craft assigned to the player. The standalone combat engagement \"Attack on Imperial Factory Drekker\" is identical except for the craft, which may include Assault Gunboats, TIE Avengers, X-wings, and Y-wings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}