{"url": "Battle_of_Yerbana", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles in the Outer Rim", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of Yerbana"}, {"tag": "p", "text": "The Battle of Yerbana  was an engagement that took place during the Outer Rim Sieges in the final days of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, on the planet Yerbana. Clone troopers of the 212th Attack Battalion under Jedi General Obi-Wan Kenobi and of the 501st Legion under Jedi General Anakin Skywalker engaged the Separatist Droid Army on the world."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 19 BBY, the Confederacy of Independent Systems launched a campaign in the Outer Rim Territories led by General Grievous. The Jedi Generals of the Grand Army of the Republic were sent far from the Core Worlds due to this campaign, and the 501st Legion and 212th Attack Battalion were dispatched to the Outer Rim planet of Yerbana under the command of Jedi Generals Anakin Skywalker and Obi-Wan Kenobi."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Arriving in orbit of the planet Yerbana, the 501st Legion and 212th Attack Battalion were split into two fronts, with the 212th leading an assault on a city controlled by the Separatists. The 501st managed to finish with their front of the battle before the 212th did, and went to help them with theirs. In the air, Clone Z-95 Headhunters and gunships engaged Separatist droid tri-fighters."}, {"tag": "p", "text": "On the bridge leading into the city, the 212th faced a blockade by the Separatist Droid Army. Clone Commander Cody ordered his troops to take cover as the Separatist forces fired explosives at them. The clones continued to fire at the enemy while taking cover. Cody was nearly killed by one of these explosives but was saved by the timely arrival of Kenobi. Alongside Kenobi's arrival, he ordered his troops to get down. From behind cover, Cody informed Kenobi that they couldn't find the tactical droid as the Separatists continued to fire explosives at them. As Kenobi asked where Skywalker was, he suddenly appeared right behind them with a new strategy."}, {"tag": "p", "text": "Leaving cover, Skywalker walked out in to the open while the droids continued to fire at the 212th, easily avoiding all of the shots fired at him. After identifying Skywalker, the OOM command battle droid ordered his forces to aim all of their batteries on him; however, before they could fire, Skywalker feigned his surrender to them. As Skywalker continued to oversell his surrender, the battle droid commander ordered the other battle droids to contact the super tactical droid. Meanwhile, R2-D2 checked up on the progress of Skywalker's plan and told Clone Captain Rex that he and the other clone jetpack troopers hiding underneath the bridge would not have to wait there much longer. As the super tactical droid emerged from hiding, he realized Skywalker's trick and ordered his units to open fire once more, but before they could do anything else, Skywalker ordered his troops to attack and pulled the tactical droid towards him using the Force, slicing his head off with his lightsaber. As he did this, the jetpack troopers emerged from hiding and attacked, firing at the droids and planting explosives on the Octuptarra tri-droids. As the droids were forced back, Kenobi allowed his troops to join in on finishing the Separatist forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the battle was wrapping up, the Jedi were called back to the ship after receiving a message from an individual using Anakin's subspace frequency \"Fulcrum,\" who they believed to be Saw Gerrera requesting their assistance in the siege at Onderon. However, the person using the frequency was actually Skywalker's former Padawan, Ahsoka Tano, and Bo-Katan Kryze, the sister of the late Duchess Satine Kryze, seeking the assistance of the Republic and the Jedi to help defeat and capture the renegade Sith Lord Maul."}, {"tag": "p", "text": "After meeting with Tano and Kryze onboard a Venator-class Star Destroyer and hearing their request, Kenobi insisted on waiting for the approval of the Jedi High Council before committing to the operation. Kryze told Tano she had known this would be a waste of time, but Skywalker had a surprise for his former apprentice, taking her to meet Rex and a unit of the 501st who had repainted their helmets after her facial markings in her honor once they knew she was coming back. The reunion was interrupted, however, by the klaxons going off. When Kenobi arrived at the scene, Skywalker asked if the attack on Mandalore had been approved as the clone troopers ran off to prepare for battle, but the Jedi Master explained that Grievous had attacked Coruscant and the Supreme Chancellor was in danger. Tano was upset, pointing out that the Jedi playing politics instead of helping people who really needed them was why the general public had lost faith in the Order. Skywalker proposed splitting the 501st and creating a new unit under Tano's command, but Kenobi pointed out that as she was no longer a member of the Republic Military, she could not officially command anyone. Skywalker's solution to this was to promote Rex to Commander so he could lead the new unit, with Tano officially designated as his advisor, which she was amenable to."}, {"tag": "p", "text": "As Kenobi, Skywalker and their forces headed for the capital of the Republic to stop Grievous, Tano, Rex, and Kryze set out for Mandalore with their forces, beginning a siege to draw Maul out of hiding."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle appears in the episode \"Old Friends Not Forgotten\" of Star Wars: The Clone Wars, streamed April 17, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}