{"url": "Trever_Flume%27s_mother", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Galactic Republic military officers", "Category:Unidentified Galactic Republic individuals", "Category:Unidentified humans", "Category:Unidentified military personnel", "Category:Unidentified mothers"], "nodes": [{"tag": "h1", "text": "Trever Flume's mother"}, {"tag": "p", "text": "A Human female soldier lived on the planet of Bellassa and had two children, Trever and Tike Flume, with a doctor. During the early phases of the Clone Wars, which began in 22 BBY, she fought in the Galactic Republic's armed forces against secessionists known as the Confederacy of Independent Systems. Holding the rank of captain, she died fighting in the Battle of T'olan early in the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the Galactic Republic's waning decades, a Human female was born on a Core World called Bellassa. She eventually had two sons, Tike and Trever Flume, with a doctor. The younger of the two, Trever, was born around the year 31 BBY. While Flume was growing up, the family was quite happy and inseparable. They went to concerts and played laserball in their hometown, the city of Ussa. On weekends, they frequented a particular café."}, {"tag": "p", "text": "Approximately nine years after Trever's birth, the Confederacy of Independent Systems's secession from the Galactic Republic plunged the galaxy into the Clone Wars. The woman went to fight the Confederacy with the Republic Military. Before she left, she told Trever that it was too dangerous for him to come with her and assured him that she would return safely. She died early in the conflict, serving as a captain at the Battle of T'olan, at a place called T'olan in the Wuun system."}, {"tag": "p", "text": "Flume did not talk much about his mother after her death. When his father and brother died in a bombing after the end of the war, he was orphaned. He spent months trying to forget all these deaths, consumed by his anger and hurt feelings. He dropped out of school to live on the street and allied with the Bellassan black market to keep himself alive. They had him do various jobs in exchange for food and shelter. This also conveniently kept him away from his family's stomping grounds in the upscale parts of Ussa. He preferred not to be reminded of any of them. Even so, he did think of them fondly and their deaths lingered in his mind. Remembering what his mother had said to him before leaving, and his father and brother saying similar things before their own deaths, he became deeply averse to people he cared about saying \"I'll be back\" before doing dangerous things."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Trever Flume's mother could get a fierce look in her eye when she was protective of her children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trever Flume first mentioned his mother, though she was not named, in the 2005 young reader novel The Last of the Jedi: The Desperate Mission by Jude Watson."}, {"tag": "p", "text": "Trever Flume said that his mother fought in the Grand Army of the Republic in The Desperate Mission, but he must have been mistaken. The Essential Guide to Warfare (2012) stated that the Grand Army's infantry was exclusively clone troopers, who were all men and nigh exclusively sourced from the bounty hunter Jango Fett. On the other hand, Jedi Generals were considered part of the Grand Army and were not clones, but they significantly outranked the captains, who were clones. Nonetheless, there were non-clone branches of the Military fighting for the Republic, such as the Planetary Security Forces or the Judicials."}, {"tag": "p", "text": "A later book in the series, The Last of the Jedi: Death on Naboo (2006), incorrectly stated that she died fighting the Galactic Empire, which did not exist at the time of her death. After that, in The Last of the Jedi: A Tangled Web (2006), Trever Flume remembered his mother dying on Bellassa rather than at T'olan. These erroneous references to her death lumped her together with her partner and other son, whom Imperials did kill on Bellassa according to The Desperate Mission, but A Tangled Web also explicitly mentioned those two dying together independently from her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}