{"url": "Trezya_Nenei", "categories": ["Category:Legends articles", "Category:Females", "Category:Freedom fighters", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Trezya Nenei"}, {"tag": "p", "text": "Trezya Nenei was a female Twi'lek member of the Aggregate Civil Liberties Organization who lived on Talus during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Trezya Nenei was a member of the Aggregate Civil Liberties Organization, a pro-Rebel organization during the Galactic Civil War between the Rebel Alliance and the Galactic Empire. Sometime following the Battle of Yavin in 0 BBY, she conducted business as a liaison with Captain Vayde Quellium of the Rebel Alliance in his office in the city of Dearic, on Talus."}, {"tag": "p", "text": "Circa 1 ABY, the Aggregate Civil Liberties Organization sought to join the Rebel Alliance on a permanent basis. In the meanwhile, both the A.C.L.O. and the Rebels were in conflict with the Nightstrike Soldier Hegemony, a Talusian mercenary organization affiliated with the Empire. At some point, N.S.H. troops shut down an A.C.L.O. clinic and imprisoned the Wookiee medical officer Syirlabradawk, one of Trezya's friend. They also confiscated a shipment of medical supplies. Captain Quellium and Trezya Nenei therefore sent a spacer to raid the N.S.H. base. The spacer was recommended by CorSec officer Dathnaeya Loessin who wanted to determine what kind of people the Rebellion and the Empire had chosen to work with. The spacer assaulted the N.S.H. base and eventually managed to retrieve the medical shipment and rescue the medical officer, killing many N.S.H. enforcers in the process. Trezya Nenei was very grateful to the spacer for saving her Wookiee friend."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trezya Nenei was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Trezya Nenei was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}