{"url": "Battle_of_Yavin_4_(Great_Sith_War)", "categories": ["Category:Legends articles", "Category:Battles of the Great Sith War", "Category:Battles of Yavin"], "nodes": [{"tag": "h1", "text": "Battle of Yavin 4  (Great Sith War)"}, {"tag": "p", "text": "The Battle of Yavin IV was one of the final conflicts of the Great Sith War in 3996 BBY. It culminated in the death of Sith Lord Exar Kun and the annihilation of much of the Massassi species on Yavin 4. Following the defection of fellow Sith Lord and former Jedi Knight Ulic Qel-Droma, the Jedi Order and elements of the Republic Rim Fleet converged on Yavin IV—the Brotherhood of the Sith's main staging center. In an attempt to unleash his spirit into the cosmos, Kun used a dark side Sith ritual to drain the souls of many Massassi. However, this collided with a wall of light-side energy generated by the Jedi participants, culminating in a firestorm that devastated Yavin IV's surface and destroyed much flora and fauna. Kun's spirit survived the inferno but was imprisoned within the Massassi Temples."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Exar Kun's program of systematic galactic conquest had claimed the lives of millions, over the years that the Great Sith War burned. With the final destruction of the great Jedi training headquarters at Ossus, it appeared that an era of self-assured complacency for the Order was now officially at an end. The need for a swift, final resolution had become all the more urgent."}, {"tag": "p", "text": "The Galactic Republic was dealt an unforeseen lucky break, however, when former Sith Lord Ulic Qel-Droma turned away from the darkness after slaying his own brother, imprisoned beneath a Wall of light. Ulic psychologically faced up to the consequences of his actions, realizing the need to undo the damage already wrought by his hand. Revealing the location of Exar Kun's main headquarters—the fourth moon of the planet Yavin—the Jedi leaders under Jedi Master Thon and Nomi Sunrider quickly organized the Republic Rim Fleet to take the war back to Kun."}, {"tag": "h2", "text": "Conflict"}, {"tag": "p", "text": "Thousands of Jedi Knights from across the galaxy answered the summons, converging upon the jungle moon in a multitude of battlecraft which blotted out the sky. Looking heavenward, Kun instantly recognized Qel-Droma's betrayal, and vowed to continue the fight against the light by surviving. Some ground engagements between Republic soldiers and Kun's Massassi warriors occurred. Unable to counteract the Rim Fleet's space blockade, Kun summoned much of the Massassi population on Yavin IV to the Temple of Exar Kun for one final ceremony. Guided by ancient Sith spellbooks, he drained the Massassi of their life-essence and used the energy in a Sith ritual to free his spirit from the chains of his mortal body. For a while, it seemed that Kun would be free to ravage the cosmos forever."}, {"tag": "p", "text": "In response, the assembled Jedi created a massive wall of Light Side energy aimed at cleansing Exar Kun's corrupt presence from the galaxy and imprisoning his spirit. However, the wall unexpectedly collided and reacted with the colossal wave of dark side energy rising from Yavin—causing a chain reaction on the planet below, creating a massive firestorm unlike any ever seen before in history, utterly devouring all traces of Kun and the Massassi."}, {"tag": "p", "text": "With the holocaust proving to be unquenchable, the Jedi forces reluctantly departed from Yavin space, as the fires continued to rage out of control. Nomi, Ulic, Thon, and the rest of the Jedi were stunned at what they witnessed and asked themselves what the final cost of their actions would ultimately prove to be."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Two years later, Qel-Droma himself would finally comprehend the cost. His newly-christened ship, Cay's Dream, landed on Yavin 4, finding a devastated world and ecosystem, with no lifesigns anywhere to be found. No trace of Exar Kun was found and Qel-Droma left. However in the darkness of the Massassi temple, the spirit of Exar Kun screamed futile pleas for deliverance from the darkness, damned to the hell he had made for himself, but Ulic, blind to the Force, could not hear him.Gradually over the years, Yavin IV's ecosystem regenerated and recovered till it could sustain flora and fauna again."}, {"tag": "p", "text": "Some Massassi on Yavin IV,including Kalgrath, also survived the firestorm.Over the centuries, their numbers on Yavin IV multiplied. In 3756 BBY, these Massassi were encountered by the covert True Sith spy Barel Ovair and the Jedi Padawan Eison Gynt who were on a mission to ostensibly eliminate the dark side energies emanating from the tomb of the Sith Lord Naga Sadow from the Great Hyperspace War. These Massassi attacked the two offworlders and drove them deeper into the tombs where they encountered the Sith Lord's lingering energies. Seven years later, Gynt emerged wearing Massassi warrior robes and possessed by Sadow's dark side spirit. Gynt attacked master Ovair in broad daylight in Coruscant but was bested by Ovair.In addition, there were Massassi living on other worlds including Korriban and Tund."}, {"tag": "p", "text": "Nearly four thousand years later in 1 ABY, Professor Walter Emanus led a Corellia University archaeological expedition. However, during their excavations, they uncovered the catacombs beneath the Dark Lord's temple and reawakened his spirit. He possessed them and made them into the Cult of Exar Kun, which was devoted to his worship. Under his influence, some of the cultists traveled to the Corellia University research outpost on Talus to recruit more students and researchers to their ranks. The cult based itself around the catacombs, but was destroyed when Professor Cornelius Wagglehorn, a former colleague of Emanus, hired a group of spacers to drive them out. Kun himself battled the spacers, but due to his spirit form, was easily defeated and silenced once more."}, {"tag": "p", "text": "In 11 ABY, Kun's temples became the site of Luke Skywalker's Jedi Praxeum, a school where he began the re-creation of the Jedi Order. The Jedi trainees' exercises in the Force awakened Kun who sought to subvert the Jedi training. As a spirit, Kun appeared to the young Jedi apprentice Gantoris. The inexperienced apprentice was unable to avoid being corrupted and, when he started to resist, Kun killed him, burned from inside. After destroying his first Jedi in thousands of years, Kun's insatiable appetite for spreading his dark wrath escalated. He was able to successfully corrupt and partly possess the young and extraordinarily talented Kyp Durron."}, {"tag": "p", "text": "In addition, he sundered Skywalker's spirit from his body, demoralizing his Jedi apprentices. Kun's spirit was eventually roused from hiding and banished into Chaos by the combined efforts of the Jedi apprentices, Luke's spirit, and the long-dead spirit of Kun's Master, Vodo-Siosk Baas. After Kun's shade was vanquished, Corran Horn destroyed Kun's temple with proton torpedoes, thus eliminating his dark taint."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}