{"url": "Tribunal_of_Zare_Leonis", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Ceremonies"], "nodes": [{"tag": "h1", "text": "Tribunal of Zare Leonis"}, {"tag": "p", "text": "This tribunal was held at the Arkanis Academy against Zare Leonis for crimes against the Galactic Empire while training as one of its cadets. At the tribunal, Leonis was charged with numerous offenses against the Galactic Empire and plead guilty to them all. For his crimes, he was sentenced to death, but the sentence was not carried out, as he escaped and with help rescued his sister before fleeing from the Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Zare Leonis's enlistment as a cadet with the Galactic Empire was, from the beginning, a deception, as his goal was to discover the fate of his sister, Dhara Leonis, and if possible, rescue her from the Empire's clutches. To this end, he regularly worked with rebels impeding the Empire's operations, while also absorbing the Empire's lessons in order to pass himself off as the perfect cadet. After a time at the Academy for Young Imperials on Lothal, Leonis was transferred to the officers academy on Arkanis. There, he continued his deception, faking his way into a secretive group known as the Commandant's Cadets. It was then that things went wrong, as Leonis was spotted by Beck Ollet, a friend of his that had been captured by the Empire and brainwashed as part of Project Unity. Ollet called Leonis out as a traitor and Leonis was subjected to interrogation and torture, then forced to attend a military tribunal to determine his fate."}, {"tag": "h2", "text": "Tribunal"}, {"tag": "p", "text": "Leonis's tribunal was conducted Colonel Julyan, his instructor in Strategy and Tactics at the academy, before his fellow Commandant's Cadets and their leader and academy overseer Commandant Brendol Hux. Also present was the deeply disturbed Lieutenant Chiron, who had served as both a friend and mentor for Leonis, and Sergeant Pocarto, another of the academy's instructors. For the tribunal, Leonis was made to wear his dress uniform, something he found darkly amusing. The tribunal was held in a ceremonial chamber in Area Null, a secret area within the Arkanis Academy grounds."}, {"tag": "p", "text": "Leonis expected a lengthy review of his offenses and was surprised when Julyan moved straight to the point. He told Leonis to rise and quickly read off the numerous charges that Leonis was facing: fraudulent enlistment, making false official statements, perjuring his oath as a cadet, refusal to obey lawful orders, conduct unbecoming of a cadet, dereliction of duty, destruction of Imperial property, conspiracy, providing aid and comfort to enemies of the Galactic Empire, espionage, assault on Imperial personnel, attempted murder of Imperial personnel, sedition and treason. He noted that Leonis had been given the chance to review the evidence against him and asked how he pleaded. Leonis replied that he was guilty on all counts. Julyan asked if he had anything to say in his defense."}, {"tag": "p", "text": "After scanning the faces of those around him, Leonis spoke his piece. He said that he had only ever wanted to be a servant of the Empire, to make the galaxy a better place. The Empire, however, was guilty of numerous crimes, including ruining the environment of his adopted homeworld, Lothal, spreading terror among its populace, suppressing lawful dissent and kidnapping his sister, a sister who had wanted to serve the Empire even more than he did. Leonis finished by stating the Empire couldn't kill all of those like him, or it would be an Empire that ruled nothing, that was nothing. Julyan was entirely unimpressed by Leonis's speech. He told him that the first part of his punishment was that he was expelled from Imperial service, a punishment that would be conducted by his fellow cadets. At that, the Commandant's Cadets rose and stripped him of his uniform, leaving him only a t-shirt and knee-length shorts. Julyan then told him that the second part of the punishment was that he was to be executed by firing squad the next morning. Until then, he was to be returned to his prison cell."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Zare Leonis was sent back to his prison cell, where he received a visit from Lieutenant Chiron. Chiron was still trying to save him. He had tried before to help Leonis find his sister and wondered why Leonis didn't come to him with his concerns. He told Leonis that the things he had seen were perversions of Imperial policy, but Leonis felt otherwise, that he had seen the true face of the Empire. Chiron offered to have his sentence commuted to enrollment in Project Unity, the same project in which his friend Ollet was enrolled, but Leonis was adamantly against this idea. Chiron insisted that Leonis at least talk to Ollet. Leonis agreed, but found the conversation unproductive, as the brainwashed Ollet simply tried to convince him that Project Unity had been helpful to him and there were shadowy individuals convincing people to rebel. He ordered Ollet to get out and then Chiron offered him a last meal and his choice of who would deliver it. Leonis used the meal as a trick by ordering two jogan fruits, the smell of which he used to remind Ollet of his family's jogan fruit orchards in the Westhills. The two then put into a action a hastily-concocted plan to rescue Leonis's sister."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The stripping of Zare's uniform and breaking of his saber was inspired by Han Solo's expulsion from the Imperial Academy in the Star Wars Legends titles Han Solo at Stars' End and the Dark Empire Sourcebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}