{"url": "Battle_of_Ylesia", "categories": ["Category:Legends articles", "Category:Battles of Ylesia"], "nodes": [{"tag": "h1", "text": "Battle of Ylesia"}, {"tag": "p", "text": "The Battle of Ylesia was fought in 0 BBY at the planet Ylesia by the Alliance to Restore the Republic against the t'landa Til and their Cult of The One and The All that was based on that world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alliance to Restore the Republic planned to attack the drug processing planet of Ylesia in order to capture spice to fund its operations and free the prisoners with the prospect of gaining recruits from the liberated pilgrims. Ylesia was under the control of the Besadii Hutt kajidic; as such, the Alliance received assistance from Jabba Desilijic Tiure, whose clan were mortal enemies of the Besadii. Jabba sent assassins to remove the t'landa til priests prior to invasion, in order to prevent them from using their empathic \"Exultations\" to slow the attackers."}, {"tag": "p", "text": "The Besadii themselves, however, had received aid from Black Sun, including the assistance of a mercenary regiment known as Nova Force, as well as a ground-based turbolaser placed in Colony One, which Jabba did not know about."}, {"tag": "p", "text": "The attack was carried out by the Alliance's Red Hand Squadron under the command of Bria Tharen, aided by a smuggler fleet provided by Jabba which included notable smugglers such as Han Solo, Lando Calrissian, and Chewbacca. The Squadron was divided up into nine units, one for each major colony on Ylesia. During the attack, at least one unit—lead by Jalus Nebl on board the Dream of Freedom—was destroyed by the turbolaser. Additionally, Jarik Solo was killed in a running lightfight."}, {"tag": "p", "text": "However, the Nova Force units were quickly overrun and surrendered to the Rebels. Red Hand Squadron looted a lot of spice and credits from Ylesia before blowing up the spice-processing facilities and storage warehouses. Meanwhile, Tharen and Solo went to the treasure room of the High Priest Teroenza. There, Teroenza ambushed them but before he could fire at Han, the t'landa Til was killed by Boba Fett, who had been hired by Durga Besadii Tai on a Priority Bounty to enact revenge for the deaths of Aruk Besadii Aora and Kibbick. The smugglers who helped to raid Colony One, however, were betrayed by Tharen, who took their share of spice and treasure in order to help finance the Alliance, acting on misinterpreted orders from her superiors within the Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}