{"url": "Trial_of_Ulic_Qel-Droma", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battles of the Krath Holy Crusade during the Great Sith War", "Category:Battles of the Senate", "Category:Legal trials"], "nodes": [{"tag": "h1", "text": "Trial of Ulic Qel-Droma"}, {"tag": "p", "text": "The Trial of Ulic Qel-Droma was a criminal proceeding carried out in 3996 BBY, which followed the Sith Lord Ulic Qel-Droma's arrest and subsequent charge of perpetrating a menace to galactic society. He was taken into custody by the Knights of the Jedi Order after being abandoned by an accomplice, the Sith sorceress Aleema Keto, following their Krath cult's failed surprise attack on the galactic capital of Coruscant. Qel-Droma was immediately placed under the jurisdiction of Supreme Chancellor Sidrona, who chided that death was the planned and acceptable restitution for the Sith Lord's crimes against the citizens of the Republic."}, {"tag": "p", "text": "Qel-Droma was shortly thereafter brought into the center of the Senate Hall to stand before the Republic Inquisition, where a list of offenses was read by Sidrona for all to hear. When asked to enter a plea on his own behalf, Qel-Droma denounced those present as short-sighted individuals who only served as obstacles in the way of the Sith Brotherhood's plan to restore a Golden Age of Sith splendor through conquest of the galaxy. It was then that Qel-Droma's Master, Dark Lord of the Sith Exar Kun, arrived with Mandalore the Indomitable and a cadre of Massassi warriors at his side to take control of the judicial proceedings."}, {"tag": "p", "text": "A Sith spell invoked by Exar Kun prevented anyone from intervening as the Dark Lord freed Qel-Droma and made his way to the Chancellor's podium. The present Jedi Knights were detained by the Massassi while Kun accosted Sidrona and, through the influence of his sorcery, forced him to profess both the insignificance of the Republic and the superiority of the Brotherhood of the Sith. Kun then murdered the Chancellor before the impotent masses, effectively eliminating the judge and jury whose determination it was to see Ulic Qel-Droma found guilty for his infractions. With none left to oppose them, the accused and his comrades prepared to depart but were delayed by the sudden arrival of Jedi Master Vodo-Siosk Baas. The Krevaaki Master attempted to reason with the Sith, but he too met his demise on the floor of the Senate Chamber in a duel with Exar Kun. The events that unfolded during Ulic Qel-Droma's trial only served as proof of what both he and Kun had previously stated: that the Galactic Republic was powerless against the machinations of the Sith."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3996 BBY, the warrior clans of Mandalore the Indomitable led an unprovoked attack on the seven planets of the Empress Teta star system. This onslaught brought the Mandalorians into direct conflict with the system's governing body, the Sith-inspired Krath cult. In response, Sith Lord and Krath leader Ulic Qel-Droma accepted a challenge of personal combat against Mandalore with control of either man's factions wagered as spoils for the victor. Qel-Droma triumphed over his opponent in battle on the planet Kuar's plains of Harkul, and he absorbed both Mandalore and his armies into the ranks of the Krath. Under Qel-Droma's heel, the combined Mandalorian and Tetan forces then commenced a series of raids on several instrumental starship construction facilities under the service of the Galactic Republic which were designed to augment the strength of the Sith military forces in preparation for an all-out war against their enemies. Plunder, destruction, and the deaths of innocents were their trademarks, and the swift efficiency with which Qel-Droma's force operated left the Republic unable to determine the identities of the aggressors at each turn. It was not until the Krath legions carried out an assault on the shipyards at Foerost did the Republic learn that, much to their dismay, Jedi expatriate Ulic Qel-Droma had been the mastermind behind these acts of piracy."}, {"tag": "p", "text": "Following the terrorist attacks on the Republic shipyards, Qel-Droma's next offense, a surprise attack on the galactic capital of Coruscant, ended in folly. He was betrayed and intentionally abandoned to his own resources by his lover, the Krath witch Aleema Keto, even as victory was in his grasp. Before he could escape, he was arrested by Knights of the Jedi Order to which he had once belonged. They imprisoned him within a wall of light—a fortress of light-side Force energy that blocked access to his Jedi powers. Custody of Qel-Droma was then given over to Supreme Chancellor Sidrona, who declared that not only would the Sith Lord stand trial for his crimes against the galaxy, he would most assuredly be executed for them as well."}, {"tag": "h2", "text": "The trial"}, {"tag": "h3", "text": "Inquisition begins"}, {"tag": "p", "text": "Ulic Qel-Droma was shackled and confined in total darkness within a cell until the hour of his arraignment. He was then escorted by a pair of Republic soldiers into the Grand Convocation Chamber of the Senate Hall and led to the center of the auditorium to face the entirety of the Galactic Senate, which comprised the body of the Inquisition that would oversee the criminal procedure. The Supreme Chancellor of the Republic, who presided over the trial as both judge and jury, towered over Qel-Droma on a podium much larger than the one on which the accused stood."}, {"tag": "p", "text": "Prosecution began without any further delay as Qel-Droma stood silently listening to Sidrona recite a long list of offenses. Destruction of Republic property, terrorism, and enslavement were among them; the most damning, however, was the accusation that Ulic Qel-Droma had forsaken his commitment of sworn service to the Galactic Republic as a Knight of the Jedi Order. When asked to enter a plea on his own behalf, the Sith Lord remained defiant and refused to even acknowledge the authority of the Inquisition. He instead excoriated the entire Republic as a self-serving, meaningless organization, one that was insignificant in the Golden Age that was to be restored by the efforts of the Brotherhood of the Sith. His claim rocked the Senate Chamber and horrified all those present, including Jedi Knights Nomi Sunrider and Sylvar, whose heads hung in shame at their fallen comrade's proclamation. His own brother, Cay, was also in attendance and rushed the Senate floor in disbelief of what he believed to be Ulic's Sith delusions. Cay attempted to enter a plea of trial incompetence for his brother but was rebuked by the same man on whose behalf he was trying to intercede."}, {"tag": "h3", "text": "Sith objections"}, {"tag": "p", "text": "Having discovered the nature of Aleema's betrayal, Mandalore the Indomitable prepared to rescue Qel-Droma by first going to Yavin 4 and requesting assistance from Qel-Droma's superior, Dark Lord of the Sith Exar Kun. The pair then traveled with Kun's Massassi warriors to Coruscant and stormed the Senate Hall in the midst of Qel-Droma's trial. Immediately seizing control of the Inquisition, Kun petrified the entire Senate body through a mind control spell and simultaneously used the Force to remove Qel-Droma's restraints. The enthralled senators of the Republic could do nothing to prevent Kun's interruption, but the unaffected Jedi rushed the Senate floor in opposition of the intruders. Nomi Sunrider pleaded for the defendant to entertain reason while Sylvar slaughtered several Massassi in combat. Kun, meanwhile, ascended the podium of the Chancellor, who himself called for his guards. When Sidrona realized their failure to respond, he futilely attempted to defend himself against Exar Kun, but the Dark Lord blocked the attack and bored his fingers into Sidrona's skull, forcing him to repeat the words of Kun's plan for galactic conquest to a captive audience as though he were a puppet. Kun closed by stating that his actions thus far had been a demonstration of the Republic's uselessness and that the Republic did not even factor into the Brotherhood's grand design of a galaxy ruled under the magnificence of a Sith Golden Age. He released his Force-empowered grip on Sidrona, whose lifeless body fell to the floor in a pool of his own blood. Kun then prepared to depart with his associates. When it appeared that no one dared to stand in the way, however, Jedi Master Vodo-Siosk Baas arrived and barred their exit. Not to be hindered, Exar Kun exchanged several words with his former teacher before the two of them engaged in a vicious duel. Kun was ultimately victorious, slaying the Krevaaki Master on the floor of the Senate Chamber. With the trial effectively over, Ulic Qel-Droma was absolved of guilt by his Sith Master. Together, they left to continue the war that they believed would precede the Sith dynasty wherein they intended to rule the galaxy."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Sith Brotherhood's flight from Coruscant and return to Exar Kun's temple on Yavin 4, Mandalore the Indomitable made Ulic Qel-Droma aware of Aleema Keto's attempt to leave him stranded on Coruscant. Qel-Droma realized that the Tetan empress had manipulated their partnership since its inception, and her actions on Coruscant were a result of her desire to eliminate the Sith Lord so that she might assume sole leadership of the Krath. He dealt with Aleema's treachery by allowing her to lead the next offensive on the Kemplex IX jump station, where she used an ancient Sith weapon far beyond her capabilities of controlling. The supernova that she caused annihilated her enemies, but consumed her as well—just as Qel-Droma had planned."}, {"tag": "p", "text": "Exar Kun continued to lead the Great Sith War with Ulic Qel-Droma at his side, defeating the Republic and Jedi repeatedly in battle, and they believed the Sith Brotherhood would indeed conquer the galaxy just as Kun had declared at Qel-Droma's trial. When the supernova that resulted from Aleema Keto's misuse of Sith powers at Kemplex IX forced the Jedi to evacuate the library world of Ossus, Kun and Qel-Droma led their forces in an invasion of the planet. While Exar Kun counted on the conflagration providing him with an opportunity to pilfer as much Jedi lore as he could obtain, he had not expected that Qel-Droma would ultimately betray him. After murdering his brother Cay in a lightsaber duel and being totally stripped of the Force by an outraged Nomi Sunrider, Ulic renounced his dark side ways and turned on Kun by assisting the Jedi in his final defeat at Yavin 4. Because of this, the vision of a Sith Golden Age spoken of by the Dark Lord during Qel-Droma's trial never came to pass."}, {"tag": "p", "text": "The ease with which Exar Kun entered the Convocation Chamber of the Senate to disrupt the trial of Ulic Qel-Droma caused the Galactic Republic to take preventative measures against such travesties from ever happening again. A modernized facility was constructed to replace the Senate Hall as the new venue for governmental affairs, but the Hall itself remained as a place of ceremonial reverence, occasionally used to house important high-profile events due to its large seating capacity. Thirty-three years after Ulic Qel-Droma's trial, the Inquisition convened again to determine the fate of another galactic criminal: the Mandalorian scientist Demagol."}, {"tag": "h2", "text": "Principal participants"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "h4", "text": "Sidrona"}, {"tag": "p", "text": "Sidrona was the Supreme Chancellor of the Republic during the Sith War. He was present on Coruscant when his friend Vodo-Siosk Baas arrived to discuss the possibility of Jedi involvement in the terrorist attacks that had been plaguing the Republic, though he was reluctant to believe what he perceived as a rumor. The Chancellor's worst fears were realized, however, when Minister of Defense Netus confirmed the criminal's identity as that of Ulic Qel-Droma. After the battle of Coruscant and Qel-Droma's subsequent apprehension, Sidrona felt that a preponderance of the overwhelming evidence would be enough to sway the senatorial Inquisition into accepting a proposition of capital punishment as penance for Ulic Qel-Droma's crimes."}, {"tag": "h4", "text": "Cay Qel-Droma"}, {"tag": "p", "text": "The younger son of Jedi Master Lien-Tsai Qel-Droma, Cay was one of the Jedi who, alongside his brother, were regarded as heroes following their success in eradicating the Onderon system of the oppression of the Sith. Cay was hesitant to allow his brother to embark on a lone infiltration mission to the Empress Teta system, and was devastated to learn that the mission resulted in his older brother's fall to the dark side of the Force. He also found it difficult to fathom Ulic as capable of committing the atrocities that he was accused of against the very Republic he had sworn to protect as a Jedi Knight. At Ulic's trial, Cay was dumbfounded when he heard his brother's response to the charges levied against him. He implored the senators to ignore Ulic's delusional tirade, but to no avail; Exar Kun had already arrived and incapacitated the entire Inquisition with his Sith sorcery. Cay was among those who watched helplessly as Kun freed his brother and killed both Sidrona and Jedi Master Baas."}, {"tag": "h3", "text": "Brotherhood of the Sith"}, {"tag": "h4", "text": "Exar Kun"}, {"tag": "p", "text": "Exar Kun was once a Jedi apprentice under Master Vodo-Siosk Baas on Dantooine whose curiosity about the ways of renegade Jedi led him into a quest to acquire Sith knowledge on his own, against the suggestions of his former teacher. Kun found that which he sought and embraced the dark side, eventually becoming Lord of the Sith. As the new Dark Lord, Exar Kun embarked on a campaign with Ulic Qel-Droma's Krath to destroy the Republic in preparation for the re-institution of a Sith Golden Age. Patience and meticulous calculation were his tools though, and he spoke against the hasty invasion of Coruscant that ultimately resulted in Qel-Droma's arrest. Nevertheless, when Mandalore the Indomitable arrived on Yavin 4 requesting Kun's assistance in liberating Qel-Droma from the clutches of the Republic, the Dark Lord obliged. He believed that the Republic was powerless against what was to come and demonstrated their impotence upon his arrival in the Senate Hall when he freed Qel-Droma, murdered the Supreme Chancellor, and killed Vodo-Siosk Baas shortly thereafter."}, {"tag": "h4", "text": "Ulic Qel-Droma"}, {"tag": "p", "text": "Former Jedi Knight Ulic Qel-Droma was once a hero of the Galactic Republic; however, his transgressions as a Dark Lord of the Sith far overshadowed any benevolence that had previously been associated with his character. Regardless of the headstrong assessment given by both his former Jedi allies and his current Sith Master Exar Kun, Qel-Droma believed that he and his Krath forces were powerful enough to overthrow the seat of the Galactic Republic on Coruscant itself. He had not counted on the treachery of Aleema Keto, which led to his arrest and subsequent trial as a war criminal. Even after being temporarily blocked from his Force powers and forced to answer to the Inquisition for his actions, Qel-Droma remained indignant and determined to show the Republic that their demise was at hand. To see their former comrade and loved one behave in this manner was enough to deeply upset the Jedi, although their expressed distress did little to sway him from the destiny he had chosen for himself."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Veteran Star Wars author Kevin J. Anderson penned the issue in which the trial of Ulic Qel-Droma appeared, being the third in Tales of the Jedi's Sith War story arc, titled the same as the actual event. Aleema Keto's betrayal of Ulic in the previous issue served as the plot device which allowed for Ulic's capture and prosecution in The Trial of Ulic Qel-Droma issue. Qel-Droma would return the favor in the next installment, Jedi Holocaust. Aside from its comic appearances, the trial was also mentioned in several pieces of source material, including both the Dark Side and Power of the Jedi Sourcebooks and the Essential and New Essential Chronologies as well."}, {"tag": "p", "text": "The Star Wars Insider 26 article Straight from the Horse's Mouth: A Guide to the Star Wars: Tales of the Jedi Universe, Part 1 says that the trial took place in 3991 BBY, while The Essential Chronology places the event at 3996 BBY. As Insider 26 contradicts many other established dates, this article treats the comic as being correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}