{"url": "Battle_of_Ylesia_(28_ABY)", "categories": ["Category:Legends articles", "Category:Battles of Ylesia", "Category:Battles of the Yuuzhan Vong War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle of Ylesia  (28 ABY)"}, {"tag": "p", "text": "The Battle of Ylesia was started after the New Republic and Chiss Ascendancy raided Ylesia during the Yuuzhan Vong War. A large fleet under Admiral Traest Kre'fey (including several Jedi forces, such as the infamous Kyp's Dozen, and the famous Rogue Squadron) had been assembled near Kashyyyk and spent several months harassing Yuuzhan Vong weak-points in hit-and-run tactics. Jedi Master Kyp Durron had received intelligence that the Ylesian Republic, had been assembled on Ylesia, a former Hutt slave world."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Durron and Kre'fey had initially wished to blitz the planet and destroy everything as a show of what would happen to collaborators, something they could easily accomplish due to the small size and bad cohesion of the Ylesian garrison. However, Jacen Solo proposed capturing the leadership for trial, something to provide a desperately-needed morale boost to the New Republic and a way to distract the HoloNet from something other than the bad progress of the war."}, {"tag": "p", "text": "At the same time, Thrackan Sal-Solo, diktat of Corellia and head of the Centerpoint Party, had been forced by Supreme Overlord Shimrra to assume the presidency of the Peace Brigade and the Ylesian Republic in return for Corellia being safeguarded from Yuuzhan Vong attack. A small Yuuzhan Vong force under Supreme Commander Maal Lah had arrived on the world to oversee the Ylesian military, and Pwoe, the claimant Chief of State of the New Republic, had arrived to negotiate a \"peace treaty\" between the New Republic and Ylesian Republic."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The New Republic force was split into three sections and included Interdictor cruisers so that enemy ships could not escape. While the Peace Brigade force, mostly composed of a handful of New Republic warships and starfighters stolen from earlier battles in the war, was mopped up with few casualties (around half of the New Republic fighter pilots were rookies), Jedi Knight Jaina Solo and General Tigran Jamiro led a ground insertion team into the Ylesian capital, Peace City. There, they managed to capture the entire Ylesian Senate, including Pwoe and Sal-Solo."}, {"tag": "p", "text": "Their escape was halted due to an ambush of Yuuzhan Vong warriors and the arrival of a Yuuzhan Vong reinforcement fleet, but Colonel Jagged Fel's leadership of Vanguard Squadron and Twin Suns Squadron helped evacuate the prisoners and soldiers with a minimum of casualties. The New Republic fleet escaped back to Kashyyyk safely, and the Peace Brigaders were placed on trial."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}