{"url": "Trickster", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Galactic Alliance starships", "Category:Interdictor starships", "Category:New Jedi Order starships", "Category:New Republic starships", "Category:Ro'ik chuun m'arh"], "nodes": [{"tag": "h1", "text": "Trickster"}, {"tag": "p", "text": "The Trickster, originally the Ksstarr, was a Yuuzhan Vong frigate analog renamed in the latter half of the Yuuzhan Vong War. It held three scourges of warriors. She was Executor Nom Anor's personal warship, but was stolen by Jacen Solo and Vergere to aid the rest of the Jedi strike team in their getaway after the Mission to Myrkr. Jaina Solo, who became the owner, first piloted the ship to Coruscant, hoping the New Republic could gain much-needed intel from a still-living Yuuzhan Vong ship. Upon their arrival, However, they found themselves in the midst of a large-scale battle. Realizing that it would be impossible to make contact with their allies, the Jedi opted instead to jump to the Hapes Cluster. Once the crew had arrived safely in the Hapes Consortium, the warship was closely examined by Jaina and Lowbacca, who used it to better understand how Yuuzhan Vong biotechnology worked. Renamed Trickster in honor of Yun-Harla, the so-called Trickster Goddess of the Vong pantheon, it was outfitted with a comm system and controls fit for normal usage, as opposed to the cognition hoods normally used by the ship's former masters. During Jaine and Lowie's efforts, much was learned about how the Vong fought their battles, with the result that work on several versions of countermeasures and other 'tricks' was begun. Trickster would serve as a testbed for many of these developments, which included the yammosk jammer."}, {"tag": "p", "text": "The ship was used as part of Jaina's efforts to become the embodiment of Yun-Harla, in an effort to destabilize and demoralize the enemy, particularly during the Battle of Hapes. Realizing that the ship's dovin basals bore unique gravitic signatures that differentiated the Ksstarr from other warships, she made copies of it and put them on ships piloted by Hapan pilots, making them appear to be the same ship, thus confusing the yammosks that coordinated Vong fleet movements and attacks. Throughout the course of several battles, the Trickster served Jaina and her crew of Jedi well, sowing confusion and providing the New Republic (and later the Galactic Alliance) with several key victories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}