{"url": "Tricia_Barr", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Reference work authors"], "nodes": [{"tag": "h1", "text": "Tricia Barr"}, {"tag": "p", "text": "Tricia Barr is a blogger, podcaster, and novelist who has covered Star Wars since 1977. She contributes to Star Wars Insider magazine and the official Star Wars Blog, and discusses Star Wars extensively on her blog and podcasts. She is one of the co-authors of Ultimate Star Wars (2015) and Star Wars: The Visual Encyclopedia (2017), both released by Dorling Kindersley. In 2018, she wrote Star Wars: The Dark Side, an in-universe reference book on the dark side of the Force and the characters who wield it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tricia Barr saw Star Wars when it premiered in 1977 and cosplayed Princess Leia for Halloween that October. Ever since, she has been a Star Wars fan. In recent years she has written solicited feature articles for Star Wars Insider magazine and contributed guest posts to the official Star Wars Blog."}, {"tag": "p", "text": "She also has contributed to the Suvudu blog for Del Rey and worked with Ashley Eckstein for Her Universe's Year of the Fangirl promotion in 2014. From 2012 to 2017 she organized and moderated a Star Wars panel at the annual GeekGirlCon convention in Seattle, Washington."}, {"tag": "p", "text": "In 2012 she provided editorial services for Del Rey on The Essential Reader's Companion, including fact-checking, prose clarity, interpretation of canon and continuity, and commentary on gender imbalance in summaries of then-Expanded Universe material. In addition, two pieces of artwork reprinted in the Essential Reader's Companion originated as commissioned artwork for her posts at Suvudu. She provided detailed source-material notes for artists Chris Trevas and Chris Scalf, respectively, for the depictions of the first kiss for Jaina Solo and Jagged Fel in Rebel Dream, and the battle involving Jaina and Tyria Sarkin Tainer against Mandalorians in Backlash."}, {"tag": "p", "text": "She founded FANgirl Blog in 2010, and continues to write frequently about Star Wars topics, including the movies, television, and novels and comics. She co-hosts the podcast Fangirls Going Rogue, the first all-female podcast discussing Star Wars from a fangirl perspective. She also co-hosts the monthly speculation and storytelling podcast Hyperspace Theories."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h3", "text": "Reference books"}, {"tag": "h3", "text": "Star Wars Insider"}, {"tag": "h3", "text": "The Official Star Wars Blog"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}