{"url": "Trinex-M", "categories": ["Category:Legends articles", "Category:Gases"], "nodes": [{"tag": "h1", "text": "Trinex-M"}, {"tag": "p", "text": "Trinex-M was a gas formed when the temporal effects of the Darkstaff infused some gas with the Dark side of the Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Circa 31 BBY, the Metatheran Cartel freighter Porthoy mined out some gas deposits in the Cularin system asteroid belt and then headed out of the belt to leave the system. However, just as it passed the planet Almas, the Porthoy was hit by Force lightning unleashed by the Almas Sith fortress in an attempt to destroy the Darkstaff, transporting the Cularin system ten years into the future to about 21 BBY. The Force lightning molecularly altered the gas aboard the Porthoy, changing it into something that could tap into an energy field similar to the Force. The Caarite crew of the freighter noticed that the gas had changed, but their instruments were too damaged to tell them how. They landed in the nearest neutral port, Oluna Biqua on Genarius, where they purchased a temporary laboratory to examine the gas inside. However, while the freighter was being unloaded, it was involved in an accident with a motorized loader. It tore open the side of the ship, which ignited a fuel line and caused an explosion that destroyed everything on board the ship, including a canister of the gas. The Caarites survived as they were already at their lab, studying the one remaining canister."}, {"tag": "p", "text": "They soon discovered that the gas gave mental powers to those that were exposed to it. This power resembled the Force, but was not part of it and could be controlled a lot more easily. It also created a surge in the Force around the host, which would allow them to wield Force powers without much effort. They also gave it its name, Trinex-M."}, {"tag": "p", "text": "However, the gas from the explosion had infiltrated the city's air circulation system and infected most of the population. Within a week, all the people there had been driven mad by their sensitivity to the Force. Only a few people remained uninfected, including Nestin Thokor, the city's Comptroller. When the Heroes of Cularin arrived in the city for a luxury holiday, he asked them to obtain a sample of the gas, so that his droid, I2-1A, could create an antidote. The heroes found the Caarite and obtained a sample of the gas, although before they did so, the Caarites were able to sent a information about the gas to a Cartel battleship that was near Cularin. The heroes took their sample back to I2-1A and he created an antidote, that was used to heal they city's population."}, {"tag": "h2", "text": "Appearances"}]}