{"url": "Trihexalon", "categories": ["Category:Legends articles", "Category:Weaponized chemicals"], "nodes": [{"tag": "h1", "text": "Trihexalon"}, {"tag": "p", "text": "Trihexalon, also called dragon's breath and hex for short, was a biological weapon of mass destruction. The Trade Federation's dragon's breath was formed from ore mined at Mount Merakan on Maramere, and refined and weaponized at a factory on Nod Kartha."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Trihexalon was infamous in the Karthakk system as a deadly and highly dangerous weapon; so much so that the Galactic Republic banned trihexalon because of its deadly potential. It was known to cause \"complete biomass conversion\" in victims, and could be refined to target individual beings or for use as a planetary bombardment weapon. In refined form, trihexalon was a dust-like substance that gave off a toxic, green glow, and became inert and stable at very low temperatures; a major reason for the factory being on Nod Kartha. Small doses like the sample produced for Toth could be held in special vials, and would react upon release, causing an energy burst capable of instantly killing Humanoids. A single, palm-sized vial contained enough dragon's breath to kill three hundred Wookiees, though simply shattering the vial would only generate a blast of a few meters in size. Although unclear, it is implied that the aftermath of a Hex blast is horrific and gruesome; Captain Cavik Toth immediately ordered droids to clean up the remains of Harro Ruuk and his subordinates after killing them with a sample vial they had just given him."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Captain Cavik Toth of Sabaoth Squadron first tested it by launching missiles and sending bombers to destroy Point Modie on Maramere, which would have killed approximately one thousand civilians had Jedi Master Adi Gallia not intervened and destroyed the missiles launched before impact, with the help of the Lok Revenants. She decided the threat should be eliminated, teaming up with the space pirate Nym and his crew. They broke through the orbital defenses at Nod Kartha, the planet churning out Hex weapons. With precision flying and teamwork, they were able to stop the further production of such weapons."}, {"tag": "p", "text": "During the Battle of Geonosis, Toth brought a fleet of Hex Deployers and Bombers to help the Confederacy of Independent Systems triumph over the Republic. Jedi Master Adi Gallia, her Padawan, Siri Tachi, Nym, and his Revenants plus a squadron of other Jedi, foiled Toth's evil ambitions by destroying his fleet of Hex weapons. Toth himself was killed in the battle."}, {"tag": "p", "text": "During the Battle of Skye, genetics terrorist Zeta Magnus threatened the planet with total destruction by unleashing a Trihexalon-based rooze, but was foiled in his plot by the efforts of Obi-Wan Kenobi, Anakin Skywalker, and Halagad Ventor."}, {"tag": "p", "text": "Sometime during the Clone Wars, a group of Padawans led by Mavra Zane and Chewbacca discovered a plot headed by Count Dooku and Shu Mai of the Commerce Guild to spread the deadly gas on Coruscant through the use of a Subjugator-class heavy cruiser that was modified for the distribution of the trihexalon. However, the plot was thwarted when Zane and Chewbacca, flying in the Star Runner, led the aforementioned group of Padawans into the Subjugator and destroyed the main reactor, subsequently destroying the battleship."}, {"tag": "p", "text": "In 41 ABY, Jaden Korr was led to a Thrawn-era Imperial research facility by a Force vision. There he found records requesting that the experiments in the facility be terminated by trihexalon gas protocol, indicating that knowledge of the gas either survived the Clone Wars, or a similar poison was later discovered by Imperial scientists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}