{"url": "Trill_(Force_Hound)", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Females", "Category:Force Hounds", "Category:Individuals of unidentified species", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Trill  (Force Hound)"}, {"tag": "p", "text": "Trill was a Force-sensitive humanoid slave of the Infinite Empire, trained as a Force Hound by the Rakata. She was a servant of Predor Skal'nas and rival of fellow Force Hound Xesh. She had discovered a planet strong in the Force in the Deep Core, but stated that it was impossible to reach because of the twisting lanes from black holes and stars. Xesh stated that he could do what she couldn't; this enraged her to the point that she attacked him. She was about to be killed by the stronger Force Hound when her master Skal'nas saved her and ordered Xesh to set out for the planet."}, {"tag": "p", "text": "Soon after these events, Skal'nas lost communication with the ship and brutally threw Trill around as he vented his anger for an opponent wishing to supersede him. Trill claimed that she would track Xesh to his destination. Skal'nas was assured that she could track her broodmate."}, {"tag": "p", "text": "As Trill reflected on the past, she recalled that as children she and Xesh looked out for each other, and how she used to protect him. But when pitted against each other, Xesh won, and suggested she be given to Skal'nas as an insult and gift simultaneously, thus sparing her from being eaten by her Rakatan master. Trill was shocked at his betrayal of her trust and was eager to make him pay."}, {"tag": "p", "text": "Trill arrived on Krev Coeur in search of Xesh and battled the hungry predators stalking the crystal mounts. Eventually, she came upon the Je'daii Journeyer Sek'nos Rath, who leapt onto her ship in freefall during a battle against Xesh and Daegen Lok. Trill concealed her identity as a Force Hound and sought to manipulate Sek'nos in hopes that he would lead her to Xesh, and provide information about Tython and the Je'daii."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Trill had a red tattoo on the face representing the letter Trill of the Aurebesh alphabet. She was incredibly enraged at the insults Xesh made of her skills, but was easily beaten when she attacked him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}