{"url": "Trigalis/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Republic planets", "Category:Juris sector planets", "Category:Shadowports", "Category:Swamp planets"], "nodes": [{"tag": "h1", "text": "Trigalis"}, {"tag": "p", "text": "Trigalis was a swamp-covered planet located within the Outer Rim Territories' Juris sector. Long before the Clone Wars, the trading post of New Coronet was founded on Trigalis, but over time the city degenerated into a busy center of various illegal activities."}, {"tag": "p", "text": "In 19.48 BBY, the Jedi Master Aayla Secura was assigned a mission to Trigalis. A month later, the planet was also visited by Jedi General Obi-Wan Kenobi, who was investigating rumors of the survival of Asajj Ventress, a commander of the Confederacy of Independent Systems believed to have been previously killed. Evading groups of local thugs attempting to rob him, Kenobi rendezvoused with Secura, who led him to the fortress of Xist, a local Black Sun enforcer with ties to the Confederacy."}, {"tag": "p", "text": "After nightfall, Kenobi attacked the fortress, causing several explosions and defeating many of the compound's guards. Finally, the Jedi engaged Xist himself in a vicious duel, demanding he surrender information on Ventress's whereabouts. Following his defeat, Xist intentionally provided Kenobi with a misleading tip, claiming that the Confederacy had sent a top agent to assassinate one of Xist's rivals at the world of Maramere. The following day, Kenobi left Trigalis in Secura's starfighter in order to recruit Jedi Knight Anakin Skywalker for assistance in preventing the planned assassination."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Trigalis was a planet located within the Trigalis system of the Outer Rim Territories' Juris sector. The Trigalis system lay on the hyperlane known as the Five Veils Route, which connected it to the Ninzam and Qeimet systems. The surface of Trigalis, which appeared blue and green from orbit, was covered by swamps that were overgrown with trees and were home to a species of yellow flying bird, as well as dark-blue winged insects."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic shadowport"}, {"tag": "p", "text": "The area of space surrounding the Trigalis system was explored between 1000 and 25 BBY. At some point long before the galactic conflict known as the Clone Wars, the city of New Coronet was established on Trigalis as a trading post. Over time, the city devolved into a haven for individuals indulging in criminal activities, most of whom were connected to the Black Sun syndicate, and the planet Trigalis became a famous shadowport."}, {"tag": "p", "text": "During the Clone Wars, Trigalis fell within the borders of the Galactic Republic, and in 22 BBY, the Republic's Fifteenth Sector Army was charged with engaging the military forces of the Confederacy of Independent Systems in the planet's vicinity. Around the date 19.48 BBY, while traveling through hyperspace after a mission to the world of Anzat, Jedi Master Aayla Secura told her fellow Jedi Tholme that she had been ordered by the Jedi Order to travel to Trigalis on a mission."}, {"tag": "h3", "text": "Kenobi's mission"}, {"tag": "h4", "text": "Hunting for leads"}, {"tag": "p", "text": "A month later, Jedi General Obi-Wan Kenobi engaged in a personal mission to confirm his suspicions that Asajj Ventress, a Confederacy commander believed to have been killed by Jedi Knight Anakin Skywalker, had, in fact, survived. To that end, Kenobi visited Trigalis, where he had arranged to meet with Secura in New Coronet, having been previously instructed by Grand Master Yoda not to allow his own mission to interfere with that of Secura."}, {"tag": "p", "text": "While Kenobi was still away from the city, a green-skinned swooper noticed the Jedi using his lightsaber. The swooper, together with seven other swoop-mounted thugs who were all intent on confiscating Kenobi's possessions, proceeded to pursue him through a stretch of Trigalis's swamps, peppering their quarry with blasterfire. Kenobi, who was wearing a mask and was also riding a swoop, crippled six of the pursuers' repulsorcraft, including one that he destroyed with a thrown explosive. Heading for New Coronet, Kenobi disposed of another pursuer when the latter crashed his swoop in a bridge on the settlement's outskirts. Arriving in the city, Kenobi dismembered his lone remaining pursuer, causing him to crash as well."}, {"tag": "p", "text": "Immediately thereafter, a group of Black Sun thugs surrounded Kenobi and demanded he surrender his money and lightsaber. Refusing, Kenobi proceeded to throw one of the thugs through the window of a nearby cantina. Inside, he met with Secura. Removing his mask, Kenobi let Secura introduce him to New Coronet while escorting him through the city's streets toward the personal fortress of Xist, the Falleen local Black Sun authority who was providing weapons and intelligence to the Confederacy."}, {"tag": "h4", "text": "Tips and lies"}, {"tag": "p", "text": "Kenobi refused any further assistance from Secura and waited until nightfall before entering the fortress. Once inside, the Jedi prevented alarms from triggering early. He then defeated many of Xist's guards—leading Xist to believe at first that an entire army had invaded the compound—and in the process caused several explosions that were noticed by the city's residents. Finally, Kenobi confronted Xist and requested the enforcer give information to him. In response, the Falleen drew his vibrowhip, leading the two to engage in a vicious duel. During the fight, Kenobi continued to demand that Xist reveal the location of Ventress. When he was finally defeated, the Black Sun leader agreed to reveal to the Jedi what little he knew about Ventress's survival."}, {"tag": "p", "text": "Xist then invited Kenobi to another room of the fortress and told the Jedi that he could not confirm the veracity of rumors about Ventress's survival. The Falleen did, however, know that the Confederate leader, Count Dooku, had sent one of his best agents to assassinate Xist's rival, the arms dealer Drama Korr. Xist also told Kenobi that the hit on Korr would occur when the merchant arrived at the Karthakk sector world of Maramere in a few days' time. In truth, the enforcer had intentionally provided misleading information to Kenobi, as the agent assigned to kill Korr was the bounty hunter Durge, not Ventress, as Kenobi assumed."}, {"tag": "p", "text": "The following day, Kenobi contacted the Jedi High Council on the planet Coruscant via hologram. He was then seen off at a landing platform by Secura, who had loaned Kenobi her starfighter so that he could travel to the Mid Rim planet Naboo in order to recruit Anakin Skywalker's assistance in preventing the assassination of Korr."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "Trigalis was located just outside space controlled by the Galactic Empire by 19 BBY. That year, Imperial military forces commanded by Grand Moff Octavian Grant passed through the Trigalis system as they pursued Marath Vooro, the former Customs Vizier of the disestablished Trade Federation, from the planet Farstine down the Five Veils Route."}, {"tag": "p", "text": "Around 2 BBY, the Zelosian thief and smuggler Celot Ratua Dil visited a port pub on Trigalis to enjoy a mug of ferment. During his stay there, the Zelosian started haggling over previously stolen meelweekian silk with a member of a pirate gang who was also present in the bar. Unfortunately for Ratua Dil, he was promptly arrested by local authorities, who assumed he was also a pirate. Since the judges presiding over the Zelosian's case were convinced he was guilty of at least some criminal transgressions, if not the original accusation of piracy, he was sentenced to imprisonment on the Atrivis sector prison planet Despayre."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The population of the Trigalis system around 25 ABY was between 10 million to 100 million. Representatives of several sentient species were present in the city of New Coronet on Trigalis. The species' mix included Humans, a number of whom were employed as guards in the fortress of Black Sun authority Xist. Several inhabitants of Trigalis spoke Galactic Basic Standard."}, {"tag": "p", "text": "Individuals accused of breaking the law on Trigalis could offer to undergo a truth-scan in order to determine their innocence, on the condition that they would reimburse the expenses involved in the procedure. If the defendant lacked the means to pay for a truth-scan, the judges arbitrating the case could choose to fund the procedure using tax income."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The primary port city of Trigalis, New Coronet was a settlement consisting of red-hued, run-down buildings located in an elevated area overlooking a swamp. There were at least two wooden pedestrian bridges and a pier on the city's edge. Originally founded as a trading post, New Coronet had already become a center of illicit activities decades before the Clone Wars erupted, catering to the needs of murderers, pirates, spice dealers, and gamblers, most of whom had ties to the Black Sun organization. Nevertheless, many travel guides continued to designate the city as a trading post."}, {"tag": "p", "text": "During the Clone Wars, New Coronet was controlled by the Black Sun leader Xist from a heavily guarded stone fortress located inside the city. The compound featured a central tower; a room that had one wall lined with several different bladed weapons, firearms, and various trophy skulls; and a room with a balcony and a large stone table. In the last of these rooms, a pair of wheeled servant droids was present and catered to Xist and Obi-Wan Kenobi during their conversation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trigalis first appeared in the first issue of the Star Wars: Obsession comic series. The comic was published in 2004, and was written by Haden Blackman and penciled by Brian Ching. The 2009 reference book The Essential Atlas placed the Trigalis system, and therefore the planet Trigalis, in grid square P-17."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}