{"url": "Trinkatta_Starships", "categories": ["Category:Legends articles", "Category:Shipwrights"], "nodes": [{"tag": "h1", "text": "Trinkatta Starships"}, {"tag": "p", "text": "Trinkatta Starships was a company that specialized in the production of a variety of starships. Established by the Kloodavian businessman, Boll Trinkatta, the company was headquartered in the city of Calamar on the planet Esseles. A short time before the Invasion of Naboo, Trinkatta Starships was contracted with the construction of fifty vulture droid starfighters to be equipped with hyperdrives. This order proved highly suspicious with the Galactic Republic due to the expansion of the Trade Federation, and they contacted the Jedi High Council to investigate who had placed the order. The council sent the Jedi Master Adi Gallia to search the company's headquarters. Unfortunately, she disappeared during the investigation, leaving the identity of the mystery person unknown."}, {"tag": "p", "text": "It was eventually revealed that the design of the droid starfighters was implemented by the Xi Char, who had ties to the Trade Federation. Trinkatta Starships' factory was run almost completely by droid control, and Boll Trinkatta had been unaware of the Trade Federation's ties to the project. After discovering the Xi Char's involvement, Trinkatta refused to help, trying to cancel the order. However, the order continued to be processed after Bartokk assassins captured Trinkatta and reprogrammed the factories' droids. When Adi Gallia had arrived, the reprogrammed droids had incapacitated her, and the Jedi Council sent a task force of four Jedi—Qui-Gon Jinn, Obi-Wan Kenobi, Noro Zak, and Vel Ardox—to continue the investigation. The group shut down the starfighter's production, and Adi Gallia was rescued and sent to a Jedi chapter house for recuperation. However, several of the specially equipped starfighters were commandeered by the Bartokk assassins which they planned to use against the Jedi who had foiled their plot. They eventually got their chance by attacking the Jedi task force that had been sent to the Corulag Academy."}, {"tag": "p", "text": "The entire operation had been orchestrated by Darth Sidious, who wished for the droid starfighters to be used to take over the planet Brentaal. The capture of this planet would allow the Trade Federation to control trade routes through the Hydian Way and the Perlemian Trade Route, increasing their influence for Sidious' benefit. The failure of the project had an untold effect on the Dark Lord of the Sith's plans."}, {"tag": "h2", "text": "Appearances"}]}