{"url": "Tripion", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of unspecified diet", "Category:Crustaceans", "Category:Desert creatures", "Category:Species of undefined sentience", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Tripion"}, {"tag": "p", "text": "The tripion was a crustaceous species with three venomous tail stingers and over 600 different subspecies. They were best suited to live in the deserts of hot worlds, including the moons Gall and Yavin 13, with the species' diet consisting of small lizards and insects."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "There were more than six hundred different subspecies of the crustaceous tripion discovered, which ranged in size from less than one meter up to eighteen meters tall. Tripions had pincers, spider-like legs, and generally three venomous stinger-tipped tails. Based on the subspecies, the sting could be simply annoying, or even deadly. One subspecies of tripion, found on the planet Thrantin, had six spider-like legs, but no pincers. Another subspecies, found on the moon Gall, had four legs, two antennae, two pincers, stood upright, and had only one tail."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Although tripions could withstand high amounts of heat on moons like Gall and Yavin 13, they would spend the day under stones, and would come out at night. They hunted insects and small lizards, and could sting with their tails three times in rapid succession, but would only do so if the prey was struggling, or if the prey was large."}, {"tag": "h2", "text": "Tripions in the galaxy"}, {"tag": "p", "text": "When the young bounty hunter Boba Fett was on the desert planet Tatooine to find work from the Hutt crime lord Jabba the Hutt in 22 BBY, Fett saw a tripion from Gall in a cage on Jabba's sail barge. The tripion slammed its poisonous tail against the cage and clicked its pincers, and a guard poked it with his sword for his and his comrades' entertainment."}, {"tag": "p", "text": "When a group of trainees from the Galactic Outdoor Survival School was partaking in their final test on the planet Thrantin, one member of Twilight Class, Xenon Nnaksta, was attacked by a tripion. He was saved by another member of Twilight Class, Derembus Sitnalta, who in turn sustained a bad, but non-lethal, sting in doing so."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tripions were first mentioned in the first and second editions of Galaxy Guide 2: Yavin and Bespin, released in 1989 and 1995, respectively. They were later mentioned in the Star Wars Roleplaying Game supplement Alliance Intelligence Reports, which was released in 1995. In The Essential Guide to Planets and Moons tripions were referred to as \"Gallian tripions,\" while in Boba Fett: Hunted they were referred to as \"Gallion tripions\". This subspecies from Gall, however, only possessed one stinger tipped tail."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}