{"url": "Trition_Trade_Route", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Outer Rim Territories hyperlanes"], "nodes": [{"tag": "h1", "text": "Trition Trade Route"}, {"tag": "p", "text": "The Trition Trade Route was a commercial hyperlane located in the Outer Rim Territories at the edge of the galaxy. A continuation of the Rimma Trade Route—a major hyperlane that connected the Core Worlds to the Outer Rim—the Trition Trade Route commenced at the planet Karideph in the Minos Cluster, extending into the remote Kathol sector before eventually terminating at Gandle Ott. The Trition Trade Route linked several important worlds in the sectors together, and placement on the Trition aided each planet's development and economic growth by giving them easy access to outside trade."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Trition Trade Route was a continuation of the Rimma Trade Route, a major commercial hyperlane that connected the Core Worlds to the Minos Cluster in the Outer Rim Territories. The Trition commenced in the Minos Cluster from the planet Karideph, before stopping at Pergitor. The Trition then passed out of the Minos Cluster, and headed deep into the Kathol sector on the edge of known space. The Trition included the Kathol sector capital, Kal'Shebbol, the worlds of Torize, Kolatill, and Charis, and terminated at the planet Gandle Ott in the Ott system. The majority of planets on the Trition were noted for having large industrial and manufacturing bases—large, at least, by the standards of planets within the Outer Rim Territories and beyond."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Trition Trade Route was established at some point after 592 BBY. Before that year, the Kathol sector was largely unexplored and unsettled. Gandle Ott was the first planet to be colonized in the entire sector, and was settled around 592 BBY. The majority of the planets that made up the Trition were in the Kathol sector, and were colonized later than Gandle Ott. Around 392 BBY, the planet Kal'Shebbol was settled by escaped Twi'lek slaves. The planet was chosen due to its relative isolation, but it also because of its position on a trade route to Gandle Ott. By 8 ABY, the Trition Trade Route was a vital link in the Kathol sector economy, linking the isolated settlements to the Minos Cluster, and many of the sector's most important and successful worlds were located on its length. Gandle Ott, the terminus for the Route, was also considered the last major planet in the sector before entering the \"wilderness,\" of the Kathol sector, demonstrating that a position of the Trition affected a planet's economy and development substantially by offering access to outside trade."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Karideph"}, {"tag": "p", "text": "Homeworld of the insectoid Kari, Karideph was located at the junction of the Rimma and Trition Trade Routes in the Minos Cluster. Heavily overpopulated, the planet's primary industry was food production, with all available landmass devoted to agriculture. Despite this, the Kari required constant imports of food, and exported small appliances and machinery. Under the rule of the Galactic Empire, Karideph was forbidden from developing or acquiring space flight technology as Imperial authorities feared that, if the Kari ever left their homeworld, their prodigious breeding rate would see them overrun the galaxy."}, {"tag": "h3", "text": "Pergitor"}, {"tag": "p", "text": "Located in the Minos Cluster, Pergitor was a mining planet settled by workers from the Jesa Corporation. Formerly a lush and fertile world, the inhabitants were forced to retreat to sealed settlements when over-mining caused volcanic eruptions that poisoned the atmosphere and scoured the native ecosystem. A despotic theocracy governed Pergitor, heavily restricting the day-to-day life of the population. Minerals were the world's main exports, while machinery was the major import. An extensive black market thrived on the planet, smuggling in luxury goods."}, {"tag": "h3", "text": "Kal'Shebbol"}, {"tag": "p", "text": "Sector capital of the Kathol sector, Kal'Shebbol was founded approximately four centuries prior to the Galactic Civil War. As the colony grew, the planet became a major trading post, and was eventually named as the sector capital when the Kathol sector was formally inducted into the Galactic Republic. During the Galactic Civil War, the planet was under the rule of Imperial Moff Kentor Sarne, who later withdrew the sector from the Empire in 4 ABY following the death of Emperor Palpatine. The planet was liberated by the New Republic in 8 ABY."}, {"tag": "h3", "text": "Torize"}, {"tag": "p", "text": "A volcanic planet in the Kathol sector, Torize was a major industrial and manufacturing hub. Ringed by space stations, the planet suffered an industrial accident that released toxins into the atmosphere in 5 ABY. The pollutants worsened the already harsh atmosphere, with inhabitants requiring breath masks while outside. In 8 ABY, the world underwent an internal power struggle following the breakdown of Imperial authority in the sector."}, {"tag": "h3", "text": "Kolatill"}, {"tag": "p", "text": "Located in the Kathol sector, Kolatill's main industry was the production of repulsorlift vehicles and parts. Placed under martial law in 0 ABY by Governor Tetrum—the Imperial administrator of the planet—all factories and plants were ordered to produce combat speeders for the ground elements of Moff Sarne's forces. Following the liberation of Kal'Shebbol in 8 ABY, the population of Kolatill overthrew their governor, although they suffered a reprisal attack when Imperial forces bombed their capital city of Domaz."}, {"tag": "h3", "text": "Charis"}, {"tag": "p", "text": "The planet Charis, located within the Kathol sector, had industries devoted to manufacturing and information technologies. Originally a world with a population of one billion inhabitants, a civil uprising against Imperial forces in 4 ABY resulted in the deaths of over one hundred fifty million beings and the destruction of several major cities."}, {"tag": "h3", "text": "Gandle Ott"}, {"tag": "p", "text": "The end point of the Trition Trade Route, Gandle Ott was located in the Ott system of the Kathol sector. With several billion citizens and a large industrial base, Gandle Ott was considered to be the last major world of the sector. Nominally allied with the Empire, the local inhabitants did not mind their presence, as they generally left the population alone. However, in 8 ABY, the majority of Imperial forces were pulled out by Moff Sarne as he retreated from the sector following the fall of Kal'Shebbol. Left alone, the planet's remaining authorities were torn between remaining with the Empire, or allying themselves with the New Republic."}, {"tag": "h2", "text": "Travel times"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trition Trade Route originated in 1995's The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games. All of the Kathol sector planets on the Route were established in this book, as was the fact that the Route ran to Karideph in the Minos Cluster. The Route was subsequently referred to in the 1997 supplement Lords of the Expanse, in a section detailing the Rimma Trade Route. Here, it was established that the planet Pergitor was also part of the Route, and that Karideph was also its starting point. Both Pergitor and Karideph had already been established in 1994's Galaxy Guide 6: Tramp Freighters as part of the Minos Cluster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}