{"url": "Trinn", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Trinn"}, {"tag": "p", "text": "Trinn was the uncle of Rebel Alliance starfighter pilot Keyan Farlander and lived with his wife, Mimya, on Oorn Tchis in the Lahara sector. After the Imperial attack on Farlander's hometown of Tondatha on Agamar, Farlander asked his aunt and uncle to look after his sister, Kitha, who was injured in the attack."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Imperial era, Trinn lived with his wife Mimya on Oorn Tchis, a small, rural planet in the Lahara sector of the Outer Rim Territories. In 0 BBY, the Galactic Empire destroyed Tondatha, the home town of Trinn's nephew, Keyan Farlander, on the nearby agriworld Agamar, in retaliation for alleged sedition by its residents. Farlander's mother and father were killed and his sister, Kitha, was left badly burned. Unable to provide her with the treatment she required, Farlander sent Kitha to live with his uncle and aunt. The couple ensured that their niece received care around the clock, although she did not initially respond to treatment. After Farlander joined the Rebel Alliance, they wrote to him aboard the Mon Calamari Star Cruiser Independence to update him on his sister's condition."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Trinn was created by Rusel DeMaria and was mentioned in the narrative sections of X-Wing: The Official Strategy Guide, a strategy guide that accompanied the 1993 LucasArts video game Star Wars: X-Wing and told the story of Keyan Farlander, the game's player-character. The character does not have an entry in 2008's The Complete Star Wars Encyclopedia, but is mentioned in Mimya and Kitha Farlander's entries. Although Farlander is described as Human, Trinn's species is not stated in X-Wing: The Official Strategy Guide."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}