{"url": "Trisstan", "categories": ["Category:Legends articles", "Category:Anointed People", "Category:Kings", "Category:Males", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Trisstan"}, {"tag": "p", "text": "Trisstan was the Godking of Masterhome, supreme monarch of the Anointed People, from c. 39 BBY to at least 0 ABY. A shrewd ruler, he took his people to peace and prosperity and was also responsible of Abonshee joining the Alliance to Restore the Republic in their fight against the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Trisstan became the Godking of Abonshee c. 39 BBY. He used intelligently the taxes to give the people what they wanted, he maintained good public relations while pretending to be less clever than he were, and he kept his enemies fighting each other. With this combination, Trisstan was responsible of a four-decade golden age for his people like none other. At that time, Abonshee had no starship technology. Some of the Anointed People, including Trisstan, were aware of the existence of alien civilizations, but not of their goals or powers."}, {"tag": "p", "text": "Around the time of the Battle of Yavin, Abonshee was visited by a spacer named Jayhawk. Jayhawk claimed to want the planet for the Alliance to Restore the Republic in their fight against the Galactic Empire. Jayhawk, a galactic con man, was only pretending to be a member of the Alliance. He obtained an audience with Trisstan and, for several days, both king and pilot discussed about that possibility. Jayhawk tempted Trisstan offering him a supposed elixir of eternal life."}, {"tag": "p", "text": "One night, Jayhawk killed two guards, stole hundreds of kilograms of gold and jewelry from the Royal treasure and left the planet. Trisstan understood that he had been tricked, and silenced all the informed subjects to avoid a public relation disaster."}, {"tag": "h3", "text": "Rebel visitors"}, {"tag": "p", "text": "Some months later, real representatives of the Alliance visited Abonshee, wanting to establish diplomatic relations and to offer technology, except for weapons, and qualified personnel in exchange for food. While their ship Long Shot remained idle, the diplomats, members of the Green squad, were directed to Trisstan, as he was the only one who could sign any valid treaty."}, {"tag": "p", "text": "Trisstan had all the reasons to mistrust the newcomers, after his past history with Jayhawk. He decided to test the moral values and the power of these self-proclaimed ambassadors: If they were as bad as Jayhawk had been, he would imprison them; if they were really who they claimed to be and they were strong to succeed, then Abonshee would join their cause and Trisstan would apologize and explain them about Jayhawk."}, {"tag": "p", "text": "Trisstan met with these people pretending to be a lazy figurehead kept in power only by the strength of his guards and because his court could manipulate him. During the audience, he questioned the Rebels about the nature of the Empire's supposed evil, their own morality and the benefits of technology. He claimed he would think about it and invited the ambassadors to a banquet for dinner."}, {"tag": "p", "text": "During the banquet, Trisstan tested the Rebels's biology by flavoring their food with a midly toxic substance. He also tested their honesty asking Godling Satrank to pretend to be a claimant to the throne looking for allies to depose Trisstan. Trisstan tested their might by defying one of the guests to a wrestling match against the Godking himself. Lastly, he tested their greed by making a guard offer gold in exchange for a blaster."}, {"tag": "p", "text": "That night, Trisstan hired one working-class Unwashed to secretly infiltrate in the rooms of visiting alien diplomats and steal their equipment to test their alertness. He promised the Unwashed some gold coins even if he got caught."}, {"tag": "p", "text": "In successive days, Trisstan asked the aliens to give proof of their technology, as he was unfamiliar with his limitations: He was afraid they could be telepaths, so he asked them to perform any feat he could be impressed at, from healing the injured to stopping the sun in the sky. He also tested them by going on a hunt of griffs with them and twenty-five friends, riding native likkas. This was an accidented hunting, as they were interrupted by a ferocious, garguantuan predator known as the eater."}, {"tag": "h3", "text": "Against the Empire"}, {"tag": "p", "text": "During the negotiations, a damaged Imperial shuttle approached Abonshee intending to land to perform unforeseen repairs. Seeing it coming, the ship Long Shot jumped to hyperspace to group with some reinforcements, leaving behind the Green squad of diplomats. These people were suggested to lay low until the Long Shot could return."}, {"tag": "p", "text": "The Imperial Curich-class shuttle, Resurgence landed. Thirty stormtroopers left the ship and immediately surrounded it. Trisstan wanted to know what these newcomers wanted. Trisstan ordered Grissom, a Godling, to go there with a twentyfive-person Honor Guard and question these people. Grissom obeyed and, en route, one stormtrooper ordered him to stop. Grissom then doubted, but he eventually kept walking, showing his hand. The trooper shouted again, and then the Imperials fired on Grissom, his Guard and any civilian in range."}, {"tag": "p", "text": "Trisstan retreated to his palace with his entourage and the diplomats. He officially joined the Alliance in the name of Abonshee, if only to get rid of the murderers. He also prepared a less-than-optimal military strategy of full frontal attack with two hundred cavalrymen that could kill one easily hundred and seventy-five of those. Trisstan's followers were loyal to the point of supporting this numbers, but Trisstan himself tried to look for any alternative to reduce the bloodshed."}, {"tag": "p", "text": "Finally, with the help of the Rebel Alliance, the Empire was defeated. The Godking knighted the Green squad with two titles, \"Assistant Demi-gods\" and \"Heroes of the Realm\" and the Anointed People partied to celebrate their victory."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Intelligent and crafty, Trisstan ruled his people to a golden age, giving the people what they wanted and manipulating any enemy against any other foe. At the same time, he tried to give an image of incompetence, complacency and slovenliness even during ceremonial events. All of this was a charade to hide his real knowledge, which went far beyond anyone suspected. Nevertheless, Trisstan could be deceived, as proofed by Jayhawk."}, {"tag": "p", "text": "Although he was particularly short for a member of his species, probably no more than 150 centimeters, Trisstan was a great warrior, hunter and wrestler, among the strongest of his people."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars Miniatures Battles features an image of the Anointed People fighting stormtroopers \"for the greater glory of the Godking.\" Which Godking they are fighting for has not been confirmed, but it might be for Trisstan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}