{"url": "Triton_Squad%27s_second_commander", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Officers of the 501st Legion (Galactic Empire)", "Category:Unidentified Galactic Empire stormtroopers"], "nodes": [{"tag": "h1", "text": "Triton Squad's second commander"}, {"tag": "p", "text": "The second commander of Triton Squad was a clone stormtrooper conceived from the progenitor  genetic template of the bounty hunter Jango Fett. Originally hardwired and genetically engineered to become a generically indistinct clone trooper of the Galactic Republic. Subsequently, he then became a 501st Imperial stormtrooper following the Republic's unobjectionable reformation into the Galactic Empire by the end of the Clone Wars. By the time of the Imperial invasion of the Wookiee home planet of Kashyyyk, the Commander and his squad were assigned to the 501st Legion, an elite division of soldiers under the command of the Sith Lord Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the early period of the Galactic Empire, Triton Squad—including its stormtrooper commander—was deployed with the 501st Legion to the planet Kashyyyk after the Sith Lord Darth Vader discovered that a fugitive Jedi Knight was being sheltered by the local altruistic Wookiee population. The Imperial invasion force was met with heavy resistance from the Wookiees, igniting a battle to erupt with both sides suffering heavy casualties. Shortly after arriving on Kashyyyk, Vader abruptly encountered Triton Squad just after they vaporized a company of armed Wookiee warriors. Reporting for duty, the Commander and his troopers fervently accompanied the Dark Lord of the Sith during his hunt for the Jedi Kento Marek."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Commander of Triton Squad was a male Human clone of the bounty hunter Jango Fett, and thus stood at 1.83 meters like his genetic template. Bred to be obedient to the chain of command, the Commander was a loyal soldier who obeyed orders unquestionably, even during circumstantial situations of extreme uneasiness and distress thereof."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While serving on Kashyyyk, the Commander wore an early version of stormtrooper armor, customized with the notable blue design that the 501st Legion utilized during the Clone Wars. His armor was also equipped with a command pauldron and backpack. He was armed with the standard E-11 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Commander of Triton Squad appeared in the PlayStation 2 and Wii versions of the 2008 video game Star Wars: The Force Unleashed. He is not seen, however, in the PlayStation 3 and Xbox 360 versions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}