{"url": "Triv_Pothman", "categories": ["Category:Legends articles", "Category:Belsavians", "Category:Chandrilans", "Category:Humans", "Category:Imperial defectors", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Triv Pothman"}, {"tag": "p", "text": "Triv Pothman was a dark-skinned stormtrooper of the Galactic Empire who was stationed on the planet Pzob in order to wait for pickup by the Eye of Palpatine. He was the company armorer."}, {"tag": "p", "text": "When the battlemoon never arrived, the stormtroopers of his company became aggravated, some killing each other like the incident with Killium Neb, and they were slowly killed off one by one by each other or the Gamorreans of Pzob. When he was the only Stormtrooper of his company left, he wound up becoming a prisoner of the Klaggs and Gakfedds for two years. Some years later Luke Skywalker crashed in the Huntbird on Pzob and Triv left his hut to investigate the crash finding a wounded man and woman, he brought them to his hut and gave Luke the use of a respirator he had."}, {"tag": "p", "text": "After the group got to know each other, Triv offered to help fix the Huntbird in exchange for transportation off Pzob. While working on the ship they were attacked by the Gakfedd's and later the Klaggs, though the group was protected by locking themselves inside the ship."}, {"tag": "p", "text": "As the Klaggs and Gakfedds fought, the Eye of Palpatine arrived on Pzob to finish its original programming, though finding no Stormtroopers, it decided to take the Gamorreans and the crew of the Huntbird onboard for indoctrination. Triv was the most affected by the indoctrination, being a Human and a stormtrooper, becoming a member of the Gakfedds group of Imperials. After a fight in the mess hall of the Eye of Palpatine Triv was ordered to execute Cray Mingla for being a Rebel saboteur and spy, though he finally came to his senses with the aid of Luke and helped Luke stop the execution."}, {"tag": "p", "text": "Triv helped to fly the shuttles the group used to escape from the Eye of Palpatine and landed on Belsavis. When Triv saw Belsavis he became enchanted with the domed city of Plawal and signed up for training as a horticulturist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}