{"url": "Triumph_(Victory-class)", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:New Republic starships", "Category:Victory-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Triumph (Victory-class)"}, {"tag": "p", "text": "The Triumph was an Imperial Star Destroyer serving under Director of Imperial Intelligence Ysanne Isard. It was one of two ships left to defend Imperial Center against the impending New Republic invasion. It was captured by the Mon Remonda after having received heavy damage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Triumph's class was never specified, but well before the battle, Admiral Gial Ackbar stated that approximately seven Victory-class Star Destroyers were on station defending Imperial Center. It was also stated that both sides' Star Destroyers traded missiles during the battle, something Imperial-class Star Destroyers do not have, lending more credibility to the ship being a Victory-class Star Destroyer."}, {"tag": "h3", "text": "Reputation"}, {"tag": "p", "text": "Although tasked with the defense of Imperial Center, the Triumph was not known for its illustrious reputation or crew. As a result, Isard chose it to defend the planet during the Seizure of Coruscant along with the Star Destroyer Monarch, which had a similarly unimpressive reputation."}, {"tag": "p", "text": "Isard wanted Coruscant to fall to the Rebel hands so that the New Republic would find its bacta resources devastated by an outbreak of the krytos virus. Therefore, it is likely Isard knew the Triumph and Monarch would be either captured or destroyed during the battle. She essentially left them for dead, choosing to instead relocate the superior Star Destroyers Emperor's Will and Imperator."}, {"tag": "h3", "text": "Capture during Coruscant battle"}, {"tag": "p", "text": "Early during the battle, Triumph took heavy fire by the New Republic's Star Destroyers Emancipator and Liberator, causing some of its shields to collapse. The captain executed a roll to bring undamaged shields up between the Triumph and the Rebels, but after the Mon Calamari Cruiser Home One joined in the assault against it, the remaining shields failed."}, {"tag": "p", "text": "On Admiral Ackbar's orders, the Mon Calamari Cruiser Mon Remonda then engaged the Triumph with turbolaser and ion cannon fire, damaging it enough that assault shuttles were able to safely join in directly attacking it."}, {"tag": "p", "text": "Soon, the Triumph lost power and started heading slide back into the Coruscant atmosphere. Ackbar ordered Mon Remonda Captain Onoma to use his tractor beams to pull the Triumph along and accelerate its orbit so that it would not decay. It was then captured by the New Republic, shortly before the Monarch also surrendered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Victory-class Star Destroyer named Triumph took part in an ambush of the Nebulon-B frigate Rehz'nor in the game Star Wars: X-Wing vs. TIE Fighter. The exact time and location of the battle are unknown, but it would presumably have been before the Battle of Endor. Triumph may be forced to withdraw by breaking through its shields, and it is possible to destroy it in the mission. If this is the same Triumph, it can be surmised that the Legends result of that battle was the Triumph successfully escaping to hyperspace, as well as lending to the notion that the Triumph captured was, in fact, a Victory-class Star Destroyer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}