{"url": "Triumph_(Theta-class_T-1_vessel)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Starships of the Order of the Sith Lords", "Category:Theta-class T-1 vessels"], "nodes": [{"tag": "h1", "text": "Triumph (Theta-class T-1 vessel)"}, {"tag": "p", "text": "The Triumph was a Cygnus Spaceworks Theta-class T-1 vessel owned by Dark Lord of the Sith Darth Bane. Bane flew in the shuttle on a mission to the Deep Core planet Prakith in 980 BBY to acquire the holocron of Sith Lord Darth Andeddu. Bane subsequently took by force the knowledge of how to transfer one's essence into another body from the holocron during his journey in the Triumph back to his home on Ciutric IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Theta-class T-1 vessel Triumph was a shuttle produced by Cygnus Spaceworks. It was equipped with a hyperdrive and required no more than one pilot, although it could also carry at least one additional passenger."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Triumph was the personal shuttle of Dark Lord of the Sith Darth Bane around the time following the New Sith Wars. For several years, he lived in a mansion on the planet Ciutric IV with his apprentice, Darth Zannah. While on Ciutric IV, he kept the Triumph in a nearby spaceport."}, {"tag": "p", "text": "In 980 BBY, Bane discovered that the legendary holocron of the Sith Lord Darth Andeddu—which was rumored to contain the secret to eternal life—was located on the Deep Core world Prakith. Bane then embarked on a mission to Prakith in the Triumph, making carefully calculated hyperspace jumps in the shuttle along the dangerous Deep Core hyperlanes before arriving safely at his destination."}, {"tag": "p", "text": "Bane successfully acquired the holocron from Andeddu's tomb and quickly fled Prakith in the Triumph. He studied the holocron on his return trip, forcefully taking the knowledge of the Force power to transfer one's essence from the artifact during the journey back to Ciutric IV in his shuttle. This mission proved to be Bane's final flight in the Triumph, as he was soon after captured and taken to Doan, before eventually being challenged twice by his apprentice, the second time resulting in his death."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Theta-class T-1 vessel Triumph was owned and operated by Dark Lord of the Sith Darth Bane, the creator of the Order of the Sith Lords."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The shuttle Triumph received its first appearance in Drew Karpyshyn's Darth Bane: Dynasty of Evil, the final novel of the Darth Bane Trilogy, released December 8, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}