{"url": "Trouble_on_Tibalt", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Incomplete lists", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "Trouble on Tibalt"}, {"tag": "p", "text": "\"Trouble on Tibalt\" is the second episode of the second season of LEGO Star Wars: The Freemaker Adventures. It was released on Disney XD on June 17, 2017."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "While scavenging for the Rebellion, the Freemakers meet the Empire's newest threat, M-OC."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Enter M-OC"}, {"tag": "p", "text": "At the Imperial Palace, Darth Vader presents the Emperor Palpatine with a hologram of the second Death Star. He boasts of its superior power but the Emperor interjects that he knows it will crush the Rebellion once and for all and turn Luke Skywalker to the dark side. Palpatine thinks it is still not good enough and demands \"Reginald Freemaker\". Vader reminds him that the boy is called Rowan Freemaker."}, {"tag": "p", "text": "When Vader reports they have been unable to find Rowan, Palpatine laments that the Galactic Empire is run by \"brick heads.\" The Emperor then reveals a secret project which he has even kept from Lord Vader. The Emperor opens a trap door, causing two Imperial officers to fall inside. A levitation platform presents the new hunter droid M-OC, which the Emperor calls \"My Own Creation.\" He boasts that M-OC will deal with \"Ricky Freemaker.\" When Vader corrects the boy's name, Palpatine yells in exasperation."}, {"tag": "h3", "text": "Fleeing the Empire"}, {"tag": "p", "text": "At the Home One, the Freemakers are working on an A-wing starfighter belonging to Blue Squadron leader Lieutenant Valeria. Rowan tries starting up the ship a few times but it doesn't start up until Zander Freemaker fixes the aft power coupling. Rowan then catches sight of Commander Luke Skywalker and R2-D2 and runs to him. Rowan is about to tell Luke that he is something when the klaxons begin ringing. Admiral Ackbar announces that the Empire has found the Alliance Fleet. Two Imperial Star Destroyers exit hyperspace and unleash TIE fighters."}, {"tag": "p", "text": "Rowan lets Luke leave but is disappointing that the Empire and poor timing disrupted their reunion. Kordi Freemaker meanwhile reassures Valeria her A-wing is reading to fly. Valeria leads Blue Squadron into combat and tasks them with creating a hole in the Imperial formation so that the rebels can jump into hyperspace. Rowan wants to help Zander and Kordi but other rebel ground crew are ready to help them. In space, Red Two and Valeria are pursued by two TIE fighters each. Valeria tells Red Two to meet her at Point 3.5 for an \"evasive entry.\" The two rebel pilots cause their TIE pursuers to crash into each other but safely pull up. She then asks where are their B-wings."}, {"tag": "p", "text": "Rowan finds Roger who tells him that the B-wings need targeting lasers. Rowan has no targeting lasers and that there is nothing for him to do. Just then, a crate of targeting lasers falls on Roger, who announces that he has found them. Kordi begins outfitting the B-wings. The B-wings sweep through the TIE formation and create a window that allows the Alliance fleet to flee into hyperspace."}, {"tag": "h3", "text": "Rowan's new assignment"}, {"tag": "p", "text": "After the battle, Zander finds that Valeria's A-wing has sustained extensive damage. Valeria is unperturbed and tells him that he can fix it because he is \"Zander Freemaker, Superstar Pilot Guy.\" Zander, Kordi, and Roger lament that they lack sufficient spareparts to repair the starfighters. Kordi then proposes that a salvage run will solve their problem. Rowan is upset that he did not do anything but Kordi tells him that he provided moral support. She suggests that he talk to Luke but Rowan can't find him. General Hera Syndulla informs them that she has a special assignment for Rowan."}, {"tag": "p", "text": "Meanwhile, the Emperor tests M-OC against several pop-up targets depicting rebel troopers. M-OC cuts them down effortlessly with his blades and flamethrowers. Palpatine is proud of his new servant. M-OC also sports blasters and grappling arms. He also destroys a moving target by deploying all his arsenal. M-OC tells his master that he awaits his instructions."}, {"tag": "p", "text": "Aboard the Home One, Hera sends Rowan to meet someone in the lowest level of the ship. He reaches a gate but is greeted by a TT-8L/Y7 gatekeeper droid who asks him what he wants. Rowan tells the gatekeeper droid that Hera sent him. Two blast doors open and Rowan finds himself in a garage. He sees Quarrie's Lothal astromech droid BG-81 and meets the Mon Calamari shipwright Quarrie, who asks if General Syndulla sent him with spareparts. Rowan tells Quarrie that Hera sent him and takes interest in an ion dilator. Quarrie doesn't think he needs an apprentice and tries to show Rowan out."}, {"tag": "p", "text": "Rowan replies he is not a distraction and touches a fuel stabilizer. Quarrie disagrees and tells Rowan that he is trying to build a ship that will save the Rebellion. Rowan recognizes Quarrie as the creator of the B-wing starfighter. After learning that Quarrie needs spareparts, Rowan volunteers the services of Freemaker Salvage and Repair and invites Quarrie to come for the Freemakers' salvage run to the planet Tibalt."}, {"tag": "h3", "text": "Expedition to Tibalt"}, {"tag": "p", "text": "Meanwhile, stormtroopers repair the damaged targets while the Emperor asks Vader about his thoughts on M-OC. Vader tells him not to be proud of the \"technological terror\" he has constructed because M-OC lacks the ability to use the Force. M-OC counters that he lacks offspring that threaten the Emperor. The Emperor sends M-OC to find Freemaker. The hunter droid acknowledges his command to the Emperor's delight. M-OC begins collating data and predicts that Rowan will be heading to Tibalt because there was a recent battle which will provide a tempting supply of spareparts. M-OC blasts his way out of the chamber and heads to the Tracker I. The Emperor is impressed but Vader counters that it would have bee more impressive if his creation learned how to use the door. Palpatine admits Vader is right."}, {"tag": "p", "text": "As the StarScavenger travels through hyperspace, Quarrie marvels that he has not been aboard a CT-900 freighter since before the Clone Wars. He is amazed it still flies but thinks their modifications could be better and begins fixing the stabilizer. Zander is annoyed but Kordi responds that she told him a hundred times to fix it."}, {"tag": "p", "text": "On Tibalt, Kordi signals for Zander, who is using the Mini Scavenger to lift a wrecked A-wing. Rowan asks Roger about an ion thruster which the droid thinks \"looks clean.\" However, Quarrie thinks it is Imperial junk. Rowan responds they can't be choosy but Quarrie tells him that he is thinking of building a single ship that can turn the tide of the war. Rowan sees a ship in the distance but Quarrie thinks that he is referring to his planned ship and says he has not made up its mind. Rowan points to a strange, sleek, black craft with sharp blade-like wings."}, {"tag": "h3", "text": "Ambush on Tibalt"}, {"tag": "p", "text": "Rowan approaches the strange craft, which turns out to be the Tracker I. Quarrie has not seen this particular configuration and warns the boy to keep his distance. Rowan can't see a pilot and marvels that it is brand new. Unknown to them, M-OC is watching. Suddenly, the ship's ramp opens and a grappling arm grabs Rowan inside. M-OC announces that his target has been acquired and jets off in the Tracker I. Roger and Quarrie try to follow while Kordi and Zander look up. In the ship's brig, a hologram of M-OC tells Rowan that he has been assigned by the Emperor to collect him. Rowan says he hates the \"scum weasel\" but M-OC replies his feelings are irrelevant."}, {"tag": "p", "text": "The Freemakers and Quarrie give chase aboard the StarScavenger. Roger panics that the \"thing\" has taken Rowan. Zander and Kordi take the StarScavenger into space and pursue the Tracker I through the skies. The Tracker I sustains a hit on one of its blade wings. Rowan's lightsaber slips out and he uses the Force to summon it. Meanwhile M-OC exchanges fire with the StarScavenger. Rowan uses his lightsaber to cut his way out of the ship. Quarrie marvels the boy has a lightsaber while Zander and Kordi reply that he is a Jedi."}, {"tag": "p", "text": "Kordi opens the StarScavenger's scoop and Rowan Force jumps aboard the ship. M-OC quickly realizes and expresses disappointment that the Imperial database did not mention Rowan wielding a lightsaber. When Rowan enters the cockpit, Quarrie tells him that he knows that Rowan is a Jedi in training. When Rowan asks how he knows, Kordi replies that the lightsaber gave him away. M-OC attacks the StarScavenger. Roger tells Zander to get them out of here but Zander replies that the other guy is a better pilot than he is."}, {"tag": "p", "text": "M-OC fires a laser cannon that knocks out one of the StarScavenger's engines. Kordi panics but Quarrie tells them to activate the lateral compensators. Zander replies that he took them out to give more power to the engines and admits he was wrong. The StarScavenger crashlands and the Freemakers and Quarrie fall out through the ramp. When Kordi asks Zander if he thinks he can make the ship fly, Zander replies he will try."}, {"tag": "h3", "text": "Duel with M-OC"}, {"tag": "p", "text": "M-OC lands the Tracker I nearby and orders Rowan to surrender. Rowan charges with his lightsaber but the droid uses his grappling arms to jump out of harm's way. M-OC attacks Rowan with his blasters. Zander asks what it is but Quarrie doesn't know but says they should blow it up. She likes his idea. M-OC blasts Rowan's lightsaber out of his hand and traps the boy under a net. M-OC replies that the chances of surviving a fight against him are \"2,072 to one.\" Rowan however uses the Force to levitate his lightsaber and cuts his way out. He then tells M-OC not to tell him the odds because he doesn't understand how it works."}, {"tag": "p", "text": "Meanwhile, the Freemakers and Quarrie climb on top of a wrecked starship. Quarrie and Kordi began looking for various ship parts including a power cell, hydrospanner, stabilizer, and power coupling. Kordi realizes what Quarries is thinking but Zander is still blur. Meanwhile, Rowan asks if he is the 2,072 or the \"one.\" M-OC replies that his the \"number one.\" Roger panics that the fusion generator is leaking but Quarrie says they are not planning to fly. Kordi adds they are launching it in a general direction. M-OC activates his rocket boosters and uses his flamethrowers to drive Rowan towards the Tracker I's ramp."}, {"tag": "p", "text": "M-OC boasts the boy has no chance of besting him in one-on-one combat. Rowan sees his siblings and Quarrie signalling to him. Replying that he is a Freemaker, Rowan leaps out of the way just as the wrecked starship rams into M-OC and the Tracker I. Rowan adds that the Freemakers are always together. The Freemakers and Quarrie celebrate but a damaged M-OC emerges from the pile and begs to differ. He is missing his right arm and left leg. The Freemakers and Quarrie flee aboard the StarScavenger as M-OC raises his fist. In space, Kordi asks what was that thing. Zander thinks it is a bounty hunter but Rowan tells them that the droid is M-OC and works for the Emperor."}, {"tag": "h3", "text": "Quarrie's new apprentice"}, {"tag": "p", "text": "After returning to the Home One, Quarrie reassures Rowan that the Emperor is in for a disappointment. Quarrie recruits Rowan as his apprentice but tells the boy he can't have dawdlers. Rowan promises to come but admits he doesn't know what a dawdler is. Neither do his siblings."}, {"tag": "p", "text": "Meanwhile, M-OC reports his failed attempt to the Emperor and Lord Vader but blames the database for omitting the fact that Rowan carried a lightsaber. When Vader asks if he has more to say, M-OC reports that Rowan was accompanied by the rebel ship designer Quarrie. The Emperor realizes that the Freemakers are working for the Rebellion and orders M-OC to find the rebels, the Freemakers, and the Kyber Saber; unaware that the latter has been destroyed. M-OC replies that he lives to serve. In exasperation, Palpatine hurls Force lightning at the officer who put together the Freemaker file."}, {"tag": "p", "text": "As the rebel fleet travels through space, the Freemakers sleep in their quarters aboard the StarScavenger. Rowan dreams that he is in space and using the Force to build a ship that is powered by a kyber crystal. He sees the ship carving through an asteroid and flying through space. After awakening from the Force vision, Rowan names the ship the Arrowhead. Zander starts to awake and mumbles it is time to get up."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}