{"url": "Trondor_Pyn", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Spies", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Trondor Pyn"}, {"tag": "p", "text": "Trondor Pyn was a spy for a pair of feuding Kuati merchant houses."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Pyn was originally a starshipwright employed by Kuat Drive Yards. He began his career in espionage when he was approached by representatives of House Andrim. They asked him if he was interested in spying on their rival House Purkis. Pyn accepted their offer and did what was expected of him but his activities were eventually discovered by House Purkis."}, {"tag": "p", "text": "House Purkis did not bring Pyn's activities to the attention of the Kuati Security Forces. However, Pyn was not in a position to refuse the wishes of representatives of House Purkis when they demanded that he spy on House Andrim on their house's behalf. The stress caused by the inherent risks of being a double agent had a negative impact on Pyn's health."}, {"tag": "p", "text": "As time passed, Pyn became increasingly mentally unbalanced. He sought refuge in alcoholic beverages, suffered from insomnia and gained weight. Desperate to escape what appeared to be an untenable situation, Pyn eventually hit upon a plan that he believed would allow him to escape the scrutiny of his employers. He recruited eight co-workers who he considered to be his most trusted friends and paid them with the compensation that he received for the activities that he carried out for both houses."}, {"tag": "p", "text": "His plan called for sabotaging the drydocks of both houses with explosives. Doing this would likely cause a massive amount of casualties, but he believed that the catastrophe would sufficiently distract his employers while he fled to an unspecified location. It is unknown if the plan was successfully implemented."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}