{"url": "Troo-tril-tek", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:Cad Bane's group", "Category:Chadra-Fan", "Category:Cyborgs", "Category:Males"], "nodes": [{"tag": "h1", "text": "Troo-tril-tek"}, {"tag": "p", "text": "Troo-tril-tek, also known as Tek-tek, was a Chadra-Fan bounty hunter who worked with Darth Maul alongside Cad Bane, Aurra Sing and Vorhdeilo. He and the others were hired to help track down and kill the Jedi Padawan Eldra Kaitis, who was on sale at an auction held by Xev Xrexus on her hideout. A Moogan called Jee Kra won the auction and so the team eliminated him on his ship and took it with Kaitis on board. However, Xev Xrexus had predicted an attack on the winner and had rigged the ship with detonators which disabled the ship."}, {"tag": "p", "text": "After their ship was disabled, the group crashed onto the Moon of Drazkel where Troo-tril-tek was severely injured and separated from the rest of them. Later, after Kaitis had been killed by Maul, Troo-tril-tek was assumed dead and the team departed the moon without him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hired by a Sith"}, {"tag": "p", "text": "Troo-tril-tek was hired by Darth Maul to be a member of Cad Bane's group with the goal of capturing and killing the Jedi Padawan Eldra Kaitis for Maul's amusement. Kaitis was being held at an auction hosted by Xev Xrexus at her hideout. In order to attend the auction without any suspicion, the group came up against the Haddrex Gang in order to steal tickets. They also took the gang's protocol droid designated FE-B3 and Troo-tril-tek and Maul tortured it to reveal the location of Kaitis."}, {"tag": "h3", "text": "The auction"}, {"tag": "p", "text": "Using the Haddrex gang's freighter to fly to the hideout in the Drazkel system revealed by FE-B3, they landed with FE-B3 still on board. They used FE-B3 to predict the winner and the protocol droid speculated that the winner would be the Moogan Jee Kra and his group. FE-B3 was proven right and they boarded Kra's ship capturing Kaitis and the ship. However, shortly after Kra had won Xrexus had predicted someone would attack him. As a precaution she placed explosives in the ship, which detonated once the ship was out of the hangar."}, {"tag": "h3", "text": "Abandonment"}, {"tag": "p", "text": "Once the ship was disabled, it crashed on the moon of Drazkel. Troo-tril-tek was seriously injured in the crash and separated from the others. Other pirates and scoundrels traveled to the moon in order to try and find Kaitis. Kaitis and FE-B3 were eventually both killed by Maul and using a ship gained from some of the pirates that came for Kaitis they escaped the moon without Troo-tril-tek as they presumed him dead. The three bounty hunters are given a bigger share because of the absence of Troo-tril-tek and Maul tied up all loose ends by killing Xrexus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}