{"url": "Trumpet%27s_Call", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic starships", "Category:Freighters"], "nodes": [{"tag": "h1", "text": "Trumpet's Call"}, {"tag": "p", "text": "The light freighter later known as the Trumpet's Call used by the Rebel Alliance in the Mid Rim. It changed its name frequently, formally being known as the Eyesore and the Careful Buyer. During the Mid Rim Retreat, the freighter was attacked and seized by the Galactic Empire, who planted spies onto it and sent it to a rebel flotilla in the Elochar sector without life support."}, {"tag": "p", "text": "After the Trumpet's Call arrived, the CR90 corvette Thunderstrike locked onto the freighter and blindly took aboard the Imperial spies, who stormed the corvettes bridge and killed the Rebel Officers. When trying to retake the bridge, the rebel soldier Brand detached the Trumpet's Call from the corvette and ejected herself from it to reach the bow of the Thunderstrike."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Trumpet's Call was a light freighter serving under the Rebel Alliance for passenger and cargo purposes. The freighter was equipped with engines and a hyperdrive. The starship also had life support and safety systems as well as communications which could be used to make contact with other vessels."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Seized by spies"}, {"tag": "p", "text": "The light freighter later known as the Trumpet's Call served in the Rebel Alliance fleet, operating officially as a trading vessel among the purse-worlds while in reality being on passenger transport and cargo duty. Whenever the Galactic Empire became suspicious about the freighter, the vessel changed identity records as well as taking a new name such as the Eyesore, Careful Buyer and eventually the Trumpet's Call. Despite the crew's efforts in forging records, the Empire was becoming increasingly more equipped at identifying fraud and eventually attacked the Trumpet's Call in 3 ABY. During the attack, the light freighter was severely damaged and a few of the crew burned to death, the rest suffocating when the life support systems failed."}, {"tag": "p", "text": "With the rebel crew dead, the Trumpet's Call was boarded by an infiltration team of Imperial spies assigned by the special forces commander aboard the Imperial II-class Star Destroyer Herald and taken over by the Empire. Disguised as rebels, the boarding team navigated to a rendezvous point of the Alliance in the Elochar sector, where a flotilla of rebel ships had formed. One of the flotilla vessels, the CR90 corvette Thunderstrike clamped to the Trumpet's Call and the corvette's crew, the Alliance's 61st Mobile Infantry, took aboard the spies, numbering at almost twenty, believing they were surviving crew from the battle."}, {"tag": "p", "text": "After they had brought all the survivors to the Thunderstrike's, the Sixty-First soldier Brand boarded the Trumpet's Call and checked for any homing beacons which could have been planted. She then looked through main computer for anything suspicious and found the light freighter's history as well as the captain's entry and his record. When she finished the crew list, Brand realized that none of the survivors matched any of the crew on the freighter's personnel records. As she discovered this, the disguised Imperial spies were already attempting to takeover the Thunderstrike."}, {"tag": "h3", "text": "Final flight"}, {"tag": "p", "text": "Brand boarded the Thunderstrike to find that the bridge crew had locked the corvette down to isolate the spies. Intending to make her way to the Thunderstrike's bridge more swiftly, she returned to the Trumpet's Call transferred all power from the life support to the engines in order to separate it from the larger vessel. As Brand teared the light freighter from the corvette's docking clamps, its airlock became damaged in the process, allowing the remaining air inside the Trumpet's Call to rush out into the outside void of space. She then flew the freighter towards the bridge of the Thunderstrike."}, {"tag": "p", "text": "As Brand did this, the Imperial spies were able to storm the bridge of the corvette. The highest ranking officer aboard the Thunderstrike, Lieutenant Sairgon, barely managed to warn the rest of the flotilla of what was happening before he was killed alongside most of the other bridge crew. Brand received the message herself at the Trumpet's Call. One by one, the rebel ships of the flotilla fled the Elochar Sector, leaving the light freighter, the Thunderstrike and the corvette's escort, the Braha'tok-class gunship Apailana's Promise. The Imperial spies had already contacted the Herald, which appeared shortly afterwards."}, {"tag": "p", "text": "As the Trumpet's Call neared the bridge of the Thunderstrike, Brand leapt out through the damaged airlock. She entered the Thunderstrike through a maintenance hatch and killed the spies on the bridge. The surviving bridge crew then had the corvette jump into hyperspace alongside the Apailana's Promise before the Herald could destroy them. Sometime after the skirmish, Hazram Namir and Everi Chalis, members of the Sixty-First who wished to reunite with the Thunderstrike, arrived at the Elochar Sector and found the Trumpet's Call hollowed out along with debris around it. The pair subsequently left the sector to find the Thunderstrike on the planet Ankhural."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trumpet's Call appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}