{"url": "Tru%27eb_Cholakk", "categories": ["Category:Legends articles", "Category:Black Curs", "Category:Males", "Category:Mercenaries", "Category:Smugglers", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Tru'eb Cholakk"}, {"tag": "p", "text": "Tru'eb Cholakk was a male Twi'lek smuggler who worked together with Platt Okeefe. He was tall and preferred to wear gray and black tunics. His voice was deep and resonant, which gave his speech a pinch of respectable pride."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Son of a head-clan member of the Rylothian city of Kala'uun, Tru'eb dreamed of one day leading his people. Unfortunately, he was kidnapped by his cousin Ku'amar and given to slavers. Eventually, he ended up in the hand of Big Quince who made him his personal servant."}, {"tag": "p", "text": "While in the custody of Big Quince, Tru'eb befriended a Human slave girl called Platt Okeefe and together they managed to escape the clutches of the Sludir slaver. Okeefe taught Tru'eb about spaceship piloting and helped him buy the Luudrian Star. Tru'eb specialized in gunrunning, supplying the Rebel Alliance with much needed weaponry, and continued to serve the New Republic. He primarily operated in the Outer Rim Territories and the Mid Rim. He would also work with the mercenary group, the Black Curs under the leadership of Dirk Harkness. He was present at Gorkin's Rest when Harkness told the tale of how he lost the love of his life Chessa Dohhenty and joined the Rebels."}, {"tag": "p", "text": "While on a reconnaissance mission in the Core Worlds, he and the rest of the Black Curs were shot down over the planet Moorja. While Harkness went to look for help, Cholakk stayed behind with the Last Chance to defend the ship and assist with repairs. After his colleague Platt Okeefe was captured by Golthan and taken to his stronghold, Cholakk recruited some beings to assist in a rescue mission. He flew them to the Black Curs' base and gave them a briefing on their plans to rescue Okeefe. After the group was able to infiltrate and bring down the defenses of Golthan's base, Cholakk flew his freighter to extract the team."}, {"tag": "p", "text": "Cholakk was a distant relative of Black Sun Vigo Lonay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}