{"url": "Troxan", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Expansion Region species", "Category:Troxans"], "nodes": [{"tag": "h1", "text": "Troxan"}, {"tag": "p", "text": "The Troxans were a sentient species native to the planet Troxar in the Expansion Region. They had gills on their necks that fluttered and vibrated to convey emotion. Gill patterns varied from individual to individual, so much so that those olfactory organs were used as identity markers by Troxan security devices, such as incendiary packets. At least part of the Troxan government was known as the Benevolence of Troxar, itself a bureaucratic organization that featured departments such as the Bureau of Patriotic Defense and posts such as the under-palatine for patriotic liaisons and the first diplomatic legatee."}, {"tag": "p", "text": "During the Clone Wars, the Troxans sided with the Confederacy of Independent Systems. However, as the Grand Army of the Republic gained the upper hand against the Troxans and inflicted severe damage on the species' homeworld, the Troxans considered suing for peace. The species sent a delegation to the Republic, but their appeals were rebuffed. They then hatched a new plan: to pretend to surrender only to mount an insurrection once the Republic recalled most of the troops it had sent to subdue the world. However, at a summit on the planet Vjun with the Separatist Head of State Count Dooku—actually the Sith Darth Tyranus—the Count planted suggestions in the Troxans' minds to keep them fighting—little did they know that Darth Sidious, the mastermind behind the war and Dooku's Sith Master, wanted their world to continue fighting so as to drain the resources of the Republic army."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Troxans were a sentient species who breathed through gills in their throats. Those respiratory organs came in patterns unique to each Troxan, much as fingerprints were unique to individual Humans. When a Troxan was calm, the gills were moist, with a pinkish hue. However, when the individual was flustered or excited, the gills changed to a purplish color. The Troxan countenance was otherwise characterized by a nose—large and pronounced in some members of the species—cheeks, and purple skin. Troxans had hands with which to manipulate their environment. Some members of the species could grow quite fat, causing their hands to take on a swollen appearance. They were divided into male and female sexes."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Troxan homeworld was the planet Troxar, located in the Expansion Region of the galaxy. By the time of the Clone Wars, the species had access to the level of technology that was standard on most galactically integrated worlds. Their society boasted experts in demolitions, poisons, surveillance, and other high-tech professions. Troxan security systems worked by identifying gill patterns and retinal scans to distinguish between individuals. One device that relied on that technology was the incendiary packet, a container that plasmated should anyone try to open it other than its intended recipient."}, {"tag": "p", "text": "The Troxan government was bureaucratic, with at least part of the government known as the Benevolence of Troxar, and with diplomacy carried out by the Bureau of Diplomatic Liaison. One official employed by that department was the under-palatine for patriotic liaisons, and individual delegations were headed by the first diplomatic legatee. The Troxan armed forces were supported by the Bureau of Patriotic Defense, which had an under-palatine."}, {"tag": "p", "text": "The Troxans spoke a language, also called Troxan, for which they also had a written form. Members of the species could also speak Basic. Troxans supplemented their speech with movements of their gills, which were useful in conveying emotions and states of mind. For example, flapping of the gills conveyed befuddlement, while rippling them indicated derision. Fast, violent gill vibrations indicated anger, while unmoving gills showed calmness. Gill color, too, signified emotion: pink showed a peaceful state of mind, while purple conveyed agitation. Troxans also used their cheeks to convey emotion; sucking them in when flustered, for instance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Years before the Clone Wars, the Troxans developed advanced technology and established relations with the Galactic Republic. Sometime after, the Battle of Geonosis sparked the Clone Wars in 22 BBY, however, the Troxans allied with the Republic's rival in the war, the Confederacy of Independent Systems. Troops from the Grand Army of the Republic invaded Troxar in response. Although Troxan forces resisted them to the extent of their ability, their world was severely damaged, and the tide of the hostilities turned against them."}, {"tag": "p", "text": "In the face of what they considered inevitable defeat, the Troxans engaged the Republic in two rounds of diplomatic talks. In the end, the Republic's legislative body, the Galactic Senate, rejected a diplomatic resolution to hostilities with Troxar, which the Troxans took as evidence that the Republic was only interested in using force or threats so far into the war. However, during the latter conference, Senator Padmé Amidala presented the Troxan first diplomatic legatee with a black box to deliver to Count Dooku, leader of the Separatists. Troxan experts checked the supposed gift for evidence of explosives, listening devices, or poison, but it seemed clean."}, {"tag": "p", "text": "The Troxans considered surrendering to the Republic under the assumption that the bulk of Republic clone troopers would be called away, at which time the Troxans could mount an asymmetrical insurgency to continue the fight. The species sent a delegation to meet with Dooku at Château Malreaux on the planet Vjun to discuss the ploy and to ask for Separatist reinforcements. The members included the under-palatine for patriotic liaisons—the same individual who had served as the first diplomatic legatee in talks with the Republic—his assistant, and the under-palatine for the Bureau of Patriotic Defense. Unbeknownst to the Troxan envoys, Darth Sidious, master of Dooku, who was himself secretly a Sith Lord, considered Troxar an expendable world due to the damage it had sustained; yet he still felt that it had use to the Separatist cause as a location for the Republic to sink resources and personnel by fighting the Troxans. Sidious accordingly instructed Dooku to persuade the Troxans to continue their conflict by assuring them that Separatist reinforcements would arrive within the month—an empty promise."}, {"tag": "p", "text": "Dooku did as he was told: he merely mentioned that new battle droids were coming from Separatist factories, and then he used the persuasive ability of the Force to plant ideas that the droids would be sent to the Troxar system. Via the Force, Dooku thus suppressed the realizations that continuing to fight would result in the untold slaughter of Troxan lives, instead emphasizing ideas of egotism and heroism in the Troxar delegation. Before the Troxan envoys parted, they presented Dooku with Amidala's gift. Inside, Dooku found a black, wax candle, a reminder of his former home at the Jedi Temple, where he trained under the Jedi Grand Master Yoda."}, {"tag": "p", "text": "On Coruscant, a Troxan diplomat visited the Jedi Temple to deliver an incendiary packet, addressed to Yoda, which contained a holoprojector with a message inviting Yoda to visit the Count. The Troxan was greeted at the door by a mere youngling, which he took as a slight—he wanted to speak only to a full-fledged Jedi. The boy, a Padawan named Whie Malreaux, was soon joined by his superior, Jedi Master Maks Leem, who used the Force to calm the Troxan envoy. She swore to deliver the package directly to Yoda, and the Troxan handed it over. He then boarded a flier and flew away."}, {"tag": "p", "text": "More than a century later, in 137 ABY, the Troxan homeworld fell within territory controlled by Darth Krayt as part of his Sith Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Sean Stewart introduced the Troxans in his novel Yoda: Dark Rendezvous, which was first published by Del Rey in 2004. Although the species plays only a small part in the story, theirs is a significant role, since the packages the Troxans convey between Republic and Separatist operatives set the stage for the book's main plot, an encounter between Jedi Master Yoda and his former apprentice, Dooku. The incendiary package the Troxans deliver to the Jedi Temple scans for its recipient's gills, fingerprints, and retinal pattern; however, as is intended for Yoda, a member of another species, the book leaves it unclear whether Troxans too have fingerprints and retinas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}