{"url": "True_Republic", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Republic organizations", "Category:Political factions"], "nodes": [{"tag": "h1", "text": "True Republic"}, {"tag": "p", "text": "The True Republic was a movement formed after the Treaty of Coruscant that intended to preserve the founding principles of the Galactic Republic by any means necessary."}, {"tag": "p", "text": "Around ten years after the treaty, during a period of uneasy peace with the Sith Empire, the True Republic targeted the radical Senator Parvil, who was moving to motion the Senate to break ties with the Jedi Order and instead establish an alliance with the Sith Empire. Parvil, frustrated by the organization's attempts to interfere with his efforts, had its members placed on the Senate security watch list, preventing them from entering the Senate tower."}, {"tag": "p", "text": "Soon afterward, the organization learned of a diplomatic parcel containing information that, if made public, would expose Parvil's radicalism. However, the parcel was being delivered inside the Senate tower, making it impossible for the organization's members to reach it. To circumvent this, a representative of the movement asked a Republic citizen who was permitted to enter the building to steal the parcel on her behalf, offering a device that would disable the senator's courier droid to help."}, {"tag": "p", "text": "However, the would-be thief was caught by Senator Parvil's page, who accused the individual of undermining the democratic process and referred to the True Republic as paranoid fanatics. The individual conceded that the principles of the Republic protected Parvil's right to express even radical and unpopular ideas, and agreed to deliver a parcel of outdated agricultural information to the movement instead of the diplomatic parcel. The movement, unaware of the deception, still paid the individual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}