{"url": "Trunsk", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Colonies species", "Category:Enslaved species", "Category:Mammalian sentient species", "Category:Trunsks"], "nodes": [{"tag": "h1", "text": "Trunsk"}, {"tag": "p", "text": "The Trunsks were a species of sentient mammals native to the planet Trunska. Descended from predators, Trunsks were stout, fur-covered bipeds with large ears and nostrils, well adapted to their cold, thin-atmosphere homeworld. Their wide, tusked mouths, vestigial horns, and sharp fighting claws gave them a fearsome appearance. Trunsks typically had a gruff temperament, and they were paranoid toward outsiders and strangers."}, {"tag": "p", "text": "As the species progressed from agricultural settlements along rivers to continent-spanning empires, Trunsk warlords continually feuded with each other. Eventually, the planet was unified by Tyl the Deplorable. By this point, the Trunsks had developed information-age technology. Without wars to slow their progress, they rapidly developed hyperspace technology and joined the Galactic Republic. When the Galactic Empire came to power, the Trunsks lost their freedom, becoming one of many legally designated slave species. The Trunsk ruler, Emperor Belgoa, became an Imperial puppet who publicly denounced the enslavement of his people but secretly allowed the Empire to take slaves—especially Belgoa's political enemies. The slave trade continued, although the defiant nature of Trunsks made them unpopular among buyers and sellers. Even free Trunsks on Trunska were not allowed access to armed spacecraft or personal weapons, a law strictly enforced by Belgoa's police."}, {"tag": "p", "text": "The indignities of slavery drove many Trunsks to join the Alliance to Restore the Republic. Sully Tigereye was one example: he escaped from a life lived in a cage to join the Rebel Red Alpha team as fire support. After a distinguished career that continued as the Alliance became the New Republic, the Trunsk resigned to follow his commanding officer, Colonel Andrephan Stormcaller, into a mercenary band known as the Red Moons. With this group, Tigereye continued to fight a remnant faction of the Empire, the Pentastar Alignment."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Trunsks were a stout species of humanoid mammals who were covered in coarse, matted, brown fur. Only the face, nipples, palms of the hands, and soles of the feet left their tough skin exposed. Although they only stood between 1.5 and 2.0 meters tall, Trunsks were burly beings with a stalwart constitution. They had four fingers per hand and long, sharp, retractable fighting claws growing from each finger and toe."}, {"tag": "p", "text": "The species' weathered visage featured two large eyes that gave the Trunsks an air of fierceness and wildness in the view of other species. In some specimens, the yellow iris and pupil were oval-shaped, tall and thin; in others, the iris was so large as to occlude the sclera. The sclera themselves were dark. The eyes were set into bony sockets, which in some Trunsks extended for several centimeters above, but in others, were much less pronounced. Beneath the eyes was the Trunsk nose, which in most members of the species was wide and flat, with two gaping nostrils adapted to breathing in a thin atmosphere. However, at least some Trunsks had much smaller noses. Directly below the nostrils spread the Trunsk mouth, a broad expanse with lips turned down in a perpetual frown. Two tusks jutted up from the bottom row of teeth, protruding even when the mouth was shut. Despite the toughness of the skin, Trunsk lips were supple enough to pucker. Members of the species sported a prominent beard on the chin. A large, triangular ear lay flat against the hair at each side of the hairless face. These sensory organs were adept at picking up sound waves in thin atmosphere. A small, vestigial horn grew in front of each ear; in some Trunsks, these grew downward, while in others they grew upward."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Trunsks came off as gruff and temperamental. Notorious for their short tempers, they were particularly prone to tantrums when under stress. This was especially true among strangers, as Trunsks had a deep distrust of outsiders and treated them brusquely at best. At its most extreme level, the Trunsk temper manifested in outbursts of violence. Nevertheless, Trunsks refrained from out-and-out brawling unless provoked."}, {"tag": "p", "text": "When they did come to blows, Trunsks were known to be natural fighters. Their sharp claws, backed up by their stocky musculature, allowed them to quickly dispatch an enemy at close range. Other Trunsks were equally adept at using high-tech weaponry such as blasters."}, {"tag": "p", "text": "Despite their fierce demeanor, Trunsks were warm and gentle with friends and loved ones. Likewise, Trunsks who spent a great deal of time with non-Trunsks could be charming and gallant with strangers if they wanted to be. Still, even among close friends, a Trunsk occasionally came off as overly grumpy most of the time."}, {"tag": "p", "text": "Trunsks had a strong work ethic that made them good physical laborers. Nevertheless, their temperament was not amenable to slavery. In fact, for most Trunsks, slavery was the most detested thing in the galaxy. As principled beings who could be driven to further goals important to them, Trunsks such as Sully Tigereye felt compelled to fight the slave trade."}, {"tag": "p", "text": "For much of their history, the Trunsks were ruled by competing empires. At some point before the fall of the Galactic Republic, a warlord named Tyl the Deplorable united them under a single government. From this point on, a large police force was employed to enforce the emperor's laws and to keep the peace."}, {"tag": "p", "text": "Trunsks had access to technology standard throughout most of the galaxy. Members of the species wore clothing similar to that worn by other galactically integrated humanoid species. Some Trunsks sharpened their tusks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Trunsks hailed from Trunska, a planet of craggy terrain, frigid temperatures, and rarefied atmosphere. They evolved from carnivorous, quadrupedal forebears that preyed upon the world's large variety of hoofed, tuber-eating animals. From these ancestors, the Trunsks inherited large nostrils to breathe Trunska's thin air, big ears to receive sound waves in such conditions, and horns by the ears that had atrophied over the generations. As the Trunsks' intelligence increased, they eventually became sentient. From their front paws developed hands capable of fine manipulation, and from a life lived on all fours came a bipedal gait."}, {"tag": "p", "text": "Early Trunsks lived as farmers along their planet's widespread river networks. Agricultural communities soon gave rise to cities, and cities to empires. As land became scarce, the Trunsks entered an era of incessant conflict between rival states. Trunsk generals and warlords led their factions in a never-ending quest for territory. Meanwhile, the species advanced technologically to enter the information age."}, {"tag": "p", "text": "Eventually, a famed strategist known as Tyl the Deplorable led his armies to conquer all of Trunska, uniting the Trunsks for the first time in their history. With no need of soldiers and weapons of war, Tyl converted the military into a police force tasked with preserving order. Funds once devoted to war could now fund scientific research. The species eventually attained the ability to create hyperspace-capable starships, either by their own innovation or from other sources."}, {"tag": "p", "text": "The Trunsks used their new spacefaring ability to send forth explorers and scouts to chart the nearby regions of space. They came to the attention of the Galactic Republic, and the Trunsks joined the pan-galactic government, eventually becoming respected members of the galactic community. Their world was considered part of the Colonies region, located southwest of the galactic Core."}, {"tag": "p", "text": "With the rise of the Galactic Empire and Emperor Palpatine's declaration of the New Order, new anti-alien laws came into effect, and the Trunsks were declared a slave species. Slavers came to Trunska and shipped thousands of the hardy beings offworld to labor throughout the galaxy."}, {"tag": "p", "text": "The Trunsks retained the semblance of self-rule in the guise of their emperor, Belgoa. This ruler publicly decried the enslavement of his people, but behind the scenes, he struck a deal with the local Moff: the Trunsk ruler agreed to go along with Imperial decrees and to permit the slave trade to continue unhindered, but he reserved the right to decide which Trunsks were taken and which were left alone. In this way, Belgoa was able to rid himself of political rivals and enemies on the world. Nevertheless, slave traders and owners soon realized that the Trunsk temperament was not amenable to enslavement, and the species lost popularity among traffickers in sentient life. One of the few niches where Trunsk slaves remained in demand was as gladiators."}, {"tag": "p", "text": "Imperial laws—filtered through the Trunsk emperor—forbade Trunsks from owning or carrying weapons and from piloting starships with weapons systems. The Trunskan police force remained loyal to the Trunsk leader—and thus the Galactic Empire—and enforced these regulations. After the Empire splintered into various factions beginning in 4 ABY, it was eventually supplanted as the main galactic power by the New Republic, which outlawed slavery. Nevertheless, Trunsks were still found as slaves within the territory of the Imperial remnant faction known as the Pentastar Alignment. More than a century later, in 137 ABY, Trunska fell within the territory controlled by Darth Krayt as part of his Sith Empire."}, {"tag": "h2", "text": "Trunsks in the galaxy"}, {"tag": "p", "text": "As soon as the Trunsks discovered hyperspace technology, they began to explore the galaxy beyond their homeworld. Nevertheless, the species never emigrated in large numbers from Trunska even after they joined the Galactic Republic. Under the Galactic Empire, the Trunsks faced the same prejudices as other non-Humans under Palpatine's anti-alien policies. With the enslavement of their species under the New Order, Trunsks were taken from their planet by the thousands, but their irascible personalities deterred larger-scale slave operations and kept the number of Trunsks offworld to a minimum. Nevertheless, several enslaved Trunsks became famous as gladiators, ring fighters, and carnival attractions."}, {"tag": "p", "text": "Those offworld Trunsks who escaped enslavement during the Galactic Civil War used their natural talents to find employ as bodyguards, scouts, and sector police officers. One Trunsk visited the world of Port Haven, where he came under fire from an Imperial probe droid. Others joined the Alliance to Restore the Republic to fight the Empire and their people's subjugation."}, {"tag": "p", "text": "One such Trunsk was Sully Tigereye, who escaped from a life as a caged slave. He joined the Alliance as a basic ground force trooper and he proved himself to be a fierce fighter prone to explosive outbursts of rage. The Trunsk rose through the ranks and came to the attention of Colonel Andrephan Stormcaller, who invited Tigereye to join the Red Alpha insertion team as fire support. Tigereye was an expert with large weapons such as heavy blaster rifles, repeating blasters, and vibro-axes. When the Alliance became the New Republic, Tigereye became a respected and decorated member of an infiltrator unit, tasked with deftly penetrating enemy lines and then attacking. However, he followed Stormcaller in resigning his commission and becoming a member of the Red Moons, a group of mercenaries who focused on missions that hurt the Pentastar Alignment. Tigereye led a mission targeting the Karazak Slavers Guild on Gabredor III to free children of diplomats held by the slavers. He later traveled with the Red Moons to Entralla to steal the plans for the Lunar Night festival from agents of the Alignment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trunsk character Sully Tigereye was created by author Anthony Russo for his article \"Blasters for Hire,\" published in the Star Wars Adventure Journal 3 in August 1994. The article describes mercenaries in the Star Wars universe and details a sample mercenary group, the Red Moons, of whom Tigereye was a member. Russo later included Tigereye and his Red Moons cohorts in two short stories, \"It's a Gambler's Life,\" and \"*Blaze of Glory,\" both published in later issues of the Adventure Journal. The latter of these was reprinted in the short story collection Tales from the Empire, published in 1997."}, {"tag": "p", "text": "Author Brian Smithson expanded on the Trunsks and their culture in his article \"Alien Encounters,\" published in the Star Wars Adventure Journal 13 in May 1997. The article provides game rules to allow players of Star Wars: The Roleplaying Game to portray Trunsk characters. These statistics make Trunsks slightly less intelligent, perceptive, technologically inclined, and quick footed than Humans but slightly stronger as well. This description and collection of statistics are reprinted in slightly altered form in the book Alien Encounters, published in 1998."}, {"tag": "p", "text": "A Trunsk appears in an image by artist Mike Vilardi in the book Platt's Starport Guide, published in 1995. The illustration accompanies an adventure idea for players of the West End Games Star Wars roleplaying game, but it is unclear if the Trunsk shown is intended to be one of the characters who participate in that adventure. The story sends a group of smuggler characters into the jungles of Port Haven to investigate a shipwreck they have witnessed. There, they discover that the crash survivors are agents of the Rebel Alliance. The player characters help the survivors make their way to a settlement, where the grateful Rebels award the smugglers for their help."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}