{"url": "Tsalok", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Males", "Category:Yuuzhan Vong officers"], "nodes": [{"tag": "h1", "text": "Tsalok"}, {"tag": "p", "text": "Tsalok was a male Yuuzhan Vong commander during the Yuuzhan Vong War. During the evacuation of Rychel in 25 ABY, Tsalok commanded the invasion force which included an army of Chazrach slave-soldiers and the warbeasts Tu-Scart and Sgauru. He slew the Pau'an Jedi Master Lar Le'Ung but was beaten in a duel with Padawan Finn Galfridian. However, Finn spared Tsalok and fled the planet. Unable to come to terms with the shame of his defeat and being denied an honorable death, he slaughtered several Human prisoners."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 25 ABY, Tsalok led the attack on Rychel with an army of Chazrach slaves. During the battle, he murdered the Pau'an Jedi Master Lar Le'Ung by stabbing him in the back with his amphistaff and then hurling him into the mouth of the serpentine warbeast Tu-Scart. Later, during the battle, Tsalok attempted to stop the young Human Padawan Finn Galfridian from saving some of Rychel's inhabitants from being enslaved."}, {"tag": "p", "text": "Finn, using the lightsaber of the downed master Le'Ung, engaged Tsalok in a duel. The fight was cut short when another war beast, Sgauru, devastated the building that the confrontation was taking place in. When the dust settled, Tsalok was unscathed but pinned beneath a huge column of duracrete. As Finn urged the remaining survivors to get to the evacuation ships, he approached the massive Yuuzhan Vong commander."}, {"tag": "p", "text": "While raising the lightsaber he held in his hand, Finn related how the Yuuzhan Vong had taken his family, friends, and home. He then brought down the lightsaber to cut the duracrete in half; freeing Tsalok in a strange gesture of mercy. Galfridian quickly fled Rychel on one of the evacuation ships. Unable to bear the shame of defeat and being denied a warrior's death, Tsalok slaughtered several weak and elderly Human prisoners."}, {"tag": "p", "text": "Tsalok later took command of the planet Rychel but his victory felt hollow as he reflected on why the Galfridian had spared him. He decided that he must seek out Galfridian and hurt him until he got the answers he sought."}, {"tag": "p", "text": "To learn more about Finn Galfridian Tsalok traveled to Dibrook to interrogate Yuledan, a captured Jedi. Tsalok placed a tizowyrm in his ear and a Spineray on his back to interrogate and torture him. Yuledan resisted for several days, relying on the Force to sustain himself. However, he eventually broke down and told Tsalok that he was in training on Yavin 4. Tsalok then took Yuledan with him offworld when New Republic and refugee forces breached the facility, forcing the Yuuzhan Vong to evacuate the Shapers."}, {"tag": "p", "text": "Tsalok later took Yuledan and the shapers to Rychel. Yuledan continued to be experimented on, but Nagame and the other Shapers did not want him to break, or else their plans for him would not succeed. They allowed Yuledan to escape from his confinement in order to keep his spirit up, and he acquired a weapon and attempted to kill Nagame. Tsalok intervened, picking up Yuledan and throwing him against a wall, and was about to impale him upon an Amphistaff before Nagame stopped him. She explained to him the situation, but Tsalok was determined that Yuledan would not touch her. He advanced on Yuledan, who raised his arms in defense, but Tsalok cut off his right hand in punishment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}