{"url": "Tsil", "categories": ["Category:Legends articles", "Category:Enslaved species", "Category:Mineral-based sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Tsil"}, {"tag": "p", "text": "Tsil, also known as Spook-Crystals or Smokies, were mineral-based life forms that resided on the planet of Nam Chorios. Oldtimers, descendants of the planet's original Human settlers, gave the Tsils their names and nicknames, and were unaffected by the electrical storms they produced. Offworlders caught in the five-to-ten minute electrical storms that the Tsils created, were left sick for about a day and a half. The Guardian crystals were the largest of all the crystal variants; this made them capable of controlling the smaller crystals."}, {"tag": "p", "text": "As Luke Skywalker discovered, Tsils could reflect and amplify light and life energy. This increases the Force sensitivity on Nam Chorios, and the slightest use of the Force on the planet would set off a wild Force storm. Tsils communicated via telepathy by putting images in another's mind. Oldtimer religious leaders known as \"Listeners\" could hear these \"voices.\" One apparently had to be Force-sensitive to understand a Tsil. The Tsils warned the Oldtimer prophet Theras that the drochs which inhabited the planet were the cause of the terrible Death Seed plague. Drochs are weakened by light, so the Tsils' ability to amplify light rendered drochs harmless on Nam Chorios."}, {"tag": "p", "text": "A number of Tsils were taken offworld for commercial and industrial exploitation. They were officially designated for use in filtering light for K-Class planets, but their primary purpose was to function as the core component of Centrally Controlled Independent Replicant systems in the CCIR Needle and synthdroid projects undertaken by Loronar Corporation. The reprogramming process used to harness a Tsil for these purposes was considered an atrocity by the Tsils. Tsils offered the solution to the Death Seed plague to Leia Organa Solo if she made sure all the Tsils thus enslaved were returned. She agreed, and most of the Tsils were returned to Nam Chorios after containing the droch threat."}, {"tag": "p", "text": "In 44 ABY, Sith apprentice Vestara Khai killed a Tsil during a battle against the dark side entity Abeloth in order to create a death convulsion, which harmed Abeloth in the process while also allowing her and her Jedi allies to escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}