{"url": "Tsalesh", "categories": ["Category:Legends articles", "Category:Males", "Category:Rift Alliance military personnel", "Category:Selkath"], "nodes": [{"tag": "h1", "text": "Tsalesh"}, {"tag": "p", "text": "Tsalesh was a male Selkath private, from the planet Manaan. During the Cold War between the Galactic Republic and the resurgent Sith Empire, Tsalesh was part of the Rift Alliance Coalition Forces and stationed on the planet Hoth. He aided the Barsen'thor in stopping the pirating of their trade lines."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tsalesh was a male Selkath from the planet Manaan, and served in Manaan's own military. During the Cold War between the Galactic Republic and the resurgent Sith Empire, Manaan's citizens were unhappy with how the Republic had ignored them in their need when their home world was bombarded by the Sith Empire. They formed an alliance with similar displeased members of the Republic, and named it the Rift Alliance. Pirates were however raiding their trade lines in the Outer Rim, so they formed a Coalition Force comprising members of each member's planet. Tsalesh joined the coalition force as a private and joined his new team on the planet Hoth where they had located the pirates' base."}, {"tag": "p", "text": "The team made their home base in the Whiterock Wastes at the Republic Aurek Base, where they would plan their operations against the pirates. Under the command of Lieutenant Felix Iresso they would perform strikes against the pirates who had become a splinter faction of the White Maw Pirates. Their attacks proved futile on the pirate leader, Valon, who kept coming back despite having even a tunnel collapsed on him. As more members of the team got killed during their repeatedly failed missions, the squad's morale became very low. One day after Valon had stolen their Thermal bore device, private Kree had had enough and proposed that they should all leave the planet while they were still alive. As he shouted at Lt. Iresso, a Jedi walked in, the Barsen'thor. The Jedi was to be their new commander and solve the problem with the pirates. The squad members agreed that it was impossible, and Tsalesh chimed in that they had tried everything against their leader Valon. Iresso calmed the squad down and talked them out of leaving the planet while convincing them that the Jedi would kill Valon. The Barsen'thor then headed out into the icy wastelands of Hoth and succeeded in retrieving the stolen thermal device, but not in defeating Valon. During the Jedi's quest, the lieutenant had sent all of the squad members out on a training mission to distract their minds. After their mission was finished the squad journeyed to Outpost Onith."}, {"tag": "p", "text": "At the outpost, the squad was suddenly attack by several bandits, but the Barsen'thor came and helped them. Private Kree figured out that Valon wasn't dead due to the coordinated attacks and pulled his gun at the Lieutenant in desperation. The Barsen'thor revealed that so was the case, but that he had managed to find out Valon's secret to his immortality which lay in his armor. Iresso quickly disarmed Kree and knocked him to the ground. Kree would be punished for his disobedience, but private. Falch stepped in and said that Kree was right in that no one could defeat Valon. The Jedi explained how Valon's armor worked and how it was stolen from an Imperial research lab on the planet. The lieutenant had intel on such a facility and that they might get more information there. Since the facility was most likely guarded, Iresso proposed a costly frontal assault or to lure them out into the snow. He ordered Tsalesh and the others to get their gear as they were moving out to hit both Valon and the Empire. The operation was a success and the facility was captured."}, {"tag": "p", "text": "While standing guard outside, the squad spotted several of Valon's men and reported to the lieutenant. They headed in the direction of the pirates and stumbled upon a camp which they cleared out from hostilities. The scouts had tracked the pirates' trail back to the Star of Coruscant, a massive dreadnought in the Starship Graveyard. Iresso theorized the pirates intended to repair the ship and use it as a flagship, which was something they could not allow. Private. Kree suggested that they strike at the engines while the Barsen'thor lure Valon out. Lieutenant Iresso agreed, and said they would signal the Jedi when they had disabled the engines. Tsalesh and the squad was successful in disabling the engines, and the Jedi was able to overpower Valon. After their completed mission they headed to Outpost Zerek where they remained in order to properly thank the Jedi. They handed some of their equipment to the Barsen'thor as they would no longer need it. They also informed the Jedi that Lieutenant Iresso would meet the Jedi at its ship. Private Cawelyn said the Jedi was one of them now and wished the best of luck. Tsalesh and the others would then leave Hoth and journey back to their respective planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tsalesh was a recruit with seemingly light experience, as the mission on Hoth would bring out. After their failed missions and low morale, Tsalesh was subjective to the group pressure and joined everyone in their desperation against Valon, the pirate leader. The height of his desperation could be seen as he shouted out that they had tried everything to defeat Valon. With the Barsen'thor leading their squad, he would gain more confidence as they accomplished more missions and eventually defeated the pirate leader."}, {"tag": "p", "text": "Tsalesh had a mottled blue skin color and black eyes. He spoke his species' language and wore a white chestguard armor with blue markings, along with boots, greaves, gloves and a blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tsalesh was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. Tsalesh appeared in the Consular class quest line on the planet Hoth, and could be first seen in the mission ”The Coalition”."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}