{"url": "Tsuusha", "categories": ["Category:Legends articles", "Category:Males", "Category:Rift Alliance members", "Category:Scientists", "Category:Selkath"], "nodes": [{"tag": "h1", "text": "Tsuusha"}, {"tag": "p", "text": "Tsuusha was a male Selkath who served as the head researcher for the Rift Alliance at Attis Station on the planet Quesh. During the Cold War between the Galactic Republic and the resurgent Sith Empire, the station was attacked by the latter, and it was only through the means of the Barsen'thor of the Jedi Order that Tsuusha was saved."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Cold War the secessionist movement within the Republic known as the Rift Alliance established a secret research facility on the planet Quesh, called Attis Station. As Manaan was a member of this alliance, several Selkath scientists came to Quesh to contribute their expertise, chief of whom was Tsuusha. He headed several projects that utilized the Venenit queshaaga which included a classified weapons program, and medical research program. Attis Station was discovered and attacked, however, by Sith warriors from the Sith Empire and communications with the Rift Alliance were lost. In response, the Rift Alliance sent the Republic's Jedi ambassador, the Barsen'thor, to investigate the matter."}, {"tag": "p", "text": "The Jedi managed to enter the lock-down station, and made short work of the Sith forces that were trying to kill the remaining scientists. Eventually the Barsen'thor made its way to the sealed room, and upon entering it, a holocall came through on the Holocomm in the room. A Sith Lord named Kyrus spoke with the Jedi, trying to entice him, but failed and ended the transmission."}, {"tag": "p", "text": "The Selkath Researcher had not realized that the person was a Jedi, so he pleaded for his life when the person approached him and his colleagues. The Barsen'thor corrected him, to which the Researcher exclaimed relief. The Selkath vented his frustration of the unsolicited attack from the Sith, and thanked the Jedi for saving them. As the Jedi was about to leave, the researcher stopped him and said that they would like to help him giving the Jedi their latest discovery of any research field. Although most of their equipment had been destroyed, they could continue one of their big projects, either the classified weapons program or the breakthrough in medical technology. The Barsen'thor would make the choice, though personally the Tsuusha thought that the medical research was more worthwhile as it could save a lot of lives as well as the Barsen'thor's. One of the Jedi's companions then contacted the Jedi and informed them that the station was free from the Sith now. The Selkath researcher then bid the Jedi farewell and said that they will be in touch. He first had to tend to his colleagues, but they would soon be back to work."}, {"tag": "p", "text": "After the Barsen'thor had left Attis station, Tsuusha would contact Senator Tobas Grell of what had happened, and of how Kyrus had contacted the Jedi for unexplained reasons."}, {"tag": "p", "text": "Some time later, Tsuusha sent the Jedi a message to let them know of the success of the research. He would also publish a paper on their results in the next monthly Coruscant Medical Review."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tsuusha was seemingly a hard and devout worker for his cause with the Rift Alliance, as was evident with his eagerness to get back to work after the attack by the resurgent Sith Empire. He also seemed to care for others as he was horrified by the killing the Sith had done."}, {"tag": "p", "text": "The researcher had a mottled blue skin color and black eyes. He spoke his species' language and wore standard clothing, boots and gloves with a researcher's robe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tsuusha was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. The Selkath was found in a rescue mission called ”Atiss Station” in the Consular class' main quest line. Although his NPC name said \"Researcher\", his name was revealed in a message sent to the player afterwards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}