{"url": "Tsui_Choi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Aleena", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Tsui Choi"}, {"tag": "p", "text": "Tsui Choi was a male Aleena who served as a Jedi Master in the final years of the Galactic Republic. Serving in several Jedi campaigns during this time, such as when the Yinchorri became suddenly aggressive and fought against the Republic in 33 BBY. During the Clone Wars between the Republic and a separatist faction, he accepted the position of a Jedi General in the Grand Army of the Republic. He would fight for the entirety of the war."}, {"tag": "p", "text": "When Order 66—a mandate given to the Grand Army's clone trooper forces that commanded them to execute their Jedi officers—was issued in 19 BBY, Choi managed to survive his assailants' efforts. However, approximately one month after the end of the war, he was killed during a confrontation with Dark Lord of the Sith Darth Vader on the planet Kessel, along with a number of other Jedi who had also survived Order 66."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Yinchorri Uprising"}, {"tag": "p", "text": "In the years leading up to the conflict between the Jedi Order and the reptilian species known as the Yinchorri, Jedi Master Tsui Choi took an Anx, Theen Fida, as his Padawan. In 33 BBY, Choi volunteered to go as part of one of three Jedi task forces being sent to investigate Yinchorri aggression in the star systems neighboring their homeworld of Yinchorr. Choi was sent to the oceanic world of Yitheeth alongside a team consisting of himself, Fida, Tholothian Adi Gallia and Zabrak Eeth Koth; specifically to locate a Yinchorri compound on the planet. While on board a Consular-class cruiser, the four Jedi crash-landed on that world, to find that there was no such base on the planet. There was only a force of Yinchorri warriors there to ambush them."}, {"tag": "p", "text": "Choi and the other Jedi fought their way through the Yinchorri and find transport off the planet. The four Jedi then traveled to a nearby planet, Yibikkoror, where another of the task forces was carrying out a similar mission. The two groups of Jedi met and set a course to Yinchorr, where Jedi Masters Mace Windu, Qui-Gon Jinn, and Saesee Tiin, along with Jinn's Padawan, Obi-Wan Kenobi; were busy holding off a massive Yinchorri attack. Choi and the other Jedi joined the fight and, during the ensuing multi-planetary battle, Theen Fida was killed. Choi was greatly disturbed by the death of his Padawan. Because of this, when he caught a Devaronian associate of the Yinchorri army whom the Jedi had captured, smuggler Holmar Grahrk, trying to steal a Consular-class cruiser to escape Yinchorr, Choi approached him angrily and took him into custody. Choi later attended the funeral of his Padawan on the planet Coruscant—where Fida was cremated alongside Micah Giiett and Lilit Twoseas, other Jedi who were killed during the excursion."}, {"tag": "p", "text": "Shortly afterwards, Choi became a candidate for a seat within the Jedi High Council for his actions in the Yinchorri Uprising; he never got the chance to accept or refuse it, however, allowing him to maintain a lower profile in the first weeks of the Great Jedi Purge later on."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Choi went on to become a Jedi General in the newly-formed Grand Army of the Republic during the Clone Wars between the Republic and a group of planets that wished to secede from the galactic government. He led a group of clone trooper pilots known as Red Squadron into battle alongside another Jedi, Aayla Secura, at the beginning of the war. Red Squadron fought in the First Battle of Kamino, when separatist forces attacked the Kaminoan cloning facility on the planet Kamino producing troops to bolster the Republic's army. The Jedi battle plan assigned Choi's squadron the task of taking on attacking Separatist starfighters in Delta-7 Aethersprite-class light interceptors while Blue Squadron, under the command of now-Jedi Knight Obi-Wan Kenobi, attacked incoming troop transports. During the battle, Jedi Master Kossex, a member of Choi's squadron, was shot down and was killed by the opposing force before the Republic forces could repel the invaders."}, {"tag": "p", "text": "Later in the war, Master Choi was one of several Jedi who were on the Republic Troopship VCD987. While traveling to the planet Drongar, VCD987 came under attack by a large Separatist force and sustained massive damage to its engines. With the engines no longer functioning, Separatist troops under the leadership of a Sith Lord, Count Dooku, boarded the ship and cornered Choi and his companions, Knights Sian Jeisel and Kai Justiss. In an attempt to appear merciful and sway the Jedi team to the Separatist cause, Dooku allowed the captives to go free, opting to only kill the clone troopers accompanying them instead."}, {"tag": "p", "text": "During the fight to rebuff Separatist invaders of the planet Kashyyyk three years later, Tsui Choi and a team of Aleenan scouts performed reconnaissance missions for the Republic, riding can-cells through the forests of the planet. His time on Kashyyyk was cut, however, as he was likely called away to Eriadu."}, {"tag": "h3", "text": "Great Jedi Purge"}, {"tag": "p", "text": "Tsui Choi survived the activation of Order 66, a mandate given to the clones ordering them to kill their Jedi commanders, by pretending to be dead after he was shot down over Eriadu as well as evade and kill his former clone trooper subordinate—who, with the rest of a squad that served under Choi, now fought to kill Jedi as a clone stormtrooper—on the planet during the first month of the Great Jedi Purge. Immediately afterwards, he was reunited with fellow Jedi survivor Bultar Swan, who told Choi of the imminent rendezvous on Kessel with six other living Jedi. The other Jedi, particularly Koffi Arana, wanted to strike back at Darths Sidious and Vader, the perpetrators of the Purge and the masterminds of Order 66 as well as the deaths of almost every Jedi at the Jedi Temple. Choi disagreed with them, refusing to take cold-blooded revenge on the duo, as he felt doing so would accomplish nothing while leading them all to the dark side."}, {"tag": "p", "text": "Choi was shocked to learn that Shadday Potkin, an attendee of the meeting, had leaked information of the secret conference to Vader because she thought that, if all the Jedi there worked together, they could eliminate him. The Sith Lord attacked the group shortly after the meeting commenced; and though Choi was initially opposed to fighting Vader, his position changed after the Sith killed Knight Sia-Lan Wezz. Choi joined the fray, severing Vader's robotic hand with his lightsaber, though this would not stop Vader, who then killed several more of the Jedi, including Potkin. Choi, with Masters Roblio Darté and Jastus Farr, then used the Force to launch a barrage of boulders at the Dark Lord, incapacitating him."}, {"tag": "p", "text": "With Vader outmaneuvered, Choi felt there was no other choice than to strike down the Dark Lord. However, before he could do so, Imperial stormtroopers arrived. While the three could stave off their blaster fire for a time, Farr was killed in the barrage. Choi then leapt up to the balcony where the troopers were standing in order to give Darté, the only other survivor, a chance to escape, Vader held him in place with the Force so his troops could shoot him. Choi, knowing that he was close to death, threw his lightsaber at Vader, cutting a hole in his helmet. Immediately thereafter, Tsui Choi was gunned down by the stormtroopers, and Darté was felled while crying out Choi's name."}, {"tag": "p", "text": "When the Galactic Empire was finalized as the replacement of the Galactic Republic, the government's official records of the Jedi Purge, compiled by Moff Marcellin Wessel and supplemented by Grand Vizier Sate Pestage, stated that many Jedi who'd been slaughtered during the initial stages of the Purge were executed for various false crimes from kidnapping children to plotting to poison the water supply of a planet. Choi's personal file claimed he was executed for illegal spice trafficking. The parts of the documents the new Galactic Emperor, Sidious, approved were broadcast to the public via Imperial HoloVision."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tsui Choi was a peaceful Jedi Master, and was not fond of conflict—though he used his blue, later green, lightsaber when it was required of him—as he felt unprovoked or vengeful violence was pointless. He followed this philosophy to the point that he would not strike at Darth Vader, the man who killed many of his comrades during his assault on the Jedi Temple, until he had executed one of the Jedi who had attended the Conclave on Kessel. Choi was a brave and noble being, who would gladly give up his life to save the lives of others. He was popular among the order for his diplomatic, wise, and insightful ways."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Jedi Master, Choi was very skilled in the use of the Force and in lightsaber combat. Choi generally used his small stature to his advantage in battle, incorporating a wide array of acrobatic feats and quick attacks when he fought. Before his death, he was capable of holding his own against a Sith Lord in a lightsaber duel."}, {"tag": "p", "text": "Choi also excelled at both piloting and swimming, skills which came in handy during his adventures."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tsui Choi, an Expanded Universe character, almost made an appearance as one of the Jedi Council members in Star Wars: Episode III Revenge of the Sith. However, this appearance was taken out after it was decided that Jedi Master Shaak Ti wouldn't be killed as originally planned. Choi can still be seen riding a can-cell during the Battle of Kashyyyk. Aside from his cameo in the movie, Choi has only appeared in various comics series from Dark Horse Comics related to the waning years of the Galactic Republic until his death in Star Wars: Purge, which primarily took place a month after the Republic fell. All of his dialogue in the comics was written in sentence case, even though all other speech is written in all capital letters."}, {"tag": "p", "text": "Randy Stradley, the Vice President of Publishing for Dark Horse, originally planned to make the character a Vulptereen, the species of the podracer Dud Bolt in Star Wars: Episode I The Phantom Menace. He was told by Lucasfilm that the Vulptereen were too un-intelligent to become a Jedi, so he chose the species of another Podracer, Ratts Tyerell, instead."}, {"tag": "p", "text": "A Tsui Choi figurine was released by Hasbro in April 2008. It came bundled with a BARC Trooper, adorned in a yellow-accented suit, in the second serial of a set called \"Order 66.\" The set, a subsidiary of the main Star Wars action figure line, was sold exclusively at Target stores that year."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}