{"url": "Tsw%27ells", "categories": ["Category:Canon articles", "Category:Aquatic creatures", "Category:Creatures of Luprora"], "nodes": [{"tag": "h1", "text": "Tsw'ells"}, {"tag": "p", "text": "Tsw'ells were giant tentacled creatures that lived in the seas of the planet Luprora. Captain Phasma encountered several tsw'ells during the hunt for Lieutenant Sol Rivas, killing one with her knife and later electrocuting several during an assault on the R'ora stronghold."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The tsw'ells were giant tentacled monsters with pink skin, numerous tentacles, sharp teeth, and two eyes. They preyed on humanoids including the immigrant Lupr'or. They also bled green blood."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The tsw'ells were native to the oceans of the planet Luprora. As the sea levels rose, the tsw'ells moved inland and exacted a toll on the immigrant Lupr'or, harassing and killing many of their fishermen. The Lupr'or regarded the tsw'ells as monsters of great strength. When Captain Phasma and TN-3465 traveled to Luprora in 34 ABY to hunt down Lieutenant Sol Rivas, they were attacked by a tsw'ells. During the brief skirmish, Phasma was able to kill the creature with a knife, earning the admiration of the Lupr'or."}, {"tag": "p", "text": "Tsw'ells also appeared to share a symbiotic relationship with the R'ora, an aquatic species native to Luprora. Several of the creatures guarded a R'ora stronghold on an island in a lake near a village inhabited by the Lupr'or. Under Phasma's leadership, the Lupr'or electrocuted the tsw'ells in the lake with generators salvaged from an abandoned starship, killing them. This enabled the Lupro'r to storm the R'ora stronghold, which allowed her to kill Rivas in order to conceal her role in the destruction of Starkiller Base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tsw'ells first appeared in Star Wars: Captain Phasma, a 2017 four-issue comic published by Marvel Comics as part of the Journey to Star Wars: The Last Jedi promotional material. The species was created by Kelly Thompson, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}