{"url": "Tumble_bunny_trainer", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Tumble bunny trainer"}, {"tag": "p", "text": "A trainer of tumble bunnies found work as an entertainer on the Forest Moon of Endor. He was popular with the woklings of Bright Tree Village. In 3 ABY, the tumble bunny trainer hosted a tumble bunny exhibition at the Bright Tree Fête for a wokling audience. The tumble bunny trainer's show, although well received by the woklings, was not without its detractors. Budding warrior Wicket W. Warrick spoke out against the show, decrying it as \"no place for a warrior to be seen.\""}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The tumble bunny trainer was of a humanoid species. He was green in color, though pink at the neck and eyes; he also had a bill. He had a show in which small animals called tumble bunnies were made to perform tricks for a live audience. One such stunt involved having the tumble bunnies jump through a hoop held up by the tumble bunny trainer himself. In 3 ABY, the tumble bunny trainer performed his show at Bright Tree Village on the Forest Moon of Endor, as a part of a festival in the village. While performing, his show gathered an audience of woklings. These young Ewoks enjoyed the show, and the tumble bunny trainer called out to the other Ewoks at the fête, hoping to attract a larger audience."}, {"tag": "p", "text": "Word of his act reached fellow fête participant Shodu Warrick, who sent her son, Wicket, and daughter, the wokling Winda, off to see the show. Upon arriving at the tumble bunny trainer's exhibit, however, Wicket scorned the tumble bunny trainer's performance and announced that an aspiring warrior such as himself should not be seen attending such a display. Accordingly, he and his friends loudly decided to seek other forms of entertainment. Later, as punishment for not suitably looking after the woklings under his care, Wicket was forced to emulate the tumble bunny trainer's act, even going so far as to wear the same tumble bunny-resembling attire while doing so."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When performing, the tumble bunny trainer displayed enthusiasm, jovially interacting with his audience, from whom he garnered positive responses. For attire while performing, the tumble bunny trainer dressed himself in a yellow suit that featured the three ears of the tumble bunnies, imitating, to a degree, the centerpieces of his show."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tumble bunny trainer first appeared in an episode of Ewoks entitled \"Horville's Hut of Horrors,\" which was written by Paul Dini. The episode, a part of the show's second season, first aired on November 15, 1986."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}