{"url": "Tul%27kar", "categories": ["Category:Legends articles", "Category:Force-sensitives", "Category:Males", "Category:Predors", "Category:Rakata"], "nodes": [{"tag": "h1", "text": "Tul'kar"}, {"tag": "p", "text": "Tul'kar was a male Rakata who served the Infinite Empire of his species as a Predor, a military commander. Tul'kar trained the Human slave known as Xesh as his Force Hound, and the young warrior led his master to many Force-rich planets across the galaxy while in Tul'kar's service. In 25,793 BBY, Skal'nas employed Xesh's service in locating a particularly Force-strong world in the Deep Core, and Tul'kar claimed right of conquest for the planet as Xesh was his Hound. However, Tul'kar's warship Devourer was severely damaged upon arrival in the Tython system, and Tul'kar was slain in the chaos by his own Hound, who stole Tul'kar's personal escape pod and escaped the crash."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Rakata, Tul'kar rose to the rank of Predor within the Infinite Empire well before the year 25,793 BBY. While surveying the slaves whom the Rakata used to power their machines, Tul'kar sensed great power in the Force within a young Human boy designated Xesh, and he freed the boy from the machines in order to train him as a Force Hound—Force-sensitive warriors whom the Infinite Empire used to locate Force-rich planets across the galaxy. Under Tul'kar's tutelage, Xesh became a powerful Force Hound, and during his training, Tul'kar pitted Xesh against one of his broodmates, a girl named Trill, for his amusement. Xesh emerged victorious in their fight as Tul'kar watched, and Tul'kar handed Xesh a Forcesaber—a Rakatan weapon—to kill the fallen Trill. However, Xesh instead proposed that Trill be given as a Force Hound to Skal'nas, Tul'kar's superior, and Tul'kar accepted the proposal in amusement."}, {"tag": "p", "text": "Sometime after this, a battle in the arena on the planet Byss was arranged between Xesh and Skal'nas's Force Hound Isk, and Tul'kar and Skal'nas made wagers on the outcome of the fight. Xesh ultimately emerged victorious, and Tul'kar gloated over Xesh's victory and lack of mercy as Skal'nas ordered Isk to be prepared for their table. As Tul'kar's Force Hound, Xesh led his master to Force-rich worlds such as Sriluur, home of the Weequay species, and determined the strongest of the Force-sensitives among the planets' populations. In 25,793 BBY, Xesh led Tul'kar and his forces to the planet Tatooine, which Tul'kar's forces conquered and captured many of the native Kumumgah."}, {"tag": "p", "text": "At Tul'kar's command, Xesh culled the Force-sensitives from the population, and when the father of a Kumumgah named Lonai grew enraged at his son's murder, Tul'kar killed him with Force lightning. When a Rakata named Ore'mun delivered a message from Skal'nas, requesting that Tul'kar and Xesh return to Skal'nas's command center on the planet Byss while Ore'mun remained behind to oversee the culling. Sensing Ore'mun's lust for his command, Tul'kar reached out with the Force and gripped Ore'mun by the throat, choking him and then electrocuting to death. Tul'kar then ordered his subordinates to prepare Ore'mun's body so that he could consume his fallen rival."}, {"tag": "p", "text": "On Byss, Skal'nas ignored Tul'kar's anger at being removed from the Tatooine conquest and explained that he required Xesh's skills—Trill had sensed a Force-rich world withing the Deep Core, but she was unable to locate it precisely. When questioned by Skal'nas, Xesh admitted that he could find the world, but his words angered Trill and Tul'kar watched as the two Force Hounds began to battle each other—a battle that saw Xesh victorious and about to kill Trill before Skal'nas intervened. Irritated, Tul'kar expressed his desire to see who the dominant Force Hound would be, and the Predor was quick to declare right of conquest when Xesh answered Skal'nas's request for him to find the planet."}, {"tag": "p", "text": "However, when Tul'kar's warship Devourer arrived in the Tython system, which contained Tython—the Force-rich world they sought—the Devourer became wracked with explosions. As the crippled warship fell toward Tython, Tul'kar and two of his guards fought their way through the panicking slaves aboard the ship to reach Tul'kar's escape pod, but the Predor found his warriors who were tasked with guarding the pod had been slain when he arrived. Furious, Tul'kar demanded to know who was responsible, only for Xesh—under the mental control of Skal'nas—to stab the Predor through the chest with his Forcesaber. Leaving his dead master aboard the ship, Xesh took the escape pod while the Devourer crashed on Tython's surface. An enraged Skal'nas, when he found that the Devourer's reporting beacon was offline, believed that Tul'kar was trying to keep the world to himself and sent Trill to track down Xesh and the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A cruel and ruthless individual, Tul'kar was a male Rakata with blue skin and yellow eyes. Tul'kar also had four diamond shape tattoos on the top of his head. Tul'kar spared no sympathy or emotion for those he considered to be lesser beings, and his sense of superiority led him to view his superior, Predor Skal'nas, with contempt. A cannibal like the rest of his species, Tul'kar was more than willing to his execute rivals, even if they were his subordinates or allies."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A powerful Force-sensitive with strength in the dark side, Tul'kar was capable of using both telekinesis and Force lightning, and he considered himself a particularly skilled warrior."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tul'kar was first mentioned in the preview issue 0 for the Star Wars: Dawn of the Jedi comic book series, and he first appeared in the first issue of the series. Tul'kar died during the events of the second issue, though it was not depicted until the fourth, and he has appeared in flashbacks to Xesh and Trill's past in several later issues."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}