{"url": "Tuk%27ata", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Creatures", "Category:Sith warbeasts"], "nodes": [{"tag": "h1", "text": "Tuk'ata"}, {"tag": "p", "text": "Tuk'ata were a species of creatures classified as a Sith warbeast. Also known as Sith hounds, they could be found on Moraband."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Tuk'ata were large quadrupedal creatures whose limbs ended in clawed paws. They boasted a long whip-like tail, a mouth full of sharp fangs, and a row of spines along their back and tail. One tuk'ata was known to posess the ability to leap over twice its height."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At one point, Latts Razzi's crime syndicate acquired two complete mummified specimens. Those mummies were later confiscated by Dryden Vos of the Crimson Dawn syndicate, along with many other goods."}, {"tag": "p", "text": "Doctor Aphra entered an ancient temple in search for the fabled Sword of Khashyun some time after the Battle of Yavin with a crew of Shistavanen, during which she was surprised when she encountered a tuk'ata guarding the tombs, having believed the species to be mythical at the time. The archaeologist and the remainder of the crew then lost the final Shistavanen to the hound as they were chased down the hallways before the rogue deceived the beast, leading it to one of the traps laid within the construct and pretending to be injured and immobilized. The tuk'ata took the bait, leaped high towards Aphra and inadvertently triggered laser field that proceeded to bring the hound to a halt, allowing Aphra and her droid companion, BT-1, to escape the Sith tomb."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tuk'ata were first mentioned in Dooku: Jedi Lost, an audiobook written by Cavan Scott and published in 2019. In the Star Wars Legends continuity, the tuk'ata first appeared in Tales of the Jedi – Dark Lords of the Sith 3, a comic published in 1994."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}