{"url": "Tuhgri", "categories": ["Category:Legends articles", "Category:Kathol sector species", "Category:Tuhgri"], "nodes": [{"tag": "h1", "text": "Tuhgri"}, {"tag": "p", "text": "The Tuhgri were a sentient species native to the planet Ehjenla in the Kathol Outback."}, {"tag": "h2", "text": "Physical description"}, {"tag": "p", "text": "Tuhgri usually stood around one point two-five meters tall, and had mottled red skin. They were completely hairless, and possessed gangly arms that ended in six-fingered hands. Bony ridges crossed the Tuhgri's scalp to give their brains protection, and their noses looked like diamonds with four nostrils. Tuhgri also sported small eyes and ears, and had powerful leg muscles that allowed them to leap up to four meters high and eight meters forward."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A tribal people, the Tuhgri were split into tribes, each with a single chieftain, known as the Gaawan responsible for control over them. Once a year, all the Gaawans met at the House of Balance to settle disputes or pass any planet-wide policies. During this meeting, each tribe was held in equal status regardless of their political or military position. Tuhgri were extremely tribe-orientated, and maintained a strong connection with every member of their tribe. This connection was extended to anyone that the Tuhgri had been in contact with for a period of three months."}, {"tag": "p", "text": "The Tuhgri believed that everything they needed for survival was provided for them by the Great Creator. This belief shaped their society, and their first law prohibited the owning of anything by a single individual. Any Tuhgri in need of something could borrow it until they no longer had any use for it. Needless to say, this way of living did not endear them to the inhabitants of the sector, and many planets banned Tuhgri. Despite this, Tuhgri offered anything they had to those who needed it, but expected the same generosity in return."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}