{"url": "Tunroth", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Mammalian sentient species", "Category:Mid Rim species", "Category:Tunroth"], "nodes": [{"tag": "h1", "text": "Tunroth"}, {"tag": "p", "text": "The Tunroth were bipedal sentients indigenous to the Jiroch system of the Mid Rim. Towering and physically strong, Tunroth had distinctive elongated heads, a vertical nostril at the top of the skull, and three-digit hands and feet. Widely spaced eyes and sharp horns that lined the chin constituted other distinct physical features. The species was renowned throughout the galaxy for their hunting and tracking skills. They had an innate ability to track a quarry, and over time, an elite association known as the Tunroth Hunters came into demand for employment as bounty hunters and big-game hunters. The fact that the Tunroth maintained their use of sacred hunting weapons such as the klirun bow and the kilter staff even after galactic-standard blasters became available to them attested to the religious importance the Tunroth placed on hunter traditions. Each Tunroth community was ruled by the greatest hunter present. Aggressive and hard-working, Tunroth had a tendency to intimidate members of other species."}, {"tag": "p", "text": "The Tunroth were members of the Galactic Republic for thousands of years. After first contact with outsiders, the species spread to other habitable planets in their system. In 7 BBY, during the reign of the Galactic Empire, Lortan fanatics virtually wiped them out in an onslaught known as the Reslian Purge. The Empire intervened to save the Tunroth from total annihilation, and the Tunroth came to greatly respect the galactic government. The species slowly recovered, as expatriate Tunroth returned home to help rebuild their civilization. The system joined the Empire, although some members resisted the Emperor's anti-alien policies as members of the Rebel Alliance. After the transition from Galactic Empire to New Republic, the Tunroth remained wary of the new government but eventually joined it."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Tunroth were hairless, bipedal, sentient mammals who averaged 1.7 meters in height. The large frame supported a muscular physique, which gave the species a reputation for great strength. Tunroth had only three digits on each hand and foot: two opposable thumbs on either side of a large, central fin-like digit."}, {"tag": "p", "text": "The most recognizable Tunroth feature was an elongated skull that sat forward over the sloping neck. The arrangement produced a distinctive look, along with a large vertical nostril, set above the low, wide-set eyes. Each Tunroth had pronounced teeth, and a number of bony, horn-like protrusions studded the lower jaw. Many Tunroth placed similar spikes on their clothing, such as on shoulder pads and shin guards."}, {"tag": "p", "text": "The Tunroth people developed at a reasonably standard rate: considered younglings until around age eleven, society regarded them as full adults by age of eighteen. Tunroth reaching sixty were considered old, while those living past eighty were considered venerable. Tunroth skin coloration was typically dark brown or yellow, but orange-skinned Tunroth lived on certain remote continents. Tunroth blood was blue."}, {"tag": "p", "text": "Tunroth had a natural tracking ability, commonly referred to as quarry sense. Evolved over thousands of years of hunting, they had an innate sense of what direction their quarry had taken. Familiarity with the beast or individual heightened this skill, and it was a vital component in their hunting and tracking abilities."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Hunting"}, {"tag": "p", "text": "Hunting was the most common profession for Tunroth and formed the mainstay of their way of life. Creatures common to all the Tunroth worlds, such as dlarnic grazers and several nerf breeds, provided basic sustenance. Tunroth taught their children to hunt from very early on, and as such, hunters and trackers became the most highly respected individuals. It became not just a way of life, but symbolic of their view of life. Hunting became a serious spiritual endeavor. Ancient lore told of brave Tunroth who defeated the fiercest wild beasts armed only with the sacred bow known as the klirun."}, {"tag": "p", "text": "The klirun was a traditional Tunroth hunting bow, weighing around 3.5 kilograms. Built with a recurve, the weapon remained bow-shaped even when unstrung. Taking advantage of the above-average strength of the Tunroth hunters, the bow had an especially heavy pull. In the hands of a capable hunter, the weapon was extremely accurate and capable of piercing stormtrooper armor. The bows used caros arrows, which were occasionally tipped with talar, a stunning agent. The talar enabled a hunter to strike a non-lethal blow and ensure a live capture. Over time, the klirun became a sacred weapon. Another traditional weapon was the kilter, a heavy staff."}, {"tag": "p", "text": "Gradually, the Tunroth hunting tradition developed into the highly stratified organization known as the Tunroth Hunters. Only the most skilled Tunroth qualified as Hunters, a process that involved a three-month initiation ritual and acceptance by three approved Hunters. This was decided based on the skill, judgment and motivation of the candidate. Undesirable qualities, such as a particularly argumentative or greedy nature, could bar admission regardless of the candidate's skills. There were twenty-seven Hunter levels, with progression determined by strict guidelines. The twelfth level was known as shturlan and the nineteenth as chirlan. Stiilran was the twenty-seventh and highest level, a class virtually never achieved—no Tunroth gained it during the regimes of either the Galactic Republic, Galactic Empire, or the New Republic. Virtually all Tunroth aspired to gain a high level as a Hunter, with the greatest Hunters memorialized in the ancient Hall of Predation. This was considered a sacred edifice to the Tunroth, the only such monument they acknowledged."}, {"tag": "h3", "text": "Organization"}, {"tag": "p", "text": "The three highest-level Hunters on the species' home planets formed the governing body, known as the Assemblage of Three. The council dealt with issues that concerned all Tunroth, such as the need to deal with external threats, alleviate overcrowding, or colonize new worlds."}, {"tag": "p", "text": "Hunting ability and leadership were also associated in the smaller units of Tunroth society. The best tracker led each commune, which ranged from 50 to 300 individuals. Such leaders were not required to be Hunters, but it was preferred. Communes without a Hunter would often solicit other communes with more than one Hunter to take over the leadership role. This ensured prosperity for all Tunroth communities."}, {"tag": "p", "text": "The native Tunroth language was known as Tunrothese; it consisted of grunts, snarls and other such vocalizations. The written form of this language used pictograms to represent various objects. Most Tunroth also learned to speak Galactic Basic Standard."}, {"tag": "h3", "text": "Temperament"}, {"tag": "p", "text": "As a species, the Tunroth were aggressive and acted with certainty, traits that made them intimidating to members of many other species. Known for their strength and endurance, Tunroth were generally hard working and tenacious. Their flexible natures and ability to adapt quickly to new situations gave them an optimistic outlook. This attitude sobered after the near-genocide of their species, known as the Reslian Purge."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Joining the galaxy"}, {"tag": "p", "text": "Before galactic contact, Tunroth society had developed into a peaceful hunter-gatherer civilization. They had not developed advanced technology, instead functioning on animal power and handcrafted goods. After Duros scouts, who were exploring the Jiroch system, made first contact with them around 9000 BBY, the Tunroth quickly joined the Galactic Republic. The Tunroth soon made use of galactic technology to colonize their system, with the Assemblage of Three advocating the simultaneous colonization of Kalok and Saloch. Some star-charts identified these planets as Jiroch-Kalok and Jiroch-Saloch, and together with Jiroch-Reslia, spacers called them the Triumvirate. The Tunroth later colonized Saloch², another world in the system. The system became integrated into the galaxy as part of the Yushan sector and the Corellian Trade Spine hyperlane. Duros immigrants settled on the Tunroth colonies of Kalok and Saloch and heavily influenced the architecture of those worlds. From 1004 to 1000 BBY, during the New Sith Wars, the Tunroth's home system fell within a region controlled by the Sith. During the Clone Wars, the Tunroth were allied with the Galactic Republic against the Confederacy of Independent Systems."}, {"tag": "p", "text": "Despite the adoption of space travel, Tunroth preferred their traditional weapons to blasters, and neither purchased nor manufactured advanced weapons. The policy persisted even while—or perhaps because of—horrific conflicts rocked the Republic, and proved effective for many centuries."}, {"tag": "h3", "text": "The Reslian Purge"}, {"tag": "p", "text": "This decision had drastic consequences for the Tunroth during the reign of the Galactic Empire. For centuries, religious fanatics from Lorta had threatened to invade neighboring sectors. When the belligerent Lortans finally carried out their threats in 7 BBY, they conquered twelve systems before they were halted. Known as the Reslian Purge, their conquests included the Jiroch system, as well as Rrulinn, Quaensan Prime and the Dalisor Merchant Fleet. With only their primitive weapons to fight back, the Tunroth were defeated by the invaders. In only three months, the Lortans decimated the Tunroth population, reducing it to a mere four million."}, {"tag": "p", "text": "Only the intervention of the Imperial Navy saved the Tunroth people from extinction. They ruthlessly crushed the Lortans, with a task force led by the Dreadnaught-class heavy cruiser Abrogator, and the 37th Fighter Wing commanded by Soontir Fel. Although the intervention was motivated primarily to protect the Empire's interests, the Tunroth were grateful for the aid. They reluctantly accepted Imperial rule, and many Tunroth became unlikely supporters of Galactic Emperor Palpatine's New Order. However, others resisted the ongoing presence of the Empire, either as members of the Rebellion or in the criminal underworld."}, {"tag": "p", "text": "After the invasion, most Tunroth returned home to rebuild their broken societies. Coming to terms with the tragedy took the Tunroth a long time, but resulted in a strengthening of Tunroth unity across their colonies. The Tunroth also changed their view on modern weaponry, and many communes began stockpiling blasters and other high-power weapons for defensive purposes. The Tunroth developed a fierce hatred for the Lortans."}, {"tag": "p", "text": "After the Battle of Endor and the subsequent defeat of the Empire, the Tunroth were slow to join the New Republic out of fear of being seen as Imperial sympathizers. However, these fears proved unfounded, and the Tunroth were later welcomed into the New Republic. Circa 25 ABY, the population of the Jiroch system was between one and ten billion. By 137 ABY, the system had fallen within territory controlled by the Sith Lord Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Tunroth in the galaxy"}, {"tag": "p", "text": "During the period of the Old Republic, many Tunroth ventured out into the galaxy, where they made use of their renowned hunting skills. Wealthy citizens frequently hired them to lead safaris or capture rare creatures for study. Other hunters excelled as bounty hunters, beast wardens, and big-game hunters. While many Tunroth adventures were top-notch hunters, many low-ranking or aspiring hunters exploited their species' reputation for excellence to pass themselves off as greater than their skills warranted. The Tunroth that did take to the stars tended to embrace advanced technology. They also made use of Republic banking worlds such as Telerath."}, {"tag": "p", "text": "Tunroth were less common in the galaxy after the Purge, as most returned to their home system for the reconstruction effort. Some notable Tunroth Hunters who did remain offworld were Kiran Tatch and Tonas Vueral. Vueral attained the chirlan level and was a renowned tracker. He often worked in the Anthos sector, home to a number of Tunroth immigrants, especially on Berchest. Kiran Tatch was one of the few survivors of the Reslian Purge and attained the shturlan level as a Hunter. Although never substantiated, it was rumored that Jabba the Hutt considered hiring him to capture Han Solo. Such was Tatch's reputation that after spitting on Glorga the Hutt, he was able to leave his employ without the crime lord ordering his death. He later joined the elite Granse Confederacy—an outfit known for its animosity to the Rebel Alliance."}, {"tag": "p", "text": "A less honorable heir of the Hunters' tradition was Shotarr Kass, also known as \"the Strap\". Orphaned by the Reslian Purge, Kass chose to train as a Hunter to preserve what he could of his culture. After leaving Jiroch-Reslia, he became the personal bodyguard for Black Sun Vigo, Sprax."}, {"tag": "p", "text": "Another shturlan level Hunter was Rathe Palror, a member of the mercenaries known as Churhee's Riflemen. Palror was a sharpshooter, and one of the few survivors of the assault on Y'Trella, where inadequate Imperial backup led to the decimation of the Riflemen. As a result, he rejected his former pro-Imperial stance, and he later teamed up with Rebel Riij Winward in his escape to the planet Tatooine. Other Tunroth also took anti-Imperial stances, working for various outfits such as the privateer ship Far Orbit."}, {"tag": "p", "text": "Xarcce Huwla was a female Tunroth who took more direct action against the Empire. She joined the Rebel Alliance as a fighter pilot. Excelling in an X-wing fighter, Alliance High Command transferred her to the elite Rogue Squadron. However, she immediately requested a transfer, uninterested in the squadron's reputation for suicide missions. Commander Wedge Antilles delayed processing her request for a number of missions, during which she bonded with the squadron members and eventually withdrew her transfer request and fought in many important battles to become a famous member of the squadron."}, {"tag": "p", "text": "A number of Tunroth were Force-sensitive, and some trained as Jedi Knights. Others chose instead to became Force Adepts who adopted their traditional klirun bows into Force weapons. Despite fervent denial by the Tunroth, many rumors persisted of a Jedi artifact—such as a museum, tomb or temple—hidden in the Jiroch system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tunroth were first mentioned in Alliance Intelligence Reports, a book published in 1995 by West End Games, as the species for a minor character. They were first given a backstory by Craig Robert Carey in Galaxy Guide 12: Aliens — Enemies and Allies, published later the same year. The species continued to make appearances in West End Games products, both as background aliens and other identified individuals, including Rathe Palror, the first Tunroth to make an in-universe appearance."}, {"tag": "p", "text": "The Tunroth also made the leap to comic appearances with Xarcce Huwla appearing as a member of Rogue Squadron in the comic series by Michael A. Stackpole. While all other sources use \"Tunroth\" as both the singular and the plural for the species, in one line of dialog in Star Wars: X-Wing Rogue Squadron: In the Empire's Service, Huwla referred to her species as Tunroths. This article has used the original \"Tunroth\" for the plural. The Tunroth have subsequently made minor appearances in other in- and out-of-universe publications."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}