{"url": "Tunnatutikan", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Cities on Kashyyyk"], "nodes": [{"tag": "h1", "text": "Tunnatutikan"}, {"tag": "p", "text": "Tunnatutikan was a riverside city on Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Tunnatutikan was a city on the Wookiee homeworld of Kashyyyk. The city was bordered by a river to the south and was hemmed in by forests on the other sides. In the time after the Battle of Endor, the city was near three Imperial Remnant jammers, one of which was located inside a large Imperial installation. An Imperial supply depot was located to the south, and a Trandoshan slaver camp was located further north up the river. The city itself featured a Command center, Prefab Shelters, and military buildings such as a shipyard. A damaged Heavy Weapons Factory was located in Tunnatutikan."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4 ABY, after escaping the city of Okikuti and the Wookiee Weebacca's trap, New Republic members Han Solo and Chewbacca, the latter of whom was a Wookiee himself, reached Tunnatutikan and met with Shoran, Chewbacca's cousin and leader of Shoran's Defenders. From there, they repaired the Heavy Weapons Factory and recruited a Wookiee army to destroy the three Imperial jammers in Chenachochan in order to communicate with the New Republic about the situation on Kashyyyk."}, {"tag": "p", "text": "Chewbacca and Solo infiltrated the supply depot and acquired the walkers stored there, as well as destroyed the Trandoshan slaver camp to free the captured Heavy Cruisers. With those forces, supplemented by additional Wookiee soldiers and Heavy Weapons constructed at the factory, the Wookiee army led by Solo, Chewbacca, and Shoran knocked out the three jammers and sent out a distress signal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tunnatutikan was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds. It appeared and received its name during a Chewbacca campaign mission. The mission and thus the city was also included in the game's 2002 expansion pack, Clone Campaigns. The size of the army is the player's choice, and freeing the captured units is an optional objective. This article assumes the player did so."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}