{"url": "Turazza", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Oviparous species", "Category:Reptilian sentient species", "Category:Turazza"], "nodes": [{"tag": "h1", "text": "Turazza"}, {"tag": "p", "text": "The Turazza were sentient, short, mottled reptiles that hatched from eggs. They were able to run faster than a Human and had comparable strength, but they sometimes had trouble trying to use items designed for taller beings. Turazzas were seen on several planets during the years of the Galactic Civil War, although they rarely spoke any language but their own. Turazzas were often considered to be unsuitable for certain kinds of job, and were sometimes seen as little more than pets. The Turazza sisters Nizzal, Rizzal and Vizzal acted as assistants to the Twi'lek trader Loh'khar, although their abilities were frequently underestimated by his clients. Similarly, while the Turazza known only as Redeye—because of the color of his eye patch—was in charge of the security at the clandestine pub Exovar's Emporium on the planet Neftali, many of Luskin Exovar's acquaintances and customers were surprised by that fact."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Turazza were sentient reptiles covered with mottled red or green scales. Anthropomorphic in general shape, a Turazza reached a height of 75 centimeters, reaching only the waist of an adult Human. However, they could scamper much faster than a Human could run and skitter through the legs of Human-sized individuals, dodging obstacles such as tables that would slow larger beings. At the same time, the small lizard-like beings had difficulty handling technology that had been designed with Human-sized users in mind, such as swoops, with their nailless, three-fingered hands. One individual Turazza was strong enough to carry a big box of turbolaser power capacitators."}, {"tag": "p", "text": "The hairless head of a Turazza was dominated by one big snout-like beak that they could use to peck, meep twitter, snuffle up, titter or gobble. A Turazza could contort the beak to create facial expressions such as a smile. The beak had three upper incisors—two of which protruded even when the beak was closed—and also hosted a non-forked, green tongue that darted out when the Turazza laughed. A newly-hatched Turazza had a short neck and dark eyes, but as they aged, the eyes turned green, with neither pupil or iris to be seen."}, {"tag": "p", "text": "The Turazza had two sexes, male and female. A Turazza egg was fist-sized and gray-green speckled. Three Turazza eggs were considered to have little monetary worth; Galliwig, owner of Galliwig's Cantina, estimated that twenty-five credits was a generous valuation. When hatching, the baby Turazza made the egg stir and shift, and then the baby pecked its way out, carefully breaking the upper part of the egg with the beak and then pushing the pieces of the shell until it could poke out its head. After this, the baby bonded with the first mobile individual it could see, with some people believing that the bond could be empathic or even telepathic. Three sisters born from different eggs were similar in appearance, although not physically identical."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Turazzas were sentient creatures with individual needs and goals. That was true even when talking about three sisters bonded to the same person; they followed the leader and obeyed his whims, but each of the Turazza had her own skills and her own goals, sometimes in opposition to those of her siblings. Nonetheless, Turazza sisters working together were close and, should one of them desert the group, the others spent a mourning period of several days keening loudly, going without sleep or food, and snuggling up with each other."}, {"tag": "p", "text": "The Turazza language included short squeaks, heeps and meeps that sounded savage to members of other species. Rarely was a non-Turazza fluent in that language, nor was every Turazza fluent in Galactic Basic Standard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of 2 BBY, the Turazza had already joined the galactic community, having a presence on several planets. Their combat prowess was not valued: during the Galactic Civil War, the possibility of a Turazza being security chief of an underground locale with a high criminal presence was a surprise to many individuals. As of 8 ABY, Turazza were perceived more as pets than as sentient beings, even by operatives of the New Republic."}, {"tag": "h2", "text": "Turazza in the galaxy"}, {"tag": "p", "text": "The Twi'lek free-trader Loh'khar \"the Finder\" acquired three Turazza eggs as payment for work. He decided to keep the eggs and raised the three Turazza sisters, Nizzal, Rizzal and Vizzal, as his minions to run errands for him. As of 2 BBY, Loh'khar and his Turazza were active on Kelada, a planet in the Colonies, working for both the Galactic Empire and the Alliance to Restore the Republic. That same year, a hunchbacked Turazza was seen in the Black Dust Tavern in Soco-Jarel Spaceport on the planet Socorro. That Turazza was in the locale when the Sluissi Secles Uslopos and his Gamorrean underlings entered to try to recruit another patron, Drake Paulsen. Also during the Galactic Civil War, a green-skinned Turazza known as Redeye—due to the red eye patch over his right eye—served the Human Luskin Exovar both as a partner during Exovar's days as a scout and then as the security chief of Exovar's Emporium, a secret, underground hotel-restaurant on the planet Neftali. Such employment was a surprise to many who underestimated Redeye because he was a Turazza."}, {"tag": "p", "text": "In 8 ABY, Loh'khar and his trio of Turazza sisters joined the crew of the CEC CR90 corvette FarStar under her Human Captain, Keleman Ciro of the New Republic. The FarStar was engaged in a mission to chase fugitive Human warlord Moff Kentor Sarne through the unexplored Kathol sector, and at the same time create contacts for the New Republic in the area—as well as finding information about the DarkStryder technology used by Sarne. Loh'khar and the ship's Rodian security chief, Gorak Khzam, wanted to find the source of Sarne's strange artifacts and sell them on the black market, but they chose to remain in the FarStar as long they could profit from it. The Turazza sisters supported Loh'khar's plan to desert the starship at the opportune moment, and they wanted to take part in it. The Turazzas helped in surveillance tasks whenever the crew went to a planet's surface, enjoying that task. They also helped Loh'khar maintain secret communication channels with external allies, with Loh'khar's personal goals being their priority."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Turazza first appeared in a 1994 illustration by Mike Vilardi published in Star Wars Adventure Journal 2 to accompany Patricia A. Jackson's short story \"Out of the Cradle.\" The species was named and expanded in 1995's The DarkStryder Campaign, written by Peter M. Schweighofer for West End Games's Star Wars: The Roleplaying Game. The boxed campaign included new illustrations of Turazza by Vilardi. Author Paul Danner later included the Turazza \"Redeye\" in his book Wretched Hives of Scum & Villainy, also for West End Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}