{"url": "Turbolaser", "categories": ["Category:Canon articles", "Category:Articles needing additional sources", "Category:Weapon stubs", "Category:Emplacement weaponry", "Category:Starship weaponry", "Category:Turbolasers"], "nodes": [{"tag": "h1", "text": "Turbolaser"}, {"tag": "p", "text": "A turbolaser was a powerful variant of the laser cannon turret usually installed aboard capital ships as well as space stations. While their firepower made them very capable against other capital ships, turbolasers were less effective against smaller and nimble starfighters."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "During the latter days of the Clone Wars, some turbolaser batteries, such as those installed aboard the Providence-class Dreadnought Invisible Hand, had a maximum power output that was the equivalent of a Magnitude 10 earthquake. Likewise, the primary turbolaser cannons on a Munificent-class star frigate had sufficient firepower to melt an ice moon 1,000 kilometers in diameter, or pierce through the shields of a 10-kilometer-wide battle station."}, {"tag": "p", "text": "Turbolaser bolts dissipated their energy at a fast rate the further they traveled, and therefore Turbolasers only have limited range of effectiveness, even in the vacuum of space. The turbolaser armaments of the Imperial I-class Star Destroyer Chimaera had a combat range of less than 1,200 kilometers, and after said distance, they would be unable to penetrate any type of sufficient armoring. Likewise, the Star Dreadnought Supremacy's heavy turbolasers were unable to cause notable damage to the shields of the Star Cruiser Raddus from a significant distance, despite their continuous barrage."}, {"tag": "p", "text": "A turbolaser's effectiveness was further weakened drastically as the bolt moved through layers of a planet's atmosphere, making them largely ineffective even against unshielded targets. However, this could be ameliorated by moving the ship deeper into the planet's stratosphere."}, {"tag": "p", "text": "Thorilide, mined from the Inner Rim moon Cynda, was a vital resource in the manufacturing of the shock absorbers of a turbolaser."}, {"tag": "p", "text": "By the time of the First Order/Resistance War, kyber focusing crystals were installed in the turbolasers used by the First Order to increase their firepower and improve their recharge rate."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "Variants of the turbolaser existed, such as the quad turbolaser cannon, the octuple turbolaser barbette, the light turbolaser, the medium turbolaser, and the heavy turbolaser."}, {"tag": "p", "text": "Turbolasers were the primary armament on various capital ships, most notably Star Destroyers such as the Venator-class Star Destroyer, the Imperial I-class Star Destroyer, and the Resurgent-class Star Destroyer."}, {"tag": "p", "text": "Other types of ships that were equipped with turbolasers included cruisers such as the MC80 Liberty Type Heavy Star Cruisers and the Arquitens-class light cruiser, frigates such as the EF76 Nebulon-B escort frigate and the MC30C Frigate, as well as corvettes such as the CR90 corvette and the Raider I-class corvette."}, {"tag": "p", "text": "Turbolasers could also be found on space stations such as the DS-1 Death Star Mobile Battle Station, the Golan I Space Defense Platform, and the Golan M3185."}, {"tag": "h2", "text": "Examples"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}