{"url": "Turk_Brand", "categories": ["Category:Legends articles", "Category:Galactic Alliance Defense Fleet officers", "Category:Humans", "Category:Males", "Category:New Republic Defense Fleet officers"], "nodes": [{"tag": "h1", "text": "Turk Brand"}, {"tag": "p", "text": "Turk Brand was a Human male Combined Defense Forces of the New Republic officer."}, {"tag": "p", "text": "Brand had a habit of following hunches that would save him, his ship, or his personnel. This tendency won him many commendations and the rank of commodore, but also branded him with an erraticness that would deny him further promotion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An inaugural officer of the New Republic Fifth Battle Group, Commodore Brand served under General Etahn A'baht during the Black Fleet Crisis. He was captain of the cruiser Indomitable, and commanded the eighteen ships of Task Force Aster at Doornik-319. Later, he led the three-ship patrol group which won the New Republic victory in the Battle of ILC-905."}, {"tag": "p", "text": "Eight years later, Brand was a member of the Defense Force command staff during the Yuuzhan Vong War. Unlike other members of the command staff, Brand actually advocated withdrawing fleets to the Core Worlds, to protect the vital shipyards there. This brought him into conflict with A'baht. Later, Brand brought together with a unit of Defense Force leaders to guide the New Republic's military response to the Yuuzhan Vong. Brand was chosen to convince Senator Viqi Shesh's influential voice to support the reactivation of Centerpoint Station for use against the Yuuzhan Vong. He led the combined New Republic and Hapan counterstrike in the Battle of Fondor from the cruiser Yald. Brand barely escaped a court-martial, and remained a member of the Galactic Alliance command staff. He protested Borsk Fey'lya's dismissal of Sien Sovv during the Battle of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brand is given the rank of commodore in both The Black Fleet Crisis trilogy and The New Jedi Order novels, but in the former books, he is merely a cruiser captain and (perhaps temporarily) a squadron commander, while in the NJO he seems to be one of the New Republic Defense Force's senior commanders and strategists. It is possible that, even though his title remains the same, he actually holds quite different ranks on these two occasions: although no direct explanation is provided in this instance, \"commodore\" is used elsewhere in Star Wars canon to indicate not only officers ranking between captain and Rear Admiral, but also more senior commanders such as Imperial Systems Admirals."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}