{"url": "Battle_of_the_Eva-T_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Battle of the Eva-T system"}, {"tag": "p", "text": "The battle of the Eva-T system was a two-stage conflict fought between the Galactic Empire, Nami pirates and the Rebel Alliance after discovering that the Nami had operational TIE Defenders."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After stealing one of the Empire's TIE Defender prototypes from the Imperials and, with the help of rogue Grand Admiral Zaarin, abducting the Chief Scientist of the TIE Defender project, the Nami leader and crime lord Ali Tarrak gained the ability to manufacture and produce her own TIE Defenders. After giving a demonstration on an Imperial Cargo area, with a Rebel cruiser as a observer, it became apparent that she intended to profit from this by selling TIE Defenders to various parties, the Rebel Alliance in particular."}, {"tag": "p", "text": "Admiral Thrawn was tasked to counter this threat and had begun his own starfighter ever since the Rneekii had originally kidnapped the Chief Scientist. Now with the discovery of a Nami Strike cruiser planning to rendezvous with the Rebels to arrange purchase of eight TIE Defenders. Thrawn decided to let the Empire's best Imperial Ace Maarek Stele test his new project, the Missile Boat, on its first official combat mission."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "First stage"}, {"tag": "p", "text": "Two Missile Boats escorted by Assault Gunboats arrived at the rendezvous site and started engaging the Nami T-wings, Gorgg Squadron. The Strike cruiser Nuance launched more T-wings one squadron at a time, while launching three stormtrooper transports Miner to deploy mines around the ship. As the T-wings were taking heavy losses, Rebel Carrack-class light cruiser Prism arrived."}, {"tag": "p", "text": "Stele managed to finish off the remaining T-wings and destroyed all three transports deploying mines. He then helped the Assault Gunboats disable the Nuance. Not long afterwards, the Imperial-class Star Destroyer Grey Wolf arrived to deliver an Assault transport to board and capture the Nuance, recovering eight TIE Defenders, and with the help of the gunboats destroyed the Prism before it could retreat into hyperspace. Stele's sensors picked up a probe called Yey nearby and destroyed it. Thrawn would later learn of Tarrak's manufacturing factory where she was building more TIE Defenders. But first he decided to make a stand, knowing that the Rebels wouldn't give up the TIE Defenders without a fight."}, {"tag": "h3", "text": "Second stage"}, {"tag": "p", "text": "As predicted, the Alliance sent three Carrack cruisers Kingdom to attack the Grey Wolf. Stele launched from the hanger in a Missile Boat to engage the X-wings that were attacking the Grey Wolf, followed by engaging the A-wings as they were finishing off the TIE fighters, Stele then had to fend off two Y-wing squadrons that were also making torpedo runs against the Grey Wolf. The Carrack cruisers finally launched Z-95 Headhunters, which Maarek Stele also dealt with. He then began launching space bombs at the cruisers. During the run, escort shuttle Black Box launched from one of the cruisers, carrying Rebel Commanders. Stele inspected and then destroyed the shuttle before it could escape. The cruisers were all destroyed shortly afterwards."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The loss of three Carrack cruisers and Commanders was a significant blow to the Rebellion. It also demonstrated the power of the Missile Boat. With the Rebels' defeat, Thrawn set his sights on Tarrak's TIE Defender factory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in the 1994 PC Game Star Wars: TIE Fighter. This is from Battle 10, missions 4 and 5. This article assumes completion of all \"Primary,\" \"Secondary\" and \"Bonus\" objectives."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}