{"url": "Battle_of_the_Emperor%27s_Plague_Storehouse", "categories": ["Category:Legends articles", "Category:Battles in the Deep Core", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of the Emperor's Plague Storehouse"}, {"tag": "p", "text": "The Battle of the Emperor's Plague Storehouse was a battle between the New Republic and the fanatical anti-Human Diversity Alliance, which sought to exterminate all Humans for the crimes of the Humanocentric Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Prior to the battle, Raynar Thul's father Bornan Thul, a wealthy shipping merchant had come into possession of a navicomputer. He was supposed to deliver it to the Diversity Alliance leader Nolaa Tarkona at a trade conference. However, he discovered what was in the navicomputer: the location of an Imperial plague warehouse which contained a Human-specific plague known as the Emperor's Plague. In retaliation for the Galactic Empire's humanocentric policies and Ysanne Isard's devastating non-human specific Krytos virus which had devastating impact on Coruscant's alien population following the New Republic liberation in 5 ABY, Nolaa Tarkona had planned to use the Emperor's Plague in a genocidal anti-Human campaign."}, {"tag": "p", "text": "Horrified and fearful for his safety, he went into hiding. Tarkona then hired bounty hunters to find him, including Ailyn Vel, disguised as her father Boba Fett. Bornan eluded captured for months, at last visiting the plague warehouse with the intent to destroy it. Unfortunately, he did not have enough resources and was forced to leave. On the way back, he was ambushed by bounty hunters, and his ship was damaged."}, {"tag": "p", "text": "After being rescued by Zekk's Lightning Rod, Bornan revealed that Ailyn Vel had sliced into his ship's navicomputer and gotten a hold of the coordinates of the plague warehouse. After recording an encrypted message to his wife explaining their plan, Bornan, Raynar, Zekk, Jacen and Jaina Solo, Tenel Ka, Em Teedee, and Lowbacca gathered up some explosives and went to the warehouse with the intent to destroy it."}, {"tag": "h3", "text": "The battle"}, {"tag": "p", "text": "They were almost finished wiring when Diversity Alliance ships showed up. In the ensuing confrontation with Tarkona in the warehouse, some of the plague canisters were busted open, including the Human killing one. Bornan sacrificed himself so the plague would not spread, and told Raynar to get himself and his friends off the asteroid. Also, during the battle, Lowbacca fought the Trandoshan Corrsk and killed him."}, {"tag": "p", "text": "Meanwhile in space, a New Republic fleet under the command of Han Solo arrived and engaged the Diversity Alliance ships. The New Republic fleet defeated the Diversity Alliance fleet commanded by the Wookiee Raabakyysh. They then proceeded to destroy the plague storehouse, thus wiping out the biological weapons cache. The Jedi and the New Republic had scored a major victory and the Diversity Alliance was defeated as a result. Nolaa Tarkona escaped though, and she later died on a remote asteroid from a Twi'lek specific virus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}