{"url": "Turk_Falso/Legends", "categories": ["Category:Legends articles", "Category:Males", "Category:Members of the Ohnaka Gang", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Turk Falso"}, {"tag": "p", "text": "Turk Falso was a male Weequay member of a pirate gang led by Hondo Ohnaka."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Capture of Dooku"}, {"tag": "p", "text": "Ohnaka's gang found Count Dooku on Vanqor, after he escaped from a battle between him and two Jedi, Obi-Wan Kenobi and Anakin Skywalker. Ohnaka offered Dooku passage to Florrum, a planet six parsecs away. When Dooku arrived on Florrum, he was captured by the pirates. Ohnaka contacted the Republic and demanded the Republic to pay 1,000,000 credits in spice in exchange for the captured Count. Jedi Knights Kenobi and Skywalker were tasked to go to Florrum and confirm if the pirates did indeed capture Dooku. Upon their arrival, Falso scanned them with a portable scanner for any hidden weapons and lead them to his leader. They met Ohnaka and saw Dooku locked up in a containment field in his cell. Kenobi contacted Chancellor Palpatine to confirm the capture of Dooku. Palpatine sent Senator Kharrus and Representative Jar Jar Binks on a ransom mission. Later Falso invited Kenobi and Skywalker to join them in a Weequay banquet."}, {"tag": "h3", "text": "Deception and death"}, {"tag": "p", "text": "Falso tried to double cross his captain, Hondo Ohnaka, the leader of a pirate gang on the backwater world of Florrum to steal the spice ransom for himself. He ordered a fellow pirate, Barb Mentir to shoot down the ship carrying the spice in order to get it. His plan worked, partially, but the clone troopers and Jar Jar Binks survived the crash, killing only the pilots and Kharrus. After he heard that there were possible survivors from Mentir, he went to get the spice himself along with some other pirates utilizing swoop bikes. Falso stole the spice from the wreckage of the ship located in the Doshar fields, but the surviving clones and Jar Jar got it back after chasing Falso and his gang by riding on skalders, creatures native to Florrum."}, {"tag": "p", "text": "After returning to the pirate base, Falso said to Ohnaka that the Republic hadn't send the spice, but an army. He asked if he could send tanks to destroy the army. Ohnaka gave him permission, but Falso's plan failed. One of the tanks was accidentally destroyed by Jar Jar who rammed it into one of the power lines to the pirate outpost. The remaining two tanks were attacked by Commander Stone and the clone troopers and both tanks were captured. They used them to quickly go to Ohnaka's pirate base and get in unnoticed. Falso was about to flee in a Flarestar-class attack shuttle knowing that Ohnaka would figure out his betrayal, when he was suddenly choked and lifted into the air by an unseen force. As his accomplice watched, Count Dooku, who escaped from the pirate prison during the power loss in the base, emerged from the shadows and manipulated Falso into shooting the other pirate in the chest before crushing his throat with the Force and killing him. Dooku then escaped Florrum in the Weequay saucer craft which the two pirates were planning to escape in."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Falso was a skilled liar and manipulator who made it as far as Hondo's lieutenant. He gained Ohnaka's trust, which he used to operate on his own inside Ohnaka's gang. Falso thought that Hondo was weak, even saying to Mentir that \"Hondo couldn't kill a nuna\". His lies eventually got him killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Falso was voiced by Greg Ellis in The Clone Wars animated series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}