{"url": "Battle_of_the_Emperor%27s_Citadel", "categories": ["Category:Legends articles", "Category:Battles of Byss", "Category:Battles of Operation Shadow Hand"], "nodes": [{"tag": "h1", "text": "Battle of the Emperor's Citadel"}, {"tag": "p", "text": "The Battle of the Emperor's Citadel, or the Battle of Byss, was a battle between the New Republic and the Dark Empire in 10 ABY at the reborn Emperor Palpatine's throne world of Byss. Following the Empire's truce with the Balmorrans which resulted in the export of the new state-of-the-art X-1 Viper droids, the insurgent New Republic had intercepted the shipment onboard the Star Hauler Reliance. The Rebel commandos then inserted themselves inside the war droids."}, {"tag": "p", "text": "Upon landing on Byss, the X-1 Vipers quickly overpowered their Imperial guards at the spaceport before making their way down through the streets of the Imperial capital. They eliminated all opposition including various walker types and gunships. At the Emperor's Citadel, they took on and wiped out the Emperor's complement of walkers and turbolaser emplacements. However, the tide of the battle change when the clone Emperor Palpatine ordered his two top Dark Side Elite to unleashed monstrous Sithspawn known as Chrysalide Rancors. These monsters took on the X-1 Vipers, tearing them apart and scattering the Rebels. Luckily, the surviving Rebels were rescued by a group of smuggler ships led by Salla Zend. They then escaped into hyperspace, fleeing the battle. In retaliation for the Rebel attack on his citadels and their successful escape, Palpatine ordered the launch of the first projectile against the New Republic base on Pinnacle Moon."}, {"tag": "h2", "text": "Details"}, {"tag": "h3", "text": "Pre-battle"}, {"tag": "p", "text": "After the Battle of Balmorra, Governor Beltane negotiated a truce with the Empire and sent a shipment of the new molecularly-shielded X-1 Viper droids onboard the Imperial Star Hauler Reliance. However, Beltane secretly sympathized with the New Republic and arranged for the Rebels to intercept the shipment en route to Byss. The plan was for the New Republic to use the droids to target the six top Imperial command posts. The plan worked at first and the Rebels intercepted the Reliance and captured the X-1 Viper droids. Rebel commandos were then placed inside the droids. Though the X-1 Vipers were programmed to make their own decisions, Beltane modified them for supervised combat and manual override. The mission was led by Lando Calrissian along with the famous droids C-3PO and R2-D2."}, {"tag": "h3", "text": "The early attack"}, {"tag": "p", "text": "Upon arriving on Byss, the X-1 Vipers sprung into action and attacked the Imperial forces. After crushing resistance from stormtroopers and tanks, the X-1 Vipers made their way to the Emperor's Citadel. In the streets of the capital, the molecular-shielded automatons confronted and destroyed many various walker types, XR-85 tank droids, and DP20 frigates. Next, upon arriving outside the Citadel, they faced resistance from the most advanced turbolasers in use by the Empire. Meanwhile, the reborn Palpatine—who had been touring his new superweapon, the Galaxy Gun—ordered his new Executor, Xecr Nist, and his second in command, Tedryn-Sha, to unleash his alchemically altered Chrysalide Rancors."}, {"tag": "p", "text": "On the ground, the X-1 Vipers confronted the Emperor's contingent of walkers, and easily destroyed them by absorbing enemy fire through the use of their advanced molecular shields and then turning the energy against the Imperial forces. They then began tearing the turbolaser emplacements."}, {"tag": "h3", "text": "The Chrysalides arrive"}, {"tag": "p", "text": "Unfortunately, turbolifts carrying the Chrysalides appeared and then unleashed their deadly cargo on the Rebels. The Chrysalides proved a match for the X-1 Vipers and quickly reduced the once deadly force to little more than scrap metal. Several of the New Republic commandos were killed by blaster fire or the sharp jaws of these monstrous beasts. However, some of the Rebel occupants, including Lando, Wedge and the droids, managed to escape. With the surviving Rebels concentrated around the Imperial citadel, the Imperial authorities sealed all roads to the Citadel under orders of the Emperor to allow the Chrysalides to feast on the remaining Rebels and the wreckage of the Vipers."}, {"tag": "h3", "text": "Smugglers to the rescue"}, {"tag": "p", "text": "Meanwhile, at the cantina Byss Bistro, Salla Zend—who had transported the Rebels to Byss—and several other smugglers and freighter crews decided to help their Rebel allies. Unfortunately, they encountered an Imperial roadblock at the cargo terminal. However, as they fought the Imperial troops, three freighters—Starhook Ten, Bespin Bandit and Hyperspace Marauder—raced to the Emperor's Citadel. These vessels were armed with illegal weapons and modified shields. Upon arriving, they rescued the surviving Rebels and fought the Chrysalides. A well aimed ion burst from Bespin Bandit and Starhook Ten destroyed a Chrysalide. However, one of the Sithspawn managed to grab Starhook Ten, though R2-D2 confronted it and sent the monster crashing down on the main citadel defense turbolaser. The three freighters bypassed the Galaxy Gun. However, the Emperor allowed them to escape into hyperspace."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "In retaliation for the Rebel attack on his citadels and the escape of the surviving Rebels into hyperspace along with a group of smugglers, Palpatine ordered the launch of the first projectile against the New Republic base on Pinnacle Moon. Within hours, Pinnacle Moon had been wiped off the face of the galaxy. However, due to the presence of spies in Byss itself, the New Republic forces along with some of the native Ixlls managed to escape the doomed moon in a fleet of transports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of the Emperor's Citadel first appeared in the issue Dark Empire II 4 of the Star Wars: Dark Empire II series of comics. The battle was conceived and written by authors Tom Veitch, illustrated and colored by colorist Cam Kennedy. Veith used this battle to further develop the role of Wedge Antilles and Lando Calrissian in the story plot, while introducing new elements into the canonical Expanded Universe—the chrysalide rancors and the world-destroying Galaxy Gun."}, {"tag": "p", "text": "The Battle of the Emperor's Citadel would eventually be featured in the Dark Empire II audio drama, which witnessed the skirmish take on a whole new personality through the voice acting of John Cygan (Antilles) and Jim Ward (C-3PO). However, the audio drama version differs from the original comic Dark Empire II in regards to several aspects of the chronology of events in the battle."}, {"tag": "p", "text": "In the audio drama, before being initiated, Nist, together with Tedryn-Sha, leads an inspection of the Reliance that is carrying X-1 Viper droids to Byss. In Dark Empire II, this task is performed by an Imperial officer and two stormtroopers. Also, in the audio drama, Nist plays a much larger role in the ensuing battle on Byss."}, {"tag": "p", "text": "Together with Tedryn-Sha, he commands the defense of the planet from the Citadel and contacts Palpatine—who is still inspecting the Galaxy Gun—to inform him of the Rebel attack. In the comic, both Nist and Sha are still on the shuttle with Palpatine during the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}