{"url": "Turbulent-class_Star_Destroyer", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Star Destroyer classes", "Category:Turbulent-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Turbulent-class Star Destroyer"}, {"tag": "p", "text": "The Turbulent-class Star Destroyer, also known as the Turbulent-class destroyer, was a type of Star Destroyer built by the Imperial Remnant following the Swarm War. Because of its smaller size, it was sometimes referred to as a \"pocket Star Destroyer.\""}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was a smaller and more maneuverable variant of Star Destroyer and was designed with two hangars opening at the stern of the vessel. The ship's bridge was situated in a tower on top of the main superstructure. It had a large holo-display built into its design and there was a day cabin available to the flag-officer near the bridge. An emergency docking bay was located astern of the tower."}, {"tag": "p", "text": "The class had many crisscrossing maintenance tunnels running throughout the upper portion of the vessel. This made maintenance easier and also provided a means of escape in case the ship was boarded. Because of the labyrinthine nature of this design, both boarding parties as well as escapees would have a difficult time navigating inside the vessel, unless informed of the specific escape routes that wound through the interior. Another design focus was an extensive use of bulkheads throughout the interior."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Remnant created the class after the end of the Swarm War, making it out to be a smaller and more agile design than previous Star Destroyers. The Bloodfin was one of these ships and saw action during the Second Battle of Fondor during the Second Galactic Civil War. Gilad Pellaeon liked the design, for it made it easier to familiarize with the crew than on a bigger warship."}, {"tag": "p", "text": "It was the site of an attempted coup of the Imperial Remnant by forces loyal to Colonel Jacen Solo.\nPellaeon was killed onboard the vessel, which was then boarded by Mandalorian Supercommandos and many crewmembers were killed. The vessel and Pellaeon's body were taken into custody by the Maw Irregular Fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}