{"url": "Twelfth_Army", "categories": ["Category:Canon articles", "Category:Imperial Army units", "Category:Sector Armies"], "nodes": [{"tag": "h1", "text": "Twelfth Army"}, {"tag": "p", "text": "The Twelfth Army or simply the 12th, was a Sector Army of the Galactic Republic that was active during the Clone Wars, serving under the Grand Army of the Republic in the northern quadrant of the galaxy. It later served under the Imperial Army of the Galactic Empire, and at least one of its LAAT/i gunships participated in a mission to Murkhana that was undertaken by Dark Lord of the Sith Darth Vader and Moff Wilhuff Tarkin. Its insignia depicted a blue-skinned female Twi'lek carrying a spear."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Twelfth Army, or simply the 12th, was a Sector Army of the Galactic Republic during the Clone Wars. Sector Armies 7th through 12th of the Grand Army of the Republic were assigned to the northern quadrant of the galaxy, and as such, was present on Felucia. As a Sector Army, the 12th consisted of four corps for a total of 147,456 clone troopers. As one of the twenty Sector Armies, the Twelfth Army was assigned a Haven-class medical station, Felucia Medical Station HCTFF2, that was placed on Felucia's orbit."}, {"tag": "p", "text": "The Twelfth Army's insignia was a blue-skinned Twi'lek female that carried a spear within a dark circle with a yellow background. The Twelfth Army utilized LAAT/i gunships adorned with its insignia during the Imperial Era."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Twelfth Army was active during the Clone Wars, which lasted from 22 BBY to 19 BBY, between the Galactic Republic and the Confederacy of Independent Systems. During the war, Felucia's proximity to key hyperspace routes made it an important target for both sides, and as such it became part of the Twelfth Army's campaign for the Republic during the war. Felucia became a battleground in multiple instances throughout the war, including the First Battle of Felucia that involved the Republic's 7th Sky Corps, 104th Battalion, 501st Legion, and the Open Circle Fleet."}, {"tag": "p", "text": "Subsequently, the Republic placed Felucia Medical Station HCTFF2, assigned to the Twelfth Army, in orbit above Felucia, only for it to be destroyed by the Confederacy. The Second Battle of Felucia again involved the 104th and 501st, along with several clone tank divisions. The 327th Star Corps later participated in the Battle of Felucia during the Outer Rim Sieges and subsequent implementation of Order 66 against the Jedi Order."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "The Twelfth Army continued to serve the Galactic Empire, the Republic's successor state, into the Imperial Era. Serving under the Imperial Army, elements of the Twelfth Army took part in a mission to Murkhana under the direction of Dark Lord of the Sith Darth Vader and Moff Wilhuff Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}