{"url": "Twazzi/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Bounty hunters", "Category:Females", "Category:Frenk"], "nodes": [{"tag": "h1", "text": "Twazzi"}, {"tag": "p", "text": "Twazzi was a female Frenk bounty hunter in operation during the Clone Wars, and was considered one of the best of her time."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Twazzi became a skilled bounty hunter sometime prior to the Clone Wars. At one point in her career, her skills earned her praise from Chancellor Valorum. Eventually, her success as a bounty hunter caught the attention of Count Dooku who wanted her to compete with other bounty hunters in the Box, a death machine designed by Moralo Eval, on Serenno to win the honor of kidnapping Supreme Chancellor Palpatine. She witnessed Cad Bane murder another bounty hunter Bulduga to get his hat. Soon, Dooku briefed everyone on the challenge the bounty hunters had to face including telling them about The Box. They were all deprived of their weapons and soon they entered The Box."}, {"tag": "p", "text": "Their first challenge was to escape a room that was filling with dioxis gas. Platforms began to rise from the ground and all the bounty hunters, including Twazzi, climbed up but was almost crushed by the lowering ceiling so she was forced to hang between two platforms. Another bounty hunter, Rako Hardeen who was actually Jedi Master Obi-Wan Kenobi in disguise, found a secret tunnel underneath the ground. All the hunters followed him out of the room into the second challenge, thus surviving the first one."}, {"tag": "p", "text": "In the second round, ledges began to slide out of the walls with a sword resembling a lightsaber swinging around on its front. Bulduga's brother Onca quickly fell prey to the blades. As before, Hardeen saw an open tunnel on the ceiling. Using the ledges, he and Bane hopped to the top towards the tunnel with the other bounty hunters following behind. Bounty hunters Kiera Swan and Sinrich were killed as well but Twazzi got out of the challenge along with the remaining bounty hunters."}, {"tag": "p", "text": "The third challenge involved the whole room being ray shielded and the walls closing in. The switch to deactivate the shields was located in shaft in the wall behind a smaller ray-shield. Eval provided a special serum that, if injected can provide the person temporary immunity to the ray-shields."}, {"tag": "p", "text": "Platforms began to rise out of the center of the ground. Jakoli was instantly electrocuted as well when the floor he stood became ray-shielded. A hunter, Derrown was able to inject the serum due to his anatomy of being immune to such serums. During his attempt to get to the button, Mantu lost his balance and fell to his death. Derrown was eventually able to press the button and the surviving hunters made it to the next and final round."}, {"tag": "p", "text": "They found themselves on a platform with the ground below them doused in flames. This challenge involved sharpshooting. A small yellow target zipped across the wall. Next to the them, a sniper rifle appeared in a small machine. Sixtat took the rifle and aimed at the target. He shot the first two perfectly but missed the third. As a result, the platform he stood on disappeared into the ground and Sixtat fell into the flames which killed him. Hardeen took another rifle that replaced the empty spot on the machine. He shot all three targets easily but Eval gave him five more targets to shoot. Hardeen shot the first four but that was all the ammo the sniper rifle had. Eval scoffed at Hardeen and by pressing some buttons on his wrist, caused the platform beneath Hardeen to drop. However, Bane saved him, taunting Eval to kill Hardeen like a man to which Dooku agreed. Eval soon dropped to the floor and Twazzi and the other hunters witnessed the two brawl, in which Hardeen won. Dooku then congratulated the survivors and announced Bane to be the leader of the group to kidnap Palpatine."}, {"tag": "p", "text": "During the Festival of Light, the bounty hunters launched their kidnapping plot. Twazzi and Embo were the ones to be disguised as Senate Guards, in order to escort Palpatine. Bane handed out a special mapping device to lead them to the meeting point, and a holographic disguise matrix, which gave Embo and Twazzi the appearance of Senate Commandos. After Derrown deactivated the shield generator which protected the Chancellor on the festival, the explosion rendered Palpatine unconscious. At that time, the real Palpatine was concealed under the image of a Senate Commando with the help of the disguise matrix, while Twazzi turned into Palpatine. However, Anakin and Windu managed to stop them from fleeing, and Twazzi and Embo were transformed back. Then Twazzi started throwing punches at Anakin. On the third punch, Anakin used his lightsaber to cut off her right arm. She and Embo were then both arrested, while Bane and Eval escaped with the 'real' Palpatine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Twazzi was an extremely limber and agile being which served her well in her chosen profession. Her skills once earned her praise from Chancellor Valorum."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Twazzi was created for the Star Wars: The Clone Wars TV series, who appeared in the episode \"The Box\", in which she was voiced by Catherine Taber, who also voiced Padmé Amidala for the series. Twazzi was a re-do of the Frenk bounty hunter Rumi Paramita."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}