{"url": "Tuzes-Adaz", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chiefs", "Category:Females", "Category:Nelvaanians"], "nodes": [{"tag": "h1", "text": "Tuzes-Adaz"}, {"tag": "p", "text": "Tuzes-Adaz was a Nelvaanian female who was the mother of multiple sons and who served as the chieftain of the village Rokrul on the Outer Rim planet Nelvaan during the Clone Wars. Sometime during the war, the Techno Union established a facility on Nelvaan that drained the planet of geothermal energy."}, {"tag": "p", "text": "The resulting environmental shift alarmed Tuzes-Adaz and her fellow Nelvaanians, who blamed the change on an illness plaguing the Great Mother deity. In the year 19 BBY, the chieftain discovered the Jedi Obi-Wan Kenobi and Anakin Skywalker and brought them back to Rokrul to meet the shaman Orvos, who had prophesied of an off-worlder who would save their planet. Tuzes-Adaz's choice proved wise, as Skywalker went on to defeat the Techno Union and destroy the facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tuzes-Adaz was a Nelvaanian female who had multiple sons and served as the chieftain of the Rokrul village on the Outer Rim planet Nelvaan during the final years of the Galactic Republic. At some point during the Clone Wars, the Separatist-aligned Techno Union established a facility on Nelvaan that siphoned the planet's geothermal energy. The chieftain and her warriors interpreted the environmental changes as an illness befalling the Great Mother, a religious deity that the villagers honored. The village's warriors went off in search of the cause of the drastic shift in climate, but none came home, all having been captured and mutated by the Techno Union."}, {"tag": "p", "text": "Near the end of the Clone Wars, in the year 19 BBY, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker landed on Nelvaan in search of General Grievous, leader of the Separatist Droid Army. Tuzes-Adaz discovered the Jedi after they interrupted her eldest son's initiation ritual by killing the reptilian horax the young boy had been hunting. Remembering a prophecy passed down from the village shaman, Orvos, claiming that an off-worlder would come to Nelvaan and restore the Great Mother to health, she refrained from killing the Jedi and decided to bring them back to Rockrul to meet with Orvos instead."}, {"tag": "p", "text": "Tuzes-Adaz's decision ultimately saved her people from the Techno Union, as Skywalker went on to destroy the Separatist facility and put Nelvaan back on the path to normalcy. He then reunited the women and children of Rokrul with their male warrior counterparts, though the chieftain was initially hesitant to welcome them back due to their mutated appearance. However, upon seeing a child approach the mutated warriors without fear, Tuzes-Adaz and the other females had a change of heart."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As chieftain, Tuzes-Adaz showed wisdom and restraint when faced with the choice of killing Obi-Wan Kenobi and Anakin Skywalker or bringing them to Orvos, choosing the latter after remembering the shaman's prophecy. Upon seeing the mutated Rokrul warriors return home, Tuzes-Adaz was hesitant to approach them. However, after a young child showed no discrimination and approached the mutated men without fear, the chieftain, along with all the other women, quickly changed their attitude from one of shock to one of joy. Similar to her fellow villagers, Tuzes-Adaz had blue skin, black hair, and black eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tuzes-Adaz donned a long, brown sleeveless robe with red, white, and black trim along the cuffs and collar. She also wore a large tribal shield mask of the same colors with the design of a face drawn on the front. She carried a staff with the head of a birdlike creature on the top. She also wore bands around her wrists and neck."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tuzes-Adaz made her first appearance in Chapter 22 of the animated Star Wars: Clone Wars microseries, which aired on March 22, 2005 on Cartoon Network. The character was given the name \"Tuzes-Adaz\" for the first time in her entry in The Complete Star Wars Encyclopedia, published in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}