{"url": "Tutso_Mara/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Tutso Mara"}, {"tag": "p", "text": "Tutso Mara was a male Jedi Knight who, at the time of the Clone Wars, worked in service to the Jedi Order and the Galactic Republic. During his studies as a Jedi, Mara became friends with fellow student Barriss Offee, whom he aided in lightsaber combat training. In 19.1 BBY, after being elevated to Jedi Knighthood, Mara perished with other Jedi and Republic clone troopers in a bombing of the Jedi Temple's hangar, which Offee engineered in protest of the Jedi Order's increasingly militant role in leading the Grand Army of the Republic into warfare. Mara and the five other Jedi victims were memorialized in a ceremony at the Temple, which Grand Master Yoda oversaw, and their bodies were then laid to rest."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male individual, Tutso Mara lived during the final decades of the Galactic Republic. Being sensitive to the Force, he was inducted into the Jedi Order. During the course of his training as a Jedi, Mara befriended another trainee, Barriss Offee. He helped her in learning lightsaber combat, specifically with the correct hand grip for her lightsaber, and further assisted her in honing her combat techniques as time went on."}, {"tag": "p", "text": "In 22 BBY, the Clone Wars erupted, with the Jedi Order becoming the leaders of the newly created Grand Army of the Republic, as part of the Republic's pan-galactic war effort against the Confederacy of Independent Systems. Mara eventually attained the rank of Jedi Knight by 20 BBY, the third year of the Clone Wars. His friend Offee similarly approached a promotion to Knighthood around the same time."}, {"tag": "p", "text": "In 19.1 BBY, the final month of that year, Mara was at the Jedi Temple on the galactic capital of Coruscant. He and five other Jedi Knights were in the Temple hangar when it was targeted for a terrorist bombing. The engineer of the plot was Offee, who had grown disgusted with the way the Jedi High Council had led the Order into heightened militancy. A series of volatile nano-droids executed the bombing, claiming the lives of Mara, his Jedi colleagues, and a number of Republic clone troopers who were present in the hangar, and sowing further injuries to many civilian workers."}, {"tag": "p", "text": "While the Jedi Order and the Republic Military launched investigations into the attack, the Order held a memorial service for Mara and the other Jedi who had lost their lives in the blast. Jedi Grand Master Yoda eulogized Mara and his fallen comrades before the mourners who had gathered at the Temple, including Offee and other Jedi as well as prominent Republic politicians and military officers. Mara's body and those of the other victims were then laid to rest in the Temple. Although Offee tried to frame fellow Jedi Ahsoka Tano for the bombing of the Temple Hangar, Jedi Knight Anakin Skywalker exposed Offee's exploits, and she was arrested and taken into Republic custody."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tutso Mara was close with Barriss Offee, their friendship stemming from their mutual time in lightsaber training. Mara took the effort to further help Offee sharpen her combat skills, of which she remained appreciative even after she became a Jedi Knight. Despite Offee's role in the bombing that took his life, Mara's death greatly distressed her."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Being sensitive to the Force, Mara trained as a Jedi. His proficiency was such that he was elevated to the rank of Jedi Knight."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tutso Mara was first mentioned—as one of the unnamed Jedi Knights killed in the bombing of the Jedi Temple—in the preview version of StarWars.com's online guide for \"The Jedi Who Knew Too Much,\" an episode of the Star Wars: The Clone Wars television series' fifth season. The episode, which aired on February 16, 2013, identified Mara's character by name and also depicted his draped body in the memorial service at the Jedi Temple. The character has since been referenced in author Jason Fry's Star Wars: The Clone Wars: Episode Guide (June 2013)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}