{"url": "Tutaminis", "categories": ["Category:Legends articles", "Category:Control powers", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Tutaminis"}, {"tag": "p", "text": "Tutaminis was an umbrella title used by the Jedi Order to classify Force abilities related to energy absorption. Designated as one in a family of Control abilities, tutaminis techniques were taught to Jedi Initiates within the Jedi academy throughout the history of the Order. While taught to all Jedi during the days of the Galactic Republic, it was a rare feat to be capable of dissipating concentrated energy such as what makes up a blasterbolt or lightsaber blade. While it was named and practiced by the Jedi Order, tutaminis was not restricted to use by Jedi. In fact, most Force-based groups and Force-users in general learned to use or at least control some of the abilities taught at the Temple."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The skills associated with tutaminis all related to the idea that, through the Force, Force users could draw potentially harmful heat or electrical energy into their bodies and diffuse it or channel it away completely. Viewed as a starting point for further study in the Force, the Council of First Knowledge designated the study of tutaminis to be taught during the very first classes at Jedi academies. While the basics were expected to be mastered upon graduation from the academy, development of these skills would come over an entire life time, for a Jedi was never done learning. In addition to deflecting energy weapons, this ability could eliminate the harmful effects of other energy-based Force powers such as Force lightning. With additional effort, after absorbing a blaster bolt or Force power, the user could utilize the absorbed energy to heal his or her wounds or manifest other Force powers. Tutaminis was also described as a \"non-harmful Force drain.\""}, {"tag": "h2", "text": "Accompanying skills"}, {"tag": "p", "text": "As the basis of many abilities, tutaminis included many skills that were given proper or common names within the Jedi Order. Other abilities stem from this skill but were more personalized and not taught throughout the entire academy, if at all. Many skills, such as a simple body shielding or as advanced as catching and/or dispelling a lightsaber blade with one's bare hand, were all considered applications of tutaminis."}, {"tag": "p", "text": "Mastery in self-protection would include the capability to encase oneself in an energy field that could drain heat and electrical energy from incoming attacks. This ability would make the bearer invulnerable to kinectic and a wide range of energy-based attacks until the user discontinued its use, or it wore off when the user became fatigued. With this skill, it was possible to deflect blaster bolts with one's bare hands, though mastery of this skill was very difficult."}, {"tag": "h2", "text": "Notable uses throughout history"}, {"tag": "p", "text": "While practiced by all Jedi during the Old Republic and essentially all Force-based cults to some extent, there were many individuals that excelled in this particular skill and are worthy of note. A member of the Jedi Order, not unlike many of his family members, Jedi Master Nejaa Halcyon developed this skill so as to make up for his lack of telekinetic abilities. A virtuoso with the Force, Halcyon showed great talent in using tutaminis to absorb, redirect, and utilize heat and electrical energy discharges, often converting the energy he absorbed to utilize telekinetic powers that were usually beyond his talents. Darth Plagueis also used this power while on board the Woebegone. He was able to absorb the crew's blaster bolts in one hand and transferred the energy across his chest into Force lightning emerging from the other hand."}, {"tag": "p", "text": "Nejaa Halcyon's abilities in this power were such that he was able to catch lightsaber blades with his hand, an extremely rare talent that was also exhibited by Satele Shan who fought in the Battle of Alderaan during the Great Galactic War. Halcyon's descendant, Corran Horn, later demonstrated similar talents, using the power to absorb heat energy from a volcanic spring on Yavin 4 to momentarily bolster his telekinesis. Horn later utilized this ability to absorb the shock from a stun baton while aboard the Errant Venture. He then demonstrated the full extent of his talent while on Courkrus, where he absorbed the heat energy from a series of explosions and redirected it to project a powerful Force Illusion. Horn also demonstrated advanced use of the talents during the Yuuzhan Vong War while on Bimmiel. Anakin Solo also demonstrated this variation of tutaminis when trapped on Yavin 4 later in the war."}, {"tag": "p", "text": "Darth Krayt, Darth Wyyrlok, Karness Muur, Grand Master Yoda, Galen Marek and Revan were able to catch Force lightning with their bare hands. The latter three could also deflect Force Lightning back to its source. Master Yoda used this ability to deflect a blast of Force lightning from Count Dooku back at him on Geonosis. Revan used this ability to deflect a powerful barrage of lightning back at Darth Nyriss, incinerating her with her own power in the process. Emperor Valkorion of Zakuul also proved himself a powerful practitioner, being able to block strong blows from a lightsaber with little to no difficulty.\nOn Mortis, Son was also capable of using this ability, which was noted as he blocked Anakin Skywalker's lightsaber strikes with his arms without much effort. Father was also able to exhibit this ability, holding Anakin's lightsaber by the blade without damage to his hand, before forcing it back into its hilt. The final member of The Ones, Daughter, was able to deflect and absorb the Son's crimson Force lightning. The Daughter also caught one of the lightning blasts and hurled it back at the Son."}, {"tag": "p", "text": "During the Clone Wars, Obi-Wan Kenobi demonstrated this skill during his battle with Durge by deflecting the Bounty Hunter's flamethrower using nothing but the Force, and then shortly after blocked blaster bolts from a Droideka. Later, while chasing General Grievous through Utapau, he absorbed the energy of the cyborg's electrostaff with his own bare hands before snatching away the weapon. Shaak Ti also used this ability during a duel with Grievous by deflecting his lightsaber after she was disarmed.\nGalen Marek was also able to use this ability in his desperate battle against Darth Sidious, though the amount of physical damage he sustained, if any, is unknown. Marek's clone was also able to use this ability in his duel with Darth Vader, when he absorbed a naturally generated lightning strike and redirected it at the Sith Lord, defeating him."}, {"tag": "p", "text": "In addition, Darth Vader had learned to block blaster bolts with his hands, though he could not produce Force lightning due to his cybernetic limbs."}, {"tag": "p", "text": "Luke Skywalker, when Darth Sidious tortured him with Force lightning aboard the second Death Star during the Battle of Endor, defended himself with this ability. Although Luke was initially successful, Sidious' increasing intensity with the energy, combined with Luke's lack of training in repelling such an attack and being unable to summon his lightsaber, overpowered Luke in short order."}, {"tag": "p", "text": "Lost Tribe of Sith members were able to not only absorb energy from blaster bolts by their palms, but also ability to deflect it back as they would otherwise by lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In computer games, the name of the Force power varies slightly—in Dark Forces: Jedi Knight and Star Wars: Jedi Knight II: Jedi Outcast, the power is called Force absorb, while in Star Wars: Jedi Knight: Jedi Academy, it is called Force absorption."}, {"tag": "p", "text": "In terms of game mechanics, the ability to absorb energy adds more points to the user's Force pool when absorbing an attack. Force absorb manifests in at least one game as a blue aura, although this is likely an interface mechanic to allow the player to know when the power is active."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}