{"url": "Twilight_of_the_Apprentice", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Twilight of the Apprentice"}, {"tag": "p", "text": "\"Twilight of the Apprentice\" is the finale of the second season of the animated television series Star Wars Rebels. The special one-hour event that premiered on March 30, 2016 on Disney XD comprised the twenty-first and twenty-second episodes of the season. It comprised the thirty-sixth and thirty-seventh episodes of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ezra, Kanan, and Ahsoka arrive at Malachor, a seemingly dead world and home to an ancient Sith Temple, but they are not alone. Paths cross, destinies change, and fates are fulfilled."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Journey to Malachor"}, {"tag": "p", "text": "The episode opens with CT-7567 \"Rex\" corresponding with Ahsoka Tano aboard the Phantom. Rex offers to come join her on her mission but Tano declines his offer. He remarks that experience always outranks everything (a callback to their very first conversation), with Tano replying that if that were the case, then she definitely outranks him now. Their communication ends with Rex wishing Ahsoka the best. After ending their conversation, Ahsoka returns to the ship's hangar to rejoin Kanan Jarrus and Ezra Bridger. When Ezra asks Kanan why Rex was so worried, Kanan explains that the planet Malachor was considered off-limits to the Jedi in the olden days. Tano then remarks that \"there is always a bit of truth in legends.\" Ezra then enquires as to why Master Yoda would send them to Malachor if it was off-limits."}, {"tag": "p", "text": "Shortly thereafter, the Phantom exits hyperspace outside Malachor. Kanan suggests that Malachor has something that would help them to stop the Inquisitors. Tano then interjects that they are searching for knowledge that would help them defeat the Sith. As the Phantom descends into Malachor's atmosphere, the astromech droid C1-10P \"Chopper\" detects another ship. The Jedi and Tano then realize that they are not alone and that someone else is also interested in Malachor's secrets. Kanan tells Chopper to track the vessel. After passing through several clouds, Ezra spots a large group of towering monoliths."}, {"tag": "p", "text": "As the Phantom approaches the structures, Kanan tells Chopper to get a fix on the second ship's location while the Jedi and Tano inspect the site. Ahsoka finds that the monoliths have inscriptions written on them in an ancient tongue which she is capable of deciphering. Despite Tano's orders, a mesmerized Ezra touches one of the monoliths; causing the three of them to fall through a cavern. While Ahsoka is able to use the Force to land to safety, both Kanan and Ezra are disoriented by the fall. Underground, the group come upon a massive structure, with Ahsoka identifying it as an ancient Sith temple. When Chopper contacts Ezra to warn them that they might fall through the surface, Ezra sarcastically thanks the droid for his warning. Chopper also tells Kanan that he has picked up the trail of the other ship."}, {"tag": "p", "text": "As the Jedi approach the Sith temple, Ahsoka explains that they are there to seek forbidden knowledge that would enable them to defeat their enemies. On the way, the Jedi and Tano stumble upon an old battlefield littered with fallen lightsabers and the statue-like remains of long-dead combatants. Ahsoka recalls that thousands of years ago, there was a battle on Malachor where the Jedi attacked the Sith temple. When Ezra asks her about the outcome, Tano surmises from the ruins that nobody won that battle. Kanan then interrupts them, saying they need to keep moving."}, {"tag": "p", "text": "Ezra then states that their quest is a riddle and gets into an argument with his master, when they suddenly spot one of the \"statues\" moving. The figure charges at them and Ezra ignites his lightsaber in self-defense. The armored figure then ignites his own red double-bladed lightsaber, revealing himself as an Inquisitor known as the Eighth Brother. The Inquisitor is surprised to encounter the three of them and hurls a trio of explosives at them, destroying the ground beneath Ezra and causing him to fall through into an underground tunnel, separating him from his companions. Stating that he'll be fine, both Ahsoka and Kanan then go in pursuit of the lone Inquisitor."}, {"tag": "h3", "text": "Meeting Old Master"}, {"tag": "p", "text": "While trapped underground, Ezra hears a voice in the darkness call out to him. Ezra draws his lightsaber in self defense, prompting the stranger to tell the boy that he means him no harm. The stranger then tells Ezra that he has been stranded on Malachor after his starship had crashed. When pressed, Ezra reluctantly tells the stranger that he and his friends are on a quest. The stranger then responds that he is also seeking knowledge about the Sith and suggests that they work together. The stranger offers to lead him to the Sith temple but adds that he is too old to enter the temple by himself. Alone and lost, Ezra reluctantly agrees to accompany the stranger into the Sith temple. The stranger introduces himself as \"Old Master\" with Ezra sarcastically replying that his name was Jabba."}, {"tag": "p", "text": "Back on the surface, Ahsoka and Kanan pursue the Eighth Brother across Malachor's charred and barren surface. During the pursuit, Chopper contacts Kanan to tell him that he has found the Inquisitor's ship; which turns out to be a TIE Advanced v1 starfighter. Kanan tells the droid not to let the Inquisitor get offworld and warns Chopper that disobeying him would cost them. Meanwhile, Ezra and the Old Master continue their journey to the Sith temple. Ezra tells him that he needs to get back to his friends. The Old Master understands his predicament since he considers the Inquisitors as powerful opponents. He then reassures Ezra that the Inquisitors and their Sith masters are his enemies."}, {"tag": "p", "text": "When Ezra asks the Old Master whether he was a Jedi, the man replies that he was a Force-wielder a long time ago. After Ezra questions if he was a Sith, the Old Master replies that the Sith were the enemies who had ripped him from his mother's arms, murdered his brother, used him as a weapon and then finally abandoned him. The Old Master also denounces the Sith for taking away his former status. Ezra is able to sympathize with the Old Master's predicament since the Empire had taken away his home and his parents. When the Old Master asks Ezra whether he wants revenge, the young apprentice replies that he wants justice. The Old Master then claims that the Sith temple contains the knowledge necessary to destroy the Sith."}, {"tag": "p", "text": "Back on Malachor's surface, Chopper flies into the Eighth Brother's TIE fighter only to encounter the Inquisitor's red blades. Despite the Inquisitor's opposition, he manages to force himself into the cockpit. Shortly after, Kanan and Ahsoka catch up with the Eighth Brother and Chopper manages to use the fighter's laser cannons to knock the Inquisitor to the ground. Kanan and Tano then disarm the Brother and take him prisoner. Kanan then praises the astromech droid for getting things right this time."}, {"tag": "p", "text": "Meanwhile, Ezra and the Old Master approach the temple, which the Old Master describes as both a place of worship for some and an engine of destruction to others. When Ezra asks how they'll get in, the Old Master explains that two must lift the stones guarding the temple since that is the way of the Sith. When Ezra enquires on his extensive knowledge of the Sith, the Old Master tells him that to defeat his enemy, he must understand them, a sentiment that Ahsoka had earlier stated to Ezra. When Ezra points out that his master disagrees with the Old Master's philosophy that one must practice their beliefs, the stranger responds that he would be doomed to fail in that case."}, {"tag": "p", "text": "As Ezra struggles to open the stone door, the Old Master implores him to give in to his anger and passion, something that was forbidden by the Jedi. Using their anger, Ezra and the Old Master are able to open the temple's first door. However, they find that the temple has a row of stone doors. This process exerts a lot of energy from Ezra, who asks how many more doors they have to open. The Old Master then urges Ezra to give in to his rage and anger in order for them to succeed. Having gained each others' trust, Ezra then tells the stranger his real name. In response, the stranger tells him that he was now called \"Maul.\""}, {"tag": "h3", "text": "The Sith temple"}, {"tag": "p", "text": "Back on the surface, Kanan and Ahsoka interrogate the captured Eighth Brother while Chopper watches. This being the fourth Inquisitor that Kanan and his companions had encountered, Kanan asks the Inquisitor whether there were more like him, the Eighth Brother replies that there were more than enough to handle him, Ezra, and Ahsoka. The Inquisitor tells Kanan and Ahsoka that he is hunting a \"shadow\" on Malachor, which turns out to be the former Sith apprentice Darth Maul."}, {"tag": "p", "text": "Meanwhile, Maul leads Ezra to the center of the temple where they see a Sith holocron resting on an altar. Maul tells Ezra that only someone willing to risk oblivion would be worthy of the power of the holocron. Since the altar is separated by a deep chasm, Ezra tells Maul to throw him to the altar, stressing that this was something his master had taught him. Taking Ezra's advice, Maul throws Ezra towards the altar. Ezra manages to reach the Sith holocron but the ground begins to shake as the temple starts to open up."}, {"tag": "p", "text": "Back on the surface, Kanan and Tano approach the temple with the captive Eighth Brother where they see it opening. While distracted, the Inquisitor takes the opportunity to use his wrist communicator to contact the other Inquisitors. Kanan then sends Chopper away to prepare the Phantom for departure. Meanwhile at the Sith temple, the altar begins to rise and Maul tells Ezra to jump. As Kanan and Ahsoka enter the temple, Kanan notes that Ezra is most probably involved in the recent movements. Back at the altar, Maul uses the Force to levitate Ezra to safety and takes the Sith holocron."}, {"tag": "p", "text": "Meanwhile, Kanan and Tano receive warning from Chopper that they have company. Shortly after, the Fifth Brother and the Seventh Sister arrive with their red-bladed spinning lightsabers and free the Eighth Brother. Together, the three Inquisitors attack Kanan and Ahsoka. Not long after, Maul and Ezra arrive to find Kanan and Tano fighting the Inquisitors. Ahsoka quickly recognizes Maul, as do the Inquisitors. Maul, for his part, chuckles in amusement and remarks \"What fun!\" at the sight of the dark siders. Composing herself, the Seventh Sister remarks that the rumors of Darth Maul's survival are indeed true, but Maul describes himself as formerly Darth, stressing that he is now called Maul. Kanan then warns Ezra to stay away from Maul, but Ezra tells Kanan that Maul is on their side."}, {"tag": "p", "text": "Maul then activates his lightsaber and engages the Seventh Sister. As he begins to get pressured, Kanan and Tano then leap in to help. Clearly outmatched, the Seventh Sister calls a retreat and they flee. When Ahsoka questions Maul's motives, he claims that he is seeking the same knowledge as them. Maul also warns the Jedi and Ahsoka that Darth Vader himself would be coming soon."}, {"tag": "h3", "text": "An alliance of convenience"}, {"tag": "p", "text": "Maul tells the Jedi and Tano that they need to bring the Sith holocron to the top of the Sith temple in order to gain the knowledge needed to defeat the Sith. When Kanan and Tano express their distrust of Maul, the former Sith offers to help them defeat Vader. In the end, Kanan and Tano agree to Maul's request. Kanan then contacts Chopper to tell him that they are staying behind a little longer. The astromech droid says it's a bad idea but complies with Kanan's instructions to keep the Phantom out of sight.\nAfter Maul reassures them that they are on the same side, the four travelers make their way to the top of the Sith temple. When Maul attempts to take Ezra to the top, Kanan doesn't take kindly to this suggestion and pushes him aside leaving Ahsoka with Maul."}, {"tag": "p", "text": "Unknown to the four travelers, they are being followed by one of the Seventh Sister's ID9 seeker droids, who relays their conversation back to the Inquisitors. The Seventh Sister realizes that Ezra has the Sith holocron while the Fifth Brother responds that they cannot allow him to use it. The Eighth Brother vows to reclaim the holocron and departs on his spinning lightsaber to the temple. Before the Fifth Brother can follow, the Seventh Sister advises him to let the Eighth Brother thin them out so that they can retrieve Lord Vader's prize."}, {"tag": "p", "text": "Inside the Sith temple, Ezra and Kanan argue. When Kanan warns Ezra that Maul cannot be trusted, the younger Jedi accuses his master of holding him back in his Jedi training. Ezra defends Maul arguing that Maul could see his full potential. Shortly thereafter, the Eighth Brother catches up with them and attempts to recover the holocron from Ezra. However, Maul and Ahsoka manage to drive him away. When Kanan tells Maul that the Inquisitors have realized their plans, Maul advises them to split up in order to better handle the Inquisitors. Maul again offers to take Ezra with him and despite Kanan's objections, Ezra this time decides to follow Maul. After they have left, Ahsoka assures Kanan that Ezra would be fine because Kanan had taught him well."}, {"tag": "p", "text": "As Maul and Ezra make their way to the top of the Sith temple, Maul begins to sow seeds of discord between Ezra and his master. He tells Ezra to use his powers to their full potential. Along the way, they are ambushed by the Seventh Sister and her seeker droids. Elsewhere, Kanan and Tano are attacked by the Fifth and Eighth Brothers, who engage them in a lightsaber duel. Maul and Ezra manage to destroy the seeker droids and defeat the Seventh Sister. While the Seventh Sister is distracted by Ezra, Maul uses the force to levitate her and holds her in a Force-choke, telling Ezra to strike her down with all of his hatred. Despite their animosity, Ezra cannot bring himself to kill her. Devoid of such mercy, Maul throws his own lightsaber at her, killing her. He then admonishes the young Jedi and tells him that in the future, his hesitation might cost him or his friends their lives."}, {"tag": "p", "text": "Splitting up again, Maul tells Ezra to plant the Sith holocron in the temple's obelisk while he goes to assist Ahsoka and Kanan. Arriving at the scene, Maul engages the inquisitors and forces the Fifth Brother onto the back foot. Taking advantage of his distraction, Ahsoka lunges forward and strikes the Fifth Brother's lightsaber, damaging it and rendering it useless. Disarmed and defenseless, the Fifth Brother quickly falls to Maul. Kanan then manages to damage the Eighth Brother's lightsaber. Confronted by the three Force-wielders, the Inquisitor attempts to flee using his lightsaber's helicopter technique but it breaks apart in mid-air, causing him to plummet to his death below."}, {"tag": "h3", "text": "Maul's betrayal"}, {"tag": "p", "text": "Soon after the Eighth Brother's death, Kanan demands to know where Ezra is. Maul claims Ezra as his apprentice, surprising Ahsoka and Kanan. Maul then uses this opportunity to strike Kanan with his lightsaber, blinding him. Before Maul can finish off the wounded Jedi, Ahsoka comes to Kanan's aid and attacks the former Sith with her white lightsabers."}, {"tag": "p", "text": "While dueling Tano, Maul tells her that Ezra is on his way to activate the temple, which he reveals is a battle station that he intends to use to destroy all his enemies. Meanwhile, at the top of the temple, Ezra plants the Sith holocron in the obelisk. The young Jedi is then greeted by an entity known as the \"Presence,\" who tells him that knowledge is power. The Sith temple then begins powering up. Elsewhere, Tano starts pushing Maul back in their duel but stops when she notices Kanan has regained his composure, having managed to don a fallen Jedi Temple Guard's helmet and find his lightsaber, which he had dropped. She mockingly states to Maul that he would have to try and defeat Kanan first before getting a chance to challenge her. Kanan then tells Ahsoka to find Ezra while he deals with Maul. Despite being blinded, Kanan uses his Force powers and his other senses to fight against Maul and succeeds in pushing him over a cliff into the chasm below."}, {"tag": "h3", "text": "A dark showdown"}, {"tag": "p", "text": "After driving Maul away, Kanan is contacted by Chopper, who tells him that he has sighted another TIE starfighter. The wounded Kanan then tells the astromech droid to pick them up. Back at the top of the Sith temple, the Presence reveals that the Temple contains the power to destroy all life. When Ezra protests that this was not what he was after, the Presence then questions whether their new guest would try and claim the power. Believing that the Presence is referring to Maul, Ezra attempts to warn Kanan and Ahsoka, but as he emerges from the temple, the young Jedi is instead cornered by the Sith Lord Darth Vader, who has arrived in his TIE starfighter and his lightsaber ignited."}, {"tag": "p", "text": "When Vader asks Ezra how he managed to open the holocron, the young Jedi tells the Sith Lord to figure it out himself. Shrugging it off, knowing that the temple's power would serve his master The Emperor, Vader quickly defeats Ezra and breaks his lightsaber in half. As Vader prepares to finish Ezra off, Ahsoka intervenes. He states that they need not fight and that the Emperor will show her mercy if she agrees to help the Sith hunt down the remaining Jedi. In response, Ahsoka rebukes him, saying he and his Inquisitors had killed all the Jedi. As Vader threatens her with Ezra's safety, Ahsoka expresses her outrage, stating that her former master could never be as vile as him. Vader replies that Anakin Skywalker was weak and that he had destroyed him. Tano then vows to avenge Anakin's death. When Vader retorts that revenge is not the Jedi way, Ahsoka states that she is no Jedi."}, {"tag": "p", "text": "While Ahsoka engages and pushes back Vader in a lightsaber duel, Ezra decides to remove the holocron in order to keep it out of the Sith Lord's hands. Shortly after, he is joined by Kanan and Chopper, who have arrived with the Phantom. Ezra quickly notices that Kanan is wearing a helmet and his master replies that they would talk about it later. Working together, Kanan and Ezra manage to remove the Sith holocron from the obelisk, causing the Temple to start to collapse and implode in on itself. Meanwhile, on the outer walls of the Sith Temple, Ahsoka and Vader continue their duel until Vader finally forces Ahsoka over the edge into the chasm below."}, {"tag": "p", "text": "Ezra and Kanan then try to make their way back to the Phantom but Vader arrives and starts pulling the holocron towards him through the Force, with Ezra struggling to hold onto it and Kanan trying to pull Ezra back. However, Ahsoka suddenly reappears and attacks Vader, knocking away his lightsaber and damaging his helmet. With the right half of his mask destroyed, Vader as Anakin calls out Ahsoka's name, shocking her. Beneath the charred helmet and scarred face, Tano sees her former master. Torn by her feelings to Anakin, Ahsoka tells the fallen Jedi she would not leave him. Vader appears to consider this for a moment but ultimately replies \"Then you will die,\" and re-ignites his lightsaber. Around them, the temple starts to seal. Ezra tries to get to Ahsoka, but she Force-pushes him out of the temple and into the Phantom. As the temple closes in on itself, Ahsoka and Vader continue their fight as Ezra, Kanan, and Chopper manage to escape Malachor on the Phantom."}, {"tag": "h3", "text": "It's over now"}, {"tag": "p", "text": "As they leave, the temple explodes and engulfs the surrounding area in a burst of power, seemingly killing Ahsoka and Vader. Aboard the Phantom, Kanan comforts a weeping Ezra as they deal with the apparent loss of their ally and mentor Ahsoka Tano. The Phantom returns to Chopper Base on Atollon where they are greeted by Hera Syndulla, Sabine Wren, Garazeb Orrelios, Rex, and AP-5. While the others look on in silence, Hera embraces Kanan, who is wearing a white blindfold around his eyes. Ezra and Rex lock eyes, sharing their sadness for Ahsoka's loss when the clone realizes she did not return. Meanwhile, Maul escapes Malachor in a stolen TIE fighter."}, {"tag": "p", "text": "On Malachor's surface, a lone and damaged Darth Vader limps away from the destroyed Sith temple without Ahsoka. While the convor Morai flies overhead, Tano can be seen walking back into the temple. Back on the Ghost, the Spectres silently deal with Kanan's blindness and the apparent loss of Ahsoka. In his darkened room, Ezra manages to access the Sith holocron using the dark side of the Force, with his eyes reflecting the beaming red light."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "During the episode's early development, the Malachor superweapon was supposed to fire an energy blast that would've turned all living things to stone. In this sequence of events, the Eighth Brother initially survived his fall from the temple but was caught in the blast while trying to get back to his ship, turning him to stone.[source?]"}, {"tag": "p", "text": "The shot of Darth Vader's mask being partially shattered and showing one of his Sith eyes was taken from the Star Wars Legends comic series Star Wars: Dark Times which showed a similar shot after he killed the Jedi Conclave on Kessel.[source?]"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}