{"url": "Twi%27lek_Ark", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Artifacts", "Category:Dok-Ondar's belongings", "Category:Twi'lek culture"], "nodes": [{"tag": "h1", "text": "Twi'lek Ark"}, {"tag": "p", "text": "The Twi'lek Ark was a golden artifact from the planet Ryloth. Throughout history, it changed hands several times. In 22 BBY, during the Clone Wars, it was seized by Emir Wat Tambor of the Confederacy of Independent Systems. It later fell into the hands of the Galactic Empire and, in 3 BBY, was placed aboard a container transport that blew up in space. Having survived the transport's destruction, the Ark later wound up in the private collection of the pirate queen Maz Kanata on Takodana."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Twi'lek Ark was a rectangular box plated with gold. On the bottom of the box, four rings were attached, through which two poles were put. People would carry the ark using those poles. Attached to the lid were two sculptures of kneeling Twi'leks facing one another, with their arms and lekku extended."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, a small army of the Confederacy of Independent Systems commanded by Wat Tambor took control of Ryloth, homeworld to both the Twi'lek species. Taking up residence in the capital city of Lessu, Tambor took the title of Emir and started hoarding valuables, including the Twi'lek Ark. However, the planet's freedom fighters allied with the Galactic Republic against Tambor, who begrudgingly ordered his tactical droid TA-175 to prepare his shuttle for evacuation. Aboard said shuttle, the Emir hoarded all the treasures he had plundered from Ryloth. Ultimately, the Ark took off with the shuttle when TA-175 decided to leave without the Emir."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "Eventually, the Galactic Republic won the Clone Wars, and its leader Sheev Palpatine proclaimed its transformation into the Galactic Empire. By 3 BBY,[source?] the Empire possessed the Twi'lek Ark. At one point that year, the artifact was placed aboard the class four container transport 241, which ended up being destroyed in space by the Spectres, an anti-Empire Rebel cell. The remnants of the transport were then salvaged and looted by the Rebels."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "At the time of the Cold War, the Twi'lek Ark was in the possession of the Ithorian collector Dok-Ondar, who placed it in his antiques shop in Black Spire Outpost on the planet Batuu. Some time later, the Ark was part of Maz Kanata's collection of antiques and treasures on Takodana."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Twi'lek Ark first appeared in Liberty on Ryloth, the twenty-first episode of season one of the Star Wars: The Clone Wars. The ark was included as a reference to the Ark of the Covenant, as it appeared in the first Indiana Jones film: Raiders of the Lost Ark. In the film, Indiana Jones and other characters hunt for the missing artifact. Star Wars creator George Lucas also produced the Indiana Jones franchise, so the Twi'lek Ark was added as a reference."}, {"tag": "p", "text": "For a time, a real-life Ark prop was on display at Dok Ondar's Den of Antiquities in Star Wars: Galaxy's Edge, but it has since been removed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}