{"url": "Twin_Suns_(episode)", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Twin Suns  (episode)"}, {"tag": "p", "text": "\"Twin Suns\" is the twentieth episode of the animated television series Star Wars Rebels' third season. It is the fifty-seventh episode of the series overall. It aired on March 18, 2017, on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Maul arrives on Tatooine seeking revenge against his nemesis, Obi-Wan Kenobi. Ezra, meanwhile, heads to the desert planet hoping to reach the Jedi Master first."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The desolation of Maul"}, {"tag": "p", "text": "The episode opens with Maul lost in the deserts of the planet Tatooine. He can feel Obi-Wan Kenobi's presence in his mind's eye, but searching an entire planet for a man who doesn't want to be found has proven to be far more difficult than Maul expected. In exasperation and rage, Maul cries out Kenobi's name. His voice reverberates through the desert. Maul does not want to die in the desert, and vows to draw Kenobi out of hiding. While contemplating, Maul has an idea, slowly opening his hand to reveal a fragment of the Sith holocron from Malachor."}, {"tag": "h3", "text": "The holocron's messages"}, {"tag": "p", "text": "Meanwhile, at Chopper Base on the planet Atollon, Ezra Bridger is sleeping in his bunk bed above Garazeb Orrelios when he is woken by a faint recording of Kenobi's voice emanating from Kanan Jarrus' holocron. Ezra at first thinks that Zeb is snoring, but hears the holocron speaking when Ezra opens his eye. The holocron repeats Kenobi's warning to the Jedi following Order 66. Ezra enters Kanan's quarters, where Kanan's holocron and the Sith holocron are stored. He finds Kanan's holocron repeating itself. The Sith holocron then glows red, and Ezra hears Maul roaring Kenobi's name again, causing him to trip backwards as red light flashes from the broken holocron. Ezra finds his master, Kanan Jarrus, standing behind him and tells his master that Maul is back."}, {"tag": "p", "text": "Ezra, Kanan, Hera Syndulla, Rex, Commander Jun Sato, and Chopper meet in the base's command center to discuss the news. Kanan is unsure what the holocrons are trying to say, but Ezra believes that Master Kenobi's life is in danger because Maul is after him right now. While sympathetic to Ezra's hope that Kenobi is still alive, Rex – who had served at the Jedi's side during the Clone Wars – tells Ezra that Senator Bail Organa had confirmed Kenobi's purported death. Ezra thinks that Senator Organa is wrong, and fears that Maul is closing in on Kenobi."}, {"tag": "p", "text": "Hera thinks Ezra just heard a broken recording, but Ezra counters that he heard Maul's voice. Kanan reminds Ezra that Maul has tricked him before, but Ezra insists on going to Tatooine to check things out. Hera takes the young Jedi aside for a private word. She reminds him that the rebels are training for their attack on Lothal, and that they need his local knowledge to help prepare if they want to be successful. Ezra argues that Kenobi is alive and could help the Rebellion."}, {"tag": "p", "text": "Hera dismisses that idea that Kenobi is alive based on the reasoning that he would not be hiding on a backwater world instead of helping the Rebellion. Hera wishes things were different, but reiterates that she needs him here for the Lothal mission. Ezra reassures her that he is enthusiastic about helping the rebels on the Lothal mission. Hera tells Ezra she understands what he is going through, and allows him to leave. Kanan walks over to Hera, followed by Chopper, and they exchange a brief glance and watch Ezra walk away."}, {"tag": "h3", "text": "Going AWOL"}, {"tag": "p", "text": "The following morning at Chopper Base's busy landing field, a rebel trooper greets Ezra as the boy pushes several crates of munitions. Ezra claims the munitions are for the A-wings. When the trooper does not recall receiving such orders, Ezra claims that the inventory droid AP-5 sent them. The trooper remarks that the \"calculator\" must be going into overdrive, and asks Ezra for the manifest. As he hands it over, Ezra asks if any of the fighters need loading."}, {"tag": "p", "text": "The trooper reports that the RZ-1T trainers need to be rearmed, since they have been used by the new recruits lately. While the trooper confirms the authenticity of Ezra's manifest, Ezra takes the opportunity to disappear. Unbeknownst to Ezra, Chopper is also watching and follows the boy. Before the trooper can tell Ezra to take the munitions to the trainers, Ezra climbs into the cockpit of an RZ-1T trainer and takes off despite the trooper's orders not to, pretending that he can't hear the trooper. As he leaves, Ezra says that he hopes Hera can forgive him."}, {"tag": "p", "text": "Ezra takes the RZ-1T trainer into hyperspace and flies to Tatooine. Upon arriving over the desert planet, Ezra is startled by Chopper, who has stowed aboard the trainer. Ezra jerks the RZ-1T in fright. Ezra demands that Chopper tell him how he got aboard, and adds that he did not want the other rebels to get involved. Chopper squeals back in Binary, and Ezra reluctantly accepts Chopper for the mission. He then adds that they do not know where they are going."}, {"tag": "p", "text": "Ezra activates Kanan's holocron and the Sith holocron, telling Chopper to take them into Tatooine's atmosphere, as he will let him know when to change course. The RZ-1T trainer enters Tatooine's atmosphere at night, while Ezra lets the holocrons guide him. Ezra tells Chopper to take their ship north by north-west. Shortly before landing, the holocrons fade. After disembarking, Ezra tells Chopper to stay with the ship. The holocrons lead him towards a glowing shard of the Malachor Sith holocron, which Maul had used to lure Ezra to the planet. As he picks up the shard, Ezra hears Maul saying \"now you see\" and realizes they have stumbled into a trap."}, {"tag": "h3", "text": "Tusken ambush"}, {"tag": "p", "text": "Ezra and Chopper soon find themselves under attack from several Tusken Raiders, who had been converging on the canyon. Under the cover of darkness, the Sandpeople attack the RZ-1T with gaderffii sticks and slugthrowers. Ezra returns to the trainer fighter, where he uses the Force to hurl away a Tusken Raider threatening Chopper. Chopper flees the ship with his rocket booster and dodges blaster bolts. Ezra tells Chopper to find cover while he takes position under the fighter."}, {"tag": "p", "text": "Ezra is soon attacked by a Tusken Raider, but Chopper comes to his aid by spraying foam at the assailant. The other Tuskens concentrate their fire on the RZ-1T, causing it to explode. Ezra and Chopper narrowly avoid being hit by the blast, Ezra saving Chopper by pushing him to the ground. The jubilant Tusken Raiders then raise their sticks and begin chanting. However, Maul arrives and cuts them down with his lightsaber. Meanwhile, Ezra gets to his feet and lifts Chopper up. While the explosion scared the Tusken Raiders away, the two rebels realize they are stranded with no way of getting home. Ezra and Chopper head through the canyon."}, {"tag": "h3", "text": "Trials of heat and sand"}, {"tag": "p", "text": "At daybreak, Ezra and Chopper exit the canyon to find themselves facing an empty desert. Ezra thinks that crossing the sands is a bad idea, especially for droids. Chopper suggests traveling along the ridge. Ezra accepts Chopper's idea, but then sees an apparition of Maul telling him to head into the desert. Using the Jedi and Sith holocrons, Ezra believes that Maul is out there and that they have to venture into the desert to stop him."}, {"tag": "p", "text": "Chopper grunts, but Ezra insists on finding Master Kenobi. He tells Chopper that he is free to follow the ridge and find a settlement. He suggests that Chopper can then contact Chopper Base. After some thinking, a grumbling Chopper reluctantly follows Ezra into the desert. The two rebels are soon caught in a sandstorm. Ezra uses the Jedi and Sith holocrons to guide them, but the two are blinded by the sand. Amidst the sandstorm, Ezra hears Maul's voice telling him to draw Kenobi out. Maul tells Ezra that his pain and sorrow call out to Kenobi. Ezra tells Chopper to keep moving."}, {"tag": "p", "text": "The sandstorm eventually subsides, but the two rebels are exhausted. Chopper's battery drained, the droid shuts down. A despondent Ezra tries to revive his rebel comrade. With Chopper immobile, Ezra blames himself for not heeding Hera's advice. While waiting under the scorching suns, Ezra is tormented by Maul's voice claiming that Kenobi is dead because of his actions. An exhausted Ezra then sees Maul looming over him, and charges at him with his green lightsaber. However, Ezra discovers that he only saw a mirage, succumbing to exhaustion and heat stroke as Maul laughs. Later, a cloaked figure approaches the immobile Chopper and the delirious Ezra, who is fading into unconsciousness."}, {"tag": "h3", "text": "An evening with Kenobi"}, {"tag": "p", "text": "That night, Ezra awakes to find himself at a campfire. He discovers that Chopper has been hooked up to a power lamp. Ezra also finds a dewback watching them. On the other side of the campfire, Ezra sees a cloaked figure who tells him that he is in the wrong place. The cloaked figure reveals himself as Master Obi-Wan Kenobi, and tells Ezra that he will help him to get on his way back once the boy has regained his strength. Ezra protests, saying that he has come to warn Kenobi about Maul."}, {"tag": "p", "text": "However, Kenobi already knows that Maul has been hunting for him. He tells Ezra that one does not survive for as long as he has by being foolish. Kenobi describes Maul as an old and persistent adversary. When Ezra suggests that they fight him together, Kenobi says that he had no intention of fighting Maul, but acknowledges this is now unavoidable."}, {"tag": "p", "text": "When Ezra tells Kenobi that the holocrons told him that Kenobi would be the one to help them destroy the Sith, Kenobi expresses surprise. Ezra adds that the Rebellion needs Kenobi's help to defeat the Empire. Kenobi responds that Ezra already has what he needs, and warns the young Padawan that he is already letting it go. When Ezra expresses puzzlement at why the holocrons would send him here, Kenobi tells him that Maul used the holocrons to manipulate Ezra's emotions and thus altered the course of many things."}, {"tag": "p", "text": "He warns Ezra that Maul knows his fears and has manipulated the truth to lead him here, where he should never have been. When Ezra tells him that the holocrons tell the truth, Kenobi explains that the holocrons only told him what he wanted to hear and believe. Kenobi warns that Maul is the only one to have benefited from all of this. At this point, Maul interrupts Kenobi's sentence, walking up to the other side of the campfire."}, {"tag": "p", "text": "Kenobi tells Ezra to go. When the boy protests, Kenobi tells him that it is not his responsibility, stressing that he will mend the \"old wound.\" Kenobi tells Ezra to ride the dewback north, where he will find his way home. Chopper uses his rocket booster to land on the dewback's saddle and the two leave the encampment."}, {"tag": "h3", "text": "Mending old wounds"}, {"tag": "p", "text": "After Ezra and Chopper have left, Maul bids \"his\" apprentice farewell before turning his attention to Kenobi. Maul insults Kenobi by describing him as a \"rat in the desert.\" Kenobi counters with \"Look what I have risen above.\" Maul tells Kenobi that he has come to kill him, but thinks it is worse to leave him here festering in squalor. Kenobi responds that Maul has nothing, because he solely defines himself by his power to take life and to dominate others. Maul ignites his double-bladed lightsaber and slashes at the sand, dousing the fire. He then cries out, \"What do you have?\""}, {"tag": "p", "text": "Kenobi stands impassively as Maul asks him why he came to Tatooine, suspecting that the Jedi Master would not hide away on a backwater planet for no reason. He is able sense the mind of his enemy and deduce that Kenobi is protecting someone. In response, Kenobi ignites his lightsaber and adopts his master Qui-Gon's stance, tricking Maul into attacking him as he did the fallen Jedi Master. Kenobi parries his blade; Maul parries in response and the two men size each other up. Maul then lunges forward at the Jedi Master and the two blades crash. Following a brief exchange, Kenobi bisects Maul's lightsaber and inflicts a fatal wound to his chest."}, {"tag": "p", "text": "As Maul drops his bisected lightsabers and falls to the ground, Kenobi catches him and props up his fallen adversary. In his last moments, Maul asks if Kenobi is hiding the Chosen One. Kenobi confirms that this is true, which implies that Kenobi thinks Luke Skywalker, not his father Anakin Skywalker, is the Chosen One. Maul then says that he [the Chosen One] will avenge them, before passing away. Out of respect and pity, Kenobi closes Maul's eyes and sits beside his fallen adversary beneath two of Tatooine's three moons."}, {"tag": "h3", "text": "Parting company"}, {"tag": "p", "text": "Later, Ezra and Chopper fly Maul's ship Nightbrother back to Atollon. Upon entering the atmosphere, they are escorted to Chopper Base by two A-wings. Zeb is loading supplies, while Hera and Kanan watch as the Nightbrother lands. After the two rebels disembark, Zeb asks Ezra \"if this means what I want it to mean.\" Ezra tells his rebel comrades that they won't be seeing Maul again. He apologizes to Hera and Kanan for running off, and tells them that the Rebellion is where he is supposed to be. Ezra adds that his fellow rebels are his family, and that they are supposed to go home. The Spectres embrace Ezra."}, {"tag": "p", "text": "Back on Tatooine, Kenobi rides his dewback towards the Lars moisture farm. Over the horizon, he hears Beru Whitesun Lars calling out to her step-nephew Luke. Kenobi strokes his chin as he watches Luke head home, a tiny silhouette against the binary sunset."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": "Twin Suns on Wikipedia"}]}