{"url": "Twin_Suns_Transport_Services/Legends", "categories": ["Category:Legends articles", "Category:Azzameen family property", "Category:Transport companies", "Category:Twin Suns Transport Services starships"], "nodes": [{"tag": "h1", "text": "Twin Suns Transport Services"}, {"tag": "p", "text": "Twin Suns Transport Services was a small shipping company owned by the Azzameen family."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The company headquarters space station also served as the family's home. Other assets included a repair yard in a nearby system that also turned a tidy profit fixing-up other ships that didn't belong to the company or want to pay the Viraxo's repair fees. They also employed a wide variety of freighters, ranging from YT-1300 light freighters to Gallofree Yards medium transports and protected them with highly capable Toscan snubfighters. The family's company was a rival of Viraxo Industries, as they worked the same area of space, but during the Galactic Civil War Tomaas Azzameen was trying to compromise with them."}, {"tag": "p", "text": "However it was not easy; Aeron Azzameen discovered that Viraxo was planting spice in their containers. This meant that their storage area was compromised, which led to the relocation of all the containers. The Azzameens then staged a quick hit-and-fade to cover returning the spice to its original owners and attract an Imperial fleet, which would throughly search the area and find the contraband. It was hoped that the Viraxo would be put out of business, and while that didn't happen, it undoubtedly cost the Viraxo a fortune in bribes and fines."}, {"tag": "p", "text": "The Azzameens had a contract with the Rebel Alliance to deliver bacta to one of the Alliance bases handling casualities wounded on Hoth. During one trip, the Imperial Star Destroyer Corrupter arrived and attacked both the Alliance forces and the family vessels. In the aftermath of that battle the family was then declared traitors to the Empire and a warrant of caption was issued against them."}, {"tag": "p", "text": "The family took what they could from their family base and escaped before the Imperials arrived and took control of their shipyards and their base. The remnants of the company later helped the Azzameen family hit Viraxo transshipment points for cargo to sell to the Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}