{"url": "Two-wave_gravshock", "categories": ["Category:Legends articles", "Category:Gravitational superweapons", "Category:Imperial Department of Military Research products", "Category:Imperial projects and operations", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Two-wave gravshock"}, {"tag": "p", "text": "The two-wave gravshock, also known as the gravshock device or simply the planetbuster, was an Imperial superweapon that manipulated gravity on a planetary scale."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Designed by the Imperial Department of Military Research, the two-wave gravshock was a large, power-hungry apparatus housed within the shell of a Torpedo Sphere. The device used gravwaves to affect a planet's gravitic field, thus causing effects that resembled groundquakes and other natural disasters. The device therefore could cause cities to be crushed in upon themselves or flooded by massive waves."}, {"tag": "p", "text": "During development, it was discovered that the effect of low-level gravwave broadcasts could also be used to determine the interior composition of a planetoid, offering non-military applications in exploration and mining."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Two problems were discovered during the testing phase of the project. The initial prototypes were carried within the hulls of modified Torpedo Spheres, which proved capable of mounting attacks on city-sized targets; but only the drives of Super Star Destroyers were thought to have sufficient power to mount attack on a fully planetary scale, and a Super Star Destroyer had no need of such a device to supplement its turbolaser and concussion missile batteries. Perhaps equally seriously, the violent disruption which the device caused to the target planet's gravitational field during an attack created severe navigational problems for ships in orbit, including the attacking vessel itself, and any escorts it might have."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}