{"url": "Battle_of_the_Graveyard", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Alderaan", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of the Graveyard"}, {"tag": "p", "text": "A space battle between the Alliance to Restore the Republic and the Galactic Empire occurred in the Graveyard, the remains of Alderaan after it was destroyed by the Death Star around 0.5 ABY during the Galactic Civil War. Shortly after the destruction of that Death Star in the Battle of Yavin, a Rebel fleet centered around Renegade Squadron—a recently established Alliance squadron made up of smugglers and criminals—attempted to secure a very valuable data holocron believed to have survived the destruction of Alderaan. The Alliance fleet, under the command of Han Solo, believed the holocron contained ideal locations for a new base for the Alliance. Likewise, the Empire wanted the holocron to suit their own ends. Upon arrival in the system, Solo's fleet found themselves opposed by an Imperial fleet, as well as by the bounty hunter Boba Fett, who had been hired by the Empire to capture the holocron."}, {"tag": "p", "text": "After a brief battle between the two forces, the Renegades were able to find and secure the data holocron. After they did so, Fett, aboard his personal starfighter Slave I, tried to steal the holocron by engaging the Rebels in a dogfight. The Rebels were able to defeat the bounty hunter, and destroyed the gravity well projectors on an Imperial Interdictor Star Destroyer which was keeping the Alliance fleet trapped in the system. The Alliance retreated from the system, and later used the holocron to find the graveyard planet of Boz Pity, where they built a new base."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the Evacuation of Yavin in 0.5 ABY, Han Solo and Commander Col Serra, a pair of smugglers turned Rebel officers, were told by Mon Calamari Admiral Gial Ackbar about a data holocron that had been created by Viceroy Bail Organa of Alderaan. The holocron had been created before the first Death Star had destroyed Alderaan, and contained information regarding possible locations for a new base for the Alliance. After the Alliance was forced to retreat from Yavin 4 and the Rebel base that had been centered around it, the Rebellion was in dire need of a new central base. As such, the recovery of the holocron was given significant priority by the Alliance. The holocron was known to have been encased in a rare metallic compound known as phrik, one of the strongest substances in the galaxy, and because of this, Ackbar had reason to believe that the holocron might have survived the destruction of Alderaan."}, {"tag": "p", "text": "In response to this information, Ackbar ordered Solo to take a small fleet, along with Renegade Squadron, the Alliance's recently established fighting unit made up of smugglers and criminals, to the Graveyard, the asteroid remnants of Alderaan. Under Solo's command were a Mon Calamari Star Cruiser and two EF76 Nebulon-B escort frigates, several starfighter squadrons, and his own personal ship, the Millennium Falcon. Unbeknownst to the Rebels, the Empire had also discovered the existence and whereabouts of the holocron, and had sent a fleet to the Alderaan system as well. As a contingency plan, the Empire also hired the bounty hunter Boba Fett to find the holocron in case their forces failed."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "When the Alliance fleet arrived out of hyperspace, they discovered that there was an Imperial fleet made up of an Interdictor Star Destroyer and two Victory II-class frigates already in the system. The Interdictor launched half of a squadron of TIE fighters, and in response, Col Serra quickly ordered a member of Renegade Squadron to take out the six incoming TIE fighters using an X-wing starfighter. After a small dogfight, the six TIE fighters were destroyed. However, both sides continued to launch starfighters, escalating the battle."}, {"tag": "p", "text": "As the battle intensified, Solo and his Wookiee co-pilot, Chewbacca, launched the Millennium Falcon from the Mon Calamari Star Cruiser to locate and retrieve the holocron. Solo ordered his Renegades to keep fighting the Imperials, hoping to use the battle as a distraction. However, a trio of TIE interceptors followed the Falcon and managed to damage it. The Renegades were eventually able to destroy the interceptors, and Solo informed his men that he had found the location of the holocron, but that the Falcon was too badly damaged to pick it up. As a result, Solo instead ordered Renegade Squadron to retrieve the holocron from the Graveyard and they did so."}, {"tag": "p", "text": "After the Renegades picked up the holocron, Boba Fett arrived into the battle from hyperspace and gave chase in his personal starship, Slave I. Realizing that the Empire was about to lose its prize to the Rebels, Fett radioed the Renegades to inform them that he was after the holocron. Understanding that Fett posed a larger threat than the Imperials, Col Serra ordered Renegade Squadron not to allow the bounty hunter to retrieve the holocron. As such, the Renegades engaged Fett, eventually causing enough damage to Slave I that it forced Fett to leave the battle and jump to hyperspace. The Imperials were now forced to retrieve the holocron themselves."}, {"tag": "p", "text": "With Fett's retreat, the Renegades just had to destroy the Imperial Interdictor's gravity well projectors before they could jump back into hyperspace, so Serra ordered the Rebel forces to attack the battleship. The Renegades were able to eventually able to destroy the gravity well projectors, and with the way clear, Han Solo led his fleet away from the Graveyard and out of the system."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the damage sustained in the Alderaan system, Han Solo and Renegade Squadron were ordered to Ord Mantell for repairs. While on the planet, the Renegades were attacked by the droid bounty hunter IG-88 and Imperial forces. After a brief battle, the Renegades defeated the Imperial forces and retreated from the system."}, {"tag": "p", "text": "With the holocron in Rebel hands, Ackbar decided to to personally examine one of the prospective planets on the holocron's list. Ackbar and a small scouting party traveled to the graveyard world of Boz Pity in the Outer Rim, and after scouting the planet, he decided it would make an ideal spot for a new base. Nonetheless, the Mon Calamari sought to examine other options and took a smaller scouting party with him to Saleucami, another planet on the list. However, when they exited hyperspace over Saleucami, they were ambushed by Boba Fett. Fett was able to defeat the Rebels and captured Ackbar and a number of other survivors. Fett then sold Ackbar to the Imperials and presented the other survivors to the Hutt Cartel on the planet Tatooine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of the Graveyard made its first and only appearance in the video game Star Wars Battlefront: Renegade Squadron, which recounts the various battles and exploits of Renegade Squadron during the Galactic Civil War. The battle itself makes up the second level in the game's campaign mode."}, {"tag": "p", "text": "Due to the fact that the battle takes place only a short time after the Battle of Yavin, the A-wing starfighters that served in this battle could possibly be the R-22 Spearhead, the predecessor of the A-wing. However, an official explanation for this has not been presented yet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}