{"url": "Battle_of_the_Great_Pit_of_Carkoon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battles of the Galactic Civil War", "Category:Battles of Tatooine"], "nodes": [{"tag": "h1", "text": "Battle of the Great Pit of Carkoon"}, {"tag": "p", "text": "The Battle of the Great Pit of Carkoon, also known as the battle over the Great Pit of Carkoon, or the Battle of Carkoon, took place in 4 ABY as part of a campaign by Luke Skywalker to rescue his captive friend, Han Solo, from the gangster Jabba the Hutt. Following a failed infiltration of the Hutt's palace, Jabba attempted to execute Luke Skywalker, Han Solo, and Solo's companion Chewbacca by throwing them into the Great Pit of Carkoon, home of the Sarlacc."}, {"tag": "p", "text": "Skywalker was prepared for this type of situation, having stored his lightsaber inside his droid R2-D2 prior to the rescue attempt. Just as the execution was to take place, the droid launched the lightsaber into the air, equipping Skywalker and allowing him to neutralize all of Jabba's guards. During the ensuing chaos, Jabba was assassinated by Leia Organa, another participant in the operation who was taken as a slave by Jabba, and Boba Fett, an associate of the Hutt considered to be one of the greatest gunfighters in the galaxy, was catapulted into the Sarlacc's maw by Solo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Years earlier, Jabba hired Han Solo to smuggle spice for him. However, on one spice run, Solo was boarded by Imperial forces and forced to jettison the spice to avoid incrimination. After Solo was unable to repay the Hutt, Jabba placed a bounty on his head. Several years after the initial bounty, Solo was tracked to Cloud City on Bespin by the feared bounty hunter Boba Fett. There Solo was captured, tortured and frozen in carbonite by Darth Vader, after which he was turned over to Fett for delivery to the Hutt crime lord. After spending some time trying to track down Boba Fett, including a near-miss on Gall, the Rebels learned that Solo had finally been taken to Jabba."}, {"tag": "h3", "text": "Infiltrating the palace"}, {"tag": "p", "text": "Lando Calrissian had infiltrated Jabba's Palace as a guard under the alias of Tamtel Skreej, in case of an emergency. Luke Skywalker then sent his droids R2-D2 and C-3PO to deliver a message to Jabba the Hutt. The holographic message played by the droid requested that Jabba free Solo in a mutually beneficial arrangement with the young Jedi. It also presented the droids as gifts to the Hutt, in order to show that he wanted a peaceful agreement rather than a confrontation. Jabba refused to cooperate and surrender his favorite prize."}, {"tag": "p", "text": "In the second phase of the rescue operation, Leia Organa, disguised as the bounty hunter Boushh, brought a \"captured\" Chewbacca to the palace to collect a bounty on his head. Jabba offered 25,000 credits for the Wookiee, but paid her 35,000 credits after heated negotiations involving a thermal detonator. The following night Organa sneaked into Jabba's throne room and attempted to free Solo, releasing him from the carbonite. Before they could flee however, they were captured, as Jabba had not trusted Boushh and was laying in wait of the escape attempt. Jabba imprisoned Solo in a cell with Chewbacca and added Organa to his harem of slave girls."}, {"tag": "h3", "text": "Attempted Negotiations"}, {"tag": "p", "text": "Luke Skywalker then came to free his friends. He easily made his way past Jabba's Gamorrean guards and used a Jedi mind trick on Bib Fortuna to gain entrance to the Hutt's throne room. However, the Hutt crimelord was much less susceptible to the Jedi's influence. He was immune to mind tricks and refused to release Luke's friends. When Skywalker attempted to eliminate the Hutt with an appropriated blaster, Jabba pressed a button dropping him into the rancor pit. After evading the rancor, Skywalker threw a skull at the gate-control switch, dropping the heavy gate and impaling the rancor through the neck. Furious, Jabba ordered Skywalker, Solo and Chewbacca to be brought before him. There he sentenced them to death by being fed to the sarlacc. Solo, upon initially hearing of them being executed immediately, initially retorted that he \"hated long waits\", although he soon changed his mind upon learning the exact nature of the planned execution."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The three prisoners were taken to the Great Pit of Carkoon on a desert skiff, while Jabba and his guests watched from the Khetanna, Jabba's personal luxury sail barge. On board the skiff, Luke offered Jabba one final chance to release him and his friends, or die as a result of his refusal. Skywalker was then forced to jump, but he twisted as he fell and caught the end of the plank, using it to catapult back up onto the skiff. Unknown to anyone but Skywalker himself, R2-D2 was concealing Luke's newly constructed lightsaber. Having made his way to the deck of Jabba's sail barge, Artoo launched the lightsaber into the air and into his master's waiting hand. As the stunned guards prepared to defend themselves, Luke slashed through them, knocking them over the edge into the pit and the sarlacc's maw. Boba Fett, looking to kill the Jedi, rocketed from the barge to the skiff. As Fett raised his EE-3 carbine rifle, the Jedi cut the weapon in half. When Luke became distracted, Fett tied him with a fibercord whip, but the Jedi was able to free himself, knocking Fett to the ground in the process."}, {"tag": "p", "text": "He then leaped onto the second skiff and began deflecting blaster fire. Taking advantage of this, Fett prepared to shoot him. With Fett now focused on Skywalker, Solo, half-blind due to hibernation sickness from being frozen in Carbonite, inadvertently swung a vibro-ax into Fett's jetpack, having panicked when he learned from Chewbacca that Fett was behind him. Solo's actions caused Fett's jetpack to misfire, slamming Fett into the side of the sail barge, causing him to roll into the sarlacc's mouth and upon swallowing him, the sarlacc let out a massive belch."}, {"tag": "p", "text": "Lando Calrissian, disguised as the guard Tamtel Skreej, helped defeat some of the guards on the skiff. During the struggle he was knocked into the Pit of Carkoon. Han and Chewbacca tried to rescue their friend by lowering a vibro-ax, but the sarlacc grabbed Lando's leg and began slowly dragging him in. Han was able to free Lando and pull him to safety by wounding the beast with a blaster shot, due to his eyesight returning in the nick of time, forcing it to release him."}, {"tag": "p", "text": "Noticing that the skiffs were taking heavy fire from the deck-mounted blasters on Khetanna, Skywalker leaped onto the barge, scaled his way up the side to the upper deck. There he battled Jabba's henchmen, knocking many overboard into the pit. He also quickly dispatched the guard manning the heavy cannon."}, {"tag": "p", "text": "The Rebels were assisted by some of Jabba's traitorous henchmen, such as Ree-Yees, a Gran who did not prevent Leia Organa from strangling Jabba to death. Though not a rebel sympathizer, Hermi Odle also unknowingly provided aid when he took advantage of the chaos and shot his rival, Pote Snitkin."}, {"tag": "p", "text": "As a battle raged outside, Organa used the chaos to cut power inside, closing the side viewports and throwing the interior into darkness. In the confusion she threw her chain around Jabba's body, and using all her strength, choked him to death. With the help of R2-D2, she was released from her chains, Salacious started to rip out Threepio's wires from the droid's photoreceptors and Artoo shocked Salacious away from Threepio the droids then hurried to join Skywalker on the deck, followed by Artoo and Threepio. Skywalker told Organa to aim the cannon at the deck of the barge, at which point Taym Dren-garen shot his right hand, exposing his mechanical limb, but the Jedi quickly recovered and continued to prevent any guards from reaching the cannon. R2-D2 pushed C-3PO from the barge and both droids landed getting partially buried in the sand. Skywalker swung with Organa from the barge to the skiff just as he kick-started the blaster cannon. After picking up the droids, Calrissian piloted the remaining skiff with all the rebels aboard safely away from the ensuing explosion of Khetanna."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Boba Fett managed to escape from the pit days later, thanks to his Mandalorian armor and iron will. He was found by a fellow bounty hunter, Dengar, and Kateel of Kuhlvult who nursed him back to health. Kuat of Kuat, the leader of Kuat Drive Yards,  then arranged a bombing run on the Great Pit of Carkoon to ensure the death of Boba Fett but the bounty hunter managed to escape."}, {"tag": "p", "text": "The death of Jabba canceled the debts of many individuals, and as such, Luke was held with considerable favor for removing that dangerous complication in their lives. This resulted in the permanent desolation of the Hutt Cartel and the temporary desolation of Jabba Desilijic Tiure's criminal empire. In response to his son's death, Zorba the Hutt placed a bounty on Organa, which the Desilijic kajidic later extended to Solo, Chewbacca, and Skywalker. The bounty was not formally rescinded until Organa's election as Chief of State, as the Hutts did not wish to further antagonize the New Republic."}, {"tag": "p", "text": "Many beings who had been slaves of Jabba escaped, and started their lives over, such as Doallyn, the dancer Yarna d'al' Gargan, and the members of the Max Rebo Band."}, {"tag": "p", "text": "Skywalker and the rest of the Rebels would go on to fight in the Battle of Endor, where the Jedi would defeat Darth Vader and Emperor Palpatine would be killed. The Death Star II would be destroyed, giving the Rebel Alliance their biggest victory in the Galactic Civil War. However, one year later the criminal empire was resurrected by Jabba's father and nephew."}, {"tag": "p", "text": "In 44 ABY, after Jaina Solo, Leia's daughter, sensed a Hutt in the Old Town on Sakuub, Jagged Fel, her husband, briefly referenced Leia's killing of Jabba as an explanation of his slithering out of sight in the event that the Hutt knew who Jaina and Fel were."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of the Great Pit of Carkoon first appeared in the beginning of the 1983 film Star Wars: Episode VI Return of the Jedi, the final installment of the Star Wars original trilogy. Though popularly assumed that George Lucas thought up the battle, it was, in reality, the idea of writer and director Richard Marquand and Lawrence Kasdan. The fact was eventually revealed via transcripts of meetings from The Making of Return of the Jedi."}, {"tag": "p", "text": "Lawrence Kasdan was the one to suggest killing Jabba the Hutt during the battle, while George Lucas had the idea of having Leia Organa strangling him with her chain as an homage of Francis Ford Coppola's 1972 classic film The Godfather, mirroring the scene in which Luca Brasi gets garrotted to death by Virgil Sollozzo and his men."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}