{"url": "Tyneir_Renz", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Archaeologists", "Category:Humans", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Consulars", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Knights", "Category:Republic Army officers"], "nodes": [{"tag": "h1", "text": "Tyneir Renz"}, {"tag": "p", "text": "Tyneir Renz was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic in the final years of the Republic Classic era. A veteran of the Clone Wars, Jedi Renz survived the Great Jedi Purge and went on to become a member of the Rebel Alliance in the years leading up to the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native of the planet Jiaan, Tyneir Renz was discovered to be Force-sensitive at a young age and was sent to the Coruscant Jedi Temple for training in the ways of the Force and the light side. Studying at the Temple's academy, Renz went onto train one-on-one with a Jedi Master before passing his Trials of Knighthood and ascending to the rank of Jedi Knight. Pursuing independent studies as a Jedi Consular, Renz enjoyed the study of archaeology and anthropology as a researcher. Despite his loyalty and sense of duty to the Order, Renz violated the Jedi Code and the will of the Jedi High Council by marrying and fathering two children in secret; a son and a daughter named Padija Anjeri."}, {"tag": "p", "text": "When the Separatist Crisis between the Republic and the Confederacy of Independent Systems erupted into full-scale war, Renz reported to Coruscant and took up the rank of Colonel within the newly formed Grand Army of the Republic. Leading troops in battle, Renz confronted the leader of the Separatist Droid Army, General Grievous in battle on Parein II 4. Mounted on his wheel bike, Grievous conducted a full frontal assault against Renz and two other Jedi; Valin Draco and Sannen. While Sannen was killed and Draco left for dead, Renz managed to limp away from the battle defeated but still alive."}, {"tag": "p", "text": "When the Clone Wars ended abruptly with the dissolution of both the Republic and the Confederacy and the rise of the Galactic Empire, Renz managed to escape execution at the hands of the Grand Army, who had been ordered by the duplicitous Supreme Chancellor of the Republic to destroy all Jedi. The Chancellor, in fact the mysterious Dark Lord of the Sith Darth Sidious, had the Temple on Coruscant razed and all Jedi hunted to near extinction. Avoiding detection, Renz rendezvoused with his family on Jiaan briefly before fleeing an Imperial blockade. While he had hoped his family would be safe if they remained on Jiaan, the Empire invaded the world and Renz' family was killed in the fighting there, excluding his daughter who he managed to rescue. Sending his daughter Padija to live with her in-laws on Alderaan, the girl matured into an educated scholar, studying at the University of Alderaan the field in which her father excelled: archaeology."}, {"tag": "p", "text": "As opposition to the Empire's reign grew stronger, Renz joined the Rebel Alliance, a loose confederation that hoped to overthrow the Empire and return to democracy. On a mission as a field operative for the Alliance, the Force reunited father and daughter who eventually went on to journey the galaxy in search of relics stolen by the Imperials. Carrying a concealed lightsaber he had crafted before the Clone Wars, Renz protected his daughter as much as he could so as to spare the two any more time apart. On a mission to recover a pair of crystallite skulls for the Nercathi Twi'lek clan, the pair managed to garner support for the Alliance in thanks for recovering the artifacts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyneir Renz was considered by Abel G. Peña to use as Jerec's Jedi Master, but ultimately he went with Jocasta Nu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}