{"url": "Tyffix", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gand", "Category:Jedi Generals", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Tyffix"}, {"tag": "p", "text": "Tyffix was a Gand male Jedi Master who served the Jedi Order during the Clone Wars. In 21 BBY, Tyffix and his Padawan, Cal, were dispatched to lead a Republic clone trooper force on the planet Thustra when the world's populace attempted to secede from the Republic. Shortly after arriving on the planet, the Republic forces were attacked by the native Sephi, and Tyffix and his Padawan were killed when a suicide bomber destroyed the Republic command center."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Gand male, Tyffix was a member of the Jedi Order who held the rank of Jedi Master during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Forced to wear a breath mask in order to survive in an oxygen-rich atmosphere, Tyffix selected the young Human Cal as his Padawan, training the youth to think like a warrior."}, {"tag": "p", "text": "In 21 BBY, Tyffix and his Padawan were part of a Republic task force sent to the planet Thustra when the native Sephi population wanted to secede from the Republic. What was originally planned to be a show of force soon turned into a bloody battle, in which Sephi suicide bombers inflicted heavy casualties on the Republic troops. While discussing strategy with fellow Jedi Master Tyr and a clone officer inside the Republic command center, Tyffix himself became a victim of the Sephi tactics when a suicide bomber destroyed the command tent, killing all present except Tyr's Padawan, Pix, whom her Master had Force-pushed out of the tent before the explosion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tyffix taught his Padawan that thinking like a warrior and a conqueror would be the only way to survive the Clone Wars, a lesson Cal took to heart but one that ultimately led to the Padawan's death later during the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyffix appeared in Jedi: Yoda, the fifth and final issue of the Star Wars: Jedi comic series, which was released on July 21, 2004. Jedi: Yoda was written by Jeremy Barlow and illustrated by HOON. In 2008, Tyffix was mentioned in his Padawan's entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}