{"url": "Tynna/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Terrestrial planets", "Category:Tynna locations", "Category:Tynna sector planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Tynna"}, {"tag": "p", "text": "Tynna was a planet located within the Tynnani system of the Expansion Region and the home to the Tynnan species."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Tynna was situated on the Shipwrights' Trace in the Tynna sector of the Expansion Region of the galaxy. It was a frigid planet that featured lakes and forests. A key business partner of the Corporate Sector, it was a wealthy, state-run world whose inhabitants were not required to work."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The pristine world was part of the Galactic Republic until a stone mite infestation 22 BBY prompted it to secede shortly before the onset of the Clone Wars. While Tynna seceded and joined the Confederacy of Independent Systems, they returned to the Republic prior to the end of the war with Senator Streamdrinker serving in the Galactic Senate until his arrest after the Declaration of a New Order in 19 BBY."}, {"tag": "p", "text": "During the Imperial Period, it was the site of the failed Invasion of Tynna."}, {"tag": "p", "text": "During the early Galactic Civil War, the Rebel Alliance considered basing themselves on Tynna, but chose Yavin 4 instead. The world was a New Republic stronghold during the Zsinj and Thrawn campaigns. During the Yuuzhan Vong War, Tynna was conquered by the hostile race, who bio-engineered the planet's extensive seas for their own purposes. Remaining under Yuuzhan Vong control until the end of the war in 29 ABY, Tynna was situated in Galactic Alliance space during the Second Galactic Civil War, and was a member state of Darth Krayt's Galactic Empire as of 137 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}