{"url": "Tyionsis_Cex", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Males", "Category:Srrors'tok"], "nodes": [{"tag": "h1", "text": "Tyionsis Cex"}, {"tag": "p", "text": "Tyionsis Cex was a Srrors'tok bounty hunter who served the Galactic Empire during the height of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An inhabitant of Sellasas, Cex watched as his entire family was wiped out over the course of a seven-week siege laid by a Rebel strike force in an effort to eliminate all Imperial presence on the planet. Cex and his family of merchants had previously been unconcerned with politics, but the deaths of his family members caused the Srrors'tok to take up arms against the Rebels. The last male of his line, Cex found himself fighting on the side of the Imperials during the Rebels' final assault on the army garrison and was severely wounded. If not for the compassion of Commander Amara Jedselk, second-in-command of the garrison and daughter of the planetary governor, the Srrors'tok would have died. Despite being wounded repeatedly herself, she managed to save Cex's life and together, the two managed to evade capture for several days. Within a week of completing their final assault on the garrison, the Rebel strike team withdrew from the planet. Three days later, a navy relief force arrived under the command of Admiral Kedler."}, {"tag": "p", "text": "While the two recovered from their wounds, the Srrors'tok was \"adopted\" by Amara, who gave him his name. Cex developed great affection for Amara over the course of his recovery. It was during this time that Cex met Amara's father, the newly-promoted governor of Dolla. Cex made it clear that he owed Amara a life debt, and was honor-bound to repay it. Though Amara was eventually reassigned, Governor Jedselk did not let opportunity pass him by. Capitalizing on Cex's feelings of affection toward his daughter, the life debt he owed her, as well as the Srror'tok's hatred for the Rebels, Governor Jedselk offered his patronage in exchange for Cex's service as an Imperial bounty hunter. Cex readily accepted, seeing each acquisition as both a personal fulfillment and a repayment of immeasurable debt. As governor of Dolla, Jedselk used his influence to smooth over any local unrest caused by Cex's actions while pursuing bounties. Jedselk considered the bounty hunter a great asset, and if necessary, would have sent an armed relief force to his aid, despite the shame such a rescue would cause Cex. In the first two years of his career as a bounty hunter, Cex successfully brought in eighty-three separate acquisitions; seventy-five of these were brought back alive."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cex was a proud Srror'tok warrior who delighted in hunting down enemies of the Empire, and was bent on avenging the deaths of his family. The bounty hunter did not stand to be insulted in any way; his response to such insults was often a deadly one. In addition to his tracking skills, Cex also developed the ability to throw his voice, a skill that he often used to trick opponents into thinking that there were one or more Srror'toks in the vicinity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}