{"url": "Ty_Yorrick", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Force-Sensitive Outcasts", "Category:Former Jedi", "Category:Jedi trainees of the Jedi Order", "Category:LGBTQ+ individuals", "Category:Tholothians"], "nodes": [{"tag": "h1", "text": "Ty Yorrick"}, {"tag": "p", "text": "Ty Yorrick was a female Tholothian Force-sensitive monster hunter and saber-for-hire who lived during the High Republic Era. A former Jedi Padawan, Yorrick departed the Jedi Order and came to work as a mercenary, being part of a band led by Caratoo for a time. She crossed paths with the Jedi again when she came to the Republic Fair on Valo while working as a bodyguard for Mantessa and Klerin Chekkat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ty Yorrick was a Force-sensitive Tholothian who lived during the High Republic Era. As a child, she was inducted into the Jedi Order, eventually becoming a Padawan. During her time as an apprentice, she was taught how to construct her lightsaber by the Azumel Jedi Master Cibaba, and also befriended a fellow Padawan, Klias Teradine. However, Yorrick eventually left the Jedi after an incident with Teradine at the Yallow Shrine."}, {"tag": "p", "text": "Yorrick eventually went into mercenary work, joining a band led by the Kerk Caratoo, whom she eventually killed after a betrayal. She spent almost a decade working as a monster hunter, becoming known as the \"Saber for Hire\" as well. At some point, a Weequay cut off one of her head-tendrils with a knife."}, {"tag": "p", "text": "In 232 BBY, the Drengir, a species of sentient carnivorous plants which hungered for the meat of other beings, were awakened from a long slumber. Yorrick initially disbelieved the reports and laughed them off. However, during a hunt on Galidraan for a batarikan snake, she learned otherwise when she found her quarry infested by a root system. The discovery that many of the locals had also been killed by the Drengir meant she also did not get paid for the job, something her droid KL-03 lamented."}, {"tag": "p", "text": "Three months before the Valo Republic Fair was to be held, Yorrick was involved in a mission on Blarrum which brought her closer to encountering the Jedi than she had in quite some time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ty Yorrick was a female Tholothian with dark skin and silver head-tendrils. Due to the trauma of how she had left the Jedi, she avoided members of the Order and disliked talking about what had happened. She was once extremely superstitious, relying on Verazeen stones to make every decision. Yorrick could also be quite skeptical, reacting to initial reports of the emergence of the Drengir with derision at the thought of \"plant monsters\" running about."}, {"tag": "p", "text": "When Yorrick realized that Klerin Chekkat appeared to have a crush on her, she would have considered exploring a possible connection if the timing was different, but Chekkat being the daughter of her unpredictable client made it unwise. Nevertheless, she flirted with Chekkat in an attempt to solicit more information about the job. When she later shared through the Force Elzar Mann's intimate memories of Avar Kriss, she felt attraction and teased Mann by clarifying that it was not towards him as he was not her type."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ty Yorrick was experienced in the use of her Force powers, particularly telekinesis, mind tricks, and lightsaber combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ty Yorrick owned a purple-bladed lightsaber, a starship which she refused to name, and two droids: the admin unit KL-03 and the astromech droid R0-VR. She wore blue clothing and a golden headdress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Ty Yorrick was created for Cavan Scott's novel The High Republic: The Rising Storm. After the release of the novel's title and cover, Scott confirmed on Twitter that the female Tholothian on the book's cover was indeed Yorrick."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}