{"url": "Tyrann", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Military personnel", "Category:Planetary leaders", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Tyrann"}, {"tag": "p", "text": "Tyrann was a male Human living on Ophideraan during the Galactic Civil War. He was the Supreme Master of the Serpent Masters, ruling from the Great Well. He was an imposing man with a short beard and commonly wore a white cloak and headwrap. He wore a medallion around his neck that hid a special transmitter used to control the flying serpents."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tyrann commanded not only the Serpent Masters but a workforce of slaves, whom he put to work in the lower level of the Great Well, extracting water from the planet's mantle. When Luke Skywalker and Tanith Shire crash-landed on Ophideraan, Tyrann's warriors brought them before the Supreme Master, who ordered Luke's execution. However, Tanith, currently in Tyrann's employ, was able to convince Tyrann otherwise, and both were sent down to the lower level. There, Luke discovered the serpents' homeground, but Tyrann and his aide, Varn, followed and confronted him. Tyrann forced Luke to attempt to ride one of the serpents, as he had done with previous infiltrators. Varn hoped Luke, unable to control the serpent, would fall onto the rocks of the cavern, as others had, but Tyrann still wanted to keep Luke alive to serve as his slave."}, {"tag": "p", "text": "This proved to be a mistake on Tyrann's part, since Luke was able to learn how Tyrann controlled his serpents, and had R2-D2 duplicate the code, allowing Luke to gain control. Realizing this, Tyrann held Tanith hostage, and ordered Varn to kill Luke. However, Skywalker proved to be a match for Tyrann's aide, and during the fight realized Tyrann's medallion was the source of the transmissions. Luke swooped down to Tyrann on his serpent, and used his lightsaber to cut the medallion from around the Supreme Master's neck. Lunging desperately to catch his medallion, Tyrann toppled over the edge of the platform and plunged to his death in the Great Well. The medallion was also destroyed, and the Serpent Masters lost all control of their beasts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}