{"url": "Tyrant", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Imperial II-class Star Destroyers of the Galactic Empire", "Category:Starships of Death Squadron"], "nodes": [{"tag": "h1", "text": "Tyrant"}, {"tag": "p", "text": "The Tyrant was an Imperial II-class Star Destroyer in the Imperial Navy. Under the command of Captain Lennox, it served as part of Darth Vader's personal fleet, Death Squadron. In 3 ABY, along with the rest of the fleet, it took part in the Battle of Hoth, where the Empire assaulted the Rebel Alliance's secret base on the ice planet Hoth."}, {"tag": "p", "text": "The rebels had installed a powerful deflector shield to protect their base, so the five Imperial Star Destroyers of Death Squadron, including the Tyrant, blockaded the planet to stop Alliance forces from escaping the Imperial ground assault. As such, the Tyrant tried to intercept the first rebel transport attempting to flee Hoth; however, the Star Destroyer was disabled by the rebels' v-150 ion cannon and left to drift into deep space while the rebel ship escaped."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Imperial II-class Star Destroyer, the 1,600-meter-long Tyrant was armed with eight octuple turbolaser barbettes (four port, four starboard), ten heavy tractor beam emitters, and missile launchers. It was additionally equipped with a conning tower, a communications tower, a solar ionization reactor, two deflector shield generator domes, and a hangar bay. The Tyrant was propelled by three destroyer-I ion engines, four emergency-use gemon-4 ion engines, and a hyperdrive."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Serving Death Squadron"}, {"tag": "p", "text": "In 3 ABY, during the Galactic Civil War, the Tyrant was part of the Imperial Navy and commanded by Captain Lennox. It was one of the five Imperial-class Star Destroyers in Death Squadron, a mobile Imperial fleet commanded by the Dark Lord of the Sith Darth Vader from his flagship, the Super Star Destroyer Executor."}, {"tag": "p", "text": "At that time, Death Squadron was searching for the Rebel Alliance's secret base, as part of an Imperial operation known as Project Swarm. When a probe droid discovered the rebel base on the ice planet Hoth, Vader and the fleet's admiral, Kendal Ozzel, led Death Squadron, including the Tyrant, to the Hoth system to wipe out the Rebellion. However, Ozzel had his ships drop out of hyperspace too close to the system, alerting the rebels to the Imperial presence and allowing them to deploy a powerful deflector shield over their base, protecting it from orbital bombardment."}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "Due to the rebels' shield, Death Squadron was forced to deploy a ground assault, with its capital ships, such as the Tyrant, forming a blockade to prevent the rebels from escaping. However, the Alliance nonetheless began its evacuation, starting with the GR-75 medium transport Quantum Storm, escorted by two T-65B X-wing starfighters. The Tyrant moved into the path of the transports, and Lieutenant Cabbel, a controller on the Star Destroyer's bridge, alerted Lennox of the situation while the captain observed Hoth through the bridge's viewports."}, {"tag": "p", "text": "Lennox consequently expressed his pleasure at the opportunity to capture the first rebel ships of the day. The Tyrant's shields were then lowered and its tractor beam readied. However, just as the tractor beam had locked onto the enemy transport, the rebels' v-150 Planet Defender ion cannon on Hoth, which was commanded by the base's chief communications officer, Toryn Farr, fired several shots at the unshielded Tyrant. The Empire had not known the rebels possessed such heavy ordinance, and so the blockade was unprepared for such an assault. In the attack, the Tyrant's shipboard electronics were scrambled, its missile launchers and conning tower were destroyed, and several explosions spread across its hull."}, {"tag": "p", "text": "The ion shots caused the Tyrant to veer, then spin out of control, careering into deep space. This allowed the first rebel evacuation group to escape the system through hyperspace. Although the Empire ultimately claimed victory in the Battle of Hoth, destroying the rebels' base as intended, much of the Alliance forces escaped through Death Squadron's blockade to a rendezvous point. Lennox avoided summary execution after the battle, but later perished during the Battle of Endor in 4 ABY, where an Imperial fleet unsuccessfully attempted to defend the second Death Star from rebel attack."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Tyrant was under the command of Captain Lennox during the Battle of Hoth. Lennox was pleased at the prospect of capturing the first rebel ships of the battle. Under Lennox was Lieutenant Cabbel, who served as a controller on the Tyrant's bridge. Other technicians were also present on the ship's bridge during the Battle of Hoth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Notable appearances"}, {"tag": "p", "text": "The Tyrant first appeared in the May 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. The Star Destroyer was not identified in the film but received the name Tyrant as part of the new Star Wars canon in the application Star Wars: Card Trader, originally released in 2015."}, {"tag": "p", "text": "In the Star Wars Legends continuity, the Tyrant first appeared in the April 1980 The Empire Strikes Back novelization by Donald F. Glut, and its name was introduced in the Star Wars Customizable Card Game's Hoth Limited expansion, released in 1996."}, {"tag": "h3", "text": "Model inconsistencies"}, {"tag": "p", "text": "The model used to depict the Tyrant in The Empire Strikes Back is not consistent between shots. In the Star Destroyer's establishing shot, it has three small flaps lining the edge of each primary engine, whereas a later shot depicts it with engines lacking these flaps."}, {"tag": "p", "text": "The model first used to depict the Tyrant, the one with engine flaps, correlates with the ninety-one-centimeter-long Star Destroyer model used in The Empire Strikes Back, which was repurposed from its original use in Star Wars: Episode IV A New Hope. Conversely, later appearances of the ship in the film correlate to the more detailed, 259-centimeter-long Star Destroyer model built specifically for The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}