{"url": "Type_II_Orbital_Repair_Yard", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Kuat Drive Yards products", "Category:Shipyards", "Category:Type II Orbital Repair Yards"], "nodes": [{"tag": "h1", "text": "Type II Orbital Repair Yard"}, {"tag": "p", "text": "The Kuat Drive Yards Type II Orbital Repair Yard, also known as a Type II Orbital Yard, a Type II Orbiting Repair Yard, or a type two shipyard, was a class of space station designed to build and repair Imperial warships."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Type II design was a square-sided structure, 1,200 meters from side to side and, like most Imperial dock designs, its work bays could be adjusted and rearranged to accommodate capital ships of varying sizes and designs, although it usually retained its basic box-shaped configuration. It was designed with 9 tractor beams, and in one configuration, it contained nine bays."}, {"tag": "p", "text": "Like all orbital repair yards, the Type II design was designed not merely to repair ships, but also to construct them, being equipped to build ships from light cruisers upwards. Even in its nine-bay configuration, a Type II could be described as being \"full of Star Destroyers\"."}, {"tag": "p", "text": "A Type II had a standard crew of 4,114, and could accommodate 200 troops, typically a defending company of Imperial Stormtroopers. This garrison, along with powerful shields and armor, compensated for the fact that these stations lacked any real defensive armament. A Class 4 hyperdrive permitted the station to relocate across long distances, although for sublight maneuvers, it required a cargo tug."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Type II was one of a number of orbital yard types used throughout the Empire, to support and sometimes replace the deepdocks that were the primary shipyards of each Sector Fleet. Whereas deepdocks had a heavy Fleet Support Branch presence, repair and construction in orbital yards was usually carried out by non-military contractors, often making use of local slave labor."}, {"tag": "p", "text": "The Type II design continued to be important to the Galactic Empire throughout the Galactic Civil War. As well as its stormtrooper garrison, each yard was paired with a navy flotilla for protection, although after Imperial losses in the final years of the conflict, the New Republic believed that there were no longer enough ships available to provide such dedicated protection."}, {"tag": "p", "text": "Perhaps the most famous Type II yards were those of Black Sword Command. Almost all of the shipyards assigned to this important Imperial fleet were Type II designs, with Black Nine being a typical example, although the main Black Fifteen shipyard at N'zoth was much larger. At least eight of the Black Sword shipyards disappeared during the confusion of the Imperial withdrawal from the Koornacht Cluster in 5 ABY, with at least three of them being captured by the Yevethans, who used them to construct the Star Destroyer fleet that they unleashed in the Black Fleet Crisis of 16-17 ABY."}, {"tag": "p", "text": "The New Republic placed an emphasis on locating and destroying the Yevethan-controlled shipyards, leading to engagements like the Battle of ILC-905, where ships from Task Force Aster found and destroyed Black Nine and its three defending thrustships above Prildaz. Even so, five of the Type IIs from Black Sword Command remained unaccounted for even after the resolution of the Yevethan conflict, and their absence was a source of some concern to the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"type two shipyard\" designation was first used in Tyrant's Test, when Black Nine was discovered during the Battle of ILC-905. Black Nine is described in dialogue as being \"full of Star Destroyers\", and it shares a nine-bay configuration with the large Black Fifteen shipyard seen at N'zoth in Before the Storm."}, {"tag": "p", "text": "However, Cracken's Threat Dossier gives the Type II Orbital Yard its canonical size of 1.2km, and also describes it as \"cubical\", implying that its docks are arranged into a three-dimensional box, rather than a flat grid. These details mean that Black Fifteen, a flat-grid facility capable of holding an Imperial-class ship, a Victory-class Star Destroyer, a moored Super Star Destroyer and six other warships simultaneously, cannot be identified as a Type II shipyard, and that the majority of Black Sword Command's shipyards were much smaller."}, {"tag": "p", "text": "The article which defines the Type II is, however, accompanied by an illustration of a large, flat-grid dock containing ships that resemble a Super Star Destroyer and an interdictor, both of which may be multiple-kilometer vessels; but as the broad subject of the article is orbital yards in general, this illustration need not represent a Type II facility, and there is no reliable way to scale the ships shown in it, or to identify what class they really are."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}