{"url": "Type_07034", "categories": ["Category:Legends articles", "Category:Industrial facilities"], "nodes": [{"tag": "h1", "text": "Type 07034"}, {"tag": "p", "text": "The Type 07034 was a medium-sized self-contained processing plant built by Rendeel Industries. It had several modules and was designed to take in food and process it for shipping and distribution. The plant was designed to withstand the pressure from extreme depths. It had a large sphere that served as the main plant, with smaller globes that were used for storage, support, and habitation. Quekka Trench Station and Shelf Station 43 were Type 07034s."}, {"tag": "h2", "text": "Configuration"}, {"tag": "h3", "text": "Main plant"}, {"tag": "p", "text": "The main plant was a large sphere that held all the machinery necessary to prepare the fish that were delivered to the plant. It was divided into several different rooms that handled a specific step in the process. There were rooms for preparing, processing and cooking, and packaging for shipment. The main plant also had six docking stations connected to it that were separated to prevent collisions. Two were used by the deep-sea harvesters that delivered the raw product, two were used by cargo haulers that would take finished goods to the surface for shipping, and the final two smaller docks that were used for resupply."}, {"tag": "h3", "text": "Storage pod"}, {"tag": "p", "text": "The storage pod was smaller than the main plant and held all the needed supplies for daily operations. This included fresh water tanks, consumables, and other supplies."}, {"tag": "h3", "text": "Habitation pod"}, {"tag": "p", "text": "The habitation pod was where the crew lived. It had the living quarters, recreational facilities, dining room and a med bay staffed by a 2-1B surgical droid. The pod also contained the plant management center, which was the main control center for the whole plant."}, {"tag": "h3", "text": "Support pod"}, {"tag": "p", "text": "The support pod housed the primary and backup generators, along with air and water recyclers."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}