{"url": "Battle_of_the_Kaliida_Nebula", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Battle stubs", "Category:Battles in the Prindaar system", "Category:Battles of the Clone Wars", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle of the Kaliida Nebula"}, {"tag": "p", "text": "The Battle of the Kaliida Nebula took place near the Kaliida Nebula during the Clone Wars. The battle was famous for being the destruction of the current flagship of Separatist General Grievous, the Malevolence. The ship had been destroying Republic fleets throughout the Outer Rim due to it's Ion cannon, which could disable an entire Venator-class Star Destroyer in a single blast. The battle was lead by General Anakin Skywalker, who lead a squad of BTL-B Y-wing starfighter/bombers, after suffering heavy losses, the squad moved from attacking the bridge, to attacking the ion cannon it's self. The squad launched it's torpedoes, which resulted in the ship suffering heavy damage. After this three Venator-class Star Destroyers arrived to help finish the job."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the first year of the Clone Wars,[source?] General Grievous commanded the secret weapon of Confederacy of Independent Systems, the Malevolence, a Subjugator-class heavy cruiser, was a starship armed with two mega-ion cannons that, when fired, could disable all functions of entire fleets, leaving the ships without power for shields, weapons or starfighters, rendering it completely defenseless to a barrage of cannon fire from the Malevolence. It was later dubbed the \"Mystery Weapon\" by the Galactic Republic as a result of it appearing without warning, destroying Republic fleets and killing any living witnesses who used escape pods to escape, thus becoming a mysterious weapon. One such fleet that was destroyed was the fleet commanded by Jedi Master Plo Koon, which met its end at the hands of Grievous during a brief incursion in the Abregado system. However, the Malevolence and its ion cannons were finally discovered by the Galactic Republic after Plo Koon survived the battle with the help of Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano, who both left for the Abregado system against the Jedi Council's orders and managed to find and rescue their fellow Jedi, and reported the existence of the Malevolence to the Council."}, {"tag": "p", "text": "After being discovered by the Galactic Republic and destroying a convoy of medical frigates escorted by a lone Venator-class Star Destroyer near Naboo, the Separatist Head of State Count Dooku gave Grievous the Malevolence's next target, the Republic's secret medical station near the Kaliida Nebula, which more than sixty-thousand wounded clone troopers were being tended to by the Kaminoan doctor Nala Se. Dooku ordered his faithful general to destroy the station, knowing that if the station was destroyed, the war would turn in favor of the Separatists. Catching wind of the Separatist ambush in the Ryndellia system, Jedi Generals Plo Koon, Anakin Skywalker and Skywalker's Padawan Ahsoka Tano remembered that their medical station was located within the system, as well, and had suspicions that Grievous would launch an attack on it, and the three Jedi left for the medical station immediately with a squadron of Y-wing bombers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}