{"url": "Tyss", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Individuals of unspecified gender", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Tyss"}, {"tag": "p", "text": "Tyss was one of three Rodian thugs in the employ of the Hutt Space-based Rodian assassin Torani Kulda. Tyss and Kulda's other thugs were eventually brought by Kulda to participate in a potentially deadly competition known as a Granee Noopa."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tyss was, along with Fondo and Plaado, one of three thugs who worked for Torani Kulda, a Hutt Space-based assassin. During the era of the Galactic Empire, Tyss, Fondo, and Plaado were brought by Kulda to a Granee Noopa in Wheeta Palace on Nal Hutta, the adopted homeworld of the Hutt species. The Granee Noopa was a potentially deadly competition between three separate groups, including Kulda's and one led by a disgraced noble named Shalo Sherin."}, {"tag": "p", "text": "Tyss was present in the palace's foyer when the event’s attendees were given a chance to meat and assess one other. After the introductions were completed, the attendees were taken to a bar and served drinks, half of which had been poisoned poisoned. The three Hutt representatives at the Granee Noopa—known as boddahs—were each given the identities of one-third of the poisoned drinks, and were allowed to share it with their respective parties, information that the attending groups could choose whether or not to share with one another. Each of the attendees was required to take a drink, which they then used to toast their rivals."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tyss was a member of the reptilian Rodian species. Tyss's appearance was extremely similar to that of other thugs in Kulda's employ, and all three felt a powerful loyalty to her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tyss, Fondo, and Plaado all wore heavy leather jackets and used a low-slung holster to store weapons, including a blaster pistol. Tyss also possessed a combat knife, the blade of which Tyss touched in a threatening manner whenever possible"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyss was introduced in the 2015 Star Wars Roleplaying sourcebook Lords of Nal Hutta,  a part of the Star Wars: Edge of the Empire roleplaying game system published by Fantasy Flight Games. In the book, Tyss is listed as a non-player character in the \"Rubbing Slimy Elbows\" modular encounter."}, {"tag": "p", "text": "Lords of Nal Hutta suggests that during certain parts of the encounter the game-master player should cinematically describe the actions—and their consequences—of non-player characters that do not directly affect the player-characters, as opposed to rolling dice to individually determine whether each of them manages to overcome the challenges of the competition. During the third stage of the encounter's Granee Noopa event, known as the Dinner, the number of opponents faced by the participants depends on the number of the latter, which may include Tyss if the character has survived both the toasting scene and the second stage, the Dance."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}