{"url": "Tyvarex", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic starships", "Category:EF76 Nebulon-B escort frigates"], "nodes": [{"tag": "h1", "text": "Tyvarex"}, {"tag": "p", "text": "The Tyvarex was an EF76 Nebulon-B escort frigate that served in the navy of the Rebel Alliance during the Galactic Civil War. Following the scattering of the fleet after the Battle of Hoth, the Tyvarex was a part of the Fourth Division, which grouped at Rendezvous Point Delta-Three in the Mid Rim. However, the Galactic Empire used cracked rebel codes to track communications between the Fourth Division and another cell, and launched an attack on the Fourth Division. Blockaded against a star by the forces of Commander Ellian Zahra, the Tyvarex was unable to escape, and was destroyed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An EF76 Nebulon-B escort frigate, the Tyvarex was equipped with engines and a system of deflector shielding. The frigate also possessed a life support system and a number of escape pods."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Tyvarex was in service to the Alliance to Restore the Republic's Alliance Fleet during the Galactic Civil War against the Galactic Empire. In 3 ABY, following the rebel escape from the Battle of Hoth, the fleet was split into a number of cells in order to prevent the Empire from tracking down the entire Rebellion. The Tyvarex was assigned to the Fourth Division, who regrouped at Rendezvous Point Delta-Three, next to a star in the Mid Rim."}, {"tag": "p", "text": "As planned, the Fourth Division made contact with another cell, the Eighth Division, in order to slowly rebuild the fleet. However, Imperial Commander Ellian Zahra had developed a signal analysis protocol, breaking the rebel codes and allowing the Empire to track down any cells that contacted one another. Zahra led an attack on the forces of the Fourth Division, using a cordon of turbolaser fire to pin the starships against the star. The Tyvarex sustained heavy damage, and the ship's commanding officers requested protection from starfighters while its crew evacuated. However, when the frigate's shields failed, the Imperial TIE fighters targeted the Tyvarex, destroying the vessel and killing the rebels aboard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Tyvarex appeared in Star Wars 1, a comic written by Charles Soule, illustrated by Jesús Saiz, and published by Marvel Comics on January 1, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}