{"url": "Tyzen_Xebec", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Tyzen Xebec"}, {"tag": "p", "text": "Tyzen Xebec was a male Zabrak Jedi Padawan during the waning years of the Galactic Republic. During the Clone Wars, Xebec was the apprentice of Rodian Jedi Master Bolla Ropal. Around 22 BBY, the Padawan was on the planet of Devaron with his master shortly before a battle began on the planet. While Ropal was with Devaronian ministers near the Republic's Temple of Eedit, Xebec remained with clone trooper Commander Ganch. After a surprise assault by bounty hunter Cad Bane, Xebec and the clones came under attack. After feeling the disappearance of his master, the Padawan ordered the clone troopers to destroy a nearby dam, which unleashed a flood of water, destroying the attacking battle droids."}, {"tag": "p", "text": "After returning to the Jedi Temple on Coruscant, Jedi Master Mace Windu entered the Padawan's quarters and tried to comfort him. He revealed that the search for Cad Bane continued, although Xebec did not respond to him. The Padawan soon walked down the halls of the Jedi Temple, only to be stopped by fellow Padawan, Ahsoka Tano. Tano commented on the loss of Ropal to Xebec, and the Zabrak knew that her master, Jedi Knight Anakin Skywalker, and herself found Ropal's body. However, their conversation turned into an emotional one for Xebec, and soon he walked away from Tano."}, {"tag": "p", "text": "Tyzen was then assigned to Jedi Master Keelyvine Reus and sent to the agriworld of Ukio to ensure that its defenses were strong enough to withstand a Confederate assault. On Ukio, he met an AgriCorps worker named Sanya, who had been assisting with the Ukian harvest. Soon, modified seismic tanks were dropped into the atmosphere and deployed a cloud of black soil which blocked out the sun."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Devaron"}, {"tag": "p", "text": "Tyzen Xebec was a male Zabrak Jedi Padawan assigned to the Rodian Jedi Master Bolla Ropal during the Clone Wars. Around 22 BBY, Xebec accompanied his master to the planet of Devaron. While on Devaron, Ropal discussed the Republic's new Temple of Eedit on the planet with Devaronian ministers. Xebec separated from his master, and joined clone trooper Commander Ganch near the Republic's outpost. The Padawan conferred about their action-less duty, although the clone trooper commander felt it was best to serve the Republic. However, their conversation was cut short when a clone trooper warned Ganch of a surprise Confederate attack."}, {"tag": "p", "text": "The Republic outpost soon went on \"red alert,\" which caused panic. As droid landing craft descended around the Republic force, Xebec called out to Ropal and asked him of his whereabouts. However, the Jedi Master ordered his Padawan to stay clear of the valley. While both Ropal and Xebec were under attack by the battle droid forces, the Zabrak Padawan continued to deflect most of the blaster fire his with lightsaber. Soon, Aurra Sing and her Nashtah Team targeted Tyzen and the clones. They destroyed a LAAT/i gunship on top of an anti-water wall called a \"brace,\" which then plummeted onto Tyzen and the clones below, causing many clone trooper casualties. The resulting explosion made Xebec to feel lightheaded for a brief time, but Ganch pulled him to safety. After regaining consciousnesses, the recovered Xebec saw a struggling Ganch, who was protecting him from the oncoming droid blaster fire. The clone trooper commander told the Padawan that they were \"pinned,\" and whoever destroyed their gunship was near a ridge by the outpost. Xebec suggested the use of rockets, although Ganch told him that they went down with the transport."}, {"tag": "p", "text": "Soon, Xebec felt the disappearance of his master. After crying out his name, Ganch immediately wanted to know what the Padawan felt. Xebec revealed Ropal was taken by the Confederate invasion force, and that he was also their primary target. However, Ganch warned Xebec that the leftover battle droids were closing in on them. After the Padawan ordered Ganch and the clones to destroy the anti-water brace, the clone troopers shot down the wall, which released the pent-up water. Sing and her droids, along with Tyzen and his clones, were all washed from the valley, ending the fight. After securing the outpost, Ganch joined Tyzen, who sat overlooking the flooded valley. Xebec lamented that Ropal would never see all the hard work they had done in the valley, for the future of the Devaronians. Three LAAT/i gunships approached the two, and were delivered back to Coruscant."}, {"tag": "h3", "text": "Returning to Coruscant"}, {"tag": "p", "text": "After Xebec was safely extracted from Devaron, he returned to the Jedi Temple on Coruscant. As he continued to grieve for the loss of his master, Jedi Master Mace Windu entered the Padawan's quarters and informed Xebec of his master's death at the hands of Bane, and assured the Padawan that he would be reassigned when the time was right. Windu also urged Xebec to view his master's death as a service to the Republic, although the Padawan remained silent throughout and showed no emotion. Soon after, Xebec wandered through the halls of the Jedi Temple. Fellow Padawan learner, Ahsoka Tano, the apprentice of Jedi Knight Anakin Skywalker, attempted to relieve Xebec from his feelings. However, Xebec told Tano that she and her master found Ropal's body. Tano, who said that they \"couldn't hold onto Bane\" after Ropal's death, began to argue with Xebec. While Tano suggested that Ropal fought hard, Xebec knew that he didn't fight. The Zabrak Padawan became emotional and broke into tears before walking away from Tano. As he ventured away from Tano, Skywalker approached Tano and told her that \"he needed time for himself.\""}, {"tag": "h3", "text": "Battle of Ukio"}, {"tag": "p", "text": "Some time later, Tyzen was assigned to a new master, Keelyvine Reus. He was sent to one of the Venator-class Star Destroyers orbiting the planet Ukio. In the bay of a LAAT, Commander Ganch showed Tyzen how to assemble a blaster rifle, coaching him through a difficulty with aligning the adapter prongs. He expressed his congratulations to the Padawan, though was skeptical that Tyzen would ever need to know that particular skill. When Master Keelyvine Reus ordered Admiral Dron to contact Ganch and Tyzen, they were unable to reach the pair. After an officer came to find them, Ganch told him that he had turned off his communicator, under Tyzen's orders, as Tyzen said that he didn't want to be interrupted. As Tyzen left to attend the briefing, Ganch slipped and called Tyzen \"kid\", then corrected himself and called him \"sir\"."}, {"tag": "p", "text": "Tyzen was led to the communications room to attend the briefing. There, Master Obi-Wan Kenobi and Master Mace Windu briefed the group on the situation of Ukio. Ukio's citizens were divided after they seceded from the Republic early in the Clone Wars, but a personal entreaty from Master Yoda ensured their new allegiance to the Republic. Obi-Wan continued, saying that the Separatists would wish to burn the agriworld of Ukio, mostly because it was a pivotal food source to feed the growing clone army. It was decided that Tyzen would land on the planet to ensure that its defenses were as strong as promised."}, {"tag": "p", "text": "Tyzen soon left with Commander Ganch and a number of other clone troopers. Though Squawk and Tyzen both believed that they would be in for a quiet time on the planet, Ganch told them that the in-depth review of the planet's shields would keep them busy. When Tyzen told Ganch that he suspected to real reason he was sent to the planet was because Keelyvine didn't want him in her way, Ganch replied that a Jedi General wouldn't do things lightly, and that she had entrusted the entirety of the planet's security to him. After they landed and met with Liege, a leader of the Ukians, the man expressed doubt that someone as young as Tyzen could lead men like Ganch. Tyzen asked Ganch for his opinion, to which Ganch pointed out that Tyzen was actually older than him."}, {"tag": "p", "text": "Tyzen then demanded that he allow his troopers full access to his shield generator assembly so that they could see how he ran his defenses, to which Liege hesitantly agreed. Xebec decided that he would try to acquaint himself with some of the local workers. He approached two of them, one of whom was arguing against Ukio realigning itself with the Republic. He introduced himself to them, as well as Sanya, an AgriCorps worker who was assigned to help the Ukians with their crops. Tyzen thought Sanya was a Padawan like him, but when she told him she was in the AgriCorps, he called her a \"washout\". Furious, she informed him that there were more ways for a Jedi to help people than by leading an army."}, {"tag": "h4", "text": "Project Instinction"}, {"tag": "p", "text": "Their conversation was cut short, as modified seismic tanks were dropped into orbit above the planet, and began to release a black cloud which began to blot out the sun. As Sanya tried to keep the workers and animals calm, Xebec tried to reach Ganch, but their communications were being jammed by the CIS ship in orbit. Sanya then realized the purpose of the attack - to blot out the sun and destroy the Ukian harvest. The fleet above analyzed the black cloud and discovered it was soil from the planet Moorja, which would follow the sun's path and indeed destroy the crops. Soon, the decision was made by Liege, in conference with Reus and Captain Pharl McQuarrie, to drop the shields and let the soil fall harmlessly to Ukio's surface. As soon as the shields opened, however, Vulture droids and Sheathipede-class transport shuttles descended toward the planet, despite the attempted intervention of the Republic fleet. Once on the planet, the Separatists, under the command of the T-series tactical droid, Doctor, set up a device which affected organic beings' minds, and promptly drove the local herds of Eopies to thrash wildly."}, {"tag": "p", "text": "Sanya asked Xebec if he could sense that something was wrong, but he admitted to her that he had shut himself off from the Force and was unable to sense the same disturbance she felt. He then noticed the fields had grown strangely quiet, and were subsequently confronted by a group of Ukians wielding scythes and pitchforks. Xebec ignited his lightsaber and told Sanya to run. The two of them escaped the Ukians, only to come across another situation with Xebec's own troopers. Under the same affects as the Ukians, Commander Ganch and the clone trooper, Squawk, were arguing with one another. Just as Ganch was about to fire at Squawk, Xebec sliced his blaster in two and then ordered the clones to explain their actions. The two of them then turned on him, and Ganch began to struggle to speak and removed his helmet. When Xebec showed concern that Ganch was in pain, Sanya warned him to stay away, and Ganch struck Xebec in the face with his helmet. Ganch regained control of his thoughts long enough to tell Xebec to run before the clone could catch him."}, {"tag": "p", "text": "Xebec and Sanya were split up in the fields, amid the stampeding gigauns. Xebex himself soon came under the influence of the Project Instinction device, and attacked Ganch. He screamed at the clone to stop telling him what to do and tried to strike him, but Ganch grappled with him, still trying to fight the effects of the device. He lost the mental battle, however, and violently struck Xebec in the face, which temporarily cleared the Padawan's mind. Sanya then found the confused young Jedi and told him to use the Force to center himself. Just as Xebec was able to fully clear the effects from his mind, Ganch caught up with him, and began to strangle him. Xebec tried to convince the clone that he wasn't himself, and appealed to Ganch's strict nature by telling him he was acting against orders. Ganch then stabbed himself in the neck with a med-shot, knocking himself out."}, {"tag": "p", "text": "Xebec carried the unconscious clone to safety, sheltering him in a nearby building to prevent him from being trampled by the gigauns. Sanya asked Xebec to explain what had happened in the field, and he likened the effects to what he had felt when Master Ropal was killed, saying, \"everything turned... red\". At Sanya's urging, he cleared his mind and decided to track down the source of the disturbance. The two soon found a Sheathipede-class transport shuttle, guarded by three B1-Series battle droids and a single B2 super battle droid. Seeing that the droids were operating a device - unknown to the pair, a part of Project Instinction - they attacked. Xebec sliced the B2 battle droid in half, while Sanya, using one of Ganch's pistols and wearing his gauntlet, fired at the droids and destroyed one of the B1's. Xebec then used telekinesis to throw his lightsaber in an arc, destroying both the remaining droids and the transmitter. While the two felt that with the device gone, their heads were more clear, they could also sense that there were two more such devices on the planet. Xebec went after the remaining Instinction transmitters, and asked Sanya to check on the shield generator facility, fearing that the planet's defenses may have been compromised with everyone feeling the effects of the transmitters. Sanya pointed out they could achieve both goals faster if they took the droids' STAPs."}, {"tag": "p", "text": "The pair split up as planned, and soon Xebec had destroyed the second of the devices. As he traveled toward the third, he attempted to contact Sanya to check on her progress. As he waited for her reply, his STAP was struck by a missile, which flung the Padawan to the ground. He survived the explosion unscathed, and was immediately beset by the tactical droid, Doctor, and a group of B1 and B2 battle droids. Xebec attacked the droids head-on, quickly disabling the lot with an impressive display of lightsaber skill and telekinesis. With his enemies destroyed, Xebec spied the final transmitter, and sliced it in two, finally ending the project's mind altering effects. As soon as the transmitter was down, however, Xebec was shot through the shoulder by Doctor. The droid approached the wounded Padawan, menacing him with his modified surgical arm. Suddenly, he was slashed apart by Master Reus, who had come looking for her Padawan. Xebec was genuinely surprised that she had come to find him, as he believed that Reus did not care for him. When he told her he had destroyed all the transmitters, she proudly complimented him on his accomplishment."}, {"tag": "p", "text": "Xebec asked Reus how she was able to find him and get past the shields, to which she replied there was a single answer to both questions. Sanya had been able to reach the shield facility, and when Reus tried to contact Ganch on his comlink, Reus reached her instead. Sanya directed Reus to where she believed Xebec would be, and assisted her by lowering the planet's shields. Reus once again complimented Xebec after he explained how he disabled Ganch once the project's effects took hold of him. Reus, however, was unsure exactly what the Separatists had done to the planet, and Xebec had no answer for her."}, {"tag": "p", "text": "After the battle ended, Xebec and Reus joined Master Fisto and the clone troopers at the shield generator facility. The clones and local Ukians were checked out by medical droids, who found the effects of the Instinction devices to be localized and temporary. Reus commended Sanya on her service to the Republic. Though the command center was, in Sanya's opinion, a mess, she reported to Reus that it was able to continue functioning and that the planet's shields were secure. Suddenly, Liege approached and began to yell at the group, commanding all the Republic forces to leave the world. When Reus began to protest, Liege revealed to them that he had been removed from his position, but as his last act before leaving office he officially requested that they all be forced to leave. Ganch joined the group as Liege stormed away, and the clone commented that there was no helping some people."}, {"tag": "h3", "text": "The Valsedian operation"}, {"tag": "p", "text": "After departing Ukio, Xebec and the rest of the Republic fleet returned to Coruscant aboard the Venator-class cruiser, Selfless. Xebec debarked alongside Master Reus, Commander Ganch, and Sanya, and he asked Sanya if she would miss the Agricorps and the work she did on Ukio. She replied that she'd miss the good the Agricorps does, but not the dirty work, and in fact, she preferred planets like Coruscant. She revealed that she was also born on the planet, and Xebec welcomed her home. Reus thanked Sanya for her help on Ukio and expressed her hope that the Agricorps would reward her in her next assignment. Ganch then made sure Reus was aware that he had fully recovered from the effects of Project Instinction and was ready for duty, but Reus insisted that Ganch was due for leave."}, {"tag": "p", "text": "They were met by Captain Rex, who asked that Reus and Xebec meet Grand Master Yoda immediately, and offered to accompany Ganch to the RSO Center for relaxation. Ganch was hesitant, but when Reus insisted, he invited Sanya to join him and they departed. Xebec and Reus then left for the Jedi Temple, and joined Anakin Skywalker, Ahsoka Tano, and Obi-Wan Kenobi, who were speaking with Master Yoda."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A dedicated Padawan, Tyzen Xebec cared deeply for his master's well-being. During the surprise attack on Devaron, Xebec sought to help his Master fight Cad Bane, although the Rodian Jedi Master urged his Padawan to stay clear from the valley. After Ropal's capture on the hands of Bane, Xebec felt lost and began to question Ropal's teachings. He told Ganch that he now believed that Ropal looked into the future too often rather than keeping his mind on the present. On Coruscant, he was silent and showed no emotion as Jedi Master Mace Windu revealed that Bane had killed Ropal. The Padawan also did not care for Tano's attempt to comfort him, after she told Xebec that she and her master tried to \"hold onto Bane\" after finding the body of Ropal."}, {"tag": "p", "text": "Xebec also enjoyed the clone troopers' presence, and offered them time for themselves. He became close with Commander Ganch, even asking him to teach him military skills."}, {"tag": "p", "text": "Xebec, however, initially had a shaky relationship with the AgriCorps worker Sanya, referring to her as a \"washout\". Despite this, he did manage to work with her during the invasion."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Though he trained under pacifist Jedi Master Bolla Ropal, Xebec showed adept skills with a lightsaber, including telekinetic lightsaber combat. While on Devaron, the Padawan was responsible for the command of Ropal's clone trooper force. After an explosion, which temporarily rendered Xebec unconscious, the Padawan quickly came to his senses and devised a plan. As well, when attacking droid forces on Ukio with Ahsoka, he showed to be very skilled with a lightsaber and with the force for a padawan of his age. Ahsoka even regarded his skills as being \"on par with her's.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyzen Xebec first appeared in the StarWars.com webcomic, The Clone Wars: Act on Instinct. A centralized character within the webcomic, he was originally called \"Tyzen Xebel.\" The creation of the new Padawan began after writer Pablo Hidalgo talked with artist Thomas Hodges about different characters, and soon they came up with a young Zabrak. With this information Hodges drew a pencil and marker sketch of the Padawan and his lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}