{"url": "Tyvak", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Criminals", "Category:Males", "Category:Shistavanens"], "nodes": [{"tag": "h1", "text": "Tyvak"}, {"tag": "p", "text": "Tyvak was a male Shistavanen who served as the second-in-command to the crime lord Jaum, who operated on the planet Andelm IV during the Galactic Civil War. During that time, Chewbacca attacked Jaum's mine. Tyvak at first won the confrontation, but a short time later Tyvak was lit on fire by Chewbacca."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tyvak was a male member of the Shistavanen species. He was the chief lieutenant to Jaum, a crime lord who operated on the planet Andelm IV in the Outer Rim Territories of the galaxy during the Galactic Civil War."}, {"tag": "p", "text": "By the time of the Battle of Yavin, Jaum had conscripted a slave workforce of people he had deceived into being in debt to him, and forced them to work in his mine mining Andelm beetles, which were used in the production of blasters. Tyvak accompanied his friend to the home of the man Arrax and his young daughter, Zarro, who had also failed to repay Jaum's debt, so Jaum forced them into the mine."}, {"tag": "p", "text": "Several days later, Zarro escaped from the caverns. Tyvak was ordered to hunt her down and retrieve her by Jaum. Tyvak and several other guards traveled to a city on Andelm IV and began their search in a cantina. A large Wookiee caught Tyvak's attention and he confronted the large being. The Wookiee, Chewbacca stared blankly at Tyvak until the Shistavanen moved on in a defeat of wills. Unknown to Tyvak and the guards, Chewbacca had hidden Zarro under his table."}, {"tag": "p", "text": "Later that night, Jaum and Tyvak and a guard met with an officer his stormtroopers and an Imperial scientist of the Galactic Empire in the wilderness of Andelm IV far from the spaceport in order to negotiate terms of Jaum's criminal syndicate to provide the Empire with dedlanite from the Andelm beetles in order for the Empire to keep up their war machine after the loss of their Death Star battle station at the hands of the Rebel Alliance during the Battle of Yavin."}, {"tag": "p", "text": "The next day, Zarro was recaptured by Tyvak's guards; however, unknown to any but her, it was part of a ploy to break everyone out of the mine with the help of Chewbacca, whom Zarro had persuaded to help her in her plight. Jaum and Tyvak confronted some of the workers, including Arrax, to tell them that they were being sold to the Empire as permanent slave workers. The workers were shocked, and one man went to attack Jaum, but he was cut down before he could do damage. Tyvak then organized a resistance with the other guards to quell the uprising, but Chewbacca had entered the mine and defeated many of the guards. before Tyvak and Jaum set up a trap. Tyvak placed crates of the beetle larva at the exit of the mine and fired on them with a sniper rifle when Chewbacca emerged. Which caused the larva to explode, trapping and killing many of the workers."}, {"tag": "p", "text": "Tyvak remarked to Jaum that the Shistavanen people had a saying about Wookiees: kill them whenever the opportunity arose because the brought ill fortune. Tyvak and Jaum then returned to their V-35 Courier landspeeder, lamenting the loss of their workforce, though Jaum remained hopeful that the Empire would compensate them in plenty. Tyvak, however, believed the Empire would just outright seize their properties. And then he informed Jaum that he believed Chewbacca had survived, and would seek revenge. Shortly thereafter, in a nightclub, Jaum killed a former guard after the guard informed Jaum that he had been freed from the mine by a Wookiee. Tyvak chided Jaum that he knew Chewbacca had survived, and at Jaum's order, assembled the guards while Jaum requested stormtrooper reinforcements from Imperial Commander Kai."}, {"tag": "p", "text": "Tyvak assembled the surviving guards in the hangar as ordered in order to prepare them to assault the Wookiee and his followers. A contingent of Imperials stormtroopers and scout troopers arrived shortly later in a Sentinel-class landing craft, as well as one All Terrain Scout Transport, which bolstered the ranks. However, while preparing, Chewbacca and Zarro came to the hangar disguised as hired security for the delanite and beetle larva shipments. Jaum caught on to their plan, however, forcing Chewbacca to reveal himself and attack. Tyvak raced to the battle and challenged Chewbacca to single combat with his vibro-blade, adamant that he would not \"let the Wookiee win\", as the old saying went. Chewbacca roared at the Shistavanen and activated a nearby engine instead, which shot out a plume of fire onto Tyvak. Tyvak fled, his whole body ablaze."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tyvak was a ruthless enforcer who served as the Andelm IV gangster Jaum's right-hand man and bodyguard. He led manhunts to retrieve escaped slaves like Zarro, who stood up to Jaum's exploitation of her people. Tyvak had a particular vendetta against Wookiees and was willing to throw much resources into killing Chewbacca. While Tyvak went along with Jaum's \"get rich\" scheme to develop a profitable dedlanite mine on Andelm IV, he feared that the Galactic Empire could easily seize their business operation. Jaum regarded Tyvak as a worrier and thought that he underestimated the resilience of the Wookiee."}, {"tag": "p", "text": "Tyvak was also skilled in melee combat and was able to fight Chewie with a vibro-blade. However, the Wookiee outwitted him by burning him with an engine. As a result, Tyvak was set ablaze and incapacitated for the duration of the conflict. Jaum was angered by the apparent death of his friend and vowed to send bounty hunters after Chewbacca."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyvak first appeared as a secondary antagonist in Gerry Duggan's 2015 Marvel comic story Star Wars: Chewbacca, which featured the Wookiee as the titular character. He was drawn by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}