{"url": "Tython/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Jedi planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Tython locations", "Category:Tython system planets"], "nodes": [{"tag": "h1", "text": "Tython"}, {"tag": "p", "text": "Tython was a planet in the Tython system of the Deep Core that played a pivotal role in the histories of the Je'daii Order and its successor, the Jedi Order. A verdant world that was incredibly rich in the Force, Tython was inhabited by an unknown species hundreds of thousands of years before the rise of the Galactic Empire, and it was visited by both the Gree and Kwa, two of the earliest species to have achieved interstellar travel. In 36,453 BBY, the great pyramid ships known as the Tho Yor brought pilgrims from over a dozen species from across the galaxy to Tython, where the pilgrims learned to harness the Force and established the Je'daii Order, basing their philosophy of balance upon Tython's two moons Ashla and Bogan. The Je'daii soon realized that Tython was unsafe for those who could not sense the Force, and as a result, the Tythans spread out to settle the other worlds of the Tython system."}, {"tag": "p", "text": "In 25,805 BBY, after over ten thousand years of peace, Tython was the site of the final battle of the Despot War, and twelve years later, a vessel from the Infinite Empire of the Rakata species crashed on Tython's surface, sparking one of the intense Force storms that occurred whenever the balance of Tython was shifted between the light and dark sides of the Force. The Force Wars erupted not long afterwards, a devastating conflict fought between the followers of the light side and the followers of the dark side, and in the aftermath of the Force Wars, the victorious light-siders established the Jedi Order. The Jedi departed Tython for the distant world of Ossus, leaving Tython to become lost as the Deep Core erased the hyperlanes to the planet, and the savage Flesh Raiders evolved on the now-empty world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A terrestrial world in the Tython system of the Deep Core, Tython was the fifth planet in orbit around the star Tythos, orbiting Tythos at a distance of less than 160 million kilometers, and the planet was incredibly rich with the Force. Tython possessed a breathable atmosphere and a temperate climate, and it featured a number of continents separated by oceans and seas. The planet was geographically varied, as Tython's continents were marked by plains, hills, mountains, and even canyons, and for much of the planet's history, Tython was a particularly verdant world. Tython was orbited by two moons: Ashla and Bogan, satellites that inspired the Je'daii Order's philosophy of balance between the light and dark sides of the Force, and the Je'daii maintained sentry drones in orbits thirty thousand kilometers above Tython's surface. Tython's environment was remarkably sensitive to the Force; powerful disturbances in the Force, such the presence of an individual particularly strong in either the light or dark side of the Force, could cause immense Force storms and groundquakes that would ravage Tython's surface. However, by the year 990 BBY, all hyperlanes to Tython had become unstable and forgotten, and the planet itself had been devastated—the planet was covered by a constant layer of storms, and its surface was the color of ash, with barren plains where immense forests had once stood."}, {"tag": "p", "text": "Tython was home to a large number of species of creatures whose shapes and forms were as varied as the planet's surface, such as screech lizards and acid spiders. Tython's hook hawks were birds that possessed hooked beaks and sharp talons, and hunted their prey by hypnotizing them with song and then attacking. Silik lizards were rare but deadly silicon-based creatures that absorbed energy from sand itself. Six-limbed and the size of a Human adult, silik lizards featured a large number of spikes on their bodies and were known to charge opponents on their hind legs. The Rift was home to many strange and deadly creatures, many of which were unnamed and unknown. The saarl was a massive, purple-colored worm creature with a tooth-filled maw that opened like a three-petaled flower. Flame tygahs were eight-limbed reptilian creatures twice the size of a Human that were native to Tython's Strafe Plains; a flame tygah's claws and tail dripped fire and its mouth blazed with heat. Blood spites were bat-like creatures that fed on warm blood and inhabited the Red Desert, though their existence was widely considered to be only a rumor by the Je'daii. Ak trees were common in Tython's forests during the time of the Je'daii."}, {"tag": "p", "text": "Tython's Moon Channel was home to the tentacled gelfish as well as enormous sea serpents. The hoofed quadrupeds known as Guids were native to the region around Kaleth, the Je'daii Temple of Knowledge, and while they were not ordinarily aggressive, guids could attack their opponents with their powerful jaws and massive forelegs. Like the guid, the mammalian uxibeasts were also found in small groups on other worlds despite the fact that they were believed to have originated on Tython. Uxibeasts were ill-tempered herbivores that traveled in herds and were deceptively aggressive. The four-legged horranth were reptilian predators that hunted in large family groups and had enormous birth rates—their population was typically only constrained by a limited food supply. Manka cats, feline predators from Alderaan, eventually found their way to Tython and thrived in the planet's vibrant ecosystem."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Tens of thousands of years before 36,453 BBY, a species of enormous size constructed the Old City on the continent of Talss on Tython. The Gree, one of the earliest species to achieve interstellar travel, visited Tython early in galactic history, though the Old City was long abandoned even by that time. The Gree inhabited the Old City for a time, and there were rumors that the Gree constructed a hypergate—a technology used by the Gree to travel instantaneously between two points in space—in the depths of the Old City. The Gree eventually left Tython, and the next species to visit the planet was the aquatic Kwa. The Kwa linked Tython with their other worlds with an Infinity Gate, a technology similar to a hypergate, but thousands of years before the rise of the Je'daii Order, the Kwa's encounter with the Rakata species led them to destroy all remaining Infinity Gates in order to prevent the Rakata from overrunning the galaxy. The few remaining Kwa on Tython eventually died out after destroying their Infinity Gate."}, {"tag": "p", "text": "In the year 36,453 BBY, the eight great pyramid ships known as the Tho Yor arrived at Tython, delivering Force-sensitive pilgrims from over a dozen worlds to the planet and causing an intense Force storm. The eight smaller ships met with the ninth and largest Tho Yor above a great pillar of stone that reached high into the sky on Tython, and then each of the eight departed in a different direction to a different location across Tython. The Tho Yor remained at their final destinations after depositing their passengers, and the pilgrims soon developed into a cohesive culture of Tythans, realizing that the purpose of their gathering was for them to study the Force and harness its powers. Inspired by Tython's twin moons, the bright Ashla and dark Bogan, the Tythans came to understand the dual nature of the Force's light and dark sides, and they also realized that Tython itself would react to imbalance in the Force with powerful quakes and Force storms."}, {"tag": "p", "text": "With this knowledge, the Tythans formed the Je'daii Order, naming themselves after the word for \"mystic center\" in the language of the Talid species's Order of Dai Bendu. The Je'daii built nine great temples at the sites of the nine Tho Yor, some of which remained floating in the sky while others had landed in the oceans or on mountainsides. Padawan Kesh, the Je'daii Academy, had been constructed at one of the Tho Yor by the year 36,019 BBY, when Nordia Gral was serving as the Temple's first Temple Master. By that time, the Je'daii had completed temples at the other eight Tho Yor, and they also developed the tradition of a Great Journey, a two-year odyssey across Tython's surface to each of the nine temples that would be undertaken by Padawans once they became Je'daii Journeyers. For the first thousand years of the Je'daii's time on Tython, the planet was frequently wracked by intense Force storms, as the Je'daii had not yet learned how to restore balance to the planet and calm the storms through the Force."}, {"tag": "p", "text": "The Je'daii also constructed cities across Tython's surface, though as the pilgrims' second millennium on Tython came to an end, it became evident that those who were not Force-sensitive could not survive on the planet. The destruction of the city of Aurum inspired a second migration, where those Tythans who were not Je'daii departed Tython in starships and settled the other worlds of the nine-planet Tython system. Force-sensitives born on the other planets, the Settled Worlds, were brought to Tython for training as Je'daii, and the Tython system's way of life continued for over ten thousand years. However, resentment of the Je'daii among the Settled Worlds eventually led to conflict. In 25,805 BBY, the Despot Queen Hadiya united the crime barons of her homeworld Shikaakwa and conquered the rest of the Settled Worlds. She then turned her attention to Tython, and her army invaded the planet in a final battle—a battle that saw the death of millions of Hadiya's troops and thousands of Je'daii. Hadiya herself was slain by the Je'daii Daegen Lok at the gates of Kaleth, bringing the Despot War to an end."}, {"tag": "p", "text": "Peace was shattered, however, circa 25,783 BBY, when a schism in the Order's belief system pitted those who favored the Ashla philosophy against those who adhered more to the Bogan schools of thought. Wielding katana, metal swords imbued with the Force, the Je'daii were pitted in a bloody civil war known as the Force Wars. The Ashla philosophers called themselves the Jedi Order and were led by a High Council comprised of the greatest of their number. One of the High Councilors, the great Master Rajivari, was corrupted by the dark side of the Force and led a faction of dissidents in another savage attack against the Jedi he had helped to create. Rajivari's camp fortified itself at the Temple of Knowledge, called Kaleth by the Order. While the Bogan philosophers held off the Jedi for several weeks, Master Rajivari disappeared, leaving his disciples in disarray. Weakened and taking heavy casualties, Rajivari's followers were defeated and the Jedi Order ended the uprising."}, {"tag": "h3", "text": "Abandonment"}, {"tag": "p", "text": "Initially, the Jedi believed their power was limited to Tython only, though this was later proven otherwise when a proactive group left Tython to liberate other worlds, becoming the Jedi Knights around 25,783 BBY. In the wake of the Force Wars, the victorious Jedi Order abandoned Tython in favor of Ossus, a lush planet on the edge of the Tion Cluster deep in the Outer Rim. Despite the Order's departure, Tython was absorbed into the Galactic Republic and was held throughout the Indecta, Kymoodon, and Pius Dea eras and beyond."}, {"tag": "p", "text": "Following the destruction of the Cron Cluster and the ensuing ruination of Ossus, the Jedi Order had relocated to Coruscant; records of Tython's existence survived to this point, and notation of Sith experiments on the planet were made in the Archives of the Jedi Temple. Terrific beasts called terentateks, the product of alchemy, were loosed on Tython and were deemed monstrous abominations that posed as an affront to the Force by the Jedi High Council. Charging members of the Order to hunt down the creatures and execute them with extreme prejudice, the High Council initiated the Great Hunt, allowing any who wished to join in the purge to participate. Among other worlds, Tython was cleansed in 3994 BBY, ridding the ancient Jedi homeworld of the terentatek threat."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "p", "text": "Soon after the Great Hunt ended, hyperlanes to the planet collapsed and the world was left abandoned for several centuries. Tython had not been forgotten, however; new hyperlanes into the Deep Core were paved in 3651 BBY by Jedi Knight Satele Shan in the wake of the Sacking of Coruscant by the reconstituted Sith Empire. Leading Jedi scouts to reclaim the world, Shan reestablished a Jedi presence on the world, making Tython the Order's fortress world during the Cold War between the Sith Empire and the Galactic Republic. In the same time period, a group of Twi'lek Pilgrims landed on the world and established a small settlement near to the Jedi headquarters. Constructing their Temple near the ruins of Kaleth, the Jedi kept their distance from the illegal Twi'lek settlement despite pleas from the Matriarch to assist in warding off Flesh Raiders."}, {"tag": "p", "text": "During the Cold War, Darth Angral of the Sith Empire destroyed the Republic agricultural world of Uphrades to issue a challenge to the former Padawan of Master Orgus Din. This Knight had come to be a thorn in the side of the Empire on several different occasions and had finally drawn Angral's wrath upon Tython. The Knight and their own apprentice, Kira Carsen, entered Angral's flagship the Oppressor and confronted Angral after disabling it. During the confrontation, the Sith Emperor possessed Carsen from afar and ordered Angral to finish off the Knight. Ultimately the Knight was able to defeat Angral while Carsen refused to be the Emperor's pawn and was able to shatter the mental link. The two Jedi were able to flee the Oppressor before it exploded, taking Angral's corpse with it. Upon their return to the surface of the planet, Grand Master Satele Shan bestowed the title, \"Hero of Tython\" on the Jedi Knight for services done for the Order."}, {"tag": "p", "text": "Shortly after the Hero's defense of Tython, a new war began between the Republic and the Sith Empire. In 3637 BBY, the Sith assaulted Tython and held the Jedi Temple for a short time. The assault was planned by the Dark Council member Darth Arkous and his subordinate, Lana Beniko. However Arkous was secretly a member of the Order of Revan, and the attack was merely a means for the Revanites to obtain Rakatan technology from the Jedi Archives. A simultaneous attack on Korriban was perpetrated by Arkous's secret ally, Colonel Rian Darok."}, {"tag": "p", "text": "Following the Eternal Empire's conquest, Tython had become largely abandoned as a result of the Jedi Order scattering to the far edges of the galaxy, save for those serving in archival and research capacities. By 3627 BBY, the Republic formed Task Force Nova to reunite the Order, but chose not to resettle on Tython, deciding to instead settle a new homeworld to be closer to the people they seek to defend."}, {"tag": "h3", "text": "Return to obscurity"}, {"tag": "p", "text": "However, sometime after the Galactic War, Tython's surface was severely devastated in a catastrophe, and the planet became saturated with dark side energy. During the New Sith Wars between the Republic and various Sith factions, the Shi'ido Sith Lord Belia Darzu took control of Tython and built a large fortress on the planet. Darzu, who was skilled in the use of mechu-deru—the ability to transform the flesh of living beings into metal machines—had conducted experiments within the fortress, developing the ability to create technobeasts in the year 1250 BBY. Building an army of the technological horrors and recording her knowledge within her holocron, Darzu initiated the phase of the New Sith Wars known as the Sictis Wars. However, Darzu incurred the wrath of the Mecrosa Order in 1230 BBY, and the Mecrosa assassins killed Darzu on Tython."}, {"tag": "p", "text": "By the year 990 BBY, Tython had been long abandoned, as the hyperlanes to the planet had been lost. However, the Sith aspirant Hetton discovered navigational data on Tython, and he passed the charts to Darth Zannah, a Dark Lord of the Sith and the apprentice of Darth Bane. Bane traveled to Tython in order to investigate Darzu's fortress so that he could further his knowledge of holocrons, while his apprentice infiltrated the Archives of the Jedi Temple on Coruscant in search of information on the orbalisk creatures that Bane had been infected with. Bane took his Infiltrator-series long-range fighter Mystic to Tython and approached Darzu's fortress, destroying the fortress's defenses when they attacked his fighter. Bane then entered the fortress to find an army of dormant technobeasts, and the creatures attacked him after he retrieved Darzu's holocron. Bane destroyed all of the technobeasts and spent the next few days in meditation, studying the holocron in order to build his own."}, {"tag": "p", "text": "However, Zannah was discovered on Coruscant, and she was forced to flee to Tython with her cousin Darovit. The two were pursued by Jedi Masters Valenthyne Farfalla, Raskta Lsu, and Worror Dowmat, along with Jedi Knights Johun Othone and Sarro Xaj,and the five Jedi engaged the two Sith in a duel within Darzu's fortress. The duel ended with a Sith victory, though Bane was severely injured and Zannah was forced to take her master and Darovit to the planet Ambria for healing. In the years that followed, the Jedi Order established an academy on Tython's surface despite the strong dark side presence, and the facility served as a place for deeper immersion in the Force similar to the academy on Alpheridies."}, {"tag": "p", "text": "During the Clone Wars, the sectors of the Galactic Republic were assigned one of twenty oversectors, and were the operating theaters of the troops fighting the Confederacy of Independent Systems, and the Tython System was placed in Sector 5. In the year following 19 BBY, which saw the deaths of the vast majority of the Jedi and the rise of the Empire, Emperor Palpatine brought the Tarkin Doctrine into effect, reorganizing the oversectors into political entities as well as military, giving each Imperial Grand Moff authority over an oversector each."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Tython was originally home to a species of immense size, as the Old City was built for individuals more than three times the size of a Human, though that species was long vanished by the time the Gree arrived. The Gree eventually departed Tython, and the Kwa species eventually came to Tython for some time before they died out on the planet after destroying Tython's Infinity Gate. The pilgrims brought to Tython by the Tho Yor were of great variety and of many different species from across the galaxy: they included Talids, Humans, Selkath, Twi'leks, Sith, Cathar, Wookiees, Zabrak, Noghri, Devaronians, Sullustans, Mirialans, Iktotchi, Krevaaki, Miraluka, and the species that would be later known as Koorivar. The Flesh Raider species evolved on Tython in the millennia after the departure of the Jedi, and they had developed a primitive and savage culture by the time of the Cold War."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "During the era of the Je'daii, Tython had a number of cities and temples, and its surface was geographically varied. Mahara Kesh, the Je'daii Temple of Healing, was located in Tython's Deep Ocean. The island continent of Masara was covered by forests and verdant plains, and Bodhi, the Je'daii Temple of the Arts, was situated near the Edge Forest on Masara's southern coast, while the continent was bordered by the Thyrian Ocean on its northern coast. The continent of Thyr lay eight hundred kilometers to the north across the Thyrian Ocean, and Thyr featured rocky plains and the Stark Forests, forests with trees that sucked moisture from the air and stored it as water in large sacs on their branches. Thyr was also home to the Silent Desert, a desert with the unique property that all sound was soaked up by an unknown quality in the desert's sands. The Silent Desert also featured intense winds and a number of sand sculptures that some believed to be sentient. The Temple of Force Skills, Qigong Kesh, was located in an enormous cavern beneath the Silent Desert."}, {"tag": "p", "text": "The continent of Kato Zakar, which lay to the south of Thyr, was often called the Firelands in the Je'daii era for its tumultuous terrain and the significant amount of volcanic activity that was common in the continent's heartlands, almost thirty-two hundred kilometers south of the northern coast. The Ice Giant Range, a mountain range that was the site of the Temple of Martial Arts Stav Kesh, was located almost five hundred kilometers inland from the northern coast, and the Strafe Plains lay between the Ice Giants and the coast. The Strafe Plains were a cold, windswept scrubland that was prone to frequent Force storms and scattered with magma-filled \"swallow holes\" and columns of razor-sharp silica. Kato Zakar's eastern reaches were covered by fungi forests, then swamps, and then sand dunes the farther one got to the continent's eastern coast, and the port city of Ban Landing was located on Kato Zakar's coastline at the sea known as the Moon Channel."}, {"tag": "p", "text": "Across the Moon Channel was Tython's largest continent Talss, also known as the Dark Continent. Talss was marked by the massive canyon known as the Rift—a geographic feature which was the site of frequent volcanic and seismic activity. The two continents were separated by a distance of a hundred kilometers, and the Moon Channel between them was the site of the seven Moon Islands, and Talss's western coast was home to a number of small ports. Six hundred kilometers east of the Rift was a mountain range split by the Chasm, and Anil Kesh, the Temple of Science, straddled the Chasm high in the mountains. and something within the Chasm's depths interfered with the senses of Force-users. To the south of the Rift and the mountains lay a wide, seemingly endless plain that lacked any plant growth over waist height, as the plain's intense wind strips any plants that grow taller from the soil. To the south of the plains, in the southern reaches of Talss, was the Red Desert. The Old City was located about eighty kilometers inward from the northern edges of the desert, half buried in the sands by the time of the Je'daii."}, {"tag": "p", "text": "Vur Tepe, the Je'daii Forge, was situated directly over an active volcano in a mountain range during the era of the Je'daii, while Akar Kesh, the Temple of Balance, was situated at a towering pillar of stone—the site of the original landing of the Tho Yor. Six waterfalls cascaded from the top of the monolith, feeding into the series of lakes and rivers around the pillar's base. Kaleth, the Je'daii Temple of Knowledge, was built over a Force nexus near the river and mountain range that would be known by the Jedi tens of thousands years later as the Tythos River and the Tythos Ridge."}, {"tag": "p", "text": "Following the Jedi Order's resettlement of the planet, a massive Temple was erected near the site of the ruined city-temple of Kaleth. The Temple served as a base for all Jedi operations on the planet for several years; the Jedi also occupied a structure known as the Masters' Retreat located in the Tythonian Gnarls, while the Twi'lek Kalikori village was found on a ridge just above the Temple complex."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tython first appeared in the 2007 novel Darth Bane: Rule of Two. Rule of Two identified Tython as the birthplace of the Jedi Order according to legends. This was confirmed in the supplementary material preceding the 2011 release of the massively multiplayer online role-playing game, Star Wars: The Old Republic, in which the planet plays a prominent role in the early gaming experience for players who chose the path of the Jedi Consular or Jedi Knight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}