{"url": "Tyro_Caladian", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Clerical workers and assistants", "Category:Galactic Republic bureaucrats", "Category:Legal professionals", "Category:Males", "Category:Svivreni"], "nodes": [{"tag": "h1", "text": "Tyro Caladian"}, {"tag": "p", "text": "Tyro Caladian was a male Svivreni lawyer and bureaucrat working as a Senatorial aide during the last years of the Galactic Republic. He was cousin to Curran Caladian, also a Senatorial aide. A firm believer in democracy and an expert in many of the rules of the Senate, Caladian had a reputation that attracted the attention of Jedi Knight Obi-Wan Kenobi, who needed such expert assistance in his activities, and asked for Caladian's collaboration."}, {"tag": "p", "text": "Tyro Caladian repeatedly helped Kenobi in his endeavors, providing him with information, support, and specialized help against the likes of corrupt Senator Sano Sauro of the planet Eeropha, criminal Granta Omega, and fugitive Jenna Zan Arbor who was hiding on Romin. All of those people were enemies of the Jedi Order. During that time, Caladian and Kenobi became personal friends, and the regular contact with the Jedi also gained Caladian the esteem of other Jedi such as Siri Tachi and Ferus Olin. While reluctant to break the law for his friends, Caladian agreed to do so on occasion. At the same time, Caladian's steps attracted the attention of Sauro, who actively blocked some of Caladian's movements—rendering Caladian's help to the Jedi useless—and openly considered the Svivreni a personal enemy. While investigating on behalf of Kenobi, Caladian discovered a conspiracy involving the highest echelons of the government of the Republic. Before he could report the details, Caladian was assassinated."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Investigating Sauro"}, {"tag": "p", "text": "Tyro Caladian and his cousin Curran Caladian, both of them male Svivreni, joined the Galactic Senate and became Senatorial aides at about the same time. Tyro Caladian was assigned to a small office in the lower level of the Senate Building of Coruscant; he soon took up most of the available space with a desk and several file containers. He became a rising bureaucrat and lawyer, and started making a name for himself as an specialist in obscure Senatorial procedures with a high respect for the ideals of the Galactic Republic."}, {"tag": "p", "text": "In 25 BBY, Caladian was approached by the Jedi Knight Obi-Wan Kenobi, who had heard of the Svivreni's reputation. Kenobi and his apprentice, Anakin Skywalker, were tracking a criminal named Granta Omega who, according to their sources, had the support of Senator Sano Sauro of Eeropha. Although Kenobi had the Supreme Chancellor's nominal help, he still needed to formally petition Sauro to show Kenobi his private files. Fearing that Sauro would use legal tricks to evade disclosing his files, Kenobi asked Caladian to explain the ins-and-outs of legal protocol necessary to prevent this. Caladian, who opposed Sauro's previous activities, obtained every needed signature and approval for an order to reveal against Sauro."}, {"tag": "p", "text": "Nonetheless, Sauro bribed a committee he served on, causing a discontinued procedural rule to be approved, authorizing him to reject Caladian's order to reveal so that not even the Chancellor could revoke his decision. Caladian, who already had a busy agenda with subcommittee hearings at that point, met with Kenobi and Vice Chancellor Mas Amedda to hear the official answer of denial, and, full of rage, he threatened to appeal the decision. Caladian offered Kenobi his help in any further inquiry the Jedi might have. Sauro understood that Caladian was his political enemy and placed a trace in Caladian's comlink, so as to track any of the Svivreni's activities—a completely legal measure he would later pretend to have done because he was afraid of Caladian. Later, Caladian remembered that Sauro could only block his personal files, but not other people's files about him. He immediately claimed all the files in the Senate registry about Eeropha from all of the nine years Sauro had been serving as a Senator and began to check them one by one."}, {"tag": "p", "text": "While he was busy with this, Caladian was once more visited by Kenobi. As a part of a completely different quest, or so he thought, Kenobi was researching Senator Berm Tarturi of Andara, whose child Gillam had been kidnapped. Caladian was already familiar with Tarturi's personal plight and he told Kenobi about Tarturi's political predicaments: He was wrestling Sauro about the redistribution of hyperlanes, and this distraction could lead to Tarturi losing a hearing, which would in turn allow Sauro to lever yet another committee. In a heated debate with Kenobi, Caladian theorized that Sauro might have allied with Rana Halion, ruler of Ieria, against Tarturi."}, {"tag": "p", "text": "Following up on this hunch, Caladian researched any known illicit activities of Sauro from 30 BBY and used a probability software to find some of Sauro's secret meeting places, leading Caladian to discover that Sauro was indeed meeting with Halion. He told Kenobi about this through his comlink and then met with the Jedi in a public café. As Sauro was snooping Caladian's calls, he warned Halion, and she in turn lost her pursuers. Kenobi then discovered the bug in Caladian's comlink."}, {"tag": "p", "text": "Caladian continued his political research on the Sauro–Halion link, alongside several Jedi experts such as Jocasta Nu. He took a moment to offer his personal sympathy to Senator Tarturi due to his senatorial problems. Eventually frustrated at his lack of success, Caladian was again contacted by Kenobi. This time, the Jedi needed forged identifications for himself and his friend, fellow Knight Siri Tachi, so that they could pretend to be the kings of Cortella. Although shocked, Caladian helped them."}, {"tag": "h3", "text": "Aiding and abetting the Jedi"}, {"tag": "p", "text": "In 24 BBY, Caladian was again visited by Kenobi, this time along with Tachi and her Padawan learner, Ferus Olin. The Jedi wanted his help to apprehend the fugitive Jenna Zan Arbor who was hiding on the planet Romin, where the corrupt ruler Roy Teda rejected any request for extradition of criminals. Caladian informed them that the Senate was forced to obey the local rules, and the Jedi could not reach the planet without official approval from the Senate. Kenobi asked Caladian for a loophole, but the Svivreni was not aware of any. Only when Caladian commented on a group of fugitives that had recently escaped from a prison only to be caught again during a long series of breakouts, did Kenobi chance upon a new idea: they could impersonate the fugitives. Caladian reacted by detailing several laws which would be broken during any such stunt, but Kenobi reassured Caladian by insisting that they would not get caught as Caladian could provide them with forged documents, background information, and even the fugitives' starship, which was still impounded by the authorities."}, {"tag": "p", "text": "Caladian also used a Stop Comm order to temporarily prohibit the press from leaking the re-capture of the fugitive band, the Slams, for three days. He obtained their impounded Ubrikkian yacht after getting the Overseer of Prison Worlds to issue an order to the Confiscation Authority and, bemused at the prospect, Tyro explained that the person Kenobi would be impersonating was somewhat of a dandy, something that Kenobi was not keen to feign, but ended up doing quite admirably. Lastly, Caladian provided all the available information about Romin. Caladian's help proved invaluable during the Jedi mission."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "Later the same year, Tyro Caladian was present during a Senate hearing in which members of Senator Sauro's anti-Jedi faction, including ex-tyrant Teda and Senator Bog Divinian of Nuralee, gave witness against and questioned Obi-Wan Kenobi. Although Sauro had mustered significant power and was fomenting a growing tide of support in his quest to sever all future Jedi affiliation with galactic governance, Senator Bail Organa of Alderaan opposed him, maneuvering to meet privately with Chancellor Palpatine and Divinian; these efforts only increased the already great respect Caladian felt for Organa."}, {"tag": "p", "text": "Immediately after the hearing, Kenobi met with Caladian and talked about Sauro and Divinian's behind-the-scenes' scheming—and the connections that these machinations appeared to have with the galactic criminal Granta Omega. Caladian expressed his doubts, however, that these anti-Jedi powerplays would bear much fruit, explaining that although Sauro controlled several Mid-Rim planets, he was disliked in the Core Worlds, and, as such, could not succeed in his efforts to topple the all-too-popular Palpatine, as Kenobi suspected was Sauro's aim."}, {"tag": "p", "text": "Kenobi obtained recordings that Divinian had made for his biographers, and he gave Caladian a copy, to get the Senatorial aide's 'take' on it. Though Kenobi was unable to understand the meaning behind some of Divinian's recorded words, he later deduced that Divinian was preparing a speech to nominate Sauro as Supreme Chancellor and that the plotting of the anti-Jedi conspirators pointed to an assassination attempt on Palpatine. Caladian, from subsequent research done on the recordings, also found dark evidence of an emerging \"evil\" at the \"highest level\" of galactic governance, which apparently was unrelated to the assassination attempt Kenobi already suspected; peculiar static interference in their comlink connection, however, prevented Tryo from voicing his concerns adequately to Kenobi, in order to warn him in time. But Kenobi soon confirmed that, in fact, an Omega-staged plot was in play to murder Palpatine and hundreds of other politicians using a formidable phalanx of seeker droids in the Senate Rotunda."}, {"tag": "p", "text": "Caladian raced to join Kenobi in the Grand Convocation Chamber of the Senate, where hundreds of seeker droids had targeted and were firing upon thousands of Senators and their top advisors from across the galaxy. Kenobi had been joined by several other Jedi, countering the attack of the killer machines, but they still were unable to prevent several fatalities. Caladian hurried to meet with Kenobi in the midst of the battle, but the Svivreni was riddled with blaster fire, seemingly aimed at Palpatine, but which, at the last moment, was directed at Caladian. Although Tyro was able to reach Kenobi's position, he'd now fallen and was unable to speak; he simply performed the traditional Svivreni farewell gesture and, with fear in his eyes after one last look at Palpatine, died. Weeping, Kenobi quietly uttered the traditional Svivreni words of farewell and made the same intimate hand gesture on behalf of his fallen friend."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Caladian's death was not the only loss sustained by the Senate on that day: thirteen other aides, ten Senate Guards, twenty-one Senators, and former dictator Teda met their ends as well. Later research discovered that the seeker droid that killed Caladian had been programmed to go after him specifically. Kenobi thought this very strange, that a lowly Senate aide had been targeted for assassination."}, {"tag": "p", "text": "Caladian's memorial was so crowded that many of his friends were physically outside the room during the ceremony. His office had been re-assigned to other political uses within just two days, as space in the Senate Building was at a premium. Before the office space was taken over, however, Kenobi requisitioned Caladian's files to be delivered to Jocasta Nu's research team for further investigation, to scour them for information (particularly in reference to Tyro's last foreboding), and afterwards archive them in the Jedi Temple. Five years after Caladian's death, he was fondly remembered by many of his friends, including his cousin Curran Caladian and the Jedi Ferus Olin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tyro Caladian was a furry Svivreni who, like many others of his species, had a stout complexion. His glossy fur, covering most of his body including the hands, raised whenever he felt angry. He commonly dressed in navy tunics. Caladian had a small, pointed face with two likewise little, but bright, dark eyes, and similarly undersized, pointed, glittering teeth."}, {"tag": "p", "text": "Caladian was familiar with the traditions and culture of his peaceful species, which he followed. He used gestures and euphemisms to avoid uttering the word \"goodbye,\" which was considered a jinx in his culture. He also used a thick ring or clasp of metal to hold his long \"plume\" or mane of black hair, which reached his waist. When nervous, Caladian sometimes manipulated the ring."}, {"tag": "p", "text": "The Svivreni wanted to specialize in the administration of the Galactic Senate. Using youthful enthusiasm, acute awareness and a natural skill for bureaucracy and politics, he became an expert in his field, knowledgeable in complex and arcane rules. Caladian also managed to hear almost all of the important, confidential conversations in the Senate, despite not being a participant in many of them. He could also obtain forged identifications if needed. A hard-working person, Caladian flooded his office with containers made of plastoid to keep durasheet documents, sometimes jamming the door in the process."}, {"tag": "p", "text": "Caladian believed in the value of democracy, even though he admitted corruption was rampant among the Senators and was frequently worried because of it, as was he also by the galaxy's growing lawlessness. However, he still believed in certain Senators, particularly Bail Organa, and considered that they were the norm, rather than the exception. He could not imagine a way to spread civilization through the galaxy other than the Republic. Caladian particularly disliked Senator Sano Sauro; Sauro's dirty deeds had reached Svivren and, although his scheme there had been stopped, Sauro himself was never formally accused, something that made Caladian's blood boil."}, {"tag": "p", "text": "Caladian was well-liked among his friends, who were plentiful. The Svivreni was affectionate, warmer in his interchanges with Kenobi than with Kenobi's colleague Mace Windu. When his relationship with Kenobi led to Caladian becoming a target of spies and saboteurs, Tyro felt honored, as that meant he was becoming more important."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tyro Caladian first appeared in the novel Jedi Quest: The School of Fear, written by Jude Watson and published by Scholastic in 2003. Caladian made successive appearances in further novels by Watson. He also shared an entry with Curran Caladian in The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "Jedi Quest: The False Peace heavily implies that Tyro had managed to find information related to Palpatine's secret scheme to take over the Republic and become Galactic Emperor, and thus Palpatine sent the seeker droid to kill the Svivreni, silencing him. A major hint is that seconds before his death, he looks over Kenobi's shoulder and trembles in fear at the sight of Palpatine—although Kenobi believes that it was simply death that had filled Caladian with dread. Another hint is the strange comlink static that prevents Caladian from telling Kenobi all the details of a conspiring \"great evil\" at the \"highest level\" of governance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}