{"url": "Battle_of_the_Maw", "categories": ["Category:Legends articles", "Category:Battles in the Maw", "Category:Battles of the Daala campaign"], "nodes": [{"tag": "h1", "text": "Battle of the Maw"}, {"tag": "p", "text": "The Battle of the Maw in 11 ABY was between the New Republic and Admiral Daala's remaining forces including her flagship Gorgon and Tol Sivron's Death Star prototype."}, {"tag": "h2", "text": "Battle"}, {"tag": "h3", "text": "Buildup"}, {"tag": "p", "text": "Prior to this, the long dead Sith Lord Exar Kun had been defeated for all time and his grip on Kyp Durron ended. Earlier, under the influence of the Sith Lord, Kyp had destroyed the Cauldron Nebula and Carida. With the vile spirit destroyed, Kyp came back to his senses and surrendered to Han Solo. At the New Republic Senate on Coruscant, Chief of State Mon Mothma decided that the Jedi Master Luke Skywalker should decide the punishment for Kyp Durron. Skywalker decided that the Sun Crusher had to be destroyed and that Kyp Durron would do it to pay back for the carnage he had caused. Together, they would go to the Maw Cluster and plunge the superweapon into the galaxy's black holes where it would be destroyed for all time."}, {"tag": "p", "text": "Meanwhile, with Daala's forces driven from the Maw Installation, the New Republic sent a force to occupy it. Accompanying the task force were the Wookiee Chewbacca—who wanted to free the remaining Wookiee slaves at the installation—and the former Imperial scientist Qwi Xux. However, she would never regain her lost memories. The New Republic task force traveled through the dangerous black hole cluster and eventually reached the Maw Installation."}, {"tag": "h3", "text": "Battle"}, {"tag": "p", "text": "On its arrival, the fleet captured the Maw Installation with minimal resistance. The Installation's staff managed to destroy one of the New Republic's corvettes with a prototype Metal-Crystal Phase Shifter, but the fleet quickly opened fire on and destroyed the section of the installation housing the MCPS, rendering the remainder of the installation defenseless. The Twi'lek administrator Tol Sivron took the Death Star prototype and escaped into space with a majority of the Installation's personnel."}, {"tag": "p", "text": "Upon capturing the Installation, the New Republic troops confiscated documents and unfinished works that had been under development by the scientists at the Installation for use by the New Republic. Though Qwi Xux could not recall any details during her visit, she discovered the true colors of the Empire that she had served and realized that they had misled her. Shortly after, they were interrupted by the arrival of Daala's flagship Gorgon—the sole remaining Star Destroyer in her guardian fleet. The other, Basilisk, was destroyed when Kyp Durron obliterated the Cauldron Nebula with the Sun Crusher in an attempt to destroy Daala and her fleet."}, {"tag": "p", "text": "Upon seeing the New Republic stripping away the weapons discoveries in the Maw Installation, Daala was furious as Grand Moff Tarkin had assigned the protection of the station to her. With her remaining Star Destroyer, Daala assaulted the New Republic forces as they scrambled to defend themselves. Meanwhile, Tol Sivron took the Death Star Prototype out of the Maw Cluster to the nearby Kessel system and used the superweapon's super laser to destroy Kessel's Garrison Moon. However, upon receiving coordinated resistance from Smugglers' Alliance vessels, Sivron retreated back into the Maw since the prototype had no TIE Fighter escorts and strategic defenses."}, {"tag": "p", "text": "Unaware of the chaos, Skywalker and Durron arrived at the Maw Cluster on their mission to destroy the Sun Crusher. Upon arriving, they saw the scrambled New Republic forces and an asteroid field which had formerly been Kessel's Garrison Moon. Racing towards the Maw Installation, the Jedi watched as the skeletal Death Star appeared in space to join Daala's Star Destroyer. Unknown to Sivron, Han Solo had managed to hide the Millennium Falcon within the tangled superstructure of the Prototype as it retreated from Kessel. Along with Lando Calrissian and Mara Jade, Solo worked to sabotage the prototype's main reactor before Sivron could fire on the Maw Installation. The Falcon retreated from the Prototype as Sivron's teams worked desperately to repair the damage done to the reactor. Once the damage was fixed, Sivron order the station to open fire on an idle CR90 corvette, completely destroying it."}, {"tag": "p", "text": "Meanwhile, Kyp Durron, wanting to make up for the suffering and deaths he had caused, raced back to the Sun Crusher, using it to engage the prototype while Chewbacca led an attack on Daala's Star Destroyer. As the New Republic force evacuated the Maw Installation, Daala opened fire on the installation's main power reactor which exploded in a large flash, apparently destroying Gorgon. However, in reality, the explosion blinded the sensors and Daala escaped to the Deep Core to join the remnants of the Empire."}, {"tag": "p", "text": "Piloting the Sun Crusher, Kyp fired his two remaining resonance torpedoes into the Death Star, but was dismayed to find that the damage they caused was insufficient to destroy or even disable the battle station. Kyp then led the prototype on a chase through the dangerous black holes of the Maw Cluster. In a final gambit, the Jedi Knight lured the prototype too close to a black hole. As the prototype reached the point of no return, Sivron managed to score a direct superlaser hit on the Sun Crusher, overwhelming its armor and causing it to lose engine power. As both the Sun Crusher and the prototype Death Star descended into the bottomless pit of the black hole, a small message pod was launched from the Sun Crusher. When the pod was recovered by Han Solo, he was astonished to find that Durron had managed to cram himself into the pod, breaking many of his of bones in the process. Kyp's survival was due to his innate ability to use a Jedi technique almost to the point of suspended animation. Kyp recovered from his wounds and served as a Jedi Knight for the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}