{"url": "Tzidik_Wrantojo", "categories": ["Category:Legends articles", "Category:Males", "Category:Podracers", "Category:Sulituans"], "nodes": [{"tag": "h1", "text": "Tzidik Wrantojo"}, {"tag": "p", "text": "Tzidik Wrantojo was a Sulituan from the planet Archae Teuthis who performed as a professional Podracer pilot during 24 BBY. Racing in a Wellos and Allos 825 Podracer, he became quite successful on the Nightlands racetrack located on the planet of Ryloth, becoming a particular favorite of the Twi'leks that lived there. He participated primarily in the Hutt Championships, racing across worlds such as Tatooine, Mon Calamari, and Gamorr."}, {"tag": "p", "text": "During 22 BBY, Podracing was garnering negative attention after a number of under-handed events connected to Podracing occurred, prompting the HoloNet News to interview Wrantojo, looking for his stance on racer safety and the sport's popularity. According to the professional pilot, the sport drew its audience from thrill seekers drawn to the sport's violence."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A slippery opponent"}, {"tag": "p", "text": "Born on the planet of Archae Teuthis, Tzidik Wrantojo was a Sulituan male who took to a daring life of speed and hazard. Leaving his homeworld, Wrantojo honed his piloting skills in the sport of Podracing, entering the sport sometime before 24 BBY."}, {"tag": "p", "text": "Piloting a Wellos and Allos 825 Podracer, Wrantojo surprised the sport with his abilities and the 825's incredible speed and handling, eventually clamoring to the top of the charts as a magnetic presence on the course that drew crowds. Due to his rather sudden arrival, the Sulituan was considered to be an enigmatic figure on the course due to his sudden appearance in the sport. Wrantojo eventually became the track favorite of the Nightlands racecourse located on the planet Ryloth, a course that was a part of the Hutt Championships. Wrantojo as such stuck mostly to the Hutt Championships circuit, a set of five courses strung about the Outer Rim Territories. Wrantojo managed to carry a number of records throughout his preferred circuit."}, {"tag": "h3", "text": "Record setter"}, {"tag": "p", "text": "The Hutt Championships began on the planet of Sullust, on the track named Serres Sarrano, located in the city of Serres Sarrano. Here, Wrantojo held the top speed records for both best lap and best three lap race, standing with the times of 1:08.97 minutes and 3:48.74 minutes respectively. The Grand Reefs, a track on the planet of Mon Calamari, was a course where the diminutive Mars Guo held the crowd's favor. Wrantojo, however, held the best 3-lap time, standing at 4:15.93 minutes. Guo didn't hold any records for the course at all. Wrantojo held no records on the course known as The Citadel, which was the next race in the Championships. On Wrantojo's preferred course of the Nightlands, Wrantojo only held the third best time for a 3-lap race, standing at 3:54.43 minutes. The Human pilot Anakin Skywalker held the top time, standing at 3:41.95 minutes. The circuit, and by extension, the entire season, ended with the Boonta Eve Classic, located on the desert world of Tatooine. Here, Wrantojo held the third best single lap time with 1:51.24 minutes. The crowd favorite, the Dug Sebulba, held the best single lap record, standing at 1:35.48 minutes."}, {"tag": "p", "text": "Two years later, Wrantojo was approached by the HoloNet News, who were writing an article relating to a series of events that were casting a harsh light on Podracing. Wrantojo stated that despite many pilots claiming that racer safety was important, everyone more or less knew that it was the danger of Podracing that sold tickets."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tzidik Wrantojo was a level headed Podracer who held no illusions about the danger of Podracing and its draw on crowds. Unlike many of the pilots during the 24 BBY season, Wrantojo was not particularly aggressive, and he held no records for knocking the competition out of races. Wrantojo primarily focused on speed, which his Wellos and Allos Podracer did best. As a result of his knack for actual racing, the Sulituan held several time records across various courses. However, if threatened, Wrantojo would certainly fight back to keep his Podracer running, and keep his opponents in the dust. Wrantojo did not think too much of pilots who participated in the Pouffra Circuit."}, {"tag": "p", "text": "Wrantojo was a Sulituan, and like all Sulituans he could move through water effortlessly with speed and agility. He possessed brown leathery skin that had bluish tints around his face and at the ends of his limbs, and had yellow-green eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Wrantojo was a Podracer who surprised the sport with his racing talent in the years before 24 BBY. Wrantojo became a dynamic presence on the course, and at some point won over the crowd on the world of Ryloth. Wrantojo managed to maintain the quick reflexes that one would need to pilot a Podracer, and as a result he managed to finish and survive several races. Wrantojo set several speed records across the board before the season's end."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tzidik Wrantojo's favored racing craft was a Wellos and Allos 825 Podracer, a craft that was distinguished for its hefty accelerator, average top speed, spectacular handling, and its useful cooling system. In addition, the vehicle was a durable racer, thus turning it into a valuable machine of both speed, agility, and strength. The colors of the Podracer primarily matched the colors represented on Wrantojo's flag. The primary color was a bright red which dominated the majority of the engines, which was highlighted by some silver details. The fins attached to the engines had cyan streaks that ran across the length of the engines. The noses of both engines were purple and silver. The cockpit was mostly a dark blue color with bright red stripes on either side of the pilot's seat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tzidik Wrantojo first appeared in the PlayStation 2 video game Star Wars: Racer Revenge as one of twenty-three playable characters. The game was developed from a partnership between LucasArts and Rainbow Studios and was released in February of 2002. His voice was provided by Gregg Berger, who also voiced another racer, Wan Sandage Jr. Players could play as Wrantojo after placing above him or knocking him out of the Nightlands track. As such, Wrantojo was the second-to-last character who could be unlocked during an initial run of the game's tournament mode."}, {"tag": "p", "text": "The character's species and homeworld, along with some of his backstory, was fleshed out in the game's companion guide, Star Wars: Racer Revenge: Prima's Official Strategy Guide, which was published alongside the game. He was later mentioned in an edition of the HoloNet News published in March 2002, only one month after the release of the game. The species name Sulituan is 'nautilus' spelled backwards, which is a real world species to which Wrantojo bears a heavy resemblance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}