{"url": "U-3PO", "categories": ["Category:Canon articles", "Category:3PO-series protocol droids", "Category:Alliance to Restore the Republic droids"], "nodes": [{"tag": "h1", "text": "U-3PO"}, {"tag": "p", "text": "U-3PO was a 3PO-series protocol droid that served the Alderaan Diplomatic Corps. After Imperial agents altered its programming, the droid became an unwitting spy in the royal court of the planet Alderaan, before being assigned to the CR90 corvette Tantive IV in 0 BBY. After corvette fled from the Battle of Scarif carrying the plans to the Death Star superweapon, the Empire used U-3PO to track the vessel to the Tatoo system."}, {"tag": "p", "text": "The Imperial I-class Star Destroyer Devastator then attacked the Tantive IV, and as laser fire from the Star Destroyer rocked the corvette, U-3PO followed the droids C-3PO and R2-D2 through the Tantive IV's main corridor, before splitting off from them down a separate corridor. After the Empire captured the Tantive IV they discovered that U-3PO could provide no further useful information and that the Death Star plans were no longer aboard."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "U-3PO was a 3PO-series protocol droid that was manufactured by Cybot Galactica and served in the Diplomatic Corps of the planet Alderaan. Agents of the Galactic Empire at some stage altered the droid's programming and turned it into an unwitting Imperial spy within Alderaan's royal court. Luckily for the Empire, U-3PO was assigned to the CR90 corvette Tantive IV just before the vessel was assigned a mission in 0 BBY to travel to the planet Tatooine and recruit the Jedi Master Obi-Wan Kenobi to the Alliance to Restore the Republic."}, {"tag": "p", "text": "However, before the vessel was ready to depart for the mission from the headquarters on the moon Yavin 4, the Alliance Fleet was scrambled to travel to the Scarif system to support Alliance forces attempting to steal the plans for the Death Star superweapon. While under repairs, the Tantive IV was carried to the Scarif system on board the MC75 Star Cruiser Profundity, which then took part in attacking the Imperial forces stationed above the planet Scarif. During the battle, the plans were transmitted from the planet's surface to the Profundity, but before it could retreat, the cruiser was disabled by the Imperial I-class Star Destroyer Devastator. As Imperial forces led by the Sith Lord Darth Vader boarded the Profundity, the plans were transferred onto the Tantive IV which then launched from the cruiser and fled from the Scarif system."}, {"tag": "p", "text": "The Tantive IV jumped to the Tatoo system, the target of its original mission; however, U-3PO's altered programming allowed the Devastator to track the fleeing corvette and follow them with the aim of reclaiming the stolen plans. As the Tantive IV tried to get as close to the planet Tatooine as possible, the Star Destroyer opened fire on it. During the attack, Organa summoned the protocol droid C-3PO and the astromech droid R2-D2 to her, and U-3PO followed the pair down the main corridor of the ship as the corvette shuddered from being struck by fire. U-3PO then turned off down a side corridor but the other droids carried on and left it to do its job. The Empire successfully captured the vessel and Organa, but discovered that U-3PO had no useful information to deliver and that the plans were no longer on board, as Organa had given them to R2-D2 before it escaped from the Empire in an escape pod."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "U-3PO had silver plating and yellow sensors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "U-3PO first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. In the new Star Wars canon, it was first identified in the 2017 reference book Ultimate LEGO Star Wars. The name originated in the Star Wars Legends continuity, where it was first used on a card in the 1995 A New Hope Limited set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}]}