{"url": "Ucce%27s_servant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Servants", "Category:Unidentified individuals"], "nodes": [{"tag": "h1", "text": "Ucce's servant"}, {"tag": "p", "text": "A servant of the slave trader Lady Ucce was of a species that had hairy protuberances. This individual traveled to Crseih Station aboard her starship, and was on board when Leia Organa Solo boarded, seeking the whereabouts of her kidnapped children."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 14 ABY, this individual served Lady Ucce, a slave trader and supporter of the underground Imperial movement known as the Empire Reborn. That group, headed by Lord Hethrir, sought to oust the New Republic and replace it with a new Empire with the Force-sensitive Hethrir as its Emperor. The movement was financed by trade in slaves, patronized by Lady Ucce and other Imperial nobility. Ucce and her servant traveled to Crseih Station to witness the sacrifice of Anakin Solo, son of New Republic Chief of State Leia Organa Solo, by Hethrir to the Waru, a being from a parallel universe. The servant stayed behind on Ucce's golden starship and encountered Organa Solo. In the belief that Organa Solo was interested in purchasing slaves, the servant directed her to find Lady Ucce at the Crater Lodge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Physical appearance"}, {"tag": "p", "text": "Lady Ucce's servant was a member of a sentient species with hairy, flexible protuberances, each of which terminated in a starburst of fleshy tendrils. Those appendages functioned as sensory organs: the tendrils inclined in the direction in which the individual focused the senses and wriggled. The servant was capable of speaking Galactic Basic Standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vonda N. McIntyre created this character for her novel The Crystal Star, published in 1994 by Bantam Spectra. The character, and its species, were not named."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}