{"url": "Battle_of_the_Naboo_resistance_base", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Battle of the Naboo resistance base"}, {"tag": "p", "text": "A battle took place around a Naboo resistance base during the Trade Federation's invasion of Naboo in 32 BBY. It took place simultaneously with the battle raging on the Great Grass Plains. The Trade Federation Droid Army sent three elements to the Plains; one engaged the Gungan Grand Army head-on, one flanked Theed's south ridge, and the third element flanked the plains and discovered a Naboo Resistance outpost. The last element engaged the base, but was countered by the spacers Nym and Vana Sage. The two pilots joined with the Naboo to defend the base and destroyed numerous vehicles. The battle dragged on, but the two spacers were joined by Bravo Flight pilot Rhys Dallows and the Toydarian mercenary Reti. With a reinforced squadron, Nym was able to fight off the rest of the battle droids. Destroying an element of the Droid Army allowed the Grand Army to hold out while Bravo Flight destroyed the Lucrehulk-class Droid Control Ship in orbit and ended the invasion."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Trade Federation invaded the planet Naboo in 32 BBY in response to taxation of the Outer Rim trade routes. The Royal Naboo Security Forces became embroiled in a desperate battle for their planet. The Queen fled to Coruscant to find a way to end the invasion in the Galactic Senate but returned home to free the planet. She planned on using Gungan Grand Army to draw out the main part of the Trade Federation Droid Army while the she led a ground assault of the capital city of Theed. The Trade Federation sent three armies to engage the Gungans. Army A engaged the Gungan army head-on, Army B flanked from the side of the Plains, and Army C approached from the south ridge of Theed. Army B discovered a Resistance outpost on the Plains and engaged it. The pirate Nym, after losing his base to the Trade Federation, agreed to join forces with the Naboo resistance and engaged Army B."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "A scout found the approaching Army B and raced back to warn the base. The outpost commander ordered the outpost to prepare for battle. The Federation deployed Heavy Artillery Guns to engage the outpost. The resistance's laser turrets opened fire on the tanks. The spacers Nym and Vana Sage were flying overhead searching for the Federation army, so the commander contacted them and asked them to protect the outpost. Nym used the Bomblet generator on his starfighter, the Havoc to take out the enemy artillery. The outpost commander kept up a running commentary as Nym attacked the tanks."}, {"tag": "p", "text": "While Nym was attacking the HAGs, two Federation C-9979 landing craft and several dropships landed and disgorged a number of Armored Assault Tanks to attack the outpost. A squadrons of Scarab droid starfighters arrived to support the tanks. Sage engaged the fighters in her personal fighter, the Guardian Mantis. Even though the first wave was destroyed, more droid starfighters and a squad of droid bombers joined the fight. Sage commented to Nym that they were outnumbered, but Nym was determined to fight to the end. Nym's wingmate and Bravo Flight pilot Rhys Dallows as well as the Toydarian Reti arrived at that moment to support the Naboo outpost. Nym told them to attack anything that moved. With a reinforced squadron, Nym was able to fight off the rest of the Federation forces and save the outpost from destruction. The outpost commander thanked the pilots as they flew off."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a third of the Federation army had been destroyed at the outpost, and another third destroyed by Gavyn Sykes at the south ridge of Theed, the Gungans were able to hold out long enough for the Naboo Security Forces to infiltrate Theed. With the Lucrehulk-class Droid Control Ship ship in orbit destroyed, the invasion ended with the capture of Viceroy Nute Gunray."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was a mission appearing in the 2001 video game Star Wars: Starfighter and was mentioned in the Gungan civilization DataBank entry in the video game Star Wars: Galactic Battlegrounds, released later that year. The event was later given an indirect mention when describing a diagram of the Battle of Grassy Plains in The New Essential Guide to Vehicles and Vessels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}