{"url": "Battle_of_the_Murgo_Choke", "categories": ["Category:Legends articles", "Category:Battles in Wild Space", "Category:Battles of the Dark Nest Crisis"], "nodes": [{"tag": "h1", "text": "Battle of the Murgo Choke"}, {"tag": "p", "text": "The Battle of the Murgo Choke was a battle that occurred during the Dark Nest Crisis, and a conflict which led into the beginning of the Swarm War. It was fought between the Galactic Federation of Free Alliances, with the help of the New Jedi Order, against the Killik Colony and the Dark Nest behind it."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Murgo Choke was a group of four blue-white stars near the Utegetu Nebula. The intense gravity wells exerted by the four stars prevented any sort of hyperspace travel, hence the name \"Murgo Choke\". The Killiks had built fifteen nest ships, with which they were going to leave Utegetu and attack both the Chiss and the Galactic Alliance. The Fifth Fleet, under the command of the Bothan Admiral Nek Bwua'tu, had blockaded the Choke as Killik nests violated the Qoribu Truce and expanded on Chiss space again. Leia Organa Solo and Saba Sebatyne were being held on the Admiral Ackbar as they were trying to rescue Han Solo and Luke Skywalker who were on Woteba, the headquarters of UnuThul and the Colony. Their team of Jedi in StealthXs, Mara Jade Skywalker among them, had no choice but to put themselves in Jedi trances and wait for rescue."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Bwua'tu wanted to capture these StealthX pilots. Meanwhile, Luke Skywalker, Han Solo, Jae Juun, and Tarfang were trying to find and kill Lomi Plo, the Queen of Gorog, the Dark Nest. To achieve this end, they traced the Dark Nest to the Tusken's Eye and stowed away on the Gorog nest ship. Earlier on, the partnership of Juun and Tarfang had delivered Killik spinglass busts of Bwua'tu to the Admiral Ackbar. Unbeknownst to them, the busts each contained a number of tiny Gorog assassin bugs, which were released at about the same time as the Killik nest ships jumped from the Tusken's Eye to the Choke and made their move on the blockade. The blockade largely consisted of the Admiral Ackbar, the Mon Mothma, and the capital ships' starfighter squadrons. With his ship being infiltrated and the Killiks trying to break his blockade, Bwua'tu ordered Mara's team, together with the newly arrived squadron led by Kyp Durron, onto his ship for refueling, then to go out and fight."}, {"tag": "p", "text": "Although Bwua'tu and his crew fought bravely, with the aid of Leia Organa Solo and Saba Sebatyne, they could not hold the Ackbar and were forced to abandon it. UnuThul, on his flagship of a Lancer-class frigate, used the Force to deflect Alliance turbolaser bolts and attempted to neutralize Leia through a mental Force attack. The Killiks, led by Alema Rar, seized the Ackbar and left the Choke to attack the Chiss. Meanwhile, Skywalker and his team had to face down Lomi Plo on the surface of the Gorog nest ship. They managed to send Plo into retreat, but Skywalker was hurt. The battle ended with four Killik nest ships and the Ackbar escaping the Choke."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Which side gained victory is questionable. The Galactic Alliance managed to partially hold their blockade and keep eleven nest ships at the Choke, including \"Bug One\", the Dark Nest's nest ship. In order to make the Colony think twice before further advancing, Bwua'tu ordered Darklighter to initiate aggressive actions to maintain the Alliance blockade. The Chiss Ascendancy, on the other hand, believed that the Alliance had actually given the Ackbar to the Killiks to use against them. Regardless, with the Chiss determined to take aggressive actions against the Colony, and the trust between the Chiss, the Alliance, and the Jedi broken, the Swarm War began."}, {"tag": "h2", "text": "Appearances"}]}