{"url": "Ugnaught", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Enslaved species", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Ugnaughts"], "nodes": [{"tag": "h1", "text": "Ugnaught"}, {"tag": "p", "text": "Ugnaughts were porcine sentient humanoids that were native to the planet Gentes. The species was considered one of the hardest-working species in the galaxy. Although originating on Gentes, many Ugnaughts considered Bespin's Cloud City their home. When the Corellian Lord Ecclessis Figg decided to build a floating city on Bespin, he hired many Ugnaughts due to their reputation as industrious and loyal workers. In exchange for their service, they were given several of the lower levels of the city and built their own home there."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ugnaughts were diminutive, porcine humanoids who had pink skin, upturned noses, white hair, and thick layers of jowls. Some had tusks that they used in blood duels, They were strong and resilient, and their life-spans reached up to more than 200 standard years. Ugnaught children were knowns as \"Ugletts.\" Members of the species who lived on Cloud City had a diet of genteslugs and various types of molds and fungi grown in dark, dank side tunnels off their main living areas. The Ugnaught's natural habitat was desert or wastelands."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Ugnaughts divided themselves into a tribal hierarchy. They favored the color red, the presence of which tended to improve their work productivity."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ugnaughts evolved on Gentes, a planet located in the Anoat sector of the Outer Rim Territories. However, throughout history, many were sold into slavery and taken to new worlds to work as indentured servants."}, {"tag": "p", "text": "When the Corellian eccentric Lord Ecclessis Figg decided to build Cloud City, a floating tibanna gas mine colony high in the atmosphere of Bespin, he brought in three Ugnaught clans to help him. In exchange for their help, the pig-like aliens were rewarded their freedom and freedom of the city. The freed slaves built a floating colony of their own, the Ugnaught Surface, with the city of Ugnorgrad as its capital."}, {"tag": "p", "text": "By the time of the Galactic Empire's blockade of the Anoat sector, few Ugnaught clans remained on Gentes, and slavers still raided their homes. Out of desperation, the porcine beings were forced to hide in the swamps and send out a distress signal, offering supplies to whoever would rescue them."}, {"tag": "p", "text": "Many Ugnaughts found work across the galaxy everywhere from the Coruscant to Lothal. One notable Ugnaught scholar and antiquities expert was Korin Pers, who managed to become a respected sava at the University of Bar'leth, in the Core Worlds."}, {"tag": "p", "text": "During the Galactic Civil War, a large group of Ugnaughts still worked on Cloud City. Some of them attempted to melt down the dismembered remains of the protocol droid C-3PO, but were interrupted by the Wookiee Chewbacca. Other Ugnaughts worked in the carbon-freezing chamber where Darth Vader ordered Han Solo be frozen in carbonite."}, {"tag": "p", "text": "Many Ugnaughts who remained on Gentes were sold into slavery and were spread throughout the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}