{"url": "Ugor_homeworld", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Airam sector planets", "Category:Destroyed planets", "Category:Terrestrial planets", "Category:Unidentified planets"], "nodes": [{"tag": "h1", "text": "Ugor homeworld"}, {"tag": "p", "text": "The Ugor homeworld was a planet in the Paradise system—known as J21-Z65 on most star charts—in the Airam sector of the Outer Rim Territories, at galactic coordinates M-20. The Ugor species evolved on the world. Although knowledge of the planet had been lost by the time of the Galactic Civil War, the Imperial sentientologist Obo Rin speculated that conditions there must have been perfect to allow for large, unicellular beings like the Ugors to evolve. It must have had easily obtainable nutrients, for example, and an absence of predatory species."}, {"tag": "p", "text": "The planet also had vast natural resources, which the Ugors used to develop new technologies. This preceded their philosophical development, however, and the species unwisely overpopulated the world and polluted it with industrial waste. Rather than rectify the situation, though, the Ugors evolved the ability to survive in such conditions."}, {"tag": "p", "text": "After the Ugors developed space flight and took to roaming their system on starships, they blew their homeworld to pieces, along with the other worlds of the Paradise system, to make way for a system-spanning junkyard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ugor homeworld—as well as its ultimate fate—were first mentioned in Scavenger Hunt, an adventure scenario written by Brad Freeman for the West End Games Star Wars: The Roleplaying Game in 1989. Other sources have repeated the story and added a few more details, although the world is still largely undescribed. The cover of Scavenger Hunt mentions a \"Paradise sector,\" although The Essential Atlas and Star Wars: The Essential Atlas Online Companion have shown that this was a misprint for \"Paradise system.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}