{"url": "Ugnaught_rebellion", "categories": ["Category:Legends articles", "Category:Rebellions and uprisings", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Ugnaught rebellion"}, {"tag": "p", "text": "The Ugnaught rebellion was an uprising that took place in Cloud City on the planet of Bespin shortly after the Battle of Hoth."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Lando Calrissian, who had been the Baron Administrator of Cloud City during the Galactic Civil War, was forced to flee his position in the face of an Imperial occupation as well as to rescue his captured friend, Han Solo from the clutches of Jabba the Hutt. In his absence, Cloud City and the tibanna gas mines on Bespin fell under Imperial control. The Emperor dispatched an Imperial Navy officer named Captain Hugo Treece to take control of the city, its gas processing facilities, and effectively the planet itself."}, {"tag": "p", "text": "Captain Treece would become involved in an embezzling scheme taking place in the city. In order to cover up discrepancies in his account activity he attempted to save on labor costs in Cloud City by enslaving the city's Ugnaught population."}, {"tag": "h2", "text": "Revolution"}, {"tag": "p", "text": "After a short period of time the Ugnaught workers grew tired of their slavery and staged an uprising, which was led by the wealthy King Ozz. The revolutionaries went to the underbellies of the refineries and planted twelve talking bombs at different locations throughout the city. They alerted Captain Treece to their plan and allowed him the opportunity to evacuate the city. However, Treece had the cyborg aide Lobot slice into the central computer to temporarily deactivate all of the bombs."}, {"tag": "p", "text": "Shortly thereafter King Ozz was reunited with Calrissian. Lando learned of the enslavement of the Ugnaughts and promised to assist them in overthrowing the Imperial occupation and enslavement. They boarded several floatboats and departed from the marshland city of Ugnorgrad and headed for Cloud City itself."}, {"tag": "p", "text": "Meanwhile, Luke Skywalker and Shira Brie likewise landed in Cloud City. They located the Imperial garrison and engaged in a firefight with Captain Treece's stormtrooper squads."}, {"tag": "h2", "text": "Resolution"}, {"tag": "p", "text": "Luke Skywalker used the power of the Force to trip the primers on all of the talking bombs. However, this effort did not cause the actual bombs to detonate. Treece and his men erroneously believed that the bombs had exploded and that Cloud City was going to fall into the core of Bespin. Treece ordered a strategic withdrawal and his Imperial regiment abandoned the planet, ending the slavery of the Ugnaught tribes. The Ugnaught holojournalist, Ars Fivvle, filmed the final moments of the epic struggle from the prow of his floatboat. Ars' journalistic contributions to this historical event earned him planet-wide recognition."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once the fighting was over Lando instructed Lobot to slice into Captain Treece's bank accounts on Aargau. He transferred a large sum of Treece's embezzled funds and re-deposited them into Darth Vader's private banking account. This act completely exposed Treece's covert actions to the Emperor. When Emperor Palpatine discovered what Treece had been involved with, he had him summarily executed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}