{"url": "Uffel_droid_community", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Expansion Region organizations"], "nodes": [{"tag": "h1", "text": "Uffel droid community"}, {"tag": "p", "text": "During the waning years of the Galactic Republic, a droid community colonized the moon Uffel in the Cularin system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, two Twi'leks traveled to carry out a mining survey on the moon Uffel, but during their expedition, their starship crashed on the world and the Twi'leks perished. However, three droids survived the impact, the astromech droids R4-J9 and R4-S2, and the droid administrator QS-2D. Deciding that the death of its owners rendered it independent, QS-2D re-programed the two astromechs to serve him and with the aid of the Hutt crime lord Riboga, the administrator acquired more droids and established a mining operation on the moon. QS-2D reinvested the profits generated from the operation to buy further equipment and open a droid manufacturing plant on Uffel, and within a few years, there were hundreds of droids inhabiting the moon."}, {"tag": "p", "text": "The mines later began to run dry and QS-2D started work on the development of new droid designs, and the Uffel droids commenced the manufacture of MSF droids, a variant of the MSE-series mouse droid. By 31 BBY, over a thousand droids lived on Uffel, and the bulk of them inhabited the spaceport X2-4."}, {"tag": "p", "text": "In about 31 BBY, the rogue droid LN-73 fell to the surface of Uffel during a debris storm and sabotaged the world's droid production operation, in an attempt to subjugate the Uffel droids. However, LN-73 was soon defeated by the Heroes of Cularin, a group of freelance agents that were hired by HG-211, the Uffel droids' security chief. Later, during the time of the Clone Wars, a force of Thaereian military soldiers landed on Uffel, planning to seize control of the moon's manufacturing facilities. The arrival of the invaders triggered the activation of a protocol hidden withing the programing of half of the droids of Uffel, which rendered them hostile to all organic beings. As a result, a schism developed among the droids, with HG-211 becoming the leader of a loyalist faction that were not programed with the protocols, and the droid administrator N-4PO becoming the leader of an anti-organic faction. The Heroes of Cularin traveled to the moon to aid the loyalists, and they repulsed the Thaereians from the moon."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the anti-mechanical Red Knights of Life attacked the Uffel droid colony, but were driven away by the Shard Jedi known as the Iron Knights."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}