{"url": "Uffel", "categories": ["Category:Legends articles", "Category:Thaere sector moons", "Category:Type IV atmosphere moons", "Category:Uffel locations"], "nodes": [{"tag": "h1", "text": "Uffel"}, {"tag": "p", "text": "Uffel was a droid manufacturing moon run, inhabited, and owned entirely by droids. The celestial body occupied the second orbit around the planet Genarius. The moon had a poisonous atmosphere, which was so thick that the planet was kept perpetually in twilight during its day. The first droids came to Uffel with a pair of Twi'leks who were mounting a survey of the moon in 90 BBY. Their ship crashed and the Twi'leks were killed, but the modified protocol droid QS-2D accompanying them survived, along with two R4 units, R4-S2 and R4-J9."}, {"tag": "p", "text": "Determining they were free, QS-2D decided to mine the moon. It contacted Riboga the Hutt and arranged for more droids to be delivered for its operation in return for a cut of the mining profits. The mining was successful, and the droids kept building up their operation, expanding into droid manufacturing, with the MSF-series mouse droid being their greatest success. With that line's profits, QS-2D was able to buy out Riboga's interests shortly before Riboga left the system in 53 BBY."}, {"tag": "p", "text": "In a few years, QS-2D built the mechanic city of X2-4, which included a single-droid-controlled spaceport, but not any accommodation of organics: visiting clients were supposed to use pressure suits. As the droids lacked greed, the incomes were used to improve and maintain the city. QS-2D also designed war droids to protect the factory from any organic attack, led by HG-211; and engineering droid G-8Y5 to develop, maintain and improve the droids in Uffel; G-8Y5 was responsible of the design of local space defense weapon platforms. The Uffel droid designs expanded through the Cularin system and many people in Genarius said that their strange-looking droid was a prototype from Uffel."}, {"tag": "p", "text": "After the success of the MSF droid, the initial crash-landing settlement was abandoned in favor of X2-4; the initial mines were also abandoned when they dried out, but the droids looked for other mines to work at."}, {"tag": "p", "text": "At some point before 32 BBY, Alderaanian politician Barnab Chistor satisfied his exploring urges of youth by joining an expedition to Uffel. Chistor discovered that scouting was too uncomfortable for his tastes and, when he returned to Cularin, he devoted himself to politics."}, {"tag": "p", "text": "Uffel was vainly attacked by four pirate ships in 33 BBY, before the Trade Federation left the Cularin system. The platforms destroyed three ships and shot down the last one; the surviving crew were killed by war droids after the landing."}, {"tag": "p", "text": "In 31 BBY, rumor said that Uffel was accepting contracts to design mining machinery able to withstand the conditions of Acilaris, the innermost world in the Cularin system, which was too hot to allow any activity."}, {"tag": "p", "text": "At some point during the Yuuzhan Vong War (25-29 ABY), the New Jedi Order-aligned Iron Knights repelled an attack on Uffel by the Red Knights of Life, a Yuuzhan Vong-allied group who abhorred technology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}