{"url": "Udrai", "categories": ["Category:Canon articles", "Category:Imperial Navy officers of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Udrai"}, {"tag": "p", "text": "Udrai was a male commander in the Galactic Empire's navy who served aboard the Star Destroyer Determination. After the destruction of the Death Star in 0 BBY, the commander told an Imperial squadron to come forward to ask for help if they had troubling thoughts. After Lieutenant Tarvyn Lareka identified this with Captain Iden Versio, the lieutenant informed Udrai of the captain's thoughts. The commander attempted to reach them, but a squad of stormtroopers arrested the pair first."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, Udrai served as a commander in the Galactic Empire's navy aboard the Star Destroyer Determination. Following the Battle of Yavin in 0 BBY, which saw the destruction of the Empire's Death Star superweapon, he took aside a squadron, advising the TIE pilots to come forward to him if they needed any help. One of the squadron, Lieutenant Tarvyn Lareka, became worried that Captain Iden Versio, a veteran of the Battle of Yavin who had recently transferred to the Determination was having the troubling thoughts that Udrai had mentioned."}, {"tag": "p", "text": "The lieutenant had a conversation with Versio about her thoughts, where he secretly recorded the captain expressing her disgust for the Empire's obliteration of the planet Alderaan and her support for the ideals of the rebel extremists known as the Partisans. Lareka sent the recording to Udrai, who replied via message that he was on his way, informing the lieutenant that he had done the right thing. However, Versio and Lareka were arrested by a squad of stormtroopers before the commander could reach them, the former most being put on trial."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male individual, Udrai offered help to anyone having troubling thoughts following the Death Star's destruction. When Tarvyn Lareka informed the commander of Iden Versio's thoughts, Udrai assured the lieutenant through message that he had done the right thing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Udrai was mentioned in the 2017 novel Battlefront II: Inferno Squad, written by Christie Golden."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}