{"url": "Uj%27alayi/Legends", "categories": ["Category:Legends articles", "Category:Cakes", "Category:Mandalorian food"], "nodes": [{"tag": "h1", "text": "Uj'alayi"}, {"tag": "p", "text": "Uj'alayi, or uj cake when translated from the Mando'a language into Galactic Basic Standard, was a traditional Mandalorian dessert. A flat, dense, and sticky cake, uj'alayi was made using crushed nuts, dried fruits, and a sweet spiced syrup known as uj'ayl. A favorite among Mandalorian soldiers, the extremely sweet-tasting uj cake was a mainstay dessert at Mandalorian meals and get-togethers."}, {"tag": "p", "text": "During his years spent on the planet Kamino training clone commandos as a member of the Cuy'val Dar, veteran Mandalorian soldier Kal Skirata had shipments of uj'alayi brought in by clone template and Mand'alor Jango Fett. Skirata shared the uj cake with his clone trainees, and many grew up with a fondness for the dessert. Later, following the end of the Clone Wars and the rise of the Galactic Empire, the Skirata clan enjoyed uj cake during several clan dinners at their home on Mandalore. A group of Mandalorian supercommandos aboard a Tra'kad-class assault ship also partook of an uj'alayi cake prior to an assault on a Turbulent-class Star Destroyer in 41 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Uj cake—the Basic language rendering of the native Mando'a word, uj'alayi—was a unique culinary creation of the Mandalorian culture. A flat, dense, amber-colored cake, uj'alayi was sweet to the taste and very filling. Uj cake was made from a combination of spices, dried fruits, crushed and ground nuts, and the scented uj'ayl syrup that gave the cake its sticky composition and sweet taste. The high sugar content meant even unpreserved uj cake could last for years."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Uj cake originated as rations for ancient Mandalorian soldiers, who could cook it in a helmet before preserving for later consumption."}, {"tag": "p", "text": "As a member of the Cuy'val Dar, veteran Mandalorian soldier Kal Skirata spent close to ten years on the planet Kamino, located in the Wild Space region of the galaxy, training the clone commandos of the developing Grand Army of the Republic. During this period of time, Skirata received shipments of uj cake and alcoholic tihaar from the army's clone template and Mandalorian leader, Jango Fett. Skirata shared his cache of uj'alayi with his commando trainees during their off-duty time on Kamino, and uj cake was the first meal the Mandalorian training sergeant shared with the Null-class ARC troopers, whom he would later adopt as his sons. Eating uj cake with Skirata was one of the fondest memories clone commando RC-1136—known informally as Darman—had of his training on Kamino."}, {"tag": "p", "text": "In 19 BBY, following the end of the Clone Wars and the transformation of the Galactic Republic into the new Galactic Empire, the Mandalorian woman Parja Bralor taught her husband, Fi Skirata, how to make uj cake. The former clone soldier and adopted son of Kal Skirata, Fi had come to live at the Skirata clan's home on Mandalore following his desertion from the Republic's Grand Army. A few weeks after the rise of the Empire, he put his wife's teachings into action, baking an uj cake for his clan mates. A short while later, during an unofficial celebration of the coming of spring in Mandalore's northern regions, the clan put together a small feast that included uj'alayi among several other snacks."}, {"tag": "p", "text": "Decades later, amidst a meeting of the Mandalorian clans at the communal MandalMotors Hall in 40 ABY, clan chieftain Baltan Carid referenced uj cake as a potential souvenir for hypothetical tourists traveling to Mandalore. That same year, during a family dinner at his farm outside of Mandalore's capital city of Keldabe, Medrit Vasur served a plate of uj'alayi for desert. Early in the following year, Mandalorian forces were contracted to capture the Turbulent-class Star Destroyer, Bloodfin. Aboard a new Tra'kad-class assault ship prior to the attack, uj cake was enjoyed by the embarked Mandalorians and the Jedi Knight Jaina Solo, who had been spending time on Mandalore in order to learn new techniques to combat users of the Force, including her recently turned Sith Lord brother, Darth Caedus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Uj'alayi was first introduced to the Star Wars universe in the 2004 tie-in novel to the Star Wars: Republic Commando video game, Republic Commando: Hard Contact by author Karen Traviss. It was featured throughout Hard Contact's numerous sequel's in Traviss' Republic and Imperial Commando series, including Triple Zero, True Colors, Order 66, and Imperial Commando: 501st. The Star Wars Insider article, The Mandalorians: People and Culture, detailed information on the Mandalorian cake, and uj'alayi also appeared in two of Karen Traviss' entries into the multi-author novel series, Star Wars: Legacy of the Force, entitled Sacrifice and Revelation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}