{"url": "Ulgo", "categories": ["Category:Legends articles", "Category:Duloks", "Category:Kings", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ulgo"}, {"tag": "p", "text": "Ulgo, who claimed to hold the title King Ulgo the Magnificent, was a male Dulok from the forest moon of Endor, where he lived in a cave near the Canyons of Mist. There he was confronted by a group of Ewoks from Bright Tree Village, who had been misled by another Dulok named Vulgarr to believe a monster lived in Ulgo's home. When the Ewoks rescued a group of lantern birds that Ulgo planned to eat, he attempted to attack them but fell to his death in the ensuing struggle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Dulok Ulgo lived on the forest moon of the planet Endor, homeworld of his species. He claimed to be king of all Duloks, but lived alone near the Canyons of Mist in a cave high in the canyon walls near the Whispering River. There, he set snares made from stranglevine to capture lantern birds, which he both ate and used as a light source within his dark cave. Ulgo at one point interacted with Vulgarr, another Dulok who claimed the title of king, and traded him a pair of lantern birds in exchange for a vest made from the furs of Ewoks, another sentient species who called the moon home. Vulgarr later made plans to capture the Woklings of an Ewok settlement named Bright Tree Village, and in order to draw the village's warriors away first captured a single wokling named Malani. Vulgarr then visited the Ewoks and claimed a great monster had taken the child, directing them to Ulgo's home, which he claimed was the monster's lair."}, {"tag": "p", "text": "The warriors of Bright Tree Village followed the Whispering River to Ulgo's home using gliders, where Ulgo confronted them and order them to leave his land. The warriors' leader, Chief Chirpa, explained that Vulgarr had misled them, causing Ulgo to show off the Ewok fur vest the other king had traded him. This upset the Ewoks, especially the warrior Pondo, who attempted to attack the Dulok before being constrained by his colleagues. Ulgo reacted to the attempted attack by threatening the Ewoks, who made to leave."}, {"tag": "p", "text": "Before departing, however, Warok, the father of Malani, took the caged lantern birds Ulgo was carrying and informed him that the creatures were servants of the Great Spirit of the forest and must be set free. Enraged at losing his breakfast, Ulgo lunged at the Ewok, who side stepped the attack and accidentally knocked the Dulok with his glider, sending the king tumbling off a cliff into the canyon below. At first the Ewoks believed Ulgo would survive the fall by landing in deep water, but a strong gust of wind changed the falling Dulok's path and caused him to land on a large flat rock, which killed him. Chirpa then whispered an oath for Ulgo, as the Ewoks did for any forest creature who died."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ulgo lived alone in the Canyons of Mists, but nevertheless, claimed to be king of all Duloks. He considered Vulgarr, another Dulok king, to be a fool because he was willing to trade a fine Ewok fur vest for two lantern birds. When angered by the warrior of Bright Tree Village, the Dulok hissed and spit at them, threatening to use their fur to make foot wipes. An elderly, bent and wizened Dulok, Ulgo had mangy fur and spoke in a deep, growling voice."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of his meeting with the warriors of Bright Tree Village, Ulgo carried a long-handled flint axe and wore a fine Ewok fur vest. He used a small portable wooden cage to contain captured lantern birds, which he used as a light source."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ulgo was created for the children's novel The Adventures of Teebo: A Tale of Magic and Suspense, which was written by Joe Johnston and released in 1984."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}