{"url": "Ulaha_Kore", "categories": ["Category:Legends articles", "Category:Bith", "Category:Females", "Category:Jedi Consulars", "Category:Jedi Knights of the New Jedi Order", "Category:Mathematicians", "Category:Musicians", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Ulaha Kore"}, {"tag": "p", "text": "Ulaha Kore was a female Bith musician and Jedi Knight of the New Jedi Order who fought during the Yuuzhan Vong War. Possessing an innate gift for both strategic analysis and the composition of music, Kore had a prominent role as a Jedi tactician. In 25 ABY, when the extragalactic Yuuzhan Vong species invaded the galaxy and attacked the New Republic and the New Jedi Order, Kore soon found herself involved in the management of the Order's war. When the Yuuzhan Vong deployed voxyn—bioengineered creatures bred to hunt and eliminate Jedi—in the second year of the war, Kore and a number of the Order's younger Jedi prepared to confront the threat."}, {"tag": "p", "text": "A strike team, of which Kore was a member, was organized under the auspices of Jedi Master Luke Skywalker, with orders to destroy the facility over the occupied world of Myrkr where the voxyn were being cloned and trained. Accompanying the strike team as an analyst and tactician, Kore was severely wounded during the insertion into Yuuzhan Vong territory and was subsequently tortured extensively as the Yuuzhan Vong attempted to break the spirit of the Bith and her companions. Although the strike team was able to seize control of the Yuuzhan Vong vessel aboard which they had been incarcerated, Kore was too badly injured to accompany the team to the voxyn cloning facility. The dying Bith musician instead sacrificed herself to bolster the mission's chances of success."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Wartime Jedi"}, {"tag": "p", "text": "A female Bith, Ulaha Kore was Force-sensitive and was trained as a Jedi in Luke Skywalker's New Jedi Order. Alongside her innate ability to manipulate the Force, Kore was also a talented musician, an inherent gift that secured her invitations to elite social gatherings throughout her life. Kore's training was successful and she constructed her own lightsaber and achieved the rank of Jedi Knight. In 25 ABY, the galaxy and its reigning galactic government, the New Republic, was invaded by a race of extragalactic beings known as the Yuuzhan Vong, who waged a holy crusade against the inhabitants of the galaxy and sought to take it as their own. Both the Jedi and the New Republic suffered losses throughout the opening months of the war as the Yuuzhan Vong advanced from the Outer Rim Territories upon the Core Worlds. The Jedi lost much of the public's faith following the destruction of Ithor, which was blamed on Jedi Master Corran Horn."}, {"tag": "p", "text": "In 25.7 ABY, Kore was present at the Jedi Praxeum on the moon Yavin 4 when a smuggler, Talon Karrde, arrived to deliver important information concerning the Yuuzhan Vong advance. Karrde had ascertained that following a peace accord between Hutt Space and the Yuuzhan Vong, the trade of spice to key systems such as the Corellian system, the Tynnani system and Bothan sector had ceased, leading Karrde to believe that the Yuuzhan Vong planned to attack one of those three locations imminently. Kore was uncertain as to why Karrde had approached the Jedi with this information rather than the New Republic Defense Force or the upper echelons of the government; the smuggler answered that the public image of the Jedi had been tarnished following the destruction of Ithor and that by procuring intelligence on the invaders' next target the Jedi could recoup their losses. In fact, the Yuuzhan Vong had ensured the cessation of the spice trade to Corellia, Tynna and Bothawui as part of a ruse to draw attention to those areas so that they could launch a sneak attack on Fondor, where the New Republic suffered a heavy defeat a short time after Karrde delivered his information."}, {"tag": "p", "text": "Following the defeat at Fondor, the Yuuzhan Vong made advances along the Corellian Run toward the Inner Rim and the Core Worlds. Jedi Master Skywalker regularly began convening meetings of Jedi on the galactic capital of Coruscant in order that strategy could be discussed. An expert mathematician, Kore often sat in on the strategy sessions along with a number of other Jedi. At one such meeting, Kore listened as Skywalker took reports from a selection of Jedi on a balcony in Coruscant's government district. The assembled Jedi commented upon and discussed the progress of the Yuuzhan Vong War, with Kore observing that the invaders had not yet made any advance upon the Wookiee homeworld of Kashyyyk, despite its proximity to the Yuuzhan Vong invasion corridor. The meeting concluded shortly afterwards; within the next few weeks, the New Republic suffered another major defeat at the planet Duro, where the Yuuzhan Vong warmaster, Tsavong Lah, delivered a galaxy-wide message demanding the surrender of the Jedi Order to his species."}, {"tag": "h3", "text": "The voxyn threat"}, {"tag": "p", "text": "Having turned much of the galaxy against the Jedi Order, the Yuuzhan Vong then released voxyn, bioengineered creatures which were able to track down Force-sensitives and eliminate them. The voxyn began ravaging Jedi ranks at the beginning of 27 ABY. With the Order in crisis, Jedi Knights mobilized to combat the threat. Ulaha Kore accompanied a squadron of Jedi to Froz, where it was believed the Yuuzhan Vong would attempt to attack one of Jedi Master Kyp Durron's supply bases with voxyn. A mission was organized by Anakin Solo in order to obtain voxyn for study at the Froz system, where it was believed the Yuuzhan Vong would soon release more of the creatures. Kore accompanied Solo's squadron aboard a converted blastboat named the Big Eye, along with fellow Jedi Tenel Ka, Raynar Thul and Lowbacca. Kore was assigned the call sign \"Minstrel.\" The role of the team on the Big Eye was to provide tactical analysis and information."}, {"tag": "p", "text": "As Kore and her fellow Jedi awaited the arrival of voxyn in the system, which they would be able to sense by use of the Force, the team aboard the Big Eye observed the arrival of Speed Queen, a freighter that was quickly set upon by a Yuuzhan Vong interdictor. As it was not the mandate of the mission to rescue civilian vessels, Solo ordered the team to hold their positions. Aboard the Big Eye, however, Kore and the others witnessed as Kyp's Dozen, a starfighter squadron led by Jedi Master Kyp Durron, arrived to combat the Yuuzhan Vong. Durron's squadron defeated the Yuuzhan Vong force and rescued Speed Queen, although moments later three Yuuzhan Vong assault frigates emerged in the system and surrounded Durron's squadron, forcing Anakin Solo to tip his hand and engage the frigates."}, {"tag": "p", "text": "Following the mission to Froz, the Jedi continued to work to capture voxyn for study. Ulaha Kore paired with Eryl Besa, a Human Jedi, with whom she was able to secure another voxyn and return it to Cilghal at the secret Jedi base located over the planet Eclipse. Once Cilghal had researched the voxyn further and drawn conclusions from her studies, Luke Skywalker summoned several Jedi, Kore included, to Eclipse Station in order to announce Cilghal's findings. The Mon Calamari revealed that in the stomach of the voxyn recovered by Kore and Besa she had discovered evidence indicating that the creature had been bred on Myrkr, a conquered planet deep in Yuuzhan Vong territory. Kore was quick to analyze the chances of a full frontal assault on the world and concluded that such an approach would be doomed to failure, even if the Jedi were able to assemble a large enough fleet."}, {"tag": "p", "text": "It was Anakin Solo who proposed that in order to infiltrate Myrkr, a team of Jedi would have to be surrendered into Yuuzhan Vong custody, whereupon they could be transported across the frontier of occupied territory before commandeering the vessel and traveling to the Myrkr system."}, {"tag": "h3", "text": "Injury and death"}, {"tag": "p", "text": "During the decoy capture by the Yuuzhan Vong, her single lung was pierced by a coufee. This serious injury caused the Yuuzhan Vong commander to target her during an attempt to break the Jedi: he stroked the Bith's delicate hands several times across a voxyn's scales. The other Jedi tried to prolong their torture sessions to give the Bith time to recover in a healing trance. Jaina Solo couldn't stand the Bith being in pain and so finally admitted that a Jedi base existed. Before Ulaha could be tortured even further, Anakin Solo ordered her to give the name of the base to stop her torment. She disobeyed and, gathering strength from the Battle meld, killed the voxyn with a coufee and many other Yuuzhan Vong from its acid. Jacen Solo and the others assumed Anakin had ordered her to kill the voxyn."}, {"tag": "p", "text": "Ulaha later sacrificed herself to destroy an enemy boarding party onboard the worldship orbiting Myrkr, and became thus the first to die on the mission. As she died, she played a melody using a metal tube; Jaina commented that she wished Tionne could have heard it."}, {"tag": "p", "text": "The Bith musician's sacrifice enabled the Jedi strike team to insert themselves onto the Baanu Rass and begin the long process of locating and eliminating the voxyn queen. Ultimately, Kore was the first of six Jedi who died on the mission which, although eventually successful, had great repercussions upon its survivors. On the waterworld of Dac, where the New Republic established its new capital in 28 ABY following the fall of Coruscant to the Yuuzhan Vong, Kore was honored posthumously in a ceremony presided over by Chief of State Cal Omas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Ulaha Kore was introduced in James Luceno's The New Jedi Order: Agents of Chaos II: Jedi Eclipse, as a background Jedi. Kore was featured once again in the subsequent installment of The New Jedi Order series, The New Jedi Order: Balance Point, which was written by Kathy Tyers. In The New Jedi Order: Star by Star, author Troy Denning expanded upon Kore's character in more detail, although the Bith Jedi was killed off in the Mission to Myrkr plotline. Kore's statistics for the Star Wars roleplaying game were later included in The New Jedi Order Sourcebook and the Bith later received an entry in The Complete Star Wars Encyclopedia, published in 2008. In 1997, the Bantam Spectra novel Planet of Twilight had made passing reference to a new Bith student Luke Skywalker's Jedi Praxeum. Although there are no other known members of Kore's species in the New Jedi Order, there is no further connection between the Bith mentioned in Planet of Twilight and the character of Ulaha Kore."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}