{"url": "Ulbrick", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith in the Lost Tribe of Sith", "Category:Sith Sabers"], "nodes": [{"tag": "h1", "text": "Ulbrick"}, {"tag": "p", "text": "Ulbrick was a young Human male and Sith Saber of the Lost Tribe of Sith who served as a warrior aboard the Candra during High Lord Edell Vrai's reconnaissance mission to Alanciar in 2975 BBY. Ulbrick was one of the six crew of the Candra besides its captain Edell who survived a pursuit by the Alanciari air force. Later, he and the other Sith survivors climbed a cliff which led to the Alanciari frontier fort of Point Defiance."}, {"tag": "p", "text": "However, he was shot and seriously wounded in the right leg by Quarra Thayn, an Alanciari Keshiri soldier who was armed with a hand-ballista. His Sith companions succeeded in overpowering Quarra and her wounded lover Jogan Halder. One of the Sith crew members, the Keshiri scholar Tellpah, attended to Ulbrick's wounds and bandaged it but was unable to stem the bleeding. Since Ulbrick was too debilitated by his injuries to walk, his commander Edell Vrai beheaded him in order to warn Quarra that the Sith meant business. In addition, Edell wanted to prevent the Alanciari from capturing a Sith prisoner. Prior to their departure from Point Defiance, the Sith dumped Ulbrick's body down a cistern."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ulbrick was a member of the Lost Tribe of Sith, a group of Human Sith who had settled on the planet Kesh during the Great Hyperspace War. He grew up during the Hilts Restoration and participated in the Tribe's efforts to reach and conquer Alanciar, another continent in Kesh's southern hemisphere. Ulbrick joined the Sith Sabers, a rank within the Tribe that was the equivalent of the Jedi Order's Jedi Knights. In 2975 BBY, Ulbrick participated in the Tribe's expeditionary mission to Alanciar and served aboard the airship Candra. He was part of a ten-person crew which included Captain Edell Vrai, the uvak-tenderer Peppin, the thoughtcrier Taymor, four other warriors including Janns, and two Keshiri ambassadors including Tellpah. His captain Edell was also the commander of the Sith expedition and had invented the Tribe's airships after discovering that methane extracted from the volcano Sessal Spire could be used as hydrogen to power gasbags."}, {"tag": "p", "text": "Ulbrick and the Sith scouting fleet traveled across the Western Sea to Alanciar's southeastern peninsula region known as the Six Claws. Shortly after arriving in Alanciar, the Sith airships were attacked by black javelins fired from Alanciari ballista emplacements in the Six Claws and were pursued by the Alanciari air force, which consisted of armed uvak riders. Thus, the Sith had made contact with the Keshiri living on Alanciar but quickly learnt that they had a strong military that was capable of resisting invasion. In fact, the Keshiri geologist Adari Vaal, who had initially worked with the Tribe but later attempted to overthrow them, had fled to Alanciar over two thousand years ago. She succeeded in warning the Alanciari about the threat posed by the Lost Tribe. As a result, the Alanciari developed a highly militarized society based around resisting invasion by the Sith."}, {"tag": "p", "text": "Ulbrick was one of the six Sith crew who survived the Candra's crash-landing near Point Defiance, a signal station that was situated on the peninsular of Garrow's Neck. The other Sith survivors included the mission's commander Edell Vrai, the uvak-tender Peppin, fellow Saber Janns, and the Keshiri scholar Tellpah. Unseen, the Sith party had dropped north of Point Defiance while the balloon carried the wrecked gondola farther eastward. After traveling for a kilometer, the Sith party led by its commander Edell Vrai climbed a stony tumbledown which led to Point Defiance. Ulbrick was the first of the Sith party to climb up the summit. As a result, he was hit in his right thigh by glass projectiles from the Alanciari Wardmaster Quarra Thayn's hand-ballista. Quarra had been protecting her wounded lover Jogan Halder, who had been crushed by the fallen uvak Starboard, who had been tethered to the Candra. His fellow Saber Janns managed to dodged the projectile by diving for cover behind a ruined heart."}, {"tag": "p", "text": "After a brief but fierce struggle, Ulbrick's companions Peppin and Janns managed to overpower Quarra and take her and her companion prisoner. Quarra revealed that she could speak the same language as the Sith and that the Alanciari had been well prepared for the Sith invasion. Meanwhile, the Keshiri scholar Tellpah attended to Ulbrick's wounds. Ulbrick's right thigh had been badly splintered by multiple glass projectiles and his makeshift bandage was completely saturated in blood. Due to the bleeding, Ulbrick was unable to continue walking. After Ulbrick admitted that he would be unable to walk, his commander Edell made the brief decision to euthanize Ulbrick by swiftly decapitating him. This was done to send a warning to the captive Quarra that her life would be in danger if she did not cooperate with her captors and to prevent the Alanciari from capturing a Sith prisoner. Prior to the Sith party's evacuation from Point Defiance, Ulbrick's body was dumped into a cistern in an effort to hide it from Alanciari reinforcements who had been dispatched from Garrow's Neck."}, {"tag": "p", "text": "Despite Ulbrick's death, Edell and the other Sith expeditionary members managed to survive their disastrous first contact with the Alanciari. They then hijacked an Alanciari harvester Mischance which they used to return to their continent of Keshtah Minor via the Southern Passage and Sea of Flames. In the end, the Sith managed to conquer Alanciar by using Jogan Halder to convince the Alanciari that the Sith did not actually pose a threat to them."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a member of the Human Lost Tribe of Sith, Ulbrick was Force-sensitive. He was also a warrior in the Sith Sabers, the Tribe's equivalent of the Jedi Knights, and was presumably skilled in lightsaber combat. However, his combat skills were not sufficient to save him from being fatally wounded by Quarra Thayn during his commander Edell Vrai's mission to Alanciar in 2975 BBY. Due to his serious leg injuries, he was unable to walked and had to be \"euthanized\" by his commander."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ulbrick first appeared as a minor non-point-of-view character in John Jackson Miller's novella Lost Tribe of the Sith: Pandemonium, which was first released on July 24 2012 as part of the mass paperback Star Wars: Lost Tribe of the Sith: The Collected Stories. This marks his only appearance in the Star Wars Expanded Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}