{"url": "Ultimate_Star_Wars", "categories": ["Category:Real-world articles", "Category:Ultimate Star Wars"], "nodes": [{"tag": "h1", "text": "Ultimate Star Wars"}, {"tag": "p", "text": "Ultimate Star Wars is a canon reference book written by Ryder Windham, Tricia Barr, Adam Bray, and Daniel Wallace, including a foreword by actor Anthony Daniels, who plays C-3PO in various forms of Star Wars media. The book was released by Dorling Kindersley on April 28, 2015, and on September 1, 2015, a special edition with frame images, props, and behind-the-scenes shots of the cast and crew of Star Wars: Episode VII The Force Awakens, as well as two behind-the-scenes prints, was released. The reference book features info on characters, locations, weapons, and vehicles pulled from various corners of Star Wars canon."}, {"tag": "p", "text": "In October of 2019, an updated edition of the book, which featured info from Star Wars: Episode VII The Force Awakens, Star Wars: Episode VIII The Last Jedi, Star Wars: Episode IX The Rise of Skywalker, and Star Wars Resistance, was released."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "First edition"}, {"tag": "p", "text": "Become an expert on the Star Wars galaxy!"}, {"tag": "p", "text": "Ultimate Star Wars® is an in-depth visual feast exploring the characters and storylines from the Star Wars galaxy. This is a beautifully illustrated guide that is structured chronologically and packed full of information about key characters and storylines from the Star Wars movie saga, The Clone Wars, and Rebels. The perfect primer before Episode VII is released, Ultimate Star Wars will get old and new fans caught up and knowledgeable on all things Star Wars."}, {"tag": "h3", "text": "Special edition"}, {"tag": "p", "text": "Your ultimate guide to the Star Wars™ universe"}, {"tag": "p", "text": "Open this ultimate visual feast and explore the iconic characters and storylines from the Star Wars galaxy. Beautifully illustrated, Ultimate Star Wars is packed with information about every single character from Mace Windu to Darth Maul through detailed analyses of their stories throughout the saga."}, {"tag": "p", "text": "Explore the Star Wars universe in chronological order to follow the whole story or dive in and out to relive your favourite moments, key battles and iconic characters. A must-have for Star Wars fans, Ultimate Star Wars will enhance your knowledge of the characters and storylines before the release of Star Wars: The Force Awakens. Including characters from the Star Wars movie saga, Star Wars Rebels and the Clone Wars, this is the only guide that explores the entire Star Wars universe in such detail."}, {"tag": "p", "text": "Includes concept art, wire frame images, props and behind-the-scenes shots of cast and crew from Star Wars: The Force Awakens, plus two beautiful behind-the-scenes prints."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}