{"url": "Ultimo_Vista", "categories": ["Category:Canon articles", "Category:Giga-class transports", "Category:Luxury spacecraft"], "nodes": [{"tag": "h1", "text": "Ultimo Vista"}, {"tag": "p", "text": "Ultimo Vista was a Giga-class transport originally established as a leisure cruise ship, but which over the decades became an almost entirely self-sufficient world for its passengers-turned-residents, and circled the skylanes of Coruscant during the last decades of the Galactic Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A massive, blue transport of the Giga-class, Ultimo Vista was originally established as a luxury leisure cruise ship. It was fitted with habitation areas, including forests, rivers, and seas with controlled climates, as well as sports fields and storage areas towards the vessel's aft. Apartment blocks in the central section housed several thousand passengers, which over time became a population of full-time residents as the ship became a separate, contained world. Slow-moving, Ultimo Vista circled its original route through the skylanes of Coruscant's ancient city, close to the heart of the district, Corusca Circus."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of 22 BBY, Ultimo Vista was one of Coruscant's most bizarre sights, having been established decades prior as a leisure cruise ship. By this time, the transport was almost entirely self-sufficient, with housing for several thousand full-time residents, and was considered a separate, contained world. It continued to circle its original route to nowhere above Corusca Circus."}, {"tag": "p", "text": "After commandeering an XJ-6 airspeeder to pursue the assassin Zam Wesell through Coruscant's skylanes, Jedi Padawan Anakin Skywalker almost collided with Ultimo Vista while maneuvering the speeder through a sharp nose-dive towards Corusca Circus. Warned by his Jedi Master, Obi-Wan Kenobi, Skywalker pulled up just in time to avoid crashing into the giant transport ship, and continued his pursuit of the Clawdite assassin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}