{"url": "Umak_Leth", "categories": ["Category:Legends articles", "Category:Galactic Empire science and engineering personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Umak Leth"}, {"tag": "p", "text": "Umak Leth was an Imperial engineer. He was one of the chief weapons engineers on the original Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time leading up to the Clone Wars, Leth was a representative of the Galactic Republic's Ministry of Science. In 22 BBY, Leth participated in a HoloNet debate opposite Nasdra Magrody and Bunt Dantor, where he argued that the mysterious weapon targeting Republic task forces was possibly equipped with cloaking devices. He estimated that the power supply capable of destroying entire task forces of capital ships would require a vessel to be at least 8 kilometers long. He also speculated that a Jenth-class hypermatter core was the possible reactor being used for this."}, {"tag": "p", "text": "During the Great Jedi Purge, Leth designed the Universal Energy Cage to hold and transfer Jedi captives. He also developed the \"resonator\" devices, weapons which were used to torture and subjugate the Marasan people. He also began work on the World Devastators as early as 0 BBY, with its development being so secret that Leth only relayed the most basic information to Grand Moff Wilhuff Tarkin, which he then used in the official field manual Imperial Handbook: A Commander's Guide. After the Battle of Yavin discredited Bevel Lemelisk, Leth was given the position of Master of Imperial Projects for his creation of an advanced model of molecular furnace."}, {"tag": "p", "text": "Years later he designed the Galaxy Gun for the reborn Emperor Palpatine, as well as the World Devastators, SD-10 battle droids, and Shadow Droids. In addition, he presented the cloned Emperor with the XR-85, allowing the tank droids to finally be fully realized. He was killed when Palpatine's flagship Eclipse II fell out of hyperspace and collided with the Galaxy Gun."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the audio dramatization of Star Wars: Empire's End, Leth was voiced by John Cygan, and in HoloNet News — A Galaxy Divided, he was voiced by David W. Collins."}, {"tag": "p", "text": "He was to appear in an additional comic, Boba Fett vs. The Empire, where Leth would betray the Empire and Boba Fett would be tasked with hunting him down, but the comic was never developed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}