{"url": "Ultra-Light_Assault_Vehicle/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Galactic Empire vehicles", "Category:Galactic Republic repulsorcraft", "Category:New Republic vehicles", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "Ultra-Light Assault Vehicle"}, {"tag": "p", "text": "The Ultra-Light Assault Vehicle (ULAV) was a tiny landspeeder first used in the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sienar Fleet Systems' Ultra-Light Assault Vehicle was a compact, fast, and agile repulsorlift assault vehicle. Measuring seven meters in length, the ULAV was crewed by two: a driver and a gunner. New ULAVs cost between 20,000 and 50,000 credits; used ULAVs traded for between 12,900 and 22,000 credits."}, {"tag": "p", "text": "Despite being a small craft, the ULAV mounted an impressive weapons array. Forward-mounted weapons were controlled by the driver, and included twin Mk 2/S laser cannon or double light blaster cannons, and a concussion grenade launcher with a magazine of six grenades or a Mk 1/S concussion missile launcher with a magazine of three Mk 1/S concussion missiles. The gunner controlled the rear-mounted weapon, which was usually either a Mk 3e/S medium blaster cannon or heavy blaster cannon. The rear-mounted weapon was the ULAV's biggest design flaw. Although it had a firing arc of one-hundred and eighty degrees, it could not fire in front of the ULAV, requiring the driver to maneuver the ULAV into an optimum firing position by slewing the craft around. With the rear of the craft facing the enemy, the gunner was able to fire several shots before the driver had to move the craft out of the way of return fire."}, {"tag": "p", "text": "The ULAV could reach speeds of four hundred kilometers an hour, but had inefficient repulsorlift engines resulting in a ground clearance of only 0.6 meters, which could cause problems when the vehicle traveled through underbrush or rocky outcroppings. It had a cargo capacity of between five and twenty-five kilograms, and a week's worth of consumables."}, {"tag": "p", "text": "When the ULAV entered service with the Alliance to Restore the Republic, Alliance technicians only had to perform minor modifications to make them effective combatants, including increasing the power flow and adding ray shielding."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ultra-Light Assault Vehicles were developed by Sienar and employed as rapid assault craft ideally deployed from dropships and large transports. During the Clone Wars, the Galactic Republic utilized ULAVs, which were effective against the Confederacy of Independent Systems' droids formations, breaking through their lines where they were able to employ their forward and rear-mounted weapons in target-rich environments. With the transition of the Republic to Galactic Empire, ULAVs were deployed extensively in the early years until they were phased out in favor of larger, more powerful ground vehicles with primary forward-facing weapons, such as walkers."}, {"tag": "p", "text": "The decommissioned vehicles could not be sold: the craft was too small and underpowered to be used by image-conscious commercial concerns, planetary defense forces, or police forces, and the cargo capacity was too limited to appeal to criminals or pirates. The ULAV fleet was forgotten and stored in warehouses across the galaxy with other heavy equipment. On the planet Hiffis, a commando raid netted a huge fleet of ULAVs along with other equipment. The Alliance classified them as Combat Assault Vehicles, and they were the smallest and quickest craft in the Alliance ground fleet."}, {"tag": "p", "text": "During the early years of the New Republic, four ULAVs were assigned to the CR90 corvette FarStar during its mission to track down Moff Kentor Sarne in the Kathol sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}