{"url": "Umbaran_Militia", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Separatist military units", "Category:Umbaran culture", "Category:Umbaran militia vehicles"], "nodes": [{"tag": "h1", "text": "Umbaran Militia"}, {"tag": "p", "text": "The Umbaran Militia, also known as the Umbaran military, was the defense force of the planet Umbara that became aligned with the Confederacy of Independent Systems following the assassination of Senator Mee Deechi during the Clone Wars. Largely isolated from the rest of the galaxy, the Umbarans developed advanced and formidable technology for their soldiers, which they unleashed on the Grand Army of the Republic at the Battle of Umbara."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the assassination of senator Mee Deechi of the Galactic Senate in 21 BBY, the planet Umbara seceded from the Galactic Republic and joined the Confederacy of Independent Systems. In response to this action, the Grand Army of the Republic was deployed to the planet to participate in an invasion that would later become known as the Battle of Umbara. Whilst there, the Republic forces encountered fierce resistance from the local Umbaran Militia, who utilized extremely advanced and deadly technology in their defense of their homeworld."}, {"tag": "h2", "text": "Vehicles and machinery"}, {"tag": "p", "text": "Umbaran vehicles were more technologically advanced than those developed by the Republic, with many utilizing touch-sensitive holographic controls. Umbarans made use of Zenuas 33 Umbaran starfighters and Umbaran support ships for aerial engagements, while ground combat vehicles included Umbaran mobile heavy cannons, Impeding Assault Tanks, and Umbaran hover tanks."}, {"tag": "h2", "text": "Weapons and equipment"}, {"tag": "p", "text": "Soldiers of the Militia wore helmets that pumped gas within, which increased their reflexes and aggression in battle. They wielded blaster pistols, planted mines and deployed Scutiger-100 stealth droids to electrocute enemy soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of Umbara gave the crew of  The Clone Wars a chance to create a new unique military force. Kilian Plunkett described Umbara as a \"video game planet,\" and said their military gave them opportunities for ideas that would not usually fit in the show's Republic or Separatist aesthetics. Dave Filoni, who described the Umbaran aesthetic as \"PVC plastic,\" said it would lend a very alien quality that would help distinguish them from the clone troopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}