{"url": "Umbaran_starfighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Ship stubs", "Category:Confederacy of Independent Systems starfighter classes", "Category:Umbaran militia vehicles"], "nodes": [{"tag": "h1", "text": "Umbaran starfighter"}, {"tag": "p", "text": "The Umbaran starfighter, also known as the T-20 fighter, was a starfighter model developed by the Umbaran militia during the Clone Wars. The starfighters saw heavy action in a defense of Umbara against the Galactic Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Umbaran starfighter appeared odd when compared to other starfighters of the galaxy in that it had no true cockpit to speak of, instead utilizing only a command chair surrounded by an energy shield. The chair itself was ray shielded. This command chair would detach from the main fuselage and rest on the ground when the ship was not in use. The ship was controlled through a holographic interface that would surround the pilot's hands and the pilot would use hand gestures to control the ship. This could result in very erratic flight patterns if the ship were to be piloted by those unfamiliar with the controls. Hardcase, while trying to pilot one, had crashed into several of the Republic's supplies, and destroyed part of the base."}, {"tag": "p", "text": "The ship itself resembled a large ornamentation rather than a starfighter with large triangular loop shaped wings that were backward swept from the cockpit. There were also two smaller fins attached to the top of the ship above the command chair. The ship's engines were situated in a vertical configuration with three exhaust vents."}, {"tag": "p", "text": "The ship's flight pattern was also unique when compared to other starfighters. Instead of requiring banks and turns to change orientation, the ship could remain stationary and rotate in place, making it highly maneuverable, as demonstrated when two clone troopers flew two commandeered fighters haphazardly while attacking Umbaran mobile heavy cannon. It also meant learning to fly one was more challenging than more traditional starfighters, which, when combined with the also unique holographic interface, can end disastrously, as shown when Hardcase attempted a test flight while still inside an Umbaran hanger."}, {"tag": "h2", "text": "Armament"}, {"tag": "p", "text": "The ship was armed with a single rapid-fire laser cannon that could easily bring down scores of enemy infantry or tanks. In addition the starfighter is also armed with two electromagnetic pulse missile launchers similar to those on the Umbaran hover tank. The launchers could be detached from the ship for storage and were moved around on repulsorlifts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These starfighters were used heavily in the Battle of Umbara by the local militia. Clone troopers Fives and Hardcase infiltrated an Umbaran airbase and commandeered two fighters then used them to destroy enemy mobile cannons. Hardcase, Jesse and Fives later used three fighters to enter a Separatist supply ship and destroy it from the inside by hitting the ship's main reactor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design of this starship was inspired by the cervical vertebra of the dinosaur Apatosaurus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}