{"url": "Battle_of_the_Redoubt", "categories": ["Category:Legends articles", "Category:Battles in the Chiss Ascendancy", "Category:Empire of the Hand events", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of the Redoubt"}, {"tag": "p", "text": "The Battle of the Redoubt was a battle in 22 ABY between the Chiss Ascendancy, aided by the Empire of the Hand, the New Republic, and survivors of Outbound Flight against the Vagaari Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Prior to the battle, Luke Skywalker and Mara Jade Skywalker boarded the Chiss Ascendancy diplomatic vessel Chaf Envoy for the journey to the Redoubt, which contained the remains of the Outbound Flight fleet. They were welcomed by Aristocra Chaf'orm'bintrano and joined by Empire of the Hand commander Chak Fel, New Republic envoy Dean Jinzler and several Geroons along with their spherical refugee transport. These Geroons wished to pay tribute to the Outbound Flight Jedi who liberated them from their cruel Vagaari masters."}, {"tag": "p", "text": "However, the Geroon were in reality the Vagaari themselves and their refugee ship was actually a Paskla-class cruiser. However, the rest of the expedition would not realize it until sometime during the exploration of the Outbound Flight vessel—six Dreadnaught-class heavy cruisers attached to a fuselage containing the space station that housed the explorers. After encountering Thrawn's forces, the Outbound Flight crash-landed on a planetoid within the Redoubt. Only the topmost Dreadnaught protruded over a loose shale that made up the surface of the planetoid."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "During the exploration, they discovered the survivors of the Outbound Flight who had established a colony for nearly five decades. However, the Geroons would soon reveal themselves as the Vagaari, who had come to avenge their losses at the hands of the Chiss. Soon, Vagaari soldiers attempted to assume control of the Outbound Flight complex though they were opposed by the Skywalkers, the surviving colonists, along with Chak Fel and his Stormtroopers of the re-activated and vastly re-organized 501st Legion. These would be pitted against the Vagaari's deadly Wolvkils and a reactivated Droideka, though they eventually prevailed. Most of the Vagaari force was concentrated on the uppermost Dreadnaught and they freed it from the fuselage that held it through the use of explosive charges. The Vagaari then proceeded to attack the Chiss Brask Oto Command Station and the Chaf Envoy through the use of Vagaari fighters. However, the Vagaari were defeated by Luke and Mara Jade in a Delta-12 Skysprite and the Chiss fleet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though a Chiss victory, Formbi would later reveal that it was merely a ruse to start war between the Chiss and the Vagaari. A large Chiss and Imperial strike force under the command of General Drask, and including Unit Aurek-7, were dispatched to assault the Vagaari home-territories. Most of the surviving colonists left for the Empire of the Hand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}