{"url": "Ulu_Ulix", "categories": ["Category:Legends articles", "Category:Individuals of unidentified species", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ulu Ulix"}, {"tag": "p", "text": "Ulu Ulix was a male Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive male, Ulu Ulix belonged to a species of horned-bipeds with three black eyes. Training in the ways of the Force at the Coruscant Jedi Temple as a member of the Jedi Order, Ulix was selected to be the Padawan of Jedi Master Glynn-Beti before the Clone Wars. When war did erupt between the Galactic Republic and the Confederacy of Independent Systems, Ulix took up the rank of Commander in the Grand Army of the Republic and was assigned to lead clone troopers in battle alongside his master."}, {"tag": "p", "text": "Joining his master at the battle for Raxus Prime, Ulix and the Republic forces there were instrumental in ending the Dark Reaper Crisis and ensuring that Count Dooku could not access that dangerous power for the Confederacy. After the fighting concluded, Ulu Ulix took care of the orphans on the Republic troopship Candaserri, including young Boba Fett. Ulix was the only Jedi who Fett ever considered a friend. During the conflict on Xagobah Ulix would once more encounter Fett without realizing that he was the son of the notorious bounty hunter Jango Fett. As the troops under his master's command were having difficulty attacking their target, the Mazariyan citadel of Wat Tambor, Ulix took it upon himself to infiltrate the facility. When Ulix's swoop bike was shot down upon his approach to the citadel, Fett rescued the Padawan before he could fall to his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}