{"url": "Umpass-stay/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Desilijic servants", "Category:Klatooinians", "Category:Males", "Category:Max Rebo Band members"], "nodes": [{"tag": "h1", "text": "Umpass-stay"}, {"tag": "p", "text": "Umpass-stay was a Klatooinian affiliated with the Desilijic kajidic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Umpass-stay was born into slavery on the agricultural planet Shawti. Growing up, he was taught to regulate and organize the mud baths of Hutts. He worked as a bodyguard for Shebba Kalshi Desilijic, eventually becoming the Hutt's favorite, but failed to prevent his murder at the hands of Shebba's nephew, Jabba Desilijic Tiure. Despite being a capable bodyguard, Umpass-stay had failed to see Jabba as a risk."}, {"tag": "p", "text": "Jabba appropriated Umpass-stay's services and forced him to work as a spy. He also sat in as a drummer for the Max Rebo Band with the Weequay Ak-rev. Umpass-stay was ordered to be a drummer for extra security after a group of musicians attempted to assassinate Jabba. As he was not among the denizens who followed Jabba to the fateful event at the Great Pit of Carkoon in 4 ABY, Umpass-stay became a free man. Unfortunately, with no clear prospects outside Hutt influence, he became an employee at another Desilijic clan house where he helped Darson Kinderlot find passage to Hutt Space. Umpass-stay became an employee of Jocoro Desilijic Tiure on the planet Du Hutta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Umpass-stay was added to the extended musical number in the Special Edition of Return of the Jedi."}, {"tag": "p", "text": "Under the latex was Miles V. Fawkes, who was picked for the role because of his background and study of Taiko Drumming.[source?]"}, {"tag": "p", "text": "Umpass-stay was made into an action figure along with Ak-rev, who both had separate parts of the drum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}