{"url": "Unagin", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with cut elements", "Category:Al'Nasrl sector", "Category:Outer Rim Territories planets", "Category:The Slice planets", "Category:Terrestrial planets", "Category:Trade worlds"], "nodes": [{"tag": "h1", "text": "Unagin"}, {"tag": "p", "text": "Unagin was a minor trade planet. It was located within the Unagin system of the Al'Nasrl sector, a part of the Slice portion of the Outer Rim Territories. The planet lay on the hyperlane called the Hollastin Run, which connected it to the worlds of Tsyk and Syvris. A smaller hyperspace route also connected Unagin to the planet Riileb. Due to Unagin's location near Hutt Space, starships that prepared to enter or leave that region frequently stopped at the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Unagin was first mentioned in The Essential Atlas, a 2009 reference book co-authored by Daniel Wallace and Jason Fry, which placed the planet in grid square T-13. The planet was set to appear in Adventures in Hyperspace: The Big Switch, a young-readers book written by Ryder Windham. However, that book was postponed and eventually canceled."}, {"tag": "h3", "text": "Adventures in Hyperspace: The Big Switch"}, {"tag": "p", "text": "At some point between 2 BBY and 0 BBY, the Aleena art dealer Itto Bipsmik lived with her two children in a small spaceport settlement that was located near a wooded area in Unagin's southern hemisphere. During that time, she sold the Hutt crime lord Jabba Desilijic Tiure a portrait bust of Jabba's ancestor Bogga, which she kept in a storage shelter near the compound's landing site, and Jabba hired the Human smuggler Han Solo and his Wookiee co-pilot, Chewbacca, to retrieve the sculpture on Unagin, where Bipsmik resided, and bring it to the planet Tatooine."}, {"tag": "p", "text": "Arriving on Unagin in their freighter, the Millennium Falcon, the smugglers met Bipsmik at the edge of the settlement, in a large compound of structures bordered by a duracrete wall; however, their meeting was interrupted by the arrival of Imperial Customs Captain Rench. The Imperial captain ordered the stormtroopers accompanying him to destroy the bust and subsequently left Unagin."}, {"tag": "p", "text": "Luckily for Solo, Bipsmik had made a perfect replica of the sculpture that she stored in her garage. Solo intended to deliver the replica to Jabba, hoping that the Hutt would not notice the difference. After discovering a transmitter that Rench had planted aboard the Millennium Falcon and evading the captain's light corvette in Unagin's orbit, the smuggling duo left the planet for Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}