{"url": "Undercity_Ambush", "categories": ["Category:Legends articles", "Category:Battles of Coruscant", "Category:Battles of the Second Galactic Civil War", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Undercity Ambush"}, {"tag": "p", "text": "The Undercity Ambush was the Jedi Coalition's first action taken against Jacen Solo, the co-Chief of State of the Galactic Alliance and Sith Lord. At first the plan was to either a capture or neutralize Jacen, but changed to planting a tracking device on Solo after realizing that the first intentions weren't realistic. The ambush was a failure, with Darth Caedus killing Thann Mithric and nearly killing the famous Jedi Master Kyle Katarn. The Jedi however, were able to plant the tracking device on the Dark Lord."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Devastation of Kashyyyk, Luke Skywalker gave Kyp Durron the task of planning a mission against Jacen Solo. Kyp later informed Luke that a team of 4 Jedi including a guide would ambush and capture Solo in Coruscants undercity as he was entering or leaving the Senate Building. There would be a droid piloted shuttle meant to draw away their pursuers as they were escaping with the captive Chief of State. Kyp told the Grand Master that if the capture didn't work out as planned; they would kill Jacen to prevent him from causing further damage to the galaxy. Luke reluctantly agreed and then asked to meet Seha Dorvald, the teams guide through the undercity. Her loyalty was in question because she helped Ben escape out of the Jedi Temple under Jacen's orders as well as giving him information on the Jedi. She came forward about her actions when she heard about the Massacre on Ossus. But Luke accepted her after talking with her and learning of her actions during the Invasion of the New Jedi Temple. Kyp insisted that Luke lead the mission but he refused. Luke knew he would attack with hate and that Ben would follow his example and be lost to the darkness. He instead appointed Jedi Master Kyle Katarn team leader."}, {"tag": "p", "text": "The Jedi team which consisted of Katarn, Jedi Knights Valin Horn, Thann Mithric, Kolir Hu'lya, followed Seha Dorvald as they crawled thorough the undercity's waste pipes to get to their positions. After several hours a convoy of three airspeeders showed up. One was a black GAG speeder, the second was a heavily armored civilian speeder, and the third was a GAG troop carrier. The convoy stopped and troops began securing the area. Then the civilian speeder opened and a YVH droid came out holding a crate containing Solo's daughter Allana followed by Jacen himself. As the group headed toward the Senate Building, Katarn gave the order to attack."}, {"tag": "h2", "text": "Attacking the Chief of State"}, {"tag": "p", "text": "Caedus heard what sounded like four grenade launchers firing. He told the droid to take Allana to safety and watched as dazzle grenades blinded his troops. The four Jedi then approached Jacen and Katarn offered surrender, which Solo quickly rejected. Darth Caedus nearly laughed at the Jedi as he realized that, with the exception of Katarn, they were no match for him. Katarn also realized it would be very difficult to complete their objective and told Seha to linger behind the fight and plant a tracking device on Jacen's cloak. At the very least, the Jedi would know of Jacen's whereabouts."}, {"tag": "p", "text": "Katarn began the duel with a strike that Caedus easily deflected as he Force Pushed Hu'lya into Mithric. Katarn tried to strike Caedus again, but he dodged the blade and kicked Valin Horn in the chin. Katarn nearly kicked Caedis in the head but he managed to partially avoid it, catching a scrape on his cheek. Caedus retaliated by slashing at Katarn's leg, but his strike was blocked by Kolir. Then the Jedi escape shuttle entered the plaza closely followed by three GAG airpeeders pursuing it."}, {"tag": "p", "text": "Caedus attacked Horn so that he would flinch into the path of Mitric, which he did. As the two Jedi collided, Caedus force pushed Hu'lya into Katarn, who threw his lightsaber at Jacen so he could catch Kolir with both hands. Caedus swatted away the lightsaber and threatened to torture the Jedi if they didn't reveal the location of their secret headquarters. Hearing this, Katarn made one final plea to Jacen to realize his actions, asking if he knew who he was anymore. The Sith Lord simply responded that he did, and it was the Jedi who had no idea who he was now."}, {"tag": "p", "text": "Caedus sensed Mithric and Horn preparing to attack so he yanked Kolir with the force so he blocked their path. Katarn advanced toward the Sith Lord, but remained unaware of the many GAG speeders attacking their escape shuttle overhead. Caedus used this to his advantage by yanking down a speeder and launching it down toward the Jedi Master. Katarn expected another force push and realized too late that a speeder was flying towards him. The speeder hit Kyle in the back and knocked Kolir to the ground. Katarn flew forward and slammed into Caedus as he buried the hilt of his lightsaber into his chest. Seha used the chaos to her advantage and merged the patch with Jacen's cloak as the three remaining Jedi charged Solo. As Seha left, she pulled Master Katarn to safety."}, {"tag": "p", "text": "The GAG troopers' sight had begun returning and fired at Mithric and Horn. Valin deflected the bolts at Jacen, grazing his leg. Mithric then charged Jacen as he fell and began to beat down his parries. Caedus then realized that he was losing focus and hadn't fully recovered from his duel with Luke. Also, Mithric sent more and more blaster bolts towards him. Caedus waited until another bolt flew towards him and deflected it into Mithric's chest. Caedus decapitated him with a single lateral blow. After sharing a few words with Horn, Caedus watched as the Jedi fled."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Seha, Horn, and Hu'lya carrying and injured Kyle Katarn managed escape through the undercity and made it back to the Jedi hideout. Caedus picked up Mithric's head and observed it before dropping it on the ground. He was disappointed that he could not find the body of Kyle Katarn. Kyp Durron later informed Luke of the failed ambush and the success of the tracking device. This device would help the Jedi locate Jacen before the Battle of Centerpoint Station, but it was eventually discovered by Patra Tebut."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}