{"url": "Underwear/Legends", "categories": ["Category:Legends articles", "Category:Underwear"], "nodes": [{"tag": "h1", "text": "Underwear"}, {"tag": "p", "text": "Underwear, also known as undergarments and microgarments, were clothes worn next to the skin, usually under other clothes. They served many functions depending on what species, race, and/or culture wore them. Generally, they were worn to provide support, shape, and comfort for the body, though they were also used as protective clothes, religious tools, erotic display items, or simply garments to protect the modesty of the wearer depending on species, race or culture."}, {"tag": "p", "text": "There were many types of underwear worn throughout the galaxy. These included but were not limited to loincloths, body gloves, and brassieres. Nightwear and swimsuits could also be considered underwear—or, more appropriately, undergarments—due to their being worn next to the skin. Some nightwear and swimsuits even provided the same facilities and supports as underwear and so served the same functions."}, {"tag": "h2", "text": "Function"}, {"tag": "p", "text": "Humanoids wore underwear to keep outer garments from being soiled by perspiration and for support: female brassieres provided support for the breasts, loincloths for the male genitalia. A female might wear a corset to alter her body shape. For protection and additional support, one could wear tighter fitting, sturdier garments to reduce the chance of damage to the body. These undergarments mostly involved a body glove of some kind and were particularly common for spacefarers. Body gloves also served as additional thermal protection in colder climates."}, {"tag": "p", "text": "For the issue of modesty, camisoles and petticoats might be worn for additional coverage, while in the realm of eroticism, undergarments were designed to sexually titillate both the wearer and the observer by revealing as much skin as possible while still remaining on the wearer. Such examples could be seen on dancers in disreputable cantinas. Erotic garments could also be used as a form of oppression upon the wearer depending on the situation, species, race, or culture."}, {"tag": "p", "text": "Social norms, indoor-outdoor climate, fashion, legal requirements, and personal choice all affected the suitability of underwear as outer clothing, nightwear, or swimsuits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In a 2008 interview in London, Carrie Fisher revealed that during the filming of Star Wars: Episode IV A New Hope in 1977, director George Lucas had made her cover her breasts with gaffer tape. She said, \"I had to tape them down, because there's no underwear in space. George knows that for a fact.\" She reiterated this in her memoir and subsequent one-woman show Wishful Drinking."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}