{"url": "Battle_of_the_Sith_Lords", "categories": ["Category:Real-world articles", "Category:Canceled video games", "Category:LucasArts games"], "nodes": [{"tag": "h1", "text": "Battle of the Sith Lords"}, {"tag": "p", "text": "Battle of the Sith Lords (internally codenamed \"Damage\" and given the working title Maul) was the tagline for a Star Wars video game once in development by Red Fly Studio. The game was canceled on June 24, 2011. Red Fly employees linked the game's cancelation to Star Wars creator George Lucas' decision to sell Lucasfilm Ltd. and LucasArts to The Walt Disney Company."}, {"tag": "h2", "text": "Development"}, {"tag": "h3", "text": "Inception"}, {"tag": "p", "text": "LucasArts contracted Red Fly Studio to begin working on ideas, demos, and mechanics for a Star Wars Wii or Wii U video game featuring Darth Maul, with prototyping for the game beginning on October 9, 2010. Red Fly didn't have any story direction from LucasArts other than the title Battle of the Sith Lords. Red Fly originally had the idea of telling the story of Maul's origins and ending with his \"death\" at the end of Star Wars: Episode I The Phantom Menace. However, LucasArts let them know that Darth Maul survived the events of The Phantom Menace, but didn't let Red Fly in on the Star Wars: The Clone Wars television series' then-upcoming plot, which featured Maul's survival."}, {"tag": "h3", "text": "Prototyping"}, {"tag": "p", "text": "Without a main storyline, Red Fly instead focused early development of Battle of the Sith Lords toward gameplay prototyping. Emphasis was placed on action-centric gameplay, with a concentration on stealth elements. Red Fly used technology from Star Wars: The Force Unleashed II as a baseline for their prototype, but at the request of LucasArts, extra care was taken to ensure the gameplay did not feel too similar to The Force Unleashed. The gameplay prototype featured ragdoll physics and more realistic lightsaber combat, which would allow decapitation and amputation. Red Fly expected the game to receive a mature rating from software rating boards."}, {"tag": "p", "text": "Footage of Red Fly's prototype was published online and featured Maul fighting members of the Death Watch on a space station and clone troopers on a desert planet. Red Fly confirmed that these assets were made simply for demonstration purposes and do not reflect what the final the plot or time period of the game would have looked like."}, {"tag": "h3", "text": "New direction"}, {"tag": "p", "text": "Later in development, during a meeting with representatives of Red Fly, George Lucas revealed his interest in Darth Maul working with Darth Talon, a concept that would carry over to Lucas' first drafts of the sequel trilogy. When Lucas was told that this wouldn't work since Talon lived more than 170 years after Maul, he said the main character could instead be a descendant or clone of Maul."}, {"tag": "p", "text": "Red Fly then began working with this idea, and their game's story finally started coming together. The plot would have featured this Maul proxy and Talon fighting against Darth Krayt and his Sith army, with a developer of Red Fly saying Maul could strike at Krayt's Sith for going against the former Rule of Two."}, {"tag": "h3", "text": "Character designs"}, {"tag": "p", "text": "Red Fly initially made designs for Maul's descendant that made the character distinct from Maul himself. LucasArts was not in favor of the concept and insisted that the main character look identical to Darth Maul."}, {"tag": "p", "text": "Outside of \"Maul\" himself, the characters and plot of the game would have been a departure from the designs and storylines from the Star Wars: Legacy comic series, which originated Darth Krayt's Galactic Empire. Krayt was completely redesigned, with a red and black cybernetic look. Several new Sith Lords, such as Darth Kroan and Darth VaGhal, were designed for the game, the majority of which ignored the heavy usage of Sith tattoos by members of Krayt's One Sith."}, {"tag": "p", "text": "Designs for a generic Sith Emperor and his advisor were also created, although it is unknown if this character was a revised version of Krayt or an entirely new individual. Concepts for New Empire officers and stormtroopers were designed as well, both also deviating from the designs defined in the Legacy comics. In addition to many new Sith and Imperial characters, several Jedi adversaries, such as Nexus Wan were created for the game, alongside multiple bounty hunter concepts."}, {"tag": "h3", "text": "Gameplay"}, {"tag": "p", "text": "Battle of the Sith Lords would have allowed the player to switch between control of Maul's descendant and Darth Talon. A probe droid would act as a central guide, comprising a major portion of the game's user interface and main menu. The droid and Talon would also act as companions when the player is in control of \"Maul.\" The droid would scan the environment and mark potential threats. Talon would attack when given special commands."}, {"tag": "p", "text": "Several locations were planned for Battle of the Sith Lords, including a spaceport operated by the Black Sun, and a jungle planet situated next to a red dwarf. A central and recurring location in the game would have been a base built into an asteroid. It would have served as the base of operations for \"Maul\" and Talon."}, {"tag": "h3", "text": "Decline and cancelation"}, {"tag": "p", "text": "Despite the project coming together, LucasArts would not \"sign off on any of the big-ticket items that would allow development to truly get underway.\""}, {"tag": "p", "text": "The project became troubled when LucasArts suddenly stopped communicating with Red Fly. Red Fly found out from some members of LucasArts that something was wrong, before finally being told via email that the project was canceled. According to one of the game's creators, one reason for the cancelation was Disney's acquisition of Lucasfilm. At the time of its cancelation, the game's prototyping phase had just been finished."}, {"tag": "p", "text": "In October 2015, Red Fly was working on \"a full next-gen demo of all things Maul to show to the powers that be.\" In the event that Electronic Arts and/or Disney would be uninterested in the project, Dan Borth (of Red Fly) expressed hope that they could reskin the game to be more in line with the companies' vision for Star Wars."}, {"tag": "p", "text": "In December 2015, Borth confirmed in an interview that Lucasfilm was \"not interested,\" and that all Star Wars video games going forward would be developed only by Electronic Arts, as per the exclusive license granted to the company. Borth also posited that a public \"Ask Me Anything\" thread published by Red Fly on Reddit annoyed Lucasfilm."}, {"tag": "p", "text": "Since 2015, there has been no status update on Battle of the Sith Lords from Red Fly. In 2021, Lucasfilm ended its exclusive contract with Electronic Arts and founded Lucasfilm Games to partner with a variety of studios to develop video games under the Star Wars license. However, no new development contracts have been made with Red Fly."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}