{"url": "Underwater_Zeta_Zero_Nine_base", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Imperial military bases"], "nodes": [{"tag": "h1", "text": "Underwater Zeta Zero Nine base"}, {"tag": "p", "text": "This underwater base was an Imperial research facility on the planet Zeta Zero Nine. The planet was a cold wasteland, and the surface was covered in a thick layer of ice. However, under this topical ice layer was a vast body of water where the Empire built an underwater base. This ensured that the facility was completely hidden from view, away from prying eyes. Additionally, the peculiar orbit of the world caused electromagnetic storms which cut off communication and disrupted most instruments. The Imperials were able to overcome these troubles by the use of a disrupter box, but intruders would be technologically blind. The base was commanded by Moff Jesco Comark during the Galactic Civil War."}, {"tag": "p", "text": "This base was integrally involved in Operation Death-Hunter, working to create the Death-Hunter Cyborg. Due to the delicate nature of the project, security on the world was very high, and a large force of snowtroopers, seatroopers, and a variety of underwater craft were stationed at the facility. This was both to ward off intruders and to manage the many captured Humans taken from the planet Bescane who were to be made into cyborgs. The underwater craft which patrolled the outside of the base included Aquatic Terrain Armored Transports, subtugs, TIE Subfighters, and Torpedo attack carriers. The immense structure was distinguished by large ceramasteel domes that jutted out of the main building. A series of turbolifts connected the various levels, linking the different research centers together. Adjacent to the main research center was an elaborate detention facility with several levels patrolled by detention guards. The detention facility was set up in a circular design consisting of several levels of stasis booths surrounding a specialized medical table. This table was used to test potential converts into a Death Hunter cyborg. Imperial technicians and a medical droid worked in tandem to perform tests which ensured that the Human would survive the cyborg transformation. These tests often came at great pain to the patient."}, {"tag": "p", "text": "At some point early into the project, the base was infiltrated by Rebel agents who were posing as salvagers with forged Imperial Trade and Commerce Authority permits. With help from double-agent, Lady Amber Comark, many of the imprisoned Humans were released and an uprising occurred against the Imperial forces. After gaining access to Imperial weapons, the released prisoners and the rebel infiltrators made their escape in a commandeered Torpedo attack carrier. At the suggestion of Cooper Dray, the Rebel team fired concussion missiles on the underwater base, compromising its structure. As the Rebels escaped the world, huge underwater explosions shattered the ice, signaling the destruction of the facility."}, {"tag": "h2", "text": "Appearances"}]}