{"url": "Unidentified_Advanced_Recon_Commando_(lieutenant)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Members of the Muunilinst 10", "Category:Unidentified Advanced Recon Commandos"], "nodes": [{"tag": "h1", "text": "Unidentified Advanced Recon Commando  (lieutenant)"}, {"tag": "p", "text": "This ARC Trooper Lieutenant participated in the Mission to Hypori along with the rest of the Muunilinst 10, where the ARC Troopers were sent to rescue the surviving Jedi Knights from General Grievous."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After being sent to Hypori to rescue the survivors of Barrek's task force. He along with Captain Fordo and nine other ARC Trooper lieutenants were tasked with recovering them. Reaching Hypori in a gunship, the ARC Troopers approached the downed Acclamator-class assault ship in which the surviving Jedi were hiding. As soon as they debarked, Captain Fordo detected three life signs and had one of his troops check in some nearby rubble, while another checked in the rafters as they made their way to the life signs."}, {"tag": "p", "text": "There they were met with the sight of a wounded Jedi Master, General Ki-Adi-Mundi, dueling General Grievous. The ARC Troopers wasted no time in opening fire on the cyborg general, and although the salvo of grenade attacks did not significantly harm the incredibly agile Separatist general, they did manage to keep the cyborg preoccupied evading the explosive barrage. The cyborg then fled the site, Fordo's men recovered the other surviving Jedi: Aayla Secura and Shaak Ti."}, {"tag": "h2", "text": "Gear"}, {"tag": "p", "text": "This ARC lieutenant wore distinguished blue Phase I clone trooper armor. He also wore a skirt-like kama that dampened blasts, had a rangefinder attached to his helmet, and wore a blue command shoulder pauldron. He also utilizing an under-barrel grenade launcher, also known as an over-under attached to his modified version of the DC-15A. The over-under was a special forces weapon designed as a miniature rocket/grenade launcher."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}