{"url": "Unidentified_501st_stormtrooper", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Clone stormtroopers", "Category:Unidentified Galactic Empire stormtroopers"], "nodes": [{"tag": "h1", "text": "Unidentified 501st stormtrooper"}, {"tag": "p", "text": "A Human male clone stormtrooper of the Galactic Empire served in the 501st Legion during the Galactic Civil War. In 0 BBY, he was stationed aboard the Imperial Star Destroyer Devastator, under the command of Lord Darth Vader. The Star Destroyer pursued and captured the Rebel CR90 corvette Tantive IV, which was transporting the stolen plans of the Death Star battlestation. The Trooper participated in the following siege of the Tantive IV, and after the starship was secured, he was ordered to search for passengers. He found Senator Leia Organa, but she outdrew and shot him dead."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male was a clone who served as a trooper in the Galactic Empire's Stormtrooper Corps. During the Galactic Civil War, he was a member of the 501st Legion, an elite stormtrooper legion, and was assigned to the Imperial I-class Star Destroyer Devastator, commanded by Dark Lord of the Sith Darth Vader."}, {"tag": "p", "text": "In 0 BBY, after Rebel agents transmitted the stolen plans of the first Death Star—a new Imperial superweapon—to the Rebel CR90 corvette Tantive IV, Senator Leia Organa's consular ship, the Devastator pursued and captured the Rebel vessel over the planet Tatooine. Led by the assault commander, the Trooper's squad boarded the Tantive IV in the first wave of troops. Just after stormtroopers captured the Rebel Captain Raymus Antilles on the corvette's bridge, the Trooper reported to the Commander that Vader had come aboard the Tantive IV. The Dark Lord interrogated Antilles and ordered the stormtroopers to search for the passengers of the ship."}, {"tag": "p", "text": "DV-692, a superior of the Trooper, ordered several subordinates to search one of the passageways and secure the junction, while he led the Trooper and the rest to the port subhallway. Their orders were to search the passageways astern and forward. The Trooper was the first to spot Organa, who had hidden herself in a small alcove. Just after he informed his squadmates of Organa's presence, she shot the Trooper dead and tried to escape, but DV-692 stunned her with his E-11 blaster rifle. The Trooper's squad escorted Organa to Vader who, after a brief conversation with the prisoner, ordered them to take her to the Devastator."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Trooper felt himself lucky when he recognized Senator Leia Organa as the passenger Darth Vader wanted alive, and he saw a chance for a commendation. However, the Trooper was not as quick with a blaster as the Senator, who outdrew and shot him shortly before she was stunned by DV-692."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character first appeared in the December 1976 novelization of Star Wars: Episode IV A New Hope, ghostwritten by Alan Dean Foster. He was played by an uncredited extra in A New Hope, released the following year. His scene was one of the last few of principle photography, filmed sometime between June 29 and July 16, 1976 in the United Kingdom. Disc jockey Terry McGovern worked as a voice actor during the production of A New Hope and listed his lines on his home page. However, McGovern did not include \"Set for stun\", which indicated that the character's line was performed by one of the other three stormtrooper voice actors: Jerry Walters, Scott Beach or Morgan Upton. The actor's voice was said over a walkie-talkie and recorded by sound designer Ben Burtt. In the revised fourth draft script of A New Hope, as presented in Star Wars: Behind the Magic, the Trooper is identified simply as \"Trooper.\""}, {"tag": "p", "text": "In 1981, the character's role was slightly expanded in the Star Wars radio drama, the script of which, as presented in Star Wars: The National Public Radio Dramatization, addresses the stormtrooper as '4th Trooper.' In the novelization, the storybook and the Marvel Comics adaptation of A New Hope, Senator Organa shoots not only this particular stormtrooper but also another one; however, it contradicts the movie, where only one trooper is gunned by Organa. The trooper's line in some adaptations does not match the one spoken in the movie. In Classic Star Wars: A New Hope, the role of the stormtrooper and DV-692 is merged into that of a stormtrooper sergeant, who calls out Leia's presence and stuns her, though not before she manages to shoot two other stormtroopers."}, {"tag": "h3", "text": "Trooper comic"}, {"tag": "p", "text": "In 2001, the tenth issue of Dark Horse Comics's Star Wars Tales series presented a story entitled \"Trooper\", which featured the character as the protagonist. Leland Chee, continuity referee of Lucasfilm, stated that elements of those Tales comics are considered S-canon until referenced by C-canon materials. He later confirmed on his Facebook page that this particular story was intended to be non-canon."}, {"tag": "p", "text": "The Trooper comic presented the events of the opening scene of A New Hope from the point of view of the character, beginning with the preparations of the boarding and ending with the death of the protagonist. The story was interrupted by flashbacks to the life and training of the character, some elements of which were contradicted by newer sources, thus rendering the story non-canon. First of all, the comic stated that the character was born on the previously unreferenced planet of Greater Marianas, where he lived with his father, an old-time yaggie man, and spent his days hunting yaggies for meat and hide, while he was listening to his father talking about every man being equal and free—all of which the character did not like. The character's life changed when an Imperial landing party appeared in a settlement on Greater Marianas, announcing that the planet was now under Imperial protection. The father of the character protested; however, by the order of the officer in command of the Imperials, who wanted to show an example to the locals, a stormtrooper shot the man dead. Seeing the end of his old life, the character appealed to the Imperial officer to take him with them. To demonstrate his ability to follow orders, no matter what, the officer ordered him to execute a random member of the crowd, an eyepatched man. The character took the SE-14r light repeating blaster the officer offered him and shot the fellow yaggie man in cold blood. He did not feel it to be evil, but considered it common sense: his way off Greater Marianas."}, {"tag": "p", "text": "The character then had brutal training that initiated him into the stormtrooper ranks. The first test required him to kill his fellow recruits. The training officer offered one single standard issue E-11 blaster rifle to a group of recruits and announced that the first who killed five others would be accepted to stormtrooper training. The character was the third to complete the task, and thus had to kill ten fellow recruits. After the exercise was over, the officer ordered the survivors to clean up the training ground and to report to the quartermaster. The following wide panels of the comic showed moments of the further training exercises that required the Recruit to risk death of himself and of his fellow recruits. He participated, among other things, in climbing, shooting exercises, and swamp and melee combat training, all designed to drain him of his humanity and individuality, teach him complete obedience to orders, and to value victory over everything, including his own life. As a trooper, he became all but indifferent to the deaths of his comrades and the atrocities he was ordered to carry out. The next flashback showed the character's life after completing the training: the Trooper got away from Greater Marianas and was fed, quartered and equipped. He traveled the galaxy, saw worlds he had never imagined and did things he was not proud of, such as burning villages and killing innocents. Later, two fellow stormtroopers brought a dreadlocked Human prisoner before the Trooper. The Human insulted the troopers and his words reminded the Trooper of his father, so he shot him dead and instructed the others to find another prisoner instead. This was the final flashback, and the story returned to the events of the film just before the breaking of the Tantive IV's hatch."}, {"tag": "p", "text": "During his career, he participated in dozens of boarding missions and saw many others go in first and die. When the Devastator captured the Tantive IV, the Trooper and the rest of the boarding party were assembled in one of the Star Destroyer's hangars, where Lord Vader inspected them and ordered the Sergeant, who was in command of the boarding party, to take the mission seriously. The Trooper noticed that a fellow stormtrooper behind him got scared of Vader's appearance and angry outburst, while he himself cursed the day he ever joined the Empire. As he had done every single time when he was part of a boarding party, the Trooper prayed to himself not to be chosen to go in first, because the first one usually was the first to die. However, he ran out of luck, as the Sergeant chose the Trooper to go in first. The Trooper swore to himself that he would defect from the Empire if he survived the mission. He set a charge on the hatch of the Tantive IV and ignited it to force the Rebels inside the ship to flinch. The plan worked and he got in alive, but just behind him the Sergeant was shot by the Rebels. While they moved deeper into the enemy ship, the character noticed that two droids—an obvious reference to protocol droid C-3PO and astromech droid R2-D2—spoiled the Trooper's aim at a Rebel when they moved through an ongoing firefight. After the ship was secured, Vader ordered the stormtroopers to search for the passengers. While searching for Organa, the character was thinking about a TIE pilot who deserted after being ordered to kill thousands of innocents, and he was also dealing with his own upcoming desertion. The character's final minutes played out slightly differently in the comic than in the film, where he spotted Organa, who outdrew him. In the comic, the thoughts of desertion distracted the Trooper, who became aware of Organa, whom he found the most beautiful girl he had ever seen, only a moment before she shot the character in the face—instead of hitting him on the chestplate, like in the film. The dying Trooper heard DV-692's shot that hit Organa, and in his final moments, after he heard his superior noting that Organa would be all right, the Trooper realized that he, however, would not."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}