{"url": "Unidentified_Aqualish_(North_Apartments)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Hidden Beks", "Category:Unidentified Aqualish", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Aqualish  (North Apartments)"}, {"tag": "p", "text": "In 3956 BBY, a male Aqualish resided in the North Apartments in the Upper City of the planet Taris. He hated Darth Malak's Sith Empire, and stole their uniforms for the Hidden Beks swoop gang in order to undermine the Sith rule of Taris. However, he was caught on tape and was approached by three Sith soldiers, who began to interrogate him. Galactic Republic soldiers Carth Onasi and Revan watched the soldiers as they threatened the Aqualish's life, eventually deciding to intervene in the situation. This led to a short skirmish that resulted in the death of all three Sith. After the fight, the Aqualish thanked Revan and advised him to take the uniforms of the dead Sith. He then directed them to speak with the leader of the Hidden Beks, Gadon Thek."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3956 BBY, this male Aqualish was residing in the Upper City North Apartments of the Outer Rim world Taris. He was asked by the Hidden Beks swoop gang to obtain Sith uniforms so that they could strike against the Sith rule of the planet. The Aqualish agreed and infiltrated a Sith base, stealing the uniforms and giving them to the Beks. As a reward for his work, the Aqualish received credits, which he spent quickly. However, he had been caught on security footage inside the base and was accused of possession of illegally obtained Sith uniforms, as well as supplying them to the Tarisian underground. In that year, two Sith soldiers and a commander found him in a room of the North Apartments and began to interrogate him."}, {"tag": "p", "text": "At this point, Galactic Republic troopers Carth Onasi and Revan noticed the commotion and stopped to watch. The Sith Commander continued the interrogation of the Aqualish while one of his subordinates blocked the duo and told them to leave. The Aqualish denied the troopers' allegations, stating that he was simply a visitor marooned on the world by the recently imposed quarantine of Taris. Undeterred, the Commander threatened to kill the Aqualish if he didn't talk. Refusing to let the Sith kill a defenseless and potentially innocent prisoner, Revan and Onasi intervened. A fight broke out between the two parties, leaving all three Sith dead."}, {"tag": "p", "text": "Afterward, the Aqualish began to talk to Revan, thanking him and revealing that he had in fact supplied uniforms to the Beks. He also advised Revan to speak with Gadon Thek, the leader of the Beks, if he wished to help with the fight against the Sith. Since access to the Lower City and hence the Bek headquarters was restricted, the Aqualish told them to take the armor of the deceased Sith soldiers. Knowing that his identity was now known to the Sith authorities, the Aqualish thanked Revan one last time before leaving to seek a hideout."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Aqualish hated the Sith, and went as far to steal Sith uniforms in order to undermine their efforts to subjugate Taris. He believed in a proverb of his people, \"the enemy of my enemy is my friend.\" Thus, when he saw Revan defeat his interrogators, he openly confessed to his crimes and revealed his opinions on the Sith. In addition to speaking his native language, the Aqualish could understand Galactic Basic Standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aqualish's first appearance in canon was as a non-playable character named \"Alien Prisoner\" in the Star Wars: Knights of the Old Republic video game, in which the player, Revan, can interact with him. Although Sith uniforms are required for entry into the Lower City, this encounter with the Aqualish is not the only way to obtain the armor. Among other possibilities, the player may talk to either Sarna or Yun Genda, and get invited to a Sith party that is to be held in the North Apartments. At the party, the Sith troopers, unaware of the potency of Tarisian ale, become intoxicated and pass out, allowing the player to sneak in and steal the uniforms. If the uniforms are obtained this way, the Aqualish and his Sith interrogators will not appear in the game. However, since talking to the Aqualish is the only way to gain light side points, it is considered to be the canonical path that Revan took."}, {"tag": "p", "text": "Following the canonical series of events furthers a player's light side alignment. However, events can unfold differently depending on the dialogue choices of the player. For example, the player may decide not to get involved in the interrogation. In this case, the Aqualish will continue to insist his innocence, prompting the Sith Commander to kill him. Afterward, the Sith begin searching the room, and the player is allowed to leave. The player must eventually return to the room and kill the trooper for their uniforms in order to continue the plot. This course of events does not earn a player any alignment points.\nIn addition, if the player kills the Sith Troopers, then equips their armor before talking to the Aqualish, he will still consider you a friend based on your actions, except the player has the option of killing him for dark side points. However, if Carth is with you, he will prevent you from doing so, allowing the Aqualish to escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}