{"url": "Battle_of_the_Vallusk_Cluster", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles in the Gordian Reach", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle of the Vallusk Cluster"}, {"tag": "p", "text": "The Battle of the Vallusk Cluster was initiated by fleet-elements of the Rebel Alliance navy, six months after the Battle of Yavin in 0 ABY, in order to aid the main fleet at Yavin."}, {"tag": "h2", "text": "Prologue"}, {"tag": "p", "text": "Admiral Gial Ackbar, representing the Mon Calamari faction of the Alliance, agreed to attack Imperial forces in the Vallusk Cluster. Several other areas of the blockade were also singled out for attack, to minimize the chance of Imperial commanders seeing through their ploy. This would serve to divert Imperial fleet-elements from the siege of the Gordian Reach sector, opening up a small \"hole\" in the Imperial blockade net and allowing the evacuating Rebel personnel of Massassi Station to escape with their fleet."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Admiral Ackbar's forces,which were made out of Mon Calamari Star Cruiser, and CR90 corvettes, begun their attack in the Vallusk Cluster, quickly followed by two more strikes in other parts of the blockade. Imperial Admiral Amise Griff, who was in charge of the blockade forces while Darth Vader's Executor underwent repairs, was not fooled by the Mon Calamari attacks, and refused to send additional ships to aid his forces under fire. Instead, he proceeded to attempt to stop the main Rebel fleet from using the free passage and thus claim victory for himself, a decision that would ultimately cause his death."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The amount of casualties inflicted on each side in the battle is unknown, but the operation was considered successful on the Mon Calamari's part. It was also the first time the Mon Calamari had openly shown their allegiance with the Rebel Alliance, though they had clashed with the Empire before."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}