{"url": "Unidentified_B1_battle_droid_captain", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Separatist droid officers", "Category:Unidentified B1 battle droids"], "nodes": [{"tag": "h1", "text": "Unidentified B1 battle droid captain"}, {"tag": "p", "text": "During the Clone Wars, a B1 battle droid captain commanded the Separatist leader Count Dooku's personal Munificent-class star frigate. Circa 21 BBY, while inside an ice field, the frigate came across the damaged Delta-7B Jedi starfighter of Jedi Knight Anakin Skywalker. The droid Captain ordered the fighter and its pilot to be captured, and Skywalker was subsequently apprehended. However, the Jedi had planned his capture and disabled the security systems of the frigate, which allowed Jedi Master Obi-Wan Kenobi to infiltrate the ship unseen. As the Jedi confronted Dooku together, the frigate was ambushed by the Republic Venator-class Star Destroyer Resolute. Pursued by the Jedi pair, Dooku was able to escape from the frigate, and the Captain was left to take care of the destroyer."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Created by Baktoid Combat Automata, a B1-Series battle droid was a captain in the Confederate Navy during the Clone Wars. The droid was in charge of the personal Munificent-class star frigate of Count Dooku, the leader of the Confederacy. Around 21 BBY, the frigate was passing through an ice field when a subordinate droid of the Captain spotted a heavily damaged Delta-7B Jedi starfighter nearby, which contained one life-sign aboard. Upon hearing the subordinate's report, the Captain ordered the starfighter to be towed into the frigate's docking bay and sent a security detail, consisting of B1 and B2 battle droids, to restrain the fighter's Jedi pilot. The fighter was successfully captured and the Jedi, Anakin Skywalker, was quickly imprisoned."}, {"tag": "p", "text": "Unbeknownst to the Captain, Skywalker had intentionally allowed himself to be captured so that he could disable the frigate's security systems and allow fellow Jedi Obi-Wan Kenobi to infiltrate the frigate undetected. Soon after Skywalker's supposed capture, while the frigate was near the planet Vanqor, Kenobi boarded the ship and freed Skywalker, after which the pair confronted Dooku together. At the same time, the frigate was ambushed and fired upon by the Republic Venator-class Star Destroyer Resolute. Chased by the Jedi, Dooku quickly fled from the outgunned frigate, leaving it and the Captain to deal with the destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all B1 battle droids of the same series, the droid Captain stood 1.91 meters in height and had black photoreceptors. The Captain was in command of Count Dooku's frigate, and the droid crew of the ship called themselves \"the best of their series,\" an outlook held because they served directly under the leader of the Confederacy. Jedi Knight Skywalker did not share their opinion—he believed the droids were so unintelligent that they would fall for the most simple of plans. Indeed, when the Captain heard about the Jedi's immobilized fighter, the droid ordered it to be captured, failing to realize that that was exactly what Skywalker wanted."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The B1 battle droid Captain first appeared in The Clone Wars: Bait, an issue of the Star Wars: The Clone Wars webcomic series, which led directly into \"Dooku Captured,\" the eleventh episode of Season One of the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}