{"url": "Unidentified_B1_battle_droid_lieutenant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Separatist military members", "Category:Unidentified B1 battle droids"], "nodes": [{"tag": "h1", "text": "Unidentified B1 battle droid lieutenant"}, {"tag": "p", "text": "A B1-Series battle droid lieutenant served at General Grievous's castle on the third moon of Vassek in 22 BBY during the time of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When viceroy Nute Gunray escaped the Venator-class Star Destroyer Tranquility, this lieutenant was assigned to protect a hologram of Gunray, which was intended to throw the pursuers off track. When Jedi Master Kit Fisto along with Jedi Knight Nahdar Vebb and a squad of clone troopers reached the Third moon of Vassek and entered into a mysterious castle, they discovered what seemed to be the viceroy, guarded by the group of battle droids."}, {"tag": "p", "text": "Eventually, the lieutenant noticed the task force while conversing with the viceroy and his squad engaged the troops. Soon, Nahdar Vebb brutally cut the droid in half and performed a force push to \"incapacitate\" the still functioning lower half of the droid. The droid was the last of his squad to be defeated. Vebb and Fisto would later discover that the viceroy, and the droids were only part of a trap."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though a normal battle droid would panic when faced by two Jedi, this droid was loyal enough to take a stand against his foes and make a hoax look realistic. This particular lieutenant had his troops stand their ground and slowly advance as they targeted the Jedi first instead of mindlessly charging at his enemies, a tactic more commonly employed by battle droids. However, this tactic did not succeed and the lieutenant was defeated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle droid appeared in the Star Wars: The Clone Wars episode Lair of Grievous. However, the episode did not say which B1 battle droid was the lieutenant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}