{"url": "Unidentified_BX-series_droid_commando_(crystals)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Non-canon Legends articles", "Category:BX-series droid commandos"], "nodes": [{"tag": "h1", "text": "Unidentified BX-series droid commando  (crystals)"}, {"tag": "p", "text": "A BX-series droid commando was ordered to transport stolen lightsaber crystal to a ship in a ice mountains on the other side of the planet. However Clone Commander Gree had been assigned to retake the Crystals from the droid, who had hidden them in the canyon. The droid was attacked in a canyon by Gree's V-19 Torrent starfighter however used a J-1 proton cannon to repulse the starfighter. Although successfully landing a hit on the left wing the proton canon was also destroyed forcing the droid to flee to a wooded area on the planet."}, {"tag": "p", "text": "After creating a Vespula Fighter the droid launched an attack on Commander Gree's Wet Terrain Recon Transport walker however his fighter spins and went into a tree. After pursuing Gree into the desert, the commando successfully created a PH-STAP and attacked Gree. After the Clone embarked his Desert Speeder the droid chased him across the desert. Gree forced sand back at the droid's speeder however this caused a collision and both vehicles were destroyed. After digging up the hidden crystals secretly the droid created a KD81 Cargo Skiff on which he put the crystals. He then drove off the the ice mountains where his ship would be waiting. Gree then caught up with him on an Ice Speeder. Whilst Gree opened fire the commando avoided the lasers. Jedi Master Yoda then informed Gree that he must not destroy the speeder or else the crystals would be destroyed as well. The commando did not notice Gree's tractor beam and the crystals were taken from his speeder and beamed to Gree. Whilst Gree returned to the Jedi temple with the crystals the droid was left on the ice to explain his failure to Count Dooku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}