{"url": "Battle_of_the_World-Well", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battles of the Senate", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Battle of the World-Well"}, {"tag": "p", "text": "The Battle of the World-Well took place in 27 ABY at the Well of the World Brain on Yuuzhan Vong-occupied Coruscant. Jedi Jacen Solo and Ganner Rhysode were led to the Well by several thousand Yuuzhan Vong warriors in order for Solo, who had pretended to convert to the Yuuzhan Vong religion while in captivity, to sacrifice Rhysode."}, {"tag": "p", "text": "Instead, Rhysode accepted his own lifelong desire to be a hero, channeling it into a strength as he engaged the thousands of Yuuzhan Vong at the entrance to the Well while Solo communed with the World Brain, turning it to his side. Rhysode engaged the warriors first one-on-one, but as he proved unable to be defeated they came in greater numbers. Rhysode became completely one with the Force, slaying all the warriors who came against him until there were none left, buying time for Solo. Finally, when faced with a tank beast and infantry, Rhysode brought down the ceiling, killing himself and his opponents. Solo was able to escape with the aid of his mentor Vergere, returning to the New Republic."}, {"tag": "p", "text": "Rhysode's display of skill and strength earned him tremendous respect among the Yuuzhan Vong warrior caste, as well as gaining him a place in the Jeedai heresy and entering the Yuuzhan Vong religious pantheon. Solo's conversion of the World Brain and return to the New Republic proved vital in finally defeating the Yuuzhan Vong and retaking Coruscant."}, {"tag": "h2", "text": "Buildup"}, {"tag": "p", "text": "During the Mission to Myrkr, Jacen Solo was captured by the Yuuzhan Vong. He spent the next months with Vergere, a former Old Republic Jedi who had hidden her talents during her time among the Yuuzhan Vong, being tortured and exposed to Vergere's radical philosophy of the Force. Solo eventually escaped to Coruscant, which had been conquered by the Yuuzhan Vong. There he was recaptured by Vergere and Executor Nom Anor, who offered him the chance to convert to the Yuuzhan Vong religion and take up the mantle of godhood, as the Yuuzhan Vong thought him the incarnation of Yun-Yuuzhan; Solo accepted."}, {"tag": "p", "text": "As one of the Twin Gods, the Yuuzhan Vong also saw his twin sister Jaina Solo as the incarnation of Yun-Harla, and greatly desired that the two twins should battle to the death in a twin sacrifice, which was traditional among the Yuuzhan Vong. Accordingly, they sought to capture Jaina. To lure Jaina to Coruscant, rumors were spread of an individual that had spotted Solo on the terraformed world. However, these rumors directed the recipients towards Jacen Solo himself, disguised as a middle-aged man. As the rumors slowly spread, it was hoped that Jaina would hear the message and be drawn to seek out the individual. Jacen, in his disguise, was put aboard a camp ship with several Yuuzhan Vong guards and a dovin basal which would annihilate the ship and the refugees aboard if he betrayed them. Jacen Solo, however, had not actually converted, and was determined to make the attempt a failure. Jedi Knight Ganner Rhysode came to hear the rumors and pursued them, drawing him to the camp ship. Solo could feel him coming and blanketed him through the Force with a sense of dread and foreboding, hoping to frighten him out of the trap. Rhysode would not be deterred, however. Even after a powerful mind trick, he returned, overpowered the guards, and confronted the disguised Solo. Rhysode demanded that he be told what the seemingly unknown man knew of Jacen Solo. Solo revealed himself, stunned Rhysode, and took the captured Jedi back to Coruscant with him, considering the trap wasted."}, {"tag": "p", "text": "Rhysode was kept semi-conscious on Coruscant while Solo persuaded Anor to allow him to sacrifice Rhysode in a practice for the twin sacrifice, held in the Well of the World Brain, the former Senate Building. Anor agreed, but what Solo actually wanted was access to the World Brain itself. When the trial sacrifice was fully prepared, Rhysode was awoken and left alone with Solo, in order that Solo could convert him to the Yuuzhan Vong religion as well. Solo began with a traditional religious speech, but quickly rendered the monitoring creatures in the room unconscious. He told the incredulous and confused Rhysode that he remained a Jedi at heart and tended to Rhysode's injuries. He convinced Rhysode to go with him, that they were both dead, but that in the Well of the World Brain they could accomplish something meaningful with their deaths. He offered Rhysode Anakin Solo's lightsaber, and convinced Rhysode to play along as they were led out to the sacrifice."}, {"tag": "p", "text": "Anor, himself a cynic, was disinclined to trust Solo's conversion, but went along with it nevertheless. The two Jedi were led by Anor and Master Shaper Ch'Gang Hool in a magnificent procession to the Well of the World Brain. Vergere was also present, in whom Solo had confided his plans; she was his mentor and, he suspected, no more loyal to the Yuuzhan Vong than he. Rhysode was confused and terrified, but Solo remained glacially calm. Just before entering, Rhysode collapsed, unable to bear the situation anymore. Overwhelmed with self-loathing at his own perceived weakness, he nearly committed suicide. Solo had to pick him up with the Force and use telekinesis to force him to walk. As soon as they entered the Atrium of the Senate, Solo slammed the door shut, locking himself and Rhysode inside. They rushed to the Well of the World Brain, the former Grand Convocation Chamber, where Solo offered Rhysode an escape route. Rhysode refused to leave without Solo, and as they argued the Yuuzhan Vong blew through the door. Rhysode finally came to terms with his fear and his lifelong desire to be a hero, deciding to make a stand at the door while Solo communed with the World Brain."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Rhysode cut down the squad of warriors sent in by Anor to search the area and strode to the door, where he issued a dramatic challenge to the thousands of Yuuzhan Vong warriors present in the procession. Anor was frightened by Rhysode's extreme confidence, and urged the warriors to attack."}, {"tag": "p", "text": "The warriors began by engaging Rhysode one-on-one, as they did not see him as a significant threat and single combat was seen as the most honorable way of engaging the enemy. He defeated all comers, however, and after a long succession of single engagements the warriors began attacking in pairs, Rhysode having proven too formidable for single combat. Rhysode still remained undefeated, submerging himself completely in the Force and shrugging off numerous minor injuries as he cut down warrior after warrior. Eventually, the Yuuzhan Vong came at him in groups, but by that time Rhysode had already built heaps of the dead around himself."}, {"tag": "p", "text": "Anor, taking shelter behind some debris, was terrified of Rhysode and of the fact that Jacen Solo was alone with the World Brain. He demanded that the commander of the warriors use some sort of explosive or gas against Rhysode. The commander refused, citing it as a breach of honor to deny such a worthy enemy personal combat. Hool also suggested that the use of area-effect weapons would be unwise, as they could harm the World Brain. Vergere drew Anor off to the side and told him that there was no chance Warmaster Tsavong Lah would tolerate Anor's role in the fiasco. She knew that he kept a secret craft in an otherwise unknown escape route inside the Well of the World Brain, and encouraged him to flee and take her with him. Anor waited until he was unobserved, then sneaked in through a hidden entrance, taking Vergere with him to the craft and preparing it for launch. Vergere betrayed him, however, revealing that she was a Force-user and binding him as she awaited Solo."}, {"tag": "p", "text": "Rhysode continued battling, holding off massive numbers of Yuuzhan Vong as he took various injuries and suffered venomous amphistaff bites. He became one with the Force and, repeating his battle cry of \"None shall pass,\" he used his skills in telekinesis to levitate the pieces of the Great Door of the Senate and tear the statues lining the Atrium from their pedestals, battering his enemies with whirling debris. In time, he killed all those who faced him. Pausing, he saw that the Yuuzhan Vong had brought forth reinforcements—infantry supporting a massive flame- and acid-spewing tank beast. Realizing he could not hold out against it, Rhysode collapsed the ceiling of that part of the building on himself, the tank beast, and the infantry, killing himself and his enemies and blocking the entrance to protect Solo."}, {"tag": "p", "text": "Meanwhile, Solo was taken into the nutrient pool which nourished the World Brain by its mass of tentacles. Solo had befriended the World Brain earlier in his captivity, before trying to kill it. The betrayed creature wished to take its revenge and devour Solo. Solo, however, opened himself to the World Brain through the Force in a bond of perfect empathy and love, establishing their oneness. Solo persuaded the World Brain to disrupt the worldshaping ongoing on Coruscant slightly, just enough to irritate the Yuuzhan Vong and keep their world from perfection—in Solo's words, to force the fanatics to learn to compromise. Upon realizing that Rhysode still fought, Solo left the pool to rush to his aid, but Vergere was present and persuaded him to let Rhysode have his great moment and to honor his sacrifice by escaping. Solo felt Rhysode die as Vergere took him to Anor's escape ship and the pair departed Coruscant to return to the New Republic."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Solo and Vergere successfully escaped, returning to the New Republic. There, Vergere prevented the Alpha Red bioweapon from being deployed, and gave her life to save Solo. Solo went on to help end the war peacefully, persuading Zonama Sekot to join with the Jedi, which helped the Shamed Ones rise up against the Yuuzhan Vong, and killing Onimi, the power behind the Yuuzhan Vong throne. His rapport with the World Brain also allowed him to keep the World Brain from destroying Coruscant when it was recaptured by the Galactic Alliance."}, {"tag": "p", "text": "Rhysode's last stand was witnessed by several Yuuzhan Vong who survived, and his display of martial strength and bravery earned him awed respect among the warrior caste. Rhysode also entered the pantheon of the Jeedai heresy, a creed among the downtrodden Shamed Ones of the Yuuzhan Vong which revered the Jedi as heroes who would liberate them from their low social station and restore true religion to the Yuuzhan Vong. Rhysode, called \"the Ganner,\" was held in reverence as one of these Jedi heroes. According to a vision Vergere had, \"the Ganner\" would eventually enter the Yuuzhan Vong religion as an invincible Jedi giant who guarded the gates to the land of the dead, his battle cry of \"None shall pass\" inscribed in the arch, keeping the dead within where they could not bother the living."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle of the World-Well appeared in the novel The New Jedi Order: Traitor by Matthew Stover. It has only been explicitly named in The New Jedi Order: Destiny's Way, in which there is the first and only reference to it as \"the battle of the World-Well.\" Though it is unlikely that Rhysode's death was actually planned at the time of The New Jedi Order: Dark Tide I: Onslaught's writing, it contains imagery which could be retroactively seen as foreshadowing the battle: Corran Horn has a brief mental vision of Rhysode covered in swarming Yuuzhan Vong."}, {"tag": "p", "text": "The Battle of the World-Well has proven immensely popular among readers due to its epic nature, landing on Star Wars Insider's list of the 20 Most Memorable Moments of the Expanded Universe and topping fan polls of the greatest moments in the Expanded Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}