{"url": "Unidentified_Black_Sun_agent", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Black Sun members", "Category:Individuals of unspecified species", "Category:Non-binary individuals", "Category:Pilots", "Category:Unidentified criminals"], "nodes": [{"tag": "h1", "text": "Unidentified Black Sun agent"}, {"tag": "p", "text": "A non-binary agent of Black Sun followed the former Jedi Ahsoka Tano to a planet in the Thabeska system, where they attempted to recruit Tano for the criminal syndicate. Tano declined and fled in her light freighter, with their ship in close pursuit. When the agent's ship came under fire from a larger ship, piloted by Bail Organa's associates Chardri Tage and Tamsin, the agent was forced to flee."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 18 BBY, a non-binary agent working for the Black Sun criminal syndicate was sent to recruit the former Jedi Ahsoka Tano. Tano, who had departed the planet Thabeska, noticed their starship approaching her location after she landed in the mountains on another planet in the same system. As she had not gone into hyperspace and there was no tracking device aboard her light freighter, Tano realized the other ship had likely tracked her visually."}, {"tag": "p", "text": "After the agent disembarked from their vessel, they told Tano that Black Sun had noticed her work under her pseudonym \"Ashla\" as a pilot for the Fardi clan. \"Ashla\" had helped people affected by the rule of the Galactic Empire and thereby disrupted Black Sun's criminal enterprises, leading the agent to threaten Tano that she could either pay back the syndicate with credits and labor or pay with her life. Tano turned down the Black Sun agent's offer and dodged their blaster fire to escape in her light freighter, but they pursued her in their more advanced ship. Both parties damaged the engines of the other's ship, and Tano was close to crashing when a larger ship, piloted by Chardri Tage and Tamsin on a mission to locate Tano on Bail Organa's behalf, fired upon the agent's vessel and forced them to flee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The agent regarded the Fardi clan as petty scum yet, in contrast, described Black Sun as a high-level organization engaged in business ventures. As those ventures included trafficking in sentient beings, Tano would not have described them in such terms."}, {"tag": "p", "text": "To secure the outcome desired by Black Sun, the agent was willing to threaten Tano's life, but they did not begin firing blaster shots at her until Tano said she was not interested in their offer. Their reflexes were not quick enough to land a hit on the former Jedi before she entered her freighter, leaving the agent with a choice between charging its ramp or pursuing in their ship; the Black Sun operative chose the latter. At one point, they were flying toward Tano when she pulled her ship around, and it was unclear to Tano if the agent did not care about ramming her or failed to notice her change of direction. After the agent successfully targeted Tano's starboard engine and she spun out of control, they appeared to seek a better viewpoint to watch her expected crash, but the agent chose to flee instead of engaging in further combat upon the arrival of the larger ship sent by Organa."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The agent wore dark armor that completely covered their body and utilized a voice modulator; as a result, Tano was unable to identify them by their physical appearance, such as their species. The difficulty of understanding their modulated words left Tano uncertain if they were a seasoned professional utilizing old equipment or too new to afford a modulator of better quality. Tano observed their cracked knee plating was a vulnerable spot she could target. They armed themselves with at least two blasters that were readily visible. Their well-maintained starship was small and sleek, with cannons that were slower but more powerful than those of Tano's freighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Black Sun agent appeared in the novel Ahsoka, written by E. K. Johnston and published in 2016. The use of gender-neutral singular they pronouns in the novel was confirmed by Johnston via Twitter to indicate the agent's correct pronouns as a non-binary character. They are the second non-binary character in the new Star Wars canon, preceded in the same year by Eleodie Maracavanya in Chuck Wendig's Aftermath: Life Debt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}