{"url": "Battle_of_the_Ywllandr_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Prefsbelt sector", "Category:Battles of the Mygeeto theater"], "nodes": [{"tag": "h1", "text": "Battle of the Ywllandr system"}, {"tag": "p", "text": "A battle occurred in the Ywllandr system in 19 BBY, during the final days of the Clone Wars, as part of the Outer Rim Sieges. Following the Battle of Coruscant, Jedi General Plo Koon—overseeing a small Republic Navy fleet from the Republic flagship Courageous—pursued Confederate forces to the Ywllandr system, which had been established as a choke point along the Entralla Route to hinder Republic activity in the surrounding parts of the Outer Rim Territories. The ensuing engagement resulted in heavy fighting, with Koon eventually triumphing over the Confederate forces. His victory allowed Jedi Master Ki-Adi-Mundi's clone trooper detachment to move in and assault the nearby world of Mygeeto, while Koon was reassigned to command a campaign at Cato Neimoidia."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "By 19 BBY, the final year of the Clone Wars, the Confederacy of Independent Systems took control of the Ywllandr system in the region of the galaxy known as the New Territories. In taking the star system, which laid on the Entralla Route hyperlane, the Confederacy converted it into a choke point, forcing Galactic Republic starships and naval fleets that were bound for other areas of the Outer Rim Territories to pass through the enemy-controlled system. The system became an area of interest when the Republic targeted Separatist holdings throughout the Outer Rim in a campaign termed the Outer Rim Sieges. Following the Confederate Navy's retreat at the Battle of Coruscant, Jedi General Plo Koon, a member of the Jedi High Council, led a Republic Navy strike force in pursuit of the Separatists. His task force chased them from the galactic capital of Coruscant and along the Entralla Route to the Ywllandr system, where they began an offensive to repel the Separatists from the system."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Commanding his small fleet from the bridge of the Republic flagship Courageous, Koon oversaw the Republic's assault on the Confederate forces, focusing on breaking the Ywllandr system's choke point. During the heavy fighting that followed, Koon participated in a meeting with the other Jedi Masters of the Jedi Council via holographic connection from Courageous's bridge, regarding their plan to have Jedi Knight Anakin Skywalker spy on Supreme Chancellor Palpatine. His fleet eventually overpowered the Separatist defenses, severing their hold on the system."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Koon's victory in the Ywllandr system allowed Jedi General Ki-Adi-Mundi's battle group to reach the nearby planet of Mygeeto, which—being a major holding of the Separatist-allied InterGalactic Banking Clan—was another target in the Republic's Outer Rim campaign. The world had been mired in conflict since 21 BBY, two years prior. While Mundi staged an assault on Mygeeto with his clone troopers from the 501st Legion and the Galactic Marines, Koon meanwhile assumed command of Republic forces on the Neimoidian purse world of Cato Neimoidia, a Trade Federation stronghold that was resisting Republic control despite its defeat a month earlier. Koon was later killed following Supreme Chancellor Palpatine's issuance of Order 66, a secret directive for clone troopers to execute their Jedi commanders. Clone Captain Jag shot down the Jedi Master's Delta-7 starfighter during an aerial patrol of one of Cato Neimoidia's bridge cities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of the Ywllandr system was created for the novelization of Star Wars: Episode III Revenge of the Sith, which was authored by Matthew Stover and published on April 2, 2005. It was referred to in passing in the novel, not being alluded to in the film itself, which was released on May 19 of the same year. Several entries of the 2008 The Complete Star Wars Encyclopedia mentioned the battle, in particular expanding on how the Ywllandr system was a \"choke point\" for the Confederacy, which the novel had established but not elaborated upon. The battle was further referenced in The Essential Atlas (August 2009), which clarified that it was part of the Outer Rim Sieges; and The Essential Guide to Warfare (April 2012), in which its connection to the Battle of Mygeeto was introduced."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}