{"url": "Unidentified_Child_of_the_Emperor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Children of the Emperor", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Sith Empire personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Child of the Emperor"}, {"tag": "p", "text": "A Human male was a Child of the Emperor, an agent of the Sith Emperor of the reconstituted Sith Empire, during the Galactic War between the Galactic Republic and the Sith Empire. Going underground with his fellow Child Tannac after the supposed death of the Emperor, the Child accompanied Tannac to the planet Voss to retrieve their crazed sibling Suri and help her block out the wounded Emperor's mental commands."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male grew up on the planet Korriban, and during his childhood he was brought before the Sith Emperor of the resurgent Sith Empire. The Emperor transformed the youth into a Child of the Emperor, an extension of his will. In 3640 BBY, during the Galactic War between the Galactic Republic and the Sith Empire, the Human went underground with a fellow Child named Tannac after the apparent deaths of the Emperor and the First Son—the Child who shielded his siblings from the Jedi Order's view. Blocking out the mental raging of the wounded Emperor, the Human Child and Tannac tracked down their sibling Suri on the planet Voss after she contacted Kira Carsen, a former Child who was now a Jedi Knight."}, {"tag": "p", "text": "Locating Suri in the cave known as the Mind healer's grove, the Human and Tannac interrupted Suri's conversation with Carsen and her former teacher, the Jedi Master known as the Hero of Tython, who was responsible for the Emperor's apparent death. Speaking to the Jedi, Tannac convinced the two to let Suri depart with her siblings so that she could learn to block out the Emperor's voice."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive Human, the Child was fair-skinned with red facial tattoos, though he had a set of three scars across the left half of his face, and the Child had brown eyes and black hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Human carried a vibrosword in combat, and he wore tight-fitting, blue-gray robes with an overskirt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The unnamed Child first appeared as a non-player character named \"Tannac's Henchman\" in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, during the mission \"The Emperor's Orphans\" for the Jedi Knight class. If the player chooses to fight Tannac and Suri, which will result in a loss of affection with Carsen, all three Children will die in battle. This article assumes that the player chooses only the moral light-side options as a Republic Jedi Knight character and therefore assumes the Child survived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}