{"url": "Unidentified_Chagrian_(Gladiator_Night)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Unidentified Chagrians", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Chagrian  (Gladiator Night)"}, {"tag": "p", "text": "During the early years of the Galactic Empire's reign, a wealthy, male Chagrian traveled to the planet Lothal in order to view the gladiatorial event Gladiator Night. He purchased a private box for himself and four Twi'lek companions from Ezra Bridger, a local street urchin who also stole several items from the off-worlder while selling him tickets. Once at the event, the Chagrian witnessed the bounty hunter Bossk interrupt proceedings and defeat the gladiators fighting in the event, with the hunter then defeating the fight's organiser, Imperial Security Bureau Lieutenant Jenkes as other Imperials arrived to break up the event."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Chagrian traveled to the planet Lothal during the early years of the Galactic Empire's rule in order to attend Gladiator Night, an illegal event being held in secret on the world. Traveling with four female Twi'lek companions, he arrived in the spaceport of Lothal's Capital City where he was greeted by the local street urchin Ezra Bridger. After making sure no one was listening, the Chagrian asked the boy a series of questions about the event, expressing surprise when he learned that five tickets would cost him 500 but eventually paying 700 for a private box with a buffet. During the course of the discussion, Bridger warned the Chagrian that the Imperial allegiance pin he wore was dirty and gave him a cloth to clean it, but then managed to steal the pin and several other items the off-worlder wore without him noticing. Once the street urchin handed over the event ticket from his datapad, the Chagrian asked how he was to get to the event and was informed a shuttle journey was included in his package; however, after Bridger pointed out that a group of Rodians was about to board the shuttle he took the boys advice and hired a taxi piloted by a Bardottan driver instead."}, {"tag": "p", "text": "Once at Monad Outpost, the abandoned structure where Gladiator Night was being held, the Chagrian placed bets on the fight, which was between the Feeorin Warjak and the Houk Borbig Drob. He then took his seat in his private box alongside his companions, and shouted at the combatants to begin their battle. After the fight began however, it was interrupted by the arrival of Imperial Security Bureau Lieutenant Jenkes in the arena, being chased by the Trandoshan bounty hunter Bossk and Bridger. Jenkes ordered that the gladiators to attack Bossk, which they did, but the Trandoshan defeated them both before incapacitating Jenkes. Local Imperial forces, who Bridger had alerted to the location of the ilegal fight, then arrived and broke up the event, arresting Jenkes, who had secretly been the organiser of Gladiator Night."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Chagrian was tall with long horns, and upon meeting Ezra Bridger, he initially pretended to not be aware of the upcoming gladiator event as he feared someone may overhear them. While purchasing tickets to the event he asked several questions of Bridger, wanting to know if the boy was authorised to sell tickets and if food at the event was good. Despite it being included in the package he had already paid for, the Chagrian chose not to travel via a shuttle to the arena in order to avoid traveling with a group of Rodians, as he considered their smell unpleasant. He instead paid a taxi to take them on Bridger's suggestion, although he did not tip the street urchin. Once at the arena, the Chagrian called out to the combatants to the start the fight after he placed his bets, causing his companions to laugh as though he had been witty."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While on Lothal the Chagrian wore and expensive coat with an Imperial allegiance pin attached to the collar. He wore a jeweled ring and a silver wrist comm on his left hand, but these along with the pin and most of the contents of the Chagrian's money pouch were stolen by Bridger."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Chagrian first appeared in Ezra's Gamble, a junior novel written by Ryder Windham and released in 2014. The novel, which was a tie-in with the television series Star Wars Rebels, did not reveal the character's name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}