{"url": "Unidentified_Clone_Commander_(Geonosis)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Unidentified clone commanders"], "nodes": [{"tag": "h1", "text": "Unidentified Clone Commander  (Geonosis)"}, {"tag": "p", "text": "This Clone Commander was a clone trooper commander who served in the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The Clone Commander participated in the First Battle of Geonosis, the opening conflict in the war, leading Republic forces from a forward command center. When Jedi Master Yoda arrived at the post, the commander briefed him on the Republic's positions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This Clone Commander was one of millions of clone troopers created on the extragalactic planet Kamino to serve as soldiers of the Galactic Republic. The Grand Army of the Republic was formed in 22 BBY, and deployed to Geonosis to rescue a Jedi assault team from the Separatist Droid Army. During the First Battle of Geonosis, the commander observed the battle from the Republic Military forward command center. He reported directly to Jedi Master Yoda, informing the Grand Master of the Jedi Order that the Republic's forces were advancing from all forward positions on the battlefield."}, {"tag": "p", "text": "The clone army established air and ground supremacy under the skillful leadership of the Jedi High Council, causing the Executive Separatist Council to withdraw their droid forces from the battlefield. The commander reported that the remaining battle droids were in full retreat; Yoda acknowledged the commander's success before leaving to confront the Separatist Head of State, Count Dooku."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "This Clone Commander was a clone of a human male bounty hunter, Jango Fett, who served as the genetic template for all clone troopers created by the Kaminoans. As such, the commander's height was identical—1.83 meters—to the clones and their progenitor."}, {"tag": "p", "text": "Like all clone troopers, the commander was designed for loyalty and obedience. Prime Minister Lama Su assured Jedi Knight Obi-Wan Kenobi that the clones would obey any order without question. During the battle on Geonosis, the commander executed his duty as a clone trooper officer. He watched the clone army's progress on the battlefield and kept Yoda informed by reporting to him. The Grand Master commended the commander for his leadership more than once, and ordered him to summon a transport to which the commander complied."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This Clone Commander wore Phase I clone trooper armor, the first version of clone trooper armor that preceded the later Phase II clone trooper armor. His armor featured yellow markings which signified his military rank in the Grand Army of the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Clone Commander first appeared in the 2002 film Star Wars: Episode II Attack of the Clones. He was voiced by actor Temuera Morrison."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}