{"url": "Unidentified_Corva_sector_planet", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Alliance to Restore the Republic planets", "Category:Corva sector planets", "Category:Terrestrial planets", "Category:Unidentified planets"], "nodes": [{"tag": "h1", "text": "Unidentified Corva sector planet"}, {"tag": "p", "text": "A planet was located in a star system of the Outer Rim Territories' Corva sector. Titan Base was a secret starfighter base the Rebel Alliance had built into a mesa on the planet that was used to launch Rebel operations in adjacent sectors."}, {"tag": "p", "text": "At some point after the Battle of Yavin, a team of Rebel agents was transported to the planet, where Titan Base's command briefed the group on a mission to retrieve an experimental Imperial starship prototype from the military space station HM7-R. The team was provided with forged credentials to infiltrate the station and left Titan Base aboard a captured Imperial shuttle, The Emperor's Vision."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A terrestrial planet was located in a remote star system in the Corva sector, a part of the New Territories portion of the Outer Rim Territories. The planet's surface featured a mesa and a large subterranean cavern."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Secret Corva sector base"}, {"tag": "p", "text": "During the Galactic Civil War between the Galactic Empire and the Rebel Alliance, the Alliance operated a hidden starfighter base, known as Titan Base, on the planet. It housed the Nightmare Squadron of T-65B X-wing starfighters, as well as a resident Alliance Special Operations team—assets which were primarily used to conduct missions in adjacent sectors in order to avoid drawing Imperial attention to the presence of the Rebel base."}, {"tag": "p", "text": "The Titan Base Special Operations team was captured by the Empire at some point following the Battle of Yavin and detained aboard the Corva sector Imperial military space station HM7-R, also known as \"the Hammer.\" Approximately two weeks later, Alliance Intelligence learned of the existence of Project Shell-cracker, an Imperial weapons initiative developing a small-scale bomber starship that could circumvent the deflector shields of large-scale Rebel targets such as bases and capital ships before delivering a payload of high-yield hull-shattering bombs. The prototype of the experimental starship had also been moved to the Hammer for end stage testing."}, {"tag": "h3", "text": "Operation: Shell Game"}, {"tag": "p", "text": "The Alliance was determined to either retrieve the prototype of the starship or destroy it if capture proved impossible. However, the brief period of time during which the vessel was scheduled to be tested at the Hammer severely limited the ability of Titan Base, one of the closest Rebel bases to the Hammer, to mobilize its top operatives. As a result, a relatively untested team, consisting of Lieutenant Jaxon Brand; Ambassador Gorbek Fask; the spy Lelsk; the pilot Dero Jin; the commando Doleth Arnoko; and RA-7-D, a droid serving as an engineer and a saboteur, was recruited for the mission."}, {"tag": "p", "text": "A two-hour trip aboard an Alliance transport took the Rebel team from a minor world's starport to the planet housing Titan Base. While waiting for their briefing to begin, the agents visited several locations within the base and conversed with the Alliance personnel therein. Eventually, the team was summoned to the Titan Base's command center, where the agents were briefed on their mission by the base's commander Elemack and other members of Titan Base's command structure."}, {"tag": "p", "text": "The team was then provided with a captured Imperial Survey Corps shuttle, The Emperor's Vision, as well as forged credentials that would allow the agents to infiltrate the Hammer. In addition, the astromech droid R2-M5 accompanied the team in order to hide Titan Base's location in the shuttle's navicomputer as a precaution against Imperial inspection. Finally, the Rebel team traveled to the Hammer's system, the group's departure from Titan Base coinciding with that of Nightmare Squadron, which would serve as the team's escort during the mission."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The only inhabitants on the planet housing Titan Base were the military base's personnel, which consisted of its command staff, pilots, ground troops, mechanics, and droids. The non-mechanical Rebels at the base included members of various species, such as Humans, Near-Humans, Mon Calamari, Bothans, Sullustans, Twi'leks, and Gotals."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Titan Base was a mostly subterranean starfighter base that had been built into a mesa. It featured a hangar bay, barracks, and a command center. In addition, a weapons range had been established in a large natural cavern located beneath the base itself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet appeared in the roleplaying game adventure \"Operation: Shell Game.\" It was included in the 2013 Beta edition of the Fantasy Flight Games Star Wars: Age of Rebellion roleplaying game. This article assumes the adventure plays out as described."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}