{"url": "Battle_of_unidentified_planet_(shielded_city)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of unidentified planet  (shielded city)"}, {"tag": "p", "text": "A battle was fought on a planet between the Galactic Republic and the Confederacy of Independent Systems during the Clone Wars. Jedi Generals Obi-Wan Kenobi and Anakin Skywalker led a force of clone troopers in an extended campaign on the world against the Confederate droid army, which was safely entrenched in a city protected by an energy shield. Using an underground tunnel, Skywalker and Kenobi were able to infiltrate the city and destroy the shield generator. Once the shield was down, Clone Marshal Commander CC-2224, known as Cody, led the assault as clone troopers swarmed the city, leading to a Republic victory."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "High General Obi-Wan Kenobi and General Anakin Skywalker were in command of a force of clone troopers led by Clone Marshal Commander CC-2224, \"Cody,\" on a planet with heavy precipitation in 19 BBY. The Republic forces were entrenched for a campaign expected to last for months, while their turbolaser bombardment wore down the energy shield covering a Separatist-held city."}, {"tag": "p", "text": "One month into the siege, a jetpack-equipped Commander Cody descended to the entrance of the ramshackle shelter Kenobi was resting in and informed the general that they were on schedule and under their continued bombardment of the city, the enemy shields would be overwhelmed in a further three months. After Cody departed, Skywalker arrived with a meal he had obtained from the enemy camp after discovering an underground entrance into the city, running through the sewers beneath the protective shield."}, {"tag": "p", "text": "While their clone troopers continued their bombardment of the shield above ground, the two Jedi made their way through the sewers and into the underground levels of the city. From there, they made their way to the shield generator chamber and succeeded in destroying the generator with the use of explosives. With the shield down, Skywalker and Kenobi exited the city, leaving Commander Cody to lead a full scale attack including Clone jet troopers and All Terrain Recon Transports with Aggressive ReConnaissance-170 starfighters providing aerial support. The assault led to a Republic victory over the Separatist forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the Republic forces were preparing to depart aboard Acclamator-class assault ships and Venator-class Star Destroyers, Kenobi and Skywalker received an urgent HoloNet transmission from Jedi Master Mace Windu and Supreme Chancellor Palpatine. Intelligence had learned that the Confederate General Grievous had been making frequent trips to the planet Nelvaan, and the two Jedi were dispatched to ascertain what interest the Separatists had in the Outer Rim world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was shown in the twenty-second episode of the Star Wars: Clone Wars animated television series, and was originally aired on Cartoon Network on March 22, 2005. It was the second episode in the series' third season, and was released on the Volume Two DVD."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}