{"url": "Battle_of_unidentified_planet_(bubble_wort_projectors)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Battle of unidentified planet  (bubble wort projectors)"}, {"tag": "p", "text": "In the third year of the Clone Wars, a battle was fought on an unidentified planet between the Galactic Republic and the Confederacy of Independent Systems as part of the war's Outer Rim Sieges campaign. Jedi Aayla Secura, Voolvif Monn, and Agen Kolar had been fighting on this planet against a group of four LM-432 crab droids, who imprisoned the Jedi via bubble wort projectors. However, Jedi General Anakin Skywalker soon appeared, cutting through the force of droids with his lightsaber and freeing his commrades from their prisons with the Force."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 20 BBY, the third year of the the Clone Wars, Jedi Generals Aayla Secura, Voolvif Monn, and Agen Kolar participated in a battle on an icy planet that was part of the Republic's Outer Rim Sieges campaign. In the midst of the battle, the Jedi fought against a group of four LM-432 crab droids. The crab droids used their blasters to combat the Jedi, who in turn used their lightsabers to deflect the blasts. One of the crab droids then fired its bubble wort projector at Kolar, ensnaring him. Two of the other droids followed suit, trapping Monn and Secura next. However, it was at this moment that Jedi Knight Anakin Skywalker appeared, and destroyed one of the droids by cutting off its leg with his lightsaber. Skywalker then threw that leg into the second droid, destroying it as well. After that, Skywalker cut through the remaining two droids and used the Force to free his fellow Jedi, who cheered at the young Jedi's exploits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of an icy planet appeared in the twenty-second chapter of the Star Wars: Clone Wars television series, which aired on March 22, 2005. It marked the first appearance of the LM-432 crab droids, which went on to appear in Star Wars: Episode III Revenge of the Sith. The droids' bubble weapon used in this battle was later identified as the \"bubble wort projector\" in the Databank entry. A ruined Lucrehulk-class Core Ship is also visible in the background. However, it is not known if it was damaged as a result of this particular battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}