{"url": "Unidentified_Coruscant_Security_commander", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force officers", "Category:Individuals of unspecified species", "Category:Unidentified Galactic Republic individuals", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Coruscant Security commander"}, {"tag": "p", "text": "A male individual served as a Coruscant Security Force commander in the planet Coruscant's sector known as the Black Sun territory. Though most of the CSF had been forced out of the sector, a token detachment of police officers remained, notably Captain Theraguin and a team of officers under Lieutenant Doorn. As the commander had given up on the sector years ago, mostly, the CSF officers stayed close to the airspeeder taxi station in a defense position to prevent its takeover by Black Sun thugs."}, {"tag": "p", "text": "Around 3643 BBY, the commander ordered Lieutenant Doorn to retrieve a set of schematics that detailed secret passages under Coruscant. Doorn was hard pressed since the mission involved going deep into the Justicar territory which was just as bad in Doorn's opinion as staying in the Black Sun Territory. Adding to the presure, the commander called constantly asking Doorn for an update on the mission. Eventually, Doorn was able to enlist the help of a Republic individual who retrieved the plans for him. Doorn then gave the schematics to his commander."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The commander first appeared in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. The commander is mentioned in the missions \"Boom\" by Captain Theraguin and in \"Secret Passages\" by Lieutenant Doorn. While a possibility exists that due to the overall context of the conversations the \"commander\" is a reference to CSF Chief Winborn, this has not been confirmed and so he is treated as a separate character. It should also be noted that in a The Old Republic in-game codex, it is stated that the rank of Commander was used in the Republic as a sign of respect and did not indicate an actual rank of commander. Though this is reference to the Republic military, not the Coruscant police, there is no other evidence in-game or from other sources that the CSF had an official rank of commander during this time."}, {"tag": "h2", "text": "Appearances"}]}