{"url": "Battle_on_Doshan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Drannik sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle on Doshan"}, {"tag": "p", "text": "The Battle on Doshan was a battle conducted between the Imperial forces and the local Trandoshans. The battle was important enough to necessitate the use of the 501st Legion."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Several Imperial settlers, with Emperor Palpatine's expressed permission, attempted to claim the Doshan colony world as their own. However, they ended up engaging several Trandoshans in various fights. This resulted in the 501st Legion being ordered to step in and contain the Trandoshan violence."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "The 501st Legion proceeded to secure key points across the Doshan landmass's equator. One of their platoons, Negastrike platoon, then proceeded to an entrenched Trandoshan nest near the mouth of the Arakka waterway aboard Imperial transport boats. They managed to demolish the enemy fortification with repeating blasters and thermal detonators, but the platoon then found itself under fire from a company of Trandoshan raiders that had hidden beneath the waterway's algae mats."}, {"tag": "p", "text": "After pinning the Trandoshans down, Negastrike platoon proceeded to deploy jumptroopers to draw the Trandoshan fire in order to make landfall with minimal casualties. Upon arriving at the landfall, the Incinerator troops proceeded to saturate the shoreline with chemical spray while the Trandoshans were busy dealing with the jumptroopers and then ignited it with blaster fire, boiling well over a hundred Trandoshans alive from the ignited algae mats."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As a result of Negastrike Platoon's actions, the counterattack from the Trandoshans was thwarted, and also resulted in the platoon sergeant of Negastrike getting high praise from Darth Vader himself by citing his actions as being \"notable.\" The Rebel Alliance only learned of the battle after the dust had settled, with General Carlist Rieekan expressing regret that they didn't help the Trandoshans as a result."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}