{"url": "Unidentified_Dark_Jedi_(Endar_Spire)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Sith of Revan's Sith Empire", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Sith"], "nodes": [{"tag": "h1", "text": "Unidentified Dark Jedi  (Endar Spire)"}, {"tag": "p", "text": "A Human male Dark Jedi was part of the Sith Empire of Darth Malak, the newly proclaimed Dark Lord of the Sith, in 3956 BBY. During that time, the Dark Jedi was part of a Sith battle fleet led by Darth Bandon, Malak's Sith apprentice, that ambushed and boarded the Republic Hammerhead-class cruiser Endar Spire in search of Jedi Knight Bastila Shan, under orders from Malak to capture her alive for her proficiency with battle meditation. During the battle, the Dark Jedi dueled a Jedi Master in a hallway connected to the vessel's bridge, where he was struck down."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male served as a Dark Jedi and became a member of the Sith Empire of Darth Malak, the former apprentice of Darth Revan and self-proclaimed Dark Lord of the Sith during the Jedi Civil War. In 3956 BBY, the Dark Jedi was part of a Sith battle fleet led by Darth Bandon, Malak's Sith apprentice and Shadow Hand, that ambushed and boarded the Republic Hammerhead-class cruiser Endar Spire over the planet Taris in an effort to capture Jedi Knight Bastila Shan, whose skill with battle meditation Malak coveted."}, {"tag": "p", "text": "During the ambush, the Dark Jedi encountered a Jedi Master in the hallways leading to the Endar Spire's bridge and engaged her in lightsaber combat. The amnesiac Revan and Trask Ulgo, two Republic soldiers, witnessed the remainder of the duel, which concluded with the death of the Dark Jedi. However, the Jedi Master was also killed shortly afterward when the wall section behind her was destroyed from heavy damage from the Sith fleet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Human male, the Dark Jedi had fair skin and brown eyes. He kept his hair shaved to the skull."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a member of Darth Malak's Sith Empire, the Dark Jedi wielded a red lightsaber and outfitted himself with a set of Sith armor. Despite his skill with a lightsaber, however, he was unable to prevent his death at the hands of the Jedi Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dark Jedi's first appearance was as a non-player character in a cutscene of the 2003 Star Wars: Knights of the Old Republic video game. He was later briefly mentioned in Prima Games' Knights of the Old Republic strategy guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}