{"url": "Unidentified_Death_Watch_soldier_(white_helmet)/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Death Watch members", "Category:Unidentified males", "Category:Unidentified Mandalorians"], "nodes": [{"tag": "h1", "text": "Unidentified Death Watch soldier  (white helmet)"}, {"tag": "p", "text": "In 20 BBY, a Death Watch soldier took part in both a mission to Jabba Desilijic Tiure's Palace, the Takeover of Mandalore, and the Battle of Sundari, possibly perishing in the latter of the three.\nThis Mandalorian seemed to have a rank above that of many of his fellows, as he was charged with leading a squad of soldiers on at least one occasion. He was also seen to walk with Bo-Katan Kryze, who held one of the highest positions in the Death Watch. Further evidence is that this soldier featured the Death Watch's rank insignia on his shoulder pads."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 20 BBY, this Mandalorian took part in the mission to Jabba Desilijic Tiure's Palace, where he was present at Bo-Katan Kryze's side and later, after the Hutt Families had joined the Shadow Collective, helping up a resting warrior in Jabba's employment."}, {"tag": "p", "text": "A short time later, the Shadow Collective developed a plan where the criminals would attack Mandalore's capital, Sundari, and pretend to be subdued when the Death Watch arrived in order to acquire the favor of the people of Mandalore. The plan proceeded accordingly, with a group of Black Sun and Pyke Syndicate members taking captive workers and police at the Sundari shipping docks as other criminals took the residents of Sundari by surprise. This member arrived with some others, \"captured\" the criminals, and rescued those they had disarmed. When one of the police force members thanked him, the soldier replied that the former should instead give thanks to the leader of the Death Watch, Pre Vizsla. Later, the soldier was present when Savage Opress was defeated by Vizsla, according to plan, and helped to arrest Satine Kryze and her guards."}, {"tag": "p", "text": "Later, the soldier was nearest Pre Vizsla when Darth Maul successfully challenged Vizsla to a duel for the title of Mandalore. Toward the end of the lengthy fight, a defeated Vizsla briefly locked eyes with this soldier before being decapitated by Maul a few moments later. This member of Death Watch, along with several others, sided with Maul while recognizing him as the new leader of Death Watch, and temporarily gave chase to the rebels. The soldier was later visible at Prime Minister Almec's side after the latter gave a speech to the people of Mandalore."}, {"tag": "p", "text": "Soon after, this Mandalorian apparently had misgivings about serving under Maul and joined Bo-Katan Kryze's rebels. He helped Obi-Wan Kenobi escape the planet so the latter could inform the Galactic Republic of what had occurred on Mandalore. Interestingly, this member did not enter the hangar his allies used to take cover, nor did another Mandalorian giving chase."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Being a member of Death Watch, this soldier felt strongly that Mandalore had to return to its warrior-like ways, or it would fall. As with all Death Watch members, this Mandalorian was bound by honor, and chose to side with an outsider when the Death Watch's former leader was killed. Later, the soldier experienced doubt that he had made the correct decision, and defected to Bo-Katan Kryze's rebels."}, {"tag": "p", "text": "Similar to most Mandalorians, this soldier was a Human male with fair skin. This particular Mandalorian had blonde hair and light blue eyes as well as a scar running diagonally down his left cheek."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This soldier wore the traditional and resilient combat armor of the Mandalorian warriors, though in a significantly lighter shade. MThe warrior's helmet and jump suit were white, as opposed to the majority of the other Death Watch members, with the exception of Bo-Katan. The helmet was equipped with an antenna, while the uniform sported both a jetpack and a faded Death Watch rank insignia, verification that the soldier held an esteemed rank in the Death Watch. In addition to his armor, the soldier wielded a pair of WESTAR-35 blaster pistols."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Death Watch member first appeared in the Star Wars: The Clone Wars television series episode, Eminence, which was released in 2013. He was voiced by Dave Filoni, and credited as an enforcer."}, {"tag": "p", "text": "During the scene where the soldier helps a Quarren to his feet, another soldier using what appears to be the exact same model can be seen conversing with Bo-Katan Kryze."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}