{"url": "Unidentified_DUM-series_pit_droid/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:DUM-series pit droids", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified DUM-series pit droid"}, {"tag": "p", "text": "A pit droid was present on the planet of Balnab where he, along with at least three other pit droids had created a giant holographic image of a Balnab named Albee Dewaw where they managed to fool the local Balnabs into thinking that Dewaw was a powerful lord. They then forced the Balnabs into slavery. However, their rule came to an end with the arrival of C-3PO and R2-D2."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A pit droid crash-landed on Balnab, along with other pit droids, and over time, they noticed how dim-witted the locals were. So they built a control room hidden in one of the rocks and created Albee Dewaw, a giant holographic Balnab who could shoot lightning. Many Balnabs came to fear Dewa and saw him as a strict leader."}, {"tag": "p", "text": "One day around 21 BBY, R2-D2 and C-3PO landed on Balnab in order to search for fuel for their starfighter but were captured by the Balnabs and brought before Dewaw. Dewaw executed one of the Balnabs, accusing him of 'thinking' when Dewaw should do all the 'thinking'."}, {"tag": "p", "text": "Although C-3PO was also fooled by Dewaw, R2 grew suspicious and after searching around, found the hidden room where the pit droids worked. R2 opened the hatch and went in, and found that the pit droids were controlling the hologram. The pit droid then confronted R2, not feeling intimidated at all. However, R2 grew frustrated and chased the pit droid outside, where the Balnabs were. With their treachery revealed, the pit droids knew they were in trouble. The enraged Balnabs then stormed into the starship and destroyed it. The explosion threw the droid across the landscape, where he bounced a few times, muttered in \"pain,\" and collapsed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The pit droid was voiced by David Acord, who also voiced Albee Dewaw, and Jimba in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}