{"url": "Unidentified_EV-series_medical_droid", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:EV-series medical droids", "Category:Feminine programming", "Category:Torture droids", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified EV-series medical droid"}, {"tag": "p", "text": "An EV-series medical droid with feminine programing operated as an interrogation droid in the Citadel, a prison located on the planet Lola Sayu that was controlled by the Confederacy of Independent Systems during the Clone Wars. Following the capture of Jedi Master Even Piell by the Separatist, she was tasked with extracting from him the coordinates of the Nexus Route, a hyperspace route that led into the heart of both the Galactic Republic and the Confederacy. However, while the droid was torturing Piell, she was shot through the head by Clone Captain CT-7567, who had infiltrated the Citadel along with a group of clone troopers and several Jedi to rescue Master Piell from the Separatists."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A feminine EV-series medical droid operated as an interrogator droid in the Citadel, a prison originally constructed 500 years prior to the Clone Wars by the Galactic Republic to hold rogue Jedi on the planet Lola Sayu. However, it fell under the control of the Confederacy of Independent Systems when they conquered Lolo Sayu early in the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A feminine EV-series medical droid, this droid was covered in dark gray plating with blue and black marking and stood 1.74 meters in height. She had an elongated head that featured several antenna on its top, with a row of four red photoreceptors along its lower half and a fifth on her forehead, and on the right side of her head was emblazoned the insignia of the Citadel. The droid stood on two thin legs and had two pairs of arms, one that attached to her shoulders and another that emerged from her midsection, and her upper right arm was equipped with a needle. She was willing to use torture to extract the coordinates to the Nexus Route, and was even willing to gouge out Even Piell's remaining eye to accomplish her task. She stood unflinchingly as her droids were shot at by Republic clones, but when she herself was destroyed, she screamed in pain as she deactivated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This droid first appeared in \"The Citadel,\" the eighteenth episode of the canon animated series Star Wars: The Clone Wars' third season, in which she was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}