{"url": "Unidentified_Ewok_chief", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified Ewoks", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Ewok chief"}, {"tag": "p", "text": "An Ewok chieftain acted as the leader of an Ewok village located on the forest moon of Endor around 19 BBY. The Ewok and his village were constantly under threat from a massive beast they called the Beast in the Mouth of the Mountain. During the last year of the Clone Wars, a galactic event that the Ewoks were not involved in, the droid armies of the Confederacy of Independent Systems arrived on the forest moon during a stage of the war known as the Outer Rim Sieges. The droid armies built an outpost on the moon, but were eventually discovered by the clone armies of the Galactic Republic."}, {"tag": "p", "text": "The Republic sent a detachment of clone troopers to the forest moon, but soon lost contact with the clones. When a Republic gunship arrived to investigate, the Ewok chieftain sent his scouts to investigate the new set of Republic forces. When they returned, they brought with them the Jedi Knight Aayla Secura, who had accompanied the clones. The chieftain requested that Secura go and defeat the Beast in the Mouth of the Mountain, as it had been responsible for the death of her clone troopers and the destruction of the droids. Secura accepted the mission and fought the beast, killing it in combat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime during the final decades of the Galactic Republic, an Ewok male came into power of an Ewok village located on the forest moon of Endor. However, not all was well during the time, as a giant creature loomed as a threat to the village, living not to far away from the village up in a mountain cave. They dubbed it the Beast in the Mouth of the Mountain. Meanwhile, the rest of the galaxy was caught up in an event known as the Clone Wars. During the final year of the war, 19 BBY, the droid armies of the Confederacy of Independent Systems arrived on the forest moon as a part of a stage in the war known as the Outer Rim Sieges. The droids built an outpost on the moon, but were eventually discovered by the clone armies of the Republic. The Republic, in response to the remote outpost, sent a clone recon squad to scout out the outpost. The clone troopers arrived on the moon and eventually found the droid outpost. A struggle ensued, but it was soon broken up with the appearance of the Beast in the Mouth of the Mountain. The droids and clones were both wiped out completely, as their blaster weapons were of no use against the Beast."}, {"tag": "p", "text": "The Beast had destroyed the droids, while abducting the bodies of the clone troopers, leaving their armor behind. The Ewok chieftain investigated the carnage himself, and brought back a damaged clone trooper helmet, which he used to ornate a staff with. With the recon squad having dropped contact, however, the Republic sent yet another scouting team to find out what had happened. This time the Republic sent Jedi General Aayla Secura along with her clone trooper commander Bly. The Ewok chieftain, in response to the new arrivals, sent several Ewok scouts to investigate. After arriving, Secura went off into the woods by herself to investigate the recon squad's disappearance. She encountered a B1 battle droid, and swiftly removed its arms and legs with her lightsaber. However, before she could gather any information, the chieftain's Ewok scouts apprehended Secura, with the use of poison darts, and the battle droid."}, {"tag": "p", "text": "Bringing the two back the village, the Ewoks waited for Secura to wake up, as the poison had rendered her unconscious, while they explained to the battle droid their situation, as the battle droid could understand the Ewok language. When Secura woke up, she first noticed the chieftain's clone trooper helmet adorned staff and was quick to suspect the Ewoks of wiping out her clones. The battle droid quickly defused the confrontation by explaining what the Ewoks had told him about the Beast in the Mouth of the Mountain. The Ewoks had captured Secura as they had believed her to be a forest spirit, sent to help them to defeat the Beast. Secura decided to accept the mission to dispatch the beast, and the Ewok chieftain provided a scout to guide her to the beast's lair. Secura also brought the droid with her, strapping him to her back against his wish. The Ewoks guided her to the mountain where the beast resided and began to scale the mountain as the scout waited for her below."}, {"tag": "p", "text": "Arriving to the mouth of the cave that served as the Beast's lair, Secura entered with he lightsaber drawn and soon found the skeletal remains of the clone troopers. The beast attacked moments afterwards and destroyed the battle droid with a massive foot. Aayla Secura managed to defeat the beast by cutting stalactites off of the roof of the cave, which then impaled the giant arachnid Beast and killed it. Secura left the mountain, leaving the Ewoks to recover the droid's cranium. The Ewok chieftain received the cranium and created a new staff with it. As the Republic gunship left the forest moon, the chieftain was well through a painting that recounted the battle between Secura, the droid, and the Beast, forever cementing the event in Ewok history."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Ewok was dedicated to his village to lead it in times of trouble, such as the lifespan of the Beast that they feared. The Ewok believed in forest spirits, and believed Aayla Secura to be one upon sighting her. The Ewok believed that sending Secura to fight the Beast would be the correct choice of action in handling the Beast, and in the end his course of action proved successful. The Ewok would also record events of Ewok history through painting."}, {"tag": "p", "text": "The Ewok was covered black fur and had black skin and black eyes. He adorned himself with an ornate headdress constructed from feathers and the skull of an animal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ewok first appeared in What Goes Up..., a short comic collected in Star Wars: Clone Wars Adventures Volume 5 and written and illustrated by the Fillbach Brothers. The events of the comic were later in referenced in The Complete Star Wars Encyclopedia, by Daniel Wallace, Pablo Hidalgo, Stephen J. Sansweet and Bob Vitas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}