{"url": "Unidentified_Duros_(South_Apartments)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Duros", "Category:Unidentified males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Unidentified Duros  (South Apartments)"}, {"tag": "p", "text": "A Duros lived in the South Apartments of Taris with his friend Ixgil, both of whom were members of the Duros species that were harassed by Sith patrols. At one point, Ixgil's friend was arrested by the Sith, and held in the local Sith base. He was eventually freed by Revan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the escape pod carrying Revan and Carth Onasi landed on Taris, the duo sought refuge in an abandoned apartment located in the same building in which the Duros Ixgil and his friend of the same species lived. After two consecutive days of harassment from Sith patrols, Ixgil lost patience, and stood up to one of the patrols, only to be shot and killed by a Sith enforcer."}, {"tag": "p", "text": "The patrol then engaged in combat with Onasi and Revan, with the same Sith enforcer claiming them to be \"Republic Fugitives,\" Ixgil's friend assisted Onasi and Revan in the fight, helping them kill the Sith soldier and his droid associates. After the battle, the Duros then thanked Onasi and Revan for the assistance, before removing Ixgil's body, along with the Sith bodies, to protect Revan."}, {"tag": "p", "text": "However, he was caught by the Sith in doing this and was imprisoned in their military base, where Revan later found and freed him, as he and his companions went in search for the Taris Launch Codes. The late Ixgil's friend was unsure why Revan was in the base, but advised Revan that he followed him in escaping from the base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When fighting the Sith patrol in the apartment, the Duros cannot be killed by the enemy, but can still be attacked, possibly resulting him to clutch his side after the brawl if he is under fire for too long. The Duros may also draw out a sword during the fight, though he may also attempt to fight the Sith patrol without a weapon."}, {"tag": "p", "text": "The player gets light side points for freeing the Duros from the cell in the military base. However, the player, depending on their actions, can also gain dark side points regarding events with this Duros."}, {"tag": "p", "text": "When the player reaches this Duros in the Sith base, a small puzzle involving turning a number of panels to the off position must be solved in order to release the Duros. However, Revan can set all the panels to \"terminate,\" and the Duros will be killed, earning the player dark side points."}, {"tag": "p", "text": "Also, when the player first talks to the Duros, after defeating the Sith patrol in the apartment, the Duros thanks him for helping out, but whilst two of the three dialogue options to follow do not shift the player's alignment at all, the player could gain dark side points by threating to be brutal to the Duros, in which case the fearful Duros tries to explain himself for his words, even though nothing offensive was said. Even if the player does choose to snap, the Duros can't be brought into a fight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}