{"url": "Unidentified_Gamma-class_assault_shuttle", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Gamma-class assault shuttles", "Category:Moff Sarne's starships", "Category:Qektoth Confederation starships", "Category:Unidentified shuttles"], "nodes": [{"tag": "h1", "text": "Unidentified Gamma-class assault shuttle"}, {"tag": "p", "text": "This unidentified Gamma-class assault shuttle was part of Moff Kentor Sarne's forces, and was presumably part of the Kathol Sector Imperial Fleet before Sarne took control of it after the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 8 ABY, Moff Sarne cut a deal with the Qektoth Confederation to supply him with samples of their biochemical technology. In return, Sarne provided the Confederation with several ships and crews for their own purposes. On the orders of Captain Rolf Treidum, the assault shuttle headed for a set of coordinates to rendezvous with representatives of the Qektoth Confederation."}, {"tag": "p", "text": "The Confederation used this particular vessel as a testing ground for one of their new biochemical weapons. While the method of delivery was unknown, strange grooves began running in wild arcs on the floor, walls and ceiling of the assault shuttle. Energy surges rippled across vessel, and the exterior of the ship was engulfed in visible tendrils of energy. The biochemical agent caused all the assault shuttle's systems to malfunction, including back-up life support. The crew of the assault shuttle attempted to escape; several crew left the assault shuttle in zero-G suits, but were killed by the energy discharges. The last two remaining officers headed for the engineering section and locked themselves in."}, {"tag": "p", "text": "Twenty-one hours after the assault shuttle received their orders, the craft was detected by the New Republic corvette FarStar. Sensors scans of the assault shuttle could not determine the cause of the malfunctions or the reason for the energy surges, although they did detect the presence of lifeforms at the rear of the vessel. Captain Kaiya Adrimetrum entertained the notion that the shuttle's plight was caused by exposure to DarkStryder technology. To this end, she ordered a rescue party to dock with the assault shuttle and retrieve the survivors, as well as any look for any signs of the mysterious technology."}, {"tag": "p", "text": "One of the FarStar's support ships, the Muvon, docked with the assault shuttle and delivered a team to the vessel. The rescue party managed to recover the most recent computer logs of the vessel, and navigational charts to local systems. After breaking into the engineering section, the rescue party recovered the two Imperial officers, and transported them back to the Muvon. During the rescue operation, the energy discharges became more erratic and unpredictable as the shuttle's systems ionized and began discharging energy in random fits of feedback. The rescue team managed to evacuate the vessel shortly before the shuttle exploded."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Back on the FarStar, the Imperial officers were diagnosed as being infected by a biochemical agent with no known cure. In an effort to treat them, the FarStar headed to the Uukaablis system. However, as the agent was infectious, many of the FarStar's crew members became ill, leading to a raid on a Qektoth Confederation research facility to find a cure."}, {"tag": "p", "text": "The results of the experiment were studied by the Qektoth Confederation at their research facility in the Qu'mock system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}