{"url": "Unidentified_Galactic_Triumvirate_starfighter", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Unidentified Galactic Triumvirate starfighter"}, {"tag": "p", "text": "In 138 ABY, Imperial Knight Jao Assam flew a class of starfighter that was affiliated with the Galactic Federation Triumvirate. The fighter sported two angular, horizontal wings, as well as two rear S-foils that were vertical but that sat horizontally when the fighter was at rest. Gray in color, the fighter was also crewed by an astromech droid in an astromech socket; Assam's droid of choice was named W3."}, {"tag": "p", "text": "Assam had the fighter at a secondary communications array outpost in the Ithori system, before he took it to the Carreras system in search of the missing Imperial Knight Yalta Val. When he arrived on a Shifalan patrol ship, he was arrested by the Shifalan guards, who were under orders from Darth Wredd—a Sith posing as Val. Assam escaped in his fighter and dodged pursuit from Carreras starfighters before landing on Carreras Minor. There, he joined a party consisting of the junk dealer Ania Solo, the engineer Sauk, and the IG-series droid AG-37, and loaded his fighter into AG-37's freighter. The group possessed an Imperial communications droid that possessed coordinates to the planet Mala, where Val was being held prisoner by Wredd."}, {"tag": "p", "text": "When the freighter was captured by the Shifalan patrol ship and taken to the Carreras G51 communications array, Assam's fighter was stored in a hangar. Darth Wredd battled and severely injured Sauk, AG-37, and Assam before taking a Carreras fighter to Mala, but Solo followed him in Assam's fighter and freed the captive Val. She then returned to the communications array, which was crashing into Mala, bringing Assam's fighter to a skidding crash-landing in the hangar. Solo brought her injured friends aboard AG-37's freighter and made an escape. Assam later experienced a Force vision of the death of his Empress, Marasiah Fel, that included several of the Triumvirate starfighters and TIE Predators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A fleet of these starfighters appears on the phantom variant cover of Legacy 1 as an homage to the X-wing fighters on the original poster of 1977's Star Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}