{"url": "Unidentified_Gibbela_crop_plant", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fruits and vegetables", "Category:Plants of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Unidentified Gibbela crop plant"}, {"tag": "p", "text": "A species of crop producing plant grew on the planet Gibbela. The plant, which produced a yellow, cylindrical crop, was cultivated in concentric circles by the planet's native sentient species, the Dazouri. Several specimens of the plant were crushed under a Sentinel-class landing craft that landed on the planet in an abortive attempt to claim the planet for the Galactic Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A species of plant from the planet Gibbela had a single stalk that grew a cylindrical, spiraling, yellow crop, with white tufts at the top. The crop was supported by overlapping, dark green, pointed leaves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The plant was native to Gibbela, a primitive agricultural planet in the Outer Rim's Atrivis sector. The Dazouri, Gibbela's native sentient species, cultivated the crop plants in concentric circles centered on groves of two or three fruit trees. These gardens were protected by scarecrows, and tended with hoes. During the period of the Galactic Empire, Imperials scouted Gibbela as a possible site for colonization. Initial impressions suggested the local population would provide little in the way of resistance. Consequently, a small Imperial task force landed on the planet, with their Sentinel-class landing craft crushing several crop and fruit gardens. A local farmer retaliated and killed the Imperial task force, later converting some of their equipment to farming use."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ken Lizzl created this crop plant for the two-page comic \"The Value of Proper Intelligence to Any Successful Military Campaign is Not to Be Underestimated\", which was illustrated by Lucas Marangon and published in Star Wars Tales 19. For volumes one to twenty of Star Wars Tales, plausible stories were considered S-canon unless referenced in a non-Tales source. If this occurred, the story would be elevated to C-canon. The events of this comic received an entry in The Complete Star Wars Encyclopedia, thus raising the events to C-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}