{"url": "Battle_on_Wasskah", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Mytaranor sector"], "nodes": [{"tag": "h1", "text": "Battle on Wasskah"}, {"tag": "p", "text": "A battle took place on the moon Wasskah during the Clone Wars when a group of captive Jedi managed to overpower their Trandoshan captors. With the arrival of Wookiee reinforcements during its latter stages, the group successfully killed all but three of them, including their leader, Garnac."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 20 BBY, during the Clone Wars, a Jedi strike team—led by Jedi Master Plo Koon, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano—returned to the planet Felucia to repel another Separatist invasion. Led by General Grievous, the droid forces dispersed from an outpost."}, {"tag": "p", "text": "Along with their respective clone troops, Koon, Skywalker and Tano broke into three separate groups to oppose the droids. However, while Koon and Skywalker were able to get to their predetermined locations unscathed, Tano, behind the outpost's wall, was incapacitated by Lo-Taren, a Trandoshan hunter, who hid on the battlefield with his stun blaster. After transporting the Padawan to the Trandoshan moon Wasskah, where they hunt those captured for sport, Tano scurried through the moon's forests, evading the lethal hunters."}, {"tag": "p", "text": "By a tree, a small team of fugitives—Jedi younglings Kalifa, Jinx and O-Mer—caught Tano by surprise, urging her to join them. The group, while engaged, preferred to keep a low profile against the aggressive Trandoshans, with Kalifa, as its leader, asking Tano to do the same. Tano, however, ignored Kalifa's meekness, electing to seek out the pursing Lo-Taren, who quickly fired at Tano. After Force gripping him by the neck, Tano flung him to a tree, knocking him out. The Trandoshan quickly recovered, however, and stampeded toward Tano, but his attack was cut short by the timely arrival of Kalifa, who angrily Force choked him in midair, much to Tano's shock. Though Lo-Taren was able to go unscathed, he cried out to his fellow hunters, alerting the nearby Ratter and Sochek. Before they could arrive, Jinx and O-Mer were able to subdue Lo-Taren, subsequently fleeing the area with Tano and Kalifa. Over a campfire, Tano suggested a new offensive strategy against the Trandoshans in order to survive."}, {"tag": "p", "text": "As they set out to find the hidden Trandoshan compound the next day, the team stumbled upon their floating fortress, alerting the Trandoshans inside. As the Jedi fled from enemy fire atop trees, Kalifa lost her footing, plummeting to the ground. Overlooking her fall aboard his customized hover pod, the Trandoshan leader Garnac ordered his son, Dar, to kill Kalifa. Though she put up a fight, Kalfia was ultimately saved by Tano, who kicked the young Trandoshan off the cliff, sending him down to a sharp object below."}, {"tag": "p", "text": "Enraged by his son's death, Garnac fired his hover pod's blaster cannons at Kalfia, shooting her dead. Though he vowed to finish Tano off as well, the Padawan was able to evade the Trandoshan's repeated fire, and return to O-Mer and Jinx. Kalifa's loss, as well as the continuous near-death skirmishes they faced, propelled Tano to launch yet another offensive—this time by attacking the Trandoshan prisoner drop ship head-on. Though Jinx was skeptical, due to their previous losses, he allowed himself to follow Tano, seeing no alternative."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Attacking the slave ship"}, {"tag": "p", "text": "Returning to the drop site, Tano waited patiently as the Trandoshan prisoner drop ship—manned by Clutch and Goron—descended from the atmosphere, hovering above a beach. Though the drop ship remained in midair, Tano gave O-Mer and Jinx the green-light to jump atop the ship's hull, catching the pilots by surprise. Recognizing Tano, Clutch ordered Goron to pursue the evasive Padawan by climbing on the ship's hull with his blaster rifle. He was quick to find Tano, but O-Mer and Jinx, to her rescue, spooked the Trandoshan by emerging from their hiding spot, tackling him to the ground."}, {"tag": "p", "text": "As Tano entered ship's cabin to find Clutch, O-Mer and Jinx found themselves locked in a hand-to-hand exchange with the formidable Goron, who, toward the end of their fight, began to strangulate Jinx to death. Inside the cabin, Tano tried to attack Clutch by sneaking up on him, but the Trandoshan was well aware of Tano's presence, engaging her with his stun blaster. Tano leaped around to dodge his fire, subsequently pressing the heavy Trandoshan against the ship's controls, damaging them."}, {"tag": "p", "text": "The ship began to rotate sharply in place, as a result of Clutch's struggle against Tano, causing Goron and Jinx to dangle off the hull. Neither Clutch nor Tano let up, continuing on until the Padawan Force pushed Clutch, smashing his head through a window. With the ship's controls all but destroyed, the ship continued to rotate until it violently broke apart. Still dangling, Goron grabbed onto Jinx's leg as a last-ditch effort to kill the youngling, but O-Mer was there to pummel the Trandoshan off the hull with his boot."}, {"tag": "p", "text": "With the two Trandoshans defeated, Tano assumed the pilot's seat to attempt a landing in order to save the ship's captives. Jinx, however, fearing for Tano's safety, ordered the Padawan to jettison the prisoner capsule from the ship's underbelly, effectively saving all those onboard. On the ground, Tano, Jinx and O-Mer met with a Wookiee prisoner named Chewbacca after hearing his cries, fleeing the scene with him."}, {"tag": "p", "text": "The next day, Garnac, Ratter, and Sochek inspected the debris field, knowing the Jedi liberated their prized Wookiee, the ship's sole prisoner. With the Trandoshans on high alert, Tano brought her group back to their hide-out to learn more about Chewbecca's grievances toward the Trandoshans, who were a neighboring threat. He knew the only way to escape Garnac's hunting party was to contact his nearby homeworld by creating a transmitter, using parts from the drop ship's debris."}, {"tag": "h3", "text": "Contacting Kashyyyk"}, {"tag": "p", "text": "In order to maintain a low profile, Tano broke the group into two teams—she and Chewbecca would go to the crash site, while O-Mer and Jinx watched for any enemy activity. Unbeknownst to them, Trandoshans Krix and Smug were flying in their hover pod, seeking to establish a sniper position near the wreckage site. Tano saw them before O-Mer and Jinx could, quietly directing Chewbecca to the downed ship."}, {"tag": "p", "text": "As Chewbecca and Tano swept the ship, seeking parts for the transmitter, Smug, using his sniper's scope, caught a glimpse of the two through the ship's window. Realizing the danger, O-Mer and Jinx carefully climbed Smug's tree in time to save Tano from a sniper shot. They then attempted to disarm the Trandoshan and, in the ensuing struggle, fell off the tree. Smug was quick to recover, followed closely by O-Mer, who punished the Trandoshan with his fists. Jinx soon recovered and joined in, but his attempt was cut short after Smug threatened his life with a dagger. Before he could kill Jinx with it, Chewbacca overpowered the Trandoshan with his strength, subsequently taking him as prisoner."}, {"tag": "p", "text": "Back at their hide-out, Chewbecca's attempt to construct a transmitter failed, much to Jinx's dismay. Instead of reaching out to Kashyyyk, Jinx wanted to use Smug to their advantage—an idea that fractured the group. While Tano believed in Chewbecca, Jinx and O-Mer turned to Smug, wanting him to secure a hover pod so they can access Garnac's flying fortress. The next morning, the foursome returned to the crash site with Smug in tow. After Jinx used a mind trick on Smug to get him to cooperate, the Trandoshan called for a speeder. Oblivious to his capture and captors, Sochek came to Smug's rescue and was immediately pummeled to the ground by Chewbecca, allowing O-Mer to take over the hover pod."}, {"tag": "h3", "text": "Infiltrating the flying fortress"}, {"tag": "p", "text": "Meanwhile, in their abandoned hide-out, Chewbecca's transmitter successfully reached out to a group of Wookiees on Kashyyyk, including Chewbecca's ally, General Tarfful. Back at the flying fortress, Tano's group took on Lagon and Ratter by surprise, throwing Lagon overboard to his death. Ratter cried out for reinforcements in his native tongue, alerting Garnac, Lo-Taren, and Gilas high above on a platform. Though Garnac ordered his men to kill the foursome, they all encountered setbacks, thanks to Chewbecca's strength and Tano's leadership. The momentum changed to favor Garnac, however, once he shot down O-Mer's orbiting hover pod, causing it to crash land on the fortress. Though he survived, Garnac's men converged around the foursome, keeping their blasters trained on them."}, {"tag": "p", "text": "While all seemed lost for Tano's group, the arrival of Tarffull onboard the Halo—a SS-54 assault ship owned by the bounty hunter Sugi—ended any hope for the Trandoshans, who found themselves at the mercy of Tarfful's Wookiee mercenaries. Their strength, coupled with the Jedi, forced Garnac to retreat inside the fortress's command center. Seeing his retreat, Tano Force jumped to the higher platform to locate Garnac, who ambushed the Padawan with an axe. Though he lashed out at her repeatably, Tano used the Force to her advantage, pushing Garnac away."}, {"tag": "p", "text": "Outside, Tarfful, Chewbecca, O-Mer, and Jinx hid behind a fallen hover pod, exchanging fire with Lo-Taren and Gilas. To end the stalemate, Tarfful aimed his long gun at Lo-Taren, shooting him dead before turning to kill Gilas. Inside the command center, Garnac rebounded from Tano's Force attacks, using his physical strength to gain the upper hand over Tano's inadequate fistfighting. To finish her off, Garnac sought to kill her with his blaster rifle, but the Padawan quickly knocked the Trandoshan to the ground and claimed victory over him. Except the Trandoshan refused to admit defeat, claiming Tano murdered his son. As he went to pick up his grounded blaster, Tano's warning to him went unheard, forcing her to Force push him out of the command center and over the fortress's railing, killing him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ahsoka and the younglings returned to the Jedi Order after the battle. Garnac's hunting guild was essentially over. However, three of the Trandoshans had made it out: Ramy, who had survived his fall; and Krix and Smug, who eventually regained consciousness following the hijacking of their pod. The three came to relocate on Nal Hutta."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}