{"url": "Battle_on_the_Devastation", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Coruscant", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Battle on the Devastation"}, {"tag": "p", "text": "The battle on the Devastation was a battle between the Galactic Republic and the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Confederacy of Independent Systems and the Nightsisters were building the Subjugator-class heavy cruiser known as the Devastation, but this was not known by the Jedi before R2-D2 and C-3PO accidentally learned the information from a CIS computer. Yoda then sent the Jedi Ahsoka Tano, Plo Koon, Obi-Wan Kenobi, Kit Fisto, Anakin Skywalker, and Mace Windu to stop the ship from destroying Dathomir. However before the battle, Sai Sircu ultimately betrayed the Confederacy and switched the coordinates from Dathomir to Coruscant."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Ahsoka and Plo Koon were the first to land on the ship, and were instantly attacked by several droids. Once they entered a few doors, they entered a hallway with several cannons controlled by droids. They then traveled down to a lower location to see that the Hyperdrive has been activated, meaning the ship must have arrived at its first location. They quickly progress through a heavy door leading to a control room, but at that moment, Asajj Ventress shows up and challenges the Jedi to a duel, however, knowing that saving Coruscant was more important than killing Ventress, Ahsoka breaks the controls. Knowing her failure, Ventress flees from battle. Soon after, Obi-Wan and Kit Fisto make a landing on the ship. They are encountered by several droids as well, before entering another door. After a few doors, the two Jedi find a reactor in the ship. The two Jedi then overload it, being mindful of staying away from the Camera droids in the room. Once the reactor was overloaded, the Camera droids fled for cover along with the Jedi, and a huge hole was formed in the wall from the blast. Soon after Obi-Wan and Kit Fisto made their way to another control room, and engaged Count Dooku. However Obi-Wan cut down the backup controls while the Nautolan fought off the Sith lord. After the two prevailed, Sai Sircu entered the room and used the force to knock out Obi-Wan and Kit Fisto. Dooku then fled. Finally, Mace Windu and Anakin land and encounter droids like their other fellow Jedi. Soon after, the two Jedi encountered Sai Sircu, and killed her."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once all the Jedi were off the ship, the Republic used a few Jedi bombers and bombed the ship. On a nearby ship, Ros Lai, a former Nightsister watches the remains of the Devastation pass by the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}