{"url": "Battle_over_Kothlis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Kothlis"], "nodes": [{"tag": "h1", "text": "Battle over Kothlis"}, {"tag": "p", "text": "This battle was fought around 22 BBY over the Bothan colony world of Kothlis during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The Republic forces traveled to Kothlis to negotiate with the Bothans, but were confronted by a Confederate fleet upon arrival. After a brief battle, however, the Separatist forces retreated. Jedi Grand Master Yoda, Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, and Skywalker's Padawan, Ahsoka Tano then entered negotiations with the Bothans' first secretary Desark Fey'lya, who thanked the Jedi for their efforts in repelling the Separatist attack. Tano, however, sensed that the secretary had probably invited the Separatists himself and expressed her concerns to the rest of the Jedi. Fey'lya felt insulted by Tano's words and declared that the Bothans and their Spynet would be open to both sides of the conflict."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 22 BBY, Galactic Republic forces—consisting of several Venator-class Star Destroyers commanded by Admiral Wullf Yularen—traveled to the Bothan colony world of Kothlis, where Jedi Grand Master Yoda hoped to negotiate with the Bothans concerning their loyalty to the Republic. Upon arrival at Kothlis, however, the Republic found a Confederate fleet of Lucrehulk-class Droid Control Ships under the command of a Neimoidian in orbit."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Republic immediately attacked the Separatist ships with V-19 Torrent starfighters, BTL-B Y-wing starfighters, and two Delta-7B Aethersprite-class light interceptors piloted by High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker. Skywalker and Kenobi, as well as Skywalker's Padawan Ahsoka Tano—who flew one of the Y-wings, with Captain CT-7567 serving as her gunner—engaged Confederate Vulture Droid starfighters."}, {"tag": "p", "text": "At one point during the battle, Kenobi's starfighter came under attack from two Vulture droids. Being unable to shake them, Kenobi contacted Skywalker and requested assistance. The latter advised Kenobi to drop down toward the planet, thus exposing the droids to Skywalker's attack. After Skywalker had rescued Kenobi, the two returned to the main battle. Meanwhile, Tano singlehandedly attacked one of the Lucrehulk-class Droid Control Ships and, using proton torpedoes, managed to destroy it. Seeing that his forces no longer outnumbered those of the Republic, the Neimoidian commander panicked and ordered an immediate retreat of his taskforce. Admiral Yularen asked Yoda if he should pursue the fleeing Separatists, but Yoda told him not to do this. Instead, the Jedi Master ordered to proceed with the original mission: to negotiate with the Bothans."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Yoda, Kenobi, Skywalker, and Tano soon landed on Kothlis and met with the Bothans' first secretary Desark Fey'lya, who thanked the Jedi for saving Kothlis from the Separatists. Tano, however, sensed with the Force that the first secretary was lying. She expressed her thoughts to the rest of the Jedi, telling them that Fey'lya had probably invited the Separatists himself. The first secretary took Tano's words as an insult and left, stating that the Bothans would remain neutral and provide their spying services to both the Republic and the Separatists. Skywalker then told Tano that he, Kenobi, and Yoda had sensed Fey'lya's lie too, but did not tell about it. Skywalker also explained to his Padawan that sometimes being a diplomat meant to allow a lie in order to achieve the goal of the mission. Yoda then decided that Tano should learn diplomacy and sent her, along with Skywalker and Kenobi, to negotiate a treaty with the Denfrandi people on the planet Taloraan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle of Kothlis was featured in the graphic novel The Clone Wars: The Wind Raiders of Taloraan, written by John Ostrander and illustrated by the Fillbach Brothers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}