{"url": "Battle_over_Coruscant", "categories": ["Category:Legends articles", "Category:Battles of Coruscant", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Battle over Coruscant"}, {"tag": "p", "text": "The Battle over Coruscant was a three-way battle between the Galactic Empire, the Rebel Alliance, and Black Sun in orbit of the planet Coruscant. The battle would lead to the destabilization of Black Sun under Xizor's rule."}, {"tag": "h2", "text": "Infiltration of Xizor's palace"}, {"tag": "p", "text": "Princess Leia Organa had been sent into Xizor's Palace under the guise of the deceased bounty hunter Boushh. Xizor uncovered her plot and subsequently detained her. A small team consisting of Luke Skywalker, Lando Calrissian, Dash Rendar, Chewbacca, and Benedict Vidkun averted the palace's security by entering the palace through the Sewers of Coruscant. Vidkun, a worker hired to guide them through the sewers, suddenly turned on the group, but was killed by Dash. Meanwhile, Luke managed to find Leia, and Rendar planted pulse bombs on Xizor's sky elevator connecting his palace to the Falleen's Fist in orbit. Security managed to pin the group down during the escape. Lando retaliated by throwing a thermal detonator into the sewer shaft. With a thermal detonator thrown into the sewer shaft in Xizor's Palace and pulse bombs were set on the elevator, the building had to be evacuated in five minutes. Most of the population of the building escaped. The royal guards and Xizor fled to Falleen's Fist, Xizor's personal skyhook."}, {"tag": "h2", "text": "Battle in orbit"}, {"tag": "p", "text": "Dash Rendar, Leia Organa, Luke Skywalker, Chewbacca, and Lando Calrissian fled the building in the Millennium Falcon. Dash transferred to the Outrider, and Rogue Squadron came out of hyperspace due to a distress signal sent by Leebo. Three rebel pilots were killed, and Black Sun was gaining an advantage."}, {"tag": "p", "text": "Darth Vader, in the Executor, came around Coruscant with two Star Destroyers and deployed squadrons of TIE fighters and ordered his fleet to attack Xizor's personal navy. Xizor, outraged, asked what was going on, but instead, Darth Vader gave Xizor two minutes to surrender or be killed. Xizor defiantly ignored Vader's ultimatum and the skyhook was destroyed by the Executor's turbolasers, violently exploding and killing everyone on board."}, {"tag": "p", "text": "Dash Rendar appeared to be killed when the Outrider was hit by debris from the explosion, but this was a trick, and he survived the battle. He left the Alliance afterward."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Rogue Squadron moved onto Prefsbelt IV to deliver the Tydirium to the Alliance, and Luke and company went to Tatooine to rescue Han Solo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}