{"url": "Unidentified_Gran_(Nar_Shaddaa)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Gran", "Category:Unidentified criminals", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Gran  (Nar Shaddaa)"}, {"tag": "p", "text": "A Gran male was employed by Urdruua the Hutt, and worked for the Hutt up until three months after the First Battle of Geonosis, the first battle of the Clone Wars, which began during 22 BBY. The Gran worked with the Hutt at his palace on the moon of Nar Shaddaa, and was present when Urdruua posted a bounty on the ex-Jedi Aurra Sing. After escaping numerous bounty hunters, Sing detonated a bomb inside Urdruua's palace, killing the Hutt, Gran, and and many others inside."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Gran male was employed by the Hutt gangster Urdruua sometime around 22 BBY. During a prior event, the Jedi Aurra Sing and her Jedi Master An'ya Kuro ran afoul of Urdruua that left the Hutt with a grudge. Unable to let it go, he placed a bounty on Sing three months after the outbreak of an intergalactic conflict known as the Clone Wars on Geonosis, although the bounty actually called for the death of a Jedi, leaving Sing's name ambiguous."}, {"tag": "p", "text": "Aurra Sing had since become a Jedi killer after leaving the Jedi Order, and accepted the mission to kill a Jedi. Arriving at Urdruua's palace, located on the moon of Nar Shaddaa, she conversed briefly with the Gran and the Hutt before Urdruua attempted to kill her with poison gas, which began to fill the throne room from a set of large pipes. Urdruua sealed himself and the Gran behind a blast door as Sing escaped through one of the spacious pipes."}, {"tag": "p", "text": "Urdruua later admitted to the Gran that he did not expect the attempt to kill her, instead hoping that large number of other bounty hunters he had hired would. The pair took little notice of the holoprojector that Sing had left behind. Sing rampaged through the streets of Nar Shaddaa, killing or subduing each of the bounty hunters that had been hired to kill her."}, {"tag": "p", "text": "After stealing a speeder bike and escaping smart mines, Sing contacted Urdruua and the Gran, telling the Hutt that he should've let go of the past. She then activated a bomb within the holoprojector that destroyed the palace, killing Urdruua and the Gran in the process."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Urdruua was talkative, and during the debacle with Aurra Sing, would constantly explain his plans and thoughts to the Gran as the events progressed. The Gran, however, appeared entirely uninterested in what the Hutt had to say. The Gran had black eyes and brown colored skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gran was created for the short story Old Scores, which was one of four stories compiled into the eighth volume of the Star Wars: Clone Wars Adventures trade paperback series. Old Scores was written by Chris Avellone, and was illustrated by Matthew and Shawn Fillbach, and colored by Pamela Rambo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}