{"url": "Unidentified_Green_Company_trooper/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified clone troopers"], "nodes": [{"tag": "h1", "text": "Unidentified Green Company trooper"}, {"tag": "p", "text": "This clone trooper served in Green Company, a unit in the Grand Army of the Republic, during the Clone Wars. In 22 BBY, Separatist Council member Nute Gunray was captured on the planet Rodia, and the Venator-class Star Destroyer Tranquility was dispatched to the planet. Under the command of CC-1004, Green Company and the trooper were assigned to the Star Destroyer to oversee the transfer of Gunray. However, the Dark Acolyte Asajj Ventress attacked the Tranquility, under orders from Confederate leader Count Dooku to either kill or rescue Gunray. Several boarding ships penetrated the hull of the ship and released battle droids into its hangar. Green Company was sent to repel the intruders, and during the ensuing firefight, the clone trooper was injured. He remained in the hangar, where he spotted Ventress, who had jumped out from a boarding craft. The trooper tried to report her presence, but was unable to finish his report before being decapitated by the Dark Acolyte."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A clone of the Mandalorian bounty hunter Jango Fett born on the planet Kamino, this clone trooper served in Green Company, a unit in the Galactic Republic's Grand Army. In 22 BBY, during the Clone Wars, Separatist Council member Nute Gunray was captured on the planet Rodia. Under the command of Clone Commander CC-1004, Green Company, and the trooper, were assigned to oversee the transfer of Gunray. The Venator-class Star Destroyer Tranquility was sent to Rodia to escort the captured Gunray to Coruscant, the galactic capital. The leader of the Confederacy of Independent Systems, Count Dooku, sent the Dark Acolyte Asajj Ventress to the Tranquility to either kill or rescue Gunray, who possessed valuable Confederate secrets."}, {"tag": "p", "text": "Soon after departing Rodia, the Tranquility was attacked by several Confederate boarding ships. The ships penetrated the hull of the Star Destroyer, and several B2 super battle droids disembarked from the boarding ships. The captain of the Tranquility informed CC-1004 of the attack, who in turn ordered the clone trooper and Green Company to repel the enemy in the hangar bay of the Star Destroyer. Under the command of Green Leader, the trooper, together with his company, raced toward the hangar, where they assumed defensive posts. The company was, however, overwhelmed and forced to retreat toward the prison level. The clone trooper, who was lying in the hangar after being wounded during the firefight, spotted Ventress, who dropped out of one of the boarding ships. He tried to report the presence of the approaching Dark Acolyte to the other clone troopers via comlink, but was unable to finish his report before being beheaded and killed by Ventress."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "After being wounded during the firefight in the hangar of the Tranquility, the clone trooper spotted Asajj Ventress. He tried to report her presence to the other clone troopers, but failed to do so before being killed by the Dark Acolyte."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The clone trooper first appeared in \"Cloak of Darkness,\" an episode of the first season of The Clone Wars television series. In the episode, which aired on December 5, 2008, the clone was voiced by Dee Bradley Baker, who voiced all clone troopers in the show."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}