{"url": "Unidentified_Human_female_Jedi_Knight", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Jedi Knights of the Jedi Order", "Category:Unidentified females", "Category:Unidentified humans", "Category:Unidentified Jedi of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Unidentified Human female Jedi Knight"}, {"tag": "p", "text": "A Human female Jedi Knight served the Jedi Order during the time of the Great Galactic War. In 3653 BBY, a Sith Imperial force led by Sith Lord Darth Malgus launched an attack on the Jedi Temple on the capital planet Coruscant. During the combat, Malgus killed the female Jedi with Force lightning."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female Force-sensitive lived during the time of the Great Galactic War between the Sith Empire and the Galactic Republic. She was trained in the ways of the Jedi and, by 3653 BBY, had become a Jedi Knight. During the Alderaan peace conference of that year—when the Sith feigned a ceasefire to negotiate with the Republic—a secret Sith strike team led by Sith Lord Darth Malgus launched an assault on the Jedi Temple on the Republic capital planet Coruscant."}, {"tag": "p", "text": "The female Jedi Knight was in the Temple at the time, and she and the other Jedi there fought against the Sith in the Great Hall. During the combat, Malgus saw the female Jedi among the crowd and shot Force lightning at her. The lightning caught two Padawans on its path to the female before it reached her, and the force of the dark side power lifted her off the ground. The Jedi Knight screamed in pain as the lightning surged through her, causing her skin to briefly become transparent, and Malgus relished in her agony as she died."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A Force-sensitive, the Human female was trained as a Jedi and achieved the rank of Jedi Knight. However, during the attack on the Temple, she was unable to stop Malgus's Force lightning, and the dark side power killed her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Human female Jedi Knight appeared briefly in Paul S. Kemp's novel The Old Republic: Deceived. The novel, released March 22, 2011, is a tie-in to the Star Wars: The Old Republic video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}