{"url": "Unidentified_Human_journalist_(Onderon)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Journalists", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Human journalist  (Onderon)"}, {"tag": "p", "text": "This journalist was a male Human working for the Iziz Comm news outlet in Iziz on the planet Onderon. During the Onderon Civil War the man was detained by separatist soldiers accusing him of spying and spreading propaganda. A passer-by, Meetra Surik, intervened and persuaded the soldiers to free him given that they had no proof of criminal activity. The journalist thanked Surik and left Iziz."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Human, this journalist participated in the Mandalorian Wars, serving in the resistance on the planet Onderon. He worked for the Iziz Comm news outlet and during the Onderon Civil War he reported on separatist leader Vaklu withholding information about the Republic, accused of treachery by the separatists. While in the city of Iziz, the journalist was apprehended by a pair of separatist soldiers who accused him of being a spy and spreading propaganda."}, {"tag": "p", "text": "Before the soldiers could take the man away for an interrogation Meetra Surik, an exiled Jedi passing by, queried the journalist's captors about whether they had a warrant or any proof of their claims. Despite their insistence that they were acting accordingly, Surik convinced the soldiers that the man was innocent and they freed him. The journalist thanked Surik and escaped the city, fearing repercussions. Later, city news reports advised that authorities believed the man was indeed a Republic spy and that he was suspected of the destruction of the South Quarter Mining Refinery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This journalist first appears in the 2005 Star Wars: Knights of the Old Republic II: The Sith Lords video game as a background character the player encounters upon entering the Merchant Quarter area. If the player chooses to intervene in the incident they can use persuasion, both the character skill and Force varieties, to allow the journalist to go free and earn light side points. As a non-canon dark side alternative, the player can suggest that the soldiers pretend the journalist has made an escape attempt or, for a higher dark side bonus, vehemently recommend an \"accident\" befall the journalist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}