{"url": "Battle_over_Tibalt", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Battle over Tibalt"}, {"tag": "p", "text": "Following the search for the Kyber Saber, a battle between the Galactic Empire and the Alliance to Restore the Republic took place on the planet Tibalt. As a result, the planet was littered with wrecked starships. Using the Imperial database, the hunter droid M-OC deduced that the Freemakers would be heading there to salvage spare parts. M-OC ambushed the Freemakers there but was unable to capture them."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the search for the Kyber Saber, the Freemakers joined the Alliance to Restore the Republic. After a series of adventures, the Freemakers found work as mechanics aboard the MC80A Home One Type Heavy Star Cruiser Home One. Rowan Freemaker eventually managed to reunite with Commander Luke Skywalker, who was a Jedi in the Rebel Alliance. However, their reunion was interrupted when two Imperial Star Destroyers emerged from hyperspace and deployed TIE fighters."}, {"tag": "h2", "text": "The escape"}, {"tag": "p", "text": "In response, the Alliance Fleet deployed its starfighter forces including Commander Skywalker, Lieutenant Valeria and her Blue Squadron, and Red Two. Valerian planned to create a hole in the Imperial formation so that the Alliance Fleet could jump into hyperspace. Rowan attempted to help his siblings and Roger but found that they did not need his help. In space, Valerian and Red Two managed to lose their TIE pursuers by flying straight towards each other and then pulling up. The two rebel pilots survived but their TIE pursuers crashed into each other."}, {"tag": "p", "text": "However, the Alliance Fleet was unable to deploy its B-wing starfighters because they lacked sufficient targeting lasers. Roger managed to find a crate which enabled Kordi to load the fighters with ordnance. The B-wings then departed Home One's hangar and managed to clear path through the TIE fighters. This enabled the Alliance Fleet to flee into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite the escape, the rebel starfighters sustained considerable damage. Due to a shortage of spareparts, the Freemakers decided to depart on an mission to Tibalt to gather more wreckage. At the request of General Hera Syndulla, Rowan recruited the Mon Calamari starship builder Quarrie, who wanted to build a starship that would turn the tide of the Galactic Civil War. Their Tibalt mission brought them into conflict with the Imperial hunter droid M-OC, who had been sent by the Emperor to capture Rowan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Battle over Tibalt first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"Trouble on Tibalt\", which premiered on Disney XD on June 17, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}