{"url": "Unidentified_Hutt_crime_lord_(Great_Goblin)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Crime lords", "Category:Individuals of unspecified gender", "Category:Unidentified criminals", "Category:Unidentified Hutts"], "nodes": [{"tag": "h1", "text": "Unidentified Hutt crime lord  (Great Goblin)"}, {"tag": "p", "text": "A crime lord of the Hutt species purchased the gladiator known as the Great Goblin and attempted to transport him to the planet Nal Hutta. The gladiator died on route from the terror caused by being alone."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Hutt crime lord purchased the Anx gladiator known as the Great Goblin at some point prior to the Battle of Gravlex Med. After buying the gladiator, the Hutt had the Anx transported alone in a small freighter to the planet Nal Hutta. The gladiator died of terror two days into the journey due to the Anx's need for social contact with others, a need that was shared by his entire species. The Hutt and the gladiator were later mentioned in The University of Sanbra Guide to Intelligent Life, which was a book written by Sentientologist Tem Eliss."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The crime lord was a hermaphrodite, like all members of the Hutt species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hutt was first mentioned, but not named, in The University of Sanbra Guide to Intelligent Life: The Anx, an article written by Craig Robert Carey, Jason Fry and Daniel Wallace for the seventh issue of Wizards of the Coast's Star Wars Roleplaying Game magazine Star Wars Gamer in 2001. It is not stated what era the Hutt lived in, although the article, which is written from an in-universe perspective, must have been published in the New Republic era or later as it mentions the Battle of Gravlex Med. Additionally, the Great Goblin and the Hutt lived three centuries prior to when the article was written."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}