{"url": "Unidentified_Imperial_Advisor_(tall_hat)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Imperial Inner Circle members", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial Advisor  (tall hat)"}, {"tag": "p", "text": "A Human male Imperial Advisor was a member of the Ruling Council of the Galactic Empire during the Galactic Civil War. He was one of only a few hundred Advisors who were genuinely loyal to Galactic Emperor Palpatine, and, as a high-ranking bureaucrat, the Advisor wore lavish light blue robes and a tall, dark blue hat. In 4 ABY, the tall-hatted Advisor accompanied the Emperor to the Endor system and arrived aboard the second Death Star, an Imperial battlestation that was undergoing construction. Alongside five other members of the Ruling Council, the tall-hatted Advisor followed the Emperor as he disembarked his private shuttle and was greeted by a large gathering of Imperial officers and stormtroopers. However, the station was destroyed by the Rebel Alliance a few days later, and all six Advisors were killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male with pale skin and brown eyebrows served the Galactic Empire as an Imperial Advisor during the Galactic Civil War. Of the several thousand Advisors who ran Galactic Emperor Palpatine's bureaucracy, he was one of only a few hundred who demonstrated genuine loyalty to the Emperor and his New Order. Those individuals were consequently appointed to the Imperial Ruling Council, also known as the Emperor's Inner Circle. Based on the galactic capital world of Coruscant, the members of the Ruling Council were permitted private audience with the Emperor. Their duties were to manage the Empire and carry out the Emperor's will."}, {"tag": "p", "text": "Palpatine encouraged competition between his Advisors, tasking them with overseeing not only their home systems, but those of rival Advisors as well. He thus kept them loyal to him while discouraging internal cooperation and alliances between them. High-ranking advisors often wore lavish robes indicative of their status, and the Human male complemented his light blue attire with a piece of tall, dark blue headwear."}, {"tag": "p", "text": "To further promote suspicion between his Advisors, the Emperor doted on only a select few at any given time. In 4 ABY, the tall-hatted Advisor was one of six Inner Circle members who accompanied Palpatine to the second Death Star, a massive Imperial battlestation under construction in the Endor system. The group arrived aboard the station in the Emperor's private shuttle and, flanked by Palpatine's Royal Guard, disembarked into a hangar crowded with a welcoming assembly of Imperial officers and stormtroopers. The Emperor was greeted by his Sith apprentice, Darth Vader, and, as the two departed the hangar, the tall-hatted Advisor and his fellows silently followed in their wake. A short time later, the station was destroyed during an attack by the Rebel Alliance fleet, and all six Advisors—as well as both Vader and the Emperor—were killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tall-hatted Advisor was one of six who followed the Emperor onto the second Death Star in Richard Marquand's 1983 film, Star Wars: Episode VI Return of the Jedi. He was played by an uncredited Francis Batsoni. The tall-hatted Advisor's outfit was inspired by Catholic bishops, whom the film's assistant art director, Nilo Rodis-Jamero, looked to when designing the robes and elaborate headgear of all of the Advisors. In concept art of the arrival scene by artist Ralph McQuarrie, tall hats are worn by two different Imperial digitaries, neither of whom are dressed in blue."}, {"tag": "p", "text": "Prior to Return of the Jedi's release, the arrival scene was described in James Kahn's novelization of the film, in which Kahn refers to the group as \"the Emperor's courtiers.\" The character's death aboard the Death Star was not revealed until the 2013 2013 Topps Star Wars Galactic Files Series 2 card set."}, {"tag": "p", "text": "In 2003, a production photo of five of the six Advisors seen in Return of the Jedi was included in an article published on StarWars.com, accompanied by text that read \"Among the members of Palpatine's Inner Circle are: Sate Pestage, Janus Greejatus, Sim Aloo, Ars Dangor, and Kren Blista-Vanee.\" At that time, three of the Advisors in the photo had already been identified in the Expanded Universe as Greejatus, Aloo, and Blista-Vanee. Neither the tall-hatted Advisor nor the black-robed fifth Advisor had been named, but Sate Pestage had been visually depicted in Star Wars canon sporting headwear similar to that worn by the fifth Advisor. As such, the article led to some fan confusion and conflation of Dangor with the tall-hatted Advisor. However, an illustration of Dangor from 1997's Star Wars Trilogy Sourcebook, Special Edition does not resemble the tall-hatted Advisor nor any of the Advisors seen in the photo. Additionally, several sources have established Dangor as living past the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}