{"url": "Unidentified_Human_male_henchman", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Desilijic servants", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Human male henchman"}, {"tag": "p", "text": "A male Human with black hair, a beard, brown eyes, and fair skin served as a henchman to Hutt crime lord Jabba Desilijic Tiure.  He was present in the Hutt's palace on the planet Tatooine by 4 ABY, around the time period where several Alliance to Restore the Republic operatives arrived to bargain for the freedom of fellow Rebel Han Solo, who was held prisoner in the palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The bearded extra who would be established in-universe as a Rebel commando was originally set to appear onset for the Jabba's Palace scenes in the 1983 film Star Wars: Episode VI Return of the Jedi, although he was cut from the final film itself. The character was visible in the documentary Classic Creatures: Return of the Jedi which gave a behind the scenes look at the film. Subsequent reference photographs of the character in costume were mislabeled as \"Rebel commando,\" with 1999's Star Wars: The Action Figure Archive being the first Star Wars Legends source to depict him as such in-universe."}, {"tag": "p", "text": "In early 2013, the Star Wars author Pablo Hidalgo grew suspicious of the character's identification with a Rebel commando due to his long robes and resolutely non-standard helmet and boots, though initially noting the character's outfit being similar to the Rebel commandos' camouflage pattern. While watching Classic Creatures: Return of the Jedi on the Blu-ray edition of Star Wars: Episode VI, Hidalgo spotted the character on the set of Jabba's throne room. On March 5, 2013, Hidalgo posted an article on StarWars.com's official blog recounting how he rediscovered the character's original identity. In that weblog entry, Hidalgo also postulated that the character may still be seen in Return of the Jedi, lurking in the background in the shot where Bib Fortuna tries to stop Luke Skywalker from entering Jabba's throne room. Hidalgo subsequently had the \"Rebel commando\" label associated with photos of the extra pulled from the official image archives, and this article assumes the character's prior in-universe identification as a Rebel commando was an error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}