{"url": "Unidentified_Imperial_Juggernaut_pilot", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial Juggernaut pilot"}, {"tag": "p", "text": "A Human male Juggernaut pilot served in a remnant of the Galactic Empire on the planet Morak around 9 ABY. Driving the Imperial Combat Assault Transport Juggernaut Five with another Juggernaut pilot. As the transport entered tunnel T-12, the pilots were attacked by the infiltrator Cara Dune, who incapacitated both. The infiltrators Migs Mayfeld and Din Djarin then wore the Juggernaut pilot and his comrade's respective armor to infiltrate the remnant's rhydonium refinery."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the reign of the New Republic, the Juggernaut pilot served in a remnant of the Galactic Empire which operated at a rhydonium refinery on the jungle planet Morak. One day, around 9 ABY, he and another pilot drove one of the refinery's Imperial Combat Assault Transports, designated Juggernaut Five, transporting rhydonium to the refinery. As the transport approached tunnel T-12, the Juggernaut pilot reported the approach to the refinery over comms, and the control speaker replied that Juggernaut Five was clear to continue."}, {"tag": "p", "text": "As Juggernaut Five entered the tunnel, the infiltrators Din Djarin, Cara Dune and Migs Mayfeld jumped on top of the transport. Dune climbed through the cockpit hatch and landed behind the two pilots, the juggernaut pilot and his comrade turning round upon hearing her land. The pilot then raised his SE-14r light repeating blaster, attempting to make a statement, but Dune disarmed him and dealt blows to both pilots before knocking their heads on the dashboard, incapacitating the pair. With the pilots defeated, Mayfeld wore the juggernaut pilot's armor while Djarin wore his comrade's armor. Djarin and Mayfeld then infiltrated the refinery, before escaping with information from a terminal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male individual, the Juggernaut pilot raised his blaster upon noticing Cara Dune, but was ultimately bested by the infiltrator."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Juggernaut pilot wore grey armor and clothing, which Migs Mayfeld claimed to smell bad, adding that the pilot's gloves were wet. The pilot also wielded a SE-14r light repeating blaster and drove the Imperial Combat Assault Transport Juggernaut Five."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Juggernaut pilot first appeared in \"Chapter 15: The Believer\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Rick Famuyiwa and released on December 11, 2020. Credited as \"Pilot 1\" in the subtitles and named \"Juggernaut Pilot\" in the credits, he was played by Miguel A. Lopez."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}