{"url": "Unidentified_IG-86_sentinel_droid_(Cad_Bane)/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:IG-86 sentinel droids", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified IG-86 sentinel droid  (Cad Bane)"}, {"tag": "p", "text": "During the Clone Wars, this IG-86 sentinel droid worked as an assassin droid. Built by Holowan Mechanicals, it was recruited in Cad Bane's posse when the bounty hunter was hired to free Ziro Desilijic Tiure from a prison. To accomplish this, Bane planned to take a group of senators as a hostages, and exchange them for Ziro."}, {"tag": "p", "text": "The droid accompanied Bane, Shahan Alama, and two BX-series droid commandos when the posse headed to the Republic Executive Building on Coruscant to start the operation to free Ziro. At the entrance of the building, the team was challenged by a group of Senate Commandos, but with the help of Aurra Sing, they were able to eliminate them, thereafter entering the building. After eliminating all of the guards and taking control of the structure, the team captured a crowd of senators at the East Wing of the building. The plan was threatened, however, when Jedi Knight Anakin Skywalker was spotted inside the building."}, {"tag": "p", "text": "Bane sent Alama and the sentinel droid to capture the Jedi, but Skywalker was able to conceal his presence. The pair then started to search for the Jedi in the rooms of the building. During the search, Skywalker used a mind trick on Alama, convincing him that the pair had two more floors to check. When Alama and the droid split up to search the two remaining floors, Skywalker sneaked behind the droid and ambushed it. The droid fought back, but ultimately proved to be no match for the Jedi Knight. Skywalker smashed the droid against a nearby wall with a Force pushed, and dispatched it with its own damaged blaster rifle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Raid on the Senate"}, {"tag": "p", "text": "Like all IG-86 sentinel droids, this droid was created by Holowan Mechanicals to serve as an assassin droid. During the Clone Wars around 21 BBY, a bounty hunter named Cad Bane was hired by the Hutts to release Ziro Desilijic Tiure from the Republic Judiciary Central Detention Center on Coruscant. Bane gathered a team of mercenaries and battle droids to help him to free Ziro. The team contained Jedi hunter Aurra Sing, technician Robonino, bounty hunter Shahan Alama, two BX-series droid commandos, and three IG-86 sentinel droids: HELIOS-3D, HELIOS-3E, and this droid. Once the team was organized, they headed to the Coruscant to start the operation to free the Hutt."}, {"tag": "p", "text": "On Coruscant, Bane planned to force the Galactic Republic to free Ziro by taking a group of senators from the Galactic Senate as hostages, and exchange them for the Hutt. Before going to the Republic Executive Building with two airspeeders, the team split up. Bane, along with the sentinel droid, Alama, and the droid commandos, headed to the entrance of the building while the rest of the team waited on an adjacent tower. Before arriving at the airspace of the building with the droids and Alama, Bane ordered the droids to hide themselves on the speeder. At the entrance landing platform, the team was encountered by Senate Commandos, who demanded that Bane surrender, for the speeder had broken security protocols and arrived in the restricted area. Backed up by Sing's sniper fire, the droids revealed themselves, attacking the surprised commandos with Alama and Bane. After the guards were eliminated, the team regrouped at the entrance. Leaving HELIOS-3D to the speeder and the droid commandos to remove the guards' corpses, the sentinel droid followed the rest of the posse inside the building."}, {"tag": "p", "text": "Moving forward inside the structure, the two sentinel droids led the team to the power control room, allowing Robonino to sabotage the building power distribution network and control both Senate Building and Republic Executive Building security system. Outside the room, the droids spotted a Senate commando on guard, whom they quickly targeted with their laser scopes and eliminated with their blaster rifles. Entering the control room, the sentinel droids opened fire at the room's occupied personnel droids. When the sentinel droid shot a WED-15 Treadwell droid, an LEP servant droid tried to escape, but was gunned down. The team left Robonino to control the room, and moved on toward the East Wing of the Republic Executive Building. While in route, Bane eliminated most of the remaining guards with a thermal detonator, resulting in team procuring control of the entire building."}, {"tag": "h3", "text": "The hunt for Skywalker"}, {"tag": "p", "text": "The team finally arrived at the East Wing, where a crowd of senators had gathered to discuss a new bill. The sentinel droid emerged at Alama's side when the posse surrounded the senators and took them as a hostages. After informing Supreme Chancellor Palpatine about the situation, and ordering Palpatine to free Ziro the Hutt from the prison, Bane ordered the senators to hand over any communication devices. This was interrupted, however, as Bane spotted Jedi Knight Anakin Skywalker in the building, and unsuccessfully attempted to shoot him. When Skywalker fled from the East Wing, Bane ordered Alama and the sentinel droid to pursue him. The pair rushed after the Jedi, and soon leaped in front of Skywalker, opening fire on him. Prior to the confrontation, Skywalker had given his lightsaber to his wife Padmé Amidala as a gift, and was unable to face Alama and the droid in direct combat. He fled once more as the droid and the Weequay chased after him. In one of the halls of the building, Skywalker was able to hide himself in one of the rooms. Alama and the droid then started to search for him, checking the rooms one-by-one."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "When Skywalker made contact with Chancellor Palpatine via comlink, the pair heard him speaking, and walked toward the door of the room where Skywalker was hiding. In response, the Jedi Knight mind tricked Alama, convincing the bounty hunter, and subsequently the droid, that they had two more floors to check. Alama left with the droid, and the pair split to search both remaining floors. The droid went downstairs, while Alama went up."}, {"tag": "p", "text": "When the droid moved downwards, Skywalker sneaked behind it, and attacked the droid with his bare hands. The droid fought back, and when Skywalker managed to grab its blaster rifle, the droid bent it to its destruction. Skywalker, however, Force pushed the droid against a nearby wall. Before the droid could recover, the Jedi smashed it apart with the rifle. After defeating the droid, Skywalker left the hall, and soon Alama reemerged and entered it. The bounty hunter was surprised when he found the still sparkling remains of the droid; upon noticing that there were no lightsaber cuts in the droid, he deduced that the Jedi was unarmed. Alama then reported back to Bane, who asked about the droid. After learning the situation, Bane sent Sing to help Alama capture Skywalker, in which they were successful. The sentinel droid would be the only casualty of the posse during the raid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As this droid was a Holowan Mechanicals-manufactured IG-86 sentinel droid, part of the IG-series of combat droids, it bore a strong resemblance with another sentinel droid, HELIOS-3D. During the raid on the Senate, it communicated with Shahan Alama by using Binary. It was equipped with a blaster rifle, and possessed several built-in utilities on its head, such as a searchlight, which helped the droid to see in dark areas, and a reflex sight, which the droid used to target certain enemies. The droid's body was painted for a white and dark gray, and its chest was emblazoned with a red sunburst sigil, which was marked for all of the droids of the team."}, {"tag": "p", "text": "While in Cad Bane's posse, the droid followed the orders of Bane and Alama, and did not hesitate to attack Anakin Skywalker when ordered to do so. It even obeyed a mind tricked Alama's command to leave a room unverified, even though they both had heard voices from within it. During the search of Skywalker, the droid acted carefully, and moved vigilantly door to door. However, it was not watchful enough, and by the time it spotted Skywalker, the Jedi had already sneaked behind the droid and was able to engage it in combat."}, {"tag": "p", "text": "The droid was very strong, being able to hold his own against Skywalker in a fistfight and bend his own blaster rifle beyond repair. However, it could not respond to Jedi Force powers, and did not recover in time from the Force push, which led to its destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This droid first appeared in Star Wars: The Clone Wars television episode \"Hostage Crisis.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}