{"url": "Unidentified_Imperial_commander_(Kashyyyk)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Imperial Army officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial commander  (Kashyyyk)"}, {"tag": "p", "text": "A Human male commander was in service of the Galactic Empire in the years before the Battle of Yavin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Jedi Knight Kento Marek was located by Imperial spies on Kashyyyk, the Empire launched an assault on the planet. The commander was in charge of the Imperial troops and greeted the Dark Lord of the Sith Darth Vader when he arrived to kill Marek. Although Vader was not too pleased at the lack of progress that the Imperial invasion force was undergoing under his command and started choking him, Vader ultimately spared him as he only came to kill Marek. After Vader killed the Jedi in his home, he discovered his son, Galen. At that moment, the commander and several stormtroopers arrived and attacked the boy. Vader, however, had his own plans for Galen and protected him from blaster fire. Vader then killed the stormtroopers and the commander by reflecting the commander's and the stormtroopers' shots with his lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Commander in the PS2, Wii, and PSP versions of the Force Unleashed is a Stormtrooper Commander. He was strangled by Vader after landing on Kashyyyk. In those versions, unlike in the Xbox 360 and PS3 versions, the commander's fate was left ambiguous as the scene immediately cut to behind Vader when he released his grip."}, {"tag": "p", "text": "All Imperial officers in-game use this officer's character model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}