{"url": "Unidentified_Imperial_Security_Bureau_WED_Treadwell_repair_droid", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Imperial Security Bureau droids", "Category:WED-15 Treadwell droids"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial Security Bureau WED Treadwell repair droid"}, {"tag": "p", "text": "A WED Treadwell repair droid which worked on the Wheel space station was commandeered by the Imperial Security Bureau during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. The droid was used to spy on the offices and cargo bays of IsoTech, a tech salvage company based on the Wheel, after they received a message pod from the long lost Confederacy of Independent Systems Munificent-class Star Frigate Sa Nalaor. When the ISB learned of a group of spacers hired by IsoTech to track down the frigate they used the droid to try and place a tracking beacon on the groups starship. The droid had a number of arms including ones sporting tools such as fusioncutters, spot sprayers, foam sealants, torque wrenchs and power calibrator."}, {"tag": "p", "text": "The spacers however had guards around their ship who spotted the droid as it attempted to place the beacon. The droid attempted to discard the beacon but was captured, however upon inspection the spacers could find nothing unusual about it beside the beacon, as it appeared the same as every other Treadwell maintenance droid on the Wheel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The WED unit first appeared in 2013 in Beyond the Rim an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire. This article assumes that the droid is caught whilst attempting to place the beacon, although if players fail to spot it or place no guards then it will be successful in its mission. It is also possible that when spotted the droid escapes instead of being caught."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}