{"url": "Battlefield_Holographic_Control_Interface", "categories": ["Category:Legends articles", "Category:Data storage and processing", "Category:Holographic technology"], "nodes": [{"tag": "h1", "text": "Battlefield Holographic Control Interface"}, {"tag": "p", "text": "The Battlefield Holographic Control Interface, or BHCI, was an advanced Imperial prototype that allowed a commander to issue orders from a safe distance while still maintaining an interactive, fully holographic representation of the field of battle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The BHCI program was developed under the supervision of Grand General Malcor Brashin. In 0 BBY, Captain Beri Tulon, a renowned training officer, began looking to recruit an officer to test the system. Observing the performance of ground forces during the Battle of Kalaan, he found a talented young stormtrooper corporal, Brenn Tantor. Promoting Tantor to the rank of lieutenant immediately, Tulon had him report to the Star Destroyer Inquisitor, Brashin's command ship. Inquisitor had been fitted with the BHCI model that Tantor would use in his training. Tantor mastered the BHCI, attaining the rank of general and continuing to use the device throughout his career. Despite Tantor's success, there is little evidence to suggest that the Battlefield Holographic Control Interface, a pet project of the Grand General, expanded beyond Tantor. It certainly did not become widespread."}, {"tag": "p", "text": "In 3 ABY, Brashin introduced Tantor to a new use of the BHCI technology: the Tracked Mobile Base. The TR-MB was a tracked, armored vehicle containing a Battlefield Holographic Control Interface. It allowed a commander to maintain the torrent of data from the BHCI system while putting him on the ground in the immediacy of the battle. Tantor accomplished only one mission with the TR-MB before defecting to the Rebel Alliance. Taking the TR-MB with him, he brought BHCI technology to the Rebellion. The Rebels were able to reverse-engineer the technology, building a BHCI that Tantor could use to command troops from orbit, the manner which he preferred. The Rebels also created a portable BHCI that was installed in the Tyderium for Tantor's use during the Battle of Endor. However, the Battlefield Holographic Control Interface apparently did not catch on with the Rebellion, or its successor state, the New Republic. Tantor seems to have been the only general to have made use of it."}, {"tag": "h2", "text": "Appearances"}]}