{"url": "Unidentified_Imperial_cargo_ship_captain", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial Navy captains of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial cargo ship captain"}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, an Imperial captain commanded a cargo ship that docked at Horizon Base. After departing, the rebel astromech droid Chopper inadvertently stowed away and took over the ship with the help of an inventory droid, AP-5, who served under the captain and was treated with disrespect. The captain attempted to stop the droids from bringing the ship to the rebellion, but he failed to end their plot."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This Imperial captain commanded the class four container transport cargo transport 241 about three years before the Battle of Yavin. He was assisted by the inventory droid known as AP-5, a veteran of the Clone Wars who had served as an analyst droid during the Ryloth campaign. The Imperial captain regularly belittled AP-5, whom he believed was destined for the scrap heap. On one trip, he docked at Horizon Base to pick up a shipment of supplies. His visit to Horizon Base coincided with a heist staged by the Spectres, who had come to steal fuel for the Phoenix Cell."}, {"tag": "p", "text": "As the cargo ship was leaving Horizon Base, the rebel astromech droid C1-10P (\"Chopper\"), who had been left behind after being distracted by stealing an ambulatory strut, managed to stow aboard the transport while fleeing several stormtroopers. As Cargo transport 241 was preparing to depart into space, AP-5 told him that he was off by .0002. The captain angrily responded that AP-5 was a \"useless droid\" and ordered him to go and check the ship's cargo manifest. While AP-5 went to check the manifest, the captain stayed aboard the ship's bridge."}, {"tag": "p", "text": "Meanwhile, AP-5 encountered the stowaway Chopper. Following a pursuit, the two droids managed to befriend each other by their shared experiences of the Clone Wars. Chopper also managed to win AP-5 over by contrasting his respectful relationship with his owner Hera Syndulla to AP-5's unpleasant servitude under the Empire. While the two droids were still conversing, the captain contacted AP-5 via comlink and demanded that the analyst droid check the cargo manifest. The captain also warned AP-5 about the stowaway. Unhappy with AP-5's progress, the captain went to find the inventory droid."}, {"tag": "p", "text": "Upon seeing AP-5, the captain chastised him for his tardiness in checking the cargo manifest while asking him about the stowaway. The captain then noticed that AP-5's restraining bolt was missing and attempt to apply a new one. However, Chopper then reappeared and attacked the captain. The captain fought back and called for reinforcements through his comlink. Despite his bigger size, Chopper managed to defeat the captain by stunning him unconscious with his electro-shock prod. In the captain's absence, the two droids managed to hijack the cargo ship by driving the stormtroopers into the cargo compartment and detaching it in space."}, {"tag": "p", "text": "Chopper also changed course and decided to reunite with the rest of the rebel fleet, who were preparing to travel to the Yost system. The captain awoke while Chopper and AP-5 were conversing with Hera, who was a leader in the Phoenix Group. AP-5 had alerted the rebels that the Empire had set a trap in the Yost system. He was about to relay the coordinates for an alternative safe world when the Captain entered the bridge to confront the hijackers. Taken by surprise, AP-5 tried to bluff the captain by claiming that he had been taken hostage."}, {"tag": "p", "text": "However, the captain saw through his deception and proceeded to attack the two droids. While AP-5 manned the helm, Chooper fought with the captain and managed to knock out his gun. The captain used his bigger size to push the smaller astromech droid into a corner. He also used his blaster to shoot AP-5 twice, badly damaging the droid. An enraged Chopped then fought back and managed to push the captain to the floor, knocking him unconscious. Chopper then relayed the coordinates to Hera before attending to AP-5 and taking the ship to the alternative safe world, which was later revealed to be the planet Atollon. There, the Imperial captain was presumably taken into custody by rebel forces."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Imperial captain was a broad-chested Human male with thick eyebrows, green eyes, and a big moustache. He had dark brown hair and a receding hairline. The captain was a mean-spirited bully who frequently belittled and chastised his cargo ship's inventory droid AP-5. On one occasion, he told the droid that he was destined for the \"scrap heap.\" His harsh treatment of AP-5 convinced the droid to assist the rebel droid Chopper and aid the rebellion with information about Atollon. The Imperial captain was able to use his big build and size to intimidate smaller opponents like the astromech droid Chopper. However, he was unable to match the droid's wit and electro-shock prod."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial cargo captain appeared in \"The Forgotten Droid\", an episode in the second season of the animated television series Star Wars Rebels. He was voiced by James Adomian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}