{"url": "Unidentified_Imperial_commander_(Keeper%27s_World)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial commander  (Keeper's World)"}, {"tag": "p", "text": "An unidentified Imperial commander led a fleet of Imperial-class Star Destroyers and later a team of Stormtroopers during the Battle of The Keeper's World."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Imperial commander commanded a fleet of Imperial-class Star Destroyers in the Keeper's World system in 0 ABY. When a Imperial Navy trooper detected an unmarked starship refusing to identify itself, the commander rightly surmised that it was a Rebel craft and ordered its capture. He did not know the vessel was crewed by the heroes of the Rebellion, Princess Leia Organa, Luke Skywalker, C-3PO, and R2-D2. The Rebel ship escaped the Imperial tractor beams, but was so damaged that it crashed on the nearby Keeper's World. The commander took a squad of Stormtroopers and a single landing craft and gave pursuit."}, {"tag": "p", "text": "The commander discovered the Rebels had fled the wreckage of their ship, and pursued them. Because of the droids the Rebels' speed was hampered, and the commander and his Stormtroopers were able to corner them in the ruins of an ancient temple. When the commander gave them an opportunity to surrender the Rebels managed to activate a teleportal, teleporting them inside the caverns within. The commander soon discovered how to activate the teleportal himself, but was surprised to find the Rebels had new allies, the strange androids who could control the elements of Earth, Fire, Rain, and Wind. The elemental onslaught forced the commander and his Stormtroopers to take cover. By the time they emerged the Rebels and the androids had fled."}, {"tag": "p", "text": "Giving pursuit once again, the commander used heat detectors to track the Rebels. Having tracked them to a cavernous chamber, the commander and his Stormtroopers witnessed that chamber destroyed in an explosion as the planet became dangerously unstable. Assured that the Rebels could not have survived, the commander ordered a retreat from the collapsing caverns."}, {"tag": "p", "text": "What the commander could not know is that the planet was under the control of the ancient computer known as The Keeper. She had manufactured the planetary upheaval, and stopped the upheaval once the Imperials had withdrawn from the planet. She also protected the Rebels from destruction during the explosion and subsequent cataclysm. Not knowing this, and believing the Rebels dead and the planetary cataclysm natural, the commander returned to his fleet. His intention was to warn Imperial High Command that the planet was a deathtrap, and warn all Imperial units away from the planet in the future."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Imperial commander was in many ways a model of what an Imperial commander should be. He was decisive, barking clear orders to his subordinates, and was equally at home leading Stormtroopers on the ground as he was commanding Star Destroyers in space. He was dogged in his pursuit of Rebels, but not bloodthirsty. If possible he preferred to capture Rebels rather than kill them. However, he was not soft-hearted either, and would rather kill Rebels than allow them to escape. After multiple frustrations he became more willing to kill, and would order his Stormtroopers to shoot to kill if a pursuit dragged on for too long. He was punctual in his reports to Imperial High Command, and secure enough in his authority to send warnings and advisories to all Imperial units."}, {"tag": "p", "text": "If he had one flaw, it was his tendency to assume a likely outcome had actually occurred, as when he assumed the death of the Rebels he was chasing without ensuring their deaths, or simply reporting them as missing."}, {"tag": "p", "text": "He used \"fool\" as his preferred insult, using it both to describe Rebels, and also subordinates who failed to grasp the obvious, like when a groundquake made a cavern a danger to his men."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}