{"url": "Unidentified_Imperial_deck_officer_(Trask)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial Navy officers of the Galactic Empire", "Category:Members of Gideon's Imperial remnant", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial deck officer  (Trask)"}, {"tag": "p", "text": "A human male deck officer served in a Galactic Empire remnant led by Moff Gideon, holding the rank of lieutenant. He served on a Gozanti-class Assault Carrier, which was attacked above the moon Trask around 9 ABY by four Mandalorians. The deck officer was ordered to hold the attackers off at the cargo bay, but quickly had his stormtroopers seal off the Mandalorians in the cargo control area. He informed his captain, but was flushed out of the Gozanti when the attackers opened the cargo bay doors."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the New Republic's reign, the deck officer served as part of the remnant of the Galactic Empire led by Moff Gideon. Around 9 ABY, he served aboard a Gozanti-class Assault Carrier, holding the rank of lieutenant. During the Gozanti-class Assault Carrier's departure from the estuary moon Trask, the starship was boarded by four Mandalorians, Bo-Katan Kryze, Din Djarin, Koska Reeves and Axe Woves. A number of stormtroopers aboard soon began amassing at the cargo bay where the deck officer was present. The officer asked the bridge, over his comlink, what was happening. The security officer informed the deck officer that the Mandalorians were approaching his position, the cruiser's captain ordering him to hold the infiltrators off until the vessel entered hyperspace."}, {"tag": "p", "text": "The deck officer, drawing his SE-14r light repeating blaster, relayed his orders to his stormtroopers as they took aim at the Mandalorians' predicted entry point, a lift at the end of the corridor extending from the cargo bay. The lift door eventually opened, and the Mandalorians engaged the deck officer's troopers, initially killing several of them. After firing some shots at the Mandalorians, the deck officer took cover and ordered for the doors in the hallway to the cargo bay to be closed. When a stormtrooper asked which one, the officer replied \"all of them.\""}, {"tag": "p", "text": "The stormtrooper closed the door behind the Mandalorians, and the deck officer insisted that all the doors must be closed, the trooper carrying out the order. The infiltrators were subsequently trapped in the cargo control area next to the cargo bay, and the officer informed the captain of this. That was when the Mandalorians used the control area to open the cargo bay doors, flushing the deck officer and his stormtroopers out of the Gozanti-class Assault Carrier, plummeting towards Trask. The security officer reached out to the cargo bay, but only got a response from Kryze, who had taken the deck officer's comlink."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The deck officer was a human male with light skin, blue eyes and white hair. Having been ordered to buy time for the Gozanti-class Assault Carrier to jump into hyperspace, the officer confidently repeated the orders to his stormtroopers and stood in the open with his blaster raised. When his troopers engaged the Mandalorians, though, he quickly took cover behind a terminal in fear, insistently telling a stormtrooper to close all of the doors around their opponents. The deck officer was unaware of the abilities the Mandalorians possessed in the cargo control area until the enemies used it to flush the officer and his men out of the Gozanti-class Assault Carrier."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The deck officer wore the standard uniform of an Imperial naval officer, including an Imperial kepi and a code cylinder attached below his left shoulder. He wore a rank insignia plaque on his left breast with two red bars above two blue, which signified the rank of lieutenant. The deck officer carried an SE-14r light repeating blaster in a holster and used it to briefly fire upon the attacking Mandalorians. He also used a comlink to speak with the bridge of the Gozanti-class Assault Cruiser he served on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The deck officer appeared in \"Chapter 11: The Heiress\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Bryce Dallas Howard and released on November 13, 2020. Credited as \"Deck Officer,\" he was played by Kevin Dorff."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}