{"url": "Unidentified_Imperial_governor_(Dathomir)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with cut elements", "Category:Unidentified humans", "Category:Unidentified Imperial governors", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial governor  (Dathomir)"}, {"tag": "p", "text": "A Human male Imperial governor was in control of the planet Dathomir during the Galactic Civil War. The governor had arranged the capture and public display of Silri, a prominent member of the native Nightsisters to break the spirit of her people, which resulted in a planetwide rebellion and the subsequent imprisonment of many Nightsisters and individuals of various species."}, {"tag": "p", "text": "Eventually, Tyber Zann, the leader of the Zann Consortium crime syndicate, and his lieutenant Urai Fen arrived to Dathomir in search of a person who could open the Sith artifact in their possession. The pair engaged with the Imperial forces, destroying several prisons and freeing the convicts, including Silri, who then requested that they kill the Imperial governor. After the Consortium forces destroyed the governor's quarters, the Governor himself escaped the ruins and begged Silri to spare him, saying that he can send a better message through Ransom. But Silri refused to listen and slew him, saying that the message sent with his blood will be enough."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The governor appeared in the 2006 video game Star Wars: Empire at War: Forces of Corruption single-player story campaign during the mission set on Dathomir. The game does not identify him by name, and the generic Imperial Field Commander model is used to portray him in the cutscene featuring him."}, {"tag": "p", "text": "An alternative line can be found within the comment blocks of the game file STORY_UNDERWORLD_M06_LAND.XML."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}