{"url": "Unidentified_Imperial_commander_(Yavin_4)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial commander  (Yavin 4)"}, {"tag": "p", "text": "An Imperial commander was an Imperial High General."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Empire Day festivities of 1 ABY, he resided in Outpost GRF-7493 on Yavin 4. It was here that he met an Imperial, sent to meet him by an Imperial data officer. The commander had the Imperial speak to Lord Vader, so that he could complete the important mission."}, {"tag": "p", "text": "The Imperial handed Darth Vader some historical documents regarding the Jedi they had imprisoned. After speaking for a short time, Lord Vader had the Imperial report back to the Imperial commander, who awarded him with an Imperial banner. The Imperial commander had one final task for the soldier, which involved interrogating the Jedi they had imprisoned for information."}, {"tag": "p", "text": "Fortunately, the interrogation was successful, and so they gained the information they were looking for. Following Empire Day, the commander left the facility to pursue other matters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Imperial commander was enthusiastically loyal toward Lord Vader, and the Empire he served. He had aspirations to serve aboard Darth Vader's flagship, the Executor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An Imperial commander, who lacks an official name, was a non-player character (NPC) in the MMORPG Star Wars Galaxies. During the Empire Day live event from June 29, 2005 to July 11, 2005 he could be found at an outpost on Yavin 4. He was part of a quest titled, \"Happy Empire Day,\" which sent players on an important mission throughout the galaxy."}, {"tag": "h2", "text": "Appearances"}]}