{"url": "Battlemoon", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Death Stars", "Category:Galactic Empire moons", "Category:Quelli sector moons", "Category:Rocky moons"], "nodes": [{"tag": "h1", "text": "Battlemoon"}, {"tag": "p", "text": "The Battlemoon was an airless moon orbiting Varn, which was converted to house a superlaser dish."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The surface of the moon allows for docking space for four Lambda-class T-4a shuttles, and has various pylons dotted throughout. The surface itself is littered with craters. The base's entrance was located on a Cliffside, and had various security features. First, the main gate was locked and possessed a security sensor outside, and required ID cards of Stormtrooper Corps level to access. In addition, there was a retractable bridge, which can only be accessed via the Imperial officer on the other side, as otherwise the person entering cannot access the main complex. The complex had two levels. The first level featured a blast door as well as various equipment for the base, and two stairways to the bottom level. The second level, located below the first, had two rooms, each of which had critical vulnerabilities that, if both were to be set off by seismic charges, would result in the base blowing up. Two Imperial officers were in charge of the facility, one of whom was a private."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was converted by the Galactic Empire into a superlaser test site based on Death Star technology after the Battle of Hoth. Luke Skywalker secured passage aboard a shuttle from Varn to the Battlemoon, infiltrating the complex to put an end to the Empire's plans."}, {"tag": "p", "text": "The Eye of Palpatine and both Death Stars were also referred to as \"battlemoons\" due to their sheer size."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}