{"url": "Unidentified_Imperial_security_officer_(Nevarro)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Members of Gideon's Imperial remnant", "Category:Officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial security officer  (Nevarro)"}, {"tag": "p", "text": "A human male security officer served in a Moff Gideon's remnant of the Galactic Empire, operating at the command center at a base on the planet Nevarro. Around 9 ABY, he noticed that the security feed for the shuttle bay went down and attempted to contact the shuttle bay. However, the security officer was ambushed by a group of infiltrators and choked to death by the Marshal Cara Dune."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the reign of the New Republic, the security officer served as part of a remnant of the Galactic Empire which was led by the Imperial Moff Gideon. He operated at an Imperial base on the volcanic planet Nevarro, stationed at the command center. In 9 ABY, the security officer was at his post when the security feed from the base's shuttle bay had gone down. He tried to contact the shuttle bay to resolve the situation, unbeknownst to the fact the personnel there had been killed by a team of four infiltrators who were there to destroy the base."}, {"tag": "p", "text": "Having had no response from the shuttle bay, the security officer continued to talk over the comms. However, he was interrupted when the four infiltrators arrived at the command center. One of them, the Marshal Cara Dune, took the security officer in a choke hold, strangling the officer to death. As the Mandalorian Din Djarin then deactivated all of the feeds on the security officer's console, the Magistrate Greef Karga took the officer's code cylinder and his Mythrol comrade took the officer's SE-14r light repeating blaster. The infiltrators left the command center shortly after and were eventually able to destroy the base."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The security officer was a human male with light skin, black hair, and brown eyes. After failing to get a response from the shuttle bay, he continued to reach out to the area until he was ambushed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The security officer wore the standard black uniform of an Imperial officer, including an Imperial kepi and a code cylinder attached below his left shoulder. He carried an SE-14r light repeating blaster in a holster attached to his belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The security officer appeared in \"Chapter 12: The Siege\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Carl Weathers and released on November 20, 2020. Credited as \"Imperial Security Officer,\" he was played by Morgan Benoit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}