{"url": "Unidentified_Imperial_officer_(Lahsbane)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial officer  (Lahsbane)"}, {"tag": "p", "text": "This Imperial Officer was in charge of a small contingent of stormtroopers and a Delta-class shuttle during the Galactic Civil War in 3 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During this officer's early days in the Imperial Military, he performed a tour of duty on the planet Zeltros, which he enjoyed greatly. By 3 ABY, the officer had been placed in charge of a small Imperial task force that specialized in short missions to problem worlds to see whether a larger force was needed. He and his men were sent to the planet Lahsbane in pursuit of the Alliance operative, Yom Argo, who had escaped from the Imperials carrying several sensitive datatapes that detailed his mission and that of his partner, Tay Vanis. After arriving, the officer had one of his stormtroopers translate the local Lahsbee language to see if they could locate Argo. The Lahsbees led the officer and his men to Argo's wrecked ship. However, Argo was already dead, and nothing of value could be found. Although the officer wanted to leave the world to report back to headquarters, his ship's intake valves had been clogged with a fine pollen that was present in the air. The Imperials were forced to stay until they could finish fixing their ship."}, {"tag": "p", "text": "During the wait, the officer and some of his men began traipsing through the forest, where they came upon a Zeltron. Dani, who was secretly working for the Rebels, was able to distract the officer and his men away from the hiding place of her friends by dancing for them. Dani's ploy worked, and the officer was kept from discovering the other rebels. The Imperials were eventually able to remove the pollen from their ship, but before they could leave the world, the ship was stolen by the same Zeltron they had encountered earlier. Dani used the larger vessel to carry a large haul of treasure she had stolen from the Forbidden City, and left the officer and his men stranded on Lahsbane."}, {"tag": "h2", "text": "Appearances"}]}