{"url": "Unidentified_Imperial_security_officer", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Imperial Navy officers of the Galactic Empire", "Category:Members of Gideon's Imperial remnant", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Imperial security officer"}, {"tag": "p", "text": "A human male security officer served in a Galactic Empire remnant led by Moff Gideon, holding the rank of lieutenant. He served on an Imperial Gozanti-class Assault Carrier, which was attacked above the moon Trask in 9 ABY by four Mandalorians led by Bo-Katan Kryze. The security officer gave updates to the Gozanti cruiser's captain and was soon ordered to begin the starship's ascent from Trask."}, {"tag": "p", "text": "The security officer listened as the cruiser's deck officer was killed trying to contain the Mandalorians. He was then present for a discussion between the ship's captain and Moff Gideon. After Gideon ordered the Gozanti cruisers scuttling, the security officer was promptly shot and killed by the captain, who took the officer's seat and attempted to crash the cruiser, although he was stopped by the Mandalorians."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Intruders aboard"}, {"tag": "p", "text": "During the New Republic's reign, the security officer served in a remnant of the Galactic Empire led by Moff Gideon, having the rank of lieutenant. In 9 ABY, he piloted an Imperial Gozanti-class Assault Carrier, alongside a freighter pilot. The Gozanti assault carrier one day visited the estuary moon Trask when it was attacked by four Mandalorians during the cruiser's departure. While the intruders fought stormtroopers on the starship's outer walkways, the captain of the vessel made his way to the bridge. The security officer informed the captain of the attack shortly before a trooper fell onto the bridge viewport, prompting the captain to have the bridge sealed."}, {"tag": "p", "text": "The captain later questioned the number of attackers over the comms, to which a stormtrooper engaging in the fighting claimed at least ten. The security officer, though, read on his terminal that four lifeforms were present, and the trooper over the comms identified them as Mandalorians before being killed. After the officer reported that the intruders were heading towards the cargo bay, the captain had him and the freighter pilot begin the Gozanti-class Assault Carrier's ascent from Trask."}, {"tag": "h3", "text": "Sacrificed"}, {"tag": "p", "text": "As the cargo bay was prepared for defense, the deck officer there asked what was happening, to which the security officer filled him in that the  Mandalorians were heading towards the deck officer's position. The security officer listened as the deck officer and his stormtroopers were able to isolate the Mandalorians in the cargo control area, which the intruders used to flush out the latter officer and his troopers from the Gozanti assault carrier through the cargo bay doors. The security officer exchanged looks with the freighter pilot before attempting to get a response from the cargo bay over the comms. That was when Bo-Katan Kryze, the lead Mandalorian, responded, exchanging with the captain and promising to capture the assault carrier."}, {"tag": "p", "text": "The captain contacted Gideon, summarizing the Gozanti-class Assault Carrier's situation and requesting reinforcements while the security officer watched. Gideon, however, implicitly ordered the captain to scuttle the assault carrier, and the security officer and freighter pilot looked at each other in fear. After cutting communications with the moff, the captain drew his SE-14r light repeating blaster and shot and killed both of his officers, pushing the security officer's body onto the floor to take his seat. The captain then attempted to crash the Gozanti assault carrier into Trask, but was stopped by the Mandalorians, who took control of the bridge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The security officer was a human male with light skin, brown hair and green eyes. He frequently looked to the captain or the freighter pilot when witnessing or hearing the elimination of other personnel on board the Gozanti-class Assault Carrier. After the deck officer was apparently lost, the security officer pressed for a response from the cargo bay. Upon hearing Gideon's final orders to the captain, the officer breathed heavily and looked over to the freighter pilot a final time."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The security officer wore the standard black uniform of an Imperial officer, including an Imperial kepi and a code cylinder attached below his left shoulder. He wore a rank insignia plaque on his left breast with two red bars above two blue, which signified the rank of lieutenant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The security officer appeared in \"Chapter 11: The Heiress\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Bryce Dallas Howard and released on November 13, 2020. Credited as \"Security Officer,\" he was played by Philip Alexander."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}