{"url": "Battlestation", "categories": ["Category:Legends articles", "Category:Technology stubs", "Category:Articles needing additional sources", "Category:Space station classes"], "nodes": [{"tag": "h1", "text": "Battlestation"}, {"tag": "p", "text": "A battlestation, or battle station, was a term used for any space station armed for combat."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A battle station was often defined as a combat spacecraft that used its primary power generation facilities for combat purposes rather than propulsion. The station could be either orbital or self-propelled like a starship. Large capital ships were usually regarded as a type of battle station.\nAn alternative term for the largest battlestations was battle planetoid."}, {"tag": "p", "text": "Battle stations were designed for various purposes, including defensive and offensive combat. Defensive battle stations bulked up on shield generators, sensor systems, defensive fighters and evacuation transports. Offensive battlestations were fitted with offensive weapons-batteries, starfighter and bomber squadrons as well as anti-ship defenses such as point-defense cannons.\nThe battle station hangars were often large enough to handle smaller capital ships in addition to the fighters and transports. Combat stations were known to keep a larger-than-average amount of combat troops onboard, and were often utilitarian in design."}, {"tag": "p", "text": "Different types of battle stations were often separated by their mobility. Mobile battlestations, such as large capital ships, could traverse interstellar space and attack distant targets. Immobile stations were usually situated in orbit of a world and used for planetary defense or logistical support. Terrestrial stations were built on or around asteroids and planetary objects and usually required less volatile reactor cores than space-faring battle stations."}, {"tag": "p", "text": "The largest battle stations were often designed with city-like structures on their surfaces. These structures mimicked terrestrial cities in order to make life more comfortable for the crew. Restaurants, shops and apartment buildings could be utilized even on the most militaristic of stations.\nThe station commanders and high-ranking officers often had their own\nstylish dwellings and there was usually space for visiting diplomats."}, {"tag": "p", "text": "Travel onboard the enclosed battle station cities was often done with turbolifts, landspeeders or in the rare cases of massive cities, through shuttle taxis that flew from one hangar to another."}, {"tag": "h2", "text": "Known classes and usage"}, {"tag": "p", "text": "The earliest known battlestation was the Krath command station at the Empress Teta system, which had been used by the Krath in a skirmish between themselves and both the Jedi and Old Republic."}, {"tag": "p", "text": "Around the time of the Naboo Crisis, Sienar Fleet Systems toyed with the concept of a battlestation shaped like a planetoid, called the Expeditionary Battle Planetoid, although it was deemed impractical. Nonetheless, Wilhuff Tarkin expressed an interest for it and ultimately submitted the plans to then-newly elected Supreme Chancellor Palpatine. The FireStar-class orbital defense station was also utilized by the Galactic Republic up to and after it was reorganized into the Galactic Empire."}, {"tag": "p", "text": "During the Clone Wars, at least one known battlestation was known to have been in use, the Grade III battle station, which had been under the operation of the Confederacy of Independent Systems."}, {"tag": "p", "text": "The Galactic Civil War resulted in a substantial increase in battlestation usage. The Rebel Alliance had access to at least one type of battlestation, which could be modified into four succeeding stages. The Galactic Empire, likewise, also had access to various battle stations of varying roles, some such as the Cardan-class space stations, which included at least five different variants, as well as the Bavos-I and Bavos-II heavy-duty military space platforms, and the Golan space defense platform, which included the Golan I SpaceGun (also known as the armored defense platform), the Golan II Space Defense SpaceGun, and the Golan III Space Defense NovaGun. Some also were formed specifically to defend certain planets, such as the Derilyn Space Defense Platform"}, {"tag": "p", "text": "Probably the most infamous battlestations, however, were the Empire's Death Stars, which were the result of Sienar's earlier Expeditionary Battle Planetoid. They included the DS-1 Orbital Battle Station, also known as Death Star I, the Death Star II, the Death Star prototype used as a testbed for developing the first Death Star's superlaser, and the Tarkin (although the latter was more of a test bed for superlaser outputs from the then-in development Eclipse-class next generation Star Dreadnought, it was considered an extension of the Death Star concept). Although technically not a true Death Star due to it being a modified Worldcraft/Habitation sphere, the Death Star III was nonetheless used as a siege platform by then-renegade Imperial warlord Ennix Devian as part of a feint against the then-newly formed Alliance of Free Planets after the Battle of Endor. With the Dark Empire helmed by a resurrected Emperor Palpatine, they had various battlestations at their disposal, like the Galaxy Gun, which was capable of firing hyperspace-capable warheads with enough charge to detonate an entire planet, and to some extent the Eclipse-class, which, although technically belonging more to the Star Dreadnought line of ships than true battlestations, were large enough to qualify as such."}, {"tag": "p", "text": "Aside from the major players of the Galactic Civil War, various third party factions had access to battlestations during that time. One was the criminal syndicate Zann Consortium, which utilized Consortium space stations in battle with various groups. Another was the Shadow Academy, which, although primarily an educational center/base of operations for the Imperial splinter faction known as the Second Imperium, had onboard weapons systems and was used to attack the Jedi Academy at Yavin 4."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}