{"url": "Battlesphere/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems starship classes"], "nodes": [{"tag": "h1", "text": "Battlesphere"}, {"tag": "p", "text": "The battlesphere was a variant of the Trade Federation Lucrehulk-class Core Ship, used by the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Unlike the Lucrehulk-class Core Ship, the battlesphere employed multiple reactors and was fitted with more extensive hyperwave transceivers."}, {"tag": "p", "text": "Its hangar facilities had enough room for several fighter squadrons. There was also a storage room for additional battle droid parts. Outlying control stations and sensors spanned out from the central sphere. The hangar bay doors could be activated from a panel on one of these."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Confederacy of Independent Systems placed a battlesphere in the atmosphere on one of the moons of Ruusan. This Skytop Station served as an important listening post for the Separatists, enabling General Grievous to launch many successful campaigns by gaining knowledge about the Republic fleet positions through the station."}, {"tag": "p", "text": "Jedi General Anakin Skywalker, Ahsoka Tano and clone strike team infiltrated the station on a dual mission, to blow it up and to rescue R2-D2, who had been captured by the Trandoshan scavenger Gha Nachkt and brought on-board. All clones who participated in the mission, not counting the pilot, were killed by Grievous, except for Captain Rex and Denal"}, {"tag": "p", "text": "With the assistance of his newly purchased EG droid, EG-07, Grievous later began drilling to the core of Mustafar to uncover an ancient superweapon hidden under the planet and placed a battlesphere similar to Skytop Station above Mustafar. The Jedi thus began an investigation into the matter, sending Jedi Master Luminara Unduli and Commander Gree to steal Separatist recognition codes from an archive in Grievous's castle on Vassek's third moon, which they used to infiltrate the Separatist-controlled space station Juma 9, using the station's scanners to locate the superweapon on Mustafar. Meanwhile, Grievous had found the weapon and prepared to use the battlestation's superlasers to charge the weapon, so that it could fire and spread the deadly virus which would then destroy all life in the system. Having learned of Grievous's intentions, the Jedi dispatched Anakin Skywalker, Ahsoka Tano, Kit Fisto and Commander Cody to prevent the battlestation's lasers from charging the weapon. With Grievous' deception revealed, Count Dooku forgave the general as Grievous' plans had bought Kul Teska the time he had needed to complete his gravitic polarization beam."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}