{"url": "Unidentified_Jedi_Council_member_(narrator)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi High Council members", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Jedi Council member  (narrator)"}, {"tag": "p", "text": "An unidentified Jedi Master who was part of a Jedi Council narrated the events surrounding the Naboo Crisis. After the Supreme Chancellor sent Qui-Gon Jinn and his apprentice Obi-Wan Kenobi to settle the conflict, the Jedi Council decided to create a record of the ongoing events. The Jedi recording device captured images and sounds from the conflict, and the unidentified Jedi Master later added his own narration to tie all the data together. The Jedi Master concluded his story on a worried note, stating that the Sith, the eternal enemies of the Jedi, were \"lurking somewhere in the galaxy... waiting for a chance to strike.\" Around the same timen the council member also lent his voice to the recoded version of the Junior Jedi Training Manual."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The unidentified Jedi Council member was created as a narrating device for the book-and-record adaptation of Star Wars: Episode I The Phantom Menace, in which he was voiced by the American voice-over artist Peter Francis James. While the adaptation treats the narrator as a real, in-universe character, he was aware of events that he should not have known—such as a private conversation between Darth Sidious and his apprentice Darth Maul. The record implies that the narrator was in fact a member of the Jedi High Council. In this case, the unidentified Jedi Master must be one of the nine male councilors that sat in the High Council at the time of The Phantom Menace to the exclusion of Yoda and Mace Windu, who were voiced by their own actors in the record."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}