{"url": "Unidentified_Junk_Maven_2", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Unidentified females"], "nodes": [{"tag": "h1", "text": "Unidentified Junk Maven 2"}, {"tag": "p", "text": "A female individual was a member of the Junk Mavens who resided on the junk moon Quantxi during the High Republic Era. The Junk Maven and a comrade came across members of the Nihil marauder organization on Quantxi, including its leader, Marchion Ro. Though the Nihil intended to lure the Jedi Order into a trap, the Junk Maven's companion distracted the marauders, allowing her to escape for a communications tower. Though the young Nihil recruit Krix Kamerat pursued the Junk Maven, she managed to reach the tower, sending a distress signal that was picked up by the Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the time of the High Republic Era, the individual was a member of the Junk Mavens, a group that resided on Quantxi, the Junk Moon of the planet Ord Mantell. During that time, a group of marauders of the Nihil organization stationed themselves on Quantxi as part of a plan to lure the Jedi Order into a trap. The marauders, including the Nihil leader, Marchion Ro, intended to send a diversionary force into a skirmish against the Jedi. As the force launched, the Junk Maven and a companion approached Ro and several other Nihil, including Zagyar and the young recruit Krix Kamerat, on Quantxi."}, {"tag": "p", "text": "While her companion distracted the Nihil, claiming to not want any part in their galactic conflict, the Junk Maven escaped, making for a nearby communications tower. Ro sent Kamerat to pursue the Junk Maven, and the boy chased her with Ro's blaster, urging her to stop and threatening to fire. The Junk Maven avoided Kamerat's shot and evaded him, though Kamerat was able to catch up to her, tackling her to the ground."}, {"tag": "p", "text": "Kamerat restrained the Junk Maven's hands with cuffs, ordering her to remain where she was. As Kamerat recorded a message for Zeen Mrala, a friend who was in the care of the Jedi—another part of Ro's trap—the Junk Maven escaped once again. Kamerat chased after her once he noticed her disappearance, firing at her when she did not stop. The shot hit the Junk Maven's hands, but she continued to run, eventually making it inside the communications tower. The Junk Maven approached a console and pressed a button, sending a distress signal that was relayed to the Ord Mantell Republic Outpost. An enraged Kamerat entered behind the Junk Maven, aiming his weapon at her, but he was too late; the distress signal alerted the Jedi in the system, who set course for Quantxi and called for reinforcements."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female member of an avian species with clawed feet and a beak, the Junk Maven had long dark gray hair and skin of the same color. She was determined to reach the communications tower and send a distress signal, even after being pursued and shot by Kamerat. The Junk Maven made a variety of sounds while Kamerat was pursuing her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Junk Maven wore ragged brown clothing, including a hooded garment and pants. She also wore a pair of dark goggles and carried a pack on her back. While traversing the junk terrain of Quantxi, the Junk Maven utilized a long stick for walking."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Junk Maven appeared, albeit unnamed, in the comic The High Republic Adventures 4, written by Daniel José Older, illustrated by Harvey Tolibao, and published by IDW Publishing on May 5, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}