{"url": "Unidentified_Jedi_Knight_(Kalandis_Seven)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Jedi Knights of the Jedi Order", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Jedi Knight  (Kalandis Seven)"}, {"tag": "p", "text": "A male Jedi Knight served the Jedi Order during the Cold War and the Galactic War. In 3640 BBY, he was sent by Republic Supreme Chancellor Leontyne Saresh to recall Colonel Jace Malcom from the front lines of the planet Kalandis Seven and bring him to the Core Worlds. The Jedi Knight fought through half a dozen blockades to arrive at Kalandis Seven. After the Knight left the planet with his passenger, they conversed about why Malcom had been recalled and the possible future of the battle on Kalandis Seven."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male individual was part of the Jedi Order during the Cold War, and by the time of the Galactic War he had achieved the rank of Jedi Knight. In 3640 BBY, sometime after the Battle of Corellia, he was personally selected by Galactic Republic Supreme Chancellor Leontyne Saresh to recall Republic Special Forces Division Colonel Jace Malcom from the front lines of the planet Kalandis Seven and transport him to the Core Worlds. He was then given the starship Frontier Justice and had to fight through half a dozen blockades to arrive on schedule."}, {"tag": "p", "text": "After he collected Malcom, the Jedi Knight proceeded to bring the Colonel to Coruscant, the Republic capital planet. During the flight, the Colonel asked the Knight why he had been recalled, to which the Knight replied that he had no idea and ventured a guess that Malcom was being promoted. They discussed the situation on Kalandis Seven, of which Malcom was sure that the Republic forces would be unable to hold the planet, and the Jedi responded by saying that Malcom did not know what would happen."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Jedi Knight was gifted in mechanics, as evidenced when he repaired the engineering console of his ship. He was also patient and did not care about others' looks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Knight was first mentioned in The Essential Reader's Companion, written by Pablo Hidalgo and published on October 2, 2012. The Knight later appeared in author Alexander Freed's short story, The Last Battle of Colonel Jace Malcom, which was published in Star Wars Insider 137 and released on October 23, 2012.\nAlexander Freed thought of establishing the Knight as a character from Star Wars: The Old Republic, which was released on December 20, 2011, when he was creating the character, but in the end chose not to."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}