{"url": "Unidentified_Jedi_Knight_(documentarian)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Knights", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Jedi Knight  (documentarian)"}, {"tag": "p", "text": "This male individual served the Jedi Order and the Galactic Republic as a Jedi Knight during the final decades of the Republic Classic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This Force-sensitive individual was inducted into the Jedi Order at an early age and instructed in the ways of the Force at one of the Order's academies before passing his Trials of Knighthood and ascending to the rank of Jedi Knight. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, this Jedi took up the rank of General within the Grand Army of the Republic and fought throughout the war. During this time, this Jedi was in the process of assembling a documentary on the species represented within the Order. It is unknown how much of the documentary he accomplished by the time of the end of the war, but it is known that death prevented him from completing his work. During the fighting, the Republic's Supreme Chancellor betrayed the Order by issuing Contingency Order 66 to the clone troopers being led by the Jedi Generals in battle. This particular Jedi was one of many to die during the fall of the Order and the Republic."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "While his work was incomplete, it survived the fighting and the fires that destroyed much of the Jedi Temple during the rise of the Galactic Empire. Sequestered away in the Temple Archives, the document survived the Galactic Civil War and the destruction of the Temple during the Yuuzhan Vong War. By 43 ABY, the Temple had been rebuilt and the Archives restored under the guardianship of the reformed Jedi Order, with this Jedi's work still preserved amongst the Stacks. While not listed among searchable records, High Council member and Chief Healer Cilghal discovered the record during a scan of audio files that included the term electroencephaloscan. Investigating, she came across the audio of an interview with long-dead Master Plo Koon. In the interview he discussed a Baran Do technique in which they could distort the scan's readings, making them appear brain-dead. This was a vital clue that first sparked the unraveling of the mystery of the bizarre Force Psychosis seen in several Jedi Knights."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}