{"url": "Unidentified_Jedi_Master_(Holocron)", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Masters", "Category:Unidentified humans", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Jedi Master  (Holocron)"}, {"tag": "p", "text": "A male Human Jedi Master served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive male Human was trained in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master. Constructing a double-bladed lightsaber imbued with green crystals at its core, this Master was proficient in it use during lightsaber combat. During his years of service to the Order, the Republic and the Confederacy of Independent Systems went to war, drawing the Jedi Order into the conflict known as the Clone Wars. The Master was stationed at the Coruscant Jedi Temple in 19 BBY when Supreme Chancellor Palpatine of the Republic betrayed the Order by issuing Contingency Order 66 to the Grand Army of the Republic. Led by Sith Lord Darth Vader, the 501st Legion marched on the Jedi Temple and began to slaughter all of its occupants, Masters, Knights, and Initiates alike."}, {"tag": "p", "text": "As the forces of the 501st Legion stormed the Temple as part of Operation: Knightfall, this man came to possess a valuable holocron and attempted to escape the Temple with the artifact. While putting up a fight, this Master was slain by Darth Vader during the fighting and the holocron fell into the hands of the Dark Lord of the Sith, Darth Sidious."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Jedi Master is killed by the player in Star Wars: Battlefront II, but the means of his execution is not standardized. He can be killed either as Vader or a clone trooper at the whim of the player."}, {"tag": "p", "text": "The nature of the holocron is not disclosed in the game, but the way the 501st leader reacts to finding the Jedi make it appear quite important to the emerging Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}