{"url": "Unidentified_Keshiri_caretaker", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Keshiri", "Category:Slaves", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Keshiri caretaker"}, {"tag": "p", "text": "This elderly Keshiri man was a slave in the service of Candra Kitai at her mansion on Kesh, called Starfall. He served as Candra Kitai's caretaker until the Kitai family themselves were enslaved followed a failed assassination attempt on Grand Lord Lillia Venn, which the latter had engineered herself to bring about the downfall of the Kitai family. Under the orders of the Grand Lord and her minions, Flen and Sawj Luzo, the Keshiri caretaker supervised his fellow laborers as they carried out the Kitai family's belongings into a public bonfire. He also encountered Candra's daughter Orielle Kitai and informed her that the Grand Lord had already ordered the enslavement of her family. Orielle then left to seek refuge at her friend Jelph of Marisota's farm near the Marisota River."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving the Kitais"}, {"tag": "p", "text": "This elderly Keshiri caretaker grew up on the planet Kesh over a millennium following the arrival of the Lost Tribe of Sith, a group of stranded Human Sith from the Sith Empire. In 5000 BBY, the Lost Tribe had installed themselves as the new ruling elite on the continent of Keshtah Minor by claiming to be the Protectors, a group of gods in Keshiri religion who had fought against the malevolent Destructors during a Great Battle. By 3960 BBY, the Keshiri caretaker had reached old age. By then, the Keshiri on Keshtah had become a lowly serf class who served as peasants and laborers for the Human Tribe. As with all Keshiri living on Keshtah following the Tribe's arrival, the caretaker presumably believed that the Sith were a divine race who were superior to them."}, {"tag": "p", "text": "This Keshiri caretaker worked for Candra Kitai, a new High Lord, who had been appointed to that position following the ascension of Lillia Venn to the Grand Lordship in 3961 BBY. He lived and worked at the family's country estate of Starfall, which was two hours south of Kesh by uvak flight. He was also acquainted with Candra's daughter Orielle Kitai, who was a Sith Saber and had several of her own apprentices. Per tradition, this Keshiri caretaker was never allowed to dressed Orielle by her nickname \"Ori\" since the latter believed that she was superior to the Keshiri. During the Donellan's Day celebrations in 3960 BBY, the caretaker stayed at Starfall with his fellow laborers. They had expected their masters to be back for dinner following the rake-riding games at the Korsinata stadium in the Sith capital of Tahv."}, {"tag": "h3", "text": "New Masters"}, {"tag": "p", "text": "However, Candra and Orielle did not return from the rake-riding games. The mother and daughter had been framed by the Grand Lord for an assassination attempt which she herself had staged as a means of eliminating potential rivals. The Kitai family's uvak wrangler Campion Dey had been manipulated by agents of Grand Lord Venn into making an assassination attempt on the Grand Lord herself at the start of the games. However, he was captured and executed by the Luzo brothers Flen and Sawj Luzo, after outliving his usefulness to them. As a result of Dey's actions, his sponsors were directly implicated in the crime even though they had not ordered the assassination. As punishment, Lillia Venn ordered their enslavement and stripped them of all their titles, lands, and belongings. Venn and her allies also took the opportunity to move against Dernas and Pallima, the leaders of the Red and Gold Factions, who were alleged to have connived with Candra to assassinate the Grand Lord."}, {"tag": "p", "text": "Following the incident, Orielle, who had left after the assassination, returned to Starfall to inform her family's slaves that Lady Candra would not be returning that night, since she had unfinished business to deal with in Tahv. After two hours of traveling on her uvak Shyn, Candra arrived at her mansion only to witness her family's laborers carrying her family belongings to a large bonfire on the lawn. By that stage, the two Luzo brothers had already arrived at Starfall with orders from Lillia to destroy the belongings of the Kitai family and to expropriate their assets. The elderly caretaker was charged with supervising the destruction of the Kitai family's belongings. Meanwhile, the Luzo brothers and their Sith apprentices entered the mansion and began confiscating Candra's belongings for destruction."}, {"tag": "p", "text": "When Orielle arrived and witnessed the bonfire, she left her uvak Shyn by the columns lining the front walk. Shocked by what she witnessed, she ignited her Sith lightsaber and confronted the elderly Keshiri caretaker. He then informed his former master that the Grand Lord had ordered the destruction of her family's belongings two hours ago. He then gestured to the main entrance where two of the Luzo brothers' Sith apprentices were standing guard and supervising the laborers, who were carrying furniture to the bonfire. Orielle initially wanted to go and confront the intruders but the elderly caretaker pulled her behind the bonfire, away from their view. He then warned her that there were more Sith inside the mansion confiscating her mother's things as well."}, {"tag": "p", "text": "Orielle then asked the caretaker whether Candra was still a High Lord but he did not know. By that stage, rumors had spread that Candra had made a direct pact with either the Red and Gold factions. There were also unconfirmed rumors that Lillia had died in her box, succumbing to her exertions during the assassination attempt. In addition, it was rumored that Dernas and Pallima had been executed in full public view within their viewing boxes. The only fact that could be verified was that the Kitai family had brought the assassin into the stadium. While rumors of Lillia's death were proven false, it was later confirmed that Dernas and Pallima had indeed been executed by the Luzo brothers. Unknown to most people, Lillia had framed the Kitai family for the attempted assassination attempt."}, {"tag": "p", "text": "Orielle decided to return to Tahv and speak with her apprentices, who were well connected enough to have access to the High Seat. She believed that the Grand Lord's faction had burnt her family's belonging to provoke a reaction and reveal disloyalty. She also hoped that her mother Candra had somehow successfully deflected blame and figured out who the culprits were. After telling the Keshiri caretaker of her plans, she turned towards her uvak. The caretaker then bid his former master farewell but addressed her by her nickname \"Ori\". When she demanded to know why he had done so, the Keshiri merely looked down and wandered away. At that moment, Orielle realized that her family had been reduced to the status of slaves; the worse case scenario that a Sith living on Kesh would ever dread. As a result, Candra changed her plans and returned to her friend Jelph of Marisota, a Human slave would lived alongside the Marisota River."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Keshiri caretaker never met Orielle again. During her time with Jelph, she discovered that he was actually a Jedi Shadow who had become stranded on Kesh. She also discovered his hidden Aurek-class tactical strikefighter, which she regarded as a \"Kesh-shaking\" discovery that had the potential of restoring her family fortunes. She returned to Tahv and informed her mother of this discovery. Her mother Candra told Orielle to contact the architect Gadin Badolfa, who had contacts with the other Red and Gold faction High Lords. However, Candra informed the Grand Lord of this planned meeting. Meanwhile, Orielle and Jelph reconciled and the two returned to the farm in an attempt to prevent the Sith from discovering this secret."}, {"tag": "p", "text": "However, Lillia Venn and her supporters arrived there first and captured Orielle. Jelph managed to ambush Venn's followers and rescue Orielle. They escaped into river while Lillia and her followers were killed when she accidentally activated the starship's anti-theft system: proton torpedoes buried beneath thousands of kilograms of ammonium nitrate. Lillia's death during the so-called Night of the Upside-Down Meteor triggered a millennium of chaos known as the Time of the Rot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Little is known about this Keshiri caretaker's personality and traits. However, it can be assumed that he was senior and experienced enough as a laborer to be appointed as the caretaker of the Kitai family's Starfall estate. As with many of his fellow Keshiri compatriots, he lived only to obey and serve the commandments of the Lost Tribe of Sith. Following the enslavement of the Kitai family, he complied with Grand Lord Lillia Venn's orders to destroy the family's belongings in a public bonfire without showing any hesitation or dissent. Still, he cared enough for his former master Orielle to protect her from the Luzo brothers, who had come to expropriate the Kitai family's assets. Due to his status as a slave, this Keshiri caretaker was ambivalent to the plight of the Kitais, who had been enslaved for allegedly staging an assassination attempt against the ruling Grand Lord."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}