{"url": "Unidentified_Kessel_spice_mine", "categories": ["Category:Legends articles", "Category:Kessel locations", "Category:Mining areas"], "nodes": [{"tag": "h1", "text": "Unidentified Kessel spice mine"}, {"tag": "p", "text": "A spice mine on Kessel was abandoned by the time of the Galactic Empire. It was the location of the Conclave on Kessel, a gathering of Jedi and an ill-fated attempt to lure the Sith into the open."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The former mine had been exhausted, so it was accordingly abandoned, along with much of the equipment. According to Shadday Potkin, not even the spice spiders gathered there any more, though she did caution that it wouldn't be wise to linger long."}, {"tag": "p", "text": "It was a large, vaguely rectangular cavern with self illuminated panels affixed to the walls. It had one large mining crane and numerous repulsorlift mining carts, still full of rock and ore. It apparently also had an oxygen processor or filter of some sort, as the cavern still contained breathable air."}, {"tag": "p", "text": "Much of the derelict equipment appeared relatively intact."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the execution of Order 66, the mine was used as the location for a gathering of Jedi. In attendance were Shadday Potkin, Bultar Swan, Tsui Choi, Roblio Darté, Sia-Lan Wezz, Ma'kis'shaalas, Koffi Arana, and Jastus Farr."}, {"tag": "p", "text": "However, in reality, one of the Jedi present; Shadday Potkin; attempted to turn the Jedi gathering into a trap for the Sith. She leaked false information that Obi-Wan Kenobi would be present at the gathering, attracting the attention of Darth Vader."}, {"tag": "p", "text": "Just as Potkin predicted, Vader arrived, unheeding and alone."}, {"tag": "p", "text": "In the subsequent battle, Vader managed to kill three of the Jedi, both with his lightsaber and with a cortosis blade he procured from the slain Potkin. Bultar Swan had been killed by one of her fellows to procure her lightsaber. The remaining three Jedi; Tsui Choi, Roblio Darté and Jastus Farr; attacked Vader telekinetically, hurling the contents of the derelict mining carts at Vader, leaving him horribly injured and partially buried."}, {"tag": "p", "text": "The remaining Jedi were slain by the sudden appearance of stormtroopers from Vader's 501st Legion."}, {"tag": "h2", "text": "Appearances"}]}