{"url": "Unidentified_Krozurbian_merchant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified gender", "Category:Krozurbians", "Category:Merchants", "Category:Unidentified individuals"], "nodes": [{"tag": "h1", "text": "Unidentified Krozurbian merchant"}, {"tag": "p", "text": "A Krozurbian merchant purchased a herd of savorium-fed thookahs from Ithorian scientist Zorneth and subsequently supplied them to the Krozurbian War Council, which ended the Krozurbian war."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The merchant was present at market when he met with the Ithorian scientist Zorneth and his protocol droid C-3PO. The merchant negotiated with Zorneth through C-3PO to purchace Zorneth's herd of thookahs, noting that although their coats looked good, they were scrawny. Zorneth, a vegetarian, countered that his thookahs were for shearing and not consumption. Before their negotiations could continue, \"Smiley,\" an individual under Zorneth's care who had been rendered permanently euphoric and pacifistic by the effects of savorium herb, was nearly kidnapped by Targonnian agents. Once \"Smiley\" was rescued, Zorneth decided to sell his thookah herd at a loss and depart immediately."}, {"tag": "p", "text": "Unbeknownst to the merchant, these thookahs had been fed with savorium, and their meat possessed the same euphoric effect as the herb itself. These thookahs were butchered and made into steaks that were fed to the Krozurbian War Council, who brought an end to two centuries of war as a result."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The merchant, like all Krozurbians, was a green-skinned being, and unlike several fellow Krozurbians on the War Council, the merchant had red eyes. The merchant was an aggressive negotiator, promptly finding fault with Zorneth's thookahs and ultimately forcing the scientist to sell the herd at a loss in order for him to close the deal."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The merchant wore a blue uniform with gold piping on the shoulders and collar, and a triangular emblem on the left breast; wrists and feet were protected by cloth wrappings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Krozurbian merchant was created by Jan Strnad for his comic book Droids (1995) 5, published by Dark Horse Comics in 1995. The being was illustrated by Bill Hughes. Other members of the merchant's species were depicted in a flashback panel in issue 4, where their name, \"Krozurbians,\" as well as the outcome of the merchant's purchase from Zorneth was established."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}