{"url": "Unidentified_Nautolan_Sith_(Vendaxa)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Nautolans", "Category:Sith of Darth Krayt's Galactic Empire", "Category:Unidentified Sith of the One Sith"], "nodes": [{"tag": "h1", "text": "Unidentified Nautolan Sith  (Vendaxa)"}, {"tag": "p", "text": "This Sith, a Nautolan male, was a member of Dark Lord of the Sith Darth Krayt's One Sith Order. He joined Krayt's Hands, Darth Talon and Darth Nihl, at a skirmish on the planet Vendaxa in 137 ABY where the crew of the starship Mynock was delivering the Fel Empire princess, Marasiah Fel, to a party of Imperial Knights. This Sith engaged Knight Ganner Krieg after one of his comrades severely wounded Fel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This Nautolan Sith joined Dark Lord of the Sith Darth Krayt's One Sith Order and completed his Sith training, earning full-body Sith tattoos, some time during or before the Second Imperial Civil War broke out between Krayt's Galactic Empire and the former Fel Empire, now the Empire-in-exile. Seven years into the war, one of Krayt's two Hands, Darth Talon, was assigned the task of capturing the Empire-in-exile's princess, Marasiah Fel, with the hope that either she would flee and return to her father, the leader of the remnant, or he would try to rescue her."}, {"tag": "p", "text": "When Talon failed to capture her, Fel fell into the hands of former-Padawan Cade Skywalker, who escorted her, off the planet in his starship, the Mynock. Talon followed them with a Sith force that included the Nautolan, to the planet Vendaxa, where Fel's group had arranged to meet Jedi Knight Shado Vao and his Jedi Master, Wolf Sazen, so they could take her to safety. Darth Talon destroyed the Jedi duo's transport and engaged the group before being |propelled into the Vendaxan jungle by Skywalker. There, she organized the Sith into groups that would follow her and attack the group and those who would go with her fellow Hand, Darth Nihl to shoot down any inbound vessels in Predator-class fighters. The Nautolan was part of the former."}, {"tag": "p", "text": "When two such ships arrived, they were quickly destroyed over the clearing where the Mynock had landed and Talon's group moved in, but Talon was wrong. Roan Fel was on neither ship, but the two Imperial Knights who were, Ganner Krieg and Antares Draco, survived the crash and fought with the Mynock crew against the Sith. During the battle, one of the Nautolan's allies injured Marasiah, enraging Krieg who then fought the Nautolan and a cadre of Sith alone while Draco took the princess to safety aboard the Mynock. With some engine difficulty, they were able to take off and escape."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The male Nautolan Sith was a fully-trained member of the One Sith Order led by Darth Krayt, signified by the red and black tattooing all over his body. He wielded a red lightsaber when he engaged Ganner Kreig on Vendaxa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Nautolan Sith appeared in the seventh issue of the comic book series Star Wars: Legacy, the final part of the opening arc. While he was shown fighting Krieg in one panel, he never appears again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}