{"url": "Unidentified_Morseerian_pirates", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Morseerians", "Category:Unidentified pirates"], "nodes": [{"tag": "h1", "text": "Unidentified Morseerian pirates"}, {"tag": "p", "text": "Two Morseerian pirates had established a base in Mos Espa on the planet of Tatooine by 32 BBY. They frequented the shop owned by the Toydarian junk dealer Watto, where they shopped for spare parts. By 32 BBY, the pirates had stashed a large amount of hard currency in their base."}, {"tag": "p", "text": "In 32 BBY, the pirates were in their base when they heard a noise from the room where they kept their booty. When they checked into it, though, they saw nothing and assumed it must have been a womp rat; the sand sewer of Mos Espa ran under the building, after all. Moments later, however, they heard someone rifling through their treasure chest. Upon investigation, they saw a young Human boy. He was Anakin Skywalker, and he was in the midst of leading a group of slave children through the sand tunnels to a smuggling vessel ready to take them away to freedom, but to the Morseerians, he was simply a thief. Nevertheless, when the boy threatened the pirates with a beamdrill, they backed away lest its flame ignite the supplies of methane both of them wore as part of their environment suit. The boy darted back into the sewer, and the Morseerian pirates' large heads would not permit them to follow him through the narrow grate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The book Episode I Adventures 8: Trouble on Tatooine offers readers the opportunity to play through part of the story as a roleplaying game in the companion volume, Episode I Adventures Game Book 8: Trouble on Tatooine. Should readers opt for this, they may choose from several characters to portray, including Anakin Skywalker, Arawynne, Dorn, Kitster Chanchani Banai, or Pala Kwi'teksa. The story follows the same general path, although success or failure at various dice rolls alters the specifics of how the escape through the sewers and the encounter with the Morseerian pirates take place. Because this game scenario is optional, this article assumes that the novel version of the events is canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}