{"url": "Unidentified_N-1_starfighter_pilot", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Naboo Royal Space Fighter Corp", "Category:Unidentified females", "Category:Unidentified military personnel", "Category:Unidentified rebels and resistance fighters"], "nodes": [{"tag": "h1", "text": "Unidentified N-1 starfighter pilot"}, {"tag": "p", "text": "A female N-1 starfighter pilot flew as Bravo Eight with the Royal Naboo Security Forces' Bravo Flight during the Invasion of Naboo in 32 BBY. She was at a resistance base in the Naboo training canyon when fellow Bravo Flight pilot Rhys Dallows agreed to transport captured Trade Federation munitions to the resistance base. She was supposed to escort him to the base, but when Dallows arrived, the escorts were not there. Dallows then led Reti into the canyon, where they found Bravo Twelve and Bravo Eight in a dogfight with Scarab starfighters. Dallows destroyed the AMTs while the escorts finished off the Scarabs. Together, they continued down the canyon to the base and to the base, which was under attack from a large force of Multi-Troop Transports and Armored Assault Tanks."}, {"tag": "p", "text": "Soon after, the three Naboo Resistance pilots conducted a raid on the Solleu River to free Naboo prisoners from the Trade Federation. Bravo Eight engaged the Federation forces while the Rescue boats proceeded to the rendezvous point with the freighter Mercatan."}, {"tag": "p", "text": "Bravo Eight also participated in the final battle of the invasion. She attacked droid starfighters while fellow Bravo pilot Rhys Dallows destroyed the Vuutun Palaa's Receiver Stations, temporarily cutting off the control signal to the Federation fighters. When the Stations were destroyed, she engaged a mercenary until the mercenary and Dallows became trapped inside the ship. The Droid Control Ship managed to reroute the signals, and Bravo Eight continued the attack against the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grey DeLisle provided the voice of Bravo Eight in the 2001 video game Star Wars: Starfighter. Bravo Eight was also mentioned in the game's strategy guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}