{"url": "Baxton", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Males", "Category:Personnel of the Imperial Remnant"], "nodes": [{"tag": "h1", "text": "Baxton"}, {"tag": "p", "text": "Baxton was the Human male driver of Imperial Head of State Jagged Fel's limousine. In 43 ABY, he traveled with Fel to Coruscant for the Unification Summit among the three prevalent galactic governments. Later, Baxton was present during Fel's capture of psychotic Jedi Knights Yaqeel Saav'etu and Bazel Warv, after which he was confronted by Galactic Alliance Security troopers under the command of Captain Atar. Fel, however, used his diplomatic immunity to convince Atar to let Baxton go, and they left the scene in his limousine with Jedi Knight Jaina Solo. Atar, frustrated, ordered an assault speeder to block their exit. Fel told Baxton to ask the speeder's commander to let them pass, but the officer refused to move his speeder. Baxton got into a heated argument with the officer, but Fel, again using his diplomatic immunity, was able to force Atar to order the Security troops to move, and Baxton drove them away."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Baxton was a big-shouldered Human male who served under Head of State Jagged Fel in the Imperial Remnant. In 43 ABY, he traveled with Fel to the galactic capital of Coruscant for the Unification Summit, a series of negotiations attempting to unite the Imperial Remnant, the Galactic Federation of Free Alliances, and the Confederation. There, Baxton served as the driver of Fel's limousine, an exceptionally long and heavily armored luxury speeder. Around this time, several Jedi Knights began to develop a mysterious psychosis that caused them to believe that everyone they knew had been replaced by impostors, and the Galactic Alliance decided to deal with the issue by encasing the affected Knights in carbonite."}, {"tag": "p", "text": "Baxton was present in 43.5 ABY when Jedi Knights Bazel Warv and Yaqeel Saav'etu developed the psychosis. They were quickly incapacitated by Fel, Jedi Knight Jaina Solo, and her parents, Han Solo and Leia Organa Solo, outside the Jedi Temple's speeder entrance. Warv, who was hit by tranquilizer darts, fell onto Fel's limousine, severely denting the roof. Fel ordered Baxton to stay quiet about the incident, and while Han, Jaina, and the Head of State hid Saav'etu and Warv inside the Jedi Temple, Organa Solo and Baxton remained out by the limousine. There, they were accosted by a Galactic Alliance Security assault squad under the command of Captain Atar, who ordered several of his troopers to surround the limousine while four more held Baxton at blasterpoint. Atar confronted Organa Solo, who denied any knowledge of the situation. When Fel, Han, and Jaina returned, the Imperial Head of State quickly ordered Atar to have his men stand down. The captain, fearing that he would evoke a diplomatic incident, complied, ordering his men to release Baxton and the limousine. Atar then requested that the Solos hand over Warv and Saav'etu, and when he showed them a warrant for the arrest of the two psychotic Jedi, Han and Leia decided to stall for time by reentering the Temple and closing the gate behind them. Fel and Jaina then got into the limousine and Baxton drove them away."}, {"tag": "p", "text": "Atar, frustrated at having failed to capture the Jedi, ordered a Duros lieutenant to prevent the limousine from leaving. Their exit was cut off by the lieutenant's forces in a Galactic Alliance Security assault speeder, and Baxton suggested to Fel that they just float over them. Fel, however, told him to simply ask the Security troops to let them go by. Baxton got out and confronted the Duros officer, requesting that he let them pass. The officer, however, refused to move his speeder, and the two quickly got into a heated argument. Journalist Javis Tyrr soon arrived, and it was then discovered that he had been using a Lovolol cleaning droid to infiltrate the Temple for his weekly show, Javis Tyrr Presents: The Jedi Among Us. As Baxton and the Duros officer continued to argue, Atar also arrived and reassured Fel and Solo that Tyrr wouldn't do anything illegal. Fel then requested that they be allowed to leave, but Atar insisted that the Head of State first hand over Solo and the cleaning droid. Fel, however, called Baxton back over to the limousine as Solo reminded Atar of Fel's diplomatic immunity, revealing that as the cleaning droid was now in the limousine it had become Imperial property. Forced to comply, Atar ordered the Duros to move the assault speeder, and Baxton drove the limousine away."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Baxton was very loyal to Fel; he was willing to illegally lie to a Galactic Alliance Security officer in the interest of protecting his Head of State. Later, when the Duros lieutenant refused to move his speeder to let them pass, Baxton quickly became aggravated and argued extensively with the officer."}, {"tag": "p", "text": "Baxton was a professional driver for the Imperial Remnant; he traveled with the Imperial embassy to Coruscant to drive Fel's personal limousine during the Head of State's stay there. Baxton was confident in his driving skills as well as the limousine's durability, suggesting to Fel that they simply float over the assault speeder, as he believed that their armor could withstand the speeder's fire. Baxton also carried a T-21 light repeating blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Baxton's first appeared in Troy Denning's 2009 novel, Fate of the Jedi: Abyss, the third of nine novels in the Fate of the Jedi series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}