{"url": "Unidentified_New_Republic_admiral", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:New Republic Defense Fleet admirals", "Category:Unidentified males", "Category:Unidentified military personnel", "Category:Unidentified New Republic individuals"], "nodes": [{"tag": "h1", "text": "Unidentified New Republic admiral"}, {"tag": "p", "text": "This male admiral was a member of the New Republic Defense Force, serving during the early years of the New Republic. In 8 ABY, he commanded the task force that liberated the planet Kal'Shebbol, the capital of the Kathol sector. The planet was ruled by Moff Kentor Sarne, a rogue Imperial warlord who controlled the entire Kathol sector. Following the successful liberation of the world, the admiral was ordered to proceed to the Minos Cluster to rendezvous with forces under the command of Sarin Virgilio, then head on to the Bozhnee sector to assist Admiral Ackbar in engaging another rogue Imperial warlord. Before he left Kal'Shebbol, this admiral authorized the transfer of personnel and equipment to the CR90 corvette FarStar, which had been charged with tracking down Sarne after the Moff escaped during the battle for his capital."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This admiral served in the New Republic Defense Force during the early years of the New Republic. In 8 ABY, he was placed in command of the task force assigned to liberate Kal'Shebbol. The planet was the capital of the Kathol sector, which was ruled by Moff Kentor Sarne, an Imperial officer who had formed his own empire following the death of Emperor Palpatine at the Battle of Endor four years previously. Rumors had reached the New Republic that he was in possession of exotic weaponry, and it had been concluded that Sarne's regime had to be eliminated. While a commando raid executed by Page's Commandos was conducted on the planet's surface to disable the planetary defense shield, the admiral led his forces into battle against Moff Sarne's forces."}, {"tag": "p", "text": "Following the successful deactivation of the defense shield, the admiral pressed his advantage and completed the liberation of Kal'Shebbol. Sarne, however, managed to escape with the majority of his forces into the depths of the Kathol sector. With the New Republic in control of the planet, the admiral was contacted by Lieutenant Judder Page, the commander of the commando team that had deactivated the shields. He relayed information to the admiral that the rumors over Sarne's possession of exotic technology were true and requested resources to track Sarne down and neutralize him. The admiral, however, had to deny his request as he could not spare any ships. He had also been ordered to leave Kal'Shebbol in three days' time to rendezvous with Sarin Virgilio's forces in the Minos Cluster before heading to the Bozhnee sector to help Admiral Ackbar box in another rogue Imperial that was terrorizing the region. However, he agreed to provide some personnel for such a mission if Page could find the ship."}, {"tag": "p", "text": "Page did manage to find a ship—a CR90 corvette that Sarne had been heavily modifying for his own purposes, which they named the FarStar. The admiral, keeping his promise, authorized the transfer of personnel and even a squadron of starfighters to support the mission. However, Page was still forced to use civilians from Kal'Shebbol to fulfill the crew requirements of the vessel. Three days after the liberation of Kal'Shebbol, the admiral led his force to the Minos Cluster to hook up with Virgilio's forces as per his orders."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A loyal New Republic officer, this admiral was a competent commander and combat officer. He kept his word, transferring personnel and supplies from his task force to support the FarStar's mission after promising to do so if Page could supply a ship for the mission. While he understood Page's need to go after Moff Sarne, he was dismissive of the claims that the warlord possessed exotic technology, writing it off as nonsense or deliberate misinformation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This admiral was briefly featured in the short story The Saga Begins, written by Timothy Zahn and published in The DarkStryder Campaign by West End Games. The admiral is never seen, but does have a conversation with Lieutenant Judder Page during the story by communicator."}, {"tag": "h2", "text": "Appearances"}]}