{"url": "Unidentified_Nihil_sniper", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Humanoids", "Category:Individuals of unspecified gender", "Category:Nihil members", "Category:Unidentified pirates"], "nodes": [{"tag": "h1", "text": "Unidentified Nihil sniper"}, {"tag": "p", "text": "A Nihil sniper lived during the High Republic Era. A humanoid individual with red skin and black tattoos, the sniper wore grey pants and boots with kneepads and a green sash, as well as shoulder armor, a bandolier and a breathing mask. The sniper carried a large blaster and a large sword. Around 232 BBY, the sniper participated in an attack on a Hutt Clan freighter transporting a load of Vratixian barley through the Kazlin system. During the raid, the sniper was injured, and subsequently left behind onboard the starship when the rest of the pirates departed. Subsequently, a group of Jedi arrived to investigate, as the space station Starlight Beacon had picked up the freighter's coded distress signal. Jedi Knight Keeve Trennis and Ceret sensed what they believed to be survivors onboard the freighter, but which was in truth the Nihil sniper."}, {"tag": "p", "text": "The four Jedi boarded, and Trennis and Ceret headed in search of the flight deck while Jedi Master Sskeer and Terec, Ceret's bond-twin, searched the ship. Amidst the clouds of toxic gas unleashed by the Nihil, the sniper was able to ambush Sskeer and Terec, firing a barrage of blaster bolts at the two which injured Terec. Sskeer did not sense the assailant because he was having some difficulties with his Force powers, and opted to use his Trandoshan sense of smell to locate the sniper, who was bleeding heavily. Noting the sniper's blaster had been dropped, Sskeer surmised that the assailant did not have long to live. The sniper attempted to attack Sskeer with their sword, leaping at him from above and behind, but Sskeer instead bisected the pirate with his lightsaber. Going into a strange rage about why he had not sensed the attacker, Sskeer then hacked the pirate's body into bits, something seen only by Trennis when she came to assist, having been alerted to the attack by Ceret. Later, after Sskeer and Ceret had been dispatched to Sedri Minor to investigate the origins of the freighter's cargo, Trennis showed Marshal Avar Kriss the Nihil's body, and Kriss realized and admitted that she should not have sent Sskeer on a mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}