{"url": "Unidentified_Nikto_Jedi/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Kajain'sa'Nikto", "Category:Post-Ruusan Jedi", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Nikto Jedi"}, {"tag": "p", "text": "A Nikto male served as a member of the Jedi Order during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 20 BBY, the Kajain'sa'Nikto Jedi was sent with fellow Jedi Finn Ertay to confront the deadly Zabrak brothers, Darth Maul and Savage Opress at an Outer Rim spaceport. This Jedi was killed, and Ertay was stabbed a few moments prior when she attempted to save the life of this Jedi."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Jedi wielded a blue lightsaber. He also wore armor over both his arms, as many other Jedi did during the Clone Wars."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "This Nikto was sensitive to the force, therefore being trained as a Jedi. He was skilled in lightsaber combat and was able to hold off Savage Opress for a brief time. He was also an aggressive adversary, demonstrating this when he launched a very aggressive blow at Opress during the duel. Despite his skill, he lacked finesse, being out of balance in his attack pattern. This weakness allowed Opress to gain the upper hand, resulting in the death of the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The animation model used was based upon that of Ima-Gun Di.\nThe character's pre-visualization model was used in an alternate battle sequence for the episode Nightsisters where he would aid in the battle and pursue Asajj Ventress. In this deleted scene he is known as \"Master Ma'kis\", and helps to corner Asajj in a hangar-bay onboard a capital-ship with Ahsoka Tano, Obi-Wan Kenobi and Anakin Skywalker. Ma'kis became separated from the other three Jedi and had to fight Ventress by himself. The cargo in the hangar-bay would hinder the battle, distracting Ma'kis, allowing Ventress to stab him to death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}