{"url": "Unidentified_Nimbanel_bartender", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Bartenders", "Category:Nimbanels", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Nimbanel bartender"}, {"tag": "p", "text": "A male Nimbanel worked as a bartender at Chalmun's Spaceport Cantina in Mos Eisley, a spaceport located on the planet Tatooine. During the Clone Wars, the bounty hunter Greedo was hired to kidnap Che Amanwe Papanoida by the Trade Federation to pressure her father, Baron Notluwiski Papanoida of Pantora, into aligning his world with the Confederacy of Independent Systems, hiding her in Chalmun's Cantina. However, Papanoida, along with his son Ion, captured Greedo and forced him to bring them to where he was holding Che Amanwe. As they entered the cantina, the Nimbanel anticipated a fight between the Papanoidas and Che Amanwe's kidnappers and sought cover behind the bar during the ensuing gunfight. Later in the conflict, the cantina was visited by former Sith apprentice Asajj Ventress, who killed the bounty hunter Oked when he tried flirting with her. He then gave Ventress a drink purchased for her by the bounty hunter Bossk, after which the Nimbanel removed Oked's corpse from the establishment. He had pink skin, black eyes, and brown hair on his cheeks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Nimbanel first appeared in \"Sphere of Influence,\" the fourth episode of the canon animated series Star Wars: The Clone Wars' third season, which originally aired on October 1, 2010. He was created when it was rationalized that the cantina didn't have the same owner during the Clone Wars, and Supervising Director Dave Filoni speculated that he was so traumatized by the episode's cantina shootout that he put it up for sale, allowing it to fall into the possession of its owner at the time of Star Wars: Episode IV A New Hope. Despite this, he later reappeared in \"Bounty,\" the twentieth episode of The Clone Wars' fourth season, which originally aired on March 2, 2012, where he was voiced by Matthew Senreich and credited simply as \"Bartender.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}