{"url": "Unidentified_OOM_command_battle_droid_lieutenant", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Separatist droid officers", "Category:Unidentified OOM battle droids"], "nodes": [{"tag": "h1", "text": "Unidentified OOM command battle droid lieutenant"}, {"tag": "p", "text": "An OOM command battle droid served as a lieutenant in the Confederate Navy, aboard a Munificent-class star frigate under the command of a Neimoidian Captain. Around the second year of the Clone Wars, the frigate was patrolling near the planet Florrum in the Outer Rim Territories, when the Lieutenant spotted a Flarestar-class attack shuttle, piloted by the Weequay bounty hunter Shahan Alama, approaching the planet. The command droid Lieutenant informed the Captain about the ship, and the Neimoidian ordered the frigate to fire upon the Weequay vessel. Soon, the Lieutenant noticed that LAAT/i gunships of the Galactic Republic had arrived at the battle zone and reported to the Captain, who sent many squadrons of droid starfighters to destroy the gunships. However, the Confederate fighters were defeated by the Republic forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Built by Baktoid Combat Automata, an OOM command battle droid served as a lieutenant in the Navy of the Confederacy of Independent Systems during the Clone Wars. The droid was the subordinate of a Neimoidian Captain, stationed on the command bridge of a Munificent-class star frigate. Circa 21 BBY, the frigate was patrolling near the planet Florrum, in the Sertar sector of the Outer Rim Territories, when a Flarestar-class attack shuttle approached the planet. The vessel belonged to the Weequay bounty hunter Shahan Alama, who was en route to Florrum to hide himself from the authorities of the Galactic Republic due to his involvement in the Senate hostage crisis. When the Lieutenant reported the vessel's arrival to the Neimoidian Captain, he ordered the droid to bring him the sector's threat files. The Lieutenant delivered a datapad containing the files to the Captain, who then verified that the Confederate leader Count Dooku had been briefly captured by a Weequay pirate gang based on Florrum. Mistaking Alama for one of the pirates, the Neimoidian ordered the frigate to attack Alama's ship to avenge the Count's captivity."}, {"tag": "p", "text": "The attacking frigate and its target were noticed by a Republic Acclamator-class assault ship, which was on a scouting mission in the same sector. The Republic ship was commanded by Jedi General Aayla Secura, who sent Clone Commander CC-5052, nicknamed \"Bly,\" with a squad of LAAT/i gunships to investigate the battle, ordering the clones not to engage the Separatists unless fired upon first. The Confederate frigate spotted one of the gunships, and the Lieutenant proceeded to notify the enemy's movement to the Neimoidian Captain, who ordered squadrons of Vulture droids, Hyena-class bombers, and Single Trooper Aerial Platforms to assault the Republic forces. However, Bly's gunship defeated the droid squadrons, which also shot down Alama's ship, winning the battle for the Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The battle droid Lieutenant had black photoreceptors and, like all OOM command battle droids of the same series, stood 1.91 meters in height. Second-in-command of a Munificent-class star frigate, the droid Lieutenant served the ship's Neimoidian Captain, overseeing the patrolling frigate's operations and reporting all detected activity in the sector to the superior officer. The Lieutenant's reporting style did not come without negative commentary, as the droid's poorly detailed notification about Alama's craft caused the Neimoidian to reprove the droid and demand a more thorough briefing. The command droid followed the Captain's orders in a dutiful manner, and when the Captain stated that the droids would not need a share of the reward he would receive for two glorious victories over the enemies of the Confederacy, the Lieutenant promptly agreed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The OOM command battle droid lieutenant first appeared in The Clone Wars: Hunting the Hunters (Part I), an issue of the online Star Wars: The Clone Wars webcomic series, taking place between Seasons One and Two of the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}