{"url": "4B-EG-6", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:GNK power droids", "Category:Manumitted droids", "Category:Masculine programming", "Category:Resistance droids", "Category:Spies"], "nodes": [{"tag": "h1", "text": "4B-EG-6"}, {"tag": "p", "text": "4B-EG-6 was a green-colored, emancipated GNK-series power droid with masculine programming that diligently served the Resistance during their conflict with the group known as the First Order. The droid was stationed at the Resistance base on the planet D'Qar, where it maintained the facility's equipment while also secretly serving as a member of the Resistance spy droid network."}, {"tag": "p", "text": "In the year 34 ABY, 4B-EG-6 was waiting in the base's landing zones when Resistance T-70 X-wing starfighters returned victorious from the battle of Takodana and later the Battle of Starkiller Base. When the Millennium Falcon left D'Qar to travel to the planet Ahch-To, the power droid was among a crowd of Resistance members who saw the starship off."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Base power source"}, {"tag": "p", "text": "The emancipated GNK-series power droid designated 4B-EG-6 had masculine programming and was used by the Resistance during its conflict with the resurgent political and military group known as the First Order. The droid was stationed at the Resistance's base of operations on the planet D'Qar, where he was one of the power droids most often assigned to the base's landing field and was responsible for providing continuous energy to the network of starship runways, including recharging power systems aboard newly returned starfighters. He also diligently worked to maintain the base's equipment."}, {"tag": "p", "text": "As the leaders of the Resistance intended the base to be easily dismantled, packed up and shipped out, the mobile power and maintenance provided by 4B-EG-6 was essential for ground crews and pilots who needed to maintain their starships at peak operating capacity. He was also classified and secretly served as a member of the Resistance spy droid network run by the protocol droid C-3PO, reporting what he saw and heard to C-3PO's subordinate PZ-4CO."}, {"tag": "h3", "text": "Read to serve"}, {"tag": "p", "text": "In the year 34 ABY, when the Blue Squadron of T-70 X-wing starfighters returned from fighting the First Order on the planet Takodana, 4B-EG-6 tended to one of their ships immediately after they landed in the D'Qar base in the landing bay opposite the YT-1300 light freighter known as the Millennium Falcon. He was then part of the maintenance crew that serviced Black One, the X-wing starfighter of Black Leader Poe Dameron."}, {"tag": "p", "text": "The droid was once again present in the bay opposite the Falcon's landing zone when the Resistance's pilots returned to D'Qar after successfully destroying the First Order's Starkiller Base superweapon. When the scavenger Rey left D'Qar aboard the Falcon in order to travel to the planet Ahch-To shortly afterwards, 4B-EG-6 was standing with fellow Resistance droid B-U4D being checked over by another member of the Resistance before both droids joined the large crowd that had gathered to wave the freighter off."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "4B-EG-6 was a devoted member of the Resistance and tried to be constantly available so that equipment was always functional, taking only periodic maintenance breaks. Like all GNK power droids, he stood 1.1 meters tall and was manufactured by Industrial Automaton. He was built with a pair of legs so that he could walk to where he was needed and provide power with his internal fusion generator. He was green in color with red markings on his front panel and a yellow strip on his rear panel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "4B-EG-6 first appeared in the 2015 sequel trilogy film, Star Wars: Episode VII The Force Awakens. The droid was not identified in the film, but his name was revealed in Star Wars: The Force Awakens: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with Episode VII."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "In the Star Wars Blips non-canon animated short \"Fan Droids,\" released on September 3, 2017, 4B-EG-6 and several other Resistance droids are shown watching a holographic projection showing the past exploits of the astromech droid R2-D2. They then become extremely excited when R2-D2 himself passes them, with the GNK droid becoming so excited that part of its front panel explodes, causing it to fall onto its back."}, {"tag": "p", "text": "4B-EG-6 also appears in the first three episodes of Star Wars Roll Out, a non-canon series of animated shorts released in 2019. 4B-EG-6 is part of a group of Resistance droids who are working in the jungle near the D'Qar Resistance base. BB-8 comes across the group before getting trapped in a vine hanging from one of the jungle trees. The group try to aid BB-8, but accidentally launch him into the sky, causing them to panic."}, {"tag": "p", "text": "Using a holographic map, the droids located where BB-8 had landed and began rushing through the jungle to reach him. They stopped upon hearing the roars of various jungle creatures, at which point a small creature lowered itself down on webbing next to 4B-EG-6. Upon seeing the creature, the power droid and his companions cried out in terror and fled. When they stopped again to check the map, 4B-EG-6 did not stop quickly enough and ran into the back of one of the other droids."}, {"tag": "p", "text": "4B-EG-6 and its companions found BB-8 as he and two native shapeshifting animals had just finished using vines to tie up a large spider-like creature that had attacked them. The droids were initially confused by the fact that the two shapeshifters were identical to BB-8, but then aided them in weighing down the spider-like creature before releasing it and launching it into the air with the vines. With the creature defeated, the droids all came together and celebrated until the two shapeshifters reverted to their natural forms, causing 4B-EG-6 and its companions to flee."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}