{"url": "Unidentified_Rebel_captain", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Alliance Fleet captains", "Category:Individuals of unspecified species", "Category:Unidentified Alliance Military personnel", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Rebel captain"}, {"tag": "p", "text": "A male individual served the Alliance to Restore the Republic during the Galactic Civil War. During the Battle of Hoth between the Galactic Empire and the Rebel Alliance in the year 3 ABY, he was the captain of the Mon Calamari cruiser Champion, which was present above the planet Hoth during the Alliance's evacuation of Echo Base, its formerly secret headquarters. One passenger that the captain received on board the Champion was the Rebellion General Crix Madine. After Madine came aboard the Champion, the captain was about to order the ship to retreat from the battle by jumping to hyperspace, when the Imperial I-class Star Destroyer Tyrant approached the Champion and prepared to attack. Xamuel Lennox, the captain of the Tyrant, hailed the Champion and ordered the captain to surrender Madine. The captain of the Champion refused and fought off the Tyrant long enough to make the jump to hyperspace in order to reach the Rebels' rendezvous point."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male individual was a captain in the fleet of the Alliance to Restore the Republic during the Galactic Civil War. During the Battle of Hoth between the Galactic Empire and the Alliance in the year 3 ABY, he was the captain of the Mon Calamari cruiser Champion, which was present over the planet Hoth while the Rebels' headquarters, Echo Base, was being evacuated. During the latter part of the battle, Rebellion General Crix Madine was rescued from the Imperial I-class Star Destroyer Tyrant by Rebel commandos, and he and one of the commandos that rescued him were eventually sent on a shuttle to the Champion."}, {"tag": "p", "text": "After Madine was on board, the captain of the Champion was about to order the ship to activate the hyperdrive, so that the Champion could travel to the Rebels' rendezvous point. However, the Tyrant, under the command of Imperial Captain Xamuel Lennox, intercepted the cruiser and launched TIE fighters. Lennox attempted to persuade the captain of the Champion to hand over Madine with promises that the Tyrant would not attack the cruiser. The captain refused to make a deal and ordered the launch of the Champion's X-wing and Y-wing starfighters. While commanding the fighters to be launched, the captain also ordered the commando who rescued Madine to take an X-wing and join the other fighters in holding off the Tyrant, so that the Champion could make the jump to hyperspace. After a battle with the Tyrant, the surviving Rebel starfighters returned to the Champion, which was then able to escape from the Tyrant and make the jump to hyperspace, eventually reaching the rendezvous point."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When the Champion was under attack from the Star Destroyer Tyrant, the captain refused to be intimidated into giving up General Madine to the Imperials. During the confrontation, the captain did not panic and gave orders that allowed his ship to escape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rebel captain who commanded the Mon Calamari cruiser Champion first appeared in the mission text for the third scenario of the light side campaign of The Price of Victory, which was released in 2010 as the eighth set of the Star Wars Galaxies Trading Card Game. In the scenario, the player takes the role of the commando whom the captain ordered to help with the fighter attack. The card game was shut down at the same time as its parent game, Star Wars Galaxies, which was closed on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}