{"url": "Unidentified_Rebel_Honor_Guard", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Alderaanians", "Category:Alliance Army personnel", "Category:Unidentified Alliance Military personnel", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Rebel Honor Guard"}, {"tag": "p", "text": "A Human male individual native to the planet Alderaan served as a military officer on his homeworld during the Galactic Civil War. By the time of his planet's destruction by the Galactic Empire's Death Star superweapon in 0 BBY, the individual joined the Alliance to Restore the Republic. After the Alliance destroyed the Death Star at the Battle of Yavin that year, the individual served as one of the Rebel Honor Guard for a post-battle ceremony held at the Alliance's headquarters on the moon Yavin 4. The ceremony honored the victorious Rebel pilot Luke Skywalker and the smugglers Han Solo and Chewbacca for their roles in the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male served as a military officer on his homeworld of Alderaan during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. During the year 0 BBY, the Empire's DS-1 Orbital Battle Station superweapon destroyed his home planet. The individual was a survivor of Alderaan's destruction, by which time he had joined the Alliance. Like some of his fellow Alderaanian survivors, he retained his ceremonial dress uniform following his planet's annihilation."}, {"tag": "p", "text": "In 0 BBY, the Alliance destroyed the Death Star in the Yavin system during the Battle of Yavin. A ceremony was subsequently held in the Grand Audience Chamber of the Alliance's headquarters on the moon Yavin 4. Along with a few other survivors of Alderaan, the individual was among the Rebel Honor Guard sentries for that occasion, standing in front of the Chamber's entrance. His Honor Guard duty was in thanks for the efforts of Rebel pilot Luke Skywalker and smugglers Han Solo and Chewbacca in the battle."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Honor Guard was dedicated to ending the Empire's tyranny. He possessed brown hair, brown eyes, and fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Honor Guard was armed with an electropole as well as a DH-17 blaster pistol on Yavin 4 and also preferred a blaster rifle. He retained his dress uniform from Alderaan, a planet rich in ceremonial history before its destruction, and wore it during his service as an Honor Guard for the Yavin 4 ceremony."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Honor Guard first appeared during the ending scene of 1977's Star Wars: Episode IV A New Hope, during the ceremony honoring the Heroes of Yavin. Though uncredited in the film itself, English actor Derek Lyons recalled portraying the character. In 2007, Hasbro released an action figure of the Honor Guard, named the \"Rebel Honor Guard\" figure, as part of its Star Wars: 30th Anniversary Collection set. The action figure elaborated on the background of all the Honor Guard sentries present during the award ceremony."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "While the 1987 comic Droids 8 featured two sentries standing by the Audience Chamber's entrance during the award ceremony scene, it depicted all of the Honor Guard sentries as having significantly different uniforms than what was shown in A New Hope."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "At the end of the A New Hope segment of the 2006 non-canon video game LEGO Star Wars II: The Original Trilogy as well as the subsequent game LEGO Star Wars: The Complete Saga, a cutscene plays that serves as a re-imagining of the award ceremony. Although the cutscene includes sentries standing at the entrance to the ceremony, their uniforms are those of Rebel troopers belonging to the Alliance Fleet, as opposed to the canonical Honor Guard uniforms."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}