{"url": "Unidentified_R5_unit_(Theed)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Feminine programming", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "Unidentified R5 unit  (Theed)"}, {"tag": "p", "text": "An R5 astromech droid was located in the city of Theed on Naboo. An R-series product of Industrial Automaton, the droid was colored white with red trim."}, {"tag": "p", "text": "In 32 BBY, the R5 unit was working near a machinery room which controlled a security gate on a Theed street. That year, the Trade Federation invaded the planet. The droid met the Jedi Padawan Obi-Wan Kenobi shortly after the invasion started. At the time, Kenobi was escorting Sabé, posing as the Queen of Naboo. Kenobi ordered the droid to stay and continue its work, as he didn't need a droid following him."}, {"tag": "p", "text": "Later, when Queen Padmé Amidala returned to retake Theed, the droid was still working at its position. Amidala met a wounded Naboo guard and asked him how to get past the security gate. the guard directed her to the R5 unit. Amidala then asked the droid to open the security door so she could disable the generator and open the door. The R5 unit complied, and Amidala continued through Theed after she opened the security door."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The R5 unit appears in the 1999 Star Wars: Episode I The Phantom Menace video game adaptation of the Episode I film. The player meets the droid in two missions. The player has several dialogue options with which to interact with the droid. This article assumes the player asked the droid to stay in its place during the first mission, and that it was available during the second to open the door. The game's strategy guide recommends following that option. If the droid is not available for the second mission, the player must interact with the wounded guard, who will give the player a passkey to bypass the security door."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}