{"url": "Unidentified_RA-7_protocol_droid_(Magna_Tolvan)", "categories": ["Category:Canon articles", "Category:Droids of the Galactic Empire", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "Unidentified RA-7 protocol droid  (Magna Tolvan)"}, {"tag": "p", "text": "An RA-7 protocol droid served Captain Magna Tolvan of the Galactic Empire. While on the Citadel of Rur, the RA-7 protocol droid was briefly possessed by Eternal Rur, attacking both the crew of Tolvan's shuttle and later Tolvan herself, but returned to normal after the destruction of the Citadel."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After Captain Magna Tolvan tracked the archaeologist Chelli Aphra to the lost Citadel of Rur, the RA-7 protocol droid accompanied her in a Lambda-class T-4a shuttle. While Tolvan and a team of snowtroopers stormed the citadel, the protocol droid remained aboard the shuttle with the pilots."}, {"tag": "p", "text": "When Eternal Rur, the disembodied consciousness of the long-dead Rur, activated its technopathy powers, the droid became possessed, killing the pilots of the shuttle. After losing her ship, the Ark Angel II, Aphra decided to escape aboard the shuttle along with Tolvan and her father, Korin Aphra. Tolvan ordered the pilots to leave, but discovered that they had been killed. As Aphra sat down to fly the shuttle instead, the possessed droid awoke, attacking Tolvan and knocking her out of the way. It put its arms around Aphra, attempting to strangle her. Aphra continued to fly the shuttle away from the collapsing Citadel, barely escaping as it exploded. With the Citadel destroyed, the droid was freed from Rur's technopathy, and removed its arms from Aphra's neck, apologizing to her. Aphra later landed the shuttle on an Outer Rim planet, leaving both Tolvan and the droid there."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RA-7 protocol droid first appeared in Doctor Aphra 5, a 2017 canon comic written by Kieron Gillen and illustrated by Kev Walker. A similar droid was shown in Doctor Aphra 3, but it is not confirmed to be the same."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}