{"url": "Unidentified_Rebel_Pilot_(Advisor)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alliance Starfighter Corps personnel", "Category:Individuals of unspecified species", "Category:Unidentified Alliance Military personnel", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Rebel Pilot  (Advisor)"}, {"tag": "p", "text": "During the Galactic Civil War, a male individual served as an X-wing starfighter pilot often was an adviser to commanders in the Alliance to Restore the Republic. He also fought in battles himself."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Early in the Galactic Civil War, this pilot served in the Alliance Fleet. He also occasionally served on-board ships, as he occasionally referred to his Captain. He served during the Battle of Fresia, preparing the team of pilots."}, {"tag": "p", "text": "After this point, he began flying an X-wing. He often contacted commanders at the beginning of battles, both in space and on the ground, where he would tell them some strategies. He later fought in the Defense of Mon Calamari, defending Dac against a massive imperial naval force. He continued to serve the Alliance after the Battle of Yavin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The pilot believed the Empire was tyrannical, and actively fought against it. He believed that civilians were innocent, and were being oppressed by their government. The pilot had some skill in tactics, and while he didn't command himself, he did give tips to commanders. He believed that tactics were more important than strength and numbers, and urged officers to scout out all routes of attack."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This pilot appears in a hologram to rebel players in Star Wars: Empire at War. He appears again in the expansion, Star Wars: Empire at War: Forces of Corruption. In it, he shares many lines with the Zann Consortium's advisor"}, {"tag": "h2", "text": "Appearances"}]}