{"url": "Unidentified_RA-7_protocol_droid_(Sentinel_Base)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Droids of the Galactic Empire", "Category:Fashion designers", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "Unidentified RA-7 protocol droid  (Sentinel Base)"}, {"tag": "p", "text": "An RA-7 protocol droid served the Galactic Empire during the early years of the organizations reign. The droid was stationed on the facility known as Sentinel Base, where on one occasion it acted as the tailor of Governor Wilhuff Tarkin. The RA-7 unit made suggestions based on the fashion of the planet Coruscant which Tarkin was initially uninterested in. The droid managed to change the Governor's mind and presented a projection of the proposed uniform, which Tarkin began modifying. Before the fitting could be complete, Tarkin was drawn away to deal with reports of an attack on the nearby Rampart Station."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An RA-7 protocol droid served the Galactic Empire during the early years of its reign. In 14 BBY, the droid was stationed on Sentinel Base, a remote Imperial facility under the command of Governor Wilhuff Tarkin, who oversaw the construction of the Death Star superweapon from the base. On one occasion the droid acted as Tarkin's tailor, visiting him in his quarters with a garment-fabricator to take measurement and suggest ideas. Tarkin at first dismissed the droids suggestions of having flare-legged, gray-green, trousers, black knee boots with turndown topside cuffs, a tunic which fell to mid-thigh and was belted at the waist, not interested in fashion, only functionality."}, {"tag": "p", "text": "The RA-7 managed to persuade the Governor to reconsider and then displayed a projection of the proposed uniform, which Tarkin scrutinized before asking that the boot's topline be removed and their heels lowered. After a final look-over of the modified projection, Tarkin asked that a command disk be added to the belt and hat, before the fitting was interrupted by the Governor's adjutant, who brought news of an attack on the nearby Rampart Station. The Governor abandoned the fitting and left his quarters in order to deal with the attack, causing the droid to call out after him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The RA-7 based its suggestions for Tarkin's uniform on the current trends on the Imperial capital planet Coruscant. When Tarkin dismissed the fashion-based suggestions, the droid was disappointed and attempted to convince Tarkin to reconsider. When Tarkin snorted in amusement at a memory of his uncle Jova while viewing the proposed uniform, the droid became distressed, believing that he found the design humorous. The droid had silver plating and spoke in a strident tone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RA-7 droid first appeared in the 2014 novel, Tarkin by author James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}