{"url": "Unidentified_RX-Series_pilot_droid_(Garel)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Masculine programming", "Category:RX-Series pilot droids"], "nodes": [{"tag": "h1", "text": "Unidentified RX-Series pilot droid  (Garel)"}, {"tag": "p", "text": "An RX-Series pilot droid flew a GX1 short hauler several years before the Battle of Yavin. During a routine trip to the planet Garel, his ship was hijacked by members of the Spectres rebel cell. After the rebels were cornered by an Imperial light cruiser, the pilot droid was tricked into powering his shuttle. Shortly later, his shuttle was destroyed by explosives that the rebels had planted aboard before escaping onto their ally Ketsu Onyo's ship Shadow Caster. The droid pilot was disintegrated during this explosion which enabled the Spectres to escape into space."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This RX-Series pilot droid flew a GX1 short hauler during the Age of the Empire. During a routine trip to Garel City Spaceport, he transported the GNK-series power droid EG-86, who was carrying some secret intelligence for the rebellion. EG-86 was picked up by several crew members of the Ghost rebel cell: Sabine Wren, the astromech droid Chopper, and Ezra Bridger. However, the rebels quickly came under attack from the bounty hunter Ketsu Onyo and a stormtrooper patrol."}, {"tag": "p", "text": "During the fighting, the rebels boarded the pilot droid's hauler and was switched off by Chopper after he protested the hijacking of his ship. The rebels then fled into space but were attacked by Ketsu's starship Shadow Caster and sustained considerable damage. The arrival of an Imperial Arquitens-class light cruiser forced the remaining rebels and Ketsu to work together. After rigging the shuttle with explosives, Sabine reactivated the pilot droid and instructed it to make an emergency protocol. The droid began powering the ship while Sabine and her companions undocked the Shadow Caster from the shuttle and escaped into space. Shortly later, the pilot droid and his shuttle were destroyed by the explosives, which also caused significant damage to the Imperial light cruiser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RX-Series pilot droid was voiced by Stephen Stanton in the Star Wars Rebels episode \"Blood Sisters.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}