{"url": "Unidentified_Republic_diplomat", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Republic Army personnel", "Category:Unidentified diplomats", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Republic Military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Republic diplomat"}, {"tag": "p", "text": "A Human male worked as a Republic diplomat on the planet Manaan during the Jedi Civil War in 3956 BBY. The diplomat represented a group of Republic soldiers in the Ahto High Court during a hearing that was the result of a brawl between his clients and a group of Sith soldiers. Both sides were found to be at fault and were fined by the Ahto City Civil Authority. Revan, a Jedi Padawan, witnessed the hearing while he was visiting the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male Republic diplomat was stationed on the water-covered planet Manaan during the Jedi Civil War in 3956 BBY. He was the representative of a group of Republic soldiers during a hearing in the Ahto High Court that was the result of a brawl between his clients and a group of Sith soldiers. The neutrality laws of Manaan meant that open aggression between the warring sides was illegal on the planet, and so they were brought to trial for the incident. As the diplomat began the hearing by claiming he had three soldiers in the infirmary, Revan, a Padawan of the Jedi Order who was visiting Manaan, entered the court and witnessed the proceedings."}, {"tag": "p", "text": "The Sith representative responded by saying that if the Republic soldiers were more capable, they would not have suffered such serious injuries, and questioned whether his soldiers should be punished for winning a fair fight. The Republic diplomat rebuked this claim, stating six against three was hardly a fair fight, and he claimed that the Sith only attack when they have numbers on their side. The Selkath judges responded by saying they were aware of the Republic's indignation, but that witnesses testified that the Republic soldiers were just as willing to engage in violence as the Sith. The Republic diplomat claimed his clients were provoked, but the judges dismissed this, stating that words were not sufficient provocation in the eyes of the court. The judges ruled that both parties were responsible and fined each of them 10,000 credits."}, {"tag": "p", "text": "At the conclusion of the trial, Revan spoke with the Republic diplomat, who held firm to his belief that the Republic was the only hope Manaan had to survive the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Republic diplomat believed that Manaan's neutrality laws were a cowardly excuse not to fight in the war, and he thought that Manaan's native sentient species, the Selkath, should ban the Sith from their planet. He believed that if it were not for the Republic, Manaan would already be under Sith control, but he was angry that the Selkath never seemed to show any appreciation for it. He was completely loyal to the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Republic diplomat appears in the 2003 PC and Xbox RPG video game Star Wars: Knights of the Old Republic when the player visits Manaan and enters the Selkath courtroom in Ahto City for the first time. Once the hearing is concluded, the player can talk to the diplomat, who will spout several anti-Sith phrases like the ones that appear in this article. The diplomat is named simply \"Republic Diplomat\" in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}