{"url": "Unidentified_Republic_soldier_(Falang_Minor)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured article nominations", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Unidentified farmers", "Category:Unidentified males", "Category:Unidentified Republic Military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Republic soldier  (Falang Minor)"}, {"tag": "p", "text": "A male individual lived during the final years of the Tionese War, which was fought between the Galactic Republic and the Honorable Union of Desevro & Tion from 24,000 BBY to 23,900 BBY. Growing up on Little Atullus, as a boy he moved with his parents to Okator VIII, where they had purchased a land property. The family established a farm there, keeping a herd of local whellays and growing several types of plants. The boy helped at the farm, shepherding the whellays with the assistance of several shakwulfs. He eventually got used to, and then became happy with, the busy pastoral life."}, {"tag": "p", "text": "Months before the end of the Tionese War, however, the boy's life changed when a group of Tionese warships arrived at Okator VIII with the intention of destroying the local Republic settlements. Away from the farm at the time, the boy witnessed the decimation of several inhabited locations before finally rushing back home before it, too, could be destroyed. He was too late, as one of the warships set the farm on fire, with the boy helplessly observing the destruction of his home and the death of his family's whellays and his favorite shakwulf, Brun."}, {"tag": "p", "text": "After that, the Tionese ships left Okator VIII, and weeks later, so did the boy. He traveled to the Republic world Abhean to enlist with the Republic Military, although mere months after the former farm-boy became a Republic soldier, the Tionese War ended, and he eventually became assigned to the Republic fortress world Falang Minor. There, the soldier monitored starship traffic, intelligence, and transmissions originating in the Tion Cluster. After having served on Falang Minor for twelve years, the soldier recorded an account of the attack on Okator VIII that he imprinted on a Baragwin sense lattice, with the record being kept in the Palace of Memnii on Caamas twenty thousand years later."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early childhood"}, {"tag": "p", "text": "During the Tionese War, which was fought between the Galactic Republic and the Honorable Union of Desevro & Tion for roughly a century beginning in 24,000 BBY, a boy was born into a family living as part of the Republic on the Inner Rim astronomical object Little Atullus. At some point, the boy's parents invested their life savings into a land property on the Divide celestial body Okator VIII that was offered by a group of traders from the Core Worlds planet Brentaal. The boy and his parents eventually left Little Atullus for Okator VIII, where they began to establish a farm in a valley."}, {"tag": "p", "text": "The boy's first job, while his parents built a cabin and cleared out fields, was to capture the local creatures known as whellays by putting out bait in Okator VIII's forests. On the first day, the boy caught six of the creatures and gave each of them a name, with his parents having neglected to tell him the whellays were meant for the family to cook and eat."}, {"tag": "h3", "text": "A farmer's life"}, {"tag": "p", "text": "Eventually the boy settled into the busy life at the farm. The family kept a herd of whellays, and the boy was entrusted with shepherding them with the assistance of domesticated shakwulfs. The boy would let the whellays, tended by a shakwulf, out at dawn and then signal the creature to bring the herd back home after lunch. The following afternoon was usually spent in grooming the coats of the whellays and checking their hooves as well as monitoring the creatures for signs of coming into estrus and researching their lineage-books to determine the best pairings. In shearing season, the boy would stay in the barn into the night helping out his parents with the whellays."}, {"tag": "p", "text": "Besides helping maintain the whellay herd, the boy's morning duties included tending the several types of plants the family was growing. The boy weeded saria, harvested nectar from charsby orchards, and tapped loam for ripe galt-gourds. In the evening, the family ate dinner, after which the boy was occupied with repairs and lessons. From time to time, the boy and his family went to town, where they would hear the latest news on the progress of the Tionese War."}, {"tag": "h3", "text": "The Tionese attack"}, {"tag": "p", "text": "At some point months before the war's end around 23,900 BBY, the boy, accompanied by his favorite shakwulf, Brun, was tracking down a lost whellay in Okator VIII's forests. At that point, the young farmer witnessed the arrival of a group of Tionese warships intent on destroying the Republic settlements on the celestial body. The boy heard the approach of one warship and then saw two additional vessels. One of the ships destroyed Derway Township by detonating a pressure bomb, and the explosion knocked the boy to the ground and temporarily disabled his hearing."}, {"tag": "p", "text": "Acting on his training to protect the whellay herd from any danger, Brun ran back toward the farm. After the boy observed the Tionese decimation of Duny Gap and Shillagh Hollow settlements, he noticed a warship hovering over the farm and followed Brun. He arrived just in time to watch the farm, including the animals and plants there, being set on fire by the Tionese vessel's attack run. At that point, the warships left Okator VIII."}, {"tag": "h3", "text": "A soldier for the Republic"}, {"tag": "p", "text": "Five weeks after the Tionese attack, the boy was able to hail a scoutship that allowed him to leave his adopted homeworld forever. Although he was encouraged to talk about his experience on Coruscant, the capital world of the Republic, the boy refused and instead traveled to the Republic world Abhean to enlist with the Republic Military."}, {"tag": "p", "text": "Eventually the young man was made a Republic soldier. Four months later, however, before he could join the fight against the Tionese, the war ended in a victory for the Republic. The soldier was eventually assigned to Falang Minor, one of a series of Republic fortress worlds established along the Coreward boundaries of the Tion Cluster. Placed under the command of watchmen of the Jedi Order, the soldier's duties included monitoring starship traffic, intelligence, and transmissions originating in the star cluster. After having served on Falang Minor for twelve years, the soldier imprinted an anonymous audio-visual account on a Baragwin sense lattice. He recorded a brief narration of his early life as well as an account of the Tionese attack on Okator VIII."}, {"tag": "p", "text": "The sense lattice containing the soldier's narration eventually became one of the oldest records preserved in the Palace of Memnii on the planet Caamas. Although the structure was destroyed in 19 BBY, at least one copy of the soldier's account remained intact in the possession of a traveling memnii exhibit."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Happy farmer"}, {"tag": "p", "text": "Regarding his original homeworld of Little Atullus, the boy who would later become a Republic soldier noted that he partially agreed with the sentiment prevalent there during his childhood—that colonists could lead better lives on the worlds beyond the region known as the Rim. The boy characterized the traders who sold his parents a land property on one such celestial body, Okator VIII, as \"hotshot.\""}, {"tag": "p", "text": "After his family moved to Okator VIII, the boy initially felt lonely but eventually got used to life at a farm. Over time, he forgot about Little Atullus, only continuing to see it in his dreams. At first the boy only tolerated his daily routine, resenting the fact that he had to take lessons after a day of working at the farm. At some point, however, he realized that he was happy with his new life, with his contentment fueled by his intense familiarity with his environment. When he caught six whellays on his first day of luring the creatures in by putting out food in the woods, the boy imagined that he was a god of the forest. The boy knew the shakwulf named Brun from the creature's first moments as a blind pup. Brun became the boy's favorite shakwulf companion, and the latter was confident the former loved him more than anything else in the galaxy."}, {"tag": "p", "text": "During his childhood, the Republic soldier knew about the Tionese War, being able to recognize the Tionjack warships upon sight. The boy was aware of atrocities the Tionese had committed against the Republic, as well as the possibility that the Republic had reciprocated. He knew of Xim, the Human ruler of a large interstellar empire centered in the Tion Cluster who had died more than a thousand years earlier after being defeated in a war against the empire of the Hutt species. The boy believed that Xim, the location and circumstances of whose death later scholars disagreed on, had been eaten by the Hutts, whom the former referred to as \"devil-slugs,\" in order to obtain his supposed powers. Ultimately, the boy believed that Okator VIII's remoteness from the Tion Cluster rendered the threat of war irrelevant to his adopted homeworld, despite the fact that at the beginning of the conflict, the Tionese had penetrated the Republic's territory as far as the Core Worlds."}, {"tag": "h3", "text": "A survivor"}, {"tag": "p", "text": "After having witnessed the destruction of his family's farm during the Tionese attack on Okator VIII, the soldier came to believe that the worst thing about the experience was the fact that he had arrived at the farm in time to see it immediately before its decimation. As a result, he had noticed that Brun had brought their whellay herd back home—which proved to be the creature's doom. As the boy witnessed the animals being set on fire by the attack, their resultant suffering seemed excessively long to him, and he only wished that the creatures would stand still so as to quicken their death."}, {"tag": "p", "text": "Following the attack, the boy turned down the suggestion of telling his story at the Republic's capital, instead opting to enlist with that government's military for a chance to fight the Tionese who had destroyed his home. The war's end denied the soldier that chance, and eventually he was posted on Falang Minor, where he helped monitor the Tion Cluster. He disliked that world's barren nature and harsh climate, and he also lamented the passive nature of his assignment, which gave him too many opportunities for introspection. Although the soldier initially hated the Tionese for their deeds, that disposition made him constantly feel sick, and he let go of the hatred."}, {"tag": "p", "text": "Ultimately, however, the soldier felt that it was his duty to perform his responsibilities, believing that he was chosen for the task when the Tionese warships arrived to destroy the Okator VIII settlements. The soldier deeply distrusted the people who had destroyed his home and believed that everyone in the Republic should forever share that distrust. In an account of the attack on Okator VIII recorded after having served on Falang Minor for twelve years, the soldier expressed his conviction that Republic agents on that world would always keep monitoring the Tion Cluster."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "During the time he spent in his family's farm as a boy, the Republic soldier became well-acquainted with his surroundings. He could recognize individual trees in the forests surrounding the farm; every outcropping in the nearby hills; and every depression and ridge of the farm's orchards. Over time, the boy also learned to recognize each of his family's whellays by their individual smell and whicker."}, {"tag": "p", "text": "In addition, the boy became familiar with the sounds made by the engines of tradeships and courier starships regularly visiting Okator VIII. That familiarity allowed him to instantly realize the foreign nature of the Tionese warships that had arrived to destroy the local settlements. During his service in the Republic Military, the soldier acquired the skills necessary to perform his duties, which included monitoring starship traffic, intelligence, and transmissions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The unnamed Republic soldier was originally meant to serve as the narrator of an in-universe section in the 2012 reference book The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart; however, the section, titled \"A Soldier's Story: Lights in the Darkness,\" was cut before the book's release. The section, which both Fry and Del Rey editor Erich Schoeneweiss characterized as \"poignant\" and which Fry further described as \"one of [his] favorite bits of writing that wound up on the cutting-room floor,\" was later renamed \"The Watchman's Tale\" and was released in 2014 as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com Blog containing various cut content from The Essential Guide to Warfare."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}