{"url": "Unidentified_Republic_soldiers_(Kolto_tanks)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Character stubs", "Category:Unidentified males", "Category:Unidentified Republic Military personnel"], "nodes": [{"tag": "h1", "text": "Unidentified Republic soldiers  (Kolto tanks)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "These two Republic soldiers were crewmembers on the Hammerhead-class cruiser Endar Spire. When the Sith Empire's fleet, under the command of Darth Malak, attacked and boarded the Endar Spire, these two soldiers fled in an escape pod, landing on the planet Taris."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The soldiers were injured in the crash landing. They were recovered by Zelka Forn and brought to his medical facility in the Upper City, despite the risk of being arrested for harboring and assisting Republic soldiers. He kept them hidden away in the back room of the medical facility. However, their wounds were too extensive for them to recover, and so Forn placed them in Kolto tanks, keeping them comfortable during their final moments."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When entering the Medical Facility, the player can open the door to this back room, to find these men. Alarmed, Zelka says that the room is for employees only. Revan can say that he recognizes them as Republic soldiers, and can persuade him to explain what is going on. If in the party at the time, Carth and Bastila both say their thanks to Zelka for what he has done. At this point, the player can gain light side points by asking if there is any way that he can help the men out, with Zelka then saying that nothing more can be done. However, the player can gain dark side points by threatening to inform the Sith of this. However, it is optional for the player to even enter the medical facility.\nIt is interesting to note that they will always appear the same, possessing the canonical [Revan/Legends|Revan's]] face model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}