{"url": "4D6-J-A7", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Feminine programming", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Imperial Security Bureau droids", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "4D6-J-A7"}, {"tag": "p", "text": "The RA-7 protocol droid 4D6-J-A7 served the Galactic Empire's Imperial Intelligence and Imperial Security Bureau as an administrative assistant during the Age of the Empire. As a result of intrusion protection applied on her databanks, 4D6-J-A7 developed a conceited attitude that led to her looking down on other droids of lower station. She was present in the Empire's Citadel Tower on the planet Scarif when a battle against the Rebel Alliance began, which culminated in the tower's destruction by the Empire's Death Star superweapon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "4D6-J-A7 was an RA-7 protocol droid who served as an administrative assistant in Imperial Intelligence and in the Imperial Security Bureau. During the reign of the Empire, she was stationed in the Imperial Office of Security in the Citadel Tower, a structure containing the archival Scarif vault, located in the Imperial security complex on the planet Scarif."}, {"tag": "p", "text": "In the year 0 BBY, she was present in the tower when Rebel Alliance agents Jyn Erso, Cassian Jeron Andor and K-2SO infiltrated the structure disguised as Imperial staff. The Alliance trio passed 4D6-J-A7 within the tower while the droid was conversing with a pair of Imperial officers, but she failed to recognize the infiltrators as a real threat to the Empire. The Battle of Scarif broke out soon after, resulting in the Alliance's theft of the plans to the Empire's Death Star superweapon and the destruction of the Citadel Tower by the Death Star itself."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Manufactured by Arakyd Industries, 4D6-J-A7 had feminine programming; black sensors and distinctive, glossy black plating; and, like all RA-7 protocol droids, stood 1.7 meters (5 feet, 7 inches) tall. Given that 4D6-J-A7 was regularly exposed to highly classified information, her databanks were protected from electronic or other forms of intrusion. This, and her high rank, led to her developing a conceited attitude and acting in a mean and insufferably arrogant manner to droids of a lower station, neither of which affected her performance on Scarif."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "4D6-J-A7 was portrayed by Nathan Plant in the 2016 Anthology film, Rogue One: A Star Wars Story. Plant also portrayed another RA-7 droid in Rogue One, KMD-RA-71, as well as one of the Hassk triplets Star Wars: Episode VII The Force Awakens, the 2015 sequel trilogy film. 4D6-J-A7 was not identified in the film but was given a designation by Pablo Hidalgo in the reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was released on the same day as the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}