{"url": "Unidentified_Shadow_Guard_(Raxus_Prime)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Emperor's Shadow Guards", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Shadow Guard  (Raxus Prime)"}, {"tag": "p", "text": "This unnamed Shadow Guard was a Human male Emperor's Shadow Guard. He was stationed on Raxus Prime at the Imperial Ore Facility. He was killed by Darth Vader's apprentice Galen Marek when he stormed the facility and dueled the guard."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point, he became a member of the Emperor's Shadow Guard, an elite subdivision of the Emperor's Royal Guard. In 2 BBY, he was stationed at the Imperial Ore Facility on the junk planet of Raxus Prime, spending his time in the ore cannon control room. However, Galen Marek, the secret apprentice of Darth Vader, infiltrated the facility and mowed down the garrison of Imperial Navy commandos, Imperial heavy troopers, Imperial jumptroopers, and Imperial medics. reaching the ore cannon control room, the two engaged in a duel. Marek won, and sent the guard flying into a ball of melted ore using the Force."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Shadow Guard, he was proficient with a lightsaber pike, using it in the duel. The guardsmen also was able to use the Force to some extent, producing purple Force lightning and able to Force choke. In the end, his skills were no match for that of Marek's."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Shadow Guard is only present in the Wii and PS2 versions of Star Wars: The Force Unleashed. In the PS3 and Xbox 360 versions, Galen Marek instead fought a malfunctioning PROXY who utilized battle data for the Shadow Guard."}, {"tag": "h2", "text": "Appearances"}]}