{"url": "Unidentified_Skakoan_combat_engineer", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Pages needing citation", "Category:Confederacy science and engineering personnel", "Category:Skakoans", "Category:Techno Union members", "Category:Unidentified CIS members", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified Skakoan combat engineer"}, {"tag": "p", "text": "An unidentified Skakoan served as a combat engineer in the Confederacy of Independent Systems during the Clone Wars. Near the end of the war, the Skakoan was among the scientists who participated in the experiments performed on the Nelvaanians"}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Towards the end of the Clone Wars, the Skakoan was among the scientists who were assigned to the planet Nelvaan in order to experiment on the Nelvaanians, turning them into mutant cyborg soldiers. General Grievous ordered the army to be delivered to him as soon as the last specimen was was transformed. The Skakoan combat engineer told the head scientist that the specimens were not ready, but the head scientist dismissed this."}, {"tag": "p", "text": "As the engineers were going to transform the final specimen, Harvos, Jedi Knight Anakin Skywalker arrived and saved Harvos. The head scientists released the other specimens and ordered them to attack Skywalker despite the combat engineer's objections. Skywalker and Harvos were able to free the mutants from their control collars. The Skakoan combat engineer fled the facility with the other scientists as the angered Nelvaanian cyborgs started attacking the security droids. However, before the combat engineer and the other scientists could get to their transport, Skywalker arrived, having just destroyed the facility's siphon generator, at the cost of his mechanical hand. Angered, Skywalker used the Force to kill all of the scientists, including the combat engineer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Skakoan was voiced by James Arnold Taylor.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}