{"url": "Unidentified_Sith_immigration_inspector", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Sith in the Lost Tribe of Sith", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Sith"], "nodes": [{"tag": "h1", "text": "Unidentified Sith immigration inspector"}, {"tag": "p", "text": "A Sith immigration inspector was a male Human who posed as an inspector for the Coruscanti Immigration Service sometime in 44 ABY. He inspected the passengers of the starliner Plain Lady and cross-examined the Jedi Knight siblings Valin and Jysella Horn, who at the time were undercover. Detecting no falsehood from the sibling's answers through The Force, the Sith inspector allowed them to go their way."}, {"tag": "p", "text": "The Sith inspector was prone to extort a ten-credit expediting fee from passengers, which Jedi Knight Jaina Solo deemed a clever cover to identify enemy agents."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Sith immigration inspector's knowledge of everything outside his Kesh upbringing was minimal. This ignorance, shared by all the other Lost Tribe impostors in the Galactic Alliance organizations, was due to their long stay on their homeworld without any contact with the rest of the galaxy."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The immigration inspector was a Force-sensitive and a member of the Sith Tribe from Kesh. He knew how to detect falsehood using the Force by searching through a person's Force Aura. In keeping with his role as an inspector, he was proficient with asking mundane questions to look for any story discrepancies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Sith immigration inspector first appeared briefly in Troy Denning's 2012 novel, Fate of the Jedi: Apocalypse, the ninth installment in the Fate of the Jedi series. To date, Apocalypse is the character's only appearance in Star Wars canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}