{"url": "Bea_Arthur", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Deceased actors", "Category:The Star Wars Holiday Special actors"], "nodes": [{"tag": "h1", "text": "Bea Arthur"}, {"tag": "p", "text": "Bea Arthur (born Bernice Frankel; May 13, 1922 – April 25, 2009) was an American actress known for her deep voice and sharp delivery of comedic lines who gained fame acting on Broadway, in television, and in films throughout her long career. One highlight of her career, Maude, was a sitcom of her own which ran for six successful seasons."}, {"tag": "p", "text": "In 1978, Arthur was invited to appear on The Star Wars Holiday Special, a holiday-themed variety show set in the Star Wars universe that was attempting to capitalize off of the success of the wildly popular film of the previous year, Star Wars. Arthur portrayed Ackmena, a gruff bartender at the Mos Eisley Cantina whose rowdy patrons refused to obey a planet-wide curfew imposed by the Galactic Empire. Ackmena resorted to singing the song \"Goodnight, But Not Goodbye,\" which caused them to waltz out the door."}, {"tag": "p", "text": "Arthur found further success on television when she played the pragmatic Dorothy Zbornak on the 1980s sitcom The Golden Girls, a very popular show throughout its seven year run. After falling ill from cancer, Arthur passed away in her home in 2009. She was remembered fondly by friends, family, and the Broadway community."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Star Wars Holiday Special"}, {"tag": "p", "text": "As the Emmy-winning lead of one of television's most popular shows, Arthur was a star. In 1978, she was invited by Ken and Mitzie Welch, the composers of a song called \"Goodnight, But Not Goodbye,\" to sing it on a television program called The Star Wars Holiday Special. Star Wars had been a wildly successful film released the previous year, and a holiday-themed variety show was being produced to capitalize off of its success. Arthur played the role of Ackmena, a gruff and assertive bartender working the night shift at the Mos Eisley Cantina, who was forced to close down the bar after the Galactic Empire imposed a planet-wide curfew. When the patrons refused to leave, she resorted to singing \"Goodnight, But Not Goodbye,\" which prompted everyone present to waltz out the door."}, {"tag": "p", "text": "Arthur's scene proved to be a lengthy shoot, spanning twenty-four hours, but she nevertheless enjoyed working on the special, even though she was unaware that it was part of the larger Star Wars franchise. Years later, she would recall singing to a group of people with funny heads, as the various cantina patrons had been aliens from throughout the Star Wars galaxy. The special itself received good reviews at the time, but ultimately came to be almost universally panned by later reviewers. Arthur's musical performance has been cited as one of its high points, despite being considered just as bizarre as the rest of the production. Arthur's role led to scores of letters and requests for autographed photos from Star Wars fans throughout the proceeding years."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "After becoming ill from cancer, she passed away at her home on April 25, 2009, and her body was cremated. Arthur was remembered fondly by many of her friends and co-stars, including Angela Lansbury, Betty White, and Adrienne Barbeau, and the Broadway community paid tribute to her life by dimming the marquees of New York City's Broadway theatre district for one minute on April 28, 2009."}, {"tag": "h2", "text": "Filmography"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}