{"url": "Unidentified_Slinani_droid", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified Slinani droid"}, {"tag": "p", "text": "A droid was one of many droids that served the religious warrior clan known as the Slinani, protecting Red Mist, one of their Migration Shrines. When the rogue archaeologist Chelli Aphra was hired to steal an artifact from Red Mist, she sliced into the droid, altering its programming so that it protected them rather than attacked. With the help of the droid, Aphra and her young ward Vulaada Klam reached the artifact, and used the droid to retrieve it from the gravity trap it was held in. The gravity trap destroyed the droid, but allowed Aphra to take the artifact."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the reign of the Galactic Empire, the droid served the Slinani religious warrior clan on the Migration Shrine Red Mist, having protected the shrine for some time. Sometime prior to the Battle of Hoth in 3 ABY, the rogue archaeologist Chelli Aphra and her young ward, Vulaada Klam, entered the shrine after Aphra was anonymously hired to steal an artifact Minister Pitina Voor of the Coalition for Progress, hoping to manipulate Aphra as part of her plot to assassinate Emperor Palpatine."}, {"tag": "p", "text": "The droid, and several others, attempted to kill Aphra and Klam for trespassing in the migration shrine, but the archaeologist hijacked the droid, adjusting its instructions so that it turned on its fellow droids and destroyed them. The droid welcomed Aphra and Klam as pilgrims, escorting them safely through the various traps on Red Mist. The droid took Aphra and Klam to the artifact, a red cape, which was held in a gravity trap. Aphra ordered the droid to collect the cape, and the droid did so, but the gravity trap caused its head to explode. Aphra collected the cape from the droid's body, and she and Klam escaped with the artifact."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid had red plating and a singular red sensor, which turned green after Aphra sliced into the droid. The droid was instructed to kill intruders to the shrine, but Aphra's new programming caused it to believe she and Klam were pilgrims."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When attempting to defend Red Mist from Aphra and Klam, the droid carried a blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The droid first appeared in Doctor Aphra 32, a comic written by Simon Spurrier, illustrated by Wilton Santos, and published by Marvel Comics on May 8, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}