{"url": "Unidentified_Solay_Rebel", "categories": ["Category:Legends articles", "Category:Individuals of unidentified species", "Category:Unidentified males", "Category:Unidentified mercenaries"], "nodes": [{"tag": "h1", "text": "Unidentified Solay Rebel"}, {"tag": "p", "text": "This Solay Rebel was a mercenary on the planet of Solay."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This rebel was loyal to the revolutionary movement led by Raggold and fought in the Solay Civil War. However, his loyalty was dependent on payment, and the rebel lived comfortably on the funds that were given to him by the rebel movement. Following the Battle of Endor, the Solay revolutionaries were secretly funded by an Imperial Governor in order to overthrow the Solay Royal Court. The rich rebel overheard rumors of the secret funding, but he was unaware that Raggold was the one who had organized the secret Imperial alliance."}, {"tag": "p", "text": "After the Solay rebels overthrew the government and captured King Blackart, the Imperial Governor's forces moved in and took control of the planet. The rebel, knowing that his days were numbered, escaped to a brothel, deciding to spend his last days living for himself. It was there that he was encountered by Luke Skywalker, a Jedi Knight who was attempting to discover who had sold out the rebel movement to the Imperials. Skywalker was led to the rebel by Scamp, a local thief who was hoping to steal from the rich rebel."}, {"tag": "p", "text": "Skywalker violently interrogated the rebel, using the Force to slam the man against a wall and Force choke him. Panicked, the rebel recounted the rumors he had heard about the Imperials funding the revolution and that the traitor had been a spy in the court. Skywalker recognized that the man only knew rumors, and frustrated, he contemplated killing the man. However, he eventually decided against it, releasing the man and scolding him for living such a self-centered life. The rebel responded that he was simply a dead man and that he would live the last hours of his life the way he wanted. As Skywalker and Scamp left the premises, the rebel called out that the Jedi was a hypocrite, as he was spending his time torturing innocent people. A short time later, the Imperials took full control of the planet, and the rebel was likely killed by the Imperial Governor's forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Solay rebel is shown with two different eye colors. He is initially shown with blue eyes, but in the next close-up, his eyes change to green."}, {"tag": "h2", "text": "Appearances"}]}