{"url": "Unidentified_TIE_variant", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "Unidentified TIE variant"}, {"tag": "p", "text": "An unidentified TIE Series variant was seen in use in 1 BBY. Incorporating components visibly similar to those comprising the TIE/sa bomber, this hyperspace-capable starfighter was used in a special operation commissioned by Darth Vader to bring his wayward apprentice, an apparent clone of Galen Marek, back under his control."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This TIE variant was composed of three fuselage cylinders in an arrangement nearly identical to the TIE Heavy Bomber, but lacking the ventral ordnance pod. In place of the concave solar array wings of the TIE/sa bomber, this variant was equipped with outward-canted wing panels very similar to those of the TIE/D Defender or an inverted mounting of those on the TIE/ad starfighter.."}, {"tag": "p", "text": "Like those fighters or the TIE/IN interceptor, it had energy weapons at the tips of its wing panels, though it was only seen to use ion cannons. The port-side pods both carried two large projectile launchers which fired a unique type of boarding pod that carried Terror Troopers and/or battle droids."}, {"tag": "p", "text": "Operated by a single TIE pilot, the ships were hyperdrive-equipped, with sufficient range to travel from Kamino to the Itani Nebula. Their twin ion engines could keep pace with Slave I at attack speed."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "In the only event in which these TIE variants have been seen in use, they were part of a strike force used to assault the EF76 Nebulon-B escort frigate Salvation. They engaged the Salvation's fighter screen, deployed boarding troops, and assaulted the frigate directly, disabling its main reactor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This class of starfighter was assigned by Darth Vader to a strike force utilized by the bounty hunter Boba Fett to capture Rebel Alliance Captain Juno Eclipse. The objective of this capture was to use Eclipse as leverage against Vader's wayward apprentice, an apparent clone of Galen Marek."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The TIE ship appears in Star Wars: The Force Unleashed II comic, a 2010 adaptation of the game of the same name. Although several ships are mentioned as attacking the Salvation fleet in the novelization, they are not identified as the TIEs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}