{"url": "Beak_(individual)", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:61st Mobile Infantry personnel", "Category:Individuals of unspecified species", "Category:Males", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Beak  (individual)"}, {"tag": "p", "text": "Beak was a male individual who served as a soldier of the Alliance to Restore the Republic's 61st Mobile Infantry during the Galactic Civil War. Thought to be an exceptional soldier, he, Roja and First Sergeant Hazram Namir was assigned to escort Captain Micha Evon and Everi Chalis to Hoth for a strategy conference with the Alliance High Command. Before they could depart Hoth, however, the Galactic Empire discovered and attacked the rebel base there. Forced to retreat from their original posts, Beak and the other two attempted to rescue Evon and Chalis when Darth Vader intervened and cut Beak in half."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Alliance"}, {"tag": "p", "text": "Beak joined the Alliance's 61st Mobile Infantry, also known as Twilight Company, sometime before the Galactic Civil War. He and Roja were present for the battle of Mygeeto and served Twilight Company through the Mid Rim Retreat."}, {"tag": "h3", "text": "Escort to Hoth"}, {"tag": "p", "text": "In 3 ABY, Beak was assigned along with Roja and First Sergeant Hazram Namir to escort the defected Imperial governor Everi Chalis and Captain Micha Evon, nicknamed Howl, to the Alliance High Command on Hoth. They were met by Alliance General Philap Bygar who commended Twilight Company for their service. Whilst Chalis and Howl attended a strategy conference with the high command, Roja, Beak and Namir were given duties throughout the Rebel base. Roja quickly bonded with the snow speeder technicians and Namir got into a fight with an Rebel Alliance Special Forces soldier named Kryndal, causing him to be on load-lifting duty for several days. Roja and Beak eventually found Namir again and they told stories of past battles and the incompetence of the base troops. Howl and Chalis returned the next day with news of their imminent departure. However, they did not have time to think about this as the Empire had found the rebel base and a mass evacuation immediately came into preparation."}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "Beak and the other two were deployed to defend against encroaching Imperial scout forces that fanned out from the main attack force. They passed a pair of macrobinoculars between them and Roja spotted ships overhead. Beak identified them as Gozanti-Cruisers carrying Imperial vehicles to the ground and Namir told him to report it to Echo Base. The walkers were confirmed by Outpost Beta shortly before it was destroyed. Beak also answered Roja's continuous questions to Namir. The contigent of light vehicles overwhelmed the defenses and the turrets were reduced to cinder. Without proper defenses to challenge them, the remaining Imperial scout forces withdrew and the three were forced to retreat. They found a HAVw A6 Juggernaut and Roja got it back online. Beak then assisted Roja driving the Imperial vehicle and Namir stayed in the back with a few other survivors."}, {"tag": "p", "text": "When they got back to the base, the rebel defenses were in full retreat and the main base had taken severe hits from AT-AT shots. A Colonel claimed that the command had taken a hit and the trio made for the base. Beak and the other two later navigated the hallways of the base and found Chalis and an injured Howl. Namir then scouted the hallways and came back with a route to the hanger. The group made for the hanger but were cut off by Darth Vader and his troops. The trio shot at the group and Vader jumped in front of Beak, bisecting him and killing him instantly. As a response, Roja then threw a grenade at Vader, but it was deflected and knocked out Namir."}, {"tag": "h3", "text": "Post death"}, {"tag": "p", "text": "Namir awoke shortly after to find Roja and Howl dead and Chalis swept aside by Vader and his troops. He and Chalis managed to escape Hoth and returned to Twilight Company on Ankhural."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "Beak was respected as a fine soldier amongst the Twilight troops. Beak was also very intelligent and was able to identify Gozanti-Cruisers from far away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Beak appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}