{"url": "Unidentified_TIE_Defender_chief_scientist", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Empire science and engineering personnel", "Category:Individuals of unspecified species", "Category:Scientists", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified TIE Defender chief scientist"}, {"tag": "p", "text": "An unnamed chief scientist worked for the Imperial Navy and Grand Admiral Demetrius Zaarin during the Galactic Civil War. He was head of the project in developing the advanced TIE/D Defender."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The chief scientist was the lead scientist of the TIE Defender project before Grand Admiral Demetrius Zaarin betrayed the Empire and led his forces into an insurrection. Zaarin would then try to loot his Research facility, only to be thwarted by Loyalist Imperial forces led by Tan Maarek Stele. After his second attempt to raid and capture the station failed. Zaarin led his Imperial-class Star Destroy Glory to destroy the station. Loyalist forces managed to retrieve the remaining TIE Defender prototypes, Proto 11 and 12 onto a freighter Mharsup and the scientist onto a shuttle G'nabgib."}, {"tag": "p", "text": "The shuttle would rendezvous with 3 modified corvette Hashim to place a TIE Defender in each corvette, with Maarek Stele's being in Hashim 3. After fending off Rebel forces trying to capture the prototypes, Hashim arrived to find itself in a trap laid by Rneekii Pirates. By the time Stele was launched to fight of the pirates, transport Ibutho 1 had already boarded the shuttle and kidnapped the scientist along with the data. Not long afterwards Proto 11 was stolen by a Nami team while Stele was engaging Rebel raiders."}, {"tag": "p", "text": "The Rneekii decided to ransom the scientist to highest bidder, which was the Empire. Unfortunately, the pirates underestimated the Empire and after negotiating the ransom near the planet Kiilimaar, the Empire used Maarek Stele to outwit and trap the pirates with a Interdictor Red Claw. After the scientist was on another shuttle, the code \"Full Speed to Kiilimaar\" was sounded and Stele engaged the pirates and the Red Claw arrived preventing their escape, when another Nami strike team disabled the shuttle and damaged the Red Claw disabling its hyperdrive and Gravity Well generators stranding both ships. The Nami tried to board the shuttle to capture the scientist but were unsuccessful his shuttle was repaired and brought to the Red Claw. The Nami decided to inform Zaarin, who learn't that the ship was going to transfer the scientist and prisoners onto a Modified corvette called Chemeti 1 so he sent an imposter ship to pick up the scientist, while sending a small attack force to distract the Imperials from noticing and gave him to the leader of the Nami Ali Tarrak. She used the scientist to help her create more TIE Defenders and decided to proliferate the ships, in particular to the Rebels."}, {"tag": "p", "text": "Thrawn in response developed and deployed his latest project, the Missile Boat to police the proliferation and bring it under control. After finding Tarrak's Deep Space Manufacturing Facility Tarrak and destroyed it, Ali Tarrak abandoned the factory in a Corellian transport Dhoora taking the scientist with her. When Stele attack the transport she warned to stay back or the scientist dies, but the Secret Order of the Empire saw through her bluff and with the help of Stele, Assault Gunboats disabled the transport and captured Ali Tarrak and the scientist as the ship was programmed to a course for Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The scientist is discussed in the 1994 PC game Star Wars: TIE Fighter and becomes a central plot of both the T/D Technology and New Threats battles. Throughout the game the scientist is usually referred to his title and his gender is only brought up once in Battle 11 Mission 1 by the Imperial briefing officer."}, {"tag": "h2", "text": "Appearances"}]}