{"url": "Unidentified_Tatooinian_alphabet", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Alphabets", "Category:Culture of Tatooine", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Unidentified Tatooinian alphabet"}, {"tag": "p", "text": "An alphabet was used on the planet Tatooine by the year 24 BBY, when that world was under the domination of Hutt crime lords such as Jabba Desilijic Tiure and Gardulla Besadii the Elder. It comprised twenty-six letters, each of which had its exact equivalent in the High Galactic alphabet. During the Galactic Civil War, it also saw use on Talus, in the Corellian system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "That alphabet was designed by Eric Larson when the Special Edition of the Star Wars original trilogy came out in 1997. At the time, the PepsiCo food corporation and its subsidiaries created several collectible promotions to coincide with the release. Among those were the pizza boxes for Pizza Hut, which featured secret messages written in a cipher called \"Jabba's alphabet.\" The code key was provided in the box. Larson stated that he based his alphabet on a modern Hebrew font after noticing similar markings on the original prop of Han Solo frozen in carbonite."}, {"tag": "p", "text": "In July, 1999, two fans known as \"Mike Dolan\" and \"Tommy of Escondido\" crafted a typeface reproducing Eric Larson's Huttese alphabet. That font was originally available at Geocities.com under the name \"Trade Huttese.\""}, {"tag": "p", "text": "In the 2002 video game Star Wars: Racer Revenge, that alphabet was used in the podracer selection menu. With the diversity of the playable characters' names, the entire alphabet was featured in the game, and the mapping corresponds both with Larson's and that of the \"Trade Huttese\" typeface."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}