{"url": "Beadle_Lubboon", "categories": ["Category:Legends articles", "Category:Duros", "Category:Males", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Beadle Lubboon"}, {"tag": "p", "text": "Beadle Lubboon was a male Duros who lived during the Republic Dark Age. He was the son of Lubboon and an unidentified Duros woman. Beadle was raised by his parents on the planet Darkknell, which had become the capital world of the Sith Lord Daiman's domain known as the Daimanate. For much of his childhood, Beadle lived under Sith rule. Throughout his youth, the adolescent Lubboon maintained a reputation for being careless and clumsy. Despite these character flaws, Beadle had a good and likeable nature."}, {"tag": "p", "text": "In 1032 BBY, Beadle's life underwent an important change when he became a mercenary working for Rusher's Brigade, one of the many independent mercenary operations during the New Sith Wars. Beadle's father supplied the Brigade's leader Brigadier Jarrow Rusher with starship parts. In exchange, Beadle was recruited into Rusher's Brigade and became a crew member on Rusher's troopship Diligence. Through his involvement in Rusher's Brigade, Beadle became locked into Lord Daiman's plot to eliminate his estranged older brother Odion. Around the same time, Daiman had lost his premier military research installation following a bomb attack engineered by the Jedi Knight Kerra Holt, a perennial Sith foe."}, {"tag": "p", "text": "Following the capture of an undercover Odionite operative Narsk Ka'hane, Daiman came to suspect that Odion was behind the bombing. In retaliation, he concocted an elaborate scheme to lure Odion into a trap on Gazzari. Daiman purchased an arxeum—university specializing in war sciences—from the Bactranate, a neighboring Sith state. He also recruited a thousand students for the university from throughout the Daimanate who would serve as bait during the attack. Finally, Daiman enlisted the services of several mercenaries including Rusher's Brigade. These mercenaries would set up their positions around a volcanic caldera. When Odion's forces landed, they would then open fire on them. Daiman's main forces and fleet would then emerge from hyperspace, trapping Odion and his forces."}, {"tag": "p", "text": "During the Battle of Gazzari, Lubboon served as a Trooper and saved the life of Rusher's helmsman Ryland Dackett. Rusher's Brigade sustained heavy losses during the battle with almost five-sixths of the mercenaries being wiped out. Near the end of the battle, Rusher encountered the Jedi Knight Kerra who had managed to evacuate the Daimanate students from the battlefield. After a lengthy argument, she convinced Rusher to evacuate the student refugees which Rusher obliged on the condition that they were dropped off upon arriving at their next destination. Following their escape from Gazzari, Beadle became good friends with Kerra and the Sullustan refugee Tan Tengo. Due to his junior position, he was assigned with helping Kerra attend to the need of the student refugees aboard the Diligence."}, {"tag": "p", "text": "Following a long and arduous voyage, the Diligence ended up on Byllura, a Sith world that was controlled by the Dyarchy, a minor Sith princedom. While exploring Byllura, Beadle and Tan were captured by the Unifiers, red-clad Sith adepts. Kerra pursued their captors and her actions culminated in the collapse of the Dyarchy. He and Tan managed to escape after Kerra convinced the enslaved Celegian know as \"One\" to rebel against his Sith master Regent Saaj Calician. Soon, One's Celegian comrades also rebelled and their actions led to the collapse of the Dyarchy's telepathic network, destroying the Dyarchy."}, {"tag": "p", "text": "Shortly later, Byllura was annexed by the Arkadianate, another Sith state ruled by Arkadia Calimondra, the older sister of the Dyarchy's former twin rulers Dromika and Quillan. Arkadia publicly extended her hand of friendship to the beleaguered crew and passengers of the Dyarchy. She also offered to shelter the student refugees\nin the Arkadianate where they would be integrated as loyal Arkadianate subjects. During his time in the Arkadianate, Lubboon accompanied Rusher and Kerra to the Arkadianate capital city of Calimondretta on the icy planet of Syned. However, Arkadia proved to be duplicitous when she tried to coerce Kerra into assassinating her grandmother Vilia Calimondra, the matriarch of the Calimondra family and the instigator of the Second Charge Matrica which had devastated the Grumani sector."}, {"tag": "p", "text": "In response, the Bothan spy Narsk Ka'hane, who secretly worked for Vilia, devise a counter-plot to foil Arkadia's plans and helped Rusher and Kerra escape from the Arkadianate. Prior to the Siege of Calimondretta, Lubboon returned Narsk's stolen Cyricept Mk VI stealth suit and smuggled Kerra's lightsaber an enviro-suit. In return for getting back his stealth suit, Narsk helped Kerra escape from her prison and supplied her and Rusher with hyperspace coordinates leading to neutral space. Following their successful escape from Syned, the Diligence reached the Galactic Republic where the Gazzari refugees would be looked after. Following his adventures in Sith Space, Beadle chose to stay with Rusher's Brigade."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Beadle Lubboon was a male Duros who grew up on the planet Darkknell during the Republic Dark Age, the last century of the New Sith Wars. At that time, Darkknell was ruled by the Sith Lord Daiman, one of the thousands of Sith warlords that had emerged in the galaxy following the collapse of the New Sith Wars. Following the Charge Matrica which began in 1066 BBY, Darkknell had been ruled by the Sith Lord Chagras, the titular ruler of the Chagras Hegemony. Following his death in 1040 BBY, the Chagras Hegemony split into several feuding states including the Daimanate. During this period, Daiman created a personality cult that revolved around himself as the \"Creator\" of the Universe. He believed that all other sentient beings, whom he dubbed the \"Encumbered\" were little more than automatons created to serve his will. During this period, the various Sith Lords of the Grumani Sector fought a succession struggle over control of the region known as the Second Charge Matrica."}, {"tag": "p", "text": "Lubboon lived in Xakrea, the planet's largest city and the capital of the Daimanate. Beadle was the son of the Administrator Lubboon and an unidentified Duros woman. His father Lubboon Senior was the first Duros to be appointed appointed as the manager of Xakrea's Plasteelworks, a relatively comfortable position within Daimanite society. During his teenaged years, he was regarded as being tall for his age group and worked as a laborer in the Daimanate's war forges in Xakrea. During his childhood, the young Beadle developed a reputation for being clumsy and nervous. While his family was relatively well-off by the standards of Sith Space, they still lived in a small crowded apartment as with many other residents of Darkknell. As with many other Daimanate subjects, he was required to work for long shifts at a factory."}, {"tag": "h3", "text": "Recruitment"}, {"tag": "p", "text": "In 1032 BBY, Beadle Lubboon's life changed when he was recruited as a mercenary by Rusher's Brigade, one of the many independent mercenary operations operating in Sith Space. The Brigade's leaders Human Brigadier Jarrow Rusher and his helmsman Ryland Dackett visited Lubboon Senior's plasteelworks to purchase six new hydraulic drives for his troopship Diligence's offloading lift assemblies. These hydraulic accumulators enabled starships to lift-off planetary locations prior to embarking on their travels. Rusher ran an independent mercenary operation known as Rusher's Brigade, which worked for several different warlords.Wanting a better life for his son outside his position as a laborer, Lubboon Senior persuaded Rusher to recruit and train his son as a mercenary."}, {"tag": "p", "text": "Lubboon's mother also added that she wanted her son Beadle to be in a place that \"challenged\" his skills and talents. Rusher offered to train the teenaged Duros as either a gunner in one of his artillery units or an administrative personnel within his headquarters unit. Rusher also claimed that his operation had no shipboard fatalities due to a stringent policy that banned any Sith from his troopship Diligence. While his parents were conversing with Rusher and Dackett, Beadle himself entered the room, having finished his work shift. To the embarrassment of his parents, Beadle leaned against a cart carrying several pails of dirty water which toppled over."}, {"tag": "p", "text": "In the ensuing watery mess, Beadle ended up with a barrel stuck to his head and took almost a minute to remove it. His clumsiness gave a poor first impression to his recruiters. Dackett silently commented to Rusher that it would be best for the Duros youth to be assigned to the headquarters unit, which was considered to be a soft posting. Rusher concluded that Beadle would probably be lucky not to take out an entire ammo magazine. After Beadle had extricated himself from the mess, Rusher assured Beadle that war was not a \"talent show.\" After receiving assurances that his son's well being would be looked after, Lubboon Senior allowed Rusher to enlist his son as a new recruit in Rusher's Brigade."}, {"tag": "p", "text": "Rusher then attempted to purchase a new hydraulic accumulator unit from Lubboon Senior's plasteelworks. However, Administrator Lubboon was unable to sell the technology to Rusher since all produce at his factory was only sold to Daiman. Rusher was able to negotiate their purchase by claiming that he was working for Daiman. After finishing the transaction, Beadle accompanied his new employers Rusher and Dackett back to their flagship Diligence which was undergoing repairs at the city's spaceport. The Diligence had been a former Devaronian spaceliner that had been mounted on top of two massive retro-rockets attached on either side of its hull. Each of these engines was at the center of a cluster of four large cargo modules."}, {"tag": "p", "text": "Beadle's first assignment as a Trooper aboard the Diligence was to fasten rigging around a hydraulic accumulator unit that was being installed onto the vessel. Despite his assurances that he was familiar with operating such machinery, Beadle did not fasten the heavy unit properly which caused the accumulator unit to break lose. After apologizing, the Duros youth went to a refresher unit to attend to his own needs. While completing repairs to the Diligence, Brigadier Rusher received a messaged from a holographic statue of Lord Daiman instructing him to attend an audience at the Sanctum Celestial, the Sith Lord's private palace in Xakrea."}, {"tag": "h3", "text": "Daiman's Plot"}, {"tag": "p", "text": "Through his new job at Rusher's Brigade, Beadle became caught up in the complexities of the Second Charge Matrica, a succession struggle that had devastated much of the Grumani sector. In 1032 BBY, Daiman's researchers had been developing a new prototype warship known as the Convergence at the Black Fang research facility in Xakrea, main city on Darkknell, the Daimanate's capital world. However, Daiman's enemies—his estranged older brother and Sith Lord Odion and the lone Jedi Knight Kerra Holt obtained intelligence on the Convergence project and sought to sabotage it. Odion dispatched the Bothan spy Narsk Ka'hane to obtain its military secrets and to destroy the complex. Meanwhile, Kerra also sought to destroy the complex in order to sabotage the Daimanate's war effort. During the Darkknell mission, Kerra intercepted Narsk and destroyed the datapad containing the data before destroying the building with baradium thermal charges. The ensuing explosion damaged parts of Xakrea. She then stole Narsk's Cryricept Mark IV stealth suit and left him behind in a rubbish bin to be captured by Daiman's Correctors, his main internal security force."}, {"tag": "p", "text": "Narsk was subsequently found by Daiman's Correctors and taken to a station where he was interrogated and tortured. Daiman and his Correctors quickly identified Narsk as a foreign undercover agent and coerced him into confessing that he had destroyed the Black Fang research installation, the Daimanate's main military think tank. However, Narsk refused to disclose the identity of his employer. Despite Narsk's denials, Daiman rightfully suspected that Odion had a role in the bombing and concocted a scheme to lure Odion into another trap on Gazzari. Daiman approached the Bactranate Quermian Sith Lord Ayanos Bactra with an offer to buy an arxeum—a mobile university dedicated to war research—from Industrial Heuristics. In exchange, Daiman offered to provide the students for the university who would be transported to the planet on four transports provided by the company."}, {"tag": "p", "text": "The transaction would occur on Gazzari and he promised Bactra's forces safe passage to the Gazzari system. Daiman later contracted the services of several mercenaries including the Brigadier Jarrow Rusher and convinced to set up a trap on Gazzari. As part of the battle plan, the mercenaries would assemble their forces including several large artillery cannons around a massive caldera. Prior to the battle, Bactra's arxeum and the student transports would land within the caldera. Odion's forces would then invade Gazzari and the mercenaries would hold them at bay until Daiman's regular forces and attack fleet emerged from hyperspace. Daiman then planned to trap Odion's forces on Gazzari and kill his estranged older brother once and for all. While Rusher was initially concerned about using the children as decoy targets, he reluctantly cooperated after Daiman choked him with the Force. At the same time, Kerra infiltrated Daiman's palace the Sanctum Celestial where she attempted to assassinate him. However, she changed her mind when she learnt about Daiman's plot."}, {"tag": "p", "text": "As part of his trap, Daiman arranged for Narsk to listen to the proceedings and then to escape back to the Odionate with the assistance of Kerra. Unknown to all the participants, Daiman had intentionally allowed Narsk to escape in order to lure Lord Odion into his trap on Gazzari. Meanwhile, Kerra stowed aboard Daiman's flagship the Era Daimanos and hitched a ride to Gazzari. As planned, the nihilistic Lord Odion saw the Gazzari deal as an opportunity to wreck further bloodshed and destruction. Despite Narsk's suspicions that this was a trap, the Sith Lord was undaunted by Daiman's plot and instead dispatched a sizeable fleet to invade the planet."}, {"tag": "h3", "text": "The Gazzari Trap"}, {"tag": "p", "text": "As a member of Rusher's Brigade, Beadle would participate in the Battle of Gazzari. Prior to the battle, Rusher's forces set up their positions around the caldera. During the preparations for the ambush, Beadle was assigned with the job of operating a tracked power-loader vehicle. However, he got the vehicle stuck in a mire of mud which only reinforced his reputation for clumsiness and incompetence. While Brigadier Rusher regarded the new recruit as a disappointment, he sensed that the Duros teenager's true talent was stealth. Shortly afterwards, Bactra's arxeum landed in the caldera. This was quickly followed by the arrival of Bactra's four transports carrying over a thousand children and adolescents which then landed about a kilometer to the west of the mobile university."}, {"tag": "p", "text": "The Brigadier Rusher observed these developments and then ordered his forces to prepare to open fire in the event that Odion's forces arrived. He also warned his mercenaries not to shoot any of the arxeum students and threatened to personally strap anyone who disobeyed that order to the artillery cannon \"Bitsy\" and fire it. As expected, Odion's ground forces landed in the caldera. His forces included a massive siege platform known as the Death Spiral which also ferried large numbers of airspeeders, speeder bikes, walkers, and troops directly to the frontline. Rusher's forces opened fire on Odion's personnel and vehicles."}, {"tag": "p", "text": "The Death Spiral meanwhile continued to rain fire on Daiman's forces, and disabled many of Rusher's Kelligdyd cannons. Several of Rusher's battalions including Serraknife, Flechette, Sat'skar, and Rantok Battalions were wiped out during this onslaught and the Brigadier was forced to find a safe route to evacuate his forces back to the Diligence. Meanwhile, the ship's helmsman Ryland Dackett took a recovery team into the battle zone in an attempt to rescue survivors and to salvage equipment. By that stage, Lord Odion himself had arrived on Gazzari and his presence caused the troops on the battlefield to act recklessly, even suicidally."}, {"tag": "p", "text": "During the Battle of Gazzari, Beadle Lubboon used a cargo crawler to haul a Kelligdyd 25 cannon into the battlefield. Unknown to the Duros trooper, this cannon had been earlier damaged on Whinndor. Beadle would later recall this episode as a frightening experience. At that point, Rusher received a distress transmission from Dackett's team that the helmsman had been wounded. In fact, the Diligence's helsman had lost one of his arms. The Brigadier then contacted Beadle and ordered him to rescue Dackett. After traversing for half a kilometer of rocky terrain, Beadle managed to locate Dackett and placed him on a makeshift stretcher that was attached to the cargo crawler. After Beadle and Dackett arrived back at the Diligence, Rusher ordered a general retreat, using the battalions on either side of the Diligence to protect the ship and the forces returning to it."}, {"tag": "p", "text": "Beadle would accompany the wounded Dackett up the ship's ramp into the medical bay for treatment. Meanwhile, the Jedi Knight Kerra surfaced during the battle and helped lead the trapped arxeum students to safety while killing several Sith troops. She had also succeeded in destroying the Death Spiral by sending a speeder bike rigged with baradium explosives into the siege platform's hangar bays. The resulting explosion ignited the siege platform's massive ammunition stocks and turbolaser cannons, destroying a key Odionite military asset. She then led the arxeum students to the Diligence. After a lengthy argument, she persuaded Brigadier Rusher—who had lost five-sixths of his forces—to allow her student refugees aboard the ship. Rusher reluctantly agreed but planned to drop of the refugees on their next destination."}, {"tag": "h3", "text": "Rusher's Ark"}, {"tag": "p", "text": "Beadle Lubboon survived the Battle of Gazzari and managed to escape Gazzari aboard the Diligence. Their escape coincided with a new startling development in the Second Charge Matrica, the contest between the local Sith Lords of the Grumani sector that had ravaged the region for the past eight years since the death of Chagras had caused the collapse of the Chagras Hegemony. The Calimondra family matriarch Vilia Calimondra, the grandmother of these Grumani Sith Lords, had decided that the Bactranate ruler Lord Bactra had outlived his usefulness. She ordered her grandchildren to invade the Bactranate and promised to divide the spoils among her family during the next bequest session. She ordered the Bothan spy Narsk Ka'hane to deliver her message to Odion and Daiman."}, {"tag": "p", "text": "After the destruction of the Death Spiral, Narsk was able to carry out his orders. The two warring Sith factions quickly abandoned their fighting and turned on Bactra's ships, destroying half of the Quermian's flotilla in under a minute. Amidst the fighting, the Diligence, carrying Rusher, Holt, and the arxeum students, made for space. Nevertheless, the Diligence survived the onslaught as Bactra's forces fled to hyperspace, and Daiman and Odion ordered their fleets to invade the planet Jutrand, Bactra's capital. As the forces of all three Sith Lords made for Jutrand, the Diligence, too damaged to continue fighting and carrying over a thousand students seeking refuge from the battle, fled into hyperspace, making six jumps to evade any pursuers."}, {"tag": "p", "text": "The subsequent voyage to Byllura, the nearest known planet, would be remembered by most of the participants as an unpleasant and hectic experience. The large number of student refugees aboard the Diligence created a serious overcrowding problem since there were insufficient facilities and beds to accommodate all the refugees. The Diligence's accommodation problems were further compounded by the lack of adequate numbers of refreshers since the former liner had been designed for male Devaronians. The diverse interspecies mix of the student body also proved volatile due to the vast physiological and cultural differences between individuals from different species. Due to his relatively junior position within Rusher's hierarchy, Beadle Lubboon was the sole member of the crew to be assigned by Rusher to help Kerra."}, {"tag": "p", "text": "Despite the difficulty of this task, Beadle was not known to have expressed any resentment towards Kerra but apparently accepted his role calmly. By contrast, most of the other crew were hostile and indifferent towards the newcomers since many of the arxeum refugees were sleeping in bunks that had been used by their fallen comrades. During the voyage, Dackett conducted a headcount of the crew and passengers aboard the Diligence which found that there was a total of 1,717 individuals on the vessel. Meanwhile, only 560 of Rusher's original crew of three thousand had survived and were re-organized into two battalion-sized units: Team Ripper and Team Zhaboka."}, {"tag": "p", "text": "After several days of traveling through hyperspace, the Diligence finally arrived in the Bylluran system. Due to a lack of reliable navigational information, the Diligence's crew had been unable to find a hyperspace route that would lead them to the Republic. Thus, Rusher was forced to settle for Byllura. While there was little extant information about the political situation in Byllura, there were rumors that Byllura was a Sith principality ruled by children with a regent running the realm on their behalf. According to one of Rusher's friends who had visited the planet, they had been in power for at least five years. As events unfolded, these rumors were confirmed to be true."}, {"tag": "p", "text": "Byllura was indeed home to the Dyarchy, a Sith realm that was the home of Quillan and Dromika, the younger children of the late Chagras, the former ruler of the Chagras Hegemony. These two Sith twins had a powerful affinity with the Force; with Quillan having a powerful farsight ability while Dromika could send out strong hypnotic commands that would compel other sentients to do her bidding. Under the guidance of their Regent Saaj Calician, the twins had used their Force abilities and a network of enslaved Celegians to directly impose their will on the inhabitants of the Dyarchy, turning their subjects into thralls."}, {"tag": "h3", "text": "False Paradise"}, {"tag": "p", "text": "Beadle Lubboon's actions on Byllura would inadvertently set the stage for a chain of events that would bring about the complete collapse of the Dyarchy. As the Diligence entered into the atmosphere above Byllura's capital city Hestobyll, Kerra and Jarrow were relieved to encounter no resistance. Jarrow was granted permission to land via commset by an unidentified individual dubbed \"Deep Voice\", who was actually the Celegian \"One\". Upon arriving at their allocated hangar platform, they were surprised to find that there was no welcoming party. Believing Byllura to be a safe destination free of any Sith presence, Rusher ordered the crew to deploy its cargo ramps to allow the refugees to disembark. However, he was opposed by Kerra who insisted on conducting a proper reconnaissance probe of Hestobyll before allowing the passengers to disembark. This sparked another argument between the young Jedi Knight and the mercenary leader which ended in a compromise when Kerra managed to get Jarrow to give her one hour to do a proper recon probe of Hestobyll in exchange for returning the refugees onboard the Diligence."}, {"tag": "p", "text": "However, the Diligence's landing was being monitored by the enslaved Celegian \"One\" who had transmitted the information back to Calician. While Calician was aware that the ship's captain had indicated a readiness to off-load his passengers on Byllura, he became suspicious about a potential threat to the Dyarchy when an unidentified person (later revealed to be Kerra) got the student refugees to reboard the ship. Calician suspected that this was a Daimanate trick and quickly dispatched a contingent of Unifiers to investigate the Diligence under direct orders from Dromika, who was in turn being telepathically controlled by her twin brother Quillan. Still, Calician regarded the arrival of the Diligence as an opportunity to hasten his plans for galactic domination, beginning with several of Daiman's unguarded systems."}, {"tag": "p", "text": "Despite Rusher's orders that the passengers remain on the vessel, the Sullustan girl Tan sneaked out of the ship, determined to follow Kerra who she idolized. In response, Rusher sent Beadle Lubboon to bring her back. Rusher had intended to leave Lubboon behind with Kerra since he regarded both of them as a liability. An hour later, the Diligence received another transmission from \"Deep Voice\" on the commset that the Byllurans had seen the refugees on the platform and were sending people to help with their situation. According to \"Deep Voice\", the refugees would supposedly be \"directed to a center for assigning quarters.\" Seeing it as an opportunity to get rid of the refugees, Rusher contacted Kerra but the Jedi remained distrustful."}, {"tag": "p", "text": "After an hour, Kerra encountered both Lubboon and Tan. The Duros soldier was physically unfit and had struggled to keep up with the young Sullustan girl during their journey through the streets of Hestobyll. Kerra was initially angry at the Sullustan girl for disobeying her orders. Both also attended to the exhausted Lubboon with Tan asking Kerra if she had Jedi healing powers. Kerra responded that her solution would be to make the Duros run laps everyday. The three travelers then became caught up in a large crowd heading towards one of the hexagonal silos."}, {"tag": "p", "text": "In an attempt to find out about the situation on Byllura, Kerra pulled aside an elderly Duros but he did not understand Galactic Basic Standard. Despite his Duros ancestry, Lubboon was unable to help because he did not speak Durese. However, Kerra quickly realized that language was not the issue but rather he could not respond because he was being controlled by external forces. After observing the silent and uniform movement of the crowd walking towards the silo, Kerra would conclude that the people of Hestobyll had been reduced to thralls by mental suggestions from unidentified Force users. Kerra thus concluded that the Sith rulers on Byllura were directly imposing their will on the masses. As they moved nearer towards the silo, they discovered that a network of Celegians was being used to transmit these Force-induced mental commands."}, {"tag": "p", "text": "As they traveled through the streets, Kerra tried to warn Beadle and Tan to stay together. However, the travelers were separated by the crowd. Both Beadle and Tan succumbed to the effects of the Force-induced mental manipulations, and were drawn towards following the flow of the crowd. At that point, a party of \"Scarlet Riders\" arrived in airspeeders. They used Force persuasion to coerce the various people within the crowd into complying with the Dyarchy's orders. Two Scarlet Riders also arrested Lubboon while a third captured Tan. The Sullustan girl and the Duros youth were then led them into an airspeeder which quickly departed for the Loft, the Dyarchy's headquarters. In an attempt to save her two charges, Kerra attacked the Scarlet Riders and embarked on a pursuit through the streets of Hestobyll. This pursuit would end at the Loft, a palace built on a rock opposite the harbor. The Loft was home to the Dyarchy's twin rulers Quillan and Dromika, and their Regent Calician."}, {"tag": "p", "text": "Kerra also managed to warn Rusher in time to bring most of his crew back aboard the Diligence, minutes ahead of the arrival of another party of Unifiers dispatched to the spaceport. The Unifiers captured several members of Rusher's crew including shipmaster Dackett and Novallo who had been making external repairs to the ship on the landing platform. However, Rusher and the crew managed to fight off the attackers. After wiping out the Scarlet Riders and destroying their airspeeders, he then rescued his captured crew. With the Dyarchy's fleet lifting into space from their underwater hangar bays beneath Hestobyll's reflection pools, Rusher ordered the Diligence out to sea and away from the chaos."}, {"tag": "h3", "text": "Escaping the Dyarchy"}, {"tag": "p", "text": "Following their capture, Beadle Lubboon and Tan Tengo were brought into the Loft where they were imprisoned by the Unifiers. However, Kerra managed to infiltrate the palace compound and kill several of the Unifiers guarding the airspeeder hangar bay. By that stage, Calician and the Sith twins had been alerted to Kerra's presence and Dromika used her powers of mind control to compell Calician into destroying the \"Jedi intruder.\" Kerra eventually discovered a large chamber within the Loft which held a transparisteel cylinder containing the Celegian known as \"One.\" Kerra learnt that the elderly Celegian was being forced to coordinate Calician's mental web. She convinced him to rebel against her Sith masters and to stop working for them. Finally, Kerra instructed him to send one sentry to bring Beadle and Tan to the airspeeder hangar bay."}, {"tag": "p", "text": "One complied with Kerra's instructions and Beadle and Tan were released. Shortly afterwards, Kerra was captured by Calician and the two Sith twins. They attempted to force her to submit and join them. However, the Jedi Knight refused and the twins ordered Calician to execute her. Meanwhile, Beadle managed to start up an airspeeder. However, he was still an inexperienced driver and was only able to move the airspeeder in circles around the hangar bay. The Duros would later confess to Brigadier Rusher that he only knew how to accelerate and stop. The Sullustan girl Tan however waited at the ledge of the hangar bay's landing port."}, {"tag": "p", "text": "Shortly later, Brigadier Rusher and the Diligence arrived outside the Loft. The first thing that the Brigadier saw was the comical sight of Beadle struggling to keep the airspeeder afloat. Rusher then opened the Diligence's cargo deck hangar bay and contacted Luboon. When Rusher asked Lubboon why he picked up Tan but left Kerra behind, the Duros replied that he had only started the speeder before she could escape the palace and admitted that he did not know how to operate it. Rusher was about the reprimand the Duros trooper for losing his headset when Lubboon revealed that the Brigadier had already lent it to Kerra for her recon probe. When Rusher asked if Lubboon and Tan had killed those Scarlet Riders lying on the floor of the hangar bay, Tan explained that Kerra had already attacked the Loft after their arrival."}, {"tag": "p", "text": "Meanwhile, two of Rusher's soldiers leapt from the cargo deck into Lubboon's airspeeder and managed to take control of the airspeeder. Since Rusher was unable to land the massive Diligence on the Loft's hangar bay without its stowed cannon barrels jabbing the cliff wall, he told the Tan to wait while his men backed the airspeeder up so that they could rescue her. He instructed Tan to hop into the airspeeder when they reached her. However, Tan refused to go unless Rusher promised to retrieve Kerra as well. Tan revealed that Kerra was still inside the Loft and told him to go in after her. Rusher was initially reluctant to storm the Loft and rescue Kerra. However, he changed his mind after witnessing several droids being thrown out the window from the penthouse. At that point, Rusher realized that Kerra was trapped at the penthouse above the Loft."}, {"tag": "p", "text": "After rescuing Beadle and Tan, the Diligence flew to the Loft's penthouse. By then, Calician was about to execute Kerra with his lightsaber. However, an argument broke out among the Sith when Calician demanded that he be given the chance to kill the Jedi himself without the twin's mental influences. Kerra took advantage of their disagreement to break free and to wound Calician's leg tentacle. Kerra was then force to fight off the twins. At that moment, the Diligence used its heavy frontal gun emplacement to breach the penthouse's windows. In the ensuing chaos, Kerra discovered that Quillan was actually controlling Dromika and was using her to order Calician to carry out their bidding. Having realized this, Kerra kidnapped Quillan and brought him onboard the Diligence."}, {"tag": "p", "text": "Once aboard the Diligence, Quillan descended into an infantile tantrum since he was unable to sense his sister through the Force. Meanwhile, a distraught Dromika fell into a comatose state since she could not discern between a physical presence and a Force emanation. Rusher was initially angry with Kerra for bringing a Sith aboard, albeit an adolescent, since it violated his strict maxim of not taking any Sith Lords aboard as passengers. The Diligence then fled Hestobyll and managed to reach Byllura's upper atmosphere."}, {"tag": "p", "text": "The incapacitation of Quillan and Dromika would have enormous repercussions for the Dyarchy on Byllura. Bereft of its twin rulers, the highly-centralized fiefdom rapidly disintegrated into anarchy. Meanwhile, One successfully convinced his Celegian compatriots to rebel. They refused to send anymore telepathic messages and this led to the collpase of the entire telepathic network. The Celegian uprising made it impossible for Calician to co-ordinate the Dyarchy's manufacturing efforts. This created pandemonium among the enslave workers and a series of explosions caused by malfunctioning equipment destroyed several shipyards and munitions factories. With the collapse of the Dyarchy's telepathic network, the population emerged from their mentally-induced thralldom and quickly reclaimed their former cognizance and autonomy. Riots quickly broke out across Byllura's major centers including Hestobyll as the inhabitants vented out their fury on the old order.["}, {"tag": "p", "text": "Following the collapse of the Dyarchy, Byllyra was invaded by a fleet of Arkadianate warships led by their older sibling and Sith Lord Arkadia Calimondra. Arkadia's warfleet quickly disabled the Dyarchy's battleships and her flagship New Crucible captured the Diligence in its tractor beam projector. Arkadianate forces rapidly occupied Byllura and annexed the former Dyarchy. Following the battle, Arkadia took her younger brother and sister into custody but kept them separate from each other. Finally, Calician himself was executed by Arkadia's troops with the Bothan spy Narsk witnessing the execution."}, {"tag": "h3", "text": "Guests of Arkadia"}, {"tag": "p", "text": "Despite his clumsy disposition, Beadle Lubboon would still play an important role in helping the Diligence escape the Arkadianate. Following the Battle of Byllura, Arkadia Calimondra surprised Kerra and Rusher by welcoming them as guests and offered to provide shelter for the passengers aboard the Diligence. She also provided them with coordinates to her capital of Syned, a remote icy planet in the fringes of the Grumani Sector. While Kerra was initially apprehensive, Rusher accepted the offer because the Diligence was already overcrowded and running low on supplies. There, Arkadia convinced Kerra and Rusher to hand over her brother Quillan into her custody."}, {"tag": "p", "text": "After some discussion, Kerra and Rusher complied and returned aboard the Diligence to bring Quillan. They were then transported to her capital city of Calimondretta by a trundle car that had been provided by Arkadia. For this visit, Beadle Lubboon and Tan Tengo also accompanied Quillan. Despite his clumsy nature, Rusher had brought Trooper Lubboon along for this meeting since he wanted to give the impression that they were not a threat to Arkadia. While Beadle pushed Quillan's brown hoverchair, Tan had been permitted by Kerra and Rusher to join them since they needed her to calm the adolescent Sith Lord. After the meeting, Arkadia's aides took Quillan into custody. Satisfied with her guests. Having gained the trust of her guests, Arkadia then organized three separate tours of her capital city Calimondretta."}, {"tag": "p", "text": "The friendly Herglic mother Seese was assigned to Kerra while the Twi'lek manager Warmalo was assigned with supplying Brigadier Rusher with food supplies. Meanwhile, Arkadia herself led Trooper Luboon and Tan on a tour of her city. During the tour, Beadle lived up to his clumsy reputation and tripped on an escalator that had been specially designed for Herglics, a large species of cetaceans. While Beadle survived without any serious injuries, his forehead was grazed. While Arkadia did not witness the incident, she was later told by witnesses that it was an interesting incident. Beadle subsequently received medical treatment. While his clumsy disposition helped convince Arkadia that Rusher's mercenaries were not a threat, she gained a bad impression of Rusher's Brigade and declined to hire Rusher's services, claiming that she was not interested in \"specialists\" since it conflicted with her policy of continually assigning her subjects to different jobs."}, {"tag": "p", "text": "Despite her warm reception, Arkadia's tours were in reality a propaganda stunt used to promote a favorable image of the Arkadianate. She succeeded in convincing both Tan and Rusher that the Arkadianate was a utopian paradise. After impressing the Sullustan girl with Calimondretta's well-run Promisoriums, she offered to give the Gazzari students a new home in her realm. There, they would be educated and trained as \"loyal\" Arkadianate subjects. Arkadia also used her scholarly outlook and feminine charms to win over Rusher. Rusher was impressed by the ample supplies of food on Syned. The lone voice of dissent was the Jedi Kerra Holt who distrusted Arkadia and her motives. She rightfully suspected that Arkadia was trying to use them to serve her own means."}, {"tag": "p", "text": "Following the tour, Beadle and Tan returned aboard the Diligence on an icecrawler carrying food supplies. Meanwhile, Kerra and Rusher remained behind for a meeting with the Sith Lord. Arkadia summoned Kerra for a private audience at her museum. There she revealed that the Sith Lords in the Grumani sector were related to each other and that the enigmatic Vilia Calimondra was their grandmother. Vilia had also orchestrated two succession conflicts known as the Charge Matrica and the Second Charge Matrica in order to preserve her own rule by keeping her children and grandchildren preoccupied with fighting each other. Arkadia expressed her desire to end this power struggle by assassinating Vilia. She attempted to recruit Kerra as an assassin but the Jedi Knight refused and Arkadia had her imprisoned."}, {"tag": "h3", "text": "Onward to the Republic"}, {"tag": "p", "text": "After the meeting, Arkadia demanded that Brigadier Rusher bring the Diligence's students in return for offering them a hyperspace lane leading out of the Arkadianate In reality, this route led to a black hole known as the Nakrikal Singularity. Arkadia also hired the Bothan spy Narsk Ka'hane to transport her younger brother Quillan to Vilia and then to assassinate both of her relatives. Unknown to everyone else, Narsk was secretly working for Vilia and received orders from his master to sabotage Arkadia's plans. After Arkadia and Kerra had departed, Narsk convinced Rusher not to follow Arkadia's orders and to help him escape Syned."}, {"tag": "p", "text": "In return for staging a diversionary attack, Narsk offered to provide Rusher with part of another set of hyperspace coordinates leading to neutral space. Narsk also promised to rescue Kerra and provide her with the remaining half of the coordinates. In the end, Rusher agreed to cooperate with Narsk and also return his stolen Cyricept Mk VI stealth suit. Prior to the planned Siege of Calimondretta, Rusher used an encrypted comlink to contact the Diligence. He planned to send one of his mercenaries to bring both Narsk's stealth suit and Kerra's lightsaber. Finally, Rusher would hijack an icecrawler and used it to attack Calimondretta from the inside. The assault would create enough chaos and confusion that would allow Narsk to escape Syned with Quillan."}, {"tag": "p", "text": "Due to his simple and unassuming personality, Trooper Lubboon was chosen for this task since Rusher rightfully believed that the Duros youth would not attract little attention from Arkadia's security forces. For this mission, Beadle donned an environmental suit and carried Narsk's Mk VI stealth suit in a pouch. He also managed to hide Kerra's lightsaber in the left sleeve of his environmental suit. If questioned by anyone, Beadle would claimed that he had sustained a broken arm. This ploy work and Lubboon succeeded in delivering Narsk's stealth suit during a preflight briefing session with Arkadia. For this mission to Vilia's secret planet, the Sith Lord had prepared a modified shuttle at Embarkation Station 7."}, {"tag": "p", "text": "As planned Lubboon departed for the infirmary by feigning a broken arm. Narsk then excused himself from the meeting on the pretext of performing a diagnostic check on his damaged stealth suit. At the infirmary, Lubboon handed the lightsaber to Narsk who then rescued Kerra from her prison. Kerra agreed to assist Narsk's plan by keeping Arkadia's soldiers preoccupied. Meanwhile, Rusher and his mercenaries hijacked the icecrawler and used it to transport two artillery cannons into Calimondretta. Rusher's mercenaries then attacked Calimondretta and caused extensive damage to Patriot Hall and Reflection Prospect. Meanwhile, Narsk and Quillan were able to escape Syned on the shuttle. Arkadia still believed that Narsk was still working for her."}, {"tag": "p", "text": "The Diligence also caused further damage to Arkadianate military assets by destroying two tractor beam emitters and several Arkadianate military warships. Arkadia had assembled a strike force to invade neighboring states in the event that Vilia was assassinated. The fighting also destroyed several chemical factories manufacturing the nerve toxin Chagras's Blood, which was made from processed Synedian alga. Meanwhile, Kerra fought Arkadia in a lightsaber duel but was no match for the Sith Lord who was an expert in wielding two lightsabers in combat. Beadle survived the fighting and manage to rejoin Brigadier Rusher, who commended him for his successful operation."}, {"tag": "p", "text": "Trooper Lubboon also informed Rusher that the Bothan spy Narsk had gone north to rescue Kerra. Based on Beadle's information, Rusher deduced that the Jedi woman was at either Patriot Hall or Arkadia's Museum. Since he had attached a tag to her lightsaber, Rusher was able to trace her signal to Arkadia's museum. He then sent the Diligence to fly over the museum to confirm that it was the top of a deep and massive dome. Rusher then used the cannon \"Bitsey\" to fire a precision shot at the museum. This damaged the museum but allowed Kerra to escape onto Syned's surface. There, she was recovered by Rusher who carried her aboard the Diligence."}, {"tag": "p", "text": "The Diligence's mercenary crew and passengers were also joined by around five hundred Arkadianite labourers wanting to defect to the Republic. One of these refugees was the Twi'lek Warmalo, the supply clerk who had earlier helped Rusher restock the Diligence's food supplies before being promoted to a metallurgist. However, Warmalo did not regard this as a promotion. He and the other refugees resented Arkadia's system of continually rotating her subjects through different jobs to maintain her grip on power. Following the Siege of Calimondretta, the Diligence departed for the Galactic Republic. Despite his risky adventures and experiences in Sith Space, Beadle Lubboon wanted to remain in Rusher's Brigade and was joined by several of Kerra's students."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite his dull and clumsy characteristics, Beadle Lubboon was also known for his friendly, honest, and loyal characteristics. He was also willing to follow orders from his superiors without challenging or grumbling about them. Lubboon was unwilling to undertake any assignment regardless of the level of difficulty and danger involved. These gradually earned him the trust and respect of his superior Jarrow Rusher, Ryland Dackett and Kerra Holt."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Beadle Lubboon was known among his peers and acquaintances for his clumsy and absent–minded demeanour. He was also physically unfit and would easily tire after physical activities like walking and running. While he was a member of the Duros species, Lubboon was unable to speak Durese since his parents lived on Darkknell, which was far away from the Duros homeworld of Duro in the Core Worlds. While he was not skilled at operating machinery, Lubboon was very proficient with stealth. He was able to infiltrate the Arkadianate capital of Calimondretta with a lightsaber hidden in his spacesuit. This enabled Rusher's Brigade along with Narsk Ka'hane and Kerra Holt to escape the Sith Lord Arkadia's realm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Beadle Lubboon first appeared as a minor supporting character in John Jackson Miller's stand-alone novel Knight Errant, which was first released on January 22, 2012. He has not appeared in any other Expanded Universe literature to date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}