{"url": "Unidentified_Trade_Federation_base", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Wookieepedia Featured article nominations", "Category:Alaris Prime locations", "Category:Settlements", "Category:Trade Federation military bases", "Category:Unidentified locations"], "nodes": [{"tag": "h1", "text": "Unidentified Trade Federation base"}, {"tag": "p", "text": "A base with a fortress was built by the Trade Federation on the moon Alaris Prime. It was constructed between 39 BBY and 36 BBY during the Trade Federation's illegal colonization of the moon. The base was maintained by eleven OX9 labor droids and commanded by SRAM-13. The base hosted several military buildings, including a troop center, a mech factory, and an airbase. It served as the main source of Federation activity during their war with Wookiee colonists for control of Alaris Prime. In the final conflict of the war, the Battle for Alaris Prime, the fortress inside the base was targeted by the Wookiee leader Chewbacca to rid the moon of the Trade Federation presence."}, {"tag": "p", "text": "Chewbacca and the Wookiees constructed a base near the Trade Federation and orchestrated their defense, facing attacks from SRAM-13's battle droids and fighters. Jedi Master Qui-Gon Jinn recommended the Wookiees focus on destroying the fortress to achieve their goal on removing the Trade Federation from Alaris Prime, and personally joined the Wookiees on the ground to see it done. The colonists built up their army to include pummels and fighters, which they used to bring down the base's defenses to let their infantry in. The pummels razed the fortress, and the Wookiees secured their control over Alaris Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Trade Federation base on the moon Alaris Prime was the source of the corporation's activity on the moon. The grass-covered base was built at the crest of a mountain and was surrounded by cliffs. A lake was north of the base, with a river around the east and south sides before flowing to the south. The river served as a natural barrier between the base and a nearby Wookiee settlement. On the northern area of the base, the space between the cliffs and the lake was covered in trees."}, {"tag": "p", "text": "The base itself was surrounded by a light wall with some portions blocked in by a natural wall of trees. The southern face of the wall had a gate from which a path led south to the river and was accessible by a ford. Two turrets were built to defend the gate, and an additional two guarded the ford. Another entrance lay on the western part of the base, with a large gap between the walls, in which a lone defensive turret was placed. The entrance could be accessed by a ford on the southern stretch of the river. The base contained several military buildings to support the Trade Federation Droid Army. It was run from a command center with eight farms surrounding it. An airbase was located near the gate, a mech factory was northeast of the command center, and northwest, a troop center was placed next to the wall. Near the troop center were various natural resources, including ore deposits, muja fruit bushes, and trees which could be harvested for carbon. Processing centers for ore, food, and carbon were built in that area."}, {"tag": "p", "text": "On the southeast side of the base there was a stockpile of nova crystals and a nova processing center to store them. At the northeast of the base lay a fortress, a building equipped with an autoturret, and anti-air capabilities. The fortress had a marker on each corner and had a gap in the wall around it. Two power cores were placed within the base to provide energy to the buildings. On the river an aquatic shipyard was built, and from it two utility trawlers caught and stored fish. Outside the walls a variety of sentry posts were placed to alert the Trade Federation of any incoming enemies. Mynocks lived in the base, and docile creatures such as nerfs and banthas resided on the outskirts. The resources at the base were gathered by eleven OX9 labor droids, and a C-9979 landing craft had landed near the command center."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The base was built during the Trade Federation's illegal colonization effort on Alaris Prime between 39 BBY and 36 BBY. It was commanded by the Droid Army member SRAM-13 and was the center of the Federation's operations on Alaris Prime. Their Trandoshan ally Pekt also operated at the base. During the war for the moon fought between the Trade Federation and the rightful Wookiee colonists in the Battle for Alaris Prime, the base was uncovered by Wookiee scouts. Following the destruction of other Trade Federation settlements, the base was targeted by the Wookiee leader Chewbacca and his Jedi advisor, Qui-Gon Jinn. They believed destroying the fortress there would drive the Trade Federation from Alaris Prime."}, {"tag": "p", "text": "The Wookiees established a settlement to the south of the Trade Federation settlement, and built up their defenses while SRAM-13 sent a group of beetle droids and a droideka to attack their sentry posts. SRAM-13 also sent three light droid starfighters to survey the Wookiee base. Eventually the Wookiees, led by Chewbacca, Jinn, Attichitcuk, and Shoran, launched their attack on the base. After destroying the turrets guarding the path to the base, the Wookiees sent in a group of starfighters; ten Agrs and three Heavy Blade bombers."}, {"tag": "p", "text": "The bombers destroyed the turrets and power cores inside the base while the fighters picked off the OX9s and any battle droids in the base, while steering clear of the fortress's anti-air missiles. With their path clear, the ground forces, including bowcaster troopers and sentinel strike mechs, marched into the base to clear it out. The Wookiees then sent in three energy pummels, which had enough armor to endure the fortress's autoturrets. The pummels razed the fotress, winning the battle for the Wookiees, although two Neimoidian transports flew from the ruins. Inside one of them was Pekt, who swore that he could still profit from Wookiee pelts as his transport flew away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Trade Federation base on Alaris Prime was first mentioned in Prima Games' strategy guide—released on November 7, 2001—for the LucasArts video game Star Wars: Galactic Battlegrounds. It appeared in the game when it was released on November 11, 2001. The base is the focal point of the final level of the Wookiee tutorial campaign, titled \"The Battle for Alaris Prime,\" in which the player claims victory by destroying the fortress. The player can choose to destroy the buildings in the base aside from the fortress, but it is not required to complete the level.  The strategy guide stated that there were battle droids inside the base, although none appeared in the game. Multiple options for invading the base are available in the game at the player's discretion. The strategy guide recommends destroying the turrets on the path to it with bombers or aquatic cruisers, and then using aircraft and pummels to bring down the walls and the fortress. The turrets begin the level as light turrets, but may be upgraded to medium turrets by the AI if they gather enough resources. Similarly, the AI may create a bio cannon and place it next to the fortress."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}