{"url": "Unidentified_Togruta_Padawan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Jedi trainees of the Jedi Order", "Category:Togruta", "Category:Unidentified females", "Category:Unidentified Jedi of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Unidentified Togruta Padawan"}, {"tag": "p", "text": "A female Togruta Padawan served under Jedi Master Mavra Zane in the Jedi Order and the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Togruta was trained in the ways of the Force by the Jedi Order. Studying at the Coruscant Jedi Temple as an Initiate,[source?] she ascended to the rank of Padawan after the Trade Federation's invasion of Naboo and the reemergence of the Sith. Assigned to a Jedi Master to continue training, she constructed a green-bladed lightsaber to wield throughout her career."}, {"tag": "p", "text": "In response to the Sith's reappearance the Jedi High Council announced that it would open several Jedi outposts across the galaxy for supplemental group training. Assigning the Padawan to Kashyyyk, the High Council placed Jedi Master Mavra Zane in command of her and a number of other students to travel to the Wookiee homeworld aboard a Consular-class cruiser. Upon the group's arrival, the students were greeted by Grand Master Yoda the Watchman of Kashyyyk, along with Masters Mace Windu and Obi-Wan Kenobi. Upon settling in at the new outpost, the classes quickly began and the Padawan's continued on their path to knowledge."}, {"tag": "p", "text": "During her time on the planet, the armies of the Confederacy of Independent Systems, combined with Trandoshan slavers, attacked the planet and the Wookiee village near the outpost."}, {"tag": "p", "text": "Rallying behind Masters Yoda and Zane, the apprentices were able to repel the Trandoshans with few casualties. Following Master Yoda's departure, the students were attacked again. This time, Master Zane and several students were captured."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Togruta Padawan appears during the Jedi Destiny portion of Kinect Star Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}