{"url": "Unidentified_Tof_Supreme", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Tofs", "Category:Unidentified males", "Category:Unidentified pirates"], "nodes": [{"tag": "h1", "text": "Unidentified Tof Supreme"}, {"tag": "p", "text": "The Supreme was a Tof pirate, and was in command of the invasion force during the Battle of Zeltros in 4 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Nagai–Tof War, Supreme was in charge of a Tof armada aboard the Wayfarer. His forces were assigned to hunt down and kill Nagai that were fleeing from their homeworld. It was this assignment that led Supreme and his men to the planet of Zeltros, following a Nagai armada made up of Nagai commandos and their allies, the Maccabrees."}, {"tag": "p", "text": "Supreme's forces landed outside the main Zeltros city and made their way toward the unsuspecting Nagai. On the way there, Supreme's men took notice of a Zeltron kitchen where several Hiromi were celebrating their \"capture\" of Luke Skywalker. The Tof broke down the door and began to brutally interrogate the Hiromi. Realizing that the Hiromi were no threat, Supreme ordered his men to continue to search the city for the Nagai."}, {"tag": "p", "text": "In a stroke of luck, one of the Tof patrols captured Den Siva, the leader of the Nagai invasion force on Zeltros. Siva had also captured two Alliance members, Leia Organa and the Zeltron Dani. At the same time, another patrol captured Rahuhl, Marruc, Jahn, and Bahb, four Zeltron youths who were also acting as Leia's unofficial bodyguards. The veracity with which the Zeltron fought their Tof captors intrigued Supreme and he sent the four Zeltrons to the Wayfarer to be personally interrogated by him later."}, {"tag": "p", "text": "After the four Zeltron had been taken away, Supreme ordered Siva to bring an armada of his men to the Nagai rendezvous spot. Siva initially refused, but when Supreme threatened to kill Dani, Siva relented. Den had become infatuated with the young Zeltron woman and could not bear to have her killed, and so he agreed to lead the remainder of his Nagai squadron into an ambush. Supreme put his second in command, the Tof Bargthron, in charge of Siva and a force of Tof warriors to deal with the remaining Nagai."}, {"tag": "p", "text": "Supreme continued setting up base near the Zeltros kitchen, but he soon encountered another obstacle. A multitude of hoojibs began to disrupt the Tof force by draining the energy out of their blasters. The Tof found this as an entertaining diversion, as they took to trying to hit the little rodents with their clubs. However, this diversion distracted the Tofs away from the real threat, the Jedi Luke Skywalker. Wielding two lightsabers, the Jedi began to beat back the Tof and killing several of them, apparently including Supreme. With their command force defeated the Tof ground forces were easily mopped up by the newly allied Nagai and Alliance forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Supreme's name is not mentioned in his first appearance in Star Wars 105: The Party's Over, but the Tof on board the Wayfarer mention their leader's name as Supreme and that he was going to interrogate the four Zeltron youths personally, just as the Tof leader had promised in The Party's Over."}, {"tag": "p", "text": "In Star Wars 105: The Party's Over, Luke ends up capturing three Tof, but since all three of the Tof are bearded and Supreme is not, It is inferred that Supreme was killed in the short battle between Skywalker and the Tof forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}