{"url": "Unidentified_Tusken_Raider_tribe_(Jedi_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Tusken Raider groups"], "nodes": [{"tag": "h1", "text": "Unidentified Tusken Raider tribe  (Jedi Civil War)"}, {"tag": "p", "text": "A tribe of Tusken Raiders lived on the planet Tatooine during the Jedi Civil War. Around 3956 BBY, they were based in an Enclave within the Dune Seas of Tatooine, southwest of Anchorhead."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Czerka Corporation had been encountering difficulties with many Sand People tribes attacking their miners and disrupting their operations. This tribe in particular, however, was the most aggressive. It seemed to Czerka that the chieftain wanted to wage war against them."}, {"tag": "p", "text": "At some points this tribe had kidnapped three Jawas and a Twi'lek named Griff Vao."}, {"tag": "p", "text": "In 3956 BBY, Revan and the crew of the Ebon Hawk arrived on the desert world to locate a Rakatan Star Map. Czerka offered Revan a hunting license to enter the Dune Sea if he would kill the chieftain and present his gaffi stick. However, following the advice of a Duros conservationist named Dayso Cooh, the Jedi opted for a peaceful solution."}, {"tag": "p", "text": "Revan was able to sneak into the enclave using the robes of killed Sand People. With the translations of the Assassin droid named HK-47, he was able to speak with the chieftain. He offered to reduce their attacks on miners if Revan would provide them with moisture vaporators."}, {"tag": "p", "text": "Revan later returned with the vaporators, and the chieftain agreed to reduce the tribe's attacks and gave the Jedi his gaffi stick as a show of good faith. He also agreed to release the Jawas and Griff."}, {"tag": "p", "text": "Revan would later prove himself a warrior by presenting the chieftain with a krayt dragon pearl. The chieftain would then allow Revan to learn of the history of the Sand People from the tribe's Storyteller."}, {"tag": "p", "text": "Eventually, the tribe relocated to a different part of Tatooine which would be farther from Anchorhead."}, {"tag": "h2", "text": "Appearances"}]}