{"url": "Unidentified_Viidaav_commander", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Separatist officers", "Category:Unidentified CIS members", "Category:Unidentified males", "Category:Unidentified military personnel", "Category:Viidaavs"], "nodes": [{"tag": "h1", "text": "Unidentified Viidaav commander"}, {"tag": "p", "text": "This unidentified Viidaav commander lead a unit of Viidaav soldiers against Galactic Republic clone troopers during the Battle of Viidaav in 20 BBY. The commander and his unit were stationed near a fortified mining array that controlled the explosive mining charges buried in the surface of the planet Viidaav. The tide of battle was turning against the Viidaav warriors, as Republic reinforcements bolstered the offensive against the array. However, when the Viidaav detected that the detonation signal had been sent to the mining array's central computer, they realized that they had been betrayed by their so-called allies from the Confederacy of Independent Systems."}, {"tag": "p", "text": "The Viidaav commander led his troops in a last-ditch effort to stop the charges from exploding. Meanwhile, clone troopers, led by their commander, charged toward the array as well. Both sides suffered heavy casualties, leaving only the two commanders standing at the bunker housing the array's computer. The Viidaav leader entered the structure and fought his way through the array's defense systems. With only 15 seconds remaining to detonation, the rival commanders met in the central computer room. They faced off silently for the next 12 seconds. Finally, the Viidaav commander opened fire and was shot by the clone commander in return. As the smoke cleared, the clone commander realized that the Viidaav leader had never been aiming to kill him. Instead, he had destroyed the computer, averting the explosion and saving the planet and its people from destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}