{"url": "Unidentified_Utai_patron", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified males", "Category:Utai"], "nodes": [{"tag": "h1", "text": "Unidentified Utai patron"}, {"tag": "p", "text": "In 19 BBY, a male Utai was a patron of the Quarek'k, a bar complex located on the planet of Coruscant. The Utai, a Zabrak, and a Shistavanen were drinking together there when the bounty hunter Aurra Sing entered. The trio tried to get her to consort with them, but she refused and eventually killed the Shistavanen and Utai, slicing the latter in half with her lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Soon after the Galactic Empire was founded in 19 BBY, a male Utai was present on the planet of Coruscant. He was drinking heavily alongside two companions—a Zabrak and a Shistavanen—in Section 7-B of a bar complex called the Quarek'k when a bounty hunter named Aurra Sing entered the establishment. The trio decided to proposition the woman, so they cornered her and the Zabrak tried to convince her to consort with them. After Sing cleaved the Zabrak's arm off with her lightsaber, the Utai jumped to his companion's aid with a vibroblade. He was quickly killed by Sing, who vertically bisected him, alongside the Shistavanen."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Utai was large and stocky for his species. When drunk, he had no qualms about trying to solicit Sing with his companions even though she was of a different species. When the Zabrak was injured, the Utai immediately came to to his companion's defense with a lethal weapon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Utai appeared briefly in the second novel of the Coruscant Nights trilogy, Coruscant Nights II: Street of Shadows, written by Michael Reaves and released in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}