{"url": "Unidentified_WED-15_Treadwell_(Lars_homestead)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Unidentified droids", "Category:WED-15 Treadwell droids"], "nodes": [{"tag": "h1", "text": "Unidentified WED-15 Treadwell  (Lars homestead)"}, {"tag": "p", "text": "A WED-15 Treadwell repair droid, produced by the Cybot Galactica company, worked for moisture farmer Owen Lars on the planet Tatooine during the Galactic Civil War. A fifth-degree droid, the Treadwell sometimes misidentified the noise of sand flies for malfunctioning equipment and followed them."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A WED-15 Treadwell repair droid was produced by Cybot Galactica, one of the two largest droid-manufacturing companies in the galaxy, prior to the Battle of Yavin. During the Galactic Civil War, the droid became one of several Treadwells working for moisture farmer Owen Lars's family on the planet Tatooine, alongside the droid WED-15-77, which served on the farm for more than twenty years."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As a fifth-degree droid, the Treadwell had only limited intelligence. Sometimes, it followed sand flies, misidentifying their noise as that of a malfunctioning piece of equipment. Colored blue, the droid was a typical Treadwell repair unit, possessing two rows of ten treaded wheels on its base. The droid's binocular photoreceptors were black and were mounted on a long, telescopic stalk, which also held its manipulator arms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The model used for the as-yet unnamed WED-15 Treadwell was designed in 1975 by production designer John Barry for use in the 1977 film Star Wars: Episode IV A New Hope. The same droid model was also used for the droids WED-15-I662 and WED-15-77 during the filming of the movie. Barry's notes showed that the prop had one functioning arm and housed a radio controller in its treadwell base so that it could be controlled by off-screen crew members. Barry's sketch indicated that the model stood between four feet and four feet, six inches tall. Scenes featuring the droid were shot on location in Tunisia in March 1976."}, {"tag": "p", "text": "The Treadwell droid first appeared in Star Wars Episode IV: A New Hope, written and directed by George Lucas and released on May 25, 1977. Dorling Kindersley's Inside the Worlds of Star Wars Trilogy incorrectly identified this droid as \"WED 15 Septoid 2,\" which is another type of Treadwell droid."}, {"tag": "p", "text": "The meltdown scene of WED-15-77, a similarly-appearing Treadwell, occurred before the appearance of the unidentified Treadwell in the film. In the film's radio drama, however, WED-15-77 merely stopped moving rather than melting down, and Owen Lars mentioned at a later Jawa auction that he had \"already got a Treadwell [and didn't] need another.\" This suggested that the unidentified droid was intended to be WED-15-77 and not another droid of the same line. However, the StarWars.com Databank confirmed WED-15-77's meltdown to be final and the droids to be separate characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}