{"url": "Unidentified_Wookiee_command_center", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Alaris Prime locations", "Category:Military bases"], "nodes": [{"tag": "h1", "text": "Unidentified Wookiee command center"}, {"tag": "p", "text": "Wookiee workers built a command center on the moon Alaris Prime between the years 39 and 36 BBY. The command center was one of the early bases built on Alaris Prime during the Wookiees' colonization effort on the moon. At the building, Jedi Master Qui-Gon Jinn taught the colonists how to gather four vital materials for the colony: food, carbon, nova crystals, and ore. The Wookiee Chewbacca also defended the base from an attack by gundarks, a predatory species on Alaris Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A command center was built on Alaris Prime, a moon of the gas giant Alaris, by Wookiee workers during their species' colonization attempt on the moon. The building was equipped with a turret that could be manned by Wookiee workers if the command center came under attack. A large and impenetrable forest covered the north and west sides of the building, and a river ran to the east of it. The command center was close to many resources; several muja fruit bushes had grown near the building, and a short distance away were deposits of nova crystals and ore, which could be used as a form of currency and processed into durasteel, respectively."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Wookiee workers constructed the command center on Alaris Prime between the years 39 and 36 BBY. The building served as one of the first bases erected on the rediscovered moon during the Wookiee colonization effort there. Three Wookiee workers were stationed at the command center, where they were instructed by Jedi Master Qui-Gon Jinn, who had been sent by the Jedi High Council to oversee the colonization effort, on how to gather several different resources."}, {"tag": "p", "text": "The Wookiees began by gathering fruit from the nearby muja fruit bushes. After a sufficient amount of food had been harvested, another Wookiee worker arrived at the base and was instructed by Jinn to catch fish from the river as another source of food for the colony. More food was gathered and another Wookiee arrived to assist."}, {"tag": "p", "text": "Following the arrival of the fifth worker, Jinn decided to conduct a drill in case the command center was attacked by gundarks, a predatory species on Alaris Prime, or any other kind of enemy. The drill involved stopping all of the workers' activity and sending the Wookiees into the command center for their protection. The drill was pulled off successfully, and the workers were then sent back to work. Eventually, enough food had been gathered to sustain the colony, meaning the workers could turn their attention to gathering carbon, another necessary resource for the colony's survival, as it could be processed into duraplast, which could be used for buildings. Jinn instructed the workers on how to gather carbon from the trees that stood near the command center. A short time later, Chewbacca, one of the Wookiee leaders of the colonists, arrived at the base."}, {"tag": "p", "text": "At the same time as the Wookiee arrived, a group of four gundarks began to attack the command center. The workers went into the command center in a similar fashion that they had practiced in the drill and used the building's turret system to defend the base from the gundarks. With assistance from Chewbacca, the Wookiees were able to kill the gundarks and prevent the command center from suffering serious damage. Following the attack, Chewbacca explored the area near the command center and found the stockpiles of ore and nova, and the workers collected enough of the various resources to sustain the base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wookiee command center was first mentioned in the 2001 book Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide and later appeared in the accompanying PC video game, Star Wars: Galactic Battlegrounds, released a week later. The command center appears in the second level of the Wookiee tutorial campaign, \"Gathering Resources,\" in which it is the only building in the player's base. The command center is used in the level for containing the resources collected by the player, creating new workers and housing them when the base is attacked by gundarks. In the level, it is the player's choice of the order they collect the resources. This article follows the instructions given by Qui-Gon Jinn, which are to first gather food, and when 200 food has been gathered by the workers, collect carbon, and then the player has to explore the area to find nova crystals and ore to gather. The level ends once 200 food, 100 carbon, fifty nova crystals, and fifty ore have been gathered, but the player can also lose the level if the command center is destroyed in the gundark attack or if all their workers are killed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}