{"url": "Unidentified_White_Squad_commando_pilot", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified clone commandos"], "nodes": [{"tag": "h1", "text": "Unidentified White Squad commando pilot"}, {"tag": "p", "text": "This clone commando pilot was a member of the Grand Army of the Republic's White Squad, a special forces squad of clone commandos who carried out missions for the Galactic Republic during the Clone Wars. A clone of the Mandalorian bounty hunter Jango Fett, this soldier was born on the aquatic world of Kamino, and was responsible for White Squad's transportation during a mission to the Mid Rim planet, Ord Mantell. There, he secured a landspeeder for his comrades, and piloted the speeder from the Ord Mantell streets to an industrial yards area where the squad engaged a group of Trandoshan bounty hunters responsible for stealing a diplomatic package bound for Supreme Chancellor Palpatine. This commando was shot several times in the chest when he discovered the Trandoshan's rendezvous with Confederacy battle droids looking to purchase the stolen package. The soldier's sergeant, RC-1013, later destroyed the droids and took the lives of the bounty hunters before recovering the parcel they had been sent to retrieve."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A clone of the Mandalorian bounty hunter Jango Fett, this male Human was born on the aquatic world of Kamino, located in the remote Wild Space region of the galaxy. Over the following years, he was trained as a clone commando to serve in the Grand Army of the Republic. Following the Battle of Geonosis that triggered the outbreak of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the clone soldier was deployed with the rest of the Grand Army and like all of his commando comrades, joined the ranks of Special Operations Brigade, a special forces unit within the Grand Army made up of clone commandos and Advanced Recon Commandos. Six months after the events of Geonosis, the commando was serving as a member of White Squad, a commando unit led by clone sergeant RC-1013—a commando known informally as \"Sarge\". He and his squad, in addition to the members of Blue Squad, were summoned to the headquarters of Republic Intelligence, where they were met by an ARC trooper intelligence officer in yellow-marked armor. The ARC trooper informed the assembled commandos that a package sent by Malastarian diplomats and intended for Supreme Chancellor Palpatine had been intercepted while en route and stolen by a gang of Trandoshan bounty hunters. The eight commandos were then tasked with retrieving the stolen package from the Trandoshans, a mission that was to take place on Ord Mantell."}, {"tag": "p", "text": "All did not go as planned on Ord Mantell, however, as during the midday assault on the Trandoshan bounty hunters, the commandos of Blue Squad were all killed and although two of White Squad's commandos were able to destroy all but one of the mercenaries' landspeeders, the final speeder carrying the package the squad had been sent for managed to flee the scene. The soldier piloted the squad's own speeder around to the front of the building they had been perched atop, and hastily sped after the bounty hunters into Ord Mantell's industrial yards. Arriving in an open courtyard, Sarge ordered his men to split up in order to quickly locate the Trandoshans, and the commando pilot managed to locate the bounty hunters first. Unfortunately for him, he stumbled upon the meeting wherein the hunters were attempting to sell the package to a cadre of CIS battle droids. The droids turned their blasters on him as he stood in the open doorway, the energy bolts penetrating his heavy armor and killing him. Sarge went on to destroy both the droids and the remaining Trandoshans, though the other two members of White Squad fell during the assault, before the squad sergeant was able to retrieve the parcel and return it to Coruscant for delivery to Chancellor Palpatine."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As the standard protection issued to all clone commandos of the Republic's Grand Army, this commando wore a suit of durable Katarn-class commando armor. Unlike the other members of his squad, he chose not to decorate his armor with colored paint or customized gear, preferring instead to maintain a cleaner, simpler appearance. The commando also wielded a DC-17m blaster rifle, the standard issue weapon provided for clone commandos. During the mission to Ord Mantell, he made use of a small speeder that could seat four individuals."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2005, the third volume of the Clone Wars Adventures comics introduced two squads of Republic commandos with the story The Package. Though unnamed in the story itself, Wookieepedia uses the conjectural title of \"White Squad\" for the squad led by Sarge, in contrast to the equally conjectural \"Blue Squad\" for the sake of reference."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}