{"url": "Unidentified_Wookiee_base_(gundark_attack)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Alaris Prime locations", "Category:Military bases", "Category:Settlements", "Category:Unidentified locations"], "nodes": [{"tag": "h1", "text": "Unidentified Wookiee base  (gundark attack)"}, {"tag": "p", "text": "Workers of the Wookiee species constructed a base between 39 BBY and 36 BBY on the moon Alaris Prime. It was one of the early settlements built on the moon during the Wookiees' colonization effort there. The base comprised a single command center, several prefab shelters, a troop center, an animal nursery, and a power core. At the base, Jedi Master Qui-Gon Jinn aided the Wookiee Chewbacca in training warriors to attack a nearby nest of predatory gundarks."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Wookiee laborers built multiple bases on Alaris Prime, a moon of the gas giant Alaris. One such base initially contained only a single building, the command center, but was later expanded to include several prefab shelters to house more Wookiees, a troop center for training warriors, an animal nursery, and a power core for supplying energy to the buildings in the settlement. The base was constructed in close proximity to a large forest and near several muja fruit bushes, and it was also a short distance south of a nest of gundarks, a non-sentient predatory species on Alaris Prime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Wookiees constructed the base during their colonization effort on Alaris Prime between the years 39 BBY and 36 BBY. The base was initially only home to three Wookiee workers and one of the colonists' leaders, Chewbacca. Another worker soon arrived at the base, and, acting on advice from Jedi Master Qui-Gon Jinn, who was supervising the colonization on behalf of the Jedi High Council, the Wookiees began gathering food from the nearby fruit bushes and carbon from the trees. The workers then built prefab shelters to allow more Wookiees to come to the base, and Jinn afterward instructed Chewbacca on how to catch nerfs and herd them into the Wookiees' animal nursery in order to produce more food."}, {"tag": "p", "text": "More workers began to assist at the base until ten of them were gathering resources. Jinn then had the workers construct a troop center in order to train warriors to eliminate the gundarks at their nest, as the creatures had been attacking the Wookiees upon their arrival on Alaris Prime. At least ten warriors were trained to wield bowcasters, a Wookiee projectile weapon, at the troop center, and the workers simultaneously built a power core to give more energy to the buildings in the base. With the troops prepared, Chewbacca led an attack on the gundark nest, where the Wookiees also encountered battle droids of the Trade Federation, a galactic corporation that was illegally trying to colonize Alaris Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wookiee base was first mentioned in the 2001 Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide and later appeared in the accompanying LucasArts video game Star Wars: Galactic Battlegrounds, released a week later. In Galactic Battlegrounds, the base appears in the third level of the Wookiee tutorial campaign, \"Building an Army,\" in which the base originally starts off with just a command center and the player is instructed to build the prefab shelters, a troop center, and a power core throughout the level. The strategy guide instructs the player to train ten workers and ten troopers, which this article uses to determine the canonical number of Wookiees at the base. The guide also instructs the player to construct an animal nursery, which is optional in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}