{"url": "Unidentified_Weequay_pirate_(Crucible)/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Unidentified males", "Category:Unidentified members of the Ohnaka Gang", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Unidentified Weequay pirate  (Crucible)"}, {"tag": "p", "text": "A Weequay pirate was a member of the Ohnaka Gang during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The pirate, along with Gwarm, Parsel, and other pirates boarded the Jedi ship Crucible in order to steal the lightsaber crystals that the Jedi Initiates had with them. After boarding the Crucible, Hondo ordered that the lightsaber crystals be found and for his men to kill anyone who stood in their way. This pirate was surprised by this order and spoke out against it, due to the targets being children. Hondo did not listen to this pirate and ordered for the ship to be searched a second time."}, {"tag": "p", "text": "Ahsoka Tano got the each of the Younglings and Professor Huyang to safety and ordered for Zatt to activate the engines and break apart the connecting bridge which would cause a vacuum and suck all of the pirates out into space. This pirate, along with the rest of the pirates, were sucked out of the ship and into the connecting bridge of the pirate's cruiser. This pirate was stuck in the connecting bridge and was pushed by Ahsoka Tano back into the pirate's ship with the force. Ahsoka was knocked into the same bridge and was captured by the pirates. This pirate, along with the rest of the surviving pirates, held a bound Tano at gunpoint."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While a member of the Ohnaka Gang, this pirate still had some sense of what he felt was right and wrong, as he spoke out against Hondo's order to kill anyone who stood in their way because the occupants on the ship were kids."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This pirate wore goggles and a chest plate like that of Dagu Flask, another member of the Ohnaka Gang and carried a Blaster during the boarding of the Crucible."}, {"tag": "h2", "text": "Appearances"}]}