{"url": "Unidentified_Wookiee_medical_droid", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Medical droids"], "nodes": [{"tag": "h1", "text": "Unidentified Wookiee medical droid"}, {"tag": "p", "text": "Members of the Wookiee species built a medical droid on the moon Alaris Prime between 39 BBY and 36 BBY for the purpose of saving Attichitcuk, a Wookiee Chieftain who had been shot and gravely injured by B1-Series battle droids of the Trade Federation. The medical droid traveled to Attichitcuk's location along with a party of Wookiees led by his son, Chewbacca, where the droid was able to give enough medical aid to save the Chieftain's life."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Wookiee species' colonization effort of the moon Alaris Prime between the years 39 BBY and 36 BBY, some Wookiees constructed a medical droid on orders from Jedi Master Qui-Gon Jinn, who was assigned to oversee the colonization. The Wookiees built the droid in a base's command center for the purpose of healing Wookiee Chieftain Attichitcuk, the leader of the colonists. Attichitcuk had been shot and critically wounded by B1-Series battle droids of the Trade Federation, a galactic conglomerate that wanted to take Alaris Prime illegally."}, {"tag": "p", "text": "Once the droid was built, it set off with a band of Wookiee bowcaster troopers led by Chewbacca, Attichitcuk's son, into the forest to rescue the Wookiee leader. After encountering and defeating several battle droids en route, the Wookiees found Attichitcuk, and the medical droid was able to heal him enough to allow him to walk back to the base. The medical droid and the Wookiee troopers then returned to the base, defeating several more battle droids along the way, including three droidekas that attacked them at the settlement. Attichitcuk, still needing to recuperate from his wounds, was prevented from participating too heavily in the colonization effort for some time."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The first-degree droid was part of a medical droid model built by the Wookiees. It moved around on a set of wheels and had two mechanical arms. The medical droid was skilled enough to get Attichitcuk back on his feet after he was critically wounded by blasterfire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wookiee medical droid was first mentioned in the strategy guide for the 2001 PC video game Star Wars: Galactic Battlegrounds before appearing in the game itself. The droid appears in the fourth level of the Wookiee tutorial campaign, \"Researching Technology,\" and is constructed at the player's command center at the cost of thirty-five food units. The player may create multiple medical droids, but an image of Attichitcuk being rescued shows one droid, establishing canonically that the Wookiees constructed only a single medical droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}