{"url": "Unidentified_YT-2400_light_freighter", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alliance to Restore the Republic starships", "Category:Unidentified freighters", "Category:YT-2400 light freighters"], "nodes": [{"tag": "h1", "text": "Unidentified YT-2400 light freighter"}, {"tag": "p", "text": "This unidentified YT-2400 light freighter was used by the Rebel Alliance at the time of the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While members of the Rebel Alliance and other people loyal to their cause celebrated Remembrance Day in Coronet City on the planet Corellia in 1 ABY, the YT-2400 light freighter was on its way to the hidden Corellian Rebel Base when it crashed onto a beach near Coronet for unknown reasons. None of the four passengers and crew members aboard the ship survived the crash."}, {"tag": "p", "text": "Imperial High Command soon learned of the crash and informed Mara Jade, one of the Emperor's Hands, who was attending the Empire Day celebrations in Theed on Naboo. Jade asked a loyal Imperial agent participating in the festivities to investigate the crash site and recover any intelligence that he could find on the ship and its passengers. When the agent arrived at the crashed ship, the Imperial identified four victims of the crash: a SpecForce soldier, a Twi'lek officer, a Mon Calamari commando and a Sullustan pilot. Data found on one of the victims was analyzed and revealed the existence of the previously unknown Rebel Hideout on Corellia to Jade. Shortly thereafter, the Imperial agent was sent by Jade to infiltrate the Rebel base and free several captured Imperial officers from a detention facility inside."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This unnamed YT-2400 was added to the MMORPG Star Wars Galaxies as part of the Empire Day event of 2009. Sent by Mara Jade to investigate the crash, Imperial players had to travel to Corellia and search the victims' bodies to find the data. The quest then continued in the Corellian Rebel Hideout."}, {"tag": "h2", "text": "Appearances"}]}