{"url": "Unidentified_Weequay_pirate_2/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Unidentified males", "Category:Unidentified members of the Ohnaka Gang", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Unidentified Weequay pirate 2"}, {"tag": "p", "text": "A Weequay pirate served in the Ohnaka Gang during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 20 BBY, the pirate assisted Hondo Ohnaka and Gwarm in boarding the Crucible to steal the Jedi Lightsaber crystals. This pirate, along with a few others, located Professor Huyang, and four of the Jedi Initiates, Petro, Katooni, Gungi, and Byph. As a trick, Petro activated his incomplete lightsaber and then tossed it at this pirate. The pirate caught it and activated it, remarking that he always wanted one. Petro, however, had built the lightsaber incorrectly causing it to detonate and knock this pirate unconscious, allowing the younglings and Huyang to escape."}, {"tag": "p", "text": "This pirate reawakened and followed the younglings and Huyang towards where Hondo and the other pirates were. Huyang sealed this pirate off from the others in order for he and the younglings to escape. While Ahsoka Tano held off the pirates, she ordered Zatt to activate the engines which would break the connecting bridge and cause a vacuum that would suck the pirates out into space. As this happened, this pirate was able to pry open the blast door, only to get sucked out of the Jedi ship. He managed to grab hold of an object in the connecting bridge along with several other pirates, leaving Ahsoka and Hondo to try to keep hold of the wall of the Jedi ship. Ahsoka used the Force and knocked an incoming pirate into Hondo and knock him into the bridge. This pirate managed to keep his grip on the object and grab Hondo at the same time as the bridge slipped away, taking Ahsoka and the pirates with it."}, {"tag": "p", "text": "After the pirates captured Ahsoka, they had a feast on Florrum. This pirate drank too much alcohol, and he was lying around drunk and sleeping. Meanwhile, the younglings came pretending to be parts of Preigo's Traveling World of Wonder, and rescued Ahsoka. The pirate later took part in the second battle of Florrum, when General Grievous attacked Florrum. The pirates cooperated with the Jedi younglings in order to escape."}, {"tag": "p", "text": "Later in the year, along with Jiro and some other pirates joined Darth Maul and Savage Opress against their former leader Hondo Ohnaka. Later on, when the two Sith were overpowered by Obi-Wan Kenobi and Hondo, the remaining pirates joined Hondo again, and helped him to chase the brothers away from Florrum. One of the pirates managed to shoot the ship with a rocket launcher, and the brothers barely escaped in the ship's escape pod. The pirates, believing that the two vaporized, started searching for what remained after them. This pirate found a Z-6 rotary blaster cannon, but Hondo didn't care too much about it."}, {"tag": "h2", "text": "Appearances"}]}