{"url": "Beasts_of_Echo_Base", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Beasts of Echo Base"}, {"tag": "p", "text": "\"Beasts of Echo Base\" is the fifth episode of the first season of the animated micro-series Star Wars: Forces of Destiny. It was released on July 7, 2017. The episode takes place prior to Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Leia and R2-D2 must free Chewie from the clutches of a ferocious wampa."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After Chewbacca goes missing while digging corridors within Echo Base, Leia and R2-D2 are searching for him. They have searched everywhere and asked everyone in the base and still cannot find him. However, just as Leia begins to lose hope, they hear Chewbacca's howl coming from inside one of the corridors. Lantern in hand, Leia leads Artoo into the corridor where deep within they catch sight of their Wookiee friend. At first it appears as if everything is alright but as they take a closer look, Leia realizes that Chewie is in the clutches of a wampa. Just as she makes this realization, C-3PO cuts in on her wrist comlink. The noise seems to startle the wampa seeing Chewbacca's frightened look, Leia quickly shuts off the comlink. As the wampa begins to rise from his perch, he releases Chewie and runs over to join Leia and Artoo. Leia quickly comes up with a plan to escape the agitated beast. She orders Chewie and Artoo to seal the passageway while she distracts the wampa. As Leia lets the wampa chase her as a distraction, Artoo and Chewie quickly get to work on the door. As the wampa corners Leia, her lantern goes out leaving her in the dark. However, she manages to slide between the wampa's legs and escape the passageway. As she escapes, Chewie and Artoo complete the installation of the door and shut it just before the wampa can escape. Chewie gives Leia a hug of appreciation and the trio celebrates that Leia's plan to contain the beast was successful."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode ties into a deleted scene from The Empire Strikes Back, where wampas would have infiltrated Echo Base and a warning sign put on the door by C-3PO after the wampas were trapped inside. The scene would have been followed up by another, in which C-3PO tears the sign off, so invading snowtroopers would have entered the room with the wampas."}, {"tag": "p", "text": "A reference book called Star Wars: On the Front Lines, released after the short, has confirmed that the deleted scene is canon."}, {"tag": "p", "text": "Concept art for \"Beasts of Echo Base\" shows the paper sign on a doorway, but it does not appear in the short."}, {"tag": "p", "text": "The events of the episode were later referenced by Leia in Star Wars: The Rebel Files."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}