{"url": "Unidentified_air_scrubber_farm", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Eriadu locations", "Category:Farms"], "nodes": [{"tag": "h1", "text": "Unidentified air scrubber farm"}, {"tag": "p", "text": "An air scrubber farm was built near the city of Phelar on the planet Eriadu cleaning toxins from the air created by the world's mining industry. During the early years of the Galactic Empire's reign the human male who would grow up to become a stormtrooper designated TK-462 lived on the farm with his parents and his younger sister Xea. TK-462's father worked as caretaker for the farm, and his mother died at some point before he was twelve. This meant that most of the time Xea and her brother took care of themselves while their father worked on the air scrubbers, and the two children often used the fields of scrubbers as a playground, pretending the machinery was a forest or an army of droids as part of their games. Around eleven years before the Battle of Yavin, a group of rebels attempted to steal several air scrubbers from the farm using starships, hooking tow cables from their vessels onto two of the scrubbers. TK-462's father became aware of the robbery and began shooting at the thieves with a blaster, the sound of which also drew his son outside. As the caretaker fired, the rebel vessel managed to pull one of the scrubbers out of the ground, leaving it only anchored by a power conduit. Realizing what was about to happen, TK-462's father began firing at the conduit, but was unable to destroy it before the rebel's tow cable snapped, sending the scrubber plummeting through the roof of the family's home and killing Xea. Grand Moff Wilhuff Tarkin, newly appointed governor of Eriadu later visited the farm with several stormtroopers, causing the caretaker to become extremely nervous. TK-462 later slipped away from the farm in the night when he was of age to enlist with the Empire, never seeing it or his father again before his death on the planet Lothal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The farm first appeared in the short story \"TK-462\", which was written by Sylvain Neuvel and published in Star Wars Insider 166 in 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}