{"url": "Unidentified_acklay_(Burnout_arena)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Acklays", "Category:Gladiators", "Category:Unidentified individual creatures"], "nodes": [{"tag": "h1", "text": "Unidentified acklay  (Burnout arena)"}, {"tag": "p", "text": "Circa 21 BBY, an acklay was kenneled aboard the Burnout space station. The acklay was released into the station's underground gladiatorial arena to serve as a prized fighting beast in the illegal bloodsport spectacles held in there. It was killed in combat by the Heroes of Cularin during an operation to rescue kidnapped Cularin citizens from the station."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Circa 21 BBY, an acklay was kept aboard Burnout, a space station orbiting the planet Zham Hlar within the Thaereian system of the Galactic Republic. Although the station developed reputation for being host to a number of trades outlawed by the Republic, the leaders of the Thaereian military often turned a blind eye to, or covertly profited from, the station's activities. The Red Fury Brotherhood controlled a section of the space station, unofficially known as \"Underburn,\" and operated a hidden gladiatorial arena there. The arena's program tended to utilize beasts, volunteer gladiators, and randomly kidnapped slaves, though the Thaereian military occasionally used the events to dispose of political dissidents from both the Thaereian system and Cularin systems. The acklay, a member of an aggressive non-sentient species of amphibious crustaceans typically native to Vendaxa, became the arena's prized fighting-beast and main attraction. The acklay was housed in the arena's largest holding pen. It sometimes shared a portion of the pen, divided by an energy field, with the kidnapped sentients who became involuntary gladiators. A crew consisting of Ugnaughts and Gamorreans served as handlers for Burnout's menagerie."}, {"tag": "p", "text": "Xirossk, a Trandoshan member of Thaereian Intelligence, led a group that would eventually be known as the Heroes of Cularin on a chase through Burnout in an attempt to expose the arena and Thaere's corruption. Xirossk had also hoped to use the chase to defect to the Cularin Militia and mount a rescue of Nim'Ri, a member of the Cularin resistance who had been secretly kidnapped by the Thaereian military. Unknown to Xirossk, Nim'Ri's fight scheduled had been moved up. Xirossk and the Heroes watched the acklay kill Nim'Ri on a viewscreen before Xirossk's plan could be revealed. The Heroes apprehended Xirossk and returned to the Cularin system, where the Trandoshan was accepted into the Cularin Militia."}, {"tag": "p", "text": "Xirossk and the Heroes soon returned to Burnout, to attempt to rescue a group of one hundred Cularin citizens who were kidnapped to be used as fodder in the arena. When the Heroes placed themselves between the citizens and a number of hostile massiffs used as a preliminary event, the acklay was released by arena staff. The acklay aggressively attacked the Heroes, but was killed in the ensuing skirmish. The beast's corpse was jettisoned from an airlock adjacent to the arena pens by arena staff."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the acklay is introduced in the Living Force adventure, The Air Up Thaere, players do not get to enter combat with the creature until the followup adventure, Memories. Memories provides three sets of stats for the acklay based on the level, or tier, of the players involved. The lower tier of the adventure describes the acklay as exhausted, and halves the base creature's vitality points. For higher tier adventures, the acklay gains Force-sensitivity and several levels of the dark side marauder class, giving access to the Force powers such as battlemind, fear, Force speed, and the ability to produce Force lightning from its mouth. The high-tier acklay also gains proficiency with light armor, blaster pistols, blaster rifles, heavy weapons, simple melee weapons, and vibroweapons; however the adventure does not detail any scenario with the creature using weapons or armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}