{"url": "Unidentified_armored_division", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial Army divisions"], "nodes": [{"tag": "h1", "text": "Unidentified armored division"}, {"tag": "p", "text": "An armored division of the Galactic Empire's Imperial Navy fought under Grand Admiral Thrawn of the Seventh Fleet during the Battle of Atollon against Phoenix Cell. The armored division was tasked with deploying infantry and destroying rebel starships and consisted of several heavy battalions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An armored division served within the Imperial Army of the Galactic Empire and was stationed aboard the Imperial Navy's Seventh Fleet, which was led by the Chiss flag officer Grand Admiral Thrawn. As an armored division, it was composed of several heavy battalions, and consisted of armored walkers and repulsorcraft. Overall, it contained six heavy All Terrain Armored Transports and six All Terrain Defense Pods, and supplemented with several Imperial Troop Transports. Its infantry was entirely composed of stormtroopers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The armored division was active during the Galactic Civil War by the time of the Lothal campaign launched by Grand Admiral Thrawn against the Phoenix Cell of the Rebel Alliance in the Lothal sector. After Thrawn managed to pinpoint the location of the rebel Chopper Base on Atollon, Thrawn deployed a contingent of starships from the Seventh Fleet to blockade the world and destroy the rebel fleet, initiating the Battle of Atollon. After a fierce space battle in Atollon's orbit forced the surviving rebel ships to retreat back to the surface, Thrawn bombarded the base. When that attempt to destroy the rebel forces failed, Thrawn deployed landing forces to annihilate the rebel cell and capture its leaders."}, {"tag": "p", "text": "The armored division landed near the Atollon Coral Mesa where the rebel base was located, and was accompanied by Grand Admiral Thrawn, who set up a command point at the rear where his Sentinel-class shuttle landed. From there, Thrawn directed the armored division, and ordered a group of All Terrain Defense Pods to move forward and test the rebel defenses. Once the walkers were defeated and the defense line was revealed, Thrawn ordered the division's heavy battalions to advance. With the larger AT-ATs now bombarding the rebel forces, the division's Imperial Troop Transports moved forward and deployed stormtroopers. As the rebel forces were routed into the Mesa, Thrawn and his guard of death troopers arrived in the shuttle and spearheaded Imperial forces."}, {"tag": "p", "text": "Thrawn then ordered the armored division to hold their position and destroy any rebel ships that attempted to escape. During the push forward, two ships managed to escape but the division's walkers managed to shoot down a GR-75 medium transport. Thrawn and his forces then surrounded the rebel leaders and ordered them to surrender, however, the Force-sensitive creature Bendu manifested in a thundering storm and rained lightning indiscriminately, allowing the rebels to escape aboard their ships. Bendu destroyed two AT-ATs but was eventually defeated when Thrawn ordered his forces to concentrate at the center of the storm. Several of the surviving ships then managed to break through the blockade in orbit and escape into hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The armored division first appeared, albeit unnamed, in the Star Wars Rebels season three finale, \"Zero Hour.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}