{"url": "Unidentified_blue-skinned_short-legged_species", "categories": ["Category:Legends articles", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Unidentified blue-skinned short-legged species"}, {"tag": "p", "text": "A humanoid species of blue-skinned and short-legged beings with conical heads existed, one of which was the notable Podracer pilot Toy Dampner. The species could exhibit red hair on their heads, and featured short legs in conjunction with long, skinny arms. A crowd favorite on the moon of Oovo IV, Dampner served as an example of his kind in the public spotlight."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A sentient blue-skinned species, the aliens exhibited conical heads atop thin necks posted upon slim bodies. Alongside these proportions, the species exhibited short legs that ended in four digits. Conversely, the aliens possessed long, thin arms that ended in three-digit hands."}, {"tag": "p", "text": "The species had the ability to grow red-colored hair that sprouted from the top of their skull. In addition, they could grow facial hair that could flourish into a full mustache and beard, the former of which would grow underneath a sizable nose. Above the nose were two beady white eyes."}, {"tag": "p", "text": "The species afforded the vocal ability to speak Huttese."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The blue-skinned species evolved somewhere in the galaxy. The species had become a part of the galactic community by the year 32 BBY."}, {"tag": "h2", "text": "The species in the galaxy"}, {"tag": "p", "text": "A favorite among the Podracing fans on the moon of Oovo IV, the Podracer pilot Toy Dampner was a public member of the species. During the final decades of the Galactic Republic, Dampner made a name for himself by becoming the crowd favorite of the Oovo IV racecourse Executioner."}, {"tag": "p", "text": "Although not an inmate of the Oovo IV prison that the course ran through, Dampner raced for the entertainment of his friends who were incarcerated there. Dampner was also a crowd favorite on a racecourse on the planet Baroonda."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The species was originally conceived for the 1999 film Star Wars: Episode I The Phantom Menace for the early script character Toy Dampner. What eventually became the alien's final design was influenced by the 1996-dated artwork of conceptual artists Terryl Whitlatch and Iain McCaig. Labeled as \"Jug-Head\" Podracer by McCaig, the species never appeared in the film, but was instead developed for the film's tie-in video game Star Wars Episode I: Racer."}, {"tag": "p", "text": "The game's design borrowed from both Whitlatch's and McCaig's artwork in that the game character was blue-skinned with red hair; Whitlatch's artwork depicted the species as being short-furred and completely red, while McCaig's design featured a clothed, blue-skinned and blue-haired character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}