{"url": "Unidentified_brown_biped", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified brown biped"}, {"tag": "p", "text": "A brown biped was enslaved by the Totem Master on the forest moon of Endor. While under the Totem Master's control, his eyes took on a red glow, signaling his subservience to the thief."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Alongside a blue biped and a green arthropod, this creature took on the form of a large totem pole, with itself as the middle block of the totem. The Totem Master would then craftily give the the totem pole as a gift to an unsuspecting village. Once night had fallen, the Totem Master would release the creatures from their stationary position, and they would proceed to rob the village. After they had completed their task, the Totem Master would order the three individuals back into their totem configuration."}, {"tag": "p", "text": "Around 3 ABY, the totem containing this individual was given to the Ewok Wicket Wystri Warrick by the Totem Master, who hoped to rob Bright Tree Village. Despite warnings by his friend, Princess Kneesaa a Jari Kintaka, Wicket brought the totem back to his village, and when nighttime fell, the Totem Master released his slaves, who ransacked the village. Following this theft, the Totem Master enslaved the young Ewoks, Teebo and Latara and made them part of the Totem Slaves, putting them on top of the totem pole. The Totem Master then stopped in the Strutter Village, hoping to pull the same caper. However, during the attempted theft, the group was disrupted by Wicket and Kneesaa who had come to rescue their friends. The Totem Master ordered his servants to attack the two Ewoks, but Wicket was able to turn the Totem Master's powers against him, turning him into a totem himself and freeing the brown biped. Along with his two companions, the trio celebrated their freedom and ran off into the forest."}, {"tag": "h2", "text": "Appearances"}]}