{"url": "Unidentified_blackmailer", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Individuals of unspecified species", "Category:Unidentified criminals", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified blackmailer"}, {"tag": "p", "text": "A male individual lived during the time of the Galactic Civil War. At some point after 0 BBY, he was in the city of Bela Vistal on the planet Corellia, where he overheard and recorded a tape of spice trader Palejo Reshad doing business with associates of the crime lord Shalera the Hutt, and he used his tape to blackmail the trader. However, Reshad was unwilling to cooperate with the blackmailer and hired a spacer to kill him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male individual lived during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. At some point after the year 0 BBY, he was in the mountain city of Bela Vistal on the planet Corellia."}, {"tag": "p", "text": "While the individual was in Bela Vistal, he overheard and recorded spice trader Palejo Reshad doing trading business with associates of the crime lord Shalera the Hutt. The individual blackmailed Reshad with the tape of the spice trader's conversation. However, Reshad wished to eliminate his blackmailer instead of paying him."}, {"tag": "p", "text": "Reshad ended up meeting a spacer who was willing to help. After Reshad explained his situation, the spacer set out to find the blackmailer in the surrounding mountains of Corellia. However, the blackmailer was not willing to give up the tape, believing it would make him rich, and fought with the spacer. He was killed in the subsequent battle. The spacer then returned to Reshad and was awarded with 500 credits."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The blackmailer believed his tape of Palejo Reshad's conversation would make him rich."}, {"tag": "p", "text": "Not wanting to give up the tape for that reason, he attacked the spacer whom Reshad sent after him, which led to the blackmailer's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This individual, simply identified as the Blackmailer, was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players performing a quest for Palejo Reshad had to kill the blackmailer. Because the blackmailer spawned under the generic \"mercenary\" template, his appearance was randomized under one of seven possible depictions. Species the blackmailer could appear as included Humans and Rodians of either gender, and a male Sullustan. The quest dialogue identified the blackmailer as male, however the canonical species cannot be definitively determined in the Star Wars Legends continuity. Although the player could choose not to pursue the blackmailer, this article assumes 100 percent game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}