{"url": "Unidentified_clone_SCUBA_trooper", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified clone troopers"], "nodes": [{"tag": "h1", "text": "Unidentified clone SCUBA trooper"}, {"tag": "p", "text": "This clone served as a clone SCUBA trooper in the Grand Army of the Republic during the Clone Wars around 21 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This clone trooper was part of the Republic forces deployed on the ocean-filled planet of Dac during the Battle of Mon Cala. During the battle, the arrival of the Clone army swayed the battle in favor of the Republic, and the Separatists were forced to retreat."}, {"tag": "p", "text": "It wasn't long before the Separatist army regrouped and attacked the Republic forces again. This time the Separatist were aided by the monstrous Hydroid Medusa. The creatures were impervious to the Republic's weaponry, and the Jedi Generals, Mon Calamari, and this trooper and his SCUBA Trooper comrades were forced to retreat to the caves. Though this trooper fought bravely, he was apprehended along with another trooper and commander Monnk by the Separatist and Quarren forces while fleeing and was to be sent to a prison camp."}, {"tag": "p", "text": "Fortunately for this trooper and his comrades, the Jedi Generals who had evaded capture along with the Prince Lee-Char, Gial Ackbar, and Meena Tills were prepared to return to the surface to board their cruiser and escape the planet. While looking for an easier way to get everyone to the surface, Kit Fisto noticed the troopers escorted by a caravan of Quarren soldiers on speeders. General Fisto easily dispatched Monnk's captors and sent the Quarren's speeders down to his comrades to hasten their escape, while he and the troopers created a diversion. Unfortunately, the ship the fugitives were planning to escape on was destroyed by Separatist air forces and pieces of the ship sunk into the ocean. While the rest of the team decided to ride pieces of debris down to the cover of the ocean floor, this trooper used his Spear blaster to take out the remaining Aqua droids, but he was killed when a speeder driven by Quarren soldiers impaled him."}, {"tag": "h2", "text": "Appearances"}]}