{"url": "Unidentified_clone_commando_squad_(RC-3222)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Republic commando squads"], "nodes": [{"tag": "h1", "text": "Unidentified clone commando squad  (RC-3222)"}, {"tag": "p", "text": "A squad of clone commandos was part of the Galactic Republic's Grand Army in the year at the opening of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Trained by Cuy'val Dar Sergeant Walon Vau, the squad was made up of four commandos, including RC-3222. The unit was deployed with many other commando units in the first battle of the Clone Wars on the planet Geonosis, where all but Atin were killed in action."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, the squad of clone commandos was created on the Wild Space planet Kamino to serve in the Galactic Republic's Grand Army. The unit consisted of four troopers, including RC-3222 \"Atin,\" and trained under Mandalorian Sergeant Walon Vau, who was handpicked by bounty hunter Jango Fett to be a member of the Cuy'val Dar. Vau was a brutal instructor who was known to physically punish his commando charges, and constantly stressed the importance of equipment on his troops."}, {"tag": "p", "text": "In 22 BBY, the squad was deployed along with many other commando units to the Outer Rim planet Geonosis in the opening battle of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The unit sustained heavy casualties during the battle, leaving Atin as the only survivor. The remaining commando was assigned to Omega Squad three months later. Upon first impressions with the other members of Omega, all of whom were also the only survivors of their original squads, Sergeant RC-1309 \"Niner\" speculated that the squad must have been a miserable group, training under a miserable instructor. As tensions within the squad eased, Atin expressed to Niner his guilt at surviving without his former squadmates to the squad leader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The squad was mentioned in the 2004 novel Republic Commando: Hard Contact, written by Karen Traviss. In a 2005 discussion forum on StarWars.com, Traviss stated that in her notes for Hard Contact that RC-3222's original squad was named \"Prudii Squad,\" but the name did not appear in the novel itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}