{"url": "Unidentified_clone_lieutenant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Incomplete lists", "Category:Members of the 91st Mobile Reconnaissance Corps", "Category:Unidentified clone trooper lieutenants"], "nodes": [{"tag": "h1", "text": "Unidentified clone lieutenant"}, {"tag": "p", "text": "A clone lieutenant was a human male clone trooper who served as a Biker Advanced Recon Commando in the 91st Mobile Reconnaissance Corps of the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Separatist Alliance. The Clone Lieutenant served alongside his respective Jedi officer and corps commander, Jedi General Stass Allie and Clone Commander CC-8826. Following the Siege of Saleucami, the lieutenant was on a routine patrol alongside his superiors when he and CC-8826 received Order 66 from Supreme Chancellor Palpatine, forcing them to use their BARC speeders to shoot down and kill their Jedi General."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Grown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, the clone served as a Biker Advanced Recon Commando, and at one point received the military rank of Clone Lieutenant within the Grand Army of the Republic. He took part in the pan-galactic Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, serving within the Republic's 91st Mobile Reconnaissance Corps alongside Jedi General Stass Allie and Clone Commander CC-8826."}, {"tag": "p", "text": "The lieutenant remained active during the Outer Rim Sieges in 19 BBY, where he served on Saleucami alongside the rest of his unit. Following the Siege of Saleucami, the lieutenant served as the wingmate of Commander CC-8826 and later went on a routine patrol on a former battlefield alongside his superiors, General Allie and the commander. At that time, the two clone trooper officers received Order 66 from Supreme Chancellor Palpatine. Obeying the command, the clone officers quickly nodded at each other and slowed down their BARC speeders. Once they were behind their unsuspecting Jedi officer, the clones quickly used their speeders' laser cannons to blast Stass Allie's 74-Z speeder bike into pieces, killing her instantly."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of the bounty hunter Jango Fett, the BARC trooper was a human male who stood at 1.83 meters tall and had tan skin."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a Biker Advanced Recon Commando, the clone was specially trained to utilize BARC speeders across difficult terrain, and served as an officer within the Grand Army of the Republic."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The lieutenant wore Phase II clone trooper armor that was identical to the armor set worn by Commander CC-8826. This included the markings of the 91st Recon Corps, a small pauldron on his right shoulder, an ARC trooper sash, an integrated communicator on his right forearm, and an equipment belt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}