{"url": "Beck-tori", "categories": ["Category:Legends articles", "Category:Aquatic creatures", "Category:Creatures of the Nilgaard sector", "Category:Non-sentient species", "Category:Parasitic creatures", "Category:Predatory creatures", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Beck-tori"}, {"tag": "p", "text": "Beck-tori were aquatic parasites from Nam Priax's warm seas that grew to extreme sizes. Because the movement of a potential host through the water attracted Beck-tori, they sometimes would mistakenly attack boats and submersible craft. They were known to have fought frequently with the Gungans. The beck-tori had a strong connection to the Force, which they could use to heal themselves."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The creature resembled a flat, elongated leech. It had rows of scraping spines along the underside of its head that led to a gaping maw. After using its spines to attach to a living victim, a Beck-tori would flex its body to grind, dislodge, and consume flesh. The creature usually attached to a large aquatic predator before swallowing parts of it. Eventually, the Beck-tori would grind its way into the victim's body cavity, exposing its host to other invasive organisms. The host's body provided a medium in which the Beck-tori could lay its eggs before moving on to new prey."}, {"tag": "p", "text": "Beck-tori larvae were translucent creatures only a few centimeters long; they typically posed little danger to anything larger than a normal fish. At their average length, their main weapons were their abrasive spikes, although full-grown specimen were capable of swallowing their prey whole. Adult Beck-tori could breathe both air and water."}, {"tag": "p", "text": "The Galactic Republic took steps to ensure that the beck-tori were never transplanted to other worlds, but were unable to prevent several infestations. Most notably, an outbreak on Mon Calamari took more than fifty years to eradicate. The creatures have also been spotted on Naboo."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}