{"url": "Unidentified_clone_trooper_(cafeteria)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial Army personnel of the Galactic Empire", "Category:Unidentified clone troopers"], "nodes": [{"tag": "h1", "text": "Unidentified clone trooper  (cafeteria)"}, {"tag": "p", "text": "A clone trooper in the Imperial Army was involved in an altercation with the genetically altered clone Omega as well as the members of Clone Force 99. Like all clone troopers in the Grand Army of the Republic, this trooper was cloned from the template of Jango Fett. With the end of the Clone Wars and the Galactic Republic's reorganization as the Galactic Empire, the clones were absorbed into the new Imperial Military."}, {"tag": "p", "text": "The trooper was stationed in Tipoca City, a cloning facility on the planet Kamino, at the time of his fight with Clone Force 99. The incident occurred in the facility's cafeteria, where he mocked Omega and the clone commandos who differed genetically from the standard clones due to the mutations in their DNA. Taking issue with the clone's attitude, Omega threw her food at him, hitting the trooper in the back of his head. Clone Sergeant \"Hunter\" attempted to diffuse the situation, but a member of his squad, \"Wrecker,\" tossed his tray at the trooper. As a result, a brawl broke out in the cafeteria between Clone Force 99 and the other Fett clones."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This clone trooper was stationed in the Tipoca City cloning facility on the world of Kamino in 19 BBY, during the final days of the Clone Wars. In the aftermath of the galaxy-wide conflict, the clone trooper and his brethren—formerly soldiers in the Grand Army of the Galactic Republic—became part of the Imperial Army when Supreme Chancellor Sheev Palpatine declared himself Emperor of the Galactic Empire. Not long afterward the clone went to the cafeteria to eat. As he passed by the table where Clone Force 99 sat, he noticed that Doctor Nala Se's medical aide, the genetically altered clone Omega, was sitting with them. This prompted the clone to jokingly refer to her as the newest addition to the \"Sad Batch.\""}, {"tag": "p", "text": "Omega regarded the genetically defective clones as her friends, and therefore hurled some of her food at the clone when his back was turned, causing it to splatter across his face and armor. The clone trooper was flustered, and he approached their table again but was stopped by Clone Sergeant \"Hunter,\" the commanding officer of Clone Force 99. Hunter diffused the situation momentarily until \"Wrecker\" threw a whole tray of food at the trooper, and the cafeteria erupted into a brawl. In the ensuing chaos, Hunter landed a punch to the trooper's jaw and knocked him to the ground."}, {"tag": "p", "text": "The incident in the cafeteria was observed by Prime Minister Lama Su and Admiral Wilhuff Tarkin. Although the Imperial officer was intent on using a service conscription force to supplant the clone army for economic reasons, he decided to test Clone Force 99's skills in order to determine if they would have a future in the Imperial Army."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Jango Fett, the trooper was a human male who stood 1.83 meters tall and had black hair, brown eyes, and tan skin. In the wake of the Great Jedi Purge, this clone became part of a force of \"fully conforming clone troopers,\" their individuality—which developed under the Jedi Order's influence—suppressed by the behavioral modification biochips in their brains. He was genetically identical to the standard clone troopers, and therefore saw the members of Clone Force 99 as a squad of defective clones due to their genetic anomalies which set them apart from the rest of the clone army. His views on Clone Force 99 extended to Omega, Nala Se's assistant whom the trooper taunted as a \"lab scrabber.\""}, {"tag": "p", "text": "The clone trooper was humorous in his contempt for genetically defective clones, laughing at his own jokes while taunting Omega and Clone Force 99 which he called \"the Sad Batch,\" a play on their nickname \"the Bad Batch.\" He became aggressive towards Omega when the youngling clone threw her food at him in defense of her new friends. Although the trooper initially backed down due to Hunter's intervention, he also chided Omega by telling her to \"know her place.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This clone trooper was equipped with the Phase II clone trooper armor, which was worn by standard clones during the Clone Wars and the early days of the Emperor's reign. Like other clones, he did not wear his helmet during his off-duty hours. His clone trooper armor possessed the standard all-white appearance in contrast to that of the once individualistic clones, who customized their armor prior to the activation of their inhibitor chips through Order 66. The armor bore food stains after Omega and Wrecker hurled their food trays at the trooper who taunted them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The clone trooper appeared in \"Aftermath,\" the first episode of the Disney+ animated series Star Wars: The Bad Batch which aired on May 4, 2021. The clone was voiced by Dee Bradley Baker, who voiced every clone trooper in The Bad Batch and the other animated series including Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}