{"url": "Becka", "categories": ["Category:Legends articles", "Category:Males", "Category:Resistance fighters", "Category:Romins"], "nodes": [{"tag": "h1", "text": "Becka"}, {"tag": "p", "text": "Becka, a native Romin, was the grand palace security officer for Romin's tyrant-dictator Roy Teda, who gave refuge and protection to galactic criminals in exchange for hefty bribes disguised as \"charitable contributions\" paid to his \"charity\" deputy. But Becka led a double life, for he was also an undercover spy for Joylin, the leader of the planet's Citizens' Resistance, a large organization of the world's desperate, oppressed citizens, that sought to oust Teda from power—replacing his tyrannical government with one based on peace and justice."}, {"tag": "p", "text": "When, in 24 BBY, the Jedi Order dispatched a Jedi team to Romin on a mission to track down and capture an escaped criminal of the Republic, mad scientist Jenna Zan Arbor, Becka was the first to greet them on the Teda Landing Platform, high in the clouds above the capital city of Eliior. But unbeknownst to Becka, the Jedi had come as undercover agents as well—impersonating the Slams, a captured criminal gang—as it was the only means of gaining admittance to Teda's criminal-harboring world."}, {"tag": "p", "text": "After doing ID background checks on the new arrivals and making a few comlink communications in his role as security officer, Becka announced to them that, due to their status as important guests, \"Great Leader Teda\" himself wished to extend a personal welcome to the Slams at his grand palace, to which Becka would escort them after a brief city tour."}, {"tag": "p", "text": "Gliding in a luxurious six-seat airspeeder along a broad boulevard, Becka expounded the virtues of their noble city and leader, painting for his guests a utopia of bliss for all planetary citizens—both for those within the capital and outside its walls. The battered security wall that Jedi Master Obi-Wan Kenobi suddenly noticed rising hundreds of meters from the ground buzzed with guard- and surveillance droids. Asking Becka what it was, the security officer gave another rose-colored response: it was the Cloudflower Wall for those citizens who \"preferred\" to live outside the city."}, {"tag": "p", "text": "In truth, as Kenobi well knew, Eliior was populated by the world's wealthy; its oppressed workers, who were required to have passes to enter the city, lived outside the city walls in concentric rings of misery—hovels that grew progressively worse, the greater their distance from the capital. Touring the commerce district, the exclusive shops filled with luxurious goods obviously lacked customers: few could be seen within or without. Next came the palatial residences, glimpsed only behind fortified walls. Made of stone and durasteel, the grand structures were framed by lush gardens and sparkling fountains. Their occupants never went anywhere except under heavy guard."}, {"tag": "p", "text": "The boulevard ended at Teda's grand palace complex, lushly landscaped, which the Slams were ushered into at a security checkpoint. Becka dropped the new arrivals off at the durasteel doors of the main entrance and bid them a friendly farewell."}, {"tag": "p", "text": "Becka encountered Kenobi again immediately after the Slam-imposter, who now worked undercover also for Joylin, stole critical security codes from Teda's private office—codes needed to incapacitate all of the city's security gates, so that the citizens' revolt could begin that evening. With security alarms now ringing wildly, Becka, who had appeared suddenly from a secret door, led the undercover Jedi through hidden panels and passageways until they emerged finally into the grand palace reception room where Teda was hosting a festive event for all of his wealthy criminal-refugees. Becka beckoned the musicians to keep playing as he allayed the fears of the guests, calling the blaring of the security devices a \"false alarm.\""}, {"tag": "p", "text": "Meeting up with the rest of the Slam gang outside on the palatial grounds, Becka advised them against all brash actions and escape routes—to take, rather, a quieter, more effective way of escape so that the revolt might begin in earnest: Becka advised them to simply give an ostentatious showing of irritable outrage at having been so disrupted in their enjoyment of the night's festivities, and to simply walk out of the main gates, leading the entire mass of offended criminal-guests with them. This they did with flourish and success, allowing them to rush the codes to Joylin and permitting the citizens' revolt to begin."}, {"tag": "p", "text": "Becka, who bore the golden skin and eyes of his species, wore, in his role of palatial security officer, an ornate uniform with silver cords looping over his shoulders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}