{"url": "4_ABY/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Years in the Imperial Period", "Category:Years in the Post-Imperial Period"], "nodes": [{"tag": "h1", "text": "4 ABY"}, {"tag": "p", "text": "The year 4 after the Battle of Yavin, also known as Year 39 after the Great ReSynchronization and Year 1004 after the Ruusan Reformation, was a period of time that saw great upheaval in the galaxy. The first month of the year saw the Battle of Endor, one of the most decisive battles of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic—the battle saw the destruction of the second Death Star and the death of the Galactic Emperor Palpatine. Palpatine's death largely fragmented the Empire, with many Imperial officers becoming warlords and seizing territory, and the Rebel Alliance transitioned into the Alliance of Free Planets and then the New Republic in the month after Endor. The first few months after the Battle of Endor also saw the Bakura Incident, the first alliance—albeit a temporary one—between the Empire and the Alliance, and also the Nagai–Tof War as the extra-galactic Nagai and Tof species invaded. Some factions temporarily set this year as 'year 0', until the establishment of the Battle of Yavin-based calendar two decades later."}, {"tag": "h2", "text": "Events"}, {"tag": "h2", "text": "Battles"}, {"tag": "h2", "text": "Births"}, {"tag": "h2", "text": "Deaths"}, {"tag": "h3", "text": "39:3"}, {"tag": "h3", "text": "39:4"}, {"tag": "h3", "text": "39:5"}, {"tag": "h3", "text": "39:9"}, {"tag": "h3", "text": "39:10"}, {"tag": "h3", "text": "39:11"}, {"tag": "h3", "text": "39:12"}, {"tag": "h3", "text": "40:1"}, {"tag": "h3", "text": "Unknown date"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}