{"url": "Unidentified_clone_trooper_4_(Citadel)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Members of the 212th Attack Battalion", "Category:Unidentified clone troopers"], "nodes": [{"tag": "h1", "text": "Unidentified clone trooper 4  (Citadel)"}, {"tag": "p", "text": "This clone trooper served under the command of Jedi General Even Piell around 21 BBY during the events of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During an attack by Separatist forces on Even Piell's cruiser, this clone trooper was taken prisoner, being stripped of his armor, along with Piell and several other surviving crew members and transferred to a prison known as the The Citadel on the planet Lola Sayu."}, {"tag": "h3", "text": "Battle of Lola Sayu"}, {"tag": "p", "text": "Due to the knowledge Piell's had on the Nexus Route, an elite strike team lead by Obi-Wan Kenobi and Anakin Skywalker entered the prison to rescue Piell. When the team learned that Piell had given part of the information to Wilhuff Tarkin, a new plan was devised so that Tarkin and the other officers, including this one, could also be rescued. After the team split up into two squads, with Obi-Wan, Cody and Piell creating a diversion while Anakin, Ahsoka, Rex, Echo and Fives take Tarkin and the naval officers to safety. After Kenobi's team was captured by warden Osi Sobeck and escaped with the help of R2-D2's battle droid squadron, the two teams reunited in the detention facility's landing bay, where they get attacked by a team of droids and are forced to retreat to the lower levels of the prison. There, they contacted the Republic and started moving towards a landing zone, when they got attacked by another squad of droids. The Jedi and clones decided to use rappelling cables to descend a steep cliff in front of them to lose their pursuers, and this trooper got on the back of another clone trooper, of the 212th Attack Battalion. As they started to descend, a BX-series droid commando shot their cable's anchoring point, and they both fell to their death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Jango Fett this clone stood at 1.83 Imperial standard meters."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This trooper utilized white Phase I clone trooper armor (however, he was stripped of it) and a standard DC-15S."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the episodes, the clone was voiced by Dee Bradley Baker, who voices all clone troopers through the series."}, {"tag": "h2", "text": "Appearances"}]}