{"url": "Unidentified_clone_stormtrooper", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Semi-protected articles", "Category:Articles with conjectural titles", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Unidentified clone troopers", "Category:Unidentified Galactic Empire stormtroopers"], "nodes": [{"tag": "h1", "text": "Unidentified clone stormtrooper"}, {"tag": "p", "text": "A clone stormtrooper served as a clone trooper commander in the Grand Army of the Republic during the Clone Wars under the Aleena Jedi General Tsui Choi. After the execution of Order 66—a mandate instructing clone troopers to eliminate their Jedi officers—the clone, now a clone stormtrooper in the Galactic Empire, hunted down Choi on the Outer Rim world Eriadu with the assistance of three other stormtroopers. There, Choi ambushed the troopers and quickly killed the stormtrooper's companions before beheading him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A clone commander, like all clone troopers, was a clone of the Mandalorian bounty hunter Jango Fett. During the Clone Wars, he served in the Grand Army of the Republic under the Aleena Jedi General Tsui Choi. In 19 BBY, Order 66—a mandate instructing the clone troopers to kill their Jedi officers—was issued, the Galactic Empire was founded, and the clone trooper personnel formerly of the Grand Army of the Republic were dubbed Imperial clone stormtroopers."}, {"tag": "p", "text": "A month following the execution of Order 66, the clone stormtrooper tracked Choi, who had survived Order 66, to the Outer Rim Territories world Eriadu. After noticing tracks on the ground in the deeper levels of the world, the stormtrooper and three other clones trailed the Jedi until they were in a dead-end alley with no sign of their prey. When a subordinate of his asked about the need of their mission, the stormtrooper dictated that Order 66 remained in effect. However, the clones were suddenly attacked from behind by Choi, who quickly killed the three companions of the stormtrooper before beheading the commander himself, killing him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a stormtrooper, the clone showed his devotion to the Empire by following his orders, determinedly tracking down Choi on Eriadu. The commander was equipped with clone trooper armor, a kama pauldron, polarized macrobinoculars, a DC-15S, and a thermal detonator. Like all Jango Fett clones, the stormtrooper stood 1.83 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The clone stormtrooper appeared in the one-shot comic Star Wars: Purge, written by John Ostrander and colored by Ronda Pattison. Purge was published on December 28, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}