{"url": "Unidentified_crab_creature", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Creatures of unspecified diet", "Category:Crustaceans", "Category:Non-sentient species", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Unidentified crab creature"}, {"tag": "p", "text": "A non-sentient crab species existed on a planet filled with swamps. During the intergalactic conflict known as the Clone Wars, which began during 22 BBY, the Jedi Obi-Wan Kenobi and Anakin Skywalker scouted the planet. After several escapes from the planet's other dangerous wildlife, they encountered one of the crabs, which tried to intimidate them with its claws. Kenobi stepped on the crab and killed it."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "One specimen of the species was less than a single meter, and was a deep orange in color. It possessed twelve eyes, four of which were on stalks, and two large limbs that ended in large claws. These claws were accompanied by eight smaller claws, six that were used as legs and two more for grasping things. The eyes were all black, though some had green highlights and pupils. The eight eyes on the creature's body were set apart symmetrically, with two large eyes and two small eyes on either side of its face. Underneath its shell it had a mouth-like crevice filled with numerous sharp teeth, and its entire body was covered in small spikes."}, {"tag": "p", "text": "The crab generally lived in or near bodies of water, such as lakes. The planet that the crabs existed on had lakes that were surrounded by muddy shoals and beaches. The beaches were populated with brown and green vegetation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the intergalactic war known as the Clone Wars, which began during 22 BBY and was set between the Galactic Republic and the Confederacy of Independent Systems, the swampy planet that the crabs existed on became a host to a Separatist base. Two Republic Jedi, Jedi Knight Anakin Skywalker and Jedi Master Obi-Wan Kenobi, were sent to scout out the terrain of the world and uncover the enemy establishment. After numerous encounters with the planet's dangerous wildlife, the Jedi encountered one of the crabs after crawling out of a lake. The specimen was rather small when compared to Kenobi's foot, as after the crab attempted to intimidate them with its claws, Kenobi stepped on the crab, crushing it without much effort."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The crabs first appeared in the short story Creature Comfort, one of four stories compiled into the seventh volume of the Star Wars: Clone Wars Adventures trade paperback series, released on January 10, 2007. Creature Comfort was written and illustrated by Matthew and Shawn Fillbach. The comic was colored by Ronda Pattison."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}