{"url": "Unidentified_droid_bounty_hunter", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Junk droids", "Category:Unidentified bounty hunters", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified droid bounty hunter"}, {"tag": "p", "text": "A droid bounty hunter operated during the time of the Galactic Empire. The bounty hunter was a monster droid, made from the body of a B2-series super battle droid and the head of a BX-series droid commando. The droid was one of several bounty hunters hired by the Empire to track down the rogue archaeologist Doctor Chelli Aphra on the planet Arbiflux, but was destroyed by fellow hunter Black Krrsantan, who wanted Aphra alive in order to collect a debt from her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime prior to the Battle of Hoth in 3 ABY, the bounty hunter was hired by the Galactic Empire to capture the rogue archaeologist Doctor Chelli Aphra and her young ward Vulaada Klam. As a previous Imperial system cell that was tracking Aphra had been destroyed by the Rebel Alliance, the Empire wished to send the bounty hunters ahead of their own forces. The droid, alongside a Herglic bounty hunter and the Wookiee Black Krrsantan, tracked Aphra to the planet Arbiflux, where she and Klam were hiding out in the house where she formerly lived with her mother."}, {"tag": "p", "text": "As the bounty hunters approached the house, Aphra was woken by a message from General Airen Cracken of the Rebel Alliance, who warned her that she had been found by the Empire. Aphra and Klam attempted to run, exchanging fire with the droid hunter. Aphra sent Klam's qaberworm Gurtyl to attack the hunters, attempting to use the creature as a distraction. However, Krrsantan wished to collect a debt from Aphra, and thus required her left alive in order to receive what he was owed. The Wookiee attacked the other bounty hunters, killing the Herglic and destroying the droid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid bounty hunter was a monster droid, consisting of the body of a B2-series super battle droid with the head of a BX-series droid commando. At some point, the droid's torso sustained damage in the form of several holes. As the droid's body was that of a B2 super battle droid, it had a blaster built into at least one of its wrists."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of its assignment on Arbiflux, the droid wore a dark red cape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The droid bounty hunter appeared in the comic Doctor Aphra 34, written by Simon Spurrier, penciled by Wilton Santos, Cris Bolson, and Andrea Broccardo, and published by Marvel Comics on July 17, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}