{"url": "Unidentified_female_Jedi_(sarlacc)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Jedi Knights of the Jedi Order", "Category:Unidentified females", "Category:Unidentified Jedi of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Unidentified female Jedi  (sarlacc)"}, {"tag": "p", "text": "An unidentified female Jedi was captured by a sarlacc on Tatooine in 3996 BBY and was digested into oblivion in 2996 BBY, three thousand years before 4 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Earlier in her life, she had previously \"talked\" with a sarlacc through the Force while on an unidentified moon."}, {"tag": "p", "text": "When she was sixty years old, she was walking through Tatooine's Dune Sea when she accidentally fell into the gaping mouth of a young sarlacc. She tried escaping by cutting the sarlacc's tentacles with her lightsaber and leaping to safety, but she was caught mid-leap by a tentacle and dragged back down."}, {"tag": "p", "text": "While in the belly of the sarlacc, she passed the time trading stories with Susejo, a Choi male who had been captured by the creature shortly before the unidentified Jedi. Despite her situation, the unidentified Jedi said she felt sorry for the young sarlacc, since it had taken root on such an inhospitable world."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Thousands of years later, around 4 ABY, Susejo's consciousness had merged with that of the sarlacc. His personality was indistinguishable from that of the beast, controlling its actions and speaking on behalf of the creature. When the infamous bounty hunter Boba Fett fell into the sarlacc, the sarlacc/Susejo \"introduced\" him to the Jedi's remains. When Susejo admitted he missed the Jedi woman, Fett goaded Susejo, making him feel guilty for not helping the Jedi escape. In anger, the sarlacc contracted around Fett's jetpack, creating a means for the bounty hunter to escape."}, {"tag": "h2", "text": "Appearances"}]}