{"url": "Unidentified_female_Imperial_Knight_(Agamar)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Personnel of the Empire-in-exile", "Category:Unidentified females", "Category:Unidentified humans", "Category:Unidentified Imperial Knights"], "nodes": [{"tag": "h1", "text": "Unidentified female Imperial Knight  (Agamar)"}, {"tag": "p", "text": "A Human female with brown hair was a member of the Imperial Knights in 137 ABY. She was one of many Knights who served as a bodyguard to Roan Fel, Emperor of the Empire-in-exile, as he traveled to the planet Agamar to conduct peace talks with members of the Jedi Order. Everyone present disguised themselves as farmers during the negotiations, and the brown-haired female joined several other Knights in pretending to tend to a field close to the talks. All disguises were shed when a Sith strike force attacked, and a skirmish ensued in which the brown-haired female fought. Most of the Jedi and Imperial Knights, including the Emperor, escaped from the Sith and fled the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 137 ABY, a brown-haired Human female served as a member of the Imperial Knights, an order of Force-users who had pledged loyalty to Emperor Roan Fel and his Empire-in-exile. In that year, a large group of Knights that included the brown-haired female served as bodyguards to Fel as he traveled to the planet Agamar. The Emperor was rendezvousing on the planet's surface with representatives of the Jedi Order; the Jedi and Fel had a common enemy in Darth Krayt's Galactic Empire, and both parties hoped to forge an alliance directed against Krayt's forces."}, {"tag": "p", "text": "On the morning of the peace talks, every Jedi and Imperial Knight disguised themselves as Agamarian farmers, and the brown-haired female joined several other Knights in pretending to tend to a field near to the negotiations. While they exercised their deception, Fel and several Imperial Knight Masters met with four Jedi representatives, led by the Jedi Master K'Kruhk. An agreement was reached, but the meeting was interrupted immediately thereafter by Nyna Calixte—the Director of Imperial Intelligence for Krayt's Empire—who was secretly aiding Fel. She rode a local beast into the field where the brown-haired female was stationed, but after two Imperial Knights fired blaster rifles at the animal, she collapsed onto the ground. Calixte hurriedly told the two groups that Krayt's Sith were aware of their meeting and had sent a task force to capture or kill the Emperor."}, {"tag": "p", "text": "A Sith strike team then rose from some nearby swamps, and Antares Draco, the leader of the Imperial Knights, called on his Knights to defend the Emperor. All farmer disguises were jettisoned, and the brown-haired female ignited her lightsaber as the battle began. The Jedi joined their new allies in fighting off the attacking Sith and protecting the Emperor, and the combat saw at least ten Sith fall to the blades of Jedi and Imperial Knights, as well as to Calixte's blaster. Some Jedi and Imperial Knights were slain as well, but most of the survivors, including the Emperor, managed to evacuate the fray on the escape shuttle Defender One."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The brown-haired female was a member of the Imperial Knights, an organization that was dedicated to protecting the Emperor and preserving his Empire. They were considered to be among the most dangerous and talented Force-users in the galaxy. On Agamar, the brown-haired female fought in a skirmish against a large group of Sith, using the order's standard lightsaber model and wearing Imperial Knight armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The brown-haired female made her first appearance in the forty-fifth issue of the comic series Star Wars: Legacy, depicted as an Agamarian farmer working on a field. She and four other Imperial Knights shed their disguises in the following issue, revealing lightsabers and armor beneath. They were shown in a single panel, and it was not revealed whether they survived the battle with the Sith. Both issues were written by John Ostrander, penciled by Jan Duursema, and released in 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}