{"url": "Unidentified_extra-galactic_spacer", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Unidentified individuals"], "nodes": [{"tag": "h1", "text": "Unidentified extra-galactic spacer"}, {"tag": "p", "text": "An unidentified spacer from another galaxy traveled through the Dragon's Spine, an asteroid belt in orbit around the barren planet Tatooine, at some point before the Naboo Crisis in 32 BBY. The spacer collided with an asteroid and made a forced landing on the planet. Stranded on Tatooine with their damaged starship, the spacer met Watto, a local Toydarian junk dealer, who offered to provide his visitor with spare parts for money. The marooned spacer then participated in games at Jabba the Hutt's Game Plaza until they earned enough wupiupi credits to buy new ship parts. Having successfully repaired their spacecraft, the spacer left Tatooine for good."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stranded on Tatooine"}, {"tag": "p", "text": "While it was often thought that a hyperspace disturbance beyond the edge of the galaxy rendered intergalactic travel impossible, counter examples occurred in recorded history. At some point before the events of the Invasion of Naboo in 32 BBY, one such extra-galactic spacer traveling aboard a starship with crimson markings reached the binary Tatoo star system, in the Outer Rim Territories. As that individual was flying through the Dragon's Spine, the asteroid field surrounding the desert planet of Tatooine, their starship collided with one of the asteroids. The damaged vessel, spinning out of control, crashed onto the sun-scorched world, leaving its pilot stranded. Committed to finding help, the spacer then headed to the city of Mos Espa, where a Toydarian merchant named Watto had a shop. Eager to turn the newcomer into a paying customer, Watto assured the spacer he could provide high-quality ship parts to mend the damaged ship. The foreigner was told they could earn wupiupi credits if they entered Jabba's Game Plaza, a gaming venue organized by the local crime lord, Jabba Desilijic Tiure the Hutt. In order to have the best chance of success, the spacer was even lent a droid helper named Z-P70, one of the Toydarian's robotic assistants. Watto also provided the spacer with a checklist showing which parts were needed to rebuild the ship and which ones were available in his shop."}, {"tag": "h3", "text": "Sojourn in Mos Espa"}, {"tag": "p", "text": "At the Game Plaza, the stranded spacer entered four gaming activities in which they played for money against local celebrities. The spacer faced the famous podracer Sebulba, challenging him to his very own game of \"Dueling Dice.\" Another player was Ratts Tyerell, who hosted a giant snakes and ladders game known as \"Ratts Race.\" Under a yellow and green tent was Teemto Pagalies, with his Digotto gaming booth. The stranger even played the Holochex with Jabba the Hutt himself, beating the crime lord at his own game. Gradually, the spacer raised enough money to purchase the required spare parts rom Watto. However, the last required component, a StarMark III hyperdrive, was still too expansive for the offworlder to afford with their gains. As the ship was only equipped with sublight engines, it could merely travel at a fraction below lightspeed. Without a hyperdrive unit, the stranger would never be able to return to their galaxy at a reasonable speed. The spacer then accepted to work for Watto, collecting space junk in the nearby asteroid field. Eventually, the damaged starship was fully repaired in the Toydarian's private hangar, and the spacer left Tatooine for good."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The spacer was skilled at strategy game and other mind sports. Jabba the Hutt himself said the stranger had \"the heart of a Hutt,\" a real compliment since Hutts considered themselves superior to most other life-forms in the galaxy. The stranger also managed to gain the respect of the other gaming hosts. In spite of their extra-galactic origins, the spacer understood Galactic Basic Standard well enough to barter with Watto and the other players at Jabba's Game Plaza."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Math: Jabba's Game Galaxy, an educational video game released by Lucas Learning in 2000, the player assumed the role of a marooned spacer. The character's gender, species and name were never specified in-game, so the player could give the character a name of their liking. Unlike other game characters—like Rookie One from Star Wars: Rebel Assault or Jaden Korr from Star Wars: Jedi Knight: Jedi Academy—this spacer has not been reused or given a proper canonical identity in later works."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}