{"url": "Bedoch", "categories": ["Category:Legends articles", "Category:Corellian Jedi", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bedoch"}, {"tag": "p", "text": "Bedoch was a male Human Jedi Master who served the Galactic Republic and the Jedi Order during the Cold War with the Sith Empire. A member of a sect of the Order known as the Corellian Jedi, Bedoch was renowned for both his patriotism and his paranoia. He consistently feared the end of days, and came to see the Battle of Corellia as just such an event, barricading himself in the Republic Foundation Museum, where he perished."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Corellian, Bedoch was trained in the ways of the Force by the Jedi Order, achieving the rank of Jedi Master by the time of the time of the Cold War between the Galactic Republic and the Sith Empire. Like many Jedi born on Corellia, Bedoch possessed a deep-rooted patriotism for his homeworld and was a devoted member of the sect of Corellian Jedi which chose to take on missions relating to the planet and her people. Renowned throughout the Order and the ranks of the \"Green\" Jedi of Corellia, Bedoch was on his homeworld when the Empire invaded. Fighting valiantly, Bedoch saw the Empire's arrival and the ensuing occupation as a sign of the end of days for Corellia. Refusing to surrender or to retreat to the Jedi Enclave with his fellows, Bedoch fled to the Republic Foundation Museum to defend Corellia's history."}, {"tag": "p", "text": "Proclaiming the Imperials to be an infection needing to be removed, he defiantly refused to leave the Museum when a strike team was sent in after him. Defying the Empire and without any support from the Jedi at the Enclave, Bedoch was forced to fight alone in the Museum's halls. Valiantly attacking the strike team with his lightsaber, Bedoch was swiftly outnumbered and killed. When the Imperial team searched the Jedi's body they discovered Bedoch's personal access codes to the Jedi Enclave, thus allowing them to access it without setting off the security klaxons."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like most Jedi, Bedoch was taught the way of lightsaber combat, and became proficient in the skill once he attained the rank of Master. During the Cold War, Bedoch wielded a double-bladed lightsaber which emitted emerald blades."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}