{"url": "Unidentified_female_(Anchorhead)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Tatooinians", "Category:Unidentified females", "Category:Unidentified humans"], "nodes": [{"tag": "h1", "text": "Unidentified female  (Anchorhead)"}, {"tag": "p", "text": "A Human female lived on the planet Tatooine around the time of the Battle of Yavin. A few days before the battle, the farmboy Luke Skywalker nearly ran her over with his landspeeder in the city of Anchorhead."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female lived in the settlement of Anchorhead on the Outer Rim planet Tatooine. She was aged by the time of the Battle of Yavin, and she wore a metallic sun shawl to protect herself from the twin suns of the Tatoo system."}, {"tag": "p", "text": "Late in 0 BBY, the woman was walking on a quiet, deserted street of Anchorhead when she was nearly run over by Luke Skywalker, the nephew of a local moisture farmer named Owen Lars. The farmboy was on his way to the Tosche power station in his X-34 landspeeder to tell his friends about a battle he had spotted over their planet. The woman quickly ran out of Skywalker's way and shouted after him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The woman had a dislike for youngsters who raced the streets at top speed in landspeeders, and chided them for doing it. When Luke Skywalker nearly ran her over, the woman shook her fist angrily at him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The woman appeared simply as \"Woman\" in the final script of Star Wars: Episode IV A New Hope; played by a local Tunisian woman, the character's scene was filmed during principal photography in front of a mosque in Djerba, Tunisia, on April 4, 1976. George Lucas cut the scene before the release of the film, and no image of the scene was released until the Star Wars Insider 41 magazine published a still from it in The Evolution of Star Wars: Exploring the Lost Cut article in 1998, which raised the filmed version of the scene to G-canon status, the highest level of Star Wars continuity."}, {"tag": "p", "text": "The woman was featured in three sources that adapted A New Hope. Her first appearance, in which she uttered a slightly different line from the one spoken in the cut scene, was in the December 1976 novelization of A New Hope, ghostwritten by Alan Dean Foster. She uttered the same line as in the script in two later sources: the first issue of Marvel Comics' Star Wars series and the young reader book A New Hope: The Life of Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}