{"url": "Unidentified_gundark_nest", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Alaris Prime locations"], "nodes": [{"tag": "h1", "text": "Unidentified gundark nest"}, {"tag": "p", "text": "The gundarks, a non-sentient predatory species, had a nest on the moon Alaris Prime. Between the years 39 BBY and 36 BBY, the nest was attacked by the forces of the Trade Federation Droid Army and a group of Wookiee warriors, who were both attempting to colonize the moon. The nest was destroyed, and the gundarks became extinct on Alaris Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A nest was created on the moon Alaris Prime by the gundarks, a species of non-sentient predators. The nest was built in a small clearing in one of Alaris Prime's forests and could be reached by crossing a shallow river. Most of the ground in the area was covered in dirt. Several gundark corpses inhabited the nest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Between the years 39 BBY and 36 BBY, two groups—the company known as the Trade Federation and members of the Wookiee species—attempted to colonize Alaris Prime. Both of these parties were attacked by the gundarks, resulting in the factions deciding to assault the nest and destroy them."}, {"tag": "p", "text": "On advice from Jedi Master Qui-Gon Jinn, who had been sent by the Jedi High Council to oversee their colonization effort, the Wookiee colonists, under the leadership of Chewbacca, trained warriors at a nearby base to attack the gundarks. The Trade Federation also sent a squad of Battle Droid Beta Versions from its army to destroy the nest. The battle droids arrived there first and began attacking the gundarks. A short time later, the Wookiees reached the nest, killing two gundarks that they encountered nearby. Upon killing all of the gundarks at the nest, one of the battle droids ordered its comrades to open fire on the Wookiee warriors; however, they fought back and destroyed all of the droids. The nest was destroyed in the attack, and gundarks became an extinct species on Alaris Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The gundark nest first appeared in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds. The nest appears in the third level of the Wookiee tutorial campaign, \"Building an Army,\" where the player uses the Wookiees and must train soldiers to attack the gundarks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}