{"url": "Unidentified_frog_species", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Amphibian sentient species", "Category:Unidentified frog species", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Unidentified frog species"}, {"tag": "p", "text": "A frog-like species was a sentient species."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The species was amphibious, capable of breathing both air and water. Their skin color could be pink or blue. When inside an egg they were a dark orange. The species was capable of and often engaged in bipedal locomotion, but they could hop, which allowed them to move faster."}, {"tag": "p", "text": "They also had long tongues which could be used to grab things quickly."}, {"tag": "p", "text": "The species' eggs could not travel in hyperspace, as it would kill them."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "They laid eggs in which more frogs were born. The eggs needed to be fertilized by a male. These eggs were edible by Yoda's species."}, {"tag": "p", "text": "After hatching, tadpoles would emerge from the egg. The tadpoles would start to form arms and legs and take on an orange color as well as tiny spikes on its back."}, {"tag": "p", "text": "At least two members of the species spoke Frog, which involved the use of clicks and groans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 9 ABY, a frog nicknamed \"Frog Lady\" was attempting to get to Trask, where her husband found a place to live. They eventually made it to the moon where they resided in their home."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The species was first mentioned in \"Chapter 10: The Passenger,\" the second episode of the second season of the Disney+ television series The Mandalorian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}