{"url": "Beedo%27s_Wild_Ride", "categories": ["Category:Legends articles", "Category:Ando Prime locations", "Category:Podracing courses"], "nodes": [{"tag": "h1", "text": "Beedo's Wild Ride"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Beedo's Wild Ride was a podracing course on Ando Prime and the third race of the Amateur Podracing Circuit. The podracer Aldar Beedo performed quite well on this track, so it was named after him. The course took place on slippery snow and ice, causing many crashes, and ergo much entertainment for the fans."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Beginning near the Bendu Statue, racers flew through the side of a massive mountain and into the canyons below. Turning left into the frozen waterways, racers could choose to take a secret route through an iced-over tunnel leading through the mountain, shaving seconds off their time. Quickly, as the main track went into the mountain, the pods had to traverse a long, creaky wooden bridge and jump over a pit and through a waterfall. Immediately afterward, they had to slide around a quick hairpin, which put the racers outside again. Subsequently, they had to travel over several stories of frozen lakes, stair-stepping down while avoiding walls and icebergs. Traveling further and quicker along the snowy route, the racers had to keep speed up to avoid falling into the bottomless pits below. The trail went into the mountain again, and they finally made it around the cliffs back into the stadium."}, {"tag": "p", "text": "Due to the slippery nature of Ando Prime's courses, racers equipped with high-traction grips excelled in this environment. With the long straightways on this course, high top-speed ratings were common."}, {"tag": "h2", "text": "Tournament and race number"}, {"tag": "p", "text": "This course was the third race in the Amateur Podracing Circuit tournament."}, {"tag": "h2", "text": "Track favorite"}, {"tag": "h2", "text": "Other tracks of Ando Prime"}, {"tag": "h2", "text": "Appearances"}]}