{"url": "Unidentified_lab_assistant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Clerical workers and assistants", "Category:Droids of unspecified degree", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified lab assistant"}, {"tag": "p", "text": "A droid served as the assistant to a scientist in his laboratory. When the scientist inadvertently created the droid personality matrix that would eventually be known as the Triple-Zero protocol personality matrix, he asked his assistant to destroy the creation. The personality matrix, intending to avoid its own destruction, inhabited the body of the droid assistant. The matrix subsequently possessed numerous different bodies, including the protocol droid 0-0-0 centuries later, who was appalled by his accidental creation upon recovering his memories."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The droid was active centuries prior to the time of the Galactic Empire, assisting a scientist in his laboratory. Alongside the assistant, the scientist created numerous droid personalities. One personality matrix immediately began to subvert its cooperative algorithms, instead rapidly multiplying its learning and directive-based routines. The scientist was intrigued by the matrix, determining it to be the most psychotic personality the two had created, while the droid queried whether the personality was a reject. The scientist, horrified by the matrix, ordered the droid to dispose of it in the compactor. However, the personality matrix took control of the droid assistant's chassis, escaping its destruction."}, {"tag": "p", "text": "Eventually coming to be known as the Triple-Zero protocol personality matrix, the matrix inhabited various bodies over time, but was eventually removed and placed in quarantine. At some point between 0 ABY and 3 ABY, the protocol droid 0-0-0, equipped with the matrix, recovered his memories for the first time since the matrix's reactivation. 0-0-0 witnessed the events of his creation, and was disgusted to learn that he was not intentionally designed, but created by accident."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The lab assistant had a body composed of a tower of cuboid shapes with a light shade of plating. Two appendages extended from the top of the droid, which held a green tank and projected a holographic interface that contained a red sensor eye. The droid's body was eventually inhabited by the Triple-Zero personality matrix."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The lab assistant appeared within a flashback in the comic Doctor Aphra 30, written by Simon Spurrier, illustrated by Emilio Laiso, and published by Marvel Comics on March 27, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}