{"url": "Unidentified_male_Imperial_technician_(Darth_Marr%27s_flagship)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Military personnel of the Sith Empire", "Category:Technicians", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel", "Category:Unidentified Sith Empire personnel"], "nodes": [{"tag": "h1", "text": "Unidentified male Imperial technician  (Darth Marr's flagship)"}, {"tag": "p", "text": "A Human male served as a technician in the Imperial Military of the reconstituted Sith Empire during the Galactic War with the Galactic Republic. He served in a joint task force with Republic forces, and made a bet with a female soldier that a Republic individual would kill an Imperial."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3636 BBY he was among the Imperial forces brought along by the Sith Lord Darth Marr to serve in a joint task force with Republic forces, formed to search Wild Space for both the former Sith Emperor and the mysterious force that had attacked several worlds. The technician served aboard Darth Marr's flagship, and made a bet with a female soldier that someone would be killed before the mission was over. As the individual who defeated the Revanites walked past them, he and the soldier argued. The soldier believed that since there had been no deaths, she had won the bet, to which the technician replied that the mission wasn't over yet and he was sure someone from the Republic would kill an Imperial. She pointed out that the Republic was outnumbered and had just as much reason to cooperate as the Empire did, but he dismissed her reasoning."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The technician had brown eyes and hair, and fair skin. He was very paranoid regarding the Republic forces aboard Marr's flagship, certain one of them would kill an Imperial."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The technician first appeared in the first chapter of Star Wars: The Old Republic: Knights of the Fallen Empire, a 2015 expansion to the 2011 video game Star Wars: The Old Republic, a massively-mulitplayer online game developed by BioWare. In the game, the soldier appears as a non-player character only identified as \"Imperial Technician\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}