{"url": "Unidentified_male_(Force_user)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Humanoids", "Category:Unidentified Force-users", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified male  (Force user)"}, {"tag": "p", "text": "A muscular male Force user was a student of the rogue former Jedi Shon-Ju in the year 21 BBY. Shon-Ju had been rejected from the Jedi Order and spent time in exile, learning new ways to use the Force. Shon-Ju then took this Force-user and two other students and taught them to channel the Force through their hands."}, {"tag": "p", "text": "In 21 BBY, Shon-Ju and his students pursued the mercenary Attuma Duum to the moon of Cavamina Minor in order to stop his crimes. The Jedi Order had also sent Aayla Secura to stop Duum. Secura was forced to flee Duum's forces and crash-landed on Cavamina Minor. Shon-Ju and his students assisted Secura by directly engaging Duum's mercenaries in combat; this man grabbed Secura when she tried to flee. After Shon-Ju and his students forcing Duum's men to flee, Secura collapsed from her injuries; this man informed Shon-Ju she was injured. They went back to Shon-Ju's hideout. When the Twi'lek Jedi awoke, she was alone. She found Shon-Ju overlooking his students' training and questioned him about his life. Down below, Shon-Ju's students practiced channeling the Force by striking a large rock as part of their training."}, {"tag": "p", "text": "Secura and Shon-Ju agreed to join forces and stop Duum. Although they destroyed Duum's operation, Shon-Ju betrayed Secura but was injured and forced to flee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "This student was trained in a particular way and was able to focus the Force in combat. Shon-Ju said his students were learning as much from him as he was from them. He wore Jedi-style robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This male Force-user appears in the 2010 graphic novella The Clone Wars: Deadly Hands of Shon-Ju."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}