{"url": "Beemon_package", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Cybernetic implants"], "nodes": [{"tag": "h1", "text": "Beemon package"}, {"tag": "p", "text": "A Beemon package was a powerful cybernetic implant produced by Beemon Laboratories and used around the time of the Jedi Civil War. It allowed organic beings equipped with the device to have greater resistance to pain and stress caused by injuries and physical exertion."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Beemon package was a high-powered cybernetic implant that was used to override an organic being's natural reactions to injuries, pain, and stress. The implant allowed users to endure increased amounts of physical exertion and injuries than would usually be possible. Anyone who used a cyber reaction system required a large amount of training with implants before they were strong enough to handle the implant's effects. The implant was colored red over most of its surface, with lighter shades closer to the edges."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Beemon packages were produced by Beemon Laboratories and were high-grade implants when in use during the years surrounding the Jedi Civil War, a conflict fought between the Galactic Republic and the Sith Empire. In 3956 BBY, the Rodian merchant Tyvark Luowan had a Beemon package that he was selling for the price of 7,500 credits at his store in Ahto City on the planet Manaan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Beemon package first appeared in Star Wars: Knights of the Old Republic, a 2003 video game produced by BioWare. In the game, its only appearance was as a purchasable item at the shop of the merchant Tyvark Luowan in Ahto City on Manaan. It was a level-three implant in the game and gave the user a bonus to his or her constitution attribute."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}