{"url": "Unidentified_male_Sith_Saber_(Kesh)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Sith Sabers", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Sith"], "nodes": [{"tag": "h1", "text": "Unidentified male Sith Saber  (Kesh)"}, {"tag": "p", "text": "A Human male Sith Saber was a member of the Lost Tribe of Sith on the planet Kesh. In 41 ABY, the Human, along with fellow Saber Shura and another Saber, met Sith Tyro Vestara Khai when she was summoned before the Tribe's ruling council, the Circle of Lords, in the city of Tahv. When Khai arrived, the Sabers greeted the Tyro, and Shura showed her to the Circle of Lords."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male was born on the remote Wild Space planet Kesh, where he lived around the time of the Second Galactic Civil War. Due to his Force-sensitivity, he was trained by the Lost Tribe of Sith, descendants of a group of Sith who had been stranded on Kesh thousands of years previously during the Great Hyperspace War. By 41 ABY, he had attained the rank of Sith Saber in the Tribe. In that year, a Sith Meditation Sphere called Ship arrived on the world and created a bond with the Sith Tyro Vestara Khai."}, {"tag": "p", "text": "Khai was then summoned before the Tribe's ruling council, the Circle of Lords, in the capitol building in the Kesh capital city of Tahv. There, the male Saber awaited Khai alongside two fellow Sabers, Shura and a female Saber. When Khai arrived, she was greeted by the three Sabers and taken by Shura to the Circle of Lords."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive, the Human male was trained by the Lost Tribe and successfully reached the rank of Sith Saber. The Tyro Khai was unable to sense the three Sabers until she could hear the sound of their boots. During the entire conversation with Khai, the male Saber remained silent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Saber appeared briefly in the 2009 novel Omen, the second installment in the Fate of the Jedi series. He has no spoken lines in the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}