{"url": "Unidentified_male_Imperial_Knight_II_(Agamar)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Personnel of the Empire-in-exile", "Category:Unidentified humans", "Category:Unidentified Imperial Knights", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified male Imperial Knight II  (Agamar)"}, {"tag": "p", "text": "A Human male with a mustache and goatee was an Imperial Knight in 137 ABY. He was part of a large group of Knights that accompanied Emperor Roan Fel of the Empire-in-exile to the planet Agamar in that year, serving as a bodyguard while Fel conducted peace talks with members of the Jedi Order on the planet's grassy plains. Everyone involved with the negotiations disguised themselves as farmers; the bearded male and several other Imperial Knights stood away and pretended to tend to a field close to the talks. However, he and everyone else cast off their disguises when a Sith strike team attacked. The bearded male fought in the ensuing battle, and the Emperor, as well as most of the Imperial Knights and Jedi, were able to evacuate the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 137 ABY, a Human male with a mustache and a goatee was a member of the Imperial Knights, a Force-using organization whose members dedicated themselves to preserving the Empire-in-exile and protecting its Emperor, Roan Fel. The bearded male was one of many Imperial Knights who accompanied Fel to the planet Agamar in that year as bodyguards while the Emperor secretly met with members of the Jedi Order. On the planet's grassy plains, every Jedi and Imperial Knight donned a farmer disguise, and several Imperial Knight Masters stood with Fel as he and the Jedi Master K'Kruhk negotiated an alliance against the Sith Lord Darth Krayt's Empire. The bearded male and several other Imperial Knights stood away from the talks, however, promoting their farmer deception by pretending to work on a field. Fel and K'Kruhk struck an agreement without incident, but the proceedings were interrupted soon after by Nyna Calixte—the Director of Imperial Intelligence for Krayt's Empire—who was secretly an ally of Fel's."}, {"tag": "p", "text": "Calixte rode a local animal into the field where the bearded male stood and dismounted after two Imperial Knights fired blaster rifles at her steed. She told the Jedi and Imperial Knights that Krayt's Sith knew about the meeting, and that a Sith–Imperial task force was on its way to Agamar to capture or kill the Emperor. When a Sith strike team rose from nearby swamps, a battle began. The bearded male shed his farmer robe and drew his lightsaber when Antares Draco, the leader of the Imperial Knights, called on his Knights to defend the Emperor. The Jedi participated in the attempt to protect the Emperor, and at least ten Sith fell to the blades of their enemies, as well as to Calixte's blaster. Several Imperial Knights and Jedi died in the fray, but Fel and most of the survivors evacuated the battle on the escape shuttle Defender One."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As an Imperial Knight, the bearded male was part of an organization whose membership was limited to beings who could use the Force. Imperial Knights were said to be among the most talented and dangerous Force-users in the galaxy. The bearded male used the order's standard lightsaber and wore Imperial Knight armor on Agamar, where he helped fight off an attacking Sith force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "John Ostrander and Jan Duursema created the bearded male, who first appeared in the forty-fifth issue of the comic series Star Wars: Legacy as an Agamarian farmer working in a field. In the following issue, he and four other Imperial Knights forsook their farmer robes to reveal their Imperial Knight armor and lightsabers. They appeared in a single panel of the issue, and it was not indicated whether or not they survived the battle with the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}