{"url": "Unidentified_patrol_cruiser", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Patrol craft", "Category:Unidentified cruisers"], "nodes": [{"tag": "h1", "text": "Unidentified patrol cruiser"}, {"tag": "p", "text": "A patrol cruiser belonged to the Malarian Alliance."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A patrol cruiser used by the Malarian Alliance was 150 meters in length with a tapered bow. The symbol of the Alliance was painted on the bow. It was armed with laser cannons, and its sensor array could be obscured by space dust. The ship had an attached boxy shuttle and life pods. The crew included a communications officer, pilot, and navigator. The ship's bridge had viewports."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 33 BBY, the patrol cruiser was captained by Krempil and assigned two Jedi observers, Dooku and Ring-Sol Ambase, to hunt Hethra Mcgrrrr's pirate gang. The crew tracked Mcgrrrr's ship, the Random Mallet, to an area of space near a nebula at the edge of the Wild Space region. The cruiser fired on the Random Mallet, disabling its systems. After picking up a transmission in an alien language, the cruiser was hit by a concussion missile. The impact destroyed the navigation console and caused a hull breach in the viewport. Krempil ordered an evacuation, but Dooku overruled him and adjusted the shields over the breach while Ambase sprayed sealant. The Random Mallet was able to jump to hyperspace, leaving the cruiser's crew to trace the transmission to a small spacecraft. Dooku and Ambase took the shuttle to dock with the craft and discovered an alien baby. A data storage device provided the baby's name: Nuru Kungurama. The Jedi brought the baby back to their Temple while another task force was assigned to hunt McGrrrr."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cruiser appears in the first chapter of Ryder Windham's 2012 young readers novel, The Clone Wars: Secret Missions 4: Guardians of the Chiss Key, which serves as a distant prologue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}