{"url": "Unidentified_protocol_droid_(Accresker_Jail)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Alliance to Restore the Republic droids", "Category:Unidentified protocol droids"], "nodes": [{"tag": "h1", "text": "Unidentified protocol droid  (Accresker Jail)"}, {"tag": "p", "text": "A protocol droid served the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. The protocol droid was aboard a Rebel Alliance frigate when it came under attack by the Imperial wreckage-prison Accresker Jail and Accresker Penal Legion, its attack force composed of prisoners. The protocol droid, alongside an astromech droid, attempted to hide in an escape pod, which landed back in the wreckage. Chelli Aphra, a prisoner aboard Accresker, came across the escape pod and destroyed the droids."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War against the Galactic Empire, the protocol droid served the Alliance to Restore the Republic. On one occasion between 0 ABY and 3 ABY, the protocol droid operated aboard a EF76 Nebulon-B escort frigate of the Rebellion. The frigate was attacked by Accresker Jail, an Imperial wreckage-prison that used its prisoners in the Accresker Penal Legion, an expendable fighting force."}, {"tag": "p", "text": "Alongside an astromech droid, the protocol droid tried to hide in one of the vessel's escape pods. The pod landed on the edge of the wreckage, just within the extended airdome of the prison. The rogue archaeologist Chelli Aphra, one of Accresker's prisoners, was led to the escape pod by the probability droid Dek-Nil in an escape attempt. The protocol droid pleaded not to be destroyed, but Aphra shot the two droids, intending to take the escape pod. Before the droids' destruction, one of them captured a static image of Aphra, sending the hologram back to the Rebellion."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The protocol droid had blue plating and yellow photoreceptors. When discovered by Aphra, the droid declared that it and its astromech companion were unarmed and had been hiding in the escape pod."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The protocol droid appeared in Doctor Aphra 20, a comic written by Simon Spurrier, penciled by Kev Walker, and published by Marvel Comics on May 23, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}