{"url": "Unidentified_red-skinned_Inquisitor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Individuals of unspecified species", "Category:Inquisitors", "Category:Unidentified females", "Category:Unidentified Force-users", "Category:Unidentified Galactic Empire personnel"], "nodes": [{"tag": "h1", "text": "Unidentified red-skinned Inquisitor"}, {"tag": "p", "text": "During the reign of the Galactic Empire, a female red-skinned Inquisitor served under Darth Vader. The Inquisitor accompanied Vader, Fifth Brother, and another Inquisitor to hunt down Eeth Koth. During the mission, the Inquisitor was tasked with capturing Eeth Koth's daughter. She intercepted the baby and her mother and stole the infant. She then brought it back to Vader as he killed Koth."}, {"tag": "p", "text": "Vader and the Inquisitors returned to the Inquisitorius Headquarters and the red-skinned Inquisitor and Twi'lek Inquisitor toasted to another Jedi killed. While they discussed what Vader would do after the Jedi were completely gone, Vader approached them and attempted to kill the red-skinned Inquisitor. The Twi'lek Inquisitor held him off while she escaped and he followed her. Vader made chase and they attempted to kill him. They managed to knock him down, but he froze them with the Force and killed them."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hunt for Eeth Koth"}, {"tag": "p", "text": "As a member of the Inquisitorius, the red-skinned Inquisitor was a former member of the Jedi Order who fell to the dark side of the Force. Years after Order 66, she accompanied Darth Vader, Fifth Brother and a Twi'lek Inquisitor to hunt former Jedi Master Eeth Koth, who was removed from the Jedi High Council prior to Order 66, on a desert planet. Vader confronted Koth shortly after his wife Mira had given birth to their baby, and Koth pleaded to be spared as he was now only a priest for the Church of the Ganthic Enlightenment, even offering Jedi codes and information. After Koth was unable to persuade Vader, he told Mira and the newborn baby to escape as he attacked and dueled Vader. During the lightsaber duel, Vader instructed the three Inquisitors to recover the baby for induction into Project Harvester."}, {"tag": "p", "text": "The red-skinned Inquisitor, Fifth Brother, and the Twi'lek Inquisitor gave chase, and decided to split up as they could cover more ground. Searching alone, she used the Force to sense the baby's presence and therefore locate her. As Mira was about to board her father's shuttle, the red-skinned Inquisitor stopped her. Mira pleaded with her, hoping to create a relation as they were both women, and eventually the Inquisitor decided to let Mira and the child onboard the shuttle."}, {"tag": "p", "text": "As the other Inquisitors arrived and questioned why she let the baby go, the Inquisitor replied that she hadn't, and used the Force to capture the baby. The red-skinned Inquisitor then said that she had allowed Mira initially to escape, so that Mira would suffer and no longer have trust in others. She and the others returned to Vader with the baby as Vader continued to duel Koth, and informed Vader that the baby had been successfully recovered. Koth, now distracted, was impaled in the back and killed, and Vader and the others departed the planet in their Zeta-class shuttle."}, {"tag": "h3", "text": "Going rogue and death"}, {"tag": "p", "text": "Vader and the Inquisitors returned to the Inquisitorius Headquarters and gave Koth's child to the nursemaids. The Grand Inquisitor approached Vader and departed to the tower's conference room, while the red-skinned Inquisitor and the others eventually went to a bar in the tower to celebrate the success of their mission. As part of the celebration, she and the Twi'lek Inquisitor sat down and drank Dust Juice, a local beverage of Koth's planet, which they both found unpleasant to drink. During their conversation, the red-skinned Inquisitor and her Twi'lek companion speculated what Vader would do when all of the Jedi were exterminated. While conversing on the subject, Vader interrupted and ignited his lightsaber."}, {"tag": "p", "text": "Upon witnessing Vader's action against the two Inquisitors, The Grand Inquisitor asked his master if what he was doing was a test or an indication of more training, to which Vader coldly denied. Seeing Vader's blade, the Inquisitor was ordered by her fellow Inquisitor to run as he contained Vader, who attempted to kill the duo upon sensing their camaraderie connection, a weakness her fellow believed strength, expressing that Koth's death should have served as a lesson about attachments. Though offering the Twi'lek to remain in the Inquisitorius, her partner chose to follow her and became rogue. Politely declining the help of the Grand Inquisitor and the other Inquisitorius, Vader started to chase the two Inquisitors."}, {"tag": "p", "text": "Seeing her fellow Inquisitor running with her, the Inquisitor replied to her partner that Vader needed no reasons to kill people as he just killed them when the Twi'lek asked her why Vader attacked them. She then told him that she couldn't believe that he got in Vader's way to save her, leading the Twi'lek to respond that he had told her how he felt, guessing that he had proved it to the Dark Lord of the Sith, leading the Inquisitor to respond that it had been a stupid idea as Vader would now come to take them out. With not other options, the two Inquisitors resolved to murder Vader and then escape from the Empire. Meanwhile, Vader and two Imperial shock troopers followed them aboard an EasyRide passenger airspeeder. The Inquisitors managed to destroy the airspeed, leading Vader to jump to another to then fall from it as the Inquisitors' blades destroyed it into another airspeeder."}, {"tag": "p", "text": "Aboard another airspeeder accompanied by a droid, she was told by her fellow Inquisitor that Vader was still coming for them, promising him to kill Vader together. The Sith Lord launched them an airspeeder, but missed. The Inquisitors then performed the same attack and succeeded, knocking Vader into a building just as he jumped from his vehicle to kill them. Jumping into the building to kill their former master, she verified that Vader was still alive as her partner expressed his surprise that both of them had actually managed to beat the Emperor's enforcer. She then took her lightsaber to kill Vader, assuring her former master that she knew just one thing about him after all their work together: that he deserved death. However, Vader used the Force to freeze the Inquisitors in place. In their final moments, the two expressed regret, before Vader used the Force to impale each with the other's lightsaber, killing them both."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the chase, Vader reported the actions of the two Inquisitors to the Emperor in the Imperial Palace. Palpatine asked him about evidence of the Inquisitor's treachery, to which Vader told his Sith Master that the Inquisitor had been reported by Fifth Brother as allowing Mira and her daughter to escape and just took the baby once she realized that she was being spotted, to which Vader commented that he always had suspicions of her, assuring his master that she ensnared the Twi'lek Inquisitor as part of her \"plan\" to build a coalition against them. The Emperor, however, was furious with Vader as during the chase, one of the airspeeders crushed a Gran senator of the Imperial Senate, leading him to relocate the headquarters of the Inquisitorius off-world in Fortress Inquisitorius on the moon Nur."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female individual, this Inquisitor had red skin, blue eyes and brown hair. She was manipulative, and cruel, as she appeared to allow Mira and her child to escape only to capture the child as Mira was departing, believing that Mira would no longer trust others. She was also curious of what drove Vader and what objectives he would set for the Inquisitorius after the eradication of all the Jedi. When he began hunting her, the Inquisitor decided that her sole objective was to kill Vader, so she could be free."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "The red-skinned Inquisitor was able to use the Force to detect ripples and locate an individual and was also able to use move objects as big as airspeeders with the Force from a considerable distance."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The red-skinned Inquisitor wore the traditional color scheme of the Inquisitorius of gray and black. The Inquisitor made use of a double-bladed spinning lightsaber and also wore a helmet with white markings and a red visor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The red-skinned Inquisitor appeared in Darth Vader: Dark Lord of the Sith 19, a 2017 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}