{"url": "Beggar%27s_Canyon", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Nature stubs", "Category:Canyons", "Category:Mos Espa podrace circuit locations"], "nodes": [{"tag": "h1", "text": "Beggar's Canyon"}, {"tag": "p", "text": "Beggar's Canyon was a dry river bed that cut through Ben's Mesa, on the desert world of Tatooine. Its landmarks included the so-called Dead Man's Turn, the Diablo Cut, and the Stone Needle. Beggar's Canyon led to the Desert Plain on one side, and to Ebe Crater Valley on the other side, with the junction being known as the Notch."}, {"tag": "p", "text": "In the last decades of the Galactic Republic, Beggar's Canyon was inhabited by hermits who had been chased out of Mos Espa. They resided in small houses nested in the canyon's rock walls. Despite being inhabited, Beggar's Canyon was also part of the notoriously hazardous Boonta Eve Classic race track. On non-race days, Tatooinian youngsters would sneak into the canyon to perform dangerous runs aboard their customized landspeeders or skyhoppers."}, {"tag": "p", "text": "In their youth, pilots Luke Skywalker and Biggs Darklighter flew T-16 skyhoppers through the narrow canyon, and Skywalker once threaded the Stone Needle. They later recalled Beggar's Canyon while fighting in the Battle of Yavin; during the Rebel Alliance's assault on the Death Star, the two pilots entered into a narrow trench leading towards the planet-destroying space station's reactor shaft, and the trench reminded them of the canyon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2015, Beggar's Canyon appeared in the Korean web-comic simply titled Star Wars. The comic depicted a young Luke Skywalker racing his friends through the canyon in his T-16 skyhopper, crashing the vehicle soon after. However, due to cultural leeway, the comic's canonical status is in a \"grey area.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}