{"url": "Beggar%27s_Canyon/Legends", "categories": ["Category:Legends articles", "Category:Canyons", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Beggar's Canyon"}, {"tag": "p", "text": "Beggar's Canyon was a massive canyon on the desert planet of Tatooine."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Beggar's Canyon was a canyon that cuts through the Ben's Mesa. It was formed by a junction of three rivers millennia ago when the planet had water and vegetation. It was home to the ferocious canyon krayt dragon, as well as the somewhat less dangerous womp rat."}, {"tag": "p", "text": "The canyon was inhabited by hermits who were chased out of Mos Espa."}, {"tag": "p", "text": "Beggar's Canyon was used as a part of the Boonta Eve Classic podrace. It also served as a place for bored youths who lived in and around the town of Anchorhead to show off their piloting skills to each other. Pilots would compete by racing inside its treacherous walls using the Incom T-16 skyhopper. They would also hone their targeting skills and earn some credits by attempting to blast womp rats as they raced at breakneck speeds."}, {"tag": "p", "text": "Beggar's Canyon is also known for the Stone Needle, an unusual rock formation that rose 18.2 meters from the canyon floor. Occasionally the Stone Needle figured into these races, since passing through or \"threading\" it could help a pilot shave off at least five seconds from his or her time. However, it was an incredibly risky thing to do and many pilots decided that their life was more important than a race.There were only two pilots known to thread it. The first was Biggs Darklighter, who almost destroyed the Stone Needle on a number of occasions. The second was Luke Skywalker, who lost his stabilizer while passing though the Needle, much to the consternation of one of his peers, \"Deak\". Both Darklighter and Skywalker would later use their piloting skills to aid the Alliance to Restore the Republic in its war against the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Boonta Eve Classic of 32 BBY, Anakin Skywalker was driven onto an access ramp by Sebulba, sending his podracer several hundred feet in the air. Skywalker recovered and jumped ahead of Sebulba's racer. He became the first person to do such a feat in podracing history."}, {"tag": "p", "text": "Six months after the Battle of Yavin, two T-16s were flying through Beggar's Canyon when the Empire raided Mos Eisley."}, {"tag": "p", "text": "While Skywalker was a member of the Alliance, the Black Sun put a bounty on his head and bounty hunters hired by Jabba the Hutt were sent to Ben Kenobi's hut to capture him on their swoop bikes. Luke hijacked one bike and headed towards his well-known canyon; he managed to lose half of them who could not maneuver its narrow turns or pass the Stone Needle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Beggar's Canyon was first mentioned in Star Wars: Episode IV A New Hope—the first Star Wars film."}, {"tag": "p", "text": "In the video game Star Wars: Rebel Assault, Beggar's Canyon was the location of a training center for new Rebel pilots known as Anchorhead Base. It was completely destroyed when it was attacked by a flight of TIE Fighters in 0 BBY."}, {"tag": "p", "text": "Players could navigate Beggar's Canyon in three different stages of Rebel Assault. The first involved piloting a skyhopper and avoiding the walls of the treacherous canyon. At one point they were given a decision to take follow the leaders of the training flight through an \"easy\" stretch, or to go by themselves down a more difficult stretch of the canyon. Going through the difficult stretch resulted in more points being awarded to the player. In the next stage, from a top-down perspective, the player would navigate the skyhopper through the canyon, shooting down target drones as he/she progressed. The last stage involving Beggar's Canyon occurred a few chapters later. It was nearly identical to the first, except for the fact that the player's objective was to chase down and destroy the TIE Fighters that had destroyed Anchorhead Base while piloting an X-wing."}, {"tag": "p", "text": "The concept of the training center appears only in Rebel Assault and this information is considered apocryphal due to Rebel Assault's canon status. This idea was probably derived from Luke and Biggs's use of the canyon during their teenage years."}, {"tag": "p", "text": "In another scene of questionable canonicity, Beggar's Canyon is again featured in a later game, Star Wars: Rogue Squadron. The Beggar's Canyon race bonus level could be unlocked by scoring at least a Bronze medal in all the normal levels. In the mission, Luke Skywalker (the player) races fellow Rogue Squadron pilots Zev Senesca, Dak Ralter and Wedge Antilles through the twisting confines of the narrow canyon, all in T-16 Skyhoppers. At various points, the player can choose to take different branches, some of them offering shorter routes to the finish line. However, the fastest routes are also the narrowest and most winding, requiring the most piloting skill to navigate successfully. Finishing the race in first place, ahead of Wedge, requires Luke to take the most difficult route. The Stone Needle is visible at the end of the canyon race course, and Luke can fly through its \"eye\". The game's 2001 sequel, Star Wars: Rogue Squadron II: Rogue Leader, includes Beggar's Canyon in the training session, as does Star Wars: Rogue Squadron III: Rebel Strike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}