{"url": "Unidentified_six-armed_alien", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified six-armed alien"}, {"tag": "p", "text": "A six-armed alien was present in the Mos Eisley spaceport's Chalmun's Spaceport Cantina when the bounty hunter Boba Fett confronted the patrons of the establishment, demanding the identity of a former local moisture farmer, Luke Skywalker. The alien challenged Fett, and as a result, had three of his arms broken and a fourth removed by the bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, an eight-limbed, three-nostriled alien was present at Chalmun's Spaceport Cantina in the spaceport-city of Mos Eisley on the desert planet Tatooine, where he sat relatively far from the central bar when the bounty hunter Boba Fett entered the establishment and accosted the cantina's patrons, demanding that any individual who knew a local moisture farmer by the name of Luke Skywalker reveal themselves and tell all they knew of Skywalker. As he questioned an Ithorian for information about the boy, the six-armed alien challenged Fett, calling him an adolescent. Fett demanded whoever had addressed him to reveal themselves, which the alien did, coming face-to-face with the esteemed bounty hunter and towering over him in height. Upon seeing the alien, Fett expressed his satisfaction with the situation. The alien was shortly taken off-guard when Fett tackled him, breaking three of the alien's arms and removing another. During the process, the alien screamed in pain while Fett continued to question his audience.  As a result of the burst of violence, the cantina's bartender, Wuher, insisted to the bounty hunter that no one knew the boy, but Fett would not back down. Immediately after, Wuher was proved wrong when a young moisture farmer bolted from the bar, catching the attention of Fett, who proceeded to capture and interrogate the boy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A humanoid, this alien was male and had six arms, two legs, light-colored skin, a brown-furred chest, three nostrils, red eyes, and four-fingered hands. The alien challenged the bounty hunter Boba Fett to a fight, but the alien was proven to be overconfident in his skills when he was taken off-guard when Fett trounced him and removed and broke four of his six arms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The alien first appeared in the fifth issue of Marvel Comics' Star Wars comic series, which was published on May 20, 2015. The issue was written by Jason Aaron with art by John Cassaday."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}