{"url": "Unidentified_script_(Star_Wars_%2776)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Alphabets", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Unidentified script  (Star Wars '76)"}, {"tag": "p", "text": "A writing system was in common use throughout the Old Republic and continued to be used during the reign of the Galactic Empire."}, {"tag": "h2", "text": "Known use"}, {"tag": "p", "text": "This script was commonly used to display information on small, portable devices. This script displayed targeting information on Zam Wesell's electro-goggles and sniper rifle optics."}, {"tag": "p", "text": "It also displayed information on the display screens of the Delta-7 Aethersprite-class light interceptor belonging to the prominent Jedi Obi-Wan Kenobi."}, {"tag": "p", "text": "The ARC-170 starfighter that shot down Plo Koon's Delta-7 starfighter was kitted out with this script at the time of Order 66."}, {"tag": "p", "text": "Information feeds displayed information in this script on Vos Gesal Street and throughout the wider Uscru Entertainment District on Coruscant."}, {"tag": "p", "text": "During the Clone Wars, the data readouts in Palpatine's private office utilized this script, which Palpatine had been reading when Anakin Skywalker arrived to inform him that General Obi-Wan Kenobi was about to fight General Grievous."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars '76 (which lacks an in-universe name) is an in-universe writing system further developed by Philip Metschan, based upon an earlier Joe Johnston typeface developed for Star Wars: Episode IV A New Hope and later used in Star Wars: Episode VI Return of the Jedi. The typeface can also be seen throughout Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "Fans will have difficulty transliterating this font, as Metschan only canonized the letters A through U."}, {"tag": "p", "text": "The typeface can be seen on TIE pilot helmets in A New Hope and the Imperial speeder bikes in various behind-the-scenes images from Return of the Jedi."}, {"tag": "p", "text": "Luke Skywalker's X-wing cockpit screen displays this script when translating R2-D2's warbles during Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "The script is also visible on Obi Wan's Jedi Starfighter cockpit display screens and Zam Wesell's KiSteer 1284 projectile rifle scope display in Attack of the Clones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}