{"url": "Unidentified_six-legged_creature", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified individual creatures"], "nodes": [{"tag": "h1", "text": "Unidentified six-legged creature"}, {"tag": "p", "text": "A six-legged creature lived on the Forest Moon of Endor, and at least one member of the species lived on the Floating Mountain with the sentient being known as Gracca. With the powers of an artifact known as the Crystal Cloak, which he had stolen from the Ewoks' Bright Tree Village, Gracca turned the creature into pure crystal at some point prior to 3 ABY. The creature was eventually discovered by the Ewoks Wicket Wystri Warrick and Latara when they went to the Floating Mountain to retrieve the cloak. Latara later carried the crystallized creature home with her on her skin glider."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Sporting six legs and a long tail, the creature had a multi-spiked frill protruding behind its two eyes. Its large jaw was long and pointed, and contained several sharp teeth."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The six-legged creature lived on the Forest Moon of Endor, which featured a wide variety of terrains. At least one of these creatures made its home on the Floating Mountain with the sentient being named Gracca, who possessed a magical Crystal Cloak he had stolen from the Ewoks' Bright Tree Village several years earlier and had used to rule the whole of the mountain. During his rule, Gracca turned several creatures—including the six-legged creature—into crystal with the magic of his cloak, sometimes accidentally by forgetting his powers, and other times willfully, because the creatures refused to serve him or displeased him in some other way. The six-legged creature's crystallized corpse remained on the mountain with Gracca until 3 ABY, when it was discovered by the Ewoks Wicket Wystri Warrick and Latara, who had come to the mountain to reclaim the stolen cloak. After a skirmish with Gracca, which saw the cloak destroyed and its de facto owner incapacitated, the creature was kept as a trophy by Latara, who brought it back to Bright Tree Village on her skin glider."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This creature went unnamed in the Ewoks episode \"The Crystal Cloak,\" in which it appeared only in a crystalline form. \"The Crystal Cloak\" was the first episode of the second season of the Ewoks television series and originally aired on September 13, 1986."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}