{"url": "Unidentified_shuttle_operator", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Coruscant Security Force officers", "Category:Unidentified Galactic Republic individuals", "Category:Unidentified humans", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Unidentified shuttle operator"}, {"tag": "p", "text": "A Human male worked as a shuttle operator for the Coruscant Security Force, the law enforcement agency on the Galactic Republic's capital planet Coruscant, during the Cold War between the Republic and the reconstituted Sith Empire. While a travel advisory was in effect for the Old Galactic Market, he dealt with a businessman who wished to travel there."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the year 3643 BBY, the shuttle operator worked on Coruscant as a member of its security force while a travel advisory was in place for the Old Galactic Market region, which was then the location of an uprising by the Migrant Merchants' Guild. Stationed at the taxi pad outside the Senate Plaza, he dealt with a businessman who claimed a need to travel to the Old Galactic Market. The operator replied that he was not the one who made the rules and would have to obey the advisory, but the Twi'lek businessman informed the shuttle operator that he carried a stun baton. The businessman then asked if they could leave. The shuttle operator replied that he would need to sign a waiver first."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The shuttle operator had dark skin and hair, and brown eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The operator wore a white and dark-grey uniform with brown boots and gloves and a brown belt, as well as brown pockets. The uniform featured a white version of the insignia on the uniforms of many Coruscant Security Force personnel at that time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The shuttle operator first appeared in Star Wars: The Old Republic, a 2011 massively-multiplayer online roleplaying video game by BioWare, identified by his NPC nameplate as \"Shuttle Operator.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}