{"url": "Unidentified_species_(Imperial_torching)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Non-canon Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Unidentified species  (Imperial torching)"}, {"tag": "p", "text": "Under the aegis of the Galactic Empire, several members of a sentient species were executed by stormtroopers. The species was humanoid, had red eyes, two short antennae, and was distinguished by a nasal structure composed of three pairs of breathing holes."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A humanoid sentient species was distinguished by three rows of parallel breathing holes above its mouth. The species had red, pupil-less eyes, above which grew two short antennae. Females of the species had breasts and grew long hair on their heads. The species had four-fingered hands with opposable thumbs. They had a navel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the period prior to the Battle of Yavin, members of the species lived in a community of square, flammable structures. Stormtroopers of the Galactic Empire attacked that community, torching many of its buildings, and executing several members of the species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This species was created by Garth Ennis and illustrated by John McCrea for the comic \"Trooper\", published in 2001 by Dark Horse Comics as part of Star Wars Tales 10. The comic was later republished in Star Wars Tales Volume 3 in 2003."}, {"tag": "p", "text": "Plausible stories from Tales issues 1–20 are considered S-canon—material that is available to be used or ignored as needed by current authors—and liable to be elevated to C-canon, and therefore part of Star Wars continuity, if referenced in another source. However, Leland Chee, keeper of Lucasfilm's Holocron continuity database, specified that this comic is considered to be non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}