{"url": "Unidentified_space_battle_(Saesee_Tiin)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Unidentified space battle  (Saesee Tiin)"}, {"tag": "p", "text": "In 20 BBY, during the Clone Wars, Jedi General Saesee Tiin participated in a space battle alongside a Republic fleet that consisted of Venator-class Star Destroyers and ARC-170 starfighters. Aboard his Eta-2 starfighter, the Jedi Master engaged three Confederate tri-fighter droids in the midst of the conflict. The droid starfighters overwhelmed Tiin, forcing the Jedi to remain on the defensive. Tiin was saved from death by the timely arrival of Jedi General Anakin Skywalker, who destroyed the droids with his starfighter's laser cannons."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 20 BBY, the third year of the the Clone Wars, Jedi General Saesee Tiin participated in a space battle that was part of the Republic's Outer Rim Sieges campaign. Tiin—along with a Republic battle group that consisted of at least four Venator-class Star Destroyers and accompanying ARC-170 starfighters—fought against two Confederate Providence-class carrier/destroyers and additional tri-fighter droids. In the midst of the battle, Tiin, who was aboard his Eta-2 Actis-class interceptor, was the target of three tri-fighter droids. After engaging the droid starfighters in combat, Tiin was forced to stay on the defensive, being gradually overwhelmed by the droids' blaster fire."}, {"tag": "p", "text": "Tiin struggled to maneuver his interceptor away from the pursuing droids' laser fire. Aboard his own starfighter, Jedi General Anakin Skywalker arrived to aid Tiin and destroyed all three attacking droids with his starfighter's laser cannons. After saving Tiin, Skywalker, flanked by several of the battle group's ARC-170 starfighters, took out other tri-fighter droids near the Venator-class Star Destroyers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The space battle involving Saesee Tiin first appeared in the twenty-second chapter of the Star Wars: Clone Wars television series, which aired on March 22, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}