{"url": "Unidentified_super_tactical_droid_(Yerbana)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Separatist droid officers", "Category:Super tactical droids", "Category:Unidentified droids"], "nodes": [{"tag": "h1", "text": "Unidentified super tactical droid  (Yerbana)"}, {"tag": "p", "text": "An ST-series super tactical droid served in the Confederacy of Independent Systems  as a commander. The super tactical droid led Separatist forces during a battle on the planet Yerbana in 19 BBY. The tactical droid was Force-pulled out of cover and destroyed by Jedi General Anakin Skywalker after he led the Separatist droid forces into a trap."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The super tactical droid served in the droid army of the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. In 19 BBY, during the Outer Rim Sieges, the tactical droid commanded an occupation of a city on the planet Yerbana. In response, the Republic sent Jedi Generals Obi-Wan Kenobi and Anakin Skywalker to attack the Separatist forces and rescue the people of the city."}, {"tag": "p", "text": "During the battle, the Republic's force of clone troopers took severe casualties while attempting to retake the city. The tactical droid remained hidden from the troopers led by General Kenobi and Commander CC-2224 \"Cody,\" who sought to locate and destroy the droid. Skywalker intervened, pretending to surrender himself to the Separatists, and the battle droid commander notified the tactical droid of his surrender. The tactical droid came forward to question why his forces ceased fire, and determined that the situation was a trap. Once the tactical droid revealed himself, Skywalker used the Force to pull the tactical droid toward him, decapitating the droid with his lightsaber. Following the tactical droid's destruction, the Republic forces led an assault on the Separatist droids, and were ultimately successful in winning the battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "An ST-series super tactical droid manufactured by Baktoid Combat Automata, the droid was designed to be highly intelligent and strategic. During the battle on Yerbana, the tactical droid attempted to stay out of sight of the enemy forces, but was led into revealing himself after the forces he commanded were tricked by General Skywalker. The droid had masculine programming, possessed red sensors and plating, and stood at a height of 1.94 meters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tactical droid appeared in the Star Wars: The Clone Wars episode \"Old Friends Not Forgotten,\" released on April 17, 2020, in which he was voiced by Donald Faison."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}