{"url": "Unidentified_stormtrooper_(Mos_Eisley)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Unidentified Galactic Empire stormtroopers"], "nodes": [{"tag": "h1", "text": "Unidentified stormtrooper  (Mos Eisley)"}, {"tag": "p", "text": "This stormtrooper was a human soldier who served the Galactic Empire during the Galactic Civil War. Shortly before the Battle of Yavin, the trooper was stationed in Mos Eisley, a spaceport on the desert planet Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This human was serving as a stormtrooper at the time of the Galactic Civil War. During the trooper's service in the Stormtrooper Corps, the plans to the Galactic Empire's secret superweapon, the DS-1 Death Star Mobile Battle Station, were stolen by the Alliance to Restore the Republic. Princess Leia Organa, a member of the Rebellion, received the plans, but was forced to hide them in R2-D2—an astromech droid—when her starship came under attack over the planet Tatooine. R2-D2 and his counterpart, the protocol droid C-3PO, flew via escape pod to the desert planet, and came into the possession of a young moisture farmer named Luke Skywalker."}, {"tag": "p", "text": "Aided by Jedi Master Obi-Wan Kenobi, Skywalker took the droids to the Mos Eisley spaceport where they sought a pilot who could transport them to Alderaan. After searching Chalmun's Spaceport Cantina, they were met by the stormtrooper, who asked to see their identification. Before the soldier could react, Kenobi drew his lightsaber and cut the trooper's blaster. The Jedi then used the Force to crush their antagonist with a large piece of metal, killing the stormtrooper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This stormtrooper first appeared in Star Wars, a webtoon written and drawn by Hong Jac Ga and published by LINE Webtoon in 2015. Though licenced by Lucasfilm, Jennifer Heddle, when asked about the canonicity of the comic, said \"its canon status is grey area\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}