{"url": "Unidentified_starship_(marooned_spacer)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Unidentified starship  (marooned spacer)"}, {"tag": "p", "text": "At some point before 32 BBY, a starship belonging to an extra-galactic spacer was forced to land on Tatooine after colliding with an asteroid of the Dragon's Spine belt. Because of the accident, the starship was heavily damaged, but its owner managed to gather enough local Wupiupi credits to buy new parts and rebuild it. Following its refitting, the ship was equipped with a StarMark III Hyperdrive bought from Watto, a junk dealer from the Mos Espa spaceport."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Before its crash-landing on Tatooine, that starship of extra-galactic origins was equipped with a quadruple-thruster propulsion system, a pair of delta wings and a hull that looked very much like the T-06 hull manufactured by Incom Corporation. For the most part, the ship was painted in a standard gray hue, although the wings, tails and outer cockpit bore distinctive crimson markings."}, {"tag": "p", "text": "However, following its forced landing, the ship was heavily damaged, and it became necessary to rebuild it from scratch with components available on Tatooine. After an extensive refitting that cost between 3,829 and 6,329 wupiupi, the ship was equipped with a StarMark III hyperdrive for hyperspace travel, three Voyager III fuel cells to store more energy, three GalaxyGuard Mk. VII shield boosters to increase the deflector shield's power, and three Polestar subZero blaster radiators to better dissipate the heat in the ship's mounted weapons. Additionally, the craft was given a brand new paint job."}, {"tag": "p", "text": "In addition to the above, the starship also had to replace its original hull, its engine types, and its wings, with the spacer having chosen either the Slipstream IV hull, the T-06 hull, or the AeroMaster XI hull; the Sun-Gull 1e wing, the StarWind V wing, or the Nebula 3 wing sets; and the Thornley Space Systems-developed NovaFury MonoThrusters, the Galaxy Seven, or the Hamilton Engineering-developed Delta-C Tri-Thrusters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point before the 32 BBY edition of the Boonta Eve Classic, an extra-galactic spacer ventured in the Dragon's Spine, an asteroid field of the Tatoo system, with his or her ship. Upon entering the field, the spacecraft collided with an asteroid, causing it to enter a spin and crash on the closest planet, Tatooine. Reaching the city of Mos Espa, the spacer encountered Watto, a local junk dealer who offered to sell him ship parts to repair the heavily damagaed craft. Bereft of money, the marooned spacer visited Jabba's Game Plaza, a gaming venue in which local Wupiupi credits could be gained."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "That unidentified starship appeared in the 2000 video game Star Wars Math: Jabba's Game Galaxy, released by Lucas Learning. Using wupiupi credits earned in the various activities of the game, the player could collect parts and pieces used in the rebuilding of his crashed spaceship. Because of that, the final appearance of the starship depends on the player's choice. However, the game still contained a hint of what the canonical ship may have looked like following the repairs. The map of Mos Espa featured a \"fly ship\" icon thanks to which the player could leave Tatooine and end the game. The icon featured a starship clearly made of an AeroMaster XI hull, a Delta-C Tri-Thruster and a Nebula 3 wing set, entirely painted in light teal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}