{"url": "Unidentified_transport_shuttle", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Alliance to Restore the Republic starships", "Category:Unidentified shuttles"], "nodes": [{"tag": "h1", "text": "Unidentified transport shuttle"}, {"tag": "p", "text": "A transport shuttle was in the service of the Rebel Alliance during the Galactic Civil War. The shuttle was utilized by the rebels Leia Organa and Han Solo when they were sent on a mission to the planet Lanz Carpo to distract the Galactic Empire in its search for the Rebellion."}, {"tag": "p", "text": "However, Organa and Solo's mission went awry, and the two rebels, alongside District Advocate Dar Champion, were ordered by the crime lord Boss Carpo to eliminate the regional Imperial governor. The rebels flew the shuttle in an attack on the orbiting Star Destroyer, luring it to the planet K43, which the Rebellion was planning to destroy in an adjacent mission. Landing the shuttle on K43, the rebels assisted their comrades that were on the planet. As the planet began to break up, Organa and Champion escaped in the shuttle, while Solo returned to his own starship, the Millennium Falcon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The transport shuttle possessed a flat body with a rounded front and two wings, which were oriented horizontally while the vessel was in flight and pointed vertically when it landed. Its cockpit extended from the front of the shuttle and featured a single flat window. The interior of the cockpit contained two seats positioned in front of the viewport, with another placed further back. The shuttle could be boarded through an opening on its side."}, {"tag": "p", "text": "The shuttle was equipped with a hyperdrive and had three engines at its rear, with one larger central unit and two smaller engines positioned between its wings and body. It also possessed a communications system."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Distracting the Empire"}, {"tag": "p", "text": "The transport shuttle was in the possession of the Alliance to Restore the Republic during the time of the Galactic Civil War against the Galactic Empire. Prior to the Battle of Hoth in 3 ABY, the Rebel Alliance wished to delay the Imperial search for the rebel forces, and General Carlist Rieekan intended to initiate three simultaneous missions to draw the Empire's attention away. The shuttle, parked aboard an EF76 Nebulon-B escort frigate, was to be used by the rebels Leia Organa and Han Solo, who had been sent to the planet Lanz Carpo in order to lead the Empire into believing that the local crime lord, Boss Carpo of the Carpo Crime Syndicate, was collaborating with the Rebellion. Despite Organa and Solo's displeasure at being asked to work together and Solo's objection to their assigned shuttle, the two rebels boarded the vessel, departing the frigate and heading for Lanz Carpo."}, {"tag": "p", "text": "Organa and Solo landed the shuttle on Lanz Carpo, disembarking to undertake their mission. A guard at the landing dock ordered them to wait inside their vessel for a customs crew, but Solo bribed the guard to let them pass. While on their mission, Organa and Solo encountered Dar Champion, former boyfriend of Organa and the current Lanz Carpo District Advocate, who objected to their intentions, instead persuading Organa to trick Boss Carpo into believing that the Empire wished to eliminate him and subsequently leaving Lanz Carpo to retaliate, achieving the same effect without the consequences for the planet's inhabitants. Carpo fell for the ruse, but also learned of the rebels' original mission, and thus ordered them to take the ship they had arrived in and eliminate the regional Imperial governor for him."}, {"tag": "h3", "text": "Mission parameters altered"}, {"tag": "p", "text": "Carpo allowed the rebels and Champion to return to their shuttle, and they left the planet, heading for the orbiting Imperial II-class Star Destroyer. While Organa wished to pose as spice traders in order to board, Solo intended to strafe the Star Destroyer and lead it to the volcanic planet K43, where the Rebellion had planned to lure numerous Star Destroyers before destroying the planet. Piloting the shuttle near the Star Destroyer, Solo was pursued by a number of TIE fighters, which damaged the Imperial capital ship in their attempt to shoot down the shuttle. Solo made contact with the rebels' protocol droid C-3PO on K43, utilizing a clear channel to falsify a conversation with a supposed rebel command group, tricking the Imperials into following them and being caught in the planet's imminent destruction."}, {"tag": "p", "text": "After the shuttle exited hyperspace at K43, the Star Destroyer arrived behind the rebels. They crash-landed the shuttle on K43, scattering Imperial stormtroopers who were firing upon their fellow rebels Chewbacca and Luke Skywalker. Champion, Organa, and Solo departed the shuttle and incapacitated the stormtroopers, assisting their comrades. With K43 about to explode, Champion and Organa intended to return to the shuttle, but Solo wished to leave in his own ship, the Millennium Falcon. After the ground broke apart beneath the rebels, separating them, Solo escaped in the Falcon while Champion and Organa followed in the shuttle."}, {"tag": "p", "text": "The shuttle escaped K43 as the planet broke apart, revealing the grandmother of the native Kakran species. At the same time, Boss Carpo's Panop arrived amidst the skirmish, having also been lured to K43 by Champion, who hoped that he would be killed in the planet's destruction. Both the Panop and the Star Destroyer from Lanz Carpo fired on the rebel vessels, but the Kakrans' grandmother destroyed the Imperial vessel. From the shuttle, Champion taunted Carpo, threatening to jump to lightspeed. Carpo pursued the shuttle, but the Panop was obliterated by wreckage from the Star Destroyer. The sole remaining Imperial vessel, the Super Star Destroyer Executor, escaped into hyperspace to avoid the debris, leaving the rebels safe to regroup and head to the planet Hoth, where the Rebellion established a secret base."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The shuttle was used by Leia Organa and Han Solo in their mission to Lanz Carpo. The two rebels were joined by Dar Champion after Boss Carpo forced them to eliminate the Imperial governor, and Solo piloted the shuttle in an attack on the governor's Star Destroyer. Organa and Champion escaped K43 in the shuttle, with Champion piloting the vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The transport shuttle first appeared in the comic Star Wars 68, written by Greg Pak, illustrated by Phil Noto, and published by Marvel Comics on July 10, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}