{"url": "Unidentified_temple_(Harkrova_system)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Structure stubs", "Category:Alliance to Restore the Republic installations", "Category:Jedi temples", "Category:Unidentified locations"], "nodes": [{"tag": "h1", "text": "Unidentified temple  (Harkrova system)"}, {"tag": "p", "text": "A temple was located on an unnamed moon in the Harkrova system. It was originally a Jedi temple, before later being used by the Alliance to Restore the Republic as a supply cache. The Alliance did not use the base for years, but kept it stocked in case it was needed. During General Hera Syndulla's campaign in the Barma sector, Syndulla sent Alphabet Squadron to gather the supplies kept in the temple and bring it back to the battle group's flagship, the Lodestar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The temple was described by Wyl Lark as an \"impossible creation\". The building was wide at the base with spokes leading to a central tower. There were windows only in the upper part of the spire. The temple was made from stone and tree. The double doors that were used as an entrance by Alphabet Squadron were hidden and carved into a joint between the spokes. Through a removable panel in the floor of the main chamber was a storage cellar built separately from the rest of the temple. This cellar was used as a storage cache by the Rebel Alliance."}, {"tag": "p", "text": "A visual phenomenon was known to take place in the temple before dawn as the main chamber lit up with thousands of sparks. To those inside the chamber, the sparks formed a map of the galaxy, \"as it was\" when the temple was created. Then darkness fell over the map and the whirling of the stars increased in speed which Wyl Lark interpreted to mean the galaxy \"as it became\" during the war. When dawn came and light spilled into the temple, Lark said it represented the galaxy \"as it is.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}