{"url": "Unidentified_trinary_system_(Gardaji_Rift)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:System stubs", "Category:Gardaji sector", "Category:Outer Rim Territories star systems", "Category:Trinary star systems", "Category:Unidentified star systems"], "nodes": [{"tag": "h1", "text": "Unidentified trinary system  (Gardaji Rift)"}, {"tag": "p", "text": "This trinary star system was a system in the Gardaji sector of the Outer Rim Territories. It was located in a hidden region at the far spinward and galactic north side of the Gardaji Rift and was surrounded by great dust clouds. The system was noted by the pilot Charza Kwinn to be almost impossible to find if one didn't know its location. It consisted of three stars—a red giant and a white dwarf, orbiting close to each other, and a small, bright yellow dwarf, located at a distance of several light-months from the other two stars. Materiel from the red giant was pulled towards the white dwarf and then flung outward as ionized gas."}, {"tag": "p", "text": "The system was noted to be devoid of life by several expeditions who charted the region of the Rift in which the system was located in approximately 229 BBY. A seed of the extragalactic planet Yuuzhan'tar arrived in the system and became the sentient world Zonama Sekot at some point between then and 89 BBY, when it was colonized by a group of Ferroans and Langhesi. The planet remained in the system for six decades. In 32 BBY, the Yuuzhan Vong attempted to settle the living planet and laid siege to it that continued for two years. A year later it was attacked again, this time by a Republic Outland Regions Security Force squadron led by Wilhuff Tarkin and Raith Sienar. However, Sekot unveiled its kilometers-high hyperdrive engines, recently built by the Langhesi, and fled into hyperspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}