{"url": "Unidentified_white_dwarf", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Gardaji sector stars", "Category:Outer Rim Territories white dwarfs", "Category:Unidentified stars"], "nodes": [{"tag": "h1", "text": "Unidentified white dwarf"}, {"tag": "p", "text": "A white dwarf star orbited close to a red giant in the Outer Rim Territories' Gardaji Rift region. Plasma from the red giant was pulled toward the white dwarf and then flung outward in a glowing spiral of red and purple gas, which provided an impressive source of illumination in the skies of the nearby planet Zonama Sekot."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A white dwarf star was located within a trinary star system in the Gardaji Rift, which was part of the Outer Rim Territories' Gardaji sector. The white dwarf orbited close to a red giant star. A third star, a yellow dwarf, lay at a distance of several light-months from the pair and was orbited by the sentient planet Zonama Sekot until 29 BBY, when the planet left the system through the use of its own built-in hyperdrive engines."}, {"tag": "p", "text": "The white dwarf pulled from the red giant a ribbon of plasma, which then curled around the smaller star and was flung outward in a long spiral of red and purple ionized gas. The combined motion of the gas and the double-star system formed by the white dwarf and the red giant resembled a large pinwheel that stretched across the northern sky of Zonama Sekot, illuminating the planet both during the day and at night."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When they visited Zonama Sekot in 29 BBY, the Human Jedi Obi-Wan Kenobi and Anakin Skywalker; their Priapulin pilot, Charza Kwinn; and, independently of the trio, the Human starship designer Raith Sienar were all impressed by the glowing display of the double-star system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The white dwarf first appeared in Rogue Planet, a 2000 novel written by Greg Bear. The Essential Atlas, a 2009 reference book, placed the Gardaji Rift, and therefore the white dwarf, in grid square M-1."}, {"tag": "p", "text": "The 2012 book The Essential Reader's Companion later claimed that during the events of Rogue Planet, Zonama Sekot was situated in square M-3 instead. However, that placement would result in the star system containing the planet at the time to be located outside of the Gardaji sector, in which lay the Gardaji Rift, the location of Zonama Sekot in Rogue Planet. As a result, this article treats the placement from The Essential Reader's Companion to be erroneous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}