{"url": "United_Warlord_Fleets", "categories": ["Category:Legends articles", "Category:Galactic Empire"], "nodes": [{"tag": "h1", "text": "United Warlord Fleets"}, {"tag": "p", "text": "The United Warlord Fleets was the unified fleet formed from the collective forces of the thirteen Imperial rump states in the Deep Core around 12 ABY, and was formed when Admiral Natasi Daala executed the thirteen warlords at Tsoss Beacon and took command of their remaining forces. Utilizing the Executor-class Star Dreadnought Knight Hammer as her flagship, and using various capital ships, vehicles, and starfighters, Daala carried on guerrilla warfare against the New Republic. Daala lost a majority of the fleet at the climactic Assault on Yavin 4, where she planned on wiping out Jedi Master Luke Skywalker's New Jedi Order. Daala's failure made her leave Imperial service. Admiral Gilad Pellaeon would eventually take command of the United Warlord Fleets and would regroup with scattered Imperial factions within the Mid Rim to reestablish the Imperial Military under the Imperial Remnant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "In 4 ABY, the Galactic Empire lost the Battle of Endor. Not only did they lose the second Death Star and the Star Dreadnought Executor, but Emperor Palpatine and Darth Vader perished, along with a majority of Imperial leadership."}, {"tag": "h3", "text": "Post-Endor era"}, {"tag": "p", "text": "The Imperial Military would scramble into the hands of Moffs, Admirals, and Generals who proclaimed the title of warlords. Director Ysanne Isard remained truly loyal to Palpatine's Empire. Isard led the Empire until the New Republic liberated Coruscant."}, {"tag": "h4", "text": "Thrawn's campaign"}, {"tag": "p", "text": "After the fall of Coruscant, Grand Admiral Thrawn returned from the Unknown Regions. He was appointed Supreme Commander of Imperial Forces by the remaining Imperial Ruling Council based on Orinda. Thrawn helped form a unified military, and it almost seemed as though the Empire would defeat the New Republic. Thrawn perished at the Battle of Bilbringi, at the hands his of Noghri bodyguard Rukh."}, {"tag": "h4", "text": "Operation Shadow Hand"}, {"tag": "p", "text": "Although the New Republic expected there to be relative peace, Thrawn's death had shown Imperial officers that the New Republic could be defeated. Striking at the New Republic, Imperial forces divided and conquered. It was later revealed that Imperial forces were being coordinated by the reborn Emperor Palpatine, who was based on Byss. Palpatine unleashed new powerful weapons, from the World Devastators, Eclipse-class dreadnoughts, Sovereign-class Star Destroyers, and the Galaxy Gun. Palpatine was defeated above Onderon, and the Eclipse II set course and rammed the Galaxy Gun stationed above Byss. Byss was destroyed, and the Dark Empire was vanquished."}, {"tag": "h4", "text": "Discovery of the Maw Installation"}, {"tag": "p", "text": "In 11 ABY, Captain Han Solo and Chewbacca were sent to negotiate terms at Kessel. They were shot down by the defense force stationed at Kessel. It was later revealed that Kessel was overrun by slaves, pirates, and smugglers. They had come together to serve Moruth Doole, Administrator of the planet's spice mines. Solo and Chewie escaped, with help from young Kyp Durron. They fled the planet, and into the Maw. Unknown to them, the Maw housed a top-secret Imperial research facility. Solo was captured by Admiral Natasi Daala, commander of the forces and the base. Daala was Grand Moff Wilhuff Tarkin's protégé, and when Daala found out of his death at Yavin 4, she decided to avenge Tarkin and the fallen Empire. Her campaign was short lived, with the Sun Crusher being stolen by Kyp Durron, and later, Daala lost more and more of her fleet. She eventually lost her secret installation at the hands of the New Republic."}, {"tag": "h3", "text": "Imperial Reunification"}, {"tag": "p", "text": "After the major loss of the Maw Installation, Daala wandered across the galaxy, inspecting splinter factions. Daala eventually met and talked with Admiral Blitzer Harrsk, a major warlord. Little did both know, Admiral Treuten Teradoc, a rival warlord, would attack Harrsk's fortress by using Crimson Command, led by Vice Admiral Gilad Pellaeon, the fleet comprising hundreds of Victory-class Star Destroyers. Harrsk, greatly angered by the attack and the loss of his flagship Shockwave, retaliated by attacking Teradoc back. He forced Daala to take command of the Firestorm, and if she didn't, he would have his troops execute her for treason. Daala complied, with not much say in the matter. They arrived, finding Teradoc's fortress based within an asteroid field. They briefly encountered space mines planted by Teradoc, but resumed the attack. Teradoc watched the battle from his command bunker, and the fight ended when Daala disabled the Whirlwind, Harrsk's ship. She threatened them by blowing up the Firestorm if they didn't listen. The fight ended, and Daala called out thirteen of the most powerful warlords at Tsoss Beacon, an Imperial listening post. They met there to discuss the future of the Empire, and Daala planned on reuniting the various factions. Little did this help, as the Imperial warlords fought for hours, as they all held rivalry with each other. Daala, having heard enough, and realizing they wouldn't agree on anything, prepared her second plan by releasing a nerve gas which filled the room, and wore a gas mask alongside Pellaeon. The two watched as the warlords died, and Daala resumed command of their remaining forces for a final fight against the New Republic. The deaths of all thirteen Imperial warlords ended the Imperial Civil War."}, {"tag": "h4", "text": "Beginning conquest"}, {"tag": "p", "text": "Daala first headed to Kampe, which Admiral Sander Delvardus used as his base of operations. Daala presented Delvardus's corpse on a frame to his second in command, Colonel Ivan Cronus. Daala gave Cronus a choice, join or die. Cronus decided to join Daala's new faction, and presented her a gift, the Executor-class Star Dreadnought Night Hammer, which Delvardus planned on using. Daala took the Night Hammer as her personal flagship, renaming it Knight Hammer. Daala gave a large bulk of Crimson Command to Cronus, and Cronus attacked Khomm. He later struck at Chardaan Shipyards, and later at Porus Vida, scoring major victories."}, {"tag": "h4", "text": "Major failure"}, {"tag": "p", "text": "Within these major victories, Daala and Pellaeon both agreed that it was time to wipe out Jedi Master Luke Skywalker's New Jedi Order. As such, seventeen Imperial-class Star Destroyers were dispatched to Yavin 4, led by Pellaeon. Pellaeon and his fleet arrived above the planet and launched a large ground force to attack the Jedi. The Jedi were overrun and retreated to the temple, where they all used their Force powers and wiped out Pellaeon's fleet in orbit. With Pellaeon taken care of, Daala would arrive with her fleet alongside Cronus's fleet. But New Republic reinforcements under the command of Admiral Ackbar came into the system and attacked Daala. Daala was surprised when Callista Ming hijacked a TIE bomber and flew it into the Knight Hammer, effectively destroying it."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "With the destruction of the Knight Hammer, and a large bulk of the military force, Daala relinquished her command of the fleet to Pellaeon, which made him the Supreme Commander of the Imperial Fleet. Pellaeon regrouped with surviving Imperial forces throughout the galaxy."}, {"tag": "h2", "text": "Headquarters"}, {"tag": "h3", "text": "Deep Core"}, {"tag": "p", "text": "Although not utilizing a traditional planetary capital like the Galactic Empire, the primary headquarters of the fleet was the Deep Core. The entire Deep Core was seeded by shipyards, factories, and various military installations to which Daala had within her power."}, {"tag": "h3", "text": "Knight Hammer"}, {"tag": "p", "text": "The Super Star Destroyer Knight Hammer, personal flagship of Daala, served as a mobile command base of the faction. Daala was able to command her military forces aboard the ship and across the galaxy."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "Imperial-class Star Destroyers, Victory II-class Star Destroyers, and one modified Executor-class Star Dreadnought provided the United Fleet with unlimited firepower."}, {"tag": "p", "text": "Proximity Mines were used by Colonel Ivan Cronus during the attack on Chardaan Shipyards."}, {"tag": "p", "text": "TIE/LN starfighters, TIE/sa bombers, TIE/IN interceptors, and GAT-12 Skipray Blastboats were used as primary starfighters. The 181st Imperial Fighter Wing was also used by the fleet."}, {"tag": "p", "text": "Stormtroopers served as the main attack force, and security of the fleet. A detachment of Imperial Royal Guards was also in service to Daala."}, {"tag": "p", "text": "All Terrain Scout Transports, HAVw A5 Juggernauts, HAVr A9 Floating Fortresses were the ground forces of the fleet. Sentinel-class Landing Craft, served as the primary transport of the fleet."}, {"tag": "p", "text": "Second Imperium, another splinter faction, which was led by Daala, was also part of the military bulk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The United Warlord Fleets were first mentioned by Jason Fry and Paul R. Urquhart in the 2012 guidebook The Essential Guide to Warfare, and in the endnotes to the book, Urquhart confirmed that the command was intended to be the faction that Admiral Daala seized control of in Darksaber, a 1995 novel by Kevin J. Anderson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}