{"url": "Unification_Summit", "categories": ["Category:Legends articles", "Category:Stub", "Category:Confederation", "Category:Galactic Alliance", "Category:Imperial Remnant", "Category:Meetings"], "nodes": [{"tag": "h1", "text": "Unification Summit"}, {"tag": "p", "text": "The Unification Summit of 43 ABY was a series of negotiations held on Coruscant in an attempt to unite the three major galactic factions: the Galactic Alliance, Imperial Remnant and the Confederation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the aftermath of the Second Galactic Civil War, peace was restored to the galaxy, though tensions remained between the three galactic powers; with neither Imperial space or the Confederation rejoining the Galactic Alliance."}, {"tag": "p", "text": "During the first public meeting of the three major powers in 43.5 ABY, it was noticed by Luke Skywalker and other attendees that all three Heads of State—Jagged Fel of the Imperial Remnant, Natasi Daala of the Galactic Alliance, and Turr Phennir of the Confederation—all had strong ties to the former Galactic Empire. Daala and Phennir served as an Admiral and General, respectively, while Fel was the son of leading Imperial fighter ace, Soontir Fel."}, {"tag": "p", "text": "A committee was set up by the Galactic Alliance Senate to prepare for the Unification Summit. It was headed by Bothan Senator Tiurrg Drey'lye."}, {"tag": "p", "text": "In 44 ABY, the growing slave revolts that were erupting all around the galaxy, as well as the tension between the New Jedi Order and Daala's government led the Chief of State to order swift repression against the slave movements. Jagged Fel, who had successfully convinced the Moff Council to unify with the Galactic Alliance, was disgusted by Daala's willingness to have anyone who revolted against the Alliance killed and even innocent people like journalist Madhi Vaandt who was killed during the revolt on Blaudu Sextus by Mandalorians working for Daala. Although he promised her Imperial troops to help destroy the revolts, he decided to withdraw the Remnant from the Summit as he wasn't willing to unite under the authority of Daala who had finally shown her true colors. He was also disgusted by the fact that she blamed the Jedi for the revolts even though she had no proof and it was only motivated by her hatred of them."}, {"tag": "h2", "text": "Appearances"}]}