{"url": "Unit", "categories": ["Category:Legends articles", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Unit"}, {"tag": "p", "text": "A unit was a standard formation of soldiers in the Sith military that fought under the leadership of the Brotherhood of Darkness, during the final phase of the New Sith Wars."}, {"tag": "h2", "text": "Size and role"}, {"tag": "p", "text": "A typical unit seems to have been a relatively small-scale formation of infantry, which could sometimes be described as a company. The exact number of men in a unit is unclear, and may not have been standardized: the term \"company\" is used elsewhere for forces ranging from a few dozen soldiers to more than two hundred. The most that can be said for certain is that one specific unit, the Gloom Walkers, appears to have numbered something more than a dozen troopers."}, {"tag": "p", "text": "In most armies, forces of this size would have been subdivisions of larger formations like battalions or regiments, but in the Sith military, the only larger formation mentioned specifically is the division, and units, such as the Gloom Walkers, were independent groups of troops that were treated as the basic components of the army. New recruits were assigned directly to specific units, and although transfer was possible, it seems to have been usual for veterans to remain with the same formation."}, {"tag": "p", "text": "A force of a thousand units was deployed in the assault on Kashyyyk, reinforced to nearly two thousand in order to defeat the Republic defenders there. From here, twenty units were sent to pursue the retreating garrison to Trandosha, where they fought in the Battle of Hsskhor. It is possible that some units were equipped with transports or armor, but for the most part, they appear to have been infantry deployed from orbit, probably in landing craft supplied temporarily by naval forces, comparable to the line infantry of the Imperial Army a thousand years later."}, {"tag": "p", "text": "Some sense of the relative balance of forces within the Sith military may be gauged by the composition of a group of reinforcements that arrived on Ruusan during the campaign: two divisions of infantry and a \"core\" of snipers, but just a half-platoon of repulsorlift armored vehicles."}, {"tag": "h2", "text": "Internal organization"}, {"tag": "p", "text": "While comparable in some respects to an infantry company, the unit seems to have had a simpler command structure, similar to a platoon, with a Lieutenant in command and a single Sergeant. There was also a position of Senior Trooper, but it is not clear if this was a single third-in-command position, or a more widely-used rank. A \"communications officer\" is also mentioned as being attached to the Gloom Walkers during the Battle of Phaseera, but his exact position in the unit is not known. Ordinary soldiers were known as Sith troopers."}, {"tag": "p", "text": "Units could be split into squads, but these seem to have been temporary divisions of the command into tactical teams, made as required for an individual mission, rather than permanent component sub-units."}, {"tag": "h2", "text": "Weaponry and equipment"}, {"tag": "p", "text": "Most troopers in a unit were armed simply with the TC-22 blaster rifle, the basic armalite of the Sith forces, with just two power-packs. Veterans and NCOs could request more advanced weaponry, and would also carry sidearms like the GSI-21D disruptor pistol, while marksmen—of which the Gloom Walkers had four—were issued with TC-17 sniper rifles rather than the standard TC-22."}, {"tag": "p", "text": "The Sergeant and at least some of the other personnel in the unit had short-range comlinks, but the main comm unit of the Gloom Walkers seems to have been large enough that it remained at their base camp on Phaseera, and may only have been issued due to their deployment on a flanking maneuver. Other special equipment, such as interference boxes, could be used, but was probably only issued for specific missions."}, {"tag": "p", "text": "The low number of power-packs issued to the average Sith trooper, with just a hundred shots in total, may explain the widespread use of edged weapons during the Seventh Battle of Ruusan."}, {"tag": "h2", "text": "Appearances"}]}