{"url": "Unmasker", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Carnivorous creatures", "Category:Creatures of unspecified biology", "Category:Non-sentient species", "Category:Yuuzhan Vong creatures"], "nodes": [{"tag": "h1", "text": "Unmasker"}, {"tag": "p", "text": "Unmaskers were non-sentient creatures used by the Yuuzhan Vong to scare ooglith masquers and cause them to reveal the identities of their wearers. Unmaskers were ill-tempered, had sharp teeth, and resembled a cross between a ng'ok and a quillarat. In the year 25 ABY, one was used by members of the Peace Brigade to identify the Yuuzhan Vong Priestess Elan aboard the luxury liner Queen of Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Unmaskers were small creatures, able to fit into a case that could be carried by the average humanoid. They had a bristly neck, as well as razor-sharp teeth, and resembled the offspring of a ng'ok and a quillarat, both creatures themselves. Unmaskers also had an olfactory organ. The creature was not immune to the affects of bo'tous, a Yuuzhan Vong biological weapon."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Classified as non-sentient, unmaskers had an ill temper. Their appearance would frighten ooglith masquers, which were Yuuzhan Vong biotechnological bodysuits used to disguise the wearer. When ooglith masquers fled from them, some unmaskers would go after the other creature with a vengeance and would shake the masquer around after catching it in its teeth. Despite their temperament, unmaskers were looked after by Yuuzhan Vong minders and would allow themselves to be transported around inside a case; they were frequently carried around by their minders to scare ooglith masquers. However, unmaskers would occasionally leap from their minder's arms to pursue fleeing ooglith masquers. Unmaskers were carnivorous in diet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 25 ABY, the Yuuzhan Vong species invaded a galaxy other than their own, and waged war on the inhabitants. That year, the Yuuzhan Vong priestess Elan seemingly defected to the side of the New Republic, which was fighting the invaders. The priestess was taken into protective custody by the New Republic Intelligence Service, and shortly after was transported aboard the aging luxury liner Queen of Empire to get her to a safe location. However, members of the Yuuzhan Vong allied Peace Brigade boarded the liner, in order to rescue Elan. The group brought aboard an unmasker and its minder in order to help them locate the priestess, eventually finding a suspicious gang of individuals including former smuggler Han Solo. The Peace Brigadiers used the unmasker to scare the ooglith masquer that was disguising Elan, who was among the individuals, thus revealing the priestess. In reality, Elan had actually only feigned defection so she could get close to members of the New Jedi Order and kill them. The priestess was later forced to slay her rescuers, along with the unmasker, after the Peace Brigadiers took her with them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The unmasker's only appearance to date was in 2000's The New Jedi Order: Agents of Chaos I: Hero's Trial, written by James Luceno. The novel was released as part of The New Jedi Order series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}