{"url": "University_of_Rudrig/Legends", "categories": ["Category:Legends articles", "Category:Universities"], "nodes": [{"tag": "h1", "text": "University of Rudrig"}, {"tag": "p", "text": "The University of Rudrig, based on the planet Rudrig was the only university in the Tion Hegemony. The university spanned the entirety of the planet Rudrig, offering a diverse array of programs and attracting a diverse variety of species. As of 1 BBY, the university had started founding annex campuses on other worlds in the Tion Hegemony, including one on the planet Brigia."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The University of Rudrig was an institution of higher learning located on the planet Rudrig, in the Tion Hegemony. The university stretched across the entire planet, with multiple campuses, housing developments, recreation and field training sectors scattered across every region of Rudrig. Its expanse across the world was characterized with spires, domes and towers standing in harmony with Rudrig's natural foliage, and featured dozens of lecture halls, auditoriums, theaters, administrative buildings and clinics, along with a wide variety of classroom configurations. It also had a sprawling recreation center, which included a number of spas."}, {"tag": "p", "text": "The only top-quality higher-education institution in the Tion Hegemony, the University of Rudrig attracted students from throughout that sector of the galaxy, drawing a diverse clientele of species. The university offered programs in a wide variety of subjects, from music to xenoarchaeology to non-Human ethnology. Although some of its departments were considered lazy and reactionary, many saw the University of Rudrig as offering a path forward from the Tion's grim past."}, {"tag": "p", "text": "The university received most of its funding via donations and tuition, in turn using that money to purchase droids and other educational materials. The university also made it a mission to establish annex campuses on other worlds, maintaining a Committee for Interinstitutional Assistance to review and approve requests for financial aid from prospective planets. The Rudrig University Anthem was the school's signature song, and some local groundcoaches used the first two bars of the anthem as a warning horn."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the era of the Galactic Civil War, the amount of income the university received from donations and tuition had grown quite sizable, enabling it to pay a modest markup for educational materials. However, it didn't always come about these materials by completely legal means—for instance, hiring smuggler Roark Garnet to deliver a shipment of GY-I information analysis droids. By the era of the Galactic Civil War, the university had started the process of building satellite campuses on other worlds around the Tion Hegemony. One of these new annexes was founded on Brigia in 1 BBY, to significant opposition from the planet's New Regime."}, {"tag": "p", "text": "The University of Rudrig started a Studies in Contemporary Non-Human Music and Dance program during the early years of the New Republic, requiring the purchase of a significant number of musical instruments. The university formerly employed the controversial xenoarchaeologist Follnor Callat, before expelling him and banning him from campus—however, Callat was still known to call on former students of his from Rudrig to assist him on treasure hunts. Arhul Manaxa, a scholar emeritus at the University of Rudrig, was considered a ranking expert on the early history of the Mandalorians and the ancient Zhell–Taung War by 2 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The University of Rudrig first appeared in the novel Han Solo and the Lost Legacy, written by Brian Daley and released in 1980."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}