{"url": "Unity_(Venator-class)", "categories": ["Category:Legends articles", "Category:Galactic Republic starships", "Category:Venator-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Unity (Venator-class)"}, {"tag": "p", "text": "Built by Kuat Drive Yards, the Unity was a Venator-class Star Destroyer that served in the Republic Navy during the Clone Wars. In 21 BBY, a large Separatist fleet—under the command of General Grievous—invaded the Republic aligned-planet of Dorin. The Unity was part of a Republic task force led by Jedi Generals Anakin Skywalker and Plo Koon and Admiral Wullf Yularen that was dispatched to Dorin to beat back the Separatist attack. The two fleets engaged in the space above Dorin, trading turbolaser fire and launching starfighters. However, the Unity was overwhelmed by the bombardment unleashed by the Separatist capital ships, which destroyed the vessel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Unity was a Venator-class Star Destroyer that was part of the Republic Navy during the Clone Wars between the Republic and Confederacy of Independent Systems. Manufactured by Kuat Drive Yards, the Unity was 1,137 meters long, and was equipped with eight engines, a hyperdrive motivator, and a pair of command towers. The Unity had an armament of fifty-two laser cannons, eight DBY-827 heavy dual turbolaser turrets, two medium dual turbolaser cannons, four proton torpedos tubes, and six tractor beam projectors. The Star Destroyer was also equipped with deflector shields, but these would collapse under sustained enemy turbolaser fire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 21 BBY, a large Confederate fleet—under the command of cyborg General Grievous—launched an invasion on the Republic aligned-planet of Dorin, the homeworld of the Kel Dor species. The Separtist fleet—composed of Grievous's command frigate, two Lucrehulk-class Droid Control Ships, and sixteen Munificent-class star frigates—began to lay waste to Dorin, killing many Kel Dor loyal to the Republic."}, {"tag": "p", "text": "When the Republic received word of the Separatist attack, they formed a task force to reinforce Dorin. Led by Jedi Generals Anakin Skywalker and Plo Koon and Admiral Wullf Yularen, the task force included the Unity, Skywalker's flagship, the Resolute, and seven other Venator-class Star Destroyers. The Unity and the rest of the Republic fleet soon departed from the Republic capital of Coruscant. However, the fleet's movement was discovered by Separatist intelligence, which informed Grievous of the incoming Republic flotilla. In preparation for the upcoming battle, Grievous recalled his battle droids from Dorin's surface and prepared his fleet and droid starfighters for combat."}, {"tag": "p", "text": "The Unity and the rest of the Republic task force jumped out of hyperspace over Dorin and engaged Grievous's forces in the space above the planet. Both fleets began launching starfighters and trading turbolaser strikes with each other. However, the Unity's deflector shields, under concentrated fire from the Confederacy's frigates' heavy turbolasers, failed, causing the Unity to break apart in space."}, {"tag": "p", "text": "Despite the loss of the Unity, the Republic flotilla managed to defeat Grievous's forces, causing the Confederate General to flee the battle and freeing Dorin from the Separatists."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Unity was first indirectly mentioned in a script reading by the main characters of Star Wars: The Clone Wars television series voice-acting cast at the October 2009 Star Wars Fan Days III convention. In the script reading, the Dark Acolyte Asajj Ventress reports to General Grievous the Republic fleet's—and therefore the Unity's—departure from Coruscant. The Unity later appeared in the \"Starfighter\" mini-game of the 2010 Star Wars: Clone Wars Adventures video game, in which the Star Destroyer was destroyed midway through the Battle of Dorin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}