{"url": "University_of_Coruscant/Legends", "categories": ["Category:Legends articles", "Category:Coruscant places of learning", "Category:Universities", "Category:University of Coruscant"], "nodes": [{"tag": "h1", "text": "University of Coruscant"}, {"tag": "p", "text": "The University of Coruscant, also known as the Coruscant University, was a university located in the Fobosi District of the Galactic Republic's capital planet Coruscant. Founded by Supreme Chancellor Fillorean and the Duinuogwuin philosopher Borz'Mat'oh in 15,500 BBY as Coruscant's first university, the institution offered a wide variety of courses throughout its history and gained a reputation as a premier learning institution. However, the rise of the Galactic Empire at the end of the Clone Wars and the New Order's Humanocentric policies sullied the school's reputation, and it was not until almost three decades later that the New Republic regained control of Coruscant that the University began accepting non-Humans again."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding and early years"}, {"tag": "p", "text": "The first formal university on the planet Coruscant, the University of Coruscant was founded by Supreme Chancellor Fillorean and the Duinuogwuin philosopher Borz'Mat'oh in 15,500 BBY, at the end of the conflict between the Galactic Republic and the Duinuogwuin species that became known as the Duinuogwuin Contention. Originally a single tower in the Fobosi District on the Republic's capital of Coruscant, the University expanded over the millennia to include many different buildings scattered throughout the district. The original tower became largely administrative offices, student housing, and several of the original lecture halls, though the two chalcedony statues of Borz'Mat'Oh and Fillorean remained. The dean of the University was addressed by the traditional title of Cadaeda The University handed out honorary degrees to individuals who were influential in their field, such as Nasdra Magrody, and the recipients of honorary degrees also received gold rings."}, {"tag": "p", "text": "The Human Archiban Kimble attended Coruscant University's medical program, the First Republic Medical Academy of Coruscant, during the early years of the Cold War between the Sith Empire and the Republic, and during his time studying xenopathology Kimble's fellow students complained that he received favorable treatment from several of his female instructors. Almost three thousand years after the Cold War, the Quermian Murk Lundi taught history at the University, specializing in little-known organizations and events that had nonetheless impacted the galaxy. However, Lundi's mediocre research skills led him to delve into topics and subjects outside of his standard classics in order to save his career, and the Quermian began to research the Sith. His attempts to retrieve a Sith holocron on the planet Kodai were foiled by the Jedi Order, and the professor was relieved of his position when he ultimately went insane and was imprisoned in a mental facility. The Zabrak medical student Zan Yant was tutored in music by one of the professors at the University's School of Music in the years before the conflict known as the Clone Wars, and the School of Music was considered one of the premier musical institutions at the time. The University's medical departments occasionally suffered from thievery during that period, such as how the Balosar medical student Elan Sel'Sabagno abused his access to the school's medical supplies and stole them to use in the production of illegal drugs."}, {"tag": "h3", "text": "The Clone Wars and the Empire"}, {"tag": "p", "text": "In 22 BBY, the tensions between the Republic and the fledgling Confederacy of Independent Systems began to boil over, and the students of Coruscant University became embroiled in several incidents of public unrest on the capital planet. The controversy surrounding the infant Ludi Billane, who had been adopted by the Jedi Order after the two-year-old was separated from her mother in a quake on their homeworld Ord Thoden, inspired many student activists to involve themselves with the ongoing events. Several students used an automated slicer program to overload two of the University's datanet hubs early in the morning with trillions and trillions of images of Ludi, who had been named Aris-Del Wari by the Jedi and whose mother Jonava was trying to fight for custody of her daughter. By the afternoon, the program—which had been duplicating the files exponentially and overwriting existing data on the University network—had completely filled both of the hubs with images of Ludi taken from a HoloNet News report. The caption \"I'd rather be with Mom than Mace\" had been added to the images, and the Campus Information Office was unable to uncover any leads in their investigation."}, {"tag": "p", "text": "Just under a month later, a twenty-student sociology tour group infiltrated the Jedi Temple through the public entrance before unleashing several pre-programmed graffiti-bombs that sprayed messages across the lobby such as \"Baby Ludi Wants Her Mom,\" \"Broodsnatchers,\" and logos of the People's Inquest movement—a public watch group that was supporting Billane in her attempts to regain custody of her daughter. As the two young Padawans present were unwilling to utilize their lightsabers against the activists, the group was able to push into the Temple's Second Atrium Lobby before Plo Koon and Ki-Adi-Mundi, two members of the Jedi Council, arrived to block their path. Koon mentally subdued the crowd with the Force so that several Padawans could remove the students peacefully, though the event gained enough attention to warrant a HoloNet report. Less than four weeks later, public uproar over the Military Creation Act drew a large number of students from the University's Southern Campus. The Senate Guard was forced to break up the crowds of approximately 7,000 activists around the Senate Building, with thirty-eight protesters—many of whom were University students—arrested by the building's protectors."}, {"tag": "p", "text": "The students' protests were in vain, however, as the following weeks saw the signing of the Military Creation Act and the beginning of the Clone Wars. By that time, the Fobosi District featured many cantinas that catered to the University's staff and students, including the Haunch of Nerf. At the end of the Clone Wars in 19 BBY, the Republic became the Galactic Empire, and the University of Coruscant underwent significant policy changes in the era of the New Order. The Empire passed a bylaw that forbade non-Humans from applying to the University and expelled those currently attending, and in their absence the University soon became almost entirely Human males. Many of the new students were former members of the Sub-Adult Group youth brigades that had been organized by the Commission for the Preservation of the New Order, and a large number of them were washouts from the Imperial Military academies—something that caused the University's reputation to suffer as most of its students pursued careers in the Imperial government. While other premier universities mocked the school as a \"bureaucrat factory\", the University's students damaged the school's reputation further by creating a climate of bullying and Humanocentrism that thrived over the next two decades."}, {"tag": "p", "text": "Around 11 BBY, the Corellian female Bria Tharen decided to study archaeology and ancient art at the University after completing her undergraduate education at the age of seventeen, though her exposure to the religion known as the Cult of The One and The All derailed her studies. Sometime during the period of Imperial rule, the University's Vice-Chancellor Zokor Polpot and the current Chancellor were among those University officials visited the planet Woostri, and Polpot attempted to discredit his boss with a prank involving the droid 8t88. Polpot replaced the crocidile–like head of 8t88, the Tiss'sharl administrative droid in charge of managing Woostri's famous HoloScan Database, with the smaller head of a JMM series droid, and the episode resulted with the Chancellor's resignation and Polpot's ascension to the post. However, 8t88 went on to become an information broker with a bitter resentment of Humans, and he eventually murdered Polpot while the Chancellor was visiting the planet Mawan sometime before 7 ABY."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "When the New Republic liberated the galactic capital in 7 ABY, the University immediately began to accept students of all species, though resentment among non-Humans remained high in the years that followed as the University's Imperial reputation lingered. By 18 ABY, the University's Diplomatic Archives were open to the public, and it included material on figures such as Gaeriel Captison, a Senator of Bakura. Students of certain species, such as Shistavanens, were shunned and feared by their fellow students and even faculty on account of their fearsome appearance, though such reactions were not always exclusive to the University. Around that time, the Coruscant University Press published scholarly articles and reports by notable scientists."}, {"tag": "p", "text": "By 30 ABY, the University had once again regained its reputation as a premier institute of learning, and it regularly dispatched research expeditions in a wide variety of fields. A group of zoologists from the University undertook an expedition to the planet Kowak, the homeworld of the Kowakian monkey-lizard, though the monkey-lizards sabotaged or stole most of the researchers equipment enough that the group was forced to abandon further attempts at studying them. Under the New Republic, a panel of multicultural scientists from the University of Coruscant was in charge of the formal designation of species' sentience, and they issued their rulings on different species only after a research team approved by the government had conducted an extensive field study. Significant findings that could affect a species' designation were also brought before the panel."}, {"tag": "p", "text": "During the Second Galactic Civil War, the Galactic Alliance Guard rounded up many Corellians on Coruscant, including a large number of students and professors at the University. The University greatly resented the Guard's actions, and various members of the school were more than willing to aid GAG captain Lon Shevu when he allied with the Jedi in order to bring down the Guard's leader and Co-Chief of State Jacen Solo. From his contacts at the University, Shevu was able to acquire a shuttle belonging to the University's geological survey team, and he and Ben Skywalker successfully masqueraded as a geological professor and student on a survey to the planet Kavan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}