{"url": "Untas", "categories": ["Category:Legends articles", "Category:Black Sun members", "Category:Humans", "Category:Males", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Untas"}, {"tag": "p", "text": "Untas was a Human male mercenary who lived on the planet Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Untas was an elite Black Sun mercenary. After the Battle of Yavin, Untas resided in Mos Eisley. He was friend with Sleash and was acquainted with Oldksam and Taibela."}, {"tag": "p", "text": "Circa 1 ABY, Untas was indebted to the crime boss Faeto. When Faeto placed a death mark on him, Untas, Oldksam and Sleash went into hiding. Untas joined the White Thranta Shipping Company, a front for illegal activities of Jabba the Hutt's criminal organization."}, {"tag": "p", "text": "Nevertheless, Taibela stayed in Mos Eisley where she was questioned by a bounty hunter. The bounty hunter persuaded her to reveal where Oldksam was hiding and, after finding him, convinced Oldksam to reveal Sleash's location. The bounty hunter later questioned Sleash and gave him his favorite spice. The drug addict was upset that Untas went into hiding without him and therefore gave his former partner's location, the White Thranta Shipping offices outside Mos Eisley. The bounty hunter infiltrated the bunker and finally found Untas. After giving Faeto's death mark to Untas, the bounty hunter killed him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Untas was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Untas was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}