{"url": "Unseen,_Unheard", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Star Wars Tales 24"], "nodes": [{"tag": "h1", "text": "Unseen, Unheard"}, {"tag": "p", "text": "\"Unseen, Unheard\" is a 6-page black and white comic featured in Star Wars Tales 24 (later collected in Star Wars Tales Volume 6). It is a story told from the perspective of Visas Marr, telling how she became the apprentice to Darth Nihilus after the Jedi Conclave at Katarr was destroyed."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "It is 4,000 years before the rise of the Galactic Empire. In the Mid Rim colony of Katarr a Miraluka female sits peacefully and gazes at the beauty of her world through the Force, unaware that her people have less than an hour left to live. Unbeknownst to them, their Force-sensitive race has attracted the attention of an unusual Sith Lord, one who sustains himself through death in the Force."}, {"tag": "p", "text": "The Devastation of Katarr by way of the Sith Lord's considerable Force powers sends an echo, through the Force, of the screams of countless lives in which the female Miraluka sees the death of all living things on her world. Unconscious and near death herself, the Miraluka is taken aboard the Ravager, a seemingly destroyed ship of the Sith Lord, where she is healed of her injuries."}, {"tag": "p", "text": "Upon awakening, the Miraluka does not know where she is or why she has been spared. Seeking out the Sith Lord, she suddenly becomes aware that the answer to her question is that the Sith Lord wants her people, at last, to see."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the female Miraluka and the Sith Lord are not identified in the comic, players of Star Wars: Knights of the Old Republic II: The Sith Lords can recognize Visas Marr as the Miraluka and Darth Nihilus as the Sith Lord."}, {"tag": "p", "text": "While the comic does not specify an exact date for the events in the story, Star Wars: Knights of the Old Republic II: The Sith Lords gives the date 3952 BBY as the date of the Jedi Conclave on Katarr, which is considered responsible for the devastation of Katarr."}, {"tag": "h2", "text": "Collections"}]}