{"url": "Unstable_Terrain_Artillery_Transport/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Galactic Republic repulsorcraft", "Category:Kuat Drive Yards products", "Category:Mekuun Corporation products", "Category:Mobile artillery"], "nodes": [{"tag": "h1", "text": "Unstable Terrain Artillery Transport"}, {"tag": "p", "text": "The Unstable Terrain Artillery Transport (UT-AT), also known as the \"Trident,\" was a military transport and assault vehicle that served the Grand Army of the Republic during the Clone Wars when the use of walkers was unsuitable. Though slow and vulnerable, the vehicle was adept at crossing bridges and traversing unstable terrain, but due to its elevated position it was constantly prone to enemy attack. Alternate configurations of the UT-AT were stocked with bridge laying equipment, converting the transport into an effective trail blazer."}, {"tag": "p", "text": "The vehicle was developed by Kuat Drive Yards and Mekuun Corporation following a disastrous use of walkers on the agriworld of Agamar. Realizing that walkers were not the answer in such situations, the two companies developed a repulsorlift ski system, which involved a series of undulating panels that would adapt to different terrain. The vehicle was favored by Jedi General Ki-Adi-Mundi, and was used to great effect on Mygeeto and Cato Neimoidia."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Since the heavy footfalls of Republic walkers had caused bridge collapses on the front lines, Kuat Drive Yards and Mekuun Corporation eliminated the catalyst altogether. Instead of \"legs,\" the UT-AT featured 16 low-power repulsorlift skis that would shift to properly balance the vehicle depending on the terrain. Four additional repulsorlift plates were located under the main carriage for propulsion. The skis also had the ability to reverse their repulsion, causing gription fields and allowing the vehicle to ascend sheer surfaces if needed. The skis supplied superior stability when firing, and were particularly effective on unstable terrain."}, {"tag": "p", "text": "Although the skis canceled out the weight of the vehicle, it was still difficult to maneuver due to its significant inertial mass. This limited the recommended speed of the craft to 45 kilometers per hour. The skis were blast-proof, which made them invulnerable to light blaster fire, but not to explosive charges. A significant amount of heat was generated by the undulating plates, which was compensated for by an air vent located towards the front of the vehicle."}, {"tag": "p", "text": "For armament, the UT-AT had three forward-facing cannons: one dorsal anti-infantry cannon, and two side-mounted medium cannons. This configuration earned it the nickname \"Trident.\" Bomblet generators were also installed, allowing drivers to unleash a maelstrom of ion-charged destruction on opposing droid armies. Shells and other artillery were stored externally on racks. Standard configuration UT-ATs also featured four anti-personnel turrets in the rear of the craft, although variants featured supplies to bolster the vehicle's standard bomblet generators, while others stored temporary bridge equipment and kits. This configuration would allow UT-ATs to forge a path over unsteady terrain while placing a suitable track for the heavier walkers."}, {"tag": "p", "text": "The cockpit of the UT-AT had positions for a driver and a gunner, who would operate the two side cannons. Twenty additional troops could be transported in the front half of the vehicle, where the bulk of the internal machinery was also held. Scanning equipment was located under the cockpit, providing the driver with ample data relevant to their field of view. The rear was padded with heavy armor and stations for the anti-personnel gunners, although this would change with alternate variants."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin and development"}, {"tag": "p", "text": "Despite the fact that the Rothana Heavy Engineering/Kuat Drive Yards All Terrain Tactical Enforcer had served the Grand Army of the Republic well on the battlefield, it did have several drawbacks and pitfalls, as experienced on the planet Agamar during the Mirgoshir campaign. Grand Army walkers attempted to traverse the natural bridges of the planet, but their heavy tread and gross weight prompted their collapse, resulting in the loss of significant amounts of personnel and armor."}, {"tag": "p", "text": "Kuat Drive Yards saw that their coverage of \"All Terrain\" had a clear deficiency, and so began devising a new vehicle that could cross bridges with a minimum of fuss, or, at least, would not be the cause of any unfortunate collapses. In an unusual move for the company, Kuat Drive Yards co-developed their new product with Mekuun Corporation, a company known for their expertise with repulsorlift technology, particularly on heavy vehicles. The product of their combined effort was the Unstable Terrain Artillery Transport, a vehicle that was not so much a walker as it was a tank."}, {"tag": "h3", "text": "Application"}, {"tag": "p", "text": "UT-ATs were put to use in environments not suited to the AT-TE, such as snowy wastelands or shifting surfaces. However, although Kuat Drive Yards and Mekuun had solved the problem of the collapsing bridges, the UT-AT was exceptionally slow and had considerable vulnerabilities. Due to the vehicle's elevated position, a significant gap existed between the vehicle and the surface, which could be exploited by well-placed explosives. If hit in such a fashion, the UT-AT would rocket up into the air before crashing back down, usually killing all crew and passengers."}, {"tag": "p", "text": "The UT-AT was used frequently in the closing stages of the Clone Wars, particularly on worlds with an abundance of bridges, such as Cato Neimoidia and Mygeeto. In the battle for the latter, Jedi General Ki-Adi-Mundi and Commander CC-1138 utilized several of the vehicles to press the attack. Since Mygeetan cities were interlinked by a honeycomb of bridges, use of the vehicle was pivotal, although many UT-ATs fell prey to the precise shots of Tri-droids. The attack pressed on, however, and CC-1138 utilized the vehicle's bomblet generator to great effect, clearing the way for the troops of the 21st Nova Corps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First appearing in George Lucas' Star Wars: Episode III Revenge of the Sith, the UT-AT was named and elaborated on by Billy Buehler and \"The Dark Moose\" through the StarWars.com Hyperspace feature, \"What's The Story?\". Buehler supplied the name and the majority of the information included in the final entry, while \"The Dark Moose\" contributed technical elements and the final paragraph. \"The Dark Moose\" had originally called the craft an \"All-Terrain Combat Sled,\" but this was passed over in favor of Buehler's submission. The \"What's the Story?\" information has gone on to be referenced in three other works of Star Wars media: Star Wars: The Complete Visual Dictionary, Guide to the Grand Army of the Republic, and The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}