{"url": "Upekzar", "categories": ["Category:Legends articles", "Category:Sith planets", "Category:Sith Worlds", "Category:Upekzar locations"], "nodes": [{"tag": "h1", "text": "Upekzar"}, {"tag": "p", "text": "Upekzar was a small terrestrial planet counted among the Sith Worlds of the Esstran sector that was unique among the mostly barren worlds of the Stygian Caldera for its diversity of verdant biomes. The planet was most notable for the Circle of Visions, a circular ring of islands and seashore locations concentrated in the planet's southern hemisphere that hosted expansive volcanic cave systems."}, {"tag": "p", "text": "The caverns of the Circle of Visions were home to the rhak-skuri, a subspecies of diplura who hunted by means of a pheromone known to cause nightmare-like hallucinations in certain humanoid species. The Sith of the Sith Empire who first settled Upekzar incorporated the rhak-skuri into their Mysteries, a series of Sith rituals that were conducted at five separate locations on the Circle of Visions and required protracted exposure to the diplurans' pheromones."}, {"tag": "p", "text": "Though historically insignificant for most of its recorded history, Upekzar came to the forefront of galactic events in 44 ABY. During the Jedi Order's hunt for the rogue Force entity Abeloth and the Sith Meditation Sphere known as Ship, Grand Master Luke Skywalker and a strike team of Jedi investigated Upekzar's ruined city and its nearby cave system for clues, inadvertently rediscovering a colony of mutated rhak-skuri and springing a trap set by Abeloth that both turned the city to ash and coerced the nearby volcano into eruption."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Geography"}, {"tag": "p", "text": "Upekzar was the primary planet of the system of the same name, a star system located in the Esstran sector of the Outer Rim Territories. Unlike many of the mostly barren Sith Worlds of the Stygian Caldera, Upekzar was a small terrestrial world home to a diverse set of verdant biomes that ranged from lush rainforests to mountainous plains to island-dotted oceans. The planet's most notable feature was the Circle of Visions, a circular chain of volcanic islands and seashore locations that stretched across the planet's southern hemisphere from the south pole to the equatorial regions. These islands were home to disparate networks of volcanic cave systems initially carved out by lava flow and subsequently abandoned by retreating magma during their volcanoes' respective periods of dormancy."}, {"tag": "p", "text": "Though described by Jedi Knight Natua Wan as a \"pleasant planet,\" Upekzar hosted a number of sites tainted with the dark side of the Force that bore testament to its tenure as a Sith colony world. On account of the multiplicity of Sith rituals conducted along the Circle of Visions, certain sites where the dark side flourished exhibited strange weather patterns and generated Sithspawn mutations in the native lifeforms. In the vicinity of Upekzar's largest city and its nearby cave system, a large black-gray storm cloud that stretched kilometers in length perpetually loomed over the region, crackling with blue Force lightning and generating a strong, foul, cold wind that swept outwards from the city."}, {"tag": "h3", "text": "Fauna"}, {"tag": "p", "text": "The lava tubes and cavern networks of the Circle of Visions came to be inhabited by the rhak-skuri, a subspecies of diplura endemic to Upekzar who secreted a pheromone known to produce nightmare-like hallucinations in certain humanoid species. The subsequent Sith settlers who colonized Upekzar during the era of the Sith Empire built their society around the rhak-skuri, developing a series of Sith rituals and acolyte initiation ceremonies called the Mysteries that involved protracted exposure to the rhak-skuri pheromones. The Sith restricted their colonization of the planet to five specific locations along the Circle of Visions associated with their Mysteries, leaving the vast majority of the verdant world uninhabited."}, {"tag": "p", "text": "As a subspecies of diplura, the original rhak-skuri were relatively small and otherwise harmless nonsentient creatures. Though their pheromones could cause terrifying hallucinations and nightmares in certain sentient species, the secretion itself was harmless, and the rhak-skuri's mandibles were too small to even pierce Human or Falleen skin. However, due to centuries of involvement in dark side rituals, the rhak-skuri mutated over time. By 44 ABY, the species had evolved into two-meter-tall predators that possessed some degree of sentience, able to recognize and telepathically communicate with Sith and differentiate between light-sided and dark-sided Force users."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "As one of the Sith Worlds of the Stygian Caldera, Upekzar was first settled by the Sith species during the era of the Sith Empire. During their initial explorations of the planet, the early Sith settlers discovered the Circle of Visions, a circular chain of volcanic islands and seashore locations that stretched across the planet's southern hemisphere from the south pole to the equatorial regions. Deep in the Circle's volcanic cave systems and pyroducts, the Sith stumbled upon colonies of rhak-skuri, a subspecies of diplura endemic to the planet notable for secreting a pheromone capable of producing nightmare-like hallucinations in certain humanoid species."}, {"tag": "p", "text": "The Sith of Upekzar built their nascent society around the rhak-skuri, developing a series of rituals and acolyte initiation ceremonies called the Mysteries that involved protracted exposure to the rhak-skuri pheromones. The Sith restricted themselves to five distinct locations scattered along the Circle of Visions that were associated with their five Mysteries, leaving the bulk of the verdant planet uninhabited. While the Cold Rites were conducted near the planet's south pole and the Rites of Fire along the equator, the most significant of the Mysteries, the High Rites, were undertaken in a temperate region of the planet. As these rituals were restricted to the strongest Force users on Upekzar, the nearby city that lay in the shadow of a dormant volcano was likewise home to the most powerful Sith on the planet."}, {"tag": "p", "text": "Though this settlement was eventually abandoned, the vestigial dark side energies introduced by centuries of Sith rituals persisted for millennia after its ruin. A black-gray cloud that crackled with Force lightning and generated a foul, cold, heavy wind that swept outwards from the city center perpetually loomed over the region, stretching across the city to the nearby dormant volcano some three kilometers distant. Likewise, on account of their use in the High Rites, the native rhak-skuri had mutated over centuries into two-meter-tall predators that had evolved some degree of sentience. These particular creatures were able to recognize and telepathically communicate with Sith and differentiate between light-sided and dark-sided Force users."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Though historically insignificant in comparison to the other worlds of the Stygian Caldera, Upekzar was brought to the greater galactic consciousness around 44 ABY. During the the Jedi Order's hunt for the rogue Force entity Abeloth and the Sith Meditation Sphere known as Ship, Grand Master Luke Skywalker and a large strike team of Jedi descended upon Upekzar in search of clues as to Ship's whereabouts. While Skywalker and the bulk of the Jedi force advanced on the ruined city where the strongest Sith Force users on Upekzar had once resided, his son Ben Skywalker, former Sith Saber Vestara Khai, and Jedi Knight Natua Wan went spelunking through the nearby cave system, the location at which the Sith had historically conducted their Mysteries' High Rites."}, {"tag": "p", "text": "In the course of their explorations, the latter group encountered many vestigial traces of the Sith presence in the caves, ranging from caverns filled with Sith lightsabers where initiates disarmed prior to conducting the High Rites to the decaying skeletons of deceased acolytes. The residual power of the dark side was likewise made evident in the mutated rhak-skuri the group encountered deeper in the caves. Disabling Skywalker by means of their pheromones, the creatures attempted to feed on the young Jedi, ignoring Khai's attempts to distract them. Realizing that the telepathic rhak-skuri had evolved a means of identifying their Sith masters and distinguishing between lightsiders and darksiders, Khai instead injured Wan and sacrificed the elder Jedi Knight to the Sithspawn, saving Skywalker's life in the process."}, {"tag": "p", "text": "In the ruined city, Skywalker and the bulk of the Jedi team made their way through the abandoned streets to the city center, where a subterranean hangar that had once held a Sith Meditation Sphere lay buried beneath a public square. Inadvertently springing a trap set by Abeloth that bound the dark side energies of Upekzar within the reanimated corpse of Tola Annax, the Jedi were forced to flee from the resultant Force bomb that turned the city to dust. Ben Skywalker and Vestara Khai were likewise forced to flee the nearby cave system, as Abeloth's trap had likewise coerced the formerly dormant volcano to erupt."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "For much of its recorded history, Upekzar was primarily inhabited by the ancient Sith, a red-skinned, Force-sensitive species positively predisposed to the dark side that was native to the nearby world of Korriban in the Stygian Caldera. During the era of their Sith Empire, Sith colonists from other Sith Worlds discovered and converged on Upekzar, settling the world at five distinct locations scattered along its Circle of Visions. Their settlements, at least one of which was a decent-sized city, were located in close proximity to volcanic cave systems in which lurked the native dipluran subspecies known as the rhak-skuri, translated from the Sith language as \"dream singers.\""}, {"tag": "p", "text": "However, the Sith of Upekzar were notably different from mainline Sith in several respects. In contrast to many of their fellow dark siders, they did not view themselves as conquerors, nor did they cultivate a martial focus. Instead, they focused on the metaphysical, harnessing the hallucinogenic aspects of the rhak-skuri pheromones in the development of their Mysteries. The architecture of their main city, which did not exhibit the aesthetics of a fortress, likewise reflected their non-martial focus. Though a functional curtain wall surrounded the entirety of the city, its exterior was extensively decorated with elaborate paintings of red-eyed Sithspawn and murals of Sith sparring and meditating. The city was accessible from the outside world by means of an innocent-looking durasteel portcullis, and its buildings were designed simply to protect and shelter their inhabitants from the elements rather than inspire awe or intimidate their beholders."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Circle of Visions"}, {"tag": "p", "text": "One of the most noteworthy geographical features on Upekzar, the Circle of Visions was the name given to a circular ring of volcanic islands and seashore locations that spanned Upekzar's southern hemisphere from its south pole to the equator. Many of the sites that together constituted the Circle of Visions hosted subterranean volcanic cave systems initially formed by lava flow and subsequently abandoned by retreating magma during their volcanoes' respective periods of dormancy. Many of these caves were home to colonies of rhak-skuri, a subspecies of diplura who generated a pheromone known to cause nightmare-like hallucinations in certain Humanoid species. Five such locations along the Circle of Visions came to host Sith settlements during the era of the Sith Empire, each of which was built around a cave system in which the Sith conducted one of their five initiation Mysteries."}, {"tag": "h3", "text": "High Rites cave system"}, {"tag": "p", "text": "One of the larger and more significant cave systems along the Circle of Visions was the network in which the ancient Sith conducted their Mysteries' High Rites. Unlike the Cold Rites, the Rites of Fire, and the other Mysteries of the Sith, the High Rites were only observed and conducted by the most powerful Sith Force users on Upekzar, many of whom lived in the nearby city. In addition to its natural caverns, the cave system was home to a collection of artificially expanded rooms in which initiates would disarm and prepare themselves prior to their ritualistic perambulations. By 44 ABY, the caves' colony of rhak-skuri had mutated into two-meter-tall predators that possessed some degree of sentience, able to recognize and telepathically communicate with Sith and differentiate between light-sided and dark-sided Force users."}, {"tag": "h3", "text": "Unidentified city"}, {"tag": "p", "text": "One of the planet's most important cities was built some three kilometers away from the cave system in which the most powerful Sith on Upekzar conducted their Mysteries' High Rites. Lying in the shadow of the caves' dormant volcano, the city was unique for its embrace of an architectural paradigm that was equal parts functional and decorative. Unlike many traditional Sith structures, the city was not built as a fortress designed to impose and awe its observers. Instead, while its outer curtain wall served a functional purpose in protecting the city, its exterior was extensively decorated with elaborate paintings of red-eyed Sithspawn and murals of Sith sparring and meditating. Similarly, its buildings were designed simply to protect and shelter their inhabitants from the elements, and its portcullis gate was little more than an innocent-looking contraption that served solely to permit entry into the city premises."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Upekzar made its first and only appearance in Legends canon in Fate of the Jedi: Ascension, a 2011 novel by Christie Golden. Though Ascension referred to the planet as a \"Sith world\" associated with the ancient Sith, the Star Wars: The Essential Atlas Online Companion subsequently confirmed its status as one of the titular Sith Worlds of the Stygian Caldera via its inclusion in the Esstran sector and grid coordinate R-5."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}