{"url": "Unox", "categories": ["Category:Canon articles", "Category:Spice producing worlds", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Unox"}, {"tag": "p", "text": "Unox was an astronomical object, and the location of an abandoned spice mine. Prior to a heist in the Red Mist Slinani Migration Shrine, the rogue archaeologist Doctor Chelli Aphra visited Unox with her ward Vulaada Klam, leaving Klam's pet qaberworm on Unox during the mission. After returning to Unox, having additionally stolen the ancient weapon known as the Farkiller, Aphra was taken prisoner by the Rebel Alliance's Extraction Team Misericorde, led by Captain Magna Tolvan."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Unox was a terrestrial astronomical object with a rocky surface. A number of geysers were present on Unox's surface, releasing steam into its atmosphere, which was breathable to a number of species, including humans. From the ground, Unox's sky appeared yellow."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, a spice mine was constructed on Unox, extracting spice from the astronomical object, but the facility was eventually abandoned. Sometime prior to the Battle of Hoth in 3 ABY, the rogue archaeologist Chelli Aphra and her young ward Vulaada Klam stopped on Unox before undertaking a heist mission in the Slinani Migration Shrine Red Mist. Aphra left Klam's pet qaberworm, Gurtyl, on Unox, leaving for Red Mist in her starship, the Ark Angel."}, {"tag": "p", "text": "After the heist was successful, Aphra and Klam returned to Unox to collect Gurtyl. However, they were tracked to Unox by the Rebel Alliance strike team Extraction Team Misericorde, who wished to confiscate the Farkiller of Oo'ob the Jedi apostate, an ancient lightsaber-powered weapon Aphra had found while in Red Mist. The forces of Extraction Team Misericorde landed on Unox, and Captain Magna Tolvan disembarked, stunning Aphra and taking her and Klam to a temporary Rebel Alliance headquarters on the space station Trading Post Sh'ung-tesk."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A spice mine was constructed on the surface of Unox, but was abandoned by the time of Aphra's heist mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Unox first appeared in Doctor Aphra 32, a comic written by Simon Spurrier, illustrated by Wilton Santos and Caspar Wijngaard, and published by Marvel Comics on May 8, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}