{"url": "Ur-Kitt%C3%A2t", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Languages", "Category:Sith culture"], "nodes": [{"tag": "h1", "text": "ur-Kittât"}, {"tag": "p", "text": "ur-Kittât, commonly known as Sith or the Old Tongue, was the runic language of the Sith. It was spoken by members of the Sith Order and the Sith Eternal cult as a secret language and written in a runic form."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "ur-Kittât was originally spoken by the Sith. It commonly adorned their temples, such as the Sith Citadel on Exegol, and their obelisks, such as the ones found outside the Malachor Sith Temple. The writing was also in the tomb of Darth Bane  and the Lothal Jedi Temple. The language was also used in Sith rituals. However, by the time of the Galactic Republic and amidst an effort to quarantine Sith worlds and erase Sith history, ur-Kittât was considered a forbidden language, and the Senate passed legislation forbidding protocol droids from translating any texts from it. Despite this prohibition, Darth Bane's Sith Order continued to use both ur-Kittât and its Balc dialect. Some Jedi were also familiar with how to read and speak the language."}, {"tag": "p", "text": "By the reign of the Galactic Empire, ur-Kittât was known as \"the Old Tongue\" or simply \"Sith.\" However, it continued to be spoken by Galactic Emperor Darth Sidious, who taught it to his apprentice, Darth Vader. The language was also etched into a dagger containing the whereabouts of the Emperor's wayfinder, which led to the hidden Sith world of Exegol."}, {"tag": "h2", "text": "Written forms"}, {"tag": "p", "text": "ur-Kittât was written in runes. Several variations of its written form existed, as the text Ahsoka Tano translated outside the Malachor Sith Temple was of a very old form. Line spacing, breaks, and inflection could change the meaning of certain words and sentences, as the Sith Eternal inscriptions concerning the dyad between Ben Solo and Rey were almost exactly like inscriptions describing the Rule of Two."}, {"tag": "h2", "text": "Known vocabulary"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith language originates in the Star Wars Legends comic-book series Star Wars: Tales of the Jedi, published in the 1990s."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}