{"url": "Uprising", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Uprising individuals"], "nodes": [{"tag": "h1", "text": "Uprising"}, {"tag": "p", "text": "The Uprising was an insurgency movement that fought the Galactic Empire in the Anoat sector in the aftermath of the Battle of Endor. It started after the Imperial Governor Ubrik Adelhard, upon hearing of Emperor Palpatine's death at Endor, locked his sector down and established the Iron Blockade. The Uprising consisted of civilians, bounty hunters, assassins, gangsters, and smugglers. The Alliance to Restore the Republic was relatively weak within the Anoat sector when the blockade was established, so almost all Alliance members were locked out, with very few members trapped inside and unable to contact the rest of the Alliance. While these rebels supported the Uprising, most members of the Uprising were independent and not in contact with the main Alliance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After twenty-three years of ruling his Galactic Empire, the malevolent Emperor Palpatine was killed during the Battle of Endor by his own apprentice, Anakin Skywalker. Not only was the Emperor dead, but his DS-2 Death Star II Mobile Battle Station battle station was destroyed by the enemy Alliance to Restore the Republic. Upon hearing of Palpatine's demise at Endor, the Imperial Governor locked the Anoat sector down, establishing the Iron Blockade. With the help of Commander Bragh and his heavily-armored Purge Troopers, the governor started eliminating those who opposed his blockade."}, {"tag": "p", "text": "A few months into the blockade, a young smuggler from the mining world of Burnin Konn became a rising star of the smuggling milieu. During a raid on the Imperial facilities on Nar Hypa, the Smuggler discovered a recorded message from Leia Organa, Princess of Alderaan and figurehead of the Alliance, informing the galaxy of the Empire's defeat at Endor and the death of Palpatine. Following that discovery, the Smuggler, Riley and all of their associates were branded public enemies, and became the target of Bragh's Purge Troopers. Intent on taking revenge on the Empire, the Smuggler and Riley set off on a quest to find powerful allies."}, {"tag": "p", "text": "The first faction the siblings managed to convince was the Ivax Syndicate, a criminal enterprise whose leader was Voras the Hutt. Later on, the Smuggler went to negotiate with representants of the Noble Court, a group of exiled aristocrats hiding from the Empire. After getting rid of the renegade Earl Alner, the Smuggler got into the good graces of Her Majesty, head of the Noble Court, who agreed to ally her forces with the Syndicate against Adelhard and Bragh. Eventually, the Smuggler was contacted by the Kouhun, an initiatory order of assassins. Although reluctant to work with them at first, the young hero ended up enrolling the Kouhun in the new resistance movement. That unlikely tripartite alliance came to be known as the Uprising."}, {"tag": "p", "text": "Despite having very different philosophies, the nobles, the criminals, and the murder cultists shared an interest in getting rid of the Empire, and they were all crystallized around the figure of the promising Smuggler. The newly created Uprising came to the conclusion that kidnapping Commander Bragh would give them leverage on Governor Adelhard. In order to do so, their first joined operation consisted in arming the Noble Court's ceremonial Throneships, failing which they could never beat Bragh's Imperial-class Star Destroyer. To that aim, the Smuggler established three camp sites on the gelid planet of Hoth, whose icy plains were littered with wreckages of military ships. In addition to several turbolaser batteries, the Uprising also managed to recover a rare and volatile stardrop torpedo."}, {"tag": "p", "text": "It was Deathstick, leader of the Kouhun, who outlined the plan to abduct Commander Bragh. Having leaked that the Smuggler and Riley would be hiding in the ruins of Anoat city, Deathstick would set up an ambush. The Kouhun leader presumed that Bragh would first send his troopers to deal with the Smuggler, but would eventually be forced to personally lead his men to the surface. At that moment, the ambushed Kouhun assassins would spring their trap, killing the troopers and capturing Bragh. Meanwhile, in orbit, the rearmed Throneships of the nobles would be ready to take on Bragh's Star Destroyer."}, {"tag": "p", "text": "Unbeknownst to the Smuggler and all other members of the Uprising, Riley struck a deal with Bragh: the Empire would be allowed to capture the leaders of the Noble Court and Kouhun in exchange for amnesty for Riley and her sibling. Bragh's men sprang the trap on Anoat and captured Her Majesty and several Kouhun assassins, including Loathe. While Riley insisted that her plan was the only way they could remove their death mark, the Smuggler felt responsible and enlisted the help of Tam Bastion, leader of the Rebels in the sector, to free their allies, sending him Princess Leia's recording."}, {"tag": "p", "text": "Bastion said that their allies were likely being held in the Crypt, a high-security, heavily-guarded Imperial prison on a lifeless moon of Pujool. Bastion and the Smuggler formed a plan to send out a sector-wide broadcast of Leia's recording as a diversion. The ensuing turmoil would draw Imperial attention away from the Crypt, giving the Smuggler enough of a window to break in and free their allies. With technical support from the Rebels, the Smuggler used Cloud City's comm array to hack into Imperial networks and broadcast the Princess's message of freedom. Riots soon broke out on several planets, including Delphon and Council."}, {"tag": "p", "text": "Following the broadcast, the Smuggler reconnected with Riley, who decided to support her sibling in the rescue mission. In a series of strikes on several of the compounds on Pujool, the Smuggler gained the support of the Kouhun, the Noble Court, and the Trade Spine League to free as many prisoners as they could, including Her Majesty. Soon after, Riley and her sibling located a command compound on Pujool where Bragh was undoubtedly waiting for them. The Smuggler traveled to the compound to confront Bragh and defeated him. Governor Adelhard was present via hologram and, with Bragh's death, assured the Smuggler that the Empire would hunt the Uprising down relentlessly to ensure that the Emperor's legacy lived on."}, {"tag": "p", "text": "At Cloud City, the Smuggler called together the leaders of the Trade League, Ivax Syndicate, Noble Court, Kouhun, and the Rebels. Despite their differences, they realized their cooperation at the Crypt was what succeeded in the end. The Smuggler convinced all of them that working together in a formal Uprising was the only way they could liberate the sector from the Empire's reign. All faction leaders agreed to join, with Bastion recommending a location for a potential base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}