{"url": "Uro_(Aqualish)", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Aqualish", "Category:Criminals", "Category:Individuals of unspecified gender"], "nodes": [{"tag": "h1", "text": "Uro  (Aqualish)"}, {"tag": "p", "text": "Uro was an Aqualish associated with the Hidden Hand criminal syndicate during the Imperial Era. At some point prior to the Battle of Hoth, Uro talked with the Weequay criminal Holaq on the world Fikari. When the Sith Lord Darth Vader arrived on the world during his search for the Hidden Hand, the Aqualish was killed by the Sith Lord alongside several other associates, including Holaq."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Uro was an Aqualish who had done business with the Hidden Hand criminal syndicate at some point prior to the Battle of Hoth in 3 ABY. While residing in the Lower Bay Docks on the Outer Rim world of Fikari, Uro conversed with fellow criminal Holaq, asking if the Weequay had brought enough firearms. Holaq exclaimed that the Sith Lord Darth Vader had attacked a number of clans that had been in contact with the Hidden Hand and left no survivors. Uro, unfazed, replied that it was the cost of working with the criminal syndicate, but stated that this also provided a benefit to the syndicate's clients as deals with the Hidden Hand and its contacts were kept anonymous."}, {"tag": "p", "text": "As the two continued talking while walking, Holaq asserted that the syndicate's days were numbered as Vader was hunting them down. As the Aqualish accused the Weequay of being afraid of the Sith Lord, Uro heard a noise and quickly alerted Holaq. Unbeknownst to the two criminals, Vader, who had arrived at the docks searching for information on the Hidden Hand, had slaughtered the docks' guards. Standing behind Holaq, Uro was suddenly pulled back by the Sith's Force powers and killed, while Holaq continued scanning the surrounding area, unaware of the Aqualish's demise. Vader then proceeded to interrogate and kill Holaq."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a four-eyed Aqualish, Uro had gray skin, gray hair, and yellow eyes. Uro enjoyed the benefit of working with the Hidden Hand as deals conducted with the syndicate were kept anonymous. Unlike Holaq, the Aqualish did not fear Vader upon hearing the stories of the Sith Lord eliminating clans who worked with the Hidden Hand."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Uro wore gray pants and a black shirt underneath a brown jacket and a green cape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Uro appeared in the first issue of the 2019 comic-book series Star Wars: Target Vader, written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}