{"url": "Urbax", "categories": ["Category:Legends articles", "Category:Black Sun members", "Category:Cathar", "Category:Males"], "nodes": [{"tag": "h1", "text": "Urbax"}, {"tag": "p", "text": "Urbax was a male Cathar who was a high-ranking member of the Black Sun during the Cold War between the Galactic Republic and reconstituted Sith Empire. He was killed on Coruscant by a smuggler and their associate Corso Riggs after being hired by his longtime acquaintance Skavak to assassinate the Sullustan lawman Miel Muwn."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the year 3643 BBY, Urbax was a member of the crime syndicate known as Black Sun in the Galactic Republic's capital planet of Coruscant. Skavak, a criminal and smuggler who was a longtime friend of Urbax, visited and subsequently hired him to murder Miel Muwn, a Sullustan Constable Brigade officer who had been chasing Skavak across the galaxy. Urbax left to deal with the lawman in a hangar in the Coruscant Spaceport. As with all Black Sun dealings, their meeting was recorded. A smuggler and their companion Corso Riggs, who had come to Coruscant searching for Skavak and the former's XS stock light freighter, retrieved the holorecordings of the meeting on a tip from their informant Darmas Pollaran and learned of Urbax's mission."}, {"tag": "p", "text": "Urbax's men had surrounded Muwn in the hangar when the two outlaws arrived. Using the Sullustan Criminal Code's Article 11607, Muwn deputized them, legally permitting the two to aid him. Together, they succeeded in killing Urbax and his thugs."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Urbax had brown hair and fur, and orange eyes. He referred to the Sullustan Miel Muwn as a \"little mouse\", and angrily wondered aloud if he was either deaf or stupid after Muwn continued to order them to stand down."}, {"tag": "p", "text": "Urbax readily accepted a job from his longtime acquaintance Skavak, though he gruffly remarked that Skavak didn't have any friends when the latter referred to the two of them as such, and demanded payment for the job up front."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Urbax first appeared in BioWare's 2011 massively multiplayer online roleplaying video game Star Wars: The Old Republic, as a minor antagonist in the Coruscant portion of the Smuggler class story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}