{"url": "Utapau/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Empire planets", "Category:New Republic planets", "Category:Tarabba sector planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Utapau locations"], "nodes": [{"tag": "h1", "text": "Utapau"}, {"tag": "p", "text": "Utapau (pronounced /'ʔuːtəˌpaʊ/) was an arid sinkhole world in the Utapau system of the Tarabba sector in the Outer Rim Territories. Utapau was the homeworld of the Pau'ans and the Utai, more commonly referred to collectively as Utapauns. These species lived in the many giant sinkholes that dotted the planet's scrub-covered surface."}, {"tag": "h2", "text": "Geology and geography"}, {"tag": "p", "text": "51,000 light years from the core, Utapau orbited a single sun and was itself orbited by nine moons. It was composed of a small molten metallic core, with a rocky mantle and rocky, calcareous crust. Surface water made up only 0.9% of the planet, although most significantly, a vast subterranean ocean encircled the planet below the crust. Although extensive surface oceans once covered the planet, they leaked away to the subterranean ocean through the readily eroded crust through vast caverns that were once giant magma chambers. In turn, the erosive sea has contributed to the giant sinkholes throughout its windswept and grassy habitable areas. The resulting vast mineral deposits below the ocean are a great source of wealth for the planet.[source?]"}, {"tag": "h4", "text": "Sinkholes"}, {"tag": "p", "text": "Sinkholes on Utapau were a common geological feature that appeared in areas where the rock below the surface of the land is made from substances like salt beds, limestone, carbonate rock (which is referred to as a karst landscape) that can be dissolved by ground water flowing through them. This rock can also be weakened by acidic rain. When these rocks dissolve, large spaces develop underneath until it gets too big and the land above the gap collapses. Naturally-occurring sinkholes are also created by long periods of drought, or when caves with underground streams naturally give way.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Utapau was a peaceful world that attempted to remain neutral in times of galactic conflict. The sinkhole world was shared by two symbiotic humanoid races whose common ancestors settled the planet at some point after 57,000 BBY. The languid, gray-skinned Pau'ans composed only thirty percent of the planetary population but served as the port masters, bureaucrats, and patricians of the world. The stubby, humble Utai composed the Utapaun labor class, which maintained the windmills of their sinkhole cities and served as handlers for the native varactyl and dactillion dragonmounts."}, {"tag": "p", "text": "Originally, the Pau'ans and the Utai colonists lived separate lives; the Pau'ans on the unremarkable surface, the Utai deep underground. In the 10,000-year span before the Clone Wars, the planet's climate began to change, causing stronger and stronger hyperwind storms. This forced the Pau'ans to move underground, re-establishing relations with the Utai people and adding their own, unique touch to the Utai cities. The sinkhole communities soon became a mix of Pau'an and Utai architecture, such as the form known as Ossic. These cities were built into the crevasses and rocky ledges that lined the edges of the sinkholes."}, {"tag": "p", "text": "The mixed population of Utai and Pau'ans were divided into city states, with occasional border skirmishes and small wars occurring between separate sinkhole communities. However, thanks to the efforts of Utapaun nobles such as Timon Medon, the various cities were brought together and Utapau was unified. To fuel the modest energy needs of the sinkhole cities, many large windmill farms were erected on the wind-blasted surface. These farms were responsible for generating over 99% of the energy consumed by the Utapaun communities."}, {"tag": "p", "text": "During the Great Galactic War, Utapau became one of the many battlegrounds between the Galactic Republic and the resurgent Sith Empire."}, {"tag": "p", "text": "Around 50 BBY, an offworld water-mining company discovered supposed healing elements in the underground water lakes of Utapau; the export of this water brought Utapau into the galactic community. For millennia, a rumor additionally persisted that the planet was one of the birthplaces of the Jedi Order. This legend added to the sales pitch, but the water was soon discovered to have no extraordinary powers and the business ended. In the time before the Clone Wars, the planet also served as the headquarters of Buuper Torsckil Abbey Devices."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Utapau never joined the Galactic Republic. During the Clone Wars, Utapau remained neutral, but allegiance was forced upon the current Master of Port Administration, Tion Medon, when General Grievous and the Separatist Council took the world as their own, at the command of Darth Sidious. Grievous threatened to destroy Pau City should Tion attempt to call for help, though luckily, Jaing and Kom'rk Skirata located Grievous on the planet. Jedi Master Obi-Wan Kenobi went to Pau City to spring a trap on the Separatists and was greeted by Tion Medon, who secretly gave Kenobi the location of Grievous's Lucrehulk-class Droid Control Ship, Unlimited Projection."}, {"tag": "p", "text": "General Kenobi sent his astromech droid R4-G9 away with his starfighter back to the fleet of Republic Ships to make the CIS believe he was leaving. He then attacked Grievous while he was unprepared. During Kenobi's battle with Grievous, Commander Cody's forces arrived, including a detachment of the 501st Legion along with his own soldiers of the 212th Attack Battalion, as well as local Utapaun warriors and pilots. Obi-Wan defeated Grievous and the droids. Eventually, Order 66 was issued and Cody followed an unsuccessful attempt to kill Kenobi. The clone troopers, following Order 66 and the Declaration of a New Order, turned on Obi-Wan, nearly killing him and forcing the Jedi Master to flee Utapau. The clone troopers then rounded up members of the resistance movement, including Tion Medon, and deported some to Byss, where they were used as slaves in \"recolonization efforts\"."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Galactic Empire later established a secret storehouse on Utapau, holding artifacts such as the remains of Grievous's body and his starfighter. In 0 BBY, Utapau was predominantly governed by the Fey family, and there was some Rebel influence on the remote world. The Zann Consortium had the option to corrupt this world by sending Silri and a detachment of Defilers, 2 Missile Attack Launchers (MALs), and droideka Mark IIs to kidnap Garnak Fey and force the Utapau government to meet the Consortium's demands.\nFollowing the Battle of Endor, Utapau was one of the first worlds to become part of the New Republic, a move designed to prevent the likelihood of once again being attacked and occupied by invading forces."}, {"tag": "h3", "text": "Second Imperial Civil War"}, {"tag": "p", "text": "During the Second Imperial Civil War, the remnants of the Galactic Alliance led by Admiral Gar Stazi set up a base on Utapau after their victory against Sith-Imperial forces on the world of Dac. Following the Devastation of Da Soocha, Sith scientist Vul Isen and Sith Lord Darth Azard set up a secret laboratory on the planet where Isen started to study the various species of the planet so as to poison them and destroy the Alliance resistance. He also planned to send a assassin to take out Admiral Stazi before releasing the toxin. Fortunately, Isen's plot was stopped by the Jedi Knights Wolf Sazen and Cade Skywalker along with their associates Jariah Syn and Deliah Blue. Isen's assassin, a guard in the Galactic Alliance who was paid off by the Sith, was killed by Syn and Blue, while Azard was mortally wounded by Sazen in a lightsaber duel, and Vul Isen himself was cut in two by Skywalker before he could poison the planet."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "From before the Clone Wars, Utapau was one of the worlds restricted by a Trade Federation arms embargo on remote galactic regions. Because of this, the local defense fleet was based around downscaled warships only, many of which were designed and built on Utapau itself, including a variant of the Rendili StarDrive Dreadnaught. It was capable of offering some protection against marauding pirates, but as a battleship, it was outclassed by those put out by rich, industrialized sectors. For example, each vessel was only about one-fifth the size of a Lucrehulk-class battleship and they were all destroyed by the invading Separatist forces."}, {"tag": "p", "text": "On the other hand, Utapau's primary starfighter, the Porax-38, was a tough, long-range snubfighter, designed for Utai pilots and capable of extended interstellar patrols of up to twenty days. They saw good use when the scattered Utapau Skyforce mustered to oust the Separatists alongside Republic forces at the Battle of Utapau.\nIn addition to mechanical vessels, the Skyforce also made use of native dactillions; giant, flying reptiles that could carry a rider into battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Utapau was a name for one of the planets (with Aquilae/Townowi and Ogana) that became Tatooine in the rough draft and second draft of A New Hope and was the original name for Naboo in the early drafts of The Phantom Menace."}, {"tag": "p", "text": "Artist Ralph McQuarrie envisioned a sinkhole planet during pre-production of A New Hope in 1976, and this artwork was approved by George Lucas during pre-production of Revenge of the Sith. Digimatte artist Brett Northcutt who designed Utapau said that he succeeded in creating \"the wheat-colored savanna that George and the art directors were looking for.\""}, {"tag": "p", "text": "Author Daniel Wallace has also pointed out that Utapau is reminiscent of the City of Bone in the Marvel Star Wars issue Star Wars 69."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}