{"url": "Utapau", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Rocky planets", "Category:Tarabba sector planets", "Category:Techno Union planets", "Category:Type I atmosphere planets", "Category:Utapau locations"], "nodes": [{"tag": "h1", "text": "Utapau"}, {"tag": "p", "text": "Utapau was a remote and rocky planet in the Outer Rim Territories' Utapau system that was covered with enormous sinkholes. Its native inhabitants were the Pau'ans and the Utai, though tribes of Amani also immigrated to the world. It was the location of the Battle of Utapau during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Outer Rim world located in the Utapau system, Utapau had a temperate climate and a rocky terrain of desert plains and large sinkholes. The planet had a population of 95 million. Pau'ans and Utai were native to Utapau, while the Amani had settled on the planet by the Clone Wars. The majority of Utapau's Amani lived deep underground. Bands of Sugi also lived on the planet."}, {"tag": "p", "text": "Below Utapau's surface was the massive \"world-ocean,\" a huge subterranean body of water. This water contained many powerful currents created by the tidal forces of Utapau's moons. These currents eroded the underside of the planet's crust and caused the formation of Utapau's many sinkholes and chasms, which, when combined with numerous storms, served to make the planet's surface inhospitable. One of Utapau's \"continents\" was more stable that the rest; for that reason, most Utapauns lived on that stabilized continent."}, {"tag": "p", "text": "Because of the lack of timber on the planet, Utapaun architecture was primarily constructed out of the bones of deceased animals. The bones of nearly all of the planet's fauna were used in construction, which later developed into a unique form of architecture known as ossic architecture. The skeletons of the huge animals that roamed the lower sinkholes and ocean had huge enough bones to be used as beams; other fossil bones were mined in caves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At least 57,000 years before the Battle of Yavin, Utapau was colonized by a race of humanoids, who eventually evolved into two sentient species."}, {"tag": "p", "text": "Hundreds of years before the Clone Wars, the native Pau'ans lived on Utapau's surface while the Utai colonists lived underground. Eventually, worsening hyperwind storms and extreme weather forced the Pau'ans to move underground with the Utai, building combined cities into the ledges of giant sinkholes. Stripped of trees by the violent winds of the surface, the new cities were built with numerous animal bones, eventually resembling giant animal skeletons to the casual observer. Additionally, the planet's formerly extensive oceans had long been draining underground, forming the sub-crustal world-ocean. The Utapauns' fresh water was extracted from machines that purified the seawater and also separated any valuable minerals from the ocean. Eventually, it was determined that the world-ocean contained a number of valuable substances that the planet began to export."}, {"tag": "p", "text": "In around 232 BBY, during the High Republic Era, Supreme Chancellor Lina Soh temporarily prohibited hyperspace travel in the Outer Rim Territories after a catastrophe known as the Great Hyperspace Disaster. The Disaster saw the freighter Legacy Run fall apart whilst travelling through hyperspace, causing it's fragments to emerge from hyperspace across the Outer Rim at random. The hyperspace ban meant that many Outer Rim worlds suffered food shortages as usual shipments were halted. Despite receiving special aid shipments, Utapau suffered food riots in its sinkhole cities."}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems sought the planet. Despite this, the planet remained neutral. Late in the war, Anakin Skywalker and Obi-Wan Kenobi were sent to investigate the death of Jedi Master Tu-Anh. This led them to locate a massive kyber crystal that the Confederacy was attempting to acquire. They were able to destroy the crystal before it could fall into Separatist hands."}, {"tag": "p", "text": "Within months, the Separatists invaded Utapau with thousands of battle droids. Later, a number of key Separatist leaders were stationed on the planet, but were moved to a mining complex on Mustafar prior to the battle on the orders of Darth Sidious. General Grievous remained on Utapau to oversee the battle, but met his end at the hands of Jedi Master Kenobi. Unfortunately for him, Supreme Chancellor Palpatine issued Order 66 shortly thereafter. Because of their behavioral modification biochips, Kenobi's clone troopers turned on their Jedi General and shot him down into a sinkhole. However, Kenobi survived and escaped Utapau. After the end of the Clone Wars, the Galactic Empire occupied the planet, leading to a number of Pau'an refugees left Utapau."}, {"tag": "p", "text": "In 13 BBY,[source?] the Pau'an medical students Fyzen Gor and Greesto Ftrak were abducted by the Wandering Star criminal organization. One of the gangsters shot Ftrak in the chest, and he fell into a coma. Gor later killed Ftrak by removing one of his arms, and attached it to a medical droid. Over the next two years, Gor built a small army of droids augmented with organic body parts, which drew Wandering Star's attention once more. Most of the droids were destroyed in a brief skirmish, and Gor was forced into the service of the gang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}