{"url": "Utani_Xane", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bureaucrats", "Category:Kallidahin", "Category:Males"], "nodes": [{"tag": "h1", "text": "Utani Xane"}, {"tag": "p", "text": "Utani Xane was a Kallidahin male who served as a curator of Quarantine World III, a quarantined planet which housed the dangerous Triple-Zero protocol personality matrix. When the archaeologist Doctor Aphra attempted to steal the matrix from the world, Xane confronted her with a group of B2-series super battle droids and reclaimed the stolen object. The Sith Lord Darth Vader then arrived on Quarantine World III searching for Aphra, whose help he desired. Xane protested the Sith's presence on the world, as it broke several treaties, but was then killed by Vader along with the battle droids."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, the Kallidahin Utani Xane served as the curator of Quarantine World III, a planet which safely housed dangerous quarantined artefacts such as the Triple-Zero protocol personality matrix. In 0 ABY, the vault containing the personality matrix was broken into by the rogue archaeologist Doctor Aphra, a troublemaker who Xane had encountered in the past. During her heist, the doctor triggered the vault's alarms, attracting the attention of Xane and a squad of B2-series super battle droids, who cornered Aphra and reclaimed the matrix before taking her captive in the hopes of having her sent to prison."}, {"tag": "p", "text": "Before Xane was able to return the matrix or lock up Aphra, the curator was warned by a battle droid that a single TIE fighter was approaching their location. Accompanied by the droids and Aphra, Xane confronted the starship's pilot, the Sith Lord Darth Vader, on the hangar platform where the TIE had landed. The Kallidahin protested that the Sith's presence was in violation of a number of treaties, but Vader took no notice and used the Force to hurl several of Xane's battle droids from the hangar platform they were stood upon. Shocked by the Sith's attack, Xane protested and then attempted to flee while Vader used his lightsaber to destroy the remaining droids; however, seeing her chance, Aphra launched herself at Xane and knocked the Kallidahin to the ground, sending the personality matrix flying from the curator's grasp and over the edge of the platform. The Doctor leapt after it and was able to grab the matrix while still holding on to the platform's edge. Vader meanwhile, approached Xane, who was still prone on the platform floor, and drove his lightsaber into the curator's back, killing the Kallidahin. The Sith then informed Aphra that he required her aid and after he helped her up from the edge, the pair left Quarantine World III."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Utani Xane was a Kallidahin with gray skin and black eyes. The curator had encountered Doctor Aphra prior to her attempts to steal the Triple-Zero personality matrix and was unsurprised that she was attempting such a heist, as Xane considered her irresponsible and troublesome. In return, Aphra believed that Xane was small minded, and wasted items as important as the matrix by hiding them away in museums or storage where they could not be used. Xane was bold enough to confront Darth Vader over his presence on Quarantine World III, but quickly attempted to flee once the Sith became violent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Utani Xane first appeared in the comic book Darth Vader 3, which was written by Kieron Gillen, illustrated by Salvador Larroca and released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}