{"url": "Ushar", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Character stubs", "Category:Incomplete lists", "Category:Humanoids", "Category:Knights of Ren", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ushar"}, {"tag": "p", "text": "Ushar was a male humanoid Force-sensitive who served as a member of the Knights of Ren, under the command of an individual known as Ren. Ushar and the other Knights later accepted Ben Solo, who took on the name \"Kylo Ren,\" as their new leader. Kylo went onto join the First Order, ultimately becoming its Supreme Leader, before being redeemed to the light side of the Force. Now Ben Solo once again, the former Knight killed Ushar and the other Knights on Exegol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Exegol"}, {"tag": "p", "text": "A short time after the hunt for Rey, Ushar and the other Knights of Ren were lurking in the Sith Citadel of Darth Sidious on Exegol. During the battle of Exegol, Kylo Ren, now the redeemed Ben Solo, entered the Citadel in an attempt to kill Sidious."}, {"tag": "p", "text": "Before Solo could reach the Throne of the Sith, Ushar and the Knights confronted their former leader. Solo briefly thought that the Knights were going to help him, but their hate towards him made Solo realize they had always been loyal to Sidious. The Knights were able to swiftly overwhelm Solo in his unarmed state, forcing him to the ground and beating him. However, through the use of their Force-bond, Rey was able to give Solo his grandfather's lightsaber. With Anakin's lightsaber, Ben swiftly cut down Kuruk and Cardo before force pushing Ap'lek into a pit, and then cutting Vicrul down. Trudgen tried attacking their former leader but was effortlessly killed by Solo. Ushar tried attacking as well but the redeemed Jedi leapt over him and stabbed him through the back."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "Ushar was the most likely of the Knights to force prisoners to beg for mercy. He enjoyed testing the mettle of his victims. Ushar believed that ones who whimpered deserved a slow punishment while those who fought back were lauded and earned his personal respect as well as a quick death."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ushar was Force-sensitive and an adept with the dark side of the Force but he was untrained which made his powers stunted."}, {"tag": "p", "text": "Despite his great skill as a Knight of Ren, Ushar was quickly killed from a stab from the back by his redeemed former Master, Ben Solo during the battle of Exegol."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ushar's weapon of choice was a war club with a blunt heavy end. On the end of his war club was a kinetite charged end with concussion vector vanes that would release a widely dispersed concussive blast when a target was hit. Ushar had a vibromachete in an inverted sheath on his torso. Ushar also made use of shaped baradium charges that made devastating area effect weapons."}, {"tag": "p", "text": "Like the rest of the Knights of Ren, Ushar wore all black clothing. He wore iron weave vambraces that allowed him to perform a crushing backhand. Ushar wore a helmet with breathing tubes and anti-ox filters which could suggest that it originated from a non-human. His helmet was partially crumpled from a previous attack by a particularly feisty prisoner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ushar first appeared in a Force vision in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment in the Star Wars sequel trilogy. In the 2019 film Star Wars: Episode IX The Rise of Skywalker, Ushar was portrayed by martial artist Ashley Beck, although the character was only listed as \"Knight of Ren\" in the film's credits. The character was simultaneously identified in Star Wars: The Rise of Skywalker: The Visual Dictionary, Star Wars: The Rise of Skywalker: The Galactic Guide, and his card in Star Wars: Card Trader, all of which were released in tandem with the movie."}, {"tag": "p", "text": "The design for Ushar was created by artist Glyn Dillon for The Force Awakens. Like the other Knights, Ushar's design was based off of unused concept art for the \"Jedi Killer\", a character that eventually evolved into Kylo Ren. Dillon referred to Vicrul's design as \"x head\" in The Art of Star Wars: The Force Awakens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}