{"url": "Urtya_(Mon_Calamari)", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Alliance to Restore the Republic members", "Category:Grand Admirals", "Category:Imperial defectors", "Category:Males", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Urtya  (Mon Calamari)"}, {"tag": "p", "text": "Urtya was a male Mon Calamari who served as Grand Admiral of the Mon Cala Mercantile Fleet, Regent of Mon Cala, Dual Protector of the Two People, and Warden of the King in exile. Some time following the battle for Jedha, Urtya met with Gial Ackbar, Han Solo, Leia Organa, Luke Skywalker, R2-D2, and C-3PO of the Alliance to Restore the Republic in order to secure a coalition."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Urtya was a male Mon Calamari. By the time of the mutiny on Mon Cala, he served as the Warden of the King in Exile, Regent, Grand Admiral of the Mon Cala Mercantile Fleet, and bore the title of Dual Protector of the Two People. At that time, he agreed to meet with agents of the Rebel Alliance in secret on Mon Cala. He declined to join in open rebellion, as the risk to Mon Cala was too great."}, {"tag": "p", "text": "After Leia Organa's team recorded King Lee-Char's final message, Urtya took the recording. He ultimately decided to play it planet-wide, knowing the greater good it would spark. It sparked an uprising. In response, the Galactic Empire fired on his headquarters, killing Urtya and his droid guards."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "He did not like his list of titles, considering them empty and that Mon Cala truly belonged to Moff Tan Hubi. He was also fiercely protective of his people, and believed that the King's message was solely a Mon Calamari matter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Urtya appears in the Mutiny at Mon Cala arc in Marvel Comics' books."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}