{"url": "Usable_Resource_Location,_Recovery,_and_Development_Corporation", "categories": ["Category:Legends articles", "Category:Companies"], "nodes": [{"tag": "h1", "text": "Usable Resource Location, Recovery, and Development Corporation"}, {"tag": "p", "text": "Usable Resource Location, Recovery, and Development Corporation, also known as U.R.L.R.D., was a company active in the Cularin system in the years before the Clone Wars."}, {"tag": "p", "text": "One of its managers was dark Jedi Karae Nalvas, who masqueraded as Fesvk Wefos."}, {"tag": "p", "text": "In 31 BBY, \"Wefos\" hired prestigious scientist and amateur archaeologist Dr. Shilaea Motacc, intending to secretly use her work to build a weapon of mass destruction. The U.R.L.R.D. gave Motacc a vacation in Rorkee, a city in the planet Genarius, where she could visit a reproduction of the archaeological dig site Dorumaa Excavation. The U.R.L.R.D. aimed to send college students later to join her."}, {"tag": "p", "text": "However, Motacc went missing during a supposedly accidental cave-in in the excavation. Wefos correctly suspected foul play—she had been kidnapped by either the Modified Technology Systems company or by creative operatives of U.R.L.R.D. Wefos hired an independent team to travel to Rorkee and rescue the \"damsel in distress.\" Wefos's team was successful, although the party behind the crime was not discovered."}, {"tag": "p", "text": "Two weeks later, Wefos hired an independent team again to travel to another city of Genarius, Depatar, looking for a missing courier of U.R.L.R.D., Alec. Alec was not a courier, but a Jedi Knight who had discovered Wefos's secret identity and schemes and had stolen the blueprints for his weapon. The independent agents found Alec, but he told them the truth about Nalvas and convinced them to change sides. However, during this time, Nalvas recovered the missing blueprints. Apparently, Nalvas forfeited his relationship with U.R.L.R.D. from this moment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}