{"url": "Belarus-class_medium_cruiser", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Belarus-class medium cruisers", "Category:Cruiser classes", "Category:Galactic Alliance starship classes", "Category:Loronar Corporation products", "Category:New Class starship classes"], "nodes": [{"tag": "h1", "text": "Belarus-class medium cruiser"}, {"tag": "p", "text": "The Belarus-class medium cruiser was one of the earliest starship designs approved by the New Republic, and was produced in limited numbers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Belarus-class was originally designed by the Loronar Corporation as an improvement over the corporation's successful Strike-class cruiser and was rushed into production by the New Republic. The design was implemented by reducing the turbolaser emplacements and settling on a single design for modular construction. It was moderately more efficient in terms of its crew complement but less adaptable in terms of modularity. Although the class was derived from the earlier Strike class cruiser, the Belarus lacked the earlier ships conformity. The Belarus Class were generally deployed in line formation, with less powerful ships covering the forward and rear of the fleet's deployment. A number of them guarded Mon Calamari at the end of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Known ships"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The only official image of the Belarus-class cruiser is found in the RPG sourcebook Cracken's Threat Dossier. Like the pictures of the New Class ships, this picture contradicts information from the Black Fleet Crisis novels, on which Cracken's Threat Dossier is based."}, {"tag": "p", "text": "The Belarus-class cruiser bears no resemblance to the Strike-class, even though it is supposed to be an improved version of that class. Because of this, the picture has been labeled as erroneous and dismissed as non-canon by many fans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}