{"url": "Uthtara", "categories": ["Category:Legends articles", "Category:Eucer sector astronomical objects", "Category:Galactic Republic astronomical objects"], "nodes": [{"tag": "h1", "text": "Uthtara"}, {"tag": "p", "text": "Uthtara was a Mid Rim astronomical object located in the Eucer sector. During the Tionese War, it was the site of a Galactic Republic hyperspace jump-beacon that facilitated commercial interstellar travel to the celestial body Okator VIII. At some point during the conflict, warships affiliated with the Republic's enemy, the Honorable Union of Desevro & Tion, attacked Uthtara, damaging the jump-beacon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Uthtara was an astronomical object located in the Uthtara system, a part of the Eucer sector of the Mid Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Tionese War, which broke out in 24,000 BBY between the Galactic Republic and the Honorable Union of Desevro & Tion, Uthtara was the site of an orbital Republic hyperspace jump-beacon, which enabled tradeships travelling along the super-hyperroute known as the Perlemian Trade Route to visit the Divide celestial body Okator VIII. Occasionally, the hyperspace jump-beacon would malfunction, leaving the trade starships unable to visit Okator VIII for weeks until the structure was repaired. At some point in the conflict, a group of Tionese raider warships attacked Uthtara, damaging the jump-beacon in the process."}, {"tag": "p", "text": "Following the war's end around 23,900 BBY, a Republic soldier imprinted into a Baragwin sense lattice an audio-visual account of a Tionese attack on Okator VIII, which the soldier survived in his youth. In the record, the soldier noted the reliance of the celestial body on the beacon at Uthtara for interstellar commerce."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Uthtara was created by Jason Fry for the 2012 reference book The Essential Guide to Warfare, authored by Fry and Paul R. Urquhart. In the book, an attack on Uthtara was illustrated by John Van Fleet. In his personal blog, Fry noted that Uthtara was intended to be a planet and that its mention in The Essential Guide to Warfare served a \"private memorial\" in that it was the sole remaining reference to a vignette cut from the book before its release."}, {"tag": "p", "text": "In 2014, however, the vignette mentioning Uthtara was released as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com Blog by Fry and Erich Schoeneweiss containing various cut content from The Essential Guide to Warfare. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Uthtara system, and therefore the celestial body itself, in grid square R-7."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}