{"url": "Utoxx_Prentioch", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial warlords", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Utoxx Prentioch"}, {"tag": "p", "text": "Utoxx Prentioch was a vain and ambitious Imperial Moff who became a warlord shortly after the Battle of Endor and commanded a short-lived breakaway regime. Prentioch was the Moff of the Sombure sector in the last years of Galactic Emperor Palpatine's reign, and when he learned of Palpatine's demise at the Battle of Endor, he began consolidating his personal power in the sector. Within months, Prentioch was acting independently of the Galactic Empire's rulers and ruling the Sombure sector in his own name. Using old surveys and treaties purporting to demonstrate a larger Sombure sector as a pretext, Prentioch began invading neighboring sectors to expand his control, believing he could come to rule the entire Empire."}, {"tag": "p", "text": "Prentioch, however, became bogged down in warfare with a fellow warlord, Moff Eyrgen, over the control of the Wornal sector, and Prentioch's Dominion never became very large. The New Republic marginalized and ignored it during its drive into the Core Worlds, and Prentioch's war with Eyrgen sapped his resources. In 6 ABY, Prentioch failed in his attempt to gain the planet Kaal's foodstuff exports to supply his forces, and later that year the New Republic defeated and captured him in the siege of Bomis Koori, bringing his rule and his domain to an end."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Becoming a warlord"}, {"tag": "p", "text": "The Human male Utoxx Prentioch rose to the position of Moff of the Sombure sector under the Galactic Empire. When Emperor Palpatine died in the Battle of Endor in 4 ABY and the Empire's cohesion began to crumble, the ambitious Moff Prentioch began to assert personal control over his domain. He was able to exercise influence over his military subordinates, who shifted their loyalty to him personally. Prentioch, looking to expand his domain, began combing through ancient treaties and surveys to find justifications for including more worlds within the Sombure sector. Affecting airs of superiority, he rejected his plain Moff's uniform for extravagant robes reminiscent of those worn by Imperial Advisors. Though he initially maintained nominal loyalty to the central Empire as he strove to solidify his own personal position, he soon rejected Imperial control entirely, becoming one of many warlords striving for power as the Empire's authority crumbled and the New Republic, born from the Alliance to Restore the Republic, expanded. Though his position was not yet strong, he had dreams of taking control of the entire Empire and saw himself as a contender for the Imperial throne."}, {"tag": "p", "text": "Not content with personal control of the Sombure sector, Prentioch moved to gain more territory and invaded several nearby sectors, using flimsy historical justifications for the enlargement of his dominion. These advances were opposed by one of Prentioch's rivals, another breakaway warlord, Sander Delvardus. His Mid Rim breakaway state, Prentioch's Dominion, was soon one of the major warlord states. Within months of the Emperor's death, he faced competition to his control of the area. As his forces moved into the Wornal sector, he found that he had to battle another warlord, Moff Eyrgen. The conflict was aggravated by New Republic agents, who fed both warlords misinformation in hopes of stoking the intra-Imperial warfare. The war between the two expansionist warlords dragged on for two more years, consuming a great deal of Prentioch's resources."}, {"tag": "p", "text": "Six months after Palpatine's death, Prentioch directed his forces to pursue the Black Curs after the mercenary group made a reconnaissance of the Core in preparation for a possible New Republic advance. Though two regular Imperial Star Destroyers under Imperial Advisor Bregius Golthan were already pursuing the Black Curs, Prentioch wanted to acquire the mercenaries' reconnaissance data, believing it would aid him in his continuing conquests. Prentioch's pair of Star Destroyers engaged the Imperial force over Moorja as the Black Curs' Last Chance crash-landed on the planet. Neither side's ground forces were able to secure the Black Curs, however, and the group escaped Prentioch's clutches."}, {"tag": "p", "text": "The New Republic, which was swiftly growing, made an early show of force in the area by destroying the pirates around Eiattu 6. Prentioch remained within his relatively small holdings, busy with his wars of expansion and not eager to engage the New Republic. The New Republic military bypassed Prentioch in its advance, securing Moorja while Prentioch continued to struggle in the Wornal sector."}, {"tag": "h3", "text": "Kaal conflict and defeat"}, {"tag": "p", "text": "In 6 ABY, Prentioch became involved in negotiations with Tirgee Benyalle, a casino magnate and crime lord who had taken control of the independent world Kaal, for that planet's aquacultural produce. With few agricultural worlds under his control, Prentioch was running short of foodstuffs and badly wanted supplies from Kaal, which was near his holdings. In that endeavor, he faced competition from Admiral Kermen, representing the Empire; a group of New Republic agents; and the supposed Syndic Pandis Hart, chief purchasing agent for the Sif-Uwana Council, who was actually crime boss Talon Karrde in disguise."}, {"tag": "p", "text": "Prentioch left his flagship, Prentioch, in orbit facing off against Kermen's Belligerent, and stayed in the Grand Imperial casino and hotel with the other parties to the negotiations. Not content to leave the outcome to chance, Prentioch hired a group of bounty hunters to assassinate his rivals in the summit. While waiting for the last group, the New Republic delegation, to arrive, he spent his time gambling and lost badly at Trin sticks. During a game, an indiscreet adviser approached him and stated that the bounty hunters had arrived and wanted to discuss payment, sending the warlord into a fury. He stormed out of the casino and met the bounty hunters covertly at the spaceport, where he settled matters with their leader. That night, the New Republic delegation having arrived, Benyalle invited all the parties to a private game of high-stakes sabacc, which Prentioch attended."}, {"tag": "p", "text": "That same night, Prentioch's bounty hunters attacked the New Republic negotiators in their room, but failed to kill them. The next morning, Benyalle took the warlord and the other parties for a cruise on her sail barge. They traveled to a floating harvester factory for the aquaculture industry, of which Benyalle gave them a tour. After the tour, the representatives retired to the meeting room of Benyalle's barge, where she outlined her terms. Prentioch was the first to make his offer: the very low price of five hundred credits per ton of food; payment to construct and crew ten more harvesters, doubling Kaal's aquaculture capacity; and ten million credits to sign the deal. Kermen, the last to speak, announced his intent to take over the entire operation by force. His stormtrooper bodyguards, plus the operatives with which he had replaced most of the sail barge crew, attempted to exert control over the barge, but loyal crewmen and the other delegates fought back. Prentioch summoned reinforcements from his Star Destroyer overhead, which had engaged Kermen's Belligerent. As Karrde, the New Republic agents, and Benyalle fled with Karrde's allies on a submersible, a dropship full of Prentioch's troops arrived to battle Kermen's operatives. Prentioch barely escaped as the sail barge was destroyed in an explosion Karrde arranged to cover his flight. He lost the chance to sign the deal, as Benyalle agreed to a contract with the New Republic delegates who had saved her life."}, {"tag": "p", "text": "Later in that same year, Prentioch's reign finally came to an end. The New Republic drove from Moorja to Prentioch's Dominion and engaged Prentioch's forces in the decisive siege of Bomis Koori. Prentioch's military complement could not hold out against the forces of the ascendant government, and Prentioch was captured. With its leader in New Republic custody, Prentioch's personal empire crumbled, swept away in the New Republic's campaign for galactic control."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Utoxx Prentioch was ambitious and not particularly loyal, seeking his own glory as a warlord rather than remaining part of the Empire. A self-aggrandizing man, Prentioch named his flagship, Prentioch, after himself, and as a warlord wore robes suggestive of an Imperial Advisor, among the highest stations in the Empire. A prideful man, Prentioch was annoyed when his perceived inferiors would challenge his skills, and reflexively looked down on others. In his mind, he was a grand personage, among the most important people in the galaxy, always right, and obviously the best at whatever he did. He thought himself an expert in games of chance such as Trin stick and sabacc, though he did not actually know how to play, and refused to admit that he did not know what he was doing."}, {"tag": "p", "text": "Prentioch demanded excellence from his subordinates, as well as extremely deferential treatment. He tolerated neither failure nor dissent. When things went badly for him or a subordinate disappointed him, Prentioch indulged his short temper and flew into a violent rage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character Utoxx Prentioch was first mentioned as \"Moff Prentioch\" in an adventure idea within the article \"Recon & Report: The Journey to Coruscant\" in Star Wars Adventure Journal 2, published in 1994. His first name, Utoxx, was revealed fifteen years later with the publication of The Essential Atlas. In-between, Prentioch was a character in the Adventure Journal adventure \"The Kaal Connection\" and was mentioned in \"Black Curs Blues,\" another adventure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}