{"url": "Uthorrferrell_Cartha", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Planetary leaders", "Category:Royal family of Eiattu 6"], "nodes": [{"tag": "h1", "text": "Uthorrferrell Cartha"}, {"tag": "p", "text": "The Emperor Uthorrferrell Cartha was a Human male who served as the ruler of Eiattu 6 during the period of the New Order's dominance of the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He came to the throne at a difficult time: when the Declaration of a New Order transformed the Galactic Republic into the Galactic Empire in 19 BBY, his father Antbbianplourr III had been forced to make humiliating concessions to retain his throne in the face of an Empire that was galactic rather than merely planetary in scale, and to prevent the deployment of Imperial forces to the planet; but five years into his son's reign, Grand Moff Tharil Tavira and a force of stormtroopers were dispatched to garrison Eiattu for the Empire."}, {"tag": "p", "text": "The planet's nobles rebelled, believing that they could deal better with Tavira on their own terms, and the Emperor and his children were sent into internal exile. As the aristocracy formed a ruling council, the Priamsta, a faction decided to eliminate the deposed monarch, brutally killing Uthorrferrell Cartha and his elder daughters, Kassen and Dullourr. The youngest daughter, Isplourrdacartha, escaped, but she herself was forced to kill her psychotic brother Harrandatha, when he tried to alert the killers to her position."}, {"tag": "p", "text": "Many years later, the Princess Isplourrdacartha was recalled by the penitent Priamsta to restore the monarchy and bring unity to strife-torn Eiattu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Some confusion prevails over the exact structure of Uthorrferrell Cartha's family; while Plourr is said in dialogue to be the youngest of three daughters, a panel in the comic shows a younger child, younger than Prince Harran, who was in turn younger than Plourr. Either this is a younger son not mentioned in the text, or it is the child of one of her sisters—the woman sitting beside the Emperor in this image may indeed be his eldest daughter, as no wife or consort is mentioned in the text, and it is said repeatedly that he and his daughters were slain by the Priamsta. This confusing situation may be related to a concern for bloodline purity in the royal family; they had apparently been genetically engineered for more than generations by \"royal life-engines\", and Plourr herself was betrothed from infancy to Count Rial Pernon, her father's first cousin."}, {"tag": "h2", "text": "Appearances"}]}