{"url": "Uwlla_Iillor", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Navy captains of the Galactic Empire", "Category:New Republic Defense Fleet captains"], "nodes": [{"tag": "h1", "text": "Uwlla Iillor"}, {"tag": "p", "text": "Uwlla Iillor was one of the few female Human officers in the Imperial Navy. She served as captain of the Black Asp, an Interdictor cruiser. Eventually, she defected to the New Republic along with her ship, which was renamed Corusca Rainbow, and participated in the liberation of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Through her forceful personality, Uwlla was able to rise through the ranks in the pre-Endor Empire, despite an Imperial bigotry against aliens, females and other designated non-humans."}, {"tag": "p", "text": "Uwlla also displayed exceptional resourcefulness and a tendency to think outside the box, such as her tactic of flying the Asp to the fringe of a system, then traveling through hyperspace to another point in that same system in order to surprise her target. While this technique of intra-system jumping was an unusual tactic for the Empire, she put it to use after witnessing its successful use in the Unknown Regions."}, {"tag": "p", "text": "While some of her superiors remained biased against her due to her gender, she earned the respect of others, including Imperial Intelligence Agent Kirtan Loor, due to her personality and abilities."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "Uwlla Iillor served under several alien commanders, including a tour of duty under Thrawn in the Unknown Regions. The last of those appointments was on a Carrack-class cruiser."}, {"tag": "p", "text": "Following the Battle of Endor, which increased the need for competent Imperial officers, Iillor was promoted to captain and granted her own command, the Black Asp. It was unlikely she ever would have received such a promotion prior to the fracturing of the Empire."}, {"tag": "p", "text": "The Asp was one of the ships under the command of Admiral Devlia, who was in charge of the defense of the Rachuk sector. Devlia, a pre-Endor officer, was biased against Iillor due to her gender, and was uncomfortable communicating with her."}, {"tag": "p", "text": "In 6.5 ABY, Uwlla discovered information that smuggler Mirax Terrik was running supplies to the New Republic in her ship, the Pulsar Skate. Uwlla attempted to capture the Skate as it departed with supplies from the Chorax system, but the operation was disrupted by a squadron of X-wing starfighters."}, {"tag": "p", "text": "Uwlla launched the Asp's squadrons of TIE/IN interceptors, but because she recognized the inferior abilities of their pilots, she also ordered that the Asp use its weapons against the New Republic forces. In doing so, she successfully disabled the X-wing of ace pilot Corran Horn. She was however quickly driven away when the remaining X-Wings sent a combined volley of torpedoes into the Black Asp, collapsing its shields and taking out two turbolaser emplacements. Unwilling to face such punishing strikes, Iillor ordered a retreat, recovering her remaining TIE's before entering hyperspace."}, {"tag": "p", "text": "Through communication intercepts and visual data, Uwlla determined that the fighters belonged to Rogue Squadron, an elite New Republic Defense Force squadron led by Commander Wedge Antilles."}, {"tag": "p", "text": "Although Devlia assumed the strike was a planned ambush against the Blask Asp, Uwlla correctly deduced that the starfighters were accidentally pulled from hyperspace by the Asp's gravity well projectors. Kirtan Loor, who was charged with destroying Rogue Squadron, concurred with Uwlla's interpretation rather than Devlia."}, {"tag": "p", "text": "Shortly after the Second Battle of Borleias, Uwlla was ordered to ambush and capture Bror Jace, who was traveling alone to his home planet of Thyferra to visit a dying family patriarch. Although Jace showed up exactly where he was expected to and the Black Asp successfully pulled him out of hyperspace, his X-wing seemingly exploded during the fight and Uwlla was unable to capture him alive."}, {"tag": "h3", "text": "Defection to the New Republic"}, {"tag": "p", "text": "Following the Second Battle of Borleias, Uwlla filed a protest over the transfer of her flight operations officer from her command, which was ignored by Imperial command. This, along with interference by Imperial Intelligence with her command, was enough to prompt Uwlla and her staff to defect to the New Republic."}, {"tag": "p", "text": "Uwlla brought with her the Black Asp, which was renamed the Corusca Rainbow, a name that was considered a positive omen by New Republic and Provisional Council officials. The defection gave the New Republic Defense Force its first Interdictor cruiser."}, {"tag": "p", "text": "Despite her Imperial background, Uwlla won the trust of Admiral Ackbar. She was cleared by General Airen Cracken and his people worked with her staff to establish an operational Alliance crew, including the Mon Calamari First Officer Lieutenant Jhemiti."}, {"tag": "p", "text": "The fact that she was placed in a position of trust and importance immediately after her defection demonstrated to Uwlla the difference between the Galactic Empire and the New Republic, and it motivated her to serve the New Republic that much better."}, {"tag": "h3", "text": "Battle of Coruscant"}, {"tag": "p", "text": "Immediately following her defection, Uwlla and the Corusca Rainbow were given an important role in the Seizure of Coruscant."}, {"tag": "p", "text": "The Interdictor cruiser was the first New Republic craft to enter the Coruscant system. It waited in the outer edges to monitor the Imperial Center's shields while Rogue Squadron was planetside attempting to disable them. Uwlla was to monitor the shields and if they were still up when the battle was to take place, she was to use her gravity well projectors to drag the fleet from hyperspace prematurely. If the shields were down, she was to do nothing and allow the assault to commence as scheduled."}, {"tag": "p", "text": "Uwlla demonstrated strong prudence during the battle when she discouraged the Corusca Rainbow crew from becoming too relaxed and unprepared. Most of the crew was confident enough that Rogue Squadron would accomplish their mission that they did not expect to have to activate the gravity well projectors. Having fought the elite squadron in the past, she shared their confidence, but nevertheless demanded that they be prepared."}, {"tag": "p", "text": "Even after the shields began to fail, Uwlla did not make the decision not to activate the projectors until they fell completely, five seconds before the New Republic fleet jumped into the system. The fleet entered the system as scheduled and eventually succeeded in capturing the planet."}, {"tag": "h3", "text": "Post-Coruscant service"}, {"tag": "p", "text": "Uwlla and the Corusca Rainbow continued to serve the New Republic following the successful operation."}, {"tag": "p", "text": "During the trial of Tycho Celchu, for the apparent murder of Corran Horn, Uwlla testified as to her role in the attempt to capture Bror Jace. Her testimony, that the Black Asp was given specific orders as to when and where Jace would be, further reinforced the case against Celchu presented by attorney Halla Ettyk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}