{"url": "Uumufalh", "categories": ["Category:Legends articles", "Category:Gunship classes", "Category:Uumufalh", "Category:Yuuzhan Vong starship classes"], "nodes": [{"tag": "h1", "text": "Uumufalh"}, {"tag": "p", "text": "The Uumufalh was a type of starship used by the Yuuzhan Vong, often referred to as a  gunship."}, {"tag": "p", "text": "Formed from reddish-black yorik coral and shaped like spearheads, Uumufalh gunships were designed as escorts to accompany larger warships such as cruiser analogs and carrier analogs. Some examples of the type were just 120 meters long, comparable in size to their counterparts in the New Republic military, and indivdual vessels could be destroyed by a determined flight of X-wings, but the standard size for a full-grown example was 615 meters long."}, {"tag": "p", "text": "They were equipped with dovin basals for propulsion and defense, and armed with an impressive array of plasma cannon weaponry, giving them firepower comparable to a much larger cruiser analog, but they did not carry coralskippers and were unable to create an interdiction field."}, {"tag": "p", "text": "They fought in engagements including the First Battle of Obroa-skai, the Battle of Duro,, the Battle of Esfandia, and the Battle of Selvaris. They typically deployed in groups accompanying one or more larger war vessel, and favoured a tactic in which they concentrated on a single target, with each gunship firing a weapons salvo in succession to overwhelm its defenses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Uumufalh designation is not used in any of the New Jedi Order novels, but first appeared in the New Jedi Order Sourcebook."}, {"tag": "p", "text": "This article assumes that all references to Yuuzhan Vong \"gunships\" in the novels relate to vessels of the Uumufalh type, unless they are clearly identified as representatives of another class such as a coralskipper fighter. Strictly speaking, however, the New Jedi Order Sourcebook only confirms that the gunships at the Battle of Duro in Balance Point belong to this type. These are described as \"midsize\" capital ships, a term which could denote vessels of the 615 meter length stated in the sourcebook, but elsewhere in the novel series, the \"gunship\" designation is given to much smaller capital ships."}, {"tag": "p", "text": "A gunship of this type is destroyed by a quartet of X-wings (in Hero's Trial), another is accelerated into an improvised missile by the engines of a Clawcraft fighter (in Force Heretic: Reunion) and a flotilla of three are said to be just 120 meters long (in The Unifying Force); these are the ships with which the \"reddish-black\" hull colour and \"spearhead\" hull shape are associated. These could be seen as representatives of the same type, however: for several other Yuuzhan Vong designs such as the corvette analog and frigate analog, the hull sizes stated by the sourcebook are many times larger than those specified for individual vessels in the novels."}, {"tag": "p", "text": "Conversely, the heavy escorts described as \"assault frigates\" in Star by Star might be vessels of the Uumufalh type, as the size and role assigned to the Uumufalh in the New Jedi Order Sourcebook are similar to that of the well known Assault Frigate type used by the Rebel Alliance and New Republic."}, {"tag": "p", "text": "Although Yuuzhan Vong vessels are frequently referred to by designations such as \"frigate analog\" and \"carrier analog\", the term \"gunship analog\" is not widely used, occurring once in The Unifying Force, where it appears to denote all Yuuzhan Vong ships smaller than a mid-sized warship analog."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}