{"url": "V-18", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Droids of the Jedi Order", "Category:Droids of unspecified degree", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "V-18"}, {"tag": "p", "text": "V-18 was a droid owned by the Jedi Padawan Ram Jomaram on the planet Valo during the High Republic Era. Possessing a boxy appearance, V-18 had been painted purple by Jomaram to avoid him having the appearance of a crate. When Jomaram investigated a security breach at Crashpoint Tower, a communications tower outside Lonisa City, he provided V-18 with a mobility upgrade so that the droid could act as transportation. Over the course of the ensuing Nihil attack, the Bonbraks Tip and Breebak gave V-18 several more upgrades, including weapons systems and more advanced propulsion."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Service on Valo"}, {"tag": "p", "text": "During the time of the High Republic Era, V-18 was owned by Ram Jomaram, a Padawan of the Jedi Order at the Valo Temple on the planet Valo. By the time of his ownership under Jomaram, V-18 had been around for a number of years. V-18 assisted the Jedi Padawan in his garage, alongside a number of Bonbraks. V-18 was often loaded onto starships while in sleep mode due to having an appearance similar to a crate, leading Jomaram to paint him purple."}, {"tag": "h3", "text": "Investigating Crashpoint Tower"}, {"tag": "p", "text": "While the residents of Valo prepared to host the Republic Fair in Lonisa City, V-18 discovered that an alert had been tripped on the security perimeter of the nearby communications tower nicknamed Crashpoint Tower and that communications were malfunctioning. Following protocol, V-18 intended to inform the Jedi Masters of Valo, but was unable to find them in the temple, visiting Jomaram an hour later after discovering that the Masters were occupied. V-18 interrupted Jomaram, who was using the Force to discover the fault with one of the Galactic Republic security team's speeder bikes, irritating both the Padawan and the Bonbraks with his loud greeting."}, {"tag": "p", "text": "After informing Jomaram of the locations of the Jedi Masters and the malfunctioning communications, V-18 told him of the security breach. Jomaram intended to investigate the issue immediately, but had no fast method of transportation, instead resolving to give V-18 a mobility upgrade to act as transport. V-18 was hesitant about being upgraded, but admitted that he would like it, becoming enthusiastic quickly as Jomaram and the Bonbraks began to modify him. Once Jomaram had finished upgrading V-18, the Padawan climbed onto V-18, piloting the droid past the outskirts of the city and into the Farodin Woods, where Crashpoint Tower was situated."}, {"tag": "p", "text": "As V-18 and Jomaram approached the communications tower, an individual fired at them with a cannon, and Jomaram pulled himself and the droid behind cover. Their attacker escaped on a speeder, and V-18 asked Jomaram what to do next. Jomaram intended to pursue their attacker, despite V-18 warning him against doing so."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A droid with masculine programming, V-18 had a large and boxy body with stumpy legs that could retract. His plating was bright purple, painted as such by Jomaram to avoid others mistaking him for a crate. He had glowing yellow sensor eyes on either side of his body. His eyes occasionally flickered, either due to impatience or a programming glitch, though Jomaram believed that V-18 could blink irritably on purpose. The droid additionally possessed a sleep mode. Jomaram later modified V-18 to act as transportation, installing a propulsor unit from an old crop sifter and adding a saddle with foot pedals to control acceleration, though he initially did not install a brake system."}, {"tag": "p", "text": "V-18 acted in ways that did not make sense to Jomaram, such as not immediately informing him of the perimeter breach at Crashpoint Tower despite claiming it was an urgent matter, or taking an hour before speaking to Jomaram about the matter due to the droid's adherence to protocol. He modulated his voice into a higher frequency and volume out of both excitement to see Jomaram and urgency when greeting the Padawan. The droid was proud of his physique, insisting that he could not be upgraded and protesting when Jomaram and the Bonbraks began to modify him, though he quickly became enthusiastic about gaining a mobility upgrade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "V-18 will appear in the upcoming novel The High Republic: Race to Crashpoint Tower, written by Daniel José Older and set to be published on June 29, 2021. He was first revealed by Older in the live launch event for the Star Wars: The High Republic publishing initiative on January 4, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}