{"url": "Uviuy_Exen/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alsakan planets", "Category:Colonies planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Hydian Way", "Category:New Republic planets", "Category:Northern Dependencies planets", "Category:Shwuy sector", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Uviuy Exen"}, {"tag": "p", "text": "Uviuy Exen was a heavily populated planet in the Colonies' Shwuy sector. It lay at the intersection of the Hydian Way and Shwuy Exchange hyperlanes, which led various starships traveling along those routes to pass through the Uviuy Exen system."}, {"tag": "p", "text": "During the Clone Wars, Uviuy Exen remained loyal to the Galactic Republic and by 4 ABY had become a fortress world of the Galactic Empire. Around the time the Battle of Yavin took place, Imperial Army line squads on the planet were completely armed with light repeating blasters. A few years later, Uviuy Exen was the site of several battles between the New Republic and Imperial forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Uviuy Exen was a terrestrial planet located in the star system of the same name, a part of the Shwuy sector in the Northern Dependencies portion of the Colonies. Uviuy Exen lay at the intersection of two hyperlanes—the minor hyperspace route known as the Shwuy Exchange, which connected the planet to the Dankayo system, and the Hydian Way super-hyperroute, which linked it to the Eeropha and Wakeelmui systems."}, {"tag": "p", "text": "Between 25,000 BBY and 22,000 BBY, a number of early hyperlanes connected Uviuy Exen to the systems of Chagri, Nouane, Yabol Opa, Brentaal, Coruscant, and Palanhi; however, by 17,000 BBY, these had coalesced into a single route running from Chagri to Brentaal through Uviuy Exen. That hyperlane would eventually be known as the Corsin Run, which had been merged into the modern Hydian Way by 3694 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although space surrounding the Uviuy Exen system became well-explored between 20,000 BBY and 15,000 BBY, the planet had already been incorporated into the Galactic Republic by 22,000 BBY. By 17,000 BBY, Uviuy Exen had allied with the planet Alsakan in its struggle against Coruscant for the status of the Republic's capital, yet it remained in space loyal to the Republic during the Clone Wars from 22 BBY to 19 BBY. Early in that conflict, Uviuy Exen lay at the intersection of territories that the First, Third, and Seventh Armies of the Republic Military were tasked with defending against the military forces of the Confederacy of Independent Systems."}, {"tag": "p", "text": "By 17 BBY, Uviuy Exen fell under the control of the Galactic Empire, and, by the time of the Battle of Yavin, every line squad of the Imperial Army on the planet had been completely armed with light repeating blasters. The latter fact was noted by Rebel Alliance historian Major Arhul Hextrophon in a compilation of Imperial documents for Alliance Supreme Commander Mon Mothma and other Rebel officers. Uviuy Exen had become an Imperial fortress world by the time of the Nagai invasion in 4 ABY."}, {"tag": "p", "text": "The military of the New Republic defeated the forces of Imperial Warlord Zsinj at Uviuy Exen in 6 ABY as part of a drive to push Imperials up the Hydian Way, and the world had fallen under New Republic control that same year. However, four years later, another battle was fought in the Uviuy Exen system when Imperials advanced from the Chagri system to the Brentaal system."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Uviuy Exen was a heavily populated world by the time the Battle of Yavin took place, with the population of its system numbering between 500 million and 1 billion around 25 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Uviuy Exen was first mentioned in the 1989 Imperial Sourcebook, written by Greg Gorden and published by West End Games for Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Uviuy Exen system, and therefore the planet Uviuy Exen, in grid square L-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}