{"url": "Belbullab-22_starfighter", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starfighter classes", "Category:Belbullab-22 starfighters", "Category:Confederacy of Independent Systems starfighter classes", "Category:Imperial starfighter classes"], "nodes": [{"tag": "h1", "text": "Belbullab-22 starfighter"}, {"tag": "p", "text": "The Belbullab-22 starfighter was a heavy starfighter constructed by Feethan Ottraw Scalable Assemblies for the Confederacy of Independent Systems. General Grievous flew a heavily-modified and battle-worn Belbullab-22, Soulless One, during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The starfighter was bulkier and hardier than the droid starfighters employed by the Confederacy of Independent Systems, with two rapid-fire triple laser cannons capable of inflicting damage equal to that dealt by a V-wing starfighter, and two powerful main ion drives. The Belbullab was designed for a single pilot."}, {"tag": "p", "text": "Grievous modified his fighter with a top-of-the-line hyperdrive allowing the cyborg general to stay mobile on a galaxy-wide scale. In order to remain in touch with his forces while flying his fighter, a powerful but compact HoloNet transceiver was installed onboard, allowing Grievous to slice into legitimate and pirate networks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the first battle of the Clone Wars, and the CIS's first defeat, Grievous used the fighter to secretly escape Geonosis. He also used the fighter to escape various missions including the Battle of Bothawui and the mission to Skytop Station."}, {"tag": "p", "text": "Many were used in the battle of Cato Neimoidia."}, {"tag": "p", "text": "After his initial confrontation with Obi-Wan Kenobi on Utapau, Grievous attempted to escape to his starfighter, but Kenobi pursued him and Grievous was defeated in the subsequent confrontation on the landing platform. After Grievous's defeat, as well as Obi Wan's near death from his own troops turning on him, Kenobi fled Utapau in the general's starfighter. The Belbullab was picked up by Bail Organa's Sundered Heart."}, {"tag": "p", "text": "Even after the defeat of the CIS and its remnants, Belbullab-22 fighters continued to roam the spacelanes during the Galactic Civil War. Many of these ships were used as elite fighters for Rebel forces."}, {"tag": "p", "text": "The Galactic Empire would also use the Belubllab-22 Starfighters for its forces as well. One Belubllab-22 Starfighter known as the Sithspawn was used by a Dark Jedi known as Namman Cha."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External link"}, {"tag": "p", "text": ""}]}