{"url": "Uwana_Buyer", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Smugglers' Alliance starships", "Category:SoroSuub Corporation products", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Uwana Buyer"}, {"tag": "p", "text": "The Uwana Buyer was a SoroSuub Corporation Luxury 5000 space yacht owned and operated by the Human smuggler chief Talon Karrde. Heavily modified by Karrde to suit his needs, the Uwana Buyer was the most extravagant and luxurious vessel in Karrde's fleet. He used it to impress potential clients whom he considered to be gullible enough to be amazed by wealth and riches, but rarely spent much time aboard himself, preferring to operate from aboard the Action VI transport Wild Karrde. Karrde operated the Uwana Buyer through the Galactic Civil War, and he employed it as an incentive for his associates; those who served him well were assigned to crew the yacht to take advantage of its comforts. In 8 ABY, Karrde and his Human second-in-command, Quelev Tapper, took the Uwana Buyer to the planet Varonat to investigate the operations of a Krish crime lord named Gamgalon. During the mission, Tapper was killed, and Karrde saved by a Human woman named Mara Jade."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Uwana Buyer was a SoroSuub Corporation Luxury 5000 yacht owned by Human smuggler chief Talon Karrde which was worth 1,000,000 credits new, and a half-million credits used. A 65-meter elongated crescent with two forward sweeping mandibles, the Luxury 5000 was split into two decks. Karrde gutted the ship's original interior and rebuilt the entire vessel to serve his purposes. He added extra cargo space along the curved bulkheads—enough to carry 150 metric tons—and appointed the rest of the interior as opulently as a luxurious hotel. Four staterooms dominated the lower level, as well as two crew rooms. On the port aft side, Karrde added a gourmet kitchen and dining room, and a well-appointed conference room. On the starboard aft side, an exercise room and a medical bay were added, as well as a fully equipped spa and massage room. The rear of the deck was dominated by two engineering sections, and a small casino—which included two sabacc tables and a bar—was located between the two. An aft lounge led directly off the casino. Three boarding ramps served the deck; one for passenger boarding, and one on each of the forward mandibles designed for cargo. The ship's airlocks were also located on the lower deck."}, {"tag": "p", "text": "The upper deck was smaller than the lower one. It also contained engineering sections at the rear, as well as the majority of the crew quarters and amenities, such as refreshers, a kitchen, and a galley. The bridge was at the fore of the deck, flanked by the gunwells to the forward mounted weapons. A single lift tube allowed access between the two decks."}, {"tag": "p", "text": "Karrde upgraded the ship's hyperdrive to a Class One, with a slower Class Eight as back-up, and replaced the original aging realspace engines with six Corellian Engineering Corporation Starchaser Mk. IIIs. Although Karrde intended to use the vessel as a place to meet and negotiate, he did not skimp on the weaponry, adding a pair of heavy laser cannons that flanked the bridge, an ion cannon, and a single proton torpedo launcher. The Uwana Buyer was nominally crewed by five people—a pilot and a co-pilot, as well as three gunners. However, it could be handled by only two people when the need arose. It had room for sixteen passengers and could store enough consumables to last six months."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The most luxurious and extravagant ship in Talon Karrde's fleet, the Uwana Buyer was so named to satisfy Karrde's sense of wordplay when christening ships. Despite its luxury, Karrde spent little time on the ship, preferring his office and quarters aboard one of his other vessels, the Action VI transport Wild Karrde. The smuggler chief used the Uwana Buyer as a showroom, a place to take prospective clients that he felt were gullible enough to be dazzled by his wealth. In addition to that role, Karrde used the ship as a reward for his employees. Those associates who performed well for Karrde would be assigned to the ship so that their next voyage would be a comfortable one."}, {"tag": "p", "text": "Karrde operated the Uwana Buyer during the height of the Galactic Civil War. In 8 ABY, Karrde and his second-in-command, the Human Quelev Tapper, took the ship to the planet Varonat on the Ison Corridor. Karrde and Tapper were investigating the operation of a Krish crime lord, Gamgalon, on the planet, who was using a Morodin-hunting safari as a cover for illegal activities. Karrde, ever mindful of new business opportunities, wanted to see if Gamgalon's activities were something on which he could cut himself in. Posing as a representative of the Sif-Uwana Council, Karrde had one of his associates, a Human named Chin, gimmick the Uwana Buyer's hyperdrive by mis-aligning the power flux connector by four degrees. That gave Karrde and Tapper a legitimate excuse to land on Varonat, and while waiting for the hyperdrive to be fixed, participate in one of Gamgalon's safaris. During the investigation, Karrde's and Tapper's covers were blown, and Tapper was killed. Karrde was saved by the hyperdrive mechanic whom they had hired. Like Karrde, the Human woman was operating on Varonat under an assumed name. She had suspected Karrde was more than a bored, wealthy bureaucrat upon hearing the name of his ship and the aliases that he and Tapper had used—Syndic Pandis Hart and Captain Seoul, respectively. The mechanic, whom Karrde knew as \"Celina Marniss,\" revealed her true name to Karrde as the pair escaped Varonat aboard the Uwana Buyer: Mara Jade."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Talon Karrde owned the Uwana Buyer, but preferred to travel aboard the Wild Karrde, leaving the command and crewing of the ship to his associates. Quelev Tapper crewed the ship during the Varonat mission, and Karrde employed a full-time Twi'lek masseuse to run the on-board spa. She was a medical student paying her way through school by working aboard the Uwana Buyer, and she doubled as the ship's doctor when the need arose."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Uwana Buyer first appeared in First Contact, a short story written by Timothy Zahn for West End Games' Star Wars Adventure Journal 1 in 1994. First Contact was later reprinted in The Best of the Star Wars Adventure Journal, Issues 1-4 in 1996, Tales from the Empire in 1997, and on Hyperspace. The ship was mentioned in Crimson Bounty, published in 1997's Star Wars Adventure Journal 14 by Charlene Newcomb and Rich Handley."}, {"tag": "p", "text": "The Uwana Buyer was mentioned in The Essential Guide to Characters in 1995, and was featured in the article Ships of the Smuggler's Alliance, published in Star Wars Gamer 4 in 2001, which provided the first visual image of the ship by Jeffery Carlisle and expanded on its history. It later received a mention in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}