{"url": "V-19_Torrent_starfighter/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Galactic Republic starfighter classes", "Category:Imperial starfighter classes", "Category:Slayn & Korpil products", "Category:Subpro Corporation products"], "nodes": [{"tag": "h1", "text": "V-19 Torrent starfighter"}, {"tag": "p", "text": "The V-19 Torrent starfighter was an assault fighter with exceptional speed and maneuverability used by the Galactic Republic during the Clone Wars."}, {"tag": "p", "text": "It was a predecessor of the Alpha-3 Nimbus-class V-wing starfighter, in terms of purpose and usage."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The V-19 was unique in that it had two pairs of folding airfoils (S-foils) that gave the ship added maneuverability and provided pilots with easy access to the cockpit's sliding canopy. The lower, hinged S-foils coupled with enhanced repulsorlift engines made the V-19 an exceptional vertical take-off and landing (VTOL) fighter."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "Its armament consisted of two laser cannons (one on each wingtip) and two concussion missile launchers. The number of concussion missiles carried by the V-19 was at least six. At Muunilinst, it was shown that these missiles were capable of independently acquiring and tracking their own targets. Anakin Skywalker took advantage of this feature to destroy a swarm of Nantex-class starfighters and a gun platform."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Production rush"}, {"tag": "p", "text": "After the prototypes proved successful during the First Battle of Geonosis, the Republic quickly began full scale production of V-19s to add to the arsenal of the growing clone army to compensate for the LAAT gunships' ineffectiveness against enemy starfighters. However, due to the months of training it took for the Republic's clone trooper pilots to become proficient with the vessel, the fighter was not available in large numbers for many of the early engagements of the war. They did not make a prominent showing until the Battle of Muunilinst, where 156 V-19s were carried into action by the Nevoota Bee, an Acclamator-class assault ship modified as a carrier."}, {"tag": "h3", "text": "In Combat"}, {"tag": "p", "text": "V-19 fighters were present during the Battle of Teth, when Obi-Wan Kenobi arrived with reinforcements to assist General Skywalker. General Kenobi, with aid of Odd Ball, led the squadron against Separatist Vulture droids. When Skywalker tried to land in the hangar, the vulture droids overtook them on a suicide run, crashing into the hanger and destroying all the V-19s in there, making it impossible for the general to land."}, {"tag": "p", "text": "They also comprised a significant portion of Skywalker's fighter forces aboard his flagship, the Resolute, especially during the Malevolence crisis."}, {"tag": "p", "text": "The fighter also saw action during the Battle of Kiros, where Skywalker and his Padawan freed the Togruta colony world from Separatist forces."}, {"tag": "p", "text": "When the peaceful world of Nexus Ortai was brought into the war battle, the V-19 served as the principal defense fighter against the Separatists in the space fight."}, {"tag": "p", "text": "Not long after that, V-19 fighters saw action during the Battle of Ryloth, Jedi Commander Ahsoka Tano led a squadron against the Separatist blockade, they were caught in a trap and over whelmed, after Axe, Tano's second-in-command was lost, The squadron was ordered to retreat, with only 2 fighters left out of the 15 that took part in the engagement."}, {"tag": "p", "text": "After that, fighters of this class were also present during the Sky Battle of Quell, where they defended the flagship of Jedi Aayla Secura, while she was waiting for reinforcements from Anakin Skywalker."}, {"tag": "p", "text": "Later during the Battle of Rendili under the command of generals Saesee Tiin and Plo Koon. They were also deployed during the Battle of Tirahnn."}, {"tag": "h3", "text": "Design upgrades"}, {"tag": "p", "text": "Initially designed as a short-range fighter, Republic technicians later added a Class 1 hyperdrive to equip the vessel for escort missions. Some were also modified to use Syluire-31 hyperspace docking rings. However, many of the hyperdrive-less fighters remained in service. Venator-class Star Destroyers were sometimes equipped with V-19s instead of V-wings, with a complement of 192. When a Venator opened its dorsal hangar V-19s would often be scrambled as a picket to screen the vulnerable, exposed hangar. The Acclamator-class assault ship also fielded V-19s. Although the number of fighters these ships could carry is unknown, the Acclamators that took the strike force to Muunilinst held at least 156 V-19s each."}, {"tag": "p", "text": "Torrent starfighters were joined, and nominally replaced, by ARC-170 starfighters and V-wings as the main fighters in the Republic's fleet towards the end of the Clone Wars. However, V-19s were still in use by the Republic near the end of the Clone Wars, serving as part of the task force sent to defend Kashyyyk shortly before the execution of Order 66."}, {"tag": "p", "text": "After the execution of the Order 66, the unconscious clone trooper HOB-147 of the Light Brigade Division was rescued by a man named Hurd Coyle, from the remains of his V-19 Torrent starfighter, where he was lost in space. This clone trooper would befriend young Padawans transported in Coyle's salvage ship, and would not turn them over to Imperial troopers."}, {"tag": "p", "text": "The Galactic Empire continued to utilize Torrents after the end of the Clone Wars, often reassigning these fighters to older carrier vessels and installations in the Outer Rim."}, {"tag": "p", "text": "In 17 BBY, followers of the rogue clone trooper Kaddak flew them during the Shrouded Offensive. The separatists ambushed Green Squadron before disappearing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LucasArts' Art Director Chris Williams and Concept Artist Greg Knight developed the design of the V-19 Torrent for the 2-D Clone Wars micro-series. They drew inspiration for the fighter's folding wings from the real-world F4U Corsair. Concept art of the Torrent for the 3-D Star Wars: The Clone Wars film was drawn up by Thang Le."}, {"tag": "p", "text": "A LEGO version of the fighter (LEGO STAR WARS - 7674 V-19 Torrent) was released in 2008, and is also a playable vehicle in LEGO Star Wars III: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}