{"url": "V-19_landspeeder", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Landspeeders", "Category:Naboo vehicles", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "V-19 landspeeder"}, {"tag": "p", "text": "The V-19 landspeeder, commonly referred to as a Gian speeder, was a small landspeeder used by the Royal Naboo Security Forces, alongside the lighter flash speeder."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "SoroSuub had designed the V-19 Landspeeder to operate as both civilian and military transports. The vehicle's medium-grade hull plating and reinforced armor made it a common sight on congested urban worlds where collisions were commonplace."}, {"tag": "p", "text": "The V-19 was also equipped with thrust pods tucked in at its back to reduce target silhouette. This made it popular with the Naboo Royal Security Forces which deployed it for a range of situations including crowd control, wilderness excursions and urban battles."}, {"tag": "p", "text": "Although Naboo was a fairly peaceful planet, the Gian speeder was nonetheless rather heavily armed, with 2 forward light repeating blasters that could easily disable non-military vehicles and an optional medium blaster cannon turret. Each blaster had its own dedicated auxiliary power unit which allowed it to operate even if the speeder's primary power generator was damaged."}, {"tag": "p", "text": "The removable medium blaster cannon was able to pierce the lower forward armor below the pilot's hatch of an AAT. Some Gian speeders didn't carry this cannon, their pilots favoring a larger windshield."}, {"tag": "p", "text": "Each carried a pilot, gunner and 2 passengers which were usually more than enough to handle a situation. Command versions of the vehicle featured holographic projection systems for tactical planning and more advanced communication systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Invasion of Naboo, there were 36 Gian speeders in use by the RSF."}, {"tag": "p", "text": "When the Trade Federation launched its invasion of Naboo in 32 BBY, many Gian speeders were destroyed in direct combat with heavier Armored Assault Tanks. Following that, the few intact Gian Speeders were used by the resistance movement.[source?] A Gian speeder was used at a Resistance outpost. Lieutenant Gavyn Sykes drove another speeder at an engagement at the south ridge of Theed. During the invasion, Gian speeders were deployed to ambush lone AATs. This created a diversion that allowed Padmé Amidala and a small force to storm the Theed Royal Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "V-19 landspeeders first appeared in 1999 with the release of Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}