{"url": "V-wing_airspeeder", "categories": ["Category:Legends articles", "Category:Airspeeders", "Category:New Republic vehicles", "Category:Slayn & Korpil products"], "nodes": [{"tag": "h1", "text": "V-wing airspeeder"}, {"tag": "p", "text": "The V-wing airspeeder was a combat airspeeder developed by the New Republic to replace aging cloud cars and allow more expensive starfighters to focus on space combat."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Verpine Slayn & Korpil hive colonies, famous for their development of the B-wing starfighter, designed the V-wing airspeeder. The airspeeder's standard repulsorlift system was paired with efficient ion afterburners to provide the V-wing with fantastic speed."}, {"tag": "p", "text": "The single-pilot craft's top combat speed was 1,000 kilometers per hour. Additionally, when the powerful Chab-Ylwoum scramjet booster was employed, the craft's top speed was increased to 1,400 kilometers per hour. Braking and maneuvering flaps were at the rear of the craft. Heat dispersal fins were placed between the engines. Unfortunately, combat at such a speed was potentially dangerous, and overuse of the scramjet could cause dangerous overheating of the drive system, so the scramjet was reserved for hasty retreats. The V-wing's lack of shields required the pilot to use the craft's size and speed against enemy speeders and starfighters."}, {"tag": "p", "text": "The V-wing's weapon systems had two fire-linked blaster cannons on either side of the vehicle with an effective range of two kilometers. The blaster cannons also had a rapid-fire setting that worked well against shielded targets, but after approximately three seconds of continuous fire, the cannons would overheat."}, {"tag": "p", "text": "Because of their unusually high flight ceiling, V-wings could be deployed from both ground-based hangars and from hangar-equipped starships. When deployed from space, the airspeeder relied on V-wing airspeeder transports which were capable of carrying up to four (later models carrying six) V-wings for transport into planetary atmospheres. A large capital ship could carry up to ten of these transports, allowing dozens of V-wings to be rapidly deployed to a world under siege. The craft also had a refueling port, located on the starboard stern."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As the struggle with the remnants of the Empire continued, New Republic military acknowledged the need for a low cost and low maintenance vehicle for planetary defense. The V-wing, with its rapid deployment, high speed and low cost, was the solution."}, {"tag": "p", "text": "The V-wing saw its first combat action at the Battle of Calamari in 10 ABY. Wedge Antilles and his fellow pilots of Rogue Squadron flew the craft and disabled three smaller World Devastators."}, {"tag": "p", "text": "The V-wing also saw action in the Battle of Coruscant to the Yuuzhan Vong. The V-wings were highly effective against the incoming atmospheric craft but were simply overwhelmed through sheer numbers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The V-wing airspeeder first appeared in the Star Wars: Dark Empire comic book."}, {"tag": "p", "text": "The V-wing has a missile launcher with six cluster missiles in the game Star Wars: Rogue Squadron, but it is absent from the V-wing entries in any reference books. It seems likely that the missile launcher is not considered canonical, but is simply an artifact of game mechanics."}, {"tag": "p", "text": "The design of the V-wing was recycled from an early design of the T-47 airspeeder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}