{"url": "V-wing_Speeder_Transport,_Model_A", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:New Republic vehicles", "Category:Slayn & Korpil products"], "nodes": [{"tag": "h1", "text": "V-wing Speeder Transport, Model A"}, {"tag": "p", "text": "The V-wing Speeder Transport, Model A was a transport used by the New Republic to deploy V-wing airspeeders from capital starships. Like the V-wing itself, the transport was manufactured by Slayn & Korpil."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Model A was twenty meters long and could carry four V-wing airspeeders under its arching wings. These transports were similar in shape to the airspeeders they carried, but much larger in size. The V-wings were carried externally, and could be accessed through retractable docking sleeves, as they were not sealed for space flight. As such, pilots traveled on board the transport while in space."}, {"tag": "p", "text": "Once the transport reached the upper atmosphere of a planet, the V-wing pilots would climb down and strap into their airspeeders. After releasing its V-wings, the transport could return to its mothership to take another group of V-wings or remain in near orbit to await its speeders at a rendezvous point."}, {"tag": "p", "text": "The V-wing transport was unarmed and thus had to depend on starfighters such as X-wings and E-wings for protection."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Model A was an integral part of the V-wing Transport/Combat Speeder team, an initiative to deploy airspeeders to combat zones more quickly. During the Battle of Calamari, Model As were launched from capital ships such as the Imperial-class Star Destroyer Emancipator, which had been captured and put to use by the Republic. They saw action against the resurrected Emperor Palpatine's World Devastators, TIE/D fighters, and AQ-5 Waveskimmers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}