{"url": "V-wing_Transport/Combat_Speeder_team", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Slayn & Korpil products"], "nodes": [{"tag": "h1", "text": "V-wing Transport/Combat Speeder team"}, {"tag": "p", "text": "The V-wing Transport/Combat Speeder team was the result of the New Republic's need to deploy airspeeders into combat zone withs effectiveness and efficiency. Often, the presence of airspeeders in a combat theater could prove vital to the survival of a facility, or to ensuring victory. In general, airspeeders were transported to planetary bases in parts and assembled on site. Once the time came to leave, the vehicles had to be broken down for transport. During the Battle of Hoth, the Alliance to Restore the Republic's T-47 airspeeders had to be abandoned due to the lack of transport and time necessary to properly evacuate them."}, {"tag": "p", "text": "A new deployment method was sought. Turning them into starships was out of the question, and any capital ship capable of transport a whole squadron was too unwieldy to quick deploy them to a planet. The Verpine company, Slayn & Korpil, came up with a radical idea; a two-part system that incorporated both a fully capable, all environment airspeeder, and an interface transport capable of deploying the speeders to the surface quickly. The result was the V-wing Transport/Combat Speeder team."}, {"tag": "p", "text": "The V-wing airspeeder was a fast combat vehicle that was fueled and armed while aboard a capital ship. They, in turn, were attached to a transport that could carry four V-wings slung under its wings. The pilots would enter the transport, since the V-wings themselves were not sealed for the vacuum of space. The transport would then launched, escorted by starfighters, and head to the planet to deploy the speeders. Once in atmosphere, the pilots would enter their V-wings, and launch. The transports would then return to the capital ship to ferry more speeders into battle, or wait to collect the speeders."}, {"tag": "p", "text": "By 10 ABY, the V-wing Transport/Combat Speeder team had been used successfully in over a dozen battles. They were also deployed as part of the New Republic response to the World Devastator assault on Dac. An updated version, the Model B was also produced by Slayn & Korpil. It could ferry six V-wing airspeeders. Following the successful deployments, the transport docking tube was studied by Slayn & Korpil for possible addition of an universal adapter that would allow T-47 airspeeders and other models to be used with the transport."}, {"tag": "h2", "text": "Sources"}]}