{"url": "V-4X-D_ski_speeder", "categories": ["Category:Canon articles", "Category:Vehicle stubs", "Category:Airspeeders", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Resistance vehicles"], "nodes": [{"tag": "h1", "text": "V-4X-D ski speeder"}, {"tag": "p", "text": "The V-4X-D ski speeder, also known as the Resistance ski speeder, skim speeder, or the Single Pilot Operator, was a high-powered assault vehicle manufactured by Roche Machines."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Roche Machines' V-4XD ski speeder was a low-altitude airspeeder used by the Rebel Alliance during the Galactic Civil War. The ski speeder used a stabilizer strut to keep balance when moving across alien terrain. The strut could be retracted so that the speeder could gain some altitude, but this would often make the craft experience severe wobbling."}, {"tag": "p", "text": "With its outward similarity to the A/SF-01 B-wing starfighter, Captain Poe Dameron once remarked that the speeder was essentially \"a B-wing that couldn't fly.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Roche Machines sold the V-4 series of ski speeders for asteroid slalom racers; however the sport shut down after a group of racers was destroyed by a stone mite infestation."}, {"tag": "p", "text": "The vehicle then found new life by explorer groups, who modified the ski speeders for various tasks."}, {"tag": "p", "text": "The Rebel Alliance brought a number of these to the planet Crait while attempting to reactivate a base used by the early Rebellion. The rebels decided against using the facility due to dangerous weather conditions and Imperial discovery. After a skirmish with an Imperial commando squad, the remaining speeders were left behind on the planet."}, {"tag": "p", "text": "Those same speeders were later recovered and used by the Resistance during its conflict with the First Order in 34 ABY. Thirteen of the leftover speeders, which had been stripped down almost to their barest components, were deployed during the Battle of Crait against the attacking First Order army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Resistance ski speeder was first seen in the first teaser trailer for Star Wars: Episode VIII The Last Jedi on April 14, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}