{"url": "Vaathkree_(planet)", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:High-gravity planets", "Category:Hutt planets", "Category:Hutt Space planets", "Category:Periphery planets", "Category:Type IV atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Vaathkree  (planet)"}, {"tag": "p", "text": "Vaathkree, also known as Vaath'kror, was a volcanic Outer Rim Territories planet located in the Tharin sector's Periphery region. It was the homeworld of the sentient Vaathkree species, members of which had skin covered in a layer of stone or metal and were avid, religious traders. The Vaathkree constructed vnals, sentient, partly organic domed cities, for housing off-world visitors to their homeworld."}, {"tag": "p", "text": "Although Vaathkree was historically situated in territory influenced by members of the Hutt species, by 17 BBY the Galactic Empire annexed Vaathkree and its surrounding Hutt Space area, although the Empire mostly ignored the planet. During their invasion of the galaxy, the Yuuzhan Vong conquered the Vaath'kror system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vaathkree, also named Vaath'kror after the star system it was situated in, was a planet located in the Periphery, a part of the Tharin sector in the Slice portion of the Outer Rim Territories. The planet was connected by hyperlanes to the Solacton and Sriluur systems, lying at a distance of one hour and two hours' hyperspace travel using a Class 1 hyperdrive, respectively. Occupying the third and outermost orbital position in the Vaath'kror system, Vaathkree was a considerable distance away from the other two planets of the system, with its year lasting 197 local days, each of which was fifty-four standard hours long."}, {"tag": "p", "text": "The planet had heavy, 1.8 standard gravity and a corrosive, poisonous, searing hot Type IV atmosphere that necessitated the use of environment suits for most sentient beings. Vaathkree's harsh, highly volatile surface, which suffered constant meteor impacts, included chains of active volcanic mountains and deep crevasses as well as extensive flats of lava and exposed radioactive metals. The planet had an arid hydrosphere."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Space surrounding Vaathkree was explored between 15,000 BBY and 8000 BBY, although the planet had already been located in the territory controlled by members of the Hutt species by 25,000 BBY. During the Pius Dea Era, a period of time between approximately 12,000 BBY and 11,000 BBY, Vaathkree was situated outside the borders of the Galactic Republic. It was a part of Hutt Space in 22 BBY, when the Republic's Thirteenth Sector Army was charged with engaging the military forces of the Confederacy of Independent Systems in Vaathkree's vicinity as part of the first campaigns of the Clone Wars that began that year."}, {"tag": "p", "text": "By 17 BBY, the northern portions of Hutt Space, including Vaathkree, were annexed by the Galactic Empire, although that government mostly ignored the planet. The Vaath'kror system was attacked at some point between 26 ABY and 27 ABY by the military forces of the extra-galactic Yuuzhan Vong species as part of its conquest of the galaxy, and the star system remained under the invaders' control by 27 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Vaathkree was the homeworld of the Vaathkree, sentient aliens whose skin was covered in small scales or plates of stone or metal. The Vaathkree began their multi-stage life cycle as \"Stonesingers\"—small, mobile nodes of living metal ore that inhabited the planet Vaathkree's lava flats and crevasses. Young Stonesingers did not possess cognitive abilities and spent the nights roaming their homeworld's plains and absorbing bits of lava and stone, which were then incorporated into the fluid structure of their bodies. Over a period of two decades, the Stonesingers evolved into mature Vaathkree, in the process adopting a permanent—most frequently Humanoid—shape."}, {"tag": "p", "text": "For many millennia, the Vaathkree, who communicated in the Vaathkree trade language, were active members of the Republic, and they were active traders, adhering to a religious tradition known as The Deal. The population of Vaathkree numbered six million, and it was governed by the Vaathkree Council. The Vaathkree society had reached the space level of technology, and it imported computers, droids, and other high technology from off-world while exporting mid-level technology and raw materials."}, {"tag": "p", "text": "Off-world tourists often encountered the Vaathkree Stonesingers on the planet but were ordered to only observe them from afar. The natives of Vaathkree created the vnal cities to house any visitors from elsewhere in the galaxy, although despite the vnals being comfortable for short-term visits, over extended periods of stay the guests of the planet mostly found the living nature of the cities to be disturbing."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Vaathkree had an Imperial-class spaceport. The planet's surface was also dotted by vnals—domed, partly organic cities that were living, breathing, and sentient constructs created by the Vaathkree through the use of unusual metallurgy and engineering techniques."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Vaathkree was first mentioned in the 1994 The Last Command Sourcebook, written by Eric Trautmann for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Vaath'kror system, and therefore the planet itself, in grid square S-8."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}