{"url": "Beldon/Legends", "categories": ["Category:Legends articles", "Category:Creatures of Bespin", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Flying creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Beldon"}, {"tag": "p", "text": "The beldon was an enormous rethen gas-filled creature native to the skies of Bespin. The creatures were a popular sighting for tourists on Bespin and were protected by law on the planet."}, {"tag": "p", "text": "Beldons metabolized the natural chemicals and biospheric plankton of the slushy gas-liquid-solid interface of Bespin's lower atmosphere via long, trailing tentacles. They traveled in free-floating herds numbering anywhere from 500 to 3,000. Their buoyancy was such that it was not unknown for dead beldons to remain airborne for weeks. Beldons reproduced sexually, but did not mate: eggs and sperm were released into the atmosphere and drifted until random fertilization occurred. By nature they were passive creatures, and when attacked generally fled into areas of deeper pressure where predators could not survive. In such cases one beldon often sacrificed itself by lagging behind to allow its kin to escape."}, {"tag": "p", "text": "Beldons excreted tibanna gas, which could be collected and used as hyperdrive coolant. Other gases they contained were highly flammable, rendering the creatures explosive. They were surrounded by a electrical field to detect approaching predators, like velkers, who preyed on them by poking holes in them and feeding on them until they entered the poisonous gas layer. Herds of beldon would combine these fields, extending them for hundreds of kilometers. In such cases, the fields could significantly interfere with shipboard electronics. The symbiotic triggerbirds were capable of inhabiting the tentacles of the beldon without harm."}, {"tag": "p", "text": "Some rare species of beldon could actually survive in space, drifting in interstellar nebulae or gas clouds. They could also consume minerals in small planetoids and asteroids by secreting acid on their tentacles to bore into rock and metal. They were known to even latch onto crippled starships for their mineral content. Like the beldons on Bespin, these \"space beldons\" also excreted tibanna gas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}