{"url": "VR-10_Cuirilla-Rayl_Xylines-class_spacetug", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Starfighter classes", "Category:Transport classes", "Category:Tug classes", "Category:VR-10 Cuirilla-Rayl Xylines-class spacetugs"], "nodes": [{"tag": "h1", "text": "VR-10 Cuirilla-Rayl Xylines-class spacetug"}, {"tag": "p", "text": "The VR-10 Cuirilla-Rayl Xylines-class spacetug, sometimes known as Cuirilla-Raye Xylines-class Spacetug and often called CRX-Tug, was a short-range starship designed to tow bigger transports to their docks. Slow, difficult to customize and lacking hyperdrive or stock weaponry, the Xylines-class spacetug was unpopular among spacers, although it was seen in fleets of the Alliance to Restore the Republic and in the hands of pirates like Yearo Seville, as was the case with the Worthless Fool. The Cragmoloid smuggler Rooty owned a modified Xylines-class spacetug, the Solar Grazer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The VR-10 Xylines-class spacetug was a short-range spaceship designed for use in docks. The spacetug used its tractor beam projectors to tow larger starships, mostly bulk transports, bulk carriers, and container ships, to their specific bay. The spacetug was also able to help the ships unload their cargo."}, {"tag": "p", "text": "These spacetugs were 42-meter starships that reached a maximum atmospheric speed of 230 kmh. The vessels were designed to always tow in the same star system and as such, they were not equipped with a hyperdrive. However, modifications were made to individual ships that made them capable of micro-jumps within the same system. The VR-10 Xylines-class spacetug required a crew of just two beings, but it could also lodge up to eight passengers; and was able to hold two weeks worth of consumables and 225 tons of cargo."}, {"tag": "p", "text": "The spacetug housed two highly-precise turret-mounted Hansen FeatherTouch tractor beams that could be used defensively, but most pilots did not consider them to be weapons. The spacetug was also slower and clumsier than other similarly-sized ships, and weapons were particularly hard to install because of the unusual arrangement of the spacetug's power couplings, leaving the ship defenseless except for the two tractor beam projectors. While difficult, the installation of weapons was not impossible. The pirate Yearo Seville installed two turret-mounted laser cannons, placing one in each of the tractor beam pylons. He also added a third gun, a ball-turret heavy laser cannon, in the bow of his spacetug. Seville's vessel also was adapted to accept a one-legged pilot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed by the Cuirilla-Raye corporation, the Xylines-class spacetug was introduced to the galaxy before 22 BBY. Spacers nicknamed the model the \"CRX-Tug.\" Around 10 BBY, unused spacetugs were available on the open market for 50,000 credits, and used ones were valued at 20,000. The Cragmoloid smuggler Rooty owned a highly-customized spacetug, the Solar Grazer, whose maintenance he overlooked. The Grazer had an added short-range hyperdrive that Rooty used for short smuggling runs."}, {"tag": "p", "text": "By 0 ABY, a number of spacetugs were used in Imperial docks, and others were sometimes used as short-range haulers. The spacetug was already an obsolete model by then, and they were no longer sold in mint condition. The spacetug was also a common prey for space pirates."}, {"tag": "p", "text": "Around that time, the pirate Yearo Seville owned a spacetug that he heavily modified with weaponry, a hyperdrive, and increased living space at the expense of cargo space. Seville later sold this ship to a procurement officer of the Alliance to Restore the Republic, under the pretense that the spacetug had been used in Imperial shipyards and that the ship's memory core still held valuable information. That was a lie, as the memory core had been fused. The officer paid a considerable sum for the ship, only to be reprimanded later by his Fleet Supervisor, Dwin Wisheel. Wisheel said that the ship was worthless and the officer was a worthless fool; and the spacetug was later officially christened Worthless Fool. The Fool nonetheless bolstered the Alliance sectorial fleet and made regular supply runs to the Rebel base on the planet Berrol's Donn with Maytoc Kollene willingly piloting her. Later, Seville kidnapped Shashay artist Crying Dawn Singer and the Alliance sent the crew of the Fool to rescue Seville's prisoner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "VR-10 Xylines-class spacetug was first introduced in The Abduction (1992), a roleplaying adventure for West End Games' Star Wars: The Roleplaying Game. The Abduction mentioned the customized tug Worthless Fool, calling it a \"transport.\" The specifics for a non-modified tug were only provided in Pirates & Privateers (1997)The Abduction is the only source to consistently use the spelling Cuirilla-Rayl; all of the other sources consistently use Cuirilla-Raye."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}