{"url": "Va%27too", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Va'too"}, {"tag": "p", "text": "Va'too was a Jedi Master who lived during the final years of the Galactic Republic. Sometime before 22 BBY, the Jedi Master took the female Aargauun Talia Moonseeker as a Padawan apprentice. Four months after Moonseeker became a Jedi Knight, Va'too and Moonseeker were part of a task force sent to the planet Geonosis to rescue Jedi Knight Obi-Wan Kenobi, who had been captured during a mission there. However, the rescue attempt turned into a full-scale battle with the Confederacy of Independent Systems, and Va'too was killed. After the battle, Moonseeker ensured that the body of her former Master was retrieved."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Va'too was a Force-sensitive individual who lived during the waning decades of the Galactic Republic. Va'too was taken and trained by the Jedi Order, reaching the rank of a Jedi Knight and later that of a Jedi Master. At some point, Va'too took the female Aargauun Talia Moonseeker as a Padawan learner. Around 22 BBY, Moonseeker successfully passed her Jedi Trials and became a full-fledged Jedi Knight herself."}, {"tag": "p", "text": "Four months later, Jedi Knight Obi-Wan Kenobi was captured by forces of the Confederacy of Independent Systems during a mission on the Outer Rim planet Geonosis. Jedi Master Mace Windu summoned a strike team consisting of over 200 Jedi—including Va'too and Moonseeker—to rescue the trio. However, their rescue effort turned into a large battle against the Separatist Droid Army in the arena where Kenobi was to be executed, and Va'too was killed during the fighting. When the battle had ended, Moonseeker returned to the arena and mourned the loss of her Master. Afterward, she made sure that Va'too's corpse was carried away from the battlefield."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Moonseeker was fond of Va'too, and she was deeply upset by her former Master's death. Moonseeker ensured that Va'too's remains were carried away from the arena."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Va'too possessed the knowledge and the skills to become a Jedi Knight and was able to successfully train Moonseeker to Knighthood. Although a fully trained Jedi Master, Va'too was killed in the arena on Geonosis, along with many other Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Va'too was first mentioned in Wild Space, a novel of The Clone Wars series. Wild Space was written by Karen Miller and published in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}