{"url": "Vaenrood", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Pakuuni sector planets"], "nodes": [{"tag": "h1", "text": "Vaenrood"}, {"tag": "p", "text": "Vaenrood was a planet in the Vaenrood system, which was located in the Pakuuni sector of the Outer Rim Territories. Several months before the liberation of Kal'Shebbol, capital of the Kathol sector, the New Republic fought the Galactic Empire on Vaenrood."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Vaenrood was located in the system of the same name in the Pakuuni sector of the Outer Rim Territories. An area of the planet was mountainous."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, several months before their campaign to oust warlord Moff Kentor Sarne from his capital on the planet Kal'Shebbol in the Kathol sector, the New Republic battled Imperial forces on Vaenrood. New Republic ground forces and T-65 X-wing starfighters were deployed to the planet; one of the X-wings was flown by Lieutenant Darryn Thyte."}, {"tag": "p", "text": "During the battle, New Republic ground troops covered by X-wing air support engaged Imperial units supported by artillery in a mountainous area. As the engagement unfolded, Lieutenant Thyte's X-wing was clipped by artillery fire, causing the starfighter to crash. Thyte survived the impact, but the canopy of his X-wing buckled and snapped, shearing off most of his right arm above the elbow. Medics replaced the arm with a clunky cybernetic prosthesis, which was the best available at the time. Following the crash, Thyte was removed from active flight duty."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vaenrood was first mentioned in the short story \"The Saga Begins\" by Timothy Zahn, published in The DarkStryder Campaign by West End Games in 1995. Vaenrood is further elaborated on in Lieutenant Darren Thyte's character biography."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}