{"url": "Vader%27s_diary", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Journals and memoirs"], "nodes": [{"tag": "h1", "text": "Vader's diary"}, {"tag": "p", "text": "Vader's diary was the private journal of the Sith Lord Darth Vader. He used the diary to record his thoughts on events that occurred throughout his life, as well as illustrations of acts of violence. One major incident recorded in his diary involved Vader's disappointment that the stormtroopers under his command had not acknowledged his birthday. Between 0 ABY and 3 ABY, the stormtrooper Bob stole the diary from Vader's quarters and read through it on his lunch break, along with his colleague Kjazhed-Uhl. After reading the diary, one of the stormtroopers quietly wished Vader a happy birthday."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Darth Vader's diary had green cover with a black spine, and was labelled with his name on the front. The book contained his thoughts on various events thorughout his life. One event recorded in it was his reaction to receiving a new helmet, which he considered a better fit and more menacing in appearance. He also that he had little time to write as he was due for a meeting the following morning, which he detested and preferred to do evil. Vader commented that he had been having nightmares, spelling it \"nitemares.\" On another page, Vader recorded his feelings about having to meet his son, Luke Skywalker, who did not know the truth of his parentage. He was unsure how he would communicate the truth, and worried that his son would not believe him and would be angry to learn that his archnemesis was his father. He also mused that his son must have had a difficult time growing up fatherless, having experienced the same thing. Vader, not responding well to rejection, hoped that he would not have to kill Skywalker and that he would join him and they would rule the galaxy together."}, {"tag": "p", "text": "Vader also reflected that he was a pessimist by nature and needed to be more confident. A subsequent page had a series of illustrations by Vader portraying him committing acts of violence with his lightsaber against Imperial officers and aliens. Further pages contained descriptions of Vader's hatred and atrocitities he had committed, as well as an experience with an incurable rash. A following anecdote showed Vader's mistaken expectation that his stormtroopers had organized a surprise birthday party for him. His suspicion was based on a strage vibe he felt during a lineup as his birthday drew near, which he considered as the possibility of a mutiny, but reasoned that they would never be so stupid to attempt it. He also remembered that no birthday party had been thrown for him in previous years, but reasoned that all those stormtroopers had died and been replaced. Vader wrote that he had made hints about suitable gift ideas, such as a scooter or an electric toothbrush. Vader recorded the events of his birthday the following morning. His presence had been requested in a meeting, where he hoped to be surprised, but he saw only General Chymoelaan there."}, {"tag": "p", "text": "Vader looked around to see if anyone was hiding, to no avail. While walking back to his quarters, he heard a party occurring, one for a stormtrooper who happened to share his birthday. Vader made a mental note to kill the stormtrooper. He walked into the room, causing all the stormtroopers to freeze, Vader felt ostracized and left for his quarters. The Sith Lord tried to console himself by considering his accomplishments, but could not keep his depression out of mind. He hoped to sleep, but a lack of sleep for three days and a diet of only cheese curls in the past eighteen hours caused a deterioration in his mental state, to the point that he tried to call his dead mother. Vader passed out at some point in the night and became embarassed by his actions when he awoke. He wrote in the diary that if anyone were to find out, he would have to kill them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Vader kept the diary in his quarters hidden under a pile of magazines. Sometime between 0 ABY and 3 ABY, the stormtrooper Bob found Vader's diary while removing a corpse. He planned to read it over a weekend while Vader was away, considering it a once in a lifetime opportunity. On a lunch break, Bob was encountered by the fellow stormtrooper Kjazhed-Uhl, with whom he shared his discovery. Both stormtroopers decided to start reading, selecting the page about his new helmet first. After debating on whether Vader's spelling of nightmare as \"nitemare\" was correct, they decided to skip ahead, finding the passage where the Sith Lord reflected his feelings on his son."}, {"tag": "p", "text": "The stormtroopers found Vader's illustrations next and considered them to be poor quality. Looking for Vader's thoughts on them, Bob and Kjazhed-Uhl skipped ahead to the section on stormtroopers, where they discovered his reaction to his birthday being forgotten. Both stormtroopers gained a greater understanding of Vader through reading the diary, believing it explained his tortured existence. Bob thought Vader needed a creative outlet such as painting or dancing, while Kjazhed-Uhl considered that addressing his issues head-on would be the solution. Later, after Vader called an emergency meeting to find an intruder, one of the stormtroopers quietly wished the Sith a happy birthday, causing him to pause and look back at the stormtrooper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vader's diary appeared in \"Lunch Break,\" a comic written and illustrated by Jonathan Adams and released in Star Wars Tales 16, published on June 25, 2003. Flashbacks of scenes described in the diary with greyscale illustrations constitute most of the comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}