{"url": "Vaecta", "categories": ["Category:Legends articles", "Category:Females", "Category:Yuuzhan Vong priest caste"], "nodes": [{"tag": "h1", "text": "Vaecta"}, {"tag": "p", "text": "Vaecta was a priestess of Yun-Yammka, the Yuuzhan Vong god of war, and was attached to Warmaster Tsavong Lah during the Yuuzhan Vong invasion. Wizened and elderly, Vaecta counseled Lah on the manner by which he should retain favor with the Yuuzhan Vong Pantheon, often advocating sacrifices and, on a few occasions, attempting to influence the warrior's strategy."}, {"tag": "p", "text": "The priestess presided over sacrifices at the captured world of Duro, as well as during the push on the galactic capital, Coruscant. Vaecta also ordained at the ceremony in the course of which a radank claw was grafted onto Tsavong Lah's arm prior to the warmaster's assault on Coruscant; by this stage in her dealings with the warmaster, however, Vaecta was often coming into veiled conflict with the headstrong warrior."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Ordaining at Duro"}, {"tag": "p", "text": "Warmasters such as Tsavong Lah had a habit of devoting their religious faith solely to Yun-Yammka, the Yuuzhan Vong god of war, and Vaecta, along with a host of other priests, was attached to Lah's flagship, the Sunulok, in order to prevent this from occurring. Due to this role—and beholden as she was to Supreme Overlord Shimrra Jamaane himself—Vaecta had the ability to influence and shape the warmaster's decisions, and a power struggle of sorts was constantly playing out aboard the Sunulok. Vaecta thus was attached to Tsavong Lah throughout his campaigns in the galaxy, and accompanied him as the warmaster's fleet conquered the planets of the Corellian Run. She was, even to Tsavong Lah, particularly bloodthirsty in her demands for sacrifices, and she often forced the warmaster to accommodate her wishes."}, {"tag": "p", "text": "In 26 ABY, aboard the Sunulok, Vaecta departed conquered Rodia and traveled with the fleet to Duro, the first of the bases Lah wished to establish as platforms to the Core. The priestess traveled with Lah and his warriors in yorik-trema down to Duro's poisoned surface as the battle raged in space above them. With a troupe of religious musicians, Vaecta accompanied Lah to the main refugee hub of Gateway, and there gave him a tkun with which to sacrifice the researchers who had been attempting to terraform the planet. The black-robed priestess watched over the affair."}, {"tag": "p", "text": "As Yuuzhan Vong forces battled the New Republic presence on the world, Vaecta stayed with the warmaster in the offices of Leia Organa Solo, who had been presiding over the habilitation of refugees onto Duro. When the administrator was captured by warriors and brought with a young Hutt, Randa Besadii Diori, before the priestess and the warmaster, Vaecta ordered her musicians to prepare to sacrifice Organa Solo. A slow beat was hammered out on a living drum, and two harp players plucked their instruments' tendons as Vaecta uncoiled a tkun and approached the helpless woman. Vaecta, however, was taken aback when Lah interrupted her ceremony to question Organa Solo, but at a nod from the warmaster she continued, only to have the proceedings interrupted again by the Hutt Randa, who lashed out with his tail, knocking the warriors aside and giving Organa Solo a chance to escape. Reacting quickly, Vaecta hurled her tkun around Randa's massive neck, which throttled the life out of the Hutt as Organa Solo was restrained. Randa's massive corpse was taken to the kitchens and, forming a circle around Organa Solo once more, Vaecta brought forth another tkun and watched as the warriors began to beat the woman's legs. Yet again, the ceremony was curtailed; this time the Jedi Jacen Solo, the son of Vaecta's captive, burst into the office. While Solo and Lah clashed in a duel, Vaecta and her musicians huddled against the wall, but the Jedi sooned lifted a maelstrom of objects into the air with the Force, which he spun around himself to protect his mother. The flying objects overwhelmed the Yuuzhan Vong. The warmaster himself was knocked out of the window, permanently crippling his left foot, and Vaecta was rendered unconscious along with one of the musicians—Solo had killed the other with a heavy iron sconce. Fortunately for the priestess, she survived the ordeal as Solo quickly departed with his mother."}, {"tag": "h3", "text": "During the Coruscant campaign"}, {"tag": "p", "text": "Vaecta remained with Tsavong Lah, though she was not of high enough station to preside over the grafting of a vua'sa claw onto the foot Lah had lost fighting Jacen Solo. Aboard the Sunulok, the priestess and the warmaster soon entered into more petty conflicts; Lah claimed that the priest caste was fallible and that only the gods were unquestionable. Vaecta later presided over another sacrifice, that of an Ithorian, in order to determine the gods' will with regards to the warmaster's next military action; during such occasions she did not need to offer deference even to Tsavong Lah. When the slave died silent, Vaecta counseled Lah against destroying a mass of refugee convoys, which were being held at Talfaglio, in response to a Jedi victory at Arkania; bristling at Vaecta's imposition, the warmaster informed the priestess that the decision was his alone. Lah ordered that the priestess ask Yun-Yammka to punish the commanders who had failed him at Arkania; she demanded that twenty thousand captives—instead of the eight thousand Lah offered—should be sacrificed. The new logistics, therefore, forced Lah to devote escort vessels to guard the ships carrying the sacrifices, resulting in military setbacks elsewhere. The divide between Vaecta and the warmaster grew more apparent as the readers, sacred to the priest caste, refused to honor with salutes and genuflections the warriors, intendants and shapers aboard the vessel, reminding the warmaster and his subordinates that the loyalty of the priests and readers attached to the Sunulok was to Vaecta, not to Tsavong Lah. In return, the Warmaster insulted one of Vaecta's subordinates, Kol Yabu of the Undying Flame, over the matter of the planned sacrifice of the Solo twins."}, {"tag": "p", "text": "Vaecta and Tsavong Lah were next brought into close contact during the grafting of a radank claw onto the warmaster's arm. Lah planned to sever his limb on a cutting block and sacrifice it to Yun-Yammka in return for Coruscant, and although the Warmaster wished his long-time friend, the priest Harrar, to preside over the ceremony, he felt that it would not do well to insult Vaecta by favoring Harrar at a time when he asked so much of the gods. As the Sunulok orbited Borleias, Vaecta blessed the radank claw, and was satisfied when the Warmaster, faced with the opportunity to communicate with his subordinate coordinating the attack on the planet, Supreme Commander Maal Lah, forwent interrupting the ceremony. Once the claw had been blessed, Vaecta awaited Lah's readiness as she excised a chunk of flesh from the thigh of shaper Ghithra Dal, who would attach the claw to the warmaster's wrist. The atmosphere grew strained as Maal Lah's updates postponed the ceremony, though Vaecta continued, entwining a strip of her own flesh with Dal's and presenting it to the warmaster. To the horror of Vaecta and those others present, including the priest Harrar and the tactician Seef, Lah halted the ceremony entirely to give orders to his supreme commander, before offering his entire forearm to the gods."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Utterly loyal to the gods of the Yuuzhan Vong over all others, Vaecta was devoted to her role as a priestess. She had no regard for the lives of those who were sacrificed by her or on her request, however, this trait was typical of her species. Bold and certain in her dealings with Tsavong Lah, Vaecta made no attempts to act as the Warmaster's equal, reflecting a streak of stubbornness and pride."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vaecta appears in both The New Jedi Order: Balance Point and The New Jedi Order: Star by Star, though she only emerges as an actual—if mild—antagonist of Lah's in the latter novel. It is possible she died aboard the Sunulok at Coruscant, or at the Battle of Ebaq 9, during which Tsavong Lah's command vessel, Blood Sacrifice, was destroyed along with much of the Battle Group of Yun-Yuuzhan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}