{"url": "Belgaroth", "categories": ["Category:Legends articles", "Category:Belgaroth locations", "Category:Belgaroth system planets", "Category:Fortress worlds", "Category:Rocky planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Belgaroth"}, {"tag": "p", "text": "Belgaroth was a planet that was located within the Core Worlds region of the galaxy, situated near the Rimma Trade Route. The planet was used by the Galactic Empire to test new weapons and combat maneuvers. It was also the homeworld of the droidbreaker, a species of hulking creatures that fed on plasteel and refined metals."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Most of the planet consisted of rocky, rugged, and inhospitable mountains, with an occasional hill, plain, or valley. The bodies of water that passed for oceans were a pair of large seas of a murky mustard-brown color, a result of the heavy mineral sediment. The world had one city, Belgar, and several large scrapyards. Astrophysically, the planet orbited a binary sun. Matanya A was an orange sun while Matanya B was a smaller yellow sun. Two moons were orbiting Belgaroth, Tregan and Tyrel, the only other notable satellite was a small repair yard that could barely accommodate an Imperial-class Star Destroyer."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Six hundred years before the rise of the Galactic Empire, Belgaroth was discovered and colonized by a pair of freelance explorers. After naming the world, Belgar Overlord and Roth Skimm worked hard to turn it into a bustling way station and commerce point. During the Clone Wars, a Republic Czerka Arms factory was located on the planet. Its staff secretly made illegal chemical weapons for the InterGalactic Banking Clan and their Separatist clients. The operation was exposed by a team of clone trooper scouts, most of whom died attempting to deliver this information to the Republic. The single survivor, Marrt, destroyed the factory and then relayed the information he had gathered, and two senators were implicated in the double-dealings."}, {"tag": "p", "text": "During the Imperial Period, the planet environment was devastated. When the Empire took power, the Naval Department decided it required an unimportant world on which to test weaponry and to conduct training maneuvers, Belgaroth was the world chosen."}, {"tag": "p", "text": "After the Battle of Endor in 4 ABY, Belgaroth became the main fortress world of the Zero Command, an Imperial faction established by Lord High Admiral Blitzer Harrsk. Harrsk was forced to abandon the part of the Zero Command in the Core Worlds, including Belgaroth, and flee to the Deep Core when the New Republic fleet moved to Belgaroth in 5 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Belgaroth was created by author John Terra for the book Coruscant and the Core Worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}