{"url": "Vader%27s_armor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles with conflicting sources", "Category:Belts", "Category:Cybernetics", "Category:Eyewear", "Category:Footwear", "Category:Gloves", "Category:Headgear", "Category:Sith weapons", "Category:Survival gear"], "nodes": [{"tag": "h1", "text": "Vader's armor"}, {"tag": "p", "text": "Vader's armor was a suit of cybernetic armor worn by the Sith Lord Darth Vader. He was encased in the armor as a result of grave injuries he sustained in a lightsaber duel with Jedi Master Obi-Wan Kenobi on Mustafar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The armor's belt and chest plate held the controls for the life support system, ensuring that Darth Vader's body received enough oxygen, nutrients, and medicine; through this system, Vader could endure nearly any environment, including the vacuum of space. The suit could also withstand technopathy from Eternal Rur. In addition to its life-support functions, the Sith Lord's helmet contributed to giving him a frightening appearance, and could be removed to use a feeding tube in his private chamber due to his inability to eat normally. The helmet created Vader's menacing growl due to his natural voice being very weak from vocal-cord damage, and contained neural needles that painfully connected with the top of Vader's skull and spine, to form one interconnected unit. Without these, Vader could not use his artificial limbs. The armor had ten protective layers, each one was made of very strong alloy that could protect Vader from some explosions and weapons. Vader had four artificial limbs as a result of his injuries on Mustafar and at the hand of Dooku on Geonosis. The armor's boots featured magnetic clamps, which could magnetically adhere the suit to a metallic surface. He weighed 120 kilograms in his armor, and was 2.03 meters tall in it. The armor also featured a remote to prep Vader's interceptor for combat. In the event of damage to one set of armor, Vader had a backup set which he kept in his quarters on-board whatever vessel he happened to be traveling in at the time. This proved useful when he was attacked by unusual insects on Batuu, which encased much of his armor in stone."}, {"tag": "p", "text": "Although Vader considered his armor acceptable, it was described as \"junk\" by the leader of the Droid Crush Pirates of Bestoon, who had been promised it contained advanced technology by Ochi of Bestoon. Despite Vader's reputation as the Galactic Empire's greatest weapon, a scan of his armor revealed to the droid captain that Vader was made of standard components, such as life support, a fusion furnace and a respirator. A further scan revealed the suit's components were no more advanced than the droids' own parts."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Vision to Skywalker"}, {"tag": "p", "text": "During the Clone Wars, Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano accidentally discovered the Mortis monolith, a gateway to another planet, while answering an ancient Jedi distress code. The trio then entered the world of Mortis, where they met a family of Force wielders: the Father, the Daughter, and the Son. The Father had called Skywalker to the planet, believing him to be the prophesied Chosen One. The family then put Skywalker through a series of trials, to test whether or not he was the Chosen One."}, {"tag": "p", "text": "During a confrontation between Skywalker and the Son, the Son offered to show Skywalker a vision of the future. During the vision, Anakin saw his wife in distress, the deaths of many Jedi, the evasive Darth Sidious unleashing his full power, his duel with Kenobi, and the destruction of Alderaan. The vision concluded with a ghostly image of Anakin's future cybernetic helmet. Each of these apparitions would prove to come true."}, {"tag": "h3", "text": "Rebuilding Darth Vader"}, {"tag": "p", "text": "After his fall to the dark side of the Force and new beginning as Darth Vader, Anakin was sent to the planet Mustafar, where he murdered the entire Separatist Council, ending the Clone Wars. In the aftermath of the slaughter, Vader dueled his former Jedi Master, Obi-Wan Kenobi. Vader lost the fight after having both legs and his left arm severed by Kenobi. Vader then tumbled down the volcanic planet's surface, near a river of lava, where his robes burst into flames, consuming his entire body. Kenobi left his former apprentice for dead."}, {"tag": "p", "text": "Unbeknownst to Kenobi, Vader's new Sith Master, Darth Sidious, would soon arrive to his apprentice's aide. Sidious ordered the scientist Cylo to create Vader's suit, which he did obediently in a long night of reconstructive surgery. Vader was shuttled to the Grand Republic Medical Facility on the planet Coruscant, capital of the newly formed Galactic Empire. A DD-13 medical assistant droid fitted him with cybernetic implants while a 2-1B-series medical droid picked away any remaining chars of clothing and flesh from the Dark Lord's body. An FX-9 medical droid supplied Vader with blood transfusions during the surgery. Vader required a permanent breathing apparatus, a result of his encounter with the flames, altering his voice into a deep growl."}, {"tag": "h3", "text": "Living with the suit"}, {"tag": "p", "text": "Darth Vader wore the armor for over two decades, until his redemption and death. He initially hated the armor, but after living with it for five years, he embraced how it isolated him from the rest of the galaxy, allowing him to concentrate on becoming a pure instrument of the dark side."}, {"tag": "p", "text": "Three years prior to the Battle of Yavin, Vader engaged in a duel against his former apprentice, Ahsoka Tano, inside the Malachor Sith temple. During the duel, Vader's helmet suffered considerable damage, disabling Vader's vocal modulator and exposing his right eye. Vader eventually stumbled out of the temple alive, albeit exhausted and short of breath."}, {"tag": "p", "text": "Vader had at least one backup suit of armor, which was onboard the Chimaera when Vader and Grand Admiral Thrawn went on a mission to Batuu."}, {"tag": "p", "text": "Prior to the Battle of Scarif, he spent some time in a bacta tank in his castle on Mustafar before donning the suit again to meet Director Orson Krennic."}, {"tag": "p", "text": "Shortly after the Battle of Hoth, Vader dueled his son, Luke Skywalker, aboard Cloud City, a mining city floating within the clouds of Bespin. Skywalker caused minor damage to his father's suit after slashing him on the shoulder. Vader retaliated by severing his son's right hand. The two did not meet again until the Battle of Endor six months later."}, {"tag": "p", "text": "Aboard the second Death Star, Vader dueled Skywalker for the last time while in the presence of the Galactic Emperor, Darth Sidious. Towards the end of the duel, Skywalker retreated to a hiding spot and refused to fight anymore. To bring Skywalker out of hiding, Vader taunted him by threatening to corrupt Skywalker's sister, Leia Organa. Succumbing to his rage, Skywalker burst from his hiding place and viciously attacked Vader, beating him down and, in the final blow of the duel, cutting off Vader's right hand. Delighted, the Emperor exhorted Luke to complete his acceptance of the dark side by killing the defenseless Darth Vader and taking his place. Despite his fury, Skywalker had an epiphany when he saw the damaged stump of Vader's right forearm, reminding him of his own mechanical right hand. Realizing he had already begun the descent to the dark side, Skywalker chose to ignore his rage and relented, showing Darth Vader mercy. Angered at the loss of a potential Sith, the Emperor tortured Skywalker with Force lightning, before eventually deciding to kill him. Unable to bear the sight of his son suffering, Vader betrayed his master by throwing him down a reactor shaft, effectively killing Sidious. During the conflict, the suit was critically damaged by the lightning. No longer Darth Vader, the redeemed Jedi re-embraced his former identity, Anakin Skywalker, and died just before Luke escaped the destruction of the second Death Star with his father's armor. Upon landing on the forest moon of Endor, Luke burned the armor in a funeral pyre."}, {"tag": "h3", "text": "Post-destruction"}, {"tag": "p", "text": "The disfigured helmet of the infamous suit was scavenged from the funeral pyre, and eventually found its way into the possession of Vader's grandson, Kylo Ren, a Force-sensitive dark side practitioner of the First Order. Ren kept the helmet in his private quarters aboard the Resurgent-class Star Destroyer Finalizer, where he spoke with it whenever he felt the \"pull to the light.\" Ren was unable to hear anything from the helmet itself, though he did hear a voice when meditating near it. The entity with whom he communicated was not Vader, but rather the revived Sith Master Darth Sidious. Following the Battle of Starkiller Base in 34 ABY, the mask remained on the Finalizer, although Ren was reluctant to visit the mask until after he was certain he matched up to Vader upon Snoke's reprimand of him shortly after Starkiller Base's destruction."}, {"tag": "p", "text": "By 35 ABY, the helmet was transferred to the Star Destroyer Steadfast. It was found by the Jedi Rey while she searched for the Wookiee Chewbacca's belongings, which had been confiscated by First Order stormtroopers. Vader's charred helmet rested upon an obsidian pillar within Ren's suite on board the vessel in orbit of Kijimi, and was disturbed when the pillar was shattered by Rey's lightsaber during her duel with Ren. It was transported from the Steadfast to Ren's location in Kijimi City due to their bond as a dyad in the Force, revealing Rey's physical location to Ren."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Vader's armor was designed by Ralph McQuarrie, who deemed it necessary for Vader to wear a breathing mask after reading the portion of the Star Wars script stating he would cross through space between ships. George Lucas subsequently created the backstory that Vader needed the suit and mask after falling into a volcanic pit during his duel with Kenobi."}, {"tag": "p", "text": "Costume designer John Mollo made one suit for actor David Prowse to wear, which was produced on a budget of $1,173. Brian Muir sculpted the mask. Mollo was inspired by McQuarrie's artwork, but was also influenced by samurai armor, as well as the World War I–era trench armor and Stahlhelm helmet."}, {"tag": "p", "text": "For The Empire Strikes Back, the suit was redesigned to be more comfortable, with spares for looser parts of the costumes. The helmet had minor changes to fix the domed top more securely, and the triangular chin vent was made larger so Prowse could breathe and see more easily. A helmet made of tinted acrylic was made for Prowse's stunt double Bob Anderson to see through more than just the eyepieces. The costume was barely altered for Return of the Jedi, although Fred Hole and Brian Archer designed and built a new helmet for the unmasking scene."}, {"tag": "p", "text": "Anakin Skywalker's portrayer Hayden Christensen wore the suit for the conclusion of Revenge of the Sith: molds of him were used to create the latest version of the armor by Don Bies and his team. Ryan Church designed the interior of Vader's helmet, which was shown in the film for the first time. The mask was digitally printed and so became the first symmetrical version."}, {"tag": "p", "text": "The suit's voice was provided by James Earl Jones, while Ben Burtt provided its infamous breathing sound by recording himself using a scuba-diving apparatus. Burtt also worked to make sure Jones's voice sounded like it was reverberating out of a helmet."}, {"tag": "p", "text": "Star Wars Rebels art director Kilian Plunkett said they could not experiment too much with Darth Vader's appearance, and that even the helmet hearkened back to McQuarrie's version. Dave Filoni said Vader \"has to have the cape,\" a costly simulation that meant other characters had to be redesigned with form-fitting outfits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}