{"url": "Valahari/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:D'Astan sector planets"], "nodes": [{"tag": "h1", "text": "Valahari"}, {"tag": "p", "text": "Valahari was an Outer Rim planet that claimed neutrality in the Clone Wars, but gave newer and advanced ships to the Confederacy of Independent Systems that gave the CIS an advantage over the Galactic Republic."}, {"tag": "p", "text": "The people of Valahari had a strong reputation for being some of the best starfighter engineers in the galaxy."}, {"tag": "h2", "text": "Geology, geography, flora & fauna"}, {"tag": "p", "text": "Valahari's landscape included mountains, rivers, and canyons. In 22 BBY, Anakin Skywalker engaged in a podrace with Tofen Vane through a canyon. Valahari's plant life included dense groupings of trees."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Obi-Wan Kenobi visited the planet during his apprenticeship under Qui-Gon Jinn. During that time, he became acquainted with the House of Vane. At least ten years later, Kenobi revisited the planet along with fellow Jedi Knight Anakin Skywalker on a diplomatic mission to try to convince the planet to stop aiding the Separatists through their continued manufacture of advanced starfighters. Count Dooku attended the discussion over dinner, providing counterpoints to the Jedi's accusations against the Confederacy. Harko Vane, the Viscount of Valahari, declined to take the Republic's side in the Clone Wars. As a result, the Republic blockaded the planet."}, {"tag": "p", "text": "When several unarmed ships attempted to leave Valahari, Kenobi warned Vane that if the ships continued any further, they would be disabled and boarded. Before either side could make a move, Vane's ship exploded as a result of prior sabotage by Asajj Ventress. Although flight recorders proved that the explosion was not a result of Republic aggression, the Republic information was not considered trustworthy. This event caused the outraged populace of Valahari to side with the Confederacy."}, {"tag": "p", "text": "Tofen Vane, son of Harko Vane, created a starfighter squadron called Tofen's Raiders to openly fight the Republic. Later, the Republic and Valahari fought one another in the Battle of the Hexus system. Both sides suffered heavy casualties, forcing Valahari to retreat."}, {"tag": "p", "text": "Later, the Republic fought Valahari one final time in the Battle of the Veil Nebula. The Republic attacked the Veil Nebula after it was discovered that the Veil Nebula harbored Harko Station, a space station that served as headquarters for Tofen and his squad. The two sides fought again, and the battle resulted in Tofen's death and the destruction of Harko's Station. Later, Elodore Vane exiled Count Dooku from Valahari, and announced that Valahari would no longer support either side in the conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}