{"url": "Val", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Humans", "Category:Sharpshooters and snipers", "Category:Tobias Beckett's crew members"], "nodes": [{"tag": "h1", "text": "Val"}, {"tag": "p", "text": "Val was a female human criminal who worked with fellow outlaw Tobias Beckett during the reign of the Galactic Empire. Val was a no-nonsense and occasionally prickly woman who was a crack shot with a blaster rifle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Val was highly secretive about her past, including her full name. All that was known about her past was that she grew up on Solarine and her father was a musician, and she was named after the valachord musical instrument."}, {"tag": "p", "text": "By the reign of the Galactic Empire, Val was already working with the scoundrel Tobias Beckett and the Ardennian pilot Rio Durant. They formed a crew which carried out risky though profitable heists. She and Beckett, in addition, shared a romantic relationship."}, {"tag": "h3", "text": "Meeting with Han Solo"}, {"tag": "p", "text": "Ten years before the Battle of Yavin, during a war on Mimban, Val infiltrated the Mimban Stormtrooper troops along with Beckett and Durant. There, they met the young Han Solo, who wanted to join them as part of their crew. Val didn't agree in letting Solo join them, but Beckett decided to give the boy an opportunity by leading him to be locked for insubordination. Solo was ultimately able to escape with the Wookiee Chewbacca, who was initially intended to devour them, so Beckett decided to let them join his crew."}, {"tag": "p", "text": "Once they arrived at Vandor, Beckett's crew spied the 20-T Railcrawler conveyex transport that they had been planning to steal in order to acquire its Coaxium cargo to pay Beckett's debt with the crime lord Dryden Vos, leader of Crimson Dawn. As the crew spied, they wished for the absence of Enfys Nest and the Cloud-Riders the next day. That night, before sleeping with the campfire they had made, Val kissed Beckett while they told about what they planned to do with their share from the heist."}, {"tag": "h3", "text": "The Conveyex heist and death"}, {"tag": "p", "text": "The next morning, while Beckett, Solo, and Chewbacca managed to take possession of the cargo wagon by getting rid of range troopers and separating some of the cars, Val prepared to detonate a bridge to allow the crew's stolen AT hauler to lift one of the Conveyex cars away as the rest of the train fell into a ravine."}, {"tag": "p", "text": "Unfortunately, Nest and the Cloud-Riders appeared on scene to steal the coaxium from Beckett's hands, managing to fatally wound Rio as he piloted the hauler. As Solo fought to gain control of the ship, a security sensor was tripped, alerting several viper probe droids. Though Val managed to take out some of the droids, she found herself pinned, realizing that the Conveyex was getting too close to allow time to abandon her position to join the others. Communicating with Beckett about the change of plans, she told Beckett that she loved him and subsequently detonated the bomb, blowing herself up and destroying the bridge."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Ultimately, Val's sacrifice was in vain as Solo was forced to let the cargo go in order to save Beckett, Chewie, and himself from certain death. Once all had finished, Beckett punched Solo in the face because of Val's death and their failure in acquiring the Coaxium. Later on, while visiting Vos with the empty hands, Vos expressed his condolences to Beckett for Val's death before threatening him for his failure."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Val was portrayed by Thandiwe Newton in the 2018 Star Wars Anthology film Solo: A Star Wars Story. Newton's casting in the film was first announced on February 21, 2017. Her name was revealed with a set of promotional images sent out to various news websites alongside the teaser trailer."}, {"tag": "p", "text": "In the DVD commentary of Solo, Newton revealed her thoughts about Val's backstory which she discussed with the filmmakers, stating that she likes to feel that Tobias Beckett saved Val from a dangerous situation at some point and that it was perilous for him to do that, earning Val's gratitude and loyalty in the process."}, {"tag": "p", "text": "The look of Val was inspired by pictures of female members of the Viet Cong and Black Panther Party, along with civil rights activist Angela Davis. Screenwriter Jon Kasdan expressed regret of having Val killed off early in the film, saying that Newton's acting was quite good and it would have been interesting having her playing a larger role in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}