{"url": "Vakbeor-class_cargo_frigate", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Frigate classes", "Category:Kuat Drive Yards products", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "Vakbeor-class cargo frigate"}, {"tag": "p", "text": "The Vakbeor-class cargo frigate, also known as the Resistance Cargo Frigate, was a type of hybrid cargo frigate design manufactured by Kuat Drive Yards. They were used by the Resistance navy during its conflict with the First Order."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Vakbeor-class was envisioned a combination of basic anti-pirate defenses with an extensive cargo capacity. Its light armament was made up of four laser cannons; it also boasted two tractor beam projectors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the bankruptcy of Gallofree Yards, Inc., the Galactic Empire engineered the company's takeover by Kuat Drive Yards. KDY coupled existing Gallofree designs with elements of its own Nebulon frigate line to create the Vakbeor-class. The new design would fare poorly on the galactic starship market, with many of them being dumped on the secondary market. Despite its initial role as an anti-pirate freighter, it became popular with pirate bands."}, {"tag": "p", "text": "One ship, the Vigil, was used by pirates until it was captured by the Resistance, a New Republic-sponsored paramilitary group, in a battle off the Chadrison Shoals. The Vigil participated in the evacuation of D'Qar and the attack on the Resistance fleet where it was subsequently destroyed by a barrage of fire from First Order starships."}, {"tag": "p", "text": "During the mission to Batuu, several Vakbeor-class cargo frigates were part of a fleet that engaged First Order Star Destroyers above Batuu in a large space battle. One cargo frigate broadsided a Star Destroyer where Resistance recruits were attempting to escape, but was soon destroyed by a barrage of laser fire from the Star Destroyer."}, {"tag": "p", "text": "In 35 ABY, Vakbeor-class cargo frigates were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vakbeor-class cargo frigate appears in the 2017 Star Wars saga film Star Wars: Episode VIII The Last Jedi. According to Jason Fry, the vessel's class was named after the micro-animal Tardigrade, or vac-bear, which his son fell in love with as a child."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}