{"url": "Valarian_Syndicate", "categories": ["Category:Legends articles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Valarian Syndicate"}, {"tag": "p", "text": "The Valarian Syndicate, also known simply as the Valarians, was a criminal organization created by Lady Valarian. It strongly rivaled Jabba Desilijic Tiure's criminal empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Valarian Syndicate was formed on Tatooine by the Whiphid crime lord known as Lady Valarian. Her goal was to develop a powerful criminal empire throughout the Outer Rim Territories. However, due to Jabba the Hutt's grip in most illegal activities, she admitted she had to destroy first Jabba's criminal organization in order to achieve her objective. Thus, Lady Valarian was one of the few crime lords who openly defied Jabba the Hutt and she proclaimed herself as Jabba's chief rival on Tatooine."}, {"tag": "p", "text": "Beyond Jabba the Hutt's criminal empire, Lady Valarian's organization was known to have hostile relationships with the Black Sun. However, it was closely associated with Talon Karrde's Smuggler Alliance."}, {"tag": "p", "text": "Valarian pilots were very present in a region of space in the Tatoo system known as Valarian Sun. They flew M12-L Kimogila heavy fighters as their primary starfighter. Beyond Tatooine, Valarians were also active in the Dantooine, Karthakk and Yavin systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, the Valarian gang had a smuggling depot near Bestine. Circa 1 ABY, it was infiltrated by a Rebel spacer to retrieve an RX-8 modulator from the leg of an AT-AT for Droma Ordo. Around the same time, Imperial Commander Barrezz and Rebel Captain Bastra dispatched agents to the depot in order to search for an important cargo smuggled earlier from Tansarii Point Station."}, {"tag": "p", "text": "Later Reelo Baruk hired a spacer to eliminate Valarian soldiers who were skulking around Jabba's Palace and other Valarians who were buying up gambling debts to Jabba. In the meantime, Jabba's cook, Porcellus, hired a spacer to steal several bottles of Corellian Merlot from Valarian pirates, who stole the shipment soon before. Barada, Jabba's chief mechanic, then investigated the Valarian Pod Racers Bunker because he suspected the Valarian podracer pilots to cheat. He eventually ordered the assassination of Doane Watki, the podracer champion of the Valarian gang. Meanwhile, Valarian hackers' bunker near Wayfar was attacked by Bib Fortuna's henchmen because a Sennex spy known as Romo Vax claimed they had stolen information belonging to Jabba."}, {"tag": "p", "text": "Lady Valarian eventually assembled a team of off-world specialists in order to compete with Jabba's criminal empire and possibly assassinate the Hutt. It was made of the spice trading specialist Delrice Capreese, the weaponsmith Arkahn Greystar, the slicer Iris Tanada Sinclair, the  warlord Careem, the tactician Fnast Drexler, and the assassin Emanon. However, the Hutt crime lord discovered the plot and assassinated Delrice Capreese and Lady Valarian's bodyguard, Tyrok. The other specialists were then killed during Jabba's henchmen assault on the Valarian Strategic Command Bunker."}, {"tag": "p", "text": "Shortly thereafter, the Valarians stole a cargo of droid disciplinary devices from Jabba's supervisor droid EV-9D9. EV-9D9 thus sent a spacer to infiltrate the Valarian Depot to retrieve the stolen cargo. The spacer sliced a binary load lifter to load EV-9D9's cargo in a shuttle, and then killed the shuttle's pilot, Rando M'Kabe. The spacer finally reprogrammed the shuttle for an automated flight to Wayfar where the cargo was retrieved by EV-9D9."}, {"tag": "p", "text": "A short time later, the Valarians dispatched a group of M12-L Kimogila fighters to exfiltrate Jabba the Hutt's fugitive droid R3-B57 from the Tatooine system. However, the mission failed and all ships were destroyed by Jabba's pilots."}, {"tag": "p", "text": "After the Battle of Yavin, Shamdon Kree served as pilot trainer for the Valarians and was a member of the Smuggler Alliance. During the same period of time than all the events mentioned above, Kree dispatched Smuggler Alliance pilots in a series of missions to defend the interests of Lady Valarian's organization. These missions included the destruction of Corsair starfighters in the Karthakk system, elimination of Black Sun aces in the Yavin system, escort of Valarian freighters against Hutt pirates in the Tatoo system, and destruction of an Imperial patrol in the Dantooine system. Secondary missions also included escort of transports in the Karthakk system, hijacking of Imperial transports in the Dantooine system and destruction of Black Sun fighters in the Yavin system."}, {"tag": "p", "text": "After the death of Jabba in 4 ABY, Lady Valarian finally managed to take the control of all Jabba's operations in and around Mos Eisley."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Valarian gang appeared in the video game Star Wars Galaxies, prior to its closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}