{"url": "Belia_Darzu%27s_fortress", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Fortresses", "Category:Locations of the Sith", "Category:Tython locations"], "nodes": [{"tag": "h1", "text": "Belia Darzu's fortress"}, {"tag": "p", "text": "On the Deep Core planet of Tython, a hidden fortress was constructed by Belia Darzu, a Dark Lord of the Sith who lived during the New Sith Wars. A square-shaped structure made from black durasteel, the stronghold contained several laboratories where Darzu experimented with Sith alchemy. As a military facility, the fortress featured numerous barracks that housed an army of Sithspawn creatures called technobeasts. Beneath the stronghold was a large underground chamber containing the personal holocron of Belia Darzu. Following the death of Lord Darzu, the fortress remained intact for over two centuries in the absence of its creator."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Constructed on the Deep Core planet of Tython, the fortress of Belia Darzu was a square-shaped building measuring 150 meters on each side. Made from black durasteel and used primarily as a military base, the stronghold was surrounded by a thirty-meter high wall. At the front of the fortress were two towers erected ten meters up from the corners of the exterior wall. Each of these towers harbored an ion cannon operated by an automated defense system. Located on the front exterior wall was the fortress's entrance, consisting of a twenty-meter wide gate with no visible handles, hinges, nor a control panel."}, {"tag": "p", "text": "The entrance of the fortress led into a long hallway, providing access to the rest of the installation. As a military base, the stronghold's interior mainly consisted of numerous barracks and mess halls. Further into the structure, however, were a number of laboratories containing a range of equipment and apparatus for Belia Darzu's alchemical experiments. Inside some of these labs were sealed beakers resting on top of long metal tables, as well as glass piping lined along the walls. Some rooms contained specimen bottles holding the brains and hearts from a dozen different species, while other labs held notes and sketches following Darzu's research."}, {"tag": "p", "text": "Towards the back of the structure—beyond the laboratories—was a narrow stairway leading into a separate underground level of the fortress. Within this lower level, a long hallway led towards the inner sanctum of Belia Darzu, accessible through a small wooden door. The inner sanctum consisted of a chamber that was around fifty meters long and twenty meters wide, featuring a pedestal in the center of the room holding the holocron of Belia Darzu."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Sictis Wars"}, {"tag": "p", "text": "At some point before the end of 1230 BBY, the fortress was constructed by Belia Darzu, a Dark Lord of the Sith who rose to power in 1250 BBY during the New Sith Wars. Choosing the Deep Core world of Tython for the location of the stronghold, Lord Darzu drew upon the power of the dark side that had since become infused into the planet. Within her fortress, the Dark Lord researched the art of Sith alchemy and a Force technique called mechu-deru, using her knowledge to create Sithspawn creatures known as technobeasts. Details regarding Sith alchemy, mechu-deru and various other topics were recorded in Darzu's personal holocron, a device that was stored in the underground inner sanctum of the fortress. The stronghold served as a barracks, housing the Dark Lord's technobeast army—the Metanecrons—that was unleashed against the Galactic Republic and Jedi Order during the Sictis Wars. This campaign ended in 1230 BBY when Darzu was assassinated on Tython by the Mecrosa Order, though the fortress nonetheless remained intact and operational for over two centuries after her death."}, {"tag": "h3", "text": "Abandonment"}, {"tag": "p", "text": "In the aftermath of Darzu's fall, the remaining technobeasts continued to inhabit the stronghold and wander its halls. The fortress was otherwise devoid of any lifeforms, lacking even insects or other types of vermin. The holocron of Belia Darzu radiated with dark side energy, causing its power to flow throughout the entire fortress. Attracted by this power, all of the surviving technobeasts made their way towards Belia's inner sanctum, congregating around the holocron."}, {"tag": "p", "text": "By 990 BBY, the location of Darzu's fortress had been uncovered by Hetton, a nobleman and a collector of Sith artifacts. This information was eventually divulged to Darth Bane, a survivor of the New Sith Wars who infiltrated Darzu's fortress with hopes of finding her holocron. In his attempt to seize the device, Bane was attacked by the remaining technobeasts that lingered within the inner sanctum, forcing him to destroy the creatures. Shortly after Bane retrieved the holocron, he and his apprentice, Darth Zannah, barricaded themselves inside the fortress as they were pursued by a group of five Jedi—Valenthyne Farfalla, Johun Othone, Raskta Lsu, Sarro Xaj, and Worror Dowmat. A lightsaber duel ensued between the group, during which Bane and Zannah managed to kill all five of the Jedi Knights and Masters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The fortress of Belia Darzu first appeared in the novel Darth Bane: Rule of Two, the second volume of the Darth Bane Trilogy. In The Essential Guide to Warfare, an illustration by artist Chris Scalf depicted the fortress's interior."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}