{"url": "Valeria", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance Military officers", "Category:Blue Squadron personnel", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Valeria"}, {"tag": "p", "text": "Valeria was a legendary hero of the Alliance to Restore the Republic who served as a lieutenant and led Blue Squadron during the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Valeria first appeared as a supporting character in four of the five short clips released on the LEGO Star Wars website on May 4, 2017 to promote the second season of LEGO Star Wars: The Freemaker Adventures. She is voiced by Yvette Nicole Brown."}, {"tag": "h3", "text": "Biography"}, {"tag": "h4", "text": "Meeting the Freemakers"}, {"tag": "p", "text": "Valeria was a starfighter pilot in the Alliance Fleet who held the rank of lieutenant in the period between the Battle of Hoth and the Battle of Endor. At the time that Admiral Ackbar made contact with the Freemakers, Valeria was flying a U-wing starfighter. Since her starfighter lacked a Type A vector coil, Valeria was unable to steer her ship and crashed the U-wing into the MC80A Home One Type Heavy Star Cruiser Home One's hangar. When Valeria chastised the ground crew team member, he replied that the rebels had no more vector coils to spare. As a result, the Freemakers led by Kordi Freemaker traveled across the galaxy and managed to obtain a Type A vector coil after bartering with several people."}, {"tag": "p", "text": "After an Imperial Star Destroyer discovered the Home One, Valeria led Blue Squadron's assault against the Star Destroyer but were unable to pierce through its deflector shields. Blue Squadron began to take casualties until the Freemakers' B1-series battle droid Roger accidentally catapulted himself into space and knocked out the deflector shield generator. This enabled the Home One and Blue Squadron to destroy the Star Destroyer and its TIE fighter escorts."}, {"tag": "h4", "text": "Assault on Strike Station Aurek"}, {"tag": "p", "text": "Later, Lieutenant Valeria chaired a meeting to plan Blue Squadron's assault on the Imperial Strike Station Aurek. Her plan involved dropping a proton torpedo into a Thermal exhaust port, a feat which had been first deployed by Luke Skywalker during the Battle of Yavin. Rowan Freemaker and Roger accidentally damaged Blue Squadron's starfighters. While Kordi and Zander Freemaker distracted Valeria, Rowan and Roger repaired the starfighters with the former using his Force powers. However, Roger accidentally built himself into Valeria's Y-wing starfighter's astromech socket."}, {"tag": "p", "text": "By the time that Valeria had managed to blast through an S-foil which Kordi and Zander had used to obstruct her and her squadron's path, Rowan and Roger had finished rebuilding the starfighters. Valeria entered the cockpit of her Y-wing while Rowan was struggling to free Roger. Without noticing the two, Valeria took her starfighter into space. Valeria led the assault on Strike Station Aurek while Rowan and Roger did their best to guard her flank from TIE fighters. As Valeria approached the thermal exhaust port, Rowan used the Force to deploy the proton torpedo. Strike Station Aurek was destroyed and Valeria complimented her gunner and astromech droid, not realizing they were Rowan and Roger. After returning to the Home One, Rowan and Roger cut themselves out of the Y-wing. Valeria then praised her co-pilot and astromech droid, who expressed bemusement at being left behind."}, {"tag": "h4", "text": "Working with Zander"}, {"tag": "p", "text": "Later, Zander Freemaker attempted to convince Valeria to let him join her squadron. However, Valeria turned down his offer because his starship Blazemaker Mark II lacked blasters. Shortly later, Valeria and Blue Squadron were deployed to meet an Imperial counter-attack. Blue Squadron soon found itself outnumbered and outgunned by numerous TIE fighters and TIE interceptors. Fortunately for them, Zander came to the rescue in the Blazemaker, which was heavily laden with several laser cannons and a giant magma cannon. Zander destroyed several Imperial fighters, turning the tide of the dogfight. Valeria remarked that his ship was messy but effective and complimented Zander for creating an opening. Before Zander could destroy the remaining three stragglers, the Blazemaker Mark II exploded since it was heavily loaded with weapons. Zander survived and was flung against the Home One's command bridge."}, {"tag": "p", "text": "Sometime later, as the Freemakers were repairing the Alliance fleet's starfighters, they were attacked by two Imperial Star Destroyers. Valeria led Blue Squadron into battle to clear a path for the fleet to escape into hyperspace. Despite her successful strategy, Valeria's A-wing and the other rebel starfighters sustained damage. While Zander was annoyed due to a shortage of spareparts, Valeria retorted that he could fix it because he was \"Zander Freemaker, Superstar Pilot Guy.\" The Freemakers and the Mon Calamari starship builder Quarrie subsequently embarked on a salvage run on the planet Tibalt."}, {"tag": "p", "text": "Later, Valeria was present while Zander repaired Grayson's X-wing starfighter. While Grayson thought the ship belonged on the scrap heap, Valeria advised patience. Zander managed to extract a cracked coolant compensator and reassured Grayson that the ship would fly. Valeria then praised Zander, who was distracted by his little brother Rowan. After Rowan had left, Zander asked Valeria if he could join her squadron but she replied that he was better off as a mechanic."}, {"tag": "h4", "text": "Dawn of the Arrowhead"}, {"tag": "p", "text": "When the Imperial Navy tracked down the Alliance fleet, Valeria took part in the starfighter battle. Due to her skills as a pilot, Quarrie enlisted her services in flying the Arrowhead to the desert planet of Jakku for a test flight. After the Arrowhead blew up upon landing and its energy matrix activator fell into the hands of the Imperial officers Durpin and Plumestriker, Valeria helped the Freemakers recover the energy matrix activator by knocking out the two Imperial officers."}, {"tag": "p", "text": "When the Imperials pursued them in an AT-ST walker, Valeria exchanged fire with them. The AT-ST walker fired a blast which knocked Valeria to the ground. Zander then came to her rescue by flying the Mini Scavenger into the walker. After the Arrowhead was assembled, Valeria allowed Zander to fly the ship since she was exhausted. Valeria accompanied the Freemakers back to the Alliance fleet and watched as they used the Arrowhead to destroy a Star Destroyer, forcing the Empire to retreat."}, {"tag": "h4", "text": "Combat operations"}, {"tag": "p", "text": "Following the launch of the Arrowhead, Lieutenant Valeria led rebel forces and their Wookiee allies including Chief Attabura and Tantarra in combat against Imperial forces on Kashyyyk. Outgunned by an AT-ST walker, the rebels and their Wookiee allies retreated to their Auzituck anti-slaver gunship along the beach. Valeria radioed the Freemakers for help."}, {"tag": "p", "text": "The Freemakers arrived on the Arrowhead and destroyed the AT-ST walker, forcing the scout troopers to retreat. Valeria and her rebel and Wookiee forces attempted to pursue the Imperials but were stopped by the advance of three AT-AT walkers. The Freemakers used the Arrowhead to damage the three walkers, forcing the surviving Imperials to retreat. Valeria complemented the Freemakers for their help as the Arrowhead departed into space."}, {"tag": "p", "text": "After Kordi convinced the Alliance High Command to attack an Imperial fleet docking for repairs near Alzoc 3, Admiral Ackbar tasked Valeria and her Blue Squadron with attacking the repair station in coordination with Zander, who was flying the Arrowhead. The Arrowhead destroyed several Star Destroyers. Though the starship was caught in the tractor beam of Commander Estoc's Star Destroyer Desolator, Valeria managed to free the Arrowhead by taking out the tractor beam projector. This allowed the Arrowhead to destroy the Desolator."}, {"tag": "h4", "text": "Helping the Freemakers"}, {"tag": "p", "text": "Valeria encountered Zander, Kordi, and Roger when they attempted to steal the Arrowhead in order to rescue Rowan Freemaker from the Emperor Palpatine. At Zander's signal, Roger tried to sneak up on Valeria but she dodged him and seized his arm. Realizing that the Freemakers were wanting to launch the Arrowhead in order to rescue Rowan, she took pity on them and told them that she would have done the same. After returning Roger's arm, she told them to say she was never there before letting them proceed on their mission."}, {"tag": "h4", "text": "Battle of Endor"}, {"tag": "p", "text": "Prior to the Battle of Endor, Lieutenant Valeria was contacted by the Freemakers, who had traveled to Sullust to rendezvous with the rebel fleet. Though, Valeria was reluctant to speak with them since she could face a court martial, she informed them that the rebels were heading to the Endor system to attack the second Death Star. The Freemakers tried to warn Valeria that the station was fully operational but their message was lost in the static of space."}, {"tag": "p", "text": "After the Freemakers managed to board the second Death Star and escape their prison cell, Kordi contacted Valeria to inform them off their location. Valeria informed then that Admiral Ackbar had ordered them to enter the Death Star and told the Freemakers to flee."}, {"tag": "p", "text": "Following the Battle of Endor, Valeria joined the Freemakers and Quarrie at the rebel celebrations in Bright Tree Village. Quarrie suggsted that the X-wing's design could do with some tweaking."}, {"tag": "h3", "text": "Personality and traits"}, {"tag": "p", "text": "Valeria was a female human Rebel Alliance starfighter pilot with dark skin and black hair. She was able to pilot several different starfighters including U-wings, Y-wings, and A-wings. She was a good leader who coordinated strikes and dogfights against the Empire. Valeria appreciated the Freemakers for their efforts to obtain a Type A vector coil for her U-wing. Valeria used her knowledge of rebel tactics and the history of the Battle of Yavin to destroy the Imperial Strike Station Aurek. However, she was too enthusiastic to notice that Rowan and Roger were aboard her Y-wing Valeria appreciated Zander's enthusiasm to join Blue Squadron but turned him down because his starfighter Blazemaker II lacked blasters. Valeria relented after Zander refitted his starfighter with laser cannons and turned the tide of a dogfight."}, {"tag": "p", "text": "After expressing doubt about the state of the repairs that the Freemakers did to her A-wing, she said that if she exploded, she would at least take Imperial TIEs down with her. Valeria had faith in Zander's mechanical abilities and praised him for savlaging Grayson's X-wings."}, {"tag": "p", "text": "Valeria had a good friendship with the Freemakers, working with them in several adventures on Jakku. Kashyyyk, and at the Imperial repair station near Alzoc III. Valeria was sympathetic to the Freemakers after learning that Rowan Freemaker had been captured by the Empire. She allowed them to \"steal\" the Arrowhead so that they could travel to Coruscant and rescue their brother."}, {"tag": "h3", "text": "Skills and abilities"}, {"tag": "p", "text": "Valeria was a skilled starfighter pilot, with Quarrie opining that she had chromium nerves and nexu reflexes. In addition, Valeria was skilled at unarmed combat and a competent sniper. Due to her combat skills and reflexes, Valeria was able to protect herself when Roger tried to sneak up on her and knock her out."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Notes and references"}]}