{"url": "Valius_Ying", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bounty hunters", "Category:Males", "Category:Pirates", "Category:Rutian Twi'leks", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Valius Ying"}, {"tag": "p", "text": "Valius Ying was a male Twi'lek pirate who was notorious in the Outer Rim during the Mandalorian Wars. Ying was the captain of the starship Oroko, and headed a crew of several gangsters. Once captured by Galactic Republic Captain Saul Karath, Ying had his operation back up and running by 3964 BBY. That year, Ying, not normally a bounty hunter, joined the potentially lucrative search for runaway Jedi Padawan Zayne Carrick, who was accused of murdering four of his fellow classmates on Taris. Ying and the Oroko soon tracked down Carrick in the Taris asteroid belt, capturing the fugitive along with alleged accomplice Marn Hierogryph and two Arkanian Offshoots, Jarael and Gorman \"Camper\" Vandrayk."}, {"tag": "p", "text": "Hierogryph negotiated for his and the Offshoots' freedom in exchange for the codes to his Taris storehouses, and Ying brought Carrick alone to Taris to turn him over to the Jedi Order. Greeted by a massive throng of onlookers, Ying took Carrick to the five Jedi Masters of the Tarisian Jedi Tower, hoping for a substantial reward. It was there that Ying learned, much to his surprise, that Carrick was not the Padawan killer—the Masters had done the deed and framed Carrick. Although Ying tried to leave, Jedi Master Lucien Draay decided that the Twi'lek knew too much, and slew him with his lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Valius Ying was a notorious Rutian Twi'lek pirate and gangster who was active in the Outer Rim in the era of the Mandalorian Wars. By 3964 BBY, he had become captain of the starship Oroko, with several crew serving under him, and became acquainted with local Snivvian hood Marn Hierogryph. At some point, Ying hired the Ithorian bounty hunters known as the Moomo Brothers for a job, only to fire them because of their incompetence. During his time as a pirate, Ying was captured by Republic Captain Saul Karath on the ship Reciprocity, although he had resumed his operations by 3964 BBY."}, {"tag": "p", "text": "That year, Jedi Padawan Zayne Carrick was accused of the murder of four of his fellow classmates on the planet Taris. Carrick went on the run with the help of Hierogryph, and a large bounty was placed on their heads. Not normally bounty hunters, Ying and the crew of the Oroko joined in on the hunt for Carrick and Hierogryph, eventually finding them in the Taris asteroid belt. The two fugitives were aboard the junk hauler Last Resort, which the Oroko captured with its tractor beam. Along with Carrick and Hierogryph, Ying and the Oroko also brought aboard Jarael and Gorman \"Camper\" Vandrayk, the Arkanian Offshoot owners of The Last Resort. Soon afterward, Ying made a deal with Hierogryph—in exchange for the codes to Hierogryph's Taris storehouses, Ying would tell the authorities that The Last Resort had been destroyed in the asteroid belt, and that he had found Carrick alone in an escape pod. Ying would then allow Hierogryph, Jarael and Camper to go free once they reached Taris."}, {"tag": "p", "text": "When Ying and the Oroko returned to Taris with their \"guests\" in tow, Ying took a shuttle down to Taris's Upper City with Carrick, who was restrained in handcuffs, intending to bring the runaway Padawan to the five Jedi Masters stationed at the local Jedi Tower. Ying and Carrick were greeted by a massive crowd and heavy press coverage—reports on the event were broadcast as far away as the planet Dantooine. Ying paraded Carrick through the throng of spectators to the Tower, where he and his prisoner were scanned for weapons and recording devices before being allowed to meet with the Masters. Ying told the Masters his false story of having found Carrick in a lifepod, but the Miraluka Jedi Q'Anilia immediately saw through the lie. To Ying's surprise, Lucien Draay, Carrick's Master, admitted that Carrick had not actually killed his classmates, but that he was what the Masters wanted all the same. Furious, Carrick and Draay argued, revealing intimate and secret details of the fateful night, and Ying learned that the five Masters had actually killed the Padawans and framed Carrick after he narrowly escaped death at their hands. Disturbed by these revelations, Ying attempted to take his leave and return to his shuttle—however, Draay would not allow Ying to leave knowing what he did. Draay told Ying that the Jedi would be requiring his shuttle, and when Ying protested, Draay quickly slew the Twi'lek gangster with his lightsaber. In the end, Carrick was able to escape his predicament with the help of Hierogryph and the two Offshoots, who came back to save him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A large, imposing blue-skinned, four-fingered Rutian Twi'lek male with lekku covered in rings, Ying was regarded by his acquaintance Marn Hierogryph as an easily confused dimwit. Although not usually a bounty hunter, he joined the hunt for Hierogryph and Zayne Carrick when it became profitable, but was willing to negotiate with his captives once he found them in the Taris asteroid belt. Ying was also willing to lie, even to a group of Jedi Masters, to uphold his end of a bargain. As a bounty hunter, Ying did not particularly care whether Carrick had actually committed the crime he was accused of, doing the job for the money. However, he was extremely surprised and disturbed when he learned the truth behind the Padawan Massacre, and sought to extricate himself from the situation as quickly as possible."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Valius Ying made his first two appearances in Star Wars: Knights of the Old Republic: Commencement Part 5 and Part 6, written by John Jackson Miller and released in 2006. For Ying's design, Miller suggested to artists Brian Ching and Travel Foreman that they create an \"alien Tony Soprano\" who started out full of himself but later found himself in over his head. Miller also noted that Ying was the first \"on-screen\" character death in the Knights of the Old Republic comic series. Ying also made a brief flashback appearance in the later installment Knights of the Old Republic: War 4, released in 2012. Over the course of his three Knights of the Old Republic appearances, Ying was illustrated by three different artists—Travel Foreman, Brian Ching, and Andrea Mutti. In 2008, Ying was given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}