{"url": "Valis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Children of the Emperor", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Valis"}, {"tag": "p", "text": "Valis was a Human male Child of the Emperor, an agent of the Sith Emperor's will. Born during the Great Galactic War between the Galactic Republic and the Sith Empire, and raised at the Sith Academy on the planet Korriban, Valis was a loyal servant of the Emperor. During the tense Cold War, he was ordered to retrieve the former Child Kira Carsen when the Emperor became aware of her continued existence. Posing as the Imperial Admiral Hacklin, Valis lured Carsen, now a Jedi Padawan, and her Master to a mining facility in the Unknown Regions, but his attempt to capture Carsen resulted in a duel that ended with his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born sometime during the Great Galactic War between the Galactic Republic and the Sith Empire, the Human male Valis was taken from his parents as an infant and sent to the planet Korriban, where he was inducted into the Sith Academy. Alongside fellow recruits such as Kira Carsen, Suri, and Tannac, Valis underwent training in the use of the dark side of the Force, and he was taken to see the Sith Emperor on several occasions. By the time he was a teenager, Valis had become a Child of the Emperor, an extension of the Emperor's will, and was imbued with a portion of the Sith ruler's power. However, in 3653 BBY, his fellow Child Carsen escaped from Korriban, as she feared what the Emperor was doing to her mind, and she later joined the Jedi Order."}, {"tag": "p", "text": "In 3643 BBY, the Emperor was alerted to Carsen's continued existence when the former Child was captured by the Sith Lord Darth Angral aboard the Ord Mantell Orbital Station. Carsen escaped her captors with the help of her Master, the former Padawan of Jedi Master Orgus Din, but the Emperor ordered Valis to bring Carsen back to him. Posing as the Imperial Admiral Hacklin, Valis contacted General Var Suthra of the Republic Military and claimed that he wanted to defect—but that he would only do so if he could meet with Carsen, whom Hacklin had met when the girl had been captured by Angral. Valis then took a starship to an asteroid mining facility in the Unknown Regions, the meeting place that Suthra had selected for the defection. Valis disembarked his ship and hid behind several cargo crates in the hangar, watching as Carsen and her Jedi Knight teacher arrived in their ship. When the two Jedi reached his ship, Valis stepped out from his hiding place and greeted the pair."}, {"tag": "p", "text": "Introducing himself and apologizing for using Hacklin's name in his deception, the Sith was recognized by Carsen, and he was amused at how his sibling immediately warned her Master to attack. Valis then informed the Knight of Carsen's true past, warning the former Child that the Emperor wanted her back, and asked her Master to peacefully leave him to settle the matter with Carsen. However, the Knight refused, and Carsen rushed her \"sibling\" to attack him with her double-bladed lightsaber. Valis drew his own lightsaber to his hand and ignited the purple blade in time to block Carsen's strike before throwing her backward with the Force. Carsen's Master then joined her in battling Valis, and the Sith unleashed arcs of violet Force lightning at his opponents as the three dueled back and forth across the hangar. Despite his strength in the Force, however, Valis was unable to overcome the combined strength of Carsen and the Knight, and their duel ended when Valis was struck down by the Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Fair-haired and fair-skinned with brown eyes, Valis was arrogant and confident in his superior strength and power. Despite this, Valis was cultured and polite, and he was perfectly willing to allow the Knight to leave if the Jedi allowed him to take Carsen peacefully—but he would not back down from his mission to retrieve the wayward Child at any costs. Valis took great pride in his status as a Child of the Emperor, and he truly considered the Emperor to be his father."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Trained at the Sith Academy, Valis was strong in the Force and skilled in the use of the dark side. He freely utilized offensive Force powers in combat, making use of telekinesis to throw his opponents across the battlefield as well as energy blasts and Force lightning during his battle with Carsen and the Knight. Valis carried a purple-bladed lightsaber that featured a talon-like ornament on the base of the hilt and three evenly-spaced metal blades attached to the emitter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Valis first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011. Voiced by Nicholas Boulton, Valis is the antagonist in the Jedi Knight class mission \"The Defector,\" which players undertake after completing the class storylines on the planets Taris and Nar Shaddaa. Regardless of the dialogue options taken by the player during the conversation with Valis, the player will be forced to duel the Child, and he will be killed in combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}