{"url": "Valor-class_cruiser", "categories": ["Category:Legends articles", "Category:Galactic Republic starship classes", "Category:Heavy cruiser classes", "Category:Valor-class cruisers"], "nodes": [{"tag": "h1", "text": "Valor-class cruiser"}, {"tag": "p", "text": "The Valor-class cruiser, also known as a D-Class attack cruiser, served in the Republic Navy during the Great Galactic War and the subsequent Cold War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The ship design had a bulbous center section, with gun batteries covering the front, sides and stern, seven thrusters located on a ventral tower and a command tower on the dorsal side. Lining the sides of each ship were several hangars. In addition, at least one hangar was located on the dorsal hull, facing the \"valley\" in the middle of the craft. The Capital Ship followed the Republic color scheme with red stripes on white hulls."}, {"tag": "p", "text": "The ship class served as the heaviest and most powerful warship in the Republic fleet, allowing it to match the Harrower-class dreadnought in terms of size and firepower but it was only armored where needed, allowing it to be faster and more agile than the Harrower. These usually served as flagships of the Republic Fleet in charge of planetary defense against Imperial attacks and hitting Imperial assets across the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several of these ships were involved in fighting during the Great Galactic War, as part of a task force that attacked Korriban. They later saw combat in the following Cold War. Jedi Master Oteg served on board the Telos, flagship of the First Expeditionary Fleet and directed a group of Republic adventurers from the ship during a raid on the Imperial compound of Taral V."}, {"tag": "p", "text": "During the Cold War, the Telos was part of the Republic task force to rescue Jedi Master Revan from the Maelstrom Prison along with a Republic strike team. After Revan's release at least two of these ships were part of the Republic blockade protecting the Foundry from Imperial attack until the Emperor ordered an attack on the space station."}, {"tag": "p", "text": "The Allusis, named after Great Galactic War hero Jedi Master Belth Allusis, was captured by Mandalorian forces. A strike team was created and the ship was boarded by a launched boarding pod from a Thranta-class corvette."}, {"tag": "p", "text": "During the Galactic War, a Valor-class named the Valiant commanded by Admiral Dabrin served as the Republic flagship, being captured by Imperial forces led by Jedi Master Warren Sedoru who had been turned into the Emperor's slave. Along with the knowledge of Republic tactics and fleet positions, the Empire made the Valiant into an unstoppable weapon that could cripple the Republic Fleet. The Jedi Knight along with allies boarded the flagship and defeated the fallen Jedi as well as saving Admiral Dabrin."}, {"tag": "p", "text": "During the renewed conflict between the Sith Empire and the Galactic Republic many Valor-class warships were deployed against the Empire in several battlefields including Corellia, Ilum and in several schisms as well as the Republic redoubled its efforts to defeat the Sith Empire. A number of these warships would also go on to do what was believed impossible by assaulting the Imperial Capital itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}