{"url": "Valley_of_the_Dark_Lords", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Locations of the Sith", "Category:Moraband locations", "Category:Valleys"], "nodes": [{"tag": "h1", "text": "Valley of the Dark Lords"}, {"tag": "p", "text": "The Valley of the Dark Lords was an area of Moraband that contained numerous monuments serving as crypts for deceased Dark Lords of the Sith. The largest monument in the valley housed the tomb of Darth Bane, the founder of the Rule of Two."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ancient times"}, {"tag": "p", "text": "At least six thousand years before the Clone Wars the Schism in the Jedi Order led to a civil war where the Jedi and the newly founded Sith Order, once brothers and sisters in the Force, fought one another for power. The war ended in the defeat of the Sith, who fled from known space. Unbeknownst to the Jedi, however, the Sith settled on Moraband, a world of red sands, where they rebuilt in secret to wait for another chance to strike. As the Sith Order grew, they constructed massive temples and tombs on Moraband in a location known as the Valley of the Dark Lords."}, {"tag": "p", "text": "During a time known as the Dark age, the Jedi-Sith War broke out. The Jedi defeated the infighting Sith, bringing what was left of the dark order to its knees. As it turned out, one Sith, Darth Bane, survived and, later, created the Rule of Two. He was the last Sith Lord to be buried in a sarcophagus in the Valley of the Dark Lords prior to its abandonment."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "In 19 BBY, during the Clone Wars, the Grand Master of the Jedi High Council, Yoda, was sent to Moraband by the Force Priestesses as part of his journey to discover the secrets of eternal consciousness. Once there, he encountered a number of Sith spirits, including that of Darth Bane. As he ventured further into the Valley of the Dark Lords, he encountered visions created by Darth Sidious, the reigning Dark Lord of the Sith, who attempted to corrupt Yoda to help win the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Valley of the Dark Lords made its first appearance in \"Sacrifice,\" an episode in the sixth season of the animated television series Star Wars: The Clone Wars. The valley was heavily based on the one in Star Wars Legends, which first appeared in the 1994 comic book Tales of the Jedi – Dark Lords of the Sith 3."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}