{"url": "Bellan", "categories": ["Category:Canon articles", "Category:Individuals of unidentified species", "Category:Queens"], "nodes": [{"tag": "h1", "text": "Bellan"}, {"tag": "p", "text": "Bellan was the queen of Rendel. After becoming queen, she imprisoned her sister Zalla, thinking she would use her powers to overthrow her. Zalla managed to use her powers to escape, overrunning Rendel with plant life. Bellan fled from the planet, and later hired pilots and smugglers for jobs to Rendel so that they could unknowingly attempt to defeat Zalla."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Childhood"}, {"tag": "p", "text": "Bellan was born on Rendel, and was the sister of Zalla, who, unlike the rest of her species, was gifted with powers. The two sisters had a loving relationship, and Bellan assured Zalla that she didn't mind her being different. Some time later, Bellan became the queen of Rendel. Her attitude toward Zalla changed, and she feared that she would try to overthrow her, imprisoning her sister and treating her like a monster. Zalla was filled with hatred over her sister's betrayal, and waited until she could escape. She managed to do so by using her powers on a seed which had landed in her cell. With that seed, she spread plants across Rendel. Bellan fled, vowing revenge on her sister."}, {"tag": "h3", "text": "Bellan's revenge"}, {"tag": "p", "text": "While in hiding, Bellan hired various smugglers and starship pilots for jobs to Rendel, sending them in an attempt to defeat her sister. Believing Rendel had been cursed, most individuals she approached turned her offer down. Bellan hired the Barbadelan Karamu to deliver a statue to Rendel, but the pilot was unsuccessful and became trapped in Zalla's vines. She later found Han Solo, who was willing to take the deal, thinking he would receive one million credits in return. Bellan gave Solo a statue containing a toxic substance that was able to damage Zalla's plants, and the smuggler took it to Rendel."}, {"tag": "p", "text": "Once on Rendel, Solo was also captured by Zalla, who revealed Bellan's true intentions, informing him that he had been tricked. However, Bellan managed to get her revenge when Solo broke the statue by throwing it at Zalla, letting the substance escape and begin to weaken her powers. Zalla, along with the plants she had created, withered away and died as Solo escaped Rendel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bellan had yellow eyes and orange skin. She had white markings on her face. When she was a child, she and her sister Zalla were friends, despite the fact that Zalla was different. As an adult, however, she feared that Zalla would try to overthrow her and imprisoned her. When Zalla took over the kingdom, Bellan vowed to get revenge on her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bellan first appeared in the flashback section of the 2018 canon comic Star Wars Adventures: Tales from Vader's Castle 3, written by Cavan Scott and illustrated by Corin Howell. Scott originally gave Bellan and Zalla the names Ana and Helza, after Anna and Elsa, the two sister protagonists from Disney's 2013 animated film Frozen, but he later made a note to change the names to something less obvious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}