{"url": "Van-Ith", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Humans", "Category:Males", "Category:Monarchs"], "nodes": [{"tag": "h1", "text": "Van-Ith"}, {"tag": "p", "text": "Van-Ith was a Human male who served as the ruler of Vanqor in the years leading up to the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Separatist Crisis, Van-Ith began an expansionist enterprise of invasion and conquest that led the Vanqor to controlling the entire Uziel system, except for the planet Typha-Dor. The Vanqors dominated Uziel airspace."}, {"tag": "p", "text": "Despite his planet's lack of resources, Van-Ith was able to create a massive amount of power for Vanqor through cunning use of the few resources the planet did have augmented by a skillful conquest of worlds rich with resources—an aggressive enterprise that lay in stark contrast to planets like Typha-Dor and others that had large amounts of resources, but ostensibly no drive to succeed. Under Van-Ith's rule, Vanqor was thus able, through its expansionist policies, to creating booming industries for itself and to achieve a measure of wealth."}, {"tag": "p", "text": "In 25 BBY, Van-Ith ordered an invasion of the neighboring planet of Typha-Dor. Employing an undercover agent by the name of Mezdec, to infiltrate Typha-Dor's TY44 satellite surveillance outpost, Van-Ith moved forward with Vanqor's invasion once Mezdec had delivered a disk containing false invasion plans to Typha-Dor's rulers and military leadership. Van-Ith's plans were foiled, however, by the Jedi, who were able to deliver a disk with Vanqor's true invasion plans to Typha-Dor's rulers. This enabled the threatened planet to launch a preemptive countermeasure to trap Van-Ith's fleet in a satellite-moon corridor through which the Vanqor fleet made its approach, and to force a truce."}, {"tag": "p", "text": "Van-Ith worked with Typha-Dor's \"twin rulers\" Binalu and Talus, and also Obi-Wan Kenobi, Anakin Skywalker, Clee Rhara, Siri Tachi, and the other Jedi sent, to negotiate a ceasefire and an enduring peace between the two worlds."}, {"tag": "h2", "text": "Appearances"}]}