{"url": "Vance_Groten", "categories": ["Category:Legends articles", "Category:Guards", "Category:Humans", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Vance Groten"}, {"tag": "p", "text": "Vance Groten was a Human male who lived in Dee'ja Peak on the planet Naboo during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time of the Battle of Yavin, Vance Groten was the Chief Security Officer at Stonewall Labs before the company closed. His security officers included Kippy Martin and Walker Luskeske. Circa 1 ABY, he met a spacer who was trying to acquire an Old Republic droid module from Stonewall Labs. Vance Groten offered to help the spacer find a security beacon from Stonewall Labs. In exchange, Groten asked the spacer to eliminate groups of Maulers and Naboo pirates, as well as Blot's pack of aggressive feral shaupauts, that threatened Dee'ja Peak. Groten later fixed a Stonewall Labs security beacon acquired by the spacer from Walker Luskeske. As a favor, Vance Groten also asked the spacer to recover a ring that was a family heirloom lost during a sabacc game with Herman Pate. However, Pate had lost the ring to Janelle, a smuggler leader. The spacer was thus forced to fight the smugglers to recover the ring. However, the security beacon was stolen in the meantime by Strehkforce mercenaries. The spacer then attacked their camp and killed their leaders Evan Strehk and Maris Fahrs to recover the security beacon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vance Groten appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Vance Groten was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}