{"url": "Vana_Dorja", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Humans", "Category:Imperial Navy officers of the Imperial Remnant"], "nodes": [{"tag": "h1", "text": "Vana Dorja"}, {"tag": "p", "text": "Vana Dorja was a Human female who served as a commander in the Navy of the Imperial Remnant during the Yuuzhan Vong War. She was an inquisitive and observant woman with a partisan Imperial frame of mind. Her family had a long history of naval service to the Galactic Republic and Galactic Empire, with her father having captained an Imperial Star Destroyer into the era of the Remnant. Although the Remnant's Council of Moffs chose not to participate in the war, Dorja was sent on an allegedly commercial mission to the New Republic's capital planet of Coruscant, where she witnessed the extra-galactic Yuuzhan Vong attack the world in 27 ABY. She escaped before the invaders conquered the capital, and in 28 ABY, she made her way to the New Republic's provisional capital planet of Mon Calamari and requested a ride back to Imperial Space."}, {"tag": "p", "text": "Dorja was shuttled home by Captain Han Solo and the ambassador Leia Organa Solo aboard their freighter, the Millennium Falcon, as the Solos were themselves on a diplomatic mission to the Remnant. Organa Solo suspected that Dorja had been serving as an Imperial spy on Coruscant and was frequently unsettled by the commander's presence, but when the freighter was interdicted from hyperspace by a Yuuzhan Vong dovin basal, Dorja crewed one of the Millennium Falcon's quad laser turrets and helped destroy Yuuzhan Vong coralskipper fighters. Their victory was aided by the arrival of a force of New Republic starfighters, whose leader, Colonel Jagged Fel, came aboard the Millennium Falcon and discussed with Dorja what he thought the Remnant's best interests would be as the Yuuzhan Vong War continued to rage. After Fel departed, the freighter continued to Imperial Space, and Dorja quietly slipped away from the Solos when they landed aboard a Super Star Destroyer at the Remnant's capital of Bastion."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Escape from the capital"}, {"tag": "p", "text": "The Human female Vana Dorja was born around the year 2 BBY. Her father, Captain Dorja, was an officer in the Imperial Navy, continuing their wealthy family's rich tradition of Imperial and Republican military service—the preceding six generations of Dorja men had all been naval officers. Vana Dorja's father became the captain of the Imperial I-class Star Destroyer Relentless before 4 ABY, and he continued to command the warship into the era of the Imperial Remnant. The younger Dorja followed in her father's footsteps and became a commander in the Remnant's Navy."}, {"tag": "p", "text": "In 25 ABY, the extra-galactic Yuuzhan Vong invaded the galaxy. Although the Imperial Remnant's Council of Moffs elected to sit out the war and fortify Imperial Space while the New Republic dealt with the invaders, Dorja was sent to the New Republic's capital world of Coruscant, allegedly to negotiate a commercial treaty and to purchase Ulban droid brains for Imperial hydroponics farms. The negotiations failed due to the fact that the droid brains could also be used for military purposes, and in 27 ABY, during Dorja's extended stay on-world, the Yuuzhan Vong attacked Coruscant. Dorja escaped off-world before the capital was conquered, and in 28 ABY she arrived at the New Republic's provisional capital planet of Mon Calamari and asked for a ride back to Imperial Space. Leia Organa Solo, an ambassador attached to the New Republic, was about to embark on a diplomatic mission to the Remnant and agreed to bring Dorja aboard her husband's freighter, the Millennium Falcon."}, {"tag": "h3", "text": "Hitching a ride"}, {"tag": "p", "text": "Organa Solo was suspicious about Dorja, suspecting that she was a commercial spy who had been on Coruscant to witness its fall. She also believed that Dorja's negotiations had been intended to go nowhere and that her subsequent escape had been planned long in advance. Accordingly, Organa Solo declared certain areas of the Millennium Falcon off-limits to Dorja and scanned the commander for any technological secrets. The result was negative, and the freighter embarked on its journey. While they were traveling through hyperspace, Dorja made conversation with the Solos' protocol droid, C-3PO, and later dined with Organa Solo and her husband Han Solo in the ship's main hold. They spoke of power and of leadership, and Dorja mused out loud how she thought the Empire would have dealt with the Yuuzhan Vong threat had Emperor Palpatine still ruled the galaxy. The conversation was interrupted by the wail of alarms, however, as the ship was interdicted from lightspeed by a Yuuzhan Vong dovin basal in an area of space along the Hydian Way. Captain Solo rushed to the cockpit while Dorja and Organa Solo took to the freighter's quad laser cannons, Dorja in the dorsal turret."}, {"tag": "p", "text": "Solo took the Millennium Falcon directly toward the dovin basal, the gravitic pull of which hid them from the sensors of six Yuuzhan Vong coralskipper fighters that were positioned on its other side. When he swept past at the last minute, he fired concussion missiles, which, combined with Dorja and Organa Solo's laser fire, destroyed four and damaged one of the coralskippers. Six others were pursuing from behind, which led to Solo taking the freighter around for another pass inside the dovin basal's gravitic pull and destroying one of the pursuers. When the lone survivor of the first flight caught up to them, Dorja destroyed it. Solo then halted his slingshot around the dovin basal in order to confuse the remaining enemy pilots, which allowed Dorja and Organa Solo to destroy another coralskipper and damage its wingmate. They finished off one more as Solo rocketed back out of the dovin basal's gravity, but before they could tangle with their remaining foes, a joint force of New Republic E-wings and Chiss clawcraft decanted from hyperspace and took care of the remaining coralskippers. Solo invited Colonel Jagged Fel, the force's leader and his daughter's boyfriend, aboard the Millennium Falcon for dinner."}, {"tag": "p", "text": "After Fel was introduced to Dorja, he joined the others at the table in the main hold. When Organa Solo mentioned her diplomatic mission to the Imperial Remnant, Fel wished her luck but mentioned that it was in the Remnant's short-term interests to ally themselves with the Yuuzhan Vong. An intrigued Dorja bid him to continue, and his musings that the Yuuzhan Vong would offer vast amounts of territory to its Imperial allies had Dorja's attention until he pointed out that in the long term, the invaders would end up betraying and destroying the Remnant. He departed soon afterward, and the Millennium Falcon continued on its long voyage through Yuuzhan Vong territory. When they arrived in the Sartinaynian system at the Imperial capital world of Bastion, they landed in a Super Star Destroyer's docking bay, where Dorja quietly slipped away. As the Solos were escorted to Imperial Headquarters on the fortress world's surface, Organa Solo suspected that Dorja was briefing the Remnant's Supreme Commander, Gilad Pellaeon, on what she had learned about the state of the New Republic. The Solos then met with Pellaeon and successfully negotiated an exchange of information: in return for all of the intelligence that the New Republic had on the Yuuzhan Vong, Pellaeon provided the Remnant's secret hyperspace routes through the galaxy's Deep Core."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vana Dorja had brown eyes and bobbed dark hair that she tucked neatly into her Imperial uniform. She was an observant, inquisitive woman with the bland and pleasant face of a diplomat—attributes that Leia Organa Solo thought were appropriate for a probable Imperial spy. Organa Solo found her manner of speaking to also be bland, and although Dorja was polite and accommodating to her hosts aboard the Millennium Falcon, she created unsettling moments for them quite easily. Dorja appreciated the efficiency of C-3PO but found him to be slightly talkative. During the freighter's battle with Yuuzhan Vong coralskippers, Dorja thought that Solo's creative piloting was highly unorthodox, but she nevertheless adjusted to it and proved herself a capable gunner. Her usual restraint was broken when she whooped with joy after destroying an enemy ship."}, {"tag": "p", "text": "Dorja held a partisan view toward the Empire, believing that Emperor Palpatine would have immediately crushed the Yuuzhan Vong with his Imperial war machine. She felt that New Republic Chief of State Borsk Fey'lya's method of negotiating with the Yuuzhan Vong while simultaneously fighting them had been a weak and hesitant method that had in turn led to chaos. Dorja listened intently when she believed that Jagged Fel was advocating that the Imperial Remnant ally itself with the invaders rather than with the New Republic, and she was also critical of the New Republic's lack of a clear chain of command following Fey'lya's death. She suspected that Organa Solo, a former Chief of State herself, would attempt to return to power—to Dorja, the voluntary relinquishing of power was tantamount to declining one's responsibility. Han Solo was openly critical of Imperial methods, and after an angry tirade of his about past failures of the Empire, Organa Solo thought that she detected amusement in Dorja's eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vana Dorja plays a minor role in Walter Jon Williams's The New Jedi Order: Destiny's Way (2002), the fourteenth novel in The New Jedi Order series. Although the book only vaguely discusses her parentage, merely calling her \"the daughter of the captain of a Star Destroyer,\" 2008's The Complete Star Wars Encyclopedia explicitly identifies her father as Captain Dorja, a character who first appeared in Timothy Zahn's 1992 novel Dark Force Rising."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}