{"url": "Vandangante_outlaw_techs", "categories": ["Category:Legends articles", "Category:Criminal organizations", "Category:Wild Space organizations"], "nodes": [{"tag": "h1", "text": "Vandangante outlaw techs"}, {"tag": "p", "text": "Vandangante outlaw techs were a roving band of well-equipped and well-trained outlaw technicians, led by Klaus 'Doc' Vandangante and his daughter Jessa. They made their living by illegally repairing and modifying starships for fugitives, organized crime, and political opponents of the Empire and the Corporate Sector Authority."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Doc and his techs had been sought by Authority and other official forces for years, but never apprehended. They had kept themselves well insulated, channeled into as many crooked bureaucrats and scuttlebutt sources as possible. More than one strike unit had moved against one of Doc's outlaw tech bases, only to seize a target area empty of everything but abandoned buildings and useless junk."}, {"tag": "h2", "text": "Facilities"}, {"tag": "p", "text": "Doc had an operation that was well known to lawbreakers throughout the galaxy. His techs repaired vehicles that had been in firefights and changed the ID profile and appearance of vessels... with no questions asked. Doc even bought and sold stolen pieces of major hardware and also hijacked drone barges in flight for the salvage. In 2 BBY, a number of males, females, humans, and non-humans, along with a large assortment of droids and other automata, made up Doc and Jessa's band of outlaws.Repair, modification, and salvage included equipping space vessels with heavy armament, sophisticated sensor arrays, military-rated deflector shields, superlight-speed engines, or any combination thereof. The Vandangante outlaw techs frequently moved from system to system to elude patrols and evade capture, while they kept their whereabouts a secret.If something was needed with machinery and his rigorous background check was met, Doc and his techs could do it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}