{"url": "Bellator-class_dreadnought", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Dreadnought classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Bellator-class dreadnought"}, {"tag": "p", "text": "The Bellator-class dreadnought was a class of large-scale dreadnought that was in service to the Galactic Empire during its reign. The dreadnought was smaller than the Assertor-class Star Dreadnought, which, in terms of size and power, was second in the Imperial Navy only behind the Executor-class Star Dreadnought."}, {"tag": "p", "text": "Both the Bellator-class and the Mandator-class belonged to the same Imperial Navy family of dreadnoughts as the Assertor-class. The command structure of the Bellator-class was similar to that of the smaller Surveyor-class reconnaissance frigate. The frigate's heavily shielded broad and bunker-like command structure extended beyond the main drives and arose at the aft of the ship. The Bellator-class dreadnought was active at the same time as the Mandator-class as well as the Assertor-class Command Dreadnought, the latter of which was introduced at some point prior to the Battle of Yavin in 0 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Bellator-class dreadnought was first introduced in the new Star Wars canon in the 2016 Fantasy Flight Games Star Wars Roleplaying sourcebook supplement, Lead by Example. The Bellator-class dreadnought originally appeared, albeit unnamed, in the Star Wars Legends comic book Dark Empire 2 that was released on February 18, 1992 and drawn by Cam Kennedy."}, {"tag": "p", "text": "The dreadnought was later redesigned by Ansel Hsiao as a fanon 3D design in 2008, but was incorporated into the 2012 Legends reference book, The Essential Guide to Warfare, authored by Jason Fry and Paul R. Urquhart. In his Tumblr endnotes regarding the reference book, Fry stated that the specifications and information of the Bellator-class were approved by Lucas Licensing."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}