{"url": "Vannar_Treece", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vannar Treece"}, {"tag": "p", "text": "Vannar Treece was a male Human Jedi Master who fought during the New Sith Wars and the former master of Kerra Holt. During the Republic Dark Age, he led several military missions against Sith forces in the Outer Rim Territories. He led the unsuccessful defense of Aquilaris Minor in 1042 BBY, but managed to evacuate a young Human girl who would subsequently become the Jedi Knight Kerra Holt. In 1032 BBY, Treece led a three-step Jedi operation known as Operation Influx, which sought to disrupt the production and supply of baradium—a compound used in the manufacture of munitions—in Sith Lord Daiman's princedom. Despite a successful infiltration at Oranessan, the taskforce was destroyed at Chelloa with the exception of Kerra Holt, who managed to establish contact with the Chelloan resistance led by former Jedi Knight Gorlan Palladane. Despite Treece's death, his ideals and philosophy still influenced his apprentice Holt, who was determined to wage war on the Sith while saving the lives of innocents."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi career"}, {"tag": "p", "text": "Vannar Treece was a member of the Old Jedi Order during the Republic Dark Age. By 1042 BBY, he had attained the rank of Jedi Knight and had become aware about a University of Sanbra research project to uncover the Helm of Ieldis, an ancient Sith artifact. The Helm had been created by the Sith Lord Ieldis prior to the Great Hyperspace War and was capable of driving sentient beings into a homicidal frenzy. During a raid on Sanbra, Sith Lord Odion, then working under the banner of the Sith Chagras Hegemony, came across information on the Ieldis research project. This research team included Aron and Mercia Holt, the parents of future Jedi Knight Kerra Holt. He also found out that the researchers had fled to Aquilaris Minor, a planet in the Grumani sector that had previously hosted refugees fleeing the Chagras Hegemony's onslaught."}, {"tag": "p", "text": "By then, Vannar had established a reputation as a perennial foe of the Sith. Under the pretext of capturing Vannar, Odion obtained permission from the Calimondra family matriarch to launch an invasion of Aquilaris Minor. Odion succeeded in capturing the researchers, who were then conscripted into Project Pandemonium, a top-secret project to obtain the Helm for himself. During the fighting, Vannar oversaw the Galactic Republic's unsuccessful defense of the planet. During the subsequent Massacre of Aquilaris, he encountered a young Force-sensitive Human girl named Kerra Holt in the ensuing house-to-house fighting that enveloped the city of Capital Cay. Initially, Kerra Holt mistook him for an intruder and nearly shot him with a blaster pistol."}, {"tag": "p", "text": "However, she quickly recognized him as a Jedi and related to him how her family had to her to flee but she went because she did not known where else to go. Taking pity on her, Vannar informed Kerra that he had a starfighter hidden nearby and offered to help escape offworld. He promised Kerra that they would return to Aquilaris when it was safe and that they would make it safe as Jedi. Holt subsequently became a Padawan under Treece's tutelage. By 1032 BBY, she had passed her Jedi Trials and become a novice Jedi Knight. At an unknown point prior to Operation Influx, Vannar also authored the holotract Those Who Drown which highlighted the plight of civilians in Sith-occupied space. Following his experiences on Aquilaris Minor, Vannar began leading independent \"knight-errant\" operations into Sith Space with a focus on the Grumani sector."}, {"tag": "p", "text": "Due to the unconventional nature of these \"knight errant\" operations, Treece was considered a maverick among his contemporaries at a time when the Republic's contemporary military strategy involved withdrawing behind a defensive cordon in the Core Worlds and the Colonies. For these operations, Treece utilized volunteers rather than regular Jedi and Republic military personnel since Supreme Chancellor Genarra and the Ministry of Defense were reluctant to commit substantial forces and other resources to invading the Sith-controlled territories due to the weakened state of the Republic. He was also able to exploit a loophole that allowed Jedi Knights a period of sixteen days of free travel anywhere in the galaxy between their regular routine of serving three months in law enforcement patrols and nine months of active service on the Republic's contracting frontiers. By 1032 BBY, Treece's \"knight errant\" operations became the sole Jedi activity within the entire Grumani sector."}, {"tag": "h3", "text": "Operation Influx"}, {"tag": "p", "text": "That year, Treece received intelligence from former Jedi and undercover Republic operative Gorlan Palladane that the Sith Lord Daiman had discovered vast deposits of baradium, a volatile compound used in the manufacture of munitions. The planet Chelloa was an exporter of baradium to the Daimanate's war forges near the frontier. Since the death of Sith Lord Chagras in 1040 BBY, the various Sith princedoms in the Grumani sector, including Chagras' nephew Daiman's Daimanate, were locked in an internecine power struggle known as the Charge Matrica. In a memorandum submitted to Chancellor Genarra, Treece recommended a strike to knock out production and to sabotage the supply lines to prevent a change in the balance of power in the region. Treece was aware of the mutual sibling rivalry between Daiman and his older brother, Sith Lord Odion. His strategy advocated keeping the Sith Lords permanently locked in stalemate to prevent one faction from dominating the entire Grumani sector."}, {"tag": "p", "text": "In response, Treece devised Operation Influx, a three-step lightning operation to disrupt the production and supply of baradium within the Daimanate. The first step would involve infiltrating the Daimanate through the transit world of Oranessan. The second step would involve a raid on Chelloa itself while the third step would involve extraction by interstellar travel to neutral space. Due to the serious nature of Operation Influx, Vannar had taken great pains to recruit several senior Jedi who had owed him a favor in the past. His team consisted of eleven Jedi, including Kerra Holt, the Quarren Master Berluk, the Trandoshan Mrssk, and the Cerean Dorvin Eltrom. This mission was originally dubbed Operation Deadlock by Holt. However, it was renamed Operation Influx when Treece recalled that it gave away their covert strategy of stalemating the Sith Lords against one another. This had the potential of alienating occupied civilian populations who looked up to the Jedi as their saviours and would allow the Sith to deduce the Republic's strategy."}, {"tag": "p", "text": "For his former Padawan Kerra, this marked her first return to the Grumani sector since her homeworld was invaded eight years ago. Treece had learnt about the baradium operations from his old friend and undercover Jedi operative Gorlan Palladane, the leader of the Chelloan resistance. Palladane and his Rodian mechanic friend Skodo had used a stolen transmitter to reactivate a hyperspace relay and communicate with Treece. However, the Sith Lord Odion had been monitoring the transmission and made preparations to invade Chelloa. The nihilistic Sith Lord believed that the planet's high concentration of baradium created an imbalance in the Force and thus had to be destroyed."}, {"tag": "p", "text": "Vannar's Jedi strike team travelled to the planet Oranessan in an unidentified Jedi starship. The planet was a polluted rain-drenched world located at a key hyperlane within the Daimanate. While approaching Oranessan's surface, the Jedi intercepted and shot down a Daimanate personnel shuttle. The shuttle had been carrying several flight crew to the planet's spaceport where a fleet of Daimanate Heavy-Lift Starcrosser transports was waiting to depart for a delivery run to Chelloa. These flight crew would be used to crew the vast transports. The shuttle crashed on top of a hillcrest in the mud flats and the Jedi quickly retrieved the fallen crew's cloaks and identification badges. During the first phase of Operation Influx, Treece led a four-member advance team which included Kerra and the Celegian Dorvin Eltrom that approached the spaceport where a fleet of the Starcrosser transports were departing for Chelloa."}, {"tag": "p", "text": "The four Jedi then encountered a Daimanite party consisting of a female ground crew chief and four armed sentries who attempted to execute them for being late to a flight preparation meeting that occurred twenty minutes earlier. However, the Jedi quickly killed the Daimanate sentries with their lightsabers. After stealing the dead Daimanates' equipment, the four Jedi commandeer an empty Starcrosser transport. Vannar then contacted the rest of the team via comlink to inform them that the objective vessel had been secured, that Operation Influx had been confirmed, and that they could now rejoin the advance team at the transport. During a brief conversation, his adopted daughter Kerra reflected on how she had switched from using Force Persuasion to lightsaber combat during her encounter with the ground crew chief. Kerra also admitted that she did not like posing as a Sith and Vannar responded that she could not get very far in enemy territory without employing subterfuge."}, {"tag": "p", "text": "The Jedi have taken over the Starcrosser transport and prepared to depart for Chelloa. However, the mission encountered a new obstacle whe pilot Dorvin found that the transport's navigation computer lacked an activation cylinder, a small device that enable a ship to enter hyperspace. While it was still able to take off, the Starcrosser transport was unable to make a hyperspace jump and Operation Influx would have to be aborted. Meanwhile, the other transports were already departing for Chelloa. Kerra quickly recalled that she had forgotten to retrieve a dispatch case from the wreckage of the downed personnel shuttle they had shot down earlier. The case had been trapped under one of the shuttle's consoles and she had mistaken it for a personal item."}, {"tag": "p", "text": "While it was standard procedure in the Republic for most flight crews to keep their activation cylinders with the ships, the Trandoshan Jedi Mrssk explained to his companions that the Starcrosser lacked one since Daiman had a policy requiring his flight crew to keep them on their persons in order to minimize the risk of desertion by his ground troops. When Kerra expressed frustration at her failure to retrieve the dispatch case, Treece was sympathetic towards the young Jedi woman since it was impossible for her to do everything. The Jedi were unable to travel to Chelloa on their own ship since the planet was tightly guarded by Daiman's forces. Time was running out since they had only one hour to infiltrate Chelloa and sabotage the baradium shipping before departing for neutral space."}, {"tag": "p", "text": "Vannar considered activating the fallback plan which involved flying the transport back to their hidden Jedi vessel and using it to shoot down the Daimanite transports before returning to the Republic. However, this plan had a serious drawback since Daiman could respond by re-routing other vessels to Chelloa. Kerra opposed this idea and suggested hijacking an ore transport but Vannar ruled it out since the ore transports were heavily armed. Finally, Kerra suggested returning to the wrecked shuttle and retrieving the dispatch case. However, Vannar was uneasy about this plan since he did not want to risk the lives of the Jedi Knights involved. However, Kerra was still determined to carry out Operation Influx due to the considerable amount of energy, time, and resources they had already committed to the mission. At that point, they were interrupted by an announcement from the Sith control tower on Oranessan reminding them to hasten their departure or they would be punished."}, {"tag": "p", "text": "Vannar then ordered the team to opt for their fallback plan. He ruled out walking back several kilometers back to their hidden Jedi ship due to the wet conditions outside. Vannar also ordered Dolvin to secure all the vessel's hatchways. However, Kerra disagreed with her master's orders and used her stolen remote control to open the transport's main cargo hatchway as it was lifting off. Donning the fallen ground crew chief's overalls, she then headed to the spaceport's hangar bay which stored several replacement navicomputers and activation cylinders. Despite flying at low altitude and the transport's external sensors, Oranessan's torrid weather made it impossible for the Jedi crew aboard the transport to detect Kerra. After several nervous minutes of waiting, Kerra returned back to the departing Starcrosser transport and used her lightsaber as a beacon."}, {"tag": "p", "text": "A soaked and exhausted Kerra then climbed back onto the transport's cargo deck where she presented the activation cylinder to her pleased master. Kerra then explained how she had obtained the activation cylinder by infiltrating the hangar while disguised as a worker. Due to her stolen clothes and because she had entered during a busy period of the day, she was able to evade detection. When Treece commented that he thought that Kerra hated posing as Sith, the Jedi woman replied that she hated letting them win even more. Having obtained the activation cylinder, the Starcrosser transport was now able to make a hyperspace jump. Having successfully accomplished the first phase of Operation Influx, the relieved Treece and Kerra shared jokes prior to departing for the raid on Chelloa."}, {"tag": "h3", "text": "Behind Enemy Lines"}, {"tag": "p", "text": "During the second phase of Operation Influx, the Jedi strike team managed to land their stolen Starcrosser transport at Jenith's spaceport. During the raid, they rammed a squad Daimanate Sith troopers and destroyed several cargo liners to disorientate their Sith opponents. They then overwhelmed the security guards with the support of the mining workers, many of whom were members of the Chelloan resistance. During the ensuing melee, Treece cautioned his former apprentice Holt not to be reckless with her life since she had already passed the trials. He then reminded Holt of her job which was to reconnoiter with Gorlan Palladane, who was gathering a group of miners in the South Work Yard. She and Palladane's group would then rejoin the main force following the fighting."}, {"tag": "p", "text": "Treece commented that Holt in the future could be the charismatic leader running the \"hopeless\" mission. She responded jokingly that her job was to make the charismatic leader \"look good\" before parting to go on her assignment. Holt saved Gorlan Palladane and his fellow miners from being killed by a T'surr Daimanate Sith officer, who wanted to kill them as part of a scorched earth strategy to ensure that no opponents could secure Daiman's labor force. She knocked out a T'surr Daimanate Sith trooper with her lightsaber while Gorlan incapacitated a human officer with his crowbar. Holt then escorted Palladane and his companions to the spaceport. By then the Sith garrison had been overpowered and Treece was being welcomed by a jubilant multi-species crowd of laborers and miners. Vannar and Gorlan reunited and shooked each others' hands as close friends. Vannar also introduced Gorlan to Kerra and introduced him as his top secret intelligence source."}, {"tag": "p", "text": "Gorlan had worked as a relief worker even before the Sith occupation but had always remained in close contact with the Jedi Order. However, tensions soon developed when Gorlan noted that the small size of the Jedi taskforce was insufficient to liberate Chelloa. Vannar explained that Operation Influx was not a rescue mission but rather a preemptive strike to sabotage the distribution of baradium and prevent further incursions into the rump Republic. Gorlan criticized Vannar's \"filibustering raid\" as insufficient in helping ordinary people living under Sith rule. Kerra intervened and defended her Master by stressing that the Vannar was right in asserting that a small tactical raid would keep the Sith deadlocked. Vannar then took Kerra aside personally and stressed that Gorlan was right but admitted her was unable to help everyone. However, he reminded Kerra that their transport ship still had sufficient space for the dock crew. He ordered her to personally assist Gorlan in helping mobilize anyone willing to flee to Republic Space. Kerra argued that she should be assisting the other Jedi in the demolitions work since she had studied the site from orbit. Gorlan responded that her knowledge of the site's dimensions could also used be used for more peaceful work and stressed that might and mercy were part of the job."}, {"tag": "h3", "text": "Last Stand on Chelloa"}, {"tag": "p", "text": "Kerra concurred and began tending to a wounded Duros labourer. However, they were distracted by the rumble of engines emanating from Squatter's Hill. Daiman's rival and estranged brother Sith Lord Odion had arrived with an attack force comprising of landing ships and a Kinetic corruptor, a massive repulsorlift vehicle capable of harvesting baradium from the surface by igniting it. Later it was learnt that Odion had also intercepted Gorlan Palladane's transmission and learnt about Daiman's secret baradium mining operations on Chelloa. Like the Jedi, he sought to sabotage Daiman's war effort by disrupting baradium production. In the ensuing duel, Odion unleashed his Force-sensitive Novitiate acolytes on Vannar's Jedi team."}, {"tag": "p", "text": "Vannar expressed surprise at Odion's presence since Chelloa was situated far from the Odionate's supply lines. Kerra also attempted to enter the fray and slay Odion in revenge for the destruction and suffering inflicted on her homeworld ten years ago. Vannar reminded Kerra of his previous order to assist Gorlan in evacuating the people and stressed that Daiman would be returning with reinforcements. He ordered her to evacuate Gorlan's people from Chelloa while emphasizing that it was his task alone to deal with Odion. Kerra returned to the freighter only to discover that Gorlan was refusing to leave because he still had a family in Jenith. Gorlan also stressed that there were still sixty thousand people in the slave cities of Chelloa and he was still needed as the de-facto leader of the Chelloan resistance. Upon learning this fact, Kerra correctly deduced that Odion was trying to destroy Aquilaris since it was too far from his supply lines to defend effectively. She told Gorlan to evacuate while she reentered the fray in an attempt to defeat Odion."}, {"tag": "p", "text": "During the ensuing duel, Vannar took on Odion atop an automated repulsorlift platform with the two men goading each other. Meanwhile, the Kinetic corruptor was begin its activation process. Kerra interrupted the duel and attempted to stop the Kinetic corruptor by damaging its cables. However, she Odion stopped her and used the Force to hurl onto the repulsorlift platform where she was quickly tended to by Vannar. He ordered her to resume her original mission and sent the repulsorlift platform back to the spaceport by pressing its control button. By then, the ground had begun shaking with Odion gloating that his baradium experts had discovered how to detonate baradium. Taken by surprise, Treece was impaled by Odion from behind and all of the Jedi team with the exception of Holt were killed in the ensuing magma explosion which also killed and wounded many of Odion's cultists, Chelloan workers and Daiman's guards. Kerra was recovered by Gorlan who took her aboard the transport ship which was protected from the resulting magma flow due to its distance from the site. Vannar's death was sensed in the Force by Kerra, who became the last surviving member of the Jedi mission and was stranded on Chelloa."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Due to their strong bond, Kerra continued to look up to her fallen master. While Kerra was initially preoccupied with trying to defeat the two fraternal Sith Lords, she eventually understood and came to accept Vannar's order to save the Chelloan people. She and Gorlan subsequently organized the evacuation of the sixty thousand civilians on Chelloa. They seized control of a fleet of cargo liners and transports which became known as the Freedom Fleet. Following the Destruction of Chelloa by Daiman's kinetic corruptors, they escaped into the safety of Republic space via a hyperspace lane. Thus, Operation Influx arguably succeeded albeit belatedly."}, {"tag": "p", "text": "Throughout his life, Vannar championed the plight of civilians living in Sith-occupied Space while lamenting the decline of the Republic into a rump state centered around the Core Worlds and the Colonies since it left large outlying regions lawless and occupied by hostile forces. He also decried the general tendency within the Republic to blame the victims of Sith domination for not rising up to challenge their oppressors, citing they lacked the will and the strength to defend themselves from their oppressors. However, he still argued that they could be led to overcome their condition if the \"way was lit by those who fight for good.\" This thesis was proven right when his former apprentice Kerra almost single-handedly led the evacuation of civilians during the Great Aquilaris Deluge despite great obstacles from both her enemies and supposed allies."}, {"tag": "p", "text": "Vannar also instilled a sense of selflessness and commitment among his followers, particularly his Padawan Kerra. This led non-Jedi commentators like Grace Command captain Jenn Devaad to comment that Kerra's selfless devotion to fighting for the people made her a \"Vannar Treece product.\" Later, during her quest into the Odionate to ascertain the fate of her parents, Kerra learnt about his involvement with her late parents in a University of Sanbra research project to find the Helm of Ieldis, an ancient Sith artifact dating back to the Great Hyperspace War. She also learnt that Odion's invasion of her homeworld of Aquilaris Minor was actually motivated by a desire to acquire the Helm for himself, under the pretext of capturing Vannar who had by then become a perennial foe of the Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vannar Treece was a natural leader based on his leadership and oratory skills. He was also a skilled combatant in lightsaber combat and an effective teacher. Vannar exuded a kind and calm demeanour which made him popular when interacting with other sentient beings. However, he was also a skilled strategist who championed preserving a constant state of stalemate within Sith Space to block further incursions into the rump Galactic Republic. He also decried the decline of the Galactic Republic and argued that the once powerful civilization had degenerated into a rump state based around a security cordon encompassing the Core Worlds and the Colonies."}, {"tag": "p", "text": "Still, Vannar championed the plight of civilian populations in Sith-occupied Space and made it his mission to alleviate their plight. In one of his writings Those Who Drown, he decried the general tendency within the Republic to blame the victims of Sith domination for not rising up to challenge their oppressors, citing they lacked the will and the strength to defend and free themselves from the Sith warlords. However, he still argued that they could be led to overcome their condition if the \"way was lit by those who fight for good.\" Due to his experiences helping those whom he regarded as oppressed, Vannar also became a father figure for the young Jedi woman Kerra Holt following her separation from her parents during the Massacre of Aquilaris. He cautioned her not to give in to her anger and passions since it would lead to the Dark Side and advised her to focus on her mission."}, {"tag": "p", "text": "However, Vannar also argued that Jedi were only effective when working in a group and were ineffective in the greater struggle when working alone. This clashed with fellow Jedi Gorlan Palladane's perspective that the Jedi could still operate alone even behind enemy lines. Vannar's emphasis on pursuing a strategic approach to ending the New Sith Wars led Palladane to surmise that Vannar and his contemporaries were more concerned with fighting the Sith than the consequences of their actions."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "As with most other Jedi, Vannar Treece was proficient in lightsaber combat and wielded a yellow lightsaber. However, he was also a strong leader, effective speaker, and knew how to operate various starships including starfighters and cargo transports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vannar Treece was first introduced as a supporting character in the new comic Knight Errant comic series which debuted in August 2010 with the release of Knight Errant 0 during Celebration V. His story background was developed by John Jackson Miller, drawn by artist Federico Dallocchio and colored by Michael Atiyeh. He also appeared in the short story Star Wars: Knight Errant: Influx which was also written by Miller and explored the prelude on Oranessan prior to the events in the Aflame story arc. This short story first debuted on October 19, 2010."}, {"tag": "p", "text": "Vannar was killed off in Knight Errant: Aflame 1, the exposition of the Star Wars: Knight Errant: Aflame story arc which was first released on October 13, 2010. However, he still makes occasional cameo appearances in recurring flashbacks throughout the series and is also still mentioned throughout the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}