{"url": "Vanguard_c20_retrofit_suite", "categories": ["Category:Legends articles", "Category:Corellian Engineering Corporation products", "Category:Starship components"], "nodes": [{"tag": "h1", "text": "Vanguard c20 retrofit suite"}, {"tag": "p", "text": "The Vanguard c20 retrofit suite was an aftermarket upgrade provided by the Corellian Engineering Corporation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Vanguard c20 retrofit suite was meant to bring the CR70 corvette up to date technologically with the CR90 corvette. It enhanced the combat prowess of the Corellian corvette and ensured that the CR70 remained on par with the CR90. This modification essentially transformed the CR70 corvette into a CR90 model."}, {"tag": "p", "text": "Trained professionals usually took 2 to 3 weeks of work to install the Vanguard c20 retrofit suite. The modification added several meters to the ship's length and added a secondary boarding ramp near the engine block."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Corellian Engineering Corporation began producing the CR90 corvette as its standard, rather than as an upgrade for the unarmed CR70 corvette, current owners of CR70 models were given the option of purchasing this aftermarket modification suite."}, {"tag": "p", "text": "Some time after the Declaration of a New Order, the Sundered Heart was upgraded, under the supervision of Master Petty Officer Corla Metonae, with the Vanguard c20 retrofit suite. It added considerable armor, better sensor capacity and weapon systems, bringing the ship in line with the weapons-laden CR90 corvette. The enhanced Sundered Heart was later used in several battles of the Galactic Civil War, with Raymus Antilles as its captain."}, {"tag": "p", "text": "In 0 ABY, several other Corellian corvettes, modified with this equipment, were used by the Alliance to Restore the Republic during the battle of Arrochar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}