{"url": "Vanguard_Squadron", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:New Republic starfighter squadrons", "Category:Vanguard Squadron personnel"], "nodes": [{"tag": "h1", "text": "Vanguard Squadron"}, {"tag": "p", "text": "Vanguard Squadron was a New Republic starfighter squadron that was active during the Galactic Civil War and was based on the Acclamator-class assault ship Lodestar, the flagship of General Hera Syndulla's battle group, some weeks after the Battle of Endor in 4 ABY. The squadron fought at the planet Argai Minor and was later present at the Pandem Nai system during the attack on the Galactic Empire's 204th Imperial Fighter Wing at the planet Pandem Nai."}, {"tag": "p", "text": "Around 5 ABY, Vanguard Squadron went on a mission to the Bormea sector, with Syndulla going to aid them part way in. However, after the general's battle group was devastated by the 204th in the Cerberon system, Syndulla and Vanguard Squadron traveled to the star system to assist the remaining forces. The squadron lost at least two fighters, and it helped pursue the 204th, which escaped aboard the bulk freighter Yadeez."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vanguard Squadron was a starfighter squadron of the New Republic within the New Republic Starfighter Corps. They specialized in rapid response attacks, high-risk rescue missions, and ambushes on Imperial capital ships. It consisted of at least five New Republic pilots, including the Mimbanese Vanguard Leader Kierah Koovah, the Trandoshan Feresk Tssat, the Mirialan Keo Venzee and two humans Grace Sienar and another pilot. Each member wore an orange flight suit, with the exception of the Trandoshan who wore a blue flight suit."}, {"tag": "p", "text": "The squadron flew a mixture of T-65B X-wing starfighters, BTL-A4 Y-wing assault starfighter/bombers, RZ-1 A-wing interceptors, and UT-60D U-wing starfighter/support craft depending on the mission needs. Post the battle of Galitan, the squadron adopted the use of A/SF-01 B-wing starfighter as well. The squadron's starfighters painted with light green-and-blue markings. The squadron was at one point, headquartered on the Acclamator-class transgalactic military assault ship Lodestar, which served as the flagship of New Republic General Hera Syndulla and her Barma Battle Group. Then later on, headquartered on the MC75 Star Cruiser Temperance under the command of Commander Lindon Javes. While on the Temperance, Vanguard Squadron's maintenance needs were attended by the ship's chief mechanic, Zerelda Sage."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Operations on the Lodestar"}, {"tag": "p", "text": "Some weeks after the Battle of Endor in 4 ABY, fighters from Vanguard Squadron resided on the Lodestar for maintenance. The members of Meteor Squadron and Hail Squadron, the other two squadrons aboard the Acclamator-class assault ship, were unhappy when the mechanic Sergeant Ragnell prioritized Vanguard's fighters for repairs."}, {"tag": "p", "text": "Vanguard Squadron later went on a mission to aid ground forces against the Galactic Empire's Treinhaus Citadel on the planet Argai Minor. They were joined by Meteor and Hail Squadron as well as the rest of Syndulla's battle group. The fighting had been brutal, and the New Republic Intelligence suspected that the planetside Imperial forces planetside had been receiving logistical support from elsewhere, wondering whether the enemy supply lines reached all the way to the planet Pandem Nai, where the Empire's 204th Imperial Fighter Wing had established a base of operations. Syndulla subsequently brought in the New Republic's Alphabet Squadron to assist with patrols during the citadel salvage operation, due to their specializations in understanding the 204th."}, {"tag": "p", "text": "Later on, Vanguard Squadron and the rest of Syndulla's battle group traveled to the Pandem Nai system, forming a blockade outside of a minefield while Alphabet Squadron fought the 204th at their tibanna gas mining stations. When a fire broke out in the planet's tibanna clouds, Syndulla had her battle group pass the minefield to assist in quelling the issue."}, {"tag": "h3", "text": "Routine patrols"}, {"tag": "p", "text": "The squadron carried out routine patrols. On returning from one particular patrol, they encountered a problem with long-range communications, which they informed the Temperance. While still flying back to the fleet, they listened to their new commander's speech."}, {"tag": "h3", "text": "Incursion in the Bormea sector"}, {"tag": "p", "text": "The New Republic began experiencing communication blackouts and a patrol around the Bormea sector had gone missing. Lindon Javes, recently promoted to commander of the MC75 Star Cruiser Temperance, ordered Vanguard Squadron to investigate a potential Imperial incursion. They were split into two teams; Feresk, Grace, and Vanguard Five looked for the missing scouts, while Gunny and Keo Venzee headed off looking for the cause of the communication disturbance."}, {"tag": "p", "text": "Feresk's group jumped to the planet, where they found the remains of the scouts, with no survivors. Suddenly, they were ambushed by an Imperial Gozanti-class cruiser, which immediately deployed four TIE fighters, which were quickly taken out. Realizing that their friends were walking into a trap, they scanned the Gozanti wreckage and began to look for their friends. Feresk's group ran into two IGV-55 surveillance vessels and their escort of six TIE fighters. The trio destroyed the jamming ships, freeing up communications within the area. They weren't able to contact the fleet, but were able to find Gunny and Keo, who had already engaged an Imperial force of one Arquitens-class command cruiser, two more Imperial jammer ships, and their TIE fighter escort. The group first targeted the fighters, only to get more reinforcements via a Gozanti cruiser that entered the battle. Together, Vanguard Squadron was able to take out the fighters and jammers, freeing up communications, but needed to call in help to finish off the Arquitens. Javes sent in two CR90 corvettes to assist them in destroying the cruiser. With communication restored, Wedge Antilles was able to get a message through to the Temperance to request assistance on an assignment."}, {"tag": "h3", "text": "Battle above Yavin Prime"}, {"tag": "p", "text": "A battle occurred above Yavin Prime when the New Republic's Talus Group cornered the Imperial II-class Star Destroyer Victorum in the atmosphere, and with the help of Vanguard Squadron and a boarding party, managed to take control of the ship and fend off Imperial reinforcements."}, {"tag": "h3", "text": "Defense of the Victorum"}, {"tag": "p", "text": "After taking possession of the Imperial II-class Star Destroyer Victorum, the ship was damaged in the previous battle, and couldn't make the full jump from Yavin Prime to the Nadiri Dockyards, and was trapped in Imperial territory. After calling in for help, the Temperance sent Vanguard Squadron to give them cover from two oncoming Quasar Fire-class cruiser-carriers closing in on the Star Destroyer. After a brief battle, the Imperial forces were held back and the Star Destroyer was able to make the jump the hyperspace following repairs."}, {"tag": "h3", "text": "Arriving at the Nadiri Dockyards"}, {"tag": "p", "text": "Vanguard Squadron escorted the Victorum to the Nadiri Dockyards, the site where the New Republic was constructing a prototype Starhawk-class battleship called the Starhawk. The Victorum's parts were salvaged and used for the constuction of the prototype ship."}, {"tag": "h3", "text": "Strike on Esseles"}, {"tag": "p", "text": "Vanguard Squadron participated in a strike on an Imperial Esseles listening post above Esseles in order to bait the Imperial II-class Star Destroyer Overseer and to stall the Imperial hunt for the Nadiri Dockyards. The strike was successful, and the listening post was destroyed."}, {"tag": "h3", "text": "Ambush in the Zavian Abyss"}, {"tag": "p", "text": "In an attempt to keep the Empire from finding Project Starhawk, Vanguard Squadron led an attack that lured the Imperial II-class Star Destroyer Overseer using droid-piloted transports. The Imperial ships were ambushed and the Starhawk revealed itself for the first time and used its powerful tractor beam to pull the Star Destroyer into the large asteroids, damaging it and causing Captain Terisa Kerrill's forces to flee."}, {"tag": "h3", "text": "Battle at the Nadiri Dockyards"}, {"tag": "p", "text": "While the Nadiri fleet was away on defending various New Republic outposts from hit-and-fade strikes by the Empire, the Nadiri Dockyards and the Starhawk were left critically exposed for attack. The Overseer carried out an assault, led by Titan Squadron, destroying the dockyards' shield generators and hangars, which allowed the Imperial to launch a baradium missile assault on the Starhawk causing huge amounts of damage. The Temperance was able to return in time to protect the Starhawk from destruction and force the Imperials to retreat, however it took a huge amount of damage to its hyperdrive."}, {"tag": "h3", "text": "Sissubo debris field"}, {"tag": "p", "text": "Hera Syndulla decided the next step was to get Project Starhawk to the safety of Chandrila, however without a hyperdrive on either the Starhawk or the Temperance, the fleet had to limp their way through Sissubo's debris field with the close protection from Vanguard Squadron. Titan Squadron attacked the smaller ships of the fleet, targeting floating power cores from wrecked Star Destroyers in the debris field. The cores' explosions were enough to destroy eight CR90 corvettes and one EF76 Nebulon-B escort frigates. Too dangerous to continue on through the debris field, Syndulla's fleet were forced to change course and into the Ringali Nebula."}, {"tag": "h3", "text": "Battle of Galitan"}, {"tag": "p", "text": "With Syndulla's forces lost, weakened and in desperate need of reinforcements, Vanguard Squadron were sent on a mission to get an old Rebel broadcast hub online, which was located over the nearby moon Galitan and to raise a distress call for New Republic reinforcements, which was answered when Anvil Squadron arrived to help. A major battle followed, with the Overseer accompanied by Imperial reinforcements from Admiral Sloane's fleet. Titan Squadron led an attack on the Starhawk, defeating Anvil Squadron and Lindon Javes in the process. One Titan TIE, managed to penetrate the Starhawk's hull and damaged the tractor beam core, causing a catastrophic overload which would lead to its ultimate destruction. Kerrill's forces withdrew, however some of Imperial fleet remained."}, {"tag": "p", "text": "Syndulla decided to sacrifice the crippled Starhawk. Corvettes were used to tow the massive battleship using its functional tractor beam, while Vanguard Squadron fought off waves of TIEs. Once it reached its optimum velocity, the Starhawk crashed into the moon's exposed core and the unstable tractor beam mechanism detonated, which resulted in a colossal explosion of molten rock and subsequent shockwave that destroyed all nearby Imperial ships caught within it."}, {"tag": "h3", "text": "Battle of Troithe"}, {"tag": "p", "text": "Around 5 ABY, Vanguard Squadron went on a special assignment to the Bormea sector to help better the New Republic's starship supply. The squadron eventually needed support, which Syndulla chose to give by leaving the rest of her battle group at their own campaign in the Cerberon system."}, {"tag": "p", "text": "However, while Syndulla worked with Vanguard Squadron, her battle group was devastated by the 204th, the Lodestar being lost in the battle. Syndulla and Vanguard, aboard the MC75 Star Cruiser Temperance, traveled to the Cerberon system and joined a battle between a remnant force of the battle group and the 204th at the Core Nine mining megafacility on the planet Troithe. The X-wings of Vanguard Squadron engaged the 204th's TIEs, taking orders from Wyl Lark of Alphabet Squadron and assisting ground troops from the New Republic's 61st Mobile Infantry. One Vanguard fighter crashed into a canyon on near the mining facility."}, {"tag": "p", "text": "When the Alphabet Squadron pilot Chass na Chadic sang through the comms, the Vanguard pilots cursed and ignored her. Another of Vanguard Squadron's fighters was lost by the time the 204th began withdrawing from Core Nine on a bulk freighter. As one Vanguard pilot reported 204th TIEs docking onto the freighter, Tssat asked Lark where their squadron was needed. Lark ultimately had all fighters pursue the freighter and its escorting TIEs. The bulk freighter then launched missiles, which some of the New Republic fighters were distracted by while X-wings from Vanguard squadron continued to chase the freighter. The 204th ultimately escaped aboard the freighter, allowing the New Republic forces to claim victory."}, {"tag": "h3", "text": "Hunt for Shadow Wing"}, {"tag": "p", "text": "Following the loss of her flagship, Lodestar, at the hands of the 204th on Troithe and near-total destruction of Meteor Squadron, General Syndulla was assigned a new flagship, a refitted Star Destroyer, Deliverance, and put together a new starfighter wing under the command of Commander Wyl Lark. Hail Squadron continued to serve in the starfighter wing, though they suffered heavy losses at Cerberon. The remnants of misfit pilots from Lark's hodgepodge strike force that he and Nath Tensent put together on Troithe, were brought over to the newly formed Wild Squadron. Flare Squadron were summoned by Syndulla to support the Hunt for Shadow Wing, in place of Vanguard Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vanguard Squadron first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}