{"url": "Bellassa/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Bellassa locations", "Category:Core Worlds planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Hydian Way", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Bellassa"}, {"tag": "p", "text": "Bellassa was a thriving, peaceful world during the final days of the Republic. The planet's capital was Ussa, a pleasant city with seven large, tranquil lakes. After the rise of the Galactic Empire, Obi-Wan Kenobi went to Bellassa after learning on Tatooine that one former Jedi survived the purge: Ferus Olin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the beginning of the Clone Wars, the natives committed their army to fight alongside the clone troopers. After the overthrow of the Republic and the birth of the Empire, the governor was deposed and an Imperial garrison was established. While the planet's Senate maintained control in theory, Inquisitor Malorum became the de-facto head of the local government when the Empire came to power. He called for the execution of Order 37 to force the local population to turn in Ferus Olin by arresting a large number of civilians in Ussa, and threatened to execute them if Olin was not turned into Imperial custody. He hired Boba Fett to kill Obi-Wan Kenobi and the then weak, Ferus Olin. The two managed to escape along with Trever Flume, a street kid who came along on their adventures. Later, Bellassa's economy began weakening, and the Empire hired scientists and constructed factories—presumably to manufacture Bellassa's famous cloth. However, Ferus Olin, now an agent for the Emperor, although in reality a double agent, discovered the Empire was illegally creating weapons. This further fueled the resistance that sprung up during the Imperial rule."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}