{"url": "Vandor-3", "categories": ["Category:Legends articles", "Category:Coruscant sector planets", "Category:Coruscant system", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Vandor-3 locations", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Vandor-3"}, {"tag": "p", "text": "Vandor-3 was the fifth planet in the Coruscant system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vandor-3 was a planet with very rich flora and fauna; the polar regions were the home of several carnivorous creatures, and the jungles in the north-west were also dangerous due to the infestation of Yulltrps brought by a survey team generations before. The Tanthen Ocean dominated the surface of the planet and the southern part of the main continent often got flooded with large tidal waves which were formed by severe sea-quakes from the small chain of volcanoes just to the south."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was a terrestrial world with oceans and a small population. Its capital city was a small industrial town that included a petroleum plant."}, {"tag": "p", "text": "In 43 BBY the Tech Raiders, a criminal organization that stole tech equipment and later sold them on the black market relocated their base to Vandor-3."}, {"tag": "p", "text": "Vandor-3 served as a training ground for clone troopers during the Clone Wars. For the training ground, a barracks was constructed on the capital's outskirts that could hold 50,000 troopers. One particular exercise involved facing the selenome that inhabited one of the planet's oceans."}, {"tag": "p", "text": "Following the Declaration of a New Order, it became part of the Galactic Empire. At some point after the Battle of Endor, Vandor-3 joined the New Republic and later its successor state, the Galactic Federation of Free Alliances."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}