{"url": "Vane%C3%A9", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Articles needing illustration", "Category:Humans", "Category:Males", "Category:Members of the Acolytes of the Beyond", "Category:Mustafar residents", "Category:Personnel of the Galactic Empire", "Category:Servants", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Vaneé"}, {"tag": "p", "text": "Vaneé was a human male attendant who served Darth Vader in the Sith Lord's castle on the planet Mustafar. In 0 BBY Vaneé approached Vader—who was meditating in a rejuvenation chamber—to inform him that Director Orson Krennic had arrived to discuss the Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Sinister origins"}, {"tag": "p", "text": "According to a story told by Mustafarians, shortly after the construction of Fortress Vader, Vaneé, an Inspector for Imperial Command, was sent by Moff Seward to Mustafar with his droid, See-Seven to determine why several of the garrison's stormtroopers had gone mad. He and See-Seven examined a trooper of the castle's garrison that had been exposed to the lava fumes and became a lunatic. During his questioning, the trooper attacked Vaneé and warned him not to go inside of the castle. He saw that the trooper was just weak-minded. Vaneé entered the castle, looked around and searched for Lord Vader. He found Lord Vader in a bacta tank."}, {"tag": "p", "text": "He told Lord Vader that the castle was not safe, should be evacuated and have enviromental filters installed. Vader refused and Vaneé argued against it until the fumes affected him. He saw hallucinations and Vader offered him a position as his attendant. Vaneé heard the hallucinations telling him what Vader needed. Vaneé tried to convince him that the hallucinations were not real and tried to laugh at them. He laughed for days until his laughter became real. Vaneé agreed to become Lord Vader's attendant at the castle and told him his name."}, {"tag": "h3", "text": "Mustafarian raid"}, {"tag": "p", "text": "After taking his position as attendant for Lord Vader at  Fortress Vader, Vaneé was captured by a horde of Mustafarians who had invaded the fortress in hopes of destroying it and its master. Vaneé began to say mercy but was interrupted by the Mustafarian leader who grabbed him by his robe and mocked his pleas of mercy. However with a dark smile, Vaneé informed the Mustafarian that he was not speaking to him as Darth Vader appeared behind the Mustafarians with his lightsaber drawn and proceeded to kill the invading Mustafarians."}, {"tag": "h3", "text": "Mustafarian plague"}, {"tag": "p", "text": "Vaneé stood on the lower level of an audience chamber within Fortress Vader near Imperial advisor Rersey as his master stood on the upper level looking out the room's window with two Imperial Royal Guards standing below. Rersey was demanding an explanation from Vader which angered Vaneé due to the advisor's lack of respect towards his master. Vaneé reminded Rersey that he was a guest in his master's residence and would act accordingly which Rersey rebuffed. Vader halted the pair's squabbling as he felt a disturbance in the force moments before a chilling scream echoed in the chamber, startling all but Vader."}, {"tag": "p", "text": "Vaneé along with Rersey followed Vader and the two guards as they went to investigate the source of the scream. Rersey remarked how the fortress was supposed to be secured to which Vaneé quietly suggested that Rersey secure his own mouth. When Rersey asked what he had said, Vaneé drearily replied he had said nothing right before loud heavy booming sound echoed through the corridor. Arriving at the fortress' entrance, Rersey demanded to know what was going on to which Vaneé answered that the castle was under attack as a horde of plagued infested Mustafarians and a lava flea broke through the doors. Vaneé looked on in shock as his master and the guards engaged the rampaging horde which included an infected Lava Trooper. After Vader had bitten by the infected trooper, Vaneé cried out in horror to Rersey that they had to escape only to look on in horror, clenching to Rersey as the horde and Vader slowly advanced on them until he was halted by Mother Sssl of Clan Rrrt."}, {"tag": "p", "text": "As Rersey confronted Sssl, Vaneé cautiously advise him to be careful as she controlled the infected. After the advisor snidely asked Sssl what secrets she was protecting, Vaneé pointed out to Rersey that Sssl would not be telling them what secrets she was protecting. Vaneé and Rersey recoiled in fear as Sssl commanded Vader to kill the both of them as Vaneé cried out in fear. Rersey then shoved Vaneé to the floor between him and Vader as he told the Dark Lord he needed to resist Sssl's power over him. As Vader advanced towards them, Vaneé cowered in fear on the floor until the Dark Lord revealed he was not under Sssl's power by levitating her off the ground."}, {"tag": "p", "text": "Getting up off the ground, Vaneé revealed to Sssl that it had all been a tarp to lure her into attacking the castle. As Sssl struggled in Vader's grip, Vaneé gleefully told her that she was no match for his master's ingenuity and power. Vaneé watched as Vader willed Sssl to order her horde to drag her into the lava and followed his master and Rersey outside as they watched Sssl and her infected horde burn in the lava. Once the ordeal was over with Vaneé congratulated his master, stating how all Mustafarians would tremble at the very mention of his name. Vader  informed Vaneé that it was of no importance before telling Advisor Rersey that his shuttle was waiting for him to take him back to the Emperor. Vaneé looked on Rersey with an expression of exasperation as the traumatize advisor continually recounted the sight of Mother Sssl being dragged into the lava."}, {"tag": "h3", "text": "Rebels in the fortress"}, {"tag": "p", "text": "Vaneé was in an upper floor control room informing Vader via comlink that spy droids had detected rebel forces within the castle when Gee-Three and Skritt came upon him. Fearful when he saw Gee-Three aiming at him, Vaneé quickly alerted his master that the rebels had found him. After Gee-Three demanded to know what the Empire was doing on Mustafar, Vaneé merely chuckled and replied he would like to see him try to shoot him just before the droid was lifted off the floor. Vaneé laughed after Gee-Three asked he was lifting him and responded that it was his master's doing. With a sadistic smile, Vaneé watched as Gee-Three was ripped apart and fell to the floor in pieces."}, {"tag": "p", "text": "Moments later, Vaneé, wielding an ax, confronted rebel Commander Lina Graf and Skritt in one of the castle's corridors after the pair had been surrounded by the castle's security droids. He asked Graf if she was sure ghosts did not exist as he ominously claimed that the lost souls of his master's victims roam the castle's hallways included that of their comrade, the thief. After Graf identified the supposed thief as their colleague Thom Hudd, Vaneé revealed that Hudd had paid the price for trying to take something that was not his and he had not been the first to meet that fate. Vaneé then told Graf and Skritt the story of the first Mustafarian raid on the fortress and how the forces where eventually slaughtered by his master. Even after Vaneé told the rebels such would be their fate, Graf replied that he did not frighten them as she pulled her blaster on him, stating she had faced real monsters. Vaneé informed Graf that she would know fear as he introduced her to his master, Darth Vader who had appeared behind her. Vaneé smiled as he watched Vader deflect Graf's blaster shot and hurled the bisected torso of her droid Crater at her."}, {"tag": "p", "text": "The Sith Lord approached Vaneé and voiced his disappointed in his attendant by chiding his fear of the rebels. Cowering, Vaneé replied how the rebels had tried to steal Vader's treasures after breaking into the castle. Vaneé watched as his master used the Force to lift Graf but was suddenly shoved by Crater, knocking him against Vader, allowing the rebels a chance to escape. A short time later, Vaneé informed Vader that the castle was under attack by an AT-ST which Skritt had commandeered."}, {"tag": "h3", "text": "Torturous storyteller"}, {"tag": "p", "text": "Vaneé leered before Lieutenant Hudd, who was restrained by shackles upright. Holding an ax, the servant expressed his glee that Hudd had regained conscious and remarked on his stamina to resist pain unlike previous prisoners. Asking Hudd if he knew why he was restrained, Vaneé stated how he was looking forward to what was in store for the captured rebel. Vaneé went on to explain that he knew how others thought of him but that he did not care; he lived to serve his master and he had his stories. Pressing a button on a nearby control panel, Vaneé projected five distorted holograms of freighting figures including one of his master and stated that he knew stories that were true nightmares. With dark glee, the servant asked Hudd if he would like to hear one of his stories and proceeded to tell him the tale of the horned devil on the planet of Lotho Minor. As he finished his tale, Vaneé commented on the nature of greed as he deactivated the hologram and concluded how it never ended well before pointing an accusing figure at the restrained Lieutenant Hudd, who knew this as he tried to steal from his master."}, {"tag": "p", "text": "With sadistic joy, Vaneé watched as Hudd continued to be shocked within the torture web. Turning the device off, Vaneé thanked the captured rebel for being able to inform his master that the torture web was still operational before subjecting Hudd to another round of electric torture. Vaneé's habit of telling nightmarish stories made Hudd recall a story told to him by Commander Cremp. Hearing Hudd speak quietly to himself after recalling the tale, Vaneé asked him if he had anything to say. Receiving no answer, Vaneé activated the torture web but heard no reaction from the captured rebel. Turing, Vaneé was shocked to see Hudd had escaped from his shackles. Vaneé then took after Hudd, promising the lieutenant that he could not hide from him and would experience new levels of pain."}, {"tag": "p", "text": "With ax in hand, Vaneé made his way down a corridor where Hudd was hiding behind a curtain. Hearing the man behind the curtain, Vaneé sliced through it, causing Hudd to emerge from hiding. Hudd the threw the curtain at Vaneé as a distraction, giving him time to make a run for it. After pulling the curtain off, Vaneé stood motionless and informed Hudd that he was fooling himself trying to escape and how he would never give up hunting him. Stalking down the hall, Vaneé told Hudd that the lieutenant's suggestions of hobbies made him laugh but that one's nature did not allow them to change. This prompted Vaneé to ask Hudd if he had told him the tale of the assassin who became a bounty hunter as he continued his hunt. As he finished his tale, Vaneé concluded that the dark side always wins in the end just as he came upon Hudd in a control room trying to find a way out of the castle."}, {"tag": "h3", "text": "Krennic's visit"}, {"tag": "p", "text": "Vaneé was present on the landing pad of the castle when Director Orson Krennic disembarked his shuttle after arriving on Mustafar. Without a word, Vaneé led Krennic into the castle and took him deep into the facility until they had arrived in a rotunda that looked out onto Mustafar's landscape. He motioned for the Director to wait before he proceeded to leave via a door on the other side of the chamber."}, {"tag": "p", "text": "Vaneé made his way to Vader's private rejuvenation chamber and entered, passing through the chamber's two sets of security doors. Approaching the bacta tank centered in the middle of the chamber, Vaneé knelt with his head bowed. As he stated that Krennic had arrived at the castle, Vaneé looked up directly to the tank to see Vader's form emerge from within the bacta. Vaneé bowed his head as the tank started to drain."}, {"tag": "p", "text": "Moments later, Vaneé returned to the rotunda and made his way past Krennic without speaking anything to him which was hardly noticed at all by Krennic. He then disappeared into the corridor. After Vader's meeting with Krennic had come to an end, Vaneé met Krennic as the man stumbled out from the rotunda. Silently tipping his head, he motioned for the Director to follow him as he led Krennic back down the same path they had taken before. After a few moments as they walked, Vaneé spoke for the first time, telling Krennic that he was one of the few individuals who had had the honor of seeing Vader in his sanctum. Upon reaching the door of the landing pad, Vaneé cautioned the Director to keep what he had witnessed to himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vaneé was a male human with white hair and light skin. His eyes were originally black, which later turned red and then green. Afterwards, Vaneé's eyes returned to red. He was insane due to breathing in the lava fumes. He was also rather sadistic taking delight in the pain of others. He was also quite content with being Vader's servant, as he himself claimed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vaneé was played by British actor Martin Gordon in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story. He was scripted as appearing in Star Wars Rebels Season Four, but as the story concept evolved he was replaced with Veris Hydan. An unnamed character similar in appearance to Vaneé appears in Darth Vader: Dark Lord of the Sith 8, informing Vader on Coruscant that the Imperial Security Bureau had discovered evidence of a Jedi Knight in Galactic City. According to a story told by Lellis in Star Wars Adventures: Shadow of Vader's Castle, however, Vaneé did not begin serving Vader until after the construction of Fortress Vader, meaning that the servant in Dark Lord of the Sith cannot be him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}