{"url": "Vanguard", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Ship stubs", "Category:EF76 Nebulon-B escort frigates", "Category:Massassi Group starships"], "nodes": [{"tag": "h1", "text": "Vanguard"}, {"tag": "p", "text": "The Vanguard was an EF76 Nebulon-B escort frigate commanded by General Jan Dodonna that was a part of the Rebel Alliance's fleet. Dodonna took the Vanguard and several other ships that were a part of his unit to the planet Atollon in the year 2 BBY, home to the Phoenix Cell Rebel unit. Dodonna's forces and Phoenix Squadron, led by Commander Jun Sato, planned to attack an Imperial factory on Lothal, however the location of Phoenix Squadron's base was discovered by the Imperial grand admiral Thrawn, who brought his fleet to Atollon in an effort to crush the Rebellion. The Vanguard was destroyed in the ensuing battle, though Dodonna and several members of the ship's crew managed to escape shortly before its destruction."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Vanguard was an EF76 Nebulon-B escort frigate manufactured by Kuat Drive Yards. Like all Nebulon-B frigates, the Vanguard was armed with twelve turbolasers and twelve laser cannons, with the main turbolaser and laser cannon located at the low-end of the ship's bow. The frigate was also equipped with at least eight escape pods, powerful dual tractor beams, and a primary communications array located on the port side of the top of the Vanguard. Various portions of the frigate's outer hull were painted red and yellow."}, {"tag": "p", "text": "The Vanguard's bridge was placed in the middle of its bow, containing several computers and chairs which the frigate's crew was stationed at, a holotable in the center of the room, and a few stairs with handrails leading up to a raised area from which Vanguard's commander, General Jan Dodonna, would give orders during battle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of many EF76 Nebulon-B escort frigates manufactured by Kuat Drive Yards, the Vanguard and several other Nebulon-B frigates were acquired by the Alliance to Restore the Republic and used in their struggle against the Galactic Empire. At least three, including the Vanguard, were a part the Massassi Group Rebel unit led by General Jan Dodonna in the year 2 BBY.[source?]"}, {"tag": "p", "text": "Dodonna's Massassi Group and another Rebel unit, Phoenix Cell, made plans to attack an Imperial factory on the planet Lothal, which was responsible for manufacturing all manner of Imperial vehicles, from TIE fighters to walkers to the newly-designed TIE Defender. Finally ready for their assault, the Vanguard and the rest of Dodonna's ships jumped to the Outer Rim world Atollon, home to Phoenix Squadron's base. Phoenix Squadron leader Commander Jun Sato, aboard the Rebel cruiser-carrier Phoenix Nest, made contact with the Vanguard and welcomed Dodonna to the planet. The general thanked him, happy to at long last deliver a significant strike against the Empire."}, {"tag": "p", "text": "Unbeknownst to the Rebels, the Imperial Grand Admiral Thrawn had discovered the Alliance's intention to attack the Lothal factory, and after tracking Dodonna's fleet movements and the trajectory of a transmission trying to warn the Rebels that Thrawn knew of their planned assault sent by Imperial Security Bureau agent Kallus, who was one of the Rebellion's \"Fulcrum\" operatives, discovered the location of Phoenix Squadron's base. Dodonna, still aboard the Vanguard, conferred with Phoenix Squadron via hologram and they received Kallus's transmission, which had been cut off before he could tell them what Thrawn knew, however after being told by Ryder Azadi, leader of a resistance on Lothal, that the Imperial fleet had left the system Rebel captain Hera Syndulla correctly deduced that Thrawn knew the location of their base, and moments later his Seventh Fleet came out of hyperspace over Atollon. The Vanguard would eventually be destroyed in the battle when Syndulla ordered all forces to retreat back to the surface, with survivors escaping via escape pods."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "During the battle of Atollon the Vanguard was commanded by General Jan Dodonna, a human male from Commenor. The frigate's bridge crew during the battle consisted of at least five Rebel soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vanguard appeared in the twenty-first episode of the animated television series Star Wars Rebels' third season, \"Zero Hour,\" which aired on March 25, 2017, on Disney XD."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}