{"url": "Vann_Bragheer", "categories": ["Category:Canon articles", "Category:204th Imperial Fighter Wing members", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vann Bragheer"}, {"tag": "p", "text": "Vann Bragheer was a human male lieutenant TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing. He took part a training exercise led by Major Soran Keize, who noted the lieutenant's aversion to zero-thrust turns. Keize, field promoted to Colonel, then chose Bragheer to assist the colonel's squadron of TIE drones alongside Lieutenant Palal Seedia. Keize warned the pair that they may die during their mission. When the 204th arrived in the Cerberon system, the squadron deployed, engaging a New Republic squadron above the planet Catadra. Bragheer was killed during the fight, with only Keize returning to the rest of the 204th after."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, Vann Bragheer served as a TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing, holding the rank of lieutenant. Around 5 ABY, the fighter wing prepared for an attack on a New Republic battle group in the Cerberon system. As a part of the preparation, Major Soran Keize, the commanding officer of the 204th, held a training exercise with Bragheer and a number of other pilots. During the exercise, Keize led the other TIE pilots through the icy ring system of a moon. After, the major gave Bragheer and the others simulated readings to test their reactions. The lieutenant showed aversion to zero-thrust turns, which Keize noted and planned to discuss with Bragheer's squadron commander. The major then called out the next exercise to the pilots, detailing himself as the new target."}, {"tag": "p", "text": "Keize, being field promoted to colonel, chose Bragheer and Lieutenant Palal Seedia to join his and nine TIE drones as a part of a diversion for the New Republic forces in the Cerberon system while the rest of the 204th made their own attack. Bragheer and Seedia's roles were to herd the drones in the inevitable event of an engagement with enemy starships. Keize told the pair that their deaths were probable in the mission, but only Seedia hesitated at this statement. The 204th soon arrived in the Cerberon system, and Bragheer, Seedia and the drones were ready to deploy by the time Keize checked on the status of their ploy squadron."}, {"tag": "p", "text": "The squadron launched once Keize joined them, travelling to the planet Catadra, where the New Republic's Meteor Squadron engaged the TIEs. Bragheer was killed during the fight, being lost along with all of the drones. Assuming that Seedia had also perished, Keize left the battle scene. He later mourned Bragheer and Seedia during the funeral of Garmen Naadra, a pilot who was killed later into the 204th's time in the Cerberon system."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human male, Vann Bragheer had a reliable mainstay impression on Soran Keize. Bragheer's aversion to the zero-thrust turned was noted by the major, who chose the lieutenant to be part of his ploy squadron as a counterweight to the inspired boldness of Palal Seedia. Bragheer showed no hesitation when Keize told him that he may die on the diversion mission."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vann Bragheer flew a TIE/ln space superiority starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vann Bragheer appeared in the 2020 novel Shadow Fall, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}