{"url": "Var-Shaa", "categories": ["Category:Canon articles", "Category:Galactic Empire planets", "Category:Mid Rim planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Var-Shaa"}, {"tag": "p", "text": "Var-Shaa was a resource-rich planet located in the Mid Rim that hosted a dockyard of the Galactic Empire in its orbit. The dockyard was a key waypoint for the Imperial Navy, but was destroyed in a New Republic attack shortly after the Battle of Endor. The Imperial pilot Varko Grey, leader of Titan Squadron, was left behind when the Star Destroyer Overseer fled the battle, but was later rescued after he outmaneuvered a New Republic pilot that pursued him."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Mid Rim, Var-Shaa was a terrestrial planet rich in resources. Its surface was covered by massive fjordlands and canyons, with rivers and larger oceans situated in between. The tops of the rocky peaks were covered in plant life, and the planet's atmosphere was breathable to humans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire operated a dockyard in orbit of Var-Shaa during its reign. The station acted as a pivotal waypoint for the Imperial Navy at the height of the Empire's power. However, after the Battle of Endor in 4 ABY, in which the Empire suffered defeat at the hands of the Rebel Alliance, the Var-Shaa dockyard was subjected to a surprise attack by the fledgling New Republic. An Imperial force, including the Imperial II-class Star Destroyer Overseer and Titan Squadron, led by Titan Leader Varko Grey, attempted to defend the dockyard, leading to a battle above Var-Shaa."}, {"tag": "p", "text": "Despite the Empire's attempt, the dockyard was lost, and the Imperial forces were ordered to retreat. Grey remained behind to assist squadron member Titan Three, who was shot down before they could return to the Overseer. Moments before Grey reached the Star Destroyer's hangar, the Overseer jumped to hyperspace, leaving Grey stranded in the debris field. He attempted to hide from the passing New Republic forces, but one pilot noticed his TIE interceptor, pursuing him down into Var-Shaa's atmosphere. Evading both the New Republic pilot and falling wreckage from the battle, Grey outmaneuvered his opponent, causing the pilot to crash his X-wing into a rock formation. Grey's TIE fighter crashed into an ocean, and the TIE fighter pilot crawled to safety. The fleeing Overseer threw off its pursuers and returned to Var-Shaa, where Grey was rescued."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Var-Shaa dockyard was a space station situated in the orbit of Var-Shaa until its destruction by the New Republic. Numerous structures were located on top of the peaks of the planet's canyons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Var-Shaa was first mentioned in the StarWars.com Databank entry for the Overseer, published on June 18, 2020. The planet appeared in the cinematic short \"Hunted,\" developed as a tie-in to the video game Star Wars: Squadrons, released on September 14, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}