{"url": "Var%27Rotha_Fin%27Rotha", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bounty hunters", "Category:Males", "Category:Tolanese"], "nodes": [{"tag": "h1", "text": "Var'Rotha Fin'Rotha"}, {"tag": "p", "text": "Var'Rotha Fin'Rotha was a Tolanese bounty hunter who operated out of the Outer Rim prior to the Galactic Civil War. Good with women and even better with weapons, he was confident and successful in his line of work, and put great pride into his ship, the Tolan's Tusk, which he frequently furnished with forbidden modifications."}, {"tag": "p", "text": "Fin'Rotha owned a duo of personal slaves: Gorge and Greel, two Gamorrean brothers. He was unaware that the two were more intelligent than the average Gamorrean, and underestimated them to his detriment. While he was meant to be cleaning the Tolan's Tusk, Greel sabotaged the ship's hyperdrive and freed his brother; they cornered their master and gave him two choices: he could leave the ship in an escape pod or through an airlock."}, {"tag": "p", "text": "He chose the former and was left hideously scarred in the ensuing crash on the nearest planet. Ashamed and vengeful, Fin'Rotha made it his mission to track them down and exact his revenge. He eventually found them on Reuss VIII, and—along with a gang of hired mercenaries—laid siege to their cantina, killing the two Gamorreans and anyone else who got in his way."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Bounty hunter"}, {"tag": "p", "text": "Originally known by only a single name, Fin'Rotha was a male member of the Tolanese species, and at a young age took up a career as a bounty hunter. He proved suited to the profession, earning himself a reputation as both a deadly hunter and a ladies' man. Considered to be extremely handsome for a Tolanese, Fin'Rotha generally pursued wealthy women, in order to gain extra funds for himself, on top of his bounty hunting payment. He eventually had enough money to purchase his own vessel, which he named Tolan's Tusk. Shaped like a thorn, the Tolan's Tusk was Fin'Rotha's heart and pride, and he spent an abundance of both money and time on his ship—the majority of his funds were spent on illegal modifications to the vessel. He also acquired a pair of Gamorreans, one exceptionally thin for his species and the other particularly obese, some time during his years as a bounty hunter. Greel and Gorge were made slaves and were kept locked up in Fin'Rotha's ship the majority of the time, only let out when Fin'Rotha was in need of physical labor."}, {"tag": "p", "text": "Unbeknownst to Fin'Rotha, Greel and Gorge were in fact far more intelligent than the average Gamorrean, and sought to escape their slavery and live a better life. Sometime during the height of the Galactic Empire, Fin'Rotha successfully captured a bounty and returned his quarry to Coruscant to receive payment. After doing so, he traveled to the Outer Rim, intending to spend the profits earned on the bounty on additional modifications to his beloved ship. Deciding to make use of the time, Fin'Rotha had Greel, the smaller of his two slaves, exit his cage and go about cleaning the ship's interior, leaving the Gamorrean alone while Fin'Rotha watched some newly released holovids. The Tolanese bounty hunter had underestimated Greel, and in doing so, made a grave error."}, {"tag": "p", "text": "While Fin'Rotha busied himself in his cockpit, the mechanically-minded Greel severely damaged the Tolan's Tusk's hyperdrive, forcing the ship out of hyperspace and back into realspace. Furious, Fin'Rotha shoved the minuscule Gamorrean aside and began examining his delicate machinery to discover what was wrong with it. Meanwhile, Greel freed his brother from captivity and let him loose on Fin'Rotha. The physically powerful Gamorrean offered his former slaver the choice between exiting the ship via an escape pod or the airlock. Fin'Rotha went with the escape pod and crashed on the nearest planet, presumed to be dead."}, {"tag": "h3", "text": "Revenge"}, {"tag": "p", "text": "The crash was devastating for both Fin'Rotha and the flimsy pod. The escape pod's heat shields failed and was thus badly burnt, and upon impact, it shattered into many pieces. Fin'Rotha, however, remarkably managed to survive, though he suffered grievous injuries. His face was extremely disfigured; ashamed, Fin'Rotha wore a mirrored, raptor-like mask for the remainder of his life. Although his injuries were originally thought to be life-threatening, Fin'Rotha recovered after many years. Renaming himself \"Var'Rotha Fin'Rotha,\" he made plans to regain his former glory as a bounty hunter, though first he planned to gain revenge over Gorge and Greel, and anyone else who stood in his way."}, {"tag": "p", "text": "After years searching for any hint of his beloved Tolan's Tusk, Fin'Rotha eventually found it, shipwrecked on the planet Reuss VIII. Gorge and Greel had made a roaring business out of Fin'Rotha's ship, which they had crashed not long after commandeering it. Named The Broken Tusk, it acted as a sort of cantina, with the main attraction being the vicious arena fights Gorge and Greel established. Still seething at losing his ship, good looks and reputation, Fin'Rotha began to plan for his attack, building up a private arsenal of weaponry, and he enlisted the help of a squad of hired goons for the raid."}, {"tag": "p", "text": "One night during the Galactic Civil War, prior to 6 ABY, Fin'Rotha and his men raided the Broken Tusk, killing anyone and anything in sight, though Fin'Rotha cared only about killing the two Gamorreans. He succeeded, killing the two Gamorreans who had inflicted his injuries on him. Though he did considerable damage to the premises, Fin'Rotha left it in one piece and it was ultimately taken over by Torel Vorne, who attempted to \"legitimize\" the establishment. Fin'Rotha's attack on the Broken Tusk was mentioned by professional shockboxer Lobar Aybock in his autobiography Fists Of Ion: Memoirs Of A Champion Shockboxer, though Fin'Rotha wasn't identified by name."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his youth, Fin'Rotha was described as a \"smooth talker\" and was often seen fraternizing with women. He had a penchant for attracting the interest of wealthy women and exploiting them, making off with their wealth, and he took great pride in his personal appearance, which was considered to be very handsome by Tolanese standards."}, {"tag": "p", "text": "He was also quite overconfident and did not imagine that tiny Greel would be able to cause him any harm, which proved to be untrue. Fin'Rotha put great stock in physical strength; he was far less reluctant to release Greel from his cage than Gorge, the large and more robust of the two slaves. He did not believe the lithe Greel to be a threat of any sort; ultimately, he severely underestimated his slave, who outwitted him and orchestrated his temporary downfall."}, {"tag": "p", "text": "Later, after the devastating crash, Var'Rotha Fin'Rotha lusted for revenge and spent several years tracking down the two Gamorrean siblings. He put all his time and resources into finding them, and after doing so, he hired a team of mercenaries to help him enact his revenge on his former slaves. Fin'Rotha was also merciless and would happily kill innocents in order to achieve his means."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "After the crash, Fin'Rotha began to stock up on weapons and held a plethora of weaponry by the time he raided the Broken Tusk. He wore a hooded cloak along with his signature blast armor and helmet, and he carried a powerful SonoMax 100 sound rifle, a Merr-Sonn heavy disruptor pistol, and dozens of thermal detonators, stun grenades, manacles, and restraints. Fin'Rotha had a valuable ship during his prime, which he cherished. He kept it in good condition and spent the majority of his profits on making performance-enhancing modifications to it, the majority of which were illegal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Var'Rotha Fin'Rotha was created by Paul Danner in 1997 for Wretched Hives of Scum & Villainy, a West End Games Star Wars: The Roleplaying Game sourcebook. Fin'Rotha appears in a roleplaying adventure in Wretched Hives, the outcome of which is up to the players and was not initially established in canon. However, in 2008, Edward M. Erdelac inferred the outcome in his short story Fists of Ion with mention of a \"vengeful Tolanese bounty hunter,\" which he later confirmed to be Fin'Rotha in his StarWars.com blog."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}