{"url": "Bellava_Parnadee", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:First Order admirals and generals", "Category:Humans", "Category:Supreme Council members"], "nodes": [{"tag": "h1", "text": "Bellava Parnadee"}, {"tag": "p", "text": "Bellava Parnadee was a human female who served as a general in the armed forces of the First Order. As the senior ground commander of the First Order military, she sat on Supreme Leader Kylo Ren's Supreme Council and in 35 ABY attended a session on board the Resurgent-class Star Destroyer Steadfast."}, {"tag": "p", "text": "During the meeting, Parnadee complimented the Supreme Leader's newly repaired mask and suggested that they increase recruitment of personnel when he brought up the Sith fleet that would soon be bolstering the First Order's forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bellava Parnadee was a human female who held the rank of general within the First Order and served as its senior ground commander during their war with the Resistance. Once much of the galaxy had fallen under First Order control following the Hosnian Cataclysm, Parnadee focused on the occupation of contested worlds and directed ground forces on Torost, Odynnia Gavo and the planet Kijimi. She operated out of Ren's command vessel, the Resurgent-class Star Destroyer Steadfast, but had standing quarters on every vessel in the First Order fleet in case she needed to personally oversee a campaign."}, {"tag": "p", "text": "Parnadee sat upon the Supreme Council, a body within the First Order High Command of the highest ranking military officers and their aides formed by Supreme Leader Kylo Ren to plan the future of the First Order. In 35 ABY, she attended a meeting of the council on board the Steadfast in which Ren presented the head of the Resistance sympathizer Boolio and declared that there was a mole within the First Order. When the Supreme Leader accused General Armitage Hux of feeling uneasy about a newly repaired mask Ren was wearing, Parnadee quickly declared that she personally liked the look."}, {"tag": "p", "text": "When Ren began discussing the Sith Eternal fleet that would soon bolster their ranks, Parnadee suggested to General Amret Engell, who handled the First Order's stormtrooper training program, that the First Order should increase recruitment of new personnel from occupied worlds. General Domaric Quinn then questioned the use of the fleet, making the rest of the council uneasy, but Ren used the Force to slam him into the ceiling. As he choked Quinn to death, Ren ordered Parnadee and the rest of the council to crush any remaining resistance to their rule while he and his Knights of Ren hunted down the scavenger Rey."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bellava Parnadee was a female human with black hair, dark skin and brown eyes. She was an avid student of history and maintained an extensive hololibrary containing detailed analysis of the major engagements of the Clone Wars and Galactic Civil War. Her presence encouraged her troops, as they either wished to make her proud or avoid her well-documented ire. She had a gift for leadership, and her strength of character gained her respect on all levels of the militarty hierarchy."}, {"tag": "p", "text": "Parnadee knew when and how to give opinions that favored her among her superiors: when she realized that Supreme Leader Kylo Ren singled out General Hux for his unease at his appearance, Parnadee stated that she liked Ren's mask. She was able to handle political tension, and was unshy about giving praise to a superior in order to gain their favor. When suggesting that the First Order recruit more children she spoke with more than a hint of glee in her voice."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Parnadee was an efficient officer. She was effective both on the battlefield and when commanding troops."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While at the meeting of the Supreme Council, Parnadee wore a freshly droid-ironed black First Order uniform with a black belt and gloves. On her left arm she bore the double-banded rank insignia of a general. Her boots were well used."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bellava Parnadee first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, in which she was portrayed by Tanya Moodie. The character's last name was listed in the films credits, while her first name was first revealed in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}