{"url": "501-Z_police_droid", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Security droid models", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "501-Z police droid"}, {"tag": "p", "text": "501-Z police droids, also nicknamed Zeds, were police droids that were used by law-enforcement and police agencies to maintain order and apprehend criminals. These droids were SoroSuub Corporation's only advance into the police and law-enforcement market."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 501-Z series stood at a height of nearly 1.9 meters tall and were covered in a shock-resistant crimson durasteel armor, making them a formidable and dangerous opponent for any criminals who came upon them. They were very intelligent and also gained a reputation of having the uncanny ability to sense what a criminal's next move might be, often resulting in accurate predictions concerning the whereabouts of their quarry of what their target would be next."}, {"tag": "p", "text": "The Zeds' personality module was advanced enough to rival that of even the most sophisticated protocol droids in the galaxy. A 501-Zed could easily communicate with other beings including their fellow police officers, whether sentient or droid. Due to their advanced design, such droids are also deployed as detectives and investigators."}, {"tag": "p", "text": "All Zed units in the product line were programmed to respond to threats with humane and non-lethal force only. Typical equipment for most Zeds ranged from electrical stun sticks to even low-power stun blasters as well as portable lumi-rods for traversing through dark alleyways or buildings."}, {"tag": "p", "text": "Their programming also included a subroutine which allowed it to change tactics when confronted with a dangerous challenge. 501-Zs also earned a reputation among their colleagues and employees of being determined and optimistic to complete an assignment though some found the droid's optimism quite annoying."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "While the 501-Z would mark the mighty galactic-wide SoroSuub Corporation's only incursion into the police and law-enforcement market in the decades before the rise of the Galactic Empire of Emperor Palpatine, the droid remained popular into the Imperial period. The Zeds' assignments by the police and law enforcement agencies that deployed them ranged from handling security and police work on frontier outposts on remote worlds to supplementing the regular police on highly-populated worlds such as Teyr and Hosk Station."}, {"tag": "p", "text": "Their jurisdiction also extended to even the most remote worlds and star systems, allowing them to pursue and apprehend fugitives who had managed to escape the stations that the Zeds were based on. However, this sometimes resulted in problems since many local governments or administrations did not recognize the authority of these automotive constables."}, {"tag": "p", "text": "Three 501-Zs were employed by Groodo the Hutt to guard the R1 astromech-controller of the Sun Runner counterfeit ship he fabricated in 23 BBY for his Jedi-foiled attempt to destroy the orbital Fondor Shipyards. The droids were handily dispatched, however, by the 18-year-old lightsaber-wielding Jedi Padawan Anakin Skywalker before he destroyed the false Sun Runner itself with a hypermatter reactor-planted proton grenade."}, {"tag": "p", "text": "Notable droids included Zed who was the chief of automated station security at Hosk Station. On one occasion, he even fought a rogue wrecker droid and continued to do so even after his right leg had been torn off."}, {"tag": "p", "text": "Following the evacuation of the spaceport, he met C-3PO and his counterpart, R2-D2. Quickly he gained their support and that of dozens of leftover and broken droids. Together they rerouted a possible explosion on the station and foiled Olag Greck's plan to steal a load of ash ore. They then pursued Greck across space to Nar Shaddaa, where Unit Zed was wounded by Greck's bodyguard, Xob, before he was destroyed by Jace Forno."}, {"tag": "h2", "text": "Notable members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}