{"url": "Varish_Vicly", "categories": ["Category:Canon articles", "Category:Females", "Category:Lonerans", "Category:New Republic Senators", "Category:Populists"], "nodes": [{"tag": "h1", "text": "Varish Vicly"}, {"tag": "p", "text": "Varish Vicly was a female Loneran who served as a senator in the Galactic Senate of the New Republic twenty years after its founding. She belonged to the Populists, a senatorial faction whose members believed individual planets should retain almost all authority. Although she seemed to cultivate frivolous interests, Vicly was an upright politician, and one of the very few senators her fellow Populist Leia Organa enjoyed to spend time with."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "New Republic senator"}, {"tag": "p", "text": "Varish Vichly was a female Loneran senator in the New Republic's Galactic Senate on Hosnian Prime. She was a member of the Populists, a faction that believed that individual worlds should retain most of the authority. In 28 ABY, Varish attended a memorial ceremony to dedicate a Jelucani fogstone statue of the late Bail Organa, a founding member of the Alliance to Restore the Republic and the adoptive father of her Populist colleague Leia Organa. After listening to Leia's speech, she told Organa that she was a pessimist and remarked that X-wing starfighter manuevers were more exciting than speeches. Later that day, she organized a dinner for several Populist senators including Organa."}, {"tag": "p", "text": "The following day, Senator Varish attended a hearing where Ryloth's Emissary Yendor highlighted the threat posed by the Nikto crime lord Rinnrivin Di's cartel to his planet's economy and independence. She opined that the matter was an intrasystem one and that the Senate had no jurisdiction to investigate even if Ryloth and Bastatha belonged to the New Republic. In the end, senator Organa and a young Centrist senator named Ransolm Casterfo agreed to investigate Rinnrivin's cartel. They discovered that Rinnrivin's cartel was a major crime syndicate which was funnelling its gambling and smuggling revenue to mysterious sources in the Outer Rim Territories."}, {"tag": "h3", "text": "Political intrigue"}, {"tag": "p", "text": "Later, Varish and her Populist colleagues including Organa and Tai-Lin Garr were disappointed when a Centrist motion to create a new powerful government office called First Senator was adopted by the Senate. She invited Organa and Tai-Lin to her opulent penthouse where they discussed their next strategy. In the end, the three senators decided to nominate Organa as the Populist candidate for First Senator due to her status as a rebel war hero and her contributions to the New Republic."}, {"tag": "p", "text": "Several days later, Varish met with Organa and Tai-Lin at the New Republic senatorial complex to attend a Populist caucus meeting to discuss Leia's nomination. However, Leia discovered a note inscribed with the message \"Run.\" Shortly later, a bomb damaged half of the Senatorial conference building. While nobody was killed due to Leia's quick thinking, Varish suffered several broken bones. She spent the next three days at the medcenter regrowing her arm bones. Despite recovering from her injuries, Varish was unhappy with the lack of perceived improvements in bacta therapy. Varish sent a holomessage to her friend Leia, who received it after returning from a senatorial mission to Ryloth."}, {"tag": "h3", "text": "Standing by a friend"}, {"tag": "p", "text": "On the day of the Senate hearing to consider Leia's nomination for First Senator, Varish gave an impassioned speech describing Leia's contributions to the Rebellion during the Galactic Civil War. She then urged the Senate to support Leia Organa as First Senator. However, Leia's Centrist friend Ransolm Casterfo took the floor and revealed that Leia was the daughter of the infamous Imperial enforcer Darth Vader. Varish was outraged by Casterfo's accusation and denounced it as a filthy, outrageous lie that Leia would deny. However, Casterfo presented Leia's keepsake chest and music box containing a recording from Bail confirming Leia's parentage. As a result, Leia was forced to admit that she was indeed Vader's daughter."}, {"tag": "p", "text": "This revelation threw the Galactic Senate into uproar and destroyed Leia's political career. After Leia left the Senate chamber, Varish rose to Leia's defense by reading out a passage from the New Republic constitution declaring that nobody should have to answer for their parent's crimes. Her friend Tai-Lin Garr also submitted a motion to the entire Populist party reaffirming their respect and loyalty for Leia's individual accomplishments. Later, Varish presumably attended another Senate hearing where Leia withdrew her nomination for First Senator and obtained leave from the Senate."}, {"tag": "h3", "text": "Leia's warning"}, {"tag": "p", "text": "Following Leia's mission to Sibensko, Varish and her fellow Populists presumably voted in favor of Leia being granted a hearing at the Senate. Later, she invited Leia to a party at her residence where Tai-Lin Garr announced that he would stand as the new Populist candidate for First Senator in order to render that position irrelevant. The following day, Varish presumably attended a Senate hearing where Leia and Casterfo warned about the danger that Rinnrivin's cartel and a paramilitary faction called the Amaxine warriors had posed to the New Republic."}, {"tag": "p", "text": "Ten days later, Varish and Leia accompanied Tai-Lin Garr on his first campaign in a public park on Hosnian Prime. She encouraged Leia to come along and pointed out that people would still respect her because of her glorious war record and service to the Senate. She expressed hope that Leia would be able to rebuild her political career. During the campaign walk, Varish was optimistic about Tai-Lin's chances of success given that the Centrists had not yet fielded a candidate. She was also hopeful that Tai-Lin Garr would win based on poll results showing that support for the Populists had not fallen despite the revelations of Leia's parentage."}, {"tag": "p", "text": "Varish was present when the Amaxine leader Arliz Hadrassian assassinated Tai-Lin before committing suicide. Following the assassination attempt, Varish and many others believed that Arliz had been the sole mastermind behind the Napkin Bombing and Rinnrivin's cartel and that the Republic had nothing more to fear. Leia disagreed and pointed out that a small-time businesswoman like Hadrassian did not have the resources to bankroll an entire paramilitary. During Tai-Lin Garr's memorial service, Varish brushed off Leia's warning and told her that Tai-Lin needed to be mourned in peace. In truth, Rinnrivin's cartel and the Amaxines had been engineered by agents of the First Order, which was preparing for its war with the New Republic. Disillusioned with the Senate's complacency and regulations, Leia formed the Resistance, a paramilitary outfit aimed at protecting the Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Loneran, Varish Vicly was covered in long, silky gold fur and had four thin, extended limbs which allowed her to walk on two feet or all fours with equal ease. Despite her frivolous interests, Varish was a woman of integrity and a staunch Populist. She was a good friend to Organa and stayed loyal to her despite revelations about Organa's true parentage. As a Loneran, Varish believed that opulence was a virtue and showcased her status by living in a luxurious penthouse in Hosnian Prime. Unlike Leia, Varish believed that the destruction of Rinnrivin's cartel and the Amaxine Warriors eliminated any threats to the New Republic. She did not realize that these groups were proxies of the First Order, a remnant of the Old Empire preparing to retake the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Varish Vicly first appeared in Claudia Gray's 2016 novel Bloodline as a supporting character. Her lines are told through the point of view of the main protagonist Leia and the antagonistic Carise Sindian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}