{"url": "Belligerent", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with elements from unlicensed sources", "Category:Imperial-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Belligerent"}, {"tag": "p", "text": "Belligerent was an Imperial-class Star Destroyer that served the Imperial Navy during the Galactic Civil War. Around 0 ABY, it was stationed as part of a picket force alongside the Star Destroyer Vengeance over the planet Tatooine when it attempted to stop the YT-1300 light freighter Limping Lady from fleeing the world with a cargo of illegal-acquired Imperial-issue weapons. By 6 ABY, Belligerent served with the Imperial forces controlled by the Imperial Advisors and was commanded by Admiral Uther Kermen. Kermen attempted to seize control of the planet Kaal and its aquaculture industry during negotiations with the world's ruler, Tirgee Benyalle. Also bidding for the rights to harvest the planet's oceans were a New Republic delegation, Syndic Pandis Hart of Sif-Uwana, and warlord Moff Utoxx Prentioch. During Kermen's bid to take the planet by force—which ultimately failed due to the efforts of the New Republic's representatives—Belligerent engaged Prentioch's Star Destroyer, Prentioch, in battle over Kaal."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Belligerent was an Imperial-class Star Destroyer, manufactured by Kuat Drive Yards. Like other vessels of the Imperial-class, it measured 1,600 meters. It was armed with turbolasers and equipped with a hyperdrive."}, {"tag": "p", "text": "Belligerent's starfighter complement included TIE/LN starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Belligerent served in the Imperial Navy during the Galactic Civil War."}, {"tag": "p", "text": "Around 0 ABY, Belligerent was in orbit over the planet Tatooine, in the Arkanis sector of the Outer Rim Territories, alongside the Star Destroyer Vengeance. The pair acted as picket vessels and attempted to stop the launch of the YT-1300 light freighter Limping Lady from Docking Bay 35 at the spaceport in Mos Eisley, as the vessel was believed to be carrying crates of stolen Imperial-issue heavy blasters. The two vessels transmitted orders for the ship to return to port. Upon receiving no answer, the Star Destroyers launched TIE fighters to intercept the Limping Lady, but the freighter managed to evade pursuit and escape into hyperspace."}, {"tag": "p", "text": "By 6 ABY, the vessel was under the command of Admiral Uther Kermen. Despite the fracturing of the Empire into warlord states following the Battle of Endor two years previously, Kermen had stayed loyal to the Imperial Advisors ruling the remnants of the Empire. Kermen took Belligerent to the planet Kaal, in the Yushan sector of the Mid Rim. Tirgee Benyalle had ruled the world since the Empire withdrew from the planet following the defeat at Endor and was accepting bids from various delegations over the right to harvest food from Kaal's oceans for their own purposes. Kermen was charged by the Imperial Advisors to secure the planet's bounty for the Empire. The other delegations included New Republic representatives, Syndic Pandis Hart of the Sif-Uwana Council, and Moff Utoxx Prentioch, a local warlord."}, {"tag": "p", "text": "While Kermen was on Kaal, Belligerent remained in orbit, standing off with Prentioch's own Star Destroyer, the Prentioch. The crew were on full alert, prepared to counter any move that Prentioch's ship made. On the surface, Kermen made his move during the negotiations; the Admiral had no intention of peacefully negotiating for the rights to Kaal's aquaculture industry, preferring to settle the matter by force. Over the course of a month, he had infiltrated his own agents into the crew of Benyalle's sail barge, aboard which the final negotiations were to take place. He attacked Benyalle and the assembled delegations, but Benyalle was rescued by the New Republic representatives. Kermen's agents clashed with reinforcements summoned by Prentioch from orbit aboard the sail barge, and eventually, Syndic Pandis Hart—who was in reality the smuggler Talon Karrde—rescued Benyalle and the New Republic delegation, blowing up the sail barge at the same time."}, {"tag": "p", "text": "In orbit, Belligerent and Prentioch began to attack one another, trading turbolaser fire that was visible from the surface of the planet. The fighting took its toll on both vessels, and Belligerent attempted to flee the system while still shooting at the Prentioch, which was likewise attempting to withdraw."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Belligerent was commanded by Admiral Uther Kermen in 6 ABY. A loyalist Imperial officer, he was in command of the Imperial fleet defending the Core Worlds from New Republic aggression."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Belligerent first appeared in the ambiguously canon RPG adventure \"Limping Lady\" by Peter M. Schweighofer, which was published in the magazine Challenge 64 in 1992. The vessel later appeared in The Kaal Connection, which was published in 1995's Star Wars Adventure Journal 7. It was also written by Schweighofer with assistance from Timothy Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}