{"url": "Variise", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Guards", "Category:Humans", "Category:Mistryl"], "nodes": [{"tag": "h1", "text": "Variise"}, {"tag": "p", "text": "Variise, a member of the all-female Mistryl Shadow Guard, served Moff Caerbellak as his bodyguard and trusted agent following the Battle of Endor. She was rumored to have been rescued by the Moff from pirates prior to her service to him, an idea that satisfied the curiosities of those who wondered why a Mistryl would be working for someone representing the hated enemy of their people, the Empire. Variise's ruthlessness and sadistic attitude soon gained her a fearful reputation among those who knew of her."}, {"tag": "p", "text": "Variise later accompanied Caerbellak to Rydonni Prime, where the Moff intended to procure a prototype weapon being developed by the weapons manufacturing company Rythani Products. The pair attended a royal parade preceding the prototype's unveiling ceremony hosted by King Rilvvan K'ntarr, ruler of Rydonni Prime and CEO of Rythani Products, but Caerbellak was soon given word that the prototype had been stolen from the Rythani Products Building. In the middle of the parade, the pilot of one of the All Terrain Armored Transports in formation identified himself as the thief who had stolen the prototype. Under Caerbellak's orders, Variise boarded the walker and attempted to retrieve the weapon. She engaged the thief, Sienn Sconn, in close-quarters combat, but Sconn was able to throw her over the edge of the walker's lowered side ramp and detonate a thermal half-sphere he had placed there, killing Variise."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and service to Moff Caerbellak"}, {"tag": "p", "text": "Variise was a Human member of the Mistryl Shadow Guard—a group of all-female warriors from the planet Emberlene. She eventually became the bodyguard and right-hand operative of Imperial Moff Caerbellak, often considered an unusual pairing given the collective Mistryl's hostility toward the Empire, due to their belief that Imperial aggression was the cause of their homeworld's devastation. As a result, nearly all Mistryl refused to do any work for the Empire, with Variise being one of the few exceptions. Although Variise acknowledged that she was a member of the Shadow Guard, she never discussed the group, claiming to have sworn an oath of secrecy on any matters concerning them. It was rumored that Caerbellak once saved Variise's life from a band of pirates, and that her service to him was her way of repaying the debt. While this rumor satisfied the curiosities of those who were baffled at Varrise's relationship with the Moff, it had never been verified. Variise eventually built a reputation for herself as the Moff's ruthless personal protector."}, {"tag": "h3", "text": "The Rydonni Prime affair"}, {"tag": "p", "text": "At some point after the Imperial fragmentation at the Battle of Endor, Variise accompanied Caerbellak to the corporate world Rydonni Prime, headquarters of the weapons manufacturing company Rythani Products. Caerbellak wished to secure a prototype weapon from the company and was invited to a ceremony showcasing the product. Variise and the Moff first attended a gathering hosted by the Rydonnian King, Rilvvan K'ntarr, who served as both monarch of Rydonni Prime and chief executive of Rythani Products. Variise dressed herself in a black gown and accompanied Caerbellak to K'ntarr's mansion, where she bumped into one of the waiters, Sienn Sconn. Variise stopped Sconn as he attempted to apologize and excuse himself, and intimidated the waiter into giving her a glass of Rydonnian spicewine, which she finished in one long sip. The Mistryl then reminded the shaken waiter that she was not easily forgiving before returning to the crowd."}, {"tag": "p", "text": "The next day, Variise and Caerbellak attended the prototype unveiling ceremony in Rydonni Prime's capital city, Ryell. The Mistryl sat beside Caerbellak and King K'ntarr in the royal reviewing stand during the ceremony's preceding parade, consisting of an Imperial procession led by several All Terrain Armored Transports, repulsorlift vehicles, and stormtroopers marching in formation. During the parade, Caerbellak received word that the prototype had been stolen from the Rythani Products Building; he grabbed K'ntarr by the collar, threatening him with the imposition of martial law on the planet if the prototype was not found. The King called for his guards to aid him, but before they could reach for their weapons, Variise swiftly shot each in the back with her dual hold-out blasters."}, {"tag": "p", "text": "As Caerbellak continued to threaten K'ntarr's life, one of the parading walkers stopped and the pilot identified himself as the thief who had stolen the prototype. His cover now blown in an attempt to distract Caerbellak from killing the King, the thief fired on the platform on which Variise and the others stood. Variise, Caerbellak, and K'ntarr safely stumbled to the bottom of the grandstand as its supports gave way. After checking Caerbellak for injuries, Variise was ordered by the Moff to retrieve the prototype and kill the thief and his accomplice, Princess Kalieva K'ntarr, the King's daughter. The Mistryl leapt from the tilting grandstand to the back of the walker and hid herself in the AT-AT's darkened troop deck."}, {"tag": "p", "text": "The thief, who turned out to be Sienn Sconn, eventually entered the troop compartment after Kalieva reported hearing a noise, and a moment later Variise took him by surprise and attacked him with her shock whip. Sconn, however, was able to fend off the attack with a well-placed shot of his wrist laser, causing Variise's weapon to overload and begin sending bolts of electricity into her body. Variise recovered and rushed Sconn but the thief used the Mistryl's own momentum against her and sent her into a sensor panel that began opening the walker's side hatch upon impact."}, {"tag": "p", "text": "In the following scuffle, Sconn attempted to push Variise toward the edge of the lowered ramp but Variise was able to send the thief over the edge instead, though he was able to grab hold of the ramp and avoid the ten-meter fall. Reminding the thief that she had already forgiven him once, Variise attempted to kill a helpless Sconn with one of her hold-out blasters but was thwarted once again by the thief's wrist laser. In the subsequent chaos, Variise and Sconn found their positions reversed. Variise, now hanging for her life on the ramp's edge, stared at Sconn in disbelief as he triggered the detonation device of his thermal half-sphere explosive, which he had fastened to the ramp earlier. Variise was killed in the ensuing explosion. Though Variise ultimately failed in her mission and Sconn escaped with the prototype, Caerbellak's secret lover, Kalieva K'ntarr, was able to fool Sconn into trusting her and surreptitiously planted a tracking device on the prototype before he left."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Variise was a cold, cruel, and calculating woman who immensely enjoyed her job as Moff's Caerbellak's protector and lackey. She was sadistic, enjoying the sight of others suffering, and eager to kill, often taunting her victims before taking their lives. She especially took pleasure in the fear her reputation inspired in most sentient beings. Before the Moff arrived anywhere, rumors circulated concerning the nature of his visit, but whenever Variise was mentioned in these conversations, the words were hushed to a whisper. To many around her, she appeared to exude danger and was often compared to feline predators, always ready to spring into action. As a result of this, people tended to be very edgy around her. After encountering her for the first time, Sienn Sconn was left a sweating, petrified wreck. Whenever Variise gave an order, it was followed through immediately, usually because the subordinate given the order was in a hurry to get as far away from her as possible."}, {"tag": "p", "text": "Variise was a beautiful and exotic-looking woman with an athletic body, and was considered as deadly as she was attractive. She had smooth skin and a mane of curly red hair, with sharply filed crimson-painted fingernails to match, and a tattoo over her right forehead and cheek. She typically spoke with a smooth, silky voice, often laced with menacing undertones. She was devoted to protecting and serving Moff Caerbellak in any capacity, although her relationship with the man was seen as unusual given the Empire's history with the Mistryl. Emberlene's rulers, the Eleven Elders of the People, in fact publicly refused to do any kind of business with the Empire, although they were sometimes known to have accepted Imperial jobs in secret. Variise's relationship to her people was shrouded in ambiguity since she refused to break her oath of secrecy to them."}, {"tag": "p", "text": "As a Mistryl Shadow Guard, Variise was skilled in martial arts and hand-to-hand combat. She was also trained in the use of a shock whip and carried several other weapons with her, including a vibroknife and two hold-out blasters. Additionally, Variise knew how to operate both repulsorlift vehicles and space transports, and could use starship weaponry when necessary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Variise was created by Paul Danner and first illustrated by Doug Shuler for the short story Easy Credits, published in the ninth issue of the Star Wars Adventure Journal in 1996. In 2003, an illustration of an unidentified Mistryl Shadow Guard by Chad Michael Ward appeared in the Hero's Guide, a supplement to Wizards of the Coast's Star Wars Roleplaying Game. Ward's image was later used in Galaxy at War, a 2009 supplement to the Saga Edition roleplaying game, which identified this Shadow Guard as Variise, thus retconning her appearance in the Hero's Guide. This image bears a resemblance to a Mistryl Shadow Guard miniature released as part of the Bounty Hunters Star Wars Miniatures set in 2006. However, the miniature lacks Variise's facial tattoo, meaning that it has yet to be retconned as her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}