{"url": "Varcinius_Repository_vault_job", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Heists and robberies"], "nodes": [{"tag": "h1", "text": "Varcinius Repository vault job"}, {"tag": "p", "text": "The Varcinius Repository job was a heist pulled off by Gallandro and a gang that he had put together. The main goal was to steal the Codeleach for a client."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Gallandro had Thinner Prokov put out rumors that there was a high demand for artisanal gasses. He then hired a group of Devaronian thieves to steal a shipment of gasses that was bound for the Varcinius Repository. This caused the Varcinius archivists to rotate the hexvaults with gasses closer to the central core and resulted in the true target of the theft to be moved to the lower security outer perimeter."}, {"tag": "h2", "text": "The theft"}, {"tag": "p", "text": "Upon arrival at Clerion, Loralynn Wheeler piloted a freighter into the atmosphere, releasing a canister of buzz droids that attacked the saucer. As they were destroyed, they released small sensors that recorded the ambient temperature around the Repository. This data allowed Nersiton to program the bodysuits worn by Kilitz and Kling to prevent them from activating thermal sensors while in the saucer. The two thieves used stellarsails to fly from the freighter to the outflow grate on the saucer. They sawed through it and entered the Repository. Using diagrams provided by Banden Starshaper, they were able to release the hexvault and drop it out of the bottom of the saucer. It was caught using a tractor beam on the freighter which left before picking up Kling and Kilitz, who had jumped after the hexvault."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kling and Kilitz plummeted to their deaths in the planet's core due to Gallandro's dislike of Malkite poisoners of which the two were members. Shortly after the successful theft, Gallandro and Loonoo started to put together a crew for a job on Savareen."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}