{"url": "Bellis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Republic intelligence personnel", "Category:Humans", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Bellis"}, {"tag": "p", "text": "Bellis was a Human male who lived on the planet Ord Mantell with his wife, Lin, during the Cold War between the Galactic Republic and the reconstituted Sith Empire. At the time of the Separatist War started by a group of Separatists attempting to overthrow the planet's government, Bellis and Lin lived in a house in Talloran village, a small settlement on the island of Avilatan. After the Separatists captured the village, Bellis spied on them for the Republic."}, {"tag": "p", "text": "In the year 3643 BBY, the Separatists stole a powerful ZR-57 orbital strike bomb from the Republic—prompting the Republic forces on the planet to ask for Bellis's help in uncovering the bomb's location. Ultimately, he was able to determine that the bomb was housed in a supply outpost on the small island of Mannett Point. After placing the information in his field box, Bellis contacted the Republic forces in order to set up a meeting so that he could give them the information. In response, the Republic Special Forces unit known as Havoc Squad sent a newly-recruited sergeant to meet with Bellis in Talloran village. However, Bellis was killed by the Separatists before the sergeant arrived, although the soldier was still able to retrieve the field box from Bellis's wife."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Bellis was alive during the time of the Cold War fought between the Galactic Republic and the reconstituted Sith Empire. At some point during his life, Bellis married a Human female named Lin, with whom he lived in a two-story house in Talloran village, a small settlement located on Avilatan, an island on the planet Ord Mantell. While Bellis and Lin lived on the planet, a group of Separatists started a conflict known as the Separatist War in rebellion against the Republic and Ord Mantell's government in an attempt to take control of the planet. Bellis's home village of Talloran was the first that the Separatists took over on Avilatan, and they ultimately barricaded it to defend against Republic counterattacks."}, {"tag": "p", "text": "During that time, Bellis worked as a spy for the Republic and reported on Separatist activities to Republic forces at Fort Garnik, a Republic base located near Talloran village. While working as a spy for the Republic, Bellis and his wife stayed in their home, where Bellis stored his field box, a type of container used by Republic agents to store important uncovered information. Bellis risked his life for the Republic many times in order to provide intelligence on Separatist activities. He always met with Republic forces in person, due to the fact that the Separatists could monitor nearby communications with signal tappers."}, {"tag": "p", "text": "In the year 3643 BBY, the Separatists stole a ZR-57 orbital strike bomb from the Republic, which prompted the Republic to try to locate where the Separatists had hidden the powerful weapon. Bellis was one of several individuals on whom the Republic called for aid, and he was able to determine that the bomb had been taken to a Separatist-controlled supply outpost on Mannett Point, a small island off Avilatan's coast. After he found out the information, Bellis encoded it and placed it in his field box before informing the Republic that he had learned of the weapon's location. Commander Harron Tavus, the leader of the Republic Special Forces unit known as Havoc Squad, arranged for his squad's newly-recruited sergeant to meet with Bellis in a small alley in Talloran village in order to obtain the information, since Bellis could not leave the village due to it being controlled by the Separatists. Before the sergeant was able to arrive, Bellis was shot and killed by Separatists—forcing the soldier to go to Bellis's house to retrieve the information from his field box. Upon learning of Bellis's death, Lin was greatly upset and refused to give the field box to the sergeant, but she eventually relented, allowing the sergeant to take Bellis's information back to Fort Garnik. There, Republic forces reviewed Bellis's findings and prepared a mission to infiltrate the supply outpost on Mannett Point to recapture the bomb."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bellis had brown hair and tan skin. At the time of his death, Bellis was wearing gray and white armor with gray gloves and black knee-high boots. According to his wife, Lin, Bellis was a good man, and his main motivations for helping the Republic during the war on Ord Mantell were to make a living to provide for his wife and himself. Upon learning of his death, his wife expressed her grief at losing him as well as her anger at the soldier and Republic that had failed to protect Bellis. As a spy, Bellis was able to uncover information on the whereabouts of the lost orbital strike bomb, and he followed standard procedure for Republic agents by encoding important information and storing it in his field box."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bellis first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. He is featured in \"The Spy,\" an early quest available on the planet Ord Mantell for players of the Trooper class. In the quest, the player goes to Talloran village to meet with Bellis but finds his body instead. The player completes the mission by going to Bellis's house, where the player obtains the field box from Bellis's wife, Lin. Bellis's findings are revealed at the end of \"The Ambush,\" the Trooper quest that occurs immediately afterward. The model used for Bellis's corpse is the same as Imperial Private Ralan, who had clothing with the crest of the Sith Empire on each shoulder. However, the game provides no reason for the Republic agent to be wearing the Imperial symbols. Bellis's location is also marked on a map in the Star Wars: The Old Republic Explorer's Guide, with an indicator for \"The Spy.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}