{"url": "Varykino_Villa/Legends", "categories": ["Category:Legends articles", "Category:Naboo locations"], "nodes": [{"tag": "h1", "text": "Varykino Villa"}, {"tag": "p", "text": "Varykino Villa, also known as the Lake Retreat, was the Naberrie family's estate in a lake at the Lake Country of Naboo. Varykino also the name of the island on which the house was situated. Convergence, the ancestral home of House Palpatine, was situated at some distance from Varykino."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Before the Clone Wars"}, {"tag": "p", "text": "Centuries prior to the Naberrie family's tenancy, the retreat was occupied by the celebrated and controversial Naboo poet, Omar Berenko. In the villa rotunda known as the Room of Morning Mists, he wrote one of his most famous poems, Defense of Naboo. Berenko was kidnapped by unknown assailants from one of the island lodge's shaded balconies and was never seen again."}, {"tag": "p", "text": "When Padmé Amidala was in Level Three schooling, she visited the villa during school retreat along with friends and family. They used to swim out to a neighboring island, where an elderly jeweler crafted beautiful vases and necklaces out of glass. Paddy Accu, the retreat's caretaker, was delighted to take the young Padmé on thrilling rides in his Gondola Speeder. He had served the Royal House of Naboo and the Naberrie family for years, before Amidala became Queen of Naboo."}, {"tag": "p", "text": "Shortly after two failed assassination attempts on Coruscant in 22 BBY, Amidala used the retreat as a sanctuary. At the time, Teckla Minnau and her half-sister Nandi were the servants who tended the guests, with Paddy still the caretaker. Minnau would subsequently join Amidala's Senatorial staff on Coruscant. During this retreat, Amidala was accompanied by her Jedi protector, Anakin Skywalker. The two of them fell in love during their stay. After the Battle of Geonosis, Padmé Amidala and Anakin Skywalker returned to Varykino, where they were secretly married by Maxiron Agolerga, a Naboo holy man."}, {"tag": "h3", "text": "During the Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, a Naboo wine named Domaine de la Maison sur le Lac was often consumed at the Galactic Senate on Coruscant. On the bottle label, we could read the brand name and the phrase \"Produce of Naboo,\" as well as see a picture of Varykino. Around 21 BBY, Amidala, along with Senators Bail Organa, Mon Mothma, Onaconda Farr, and the latter's aide Lolo Purs, drank this beverage in celebration of her latest speech in favor of the reduction of military spending. Unbeknownst to Amidala, the wine had been mixed with a lethal poison that exclusively affected Rodian blood by Purs, who wanted to take revenge on Farr for his temporary alliance with the Separatist Alliance. Furthermore, Amidala had a painting of Varykino hanging on the wall of her Senatorial office."}, {"tag": "p", "text": "In 19 BBY, the pregnant Amidala planned to raise her and Anakin's child at the Lake Retreat. However, she died on Polis Massa, giving birth to their twins, Luke and Leia Skywalker."}, {"tag": "h3", "text": "After the Clone Wars"}, {"tag": "p", "text": "After Amidala's funeral, her maternal grandmother, Ryoo Thule, spent the next six months mourning in isolation at the retreat's Translucence Cove. She found peace there because she knew that Amidala loved that place. When Thule finally decided that it was time to return to her life in Theed, Inquisitor Malorum stopped by to interrogate her because, as per Naboo custom, Thule had been the one to oversee Padmé's funeral. Her defiance to his questions led him to deduce that Amidala's offspring had not died. The Inquisitor then proceeded to kill Thule. A few times later, Ferus Olin and Trever Flume arrived in turn at the Lake Retreat. With her dying breath, Thule begged Olin to protect her granddaughter's memory."}, {"tag": "p", "text": "During the Galactic Civil War, Varykino would have been lent to the Royal House of Naboo and reserved for the private use of friends, family, and loyal subjects. It also became the site of many wedding ceremonies. At this time, a woman named Lareen Dantara worked at the Lake Retreat. Amidala's beach, situated near the villa, was well-known as the favorite resting place of Naboo's most famous rulers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Randy Stradley stated that Luke and Leia were conceived in Varykino in 20 BBY, five months before the Battle of Coruscant, in the Dark Horse Comics message boards. The creators of Star Wars: Clone Wars, also joked about Luke and Leia being conceived in Chapter 22 of their series, in a scene that takes place on Naboo and what appears to be Varykino. However, Stradley's statement was made when Revenge of the Sith was assumed to take place over a period of weeks rather than days. Luke and Leia may still have been conceived in Varykino, but this must have occurred nearly nine months before the Battle of Coruscant and the beginning of Revenge of the Sith."}, {"tag": "p", "text": "The Varykino scenes were filmed at Villa del Balbianello, on Lake Como, Italy. The interiors, which were sets constructed on a soundstage, were inspired by the basic architecture found in Caserta, where Theed was filmed, but mixed with a softer, personalized style."}, {"tag": "p", "text": "Varykino shares its name with an estate in the novel and film Doctor Zhivago, although official sources have made no comment on this."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}