{"url": "Vassek_3", "categories": ["Category:Canon articles", "Category:Confederacy of Independent Systems moons", "Category:Rocky moons", "Category:Wazta sector moons"], "nodes": [{"tag": "h1", "text": "Vassek 3"}, {"tag": "p", "text": "Vassek 3, also known as the third moon of Vassek, was a remote moon located in the Wazta sector's Vassek system of the Outer Rim Territories, and orbited the planet Vassek. Home of the personal castle of Kaleesh Separatist Alliance General Grievous, Vassek 3 had a breathable atmosphere, which was tolerable to most oxygen-breathing species, and had no form of vegetation larger than lichens. During the Clone Wars, Vassek 3 was the site of an engagement between Grievous, Jedi Master Kit Fisto and his Galactic Republic forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located within the remote Vassek system of the Outer Rim Territories' Wazta sector, Vassek 3 was one of the three moons that orbited the planet Vassek, at grid square I-17 on the Standard Galactic Grid. The moon maintained a breathable atmosphere with permanent thick mists and a standard gravitational pull, and was tolerable to majority of oxygen-breathers in the galaxy, but was shrouded in dense, perpetual mists, and had no vegetation larger than lichens. The fog meant that any view of Vassek 3's surface was normally obscured from space, although glimpses of the moon's rocky surface could be seen through breaks of the mist."}, {"tag": "p", "text": "Landing on the surface was treacherous, as the vapor meant that anyone trying to find a suitable landing area had to rely on scanners and sensors to find their way. On the surface, Vassek 3's landscape was marked by craggy, moss-covered canyons that were filled with the fogs, as well as rocky mountains."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, a conflict fought between the Galactic Republic and the Confederacy of Independent Systems, a Galactic Republic task force traced a frigate stolen by Viceroy Nute Gunray of the Trade Federation to General Grievous's fortress on Vassek 3. However, the starship was not there, as Separatist leader Count Dooku had arranged for its tracking beacon to be placed in the fortress, wishing to test Grievous' combat abilities. Infiltrating the castle, the Republic forced were all but destroyed by the Kaleesh warlord and his forces. The survivors, Jedi Master Kit Fisto and his astromech droid, R6-H5, only narrowly escaped Grievous and his IG-100 MagnaGuards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vassek 3 first appeared, albeit unidentified, in the opening newsreel of \"Rookies,\" the fifth episode of the canon animated series Star Wars: The Clone Wars' first season, which originally aired on October 24, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}