{"url": "Vasco_Nailhead", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Criminals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vasco Nailhead"}, {"tag": "p", "text": "Vasco Nailhead, nicknamed Vas, was the Human male leader of the Bone Kings, one of two major prison gangs within the Cog Hive Seven prison by the year 33 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Nailhead grew up on the planet Tepasi. He had a sister named Delia and later founded his own family with a child."}, {"tag": "h3", "text": "Imprisoned"}, {"tag": "p", "text": "Before the Naboo crisis, Nailhead was brought to the Cog Hive Seven prison station due to his criminal activities. There he worked out the position of leader of the gang of gangs King of Bones, which last numbered sixteen. The Bone Kings were in rivalry with the gravity rockers, led by the Noghri Strabo. However, both of them secretly supported the arms dealer Iram Radique, who built up an extensive network of allies within the prison station and ran his illegal business from somewhere in the prison. Nailhead has always emerged victorious from the daily gladiatorial battles in the prison and has earned the reputation of a ruthless cannibal because he consumes at least a piece of meat from every living thing he kills in battle."}, {"tag": "p", "text": "In the year 33 BBY, the Sith Lord Darth Maul infiltrated the prison as part of a covert mission to search for Iram Radique in the identity of the \"Jagannath\" prisoner. The Dathomirian Zabrak caused a sensation when it fought victoriously in the mandatory gladiatorial battles within Cog Hive Station. To create chaos, the Sith Lord provoked a confrontation between the Bone Kings and the gravity rockers, which ended in a scuffle. A little later, Maul locked up the two rival gangster gangs in the washroom at Radbau Sieben and almost killed them with a Kyrofluid. The Sith spared her life, but forced Nailhead and Strabo to accept him as the sole leader of both gangsters."}, {"tag": "p", "text": "Reluctantly, Nailhead submitted to Maul and he secretly wished for a gladiatorial fight with one of his gang members, or even with Darth Maul himself, to regain respect among the inmates. Nailhead was just in time when prison director Sadiki Blirr's bone kings and gravity rockers were allowed to brutally execute a group of treacherous prison guards, who were actually Hutten Jabba's spies. The carnage also attracted Syrox, a voracious and constantly growing parasite living in the underground of the prison, which then sucked up and ate the two rival gangs together with their leaders Nailhead and Strabo."}, {"tag": "h2", "text": "Appearances"}]}