{"url": "Vazzet_Dipterz", "categories": ["Category:Canon articles", "Category:Cyclorrians", "Category:Males", "Category:Resistance members", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Vazzet Dipterz"}, {"tag": "p", "text": "Vazzet Dipterz was a Cyclorrian male technician. He managed a Cyclorrian swarm that joined the Resistance as a taskmaster and was rarely ever seen off of his loadlifter workframe. Dipterz was stationed in the Resistance base on the moon Ajan Kloss and in 35 ABY, he spoke with a member of the Ground Logistics Division while stood by the CR90 corvette Tantive IV."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vazzet Dipterz was a Cyclorrian male who acted as a taskmaster in a swarm of Cyclorrians that served in the Resistance during its war against the First Order. Working as a technician for the Resistance, he was part of the core group based on the jungle moon Ajan Kloss."}, {"tag": "p", "text": "In 35 ABY, Dipterz was on his loadlifter workframe within the base when the Jedi-in-training Rey returned from a training course to speak with General Leia Organa. As the pair spoke, Dipterz was speaking with a member of the Ground Logistics Division next to the parked CR90 corvette Tantive IV. When the Resistance forces on Ajan Kloss latter began preparations for an attack on the planet Exegol, Dipterz was on his workframe beneath the CR90 corvette Tantive IV as it prepared to take off."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vazzet Dipterz lorded it over the rest of his swarm as a taskmaster, and was bothered when the Cyclorrian Wizzich Mozzer began spreading the practice of playing sabacc throughout the swarm; however, he tolerated the behavior as long as the swarm members only indulged in the distracting activity during their allotted twenty minute breaks. Other members of the Resistance, particularly humans, found Dipterz's managerial style overbearing, but it was acceptable within Cyclorrian culture and produced efficient results."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While serving the Resistance, Dipterz was rarely ever seen off of his loadlifter workframe, which some likened to a throne despite its industrial origins. The frame was orange in color and equipped with suspension servomotors and exposed gyro-balance systems in its limbs, plus a lifter carriage with magnetized forks that could carry fuel canisters. The Cyclorrian wore a light brown outfit with a gray jacket and brown boots. He kept a brown scarf wrapped around his head that was soaked in order to prevent distraction by nearby scents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vazzet Dipterz was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. Dipterz was portrayed by Tom Wilton, who also played Aftab Ackbar in costume in the film. While the character itself was a model, Wilton was placed in the loadlifter and moved around on set, communicating with crew members through a headset. Warwick Davis, who portrayed Wizzich Mozzer, stated that the frame was quite heavy for the actor, and that the loadlifter's closed interior created a lot of heat that resulted in discomfort for Wilton."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}