{"url": "Vazan_Felix", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Humans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Vazan Felix"}, {"tag": "p", "text": "Vazan Felix was one of the most respectable and likable free-traders in the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He was completely honest and when he borrowed money to pay for his ship, the Tine's Future, he always made payments on time and through legal channels. He was almost always cheerful on his travels thanks to his wife, Cyra, and his daughter, Tine, and they were always received well whenever they made planetfall."}, {"tag": "p", "text": "Then the worst happened to him; his wife and child were kidnapped by the criminal Zhen Mirat. The day after this happened, Mirat met with him and claimed that he simply wanted Vazan's ship, the Future. Although he turned over the ship with minimal qualms, Mirat had no intention of giving him back his family. Instead, the Tatooinian criminal found that he could be easily manipulated using threats to his family as incentive. Through this method, he forced Vazan to continue piloting his ship, now renamed The Fatal Vision, and obey his every command. Felix feared that any attempt to look for his family would be discovered by Mirat through the Force."}, {"tag": "p", "text": "For over six months Vazan went through mental torture and the days wore down on him. He started sporting at least three days growth of beard at any time. His clothes became rumpled and dirty and he projected a desperate, frantic appearance. The thought of being reunited with his family kept him sane, however, and his hatred for Mirat kept him strong. He held onto the hope that he would find another spacefarer who used the Force for good to help him. Eventually he came into contact with a minor Jedi in the service of the Rebel Alliance. The Jedi gathered together a group of rebels who proceeded to find Vazan's family. Eventually they were found to be in hibernation trances in a cave deep in the Tatooine desert. The rebels managed to get past the automated laser and droid defenses, and freed his family from the clutches of the MD-5 series medical droid which had been keeping them in the trance. While this was happening, Vazan asked the minor Jedi he had contacted to wipe his mind so that Mirat would not learn of the plan."}, {"tag": "p", "text": "When the rebels attempted to contact Vazan again, he could not remember having contacted them. It took them freeing him also from Mirat's clutches, killing Mirat and freeing Huggtar in the process, for him to believe them and eventually be reunited with his family after over six months away from them."}, {"tag": "h2", "text": "Sources"}]}