{"url": "Vaylin", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Pages needing citation", "Category:Eternal Empire individuals", "Category:Females", "Category:Force ghosts", "Category:Force-sensitives", "Category:Heads of government and state", "Category:Humans", "Category:Redeemed Force-sensitives"], "nodes": [{"tag": "h1", "text": "Vaylin"}, {"tag": "p", "text": "Vaylin was a Force-sensitive female Human daughter of Senya Tirall and Valkorion. The younger sister of twin brothers Thexan and Arcann, she displayed incredible potential in the Force since early childhood, but was also difficult to control, causing Valkorion to lock her away on Nathema, fearing that she could one day challenge him. In Nathema's Sanitarium Vaylin was subjected to intense mental and physical torture that broke her innocence, turning her into a sadistic person with no empathy for others. Senya attempted to get her daughter out, but was stopped from doing so by Valkorion, causing Vaylin to blame her mother for her suffering and develop an intense hatred for her. Subjected to a mental conditioning only Valkorion knew about, Vaylin was eventually allowed to return to Zakuul, where she bided her time instead of immediately striking back. When Arcann arranged for their father's death, blaming it on the Outlander, Vaylin supported him and became the High Justice to the new Emperor, who conquered both the Sith Empire and the Galactic Republic in less than a year."}, {"tag": "p", "text": "Five years into Arcann's reign, the Outlander was released from imprisonment in carbonite by Lana Beniko and Vaylin personally led the pursuit, but was unable to prevent them from escaping. The fugitives eventually fled the planet on the Gravestone with Senya's help, giving Vaylin another reason to hate her mother who now fought against her own children. Vaylin fought her mother and revealed to her that Thexan was killed by Arcann. Vaylin personally led a series of reprisal bombardments to lure the Outlander out of hiding and inspected the Gilded Star when Senya assisted the Outlander in raiding the treasury ship while wearing Vaylin's face as disguise. During the Battle of Odessen Vaylin turned against Arcann, revealing his whereabouts to the Alliance while luring Senya away to confront her mother on her own, though Arcann later returned the favor by stopping Vaylin from landing a blow, after which Senya took him away. Vaylin returned to Zakuul, where SCORPIO has claimed the Eternal Throne in their absence and was surprised when the droid offered the Throne to her, offering to act as Vaylin's advisor instead."}, {"tag": "p", "text": "As the new Eternal Empress, Vaylin led a hunt for Arcann and Senya, confronting her mother on Ord Mantell where she slaughtered a host of Knights of Zakuul loyal to her mother. Tracking them to Voss, Vaylin launched an invasion to draw her family out of hiding, but was unable to kill her family because of GEMINI droids' newfound self-preservation given to them by SCORPIO. Using the rumors of the Outlander's death, Vaylin and SCORPIO launched an assault on the Gravestone, taking control of the only vessel capable of fighting the Eternal Fleet. While fighting against an Alliance counter-attack, Vaylin almost killed the Outlander when Valkorion, whose spirit resided in the Outlander's body, activated her conditioning, making Vaylin aware of it for the first time. SCORPIO took the Gravestone and the Eternal Fleet to Iokath, where Vaylin led her Zakuulan forces to reclaim the Eternal Fleet from ARIES, while also obtaining a way to restore GEMINI to their original programming. Celebrating her accomplishments at the Grand Festival of Empress Vaylin, the Empress was confronted by the Outlander and Arcann, who joined forces to stop her reign. Vaylin returned to Nathema, where the Anomid scientist Jarak responsible for her conditioning helped her break her bounds, after which she immediately launched an Assault on Odessen. During the battle the Outlander taunted Vaylin into a direct confrontation on the surface, in which Vaylin was killed, though Valkorion secretly absorbed her spirit's strength and enslaved her, and used her power to conquer the Outlander's mental defenses. As the Outlander fought Valkorion for control of their body, Valkorion sent Vaylin's enslaved spirit against his opponent, but instead, the Outlander freed Vaylin from Valkorion's control, using Dramath's holocron. Vaylin joined the Outlander and the rest of her family in fighting against Valkorion, which resulted in the final death of the Immortal Emperor, allowing Vaylin's spirit to depart in peace. When Valkorion's imprint spirit surfaced several years later in an attempt to resurrect himself, within the mind of Jedi Grand Master Satele Shan, Vaylin's spirit joined forces with the Outlander and everyone else whom Valkorion had manipulated or killed, finally vanquishing the ancient entity once and for all."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Emperor's daughter"}, {"tag": "h4", "text": "Early life"}, {"tag": "p", "text": "Vaylin was the daughter of Senya Tirall and Valkorion, the Immortal Emperor of Zakuul, the capital world of the Eternal Empire. She was the younger sister of twin brothers Arcann and Thexan and inherited the incredible strength in the Force from her father, who by that point was over a thousand years old. Before she was even born, Vaylin was so powerful that she made the furniture move while she was still in her mother's womb. As a toddler, Vaylin tore apart droids, and one time, she crippled a guard who dropped a ball she tossed. The children played together, sparring in the shadow of the Eternal Fleet or running away and living in the Endless Swamp for a month. She was loved by her mother, who spent a lot of time with Vaylin, playing together in the fields and forests of Zakuul. Senya tried to teach Vaylin to rely less on the Force and more on her hands, at one time stopping her from levitating a wood-carven toy. Vaylin watched as her older brothers began their combat training against the Knights of Zakuul and, wanting to be like them, tried to perform the same techniques against an old, rusty set of Knight armor when she was alone in the woods. Frustrated by her inability to land simple Force attacks on her training dummy, Vaylin became angry, and in her rage, she destroyed the entire suit. Once she was old enough to begin her own combat training, Vaylin became frustrated at having to rely on wooden sparring sticks instead of her Force abilities. During one exercise, she became frustrated at her defeats and unleashed her powers, levitating several Knights at once, before crushing them in their own armor, with the incident observed by her father. As she grew up, the Immortal Emperor noticed similarities between himself and Vaylin, which both pleased and frightened him, and he decided to keep a tight leash on his favorite child."}, {"tag": "h4", "text": "Locked away on Nathema"}, {"tag": "p", "text": "Fearing she would challenge him one day, Valkorion sought to place limits and control on her power. He took Vaylin to Nathema, his birthplace of centuries ago, which remained lifeless and devoid of the Force ever since he used the Ritual of Nathema to wipe out all life on the planet, granting himself immortality. Vaylin gave one last glance at her mother before being taken inside the Sanitarium, the last standing and inhabited structure on the planet, where she was placed in custody of Anomid scientist Jarak. Tasked to place Vaylin under strict mental conditioning, Jarak was allowed to use any and all methods that did not cause her death. Vaylin underwent brutal experiments at the hands of the Nathema Zealots, who covered her arms in ritualistic tattoos and shaved her head, making her hair permanently become darker. Jarak subjected Vaylin to multiple horrors, as she was tested both physically and mentally in constant fear, pain and isolation. She was made to observe test subjects being torn apart by creatures, witness the dissection of their corpses following the experiments and experience the effect of chemicals and implants. Vaylin chose to blame her suffering on her mother who, she believed, had abandoned her, coming to hate like nothing else."}, {"tag": "p", "text": "Sensing her daughter's suffering, Senya decided to get Vaylin away from Nathema. Infiltrating the Sanitarium, she found Vaylin unconscious and carried her to the shuttle landing platform. There, their path was blocked by six of the Nathema Zealots and after Vaylin opened her eyes, Senya ordered her to stay back, while she knocked all six Zealots out. Senya then asked Vaylin to come with her, but the look in her daughter's eyes was filled with hate. Valkorion himself then emerged from the Sanitarium and ordered several Knights to restrain Senya and take her away, while taking Vaylin with him back into Sanitarium. Deciding that her children were not safe around Valkorion, Senya attempted to run away with them, but the children idolized their father and refused to leave, calling their own mother weak, so she was forced to leave alone. Vaylin spent years on Nathema, during which the only visits she had were from her brother Thexan, who brought her gifts from conquered worlds. Eventually, Jarak exhausted conventional methods and subjected Vaylin to torture by machines of his own design. In the end, Vaylin's mind was broken and while she herself became a cruel, vindictive person prone to temper tantrums, she remained unaware of the true purpose of her stay on Nathema - being conditioned to become powerless against whoever spoke the code phrase \"Kneel before the Dragon of Zakuul\" in her presence. While effective, the conditioning aggravated Vaylin's violent tendencies and contributed to her mental instability, transforming her into a monster."}, {"tag": "h4", "text": "Valkorion's demise"}, {"tag": "p", "text": "With Vaylin's power restrained, Valkorion allowed her to return to Zakuul and Arcann traveled to Nathema for the first and only time to take Vaylin home. Returning to the Spire, Vaylin entered the Eternal Throne where her father sit with her brothers at his side and stated that he should have left her on Nathema. Valkorion replied that his daughter belonged at his side and presented Vaylin with her first lightsaber. Vaylin ignited the blade, which prompted Arcann and Thexan to move to defend their father, who ordered them to stay back. To their relief, Vaylin deactivated her lightsaber and knelt down before Valkorion, acknowledging his superiority. During the Cold War and Galactic War, the Immortal Emperor temporarily inhabited other bodies, using the Emperor's Voices to manipulate his Sith Empire in a war with Galactic Republic, though his attention remained focused on Zakuul. However, when his Voice was slain during a Dromund Kaas operation, the Emperor was weakened and his spirit was locked away on Yavin 4, unable to regain his full strength or return to his physical form for more than a year. During this time Vaylin discovered that without her father to hide her strength from her, she could access the full range of her powers and capabilities. She formed a close bond with her brother Arcann, as he detested the idea of destiny as much as she did, and bided her time. Valkorion eventually returned to Zakuul, but Vaylin did not openly rebel, instead studying her prey like a predator. Soon after Valkorion's return, Arcann and Thexan led a series of Eternal Empire raids into the Core Worlds to test their strength, in which Arcann was injured, losing his left arm and having it replaced by cybernetics as well as wearing a mask over the scarred half of his face. Returning from the raids, Arcann was provoked by Valkorion's indifference to attack his father, but to his horror, struck Thexan instead."}, {"tag": "p", "text": "Arcann later brought two survivors from a first skirmish with the Eternal Fleet, Darth Marr and the Outlander, to their father's Throne room, where the prisoners identified Valkorion as Vitiate, the former Sith Emperor of the Sith Empire. When Valkorion offered them a chance to kneel, Darth Marr refused and Valkorion struck him down with a Force lightning, killing the Dark Councillor for his defiance. Vaylin then ordered all Knights and Scions to clear the room, leaving Arcann and Valkorion alone with the Outlander, to whom Valkorion extended to an offer to share his power. Arcann used this opportunity to betray his father and Valkorion was struck down, although his spirit attached himself to the Outlander. When Vaylin returned to the Throne room, Arcann proclaimed the Outlander responsible for their father's death and assumed the Eternal Throne as the new Emperor of Zakuul, announcing to the Eternal Empire the beginning of a conquest of the Core Worlds in a retaliation and freezing the Outlander in carbonite. Vaylin became her brother's High Justice, a position previously held by Yuriem, essentially becoming the second most powerful person in the Eternal Empire. Within a year both the Sith Empire and the Galactic Republic surrendered to Zakuul, signing peace treaties. Vaylin was present in the Eternal Throne room when Republic Evran and Sith Empire Dark Councillor Vowrawn pledged their loyalty to Arcann, and after they left she sensed an unseen presence in the room with. Arcann inquired what it was, but Vaylin did not reply, instead stabbing the empty spot she senses the presence in with her lightsaber."}, {"tag": "h3", "text": "The High Justice"}, {"tag": "h4", "text": "The Outlander escapes"}, {"tag": "p", "text": "In 3631 BBY, five years into Arcann's reign, Vaylin personally responded to an alert signal in the vault with Arcann's most prized possessions, which included the carbonite slab with the Outlander in it. A Knight of Zakuul reported to her that intruders have already released the Outlander and that skytroopers search was slowed by alarms sounding in multiple sectors. Vaylin executed the Knight after telling him not to worry, after which she destroyed a holocamera she was being observed through. Vaylin followed the escapees' trail, easily destroying a thick door blocking her way and damaging a Sun Generator near a skytrooper factory attempting to catch them in the blast. She finally caught the Outlander and his companion Lana Beniko on a landing platform and prepared to deal with them personally when a shuttle piloted by Koth Vortena arrived to pick them up and opened fire on her. Vaylin telekinetically shielded herself with a piece of debris while her squad of skytroopers were cut down by laser fire. This gave her targets time to board the ship, which Vaylin damaged with the debris piece, but was unable to prevent from escaping. She then responded to a holocall from her brother, informing him that the Outlander had escaped. Vaylin then returned to the Eternal Throne room, where Arcann determined that the damaged shuttle could only land in the Endless Swamp and skytrooper forces to sweep the area, while Vaylin executed a Knight responsible for the security in the carbonite prison for not giving a satisfying explanation for his failure."}, {"tag": "p", "text": "The Outlander's accomplices managed to locate the Gravestone, a legendary starship that once overpowered the Eternal Fleet, and get it airborne. The vessel faced the Eternal Fleet as it tried to escape Zakuul, and after inquired her brother about his hesitation, Arcann ordered his ships to open fire. However, one omnicannon blast from the Gravestone destroyed more than two dozen Eternal Fleet warships before jumping into Hyperspace, with Vaylin finding the ship's power remarkable. Having questioned and killed three Zakuulan Knights who claimed that the Outlander was allied with their mother and another three because she felt like it, Vaylin reported her findings to Arcann. Vaylin wondered whether Senya was aware of Valkorion's survival inside the Outlander's mind and was attempting to restore his rule, claiming that she and Arcann no longer needed their parents, who gave them power to forge their own future. Vaylin later got a tip from a Zakuulan socialite that the Outlander and her mother were spotted in Zakuulan Old World and informed Arcann of this development, though he declined to pursue them at the time."}, {"tag": "h4", "text": "Battle of Asylum"}, {"tag": "p", "text": "Arcann was informed by the exiled leader of the Scions of Zakuul Heskal that the Outlander was hiding on the Asylum shadowport, and went there along with Vaylin to deal them personally. In the battle of Asylum Vaylin led the Eternal Empire forces towards the Gravestone, where she was ordered by Arcann to spare nobody and announced to the Outlander her intent to kill their friends. However before she could attack, her mother intervened and pushed the Outlander out of Vaylin's reach. After a brief exchange of words Vaylin attacked her mother and the two engaged in a Lightsaber duel, as Senya attempted to reason with Vaylin to no avail. Ultimately, Senya managed to disarm Vaylin and had her at her mercy, but was unable to land a finishing strike. This amused Vaylin, who shocked her mother by revealing that Thexan was killed by Arcann in cold blood and not during the fighting on the Core Worlds. Senya retreated on the Gravestone with other dissidents, after which Vaylin found Arcann and declared that she was going to kill their mother for sparing her life. Returning to Zakuul, Vaylin listened to her brother brooding over the fact that Valkorion was now plotting against his own children. She mentioned that Senya would probably want his head for killing Thexan, before confidently reassuring Arcann that the Eternal Empire would keep her at bay. Sentimental, Arcann remarked that Thexan should be alive, ruling the Empire alongside his brother and sister as it was meant to be ruled. Vaylin admitted she would like having Thexan back, but then shrugged off the nostalgia and reminded Arcann that their father now favored the Outlander and planned on taking everything from them."}, {"tag": "h4", "text": "A fruitless search"}, {"tag": "p", "text": "On her brother's orders, Vaylin scouted five sectors in search of the Outlander and the Gravestone, to no avail. She returned to Zakuul to report to Arcann her failure, jokingly claiming their problems as figments of their imagination. Arcann then ordered Vaylin to bombard one inhabited world in each of the five sectors into dust, believing it would loosen some tongues. Vaylin carried out her orders, even recording holos of her handiwork, only to return to hear that the Outlander attacked Zakuul again in her absence. Blaming the Knights of Zakuul for their inability to apprehend the Outlander, Arcann ordered them to fight to the death in pairs as a punishment and a motivation. Vaylin voiced her concern that their hunt for the Outlander would be severely hampered with half their Knights dead, but Arcann ignored her concerns and when she hesitated to carry out his command, barked at her to proceed."}, {"tag": "p", "text": "Vaylin interrupted her brother's meditation session by telekinetically snatching his lightsaber, saying that his gloomy outlook was making her sad. Arcann confessed his frustrations at their father for refusing to face him in the open, to which Vaylin suggested that Valkorion was punishing Arcann for stealing his throne. Arcann replied that their father was always emotionless, even after Thexan's death. This prompted Vaylin to nostalgically recall how Thexan was bringing her gifts from the conquered worlds. Arcann then reminded her that he freed her from Valkorion's control to inquire if he still had her support, which Vaylin affirmed. Vaylin later traveled to Vandin to check on the stealth treasury ship, the Gilded Star. Initially believing that she arrived just in time to stop the robbers, she became furious when she found the ship's vault empty and even moreso after she learned that her mother aided in the heist, wearing Vaylin's face as a disguise. Upon her return to Zakuul, she began fantasizing about revenge against her mother, but Arcann interrupted her tirade by asking whether she remembered Senya from when they were children. Vaylin repeated her belief that Senya hated and controlled her for being more powerful and asked what would happen when the rest of the galaxy learned about the insult to them, which would inspire other worlds to rise up in rebellion. Arcann then assured her that the riches could be replaced and the fear of his power would discourage any further uprisings."}, {"tag": "h4", "text": "Ascendance"}, {"tag": "p", "text": "Arcann and Vaylin later observed a real-time holographic report of a Mandalorian army assaulting an Eternal Empire weapons factory on Darvannis. Vaylin advised\ndispatching the Eternal Fleet to annihilate the Mandalorians, but Arcann was confident in the factory's ability to defend itself. As the battle progressed, the Mandalorians were gaining the advantage, and noting that the Mandalorians seemed inspired by a cause, Arcann realized the Outlander was on Darvannis alongside them. He was about to send the Fleet to Darvannis before Vaylin reminded him that their ships would not make it in time and admonished her brother for not taking her advice earlier. As Vaylin threatened to execute a Knight of Zakuul for the loss of the Darvannis factory, Arcann received a distress call from an Eternal Fleet warship that the Outlander and Senya were attempting to commandeer. Vaylin blasted the incompetent Knight off the dais and joined Arcann on his Eternal Flagship and they took a large detachment of the Eternal Fleet and rushed to intercept their target, but the Gravestone once again escaped into hyperspace just as the Eternal Fleet arrived."}, {"tag": "p", "text": "Subsequently, Vaylin informed her brother that all Eternal Fleet vessels outside their current sector were not responding to the orders. Arcann dismissed this turn of events as of little consequence, determined to hunt down the Outlander and Valkorion before worrying about the Eternal Fleet. Neither was aware that in their absence SCORPIO, an advanced artificial intelligence, had taken over the Eternal Throne, controlling both the Skytroopers and the Eternal Fleet, and through it their entire Empire. In an attempts to let her enemies destroy each other, SCORPIO revealed her actions to Arcann and Vaylin, informing them that the Alliance base was located on the planet Odessen. Arcann ordered his detachment of the Eternal Fleet to attack Odessen, planning to deal with SCORPIO after killing the Outlander and his father. As the battle of Odessen raged on, the Outlander, Senya Tirall and Lana Beniko boarded the Eternal Flagship in an attempt to kill Arcann. Seeing her mother on the security cameras, Vaylin contacted them through a loudspeaker and revealed that Arcann was on the ship's bridge, while also luring Senya away from him to confront her personally. The Outlander confronted and defeated Arcann on the bridge, crushing him under a pile of debris, but Senya arrived soon after the Outlander left the bridge and pulled Arcann from under the rubble. Vaylin then returned to the burning bridge, proclaiming that her mother was as always too late and calling her weak for leaving her children. Senya offered both her children to come back to her, which Vaylin refused and launched herself at her mother, before Arcann Force-pushed her away. Vaylin felt betrayed by her brother and demanded to know why he saved Senya's life, but before she received an answer, falling debris forcing her to retreat and flee back to Zakuul while Senya escaped with Arcann in his shuttle."}, {"tag": "h3", "text": "The Eternal Empress"}, {"tag": "h4", "text": "The hunt for Senya"}, {"tag": "p", "text": "Returning to Zakuul, Vaylin cut her way through SCORPIO-controlled skytroopers in the Eternal Throne room, but then put away her lightsaber after SCORPIO ordered her droids to stop firing. SCORPIO welcomes Vaylin and explained she only took the throne to grant free will and to the Fleet's GEMINI droids. Vaylin proclaimed herself more deserving of the Eternal Throne's power than Arcann was and was surprised a kindred spirit in SCORPIO, someone with great power and potential, who felt hindered by lesser beings. Surprised that SCORPIO did not wish to control her children, Vaylin agreed that the ability to choose made them stronger, relating to her own experiences. SCORPIO then willingly surrendered the Eternal Throne to Vaylin, offering to stay and advise the new Empress of Zakuul on how to destroy their enemies."}, {"tag": "p", "text": "As the new Eternal Empress, Vaylin quickly proved herself even more brutal leader than Arcann. During her coronation, she publicly executed a dozen Knights of Zakuul for failing to protect her brother after personally congratulating each victim on the great honor of dying at her hand, an act of cruelty that shocked Zakuul's citizens. Having purged the entire cadre of Arcann's guards, Vaylin replaced them with an elite unit handpicked from the remaining ranks of the Knights of Zakuul, which she called the Horizon Guard. She also declared a bounty on her own mother, obsessively pursuing every lead. Eventually, Vaylin learned of several dissident Knights, terrified that she might disband or destroy their order, planning on meeting with Senya on Ord Mantell. Vaylin traveled to Ord Mantell and slaughtered the host before Senya arrived on Arcann's shuttle. She then made her presence known by igniting spilled rhydonium with Force lightning, before snatching her mother's lightsaber pike from her hands. Using the Force, Senya called a fallen Knight's lightsaber to her hand to defend herself, with Vaylin calling her mother afraid while Senya implied that her daughter was taking orders from SCORPIO. Vaylin fought viciously against her mother, but Senya's combat experience and the empress's flawed techniques allowed Senya to hold her own. Senya once again tried to reason with her, but Vaylin was single-mindedly driven to kill her mother and attempted to deliver a finishing blow, only to hit a Zakuul shuttle's damaged hyperdrive. Vaylin managed to shield herself and Senya from the resulting explosion with the Force, allowing Senya to escape. It remained unclear to Senya whether there was a part of her daughter that still cared for her or that she was a predator toying with her prey."}, {"tag": "p", "text": "After Ord Mantell, Vaylin tracked Senya and Arcann to Voss and invaded the planet with the Eternal Fleet to burn them out of hiding. Her forces landed in and captured the capital city of Voss-Ka, after which Vaylin gleefully ordered the planet to be burnt to ashes. The fighting continued over time, with Vaylin becoming angry that the planet was being torched without her, when SCORPIO noted from a presence of Mandalorian forces in Voss-Ka that the Outlander was on-world as well, with the spirit of Valkorion inside. Vaylin located all three of her family members inside the Shrine of Healing and addressed them through a Skytrooper holocomm, taunting her family and ordering the Eternal Fleet to bombard the Shrine in an attempt to kill them all. However, before the Eternal Fleet ships could scorch the planet's surface, the Imperial fleet had arrived and caused the GEMINI units to flee the battle. Vaylin was angered at them for retreating without orders, but SCORPIO noted that the GEMINI merely made a choice she did not like and urged the Empress to focus on the big picture, bringing her attention back to the Outlander."}, {"tag": "h4", "text": "Assault on the Gravestone"}, {"tag": "p", "text": "Not long after the battle of Voss, news from Dromund Kaas reported that the Outlander had died. Though Vaylin could sense from feeling Valkorion's presence this was not the case, SCORPIO noted that the resulting disarray was the perfect opportunity to strike against the Alliance. Vaylin and SCORPIO set a trap for the Gravestone by capturing a civial cargo freighter Ridala, killing its captain and staging an attack on it by the Eternal Fleet. When the Gravestone piloted by Koth Vortena arrived to combat the Fleet, SCORPIO impersonated the freighter's captain and send a distress call. Vortena allowed the shuttle to land inside the Gravestone hangar for repairs, from where SCORPIO, Vaylin and a host of Knights of Zakuul and Horizon Guard took control of the vessel. Vortena himself locked the bridge and managed to avoid capture, calling the Alliance for help. The Alliance fleet arrived and engaged the Eternal Fleet, while the Outlander and Lana Beniko infiltrated the Gravestone in a boarding pod. The Gravestone computers were protected by Vortena's personal key, and SCORPIO was unable to access the HoloNet signal through the battle, so Vaylin tortured Vortena's second-in-command Len Parvek for his personal details. SCORPIO unlocked the bridge controls, but then noted that five patrols at opposite ends of the ship were lost, revealing that Vortena had help from the Outlander. Vaylin went ahead to confront her father, finding and attacking Lana Beniko at the Dark Sanctuary."}, {"tag": "p", "text": "Their fight was interrupted by the arrival of the Outlander and Koth Vortena, who warned Vaylin about a quantum bomb hidden underneath the floor, which was just triggered by the fighting. Feeling that she waited long enough, Vaylin attacked the Outlander and was about to land a blow, when Valkorion himself intervened to preserver his host. He stopped time in his vicinity, but Vaylin was able to break through and regain the freedom of movement, a feat previously unseen even by her father. Having a conversation with her father for the first time since his death, Vaylin blamed him for caging her like an animal, while Valkorion insisted that they were family and what he did was to keep her safe. Valkorion then used Vaylin's conditioning on her, rendering her powerless to strike with the phrase \"Kneel before the Dragon of Zakuul\". Aware of another mental block in her mind for the first time, Vaylin became angry and confused and fled the Dark Sanctuary. At this point SCORPIO announced that she was taking control of the Gravestone and Vaylin returned to the bridge, determined to deal with yet another betrayal. She tried to attack the droid, but SCORPIO was faster and Vaylin received a shot to the shoulder from SCORPIO's blaster instead, just as the Gravestone jumped into hyperspace. Both Vaylin and SCORPIO then left the bridge. The Gravestone and the Eternal Fleet arrived in Iokath system, where SCORPIO boarded the shuttle Ridala and left, while Vaylin and her remaining soldiers went to sabotage everything they could on the Gravestone. Returning to the ship's bridge, Vaylin overpowered the Outlander's of reinforcements including Kaliyo Djannis and Aric Jorgan. The Outlander contacted the bridge again and Vaylin responded, announcing her intention to kill either Torian Cadera or Vette for one of her trophy cages. However, before she could hurt anyway, the ship was engulfed by the blinding light coming from Iokath."}, {"tag": "h4", "text": "Trapped on Iokath"}, {"tag": "p", "text": "Vaylin awoke in a metal-walled cell, with no visible exits and began angrily pacing around and using the Force to rip the panels off the walls. She then heard a familiar voice and to her surprise saw her late brother Thexan standing in front of her. Hearing her brother say that he missed her shocked Vaylin, who asked why he waited so long to manifest after his death at Arcann's hand. Thexan claimed that he wanted to help her, asking what stopped Vaylin from destroying the Outlander. Vaylin instantly became suspicious when she could not feel her brother through the Force and asked Thexan about the time he came to Nathema to bring her home. As soon as the conversation proceeded normally, Vaylin realized the deception, revealing to \"Thexan\" that it was Arcann who brought her home. Demanding to know who was impersonating her brother, she pulled together a bunch of wall panels into a projectile and telekinetically threw it at \"Thexan\", smashing a wall and revealing a way out. Outside on Iokath's surface, Vaylin destroyed several hostile droids before spotting \"Thexan\" again. She demanded to know who the impostor was and the apparition revealed itself as the hologram of ARIES, Iokath's caretaker."}, {"tag": "p", "text": "Vaylin then came across the remains of Zakuulan crews who were likewise transported to Iokath from the ships of the Eternal Fleet, which included a number of GEMINI captains. She rallied her forces to take back the Eternal Fleet, and when one GEMINI captain refused in fear, threw her over the railing. Together they fount the control consoler, from which one of the GEMINI captains released the docked Eternal Fleet warships. However, as the ships prepared to leave, they began smashing into the energy shield that completely surrounded the planet and Vaylin ordered to find and disable its source. She was then sniped by a purifier droid drone, responding by telekinetically trashing it around until the droid's limbs were all destroyed, rendering it harmless. She brought the droid with her to one of the ships, where a Knight informed her that half of the Eternal Fleet has been recaptured, while the remaining ships could be towed with the Tractor beams. Vaylin ordered the GEMINI captain to connect to the Purifier drone and access its information about ARIES, which revealed that ARIES base in the southern hemisphere was about fire a weapon that would destroy organics and the GEMINI droids alike. Vaylin ordered the Eternal Fleet to bombard that fortress, to which the Purifier drone noted that the GEMINI functioned sub-optimally due to SCORPIO's free will protocols, which had brought their senses of self-preservation to the fore, to the point of questioning or outright ignoring Vaylin's orders. However, the Outlander's team then disabled the planetary shield, allowing the Eternal Fleet to escape. Vaylin insisted on killing her enemies first and ordered the Purifier drone to override the GEMINI captain's programming, restoring it to the default setting. The superweapon exploded and threatened to cover Iokath in radiation, which prompted Vaylin to flee into hyperspace with the majority of the fleet, while leaving behind several vessels to pursue the Gravestone and its crew. The contact with the pursuit vessels was lost and Vaylin, determined to have a fleet that obeyed her without question, brought the Purifier drone with her back to the Zakuul, where she plugged it into the Eternal Throne. The purifier used the connection to reprogram every single GEMINI unit, which Vaylin tested by ordering one ship in the fleet to destroy another, which it did without hesitation. Satisfied with the result, Vaylin then smashed the Purifier into dust."}, {"tag": "h4", "text": "The Grand Festival"}, {"tag": "p", "text": "With her full control over the GEMINI captains restored, Vaylin send the Eternal Fleet to hunt down and destroy Alliance patrols, outposts and supply convoys. She also wasted no time trying to break her mental blocks and ordered Jarak to return to Nathema and find a way to undo the conditioning he put on Vaylin, making it clear that the price for failure would be death. To celebrate her achievements, Vaylin ordered her Magistrate of Revelry Indo Zal to organize a a Grand Gestival at the Palace of the Eternal Dragon in her honor. During the party, Vaylin planned to execute a host of captured Zakuulan rebels by feeding them to wild beasts. Shortly before the party started, Vaylin experienced Valkorion's spirit appearing in the room with her, who then attempted to break her further by activating her conditioning with the phrase \"Kneel before the Dragon of Zakuul\". Vaylin instinctively drew her lightsaber, but only other being physically present in the room was Indo Zal, who informed her that everything was ready for the party and that the rebels were adorned with shock collarss, the controls for which were given to the Empress. Vaylin later received a holocall from Jarak, who informed her that a breakthrough had been made in his research efforts, and Vaylin responded that she would depart to him as soon as the rebels were dealt with. However, she then spotted Indo Zal sneaking around and realized that he was working against her with the Alliance, fitting him with a shock collar of his own. Ahead of schedule, Vaylin made her address to the gathered social elite of Zakuul, which was also broadcast across the galaxy through the numerous holocameras. At this point, the Outlander and his Alliance ally Theron Shan revealed themselves to Vaylin, mocking her in front of the crow and causing her to drop the prisoners inside the beast den. Vaylin intended to use the Force to smash the two with heavy mental ornaments, but the Outlander triggered her conditioning, causing Vaylin to lose control of her powers in front of everyone, before detonating the Ion charges they have attached to the security relays. The ion blast disabled all electronics nearby, including the prisoners' shock collars, which left them free to attack, and the locks that kept the wild beasts in place, releasing them into the crowd of civilians and the Knights of Zakuul. Vaylin drew her lightsaber and prepared to face the Outlander in combat, but at this point Arcann joined the fray with a group of his loyalists, arriving in a shuttle and launching at attack on the palace. Seeing her brother, Vaylin retreated from the main palace room and went to a remote balcony, smashing all holocams in her way. Arcann approached Vaylin at the balcony and tried to talk her down peacefully, but Vaylin was convinced that her brother was complicit in her conditioning and attacked him in a fit of rage. The two engaged in a lightsaber combat, which was interrupted by the arrival of the Outlander and Theron Shan. Seeing a chance to leave Arcann alone with their father's vessel, Vaylin threw a speeder bike at him, which she then used to escape to her flagship. There, she witnessed a galaxy-wide holographic broadcast of Arcann swearing his loyalty to the Outlander's Alliance. Enraged, Vaylin ordered the Eternal Fleet to bomb the entire Palace to rubble, Force-chocking a Horizon Guard who dared mention her supporters still inside. The Outlander and Arcann managed to escape, while Vaylin took her flagship to Nathema, leaving Zakuul in a state of chaos between her supporters and those who had risen up in rebellion."}, {"tag": "h4", "text": "Breaking of chains and downfall"}, {"tag": "p", "text": "Willing to go to any lengths to break her mental conditioning, Vaylin returned to Nathema system. A shuttle took her and a host of the Horizon Guard down to the Sanitarium's entrance, where she was greeted by an Abyssin Keeper, who informed Vaylin that Jarak was waiting for her inside his laboratory. The Empress ordered the Horizon Guards to wait outside and ventured inside, reaching the habitat in which Jarak kept his twisted experiments. A trio of mutated Acklays encircled her and threatened to attack, at which point Vaylin discovered that her access to the Force was blocked by the void of Nathema and had to use her lightsaber to slice the beasts down. Jarak arrived to witness the scene and noted that the beasts attacked the Empress because they responded to her fear and hatred, informing Vaylin that everything was prepared in the main lab. There, Vaylin witnessed a large circular arena surrounded by massive energy orb nodes and tended by Nathema Zealots, which Jarak ensured would break her bonds provided she did not die. Vaylin inquired whether any of Jarak's previous test subjects survived and even after the Anomid admitted that none were strong enough, agreed to proceed. The pillar orbs pierced Vaylin's body with energy beam, dealing her enormous pain, and causing her power to lash out of control. As Vaylin struggled, the Force blasts emitted from her body evaporated several Keepers and Zealots, which Jarak himself had fled to save his life. Now all alone at the mercy of Jarak's inventions, Vaylin continued to suffer unbearable pain, erupting energy waves that threatened to destroy the entire Asylum. Finally, determined not to die in the place she hated so much, Vaylin gathered all her remaining strength and overpowered Jarak's machines, causing them to explode one by one and freeing her from their grasps. As soon as the pain stopped, Vaylin could tell her bonds has been broken and departed the surface of Nathema. Upon her return to the flagship, a Horizon Guard inquired whether the Empress found what she was looking for, to which Vaylin replied by Force Crushing everyone else on the bridge and using her newfound power to remotely trigger the Sanitarium's destruction, before ordering her ships to leave Nathema's orbit. She then set out for Odessen with the entire Eternal Fleet, intending to put an end to the Alliance for good."}, {"tag": "p", "text": "No longer chained by her conditioning, Vaylin immediately launched an assault on Odessen, intending to wipe the Alliance and her entire family that opposed her. Her attack came at an inauspicious moment for the Alliance, as the Gravestone was grounded and could not take off before the upgrades obtained from Iokath had been installed. Without the Gravestone, the Alliance fleet was unable to prevent Vaylin's ground forces from landing, and soon World thrashers were clearing out landing spots in Odessen wilderness, at which Zakuul Hovercrafts were deploying both troops and a massive number of the Eternal Empire Walkers. The Alliance's ground forces were outnumbered by the overwhelming force of Vaylin's legions, but still displayed unexpected resistance. Overseeing the battle from her flagship's bridge, Vaylin was ensured that while her victory was inevitable, Eteral Empire casualties would be high, and ordered to pay whatever cost was necessary. Later, the Gravestone was able to take off and join the fleet battle, after which Vaylin received a call from the Outlander, who used taunts to lure her down to the surface for a direct confrontation. Down on Odessen, Vaylin captured one of the Outlander's allies as a hostage and invited Valkorion's vessel to face her on the Alliance base landing platform. There, Vaylin faced Senya, Arcann and the Outlander with a host of skytroopers and Horizon Guards at her side, asking what was it that Valkorion saw in the Outlander. Her father then appeared in front of her, calling Vaylin not worthy of the Eternal Throne and not fit to rule the Eternal Empire, to which Vaylin reacted by throwing her hostage at the Outlander in a gesture of contempt, while reaching out with the Force to snap the unfortunate fighter's neck at the same time. Vaylin then engaged her mother, brother and the Outlander in combat and after she was seemingly defeated, let her power rage out of control, causing a massive Force Storm. Having no other way to stop her, the Commander was forced to strike Vaylin down, ending her life."}, {"tag": "h3", "text": "Post-mortem"}, {"tag": "p", "text": "Upon Vaylin's death, the remaining Zakuulan forces at Odessen surrendered, but with the Eternal Throne empty the GEMINI captains have reverted to their basic programming, commanding the Eternal Fleet to rampantly bombard the capital worlds of Coruscant, Dromund Kaas, and Zakuul with equal abandon. Meanwhile, Vaylin's essence was not truly gone, as her spirit was absorbed by Valkorion into the Outlander's body, giving the Immortal Emperor the key to conquer his vessel's mental defenses. As soon as the Outlander claimed the Eternal Throne, Valkorion turned on them, trapping them in the abyss of their own psyche. The Outlander resisted and Valkorion summoned Vaylin's enslaved spirit, placing her under his spell and commanding his daughter to destroy the Outlander. The Outlander battled Vaylin in the mental mindscape and prevailed, but Valkorion easily restored her spirit, after which the Outlander used a representation of Dramath's holocron to free Vaylin from her father's mind control. At this point, Arcann has joined them inside the Outlander's mind by using the physical holocron located in the Eternal Throne room. The Outlander and Arcann convinced Vaylin to join them against Valkorion, who had enslaved her in the past and would do so again, and the three of them attacked the Immortal Emperor. After toying with them for a while, Valkorion destroyed the Outlander's holocron, claiming that nothing was able to stop him. However, since his spirit was now bound to Vaylin's and shared her weakness, the Outlander used the phrase \"Kneel before the Dragon of Zakuul\" to rob the Emperor of his own strength. With Valkorion overpowered and weakened, Senya joined her children in the Outlander's mind and together the family watched the Immortal Emperor's final words and moments. Vaylin took special pleasure in using her own trigger phrase against her father, who was forced to mad ranting on his knees before the Outlander put a final end to his millennia-long existence, setting Vaylin's spirit free."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vaylin had a relatively normal childhood, being carefree and often smiling and laughing as she played with her mother in the woods. Vaylin however was never truly normal, as she displayed incredible strength in the Force since before she was even born, to the point where she preferred to use telekinesis for even the most mundane tasks. As she grew up, Vaylin became fascinated with the Force and combat, watching her brothers Arcann and Thexan sparring in the training grounds, and attempting some of those feats herself. By her teenage years, Vaylin's aptitude with the Force grew, and she began slowly changing, using the Force violently each time something troubled her, crippling household servants and Knights that served as her sparring instructors. Instead of actually addressing the problem, Valkorion's only solution was to cage Vaylin's mind and her powers, locking away most of who she was."}, {"tag": "p", "text": "The time she spend on Nathema changed Vaylin forever. Subjected to mental and physical torture to the point that the pain made her laugh, she became indifferent to the pain of others by witnessing countless deaths in front of her, even taking sadistic pleasure in their suffering. Vaylin blamed her mother for abandoning her, fixating on causing Senya harm above all else, including personal power. She retained good relationships with her brothers and remained in fear of Valkorion as his power still trumped her own, originally unaware that it was the other way around until Valkorion put mental restrictions on her. Because of the experiences on Nathema, Vaylin greatly valued freedom and her own opinion above everything else, as those two things were completely stripped from her there. Valkorion's absence during the Galactic War allowed Vaylin to have a taste of her true power, but instead of striking back she decided to bide her time leading her to side with Arcann in his coup against their father. As High Justice, Vaylin was brutal to Zakuulan Knights, killing them indiscriminately for slightest mistakes which included her dislike of odd numbers. However she was still pragmatic enough to object to Arcann's order of having the entire half all Knights killed, pointing out that killing half of their elite force would reduce their ability to deal with the Outlander. When Senya resurfaced after years in exile and allied herself with the Outlander, Arcann found himself waging a war against his own parents, while Vaylin became fixated on hurting her mother at all costs, be it physical torture of knowledge that Thexan was killed by Arcann. Vaylin committed atrocities with a calm, nonchalant tone, using them not to fuel her strength in the Dark side of the Force like Sith did, but merely because she could. Nonetheless, she remained close to Arcann as they both detested the idea of destiny and resented their father for holding them back."}, {"tag": "p", "text": "After Arcann betrayed her by stopping her from killing Senya, Vaylin felt abandoned by him as well, usurping his throne and hunting her family down across the galaxy. Usually fearless and relentless, Vaylin was shocked to learn about Valkorion's way to block her powers, displaying visible fear whenever her conditioning was used on her. Seemingly meeting Thexan on Iokath led Vaylin to a brief moment of serenity, with a small sense of nostalgia and surprise, before she quickly realized it was an impostor and became enraged at an attempt to pull her strings. Originally allying herself with SCORPIO because she related to her desire to be free to make her own choice, Vaylin became increasingly aggravated whenever the GEMINI captains refused to follow her orders out of self-preservation, eventually finding a way to revert them to the original programming. When breaking her chains on Nathema, Vaylin showed true fear when she was abandoned by everyone, but refused to die in the place she hated, making her even more dangerous. During the assault on Odessen she taunted the Outlander by killing their ally in front of them and promising to repeat it until none were left, which prompted the Outlander to strike her down. Post-mortem, however, Vaylin found that her father was the one responsible for most of her suffering, and the others. She found it in herself to join the Outlander who killed her, the brother whom she attacked and the mother whom she hated in defeating Valkorion, the ultimate evil that caused so much suffering to her family and untold number of others."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Vaylin was the daughter of the Immortal Emperor Valkorion, unaware that the Human's body was inhabited by the spirit of Vitiate, the Sith Emperor who lived for over a millennia by transferring his essence from one host to another. Vitiate's immense strength in the Force was passed over to Vaylin and surpassed even his own, making his daughter one of the few things he feared could challenge him. After Vaylin displayed incredible strength as a child, Valkorion send her to Nathema, blocking most of her power and subjecting her to mental conditioning only he knew about. Even with such restrictions, Vaylin remained incredibly strong, and she eventually overcame the limits on her power during the years Valkorion was absent. She was the only known individual capable of overcoming Valkorion's time manipulation powers, breaking free from being frozen in time by him on the Gravestone and sensing his and the Outlander's spirits present in the Eternal Throne room, pinpointing the Outlander accurately enough to stab them, with even Arcann unaware of what was going on. During her pursuit of the Outlander Vaylin effortlessly smashed a thick door that Lana Beniko, a Sith strong in the Force, took an effort to even lift. Vaylin was able to casually disrupt a massive Sun Generator and was confident of her ability to deal with Beniko and the Outlander even without her lightsaber. Because of her strength in the Force, she was not as proficient in lightsaber combat, as noted by her mother during two of their duels, with Vaylin substituting her lightsaber skill with Force attacks. Vaylin was the only being strong enough to survive breaking her chains on Nathema, causing such destruction that individual beings were vaporized and a shockwave of her power could only be blocked by the door of the Emperor's Vault, causing even Valkorion to show visible fear. With her restraints gone, Vaylin was able to cause the destruction of Sanitarium on Nathema's surface from the planet's orbit with apparently little effort. During her fight with the Outlander Vaylin caused a massive Force-storm, which the Outlander was only able to resist because of Valkorion's protection, though even the Immortal Emperor was not powerful enough to deal with Vaylin at this point."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vaylin appears in the Star Wars: The Old Republic digital expansions Knights of the Fallen Empire and Knights of the Eternal Throne, voiced by Natasha Loring. She acts as a secondary antagonist besides Arcann in the Fallen Empire and becomes the main antagonist in the Eternal Throne, eventually teaming up with player to put a final end to Vitiate after her own death. Eternal Throne signifies her ascension to the Eternal Throne of Zakuul by giving her a different outfit with exposed sleeves that show the tattoos she received on Nathema. Vaylin's character is relatively unaffected by the choices made by player as the majority of her appearances are in cutscenes that do not feature the Commander. Vaylin is featured prominently in the Betrayed cinematic trailer, released between the end of the Fallen Empire and the release of the Eternal Throne, which ends on a cliffhanger as Vaylin attacks Senya, and continues with A Mother's Hope, a short story by Drew Karpyshyn published on the game's website."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}