{"url": "Vayde_Quellium", "categories": ["Category:Legends articles", "Category:Alliance Military officers", "Category:Bothans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vayde Quellium"}, {"tag": "p", "text": "Vayde Quellium was a male Bothan who served in the Alliance to Restore the Republic on Talus during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vayde Quellium was a Rebel Alliance officer during the Galactic Civil War between the Rebellion and the Galactic Empire. After the Battle of Yavin, the young Bothan had achieved the rank of captain and was stationed in the city of Dearic on Talus. His office was located in the building of the Wideband Temp Agency, a front company for Rebel recruiters."}, {"tag": "p", "text": "By the time following the Battle of Yavin, Captain Quellium was working with Trezya Nenei, a representative of the Aggregate Civil Liberties Organization, an anti-Imperial organization on Talus. Circa 1 ABY, the A.C.L.O. was seeking to join the Rebel Alliance on a permanent basis. In the meanwhile, both the A.C.L.O. and the Rebels were in conflict with the Nightstrike Soldier Hegemony, a Talusian mercenary organization affiliated with the Empire. At some point, N.S.H. troops shut down an A.C.L.O. clinic and imprisoned the Wookiee medical officer Syirlabradawk. They also confiscated a shipment of medical supplies which were intended for the Alliance forces on Talus. Captain Quellium and Trezya Nenei therefore sent a spacer to raid the N.S.H. base. The spacer was recommended by CorSec officer Dathnaeya Loessin who wanted to determine what kind of people the Rebellion and the Empire had chosen to work with. The spacer assaulted the N.S.H. base and eventually managed to retrieve the medical shipment and rescue the medical officer, killing many N.S.H. enforcers in the process. Vayde Quellium was very grateful and tried to recruit the spacer in the Rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vayde Quellium appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Vayde Quellium was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}