{"url": "Veema", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Kyp's Dozen personnel", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Veema"}, {"tag": "p", "text": "Veema was a Human female pilot who served as a lieutenant in the New Republic–affiliated starfighter unit Kyp's Dozen during the Yuuzhan Vong War. In 27 ABY, Kyp's Dozen participated in the final stages of the Battle of Coruscant, where the squadron went up against Yuuzhan Vong coralskippers in an attempt to protect the scientist Danni Quee's vessel with its T-65XJ X-wing starfighters. Leading a trio of other pilots while trying to save a refugee freighter near the planet Coruscant, Veema died when her fighter lost its wing to opposing fire, sending her XJ X-wing crashing into the freighter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Veema was nearing her fifties during the time of the Yuuzhan Vong War, when the extra-galactic Yuuzhan Vong species invaded the galaxy to establish a new home. Veema served as a lieutenant pilot in the rogue Jedi Kyp Durron's New Republic–aligned starfighter squadron, Kyp's Dozen, which Durron was leading against the forces of the Yuuzhan Vong. In 27 ABY, the Yuuzhan Vong overwhelmed the New Republic's defenses at the latter's capital world of Coruscant. In order to protect the scientist Danni Quee, who was bringing with her to Coruscant a new jammer meant to disrupt the telepathic signals that the Yuuzhan Vong yammosk creatures produced, Durron took Veema and the rest of Kyp's Dozen on a hyperspace journey to Coruscant."}, {"tag": "p", "text": "During their trek though hyperspace in their T-65XJ X-wing starfighters, some of the pilots chatted and made wagers on who would get the most kills, with Veema and the Jedi pilot Octa Ramis being the favorites. Kyp's Dozen arrived at Coruscant to find the Yuuzhan Vong completing their conquest of the planet, and multiple coralskippers engaged Veema and the squadron after Quee's ship and her other escorts arrived nearby. During the fighting, a Corellian refugee freighter trying to escape the Coruscant system was attacked by coralskippers, with the freighter leading its pursuers toward Quee's ship. To protect Quee and save the freighter, Durron ordered Veema and the three pilots under her command to get the freighter out of the fighting. However, while dealing with the coralskippers, Veema's X-wing starfighter lost a wing to enemy fire, causing her ship to spin out of control and crash into the freighter, which killed Veema and the occupants of the refugee ship. Kyp's Dozen suffered massive casualties during the fighting, with all but Durron, Ramis, and two other pilots perishing, though Quee and her vessel survived."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "At the time of her death, Veema was plump and pretty in appearance. She had a sense of fun that became well known in certain groups, and her inviting smiles in taverns frequently led to fights. Veema admired youth, handsomeness, and recklessness in men, developing a reputation for going through males of any species quickly in romantic endeavors. Despite her sense of fun, Veema held grudges for a long time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Veema appeared in Elaine Cunningham's Dark Journey, a 2002 installment of The New Jedi Order series of novels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}