{"url": "Veermok/Legends", "categories": ["Category:Legends articles", "Category:Creatures of Naboo", "Category:Food creatures", "Category:Jungle and forest creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Primates", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Veermok"}, {"tag": "p", "text": "The veermok was a large, ferocious primate native to the Gungan swamps and woodlands of Naboo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The veermok lived around the fringes of the swamp and woodlands hunting prey, such as jimvu, hrumph calves, and narglatch cubs, through stealth and surprise. They avoided deep water, as they were weak swimmers. They also had a unique bounding movement that took advantage of powerful upper torso and shoulder rotation, along with strong lengthy arms that dwarfed their skinny hind limbs. A veermok also had powerful, tri-tipped claws for gouging and grabbing."}, {"tag": "p", "text": "The hair on a veermok's back and chest provided protection and insulation. Their hair rose on their back when alarmed or angered. Hairless lower anatomy allowed for easy hygiene."}, {"tag": "p", "text": "Veermoks were generally solitary, unless mating. Mates apparently formed a bond during the time in which they were together. If one mate was killed, the remaining mate would take revenge on whatever or whomever was responsible. They were usually semi-territorial, but not always, defending turf from other veermoks. Females mated once a year, building nests on the ground in a bed of leaves and branches. The veermok had a gestation period three months. They usually gave birth to twins, which in most cases were immediately abandoned by their mother, unlike the more nurturing rancor. It appears that in a few unusual cases a mother would care for her offspring, at least for a short time. Forced to fend for themselves, abandoned twins matured quickly. Veermoks had an unusual resistance to blasters, thus the Systech Corporation created a line of electrical weapons to deal with them. They were also popular holopets."}, {"tag": "p", "text": "Veermok meat was comestible. The cookbook Essential Cooking Skills detailed how to best cook that meat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the last decades of the Old Republic, a cave that was mined by Jandosan Mines for its ore was overtaken by a pack of giant veermoks."}, {"tag": "p", "text": "After the Battle of Yavin, Mauler beast masters trained veermoks for fighting."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}