{"url": "Belnar_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Belnar sector", "Category:Colonies sectors", "Category:The Slice sectors"], "nodes": [{"tag": "h1", "text": "Belnar sector"}, {"tag": "p", "text": "The Belnar sector was located in the Colonies and contained the planet Belnar, the homeworld of the Khil species. The Khil developed hyperspace travel technology early on, and Belnar became a member of the Galactic Republic and later its successor, the Galactic Empire. Eventually, the Belnar Sector Force engaged and defeated the rival Peltsic League in many skirmishes in Belnar space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Belnar sector was located in the Slice portion of the Colonies. It contained the Belnar system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Khil, a species native to the planet Belnar, developed hyperspace travel technology by 25,000 BBY. The area of space surrounding the Belnar system was fully explored by 20,000 BBY, although by that time Belnar had already been a member of the Galactic Republic for at least two millennia. During the first campaigns of the Clone Wars of 22 BBY–19 BBY, the Third Army of the Republic Military was tasked with defending Belnar's vicinity against the military forces of the Confederacy of Independent Systems."}, {"tag": "p", "text": "By 17 BBY, the Belnar system was controlled by the Galactic Empire. The worlds inhabited by the Khil were assigned Imperial governors but looked to their former leaders for guidance, and Imperial stormtroopers stationed on Khil worlds remained wary of the general populace due to the Khil viewing the Empire as oppressive. By 2 ABY, the Khil tactician and naval commander Tarlo Ganar led the Belnar Sector Force to victory over its inter-system rivals, the Peltsic League, in many skirmishes that took place in Belnar space. Following the fragmentation of the Galactic Empire in 4 ABY, the Khil living on Belnar and elsewhere became one of the first members of the New Republic."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Belnar sector's namesake planet was the homeworld of the sentient Khil species. At least one Khil, Commander Tarlo Ganar, was a part of the Belnar Sector Force."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Belnar system of the Belnar sector contained the terrestrial planet of the same name, which was home to the sentient Khil species. From approximately 22,000 BBY to 3996 BBY, the Belnar system was situated on a hyperlane that connected it to the Carida and Yabol Opa systems; however, that hyperspace route had ceased to exist twenty years later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Belnar sector was first mentioned in the sourcebook Alliance Intelligence Reports, published in 1995 for use with West End Games' Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}