{"url": "Vehicle_Command_Crewer", "categories": ["Category:Legends articles", "Category:Imperial Army pilots", "Category:Imperial military specializations"], "nodes": [{"tag": "h1", "text": "Vehicle Command Crewer"}, {"tag": "p", "text": "Vehicle Command Crewers, also known as Imperial Army pilots, were the Galactic Empire's support personnel responsible for the operation and maintenance of a variety of vehicles, such as the AT-AT and AT-ST, within the Imperial Army."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Imperial Army pilots were usually unarmed, but on occasion, senior NCOs or officers would have a standard issue BlasTech SE-14r light repeating blaster, Thermal detonators, Concussion grenades and possibly even a Merr-Sonn V-6d mortar launcher."}, {"tag": "p", "text": "Imperial Army pilots usually did not wear armor due to protection given by Imperial vehicles, but higher ranking NCOs and commissioned officers often wore some protective armor into combat. This was the case with General Maximilian Veers at the Battle of Hoth. They had numerous amounts of vehicles assigned to them including the AT-ATs and the AT-STs."}, {"tag": "p", "text": "The pilots were split into at least two branches: Heavy Armor and Armored Cavalry."}, {"tag": "h2", "text": "AT-AT pilots"}, {"tag": "p", "text": "Selected from hardened combat troopers, the Heavy Armor division of the Vehicle Command Crewers, also known as AT-AT pilots, were specialized soldiers that were trained to pilot the All Terrain Armored Transport or other heavy armors in blatant \"shock\" tactics, attacking their enemy in plain sight after having landed at great distances from their intended targets. In large part because of the AT-AT being widely perceived to be invincible during combat, the AT-AT pilots were also conditioned to believe themselves invincible."}, {"tag": "p", "text": "AT-AT drivers typically worked in teams of two, and they were in charge of everything from guiding the massive walkers over all types of terrain, to firing the AT-AT's powerful heavy laser cannons, to carrying out the orders given to them by the combat coordinator, who also occupied the cockpit."}, {"tag": "p", "text": "The task of guiding the walkers over uneven terrain was a difficult challenge, and to ensure that the pilots of these massive war machines were the best of best, they were put through many hours of simulation tests and similar instruction. Because of their armored cockpits and their commanding view of the battlefield, their training stressed their importance on the battlefield, which gave many pilots the idea that they were invincible. This enlarged ego led to many pilots developing an arrogant attitude when dealing with the infantry. They received their orders from a combat coordinator who was also stationed on the AT-AT's bridge."}, {"tag": "p", "text": "AT-AT pilots were very similar in appearance to Imperial TIE pilots, though retained a color scheme that was reminiscent of the Phase II clone pilot attire, being a light grey flight suit complete with webbing, along with white gloves, boots and helmet, with the boots and overall suit in particular being insulated, and even possessing armor, although the armor was considered unnecessary by the Galactic Civil War. The helmet was reinforced, and bore the Imperial Army emblem on both sides. Although not required in the pressurized environment of an AT-AT cockpit, the operators at the controls of an AT-AT utilized life support gear that would ensure their survival in the event of a hull breach in a hostile environment, as well as out of respect for their combat history. The helmets were connected directly to vehicle's computer, allowing easy monitoring of its vital systems. A computer on their chest armor heated their suit and helmet, with controls to change the level of heat for the suit. The life support system also contained an identity chip, as well as an energy monitor, and connected to the helmet via pressurized air hoses. The suit also contained gear harnesses. The survival pack worn by these pilots was an advanced design which enabled the suit systems and heater to run off a single power pack via maximum output for up to five days without requiring a recharge. They wore driving gauntlets with a comlink on the left wrist for communication. These pilots were usually armed with a blaster pistol and grenades. The uniform also had an insulated variant that is worn when undergoing missions requiring venturing into frozen terrain such as on Hoth, as the AT-ATs themselves are not climate-controlled."}, {"tag": "p", "text": "Like all AT-AT crews, the pilots lived and worked in their machines over much of each mission. It was common for them to even involve themselves in the maintenance of the walkers, reinforcing the theory that the crew was an extension of the walker and vice versa."}, {"tag": "h3", "text": "Notable AT-AT pilots"}, {"tag": "h2", "text": "AT-AT swimmer pilots"}, {"tag": "p", "text": "AT-AT Imperial swimmer pilots were specially trained AT-AT drivers used for piloting AT-AT swimmers. They operated swimmers on aquatic worlds. In 137 ABY they were used in the Genocide on Dac, under command of Darth Krayt, serving his Sith Empire. The uniforms they wore were almost identical to the ones worn by standard AT-AT pilots a century ago, with the only differences being that the Swimmer pilot jumpsuits were black, not white, and their armor was unmarked with the Imperial insignia. They were not known to use any weapons. Only one was needed to pilot each swimmer."}, {"tag": "h3", "text": "Notable swimmer pilots"}, {"tag": "h2", "text": "AT-ST pilots"}, {"tag": "p", "text": "The Armored Cavalry division of the Vehicle Command Crewers, also known as AT-ST pilots, were utilized for operating AT-STs as well as other armored cavalry. They were trained to have an incredible sense of balance and terrain, due to the All Terrain Scout Transport's bipedal locomotion instability compared to the quadruped AT-AT. In addition, the position was only given to the most talented of Imperial recruits."}, {"tag": "p", "text": "They wore black boots with a black bottom and a gray jumpsuit with pockets. Their helmet was open-faced with a chinstrap. Their uniform included goggles, attached by a strap to the back of the helmet, and long black gauntlets. Both shoulder portions of their jumpsuit had the Imperial emblem in black. They carried concussion grenades, a blaster pistol, a blaster rifle, emergency flares, spare ammunition, a comlink, and two thermal detonators, which were coded with blank keys in case they fell into enemy hands. Compared to the Heavy Armor crewers, the Armored Cavalry wore a lightweight battle dress. Overall, the uniform resembled that of the Imperial Army trooper."}, {"tag": "h3", "text": "Notable AT-ST Pilots"}, {"tag": "h2", "text": "AT-PT pilots"}, {"tag": "p", "text": "AT-PT pilots operated inside the All Terrain Personal Transport. They were also trained to have an incredible sense of balance and terrain. Although protected by the AT-PT's armor, they still wore armor in case the vehicle was destroyed. They carried standard Imperial sidearm pistols, blaster rifles, and grenades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Battlefront II, the AT-AT pilot is referred to as an \"Imperial engineer\" on Hoth.\nIn a Star Wars Miniatures pack, Imperial Entanglements, the 181st Imperial Fighter Wing pilot looks just like the AT-AT pilot,\nrather than its normal colors."}, {"tag": "p", "text": "The Imperial Sourcebook calls the crewmen of ground assault vehicles Imperial Army Assault Trooper. It states that they are trained in the operation of a variety of ground assault vehicles and wear the Army trooper gray uniform and partial body armor. However the AT-ST crew seen in The Return of the Jedi doesn't wear field armor, while The Empire Strikes Back AT-AT crew wears a different uniform."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}