{"url": "Veild-danol", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Merchants", "Category:Yarkora"], "nodes": [{"tag": "h1", "text": "Veild-danol"}, {"tag": "p", "text": "Veild-danol was a male Yarkora independent merchant who operated a regular trading route on the edges of the Kathol sector in the Outer Rim Territories during the early years of the New Republic. For many years, he was the only regular source of contact between a large number of planets and the outside galaxy, and he amassed a great deal of knowledge about the Kathol sector. A collector of religious artifacts, Veild-danol occasionally used his standing amongst local communities to acquire new pieces for his collection."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Yarkora Veild-danol was an independent merchant who traveled along the edges of the Kathol sector in the Outer Rim Territories, plying his trade on a regular trading route. His route took him to the planet Galtea, among others, as well as several planets not featured on any official star-charts. As such, the Yarkora's monthly trading stopovers were the only contact that some worlds had with the outside galaxy. Veild-danol knew many beings, and was treated with a large amount of respect by the communities he traded with."}, {"tag": "p", "text": "Aware of the amount of influence he wielded on some planets due to his position as their only off-world contact, Veild-danol would occasionally take advantage of that fact and make unreasonable requests. He had a fondness for collecting religious artifacts, although he did not believe in any organized religion or spiritual higher power at all, and would make requests to the cultures he visited to obtain new pieces for his collection. Veild-danol saw them as collectibles, in the same way as another being might regard art or souvenirs. He would even go as far as posing as a curious scholar to get items he desired. Over the years, Veild-danol created his own set of astrogation charts of the Kathol sector, and was willing to trade them for any curious trinkets or artifacts."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Veild-danol had brown skin, white hair and orange eyes. Elderly by 8 ABY, he was stuck in his ways, and expected to be respected by everyone around him. When meeting an individual for the first time, the Yarkora would often test the limits of their patience. Although he projected a civilized veneer, Veild-danol was cynical and manipulative, using his position to obtain that which he wanted. Despite this, he was a being who needed to be needed—people had to owe him favors and rely on him for him to feel any sense of self-worth."}, {"tag": "p", "text": "Veild-danol was trained in melee combat, and usually carried a hold-out blaster and a hidden vibro-shiv for self-defense. Due to his years plying the spacelanes, he had a lot of knowledge regarding alien species, languages and planetary systems. Veild-danol had an understanding of the workings of a bureaucracy, and was a shrewd businessbeing. He could fly and repair transports, and operate their weapon systems, as well as navigate through hyperspace. The Yarkora was also skilled in droid programming and repair, and first aid. In addition to his weapons, Veild-danol carried a comlink and medpac, and often wore a cloak."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Veild-danol was introduced in the \"Rogues Gallery\" section of The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games. Intended as a Gamemaster character that could be used to help the player characters if they needed it, Veild-danol could be used to obtain new astrogation charts, or to introduce new DarkStryder technology to the characters."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}