{"url": "Velcar_Imperial_remnant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial remnants"], "nodes": [{"tag": "h1", "text": "Velcar Imperial remnant"}, {"tag": "p", "text": "Following the Battle of Endor and the destruction of the second Death Star, various Imperial splinter factions arose in the wake of Emperor Sheev Palpatine's death. One such remnant faction established itself in the Velcar sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4 ABY, the Galactic Empire suffered a devastating defeat over Endor at the hands of Rebel Alliance, ultimately resulting in the destruction of the second Death Star and deaths of both Emperor Sheev Palpatine and his enforcer Darth Vader. This resulted in the Imperial fleet becoming scattered, and, as a consequence of the Emperor's demise, the creation of a massive power vacuum. As the Empire struggled to appoint a new leader, various splinter groups and remnant factions began to separate themselves from the central authority on Coruscant. It was during this time when Governor Ecressys, an Imperial official in the Velcar sector, sought to cement his own ultimate authority, causing him to establish his own ascendancy in his region."}, {"tag": "p", "text": "Ecressys locked down his domain in order to ensure that news of the war did not reach the ears of the populace. Similarly to Governor Ubrik Adelhard of the Anoat sector did, Ecressys lied to his subjects by informing them that news of the Emperor's death was nothing more than rebel propaganda."}, {"tag": "p", "text": "The Galactic Empire surrendered to the New Republic and the two factions signed the Galactic Concordance, which stated that remaining Imperial Navy was to relocate into boundaries defined by the treaty in the Core Worlds and Inner Rim. By the time that the New Republic arrived in the Velcar sector to announce its victory, the sector had no governor to lead them as Ecressys had fled to the Western Reaches with the wealth of hundred of worlds, after raiding the treasuries of the worlds he controlled."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}