{"url": "Veltzz_Arakyd", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Veltzz Arakyd"}, {"tag": "p", "text": "Veltzz Arakyd was a male industrialist who founded the droid, starship and weapons manufacturer Arakyd Industries with his children on the planet Vulpter around nine thousand years before the Battle of Yavin. Even in the company's earliest days, Veltzz dedicated himself to eliminating competetion no matter the means. His earliest droid models were equipped with weaponry, flouting Old Republic laws that regulated the manufacture and sale such of droids. The weaponry intimidated rivals, ultimately inducing many to become subsidiaries out of fear. By the rise of the Galactic Empire, Veltzz engaged in political maneuvering, bribery and elimination of his competitors to position Arakyd Industries as the Empire's main droid manufacturer. The loyalty of Veltzz and his company eventually won Arakyd contracts for weapons and vehicles as well. With the dawn of the New Republic, he briefly retired from the public view to regroup and Arakyd Industries changed to new leadership."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Veltzz Arakyd was a ruthless businessman who was willing to use any means necessary to eliminate competitors. He was known for tactics including bribery, bullying and intimidation to advance his company's interests."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Veltzz Arakyd's namesake company Arakyd Industries was first mentioned in the 1987 roleplaying game sourcebook The Star Wars Sourcebook, written by Bill Slavicsek and Curtis Smith. Arakyd was later identified as the company's founder in Del Rey's 2004 reference book The New Essential Guide to Weapons and Technology by W. Haden Blackman."}, {"tag": "p", "text": "Although The New Essential Guide to Weapons and Technology stated that Veltzz Arakyd founded Arakyd Industries some nine thousand years before the Battle of Yavin, it also indicated that he lived during the Imperial and Post-Imperial periods. It's unclear whether this was an error or if other factors account for Arakyd's long lifespan."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}