{"url": "Velusia/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Type I atmosphere planets", "Category:Velusia locations", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Velusia"}, {"tag": "p", "text": "Velusia was a planet in the Velus system of the Core Worlds. Largely oceanic, it supported a wide variety of life. Rocky, volcanic islands near the equator supported a population including the Aquar, a native Near-Human species."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Velusia was located in the Velus system of the Core Worlds, at the coordinates L-9. It was the second planet from the star Velus and had two moons."}, {"tag": "p", "text": "Most of Velusia's surface was covered with salty oceans. The only landmasses were scattered, rocky, and largely volcanic islands in the equatorial regions. The land was unstable, wracked by groundquakes and volcanic activity. Numerous coral atolls were present in shallow water near the islands, and the oceans were covered in ice near the poles. Velusia's oceans were rich in suspended ores."}, {"tag": "p", "text": "Velusia was the homeworld of the near-Human Aquar. The oceans supported plankton, algae, and fish, while the rocky islands supported lichens, small shrubs, and avians."}, {"tag": "p", "text": "Due to the land's rocky terrain, most of the planet's food was imported, although a major export was fish. Mount Hollow was the planet's largest city and the location of its only starport."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Velusia was originally inhabited by a group of Humans who established colonies on several of the planet's islands. Over time, they formed a tribal system, eked out a subsistence living by harvesting food from the oceans and raising herd animals, and developed traits suitable for their environment, evolving into the Aquar."}, {"tag": "p", "text": "Thousands of years later, Velusia was discovered by scouts from the Nexcore Mining Corporation (NMC), which purchased rights from the Aquar to explore for ore deposits and established a starport and the city of Mount Hollow in the shaft of an extinct volcano. Many Aquar were hired as scouts, guides, and laborers. The NMC discovered ore and attempted to keep its knowledge of the discovery secret until the terms of the lease, which required the corporation to share its profits with the Aquar, had expired."}, {"tag": "p", "text": "Velusia joined the Galactic Republic prior to the Indecta Era. During the Alsakan Conflicts, it supported Alsakan."}, {"tag": "p", "text": "During the Rebellion era, the Galactic Empire established an aggressive oceanic harvesting program on Velusia. It was rumored that a hidden Rebel cell was located on one of the planet's islands. By 6 ABY, the planet had become an Imperial fortress world. Velusia remained under Imperial control until at least 7 ABY and was later attacked and conquered by the Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The near-human Aquar were native to Velusia and originally inhabited the islands in loose tribes, but later most of them shunned the traditional lifestyle and lived in Mount Hollow. The planet had a population of 2.8 million, with a majority of 68% being Aquar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Velusia was created by author Chris Doyle for the book Coruscant and the Core Worlds."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}