{"url": "Vemrin", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Vemrin"}, {"tag": "p", "text": "Vemrin was a Human male acolyte at the Sith Academy on Korriban during the Cold War, seeking to become the apprentice of Darth Baras."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Originally from Balmorra, he and his friend Dolgis were brought to Korriban to become Sith acolytes, in accordance with the law that all Force-sensitives in Imperial territory be trained at the Academy. Vemrin became a self-proclaimed enemy of the new acolyte tutored by Overseer Tremel. Vemrin sent Dolgis to ambush and attack the new acolyte, but the latter would survive this encounter. During their final trial, Vemrin was ordered to go to Baras' quarters and await further instructions, while his rival ventured into the Tomb of Naga Sadow to retrieve an ancient lightsaber. Vemrin disobeyed Baras and sought to kill the acolyte in the tomb, but his arrogance proved to be his undoing as his rival managed to kill him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vemrin was both ruthless and strong in the Force, having already earned some favor with Baras by the time Tremel's protégé arrived in Korriban. He considered himself superior to the newcomer because, while the Sith Warrior had been handed every advantage by Tremel, Vemrin had to fight and compete for his status on Korriban. Thus, Vemrin felt he had earned his place. He wielded a Sith warblade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After defeating Vemrin, the player can choose to kill him without another word (dark side dialogue) or call him a worthy opponent (light side dialogue). If the latter dialogue is chosen, Vemrin refused to be pitied and asked for an honorable death, which the Warrior then provides him. Either way, he will die nonetheless."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}