{"url": "Velmor/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Halori sector planets", "Category:Low-gravity planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Velmor"}, {"tag": "p", "text": "Velmor was the third, terrestrial planet in the Velm system in the Mid Rim near Myrkr, Obroa-skai and Aquaris."}, {"tag": "p", "text": "Its diameter was 11,788 kilometers, and its gravity was slightly below standard, at 0.92. A Velmorian day was 26 standard hours, and its year 297 local days."}, {"tag": "p", "text": "Velmor was home to two sentient species: native insectoid Velmoc and Basic-speaking Human colonists known as Velmorians, although the former were nearly extinct by 3 ABY, making up a scant third of a percent of the population."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Human colonists from the Empress Teta system arrived on Velmor around 1000 BBY, settling amongst its calm grasslands. Despite its proximity to Obroa-skai, Velmor went relatively untouched after its colonization, falling into deep isolation. As a result, the Velmorians became dependent on imports of technology. A benevolent monarchy, reminiscent of the Tetan model, was established and ruled the world from the planetary capital of Den Velmor. The Velmorian society that developed placed a high value on the fine arts, exporting much of their artwork and literature to far-off worlds. The Velmorian economy was buoyed by exports of velmstone, local foodstuffs, and precious stone and metals. As the colonists expanded to establish small villages and farms away from Den Velmor, the Velmoc retreated to the Tol Velmoc mountains."}, {"tag": "p", "text": "When the Galactic Empire learned in 17 BBY that King Lorac supported the ideals of the Rebel Alliance, a plot was hatched between the Lord Regent, Zelor, and the Imperial Diplomatic Corps to place a prince friendly to the Empire on the throne. A mob was paid to assault and kill the king and Queen Denira, sparing the Imperial-influenced Prince Anod. But Denid, the crown-prince, and his Alderaanian bride escaped offworld to Tantajoc V with the aid of Denid's Velmoc servant, Jedidiah. A Velmorian tradition of waiting twenty years before declaring a missing prince dead allowed Zelor to rule Velmor until 3 ABY. It was then, the Diplomatic Corps believed, that Anod would be crowned king and—with the manipulation of Captain Zeta Traal, the Imperial diplomat assigned to Velmor—the world would fall into line with the Empire."}, {"tag": "p", "text": "After the destruction of Alderaan in 0 BBY, many Alderaanian survivors made Velmor their new home, in part due to its similar society and ecology. It was during this time that both the Rebel Alliance and the Empire became aware of the strategic value of the wealth and resources of Velmor. According to the report of Zeta Traal, the planet's forest would have been used as game hunting grounds for wealthy tourists while the ore and gem mines were exploited."}, {"tag": "p", "text": "Around that time, Denid was discovered by the Rebel Alliance and escorted back to Velmor by Luke Skywalker and Leia Organa. There, with the aid of those loyal to Denid, they defeated Traal and Zelor. Denid was then crowned King of Velmor, and formally aligned the planet with the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}