{"url": "Venisa_Doza", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Alliance to Restore the Republic members", "Category:Females", "Category:Humans", "Category:Jade Squadron personnel", "Category:Resistance Military officers"], "nodes": [{"tag": "h1", "text": "Venisa Doza"}, {"tag": "p", "text": "Venisa Doza was a human female pilot who served in the Rebel Alliance and the Resistance, and the wife of Captain Imanuel Doza and mother of Torra Doza. After persuading her future husband to defect from the Galactic Empire during the Galactic Civil War, Venisa and her husband settled down as the owners of the refueling station Colossus on Castilon in the Outer Rim. However, at the beginning of the Cold War, when it became clear that the Imperial successor state the First Order was emerging as a serious threat to the galaxy at large, Venisa left her home and joined the Resistance, a paramilitary organization set up by Rebel hero General Leia Organa. Venisa saw her family once a year on Torra's birthday, but after war formally broke out between the First Order and Resistance, an attempted rendezvous with the Colossus, on the run in the Outer Rim, failed. Venisa was then captured by the First Order before escaping, missing her daughter's 16th birthday."}, {"tag": "p", "text": "Despite missing this pivotal moment in her daughter's life, Venisa was not separated from her family for long. In command of Jade Squadron, she returned to the Colossus seeking assistance for a mission to rescue stranded Resistance recruits on Dantooine. The mission was a success despite the loss of one shuttle to enemy fire, and Jade Squadron were granted a temporary berth on the Colossus. Venisa later led the defence of the platform during a skirmish in the Barabesh system, resulting in the destruction of the First Order Star Destroyer that attacked them."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "From the Rebels to the Resistance"}, {"tag": "p", "text": "Venisa, a human female, was a young woman during the Galactic Civil War, in which she fought for the Alliance to Restore the Republic as a starfighter pilot. She was good friends with one of her fellow pilots, Jarek Yeager. During the war, Venisa and Yeager met an Imperial officer named Imanuel Doza. Venisa and Imanuel fell in love while still on opposing sides, and Venisa eventually persuaded him to defect from the Empire."}, {"tag": "p", "text": "After the end of the war, Venisa and Imanuel got married, and eventually settled on the Colossus, an old Imperial supertanker fuel depot which Imanuel took over, located on the Mid Rim planet of Castilon. In 18 ABY, the Dozas had a daughter, named Torra, and they lived a happy life on the Colossus. In 28 ABY,[source?] Rebel hero Leia Organa resigned from the Galactic Senate and founded a paramilitary organization called the Resistance after discovering that an Imperial successor state called the First Order was a larger threat to the New Republic than the galactic government was willing to admit. Although Imanuel didn't want to be involved in another war, Venisa felt a responsibility to assist, and left her home to join the Resistance, something that Imanuel and Torra kept top-secret, as did Yeager, who had come to live on the station."}, {"tag": "h3", "text": "Resistance missions"}, {"tag": "p", "text": "For the next six years, during the Cold War, Venisa, flying her modified T-65B X-wing starfighter and accompanied by her astromech droid Torch, went on many adventures in service to the Resistance, including at Bakura and Lehon. On one occasion, Venisa and Torch escaped the rogue First Order Security Bureau Agent Terex by setting off explosions in a hangar and having Torch pilot a TIE/fo space superiority fighter as a diversion. She also made sure to never miss her annual meeting with her husband and daughter at an undisclosed location for Torra's birthday."}, {"tag": "p", "text": "In 34 ABY, the First Order began to target the Colossus as part of their plans for the upcoming war, desiring to use the station as a supply point for their military. Eventually, after the station's occupation, the Colossus threw off the invaders and was forced to escape Castilon to stay away from the First Order, just as the war had formally begun. Hoping to keep the annual tradition, Captain Imanuel Doza activated a signal beacon while the station was travelling through the Outer Rim so that Venisa would know where to meet. Venisa headed for the Colossus' location, but the Resurgent-class Star Destroyer commanded by Agent Tierny and Commander Pyre, which had been hunting the wayward space station, got there first. The Colossus was forced to flee back into hyperspace after a skirmish, just before Venisa's arrival at the rendezvous point."}, {"tag": "p", "text": "Venisa's starfighter was captured by a tractor beam before she could jump away, and she and Torch quickly concocted an escape plan requiring the droid to fake having been completely fried. Upon disembarking, Venisa refused a request from Tierny for her name, and was placed in a cell in the detention level. On the way there, Venisa was seen by former Colossus residents turned First Order TIE pilot cadets Tamara Ryvora and Jace Rucklin. Ryvora, a former employee of Yeager's, found Venisa's appearance oddly familiar, and later decided to confront the prisoner in her cell. Venisa had heard of Ryvora from Yeager, although they hadn't previously met, and quickly deduced that the young pilot's loyalty to the First Order was fragile and wavering, asking Ryvora to give her a reason for why she had joined the Order that wasn't a recruitment point, which Ryvora failed to do. Torch, having been thrown into a garbage pile, arrived and shocked Ryvora unconscious just after Venisa chose to reveal her identity to the young pilot, and Venisa decided to take the Kuati girl hostage to take her back to the Colossus."}, {"tag": "p", "text": "Venisa's conversation with Ryvora onboard the Star Destroyer made her further question her loyalties, and Venisa ascertained that there was hope for Rucklin to realize the truth as well after he couldn't bring himself to shoot Ryvora when she was being used as a human shield. Eventually the escape was discovered by Tierny's forces, and Venisa and Torch made it to the hangar with Ryvora in tow. Realizing that Ryvora wouldn't willingly come, Venisa orderd Torch to use the same tactic they had used to escape from Terex before advising Ryvora to stay away from the hangar and shooting her with a stun bolt. Torch planted bombs on TIE fighters in the hangar before detonating several fuel canisters and flying away in a TIE as a distraction, allowing Venisa to slip away to her X-wing. Tierny and her troops were unable to do anything to foil the escape as the ships in the hangar were blown to pieces. Venisa collected Torch in space before jumping away into hyperspace."}, {"tag": "h4", "text": "Running the Dantooine Blockade"}, {"tag": "p", "text": "Venisa and what remained of Jade Squadron were able to rendezvous with the Colossus. In Yeager's hangar, Venisa met up with Captain Doza and their daughter Torra. She then spoke with her old friend Yeager and new Ace pilot, Kazuda Xiono who admired her X-wing."}, {"tag": "p", "text": "Venisa asked her husband for help on her mission to rescue Resistance recruits on Dantooine from the First Order. Captain Doza agreed to assist her with her mission and provide with three of his Ace pilots: their daughter Torra, Xiono, and Ace pilot Hype Fazon. After assembling the team, Venisa briefed the pilots about the mission, which involved escorting three shuttles carrying Resistance recruits offworld. Following the briefing, Venisa confided with Yeager that she had seen Tamara Ryvora and reported that Ryvora was conflicted."}, {"tag": "p", "text": "The combined Jade and Ace squadrons breached the First Order's blockade of Dantooine, destroying several TIE fighters. Entering the planet's atmosphere, they managed to rendezvous with the three Resistance shuttles. Before they could depart offworld, they were attacked by Commander Pyre's Star Destroyer, which deployed several a squadron of TIE fighters led by Lieutenant Galek. During the dogfight, Venisa managed to shoot down and kill Lieutenant Galek but the Resistance and Aces suffered a blow when one of the shuttles was shot down by Jace Rucklin."}, {"tag": "p", "text": "While the Resistance and Ace pilots were dismayed by this setback, Venisa reassured them that loss was an inevitable outcome of war and that they only failed when they lost hope. Yeager backed her up and said that the fact that the recruits made it out counted as a victory. Venisa spoke with her husband who decided to commit the Colossus's resources to supporting the Resistance, opining that he had enough of running from the fight. Venisa was pleased with her husband's decision and the two subsequently welcomed the new Resistance recruits."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Venisa Doza was both personally brave, fighting in two wars for the sake of the galaxy, and laid-back, showing no concern upon her capture by Agent Tierny. She was also a good judge of character, realizing that Ryvora's loyalty to the First Order was on shaky ground and that the girl could be swayed. Venisa wanted to make things better, both for people she knew — such as her eventual husband Imanuel — and the galaxy at large, for which cause she left her family to join the Resistance. She also shared many character traits with her daughter Torra, to the extent that upon having her described to him, Kazuda Xiono, who had never met Venisa, immediately commented to Yeager that she reminded him of Torra."}, {"tag": "p", "text": "Doza was also a capable leader and speaker who was able to motivate her subordinates. As an optimist, Doza encouraged her pilots to focus on their achievements rather than dwell on their losses."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Venisa was a highly skilled pilot and combatant, capable of escaping from forces of the First Order, such as Agent Tierny's Star Destroyer or the forces of the rogue Agent Terex, with only Torch to assist her. As part of this, she was good at making up plans on the fly, such as after her capture during the failed birthday rendezvous."}, {"tag": "p", "text": "Doza was also competent leader who was able to inspire confidence and morale in her pilots. She was also a skilled combat pilot and shot down several TIE fighters including Lieutenant Galek's fighter."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Venisa Doza, by the time of the First Order–Resistance war, owned a modified T-65B X-wing starfighter she'd altered herself, as well as her astromech droid Torch, also an older model."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Venisa Doza was first mentioned, unnamed, in the reference book Star Wars: Women of the Galaxy, which revealed her past as a Rebel pilot. She first appeared and was named in the Star Wars Resistance season 2 episode \"Rendezvous Point,\" where she was voiced by Tasia Valenza. Doza's X-wing was designed by ILM veteran Bill George."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}