{"url": "Vendaxa", "categories": ["Category:Canon articles", "Category:Arboreal planets", "Category:Expansion Region planets"], "nodes": [{"tag": "h1", "text": "Vendaxa"}, {"tag": "p", "text": "Vendaxa was a fertile planet located in the Expansion Region of the galaxy. It was the homeworld of the acklay, a non-sentient species of crustaceans that inhabited the planet's lush plains."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vendaxa was a lush world, covered in forests and plains. It was the home of a creature known as an acklay, an amphibious creature that was often used in gladiatorial battles throughout the galaxy. It lived in the waters of Vendaxa but also hunted lemnai, which inhabited the planet's plains. The planet was also home to the Vendaxan land squid, a territorial creature that became particularly aggressive during its mating season."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3 ABY, Darth Vader and the droid ZED-6-7 traveled to the planet, where they encountered a group seemingly led by the late Padmé Amidala. After warding off a cluster of land squids, the duo discovered that she was actually Amidala's former handmaiden and decoy, Sabé. They left the planet together to uncover the secrets surrounding the senator's death."}, {"tag": "p", "text": "Sometime after the Battle of Crait, the First Order undertook a mission to Vendaxa, having received intel regarding a Resistance presence on the world. By order of General Armitage Hux, a group of stormtroopers was gathered to investigate the planet, but Supreme Leader Kylo Ren dismissed them, overseeing the mission personally. Accompanied by Hux, Ren found no trace of the Resistance. After a brief encounter with an acklay, the pair left the planet empty-handed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vendaxa was first mentioned in Star Wars: Attack of the Clones: The Visual Dictionary, a Star Wars Legends reference book written by David West Reynolds that was released on April 22, 2002. It later appeared for the first time in Legacy 5, part of the Star Wars: Legacy comic series. The planet became a part of the rebooted canon when it was mentioned in Ultimate Factivity Collection: Star Wars, a young readers activity book written and edited by David Fentiman and Sadie Smith that was released on June 16, 2014."}, {"tag": "p", "text": "The planet orbited by the moon of Kyzring in the Star Wars Adventures 31 story \"Squad Goals\" shares geographical features with Vendaxa as depicted in the story \"Loyalty Test.\" However, it has yet to be confirmed whether that is actually Vendaxa or not."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}