{"url": "Vengeful_Sandstorm", "categories": ["Category:Legends articles", "Category:Articles with unencyclopedic tone", "Category:Corellian Engineering Corporation products", "Category:Pirate starships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Vengeful Sandstorm"}, {"tag": "p", "text": "Vengeful Sandstorm was a modified SS-19 cargo transport owned by Armanda Durkin of the Notsub Shipping Company sometime during the Galactic Civil War. Durkin used the ship to raid others, which allowed her to finance Notsub Shipping. The first time it was used in this capacity was to steal a load of plastisteel from a CR90 corvette destined for Myomar."}, {"tag": "p", "text": "The ship had been on one too many Kessel Runs, making it appear like it had seen better days, and was badly in need of an overhaul. Durkin purchased the ship at a fair price and found a mechanic who could keep his mouth shut and paid him well. The ship stayed with him for three seasons to check, test, repair and/or replace every system. The mechanic upgraded the shields, gave it a new Carbanti communications jammer, and reinforced the hull. Though the ship looked unaltered from the outside, its derelict appearance belied its sophisticated capabilities. Durkin appreciated the innocuous look of the freighter which became very helpful during lengthy discussions with a customs patrol ship officer on one of her flights. Despite this, she decided to sell the ship to a new group. Though they did not have her entire asking price of 45,000 credits, she was willing to let them pay part of the cash and work off the rest. By doing this, she hoped to keep tighter control over their activities than she found was possible with the ships previous crew, as well as having a group in her corner who owed her."}, {"tag": "p", "text": "The cockpit of the ship was as standard—two pilot chairs, two secondary systems chairs, as well as a lucky charm hanging down in front of the portal; in this case a womp rat claw. The passageway to the cockpit also contained the telescoping boarding ramp which was a modification made to the ship before it came into the possession of Durkin, which she personally disliked intensely as, when docked, the lowered ramp would cut off the cockpit. The port laser battery contained the ships two Taim & Bak heavy laser cannons; a pair of gun control pods were also stuffed into this small area. The custom escape pod for the ship was large enough to accommodate up to ten beings and was in fact more akin to a lifeboat. When launched, it would exit the top of the ship unlike most which exited through the bottom. Engineering held the ships modified Kuat Drive Yards subspace/hyperdrive engines which were intertwined with the engineering section."}, {"tag": "p", "text": "The starboard laser battery held one of the ships Torplex heavy laser cannons and had a rotating gunner seat which was also crammed in this compartment. The access hatches held the ships deep space docking ports which were designed to operate at up to speeds of half the maximum sublight speed of the ship. The head and crew quarters held some rudimentary systems; bunk beds and storage for pre-packaged food but, as the ship could not be used for extended flights, Durkin did not refit these areas. Though the storage area held many knick knacks which were collected over the course of dozens of raids, there was also the possibility to use it as a temporary brig; Durkin had never seen the need to do so, however. The cargo bay had two decks, one of which extended underneath almost the entire main deck of the ship. It was a cramped area which was handled mostly by droids. When the ship was raiding another, cargo bay doors would be opened on both ships and space-suited crew members would supervise the droids cargo exchange. The other Torplex heavy laser cannon was mounted ventrally and was controlled from the cockpit by the co-pilot, and was in fact the only weapon wired to the cockpit."}, {"tag": "h2", "text": "Sources"}]}