{"url": "Vengeance_(Vengeance-class)", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Starships of the Galactic Empire", "Category:Starships of the Pentastar Alignment", "Category:Vengeance-class dreadnoughts"], "nodes": [{"tag": "h1", "text": "Vengeance (Vengeance-class)"}, {"tag": "p", "text": "The Vengeance was a slender, black KDY Super Star Destroyer that served as the flagship of the Dark Jedi Jerec in the years before and after the Battle of Endor. It was commanded by Captain Sysco."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Vengeance was based on the standard Super Star Destroyer design, the Executor-class. As such, the Vengeance was approximately 19 kilometers long, and was named after the Dark Jedi's old Star Destroyer, which he commanded some time prior to the Battle of Yavin. In addition, because of its dimensions, it sometimes possessed the standard classification of a space station"}, {"tag": "p", "text": "The most striking feature of the ship was its slender frame, which was more narrow than standard Star Destroyers, almost sword-like in comparison to the usual dagger shape."}, {"tag": "p", "text": "The Vengeance's height contrasted its length, which was little more than 150 meters and with downward sloping armor dominating most of the dorsal frame. The ship's bridge was extensive, but also covered much of the command tower, unlike most other KDY warships. It is known that it was one of the larger Super Star Destroyers of the Imperial era, and its length (exceeding 5,000 meters) put it firmly in the Star Dreadnought category."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Vengeance was only shown defeating a small, probably unmanned CR90 corvette, but it had armaments approaching Star Dreadnoughts of the Executor-class."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The Vengeance had a cluster of engines, consisting of three primary engines, two secondary engines flanking the vessel and six auxiliary engines clustering around the primary ones."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "Little is known about the capabilities of the Vengeance, except that it carried a number of TIE/LN starfighters and assault shuttles."}, {"tag": "h3", "text": "Command bridge"}, {"tag": "p", "text": "The Vengeance was unique in that it lacks the standard Kuat Drive Yards-style wedge shaped command bridge tower. Instead, the command bridge is located on a small square ridge near the stern of the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "To accommodate Jerec's increasingly large ego, he had a personal warship built to be his new command ship. The vessel began construction some time before the Battle of Hoth, as Jerec donated his Vengeance II to Admiral Kendal Ozzel's Death Squadron while waiting for the larger vessel to be finished.\nJerec used the Vengeance as a meeting place for him and his Dark Side Elite in the following years. The ship also served as flagship for the Vengeance Battle Group, an Imperial military formation which aided Jerec in his search for the Valley of the Jedi."}, {"tag": "p", "text": "Some time after the Battle of Endor, Jerec used it to travel to the planet Dorlo. There, he sent down a task force led by his Dark Jedi underlings to find and capture the fugitive Jedi, Qu Rahn."}, {"tag": "p", "text": "The ship was last seen orbiting Ruusan, the location of the Valley of the Jedi. The battle group it led seemed to represent a relatively common force composition, judging from the reaction of New Republic operative Alfonso Luiz Obota, who observed the group during the Mission to Ruusan in 5 ABY."}, {"tag": "p", "text": "Three Vengeance-class dreadnoughts, mass-produced versions of Jerec's flagship, participated in the retaking of the Core Worlds and the subsequent Imperial Civil War. In 10 ABY, various Vengeance-class dreadnoughts were seen near Byss, during Emperor Palpatine's Operation Shadow Hand campaign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The Essential Guide to Warfare, there was a mention of the Vengeance-class dreadnought as well as the Javelin. Although artwork of it was never shown, the name of the ship class suggested a connection to Jerec's flagship of the same name. A post made by Paul Urquhart on the TEGTW forum for TheForce.Net revealed that the similarities and connections between the ship class and Jerec's ship was intentional."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}