{"url": "Vento_system_shipyards", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Core Worlds shipyards", "Category:Galactic Republic shipyards"], "nodes": [{"tag": "h1", "text": "Vento system shipyards"}, {"tag": "p", "text": "The Vento system shipyards, also known as the Vento shipyards, were ancient shipyards that were located within the Vento system of the galaxy's Core Worlds region and lay on the super-hyperroute known as the Perlemian Trade Route. The shipyards were used by the Galactic Republic during the Great Sith War—a conflict waged by the forces of the Sith sect against the Republic—and came under a Sith attack during their first offensive wave."}, {"tag": "p", "text": "During the final stages of the war, the Human Sith Lord Ulic Qel-Droma attempted to force a Republic military officer to transmit orders to the Republic fleet instructing all the fleet's starships to arrive at the coordinates of the Vento system shipyards—an action that would cause the destruction of many Republic vessels. Qel-Droma's orders were not executed, however, due to the Sith Lord being arrested by a group of Jedi Knights. The Vento shipyards were still in existence by the time of later conflicts such as the Mandalorian Wars and the Jedi Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Vento system shipyards, also known as the Vento shipyards, were located within the Vento system of the galaxy's Core Worlds region, and lay on the super-hyperroute known as the Perlemian Trade Route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Considered to be ancient, the Vento system shipyards were used by the Galactic Republic for constructing or repairing starships by the time of the Great Sith War—a conflict waged by the forces of the Sith sect against the Republic in 3996 BBY. During that war, the shipyards were the site of a Sith attack during their first offensive wave."}, {"tag": "p", "text": "When the Human Sith Lord Ulic Qel-Droma attacked the Republic capital planet of Coruscant in 3,996 BBY, he entered the city-world's war room and tried to force its commander to transmit orders to the Republic fleet instructing all the fleet's vessels to arrive at the same exact coordinates—those of the Vento system shipyards. Such an action was predicted by the commander to cause a collision of the Republic's starships that would lead to the destruction of many vessels; however the execution of Qel-Droma's orders was prevented by the arrival of a group of Jedi Knights who arrested the Sith Lord."}, {"tag": "p", "text": "The Vento shipyards were still used by the Republic during the Mandalorian Wars, which were fought between the Republic and the Mandalorian Neo-Crusaders from 3976 to 3960 BBY, and the Jedi Civil War—a conflict between the Republic and the Dark Lord of the Sith Darth Revan's empire that lasted from 3959 to 3956 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vento system shipyards were first mentioned in the second issue of The Sith War story arc of the Star Wars: Tales of the Jedi series of comic books. The issue was published in 1995 and was written by Kevin J. Anderson and penciled by Dario Carrasco, Jr."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}