{"url": "Vensenor_Flight_Academy", "categories": ["Category:Canon articles", "Category:Imperial Academies"], "nodes": [{"tag": "h1", "text": "Vensenor Flight Academy"}, {"tag": "p", "text": "The Vensenor Flight Academy was an academy of the Galactic Empire that was situated on the decommissioned Venator-class Star Destroyer Vensenor in orbit above the Outer Rim planet Arkanis, in the Arkanis sector. The academy was led by Commandant Bythen Forral, a former Galactic Republic navy captain that served aboard the vessel during the Clone Wars."}, {"tag": "p", "text": "The academy was notable for their graduates receiving an above average amount of commendations, despite the cadets' struggle for retaining insignificant military protocols and regulations. The Vensenor Flight Academy was also famed for producing an exceedingly amount of defectors than any other academy in the Imperial Academy system, and despite investigations by the Imperial Security Bureau, evidence of criminal activity were not discovered, and is reasoned that Forral's emphasis on independence is the cause of treason. The true root of the defections, however, was Proctor Gola Chall who operated as a deep-cover resistance recruiting agent. Both Chall's and Forral's attention were drawn to a popular cadet, who demonstrated the characteristics of a legendary starfighter ace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vensenor Flight Academy was first mentioned in Dawn of Rebellion, a canon roleplaying supplementary sourcebook that is based on Star Wars Rebels and Rogue One: A Star Wars Story. The book was released in 2018 and published by Fantasy Flight Games. It was authored by John Dunn, Tom Sorenson, Sterling Hershey, Jonathan Julius, Keith Ryan Kappel, Tim Huckelberry, Jason Marker, and James M. Spahn. It had previously appeared in Star Wars Legends, first mentioned in Galaxy Guide 9: Fragments from the Rim, released in 1993."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}