{"url": "Belth_Allusis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Jedi High Council members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Belth Allusis"}, {"tag": "p", "text": "Belth Allusis was a male Human Jedi Master serving the Galactic Republic and the Jedi High Council during the Great Galactic War between the Republic and the reconstituted Sith Empire. A polite and selfless individual, Master Allusis was a respected member of the Council and was liked by his peers for his sharp wit and sense of humor. In 3671 BBY, Allusis was in charge of the Republic troops that defended the planet Bothawui against the overwhelming Sith forces. Although all of the Republic defenders, including Allusis, were killed, they managed to inflict heavy casualties upon the Sith, forcing them to retreat. Master Allusis' bravery was remembered for years to come and inspired Republic forces across the war-torn galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Belth Allusis was a Human male Jedi Master and a prominent member of the Jedi High Council active during the Great Galactic War between the Galactic Republic and the resurgent Sith Empire. Since the beginning of the war in 3681 BBY, the Empire had scored many victories, and eventually established its dominance in the Outer Rim region of the galaxy. In 3671 BBY, the Sith turned their forces toward the Mid Rim and attempted to seize control of the planet Bothawui. However, a Republic fleet had been waiting for them above the planet, and the Sith attack was repelled. The Republic fleet was then pulled back from Bothawui, and only a small force led by Master Allusis remained behind to defend the planet against a possible Sith counterattack."}, {"tag": "p", "text": "The attack soon followed; Imperial battlecruisers from all around the galaxy moved in to capture Bothawui. However, the planet was protected by a high-powered planetary shield, which prevented the Sith from using orbital bombardment and forced them to initiate a ground assault instead. Soon, a fifty-thousand-strong force of Sith landed on the planet and attacked the shield generators, which were protected only by seven dozen of the Jedi Order's Knights and four thousand Republic soldiers, all commanded by Allusis. Despite being greatly outnumbered, the Republic troops put up a valiant fight; for each Republic soldier killed, the Empire paid with ten lives. During the battle, Allusis and his men developed unorthodox tactics, which—combined with the Imperial commanders' decision to send all of their troops directly into the assault—resulted in so many Sith losses that the Empire was forced to call in reinforcements."}, {"tag": "p", "text": "Eventually, however, most of the Republic defenders were killed, and only a handful of Jedi and soldiers remained. The survivors gathered near Master Allusis and prepared for a final stand. At that moment, the Imperial Grand Moff Zellos offered to spare Allusis if he and his forces surrendered. Drawing from the Force, Allusis and his soldiers did not accept the offer and fought to the last man. Although all of the Republic forces perished, the Empire had taken too many casualties and was forced to retreat from Bothawui."}, {"tag": "p", "text": "The last stand of \"The Heroes of Bothawui\"—as Allusis and his men became known—restored hope across the Republic and served as a turning point in the war. The strategies developed by them helped the Republic to temporarily hold off the Sith advancement, until the Sith allied with the Mandalorians four years later. The Republic was eventually defeated and forced to sign the Treaty of Coruscant with the enemy. In the aftermath of its signing, the keeper of the Jedi Archives, Kel Dor Jedi Master Gnost-Dural, documented the Battle of Bothawui in a holorecord, as well as his personal journal. Grand Master Satele Shan later compiled key entries from that journal into the book titled The Journal of Master Gnost-Dural, adding her own recollections of Allusis. To honor Allusis's bravery, a Republic Valor-class cruiser was christened after him, the Allusis."}, {"tag": "p", "text": "After the Treaty of Coruscant, the Republic and the Sith Empire entered the period of Cold War. During that period, the Mandalorian Clan Varad, led by Mavrix Varad, rebelled against the Sith-allied Mandalore the Vindicated's rule and seized the Allusis, using it to terrorize vulnerable worlds in the Outer Rim Territories. This prompted both the Republic and the Empire to send boarding parties to capture the ship. Ultimately, Clan Varad was defeated and Mavrix Varad was slain."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Belth Allusis was a courageous and selfless person, who was willing to defend Bothawui at all costs, even if it meant sacrificing his own life and the lives of his comrades. According to Gnost-Dural, Allusis's refusal to surrender was guided by the Force and was not driven by pride. Belth Allusis was noted for his sharp wit and sense of humor, often lightening up Jedi Council debates. He was very polite in his behavior and humble in his clothing and was generally considered to embody the virtues of the Jedi Order. In The Journal of Master Gnost-Dural, Satele Shan described Allusis as a champion of lost causes. As such, she was unsurprised by his decision to remain on Bothawui. The bravery of Master Allusis and his fellow defenders of Bothawui was remembered in many years to come and was regarded as being the key factor in restoring hope of the Republic forces and rallying them to fight the enemy with renewed courage. Master Allusis had gray hair and light skin."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Belth Allusis was a Force-sensitive individual, who trained with the Jedi Order around the time of the Great Galactic War, and by 3671 BBY he had risen to the rank of Jedi Master. He was put in command of all of the Republic forces on Bothawui, with whom he created and employed several unorthodox tactics, resulting in heavy Sith losses during the battle. At one point, Allusis utilized a blue-colored lightsaber. During the battle on Bothawui, however, he wielded a yellow-bladed one."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Belth Allusis appeared in the fifth and the sixth installment of the Galactic Timeline, a series of videos that served as a tie-in to the massively multiplayer online role-playing video game Star Wars: The Old Republic. The videos are presented as holorecords made by Jedi Master Gnost-Dural, who is portrayed by voice actor Lance Henriksen. Allusis received further mention in The Journal of Master Gnost-Dural, a book that was shipped in with the collector's edition of The Old Republic. The game itself featured a mission set on the Allusis, a ship named after the Jedi Master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}