{"url": "Verge_of_Greatness", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Verge of Greatness"}, {"tag": "p", "text": "\"Verge of Greatness\" is a short story in the anthology From a Certain Point of View. The story, written by Pablo Hidalgo, focuses on the point of view of Wilhuff Tarkin and Orson Krennic."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Grand Moff Wilhuff Tarkin contemplates the power of the Death Star and his rivalry with Director Orson Krennic as he gives the order for the Death Star to fire upon the Imperial security complex on the planet Scarif during the Battle of Scarif. Tarkin regards Krennic as a bricklayer taking pride in a parapet built at the behest of a king. Tarkin had ordered the destruction of the Imperial security complex in a desperate attempt to prevent the rebels from escaping with the Death Star plans."}, {"tag": "p", "text": "The story then flashes forward to Tarkin meeting with General Cassio Tagge, Admiral Conan Antonio Motti, and Darth Vader aboard the Overbridge of the Death Star. Vader reports that Princess Leia Organa is resisting the mind probe while Motti announces that the Death Star is fully operational. Tarkin suggests that Leia will answer to an \"alternative form\" of persuasion and tells Motti to set a course for the planet Alderaan."}, {"tag": "p", "text": "Later, Admiral Motti visits Tarkin and tells him that with the Death Star he has the power of life and death over every living thing in the galaxy. Tarkin reminds Motti that they serve the Emperor and rebuffs Motti's suggestion that Tarkin could use the Death Star to exert leverage over the Emperor. Later, Tarkin meets with his prisoner Leia, who remains defiant. Tarkin breaks Leia by announcing that the Death Star will be used to destroy her home planet of Alderaan. Tarkin then watches as the superweapon destroys the planet, extinguishing millions of lives."}, {"tag": "p", "text": "The story then flashes back to Orson Krennic's last, dying moments on the Citadel Tower during the Battle of Scarif. As he succumbs to his wounds, Krennic watches as the Death Star moves into orbit above Scarif, preparing to unleash its superlaser. Now that the rebels have stolen the plans, Krennic contemplates searching the technical readouts for the flaw that Galen Erso had planted in its design. Krennic regrets that he as an engineer was outwitted by Tarkin, the politician pretending to be an architect. Despite his defeat, Krennic takes rest in the fact that Galen's flaw will be the undoing of Grand Moff Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}