{"url": "Verhandle", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Verhandle"}, {"tag": "p", "text": "Verhandle was a male criminal around the time of the Galactic Civil War. At some point during his life, Verhandle met the Corellian smuggler Han Solo. After collecting various cargo items, Solo wanted to sell the items to Verhandle at a price that did not suit well for Verhandle, who bought the items for sixty percent of the original agreed fee. The criminal had a group of soldiers working for him and dispatched them to commandeer Solo's freighter, the Millennium Falcon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Verhandle, a male criminal, was a being that lived around the time of the Galactic Civil War. In order to protect himself, Verhandle recruited a group of group of soldiers. At some point, Verhandle met the Corellian smuggler Han Solo, and began a deal with the smuggler. Solo and his Wookiee copilot Chewbacca collected various cargo items to sell to Verhandle on a planet. The price for the cargo items did not interest Verhandle, who lowered the price from its original fee to sixty percent. After Solo agreed, Verhandle took the items. Unbeknownst to Solo and Chewbacca, the criminal secretly dispatched a group of his soldiers to commandeer Solo's freighter, the Millennium Falcon. The soldiers, however, were defeated by Chewbacca."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Described to be a shady character by Han Solo, Verhandle did not keep his deal with Solo to buy his cargo goods. Instead of paying the original agreed upon fee, Verhandle lowered the price down to seventy-five percent. When Solo argued against it, Verhandle lowered it down to seventy and finally sixty percent. Verhandle was also interested in the Millennium Falcon and wanted to buy it from Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Verhandle first appeared in the Star Wars themed one-shot comic Star Wars: The Art of the Bad Deal, which was penned by Zack Whedon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}