{"url": "Verdanth", "categories": ["Category:Legends articles", "Category:Bon'nyuw-Luq sector planets", "Category:Jungle planets", "Category:Sith planets"], "nodes": [{"tag": "h1", "text": "Verdanth"}, {"tag": "p", "text": "Verdanth was a rainforest planet in the Verdanth system. It was located on a strategic position on the Duros Space Run and the Sanrafsix Corridor and near the intersection of the Grumani, Sanbra, and Bon'nyuw-Luq sectors. Verdanth's indigenous species included rimebats. During the New Sith Wars, the planet was frequently fought over by Sith Lords, while, during the Galactic Civil War, Darth Vader tried and failed to capture Luke Skywalker on the world."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "New Sith Wars"}, {"tag": "p", "text": "During the Republic Dark Age, the world was home to colonists of several species, including Bothans, and was frequently fought over by petty princelings and would-be Sith Lords, with the title \"Conqueror of Verdanth\" passing to a new Lord every few years. It was later estimated by Jedi Master Vannar Treece that Verdanth had been under the control of seventeen different self-declared Sith Lords since approximately 1032 BBY."}, {"tag": "p", "text": "During this time period, Narsk Ka'hane was raised on Verdanth by his aunt and served the various Sith Lords as a slave. It was during one of his assignments, harvesting rimebats in the jungle world's caverns, that Ka'hane first weared a stealth suit."}, {"tag": "p", "text": "Shortly before the Jedi-led Operation Influx, Treece compiled a report to the Republic Supreme Chancellor Genarra on the worlds of the Grumani and neighboring sectors. In the report, Treece included a brief description of Verdanth and noted that the jungles of the planet were still resisting the colonization efforts of the transplanted refugees."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War one thousand and thirty-five years later, Darth Vader used a seemingly crashed shuttle as bait to capture Luke Skywalker, but Luke was rescued by R2-D2 and Han Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the The Knight Errant Gazetteer states that Verdanth is located on the Sanrafsix Corridor, the map of Grumani sector accompanying the document places it on the Duros Space Run."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}