{"url": "Verkle", "categories": ["Category:Canon articles", "Category:Creatures of Endor", "Category:Non-sentient species", "Category:Rodents", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Verkle"}, {"tag": "p", "text": "Verkles were tusked, brown-and-white furred rodents that lived on the forest moon of Endor. The sentient inhabitants of Endor, the Ewoks, sometimes hunted verkles for their meat or to be used as bait. Shortly before the Battle of Endor, the heroes of the Rebel Alliance Chewbacca, Luke Skywalker, Han Solo, C-3PO and R2-D2 fell into the net of an Ewok hunting party, whose trap used a dead verkle as a bait."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Verkles were rodents that hailed from Endor, a forest moon orbiting the planet of the same name. They were covered in short, coarse fur that was tan and white. Their flesh, when exposed, was pink. They had a small mouth with four protruding tusks. Although the Ewoks found that verkle meat tasted rather unpleasant, Wookiees like Chewbacca could be attracted by its distinctive odor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "On Endor, the bear-like Ewoks mostly fed on roots, nuts, and spit-roasted splledarks, with an occasional feast of boar-wolf meat. Nevertheless, verkles were also part of the Ewoks' diet when the hunt was bad."}, {"tag": "p", "text": "After a crushing defeat by the Galactic Empire on Hoth, the Alliance to Restore the Republic set up a dangerous mission to destroy the energy shield generator of the Empire's second Death Star battle station, located on Endor. During the mission, the Alliance hero and Wookiee warrior Chewbacca found a dead verkle dangling from a tree. Interested by the smell of that fresh hunk of meat, Chewbacca tugged on it, which triggered an Ewok hunting trap. As a result, the Wookiee and his friends Luke Skywalker, Han Solo, C-3PO and R2-D2 were all scooped up in a net high above the ground."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}