{"url": "Vernol", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Vernol"], "nodes": [{"tag": "h1", "text": "Vernol"}, {"tag": "p", "text": "The Vernols were a race of sentient bipeds. They had a large colony on Garnib."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Though they appeared amphibian in origin, the Vernols actually evolved from mammalian ancestors. They had squat, round bodies with wide faces. They possessed small eyes and wide mouths, with tiny ears set far apart on their heads. Each hand had four chubby fingers."}, {"tag": "p", "text": "Vernols were blue skinned, with orange highlights around their eyes and mouths, as well as on their palms and the soles of their feet."}, {"tag": "h2", "text": "Society and Culture"}, {"tag": "p", "text": "Though much of Vernol society had been wiped out due to dual calamities on their homeworld, they sought to rebuild their culture on other planets in the galaxy. The most prominent of these was the icy world of Garnib, the only world with a significant ethnic Vernol community. After the destruction of their native world and culture, most Vernols became possessed of a worrisome mindset and a skittish demeanor. Many moved to Garnib to become part of what they saw as a safe and stable world and society. The native Balinaka somewhat frightened the Vernols, but were very accepting of their new neighbors."}, {"tag": "p", "text": "Vernols were innate foragers, extremely capable of finding food, water, or other essential supplies in any situation. Despite being somewhat fearful and territorial, Vernols integrated into many societies across the galaxy. Using their foraging abilities, some became investigators, while others used their cheerful personalities and harmless appearances to become accomplished con artists, lulling their marks into a false sense of security. These two professions aside, Vernols filled many occupations on many different planets, such as the merchant, Shulf'aa, who lived on the planet Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Over the course of fifty years, the Vernol homeworld suffered two major catastrophes. First, a meteor collided with their planet, wiping out a vast swath of their society. Next, their world shifted in its orbit around its star and quickly became uninhabitable. The Vernols fled their homeworld and took to the stars, seeking to establish colonies on safer planets."}, {"tag": "p", "text": "While Vernols could be found on many worlds throughout the galaxy, it was on the planet of Garnib that they created a new home for their species. Though they found the native Balinaka intimidating, they were accepted and welcomed by the larger species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}