{"url": "Veroleem", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Unknown Regions planets"], "nodes": [{"tag": "h1", "text": "Veroleem"}, {"tag": "p", "text": "Veroleem was a planet in the Unknown Regions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was a remote desert planet that became a refuge for Republic colonists who sought to escape an increasingly authoritarian galactic government. The colonists named the world after their leader and staked their claim on it, seeing it as both remote and with no readily exploitable resources."}, {"tag": "p", "text": "After a time, their society changed, with the group becoming more and more dependent on converting outsiders to join their cult and manufacturing a drug called kryotin powder to provide money. They sent out proselytizers to other worlds and forced the new recruits to abandon their former lives to become completely immersed in the cult.\nAlthough off-world criminal organizations attempted to make their own profits collaborating with the drug-manufacturing cult, they all abandoned this venture one by one due to \"accidents\" that cropped up."}, {"tag": "p", "text": "During the Mandalorian Wars, the Mandalorian Neo-Crusaders evaluated the planet, with some suggesting using kryotin as a potent bioweapon. The plan was rejected and Veroleem went untouched through the conflicts. Following the Jedi Civil War and the loss of many Republic records, the original claim to the planet disappeared and an off-world mining company (in reality a front for the Exchange) staked its claim on the planet, looking to mine Lommite. When the Council of Enlightened Elders went to court to dispute this claim and keep their doings hidden from the outside galaxy, the Jedi Order became aware of the cult and its sinister recruiting techniques, opposing their views. For decades, the cult thus began to change tactics to stay out of trouble and limited their distribution of kryotin."}, {"tag": "p", "text": "Following the end of the New Sith Wars millennia later and the reorganizing of the Galactic Republic, the cult returned to their old tactics, secure in the knowledge that the Jedi would have less time to investigate them due to being more involved with the Galactic Senate. During the Clone Wars, the Veroleemians stayed neutral, but supported the Confederacy of Independent Systems in secret."}, {"tag": "p", "text": "When Palpatine became Galactic Emperor, he utilized the planet as a dumping ground for political opponents and criminals. The Rebel Alliance and its successor-governments never discovered the planet's location. When the Second Galactic Empire emerged, Veroleem's cultists again began an aggressive recruiting campaign, convinced that their world would remain forgotten."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}