{"url": "Vernestra_Rwoh%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Vernestra Rwoh's lightsaber"}, {"tag": "p", "text": "During the High Republic Era, Jedi Knight Vernestra Rwoh wielded a purple-bladed lightsaber. Originally an ordinary single-bladed weapon, Rwoh modified it to be able to switch between lightsaber and lightwhip modes after the design came to her in a dream. She kept the modification secret for several weeks, practicing with the whip in private, until after she had become stranded on the jungle moon Wevo with several others, revealing the modification in order to clear brush to escape acid rain. Switching between blade modes was activated by twisting a ring just below the blade emitter."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vernestra Rwoh's lightsaber was a single-bladed weapon with a cylindrical hilt. The blade was purple, powered by a kyber crystal. Originally a fairly typical lightsaber, Rwoh modified it to include a lightwhip mode activated by twisting the first ring on the hilt after receiving the instructions in a dream. In whip mode, the saber had a flexible blade which was longer than it was in saber mode."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Vernestra Rwoh constructed her lightsaber long before she attained the rank of Jedi Knight, wielding the weapon while she was the Padawan of Jedi Master Stellan Gios. She eventually attained the rank of Knight at the age of fifteen, making her the youngest in a generation. After her promotion, she was stationed at the outpost Port Haileap, under the supervision of Jedi Master and marshal Douglas Sunvale. Her first mission was supervising Avon Starros, an aspiring inventor whose mother, Senator Ghirra Starros, had sent her away from Coruscant to keep her out of trouble."}, {"tag": "p", "text": "One week after arriving at Port Haileap, Vernestra had a Force vision one night that showed her how to redesign her lightsaber to give it a lightwhip mode, and she stayed awake until she finished the design. However, uncertain of the reception the modification would get, Vernestra kept the whip secret, not informing Masters Sunvale or Gios of the change to her lightsaber. Over the course of several weeks, she practiced with the whip in secret, learning that she had to be aware of where the tendrils were lest she accidentally lose a limb. Vernestra and Avon were eventually asked to join a delegation travelling to the Starlight Beacon space station on the cruiser Steady Wing, as Sunvale hoped that Avon would befriend Honesty Weft, the son of the Dalnan ambassador. However, the starship was bombed on route, stranding Vernestra, Avon, Sunvale's Padawan Imri Cantaros, Honesty and Avon's protocol droid J-6 on the jungle moon Wevo after they escaped in a shuttle."}, {"tag": "p", "text": "On the moon, acid rain forced the group to quickly find shelter, sending scout droid SD-7 to locate a cave. As both she and Imri were growing tired, and they had drawn ahead of the children and J-6, who were sheltering under a force field umbrella, Vernestra reluctantly decided to reveal her lightsaber's whip mode to the Padawan, as it would allow her to clear brush faster. Imri noted that lightwhips were used by the Nightsisters, but Vernestra, defensive, countered that the Jedi had also used them during the Sith Wars, and that the Force itself had led her to the design. Using the whip allowed the two Jedi to make it through the brush much faster, before opening up the cave SD-7 had discovered so the group could take shelter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vernestra Rwoh's lightsaber debuted in the novel The High Republic: A Test of Courage, written by Justina Ireland. The author conceived of the weapon's unique lightwhip mode as a way to showcase the hidden depths of Vernestra's character, as on the surface she appears to be a fairly conventional Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}