{"url": "Belugan", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Belugans", "Category:Cetacean sentient species", "Category:Inner Rim species"], "nodes": [{"tag": "h1", "text": "Belugan"}, {"tag": "p", "text": "Belugans were an aquatic sentient species native to the planet Quarzite. Largely humanoid, the Belugans sported fleshy sideburns on the sides of their faces and had sectioned jaws that hid their baleen-like teeth. While the rest of the galaxy participated in the Clone Wars, the Belugans fought an ongoing conflict with the native Kage Warriors, who opposed Quarzite's tyrannical leader, Lord Otua Blank. Despite being equipped with advanced technology, the Belugans nonetheless encountered Kage Warriors during the latters' ambushes on the formers' subtrams. This led to Blank hiring an outside team of bounty hunters to protect cargo travelling to his stronghold. Although the Belugan escorts were defeated, the bounty hunters successfully defended the cargo."}, {"tag": "p", "text": "When the bounty hunter Asajj Ventress learned that the cargo was a living Kage girl who had been kidnapped from her home, Ventress ended up having a change of heart. Instead of delivering the girl to the Belugans, Ventress freed her and alternatively gave Lord Blank fellow bounty hunter Boba Fett, much to the dictator's surprise."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Belugans were an aquatic species that hailed from the planet Quarzite. Humanoid in stature, Belugans were most identifiable by their bald heads and four-sectioned jaws. Belugan faces were adorned with colorful \"sideburns\" which were actually fleshy extensions of their cheeks. Belugans had grayish-brown skin, while their flesh sideburns could come in either blue or orange varieties. Belugans had white eyes with black, vaguely star-shaped irises. Their unique, four-sectioned jaws, which had orange tips, hid baleen-like teeth and a prehensile tongue. Belugan mouths had the ability to drool when the individual experienced lust."}, {"tag": "p", "text": "As a humanoid species, Belugans held several human characteristics, such as two arms that ended in five-fingered hands, two legs that supported the body, and an upright gait. Belugans were generally tall and thin, but it was possible for one to have more rotund sizes, as seen in the Belugan dictator, Lord Otua Blank."}, {"tag": "p", "text": "Despite a notable biological difference, Blank was physically attracted to the Kage female, Pluma Sodi."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Belugans were a technologically advanced species that shared their world with the human-like Kage species. Both species lived under Quarzite's surface, as the planet was wracked with highly pressurized environmental storms that did not provide a livable atmosphere. However, a space station was constructed at some point by the Belugans. The space station, built far outside the planet's atmosphere, descended under Quarzite's surface with a series of massive turbolifts. This allowed the Belugans to travel between their world and the space station, and in theory, leave the system. In addition, the Belugans also maintained a network of subtrams that weaved through Quarzite's massive cave system."}, {"tag": "p", "text": "Quarzite and its inhabitants were ruled by the Belugan dictator, Lord Otua Blank, who led an elite military force from a fortified compound. The military force consisted of soldiers and guards, and included the military rank of major. Soldiers wore full body armor and wielded blaster pistols that, when not in use, were holstered in a holster located on the armor's gauntlet. Major Rigosso's officer uniform consisted of a light-brown patterned tunic with a Belugan symbol on the chest. Both uniforms came with clawed-gloves."}, {"tag": "p", "text": "Blank's forces were tangled in a conflict with the Kage Warriors, a group of vigilante Kage who opposed Blank's dictatorship over Quarzite. Despite Blank's troops best efforts, the Belugan soldiers were ineffective against the Kage Warriors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Belugans evolved on the planet Quarzite alongside the Kage. By the time of the intragalactic Clone Wars, Otua Blank assumed absolute rule over Quarzite as a dictator. However, a subset of the Kage known as the Kage Warriors opposed Blank's rule. A conflict emerged in which Belugan soldiers failed to provide competent defenses against Kage attacks. The Kage specifically targeted the Belugan subtram network, hijacking Belugan cargo."}, {"tag": "p", "text": "During the conflict, Blank developed a lustful interest in the Kage female Pluma Sodi. Desiring her to be his bride, his soldiers kidnapped Sodi from her home. At the time, her brother, Krismo, had become the leader of the Kage Warriors."}, {"tag": "p", "text": "Fearing a Kage counter-attack on the subtram that was to deliver Sodi, Blank sought outside help from galactic bounty hunters to reinforce Sodi's minimal number of Belugan escorts; Blank specifically asked for a team of six. With a fee of 600,000 unmarked credits, a team of six bounty hunters led by the Human Boba Fett accepted the contract and traveled to the Quarzite space station. The commander of the Belugan mission, Belugan officer Major Rigosso, rendezvoused with the bounty hunters and brought them under Quarzite's surface. Sodi was placed into a large chest, and as such the nature of the Belugan cargo was kept a secret from the hunters."}, {"tag": "p", "text": "Along with two other Belugan guards, Rigosso's team began to travel to Blank's stronghold to deliver Blank \"his bride.\" However, the subtram was quickly besieged by Krismo and the Kage Warriors. The guards and bounty hunters were shoved off of the tram while Rigosso was personally killed by Krismo. Fett and Asajj Ventress, the remaining bounty hunters, discovered Sodi soon after. Ventress experienced a change of heart during the ordeal, and set Sodi free. Ventress still collected Blank's fee, however, after stealthily giving him a bound Fett in Sodi's place, surprising, as well as disgusting, the tyrant."}, {"tag": "h2", "text": "Belugans in the galaxy"}, {"tag": "p", "text": "By the time of the Clone Wars, the Belugans had made contact with the outside galaxy to some extent, as Lord Blank was able to acquire the services of galactic bounty hunters. Under Blank's rule, Quarzite held no affiliation during the war, although at least two Kage allied themselves with the Confederacy of Independent Systems.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Belugans were created for the Star Wars: The Clone Wars television series. Their sole appearance was in the fourth season episode \"Bounty,\" released in 2012, where conceptual artwork for the species designed by Darren Marshall."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}