{"url": "Verpine_shatter_gun", "categories": ["Category:Legends articles", "Category:Magnetic acceleration weaponry", "Category:Projectile pistols"], "nodes": [{"tag": "h1", "text": "Verpine shatter gun"}, {"tag": "p", "text": "Verpine shatter guns were handheld projectile weapons produced by the Verpine. They ranged in size from small handguns to powerful sniper rifles. The weapon was based on a magnetic field principle, similar to a rail gun. When shot, the weapon would make no sound, but would cause great kinetic damage despite the small caliber pellet it fired."}, {"tag": "p", "text": "Shatter guns launched metal alloy projectiles using advanced magnetic fields. They were nearly silent, had excellent range and accuracy, and inflicted extremely large amounts of kinetic damage. Verpine shatter guns were easy to use, and an inexperienced gunman could do massive damage with a single projectile. As such they were sometimes favored by assassins who wished to kill their target in one shot without giving away their position. Custom versions of the weapon also had the ability to fire nearly any kind of small (less than an inch in diameter) projectile, due to a very expensive feature: multicaliber magazine and bore. Kal Skirata, who owned several of these custom shatter guns, once joked that one could fire rocks out of them if they had to. The weapon's projectiles were nearly impossible to block with a lightsaber due to their small size and extreme speed."}, {"tag": "h2", "text": "Variants"}, {"tag": "h3", "text": "Verpine Sniper Rifle"}, {"tag": "p", "text": "The Verpine sniper rifle was an expensive, top-of-the-line sniper rifle based on the Verpine shatter gun design. The Mandalorian bounty hunter Kal Skirata favored Verpine sniper rifles, personally owning several expensive models. Omega Squad used Verpine sniper rifles during an anti-terrorism mission on Coruscant to eliminate several Separatist terrorist cells who had infiltrated the capital. The original variant of the Verpine weapon, the Shatter Gun, used magnetic coils to launch their projectiles, and according to Kal Skirata, could \"even be loaded with rocks, if necessary\". The weapons use gravity coils to accelerate projectiles at extremely high velocities, allowing it to be capable of inflicting heavy damage even on armored targets.\nThe commandos used the rifles to tag suspect terrorists with Dust in order to track them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This image shows a custom-made Verpine Sniper Rifle with a bipod, made by the U.S. soldier Raymond Ramirez, a fan with a special connection to Karen Traviss and Star Wars. He made a Verpine Sniper Rifle on Karen Traviss' request which she posted on her livejournal.com blog - the entry has, unfortunately, been deleted, but an image of the weapon can be found at photobucket. Ramirez's blog has been featured on StarWars.com, where a smaller image of the Verpine sniper rifle with bipod can be found. One of his blog entries goes deep into the weapon's functions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}