{"url": "Verpine", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Insectoid sentient species", "Category:Verpine"], "nodes": [{"tag": "h1", "text": "Verpine"}, {"tag": "p", "text": "The Verpine were an insectoid sentient species that controlled Roche Hive, a droid manufacturer. Effor was a member of the Verpine species."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A bipedal insectoid sentient species with green skin, Verpine had a pair of digitigrade legs that terminated in two-toed feet and a pair of saw-blade arms that ended in three-fingered hands. Their heads sat atop a long neck and featured a pair of antenna, two black eyes, and mouthparts."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Verpine were a hive-based species. Instead of singing, they rubbed their legs together to produce choral arrangements and communicated by chattering. Verpine displayed affection by rubbing their mouthparts together."}, {"tag": "p", "text": "They were the namesake of the cruciform Verpine ratchet."}, {"tag": "h2", "text": "Verpine in the galaxy"}, {"tag": "p", "text": "Based on Roche[source?] in the galaxy's Mid Rim, the Verpine Roche Hive manufactured the 8D-series smelter droid. Verpine shipwrights crafted designs that engineer Quarrie aimed to improve upon in his designing of the Prototype B6."}, {"tag": "p", "text": "By the year 4 BBY,[source?] a Verpine known as Effor worked at a gladiatorial arena. A Verpine was present in Weacoe city on the planet Wecacoe sometime before the Battle of Scarif. In 5 ABY, a pair of Verpine New Republic advisors were loudly arguing at a table at Izzik's, a restaurant located in Nakadia's planetary capital of Quarrow, prior to the first convening of the Galactic Senate at the Quarrow Senate house. They were later leaning over a different table, lustily rubbing their mouthparts together."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Verpine were first mentioned in the new Star Wars canon in Sabine My Rebel Sketchbook, a young readers book written by Daniel Wallace and released on February 3, 2015. They were originally created for Star Wars 7, the seventh issue of Marvel Comics' earlier Legends Star Wars comic series, which was first published on October 11, 1977."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}