{"url": "Verre_Sydia%27s_husband", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with conjectural titles", "Category:Imperial Intelligence personnel of the resurgent Sith Empire", "Category:Individuals of unspecified species", "Category:Spies", "Category:Unidentified husbands", "Category:Unidentified Sith Empire personnel"], "nodes": [{"tag": "h1", "text": "Verre Sydia's husband"}, {"tag": "p", "text": "The husband of the Republic Senator Verre Sydia was a deep-cover spy for the Sith Empire through his wife's career during the Great Galactic and Cold Wars until his true allegiances were exposed by the astromech droid T7-O1."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male individual married Verre Sydia, a Senator of the Galactic Republic, as part of his role as a deep-cover spy for the Sith Empire during the Great Galactic and Cold Wars. In 3663 BBY, an Alderaanian noble and fellow Imperial operative named Eckhorn Baliss added Sydia's husband to a list of potential Imperial sympathizers, and the man feared that his cover had been blown. Using his wife's access to classified Senate accounts, Sydia's husband hired the bounty hunter Terrin Sandafar to kill Baliss by rigging his ship to explode above the noble's homeworld of Alderaan."}, {"tag": "p", "text": "However, in 3653 BBY, the former slaver Shafu began investigating Baliss' death as part of an assignment for the deceased Jedi Master Ven Zallow. Sydia's husband employed Sandafar again to eliminate the Rodian Shafu above the moon Nar Shaddaa, and after killing Sandafar to eliminate his accomplice, the man's cover remained in place for another decade before the Jedi Knight known as the Hero of Tython worked with the droid T7-O1—Shafu's former partner—to expose him. Thanks to their investigations, the Strategic Information Service, the Republic intelligence agency, arrested Sydia's husband."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Verre Sydia's husband was first mentioned in conversations with the Jedi Knight companion T7-O1 in the video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}