{"url": "Vestara_Khai", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Females", "Category:Former Sith", "Category:Humans", "Category:Jedi trainees of the New Jedi Order", "Category:Lost Tribe of Sith strike team", "Category:Mercenaries", "Category:Raining Leaves Clan members", "Category:Sith Sabers", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Vestara Khai"}, {"tag": "p", "text": "Vestara Khai was a Force-sensitive female Human born to Sith Saber Gavar Khai and his wife, Lahka, on the remote planet Kesh in 27.5 ABY. She became a Tyro in the planet's local Sith Tribe in 37.5 ABY, and after being contacted by the Sith Meditation Sphere Ship in 41 ABY she was apprenticed to Lady Olaris Rhea. Ship helped the Tribe travel offworld and form a new fleet, but in 43.5 ABY Ship deserted Kesh, following the call of the dark side entity Abeloth. Vestara was a member of the strike team sent to recover Ship and kill Jedi Grand Master Luke Skywalker, but the Sith were defeated by Skywalker and his son, Ben. The team's sole survivor, Vestara fled to the planet Dathomir, where she sent a message to her Tribe and lived under the protection of the Dathomiri Witches. The Skywalkers found and eventually captured her, but they were then confronted by a Sith fleet led by High Lord Sarasu Taalon."}, {"tag": "p", "text": "Taalon forced the Jedi to accept an alliance to confront Abeloth—who had proven to be a danger to the Sith, and who was causing a psychosis among the Jedi Order's Knights—with the stipulation that Vestara remained aboard the Skywalkers' family ship. During the mission, Vestara and Ben began to develop romantic feelings for each other, and she was instructed by her father to use them to her advantage against the Jedi. On Abeloth's planet, the Sith betrayed the Jedi, but Luke defeated Abeloth. The Khais, the Skywalkers, and Taalon repaired their alliance and remained behind to investigate more into Abeloth, but after discovering that the entity had survived, the alliance again fell apart. Gavar and Taalon sent Vestara to travel with and spy on the Jedi, and they tracked Abeloth to the moon Pydyr. A contingent of Sith soon arrived, and upon finding Abeloth, Taalon—who had begun to turn into the same kind of entity—opened battle on the Jedi."}, {"tag": "p", "text": "The Sith and Abeloth incapacitated the Jedi, but Vestara killed Taalon to prevent his transformation. Abeloth then escaped, and Vestara fled with the Jedi, as the Sith suspected her of betrayal. She and the Skywalkers then located Abeloth on the world Nam Chorios, and Vestara secretly informed her father of their location. However, Abeloth survived the assault and Vestara again assisted the Jedi in escaping from her Tribe. As the hunt for Abeloth continued, Vestara, the Skywalkers, and Jedi Knight Jaina Solo dueled a group of Sith, and Vestara was forced to kill her father. She finally decided to turn her back on the dark side and train as a Jedi, and she and Ben began a relationship. They soon embarked on a mission to hunt down Abeloth and Ship, but Vestara killed Jedi Knight Natua Wan in order to save Ben from a deadly insect that was determined to feed on him. The Jedi were forced to flee the world, and due to her actions, Vestara came to the conclusion that she would never be able to follow the Jedi path."}, {"tag": "p", "text": "Vestara nevertheless remained with the Jedi for their mission to eliminate the Sith on the planet Coruscant. She hoped to ensure the destruction of the Tribe's High Lords, who were duty-bound to kill her for Taalon's murder. However, during the mission she was separated from the Jedi, and she was forced to reveal the identity of a prophesied Jedi queen—the Skywalkers' relative, Allana Solo—in order to convince her Tribe that her loyalties remained with them. She was made a Sith Saber, and then forced to open an attack on Solo. Soon afterward, Abeloth captured Vestara and Ben Skywalker in Ship. Abeloth attempted to convince them to join her in forming a new family of the Ones—the powerful deities of whom Abeloth was the last surviving member, but they killed Abeloth while her other manifestations were defeated, resulting in her destruction. Knowing Ben would not forgive her betrayal of Solo, Vestara fled in Ship, who promoted her to Sith Lady and took her to join another faction of Sith."}, {"tag": "p", "text": "However, by 45 ABY, Vestara, under her alias Savara Raine, was in the employ of the Columi brothers, Craitheus and Marvid Qreph, who hired her to access a monolith in the Chiloon Rift. Using her Force powers, she was able to open a space–time-warping gate, granting access to the monolith. Upon entering the monolith, non Force-sensitive individuals could be granted access to the Force, a power which the Qreph brothers greatly desired. However, in Vestara's tests of the monolith's powers, their test subject had also become insane, forcing the Qrephs to prolong entering the monolith until they understood it better. In attempting to prevent anyone else from discovering the monolith, Vestara and the Qreph brothers drove competing interests out of the Chiloon Rift, but their efforts caused them to come into conflict with the Jedi. The Jedi, led by Ben Skywalker, attacked the Qrephs' base on the monolith, discovering that Vestara was working for the Qrephs. During the assault, Vestara was betrayed by her employers and left for dead. However, she was able to convince the Mandalorian, Mirta Gev, who was also working for the Qrephs, to join her, and the two women escaped from the monolith in Ship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The Force-sensitive female Human Vestara Khai was born on the remote planet Kesh in 27.5 ABY to the Sith Saber Gavar Khai and his non-Force-sensitive wife, Lahka Khai. The world was home to the Lost Tribe of Sith, the descendants of the survivors of a group of Sith who had crashed there in 5000 BBY. In 37.5 ABY, ten-year-old Vestara, then a Sith Tyro—an initiate in the Tribe—participated in a competition to obtain a reptavian uvak. She was successful in that endeavor, and she named her uvak Tikk. After the competition, she became good friends with the Keshiri Sith Tyro Ahri Raas. The two often trained together, honing their combat techniques in hopes of being chosen as apprentices. During her childhood, Vestara was attended to by a Keshiri woman named Muura."}, {"tag": "p", "text": "In 41 ABY, Vestara was sparring with Raas when she felt the approach of the Sith Meditation Sphere Ship. Ship sensed Vestara's desire to become a Sith Master and offered to teach her. Since Vestara's was the first mind that Ship touched when the Sphere came to Kesh, the Circle of Lords, the ruling Sith council on Kesh, summoned Vestara. They apprenticed the girl to Lady Olaris Rhea, and Vestara left her home and began her training in the Sith Temple in the Takara Mountains on Kesh. Ship also informed the Sith of the happenings in the galaxy since their ancestors had been stranded millennia ago, revealing that the Sith had been nearly exterminated and that the Jedi had grown numerous."}, {"tag": "p", "text": "Ship soon thereafter discovered a Damorian s18 light freighter en route from the planet Eriadu, and called for five Sith to help attack the vessel. Vestara and Rhea were selected, along with fellow Sith Sarasu Taalon, Ivaar Workan, and Ruku Myal. Ship carried them offworld and attacked the freighter, which was unable to escape into hyperspace. The Meditation Sphere forced it to land, and the Sith embarked on a hunt of the surviving crew, splitting into two teams for the search—Vestara, Myal, and Workan in one, and Rhea and Taalon in the other. Vestara's team killed two of the crew, and Taalon and Rhea cornered the remaining four. Before long, Taalon ordered Vestara to return to the freighter to take inventory. On her way back, Vestara—disappointed at being denied the chance for a kill—encountered a girl who had been a passenger on the freighter. The girl told the Sith apprentice that she had just escaped slavery, and although the girl begged for her life, Vestara killed her with a parang. Ship then told Vestara to name the girl, and the apprentice decided to call her \"First,\" since the girl had been her first kill."}, {"tag": "p", "text": "Under Ship's guidance, Vestara and her Tribe continued to travel in the Meditation Sphere beyond Kesh, battling other ships and leaving no survivors. They used the parts from the vessels they defeated to rebuild the Omen, the ship in which the Tribe's ancestors had crashed on Kesh. With the Omen repaired, the Tribe began to capture starships, from which they formed a new Sith armada. One of the first battleships captured by the Tribe was renamed the Eternal Crusader and placed under the command of Lady Rhea, and Vestara served aboard the vessel with her Master. During their travels abroad in the galaxy, the young Sith apprentice became a skilled killer."}, {"tag": "h3", "text": "Strike team"}, {"tag": "p", "text": "In 43.5 ABY, the exiled Jedi Grand Master Luke Skywalker came into contact with the Codex, an Aing-Tii relic that magnified his presence in the Force, causing his power to be felt by the members of the Sith Tribe. The Sith decided that they needed to kill him in order to pave the way to reinstate the Sith Empire as the ruling power in the galaxy. Rhea and the Tribe's Grand Lord Darish Vol handpicked a strike team to be sent under Rhea's command to find and kill Skywalker, and Vestara was among those chosen. Before they left, however, the dark side entity Abeloth sent out a call through the Force that took control of Ship, causing the Meditation Sphere to desert the Sith Tribe. The strike team was then given the priority of first tracking down and recovering Ship before finding and killing Skywalker."}, {"tag": "p", "text": "Also among those beings chosen for the mission were Raas and his Master, Yuvar Xal. The team left Kesh aboard the Eternal Crusader and used Vestara's unique connection to Ship to follow the Meditation Sphere to a planet in the Maw. Some members of the team worried that they were being led into a trap, as they deduced that the Meditation Sphere was intentionally allowing the Sith to follow it; but the Sith continued on their mission anyway. Upon their arrival at the planet, the Eternal Crusader remained in orbit while a search party, including Vestara and Rhea, was sent planetside to find Ship. The Sith found that the world was home to several deadly forms of plant-life, and they lost several members of the team to the carnivorous flora. Before long, the Sith encountered a beautiful, powerful being named Abeloth, who was able to control all of the life on the world. Abeloth pretended to help the Sith in their search for Ship and agreed to return to Kesh with the strike team, but in actuality she used her influence over the Meditation Sphere to keep it away from them as the Sith fell one-by-one to the planet's flora."}, {"tag": "h4", "text": "Calamity at Sinkhole Station"}, {"tag": "p", "text": "As the Eternal Crusader's supplies were depleted, Rhea finally decided that they should leave, as she believed that returning to Kesh with the powerful Abeloth would more than make up for losing Ship. However, Abeloth then let Vestara catch a glimpse of Ship, and the Sith again chased after the vessel. As they crossed a river, however, Rhea was dragged by a siphon reed into a whirlpool. Despite Abeloth's warning, Vestara jumped into the water and followed Rhea in an attempt to save her Master. As Vestara caught up with the Sith Lady beneath the water, she used her lightsaber to cut open the reed and free Rhea. Rhea used the Force to pull them back to the surface, and they were caught and drawn back to the shore by Raas. Afterward, although Abeloth still appeared as a beautiful woman to the other members of the strike team, Vestara was able to perceive Abeloth's true form—a humanoid with a large mouth, stubby arms, and tentacles instead of fingers. Nevertheless, Vestara's attempts at convincing her fellow Sith of Abeloth's true nature failed, and the strike team remained on the world as more and more members were killed. The strike team continually sent shuttles of reinforcements down from the Eternal Crusader to replace the Sith losses, until finally there were no more Sith aboard the vessel. As Ship remained hidden from the Sith, Xal prepared to initiate a coup against Rhea."}, {"tag": "p", "text": "Before Xal's plans could be carried out, however, Abeloth discovered that Skywalker and his son, Jedi Knight Ben Skywalker, were aboard Sinkhole Station, a space station in the Maw. She thus allowed Ship to return to the Sith, convincing them that they should capture the Jedi and return with them to Kesh rather than killing them as had originally been planned. Vestara and the approximately fifteen surviving members of the strike team traveled to Sinkhole Station aboard Ship and prepared an ambush for the Jedi, although Rhea changed the mission's objective back to killing them. When the ambush commenced, Vestara lay in wait with Xal, Raas, and the Sith Saber Baad Walusari in a junction through which the Skywalkers would have to pass in order to reach their vessel, the Jade Shadow, in the space station's hangar. As the Skywalkers passed the junction, Vestara and Walusari launched a set of grenades at the Jedi. Xal had planned with his apprentice to execute his betrayal at that moment; he and Raas Force-pushed the grenades back at Vestara and Walusari before turning to attack the Jedi themselves. Rhea had foreseen the betrayal, however, and had given Walusari and Vestara fake grenades to throw first. Upset at Raas' betrayal of her, Vestara threw her shikkar—a glass dagger—at Xal, killing him. With Raas distracted by Xal's cry of pain, the Jedi quickly dispatched him. Walusari then tried to throw fragmentation grenades at the Skywalkers, but the Jedi sent the grenades back at him, killing him."}, {"tag": "p", "text": "Vestara managed to cut Luke on the face with her parang; however—unbeknownst to the Sith—he had allowed her to cut him so that he could establish a blood trail on her that would allow him to track her. The Grand Master then knocked her out with a blow to the face, bound her, and took her captive as he and Ben continued to head for their vessel. They were soon attacked by more of the Sith, and Vestara regained consciousness and joined in the assault. Ben fired on her with his blaster as she fled down a hall, but Luke ordered Ben to let her escape. Vestara located her Master and two other Sith—the only remaining survivors of the strike team. As Ben prepped the Jade Shadow for flight, Luke returned to the station inside a lift. When the doors opened, Vestara and the last three Sith began to duel the Grand Master. He killed two of them quickly, leaving just Khai and Rhea. They fought the Jedi inside the lift as it headed back for the hangar, scoring hits on his vac suit. However, he deflected a blaster shot into Vestara's boot and began dueling with Rhea one-on-one, using the Force to hold the apprentice in place. As the lift doors opened behind Luke, Ben fired on the Sith from the Jade Shadow, distracting Rhea and allowing Luke to kill her. Vestara used the distraction to flee from the Jedi, realizing that, without her Master, she was completely outmatched. She saluted Luke and then fled in a SoroSuub StarTripper yacht, She's a Chancer."}, {"tag": "h3", "text": "Dathomir"}, {"tag": "p", "text": "Vestara feared that the Jedi would attempt to locate her Sith Tribe by following her, so she sought to hide her presence on a world with a large concentration of Force-sensitives, from where she could send a secure message back to Kesh and inform her Tribe of the strike team's destruction and her current location. The planet she ultimately chose was Dathomir, a world inhabited by Force-sensitive beings known as Dathomiri Witches. Upon landing there, she sent a hypercomm message to her Tribe and made a deal with a group of Nightsisters—a female-dominant organization of dark side Witches—to exchange information and Force techniques with her Tribe."}, {"tag": "p", "text": "Vestara traveled into the Dathomir rainforests, where Olianne Sihn of the Raining Leaves Clan of Dathomiri Witches found the young apprentice on the verge of collapse. The Clan decided to keep Vestara under their protection, and Sihn planned to adopt her. Meanwhile, the Skywalkers arrived and found the Raining Leaves Clan, which was about to begin a conclave with the all-male Broken Columns Clan in order to merge the two Clans into one. The Skywalkers confronted Vestara, but the Raining Leaves Clan forced the Jedi to leave her alone since they had adopted her into their tribe. As the conclave began, the Nightsisters began to disrupt the proceedings; they were anti-male and did not want the Clans to merge. The Nightsisters attacked the two tribes with rancors and their Force powers multiple times during the conclave. In one of the battles, Vestara stole Ben's lightsaber and used it to save Luke's life from the attacking Nightsisters. Ben thanked her for that act, but he remained suspicious of her."}, {"tag": "p", "text": "Eventually, the two Clans succeeded in merging to form the Bright Sun Clan, but they were soon afterward beset by the largest Nightsister attack yet. On the newly christened Bright Sun Hill, the Clan—with the help of Vestara, the Skywalkers, and the Jedi's Force-sensitive guide Dyon Stadd—managed to defeat the Nightsisters one final time. Afterward, Vestara secretly gathered the surviving Nightsisters in a landing meadow to meet with members of her Tribe who had just arrived in-system. However, the Nightsisters, commanded by Dresdema, were furious to find that the Lost Tribe also consisted of males, and they attacked the Sith. The Tribe, led by Lord Viun Gaalan, easily defeated the Nightsisters, capturing them and taking them back to the fleet in orbit."}, {"tag": "p", "text": "Gaalan praised Vestara for her efforts, and she went to retrieve one last Nightsister—Halliava Vurse, who had been undercover as a member of the Raining Leaves Clan. However, Stadd and the Skywalkers had noticed that Vestara had gone missing and tracked her to the landing meadow, where they confronted Gaalan and three other Sith who had remained behind to wait for Vestara and Vurse. The Jedi defeated the Sith, and Gaalan fled in his shuttle just as Vestara returned with the Nightsister. The Skywalkers then took Vestara captive, exposing her treachery—as well as Vurse's betrayal—to the Bright Sun Clan. The Clan decided to exile Vestara from their midst, finally allowing the Jedi to keep her in their custody. The Skywalkers returned to the Jade Shadow in the Dathomir Spaceport and took Vestara captive aboard their ship, planning to chase after Gaalan. However, as they reached orbit they were confronted by eleven capital class ChaseMaster frigates under the command of the Sith High Lord Sarasu Taalon, who ordered them to enter a parking orbit lest he order his vessels to fire."}, {"tag": "h3", "text": "Alliance with the Skywalkers"}, {"tag": "h4", "text": "Klatooine"}, {"tag": "p", "text": "Taalon told the Jedi that Abeloth had been causing a psychosis amongst the Tribe's apprentices, just as she had been doing to many of the Jedi Order's Jedi Knights. Taalon went on to propose an alliance with the Jedi to defeat Abeloth, since she was a common enemy. Luke was dubious at first, but eventually agreed to the deal, with the provision that Vestara was to remain aboard the Jade Shadow. The Jedi vessel was then contacted by her father, Gavar, who had accompanied Taalon on the mission. Despite Luke's initial reluctance, Ben convinced his father to allow Gavar to briefly come on board and speak privately with Vestara."}, {"tag": "p", "text": "The two Sith knew that the Jedi would record their conversation—which indeed Luke did—and so they spoke in the Keshiri language. Gavar reassured Vestara that her mother was still doing well, and gave his daughter a shikkar in the hopes that one day she could kill one of the Skywalkers with it. In turn, she presented him with a layout of the Jade Shadow. He also revealed to her that the Sith alliance was a sham—the Tribe's apprentices had not fallen under Abeloth's influence at all—although he neglected to tell her the true objective of the Sith mission. He also spoke with her about the fact that she was attracted to Ben and suggested that she use that to glean information from him and potentially turn him to the dark side."}, {"tag": "p", "text": "Luke and Taalon agreed to meet up with Luke's friend, Lando Calrissian, who intended to provide them with the Colossus I Beta Series asteroid tug Rockhound for assistance in navigating the dangerous Maw. They decided to wait for Calrissian at the planet Klatooine in the Si'Klaata Cluster. There, Luke allowed Ben and Vestara to travel to the planet's surface with Stadd in order to restock the Jade Shadow's supplies. Having grown up on a remote planet, Vestara was awed by the diversity of activity on Klatooine. She continued her flirtatious behavior with Ben—which he reciprocated—and attempted to avoid any conflicts of their ideologies so as not to upset him. They were interrupted, however, when Stadd suddenly fell prey to Abeloth's influence, causing him to believe that everyone had been replaced by impostors. He fled the market, heading for the Fountain of the Ancients—a sacred wintrium Fountain that was surrounded by a one-kilometer zone wherein no technology was allowed—in the Derelkoos Desert. Vestara and Ben pursued Stadd, and she assisted him in capturing the Force-sensitive, taking care to prevent the psychotic man from dying in the process."}, {"tag": "p", "text": "Klatooinian guards subsequently took Vestara, Ben, and Stadd captive, although the Sith and Jedi were only held thus because they were underage. The Klatooinians took them to the Treema Courthouse and Detention Area, where Vestara and Ben passed the time waiting for their fathers by telling jokes. When Luke and Gavar arrived, Gavar privately scolded Vestara about how she had helped Ben, but she replied that she had done it only to cement the young Jedi's trust in her. The Skywalkers returned to the Jade Shadow with Stadd, whom the Klatooinians had gladly turned over, realizing that they would be unable to hold the psychotic Force-sensitive for long. Meanwhile, Luke had sent a recording of Vestara's conversation with her father during their meeting aboard the Jade Shadow to the protocol droid C-3PO for translation. Although the droid was unfamiliar with the language, he was able to give Luke a rough translation of it in Basic. Luke showed the transcript of the translated conversation to his son, who was deeply upset that the Sith were planning to betray the Jedi and that Vestara hoped to turn him personally to the dark side. Ben began acting coldly toward her, and she was upset by his sudden change of attitude, unaware of what caused it."}, {"tag": "h4", "text": "Into the Maw"}, {"tag": "p", "text": "With tensions between the Jedi and Sith rising, Luke and Taalon agreed that they no longer wanted to stay on Klatooine, so the allied fleet left the planet to await Calrissian just outside the Maw. Calrissian finally arrived with Jedi Knight Jaina Solo, who had come in hopes of assisting the Skywalkers in the dealing with the Sith. The fleet entered the Maw, heading first for Sinkhole Station, where Luke hoped to find information that could prove useful for their mission. Upon their arrival, however, they found that the space station had been completely destroyed. Two of the Sith frigates moved into the debris field, although the Rockhound attempted to stop them with its powerful tractor beams. It managed to save one of the frigates, but the other collided with debris and exploded. Vestara and the Skywalkers deduced that Sinkhole Station had been built to contain Abeloth, but she had become powerful enough to break free and destroy the space station. The fleet then agreed to head straight to Abeloth's planet."}, {"tag": "p", "text": "When they arrived in orbit over Abeloth's planet, Vestara sensed Ship and could tell that he was unhappy serving Abeloth. She also learned that Ben had previously piloted Ship for a short time. Concerned that Abeloth might try to free Stadd now that they were so close to her, the Skywalkers sent Vestara to check on the psychotic man. Vestara decided to use Stadd to find Abeloth by tricking him, but she neglected to tell the Jedi of her plan, fearing that they would not trust her. Vestara lied to Stadd that she was an impostor, telling him that she—along with all of the other impostors who had chosen to replace Sith—were associated with Ship, who was serving Abeloth; thus convincing him that the impostors of the Sith were on his side. She asked if he would lead them to Abeloth, and he replied that he would. Then, rather than giving him more of his sedative as the Skywalkers had requested of her, Vestara gave him the antidote and scrambled the machine that was monitoring him. She requested that he pretend to be unconscious if the Skywalkers came in to check on him, telling him that she would soon return to unlock his stun cuffs."}, {"tag": "p", "text": "After they landed on the planet, Vestara and the Skywalkers met with Taalon, Gavar, and Sith Captain Leeha Faal. Luke suggested that they travel in the realm of the Force called beyond shadows—something he had learned to do from the Force-sensitive Mind Walkers who had lived at Sinkhole Station—in an attempt to find Abeloth, since he had first seen her while Mind Walking. Vestara was strongly opposed to the idea and attempted to talk her fellow Sith out of it—having seen the decrepit Mind Walkers at Sinkhole Station during the strike team's ambush of the Jedi, she knew that Mind Walking was very dangerous and could severely weaken and even potentially kill any who attempted it. The other Sith concurred with Luke, however, and agreed to his idea. Upon her return to the Jade Shadow, Vestara spoke with Stadd once more, telling him that he should escape while Luke and the Sith were beyond shadows."}, {"tag": "p", "text": "Vestara was left with Ben on the Jade Shadow to monitor Luke's physical body while he, Gavar, Taalon, and Faal attempted to find Abeloth beyond shadows. While Ben monitored his father, Stadd suddenly broke free from his room and charged for the vessel's exit. Ben called for Vestara to stop him, but instead she stepped aside and let Stadd pass. Suddenly, Luke returned from beyond shadows—Faal had been killed, and Luke had discovered that the presence that had been reaching out to him the entire mission, which he had assumed to be the spirit of his deceased wife, was actually Abeloth. Ben then revealed to his father what Vestara had done, and the two Jedi confronted her. However, she replied that she had placed a tracking device on Stadd and let him go free so that they could follow him to Abeloth. Vestara and the Jedi met up with Taalon, Gavar, and nineteen other Sith to track Stadd."}, {"tag": "p", "text": "They found Stadd in a cave on the side of a volcano—the same cave where Vestara and her strike team had originally met Abeloth. There, they found Stadd on the ground, barely alive, and no longer possessed by the psychosis. He revealed that Abeloth had attempted to consume his life force but had left him for dead when she sensed the allies' approach, and that while he still felt her influence on his mind, he realized that it was not the truth. Stadd stayed behind at the cave entrance with two Sith guards while Vestara, the Jedi, and the rest of the Sith traveled deeper down a tunnel in the back of the cave to find Abeloth. Eventually, they reached a courtyard at the end of the tunnel. There, Luke called out to Abeloth, and she suddenly appeared behind him."}, {"tag": "h4", "text": "Confronting Abeloth"}, {"tag": "p", "text": "Abeloth attempted to trick Luke into believing that she was Callista Ming, his former lover, but ultimately failed, as he realized that Abeloth had only consumed Ming—as she had attempted to do with Stadd—and then taken on her appearance. The strike team attacked Abeloth, and several Sith began weaving a control web—a technique they had learned from the captured Nightsisters—over Abeloth in the hopes of capturing her. The Khais, Taalon, and the Skywalkers all charged Abeloth, but the entity grabbed Vestara by the throat with the Force and raised her off the ground, violently shaking her. Vestara attempted to shoot Force lightning at her, but Abeloth turned the lightning back on the Sith apprentice and raised large, white, spiked roots out of the ground, stabbing Vestara with them several times. Ben quickly came to rescue her, slashing through the roots with his lightsaber and carrying Vestara away from the battle in his arms. A quick examination revealed that she wasn't mortally injured, but she grabbed Ben and told him that the spikes were poisonous. He began to search his possessions for something that could help her wounds, and the Sith chose that moment to execute their betrayal of the Jedi—Gavar turned a strike away from Abeloth and toward Luke while the rest of the Sith lowered the control web onto Abeloth."}, {"tag": "p", "text": "Ben shouted a warning to his father, who managed to block Gavar's attack. Vestara tried to insist that she needed Ben's help, but he was furious at her betrayal, and he jumped away and engaged her father in a duel. Luke, meanwhile, slowly gained the upper hand in the battle against Abeloth while Ben began to press Gavar back; however, Abeloth set off a Force blast that repulsed everyone in the area, and she fled back up the tunnel. Luke was the first to recover and chase after her, with Ben and the Sith shortly behind and Vestara in the rear. Catching up to the entity at the cave's entrance, Luke managed to defeat and apparently kill Abeloth, despite another attempt to trick him. Afterward, the Sith repaired their alliance with the Jedi so that they could jointly investigate more into Abeloth and her origins. Taalon and Luke decided to send Calrissian, Solo, and the entire Sith fleet offworld, excepting the Khais and the High Lord himself. Vestara also went back to the Jade Shadow to be treated for her injuries."}, {"tag": "p", "text": "As Taalon, Luke, and Gavar began to investigate Abeloth's origins, Vestara remained under Ben's watch aboard the Jade Shadow, along with the recovering Dyon Stadd. However, Vestara suddenly felt Ship's presence returning, and she tricked Ben, managing to lock him in the ship with Stadd while she escaped. A bloodvine caught and nearly killed Vestara—releasing pollen that temporarily blinded her, restricting her movement with vines, and holding her over the edge of a cliff—but Ben, who had broken free, tracked her down and helped rescue her. They then made their way to the site of some ancient ruins that Luke and the other Sith were investigating. Gavar confronted Vestara about leaving the Jade Shadow, but upon Taalon's arrival, she told the High Lord that she had sensed Ship's return. She and Taalon then returned to find Ben attempting to sneak off with Abeloth's corpse while Luke distracted Gavar, and Taalon quickly moved to attack Ben. However, Vestara suddenly noticed that Abeloth's body was morphing into that of Dyon Stadd's—they realized that the entity had somehow switched bodies with Stadd before Luke had killed her. The Jedi concluded that that meant that the \"Stadd\" aboard the Jade Shadow was actually Abeloth; after a lengthy standoff, the Jedi finally convinced the Sith to return to their vessels. There, however, they discovered that Abeloth had already escaped."}, {"tag": "h3", "text": "Pool of Knowledge"}, {"tag": "p", "text": "As they searched through the jungle for Abeloth to no avail, the Sith accused the Jedi of hiding Abeloth's corpse from them. However, when the tenuous allies conversed with Ship, the Meditation Sphere claimed that Luke knew where to find Abeloth. The Sith turned on the Grand Master, who revealed that he believed they could find her at the Pool of Knowledge—a Force nexus on the planet that he had visited while beyond shadows with the Mind Walkers. Ship transported them across the planet and then left them to find the Pool for themselves. The allies split up into two groups to locate the nexus—Vestara and Ben in one, and the three elders in the other. Vestara and Ben found the Pool in a grotto, and Vestara quickly alerted her fellow Sith through the Force. Ben attempted to convince her to leave the place and forget that they had ever found it, telling her that it would be too dangerous, and that Ship was just trying to pit the Jedi and Sith against each other. Just then, however, Taalon, Gavar, and Luke all arrived on the scene, and the five allies entered the grotto."}, {"tag": "p", "text": "In the Pool, Vestara and Ben both viewed adult versions of themselves together. Suddenly, Ben exclaimed that he had seen an image in the Pool of Abeloth running for their vessels, and that they needed to return to them before she escaped. Gavar questioned Vestara whether that was true, but she had not been looking and was unsure. The Pool then showed Tahv and the Takara Mountains, and Gavar quickly moved to attack Ben, suspecting that the Jedi were trying to discover the location of the Sith homeworld. Luke pushed the Sith Saber away, but Taalon suddenly saw a Jedi queen upon the Throne of Balance within the Pool, and, fearing that she could prevent the Sith's planned invasion of the galaxy, demanded to know who she was. The Skywalkers recognized her as Allana Solo, the daughter of Luke's nephew, Jedi Knight-turned-Sith Lord Darth Caedus. The Jedi thus chose that moment to attack, knowing that a fight was going to break out no matter what. Ben pushed past Vestara, who was shocked by his sudden attack on her; but he was too late to stop Taalon from jumping into the Pool. Vestara recovered and assailed Ben, but he sent her flying backward, and she collided into Taalon as he reemerged from the Pool. The High Lord punched her in fury, but she joined him in battle against Luke while her father incapacitated Ben. Luke, however, used the Force to slam Gavar into Vestara and Taalon, and then cut off Gavar's forearm with his lightsaber. Luke was repelled by Force lightning, and he and Ben quickly fled the grotto, collapsing the entryway behind them."}, {"tag": "p", "text": "As the Sith recovered from the battle and dug their way out of the grotto, Taalon and Gavar decided to use Vestara as a spy to learn as much as possible about the Jedi queen that Taalon had seen. Taalon beat her severely to make it appear as though they had been punishing her and she had fled from them. Before sending her to join the Jedi, however, Taalon and Gavar confronted Vestara about whether she and Ben had fallen in love. Vestara's response was hesitant, but Taalon revealed that he wanted them to fall in love so that Ben would come to trust her, because the Sith could use that trust to their advantage. Gavar and Taalon then sent Vestara off to the beach where they had left their ships, and they followed close behind her. Vestara arrived at the beach to find the Jade Shadow already gone. Disappointed, she decided to await the arrival of Taalon and her father to tell them the news—unbeknownst to her, the Skywalkers were still there, hiding; it was actually Abeloth who had fled in the Jade Shadow. Since Luke saw Vestara's reaction to the missing Jade Shadow, he concluded that she was not actually running from the Sith and deduced their plan. When Taalon and Gavar arrived behind Vestara, Taalon blasted her with Force lightning and sent her tumbling down a sandy bank. Luke came out of hiding and provided cover fire, forcing Taalon and Gavar to take shelter. As Luke and the two Sith exchanged fire, the Grand Master retreated down the bank to Vestara. Taalon and Gavar moved closer, but accidentally triggered a thermal detonator that Luke had left as a trap for them in the jungle. Luke and Vestara then fled to the Emiax, Taalon's personal shuttle, where Ben was waiting. As Vestara and the Jedi boarded the shuttle, Taalon and Gavar reemerged. Luke fired on the two as he, Vestara, and Ben escaped in the Emiax."}, {"tag": "h3", "text": "Events on Pydyr"}, {"tag": "p", "text": "Aboard the Emiax, Vestara, Luke, and Ben tracked Abeloth to Pydyr, a moon of the planet Almania. They received a message warning them not to approach the surface due to the outbreak of a terrible plague, but Luke decided to land the shuttle in the spaceport in the capital city of Corocus anyway. While Luke investigated the situation and tried to locate Abeloth, Vestara escaped the shuttle and found a public S-thread booth, where she sent a quick message to a Sith relay center on the planet Boonta. She reported that they had reached Pydyr, and that she believed the Jedi had already called for reinforcements. Ben found her and began to question her, asking her to return to the shuttle, but she convinced him to come with her to seek out his father. They eventually found him with the Jade Shadow in a cave where he had just finished speaking with Akanah Norand Goss Pell, a member of the pacifistic Force-sensitive Fallanassi. While Vestara and the Skywalkers regrouped and contemplated further action, Vestara and Ben both began to show signs of the planetwide plague—unbeknownst to both of them, the plague was merely an illusion put forth in the White Current, the Fallanassi's interpretation of the Force. Thus only Luke, who knew how to access the White Current, showed none of the effects of the disease."}, {"tag": "p", "text": "Soon, the Kondo-class assault shuttle Obuuri arrived with a large contingent of Sith reinforcements, including Sarasu Taalon—who, following his dive in the Pool of Knowledge, had begun to transform into the same kind of being as Abeloth—and Gavar Khai. Gavar and Luke clashed immediately and prepared to open battle, but Taalon told Gavar to back down, insisting that once he learned what exactly he was becoming he would help the Jedi kill Abeloth. Aboard the Jade Shadow, Vestara, her father, Taalon, the Skywalkers, and fifty more Sith traveled alongside the Obuuri in search of the Fallanassi's village. Luke tried to tell the Sith that their hazard suits would not protect them from the plague, revealing that both Ben and Vestara had worn the suits and both showed symptoms anyway; but Gavar accused Luke of neglecting to protect his daughter while Taalon asserted that the Jedi was trying to trick the Sith. The Jade Shadow and the Obuuri were soon assailed by the Fallanassi's defenses—more illusions in the White Current. The ships were beset by a fleet of Sith Meditation Spheres, and although Taalon at first kept up the pretense that the Spheres were all under Sith control, Vestara and the other Sith grew fearful as the fleet neared them. The Obuuri finally opened fire, but Luke, who was aware that they were just illusions, was able to fly the Jade Shadow straight through the Spheres. Soon afterward, the Obuuri crashed into a cliff that had been hidden by illusions. Taalon began to demand that they land and await more reinforcements, but just then they reached the island that was home to the Fallanassi. Luke dove his vessel down to the village, and the illusions hiding it were broken."}, {"tag": "p", "text": "The Sith and Jedi were greeted by the Fallanassi, who agreed reluctantly to help nurse the Sith who had contracted the plague. Taalon, however, finally saw the plague for what it was and demanded to know Abeloth's whereabouts. When Pell stepped forward to speak with the newcomers, Taalon began to question her and even had Vestara's father hold another Fallanassi hostage in an attempt to make Pell more forthcoming. She revealed that Abeloth had come to the Fallanassi because she was one, but when Luke questioned whether that meant she had always been one or if she had joined more recently, Pell refused to answer. On Taalon's orders, Gavar killed the hostage; Pell grew furious and attacked the Sith Saber with an illusion that drove him to madness. As Gavar ran screaming from the gathering, Vestara tripped him with the Force. However, he remained under the illusion's power, and she finally used the Force to knock him out. Pell—who was actually Abeloth in Pell's body—then released visions onto all of the Sith present, save Vestara and Taalon, driving many to commit suicide by jumping into the surrounding ocean."}, {"tag": "p", "text": "Abeloth then invited Taalon to a gathering hall to converse with him, and Vestara and the Skywalkers followed them. Luke told the Sith that Abeloth was just trying to play them against each other, but his words were in vain; and realizing he could not reason with the Sith to avoid conflict, Luke began to maneuver to the best possible position from which to attack. Taalon recognized Luke's intention and opened battle on the Jedi. While Vestara and Taalon fought with Ben, Luke turned on Abeloth and quickly defeated her, killing Pell's body. Luke then joined Ben in battling the Sith, but Abeloth returned to the scene in the form of Callista Ming. Abeloth quickly overpowered the already weakened Luke, but she stopped Taalon from killing him, instead knocking the Grand Master unconscious and insisting that he suffer as she had. Taalon then trapped Ben in a Force net, and they retrieved Vestara's unconscious father from outside and brought him into the hall. As Vestara watched, Taalon spoke with Abeloth about what he was becoming, and the entity began to feed him dark energy from her tentacles. As Luke finally began to reawaken, he caused a distraction by collapsing the ceiling with the Force. Vestara, knowing that Taalon could not be allowed to turn into another Abeloth, took advantage of the distraction to jump forward and kill the High Lord."}, {"tag": "p", "text": "With Taalon's death, the net holding Ben disintegrated, and the Skywalkers attacked Abeloth. Khai threw her lightsaber to the Jedi to use in battle—their own had been taken from them after their capture—and then blasted Abeloth with Force lightning. Weakened, Abeloth repulsed Luke with the Force and fled the gathering hall. Vestara then turned on the Jedi and ordered that they prepare themselves to be taken into Sith custody, but Luke used the Force to awaken her father while simultaneously praising Vestara for killing Taalon. Gavar, who was unaware of the full circumstances surrounding Taalon's death, moved to confront Vestara over her apparent betrayal. Vestara knocked him out again with the Force and then fled the hall with the Skywalkers, knowing that the Sith would not allow her time to explain her actions. As she and the Jedi made their way toward the Jade Shadow, however, the other Sith began to awaken and recover from their illusions; since Abeloth had fled, her hold over them was finally gone. Master Vhool confronted the Jedi and, unaware of Vestara's situation, ordered her to start up the Jade Shadow while he went back to the hall to find Taalon."}, {"tag": "p", "text": "Vestara had started up the ship and brought its blaster cannons around to bear when a wing of Jedi StealthX starfighters, along with Captain Booster Terrik's Star Destroyer Errant Venture, suddenly arrived and opened fire on the Sith. Meanwhile, Vhool discovered that Vestara had killed Taalon, but before the Tribe could stop her, she opened fire on them, again saving the Skywalkers and giving them time to rush on board the vessel. As they lifted off from Pydyr, the Errant Venture contacted the Jade Shadow. Both sides briefly updated each other on their respective recent events, but Luke refused to take any time to rest. He deduced that since Abeloth was not dead, the only reason the Jedi back on the galactic capital planet Coruscant had recovered from their psychosis following the events on Abeloth's world was that the entity had been weakened; he decided they needed to keep her weak and on the run in order to prevent her from gaining too much power. As the Errant Venture and the StealthXs forced the Sith to retreat, Vestara and the Skywalkers plotted their course to continue hunting down Abeloth."}, {"tag": "h3", "text": "Nam Chorios"}, {"tag": "p", "text": "After they left Pydyr, Vestara and the Skywalkers tracked Abeloth to the space station Meliflar Station. Upon their arrival they were ambushed by the station's inhabitants. After forcing them to surrender, Khai and the Skywalkers consulted with their leader, Hallaf, and learned that his daughter had been put into an unconscious state by Abeloth, and that the stations' residents had then been ordered to kill the Skywalkers. However, the smuggler Cardya had led a mutiny against Hallaf, and the inhabitants had then decided to try to capture the Jade Shadow rather than destroy it. Luke then drew on the taint left by Abeloth in Hallaf's daughter and discoved that she intended to travel to the planet Nam Chorios. Vestara and the Jedi traveled to the world, where they searched for the Theran Listeners, a group of Force-users who had unique abilities and whom the Skywalkers suspected Abeloth intended to control. Luke found one of the Listeners, Taselda, whom he had met on his first trip to Nam Chorios decades earlier."}, {"tag": "p", "text": "Taselda took Vestara and the Skywalkers to meet Listener-Master Taru Durn, who taught Luke the technique of mnemotherapy—a Force power that allowed the user to draw out and destroy the memories of a being. They soon learned that Doctor Cagaran Wei had gone missing, and they suspected his disappearance was related to Abeloth. Vestara and the Skywalkers thus traveled to Wei's home in the city Hweg Shul, where they met with the Ithorian mayor Snaplaunce. Wei's landspeeder logs showed that he had gone to a rock ivory processing plant 483 kilometers from Hweg Shul. Snaplaunce then agreed to provide the three of them with transport—his customized TIE/sh VIP shuttle, Vote Snaplaunce. However, during their flight Ship attacked them and forced them to maneuver off-course. Koval Station Control contacted them and ordered them not to deviate from their flight plan, but they were unable to reply before the Station began to fire its turbolaser at them. The shuttle sustained heavy damage, and one of the Station's shots hit one of the planet's sentient crystal life-forms, a tsil, creating a massive death convulsion."}, {"tag": "p", "text": "While the disturbance made Luke lose control of the shuttle and plummet into a dust storm, it also made Ship flee the area. The dust storm itself interfered with Koval Station's lock on the Vote Snaplaunce, and the shuttle's engines soon failed, forcing them to land. Vestara and the Jedi quickly found Wei's corpse at the processing plant and speculated that either Wei had been bait to set them up for the ambush, or else someone—possibly Snaplaunce himself—had sabotaged the shuttle's engines in order to strand them out there. While they assessed the damage to the shuttle, Vestara realized that although the laser cannons had been removed, their internal wiring remained. They then managed to turn what remained of the shuttle into a functioning landspeeder, and Luke learned from communicating with the tsils that the Theran Listeners had fallen under Abeloth's control."}, {"tag": "h4", "text": "Aiding the Jedi"}, {"tag": "p", "text": "Using the makeshift speeder, Vestara and the Skywalkers returned to Hweg Shul, where they discovered that they were wanted for the murder of Wei, and that someone had attempted to assassinate Snaplaunce. The three made their way to Taselda's home, and Luke used the mnemotherapy technique to find out that she was under Abeloth's control. From Taselda, they learned that the Master of the Theran Listeners, Nenn, had been taken to a pumping station outside of Hweg Shul. Vestara then sent a message directly to her father, informing him that Abeloth was in an underground pumping station on Nam Chorios. The next morning, she and the Jedi commandeered a modified T-47 airspeeder and traveled to the pumping station in the town of Kesla Vein. There, however, they were ambushed by three Sith serving under the command of Saber Tola Annax. Annax confronted Vestara about Taalon's death, and she revealed that the Sith were aware of his impending transformation. Annax ordered that Vestara surrender, with the incentive that she may be acquitted of her betrayal. Vestara, however, declined the offer, and a duel broke out, in which Vestara killed one of the Sith. Annax quickly blew up their T-47 and fled the area."}, {"tag": "p", "text": "Soon afterward, Vestara and the Skywalkers again came under attack by the Sith near the site of the T-47's destruction. Meanwhile, the reporter Kandra Nilitz had heard of the T-47's explosion, Luke Skywalker's suspected involvement, and of a news blackout in the town of Crystal Valley; and she decided to try and find Luke. Nilitz approached them in the midst of the combat, and Vestara and the Jedi quickly jumped aboard her rental speeder and fled the area. Luke decided that their next move would be to find Crystal Valley—the tsils nearest there confirmed that Abeloth was in that vicinity—and he rewarded Nilitz for helping them by informing her of Abeloth and the Lost Tribe of Sith. When they arrived, Luke allowed Nilitz and her camera operator to use a series of data links to film the upcoming confrontation. The Grand Master then told Vestara to send a message to Annax to inform her that Abeloth was at the Crystal Valley pumping station. Inside the facility, Vestara and the Jedi found many Theran Listeners lying in pain on the floor."}, {"tag": "p", "text": "Also in the station they found Jedi Knight Valin Horn, who remained under Abeloth's influence. Horn told them that he had learned from one \"Grand Master Callista Ming\" that the impostors had been invaded by an alien intelligence that separated them from the real Force. Before long, Abeloth emerged in the form of Ming; however, Ming's presence in her was stronger than any other, to the point that Ming was able to influence Abeloth's actions, forcing her not to attack Luke. Ming revealed that it was because of her presence in Abeloth that the entity came to want so many Jedi. As Luke conferred with Ming's presence, Sith reinforcements arrived and began to battle another manifestation of Abeloth elsewhere in the station. Horn believed that the Skywalkers had brought along Jedi to trap him and Abeloth, and attacked Ben. Vestara quickly joined the fray, helping Ben hold back the more experienced Jedi Knight. Meanwhile, Luke succeeded in using the mnemotherapy technique to withdraw Ming's presence from Abeloth and sever it. The blow weakened Horn, but Abeloth quickly took the form of Nenn. The Master of the Theran Listeners, however, refused to be used thus and stabbed himself. Horn lost consciousness, and from the area of the station where the Sith were fighting Abeloth, Vestara and the Skywalkers heard the entity scream in agony."}, {"tag": "p", "text": "Before they could join in the battle against her, however, they were set upon by Annax and a team of about two dozen more Sith. Vestara stood back-to-back with the Skywalkers as the Sith opened combat. Vestara quickly began counting down from ten, warning the Skywalkers that a major Force attack would hit them when she reached zero. They managed to survive the Sith onslaught for those seconds, and as she reached zero Vestara killed a tsil, resulting in a large death convulsion that incapacitated the Sith, further weakened Abeloth, and brought both Luke and Vestara to their knees. Prepared for it as they were, though, Vestara and the Jedi recovered before the Sith, and they fled the area with Horn. Luke admonished Vestara for killing the tsil, but Vestara countered that she did so because she knew that, against so many Sith, it was only a matter of time before they would have been killed. She reasoned that Luke was the only being she knew with the strength to defeat Abeloth, so she had to ensure his survival."}, {"tag": "p", "text": "While they had been inside the station, a fleet under the command of Vestara's father had arrived in-system. However, Luke had been hoping that such reinforcements would come—unbeknownst to Vestara, he had the Jedi wing of StealthXs waiting hidden in-system the whole time, and when the Sith arrived, the Jedi ambushed the fleet. Luke called to the Jedi forces to pick the four of them up; he piloted one of the StealthXs into battle while Vestara, Ben, and Horn were taken to safety. In the combat, Luke wounded Ship, who nevertheless successfully escaped with Abeloth on board while the Jedi forced the Sith armada to retreat."}, {"tag": "h3", "text": "On the hunt"}, {"tag": "p", "text": "After Vestara and the Skywalkers recovered from the battle on Nam Chorios, the Jedi fleet joined them in their hunt for Abeloth. Although they began to suspect that Abeloth had formed an alliance with the Sith, Vestara refused to give away the location of her Tribe's homeworld—she feared that if she did, the Jedi would wipe out all of the Sith there. Eventually, they agreed to try to find Ship, in the hope that locating the Meditation Sphere would lead them to Abeloth. Jedi Knight Jaina Solo arranged for them to work with the formerly psychotic Jedi Knight Natua Wan, who was stationed in the Jedi Temple on Coruscant, to research information on ancient Sith Worlds. After acquiring a list of several worlds deemed as possible locations for Ship, the Jedi fleet split up to search the planets. Solo joined Vestara and the Skywalkers aboard the Jade Shadow as they traveled to the planet Korriban, since it was the world from which the first Sith had originated. Despite Luke's reluctance, and to Vestara and Ben's surprise, Solo invited Vestara to accompany them planetside on Korriban because she believed that Vestara could prove useful."}, {"tag": "p", "text": "They landed on Korriban in the Valley of the Dark Lords, and Luke ordered that they stick together and communicate via comlink when not right next to each other. The dark side aura that permeated the planet filled Vestara with mixed emotions—on the one hand, she was wary of the powerful energy, but it also excited her. They began their search at a nearby citadel, which they found to be deserted. As the four began to grow convinced that they would not find anyone on Korriban, a group of tuk'ata Sith hounds approached them. Before they could attack, however, Vestara moved forward and spoke to them in the Sith, ordering them not to harm the Jedi. She then requested that they find any fellow Sith who may be on the planet; but the hounds replied with an uneasiness that meant they could not carry out her wish—there were no other Sith there. The Jedi were shocked as the tuk'ata then left them alone, and Solo was instantly suspicious of the Sith apprentice. Vestara, however, revealed what she had said and that none of the Tribe's Sith were on Korriban, and the Jedi agreed to leave. Unbeknownst to the Jedi, she had also told the tuk'ata to tell any other members of the Tribe that the hounds might encounter to hide."}, {"tag": "p", "text": "The four then went to the planet Dromund Kaas, where the Jedi were even more reluctant to let Vestara accompany them, partially due to various parallels in its history with that of the Lost Tribe's homeworld. However, Vestara argued that they only had three choices: they could kill her, leave one of their own number behind to guard her while the other two completed the mission, or they could take her with them. Convinced that it was the best option, Luke finally agreed to let her come along. Upon landing, Vestara and the three Jedi made their way to a temple surrounded by a powerful dark side Force nexus. Vestara was awed by the sheer strength of the dark side emanating from the area, and she and Ben split off from Solo and Luke to explore the temple. After several minutes of searching in vain, however, they became convinced that there was no one there. Just as the four were preparing to leave, they were suddenly ambushed by ten Sith Sabers, including Gavar Khai."}, {"tag": "h3", "text": "Orphaned"}, {"tag": "p", "text": "Luke instantly assumed that Vestara had again drawn the Sith to them, but to his surprise, Vestara ignited her lightsaber and stood with the Jedi against her father. Gavar admitted disappointment in her and revealed that Vestara's mother, Lahka, had recently been killed. Shocked, Vestara asked if it had been his doing, and although Gavar replied that it had not, he also revealed that he had not stopped it, and added that both his wife and daughter could be replaced. Gavar ordered his fellow Sabers to attack the Jedi, and he assailed Vestara himself. While the Jedi held off three Sith Sabers each, Vestara engaged in combat with her father. He told her that she had brought shame upon their family and accused her of betraying the Sith. Vestara, however, noticed that Gavar—who had taught her that she must always be in control of her actions and emotions—was fighting and acting in an out-of-control manner; and she realized that he had not stayed loyal to the Sith, either."}, {"tag": "p", "text": "As the duel wore on, Vestara began to push her father backward, and she finally sliced him from shoulder to hip, killing him instantly. Meanwhile, the three Jedi had defeated all of the other Sith Sabers, and they quickly moved to comfort Vestara. Solo revealed that she had had to kill her own brother—Darth Caedus—in order to save many beings' lives, including her own. She told Vestara that she would always miss her kin, but that she knew she had done the right thing. Meanwhile, due to the small number of Sith they encountered, Luke deduced that the Sith had guessed that the Jedi were hunting for them and had sent the team there to ambush them; thus the main fleet was elsewhere. Vestara also revealed that she believed that the Sith who had attacked them were under Abeloth's influence—during her duel with Gavar, she had sensed that Abeloth had control over him. Luke then decided that they should recouperate and head back to Coruscant."}, {"tag": "p", "text": "Later, Vestara mourned over her father's death in her quarters aboard the Jade Shadow. She tried to find solace by reviewing letters that she had written while on Nam Chorios—she had imagined that her father truly cared for her as if he were a Jedi and had written the letters as a way to comfort herself with such an imaginary relationship with him. She decided to write one more, now that he was dead; in it claiming that she missed him, that he was the best father she could have wanted, and that she appreciated how he had aided her in her life as a Jedi. Before she could finish, however, Ben walked in on her typing the message. He inquired as to what she was doing, and when she insisted that it was not his business, he grew suspicious. She tried to stop him from seeing what she had written, but after a quick fight he subdued her. She told him that it had nothing to do with the Jedi; however, Ben did not believe her, and he opened the files."}, {"tag": "p", "text": "When Ben saw that the letters were addressed to their father, he became convinced that she had been spying on them the whole time; but she told him to read them thoroughly. As the young Jedi Knight continued reading and realized what the letters actually were, he quickly became embarrassed and apologetic. Once he had started, however, Vestara did not want to let him stop and insisted that he finish them. When he was done, he tried to comfort her, apologizing again for intruding. Finally, Vestara asked Ben if he thought she could become a Jedi. He replied that he believed she could and promised that he would assist her in doing so. The two then shared their first kiss as Vestara took comfort in being able to feel trust and love by turning to the light side of the Force."}, {"tag": "h3", "text": "Mission to Upekzar"}, {"tag": "p", "text": "Luke Skywalker was shocked and suspicious to hear of Vestara's intentions to be a Jedi, but she agreed to open up her presence in the Force and allow him to examine her. The Grand Master found that she was sincere in her change of heart and decided to take her under his wing as his own personal apprentice. Once on Coruscant, Ben gave Vestara a tour of the Jedi Temple. They met with Jaina Solo and Natua Wan in the library, and Wan revealed that she believed Ship was on the planet Upekzar. Wan gave them a quick briefing on the planet, revealing that the world was home to the rhak-skuri—which translated to \"dream singer\" in the Sith language—a bug in the diplura family that secreted pheromones with hallucinogenic properties. Wan went on to report that the Sith there had based their culture on their contact with the bugs, and many of their dark side rituals and rites had been performed without protection from the hallucinations."}, {"tag": "p", "text": "Luke, meanwhile, reported Vestara's new allegiance to the Jedi Council and revealed that he wanted to move the Order off of Coruscant. Luke went on to appear on reporter Perre Needmo's show, The Perre Needmo Newshour, where he publicly announced his decision, claiming that the Jedi Order was going to sever all political ties; and while it would still help the Galactic Alliance, it would no longer do so as an official branch of the government. Soon afterward, almost every Jedi in the galaxy—well over one hundred altogether—left for Upekzar to kill Abeloth; and Vestara once again accompanied the Skywalkers aboard the Jade Shadow. However, Han Solo, Jaina Solo's father, contacted them and revealed that Galactic Alliance Security had arrested his wife, Leia, for charges of conspiracy against the government, espionage, and smuggling spice. Luke told Han to confer with interim Chief of State Padnel Ovin and his Chief of Staff, Wynn Dorvan, as both were friends of the Jedi. Vestara also suggested that Han take his adopted daughter, Amelia, with him."}, {"tag": "p", "text": "As the Jedi proceeded to watch the news on the HoloNet, one \"Kameron Suldar\" was shown as the head of a Senate Subcommittee to Investigate Jedi Activity, but Vestara recognized him as High Lord Ivaar Workan of the Lost Tribe of Sith. She began to divulge what she knew of him to the Jedi, but was surprised when Luke revealed that he already knew the man was a Sith. Luke told them that he had made such a show of the Jedi leaving Coruscant in order to set the planet as bait for the Sith. He wanted to lure them all to one place so that the Jedi could take care of Ship and Abeloth and then come back and defeat the Tribe—that way they would not have to deal with both threats simultaneously. Vestara told the Jedi that she believed Workan had arrested Leia Solo to make sure that the last Jedi left on the capital world was closely guarded and to bolster his own authority."}, {"tag": "p", "text": "Upon the Jedi's arrival on Upekzar, Luke ordered Vestara, Ben, and Wan to explore a group of caves on the planet while the rest of the Jedi hunted down Ship. As the three searched through the caves, however, they were beset by a gigantic rhak-skuri—due to its prolonged exposure to the dark side energies on the world, the rhak-skuri had mutated, growing much larger and stronger. The three Jedi defended themselves from the creature as it attacked them, and Vestara tried to distract it from Wan and Ben. However, the rhak-skuri still identified her as a Sith, and it preferred to kill Jedi—it knocked off Ben's protective breath mask and prepared to feed on him while he was paralyzed by hallucinations. Vestara decided quickly that she wanted to protect Ben no matter the cost, so she suddenly turned on Wan. The Jedi Knight tried to defend herself, but Vestara sliced through her breath mask. The rhak-skuri immediately began to feed on Wan, and Ben—unaware of Vestara's actions—began to recover from his hallucinations."}, {"tag": "p", "text": "Suddenly, the caves began to collapse, and as Vestara and Ben tried to make their way out, another seism trapped them behind a wall of rocks. Vestara's lightsaber was lost behind the rubble, so using just Ben's blade and the Force, the two began to work away at the obstacle. When they finally broke through, they found Jedi Master Corran Horn waiting for them—he returned Vestara her lightsaber and revealed that a volcano had erupted and that they needed to evacuate the planet immediately. The world had been a trap laid by Abeloth—she and Ship were not there, and although Vestara and the majority of the strike force managed to escape, the Jedi still suffered several losses. Afterward, Vestara reflected on her actions; she knew that she could never tell Ben what she had done, because he would never forgive her for killing Wan. However, she did not regret her decision, and she came to realize that that meant that she could never truly be a Jedi. Vestara then resolved to remain with Ben for as long as she could until they inevitably became enemies and she was forced to kill him."}, {"tag": "h3", "text": "Chaos on Coruscant"}, {"tag": "p", "text": "Despite her conclusion that she would have to leave the Jedi Order, Vestara decided that she would help the Jedi—namely to kill all of the High Lords, whose duty it was to murder her for killing Taalon—before leaving the Order's protection. While the Jedi made their plans to spring their trap on the Sith, who had—as the Jedi had hoped, taken the Jedi's bait on Coruscant and established themselves within the government on that world—Vestara helped the Jedi prepare for the mission. She convinced the Jedi Masters that her presence on the mission would be imperative to its success due to her familiarity with the Lost Tribe, and warned them that the Sith would quickly move on from taking influential Senate positions to finding important stations in other administrations, such as inspecting immigrations. The Jedi, along with Vestara, took the starliner Plain Lady to Coruscant, and disembarked at the Galactic Center Spaceport. Due to Vestara's warning, the Jedi were prepared for the intense Sith scrutiny upon their arrival on Coruscant."}, {"tag": "p", "text": "However, as Vestara and the Skywalkers made their way through the spaceport, Master Ruku Myal, who was acting as a Galactic Alliance Security sergeant, recognized the former Sith apprentice despite her disguise. Luke noticed the recognition that passed between them and distracted Myal by using the Force to disrupt the area's electronic systems and turn out the lights. Myal activated his lightsaber and moved to attack, but nearby Galactic Alliance Security troops assumed he was a Jedi and opened fire. As Myal fought the troops and attempted to attack Luke, Vestara located the Sith Master's shikkar and stabbed him with it. When Luke realized what she had done, he thought that her method of killing was cruel, and wondered whether she could ever truly be a Jedi. Vestara revealed that she was in actuality upset over what she had had to do to her old acquaintance, but that she had done it because it was necessary for the Jedi's mission."}, {"tag": "p", "text": "After they escaped the spaceport, Vestara and Ben—disguised as Falleen and Twi'lek pages, respectively—went to the Senate Building as a part of a timed strike against numerous Sith targets across the planet. They were to distract High Lord Ivaar Workan and give Luke Skywalker and Jedi Knights Seha Dorvald and Doran Sarkin-Tainer time to arrive and attack him. However, Workan's security guard did not want to let them into Workan's office in a timely manner, and Vestara was forced to secretly mouth her identity to him in order to gain entrance. Upon their entry, they were quickly held captive by three of Workan's bodyguards. Vestara and Ben managed to delay Workan in conversation until the three other Jedi blasted into the office; they then used the distraction to get away from their captors. The two made short work of the three Sith guards, while Luke entered into a duel with Workan. Luke was working Workan into a corner in an attempt to capture him instead of kill him, but Vestara did not want to allow that to happen—she thus suggested to the Jedi that Workan was attempting to get near his desk, where he might have a hidden detonator that could kill them all. Luke and Dorvald thus dove away from Workan, while Vestara, Ben, and Tainer opened fire on him with blasters, killing him."}, {"tag": "p", "text": "After the initial strikes killed nearly 1,000 Sith, seventy-five percent of the remaining Sith withdrew into the Jedi Temple, so that the Jedi would have to face them in more open combat. Vestara was chosen to accompany the Jedi on an assault on the Temple—in which she hoped to eliminate the majority of the Circle of Lords, so that afterward she could leave the Jedi and warn the rest of the Sith on Kesh that if they ever came hunting her, she would give Kesh's coordinates to the Jedi. As she arrived on-site to begin the mission, she overheard Luke speaking with Jedi Knight Bazel Warv regarding Amelia Solo's secret identity—she then pieced together what she knew of the Jedi queen vision with Amelia Solo's adoption by the Solos after Tenel Ka Djo's child had reportedly been killed in the Second Galactic Civil War, and concluded that Amelia was in fact the Jedi queen. She decided to keep her realization to herself in case she ever needed to use it as leverage. Vestara then accompanied Ben, Valin Horn, Horn's sister Jysella, and several other Jedi into a mechanical core of the Jedi Temple while space marines assaulted the Temple's entrances from thirty different angles, with the intent of forcing the Sith to the perimeter of the Temple so that the Jedi could sandwich the Tribe's forces. Despite the Jedi's reassurances, however, Vestara did not believe that the Sith had left the core completely undefended. As she and Ben walked across the core to report to Luke, she noticed several Sith lying in wait for an ambush."}, {"tag": "p", "text": "The Sith sprung their trap moments later; they attacked the Jedi from two sides, and Vestara was knocked unconscious during the fighting. Ben attempted to save her, but the Sith took her captive and eventually fell back into hiding. Ben and Solo tried to formulate a plan to rescue Vestara, but the Sith again attacked them, and upon discovering that the computer interface—from which they had planned to override the lockdown on the Temple—had been disabled, the Jedi were forced to continue on their mission without her. Sometime after Vestara returned to consciousness, she found that her comlink, which was equipped with an evacuation guidance beacon, had been taken from her. She quickly stole a comlink from the corpse of a nearby Jedi Knight and escaped while her captors were busy attempting to deal with the Jedi. The Sith set out after Vestara, forcing her to stay on the run in the Temple as she followed the guidance beacon. She killed numerous Sith as they hunted her down and ambushed her, and she realized that they were unwilling to kill her—they wanted her alive. Vestara also discovered signs of Abeloth's presence in the Temple, but a group of Sith commanded by High Lord Sashal ultimately cornered her."}, {"tag": "h3", "text": "Abeloth's end"}, {"tag": "p", "text": "Vestara attempted to convince the Sith that she was still on their side, and that she had been forced to kill Taalon and her father because Abeloth had taken control over them. Eventually, in order to win Sashal's trust, Vestara decided to reveal the name of the Jedi queen—Allana Solo. Sashal then granted Vestara the rank of Sith Saber, handed her a detonator with the pin removed and a five second fuse, and told her to complete her mission. Vestara turned and found that the hatchway through which she had wanted to escape had finally opened, and Allana, Han, and Leia Solo were all outside. She stepped aside from the hatch and tossed the detonator toward the Solos' starship, the Millennium Falcon, guiding it with the Force. It connected, crippling the flight deck, but the Solos survived the skirmish with the Sith. Vestara promptly escaped, although she remained in the company of the Tribe. Soon afterward, Abeloth, who had assumed command of the Sith on Coruscant, brought her aboard the Meditation Sphere Ship. She was surprised to find that Ben was being held captive aboard Ship, and during their ensuing conversation, she tried to convey to the young Jedi that she was not working with the Sith and Abeloth by will, while simultaneously using her words and thoughts—which Ship could read—to trick Abeloth and Ship into believing she was on their side."}, {"tag": "p", "text": "Suddenly, they noticed Abeloth starting to create groundquakes to ravage Coruscant. Vestara helped free Ben from his bindings and tried to warn the Jedi, but Abeloth, now in the form of the Keshiri High Lord Korelei, prevented them from leaving Ship. Abeloth took them with her off of Coruscant in the Meditation Sphere, and tried to convince them to join her in becoming the Ones—immortal and exceptionally powerful Force deities who could destroy and reshape the galaxy as they pleased. She offered Vestara the position of \"Daughter of the Night\"—an irresistable and powerful representation of the dark side. Over the course of their three day journey to Abeloth's planet, she did not provide food or drink for Vestara and Ben. They told her they would rather die than join her, and upon their arrival on Abeloth's world, she took them to the Font of Power, a dark side Force nexus. Vestara was tempted to drink from the Font, but Ben tried to convince her that it would be better to die. Ben revealed that his father was already on his way to find them, but Abeloth suddenly assaulted Vestara, trying to consume her."}, {"tag": "p", "text": "Ben quickly blasted the entity away from Vestara with the Force—however, their proximity to the Font meant that the Force was tainted with the dark side. Vestara believed they would have to use it anyway, and began to wonder whether or not it was the will of the Force for them to drink from the Font, as it might be the only way to destroy Abeloth. The entity then attempted to consume Ben, and Vestara attacked her with Force lightning. With Abeloth temporarily incapacitated, Ben quickly picked up Vestara and carried her away from the Font, refusing to fight so close to the nexus. Vestara shot more lightning at Abeloth while Ben used the Force to hit the back of her head with a fallen pillar, but the entity threw Ben into another pillar, knocking him out. Vestara continued to battle Abeloth inside a sphere of Force lightning energy, holding back the entity with Force lightning. As Ben awoke, Vestara cried out for his help, and he used the Force to take the shikkar from her belt and stab Abeloth in the back with it. Vestara then hit Abeloth with Force lightning, and Ben dragged the entity away from the Font and dropped another pillar on her, killing her. Meanwhile, the entity's other manifestations were simultaneously killed by Luke Skywalker and a Sith stranger in a duel at the Lake of Apparitions beyond shadows, and by Jedi Master Saba Sebatyne with help from Tahiri Veila in the New Jedi Temple."}, {"tag": "h3", "text": "A new beginning"}, {"tag": "p", "text": "Jaina Solo soon landed the infiltrator Rude Awakening with an unconscious and weak Luke Skywalker inside, but she refused to let Vestara inside right away. Vestara realized that Solo was going to tell Ben about her attack on the Solo family and her betrayal of Allana's identity, and that no amount of explanation would get the young Jedi Knight to forgive her. As she waited outside, Ship—who had been freed from Abeloth's will upon the entity's destruction—contacted her. She told the Sphere that she did not think she could go back to her Tribe on Kesh, but the Sphere revealed that he knew of another faction of Sith in the galaxy—one that needed her help and could make use of her knowledge of the Skywalkers. Ship also promoted Vestara to the level of Sith Lady, much to her surprise. When Solo and Ben Skywalker finally emerged to capture her, Vestara blasted Ben with Force lightning, delayed Solo with another blast of lightning, and then leaped up into the cabin of Ship, who had just arrived. Vestara fled in the Meditation Sphere, heartbroken over having to leave Ben, and was told by Ship to feed on her pain."}, {"tag": "p", "text": "After abandoning the Jedi, Vestara assumed a false identity, Savara Raine, and began to work as a mercenary for the highest bidder. In this role, she came into contact with the Columi brothers, Craitheus and Marvid Qreph. She explained her lightsaber as a trophy from her run-ins with Jedi and concealed her Sith heritage. Marvid was particularly drawn to \"Savara\" and enjoyed her company, favoring her over other servants of the Qrephs, such as the Mandalorian warrior, Mirta Gev. The Qrephs hired Vestara for her Force abilities, as they had discovered a monolith, not unlike the Mortis monolith, deep within the Chiloon Rift. The entrance to the monolith, a space–time-warping gate, could only be opened with the Force, and they hired Vestara to open it and test its powers. Alongside one of Gev's Mandalorian warriors, Barduun, Vestara entered the gate and accessed the monolith. While there, Barduun was driven insane, and they only barely escaped. However, the experiment had granted Barduun the powers of the Force. The Qreph brothers were greatly intrigued by this development, hoping to acquire Force powers for themselves, but worried about Barduun's insanity, they prolonged accessing the monolith until they could better understand it."}, {"tag": "p", "text": "To keep prying eyes away from their discovery, the Qrephs began to financially acquire large portions of the Chiloon Rift, using dirty business tactics to drive out rivals. In her role as a Qreph enforcer, Vestara bullied miners out of the nebula, helping the brothers take a controlling interest. The Qrephs eventually came into contact with Lando Calrissian, who owned a refinery on the planet Sarnus within the rift. Using their usual tactics, the Qrephs attempted to acquire Calrissian's holdings but were unsuccessful. Furious, the Qrephs ordered Vestara to eliminate Calrissian and his allies, Han and Leia Organa Solo. To accomplish this, Vestara sabotaged a tractor beam within the system, causing an asteroid to plummet to the surface of Sarnus, destroying Calrissian's factory, killing thousands in the process. However, the Solos and Calrissian escaped death and made their way to the planet Valnoos and the Blue Star casino. Vestara's failure to kill her targets on Sarnus caused the Qrephs to use Mirta Gev and her Mandalorians to capture the group on Valnoos, but the operation resulted in a firefight and the deaths of several Mandalorians. However, with Vestara's help, Gev was able to capture Han Solo and escape Valnoos aboard a Tra'kad starship."}, {"tag": "h3", "text": "Lady Raine"}, {"tag": "p", "text": "With their captive in tow, Vestara returned to the Qrephs' mobile base, the asteroid crusher Ormni. The Qrephs were delighted that Solo had been captured, but their mood soured when Vestara pointed out that a homing beacon had been placed on their ship and that Jedi would be following them to rescue Solo. The Qrephs prepared their Marcadian luxury cruiser, Aurel Moon, to depart for their secret base on the monolith with Solo while Vestara readied the defenses. When Luke Skywalker and Leia Organa Solo showed up in a ScragHull commando boat and attacked the Ormni, Vestara ambushed them with Ship and destroyed their vessel. However, Skywalker and Organa Solo survived the attack and infiltrated the Ormni, defeating the Qreph forces present and finding evidence of where the Qrephs had departed to. Vestara was able to reach the Qreph's base, Base Prime, ahead of the Jedi and warned her employers of the impending Jedi rescue attempt. The Qrephs were greatly distressed by this development, not yet ready to access the monolith, and they did not trust Vestara to help them open the gate. When the Jedi attacked Base Prime, Vestara leveraged her position to take charge of the Qreph forces in defense of the base. However, using YVH-Series battle droids, the Jedi easily penetrated the base's defenses, and Vestara was forced to evacuate the brothers through the base towards their residence."}, {"tag": "p", "text": "However, their retreat was cut off by the leader of the Jedi attack, Ben Skywalker. Skywalker, still bristling from Vestara's betrayal, attempted to take her captive. Vestara was forced to use Craitheus as a shield, causing him to be badly injured, but the group escaped Skywalker and the YVH droids. Marvid was enraged by Vestara's tactics and the near-death of his brother, and he betrayed the Sith Lady. He fired his blaster at her, destroying her right ankle and left knee. Marvid also revealed a clone he had made of Vestara, Savara Two, which had been modified with Columi DNA from his mother, creating a grotesque Columi-Human hybrid. Marvid intended to use Savara Two to open the gate and access the monolith, making him no longer dependent on Vestara's help. Marvid left Vestara to die, but she called out in the Force to Ship, which came to her rescue. Unable to walk out of the base, Vestara convinced Mirta Gev her employers had been lying to her about stopping the nanovirus, a fact that Gev had refused to acknowledge. Convinced by Vestara's arguments, Gev ordered her Mandalorians to abandon Base Prime and then carried Vestara out to Ship. The two women escaped the monolith, evading the Jedi taskforce."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vestara Khai had long, light brown hair, dark brown eyes, and fair-colored skin. She possessed all of the desired physical qualities of a Sith of the Lost Tribe save for a small scar on her lip—in the Tribe's society, wherein beauty was highly regarded, such a deformity was considered a degrading flaw. However, Olaris Rhea told her that she believed the scar was beneficial to her, as it gave her the appearance of a constant smirk. Despite her scar, Vestara was considered to be beautiful by other Humans, including Ben Skywalker."}, {"tag": "p", "text": "Vestara's father taught her to use her emotions as weapons to achieve her goals. She felt great compassion for her uvak, Tikk, although she suppressed her feelings when Rhea prepared to kill the creature, accepting that it was Rhea's decision; the Lady thus allowed Tikk to live. Vestara also cared greatly for her family and understood that her father had married her mother due to love despite her lack of Force-sensitivity; something which Ben suggested was akin to a Jedi's line of thought. During her youth, Vestara became acquainted with the Keshiri Ahri Raas, with whom she frequently trained and developed a close friendship. He came to feel attracted to her, and although she found him very attractive and loved him as a friend, she did not reciprocate his feelings."}, {"tag": "p", "text": "Vestara held a powerful desire to become a Sith Master; it was due to her great ambition that Ship contacted her first upon his arrival on Kesh. The Meditation Sphere also acknowledged her powerful will, although hers was no match for Abeloth's. During her mission to recover Ship, she perceived that Xal was using Raas to spy on her and glean information from her that could prove useful to Xal's coup; she thus accepted that she might have to be the one to kill her friend. She was very upset by the prospect of doing so, but knew that she would if it proved necessary. When Xal and Raas ultimately betrayed her during the skirmish with the Skywalkers, and she was angered at Raas' stupidity. She took out her fury on Xal, killing him; an act which distracted Raas and resulted in his death. Later in the battle, after Rhea was killed by Luke, Vestara recognized that she was completely outmatched and saluted the Jedi before fleeing. Similarly, when the Skywalkers confronted her on Dathomir after Galaan fled without her, she accepted the fact that she had no chance of escaping and surrendered."}, {"tag": "p", "text": "When she was on Dathomir, Vestara recognized the power of the Nightsisters and arranged for them to meet with members of her Tribe so that they could exchange their knowledge of the Force—although in reality she intended for her Tribe to capture the Nightsisters. She showed her cunning in formulating her plans on Dathomir—her time on the run in the rain forest and under the care of the Dathomiri Witches was used simply to give her Tribe time to ready their forces and to keep the Skywalkers from discovering her true actions. As a result, it wasn't until after they captured her that they realized that she hadn't paid for her yacht to be repaired; rather, she had sold it for enough credits to send a hypercomm message to her people. When in the company of the Skywalkers, she managed to keep from revealing any information to them, despite Ben's best attempts to lure her into doing so during their conversations. Still, she frequently flirted with Ben, and they developed an attraction to each other. At the behest of her father, she attempted to use that attraction to acquire information from the Jedi."}, {"tag": "p", "text": "Vestara held great respect for her father, Gavar, but she was upset that he neglected to tell her the Sith's true motives in allying with the Jedi. She also began to see him as irrational when he grew angry at her for assisting Ben in the capture of Stadd on Klatooine. Later, unbeknownst to Vestara, Ben viewed a translation of the conversation that she had held with her father when she had met with him aboard the Jade Shadow. The knowledge that she was planning to betray them led Ben to distance himself from her, something which caused Vestara distress. She held strong hopes of being able to turn Ben to the dark side so that they could be together, and wished that he had been born a Sith. When Vestara developed her plan to use Stadd to locate Abeloth, she decided not to tell the Skywalkers because she feared that they would not trust her. Later, during the battle with Abeloth, Vestara was gravely injured and taken to safety by Ben. He saw that none of her wounds were fatal, but she claimed that the thorns that had stabbed her were poisonous, using his feelings for her to delay his return to the battle just as the Sith executed their betrayal. Nevertheless, Ben still noticed as Gavar moved to attack Luke and he warned his father of the attack in time."}, {"tag": "p", "text": "Despite her determination to turn Ben to the dark side and her numerous attempts to trick and trap the Skywalkers, Vestara was greatly changed by the events during her time traveling with the Jedi. She had already been the first Sith of the Tribe to see Abeloth's true form, and she was repulsed by the entity. When Sarasu Taalon started to turn into the same kind of being as Abeloth, Vestara realized that his transformation could only bring harm to the galaxy and decided that she had no choice but to kill him. As a result, she was forced to aid the Jedi in escaping from the Sith on Pydyr by firing at her own Tribe from inside the Jade Shadow. Although she maintained that she was still a Sith—and secretly sent messages to her Tribe notifying them of the Jedi's and Abeloth's whereabouts on numerous occasions—she also blatantly aided the Skywalkers multiple times against the Sith. Meanwhile, her feelings for Ben grew increasingly strong, as did his own for her. In addition to firing on the Sith on Pydyr, she dueled the Sith alongside the Skywalkers on three separate occasions on Nam Chorios."}, {"tag": "p", "text": "When Vestara killed a tsil to ensure that she and the Skywalkers could escape from the Sith on Nam Chorios, the elder Skywalker tried to reprimand her for murdering the sentient being. She countered that she believed that Luke was their best chance at defeating Abeloth, and she thus could not allow him to die. When the Jedi subsequently began searching ancient Sith worlds for Abeloth and Ship, Vestara grew eager to prove her trustworthiness. She convinced them to take her with them planetside on both Korriban and Dromund Kaas, despite the inherent dark side power on both worlds. On Korriban, she stopped a group of Sith hounds from attacking the Jedi, but unbeknownst to the Jedi, she also ordered the hounds to tell any members of her Tribe that they encountered to hide. In spite of her efforts to win the Jedi's trust, Jaina Solo remained largely suspicious of Vestara, due to the number of times she had proved herself capable of tricking them."}, {"tag": "p", "text": "As she traveled with the Jedi, Vestara tried to make sense of the internal struggles that she was facing in the form of unsent letters to her father which detailed a life that she wished she had lived; and in one she even described herself as the daughter of a Jedi. When confronted by her father in combat on Dromund Kaas, Vestara was horrified to learn that her mother had died and her father had done nothing to stop it. Realizing that Gavar's mind had been twisted by Abeloth, she was forced to kill him. Her grief over his death added to her already conflicting emotions, and she finally found herself wishing that she could put aside all the plotting and mistrust that came with being Sith and become a Jedi. When Ben walked in on her writing one last letter to her imaginary father, he suspected her of betrayal and forced her to let him view the letters. As he read, he immediately realized his mistake however, emotionally distraught by his attack on her, Vestara refused to let him stop until he had finished reading them all. Afterward, as he comforted her, she was thrilled when Ben said that he believed she could become a Jedi and that he would help her in that endeavor. When he kissed the scar on the side of her mouth, she realized that he was telling her that he found all of her beautiful—even what she most disliked about herself—and the two then shared their first kiss."}, {"tag": "p", "text": "However, her feelings for Ben soon got in the way of her desire to become a Jedi. When a mutated rhak-skuri on the planet Upekzar incapacitated Ben and planned to feed on him, Vestara was uncertain that she and Wan would be able defeat it before it killed him. She thus decided to kill Wan so that the rhak-skuri would feed on her instead of Ben. Vestara did not tell Ben of the incident, because she knew that he would not forgive her for her choice. Vestara realized then that she could never become a true Jedi, as she always reverted to the Sith way of doing things; and she accepted that she would one day have to kill Ben, even though it would break her heart. Nevertheless, Vestara decided to remain with the Jedi during their subsequent assault on the Sith Tribe on Coruscant; the High Lords were bound by duty to hunt her down for murdering Taalon, so she wanted to ensure that the High Lords were all killed before she left the Jedi Order's protection. In the early stages of the mission, she was forced to kill Ruku Myal, who had been friendly to her in her childhood. Though she was upset at having to kill him, she defended her actions as necessary to the defeat of the Tribe on Coruscant."}, {"tag": "p", "text": "When tasked with assisting in the assault on Ivaar Workan, she secretly gave up her cover to Workan's guard in order to ensure that she and Ben got entry to his office in the Senate Building. Later, as the Jedi dueled the High Lord, Vestara tricked them into believing that he was trying to kill them with a secret explosive, resulting in the Jedi killing Workan instead of capturing him. During the liberation of Coruscant, she also finally deduced the prophesied Jedi queen's identity as the daughter of Tenel Ka Djo, Allana Solo—who was at the time in hiding as Amelia Solo, Han and Leia Solo's adopted child. She decided to hold on to the information in case she needed to use it to save herself at some point, and such a need arose during the assault on the Jedi Temple. When High Lord Sashal and a group of Sith cornered Vestara, she decided to reveal Allana Solo's identity to them in order to win their trust. She then found herself in a position to assassinate the future Jedi queen, and when Sashal handed her a detonator to kill the child, Vestara threw it away from Allana's position and into the Solos' ship, the Millennium Falcon, nearly killing Han Solo. She then fled the scene while the rest of the Sith battled the Solos."}, {"tag": "p", "text": "When Vestara was finally reunited with Ben aboard Ship, she admitted that she had been forced to attack the Millennium Falcon, but she hid from him that she had revealed Allana Solo's identity. Abeloth offered both Vestara and Ben positions alongside her as members of the Ones; promising them immortality and the chance to spend their lives together. Although tempted by Abeloth's offer, Vestara helped the young Jedi in their final fight against the entity, despite their idealogical differences—Vestara believed that they should use the Font of Power's potency to their advantage, and even considered drinking from it, as she felt it might have been the will of the Force and the only way to defeat Abeloth. After Abeloth's defeat, Jaina Solo arrived and revealed Vestara's betrayal to Ben, and Vestara knew that the Jedi would not forgive her. Ship saved her from her would-be captors and—much to Vestara's surprise—promoted her to the rank of Lady. She was also surprised to hear Ship speak of another faction of Sith in the galaxy. Vestara was heartbroken to leave Ben behind, but Ship felt that the pain she suffered in doing so would make her strong."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Vestara was very strong in the Force and possessed a great ambition to rise through the ranks of the Tribe. Luke Skywalker himself acknowledged her potential, recognizing her exceptionally strong connection to the Force. Ship also recognized her strength and desire to be a Sith Master and approached her before any other Sith on Kesh, offering to help her become more powerful. The Meditation Sphere's move led directly to her apprenticeship to Lady Olaris Rhea and to the creation of a new Sith armada, in which Vestara served. Prior to joining the armada she had never killed anyone, but during the first two years of her travels offworld she became an experienced killer. Vestara also learned how to fly Ship under the Sith Meditation Sphere's own tutelage, and she later flew the SoroSuub yacht She's a Chancer from Sinkhole Station to Dathomir on her own. Vestara possessed some knowledge of the inner workings of vehicles, as well. On Nam Chorios, she and Ben were able to refashion the heavily damaged TIE shuttle Vote Snaplaunce into a makeshift landspeeder."}, {"tag": "p", "text": "The Sith apprentice was skilled with a lightsaber and was completely ambidextrous. As a Tyro, she often sparred with her friend Ahri Raas, frequently besting him in their matches. During the mission to Sinkhole Station, Vestara and Rhea briefly dueled Luke Skywalker, and though Rhea was killed, Vestara survived the conflict. Later, while with the Raining Leaves Clan on Dathomir, Luke Skywalker noted her talent with a lightsaber, comparing it to that of a Jedi Knight. When she and Ben were chasing the psychotic Dyon Stadd on Klatooine, she was able to use her lightsaber to deflect shots fired on them by Klatooinian guards who were also chasing after Stadd, while simultaneously speaking with Luke via comlink, informing him of their situation. Vestara was also versed in the use of parangs, shikkars, and blasters. Despite her skills, she knew when to admit defeat—she fled following Rhea's death at Sinkhole Station, acknowledging that she was no match for the Jedi Grand Master, and later surrendered to the Jedi on Dathomir after Gaalan fled without her, knowing that she had no hope of defeating Stadd and both of the Skywalkers in battle."}, {"tag": "p", "text": "Vestara Khai was proficient with several Force techniques. She displayed strong telekinetic abilities—during the battle with the Skywalkers at Sinkhole Station she Force-pushed the two Jedi into each other, giving herself time to escape; and later, while chasing Stadd on Klatooine, she easily levitated Stadd's speeder over a large distance, much to Ben's surprise. Vestara also made use of Force lightning, utilizing bursts of lightning that ranged from very powerful to so small as to be entirely harmless. When she tried to use the power against Abeloth during their first battle on her world, the dark side entity easily bent the lightning back upon Vestara; however, during her final confrontation with Abeloth—when the entity simultaneously fought the Jedi in two other locations across the galaxy—Vestara was able to use Force lightning and hand-to-hand combat to distract and even harm Abeloth long enough for Ben to kill the entity."}, {"tag": "p", "text": "The Skywalkers noted the Sith apprentice for her cunning and her skills in the art of deception. On Dathomir, Ben attempted multiple times to glean information from her, but she managed to keep the truth hidden from him for some time, avoiding detection of her duplicity while she negotiated a deal with the Nightsisters—who she also planned to betray. Later, on Abeloth's planet, she successfully devised a plan to free Stadd and follow him to Abeloth in order to locate her, deceiving him into believing that she, too, was an ally of Abeloth's. During the battle with Abeloth in the courtyard, Vestara pretended that her injuries were poisoned, drawing Ben's attention away from the battle just as the Sith executed their betrayal of the Jedi, almost leading to Luke's death at the hands of Gavar Khai. She eventually grew tired of trickery, however, and following the deaths of her parents she chose to turn her back on the dark side and join the Jedi. After finally opening her well-concealed presence for examination by Luke Skywalker, the Grand Master agreed to take her as his own apprentice. Nevertheless, she eventually returned to the dark side, and she was able to deduce the identity of the prophesied Jedi queen. Vestara kept that knowledge to herself until she needed to reveal it to the Tribe to keep the Sith from killing her, at which point Sashal bestowed upon her the rank of Sith Saber."}, {"tag": "p", "text": "During her time with the Skywalkers, Vestara's skills improved. On Pydyr, she was able to murder Sith High Lord Taalon—albeit he was distracted. Later, on Nam Chorios, she defeated a Sith Saber in one-on-one combat, and although she and Ben together were barely able to hold their own against the psychotic Jedi Valin Horn, Vestara was able to help the Skywalkers hold off about twenty-five Sith for ten seconds, even while she focused on killing a tsil in order to give them a chance to flee from the Sith. Vestara later went on to duel her own father to the death—a fight which she won—as well as kill the Jedi Knight Natua Wan. In her final duel with Abeloth, Vestara held her own against the entity for a brief time even without Ben's help, and she was ultimately able to hold the entity's attention long enough for him to stab Abeloth with her shikkar. When Ship returned to Vestara after Abeloth's death, the Sphere pronounced her a Sith Lord."}, {"tag": "p", "text": "Vestara was able to speak at least three languages, including Basic, Keshiri, and the ancient Sith language. As was traditional for Sith, she carried a red-bladed lightsaber. Following her first contact with Ship and apprenticeship to Rhea, she was given a new crystal for her blade—one of lignan ore, an ore that was exceptionally potent in the dark side of the Force and thus amplified the power of her blade. Vestara also carried a curved-bladed parang, as well as a glass dagger known as a shikkar. After she used her shikkar to kill Yuvar Xal, her father gave her one from his personal collection that had been crafted by the famous shikkar-maker Tura Sanga."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vestara Khai was first introduced in Christie Golden's 2009 novel Fate of the Jedi: Omen, the second installment in the nine-part Fate of the Jedi series. She went on to appear in each subsequent novel of the series, which was co-authored by Aaron Allston, Golden, and Troy Denning. She also appeared in two short stories written by Golden, \"Imprint\" and \"First Blood,\" the former of which was published in 2009 in the Official Star Wars Fan Club, and the latter of which was published in 2011 in Star Wars Insider 125."}, {"tag": "p", "text": "One image of Vestara, illustrated by Ian Keltie, was used on the front covers of both \"Imprint\" and Omen, and she appeared alongside Ben Skywalker in a different illustration by Keltie on the cover of the eighth Fate of the Jedi novel, Fate of the Jedi: Ascension. Vestara Khai also appeared, sketched by Shea Standefer, in the 2011 Topps Star Wars Galaxy Series 6 trading card set released by Topps in 2011. Brian Rood penciled Vestara for \"First Blood,\" and Drew Baker illustrated her in the 2012 sourcebook, The Essential Guide to Warfare. Vestara has also received multiple mentions in the Blaster department of the Star Wars Insider magazine."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Ben Skywalker"}, {"tag": "p", "text": "Despite her many betrayals, Vestara and Ben were shown on numerous occasions to have romantic feelings for each other. It is unknown if Ben's ended after Vestara's betrayal of the identity of Allana Solo, the daughter of Ben's cousin and the prophesied future Jedi queen. However, it is shown that Vestara did still have feelings for Ben, as she was heartbroken at having to leave him, although Ship advised her to use the pain to make herself stronger. The two of them may have reconciled at some point, because it is known that Ben had at least three descendants in Kol, Cade, and Nat Skywalker, who may also be her descendants."}, {"tag": "h3", "text": "Gavar Khai"}, {"tag": "p", "text": "Vestara idolized her father for a long time, until the Jedi Luke and Ben Skywalker began to turn her to the light side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}