{"url": "Vers%C3%A9", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Galactic Republic individuals", "Category:Humans", "Category:Naboo Royal Handmaidens", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Versé"}, {"tag": "p", "text": "Versé, formerly known as Versaat, was a human female who was the niece of Mariek Panaka, a captain in the Royal Naboo Security Forces and the wife of Captain Quarsh Panaka. Versé was recommended by Panaka to join Senator Padmé Amidala's new cohort of Handmaidens. She was a top-notch slicer and used her talents in Amidala's service in more ways than one. In 22 BBY, Versé was killed when the ship she had traveled to Coruscant on was destroyed by the bounty hunter Zam Wesell in an attempt to kill Amidala and prevent her from voting against the Military Creation Act."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Versé was portrayed by Avril Wynne in the 2002 film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy. As Wynne remained uncredited until 2019 and her face was mostly obscured throughout her sole scene in Attack of the Clones, author E. K. Johnston opted to substitute a new person as inspiration for the character's physical appearance when writing Queen's Shadow. Johnston sought to create a more racially diverse cast in Queen's Shadow than found in the films and based Versé's appearance on a tour guide she had at Rotorua, New Zealand. Johnston envisioned the character as stockier in build than her fellow Naboo Royal Handmaidens and portrayed by an actress of Māori descent, much like Queen Apailana's actress, Keisha Castle-Hughes."}, {"tag": "p", "text": "Johnston also toyed with the possibility of making Versé a transgender woman in Queen's Shadow, but decided against including it openly in the novel because at the time of writing it she did not feel she could do it justice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}