{"url": "Vhonte_Tervho", "categories": ["Category:Legends articles", "Category:Cuy'val Dar", "Category:Females", "Category:Individuals of unidentified species", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Vhonte Tervho"}, {"tag": "p", "text": "Vhonte Tervho was a female Mandalorian soldier, who lived during the Galactic Republic's twilight years. A veteran mercenary and an experienced huntress, Tervho was recruited by Mandalorian leader Jango Fett to serve as a trainer of clone commandos for the Republic's Grand Army during its infancy on Kamino. As a member of the Cuy'val Dar, Tervho took on the role of training sergeant for nearly a decade, training more than a hundred young clones and turning them into commandos. When the Republic's clone army was finally deployed against the droid army of the Confederacy of Independent Systems at the Battle of Geonosis, Tervho departed Kamino for the first time in close to ten years, having earned a wealth of credits for her services. Her contract completed, Tervho returned to the Mandalorians' cultural homeworld of Mandalore, though she would again take up the role of clone trainer later in the war, instructing more than a thousand of the Grand Army's elite clone commanders in weapons training."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vhonte Tervho was a female Mandalorian, who lived during the final decades of the Galactic Republic. Trained in combat by Mandalorian tradition, Tervho became a skilled soldier and huntress. She worked as a mercenary for a time, on at least one occasion working together with a group of other Mandalorian soldiers. Tervho was known to have hunted a large, horned, white-furred creature through nighttime snow."}, {"tag": "p", "text": "After being recruited by the Sith Lord Darth Tyranus to serve as the template for an army of clone soldiers to be born on the planet Kamino, Mand'alor Jango Fett hand-picked a total of one hundred beings from across the galaxy to train the clone commandos that would make up the Grand Army's special forces. Vhonte Tervho was selected by Fett and she accepted his offer, joining the ranks of seventy-five Mandalorians and twenty-five beings of other assorted backgrounds known collectively as the Cuy'val Dar, a term which meant \"Those Who No Longer Exist\" in the Mandalorian language of Mando'a. Like the other members of the Cuy'val Dar, Tervho became a training sergeant, in charge of a total of one hundred and four young clones whom she trained to adulthood and efficiency over the course of close to ten years. She was also among a number of Mandalorian members of the Cuy'val Dar to join Jango Fett in the combat education of his young son, Boba Fett. Due to the top-secret nature of the clone army project, neither Tervho nor any other member of the Cuy'val Dar were allowed to leave Kamino before they were deployed with the rest of the army against the droid forces of the Confederacy of Independent Systems on behalf of the Galactic Republic in the Battle of Geonosis, the first battle of the emerging Clone Wars. At some point in time, Tervho incurred a debt to her Cuy'val Dar colleague and fellow Mandalorian, Kal Skirata."}, {"tag": "p", "text": "With her contract to train the commandos completed after Geonosis, Tervho departed Kamino with a wealth of credits for services rendered, and like many of the Cuy'val Dar's Mandalorian members she traveled back to Mandalore, the Mandalorians cultural homeworld located in the galaxy's Outer Rim. However, Tervho later returned to Kamino to again train clone troops, imparting her skills with dual DC-17 blasters to more than a thousand up and coming clone commanders. Later in the war, during his quest to halt the accelerated aging the Republic's clone troopers had been subjected to by the Kaminoan Clone Masters, Kal Skirata kidnapped Kaminoan Chief Scientist Ko Sai, and considered calling in the favor Tervho owed to him to house Ko Sai on Mandalore, though he instead settled on taking the scientist to his own Mandalore homestead with the aid of their fellow former Cuy'val Dar trainer, Rav Bralor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Humanoid female, Vhonte Tervho served the six tenets of the Resol'nare, living her life as a Mandalorian. She was trained in the use of blasters, capable of wielding two blaster pistols in combat at the same time, and was known for her prowess using twin DC-17 sidearms. Tervho was an efficient hunter, able to bring down large prey on her own. Vhonte Tervho possessed red hair, which she styled into long braids that she allowed to hang free from beneath her helmet. She was also known to make good on favors she owed to her associates, and cared little for fame or celebrity."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vhonte Tervho wore red Mandalorian armor decorated with black-colored trim over a grey flight suit. Her armor's gauntlets featured a number of accessories, among them a retractable vibroblade mounted on the left-hand gauntlet. She wore a brown, multi-pouch utility belt, and a tattered blue cape that wrapped like a scarf around her neck. Tervho possessed a pair of silver-colored blaster pistols which she wore in dual holsters strapped to her thighs, and owned a place to live on the planet Mandalore."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First introduced to Star Wars canon via a pair of nameless pictures of a female Mandalorian in the article The Mandalorians: People and Culture, featured in the eighty-sixth issue of Star Wars Insider magazine. The article's artist, Thomas Hodges, later unofficially identified the pictured character as Vhonte Tervho, pronounced \"Fon'tee Ter'Fo.\" However, her name only truly entered canon when it was later mentioned in the novel Republic Commando: True Colors, the third entry in the Republic Commando series by author Karen Traviss, published October 30, 2007. Tervho was later mentioned in a StarWars.com blog entry by Ed Erdelac entitled \"So Uncivilized: Great Gunslingers in Star Wars,\" which referenced her contributions to the Cuy'val Dar while adding a connection with the character of Boba Fett."}, {"tag": "p", "text": "Tervho's visual appearance from the People and Culture Insider article appears to have served as the visual basis Entertainment Earth's action figure of the separate Mandalorian character, Rav Bralor. No official in-universe connection has been made between the two individuals, though Mandalorians wearing similar armor are not unheard of."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}