{"url": "Vexis", "categories": ["Category:Canon articles", "Category:Creature stubs", "Category:Creatures of Pasaana", "Category:Snakes"], "nodes": [{"tag": "h1", "text": "Vexis"}, {"tag": "p", "text": "The vexis was a serpent native to the desert world Pasaana. The species burrowed under the sand of Pasaana, and oils excreted from its skin hardened the sand it passed through to form an ever-expanding network of tunnels."}, {"tag": "p", "text": "The signet of the Mandalorian House Kast was a coiled vexis."}, {"tag": "p", "text": "At some point, the scavenger Rey learned from a trader on Jakku about the serpent, that dwelled on Pasaana's desert. According to the trader, the vexis was relatively peaceful unless provoked."}, {"tag": "p", "text": "In 35 ABY, after sinking into the underground tunnel system through the Shifting Mires, Rey, now a Jedi Padawan, and her Resistance companions Finn, Poe Dameron, C-3PO and BB-8 encountered a vexis during their search for the Bestoon Legacy. At first fearing there was no way out of the tunnels and that the creature was hostile, Rey realized it was injured and use the Force to calm it and heal its wounds. Once restored to health, the creature slithered away and in the process revealed a previously hidden opening to the surface."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The vexis first appeared in the 2019 Star Wars film Star Wars: Episode IX The Rise of Skywalker. The species was first identified in the reference book Star Wars: The Rise of Skywalker: The Visual Dictionary written by Pablo Hidalgo. The injured vexis in The Rise of Skywalker was performed by a team of puppeteers including Nick Kellington."}, {"tag": "p", "text": "The creature was realized as a puppet to allow for proper interaction of lighting and actor performance, with additional details such as saliva and blinking eyes added by visual effects artists."}, {"tag": "p", "text": "The design of the vexis was based on the extinct creature Dunkleosteus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}