{"url": "Vhiin_Thorla", "categories": ["Category:Legends articles", "Category:The Enclave residents", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Vhiin Thorla"}, {"tag": "p", "text": "Vhiin Thorla was a Twi'lek male who served as a Jedi Master in the decades prior to the Clone Wars. His Twi'lek given name was Vhiin'Thorla. A compassionate and talented Jedi, he served as a general instructor at the Almas Academy and was known to have been quite adept with a lightsaber."}, {"tag": "p", "text": "Approximately a year before the First Battle of Geonosis Vhiin was sent by the Almas Council to investigate a pirate incursion into the Mid Rim. Although successful, the mission saw the unfortunate death of his first Padawan, Kritz Drassarb. Feeling severe grief and guilt over this incident, he went into a self-imposed exile on his homeworld of Ryloth. During his exile Vhiin began experiencing a series of profound Force Visions revolving around the enslavement and exploitation of his fellow Twi'leks. Following these visions, he traveled to the Bright Lands and proceeded to construct The Enclave as a refuge to help former Twi'lek slaves. During his administration of The Enclave, Vhiin decided to take on another Padawan when he discovered Dorv'Tilsta, a Force Sensitive Twi'lek boy."}, {"tag": "p", "text": "During Vhiin's absence, trouble had come to the Almas Academy, and the Council decided to recall him. To accomplish this, they sent the heroes of Cularin to Ryloth, who eventually managed to locate the exiled master. Following the heroes' arrival at The Enclave, a slaver gang attacked in an attempt to capture several former slaves that were \"liberated\" from them. With the help of the Almas Jedi, Vhiin repelled the slavers' attack, which only hardened his resolve in attending to The Enclave."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Almas Academy"}, {"tag": "p", "text": "Little is known about the positions held by Vhiin Thorla during his time at the Almas Academy. What is known is that he was contemporaries with other Almas Masters such as Lanius Qel-Bertuk (Headmaster), Kirlocca (Weaponsmaster), Jurahi (Master of Visions), Ti-Amun Tiro (Master of Philosophy), Devan For'deschel (General Instructor and later Mistress of Lightsabers), and Darrus Jeht (General Instructor). It is was also known that Master Thorla was a celebrated duelist with the lightsaber who could even rival the Wookiee Master Kirlocca in skill. While at the Academy, Thorla began training a Padawan learner."}, {"tag": "p", "text": "Just over a year before the First Battle of Geonosis the Jedi High Council on Coruscant received disturbing reports that there was an increasing amount of pirate activity along the Mid Rim. Consequently, the Mid Rim Senate representatives demanded that Jedi do something to protect the shipping lanes from pirate attacks. The Jedi High Council met and deliberated on who to send to deal with the threat. During the deliberations, several Council members noted the proximity of the Almas Academy to the Mid Rim. With this in mind, the Jedi High Council requested that the Academy dispatch a team to investigate the claims."}, {"tag": "p", "text": "The Almas Council decided that Master Thorla would be sent, along with his Padawan, to look into the pirate allegations. Master Thorla accepted the assignment with quiet resolve and began to make preparations for himself and his Padawan to depart for the Mid Rim."}, {"tag": "h3", "text": "Tragedy in the Mid Rim"}, {"tag": "p", "text": "Master Thorla and his Padawan quickly arrived in the Mid Rim and established a base of operations from which to work from. With the help of locals who were sympathetic to the Jedi Order, Thorla was able to build a network of contacts and resources to help with the investigation. When it was determined that there was indeed a severe pirate incursion underway that was preying on the Mid Rim shipping lanes, Thorla used his contact network to ascertain the whereabouts of the hidden pirate base. Upon discovery of the secret installation, Thorla devised a clandestine plan to infiltrate the pirate base and destroy it from the top down. After careful planning, Thorla and his Padawan managed to infiltrate the pirate base and set their plan into action."}, {"tag": "p", "text": "Even though the plan succeeded in toppling the pirate leaders, tragedy struck during their withdrawal when Thorla's Padawan was killed. A dying pirate caused an explosion that took his life. In only a relatively short manner of time, Master Thorla was able to do the Councils bidding by defeating the pirate incursion and erasing their threat from the Mid Rim."}, {"tag": "p", "text": "This victory, however, came with a cost that was too much for Thorla to accept. Declining the offers of others to recover the body, Master Thorla took it upon his grief-ridden shoulders and went back to the destroyed pirate base to recover his Padawan's lifeless body. With the body wrapped and gently laid in his ship, Thorla began the long journey back to Almas."}, {"tag": "h3", "text": "Return to the Almas Academy"}, {"tag": "p", "text": "Upon his return to the Almas Academy, Headmaster Lanius Qel-Bertuk requested a private meeting with Master Thorla. Thorla asked Master Qel-Bertuk if he would meditate with him on what had transgressed, and after a time, Qel-Bertuk left to gather the Almas Council. Master Thorla was called before the Council of Almas to give an account of his mission and he steadfastly recounted every detail, from their arrival in the Mid Rim, to their collection of information, and to the events that culminated in the death of Thorla's Padawan."}, {"tag": "p", "text": "Upon completion of the retelling of events, Thorla quietly waited for the other Masters to speak. After several anxious seconds, Master Qel-Bertuk leaned forward in his chair and communicated in a wise voice that the death of the Padawan was not Thorla's fault. Thorla continued as if he had not heard the headmaster. Thorla advised the Council that he believed the only reason his Padawan was dead was that he neglected to pay attention to the Unifying Force, and if he had, then he would have anticipated the pirates intent to cause the explosion. Thorla expressed to the Council that he would accept the punishment they gave him for the negligent death of his Padawan. It was at this time that Thorla felt the compassion, but also the confusion, that radiated from the other Masters. Master Qel-Bertuk repeated to Thorla, in a quiet but stern voice, that the death of his Padawan was not his fault and that he should remember to not feel sadness for his fallen Padawan but instead he should feel a sense of joy for his Padawan who was now one with the Force."}, {"tag": "p", "text": "Thorla, however, could not stop from feeling grief over what he insisted was his mistake, and he announced to those gathered his plans to go into exile on his homeworld of Ryloth. His intent was that he believed he could commune with the Force and perhaps find his way again. The Council was quiet as Master Thorla left the Council's chambers. Later that same day, under the star-filled night sky of Almas, the Padawans, Jedi Knights, and Jedi Masters of the Almas Academy gathered around the somber funeral pyre of Thorla's fallen Padawan. Amidst this background Jedi Master Vhiin Thorla silently gathered his few belongings, and, with a heavy heart, departed the Academy for his self-imposed exile on Ryloth."}, {"tag": "h3", "text": "Exile on Ryloth"}, {"tag": "p", "text": "Vhiin Thorla arrived on Ryloth and made his way to the Bright Lands, where he became a traveling wanderer living off the land. It was during this time that he began to have Force Visions that were becoming increasingly intense. In these visions he witnessed the enslavement and murder of his fellow Twi'leks by slavers. It was not until these visions became too intense to bear that Thorla realized the Force was showing him why he had been led to Ryloth: to establish a settlement to help protect the freedom of other Twi'leks. Feeling the beginnings of something special, Thorla set out to fulfill his vision."}, {"tag": "h3", "text": "The Enclave"}, {"tag": "p", "text": "Vhiin Thorla traveled back to the Bright Lands to a series of natural caves that he had previously discovered. This location was roughly a two-day walk into the Bright Lands from the town of Bashka, and it was here that Thorla determined to establish The Enclave. To protect the entrance of The Enclave from outsiders Thorla built a solid stone wall around it. During his building of The Enclave, Thorla began spreading the word that there would soon be a secure refuge for any slave who managed to escape or free themselves. The Enclave, Thorla promised, would provide refugees with all the basic necessities as well as the necessary security required for protection from slavers. By the time of its completion, several adult Twi'leks and a number of Twi'lek children had already come to refer to it as home."}, {"tag": "p", "text": "At the height of The Enclave's existence, the population had reached three dozen individuals. An unexpected addition to The Enclave was Vhiin Thorla's own sister, Jacynith, who worked in Bashka at the local cantina. The Enclave was progressing rapidly through Vhiin Thorla's leadership and it was during this time that he discovered the Force Sensitive adolescent Dorv'Tilsta, called Dorv for short. Master Thorla felt that the Force had led him to find Dorv and therefore decided that he would take him on as his Padawan learner. Dorv took Master Thorla's decision to take him on very seriously and looked forward to the day when he would make his Master proud by being knighted into the Jedi Order."}, {"tag": "h3", "text": "Trouble on Almas"}, {"tag": "p", "text": "It appeared that things were falling into place for Vhiin Thorla regarding The Enclave and his new Padawan, and for the first time since the tragedy in the Mid Rim, Thorla felt like he was at peace with the Force. Nevertheless, Master Thorla's contemporaries back on the Almas Council had a different plan for Thorla. Around this time the Academy's Weaponsmaster, Master Kirlocca, was killed, and the Almas Council suddenly found themselves lacking a key senior council position. At a closed session meeting of the Council, Master For'deschel reminded the Council of Master Vhiin Thorla and his unquestionable ability with a lightsaber. She also reminded the council that, disregarding his self-imposed exile, Master Thorla was still a part of the Almas Academy and therefore should be recalled as the Academy's new Weaponsmaster. The other Masters concurred, and at the request of Master For'deschel, the heroes of Cularin, a group of freelance agents, were dispatched from the Almas Academy to locate Master Vhiin Thorla."}, {"tag": "h3", "text": "Attack on The Enclave"}, {"tag": "p", "text": "Upon arriving on Ryloth the agents from Almas could feel Master Thorla through the Force. However, his Force presence was too weak, and they initially had some trouble locating The Enclave. It was not until they began following reports of a wandering Twi'lek that they ended up at Bashka, where it was said the wanderer could occasionally be seen at the local cantina, the Fungus Pit. Then again, heroes were told, that wanderer had not been seen in town for more than a few months. The agents quickly found the Fungus Pit and made contact with the cantina owner who, after much deliberation, refused to help them."}, {"tag": "p", "text": "Jacynith, however, overheard the conversation and approached the heroes. She advised them that she was a very close companion of Master Vhiin Thorla and if what they were saying about the Almas Academy was true, then she would agree to take them to Master Thorla. The agents assured her that they were indeed sent from the Almas Academy to make contact with Master Thorla and would greatly appreciate any help she could provide. Jacynith could sense the truth in what the agents were saying and agreed to meet with them later that day."}, {"tag": "p", "text": "Unbeknownst to Jacynith and the agents, someone else was also listening to their entire exchange. Slavers had come to the Fungus Pit hoping to catch the trail of some slaves who had been liberated from their services. The slavers managed to place a tracking device on the cloak of Jacynith, and when she rendezvoused with the agents, the slavers were not far behind. Jacynith led the agents to The Enclave and proceeded to introduce them to Master Thorla. Thorla let it be known that he was very displeased with his sister for bringing outsiders to The Enclave."}, {"tag": "p", "text": "Even so, Thorla greeted the heroes and agreed to hear their message from the Almas Council. During their conversation, however, the slavers that had tracked Jacynith launched an attack on The Enclave. Outraged that The Enclave's secret location had been compromised, Master Thorla enlisted the help of the agents to stop the slavers. Thorla and the agents joined The Enclave's small militia in the defense of their home, and managed to completely repel the slavers' attack. When the Duros Slavelord in charge saw his attack utterly fail, he tried to escape. Master Thorla, however, had a different plan, and he stopped the Slavelord just outside the hidden entrance. Thorla engaged the Slavelord in combat and slew the Duros to ensure the promise of security that he had made to each resident of The Enclave."}, {"tag": "p", "text": "The slaver attack hardened Master Thorla's resolve, and strengthened his conviction that the Force had brought him to Ryloth for a reason. Thorla told the agents that he would not be returning to the Academy with them; instead, he would stay on Ryloth to watch over The Enclave residents who needed him far more than Almas Council did."}, {"tag": "p", "text": "During the Great Jedi Purge, Thorla was tracked down by the Inquisitor Valin Draco. The Inquisitor was able to turn his apprentice, Dorv, against him, forcing Thorla to strike down the younger Twi'lek. Devastated by the loss, Thorla was submitted to torture by Draco, to reveal what he knew about other Jedi who had escaped the purge. He was eventually freed by a group who had been pursuing Draco."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Lightsaber Combat"}, {"tag": "p", "text": "Master Thorla was one of the most skilled duelists of the Almas Academy, a status that eventually earned him invitation to be the new Master of Lightsabers at the academy. Versed in all seven Forms, Master Thorla was a known master of both Juyo and Soresu."}, {"tag": "h3", "text": "Force Powers"}, {"tag": "p", "text": "Although his forte was dueling, Master Thorla also had the rare ability to sever a being from the Force with a wall of light-side energy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}