{"url": "Vevec", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Vevec"}, {"tag": "p", "text": "Vevec was a male Mandalorian soldier, and father of Tes Vevec. An experienced fighter, Vevec was a loyal supporter of Mand'alor Chernan Ordo, and followed him to the planet Botajef in 127 ABY to engage the Imperial army of Roan Fel's Galactic Empire. During the battle, Ordo was slain and the traitorous soldier Yaga Auchs took his place; Auchs issued a retreat, and pulled the Mandalorian supercommandos off world, abandoning Vevec and his former son-in-law, Hondo Karr. When Karr revealed Auchs' betrayal to Vevec and his plan to escape death at the hands of the overwhelming Imperial forces by donning the armor of fallen stormtroopers, Vevec understood the importance of exposing Auchs but refused to discard his Mandalorian armor to avoid death. Instead, realizing the likelihood that the troopers would not believe they were Imperial, Vevec chose to aid Karr in establishing his new identity by pretending to attack him in his acquired trooper armor within view of the approaching Imperials. Vevec was subsequently shot by a nearby stormtrooper who saw only a Mandalorian attacking a downed ally, and because of Vevec's actions, Karr was welcomed into the Imperial unit, Joker Squad."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Humanoid, Vevec was a Mandalorian who lived during the waning years of the Galactic Alliance's political dominance in the galaxy. At the age of thirteen, Vevec completed the verd'goten, the traditional rite of passage among Mandalorians that marked him as an adult in their culture. As an adult, Vevec was a trained soldier, and was the father of at least one child, a daughter by the name of Tes Vevec."}, {"tag": "p", "text": "In the year 127 ABY, the first year of the war between the Fel Empire and the Galactic Alliance, Vevec joined with several other Mandalorian supercommandos to follow the current Mand'alor, Chernan Ordo, on a job they had been hired for by the Galactic Alliance. Tasked with defending the planet Botajef from the attacking Imperials until the Galactic Alliance fleet arrived, Vevec and his Mandalorian comrades attempted to hold the line against overwhelming numbers of Imperial stormtroopers and walkers. The already difficult battle took a turn for the worst when Mand'alor Ordo was killed, and with the Imperials overrunning the Mandalorian position, the soldier Yaga Auchs ordered a retreat, pulling the Mandalorian forces off of Botajef. Vevec was left behind in the chaos, though he came upon the unconscious Hondo Karr, Vevec's former son-in-law who had been previously married to Vevec's daughter, Tes. Once Karr had been roused and informed of their dire situation, Karr revealed that Yaga Auchs was a traitor, responsible for the Mandalorians' earlier loss of communications. He then suggested donning the armor of fallen stormtroopers in place of their Mandalorian armor in order to avoid being killed and allow them to escape. Vevec refused, and while Karr was busy putting on trooper armor, he realized that the Imperials would be too suspicious to believe that they were loyal stormtroopers. Vevec instead chose to sacrifice himself in order to establish faith in Karr's cover, pretending to attack his ally in front of the approaching enemy soldiers. A nearby trooper saw the scene and believed the ruse to be genuine, opening fire on Vevec. Stuck by a blaster bolt in the throat, Vevec was killed, his final act ensuring that Karr was accepted as a soldier of the Empire, taken into the Imperial unit, Joker Squad."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vevec was a courageous soldier, choosing to carry on firing at the overwhelming Imperial forces on Botajef after the remainder of the Mandalorian troops had retreated off world. He was also a proud man, who disliked the idea of shedding his Mandalorian armor and masquerading as the enemy in order to avoid a fight. Like most Mandalorians, Vevec held a strong distaste for corpse-robbers, and was willing to risk his life in order to protect and help those he cared for."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vevec wore Mandalorian armor that was primarily green, the traditional Mandalorian color associated with a sense of duty, and a popular color choice among Mandalorians for their armor. Several plates, including those on Vevec's shoulders and his gauntlets were decorated in purple, and purple accents adorned his helmet around it's T-shaped visor. During the battle on Botajef, Vevec wielded a long-barreled blaster rifle with attached optics."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Vevec first appeared in the forty-first issue of the Star Wars: Legacy comic book series, titled Rogue's End. Appearing in a flashback explaining Hondo Karr's departure from the Mandalorians, during which he was drawn by Kajo Baldisimo, Vevec's death is the catalyst responsible for the issue's second storyline featuring his daughter's mistaken attempt at revenge on Karr. Referred to only as \"Vevec\" throughout the issue, the layout of his daughter's name as Tes Vevec reveals that this is his clan name, rather than his given name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}