{"url": "Vesuvague_tree", "categories": ["Category:Legends articles", "Category:Botanical sentient species", "Category:Carnivorous plants", "Category:Plants of Ithor", "Category:Semi-sentient species", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Vesuvague tree"}, {"tag": "p", "text": "The Vesuvague tree, also known as the Vesuvague Hanging Tree, was a carnivorous, semi-sentient, red-barked tree from the planet of Ithor. It was one of a number of intelligent plants from the world, a category of which included the Bafforr tree."}, {"tag": "p", "text": "The vesuvague tree, though rooted in the earth, was able to detect and move itself towards motion by sensing air vibrations in its leaves and ground vibrations in its roots. In order to catch its prey, it used its quickly growing vines and roots, capable of extending multiple meters in mere seconds, to seize, strangle, and crush its food. Once a creature was dead, the tree would bury its vines and roots inside of its prey, and slowly feed off of its bodily fluids."}, {"tag": "p", "text": "The tree could be trained to respond to simple commands, much like a pet, and could understand words by using its leaves to sense the vibrations and patterns of spoken languages."}, {"tag": "p", "text": "Predatory vesuvague trees were kept at the south end of Gardulla the Hutt's pleasure garden within her Tatooine palace, located near the Dune Sea. The garden's many denizens and forced tourists would observe, not without horror, how the tree's limbs would suddenly drop and attempt to strangle, more often successfully than not, unwary passersby—captive beings that Gardulla constrained to enter the garden for her own and others' perverse entertainment."}, {"tag": "p", "text": "Momaw Nadon planted a vesuvague tree in his secret garden in the mountains south of Mos Eisley on Tatooine. It acted as a watchdog for the site, and its reputation warded off stormtroopers and local police. The grove also concealed a secret chamber for hiding local Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}