{"url": "Vexx%27s_Crew", "categories": ["Category:Legends articles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Vexx's Crew"}, {"tag": "p", "text": "Vexx's Crew was a crew of Humans that worked for the Corellian smuggler and gunslinger Vexx during the Cold War between the Galactic Republic and Sith Empire. In 3643 BBY, a number of them accompanied Vexx to the spaceport in the town of Jiguuna on the planet Nal Hutta. As Vexx prepared to board a shuttle in one of the spaceport's hangars, a bounty hunter seeking to claim a bounty on Vexx's head attacked the members of the crew guarding Vexx, defeating many of them and successfully killing the smuggler."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vexx's Crew was a criminal group that worked for Vexx, a Corellian smuggler and champion gunslinger, for whom a steady supply of henchmen and thugs was always avaliable. The group included a variety of Human members, including twelve mercenaries, six thugs, three hired guns, and Vexx's bodyguard. The bodyguard used a vibrosword in combat while the thugs, mercenaries, and hired guns all used blaster pistols."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Vexx and his crew were active during the Cold War between the Galactic Republic and Sith Empire. In 3643 BBY, Vexx spent time in the town of Jiguuna on the planet Nal Hutta after robbing fifteen Imperial pay stations, which resulted in a bounty being placed upon his head. While in Jiguuna the smuggler stayed in a safehouse, where he used a datapad to book tickets on a shuttle leaving from Jiguuna Spaceport the next day. The following day he left the safehouse with three hired guns inside acting as guards, but while he was out a bounty hunter seeking information on Vexx entered the structure and killed the three men inside in order to make sure they did not escape and report back to Vexx. The hunter then discovered the datapad and learned of Vexx's shuttle booking."}, {"tag": "p", "text": "Prior to his shuttle taking off, Vexx spent time working on the vehicle in one of the hangars at the spaceport while guarded by twelve mercenaries, six thugs, and his bodyguard. The bounty hunter then entered the hangar and attacked the crew, killing at least fifteen of them in order to send a message that signing on with outlaws like Vexx was a death sentence as long as the hunter was around. The bounty hunter then confronted Vexx himself and killing the smuggler."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vexx's Crew first appeared in the 2011 massively-multiplayer roleplaying game Star Wars: The Old Republic. Members of the crew must be killed by the player in the bounty hunter class bonus missions \"Sending a Message\" and \"Clear out Vexx's Safehouse\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}