{"url": "Vibroweapon", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Vibroweaponry"], "nodes": [{"tag": "h1", "text": "Vibroweapon"}, {"tag": "p", "text": "Vibroweapons were a family of weapons that utilized high-speed sonic vibrations to make the weapons more deadly; most commonly found on swords. Though this was the case, almost anything with a blade actually had the potential to be turned into a vibroweapon with the use of cortosis and a vibro-generator."}, {"tag": "h2", "text": "Method of operation"}, {"tag": "p", "text": "Vibro-generators, most often found in the hilt or handle of the weapon, sent out high-frequency sonic pulses that could cause anything attached to the generator to be sent into an extremely quick vibration. When the vibroblade contacted something, notably organic tissue, the vibrations rippled across the material, destroying a giant portion of the victim's body and damaging the target more devastatingly than a blade without a generator. This caused even the slightest glancing blow to potentially become a gaping wound. When put up against heavier armor types, a vibroweapon could be upgraded with a focused vibrator cell in order to focus the stabbing point of the weapon and penetrate even through the strongest armors."}, {"tag": "h2", "text": "Contraband status"}, {"tag": "p", "text": "As per the vibroweapon's devastating efficiency in crime and murder, it has a subsequent usage by many criminals. Due to this problem, vibroweapons were outlawed in almost all of the civilized systems, but they retained their presence in crime through the lesser-governed worlds. Some vibroweapons had a cortosis-weave, therefore weakening its overall strength as an alloy, but giving it the capability to block lightsaber blows."}, {"tag": "h2", "text": "Types of vibroweapons"}, {"tag": "h3", "text": "Vibroblade"}, {"tag": "p", "text": "Vibroblades were usually ordinary blades or similar weapons that were fitted with a vibro-generator. They tended to be a smaller and lighter alternative to the larger, more powerful vibroswords and were at least 30 centimeters in length. Despite the clear disadvantage, some individuals preferred to use a vibroblade rather than a vibrosword because it allowed for more agility and cleaner strikes due to its slim form. Vibroblades are single bladed, and can therefore be dual-wielded."}, {"tag": "h3", "text": "Vibrocutter"}, {"tag": "p", "text": "A vibrocutter was a type of spear that was normally used for carving asteroid rock, such as could be found at the Peragus Mining Facility. If needed, the vibrocutter was capable of doubling as a melee weapon. It was believed that Meetra Surik used this type of weapon at the Skirmish at Peragus II."}, {"tag": "h3", "text": "Vibro double-blade"}, {"tag": "p", "text": "The Vibro double-blade was a variation of the common vibroblade. This twin blade variation often used Echani cortosis-weave technology, and it was heavier, less precise, yet more powerful than its single-bladed cousin. Again, they were not as long as the sword version (vibro double-swords), but were very effective in combat with the right training."}, {"tag": "h3", "text": "Vibrosword"}, {"tag": "p", "text": "Vibroswords were larger and heavier versions of vibroblades which therefore allowed more powerful strikes at the cost of often requiring two hands to wield. Those who look to brute force instead of elegance tended to favor the vibroswords, and although they could be wielded in dual forms, it was very difficult to balance them out and make attacks effective due to their size and weight. Many people using vibroswords in the dual form used a vibroblade in the off-hand. This allowed them to make quick counterattacks, parries, or glance blows before coming in for the kill/disabling maneuver with the heavier vibrosword. It could cut someone in half with ease."}, {"tag": "h3", "text": "Vibrorapier"}, {"tag": "p", "text": "A vibrorapier was a type of melee weapon, similar in principle to a vibroblade, but with a longer and thinner blade. It was well-balanced and completely silent due to a special design that diminished the ultrasonic pitch the other vibroweapons had. Many professional fighters considered it an excellent weapon and preferred it over standard vibroblade or blaster for its stealth.\nReddjak was known to have wielded one such weapon. A notable model was the LaserHone Duelist vibrorapier."}, {"tag": "h3", "text": "Vibro double-sword"}, {"tag": "p", "text": "Like the Vibro double-blade was a variation on the more common Vibroblade, the vibro double-sword was a variation on its more common cousin, the vibrosword. They were difficult weapons to wield due to their sheer bulk, but with the right training one could overcome the obstacles it presents and make it a truly deadly weapon. They were more heavy duty weapons than the vibro double-blades, required greater strength, but delivered more powerful strikes. On the other hand, they greatly reduce agility, forcing the wielder to focus almost entirely on the movement of their blade for defense; as opposed to dodging strikes."}, {"tag": "h3", "text": "Jagged vibroblade"}, {"tag": "p", "text": "The Jagged vibroblade was a variation on the standard vibroblade, but it worked on the same principles. The only difference was that it had a jagged/serrated edge to it, therefore resulting in a less clean cut. The jagged lines may also be found on the flat side of the blade; again, to cause more damage when it rips through flesh. Jan Dodonna once handed one of these weapons to a new Rebel Alliance recruit."}, {"tag": "h3", "text": "Vibrodagger"}, {"tag": "p", "text": "Vibrodaggers were blades equipped with focused vibro cells used by Phase I dark troopers of the Galactic Empire. They paralyzed and eventually killed the victims of the dark trooper."}, {"tag": "h3", "text": "Vibro-shiv"}, {"tag": "p", "text": "vibroshiv is a small family of knives approximately 5 centimeters long that is similar to a switchblade, but with a mounted vibrogenerator in the hilt allowing it to vibrate at a tremendous rate, while an enhanced focused vibro cell gave the weapon's tip cutting power on par with a lightsaber. Kiro Celsius was known to employ a switchblade version of this weapon."}, {"tag": "p", "text": "The vibration of such weapons was so fast that even a slight touch could produce a large gash, while a slash could sever a limb. A non-vibration blade of comparable size was nowhere near as deadly. Vibroshivs were commonly used in a Jar'Kai stance as an offhand weapon."}, {"tag": "p", "text": "Typical vibro-shiv weapons included knives and daggers, the most common; vibroknucklers, which were basically like knuckledusters except with a blade; and vibro-scalpels and -lancets, which were more commonly used on operating tables."}, {"tag": "h3", "text": "Vibroknife"}, {"tag": "p", "text": "A vibroknife, or vibro-knife, was a blade that used an internal generator to make the blade vibrate. These vibrations could make even a glancing blow, into a huge gruesome slash, thus making it a far more effective weapon in close combat, or as a tool. These small weapons were openly used by all denizens of the Galactic Republic, from clone commandos to regular citizens."}, {"tag": "h3", "text": "Vibroknuckler"}, {"tag": "p", "text": "A vibroknuckler was a weapon that a person would wear on their fists, giving extra power to the wielder's punches. The weapon had four mini vibro-blades on the front, which gave it extra piercing and slashing power. The wielder could activate the weapon with the squeeze of a fist, for easy concealment. Many mercenaries and pirates used this weapon as a last resort in a hard battle."}, {"tag": "p", "text": "They presumably were similar to buzz-knucks."}, {"tag": "h3", "text": "Knuckle plate vibro blade"}, {"tag": "p", "text": "The knuckle plate vibro blade or vibroknuckler was a retractable weapon that was inside a clone commando's armor glove that could be ejected from the gauntlet to be used in melee combat. The weapon was extremely lethal at close range. They were also used by mercenaries and smugglers as a minor defense against police or other enemies. An example of a set of users would be Jabba the Hutt's guards, and skiff drivers, because they can't afford any other type of weaponry. It was often used against B-1 battle droids, Geonosians and Trandoshan slavers. This weapon was a Clone Commandos only form of melee defense and was not large enough to be used against a lightsaber or a full sized vibrosword."}, {"tag": "h3", "text": "Vibrostaff"}, {"tag": "p", "text": "Vibrostaves were one of the deadliest types of vibroweapon; this melee weapon featured a long staff, with a rounded hilt roughly three feet long that contained a vibrogenerator. The hilt also"}, {"tag": "p", "text": "contained one 2.5 foot long blade, sharpened to a razor's edge, that could be activated instantly. The blades' cortosis weaves allowed it to parry the blows of lightsabers, energy swords, or blaster bolts."}, {"tag": "p", "text": "The efficiency and combat-effectiveness of vibrostaves came from their double-bladed approach; with skill, the wielder could create a whirlwind of motion where he utilized the spinning stave to seriously injure and eviscerate opponents. Also, with great skill, two vibrostaves could be wielded, one in each hand; this effectively gave four blades to attack with, but left him more open to attack.[source?]"}, {"tag": "p", "text": "Double-bladed vibrostaves were the predominant weapon of choice for Royal Guard trainees. Taking an idea from his deceased apprentice, Darth Maul, the Emperor had double-bladed vibrostaves crafted to equip his newly formed corps of Imperial Guards. Palpatine employed one of the greatest melee weapons designers in the galaxy, Kolvo Weapons Manufacturing, to produce a limited number of these weapons. Once the order was completed, the manufacturing facilities were the subject of an assault by TIE/sa bombers, effectively destroying all blueprints and machinery capable of producing these unique weapons. A Royal Guardsman trained in the martial art of the Echani could wield these durable, lightweight weapons almost like a third limb in combat (an excellent example being Kir Kanos); although when they were officially guarding something, they used their usual Force pike."}, {"tag": "h3", "text": "Vibrowhip"}, {"tag": "p", "text": "Vibrowhips were whips, as the name suggested, powered by a vibro generator motor. The Black Sun Vigo Lord Xist was the only known master of the vibrowhip fighting method, although there is some debate as to whether or not it was actually a lightwhip, due to its resistance to a lightsaber blade and its blue glow. If it was a lightwhip then it would come under another category, even if it used vibro technology at all."}, {"tag": "h3", "text": "Vibro-ax"}, {"tag": "p", "text": "Vibro-axes were vibroweapons common in the underworld of the galaxy, and especially among Gamorrean warriors and guards, and Togorian pirates. There were many different types of vibro-ax ranging from smaller ones to larger ones. Some were extremely bulky weapons, but effective even if difficult to wield because they inspired fear in their opponents. Also, because of the weight behind them, it was easier to cut through chunkier objects with a vibro-ax than another vibroweapon."}, {"tag": "p", "text": "A vibro-ax was simply a standard ax, but handle-fitted with a vibration generator that, when fed by a power cell, caused the ax head to vibrate rapidly, thus causing more damage to a target. Some handles were designed to dampen the vibration effect for the user, though cruder versions, such as those wielded by the Gamorreans, used wooden handles. These weapons were often left deactivated, simply to allow the user to show off their physical strength- therefore defeating the whole point of the vibration cell."}, {"tag": "h3", "text": "Vibro-lance"}, {"tag": "p", "text": "The Vibro-lance was used by Gamorrean guard Thok in Jabba the Hutt's palace on Tatooine. It was a weapon that Gamorrean guards used in addition to the more common Vibro-ax."}, {"tag": "h3", "text": "Vibro mace"}, {"tag": "p", "text": "Vibro maces were large, heavy maces incorporating vibro-ax technology. They were often used by large Neimoidian brutes, and were the most heavy duty weapons in the vibro family. It required great strength to wield one of these weapons, but when used correctly with the right training they are extremely deadly. To those untrained in their use, they are almost useless. Anakin Skywalker had to battle his way past many Neimoidian Brutes brandishing these fearsome weapons on his way to murder the Separatist High Council and end the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}