{"url": "Vibroblade/Legends", "categories": ["Category:Legends articles", "Category:Vibroblades"], "nodes": [{"tag": "h1", "text": "Vibroblade"}, {"tag": "p", "text": "Vibroblades were a type of bladed melee vibroweapon that used ultrasonic vibrations to increase cutting effectiveness."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A vibroblade resembled a short sword with a high-tech look and feel and consisted of the same basic design as other vibroweapons: the weapon's hilt or handle usually contained a compact ultrasonic vibration generator, causing the blade to vibrate at an incredible speed, making even the slightest glancing blow become a gaping wound. Vibroblades were dangerous to use against electrical weapons, as they conducted electricity. Electrocution, however, would be the wielder's last concern. Traveling up the length of the blade, the electricity would connect with a vibroblade's energy cell and ultrasonic vibration generator. The result would be a miniature explosion with enough force to take off a hand."}, {"tag": "p", "text": "A vibroblade could be fitted with cortosis-weave, allowing it to parry the blows of lightsabers and energy swords. The cortosis-weave became less common when the probability of fighting a lightsaber-wielding opponent decreased. By the time of the Galactic Civil War, knowledge of the cortosis-weave had faded, and the cortosis mineral itself had become exceedingly rare. A highly adaptable variant of the vibroblade, the prototype vibroblade, could be fitted with a number of weapon enhancements."}, {"tag": "p", "text": "Larger variants of the vibroblade included the dire vibroblade, vibrosword, Sith Tremor Sword, and vibro double-blade, while smaller variants included the vibrorapier, vibrodagger, vibroknife, vibro-shiv, and hand-sized vibroknuckler and knuckle plate vibro blade. Variant vibroblades created and used by other cultures included the Zabrak vibroblade used by the Zabrak and the Echani vibroblade used by the Echani."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Vibroblades were favored by soldiers, mercenaries, assassins, and pirates throughout the galaxy. They were also used as backup melee weapons by bounty hunters, crime lords, and privateers. Since they were popular among criminals, vibroblades were banned on many worlds, especially in urban areas."}, {"tag": "p", "text": "Vibroweapons were common prior to, after, and during the Jedi Civil War, because as personal energy shields became more common, blasters, of course, became less viable as a sound weapon. Vibroweapons on the other hand could cut through energy shields (and their users) with ease. Vibroblades were carried as melee weapons by Mandalorian Neo-Crusader Shock Troopers as well as officers of the Republic Military. The Twi'lek computer slicer Mission Vao crafted her own custom-made vibroblade which she used to defend herself in the rough Undercity of Taris around the time she met Revan."}, {"tag": "p", "text": "During the Clone Wars, the bounty hunter Sugi carried this weapon. Clone assassins used vibroblades as their primary weapon. Vibroblades were also used as backup weapons by Imperial Dungeoneers."}, {"tag": "p", "text": "Vibroblades were still being used during the first galactic civil war, even by High Ranking imperials such as the inquisitor Jerec, who sometimes used it over his lightsaber for mundane tasks like beheading un-coperating prisoners."}, {"tag": "p", "text": "Despite widespread banning, the use of vibrobladed weaponry continued on isolated, less civilized worlds, such as Tatooine. Jabba the Hutt's skiff crew used pikes with vibrobladed cutting edges. Vibroblades were also carried by officers of the Alliance Special Forces and later by Core Fleet Elite Commandos of the Galactic Alliance Defense Forces."}, {"tag": "p", "text": "Around 40 ABY, Lumiya, a Dark Lady of the Sith, carried a vibroblade which she used to plunge into her own cybernetic thigh, without the slightest quiver of pain, to prove the extent of her prosthetic limb replacements. Around the same time, Mara Jade Skywalker gave her son Ben Skywalker a vibroblade with a concealed tracking device."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}