{"url": "Ben_Burtt", "categories": ["Category:Real-world articles", "Category:Reference work authors", "Category:Star Wars Episode III: Revenge of the Sith voice actors", "Category:Star Wars production staff", "Category:Star Wars: Episode I The Phantom Menace actors", "Category:Star Wars: Episode II Attack of the Clones actors", "Category:Star Wars: Episode VI Return of the Jedi actors", "Category:Star Wars Jedi: Fallen Order voice actors", "Category:TV screenwriters"], "nodes": [{"tag": "h1", "text": "Ben Burtt"}, {"tag": "p", "text": "Ben Burtt (born July 12, 1948) is the sound designer for the Star Wars films, and others made by Lucasfilm Limited with subsidiary Skywalker Sound. His most famous creations are the sound of the lightsaber, Darth Vader's breathing, and the binary speech of R2-D2. He has created many of the languages heard in Star Wars—most of which are marked by shared etymological roots with English—and has written the Galactic Phrase Book & Travel Guide."}, {"tag": "p", "text": "Burtt has a reputation for including a sound effect dubbed the \"Wilhelm scream\" in many of the movies he's worked on. Taken from a character named Wilhelm in the film The Charge at Feather River, the scream can be heard in Star Wars when a stormtrooper falls into a chasm in the Death Star, and in Raiders of the Lost Ark when a Nazi soldier falls from a moving car. The scream appears in many other movies."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Burtt appeared in two of the Star Wars films as an extra. He appeared in Return of the Jedi (as the Imperial officer Colonel Dyer, who yells \"Freeze!\" before Han Solo throws a toolbox filled with explosive charges, causing him to fall off a catwalk; he utters a Wilhelm scream at that moment) and The Phantom Menace (as Ebenn Q3 Baobab, who appears in the background near the end when Amidala congratulates Palpatine). He also provided the voice for Wat Tambor in Star Wars: Episode II Attack of the Clones and Lushros Dofine in Revenge of the Sith. Burtt was also heavily involved in writing the animated series Star Wars: Droids, to which the prequel trilogy makes many references."}, {"tag": "p", "text": "Burtt returned as sound designer for 2015's Star Wars: Episode VII The Force Awakens. He is credited as sound designer & re-recording mixer, with David Acord, on Star Wars: Forces of Destiny. He voiced the droid BD-1 in the 2019 video game Star Wars Jedi: Fallen Order."}, {"tag": "p", "text": "Ben Burtt appeared at Celebration IV in 2007 for a question-and-answer session."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}