{"url": "Vibrosword/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Vibroswords"], "nodes": [{"tag": "h1", "text": "Vibrosword"}, {"tag": "p", "text": "The vibrosword was a longer, heavier version of the vibroblade."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The vibrosword was based on Echani weapon design. It was generally wielded with two hands, although some beings were strong enough to wield them with one and carry two of them."}, {"tag": "p", "text": "Like all vibro-weapons, it was dangerous to use vibroswords against electrical weapons, as they conducted electricity, therefore, electrocuting the user of the sword. Though electrocution was not the primary concern, electricity traveling up the length of the blade could connect with the weapon's energy cell and ultrasonic vibration generator. The result would be a miniature explosion with enough force to take off the user's hand.[source?]"}, {"tag": "p", "text": "The vibrosword model that was commonly used around 3956 BBY during the Old Republic era contained cortosis-weave, granting it lightsaber-deflecting abilities which made it more effective against the numerous lightsaber-wielding opponents during that era. The vibrosword model used during the Rise of the Empire era did not contain this cortosis enhancement."}, {"tag": "p", "text": "Variants of the vibrosword included the icy Echani vibrosword and the high-tech Baragwin assault blade."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The vibrosword was used by members of the Sith Empire's Imperial Military, such as security chief Souske, Lieutenant Marcovic, and Dashade Sith warrior Khem Val. The weapon was also used by Keshk, a Grand Chieftain of the Flesh Raiders."}, {"tag": "p", "text": "During the Rise of the Empire era, vibroswords were used by BX-series droid commandos and seemed effective against Clone troopers of the Galactic Republic. But they were also effective against droids, as Hondo Ohnaka used one against battle droids when he fought alongside Ahsoka Tano and several other Jedi younglings on Florrum when General Grievous invaded the planet. The weapons were also used by Trandoshan scavengers. Sapphire, a Rebel operative and smuggler, carried a vibrosword with her."}, {"tag": "p", "text": "During the Legacy era, the Galactic Alliance Remnant's elite Venom assault squads used vibroswords during boarding raids and other close-quarters combat situations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}