{"url": "Vibrowhip", "categories": ["Category:Legends articles", "Category:Vibroweaponry", "Category:Whips"], "nodes": [{"tag": "h1", "text": "Vibrowhip"}, {"tag": "p", "text": "Vibrowhips were vicious close-combat whips that were—as the name suggested—powered by a vibration generator."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A vibrowhip was a cord with a tip that was enhanced with an ultrasonic vibration generator in the handle to produce augmented slashing capabilities during its use."}, {"tag": "p", "text": "Only one vibrowhip has been encountered to date; the weapon was wielded by Black Sun strongman Xist. As such, his weapon's specifications are generally used as the standard."}, {"tag": "p", "text": "Xist's vibrowhip consisted of a long cord with a short, curved handle on one end, and a knotted tassel on the other. When active, the whole length of the weapon—excluding the handle—lit up with a dull blue glow, indicating that it also had a vibroblade energy cell attached. The weapon's tip appeared capable of considerable armor penetration, as shown by Xist's glancing blow to Obi-Wan Kenobi's shoulder during their duel in New Coronet on Trigalis. However, the rest of the cord appeared to lack slashing capabilities, having wrapped around the thigh guards that Kenobi wore without causing any noticeable physical damage. Xist's vibrowhip also demonstrated the ability to resist lightsaber blades. This was demonstrated when Kenobi parried one of Xist's attacks without significantly damaging the whip and indicated it was made with an energy-resistant material, such as cortosis-weave incorporated in vibroblades."}, {"tag": "p", "text": "Similar to the lightwhip, the primary asset of the vibrowhip was its copious range in close combat. However, it shared several lightwhip weaknesses as well, such as its inadequate defensive capabilities, the difficulty in controlling it, and the wide swings needed to gain momentum for strikes, leaving the wielder's defenses open to attack."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As the only known wielder of the vibrowhip, Xist's biography seems to comprise the weapon's history."}, {"tag": "p", "text": "The preferred weapon of the Falleen strongman, Xist became renowned for his skill with it and was said to rival Obi-Wan Kenobi's skill with a lightsaber. However, due to the weaknesses of the weapon, he sported a blaster pistol in his off-hand to compensate. Rising through the ranks of Black Sun, Xist gained control of the spaceport New Coronet on Trigalis. Aligning with the Confederacy of Independent Systems during the Clone Wars, he became a powerful information broker. Such was his influence that when Obi-Wan Kenobi began searching for the CIS commander, Asajj Ventress, shortly after her disappearance, he confronted Xist for information. Xist attacked him with his vibrowhip."}, {"tag": "p", "text": "In the ensuing melee, Kenobi took advantage of the vibrowhip's weaknesses, attacking Xist from close range with punches and kicks and wielding his lightsaber to parry Xist's attacks. Though Xist managed to score a glancing blow to Kenobi's shoulder—causing the Jedi noticeable pain—he was ultimately defeated, dropping his whip when Kenobi kicked him in the abdomen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}