{"url": "Vicendi", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Historians", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vicendi"}, {"tag": "p", "text": "Vicendi was a male historian commissioned in 10,000 BBY to create a list of galactic wonders for the Galactic Republic's anniversary. His work, entitled the Twenty Wonders of the Galaxy and released in his Arturum Galactinum, focused only on objects constructed by sentient beings. Vicendi's list was criticized by many who believed the historian had overemphasized both early Republic and Core Worlds structures, and, in the millennia that followed, various species and groups compiled their own competing catalogs of wonders."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vicendi was a male historian who lived around 10,000 BBY. In that year, he compiled a list of galactic wonders for inclusion in his Arturum Galactinum, a work commissioned to celebrate the anniversary of the Galactic Republic. Vicendi opted to include only structures or objects constructed by sentients into his list, disregarding natural wonders like the Corphelion Comets and the Fire Rings of Fornax. He gathered a score of historical objects and locations—many of which were no longer in existence—into his final product, the Twenty Wonders of the Galaxy. The wonders Vicendi chose ranged from the towering, pre-Republic Statue of Xim to the crystal city of Calius saj Leeloo on the planet Berchest, and from the fire-breathing Caliginous Automaton of Tomo-Reth to the massive library on Obroa-skai known as the Celebratus Archive."}, {"tag": "p", "text": "Many beings found fault with Vicendi's list, however, arguing that it was overly focused on wonders of the early Republic and placed too much emphasis on the Core Worlds region rather than the galaxy as a whole. Over time, three species—the Bothans, the Caamasi, and the Hutts—produced their own separate lists of galactic wonders. Millennia after Vicendi's lifetime, the Galactic Empire, in accordance with its Human High Culture policies, rewrote the historian's list and distributed it through the Imperial Ministry of Education as \"Glorius Imperica.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When crafting his list for Arturum Galactinum, Vicendi disregarded natural wonders and instead focused solely on objects constructed by sentient beings. Critics of his Twenty Wonders of the Galaxy noted that the historian appeared to be biased toward the Core and the early history of the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vicendi was first mentioned in the \"Twenty Wonders of the Galaxy\" entry in The Complete Star Wars Encyclopedia, a reference book published in 2008. In 2009, the information from this entry was repeated, almost verbatim, on a page detailing the Twenty Wonders of the Galaxy in The Essential Atlas."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}