{"url": "Victory-class_Star_Destroyer", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Star Destroyer classes", "Category:Starship lines", "Category:Victory-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Victory-class Star Destroyer"}, {"tag": "p", "text": "The Victory-class Star Destroyer was a line of Star Destroyer used by both the Republic Navy and Imperial Navy. One ship of the line was the Victory II-class Star Destroyer. The Victory-class was capable of deploying a garrison base and making surface landings, and boasted seven sublight engines. The ship could be used to provide security for convoys, to transport cargo, and to accompany other vessels."}, {"tag": "p", "text": "Originally used by the Galactic Republic, the Victory-class continued into the service of the Galactic Empire from 19 BBY, with one such Imperial craft being the Harrow. In 14 BBY, several Victories were utilized by the Empire, including some based at Coruscant's Imperial Palace and Belderone's R/M Facility Four deepdock. During the Galactic Civil War, at least five Victory-class Star Destroyers served with the Dark Lord of the Sith Darth Vader at some point following the Battle of Yavin."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A line of Star Destroyer, the Victory-class Star Destroyer featured a vertical structure rising from its central tower, as well as protruding flaps on both of its side edges. Additionally, it was propelled by seven sublight engines and was capable of carrying at least one garrison base. The Victory-class could also perform surface landings."}, {"tag": "p", "text": "One type of Victory-class Star Destroyer was the Victory II-class Star Destroyer."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Victory-class Star Destroyer could be used to provide security for freighters in a convoy. The ship could also be used to transport important goods, such as Darth Vader's meditation chamber, and accompany other Imperial Star Destroyers, such as the Imperial-class Star Destroyer and Onager-class Star Destroyer."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Use by the Republic"}, {"tag": "p", "text": "The Victory-class Star Destroyer originally saw use with the Republic Navy. Sentinel Base, a lookout station that monitored supply shipments going to the first Death Star battle station, was originally a garrison base deployed from a Republic Victory-class Star Destroyer, although it was later expanded with prefabricated modules."}, {"tag": "h3", "text": "Service to the Empire"}, {"tag": "p", "text": "Following the rise of the Galactic Empire in 19 BBY, the Victory-class was still used by the Imperial Navy. At some point, a Victory-class Star Destroyer was attacked and heavily damaged in space by the MC75 Star Cruiser Aspiration. In another instance, two Victory-class Star Destroyers accompanied the Imperial Onager-class Star Destroyer Rakehell through a cloud of gas in space."}, {"tag": "p", "text": "The Harrow was an Imperial Victory-class that at some point was positioned above a terrestrial body, while another Victory served as the main security for Imperial Convoy 8766, a group of four bulk freighters and six medium freighters rumored to be heading for a secret Imperial installation. The convoy arrived at an Imperial depot over the course of three days, with the Star Destroyer arriving on the second day."}, {"tag": "h3", "text": "14 BBY campaign"}, {"tag": "p", "text": "In 14 BBY, the landing field of the Coruscant Imperial Palace could accommodate the landings of Victory-class Star Destroyers. A group of stormtroopers commanded by Darth Vader transferred the Sith Lord's meditation chamber from a Victory parked at the landing field to the corvette Carrion Spike, in preparation for Vader's mission to Murkhana with Moff Wilhuff Tarkin."}, {"tag": "p", "text": "At Murkhana, the Carrion Spike was stolen by rebel insurgents, who used it to attack Galidraan Station. Tarkin and Vader pursued the group to Galidraan III, but the insurgents soon fled the system. Tarkin then contacted an Imperial colonel and asked what Imperial resources were in the area, as he suspected the insurgents would strike again. Along with several other facilities, the colonel reported of the Imperial Navy R/M Facility Four deepdock at Belderone, at which several Victory-class Star Destroyers were parked, along with several CR90 corvettes, two Carrack-class light cruisers, and the Venator-class Star Destroyer Liberator. Tarkin decided to deploy the Liberator to Nam Chorios, as that seemed the most likely target in the vicinity, although the insurgents ultimately chose to attack Lucazec next."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Sometime after the Battle of Yavin, during the Galactic Civil War, at least five Victory-class Star Destroyers served with Vader's flagship, the Imperial I-class Star Destroyer Devastator, when the Sith Lord learned that the rebel who destroyed the first Death Star was named Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Victory-class Star Destroyer first appeared in the new Star Wars canon in the 2014 novel Tarkin, written by James Luceno. It was first pictured in Darth Vader 6, a 2015 comic book written by Kieron Gillen and illustrated by Salvador Larroca. In the Star Wars Legends continuity, the Victory class first appeared in the 1979 novel Han Solo's Revenge, by Brian Daley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}