{"url": "Victor_Flight", "categories": ["Category:Legends articles", "Category:Naboo Royal Space Fighter Corp", "Category:Starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Victor Flight"}, {"tag": "p", "text": "Victor Flight was a starfighter squadron of the Naboo Royal Space Fighter Corps that served Naboo during the Clone Wars."}, {"tag": "p", "text": "The squadron was equipped with two N-1 starfighters and several N-X Police Cruisers. Victor Flight acted as a last line of defense for Naboo against invaders or pirates. They most frequently ran across smugglers attempting to get off-planet with full cargo holds, Gungan activists and other planetside threats."}, {"tag": "p", "text": "Victor Flight served the RSF as an orbital 'coast guard', patrolling the upper atmosphere and close orbit space lanes around Naboo, occasionally venturing further out on escort runs to the colony on Ohma'Dun. Unlike the Starfighter Corps more famous squadrons, like Bravo Flight and Echo Flight, Victor Flight's pilots had a reputation in the Naboo Security Forces as troublesome mavericks and problem cases."}, {"tag": "p", "text": "This poor perception of the Victors reached back to a point before the Trade Federation embargo of Naboo, when the then-current flight leader of the squadron was arrested for collusion with pirates, after supplying the raiders with transit patterns for incoming freighters. Although it was never proven, the then-current head of Royal Security, Captain Magneta, made no secret that he suspected the involvement of other Victor Flight pilots in the crime."}, {"tag": "p", "text": "Regarded as something of a backwater posting on Naboo, Victor had already been used as a placement for pilots with 'difficult' natures and the arrest of the commander tarnished their repute even further. However, Victor Flight's next commanding officer, a naïve and untested leader named Stal Bridda, hoped to turn the opinions of the Naboo people around - and after leading an attack on a Trade Federation transport group using only under-powered Police Cruisers, Bridda started down the long road to rebuild Victor Flight's good name."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The original draft of the feature On Wings of Rogues also included the following information on three of Victor Flight's pilots, although this was cut from the final version:"}, {"tag": "p", "text": "Flight Leader Stal Bridda, Victor Leader - A youthful, energetic officer, Bridda made the mistake of earning Captain Magneta's anger over a minor infraction and found himself assigned to Victor Flight; he intends to make the misbegotten squad the best pilots on Naboo, and will not accept that this may be impossible."}, {"tag": "p", "text": "Pilot Lev Mikoyan, Victor Two – Bridda's long-suffering second-in-command, Lev knows more about the dirty secrets of the squadron than he's letting on, but the idealistic young officer has awakened in him the idea that he might just be able to get his self-respect back."}, {"tag": "p", "text": "Pilot Nelina Goq, Victor Four – A pirate flyer acting as a spy in the squadron, Goq has remained successfully hidden during the Trade Federation invasion, but now she fears that she will be discovered. Suspicious of everyone, Nelina is caught between her desire to escape and her growing love for life on Naboo."}, {"tag": "h2", "text": "Sources"}]}