{"url": "Victory_I-class_Star_Destroyer", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederation starship classes", "Category:CSA starship classes", "Category:Galactic Alliance starship classes", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:New Republic starship classes", "Category:Star Destroyer classes", "Category:Victory I-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Victory I-class Star Destroyer"}, {"tag": "p", "text": "The Victory I-class Star Destroyer, also known as the Victory I-class Destroyer and Victoria I-class Star Destroyer, was a warship designed for planetary defense, planetary assault, ground troop support, and ship-to-ship combat. It was used by the Galactic Republic during the mid-Clone Wars, the Galactic Empire and the Corporate Sector during the Galactic Civil War and the Confederation during the Second Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "Victory I-class Star Destroyers were 900 meters long, just over half the size of the later Imperial-class Star Destroyer. Like later Star Destroyer designs, the Victory possessed the ability to enter the upper levels of a planetary atmosphere. This gave the ship a decided advantage of added precision when engaging in the ground attack operations the class was designed to carry out. In addition, the Victory could also pursue other vessels hoping to escape by diving towards a planet. A set of atmospheric maneuvering surfaces were located along the ship's flanks as well. Some Victory variants dispensed with the atmospheric maneuvering surfaces altogether. Star Destroyers of this kind fought in the Operation Shadow Hand, notably in the Battle of Balmorra."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "Despite being several decades old at the time, the shields and hull armor of Victory I-class ships were still quite heavy compared to the other vessels used during the Galactic Civil War. They were equipped with 10 quad turbolaser batteries, 40 double turbolaser batteries, 80 concussion missiles tubes, and 10 tractor beam projectors.\nShips of the class were clad in 9095-T8511 grade durasteel."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "A single Victory I-class Star Destroyer required 4,798 crew members and 402 gunners for optimal operation and could transport up to 2,040 troops, 8,100 metric tons of cargo, several ground vehicles like the AT-AT, and two squadrons of starfighters."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The Victory I-class Star Destroyer's biggest disadvantage was its underpowered LF9 ion engines, which could not produce sufficient acceleration to pursue newer and faster ships, allowing them to escape ship-to-ship combat. This flaw was rectified in the limited Victory II-class, produced shortly before the advent of the Empire."}, {"tag": "p", "text": "Some variants of the Victory-class were designed with three main thrusters and four auxiliary thrusters, like the larger Imperial-class. Others, like the Harrow and the Protector, had two main thrusters and two auxiliary thrusters wedged in-between."}, {"tag": "p", "text": "The Victory Star Destroyer's Class 1.0 hyperdrive was superior to that of the Imperial-class Star Destroyer, allowing Victory ships to reach their destinations in half the time."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic-Imperial origin"}, {"tag": "p", "text": "At the start of the Clone Wars and the introduction of the Acclamator-class assault ship, the Arch-Provost of Rendili ordered industrial spies and ship-designers to come up with a way to curb Kuat's lead on new contracts with the Galactic Republic."}, {"tag": "p", "text": "The two rival shipbuilders, Rendili StarDrive and Kuat Drive Yards, later embarked on a collaborative design-project while the war was still in its early phases. This was called the \"Victor Initiative Project\", which resulted in the Victory-class. This design by Walex Blissex became a direct challenge to Kuat's Venator-class."}, {"tag": "p", "text": "An early batch of Victory I-class Star Destroyers were deployed to defend Sector 0 against the Techno Union's fleet of Bulwark Mark I battlecruisers, which had escaped the blockade of Foerost.\nThis resulted in the deployment of the \"Victory Fleet\" six months ahead of schedule. Despite this, the majority of the initial commission group was not deployed until Palpatine had already dissolved the Galactic Republic and established his Imperial rule."}, {"tag": "p", "text": "A subclass known as the Victory II was introduced later in the Clone Wars. Refitted with new ion engines by Hoersch-Kessel Drive to replace the underpowered LF9s, and trading the concussion missiles for ion cannons and extra turbolasers; this variant was designed with an emphasis on space combat. This newer class was externally very similar to its predecessor. Very few Victory II's were built, as they were introduced not long before the Imperial-class, which essentially supplanted it in the space combat role."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "The abundant number of Imperial-class Star Destroyers, and the growing popularity of the Imperial-series amongst the Imperial Starfleet, led to many Victory-class Star Destroyers being decommissioned or sold to groups like the Corporate Sector Authority, which purchased 520. Most of the Victory-series Star Destroyers still in Imperial service near the height of the Empire were often assigned to planetary defense roles."}, {"tag": "p", "text": "Within the Imperial Navy, Victory-class Star Destroyers were considered second only to Imperial-class Star Destroyers for most operations in the Outer Rim Territories against pirates and Rebels. The order of battle considered one Victory-class Star Destroyer the equivalent of two Strike-class cruisers."}, {"tag": "p", "text": "Heavy squadrons often featured Victory-class Star Destroyers; at the systems force level and above, they accompanied larger Star Destroyers, Star Cruisers, and Star Dreadnoughts in major assaults. Such as in the Battle of Ciutric, while other Star Destroyers used their turbolasers to strip the shields and armor of enemy capital ships, Victory Destroyers were called upon to deliver devastating barrages of concussion missiles against their now-unprotected hulls. The ability to pursue enemies into planetary atmospheres also made Victorys an invaluable part of many Imperial squadrons."}, {"tag": "p", "text": "A key disadvantage of the Victory I was its low speed which made its deployment difficult and allowed quicker foes to escape pursuit. During the Battle of Denab, the Rebel commander was able to defeat each Imperial squadron separately before they could come to each others aid, otherwise the greater firepower of the Victory ships would have prevailed. After that, Imperial tacticians necessitated assigning support ships, such as Interdictors, Strike cruisers, and Carrack cruisers, to make up for the shortcomings."}, {"tag": "p", "text": "While Thrawn was a Vice Admiral, he had flown his flag on Victory ships such as the Stalwart and the Sceltor, as did Admiral Harkov with the Protector. Most notably, the Bombard and the Crusader all but wiped out the notorious Eyttyrmin Batiiv pirates during the Battle of Khuiumin; the pirates were aware of the impending Imperial attack but were overconfident in their ability to defeat a pair of \"antiquated\" Victory Star Destroyers."}, {"tag": "p", "text": "When Grand Admiral Thrawn took control of the Empire, this saw a return of the Victory-class to frontline duties, because of a lack of larger and more powerful ships such as the Imperial-class."}, {"tag": "h3", "text": "Galactic Alliance service"}, {"tag": "p", "text": "Following the Yuuzhan Vong War, the Galactic Federation of Free Alliances commissioned an updated version of the Victory for use as pirate hunters across its territories. Some of these new vessels were fitted with large turrets on the upper hull, each housing a huge asteroid-tug tractor beam sold to the Galactic Alliance Defense Force by Lando Calrissian."}, {"tag": "p", "text": "Prior to the Swarm War, the Killiks hijacked a Galactic Alliance Victory-class Star Destroyer called the Admiral Ackbar, which had been used by the Alliance for the blockade of the Utegetu Nebula, for the Killiks' invasion of the Chiss Ascendancy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Victory I-class Star Destroyer was developed from a prototype Star Destroyer model created by Colin Cantwell for Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "The Victory-class Star Destroyer was first mentioned by name in Brian Daley's novel Han Solo's Revenge used by the Corporate Sector Authority Territorial Manager Odumin."}, {"tag": "p", "text": "The New Essential Chronology mentioned that the Victory-class was the product of a \"Victor Initiative Project\". This tied the Victory-class into the naming scheme used by other large Republic ship classes of the era, all of which had Latin-based names ending in -tor, such as the Venator-class, the Mandator-class, and the Imperator-class. \"Victor\" comes from the Latin verb vincere, meaning \"to conquer\", via the supine form victum."}, {"tag": "p", "text": "Roleplaying game statistics published by West End Games originally gave the Victory I-class eighty concussion missile tubes, with an unknown number of missiles. This was later adjusted to twenty tubes with four missiles each by the book Starships of the Galaxy, published by Wizards of the Coast. However, in X-Wing: Isard's Revenge, the \"eighty-concussion missile launch tubes\" of the Victory-class Star Destroyer Emperor's Wisdom and the comparable missile batteries of her sister ships Selonian Fire and Corusca Fire, play an important role in the storyline."}, {"tag": "p", "text": "Star Wars: Empire at War is the first source to depict details on the Victory-class which appear to represent large cannons flanking the bridge superstructure, similar to the Imperial-class and Venator-class Star Destroyers. A comparison using the game's map editing program (which uses the game's own 3-D rendering engine and depicts all three ships in proper proportion to each other) shows these cannons to be roughly half the size of the corresponding units on the larger destroyers. Therefore, the presence of the cannons on the Victory-class in-game model is likely an unforeseen side-effect of it simply being a scaled down and modified version of the Imperial I-class model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}