{"url": "Victory_II-class_Star_Destroyer", "categories": ["Category:Canon articles", "Category:Galactic Empire starship classes", "Category:Star Destroyer classes", "Category:Victory II-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Victory II-class Star Destroyer"}, {"tag": "p", "text": "The Victory II-class Star Destroyer was a class of Star Destroyer of the Galactic Empire that served as a successor to the Victory-class Star Destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Victory II-class Star Destroyer was a class of Star Destroyer that was manufactured by Kuat Drive Yards as a successor to the original Victory-class Star Destroyer. Initially a life extension program, it became the Victory II program which introduced the Victory II-class, and sought to fix many problems from the previous model including increasing combat performance and longevity. Despite the rebuilds, the Victory II was not able to correct all of the issues of its predecessor."}, {"tag": "p", "text": "The Victory II-class cost 50,000,000 credits and was equipped with a class 1 and class 15 hyperdrive, a navigation computer, and a long-range sensor. 6,107 officers, pilots, and enlisted crew operated a vessel, while 1,600 soldiers were stationed onboard. It could hold consumable for one year, and had a complement of twenty-four starfighters along with shuttles, landing craft, and AT-series walkers."}, {"tag": "p", "text": "Victory IIs were armed with the same weapons loadout as the predecessor, and as such were equipped with ten quad light turbolaser batteries that were evenly distributed to the port and starboard sides of the vessel. It was also armed with ten forward-mounted twin medium turbolasers, ten dorsal-mounted twin medium turbolasers, twenty assault concussion missile launchers, and ten hull-mounted heavy tractor beam projectors. Some Victory IIs, however, were equipped with ion cannons rather than concussion missile launchers, which was extremely rare."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Many Victory IIs were relegated to serve as defense for a planetary garrison and light patrol duties on the edges of the Galactic Empire's authority. They also served as system defense and as a fleet command ship. An Imperial officer being assigned to an old Victory II-class was often seen as the end of their career."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Victory-class Star Destroyer was introduced at the height of the Clone Wars and served as an all-purpose heavy line-of-battle starship. The Star Destroyer was rushed into production and service after many delays and politics, which resulted in a vast array of design flaws. These flaws required that constant maintenance be given to the Victory-class by its crew for combat readiness, and it became known as a space coffin and unlucky ship."}, {"tag": "p", "text": "As such, when the Galactic Republic was transformed into the Galactic Empire, the Victory-class was given a life-extension program that turned into the Victory II program, which launched the Victory II-class Star Destroyer. The Victory II program sought to fix the many issues of the Victory-class, but it did not put an end to several flaws. Additionally, the Imperial Navy was bolstered by the production of the Imperial I-class Star Destroyer and Imperial II-class Star Destroyer rendering the remaining Victory IIs obsolete despite the upgrades and relegating the ships to backwater and unremarkable duties."}, {"tag": "p", "text": "At one point during the Imperial Era, an Imperial commander who had a level of failure was exiled to command a Victory II at the edge of the Outer Rim Territories. In another instance, a Victory II was abandoned by its crew and orbited an abandoned planet. It had its hangar bay empty and all of the escape pods launched. A Victory II was also present in orbit above an ecumenopolis during the Imperial reign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Victory II-class Star Destroyer was first introduced to Star Wars canon in the 2020 Fantasy Flight Games supplement, Starships and Speeders. It previously first appeared in Star Wars Legends in Mission to Lianna."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}