{"url": "Vidar_Kim", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Galactic Republic senators", "Category:Humans", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Vidar Kim"}, {"tag": "p", "text": "Vidar Kim was a male Human politician from the planet Naboo. Kim served as the Senator of the Chommell sector in the Senate of the Galactic Republic in the 50s BBY, and was the tutor of a young noble boy named Palpatine. Unknown to Kim, Palpatine had been recruited as an apprentice by the Dark Lord of the Sith Darth Plagueis."}, {"tag": "p", "text": "Senator Kim's eldest son, Ronhar, had been identified as Force-sensitive and turned over to the Jedi Order in his infancy, a choice Senator Kim would later regret before his death. Kim's politics were conservative and isolationist, and he clashed with politicians like Bon Tapalo and Ars Veruna who wished to open Naboo to the wider galaxy. Tragedy struck Kim in 54 BBY when his wife and two children perished in a starship accident over Kaadara. Convinced that his political opponents had been behind his family's deaths to force his retirement, Kim's behaviour became increasingly erratic, attempting to lure Ronhar away from the Jedi Order to rejoin him on Naboo. Identifying the Senator as a liability to the Sith Grand Plan, at the behest of Darth Plagueis Palpatine arranged Kim's assassination in 52 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet Naboo, the capital world of the Chommell sector, Vidar Kim first tasted politics during his required years of service in the Legislative Youth Program. Becoming the administrative aide of a young female Senator, Kim slowly began his ascent through Naboo politics."}, {"tag": "p", "text": "At some point, Kim met his wife, and was happily married to her for years, fathering three sons, including a Force-sensitive boy named Ronhar Kim. When the Jedi Order approached the family, Kim and his wife parted ways with little Ronhar, sending him to the Jedi Temple on Coruscant to be initiated in the ways of the Jedi."}, {"tag": "p", "text": "As a conservative Naboo, Kim garnered the support of House Palpatine's patriarch, Cosinga Palpatine, as both men shared a pro-isolationist stance. Discouraging the bedding of corporate entities who wanted to exploit the rich plasma reserves in the planet's core, Kim did all he could to persuade the monarchy and the Senator to avoid selling their rare resource offworld. As Kim finished his time at the Apprentice Legislator program, he met the eldest son of his supporter, a young boy by the name of Palpatine; Kim took the rebellious youth under his wing and tutored him during his time in the Youth Program. Despite the fact that Palpatine—a strong supporter of Naboo's opening to the galaxy—and his mentor had vastly different political viewpoints, they got along well and were close friends. Vidar once told Palpatine that he was like the younger brother that he had never had."}, {"tag": "h3", "text": "Senator of the Chommell sector"}, {"tag": "p", "text": "Kim's conservative politics and influential backers eventually saw him succeed the outgoing Senator as the Chommell sector's representative in the Galactic Republic's Senate. Kim's isolationist stance saw him clash with King Bon Tapalo over the sale of Naboo's plasma reserves: Tapalo had arranged a deal with the Trade Federation to export Naboo's plasma through it, and Kim saw the deal as unjust and exploitative, pointing out that the Federation sold the plasma on for up to twenty times the price it paid for it. Kim came to feel that he was only kept on as Senator to placate the noble houses of Naboo that had opposed Tapalo in the election of 65 BBY."}, {"tag": "p", "text": "By 54 BBY, Senator Kim was joined in the Senate by his pupil, now ambassador, Palpatine and Kinman Doriana. Unknown to Kim, Palpatine had been taken as the apprentice of the Dark Lord of the Sith Darth Plagueis. The Muun Sith Lord had ordered Palpatine to deepen his connection to Kim upon hearing that the Senator had sired a Forceful son. Plagueis thought to turn the boy to the dark side of the Force at a future date if it would help further the Grand Plan. Both Kim and Palpatine knew that the younger man would one day replace him in the Senate, and that Kim only continued to serve in the position to appeal to the opponents of the current King Bon Tapalo. During a gala on Malastare in the wake of the Vinta Harvest Classic, Senator Kim and his entourage were in attendance when the Senator received a communiqué from Naboo, revealing the death of his entire family in a airspeeder accident over Kaadara."}, {"tag": "p", "text": "Returning immediately to Naboo, Kim, his entourage and a large throng of mourners gathered at the Funeral Temple in Theed for his family's cremation. The funeral procession was led by King Tapalo into the Temple, where the three bodies were laid upon a massive pyre and reduced to ashes. Walking on foot to the nearby Livet Tower, Senator Kim reflected in silence around the Eternal Flame before giving an emotional farewell to his family, spreading their ashes into the Solleu River and over the Virdugo Plunge."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Broken by the tragedy, Kim devised a far-fetched plot to lead his only living son, the Jedi Knight Ronhar Kim, away from the Order and to carry on the family lineage. Returning to Coruscant within a month of his family's accident, Kim was angered when his only remaining son refused him, reaffirming his oath to the Jedi Order. Two years passed without further communication between the Kims, though the whole affair weighed heavily on the Senator. In 52 BBY, Kim called upon Palpatine to discuss matters of great import at his home in Theed. Detailing his belief that the King and his adviser, Ars Veruna, had arranged the crash to kill his family as a means to make him retire, Kim outlined his plan to reveal the King's corruption to the Jedi High Council. While on Coruscant, Kim had arranged a meeting with his son with the intention of swaying him to his cause and getting him to investigate on Naboo."}, {"tag": "p", "text": "As Kim began to become frantic, the Sith Lords working behind the scenes on Naboo came to the conclusion that the Senator had become too much of a liability. Sidious, the alter-ego of Ambassador Palpatine, arranged with Sate Pestage to have Kim killed on Coruscant by a Maladian assassin. A week later, Kim was riding in an open-air speeder with his last remaining heir when the hired assassin fired a round at the car, killing Kim before committing suicide to evade capture and interrogation by the Jedi."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The funeral service for Senator Kim was held at the Naboo Embassy on Coruscant, and was attended by interim Senator and Kim's old friend, Palpatine. The secret Sith Lord used the funeral to meet with Kim's son, Ronhar Kim, the first Jedi he had ever encountered. Approaching Kim in the viewing room, Palpatine spoke with the Jedi about forming an alliance as the corpse of Senator Kim lay nearby in silence; a bowl of purple flowers rested on his chest, along with a symbolic candle representing the Eternal Flame. Agreeing to the terms, Palpatine and Jedi Kim would form a close relationship as the Sith Lord sought to undo the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}