{"url": "Victory_and_Death", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Victory and Death"}, {"tag": "p", "text": "\"Victory and Death\" is the twelfth and final episode of the seventh season of Star Wars: The Clone Wars, and the show's series finale overall. It was released on Disney+ on May 4, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "In the wake of Order 66, Ahsoka and Rex must work together to survive."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Trapped"}, {"tag": "p", "text": "Ahsoka Tano and Rex stand trapped in the medical bay of the Tribunal, as the clone troopers begin to cut through the door. Rex asks how they are going to get out, and Ahsoka says she has an idea. \"Which is?\" he asks, drawing his pistols, which Ahsoka tells him to set to stun so as to not kill the troopers, causing him to quip that she should tell that to them. They stand ready, with Ahsoka saying to wait until the cutting is complete. As soon as the cuts converge, Ahsoka pushes the door back with the Force, then deflects blaster fire as Rex stuns his former squadmates. Ahsoka tells R7-A7 to find them a way out, and the droid closes several blast doors cutting off most of the troopers. As the escape pods have been destroyed, Ahsoka suggests using a shuttle to escape. Rex asks Ahsoka if she'd heard that Maul had also escaped, but Ahsoka replies that he didn't escape — she let him out. Rex asks incredulously \"Why?\" and she replies, \"As a diversion.\" As Ahsoka and the droids run down the hall, she yells for Rex to come on, and as he follows her he remarks to himself \"That's one word for it.\""}, {"tag": "h3", "text": "Sabotage"}, {"tag": "p", "text": "Maul walks toward the hyperdrive room, still using a clone trooper's wrist comm to listen in on their radio chatter. Over the radio, one of the clones reports to Jesse that Tano has escaped. Jesse asks about Rex and is told he is still missing in action. He asks if Rex has aided in Tano's escape, but they don't know. Two clone troopers round the corner and train their guns at Maul, who lifts them into the air, choking them."}, {"tag": "p", "text": "Maul enters the hyperdrive room, quickly and violently dispatching the clone troopers inside it with the Force. He tears the control console away, then uses the Force to rip the hyperdrive engines out of their moorings. On the bridge, an officer reports that the hyperdrive is failing and is ordered to disengage them, but cannot. More troopers enter the hyperdrive room but are crushed when Maul brings the hyperdrive engines down on them. The vessel, emitting smoke and explosions, emerges from lightspeed and heads towards a moon."}, {"tag": "h3", "text": "Escape"}, {"tag": "p", "text": "Ahsoka and Rex enter hangar control, stunning the officers. Rex notes that the clones have anticipated their actions, and have sealed the hangar bay doors and locked down all systems — he says that if they weren't trying to kill them, he'd be proud. Ahsoka assigns R7 to unlock the bay doors, Cheep to prep the shuttle, and G-G to find out what has happened to the hyperdrive. Over the comlink, Maul hears the clones report to Jesse that they think Tano and Rex are heading to the hangar. Jesse tells them to assemble there, but to await his signal before acting."}, {"tag": "p", "text": "In the control room, G-G tells Rex the hyperdrive has been completely destroyed, and he realizes the ship is caught in the gravity well of the nearby moon. Ahsoka tells R7 to open the doors, as Jesse's troops converge on the location, followed by Maul, and the disintegrating vessel begins to enter the atmosphere. A bay door opens, revealing a Nu-class attack/transport shuttle, but also two platoons of clone troopers, who gather information below the observation windows. Rex suggests fighting their way to the shuttle, but Ahsoka says there are too many of them, and she doesn't want to hurt them. Rex says the clones don't care, and are willing to die if it means taking Ahsoka and Rex with them. He falls silent, and Ahsoka gently removes his helmet, revealing tears streaming down his cheeks. Ahsoka says he is a good soldier, but so are the troopers in the hangar, and they may be willing to die, but she is not going to be the one to kill them. Rex asks if they are going to surrender, and Ahsoka says no, to which he responds that he doesn't see any other option. Ahsoka, studying the clones waiting in the hangar, notices something and tells Rex that she thinks she has a good idea. Handing Rex's helmet back to him, she kneels down and asks the droids if she can count on them, promising to explain her plan on the way. Ahsoka leads the way as they run out of the control room."}, {"tag": "p", "text": "A trooper tells Jesse that Maul is headed their way. Rex enters the hangar, holding Ahsoka at gunpoint and telling them to hold their fire. Rex tells Jesse he has the situation under control, but Jesse says he must follow orders, and if Rex doesn't, he will. Rex reasons that Order 66 was to execute the Jedi, but Ahsoka is no longer a Jedi. As the droids sneak past, Jesse says that Rex himself said Tano was to be executed by order of Darth Sidious. Rex attempts to appeal to his comradeship with Jesse, saying if they don't get this right, they will be the ones committing treason. Jesse does not fall for it, and accuses Rex of treason against the Grand Army of the Republic, saying he will be demoted and executed for assisting the traitor Ahsoka Tano. Turning to Ahsoka, Rex admits that he never much liked being a commander anyways. As Jesse orders his troops to take aim, the droids finish their work, and the hangar elevators drop suddenly, knocking out most of the troopers. Ahsoka runs forward and Force pushes Jesse into the hole, before Rex tosses her lightsabers back to her. As Ahsoka and Rex fight off the remaining clones, Maul enters the hangar and runs towards the shuttle. Ahsoka pursues Maul, but he pushes her into the pit, although G-G catches her with a grappling cable. Jesse and his troops wake up, and open fire on Ahsoka and the droids."}, {"tag": "p", "text": "Maul takes off in the shuttle, but Ahsoka climbs up and uses the Force to hold it in the hangar. Rex attempts to hold the other clones off, but R7 is shot and Rex is hit in the shoulder. Forced to choose between stopping Maul and saving Rex, Ahsoka reluctantly lets the shuttle go and Maul takes off into hyperspace. As the clones surround them, Ahsoka spins her lightsabers around, cutting a hole in the floor to the starship bay. Jesse orders his troops to blast them, but G-G and Cheep raise the elevators again, and are executed by the clones. The cruiser fully enters the atmosphere and the officer in charge orders the ship's retrorockets fired in order to try and control their descent, but a technician reports that they've lost lateral control and will break apart just as the bridge explodes, killing all the officers. Now completely out of control, the stricken Venator careens on a doomed crash course with the moon's surface."}, {"tag": "p", "text": "Finding a sole Y-wing bomber in working order, Ahsoka throws Rex onto the ship and attempts to leap on herself but the ship and Ahsoka fall out of the bay. Rex gains control of the ship and sees Ahsoka falling alongside him. She bounces off the falling wreckage and manages to grab on to the opened gunner's seat, pulling herself in. As the stricken capital ship sinks below the clouds, Ahsoka stares into the sky."}, {"tag": "p", "text": "Sometime later, the Venator is shown to have crashed onto the moon's surface, carving a great gouge in it. In front of the wreckage, Rex loads a shovel and some other supplies into the Y-wing, which also has the parts of R7 salvaged and stood next to it. He sees Ahsoka in the distance, wearing a cowl and standing before the helmet-marked graves of dozens of clone troopers, including Jesse. She holds up her lightsaber, prepared to leave it there in order to sell the deception that she too died in the crash. Though she shows great reluctance to do so, she eventually lets her erstwhile Jedi weapon drop from her hand and then stares at the graves and the wreckage with an expression of heartbreak."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "The Tribunal wreckage continues to lie where it crashed, eventually being covered in snow as time passes."}, {"tag": "p", "text": "Some years into the Imperial Era, Imperial stormtroopers, snowtroopers, and probe droids search the wreckage, as a Lambda-class T-4a shuttle lands near the crash site. The Dark Lord of the Sith, Darth Vader, disembarks from the shuttle ominously and walks across the icy fields. He kneels down and reaches through the snow, finding and igniting the lightsaber Ahsoka Tano left there. A convor cries above and Vader looks up to see it circling in the sky. Vader watches the bird for a moment, then takes the saber, turns, and walks away, reflected in the visor of a cracked helmet belonging to a clone trooper of Tano's specialized division of the 501st Legion until his reflection fades from view. The Clone Wars are over..."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Rex's kama disappears twice: first in the shot where Ahsoka exits the medical bay, and second in a long shot of him and Ahsoka during the hangar firefight."}, {"tag": "p", "text": "The episode begins right where the previous one ended: the clones trying to get through the sealed door of the medical bay. While the ending of \"Shattered\" showed several clones getting shot or stunned in front of the door before it was sealed, this episode begins with a shot of the corridor being completely clear of any corpses or other remnants. Considering the events continue from the very minute where they finished in the last episode, it is obvious that there was no time to clear the hallway — and the clones' behaviour means it makes no sense for them to have done so to such a degree."}, {"tag": "p", "text": "In the Ahsoka novel, a clone is buried in Rex's armor and a fake grave marker is made with an inscription claiming Ahsoka and Rex killed each other. In this episode, however, Rex leaves with his armor, and no inscribed grave markers are made. Additionally, the novel states that Ahsoka ignites her lightsabers one last time before leaving both of them, and that they are green; the episode shows Ahsoka only hesitating to drop one of her blue lightsabers. The novel also indicates that the grave site is on Mandalore, when in the episode the graves are on an unidentified moon. Finally, the novel has Ahsoka alone when she abandons her weapons, with Rex having already left. The episode has him still there, as it is indicated they must leave the moon together since they only have one starship."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}