{"url": "Vigil-class_corvette", "categories": ["Category:Legends articles", "Category:Corvette classes", "Category:Galactic Empire starship classes", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "Vigil-class corvette"}, {"tag": "p", "text": "The Vigil-class corvette was a warship in the Imperial Navy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Produced by Kuat Drive Yards for the Imperial Navy, the Vigil class was considered the smallest vessel in the iconic Star Destroyer line of ships."}, {"tag": "p", "text": "With a dagger-shaped hull, heavy armament, and relatively large crew complement for its class, the Vigil class shared many iconic design features of a true destroyer. The exception to this was the command deck, which sat flush with the hull to the aft over the main drive engines, giving the Vigil class a smaller silhouette and better protection than a tall and exposed command tower."}, {"tag": "p", "text": "For its primary armament, the Vigil class was true to its destroyer origins, carrying a trio of turret-mounted dual heavy turbolaser turrets on the dorsal hull that gave it an exceedingly heavy punch for its class. Further supplementing its armament were a trio of lighter turbolaser turrets, along with smaller anti-starfighter laser cannons."}, {"tag": "p", "text": "Thanks to their size and role, these ships rarely served in the line of battle with larger types of star destroyers. Instead they patrolled trade routes, escorted cruisers as picket ships, served as battlegroup leaders for small backwater fleets, operated as lone cruisers hunting pirates and smugglers, and generally served where a larger destroyer was deemed excessive or wasteful."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several Vigil-class corvettes were serviced at Naval Station Validusia. The corvettes patrolled trade routes, acted as battle group leaders in small fleets, and hunted pirates alone. They were also used as scoutcraft."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This corvette originated as a fanon vessel designed by Ansel Hsiao. Hsiao intended it to be a heavy corvette for escort, reconnaissance, and utility duties of the Galactic Empire."}, {"tag": "p", "text": "When approached by Lucas Licensing to provide artwork for The Essential Guide to Warfare, Hsiao submitted his own designs in addition to new models, along with their names. The names were recorded in Lucasfilm's Holocron continuity database, according to the artist. Jason Fry, one of the authors of the book, posted a series of endnotes to the book on his tumblr account. He forgot to record the length of the Vigil-class corvette in part 7 of this series, which detailed the other ships Hsiao designed, and so included it in part 8 as a quick note at the end."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}