{"url": "Vilia_Calimondra", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Sith Lords of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Vilia Calimondra"}, {"tag": "p", "text": "Vilia Calimondra was a female Human Sith Lord who lived during the Republic Dark Age."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Sith Warlord"}, {"tag": "p", "text": "Vilia Calimondra married multiple times, acquiring large territories in the Grumani sector and giving birth to seven children. However, all of her children made claims to become Calimondra's heir, so in order to decide which one would inherit her empire, she organized a contest, which she called the Charge Matrica, challenging her children to expand her territories. However, her daughter Xelian soon declared war on Calimondra's son Chagras, resulting in all of her children waging war against each other. Eventually, only Chagras was left, and Calimondra made him her heir. Chagras maintained a tenuous peace through the cooperation of several cousins and grandchildren. He also became the titular ruler of an empire known as the Chagras Hegemony. However, Vilia still lived and controlled some holdings."}, {"tag": "p", "text": "By 1042 BBY, Chagras was ready to challenge the Galactic Republic. In that year, Xelian's eldest son Sith Lord Odion convinced Vilia to authorize an invasion of Aquilaris Minor under the pretext of capturing the Jedi Knight Vannar Treece, a perennial foe of the Sith. However, the invasion was a cover of his own operation to capture several researchers from the University of Sanbra who were involved in a research project to locate the Helm of Ieldis, an ancient Sith artifact created by Ieldis that was capable of driving sentient beings into a homicidal frenzy. The researchers were then conscripted into a task force known as Project Pandemonium which was tasked with locating the Helm. In 1040 BBY, Chagras was killed after being exposed to a nerve toxin. Calimondra then initiated a second Charge Matrica, pitting her grandchildren against each other to fight for the right to become her heir."}, {"tag": "p", "text": "Vilia also employed several agents including Narsk Ka'hane, a Bothan spy, who officially worked as an independent operator for several Sith Lords. She also had an implant inserted into his head that enabled the Bothan to receive coded transmissions while doing fieldwork. At at unknown time prior to 1032 BBY, Vilia also provided him a Cyricept Personal Concealment System, Mark VI stealth suit with an embedded tracking device. Narsk treasured this state-of-the-art stealth suit which had been developed on Coruscant, the Republic capital, and smuggled through secret networks into Vilia's empire. The Mark IV stealth suit had also been specially modified by Vilia's technicians to enable her to track Narsk's whereabouts. While the suit was deactivated, it silently pinged the secret communications network Vilia had used to monitor her family."}, {"tag": "h3", "text": "Managing family politics"}, {"tag": "p", "text": "In c. 1032 BBY, Calimondra ordered her grandchildren Daiman and Odion to attack the holdings of the Quermian Sith Lord Ayanos Bactra, an old family friend whom Calimondra believed had outlived his usefulness to them. Following the conquest of the Bactranate, Calimondra subsequently convened a bequest with her grandchildren and divided among them various corporations that Bactra had formerly controlled. Xelian's older son Odion received control of the former Bactranate capital of Jutrand while her younger son Daiman gained control of Industrial Heuristics, which supplied military arsenal to the various Sith warlords. After Odion objected to the deal and threatened to kill the corporation's staff rather than let them fall into the hands of his estranged younger brother, Vilia offered him two of her legions of Trandoshan slave warriors. While this temporarily resolved the tensions between the two brothers, these would later resurface."}, {"tag": "p", "text": "During the same bequest, Vilia recognized her granddaughter Sith Lord Arkadia Calimondra's annexation of the former Dyarchy world of Byllura. The Dyarchy had been ruled by the adolescent twin siblings Quillan and Dromika, the two younger children of her deceased son Chagras. Despite his great Force powers of mind control and far sight, Quillan dwelled entirely within his mind and did not interact with the outside world, delegating those tasks to his sister Dromika and their late Regent Saaj Calician, who had been executed by Arkadianate forces during the invasion of Byllura. In the end, Arkadia offered to send Quillan to be tended by Vilia. She complied and then transmitted a set of hyperspace coordinates across a secure channel to her top secret retreat world."}, {"tag": "h3", "text": "Arkadia's Plot"}, {"tag": "p", "text": "Following the Bequest, Arkadia schemed to have her grandmother murdered, because she believed that Vilia was responsible for the death of her father, Chagras. As part of her plot, Arkadia arranged for someone to escort Quillan to Vilia's world and then kill Vilia. She tried to recruit her guest Jedi Knight Kerra Holt to carry out this assassination but the Jedi woman refused, affirming that she was a Jedi and did not work with the Sith. Arkadia was then forced to rely on the Bothan spy Narsk Ka'hane, who was secretly working for Vilia. Since the Bothan was not a Force-user and was untrained in lightsaber combat, Arkadia equipped him with a hoverchair fitted with the nerve toxin Chagras's Blood, which had been developed from Synedian algae. She also had a modified shuttle fitted with a hidden compartment in one of its engines to hide the Bothan."}, {"tag": "p", "text": "Through unknown means, Vilia learnt about Arkadia's plot and transmitted a signal to Narsk, ordering him to turn against his current employer Arkadia. In return for providing part of a hyperspace coordinate leading to neutral space, Narsk was able to recruit the Brigadier Jarrow Rusher and convince the mercenary to launch a diversionary attack that would enable him to escape with Quillan from the Arkadianate capital city of Calimondretta on icy Syned. Meanwhile, Narsk broke Kerra out of her prison and after convincing her to cooperate with Rusher's attack, he gave her the remaining half of the coordinates. The two launch a diversionary assault on Arkadia's forces and military assets on Calimondretta, causing extensive damage to her city and military fleet, which had been assembled for lightning blitz attacks on other Sith principalities in the event that her plot succeeded."}, {"tag": "p", "text": "Due to the damaged caused by the Siege of Calimondretta, Arkadia was forced to abort her expansionist ambitions of enlarging her empire. While her capital suffered extensive interior damage, Arkadia also lost significant military assets including several factories that manufactured shells containing the nerve toxin Chagras's Blood and several warships. Arkadia was forced to also recall reinforcements from Byllura to reinforce her capital and to invest substantial resources into rebuilding Calimondretta. Meanwhile, Narsk was able to escape Calimondretta with Quillan and reached Vilia's homeworld safely. Two of Vilia's other agents also spirited Dromika away from Byllura, bring her to another one of Vilia's worlds. While both twins were now in Vilia's custody, she made arrangements to keep them apart from each other and any opportunists who wanted to exploit their powers."}, {"tag": "h3", "text": "Dialogue in the Garden"}, {"tag": "p", "text": "After Narsk delivered a report on Dromika's status and the situation in the Arkadianate, the Bothan asked the Sith matriarch whether she had any role in the death of her son, Chagras. Vilia denied her involvement in the death of Arkadia's father by alleging that her granddaughter had a motive and means for murdering her father. Vilia portrayed Arkadia as ambitious younger daughter who feared that her father's legacy would go to younger, and more favored siblings. She also cited Arkadia's expertise in nerve toxins, the weapon that had brought the death of Chagras. Vilia surmised that anyone could also construct a case against Arkadia in the same way manner that they could build one against her. For the Calimondra family, shared illusions mattered as much as bloodlines in explaining the complex and fraught relationship between its various members."}, {"tag": "p", "text": "Narsk also expressed his concerns that he had freed the Jedi Knight Kerra and speculated that she would not leave Sith Space and thus pose a continual threat to the Sith. The Bothan feared that the Galactic Republic and Jedi Order could exploit Kerra's knowledge of the Calimondra family and the Charge Matrica in their war effort against the Grumani Sith. However, Vilia dismissed his concerns by arguing that the lack of a mass media in Sith Space inhibited the flow of this information to the general population. She added that the Republic's authorities were ineffective against the Sith even when they had good intelligence about their Sith opponents. Finally, Vilia surmised that Kerra remained the sole Jedi throughout the entire Grumani sector."}, {"tag": "p", "text": "When Narsk reiterated that Kerra could still pose a danger to her dynasty, Vilia described Kerra as an opportunity to give her grandchildren some \"learning experiences\" with dealing with Jedi in preparation for the day that the Sith would invade Republic territory and face the Jedi Order again. Vilia also justified her policy of sowing discord within her family as a defining basis of Sith identity. Finally, she remarked that Narsk could send her greetings to Arkadia if the opportunity arose that the two crossed paths again."}, {"tag": "h3", "text": "The Helm of Ieldis"}, {"tag": "p", "text": "By late 1032 BBY, Odion had recovered the Helm of Ieldis on Skarpos, a barren desert world in the Menagerie, the realm ruled by Lord Malakite. After testing the Helm on three Sith armies during the Second Battle of Skarpos, Odion returned to Vanahame and made preparations for launching a galactic apocalypse that would destroy all life except for himself. To attain such destructive powers, Odion planned to harness the life energies of the orphans residing in the local Odionate cloister, a planet-sized mega orphanage. Daiman and Malakite escaped Skarpos and managed to alert Vilia to the threat posed by Odion."}, {"tag": "p", "text": "During a conversation via hologram, Daiman explained to his grandmother that Odion was tampering with forces he did not understand. Since Odion's acquisition of the Helm challenged the balance of power within the Grumani Sector, Calimondra rallied her family to prepare for a military assault on the Odionate. She urged the disparate Sith Lords including Arkadia, Lioko, Malakite, and Trevayne to set aside their differences in order to stop Odion at all costs. While Vilia confided in Daiman that she thought Odion had always been differently guided, she admitted that she had gravely underestimated his nihilistic ambitions of galactic destruction. She added that no one should want to be the \"king of a graveyard\"."}, {"tag": "p", "text": "Vilia attempted to contact Odion and reason with him but he ignored her entreaties. Odion then activated the Helm, launching the entire Grumani sector into a homicidal frenzy. Even the Sith were not immune with several warships opening fire on each other and several Sith Lords like Daiman being forced to fend off their crew. However, Odion's plot failed due to the actions of Kerra Holt and his second-in-command General Beld Yulan, who had turned against his master's nihilistic ambitions and freed the captives from the cloister. Following the death of Odion, the former Odionate was divided up among the various members of the Calimondra family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vilia Calimondra makes her first appearance in John Jackson Miller's first professional novel, Knight Errant. Her name is an anagram of Livia, the mother of Tiberius."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}