{"url": "Vilosorian", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Mid Rim species", "Category:Shape-shifting species"], "nodes": [{"tag": "h1", "text": "Vilosorian"}, {"tag": "p", "text": "The Vilosorians were a sentient species native to the Mid Rim planet Vilosoria. Their bodies followed a seasonal cycle, metamorphosizing into powerful carnivores with the onset of the warm seasons. During the Galactic Civil War, the Vilosorians were able to repel the Imperial presence from their world with the intervention of Rebel agents who delayed Imperial reinforcements. Their homeworld was later within the territory of Imperial Admiral Treuten Teradoc's Greater Maldrood."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Vilosorians were a sentient species from the planet Vilosoria. Their physique matched the seasonal cycles of their homeworld; consequently, during the cold months of their year, they were docile and calm, but with the onset of the warm seasons, the Vilosorians metamorphosized into powerful carnivores."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Vilosorians evolved on the planet Vilosoria, located within the Lifh sector, a portion of the Mid Rim within The Slice. Their planet was situated between the Perlemian Trade Route and the Lesser Lantillian Route, within the general region of space being explored by the Galactic Republic during the Great Manifest Period, circa 20,000–15,000 BBY. During the Jedi Civil War, circa 3959 BBY, their planet fell within the territory controlled by Darth Revan's Sith Empire; however, they were within Republic space during the New Sith Wars of 1000 BBY. During the Clone Wars, Vilosoria fell within territory contested between the Republic and the separatist Confederacy of Independent Systems."}, {"tag": "h3", "text": "Galactic Empire and beyond"}, {"tag": "p", "text": "Following the Clone Wars, the Republic transitioned into the Galactic Empire. The Empire briefly invaded Vilosoria, establishing a garrison of troops on the planet, with support provided by the Immobilizer 418 cruiser Fireclaw. Prior to the Battle of Yavin, R2z-DL, an R2z Starship Maintenance Droid working as an agent of the Rebel Alliance, intercepted information on the Imperial supply lines in Lifh sector, along with the Fireclaw's patrol routes and maintenance record. R2z-DL passed this information on to Rebel agent Koedi Raef, together with information on the seasonal cycles of the Vilosorians. With that information, Raef coordinated a delay in the Fireclaw's arrival to the Vilosoria system with that of the planet's warm season. That provided an opportunity for the Vilosorians—then metamorphosized into their carnivorous form—to attack the local Imperial garrison and drive them offworld."}, {"tag": "p", "text": "Despite the Vilosorians' local success, Vilosoria remained within a zone of Imperial control from 4–8 ABY; known as the Greater Maldrood, the area was controlled by Imperial Admiral Treuten Teradoc, until he was defeated by the New Republic circa 9 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vilosorians were created by Chuck Truett for Cracken's Rebel Operatives, published by West End Games in 1994. They later received a mention in The Complete Star Wars Encyclopedia, published in 2008, which provided some new information not in the original source. In 2009, The Essential Atlas placed their homeworld and consequently provided further information on the general history of the species and planet."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}