{"url": "Vill_Goir", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Dark Side Elite", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Vill Goir"}, {"tag": "p", "text": "Vill Goir was a Human male Dark Side Adept in the service of the cloned Emperor Palpatine during the Galactic Civil War. A member of the Dark Side Elite, Goir was the organization's second-in-command, subordinate only to its leader, Military Executor Sedriss QL. In 10 ABY, Goir assisted Sedriss in the execution of the Imperial campaign called Operation Shadow Hand, participating in the failed subjugation effort of the planet Balmorra."}, {"tag": "p", "text": "Upon Palpatine's return in a new clone body, Goir was dispatched with Sedriss to the planet Ossus to confront Jedi Master Luke Skywalker and a defected member of the Dark Side Elite named Kam Solusar. Arriving on Ossus, Goir and Sedriss engaged the two Jedi, with Goir attempting to take on the turncoat Solusar. However, as Goir had previously taught Solusar all his lightsaber combat techniques while they served together, the darksider was outmatched by the Jedi and slain by him, sliced in half with a lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Servant of the Emperor"}, {"tag": "p", "text": "Vill Goir was a Human male Dark Side Adept in service to the Galactic Emperor Palpatine during the Galactic Civil War. The Emperor, reborn in a clone body after his death at the Battle of Endor in 4 ABY, ruled his clandestine Dark Empire from the Deep Core planet Byss. During this time, Palpatine solidified his power base by creating a cabal of powerful Dark Jedi—the Dark Side Elite. Consisting of exactly seven members at any given time, each personally empowered with the dark side of the Force by Palpatine, the cadre was led by Executor Sedriss QL."}, {"tag": "p", "text": "Goir was chosen to serve as Sedriss's substitute, assistant and overall second-in-command of the group. The Dark Side Elite was headquartered on the planet Vjun, inside Bast Castle, the former citadel of Palpatine's late apprentice, Darth Vader. While stationed there, Goir instructed one of the fellow Dark Jedi, Kam Solusar, in lightsaber combat."}, {"tag": "p", "text": "In 10 ABY, the Emperor met his demise once again in battle with Jedi Master Luke Skywalker and his sister, Leia Organa Solo, near the New Republic Pinnacle Base. Later that same year, Solusar defected from the Dark Side Elite, driven to the light side by Skywalker. While the Empire waited for Palpatine to return in another clone body, Sedriss proceeded with Operation Shadow Hand, a series of campaigns aimed at conquering neutral worlds that showed defiance to the Empire."}, {"tag": "h3", "text": "Battle of Balmorra"}, {"tag": "p", "text": "During one such campaign, Goir accompanied Sedriss to the factory world of Balmorra. After the latest death of Palpatine, Balmorra's Governor Hinch Beltane had started dealing with the New Republic, forcing Sedriss to intervene. Arriving aboard the Star Destroyer Avenger and joining an Imperial fleet stationed in orbit of Balmorra, Goir and fellow Dark Side Elite member Krdys Mordi served as Sedriss's sergeants-at-arms during the campaign."}, {"tag": "p", "text": "In this capacity, Goir witnessed as Sedriss contacted Beltane via viewscreen, demanding he place his factories under Imperial control and face execution for his treason, lest the Executor would completely annihilate Balmorra. Beltane refused to accept the terms, forcing Sedriss to launch a ground assault on the planet. Sedriss initially believed that he would have the upper hand, as he had the newest Imperial invention at his disposal, the cybernetic Shadow Droid starfighters. However, Beltane countered Sedriss's arsenal with his own newest creation, the mammoth X-1 Viper droids."}, {"tag": "p", "text": "Goir realized that Beltane had produced the droid model in secret, thus betraying Balmorra's agreements with the Empire. Outraged by such defiance, Goir called for Sedriss to order a planetary bombardment of Balmorra in retaliation. Mordi concurred with Goir, yet Sedriss did not heed his cohorts' advice. Marveled by the Vipers' capabilities, the Executor wanted to obtain the machines to supply the Imperial wartime needs. Negotiating a peace treaty with Beltane that granted the planet freedom in exchange for a contract to buy the droids, Goir, Sedriss, Mordi, and the rest of the Imperial forces left Balmorra."}, {"tag": "h3", "text": "Showdown on Ossus"}, {"tag": "p", "text": "The three darksiders were joined by other members of the Dark Side Elite, and they all arrived on Byss in I-7 Howlrunner starfighters There, Palpatine had already taken control of his final clone body, and he revealed himself to Sedriss and took control of the Empire once again. Shortly thereafter, an Imperial probe droid detected Skywalker and the defector Solusar on the planet Ossus—which had once served as the headquarters of the Jedi—where they were researching the history of the Jedi Order."}, {"tag": "p", "text": "Goir and Sedriss took a squad of dark troopers, specialized stormtroopers empowered with the dark side, and flew aboard the Imperial hunter Scourge One toward their confrontation with the Jedi. As Goir's team was landing on Ossus, Scourge One's sensors detected that Skywalker and Solusar were accompanied by a large group of humanoids armed with primitive weapons—the Ysanna tribe native to Ossus. Sedriss ordered Goir to unleash their dark trooper squad upon the primitives, but after a prolonged fight, the troopers were slain by the Jedi and the Ysanna."}, {"tag": "p", "text": "Noticing that Skywalker was weakened by the fight, Goir and Sedriss moved in to attack, utilizing Force choke against their adversaries, only for the Force attack to be blocked by Skywalker. Willing to capture the Jedi alive, Sedriss ordered Goir not to kill them but only slice off their fighting arms. Goir and Sedriss then ignited their lightsabers and charged at the Jedi. Goir attacked Solusar, intent on bringing the defector to justice. However, having learned all of Goir's lightsaber techniques back on Vjun, Solusar outmaneuvered the darksider and killed him by cleaving him in half across the torso. Sedriss himself was killed by the ancient Neti Jedi Ood Bnar, who had spent millennia in a tree-like hibernation state on Ossus."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After being notified of the deaths of Goir and Sedriss, Palpatine appointed his advisors Xecr Nist and Tedryn-Sha as their replacements, with Nist becoming the new Executor and Sha taking on Goir's position of second-in-command."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vill Goir was a Dark Side Adept who pledged his allegiance to Emperor Palpatine. He was considered to be the highest-ranking member of the Dark Side Elite after Sedriss QL, and he was unafraid to argue with the Executor and voice his opinion, believing in the necessity of the orbital bombardment of Balmorra."}, {"tag": "p", "text": "However, he respected his superior and demanded that the Jedi on Ossus address Sedriss by his full title. Goir intended to bring the defector Kam Solusar to justice, failing to realize that the latter knew all of his tricks and charging at him recklessly to his death. Goir was a light-skinned individual with a yellow glow in his eyes."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Immersed in the dark side of the Force, Vill Goir was a Dark Jedi and an extension of his Emperor's will. Goir knew how to perform certain dark side techniques, employing the Force choke ability against Luke Skywalker and Kam Solusar. He was adept at lightsaber combat, having instructed Solusar on Vjun. That fact later played against him, when Solusar used Goir's own tricks to best him."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Dressed in traditional garments of the Dark Side Elite, Goir wore black robes complete with a long cape, as well as heavy boots and gauntlets. In combat, Goir wielded a lightsaber. Like the rest of the Dark Side Elite, he piloted an I-7 Howlrunner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vill Goir debuted in the comic Dark Empire II 1, the first issue of the Star Wars: Dark Empire II series, written by Tom Veitch, illustrated Cam Kennedy, and published by Dark Horse Comics on December 20, 1994. He also appeared in the third issue, which featured his death. Goir was originally set to be introduced in Veitch's proposed short novel Lightsider, which would have taken place before the events of Dark Empire II. However, Lightsider was canceled and was never officially published."}, {"tag": "p", "text": "Goir also featured in the Dark Empire II audio drama, in which he was voiced by John Cygan. The audio drama differs slightly in the events pertaining to Goir. During the Battle of Balmorra, Goir is the only adviser accompanying Sedriss, with Mordi being absent from the scene. Goir is also significantly more outspoken regarding Sedriss's decision not to utilize planetary bombardment. The battle itself is also provoked by Beltane, who shoots at Sedriss's fleet with planetary artillery."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}