{"url": "Ben_Quadinaros", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured article nominations", "Category:Males", "Category:Podracers", "Category:Toong"], "nodes": [{"tag": "h1", "text": "Ben Quadinaros"}, {"tag": "p", "text": "Ben Quadinaros was an inexperienced Toong podracer pilot who raced on the amateur circuits before entering the Boonta Eve Classic podrace on the planet Tatooine in 32 BBY. He rented a BT310 quadra-Podracer for the competition, and prior to the race, he conversed with fellow racer Teemto Pagalies in the hangar of the Mos Espa Grand Arena. On the day of the race, Quadinaros waved to the cheering crowd as his name was announced by the race's commentator, Fodesinbeed Annodue; however, when the Hutt crime lord Jabba Desilijic Tiure signaled for the competition to begin, Quadinaros' vehicle stalled on the starting grid."}, {"tag": "p", "text": "The racer hammered his fists against his vehicle as a group of DUM-series pit droids attended to it, although to no avail. As the rest of the racers neared the end of their first lap, Quadinaros' engines finally ignited just as the vehicle's energy binders deactivated. The four engines thus flew free of the vehicle and exploded, leaving Quadinaros sat on the floor of the arena as other pilots raced past. Despite his embarrassing loss, Quadinaros persisted in podracing and was billed as the racer Sebulba's arch-nemesis on the poster The Sport's Greatest Rivalry during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Inexperienced entrant"}, {"tag": "p", "text": "Ben Quadinaros was a Toong male from the planet Tund in the Tund system who became a podracer. After racing on amateur circuits, he participated in the Boonta Eve Classic on the planet Tatooine, in the Grand Arena of the city Mos Espa. Despite being the least experienced racer taking part in the event, Quadinaros was rumored to be the one to watch. Prior to the race, Quadinaros spent time in the venue's hangar, where the BT310 quadra-Podracer that he had rented specially for the race was stored."}, {"tag": "p", "text": "While in the hangar, Quadinaros walked past the Dug racer Sebulba as the latter received a massage from the Twi'lek slaves Ann Gella and Tann Gella. After the pod of the human racer, Anakin Skywalker, was brought into the hangar, the Toong conversed with the Veknoid podracer Teemto Pagalies near the entrance to the building."}, {"tag": "p", "text": "As the setup for the race began, Quadinaros' podracer was pulled from the hangar to the starting line by a dewback. The racer stood amongst his competitors' vehicles and smiled and waved to the crowd as the race's Troig commentator, Fodesinbeed Annodue, listed him first while announcing the participants. Once the participants had been introduced, each of their flags were carried in procession across the starting grid, including Quadinaros' flag, which consisted of five separate thin triangular flags, the top two red, the bottom two orange, and the central flag yellow."}, {"tag": "h3", "text": "Engine trouble"}, {"tag": "p", "text": "On Annodue's command, Quadinaros and the other racers started their engines as the race track was cleared of non-participants. When the event's host, crime lord Jabba Desilijic Tiure, sounded the start of the race, Quadinaros' power couplings failed, which resulted in his engine malfunctioning and failing to ignite, causing the vehicle to stall. As other racers left the starting grid, Skywalker also encountered engine troubles, and as Annodue commented on the two racers stuck on the starting grid, four of the Toong's DUM-series pit droids raced out to aid him as he hammered his fists into the display screen of his podracer's cockpit."}, {"tag": "p", "text": "As the rest of the racers passed through the Canyon Dune Turn, Quadinaros' pit droids left his pod and returned to the side of the race track. Despite their intervention, the BT310 suffered total breakdown and the power couplings deactivated before more pit droids, aiming to avoid collisions, could arrive and move the vehicle away from the starting grid."}, {"tag": "p", "text": "The Toong cursed and continued to hammer on the podracer's display screen as the vehicle's energy binders switched off, meaning that when the vehicle's engine did suddenly ignite, all four of his engines detached from the vehicle's cockpit and flew off individually, exploding as they crashed into arena walls or the ground. Even as his pod slowly lowered to the ground, Quadinaros continued to curse and pound his fists into it until other racers reached the end of their first lap and rushed passed him, prompting the Toong to duck and cover his head with his arms. Ultimately, Skywalker won the race and left Tatooine to join the Jedi Order."}, {"tag": "h3", "text": "Later career"}, {"tag": "p", "text": "Despite his embarrassing loss at the Boonta Eve Classic, Quadinaros persevered with the sport and was eventually billed as Sebulba's greatest rival. During the Republic Era, a sporting poster titled The Sport's Greatest Rivalry was produced under the name Codenka Mafurias, which, according to artist Janyor of the planet Bith, was presumably the alias of an art workshop bankrolled by Marlo the Hutt. The poster depicted Quadinaros as an underdog with Sebulba as his arch-rival, showing the Toong racing in a BT310 quadra-Podracer across a rocky landscape."}, {"tag": "p", "text": "In 19 BBY, Skywalker, by then a Jedi Knight, had a copy of The Sport's Greatest Rivalry hung on the wall of his personal quarters in the Jedi Temple on the planet Coruscant. Later in the war, an altered version of the poster that only showed Quadinaros and his vehicle hung in a Galactic Republic clone trooper barrack in Fort Anaxes on the world of Anaxes. In 2 BBY, Jedi Padawan Ezra Bridger had the altered version of the poster on the wall of his cabin on the VCX-100 light freighter named the Ghost. Quadinaros was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ben Quadinaros was more comfortable on the amateur podracing circuits and was quite terrified of the Boonta Eve Classic, which he hoped would end a streak of bad luck. Despite Toongs being extremely timid by nature, he overcame his shyness to become a podracer and participate in the sport. The racer was short by Toong standards at 1.63 meters in height, but was the tallest entrant in the Boonta Eve Classic. He was innovative, pudgy, and comic-faced, with yellow skin and orange eyes. He had three antennas on top of his head and spoke in a language other than Galactic Basic Standard."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "At the time of the Boonta Eve Classic, Quadinaros was a largely inexperienced rookie podracer, but later came to be billed as rival to the famous podracer Sebulba."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ben Quadinaros wore a gray bodysuit while participating in the Boonta Eve Classic and used a hastily put together BT310 quadra-Podracer that he had rented specially for the race."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Star Wars canon"}, {"tag": "p", "text": "Ben Quadinaros was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. In the revised rough draft of the film's script, Quadinaros was not included amongst a list of the pilots participating in the podrace, with a Slide Paramita of Tund mentioned instead. Paramita was not used in the film, but was developed into a separate character for the 1999 Star Wars Legends video game Star Wars Episode I: Racer. In one of The Phantom Menace's deleted scenes, Quadinaros is shown referring to a datapad and checking his podracer cockpit's display screen as other racers start their engines. He then throws the datapad toward his engines and hammers his fists on the screen."}, {"tag": "p", "text": "Conceptual art for Quadinaros in The Phantom Menace was created by designers Terryl Whitlatch and Iain McCaig, with Whitlatch producing three pieces in 1996 showing the anatomy and range of movement for the character and McCaig producing two different costume concepts on May 21, 1997. In Whitlatch's pieces, the character was labeled \"Ben Cuvidoros,\" and in McCaig's, the labels named him \"Ben Quadidaros\". Quadinaros' final name was likely derived from the \"quadra-Pod\" racing engines of his vehicle. His name was misspelt as \"Quadiaros\" in the Databank entry for the Tund system on StarWars.com. In the 2016 reference book Star Wars: Complete Locations, Quadinaros' flag is erroneously listed as belonging to the racer Mawhonic, while Quadinaros is incorrectly shown to be using the flag that belongs to the racer Clegg Holdfast."}, {"tag": "p", "text": "During a featurette for the fourth season of the Star Wars: The Clone Wars television show, supervising director Dave Filoni asked lead designer Kilian Plunkett if he believed that Quadinaros should appear in the show, but Plunkett responded that there was no room for the character as they should leave some mystery to the racer. They then joked that perhaps the Boonta Eve Classic was the only race he ever lost and that they could make a documentary-style series on the character."}, {"tag": "h3", "text": "LEGO appearances"}, {"tag": "p", "text": "Quadinaros is featured in the LEGO Star Wars: The Freemaker Adventures episode \"Race on Tatooine,\" which aired on July 18, 2016. He was voiced by Dee Bradley Baker speaking an alien language. In the episode, Quadinaros helps the Hutt crime lord Graballa lure the Freemaker family into a trap on Tatooine after the criminal threatens to snap his antenna off. The podracer contacts the family to hire them as a replacement pit crew and claims that his usual crew have caught sand rot. The three Freemaker siblings accept and travel to Tatooine to work on a decoy podracer they believe belongs to the Toong. Quadinaros then introduces them to his \"sponsor,\" revealing Graballa with several of the Hutt's henchmen. The Freemakers realize that Quadinaros has betrayed them, but Graballa explains that the Toong did not do so willingly and dismisses him."}, {"tag": "p", "text": "Quadinaros then participates in the 29th Annual Bricklayers' Classic at the Mos Espa Grand Arena and manages to reach first place by the third lap; however, the Freemakers catch up with him, having escaped Graballa's clutches in the decoy podracer they had been working on. The family crashes into Quadinaros' podracer and causes his engines to separate from his cockpit, leaving him in the dust as they fly on to win the race."}, {"tag": "p", "text": "Quadinaros also appears in LEGO Star Wars: Droid Tales, a series retelling the events of each of original trilogy and prequel trilogy films. The first episode, \"Exit from Endor,\" aired on July 6, 2015. In it, Quadrinaros is shown in C-3PO's retelling of The Phantom Menace; however, his podracer explodes immediately on the starting grid before the Boonta Eve Classic even begins. \"Gambit on Geonosis,\" the final episode of the series, aired on November 2, 2015. It featured a retelling of the 1983 film Star Wars: Episode VI Return of the Jedi, in which Quadinaros is one of several allies that join Luke Skywalker and his friends in fighting Jabba during the skirmish at the Great Pit of Carkoon on Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}