{"url": "Vik_Idd", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Vik Idd"}, {"tag": "p", "text": "Vik Idd was a Human male who worked alongside his sister Nikki and father Lonn in the business of droid repair during the Imperial Period. Circa 15 BBY, Idd and his sister collected a pair of master-less droids on the planet Dodz, the protocol droid C-3PO and the damaged astromech droid R2-D2. Idd decided to place the droids under his and his sister's stewardship."}, {"tag": "p", "text": "Upon returning to their father's repair station, Idd and his sister discovered that the gangster Tig Fromm was making demands of their father, specifically that a laser weapon be installed on Fromm's starship. Although Nikki was captured early, Idd and his two new droid acquisitions antagonized Fromm's men, at first in vain as the young Human ultimately fell into Fromm's custody as well. The family was ultimately saved by C-3PO, who disguised himself as an HK Guardian Droid to ward off Fromm. The droids were then placed in the hands of Intergalactic Droid Agency to find new masters."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Let 'em in"}, {"tag": "p", "text": "Vik Idd was a Human male member of a family that ran a droid repair business. Based out of a repair station and overseen by their father, the engineer Lonn Idd, Vik Idd and his sister Nikki Idd were charged with piloting an Intergalactic Droid Agency shuttle, collecting droids from far-flung planets. Lonn would then repair the units, and his children marveled at his skills in both fixing and designing droids."}, {"tag": "p", "text": "After a stop-off on Dodz circa 15 BBY, where the damaged astromech droid R2-D2 and his counterpart C-3PO were picked up, Vik Idd and his sister set a course for the repair station. In transit, a fight broke out between the Dodz acquisition and the other droids on the ship, causing consternation from the young pilots. Idd issued a stern warning to the droids to cease hostilities, lest he deactivate all of them. A droid who was grappling with C-3PO summarily released the protocol droid, knocking him into the volatile R2-D2. Sparks began to stream from the astromech, and Idd instructed his sister to secure the unit with an energy shield before the discharge could damage their systems and persons. Nikki did so, averting the crisis, and keeping the R2 unit stable at least until Lonn could examine him."}, {"tag": "p", "text": "Idd and his sister assured C-3PO that their father would be able to repair the damaged astromech, but the protocol droid nevertheless lamented the fact that they were without a master. To raise C-3PO's spirits, Idd offered that he and his sister could serve as their masters until R2-D2 was repaired, an offer that the protocol droid gladly accepted. Idd, however, had no real application for the droid at the time, and conjured up the fictional role of \"landing security,\" in which C-3PO was required to secure the other droids in preparation for the shuttle's arrival at the repair station."}, {"tag": "p", "text": "As the siblings brought the shuttle into landing on the repair station, they noted the curious absence of their father from the docking bay. The Idds then noticed an imposing ship in the bay, prompting concern from the pair. Nikki instructed Idd to send the droids they had recovered to their assigned repair stations, while she would attempt to determine what had detained Lonn. Idd set about his business, taking the droids to the pertinent areas, accompanied by C-3PO and R2-D2. As he finished his task, the supply shed communications monitor was activated, showing notorious gangster Tig Fromm and his associate Vlix Oncard, both of the Fromm Gang, terrorizing Lonn and Nikki. In particular, Fromm demanded that Lonn install a powerful laser on his starship, the imposing craft that the Idds had noticed earlier. Vik Idd correctly determined that Nikki had activated the communications monitor to warn him—together with the droids he decided that they should leave the supply shed before Fromm's men found them."}, {"tag": "h3", "text": "Must do something about it"}, {"tag": "p", "text": "Idd ventured back through the hangar with R2-D2 and C-3PO, and hid in an old parts storage room. While there, the protocol droid identified an HK Guardian Droid, an outmoded model that was impervious to blaster fire. Idd was uninterested by the development however, and was intent on finding a way to rescue his father and sister. R2-D2 suggested that they engage Fromm and his men directly—the young Human agreed, but as his father had enforced a \"no weapons\" policy aboard the repair station, he felt ill-equipped to handle Fromm's thugs. R2-D2 nonetheless asserted that he could be utilized as a weapon, given his currently volatile nature, if the energy shield inserted into him by Nikki earlier were removed."}, {"tag": "p", "text": "Putting the plan into action, Idd watched from afar as C-3PO and R2-D2 approached the area where Nikki was being held. The protocol droid confronted two of Fromm's men, removing the energy shield from R2-D2—the resultant energy emitted by the astromech droid distracted the thugs long enough to allow Idd to slip past and liberate his sister. The two children were soon cornered by one of Fromm's hover guards, who responded to the thugs' protestations by blasting R2-D2. Fromm's men, leaving the two droids behind, then took Idd and his sister to the hangar, where Lonn was finishing his work on Fromm's ship. Idd's father demanded that the gangster leave his family alone, but Fromm was not interested, instead declaring his intentions to test the weapon on the repair station."}, {"tag": "p", "text": "At that moment, what appeared to be the HK Guardian Droid emerged. Lonn queried as to from where the droid had come—Idd was unsure until he spotted that the HK was shaking at the knees, and he correctly assumed that it was none other than C-3PO in disguise. Fromm, identifying the droid as a rare unit, demanded possession of the HK's control disk, and Idd, sensing an opportunity to gain an upper hand, obliged by asking his sister to hand \"it\" over. The device was in fact Nikki's disk-shaped Nova Starlight perfume dispenser, which she quickly discharged into Fromm's face, while Idd urged the disguised C-3PO on. The protocol droid was beset by the hover guards at first, but was ultimately able to bat them aside with his armored arms. As C-3PO cornered the gangsters with his imposing form, Idd dropped a packing net on them, restraining Fromm and his men."}, {"tag": "p", "text": "Idd then revealed the \"HK\" ruse and unveiled C-3PO within the droid armor. The protocol droid had other priorities however, remembering that R2-D2 had been badly damaged by the hover guard earlier. The Idds attended to the ailing astromech, and Lonn was able to restore him to full functionality. The engineer then offered to have his children fly the two droids to the nearest Intergalactic Droid Agency to serve new masters. Idd and his sister obliged, the droids ultimately passing through the IDA and into the service of Ambassador Zell of Majoor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vik Idd would despair when things did not go according to plan, such as having to deal with a fight between droids awaiting repair on his family's shuttle as they were beginning their final approach to their father's repair station. He was not afraid to raise his tone to the droids of whom he was charged with taking care, and could issue instructions to his sister in times of crisis. Idd was also compassionate towards the plight of droids, in the case of C-3PO who struggled with the concept of serving no master. Vik Idd could also see through ruses such as that of C-3PO disguised as an HK Guardian Droid, and he was able to adapt quickly in a situation of crisis, turning the tables on gangsters Tig Fromm and Vlix Oncard with his initiative. Idd took umbrage at the activities partaken by female members of his species, such as his sister Nikki's usage of perfume."}, {"tag": "h2", "text": "Appearance, attire, and equipment"}, {"tag": "p", "text": "The blond-haired Vik Idd wore a pink jumpsuit much like his sister when flying the transit shuttle, and also donned a headset. His eyes had black pupils, and he had light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vik Idd first appeared in the 1986 comic Droids 2, written by David Manak and penciled by John Romita. The character was not directly referenced again in the Star Wars Expanded Universe until the StarWars.com blog entry \"The Droids Re-Animated, Part 1\" by Abel G. Peña and Rich Handley in 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}