{"url": "Vil_Sembian", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alliance to Restore the Republic members", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Vil Sembian"}, {"tag": "p", "text": "Vil Sembian was a male Twi'lek who lived during the time of the Galactic Civil War. He was the son of Daw Sembian, a famous weaponsmith who left him his schematic for a new type of blaster which could tip the scales in the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vil Sembian was the son of Daw Sembian, a famous weaponsmith. Daw died some time prior to the Battle of Yavin and left his son his schematic for a new type of blaster which could tip the scales in favor of the Rebel Alliance. Circa 1 ABY, Vil Sembian headed to Anchorhead on Tatooine to deliver the schematics to his friend, a Rebel captain named Nitra Vendallan."}, {"tag": "p", "text": "However, the Galactic Empire was on his tail, so Nitra Vendallan sent a Rebel spacer to find Sembian and bring him back safely to town. The spacer fought several scout trooper and Viper probe droid to protect Sembian. Despite facing resistance from Imperial forces, the spacer succeeded in escorting Sembian. Vil Vendallan was pleased, and saw to it that the schematic made it to Alliance High Command."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vil Sembian was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "Because Vil Sembian spawned under the generic \"commoner_twilek_male\" template, his appearance was randomized under one of six possible male Twi'lek depictions. A known screenshot of Vil Sembian exists, depicting him as a randomly generated male Aqualish. It should be noted however, that this was a screenshot taken from one of two defunct Japanese servers, which used different character templates for some of its NPCs. Because the United States and European servers consistently used the \"commoner_twilek_male\" template, this article assumes that one of the six male Twi'lek depictions is canon in the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}