{"url": "Viidaav_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Wookieepedia Featured articles under probation", "Category:Mid Rim species", "Category:Viidaavs"], "nodes": [{"tag": "h1", "text": "Viidaav  (species)"}, {"tag": "p", "text": "The Viidaav, or Viidaavs, were a species of sentient humanoids with green or orange skin and angular projections growing from their heads. They were thin beings with large, expressive eyes and three-fingered hands. The Viidaavs hailed from the eponymous planet Viidaav, where many of them worked as miners, shipbuilders, and soldiers."}, {"tag": "p", "text": "During the Clone Wars, the Viidaavs allied with the Confederacy of Independent Systems. Clone troopers from the Galactic Republic attacked their homeworld, sparking a battle on the planet. The natives resisted the Republic troops, but were eventually driven back to defending a small mining array. The Viidaavs were preparing to retreat when Separatist leader Count Dooku ordered his battle droids to detonate mining charges set within the planet's crust. A lone Viidaav commander managed to defuse the explosives seconds before they exploded."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Viidaavs (or Viidaav) were sentient bipeds with green or orange skin and lithe, humanoid bodies. Their feet had two large toes, and their hands had three thick fingers with nails. The average Viidaav stood about the same height as Galactic Republic clone troopers, a group who were 1.83 meters tall."}, {"tag": "p", "text": "The Viidaav head was covered in thick, square-like projections. They had large, red eyes under an expressive brow, and white teeth behind thick, green lips. Their prominent cheekbones framed small, round ears on the sides of the head. Members of the species had no visible nose."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The species lived on the planet Viidaav, located in the Viidaav system. Their population centers were situated near large outcrops of stone and had only small numbers of settlers. By the time of the Clone Wars, they had access to galactic-standard technology, including macrobinoculars and blaster rifles. At least some members of the species worked as miners, and the Viidaav operated at least one mining colony on their homeworld's surface. There, they used mining charges under the planetary crust to help excavate valuable materials. Other Viidaavs worked as starshipwrights and soldiers."}, {"tag": "p", "text": "During the Clone Wars, Viidaav soldiers wore uniforms that consisted of a brown baldric over the left shoulder, brown boots, a brown loincloth, and brown wraps around the forearms. Soldiers bore a colored stripe on the chin, and at least one commander wore white face paint around the eyes and the center of the forehead. Meanwhile, Viidaav civilians wore clothing standard to other members of the galactic community."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Viidaavs evolved on the planet named for them, which was located in the Bryx sector of the Mid Rim. They spread across their homeworld and founded at least one colony on the planet, which was used for mining. As part of mining operations, the Viidaav colonists set explosive charges into the planetary crust for help in the excavation of raw materials. The species also set up a shipbuilding industry on the world."}, {"tag": "p", "text": "Their planet lay in a region of space known as the Slice, which first came to the attention of beings from another world by 15,000 BBY. In the Jedi Civil War of 3959 to 3956 BBY, Viidaav fell within the sphere of influence of the Sith Lord Darth Revan's Sith Empire."}, {"tag": "p", "text": "At some point during the Separatist Crisis and subsequent Clone Wars, the Viidaavs sided with the Confederacy of Independent Systems rather than the Galactic Republic. In the early days of hostilities between the factions, the Viidaavs provided starships to the Confederacy while the Separatists sent armies of battle droids and helped set up a base and command center in a mining colony. During the same period, three Viidaavs served as wait staff for Separatist-sympathizer Bezz Drexx at a tower on the galactic capital of Coruscant."}, {"tag": "h3", "text": "Battle on Viidaav"}, {"tag": "p", "text": "After Republic scouts found the Separatist base on Viidaav in the year 20 BBY, clone troopers attacked the world, and a battle began. The natives and their droid allies resisted, but the Republic landed most of its available forces and moved ever closer toward the Viidaav mining colony. There, Viidaav soldiers were reduced to a few hundred thousand troops concentrated around the defense of a small mining array in a bunker. With the Republic poised to take the array and the world, the Viidaavs prepared to evacuate the planet."}, {"tag": "p", "text": "Any retreat had to rely on spacecraft of Viidaav manufacture, but too few remained for a full evacuation. Meanwhile, the Confederate leader, Count Dooku, was secretly plotting to take out large numbers of Republic clone troopers, but the plan relied on a sizable loss of Viidaav lives as well and would leave the planet's surface uninhabitable: Dooku ordered his battle droids to surreptitiously set the mining charges in the planet's crust to destruct, and he left the Viidaav forces to fight on to keep the Republic forces engaged until the explosives went off."}, {"tag": "p", "text": "The battle droids set the charges and initiated the bunker's defense systems to slow down attempts to disable it. The Viidaavs recognized that they had been tricked and sent a unit to diffuse the explosives. At the same time, a unit of clone troopers approached the bunker, and the two sides exchanged fire and suffered heavy casualties. Eventually, only a single member remained on both sides: the Viidaav commander and the clone commander. Both entered the mining array from different entrances. The enemies fought through the bunker's defenses, met in the computer room, and leveled their weapons at one another; the computer steadily counted down. With three seconds remaining, the Viidaav commander fired his weapon and was shot dead. Only then did the clone realize that the green-skinned warrior had only intended to shoot the computer. At any rate, the computer was destroyed, the explosives deactivated, and the battle finished."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "After the Galactic Empire splintered following the Battle of Endor in 4 ABY, the Viidaavs and their homeworld came under the domain of an Imperial Remnant territory known as the Greater Maldrood, a situation that persisted at least until 8 ABY. By 137 ABY, their world was within the confines of Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Viidaavs appear in \"Heroes on Both Sides,\" a story first published in the 2006 comic book Star Wars: Clone Wars Adventures Volume 5. The story was written by Chris Avellone and illustrated by Stewart McKenny and Dan Jackson. The comic leaves it vague whether the world depicted is the Viidaav homeworld or a colony. However, the 2008 book The Complete Star Wars Encyclopedia clarifies the matter, giving the name \"Viidaav\" to both the species and the planet depicted in the story. The 2009 source The Essential Atlas places the world in the Mid Rim. Viidaav characters also appear in the 2007 McKenney story \"Spy Girls,\" part of the comic book Star Wars: Clone Wars Adventures Volume 7."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}