{"url": "Vindoo_Barvel", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Aces", "Category:Humans", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vindoo Barvel"}, {"tag": "p", "text": "Vindoo Barvel, also known by the moniker \"The Shooter,\" was an Imperial starfighter ace and one of the most decorated TIE pilots in the Imperial Navy. Barvel, a Human male, served in the Republic Navy during the Clone Wars, where he quickly became an ace. Following the Declaration of a New Order in 19 BBY, Barvel became a recruiter for the Imperial Navy, where he played on his reputation as one of the galaxy's best pilots to attract recruits. Barvel also served as the head of the pilot school at Imperial City Naval Base. At one point, Barvel flew against Darth Vader in a training exercise with powered-down lasers. Though he was considered one of the galaxy's best pilots, Barvel proved no match for Vader, who shot him down."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Vindoo Barvel fought in the Clone Wars on the side of the Galactic Republic. Flying with the Republic Navy, he was known as one of the best pilots on the Republic's side. Barvel, nicknamed \"The Shooter,\" had over thirty confirmed kills, and at least that number in probables and kills he did not report."}, {"tag": "p", "text": "Following the end of the war and creation of the Galactic Empire in 19 BBY, Barvel continued to serve in the Navy, now under the Empire. However, he was pulled out of active duty, and became a recruiter for the Empire. Barvel, with his reputation as one of the best pilots in the Imperial Navy, was considered a hero by many. He was also placed in charge of pilot training school at Imperial City Naval Base, where he mentored recruits like Villian Dance."}, {"tag": "p", "text": "At some point prior to 2 BBY, Colonel Barvel was flying in a training exercise using powered-down fighters with several pilots when Darth Vader arrived. An elite pilot himself, Vader requested a TIE Fighter to fly alongside the others and test his skill. After just seconds, he had eliminated all the other pilots save for Barvel. Vader flew behind Barvel, matching him maneuver for maneuver. Though Vader was unable to shoot down Barvel immediately, it was quickly apparent to the watchers that the Dark Lord was merely toying with Barvel—a fact made evident when Vader simply swooped down behind Barvel and shot him down, ending the exercise before the ace could react."}, {"tag": "p", "text": "Sometime following the Battle of Yavin, Barvel took part in a skirmish against at least one Rebel pilot. Though defeated in the fight, the Imperial pilot managed to escape in his crippled TIE Fighter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vil Dance and numerous other pilots considered Barvel to be one of the best, if not the best, TIE pilots in the Imperial Navy. He was able to shoot down over sixty enemy ships in the Clone Wars, earning him the rank of ace twelve times over. However, when he flew with Darth Vader, Barvel was outmatched and beaten relatively easily. Barvel had brown hair, brown eyes and light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vindoo Barvel was created for the 2007 novel Death Star, written by Michael Reaves and Steve Perry, in which he was mentioned by Villian Dance, one of the primary protagonists, as an expert pilot. Barvel, in his TIE Fighter, would reappear in canon when he was added to the video game Star Wars Galaxies in Game Update 20 as one of various, randomly-generated \"elite pilots\" whom the player, as a Rebel character, can fight in a Tier 7 Duty Mission. A message indicates that the player successfully defeated Barvel once vanquished. The player then receives a collection icon for the feat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}