{"url": "Vindicator-class_heavy_cruiser", "categories": ["Category:Canon articles", "Category:Galactic Empire starship classes", "Category:Heavy cruiser classes"], "nodes": [{"tag": "h1", "text": "Vindicator-class heavy cruiser"}, {"tag": "p", "text": "The Vindicator-class heavy cruiser, alternatively known as the Vindicator-class cruiser, was a class of heavy cruiser deployed by the Galactic Empire's Imperial Navy during its reign. One heavy cruiser served as system security for Ord Cestus."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Vindicator-class heavy cruiser was similar to the smaller Surveyor-class reconnaissance frigate in that they had a thin, dagger-shaped hull, although the Vindicator-class cruiser had a command tower while the frigate did not. It could hold a complement of a contingent of TIE fighters that were larger than a flight."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Vindicator-class heavy cruiser saw action during the Galactic Civil War, with one vessel of the class providing the only naval security for the planet Ord Cestus, which hosted a sprawling Imperial base. The ship's crew monitored system traffic, and was on alert for known smugglers and Rebel Alliance sympathizers. Despite this, its capabilities were limited, even with the low level of traffic that the system received, and watches were a task deemed tedious by its crew. Unless an incoming starship's transponder signal activated immediate warnings or is clearly hostile, the Vindicator-class heavy cruiser's crew did not take action."}, {"tag": "p", "text": "The cruiser that patrolled Ord Cestus was fully stocked with TIE fighters, of which a flight would be launched if a vessel was suspicious according to standard procedure. Similarly, if the Imperial base on the surface requested reinforcements, the heavy cruiser's fighter complement were the most significant military asset readily available for support."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vindicator-class heavy cruiser was first mentioned in the 2016 Fantasy Flight Games Star Wars Roleplaying sourcebook, Lead by Example, where it was only known as the Vindicator-class cruiser. It was identified as the Vindicator-class heavy cruiser in the 2016 sourcebook Forged in Battle of the same roleplaying game by Fantasy Flight Games."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}