{"url": "Vin_Northal/Legends", "categories": ["Category:Legends articles", "Category:Alliance Special Forces personnel", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Imperial defectors", "Category:Infiltrators", "Category:Males", "Category:Royal Guard", "Category:Stormtrooper officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Vin Northal"}, {"tag": "p", "text": "Vin Northal was a member of the Emperor's Royal Guard who defected to the Rebel Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Vin Northal was born around the time Palpatine was elected as Supreme Chancellor, to parents who were already passionate supporters of the future Emperor's ambitions for the Galactic Republic. As a teenager in the Empire's early years, he grew up believing that the New Order existed to create peace and prosperity throughout the galaxy, and excelled in the COMPNOR-sponsored SAGEducation program where he was a wegsphere champion at the age of fourteen. His achievements earned the attention of a recruiter for CompForce, and he was offered a chance to join the unit. Northal turned them down and applied to the Imperial Academy. He was accepted and graduated at the top of his class, setting a new goal for cadets in the process."}, {"tag": "h3", "text": "Military career"}, {"tag": "p", "text": "Northal graduated as an officer in the Imperial Army, and his abilities earned him the right to special forces training. He was assigned to the command of one of the Empire's best squad commanders, Crix Madine. After two years, Northal gained his own command, and shortly after that was selected for stormtrooper officer training while also doubling as an infiltration instructor. He graduated with command of his own squad. A year later, Northal was invited to join the Emperor's Royal Guard where his skills were honed and sharpened. As a Guardsman, Northal protected the Emperor, suppressed protests, and fought the growing Rebellion on the front lines. During his customary rotation with a stormtrooper unit, he participated in the pacification of the planet Meastrinnar. The Imperial Security Bureau relayed intelligence that a Rebel cell had been located in the city of Vondrel. Northal led his squad to the target building where they proceeded to terminate all occupants with no resistance. Only after did he find out that the building they raided was an orphanage. The ISB transmission had been incorrectly decoded. The Rebels were in the sister city on Vondrol. Northal's unit had massacred dozens of sleeping children."}, {"tag": "p", "text": "Despite the mistake, Northal's superiors considered the mission a victory and media networks made no mention of the true outcome of the mission. Struggling to reconcile his ideals with the reality of the Imperial regime, Northal used his security access to review battle records and captured Alliance documentation to see if other stories of Imperial atrocities were true. After investigating, he decided to defect to the Rebel Alliance. Allowing himself to be captured on his next mission, he requested political asylum. His former commander, Crix Madine, was now a general in the Alliance Military and vouched for Northal. While Madine's faith in Northal was enough for Mon Mothma, General Airen Cracken remained distrustful of Northal until he saved the entirety of the Alliance Advisory Council on Hythrope IV by singlehandedly taking out a repulsortank and thirty stormtroopers."}, {"tag": "p", "text": "Attaining the rank of colonel, Vin Northal served the Alliance as an infiltration and retrieval specialist using his knowledge of Imperial procedure and his own training to complete missions often through impossible. Insisting on front line service, Northal commanded several Special Forces missions and trained Infiltrators in his spare time."}, {"tag": "h2", "text": "Personality"}, {"tag": "p", "text": "Northal was a deeply conflicted individual whose whole world was shattered after the raid on Meastrinnar. Before that raid he was completely loyal and dedicated to both the New Order and the Empire, believing in the propaganda that they were bringing peace to the galaxy. He realized in horror that the cover up on Meastrinnar meant that the rumors of Imperial atrocities were true and research confirmed his suspicions. In the end he realized that if he wanted to help bring about a peaceful and prosperous society he would have to switch sides and join the Alliance. He was a committed fighter and insisted to be put on the front lines in the fight against the Empire."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a former Royal Guard, Northal was an incredibly skilled combatant who was well trained in combat techniques, tactics and commando operations. He was also highly trained in demolitions which proved very useful on his commando raids."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Northal carried a blaster pistol and a blaster rifle, nine grenades, two throwing knives and a force pike. He had a survival pack, comlink, a datapad, two BioTech FastFlesh medpacs, a restraining bolt, a restraining bolt deactivator, lockpicks and a lectroticker. He also wore camouflaged clothing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vin Northal was designed by David R. Tulo for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Doug Shuler."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}