{"url": "Vinsoth/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Empire-in-exile planets", "Category:Galactic Alliance planets", "Category:Galactic Republic planets", "Category:Quelli sector planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Vinsoth locations", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Vinsoth"}, {"tag": "p", "text": "Vinsoth was the home planet of the Chevin and Chev species in the Quelii sector of the Outer Rim Territories. It was a temperate planet with zones of grasslands and prairies, arctic ice, and deserts."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Chevin had a skin that could adapt to all three environments. In 3,000,000 BBY, an asteroid collided with the planet, killing most life on its surface, but the remaining survivors evolved into the Chevin. The Chevin were nomadic pastoralists, following herds of the native grazing backshin and keeping their Chev slaves in small farming and manufacturing villages. The planet was composed of seven continents, each ruled by a Chevin dictator who remained stationary, while the rest of the Chevin migrated."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, Vinsoth was located within Separatist space."}, {"tag": "p", "text": "After the Battle of Endor, Ephant Mon established a Force-cult Temple on the planet and advocated Chev liberation. During the Yuuzhan Vong War, Vinsoth was conquered by the invaders at the beginning of the conflict.\nAfter the Yuuzhan Vong War, many Chevins favored abolishing slavery and joining the Galactic Federation of Free Alliances. However, they had to form secret societies, as they were persecuted as traitors by the local dictators, who sent assassins after them."}, {"tag": "p", "text": "During the Second Imperial Civil War, Vinsoth was contained within the boundaries of the Fel Empire. During the war, however, Vinsoth was lost to Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}