{"url": "Vir_Aphshire", "categories": ["Category:Canon articles", "Category:Planets"], "nodes": [{"tag": "h1", "text": "Vir Aphshire"}, {"tag": "p", "text": "Vir Aphshire was a planet with honey fields and orchards. Around 0 BBY, the Rebel Alliance's 61st Mobile Infantry drove the Galactic Empire's forces from the orchards and hives. After, the rebel Sergeant Fektrin scouted a settlement on Vir Aphshire and had Private Hazram Namir pass his report on to Captain Micha Evon. Upon receiving the report, Evon spoke with Namir about the private's accomplishments and the vision of the 61st."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vir Aphshire was a planet home to honey fields, orchards and hives. At least one settlement was established on the world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 0 BBY, the Rebel Alliance's 61st Mobile Infantry fought the Galactic Empire's forces on Vir Aphshire. During the fighting, rebel soldiers fighting from a trench received news that the Empire's DS-1 Death Star Mobile Battle Station had been destroyed. The soldiers cheered upon the announcement. The next day, the 61st took control of the orchards and what was left of the hives, which the Empire's forces had decided to burn before they fled."}, {"tag": "p", "text": "The evening after the 61st's victory, Sergeant Fektrin finished scouting out a settlement and gave his report to Private Hazram Namir to pass onto Captain Micha Evon, the 61st's commanding officer. After Evon received the report from Namir, he spoke about the private's accomplishments in his two months in the 61st. The captain then asked of Namir's thoughts on what the 61st could do in the company's remaining time on Vir Aphshire. Namir suggested pillaging the settlement Fektrin had scouted, but Evon advised the private that the 61st was trying to win the hearts of the people."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vir Aphshire appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}