{"url": "Viper_Sensor_Intelligence_Systems", "categories": ["Category:Legends articles", "Category:Droid manufacturers", "Category:Techno Union corporations"], "nodes": [{"tag": "h1", "text": "Viper Sensor Intelligence Systems"}, {"tag": "p", "text": "Viper Sensor Intelligence Systems (VSIS) was a droid manufacturer based on the planet Vulpter. Shortly before the Clone Wars, it was embroiled in a sensor technology dispute with rival Arakyd Industries that was resolved when the latter absorbed VSIS in a hostile takeover. Arakyd kept the company in operation as a research-and-development division, incorporating proprietary VSIS technology into its highly successful Viper probe droid."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Viper Sensor Intelligence Systems was a droid manufacturer based in Viper Tower, a facility located in the planet Vulpter's city of Hpaq. It was a smaller and younger firm than Arakyd Industries. The company was led by President Rina Fio until she was ousted by Arakyd during its takeover of VSIS, who kept the company in operation as a research and development division. It employed at least one member of the Vulptereen species."}, {"tag": "p", "text": "VSIS' logo was an inverted green triangle with rounded edges, containing a white trapezoid interlocked with a smaller blue triangle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Separatist Crisis, Viper Sensor Intelligence Systems was embroiled in an 18-month dispute with rival Arakyd Industries. The latter asserted that Viper's XPLR-R, a prototype hyperspace-route-mapping and habitation-location unit, borrowed heavily from the proprietary designs of Arakyd's line of probe droid and demanded aggressive remuneration and technology rights of the younger firm. However, VSIS was so focused on perfecting the XPLR-R's advanced sensor analysis that it ignored its needs in corporate defense."}, {"tag": "p", "text": "Shortly before the outbreak of the Clone Wars in the year 22 BBY, the dispute was resolved when Arakyd absorbed its smaller competitor in an armed takeover. 60 AAD-4 assault droids belonging to competitor Arakyd Industries entered Viper Tower just prior to the end of the business day and quickly eliminated its ground-floor security units. The remaining Viper staff were relocated to the testing wing while three XR-37 droid tanks obliterated the building's top floors, which housed accounting and administrative divisions. Arakyd kept VSIS in operation as a research-and-development division,\nwhile a garrison remained at Viper Tower to assist with the transition."}, {"tag": "p", "text": "In a comment made to the HoloNet News following her release from Arakyd forces, ousted VSIS president Rina Fio said the company was pleased that under new management Viper would have the backing of the Techno Union's military forces. Arakyd's takeover of VSIS was reported in \"Sensor Technology Dispute Settled in Takeover,\" a HoloNet Business article, and, in possession of proprietary Viper technology, the company released the Viper probe droid, its biggest success to date."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Viper Sensor Intelligence Systems was originally created for HoloNet News Vol. 531 50, a HoloNet News article written by Pablo Hidalgo and Paul Ens with illustrations by Joe Corroney and released on April 4, 2002."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}