{"url": "Virago", "categories": ["Category:Legends articles", "Category:Black Sun spacecraft", "Category:MandalMotors products"], "nodes": [{"tag": "h1", "text": "Virago"}, {"tag": "p", "text": "Virago was a prototype StarViper-class attack platform and the personal starship of Prince Xizor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Virago had four adjustable wings and thrust nacelles that moved constantly during flight, which created the illusion that Virago was a strange, living creature. Each of the vehicle's wings were capped with two microthrusters. To achieve high speeds and for atmospheric travels, the craft's wings folded closed behind the cockpit."}, {"tag": "p", "text": "In combat, the Virago's four wings expanded for better maneuverability. They moved and used the same type of S-foil technology used on the X-wing starfighter. These wings were heavily armored and each contained a power generator along with reserve fuel tanks for long travels."}, {"tag": "p", "text": "Virago's weapon systems were built around an advanced targeting computer along with an experimental laser sighting system rather than being built around the weapons themselves. With this unorthodox design strategy, the craft would not require excessive or illegal weapons that would attract attention."}, {"tag": "p", "text": "Once the targeting computer was in place, any weapon installed would perform better than manufacturer specifications. Virago was armed with two forward-mounted Taim & Bak Ht-12 double laser cannons and two forward Borstel proton torpedo launchers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although the crimelord had access to numerous starships, his favorite was a heavy assault starfighter called Virago. When Xizor contracted MandalMotors, he demanded a vehicle that could rival the TIE Interceptor in speed and agility."}, {"tag": "p", "text": "The company succeeded by producing the StarViper-class attack platform, a vehicle which had more in common with a mobile weapons platform than a starfighter. A pleased Xizor christened the vehicle Virago and purchased all rights to the design to ensure that his transport would remain unique."}, {"tag": "p", "text": "Virago was apparently destroyed in a battle over Coruscant, when Darth Vader's flagship Executor destroyed Xizor's skyhook. Soon after Xizor's death, MandalMotors regained the rights to the StarViper design and began producing inferior versions of the original craft."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Virago was designed by Doug Chiang for the Star Wars: Shadows of the Empire multimedia project. His design was inspired by Xizor's reptilian personality, as well as by pictures he had taken (while scouting locations for the movie Jumanji) of some cast-iron pulley casings in a Vancouver mill."}, {"tag": "p", "text": "The ship makes a cameo appearance in Star Wars: Galactic Battlegrounds: Clone Campaigns; however, this is more than likely non-canon. The unit is placeable in the scenario editor, but any appearances in missions are more than likely Easter eggs."}, {"tag": "p", "text": "The StarViper-class attack platform also appears in the game Star Wars: Empire at War: Forces of Corruption as the main starfighter of the Zann Consortium. The 3D model was actually in the files of regular Star Wars: Empire at War, and it had game code, but it was commented out. It is possible that Petroglyph planned to have Xizor as a hero unit for the Black Sun, as they also included a Xizor model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}