{"url": "Violia", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:AgriCorps members", "Category:Females", "Category:Individuals of unspecified species", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Violia"}, {"tag": "p", "text": "Violia was a Force-sensitive female who was a member of the Jedi Order during the last century of the Galactic Republic. She was a friend of the future Jedi Master Thame Cerulian when both were Initiates at the Jedi Temple on Coruscant but did not become a Padawan like Cerulian. Violia got assigned to the Jedi Service Corps instead, being sent to work on the agriworld of Dilonexa XXIII as a part of the Agricultural Corps. Cerulian noted Violia's assignment in his copy of The Jedi Path: A Manual for Students of the Force, expressing a wish to meet her again should circumstances allow."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born sometime prior to 115 BBY, Violia was a Force-sensitive female who was accepted into the Jedi Order at an early age. While training as an Initiate at the Jedi Temple on the Galactic Republic capital of Coruscant, she became friends with fellow student Thame Cerulian, a future Jedi Master and High Council member. Unlike Cerulian, who was chosen as an apprentice by Master Unskette, Violia did not graduate from Initiate to Padawan. Instead, the Council of Reassignment appointed her to the Jedi Service Corps branch known as the Agricultural Corps, which worked to maintain a healthy planetary biosphere on a number of worlds and aided the growth of crops through the application of the Living Force. Violia was dispatched to the agriworld of Dilonexa XXIII in the Centrality, a region Rimward of Hutt Space. Following Violia's AgriCorps assignment, Cerulian made a marginal comment about it in his copy of the Jedi trainee guidebook The Jedi Path: A Manual for Students of the Force, in which he expressed a wish to visit her if one of Master Unskette's missions brought him to Dilonexa."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though she failed to achieve the rank of Padawan after years of training as a Jedi Initiate, Violia continued her service to the Galactic Republic. She joined the Agricultural Corps, the members of which had an affinity for growing things and where patience before nature's own processes was a quality valued above all others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Violia's first and so far only mention in Star Wars canon comes from The Jedi Path: A Manual for Students of the Force (2010) by Daniel Wallace. Written from an in-universe perspective, the reference book is meant to represent an actual training manual passed from master to apprentice, with notations from each Jedi who has owned the book. Violia is mentioned in Thame Cerulian's comment scribbled in the margins of a chapter discussing the Reassignment Council and the Jedi Service Corps. While establishing her as female, the notation does not specify Violia's species."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}