{"url": "Viska", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Mammalian sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Viska"}, {"tag": "p", "text": "The Viska (singular, Visk) were winged sentients, indigenous to Rordak."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Viska's bodies were between two and three meters long, while their leathery wings spanned five meters. They had a pair of arms in the center of their body used for manipulation. They had long, narrow heads, with wide-set eyes and large ears. Their eyes were so widely placed that they could see all the way around themselves, even directly behind them. They also possessed infra-red vision, allowing them to see perfectly in the dark."}, {"tag": "p", "text": "Most prominently, they had a forty-centimeter long needle-sharp proboscis. Their circular mouth extended this proboscis - called a blossug - when feeding. It was made of several layers of strong muscles covering a hollow bone with a sharp jagged tip. This bone would be pushed into the flesh of their victim, whereupon the Visk would use muscles in their snout and skull to drain the creature's blood."}, {"tag": "p", "text": "Due to their primitive digestive tract, they were completely unable to eat meats or plants. They had to consume two liters of blood per day. Creatures from their homeworld - mostly grazing herd animals - provided the most nutrition to a Visk. They would refrain from feeding on alien creatures or sentients, as off-world blood would often physically harm them. Viska would not feed off of one another, but could use their blossug as a weapon in physical combat."}, {"tag": "p", "text": "Viska expended a great deal of energy in their day-to-day activities, and had to rest for at least eight hours a day."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Their world was ruled by a caleisk, a monarch who was chosen when their predecessor died. All of the caleisk's children would battle to the death, with the sole survivor becoming the new monarch. This new ruler would then choose between three to six clans who would control all of the repulsorlift cities across the planet. These chosen clans were called the lurinn, whereas unempowered clans were called calsedra."}, {"tag": "p", "text": "Each clan was ruled by a calsk. When the calsk died, his children would also fight to the death for power, just like those of the caleisk. Power would only shift to a new family if a calsk died without any children. Each family would then choose a leader, who would battle all other chosen leaders for the calsk position."}, {"tag": "p", "text": "Each lurinn clan had absolute authority over particular calsedra clans, and each calsk likewise had total authority over each Visk in his clan. Individual Visk were told what tasks or occupations they could have, and had no choice in the matter. They would often excel in their professions, but as Viska society was highly merit-based, they would mostly try to move upward in society through success. Viska were always seeking more wealth, influence, and comfort, as well as a higher personal status and a higher status for their clan. In order to prevent any back-handed or stealthy methods of altering Viska power-structure, such as assassination - rather than the all-out battles that decided their leaders - any individual found guilty of participating in such a plan would be executed, if the victim was within their family. If the victim was a member of another family, the guilty party's entire family would be executed."}, {"tag": "p", "text": "The Viska lived in large repulsorlift cities. This was due to the volatile nature of Rordak's surface, which suffered from groundquakes and volcanic eruptions. Even before Republic scouts brought repulsorlift technology, the Viska had developed a society that stayed away from the ground. With their new technology, the Viska developed a completely aerial society. These cities were huge structures, made completely open to the air due to the Viska's large wingspans. Their buildings were attached to enormous repulsor columns, over 500 meters long and 100 meters in diameter. The levels of these cities would often extend thousands of meters into the air. The upper levels of their cities were reserved for the royals of the clans, while the lower workers and clans lived on the bottom levels. The middle levels were used for manufacturing, trading, and as spaceports."}, {"tag": "p", "text": "Due to their need for large quantities of blood, the Viska tended to enormous herds of grazing animals, such as the kessarch and the drivveb. They imported vast amounts of grain and grasses to feed these herds."}, {"tag": "p", "text": "It was rare for a Visk to leave Rordak. If one did, they were forced to avoid elite Viska warriors and bounty hunters their clan would send after them."}, {"tag": "p", "text": "Due to their diet of blood, and their well-known disregard for the sanctity of life, they were commonly referred to by off-worlders as \"the great bloodsucking fiends of Rordak\". This was erroneous, however, as they very rarely fed off of other sentients. Even still, they were very intimidating to off-worlders, a trait the Viska were very proud of."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Viska had progressed to an atomic level of technology on their own before being contacted by other sentients. When Republic scouts arrived, the Viska eagerly embraced their space-level technology. The \"bloodsucking fiends\" soon became well-known throughout their home sector."}, {"tag": "p", "text": "By the rise of the Galactic Empire, the Viska had been part of galactic society for over three centuries. After the formation of the Empire, the Imperials immediately began to use the planet as a prison world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The New Jedi Order: Dark Tide II: Ruin, Viska is mistakenly used to refer to only one of the species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}