{"url": "Viscount-class_Star_Defender", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Dreadnought classes", "Category:Galactic Alliance starship classes", "Category:Mon Calamari cruiser variants", "Category:Mon Calamari starship classes", "Category:New Republic starship classes", "Category:Viscount-class Star Defenders"], "nodes": [{"tag": "h1", "text": "Viscount-class Star Defender"}, {"tag": "p", "text": "The Viscount-class Star Defender was a very large warship series developed by the Mon Calamari for use by the New Republic Defense Fleet."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Viscount-class Star Defender was envisioned as the New Republic equivalent of an Executor-class Star Dreadnought. The first prototype was a 3 km long battlecruiser, and the full production model was a 17 km long dreadnought. Although slightly shorter in length than the Executor-class, the superior engineering skills of the Mon Calamari enabled the vessel to carry more starfighters. Furthermore, the vessel required a substantially smaller crew to operate. Its shape was also more compact than the Executor-class and it had heavier and more extensive armor. Dozens of docking clamps allowed the vessel to directly dock with many other capital ships at the same time."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Viscount-class was equipped with over five thousand weapons systems, including heavy turbolaser batteries and assault concussion missile launchers.\nThe Viscount's shields had backups, like previous Calamari designs, and were thus highly regenerative. The computers, electronic equipment, and sensor systems were above and beyond those of an Imperial Star Dreadnought, and it carried a HoloNet transceiver as well. Its heavy armament was on par with the Empire's Executor Class Star Destroyer."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "Ships of the class could carry hundreds of starfighters, as well as dozens of small support vessels, including frigate-sized ships.\nThe class was also fitted with enough life pods to carry the crews of the ship itself, and also those of whatever smaller support vessels were carried at the time. This totaled a passenger-capacity of 500,000 individuals. The ship was also equipped with enough repair droids to cover the entire vessel during emergency repairs."}, {"tag": "h3", "text": "Other systems"}, {"tag": "p", "text": "To support wounded in combat, the Viscount-class had hundreds of self-replenishing bacta tanks in its medical wings.\nIt also had fighter repair bays, for the repair and maintenance of the ship's starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The design series began its history around the time right after the Battle of Endor. Despite having beaten the Executor in combat at the climactic battle, Admiral Gial Ackbar considered the various Super Star Destroyers, still in Imperial hands, as the main threat to the burgeoning New Republic Navy. With this in mind, he proposed the creation of Super Star Destroyer-scale warships to counter the Imperial vessels."}, {"tag": "p", "text": "It took many years of development, combined with the threat of the rogue Executor-class Star Dreadnought Intimidator during the Black Fleet Crisis, to move the development program forward and actually produce the larger dreadnoughts."}, {"tag": "p", "text": "Despite having utilized Mon Calamari battleships and Bulwark-class battle cruisers in previous decades, the New Republic had never constructed anything on this scale before. Regardless, the Mon Calamari finally began development of the Viscount-class after the Black Fleet Crisis."}, {"tag": "p", "text": "Construction on the class dragged on, as the threat posed by the Imperial Remnant diminished and the New Republic captured several Star Dreadnoughts during the war."}, {"tag": "h3", "text": "Active service"}, {"tag": "p", "text": "The first ship of the class, the smaller prototype battlecruiser Viscount, was eventually completed in time to engage rogue Imperial warlords, pirates, and hideouts. It was noted as being commissioned in 25 ABY, shortly before the Yuuzhan Vong War began."}, {"tag": "p", "text": "The Viscount's brief career of Civil War-related battles constituted the only events in which the class was used for its original purpose, battling Imperial targets. At least one confrontation involved an Executor-class Star Dreadnought on the opposing side."}, {"tag": "p", "text": "The Calamari Viscount battlecruiser and dreadnoughts, along with Corellian-made Viscounts and the Corellian Strident-class, marked the only known Star Defender ship types, all participating in the Yuuzhan Vong War. When the New Republic government transitioned into the Galactic Federation of Free Alliances, the Viscount-class continued to play a prominent role in the fleet. The ships were even regarded as the backbone of the Galactic Alliance Defense Force."}, {"tag": "p", "text": "In 27 ABY, the dreadnought Krakana was deployed to Kuat to act as an orbital battery, but was assaulted by the Vong en route and destroyed. Its sister ship, the Bounty, while still unfinished, held off the Yuuzhan Vong from attacking Mon Calamari directly for years."}, {"tag": "p", "text": "When the war finally came to Mon Calamari, the power of the Viscount-class Star Defender was made evident during an epic naval battle. The Viscount herself formed part of a trio of heavy warships that was deployed in formation by the Galactic Alliance Defense Fleet. The other two were the Executor-class Guardian and the Mon Calamari battle cruiser Harbinger. These three large warships used their heavy, long-range weapons to assault the center of the Yuuzhan Vong armada. The heavy guns of the Viscount were instrumental in destroying numerous enemy warships."}, {"tag": "h3", "text": "Retirement"}, {"tag": "p", "text": "By the Sith–Imperial War, the Viscount-class and other heavy warship-designs in the battlecruiser and dreadnought range, had been phased out of service. Fleet doctrine moved towards smaller, compact weapons-platforms and new Calamari designs reflecting this change, like the MC140 Scythe-class main battle cruiser, dominated Alliance fleets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}