{"url": "Visas_Marr", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Jedi Sentinels", "Category:Jedi trainees of the Jedi Order", "Category:Lost Jedi (Meetra Surik)", "Category:Miraluka", "Category:Redeemed Jedi", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Visas Marr"}, {"tag": "p", "text": "Visas Marr was a Miraluka female from the Mid Rim world of Katarr who lived during the time of the Jedi Civil War and the period of unrest that followed in its wake. In 3952 BBY, Jedi Master Atris held a Conclave at Katarr remaining Jedi from the First Jedi Purge whilst purposely leaking the event's whereabouts to the Sith Triumvirate, orchestrators of the Purge, in hopes of drawing them out. However, the plan backfired, and Darth Nihilus, one of the Triumvirate's leaders, consumed all organic life on the planet, striking a devastating blow to the Jedi Order. However, Nihilus left Visas Marr alive on Katarr; she was taken aboard the Sith Lord's flagship, the Ravager, and was made his apprentice. Thus, a Force bond was forged between the two. Warped into a servant of the dark side of the Force, Marr later traveled with Nihilus beyond the Outer Rim, before being dispatched in 3951 BBY to the galaxy to seek out a growing presence in the Force and bring its cause before Nihilus."}, {"tag": "p", "text": "Marr found the center of the phenomenon she sought: a former Jedi, exiled by the Order before Nihilus's rise to power, who had returned to known space. She ambushed and challenged the exiled Jedi, Meetra Surik who defeated Marr. Impressed by Surik's abilities and the destiny that she perceived about her, Marr allowed herself to be swayed to the light. Forsaking her master, Nihilus, she became an informal apprentice to Surik, teaching the elder ex-Jedi about the power of her Force-sensitive species."}, {"tag": "p", "text": "The Miraluka traveled with Surik and aided in her endeavor to save the Jedi Order by locating those Jedi Masters who had been absent from the convocation. Later that year, Marr played an instrumental part in resolving the Battle of Telos IV, in which she met her former master in battle, and triumphed. In the process, she overcame the remaining shadows of her past, coming to terms with the destruction of her people. Soon afterward, Surik confronted and defeated the two surviving members of the Triumvirate, Darth Traya and Darth Sion, at Malachor V, ending the Sith's program to eradicate the Jedi. Shortly before her death at the hands of Surik, Darth Traya prophesied of Marr's return to Katarr and her pivotal role in rebuilding the Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Sith apprentice"}, {"tag": "p", "text": "In the year 3952 BBY, Visas Marr, a young Miraluka female, was living on her homeworld, the Mid Rim Miraluka colony of Katarr, when the planet was chosen to host a secret Jedi conclave to discuss the hidden dangers the Jedi had recently faced. Seven years prior, the Jedi Knight Revan, a hero of the Mandalorian Wars, had founded a new Sith Empire and pronounced himself a Dark Lord of the Sith. He, along with his apprentice, Darth Malak, had declared war on the Republic and the Jedi Order."}, {"tag": "p", "text": "In the intervening years since the conclusion of the war, the Jedi had been disappearing, hunted down one by one. The Miraluka, as a species, were innately Force-sensitive, and the Jedi had hopes that the intensified Force energy on Katarr would provide them with a measure of clarity. One of the leaders of the Sith Triumvirate, Sith Lord Darth Nihilus, who possessed an insatiable hunger for the Force, was drawn to Katarr by this gathering of those strong within it, from where he lurked beyond the Outer Rim. Unable to ignore this emanating pulse of Force power, he consumed all life on the planet, wiping out the Jedi who had gathered there. Marr alone remained alive to bear witness."}, {"tag": "p", "text": "Miraluka were typically made uneasy by the presence of something untouched by the Force, and when Marr not only saw, but experienced, the obliteration of life through the Force, the pain and shock of the severed connections left her unconscious and near death. Taken aboard Nihilus's ship, she awoke to find that the flesh where her eyes would have been had been removed. Distraught, she sought out the Dark Lord, questioning why she alone had been spared. Fractured and vulnerable at best, overwhelmed by the dark power surrounding him, Marr allowed Nihilus to take her for his own. In an attempt to make her believe in his cause, Nihilus showed her a vision, forcing her to see the galaxy in a way that her people never could; sentient beings on other planets, disconnected from the life surrounding them, unable to feel the Force."}, {"tag": "p", "text": "The vision severely damaged Marr's Force sight—which she, as a Miraluka, had to solely rely on, having no physical sight—and she became convinced that all life must die. She came to believe that Nihilus fed upon the ugliness of the galaxy and left silence, and that the removal of this wretchedness was bringing stillness and order to where there once had been chaos. Accepting Nihilus's unspoken invitation, Marr became his apprentice, and was given a meditation chamber, in addition to living quarters—which she called her cell—aboard the Ravager. As Nihilus's Shadow Hand, Marr was compelled to do her master's bidding. About one year later, she felt a growing disturbance in the Force. Perceiving it as a faint echo rippling through the galaxy, she sought out her master to inform him of the phenomenon, only to find that he had felt it as well. Curious and perhaps uneasy with the discovery, Nihilus demanded to know if Marr was capable of tracing the origin of the anomaly. After confirming the possibility, he sent her to find and bring the source to him."}, {"tag": "h3", "text": "Finding the source"}, {"tag": "p", "text": "Marr's search for the origin of the echoes lead her to Meetra Surik, a former Jedi General in the Mandalorian Wars who had lost her connection to the Force during the war's culminating battle at Malachor V. The general alone returned to Coruscant to answer to the Jedi Council and defend her actions in disobeying them by joining Revan in his crusade against the Mandalorian threat. As a result, she was exiled from the Jedi Order. After roaming the Outer Rim for nearly a decade, Surik had returned to Republic space and was being hunted by Sith assassins who believed her to be the last Jedi Knight. In an effort to save the Jedi Order, Surik set out on a mission to find the Jedi Masters that had not been present at the conclave on Katarr. During her journey, Surik experienced a burgeoning reconnection to the Force and any subsequent decisions she made sent tremors throughout the Force, thus allowing Marr to find her."}, {"tag": "p", "text": "Marr infiltrated Surik's starship, the Ebon Hawk, incapacitated the crew, and engaged Surik in lightsaber combat—only to be defeated, wounded, and have her lightsaber broken. Convinced of Surik's superior strength, Marr yielded and begged Surik to end her life, for the alternative was death by her master's hand for her failure. When Surik refused, Marr pledged her life to her, seemingly abandoning Nihilus before losing consciousness. Surik then took the unconscious woman to the ship's medical bay. This act of mercy was met by surprise from Surik's companion, the pilot of the Ebon Hawk, Atton Rand, who was uneasy in the presence of powerful Force users, as the Miraluka were known to be. He also expressed his amazement at seeing a Miraluka Sith, saying that he had heard of Miraluka Jedi, but never Sith, further speculating that he was unsure as to how to go about killing one. The idea of killing Marr was met by incredulity on the part of Surik, who voiced her regret for having hurt the Miraluka during their duel. Rand reassured her that Marr's injuries would heal, noticing that even though some of her wounds were severe, she looked like she had suffered from many more in the past."}, {"tag": "p", "text": "While Rand grudgingly accepted Marr, Kreia, Surik's informal master, met her arrival with barely concealed contempt. She was of the opinion that the Miraluka's ability to see through the Force was wasted on her people and that she should be considered a servant. Furthermore, Kreia felt it necessary to remind Surik that the Sith were often betrayed by their own apprentices and that even though Marr had pledged herself to Surik, she was bound to other masters, thus insinuating that Marr's loyalty would always be suspect. Wary of Kreia's attitude towards Marr, Surik nonetheless sought her advice regarding the change Marr had brought about in her eyesight during their clash. While Kreia explained this alteration of Surik's perception was nothing that hadn't already been present, the elder woman had nothing but utter disdain for the forceful and \"crude methods\" that were the mark of the Sith."}, {"tag": "p", "text": "Marr's first genuine encounter with Surik left her disquieted. Unused to the mercy shown by Surik not only toward her, but others as well, Marr believed that this type of action would weaken Surik for the enemies she had to face in the near future. Nevertheless, impressed by Surik's skills, Marr rediscovered hope and came to consider that the universe was perhaps not as her master had shown her, and that, with her help, Surik would be able to stop him. The fact that her master neither understood nor saw Surik as she did was of some comfort to her. However, Marr cautioned Surik that she would need to understand why this was so if Surik was to have a chance of defeating Nihilus. She refused to guide Surik to him untested and without her potential realized, as Marr felt the Jedi was not yet ready to face such a threat. She foresaw that Surik and Nihilus would meet in the near future, however."}, {"tag": "h3", "text": "Journeys with Meetra Surik"}, {"tag": "p", "text": "From that moment, Marr devoted herself to the light side and to the search for the remaining Jedi Masters. Her admiration for Surik continued to grow, and from her Surik would learn to see through the Force as a Miraluka could. When the time came for Surik to finally confront Marr's former master aboard his flagship, the Ravager, following his assault on the planet Telos IV, Marr refused to be left behind, intuiting that her presence would be essential in vanquishing Nihilus. Likewise, Mandalore the Preserver, who had been traveling with Surik in order to gather the scattered Mandalorian clans, insisted that he and his troops lead the charge into battle, claiming that his warriors were the most capable for the task."}, {"tag": "p", "text": "Arriving on the ruined ship, Mandalore announced that he would be accompanying Marr and Surik to the bridge, asserting that he didn't trust Surik to complete the mission. However, his low opinion of Surik's capabilities was not so much directed towards her specifically, as it was a general belief that anyone who was not a Mandalorian was ineffective. As they made their way to the bridge, Marr, with Surik's blessing, took the time to visit her meditation chamber on the vessel one last time, finally coming to terms with the destruction of Katarr. Her new-found strength would see Marr through the trial ahead, not for vengeance but for the sake of all life. In a final test of allegiance, Marr confronted Darth Nihilus with her fate resting solely on Surik, who gave her the chance to stand up to the one who had wounded her. As they were taken aback by the Sith Lord's powers, Nihilus stunned Surik and Marr offered her life in exchange for sparing her. This show of devotion distracted Nihilus long enough for Surik to recover. Surik realized that Marr was a link between Nihilus and the power bound within the Ravager. Struggling as she was with the weight of that power, Marr exploited the bond to her former master and blocked his connection to the Force, momentarily stunning him. Together, Mandalore, Marr, and Surik were able to defeat Nihilus. Before they could make haste to flee the destruction of the ship, Marr felt compelled to behold what lay beneath Nihilus's death mask in order to sever the last remaining bond between them."}, {"tag": "p", "text": "Soon after the death of Darth Nihilus, Surik confronted and defeated the last two leaders of the Sith Triumvirate, Darth Sion and Surik's former teacher, Kreia, who had re-assumed the title of Darth Traya. This last struggle took place at the Triumvirate's headquarters, the ancient Trayus Academy, located within the depths of Malachor V's craggy surface. This final battle brought about the end of the shadow conflict that the Jedi had faced since the end of the Jedi Civil War, and Marr would play a role in the subsequent restoration of the Jedi Order. Furthermore, according to Darth Traya's final predictions shortly before her death, Marr returned to her homeworld and, looking upon its surface, finally saw what she was meant to see."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Miraluka were acknowledged as individuals strongly committed to their chosen course of action, as was evidenced by Marr's dedication to help Meetra Surik in stopping her former master. Nevertheless, the trauma of seeing her world die through the Force left Marr shattered and vulnerable, her Force Sight damaged. Darth Nihilus took advantage of this and twisted her psyche until she became utterly subservient and hopeless, disconnected from herself and life, a mere shell of a being."}, {"tag": "p", "text": "Marr's defeat at the hands of Surik proved to be the catalyst that allowed her to break Nihilus's hold over her and restore her own free will. She confessed to Surik that the very fact that Surik's nature had eluded her master gave her hope that he could be defeated. The search for the Jedi Masters reestablished Marr's connection to life and believing Surik responsible for this, she vowed to protect her. Although she never quite lost her servile attitude, Marr's journey with Surik allowed her to gain the confidence and self-respect that ultimately severed the final bond to her former master and enabled her to rediscover herself."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like all of her species, the Miraluka, Marr was born physically blind and instead relied on Force sight to see the physical world, which included the ability to see through walls. Though this Force power was a characteristic of the Miraluka, it was not species restrictive and Marr would later teach its use to Meetra Surik. Her sense of the Force was highly developed, as was evidenced by her detection of Surik, from across the galaxy, during her time as apprentice to Darth Nihilus. The depth of her Force-sensitivity granted Marr the ability to manipulate the Force to move or control the direction of objects through space. This was commonly known as the \"Jedi's object movement power,\" also referred to as telekinesis. The use of this talent included pulling and pushing objects with minimal effort. In addition, she may also have been a practitioner of farsight, as she was able to 'see' the eventual showdown between her first and her final master."}, {"tag": "p", "text": "Furthermore, Marr was highly skilled in the use of what were considered to be dark side powers, such as grasping and choking enemies, as well as unleashing raw dark-side energy. Her connection to the dark side gave her the use of Dark Healing, an ability that fueled regenerative processes by draining the life force of another. Marr's return to the light side following her defeat at the hands of Meetra Surik allowed her to continue training as a Jedi Sentinel. Because of her training as a Jedi Sentinel, she was later given a yellow-bladed lightsaber by Surik, which served to extend her knowledge of lightsaber combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Visas Marr was created by Obsidian Entertainment as one of the companions for the 2004 Xbox and PC video game Star Wars: Knights of the Old Republic II: The Sith Lords. Like most companions, she was written by Chris Avellone. She was voiced by American actress Kelly Hu. One of her co-creators was concept artist Brian Menze. Marr's story and background was later elaborated in the six-page comic \"Unseen, Unheard\", which was featured in Star Wars Tales 24, and the Knights of the Old Republic Campaign Guide. In addition, the Jedi Sentinel miniature in Wizards of the Coast's Champions of the Force miniatures set resembles Visas Marr. A second miniature, this one explicitly labeled as being Marr, was released in the Knights of the Old Republic set."}, {"tag": "p", "text": "At one point, there was some confusion as to Marr's actions aboard the Ravager and her involvement in the death of Darth Nihilus. Jedi vs. Sith: The Essential Guide to the Force, written as an in-universe historical account, claimed that it was unclear as to whether Marr had killed Nihilus, moreover implying that Nihilus may have in fact killed her. The matter appeared to be settled in Knights of the Old Republic Campaign Guide, where it was stated that Marr led Surik to her former master and that afterward she was pivotal in the restoration of the Jedi Order. In addition, the player had the option to convince Marr to sacrifice herself for the purpose of weakening Nihilus, but only if Marr was equipped with standard clothes and wielded a melee weapon or a lightsaber."}, {"tag": "p", "text": "The game mechanics of Knights of the Old Republic II enabled a player to choose to play either a light side or dark side character. Depending on the chosen path, the dialog choices between the player and the companions was altered, in addition to the monologues of the companions themselves. Furthermore, the alignment choices led to a change in the side quests available to the player, as well as certain action sequences of the game. An example of gameplay changes with regards to Visas Marr was if Surik chose the path of the dark side; Marr slowly forgot about Katarr and instead gained an unstoppable vengeance against anyone that had ever hurt her physically or emotionally. Additionally, Marr's experience in her meditation chamber aboard the Ravager was altered. If Surik followed the light path, Marr heard whispers; if Surik followed the dark side path, Marr heard screams."}, {"tag": "p", "text": "In order for the player to gain a prestige class—the equivalent of a Jedi Master—in Knights of the Old Republic II, the functions of game mechanics required Marr to become a companion of Surik as a prerequisite. Furthermore, Marr was one of two females who would refuse to dance for Vogga the Hutt in the player quest \"Vogga's Dancers.\" The other female was Kreia. There was also an item called \"Visas Marr's lightsaber\" that could have been obtained by using a cheat code, however, it was unclear as to whether this was the same lightsaber Marr carried when she first infiltrated the Ebon Hawk. This item was a slightly more efficient red-bladed lightsaber with no special features other than Marr's name on it."}, {"tag": "h3", "text": "Romance"}, {"tag": "p", "text": "The publication of The New Essential Guide to Droids established the canonicity of Meetra Surik as being of the female sex. As a result of game mechanics, a player had the option to play as either a male or female character. If the player chose a male character, Marr, along with the male-player-only character Brianna, was intended to be one of two romantic interests that could be chosen. Technically, however, it was not possible to have a romance with either one. Unlike the first Knights of the Old Republic game, there wasn't a dialog-driven romance progression. Much of the romance was alluded to in the form of conversations between characters and cutscenes. It was only toward the end of the game that Marr confessed her love for the male Surik as long as he had gained enough influence with her, although the player character did not have the option of returning those feelings."}, {"tag": "p", "text": "Marr and Brianna viewed themselves as rivals for the affections of Surik. They had a cutscene together in which Brianna jealously confronted Marr, claiming that she would only bring him harm. Marr's response was to state that she only wanted to protect Surik and that Brianna was aware of this since she had read as much in Marr's movements, much the same as Marr had seen in Brianna's movements. Marr then went on to ask Brianna to describe what Surik looked like, to which Brianna was unable to give a satisfactory answer, professing that he looked like a man, but also more than a man. Another cutscene centered around the bounty hunter Mira, another companion of Surik, and her inability to understand why Brianna and Marr were fighting over Surik. She was of the opinion that since she had caught him—Mira initially tracked Surik for Zez-Kai Ell, one of the lost Jedi Masters Surik sought, on Nar Shaddaa—he belonged to her."}, {"tag": "p", "text": "There were at least two occurrences of conversations focusing of the physical aspects of a romance between Surik and Marr. One was voiced aloud by Kreia soon after Marr joined the group aboard the Ebon Hawk. She urged Surik to control his urges and avoid mating with the seer, as this would have had the potential to create both physical and emotional difficulties. The player had the option to reply in the negative, stating that sparing her life did not mean that he had a romantic interest in her. To this response Kreia was skeptical, replying that Surik should have learned restraint and discipline while in exile. Another occurred when, after initiating a conversation with Mira, Mira remarked that the Surik seemed to have a strange peace. After telling Mira that his peace is through the Force, Mira said that she thought Surik and Visas might have \"hooked up a power coupling\". If Surik replies with confusion, Mira explains, \"You know, been intimate.\" (Note: This latter dialogue also occurs if the player's love interest is the Handmaiden.)"}, {"tag": "p", "text": "After the death of the Jedi Masters at the Jedi Enclave and Surik's discovery that his ability to form very strong Force bonds was the reason his companions followed his lead, Marr confessed her love to him. She did not believe that the Masters were right; it was her choice to follow him, her choice to sacrifice herself for him if need be. She explained that ever since she first heard him through the Force she understood that there was someone who felt the same sense of loss as she and that she had loved him from that moment. She begged Surik to stay with her, even as she knew that he could not. Her final request to him was to have the opportunity to see him at a moment where they were alone. This led to them meditating together, looking at each other with Force Sight."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "Like with many other characters, Marr's role was originally greater, but some details and scenes were not implemented in the final game. The majority of the cut content would have given the player a greater insight into the relations between Marr and other characters. One such scene between Surik and Marr involved the player having the option to spar with her under Kreia's supervision after Marr joined the player character's party and was in possession of a lightsaber. According to developer comments in the game's conversation file, another scene involved the initial battle between the player and Marr in which she used her Force Sight to blind the player."}, {"tag": "p", "text": "The Ravager was a location that would have shown a greater connection between Mandalore and Marr in addition to player choices. At a certain point, Marr exchanged dialog with Mandalore, where they admonished one another not to betray the other. Later, Mandalore was injured and she healed him. In appreciation, he then spoke a bit about his history with Revan. The duel on the Ravager was expanded to allow the player the option to become Nihilus's new apprentice; the player could have chosen this option as truth or lie. If in truth, the player character turned on Marr and killed her. Mandalore then said something to the effect of turning on one's allies. If a lie, then the player, Marr, and Mandalore attacked Nihilus."}, {"tag": "p", "text": "In a scene related to the endgame, Marr confronted Kreia at the Jedi Enclave. Kreia once again expressed her loathing of the Miraluka and berated her weak character. In what was considered to be one of the most detrimental cuts of the endgame, Marr joined the other party members in confronting and attempting to kill Kreia in the Trayus Academy before the arrival of Surik, but they were incapacitated by Kreia's Force Crush and imprisoned by Darth Sion. Atton was the only member to escape."}, {"tag": "p", "text": "In at least one possible ending for a male player character, Brianna provoked Marr into a fight by telling her how she seduced Surik—triggered by previous dialog options aboard the Ebon Hawk—once the player entered the Trayus Proving Grounds. Then, depending on the outcome of the fight and after Darth Traya's defeat, Surik left either Marr or Brianna in charge of the Trayus Academy with instructions to train the Force-sensitives who would come in time. The player character then set off for the Unknown Regions in search of Revan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}