{"url": "Viscus", "categories": ["Category:Canon articles", "Category:Males", "Category:Nightbrothers", "Category:Shadow Collective members"], "nodes": [{"tag": "h1", "text": "Viscus"}, {"tag": "p", "text": "Brother Viscus was a male Dathomirian Zabrak Nightbrother who lived during the Clone Wars. He lived in the Nightbrother village on Dathomir. Viscus was eventually killed by the fallen human Jedi Taron Malicos, who usurped Viscus as leader of the Nightbrothers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Leader of the Nightbrothers"}, {"tag": "p", "text": "Living in the Nightbrother village on Dathomir, he supervised the Selection, in which Asajj Ventress tested Nightbrothers to determine who was worthy of becoming her apprentice. Shortly thereafter, he and the Nightbrothers attacked Obi-Wan Kenobi and Anakin Skywalker when they went to the village looking for information about Savage Opress, who had been chosen as Ventress' apprentice and had killed Jedi. After the brief engagement, Viscus pointed the two Jedi towards Mother Talzin and allowed them to leave in peace."}, {"tag": "h3", "text": "Alliance with Maul"}, {"tag": "p", "text": "Viscus and a team of Nightbrothers were later sent to Ord Mantell by Mother Talzin to assist the rogue Sith Lord Maul and his Shadow Collective, who were preparing a trap to capture Count Dooku and General Grievous of the Confederacy of Independent Systems. The Nightbrothers arrived just as the battle began. Viscus and the Nightbrothers fought against Dooku himself. Many were killed by Dooku. Being one of the last surviving Nightbrothers at the battle, Viscus held his own until he was pulled into the ground, causing him to lay badly injured during the battle. He was saved from death due to the intervention of Maul's allies, who captured the Sith Lord."}, {"tag": "p", "text": "Viscus later greeted Maul when the latter arrived at the Nightbrothers' village with the captive Count Dooku and brought them to the heart of Mother Talzin's power. As Talzin drained Dooku's life force, Viscus left with the remaining Nightbrothers to prepare her bedchambers, as he feared the process would weaken her."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Following his crash on Dathomir, the Jedi Taron Malicos was hunted down and captured by a band of Nightbrothers led by Viscus. The Nightbrothers brought the Jedi to their village, where they waited for the Nightsister Merrin's orders. Growing tired of waiting, Viscus was determined to execute the prisoner, aware that Malicos was manipulating his captors and seeking to divide them. However, Malicos had succumbed to the Dark Side of the Force and managed to kill Viscus, proving his strength to the Nightbrothers and taking over the clan. Viscus' dead body layed in a chasm in the various set of halls called the Halls of the Nydak."}, {"tag": "p", "text": "Viscus's corpse was later discovered by the former Padawan Cal Kestis, who learned of the nature of the Nightbrother's death through Psychometry."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Viscus was skilled in hand-to-hand combat and was agile. Viscus was able to hold his own against an armed Dooku for short time."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Brother Viscus wore a orange and black padded suit, as well as a gray robe. He also briefly used a spear during the Battle of Ord Mantell."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Viscus was created for \"Monster\", the thirteenth episode of The Clone Wars: Season Three. He was voiced by Stephen Stanton. While voicing Viscus, Stanton claims that he based Viscus' raspy voice off of Peter Ustinov's character in Spartacus, Lentulus Batiatus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}