{"url": "Vitale", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:61st Mobile Infantry personnel", "Category:Females", "Category:Individuals of unspecified species", "Category:Wild Squadron personnel"], "nodes": [{"tag": "h1", "text": "Vitale"}, {"tag": "p", "text": "Vitale was a female individual who served as a sergeant in the New Republic's 61st Mobile Infantry during the Galactic Civil War. Around 5 ABY, the company fought the Galactic Empire through the city districts of the planet Troithe. Vitale worked with the pilots of the New Republic's Alphabet Squadron, which on one occasion scouted territory for the 61st soldiers. One night, the sergeant and some other soldiers ate with the Alphabet Squadron and later discussed the late Emperor Palpatine."}, {"tag": "p", "text": "After the Empire's 204th Imperial Fighter Wing, also known as Shadow Wing, devastated the New Republic forces at the Cerberon system and forced the 61st from their positions on Troithe, Vitale rendezvoused at in Highgarden District with a number of other New Republic personnel. The Alphabet Squadron pilot Wyl Lark selected her to fly for his makeshift squadron, promising the sergeant a refurbished V-wing."}, {"tag": "p", "text": "The 61st remnant left the Highgarden district and traveled through a tunnel network under the surface. In the meantime, Vitale played a game of Who? What? Where? with the rest of her new squadron until a Shadow Wing pilot found the remnant. The TIE fighter pilot's squadron soon followed, and Vitale showed doubt to Lark's plan to split off with another of his squadron, who was ultimately killed."}, {"tag": "p", "text": "The remnant hid away in a heavily mined continent on Troithe, where they targeted the nearby Core Nine mining megafacility. After Shadow Wing's forces began diverting to the mining facility, Vitale's squadron, backed by the 61st ground troops, attacked Core Nine. Vitale's squadron engaged the fighter wing's TIE/ln space superiority starfighters, and Shadow Wing eventually fled on a bulk freighter after New Republic reinforcements led by General Hera Syndulla arrived. Vitale joined the celebration days after the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Deployment on Troithe"}, {"tag": "p", "text": "At some point in her life, Vitale flew in atmospheric patrols for a local security. She also had a nephew on the planet Corellia. During the Galactic Civil War, Vitale eventually joined the 61st Mobile Infantry—a company serving under the Rebel Alliance and eventually the New Republic—and rose to the rank of sergeant."}, {"tag": "p", "text": "Around 5 ABY, the 61st was assigned to the Acclamator-class transgalactic military assault ship Lodestar, the flagship of General Hera Syndulla's Barma Battle Group. The battle group fought the Galactic Empire's forces in the Deep Core's Cerberon system, where the 61st fought through the city districts of the planet Troithe. One day, she was at the 61st's camp aboard the Lodestar with a dozen others when the New Republic pilots Nath Tensent, Wyl Lark and Kairos of the New Republic's Alphabet Squadron passed by. Sergeant Carver greeted the three and Tensent and Lark stayed to talk with the soldiers, the former making an effort to learn the names of Vitale and some of the other troops."}, {"tag": "h3", "text": "Scouting mission"}, {"tag": "p", "text": "Some days later, Vitale liaised with Alphabet Squadron for a scouting operation. Alphabet's UT-60D U-wing starfighter/support craft—piloted by Kairos with the Theelin A/SF-01 B-wing starfighter pilot Chass na Chadic aboard—took scans of the enemy territory several kilometers ahead of the 61st soldiers. Vitale heard Chadic swear over the comm and asked if there was any problems, only for Tensent to reply that the B-wing pilot was in a bad mood. When Alphabet Leader, Lieutenant Yrica Quell, asked Vitale's team whether they had enough images to work with, the sergeant felt that another pass of a tram line would be beneficial."}, {"tag": "p", "text": "When the pass over the tram line was complete, Chadic and Quell bantered some more, and Vitale interrupted, asking if the pair were done flirting. Chadic told the sergeant to be grateful that Alphabet Squadron was scouting so that the 61st troops would not get killed. Vitale then asked why the infantry was going to be rushing into Troithe's capital, the Troithe Planetary Defense Center, rather than starving out the Imperial governor's forces. Quell asked for the speculation to be left for another day."}, {"tag": "h3", "text": "Meal discussions"}, {"tag": "p", "text": "The march towards the TPDC began, with the 61st and the battle group's squadrons, Alphabet, Meteor and Hail Squadron, taking a number of sectors within two weeks. One evening, Vitale went to a refugee camp set up near the Lodestar in search of Lark. The RZ-1 A-wing interceptor pilot, who was eating with Tensent, Quell and Chadic, excused himself to join the sergeant. The pair soon returned to the other three Alphabet pilots with half a dozen other 61st soldiers."}, {"tag": "p", "text": "Tensent handed out Imperial rations to the newcomers, and the group told stories. As the discussions became directed towards the late Galactic Emperor Palpatine, who had perished at the Battle of Endor around six months before. A Mon Calamari soldier expressed his wish for the Emperor to have survived and had a trial. Vitale, raising her wine glass and spitting to the ground, argued that if Palpatine was tried first, all those who had a trial after would argue that they were not as bad as the Emperor."}, {"tag": "h3", "text": "On the run"}, {"tag": "h4", "text": "Regrouping and consolidating"}, {"tag": "p", "text": "As the campaign in the Cerberon system progressed, the Empire's 204th Imperial Fighter Wing, better known as Shadow Wing, was coaxed to the system as a part of a trap set up by the battle group. However, the fighter wing was able to devastate the New Republic forces, destroying the Lodestar. Shadow Wing's TIE/ln space superiority starfighters then routed the 61st's troops from their positions. Vitale and two dozen other New Republic personnel rendezvoused at a three story speeder garage in the Highgarden District. As the personnel listened to a nearby riot, Carver shut down another soldier who suggested intervening and remarked that the fighting would be over by the next morning. As the others laughed, Vitale said that they must wait until daylight."}, {"tag": "p", "text": "With half of the 61st, including Captain Hazram Namir, stranded off-world, Carver assumed command of the 61st forces rendezvousing at the garage, which soon numbered at almost fifty with twenty local insurgents on top of that. Lark and Tensent, who had joined the remnant, were allowed to form a make-shift squadron, led by the latter. While Tensent traveled to a district named the Web to secure some aircraft, the 61st traveled to the edge of Highgarden and Lark chose between troops for his new squadron. Vitale was among the candidates for her time flying for a local security."}, {"tag": "h4", "text": "Caravan escort"}, {"tag": "p", "text": "The 61st remnant received four Humble HoverCat airspeeders and a Alpha-3 Nimbus-class V-wing starfighter, which Lark promised to Vitale. The aircraft were refurbished by 61st engineers as the remnant entered a network of tunnels aboard a caravan of repulsorcraft. While the caravan traveled through the tunnel, the members of the squadron took turns on sensor duty. During the journey, the pilots talked and one of them, Gorgeous Su, proposed a game of Who? What? Where?, where the contenders detailed who first heard of their death and how and where they died."}, {"tag": "p", "text": "Vitale argued with the other pilots on who went first in the game, Tensent being nominated to go first. The sergeant was displeased with the what the BTL-A4 Y-wing assault starfighter/bomber pilot wanted to kill him. Vitale went next, having her Nephew as the one to first hear of her death, the guards of Imperial Vizier Mas Amedda as her killers, and the planet Coruscant as the location. After Su chose her death to be crafting her Humble HoverCat into Shadow Wing's command ship, Vitale claimed that Alphabet Squadron had dibs on eliminating the fighter wing, although Lark replied that his squadron could share it. The pilot Ubellikos disapproved and the sergeant laugh."}, {"tag": "h4", "text": "TIE fighter attacks"}, {"tag": "p", "text": "The game of Who? What? Where? continued until a Shadow Wing pilot came across the caravan. Vitale called out the presence of the TIE, which passed the remnant under fire from the 61st soldiers. Lark pursued the Imperial pilot, who attempted to collapse the ceiling of a tunnel onto his A-wing, but was killed in the process. Despite the caravan's presence being discovered by Shadow Wing, Carver ordered that it must keep moving."}, {"tag": "p", "text": "Suspicions of reinforcements were confirmed when a squadron of TIEs arrived. As Carver ordered for weapons to be drawn, Vitale relayed informed Lark of this, the A-wing pilot wishing to join Su in drawing the TIEs away. Vitale argued against the idea, worried that Lark and Su would not find the caravan again if they split off, but the A-wing pilot decided to go ahead with the plan. Ultimately, Carver chose to detonate a repulsorcraft at a tunnel entrance to block the way behind the caravan. Su was killed in the fighting."}, {"tag": "h3", "text": "Siege of Core Nine"}, {"tag": "p", "text": "The 61st remnant reached the Scar of Troithe, a mined out continent on Troithe, where the New Republic personnel hid under the cover of a ravine. Carver held a meeting with the other senior personnel where it was decided that the remnant's next target was the nearby Core Nine mining megafacility, which Shadow Wing had taken control of. Meanwhile, Vitale spent time with the rest of her squadron, reviewing Lark's combat courses and socializing with other 61st soldiers. Lark eventually told the improvised pilots to get some sleep before the remnant's attack on Core Nine. When the entirety of Shadow Wing's forces began diverting towards Core Nine, the remnant received word from friendly forces in Troithe's city districts and prepared to attack the mining facility."}, {"tag": "p", "text": "Vitale led a team which rushed to find Lark and Tensent when they did not reply over their comlinks. When the soldiers, riding a skimmer, found the pair, the sergeant informed the two of the situation and that Carver had a plan. As the remnant, backed by Lark's squadron, closed in on Core Nine, Lark had Vitale and the rest of the squadron report in. A TIE squadron appeared in response, but was scattered by the laser cannon fire from Vitale and the others. As Lark's squadron continued to engage the larger number of TIEs, the ground forces of the remnant attacking Core Nine below."}, {"tag": "p", "text": "As the fighting progressed, Lark gave out recommendations to Vitale, Ubellikos, and the insectoid pilot Prinspai. The latter two were killed shortly after, but Syndulla, aboard the MC75 Star Cruiser Temperance, arrived to the battle with the New Republic's Vanguard Squadron. Shadow Wing soon began to flee the battle aboard a bulk freighter. When Lark asked if all of the fighter wing had boarded the freighter, Vitale answered negative. The New Republic forces pursued Shadow Wing, some of them being distracted when the freighter launched missiles at the city districts of Troithe. The fighter wing ultimately escaped the system."}, {"tag": "h3", "text": "Celebrations"}, {"tag": "p", "text": "Some days after the battle, Vitale mourned, Ubellikos, Prinspai and Su with Lark and Denish Wraive, the only other remaining pilot from Lark's squadron aside from Tensent. The day after, 61st soldiers and other personnel Syndulla's battle group celebrated in the Raddakkia Plaza on Troithe. Vitale socialized with Tensent, Lark and Wraive. The sergeant also wagered with Wraive, Lark, and Sergeant Twitch on when the riots in the Old Skybottom District."}, {"tag": "h3", "text": "Service in Wild Squadron"}, {"tag": "p", "text": "That year, Vitale joined Wraive, Lark and the latter's Alphabet Squadron comrades in their own squadron named Wild Squadron. She used the callsign Wild Two."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female individual with dark skin, Vitale inquired whether there was problems after hearing Chass na Chadic swear. She was dissatisfied with the scouting images provided by Chadic and also questioned the tactics of the invasion of the TPDC, believing that starving the governor's forces was the better option. The sergeant got along with Wyl Lark, and searched for him one evening. Later, when a Mon Calamari expressed his wish for Palpatine to have survived to be tried, Vitale thought that it would only allow those tried after to say that they were better than the Emperor."}, {"tag": "p", "text": "After Carver remarked that a nearby riot would be over by the morning, Vitale agreed that they must wait until daylight. She did not think Nath Tensent's choice for what he wanted to kill him was specific enough and chose her ideal death to be on Coruscant, being insistent that the 61st would be going there next. The sergeant told Gorgeous Su that Alphabet Squadron had dibs on defeating Shadow Wing as the pilot wished to die crashing into the fighter wing's command ship. When Lark chose to split off from the caravan with Su to draw away a TIE squadron, Vitale argued against the plan, thinking that the pair would not find the caravan again."}, {"tag": "p", "text": "After Su's death, Vitale spent the evenings with the other members of her new squadrons, socializing with other 61st troops. She led a team to find Lark and Tensent when the pair did not answer their comlinks upon the remnant's preparation to deploy to Core Nine. During the celebration following the attack on the mining facility, the sergeant wagered with a few others on when the riots in another city district ended."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vitale wore an infantry uniform and a helmet. She used a comlink and a rifle as well as a skimmer during her time at the Scar of Troithe. As a part of Lark's squadron, she flew an Alpha-3 Nimbus-class V-wing starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vitale appeared in the 2020 novel Shadow Fall, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}