{"url": "Vistis_Garn", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Black Sun members", "Category:Males", "Category:Migrant Merchants' Guild members", "Category:Rodians", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Vistis Garn"}, {"tag": "p", "text": "Vistis Garn was a male Rodian smuggler living on the planet Coruscant during the Cold War. Garn worked primarily for the criminal group known as the Migrant Merchants' Guild, but he would work for any organization that offered the right price. When he was hired by the Black Sun criminal syndicate to steal the design files of the Planet Prison superweapon, the former apprentice of Jedi Master Orgus Din pursued Garn to a Guild warehouse and defeated the thief. The Jedi Knight spared the Rodian thief after interrogating him, and Garn fled to his friends on the moon of Nar Shaddaa."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Rodian male, Vistis Garn became an accomplished smuggler and thief during the Cold War between the Republic and the reconstituted Sith Empire. By 3643 BBY, Garn was working part-time for the criminal organization known as the Migrant Merchants' Guild on the Republic capital planet of Coruscant, but he also freelanced for other organizations. Garn had been successful enough to draw the attention of the Coruscant Security Force, who maintained a case file #1142-235-3721 on the Rodian and offered a reward for his arrest."}, {"tag": "p", "text": "That same year, the Sith Lord Tarnis—who was masquerading as a Republic scientist named Eli Tarnis—hired the Black Sun criminal syndicate to steal the design files for the Planet Prison, his own superweapon project. While the Guild and Black Sun were rivals, Black Sun gave the job to Garn, who worked with a Guild team to infiltrate a Republic warehouse. Garn and his team—which consisted of two Rodian thieves, three Ongree slicers, and an Abyssin guard—sliced into the building's computer network, stole the files, and escaped with a shipment of munitions, weapons, and rockets, but not before Garn was seen briefly by a security camera. Returning to the Old Galactic Market—the region under the Merchants' Guild's control—Garn and his team reported to a Guild warehouse."}, {"tag": "p", "text": "While Guild members unloaded the stolen weapons with the help of a security droid, one of the slicers decrypted the design files. As soon as the slicer finished, Garn secretly sent a copy to his employers in Black Sun. However, the Republic Strategic Information Service had identified Garn on a security recording, and the former apprentice of Jedi Master Orgus Din was sent to recover both the files and the stolen weapons. The Jedi Knight and the Jedi's companion, the astromech droid T7-O1, stormed the warehouse and defeated the Guild members. Upon realizing the warehouse was under attack, Garn sealed himself inside the warehouse's secure room. Recovering the weapons, the Knight cut open the security door and confronted the criminal."}, {"tag": "p", "text": "Realizing that his enemy was a Jedi, Garn apologized and activated a quartet of autoturrets in an attempt to kill the Knight and T7. However, the pair were able to disable the turrets and disarm the Rodian without much trouble, and Garn quickly surrendered. Learning that the Knight was searching for the design files, he freely gave them to the Jedi and offered to give up the names and locations of his employers if the Knight would allow him to leave. The Jedi agreed, and let the Rodian depart in peace after learning that he had been hired by Black Sun. Thanking the Jedi and the droid, Garn told them that he planned to go stay with friends on the Smuggler's Moon of Nar Shaddaa."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vistis Garn was a purple-eyed Rodian male with bluish-purple skin. An accomplished thief who spoke Rodese, he worked for the highest bidder, and was never completely loyal to one side. He was more than willing to work for competing parties, evident when he worked for both the Migrant Merchants' Guild and their rival, Black Sun. Despite being a criminal, Garn also respected the Jedi, and was willing to accept mercy when it was offered, although this was because he was afraid after being defeated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vistis Garn was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears in the Jedi Knight class mission \"Stolen Secrets\" on Coruscant, where the player is ordered to locate Garn and recover stolen weapons from a Merchants' Guild warehouse in the Old Galactic Market district. After being defeated, Garn can be either spared by the player for light-side points or killed for dark side points."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}