{"url": "Vladlun_Travan", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Vladlun Travan"}, {"tag": "p", "text": "Vladlun Travan was a male Rodian criminal who resided on Rori during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime during the last decade of the Old Republic, Vladlun Travan planned and organized a criminal plot to kidnap Felicia, the daughter of the wealthy land owner Wernell Covington. Although Covington accepted to pay the ransom, things turned bad and Felicia was killed by the kidnappers. The poor girl was jettisoned into space from the starship on which she was being held. Vladlun Travan was identified by the authorities at that moment but he managed to flee and escape justice for many years."}, {"tag": "p", "text": "Almost three decades later, by the time of the Battle of Yavin in 0 BBY, Vladlun Travan was living on Rori where he was leading his own gang. Three of his associates were Titus Dabrini, Aztin Maru and Tiaba Charr. However, Wernell Covington was still looking for the escaped murderers of his beloved daughter. In fact, two members of the group that kidnapped Felicia were still free: Vladlun Travan and Jurgen Nath. Circa 1 ABY, Wernell Covington hired a spacer to investigate the whereabouts of the remaining kidnappers. With the help of Horace Korr, a retired Corellia Times reporter, the spacer was able to identify the two remaining murderers. An associate of Covington in the Narmle Militia was later able to provide the last known locations of the criminals. After having killed Jurgen Nath, the spacer tracked Vladlun Travan to his hideout and fought Vladlun's gang. The spacer finally found Vladlun Travan and killed him for his involvement in the kidnapping and death of the young Felicia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vladlun Travan was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Vladlun Travan was added to the game with the release of the \"Game Update 12\", on August 10, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}