{"url": "Vlemoth_Station", "categories": ["Category:Legends articles", "Category:Spaceports", "Category:Vlemoth Port locations"], "nodes": [{"tag": "h1", "text": "Vlemoth Station"}, {"tag": "p", "text": "Vlemoth Station was an orbital gun platform constructed by the InterGalactic Banking Clan to guard the Outer Rim world of Vlemoth Port against an attack from the Galactic Republic. Later grounded on the planet's surface, the former gun platform was reinvented as an independent spaceport and administration center for the Muun industrialists who developed Vlemoth Port and oversaw its commercial trade."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Measuring one thousand twenty-seven meters in height, Vlemoth Station was originally designed by the InterGalactic Banking Clan as an orbital gun platform, built in orbit over the planet Vlemoth Port. The station was later grounded on the planet's surface, where it towered over the surrounding landscape like a jade-colored pillar, held up by an array of cables, supports, and emergency repulsor braces."}, {"tag": "p", "text": "Now functioning as a spaceport, the top levels of Vlemoth Station were converted into a number of hotel rooms, shops, and cantinas, while the bridge decks were transformed into a suite of offices for the station's Muun overseers. From here, the Muuns regulated the planet's commerce, collecting rent, fees, and taxes. The thirty decks below hosted several wide hangars with walled-off bays and mag-shielded hangar doors, each capable of holding a dozen light freighters and a large amount of cargo. Freight and passenger turbolifts positioned on either side of the hangar bays provided transit between the stations various levels. Located at the base of Vlemoth Station were the maneuvering decks, housing massive torsion hydraulics used to turn the upper sections of the tower."}, {"tag": "p", "text": "Vlemoth Station was overseen by station control, while it's numerous hangar bays were monitored by hangar control. Starships that sought to land at the station were charged a fee of fifty credits, and the process of checking in and landing at the station took close to an hour on average. The station also maintained its own force of security guards, capable of intervening in conflicts within Vlemoth Station, and arresting those involved."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Muun owners of Vlemoth Port established the manufacturing city of Sanshur Flats, they decided to construct an orbital gun platform over the planet to protect their holdings from an attack by the Galactic Republic. Eventually, the platform was grounded, brought down to the planet's surface where it was reinvented as an independent spaceport known as Vlemoth Station. The planet's Muun overseers took up residence at the station's peak, where they handled all of Vlemoth Port's interplanetary trade from the office in the tower's converted upper levels."}, {"tag": "p", "text": "During the Galactic Civil War, operatives of the Alliance to Restore the Republic traveled to Vlemoth Port seeking the aid of the Mandalorians living in the settlement of Arumorut. Landing in Vlemoth Station's hangar 9, the rebel agents rode one of the stations turbolifts down to hangar 13 where they met with their Mandalorian contact, Kad Solus. Before they could leave, Solus and the rebels came under attack by a group of Weequay and Klatooinian mercenaries in the employ of Teemo, who had put a bounty on Solus. The rebel operatives fought off the mercenaries alongside Solus, and subsequently departed Vlemoth Station aboard his ship for the Mandalorian settlement of Arumorut."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vlemoth Station was first introduced to the Star Wars universe in Fantasy Flight Games' Age of Rebellion adventure book Friends Like These, published December 8, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}