{"url": "Vob_Bitas", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Criminals", "Category:Gamblers", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Vob Bitas"}, {"tag": "p", "text": "Vob Bitas was a gambler and the owner of Blob 14, an Umgullian blob. Bitas enhanced Blob 14's viscosity with the aid of illegal substances and, in 22 BBY, entered the blob in the third blob race at the Fondine Blob Raceways on the planet Umgul. Bitas wagered over one million credits on Blob 14, but the racer's odds-defying victory prompted an investigation that led to the discovery of the substances. Bitas was arrested and subsequently executed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vob Bitas was an individual who lived during the final years of the Galactic Republic, and the owner of an Umgullian blob named Blob 14. In 22 BBY, Bitas entered Blob 14 in the third blob race at the planet Umgul's Fondine Blob Raceways. Blob 14 was not expected to win, but Bitas introduced prohibited viscosity-enhancing substances into the creature's system, an offense that was punishable by death. Bitas then bet over one million credits on Blob 14, who defied expected odds and won the race. The Umgullian Racing Commission immediately investigated the unlikely victory, and when the banned substances were discovered two hours later, Bitas was taken into custody and executed."}, {"tag": "p", "text": "Slish Fondine, the owner of the raceways, used Bitas's winnings to recuperate financial losses incurred by the scandal. As Bitas was the fourth cheater caught at the raceways that year, Fondine considered deterring further fraud by instituting a harsher penalty than death. Bitas's victory and execution were soon thereafter reported on by HoloNet News."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vob Bitas was a gambler who was willing to use illegal viscosity-enhancing substances on Blob 14 in order to win a large sum of credits. However, the gambler's untoward ways were revealed by an investigation a mere two hours after the conclusion of the race."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vob Bitas's first mention in the Star Wars Legends continuity came in the article \"Blob Racing Cheater Killed,\" published online in Volume 531, Issue 48 of the HoloNet News website in 2002. The website's various articles were written by Pablo Hidalgo and Paul Ens, but Ens was responsible for the creation of Bitas. The character was named after Bob Vitas, creator of the fan-made The Completely Unofficial Star Wars Encyclopedia (CUSWE). Vitas considers it an honor to have been made into a Star Wars character, and has written fan fiction about Bitas in an issue of the fanzine Star Wars Outsider. Although Vitas is male, Bitas's sex was not established in the HoloNet News article, nor in Bitas's entry in 2008's The Complete Star Wars Encyclopedia—a work co-authored by Vitas."}, {"tag": "p", "text": "In 2005, author Abel G. Peña included Bitas as an example in a blog entry titled \"How to Become a Star Wars Character in 5 Easy Steps.\" As Vitas was a notable figure in the Star Wars fan community, Peña humorously asserted that he had been able to skip some of the steps. Peña also jokingly implied that Hidalgo had killed Bitas off due to the CUSWE having once been a rival of Hidalgo's own Star Wars Index in the realm of online fan depositories of Star Wars knowledge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}