{"url": "Vogga", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Business owners and executives", "Category:Crime lords", "Category:Hutts", "Category:Males", "Category:Nar Shaddaa residents"], "nodes": [{"tag": "h1", "text": "Vogga"}, {"tag": "p", "text": "Vogga was a Hutt crime lord operating on Nar Shaddaa, Nal Hutta's moon, in the years following the Jedi Civil War. His business included managing shipments of fuel from the planet Sleheyron, the largest fuel source in that part of the galaxy after the destruction of Peragus II."}, {"tag": "p", "text": "However, Vogga was in competition with Goto, the leader of the criminal Exchange organization on Nar Shaddaa. Goto tracked and intercepted Vogga's fuel freighters, rendering it impossible to trade the fuel. Vogga hired many bounty hunters to kill Goto, but Goto refused to reveal himself publicly."}, {"tag": "p", "text": "In 3951 BBY, Vogga met with the exiled Jedi Meetra Surik. Vogga agreed to ship fuel to Citadel Station, the base of the Project to restore the dying world of Telos, if Surik stopped Goto from hijacking the fuel freighters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vogga was a Hutt entrepreneur and crime lord from Nal Hutta's moon, Nar Shaddaa. Vogga's business included shipments of engine-grade fuel from Sleheyron, its largest source in that part of the galaxy after Peragus II."}, {"tag": "p", "text": "Over time, however, Vogga found his freighters being hijacked by the mysterious Goto, one of the Exchange crime lords. His dock manager Fassa was forced to hold Vogga's freighters on Nar Shaddaa, further choking his business."}, {"tag": "p", "text": "The intentions of \"Goto,\"– G0-T0–were simple: he thought that any deals with the Hutts would bankrupt the Galactic Republic. He therefore made sure that the Telosian Restoration Project and Citadel Station relied on Peragus for obtaining fuel. Even after the Peragus Mining Facility had been destroyed, G0-T0 continued disrupting Vogga's business: he thought that, as tragic as the supposed destruction of Telos and Citadel Station could be, it was still a lesser evil for the Republic than striking a deal with a Hutt."}, {"tag": "p", "text": "To get rid of G0-T0's influence, Vogga hired bounty hunters, in particular Hanharr. He also entered a deal with Visquis, Goto's underling, promising him more power on Nar Shaddaa, if Visquis could lure Goto into a trap."}, {"tag": "p", "text": "Eventually, Meetra Surik's companions used the confrontation between Vogga and Goto to their advantage. When Meetra herself was caught by Goto, they changed the Ebon Hawk's ID signature to that of one of Vogga's freighters; when the ship left Nar Shaddaa, it was immediately intercepted by Goto's cloaked yacht, allowing Meetra's friends to rescue her."}, {"tag": "p", "text": "Following the yacht's destruction, Meetra, on behalf of lieutenant Dol Grenn of the Telos Security Force, struck a bargain with Vogga, who, with his business secured, agreed to ship Sleheyron fuel for the Telos reconstruction."}, {"tag": "p", "text": "However, in order to gain an audience with Vogga, Meetra was forced to help Vogga's Twi'lek majordomo by donning a Huttese slave-girl costume and accepting the role as Vogga's new dancing girl. Vogga found this very amusing, but during the dance Vogga fell asleep and his kath hounds were put to sleep with Juma Juice by Meetra, allowing her to escape with Vogga's more valuable belongings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the game, there are four more or less separate quests involving Vogga:\nMeetra can eavesdrop on the conversation between two Trandoshan thugs in the cantina (Entertainment Promenade), and learn that people who get easily admitted to Vogga are those who mention G0-T0 or his elimination to him."}, {"tag": "p", "text": "You can also eavesdrop on the conversation of two other thugs, (Nar Shaddaa Docks) and learn the way to sneak into Vogga's private 'treasure room' (a dancer to make Vogga sleep, juma juice to the kath hounds to put them to sleep as well)."}, {"tag": "p", "text": "The player can perform as a dancing girl (by convincing Vogga's majordomo of her skills), this is the first step of getting to Vogga's treasures, and/or of getting an audience from him without mentioning G0-T0, but it can be done independently, without hearing the hints of the above-mentioned thugs. The player can also perform after negotiating the fuel supply, as it is still the only way to raid the treasure room. You would also unlock the slave outfit."}, {"tag": "p", "text": "If playing as a male character, Surik can persuade Brianna or possibly Mira to wear a metal bikini and dance in order to have Vogga fall asleep. The Twi'lek domo might suggest that Visas Marr dance (if she is in your party), but she will flat-out refuse. You can ask if Kreia could dance for Vogga, but it wouldn't be allowed due to her age."}, {"tag": "p", "text": "After being admitted (either by mentioning G0-T0 to the doorguard, or by dancing), you can negotiate about the fuel supply of Telos. The only thing Vogga wants in return is to eliminate G0-T0. Consequently, the sequence of events mentioned above is only one of the several possible ones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}