{"url": "Bendu_(religion)", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Religions", "Category:Symbols"], "nodes": [{"tag": "h1", "text": "Bendu  (religion)"}, {"tag": "p", "text": "Bendu was a collection of non-confrontational beliefs practiced by the Bendu monks. The symbol of Bendu was a circle connected by eight even spokes, which represented the unification of the galaxy by the Force. Due to their study of numerology, the number eight created by this symbol had great meaning."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Even though the symbol of the Bendu was eventually used by the Galactic Republic, they at first used their own symbol. Curiously, the later reformed Sith Empire used a six-spoked symbol similar to the one used by the Republic after the Sith civil war. By then, the Republic had adopted the symbol to represent their own role in galactic unification. A six-spoked form of the symbol was also used by the Republic during the Clone Wars immediately before the rise of the Empire. The symbol was later the basis for the emblem of the Galactic Empire. Then at the end of the Galactic Civil War, the New Republic restored the Old Republic's system government, though with editing of forms to reduce the probability of abuses. The Bendu was reinstated but, due to its similarity to the much-hated Imperial Crest, it was not widely adopted as an official symbol and the Alliance Starbird all but supplanted it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"Bendu\" may come from George Lucas's original name for the Jedi Knights: the Jedi Bendu. There are several instances wherein the symbol is used. In Star Wars: Episode III Revenge of the Sith during the Battle of Coruscant, Anakin's fighter bears the Clone Wars version of the six-spoke symbol and not the eight-spoke symbol. This can be seen when R2 fights the buzz droid."}, {"tag": "p", "text": "In Star Wars: Tales of the Jedi — The Sith War, Republic Navy starships are emblazoned with a blue nine-spoke symbol. Coincidentally, the flag of the Khoonda on Dantooine (3956 BBY to 3951 BBY) which appeared 39 years later in Star Wars: Knights of the Old Republic II: The Sith Lords, had a nine-spoked blue symbol. In the PlayStation 2 version of Star Wars: The Force Unleashed, on the Nar Shaddaa level, screens with the eight-spoke Galactic Republic Bendu appear and can be destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}