{"url": "Vo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Ice planets", "Category:Sacorrian system planets"], "nodes": [{"tag": "h1", "text": "Vo"}, {"tag": "p", "text": "The seventh and outermost planet in its system, Vo was a frozen, moonless, lifeless rock. It was located in the Sacorrian system, one of the Outlier systems of the Corellian sector, in the Arrowhead portion of the Galactic Core. In 18 ABY, the government of Vo's system-mate Sacorria attempted to secede from the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vo was the seventh planet in the Sacorrian system, located in the Outlier systems of the Corellian sector, in the Arrowhead portion of the Core Worlds. The farthest world in the system from its sun, Sacorria, Vo was a moonless, frozen rock devoid of life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several ancient shrines and vaults on the planet Vo had been looted by the time of the Cold War between the Galactic Republic and the reconstituted Sith Empire. During the reign of the Galactic Empire that replaced the Republic in the year 19 BBY, Vo's sector was placed under the control of a Diktat who answered to Emperor Palpatine. After the New Republic gained control of the Corellian sector, a governor-general was placed in charge of the region. The Triad government of Vo's system-mate Sacorria attempted to wrest control of the sector in 18 ABY but was foiled by the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Vo was first mentioned in the planet list for the Sacorria entry in the 2003 supplement to Wizards of the Coast's Star Wars Roleplaying Game, titled Coruscant and the Core Worlds. It was later mentioned in two Treasure Hunting crew skill missions in the video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}