{"url": "Vlemoth_Port/Legends", "categories": ["Category:Legends articles", "Category:Instrop sector planets", "Category:Vlemoth Port locations"], "nodes": [{"tag": "h1", "text": "Vlemoth Port"}, {"tag": "p", "text": "Vlemoth Port was a planet located within the Instrop sector of the Outer Rim Territories. An uninhabited world once known only as P1S15IS0079, Vlemoth Port was purchased from the Galactic Republic by Vlem Hill, and developed by the Muuns into an industrial center. Scattered tribes of displaced Talz could also be found on Vlemoth Port, in addition to an enclave of Mandalorian immigrants centered around the settlement of Arumorut."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vlemoth Port was located in the region of the galaxy known as the Outer Rim Territories, along the Cranan-Excarga Route in the Instrop sector. A terrestrial world with standard gravity, Vlemoth Port possessed a breathable atmosphere and a climate that varied by region. A year on Vlemoth Port comprised two hundred and fifty-six days, and each day was made up of twenty-eight hours. Vlemoth Port possessed a number of oceans and rivers stretched across its surface, in addition to expanses of swampy terrain and snowy tundras. Dense forests of conifer trees—thirty meters high, with thick trunks and hard wood—grew in abundance in the northern foothills of Vlemoth Port. The planet's arctic regions were snow-covered and known to be perilous to anyone who wasn't trained to deal with the wintry conditions."}, {"tag": "p", "text": "Located close to a continent-dividing river on Vlemoth Port sat the industrial city of Sanshur Flats, home to various facilities. Positioned nearby was the towering Vlemoth Station; an orbiting defense installation that had been moved down to the planet's surface, Vlemoth Station became an independent spaceport operated by the world's Muun overseers. From the station's upper suites, the Muuns handled all of Vlemoth Port's interplanetary commerce and collected taxes on incoming and outgoing trade. Nearly an hour's flight away, in the forested northern foothills of Vlemoth Port, was the Mandalorian settlement of Arumorut, home to over eight hundred Mandalorians specializing in mercenary work."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Once an uninhabited planet known only as P1S15IS0079, the Outer Rim world became home to a population of Talz after a slaver transport carrying hundreds of the white-haired sentients crashed there. Over generations, the Talz expanded and divided into multiple tribal groups, establishing villages and occasionally battling over territorial disputes."}, {"tag": "p", "text": "Several decades before the galaxy-spanning Clone Wars the planet was purchased from the Galactic Republic by the Muun industrialist Vlem Hill of the InterGalactic Banking Clan. Vlemoth Port, as the planet came to be known thereafter, was developed by the Hill family into an Outer Rim industrial center: the world's numerous undersea volcanoes were capped with mine-spires to filter precious metals, and the industrial manufacturing city of Sanshur Flats was built along a massive river, where it produced missiles for Banking Clan Hailfire-class droid tanks. During the Clone Wars, the Banking Clan constructed an orbital gun platform to defend their holdings against Republic attacks. The thousand-meter-tall platform was later grounded on Vlemoth Port's surface, where it came to serve as an independent starport known as Vlemoth Station."}, {"tag": "p", "text": "Amidst the intersocietal struggles between the pacifistic New Mandalorians and the violently radical Death Watch, a number of Mandalorians from the traditional warrior clans on Mandalore elected to leave behind their people's cultural homeworld and its strife to settle on Vlemoth Port. Taking up residence in the conifer forests of the planet's northern foothills, the Mandalorians and their leader, Nam Beroya, established a settlement of their own they deemed Arumorut. From there, they contracted out their services as mercenaries and bounty hunters throughout the surrounding region of space. The Mandalorian and the Talz populations developed a complex relationship: some of the Talz viewed the Mandalorians as intruders to be fought, while other groups such as the Gnaaz tribe allied with the Mandalorians for mutual benefit, training and participating in festivities together."}, {"tag": "p", "text": "Following the transformation of the Republic into the Galactic Empire, the Empire nationalized Vlemoth Port and sold its resources to various independent merchants. However, the Muuns spent years quietly buying the planet back in order to recover the wealth that had accumulated from Vlemoth Port's volcanic mining efforts below the sea. During the Galactic Civil War between the Empire and the forces of the rebellious Alliance to Restore the Republic, Skypath Industries offered a payment of five hundred credits to transport twenty tons of clothing from Dravian Station to Vlemoth Port."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vlemoth Port was first introduced to the Star Wars universe in the West End Games adventure Tales of the Smoking Blaster, written by Bill Smith and published in 1993 as part of the Star Wars Gamemaster Handbook. Twenty three years later, Vlemoth Port was featured again in the Fantasy Flight Games adventure book Friends Like These, released on December 8, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}