{"url": "Voe_Atell/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Corporate Alliance", "Category:Females", "Category:Individuals of unidentified species", "Category:Separatist senators"], "nodes": [{"tag": "h1", "text": "Voe Atell"}, {"tag": "p", "text": "Voe Atell was a female senator who served in the Parliament of the Confederacy of Independent Systems during the Clone Wars. An affiliate of the Corporate Alliance, she remained staunchly opposed to the Galactic Republic throughout the war, as were many of her colleagues in the Separatist Parliament. In 21 BBY, Atell refused to support Senator Mina Bonteri's bill to open peace negotiations with the Republic. Although the bill passed by a majority in the Parliament, it proved to be unsuccessful once it reached the Republic Senate due to the machinations of the Confederate Head of State, Count Dooku. As the war continued, Atell consented to serve with Separatist Congress Leader Bec Lawise on a Separatist delegation at the first-ever peace conference with the Republic on Mandalore, in which she demanded that the Republic representatives—Senators Padmé Amidala, Bail Prestor Organa, and Mon Mothma—confer political legitimacy on the Confederacy. As with Bonteri's bill for peace, the negotiations on Mandalore failed, thanks in part to an interruption from the former Separatist Lux Bonteri."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female member of a green-skinned, horned species, Voe Atell lived during the last decades of the rule of the Galactic Republic. As a politician, she opposed the Republic and joined the Confederacy of Independent Systems, a breakaway government formed in the year 24 BBY and headed by Count Dooku. By the time the Confederacy waged galactic war on the Republic in 22 BBY in what became known as the Clone Wars, Atell became a senator in the Separatist Parliament, being affiliated with the Corporate Alliance. As part of her duties, Atell attended Parliament sessions at the Separatist Senate Building on the capital world of Raxus."}, {"tag": "p", "text": "In 21 BBY, the second year of the war, Separatist Senator Mina Bonteri of Onderon—collaborating with an old friend, Republic Senator Padmé Amidala—introduced a bill to immediately open peace negotiations with Supreme Chancellor Palpatine and the Republic, as she and Amidala believed that the war had consumed enough lives since its outset. Atell took to the floor against Bonteri, swearing that the Corporate Alliance would never support such a bill for peace with the Republic. Her statement was rebutted by Senator Kerch Kushi, who proclaimed that the Parliament was a democracy, uncontrolled by corporate interests like the Corporate Alliance, as the Republic was. When Count Dooku called for a voice vote in accordance with the Bylaws of Independent Systems, Atell and a number of other senators voted nay, but they were outvoted by Bonteri and other supporters of the peace initiative. Although the proposal for peace negotiations was extended to the Republic Senate, Dooku—who was secretly a Dark Lord of the Sith and sought to have the war continue to serve the purposes of the Sith—had the Confederate General Grievous execute a sneak attack on the Republic capital of Coruscant, which portrayed the peace initiative as insincere in the eyes of the Republic Senate. Dooku also had Bonteri murdered and, alleging that she had been killed in a Republic attack, cited her death as a reason to formally withdraw the Separatist Parliament's peace bill."}, {"tag": "p", "text": "Later in the war, Atell agreed to serve with Separatist Congress Leader Bec Lawise and Senator Amita Fonti on a delegation that was to represent the Confederacy at the first-ever peace conference with the Republic. The neutral world of Mandalore was selected as a meeting ground, with Duchess Satine Kryze of the New Mandalorians hosting the gathering in the capital city of Sundari. Bringing a C-9979 landing craft to the Sundari docks, Atell and her colleagues arrived at the Sundari Royal Palace with a bodyguard retinue of BX-series droid commandos, while the delegates from the Republic Senate—Padmé Amidala, Bail Prestor Organa, and Mon Mothma—brought Senate Guards, along with Jedi Padawan Ahsoka Tano. Opening the meeting, Amidala stated that despite the tragedy of war, there was nothing that the Republic could do that would change everything that had already happened since the conflict's beginning. Speaking for her colleagues, Atell wasted no time in demanding that Amidala, being a representative of Chancellor Palpatine and the leader of the Republic delegation, admit to the legitimacy of the Confederacy, an acknowledgement that the Republic had been withholding since the establishment of the Separatist state."}, {"tag": "p", "text": "Amidala hesitated to meet Atell's request, but before she could respond, she was interrupted by an uninvited individual, Lux Bonteri. The son of Mina Bonteri, the young Bonteri had replaced his mother in the Separatist Parliament before recently renouncing his ties to the Confederacy. Taking a stand, Bonteri announced before the conference his discovery that Count Dooku had murdered his mother. Lawise immediately lambasted Bonteri's words as lies and had their BX-series droid commandos remove Bonteri from the room. Although Kryze protested, Atell stated that the matter was an internal affair, preventing the Republic or the Mandalorians from intervening as per protocol. Once Bonteri had been escorted away by the security droids, Lawise apologized for the interruption and resumed the talks. In spite of efforts on both sides, the negotiations on Mandalore soon broke down due to obstructions from covert interests on both sides, with Atell and her colleagues unable to reach an accord with the Republic senators. In the meantime, Bonteri was rescued from the Confederate landing craft by Tano, who was friends with the ex-Separatist and helped him escape from custody."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A member of a humanoid species, Voe Atell had red eyes and green skin, with a double row of horns on her head. She possessed enough political acumen to serve as a senator of the Separatist Parliament. Her ties to the Corporate Alliance were likened by some of her colleagues to the corporate interests that influenced the same Republic that she opposed. She was immediately opposed to Mina Bonteri's bill for peace negotiations, going so far as to declare that the Corporate Alliance would never allow the Parliament to pass such a proposal. In spite of her anti-peace stance, she later accepted a place on the Separatist delegation that was sent to the peace conference with the Republic on Mandalore. She was a firm advocate for the legitimacy of the Separatists, making her first order of business to demand that Padmé Amidala offer formal recognition to the Confederacy. When both Satine Kryze and the Republic delegation protested to the Separatists' arrest of Lux Bonteri, Atell cited the matter as an internal affair, preventing outside intervention from inhibiting the situation. Atell wore a set of robes to official proceedings of the Separatist Parliament."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Voe Atell was created for the Star Wars: The Clone Wars television series. She was introduced in the series' third season, being one of the first Separatist senators to be featured in Star Wars canon, in the episode \"Heroes on Both Sides,\" which aired on November 19, 2010. She later made an appearance in the fourth season episode \"A Friend in Need,\" which was released on January 13, 2012. In both episodes, she was voiced by actress Catherine Taber, who also voiced Padmé Amidala for the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}