{"url": "Vo_Dasha", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Airon sector", "Category:Inner Rim moons", "Category:Low-gravity moons", "Category:Rocky moons", "Category:Type II atmosphere moons"], "nodes": [{"tag": "h1", "text": "Vo Dasha"}, {"tag": "p", "text": "Vo Dasha was the only moon of the Inner Rim planet of Taboon, located in the Aweris system of the Stenness Node region. A barren locale consisting of mountains, canyons, and rocky plains, Vo Dasha's Type II atmosphere forced visitors to the moon's surface to wear breath masks. By 3999 BBY, Vo Dasha and the surrounding area had fallen under the influence of Stenness Node-based crime lord Bogga the Hutt, who placed his estate and base of operations on Vo Dasha. The moon subsequently became the center of Bogga's criminal empire, the crime lord's home, and the docking place of Bogga's fleet, including the massive dreadnaught Enforcer One. In 3999 BBY, the Enforcer One brought a captured gang of pirates, led by Finhead Stonebone, to Vo Dasha to meet with Bogga the Hutt, who sent the pirates on a mission to Ambria."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vo Dasha was the only moon of the Inner Rim planet Taboon, located in the Aweris system of the Airon sector in the Stenness Node. Vo Dasha had a barren landscape, dominated by mountains, canyons, and rocky plains, and its Type II atmosphere forced visitors to wear breath masks while on the moon's surface. The climate of the moon was hot and arid, and Vo Dasha had only light gravity. The length of a day on Vo Dasha was twelve standard hours, and a year was one hundred sixty-seven local days. One of Vo Dasha's native species was a variety of two-headed, airborne reptavian. The moon also was the home to various immigrated species, including Hutts, Humans, and Weequay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The collapse of a giant molecular cloud resulted in the creation of the yellow star Awer and its single satellite, Taboon, and the planet eventually took Vo Dasha as its moon. By 3999 BBY, Vo Dasha had become part of the criminal empire of local crime lord Bogga the Hutt, who placed his estate and base of operations on the moon. Vo Dasha subsequently became the docking place of Bogga's fleet, including the massive dreadnaught Enforcer One. In 3999 BBY, the Enforcer One returned to Vo Dasha from a mission carrying a load of pirates that had been taken captive while attempting to raid an Ithullian ore hauler in the Stenness Node. The Weequay Grimorg, one of Bogga's top enforcers, brought the pirate gang to Vo Dasha, where Bogga offered the pirate leader, Finhead Stonebone, freedom in exchange for a favor; journeying to the desolate planet Ambria and retrieving a lost shipment of Adegan crystals from Bogga's sworn enemy, a Jedi Master named Thon. Stonebone took the deal, and he and his gang departed Vo Dasha in their ships, the Marauder Starjacker and the Stenness Raider."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "About two-hundred fifty sentient beings inhabited Vo Dasha, all of them affiliated with Bogga's criminal empire. As the moon's atmosphere was not conducive to breathing, the residents of Vo Dasha were mainly confined to Bogga's estate. These individuals included Bogga himself, Grimorg, and many of the Hutt crime lord's slaves."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Vo Dasha's main landmark was the estate of Stenness Node-based crime lord Bogga the Hutt. Bogga's estate was hermetically sealed due to Vo Dasha's harsh atmosphere, and was located atop one of the moon's most prominent peaks. The Hutt crime lord used this fortress as the base of operations for all his illegal activities. Bogga's estate included meeting chambers, storage areas, docking and maintenance bays, weapons lockers, living quarters, a relatively large dungeon complex, and a throne room/audience chamber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vo Dasha first appeared in Tales of the Jedi: The Saga of Nomi Sunrider, the second story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released over late 1993-early 1994. The moon first appeared in the arc's second issue, and later reappeared in the arc's third and final issue. In these appearances, Vo Dasha was illustrated by David Roach."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}