{"url": "Voices", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Voices"}, {"tag": "p", "text": "\"Voices\" is the eleventh episode of the Star Wars: The Clone Wars television series' sixth season. It premiered on the German TV network Super RTL on March 1, 2014 and was released in the US and Canada via Netflix on March 7, 2014."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Yoda is deeply unsettled when he hears a voice from beyond the grave: the voice of Qui-Gon Jinn. Knowing that it is impossible for a Jedi to retain his identity after Death, the Jedi Council begins to worry that Yoda may be corrupted by the influence of the dark side. Determined to find answers, Yoda escapes the Jedi Temple to follow the disembodied voice.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While meditating for answers regarding the creation of the Clone Army, Yoda hears a voice, who claims to be the late Jedi Master, Qui-Gon Jinn having become a part of the Living Force, demonstrating his presence by levitating Yoda and random objects in the room."}, {"tag": "p", "text": "During a session of the Council, in which Ki-Adi Mundi theorizes that Count Dooku is merely a Sith apprentice, Yoda is deep in thought, and the other members of the council take notice of this. Sensing distress, Mace Windu, in a private discussion with Obi-Wan Kenobi, suggests that they keep an eye on him."}, {"tag": "p", "text": "In the Jedi Temple garden, Anakin hears Qui-Gon's voice calling Yoda's name, before spotting the Grand Master meditating. Yoda questions Anakin about his encounter with Qui-Gon's ghost on Mortis. Obi-Wan believed his former master to be an illusion created from their memories, but Anakin remains uncertain about the Jedi teachings regarding individuals unable to retain their identity after death."}, {"tag": "p", "text": "Later, Yoda speaks to the Council about the voice. After the Council spends an entire day meditating in the hopes of hearing Qui-Gon, Ki-Adi Mundi believes that Yoda is under attack from the Sith, feeling that if they were to attack the Jedi Order, Yoda would be the best target."}, {"tag": "p", "text": "The Jedi doctor recommends that Yoda undergo a treatment that will find the answers. During the treatment, Yoda hears Qui-Gon once more, telling him this is not the way to communicate. He instructs the Grand Master to travel to Dagobah and advises that he tell no one of this."}, {"tag": "p", "text": "Yoda ultimately is kept confined to his bed in the hospital as the other Jedi order Temple Guards placed outside the doors of the room. Anakin is sent to help Yoda escape from the infirmary, where he proceeds to go to Dagobah with R2-D2."}, {"tag": "p", "text": "Upon arrival, Yoda ventures into the swamp alone. He makes contact with Qui-Gon, who manifests as a glowing swarm of fireflies. Qui-Gon explains how living beings generate the Living Force, which feeds into the Cosmic Force, and communicating with the living through midi-chlorians. However, Qui-Gon is unable to show himself as his training was incomplete. Yoda asks if he knows the Sith Lord's identity. Qui-Gon tells Yoda to go to a place where the answers would be revealed to him."}, {"tag": "p", "text": "Yoda ventures into a cave, where he experiences a vision of Jedi fighting clones, and the Sith Lord, Darth Sidious, cutting down a group of Jedi masters. As the vision ends, Yoda stumbles out of the cave and collapses. As Qui-Gon rouses him, Yoda asks when the Sith will enact their plans. Qui-Gon says that with each day the Clone War goes on, evil feeds off it. Yoda asks Qui-Gon how can the Jedi hope to survive. Qui-Gon assures him that there's always hope, but it often comes in unexpected forms that are hard to see. Qui-Gon instructs Yoda to travel to the Origin of All-Life in the galaxy where he will be guided in the next part of his training to retain his identity after death. Yoda then returns to Artoo and departs Dagobah."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Shaak Ti's death, impaled through her heart from behind by a blue lightsaber, as witnessed by Yoda among his visions on Dagobah, mirrors a deleted scene from Star Wars: Episode III Revenge of the Sith in which she is executed by Darth Vader in the Jedi Temple during the Siege of the Jedi Temple."}, {"tag": "p", "text": "Mace Windu is shown being struck by Force Lightning from Palpatine, as witnessed by Yoda among his visions on Dagobah, foreshadowing his fate in Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "This episode has two different cuts. One features a scene where Yoda flies towards his hyperspace transport ring and jumps into hyperspace – likely to be used as an ad break on television. This uncut version was aired in Germany but didn't make it onto Netflix or DVD/Blu-ray even though part of the sequence was featured in a trailer for the Netflix premiere. The complete sequence was shown as a preview prior to the Netflix premiere but with different music and sounds than the uncut airing; Yoda pressing buttons is silent in the preview and him boarding and flying his ship has different background music."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}