{"url": "Vokara_Che", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Females", "Category:Jedi healers", "Category:Post-Ruusan Jedi Masters", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Vokara Che"}, {"tag": "p", "text": "Vokara Che was a female Twi'lek Jedi Master and a highly accomplished Jedi healer who served the Jedi Order at the Jedi Temple on Coruscant during the time of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Aftermath of Geonosis"}, {"tag": "p", "text": "The female Twi'lek Vokara Che was an accomplished Jedi healer that served as the Chief Healer of the Jedi Temple's Halls of Healing. In 22 BBY, the Jedi Order suffered a great loss of Jedi on Geonosis with the outbreak of the Clone Wars. Although several Jedi survived the battle, a number were injured, and Che was set with the task of treating them. However, the Padawan Anakin Skywalker's forearm had been cut off in a duel with Count Dooku, a Jedi Master who had left the Order and become a Dark Lord of the Sith. Skywalker's Master, Obi-Wan Kenobi, had also suffered injuries, and when Master and Padawan returned to the Temple on Coruscant, Che had Skywalker put into a healing trance to counterattack the shock of his injury, while a prosthetic arm was to be given to him. In addition, Che personally sent a healer to put Kenobi into a healing trance; however, Kenobi refused, seeking to meet with his Padawan."}, {"tag": "p", "text": "Senator Padmé Amidala, who had become romantically involved with Skywalker, arrived at the Halls of Healing and insisted on seeing Skywalker. Che refused to let Amidala see Skywalker, as he was already in a healing trance, and noted that Amidala herself required medical attention as well from numerous injuries. The senator, however, refused treatment from the Jedi or a medcenter, and was determined to see Skywalker. Kenobi entered the room and intervened. Che was aggravated that he had delayed his healing, but allowed Kenobi to speak with Amidala. Kenobi was able to convince the senator to receive treatment from the Jedi and return to her apartment."}, {"tag": "p", "text": "Che later met with Master Yoda in her private chambers in the Halls, and brought him up to date with the Jedi being treated. The Twi'lek healer expressed her concern for Kenobi, who worried for his Padawan. Both Che and Yoda had known Kenobi from infancy, and Yoda resolved to counsel Kenobi. Che was relieved with Yoda's decision to assist Kenobi, but before Yoda departed, she informed him of Amidala's arrival at the Temple and her determination to see Skywalker, as well as the possibility of an official complaint."}, {"tag": "h3", "text": "A strict healer"}, {"tag": "p", "text": "Weeks later, Kenobi—who had completed Skywalker's training, and was now a Jedi Master—was returning to the Temple after receiving a tip-off from old friend and diner owner Dexter Jettster when the Jedi was severely injured in a terrorist bombing. Stranded on a rooftop, Kenobi was unable to call for assistance, but Skywalker—now a Knight, having completed the Jedi Trials—was able to find his former Master, and notified the Temple for help. Yoda, Che, and two other healers arrived to treat Kenobi, and while Skywalker and Yoda returned to the Temple with Kenobi's information, Che and the healers stayed to make Kenobi fit for a transfer. After they had returned to the Temple, Che allowed Yoda to speak with Kenobi, regarding a mission that was to be given to Skywalker."}, {"tag": "p", "text": "Once Kenobi had recovered \"well enough,\" Che permitted Skywalker to see his former Master, but not before warning Skywalker not to agitate Kenobi. However, after Skywalker received his assignment from Kenobi, that was just what Skywalker did; when the duo argued, Kenobi suffered a relapse of his injures. Che rushed into the room, and shoving Skywalker aside, she immediately used a healing crystal to treat Kenobi. When Kenobi asked for Skywalker, Che told him that his former Padawan had left, while beckoning Skywalker to leave, but Skywalker refused and stayed a few more minutes to listen to the rest of his orders. Che sympathized with Skywalker's fears for Kenobi's recovery before telling him to leave."}, {"tag": "p", "text": "Kenobi later left on a risky mission based on information recovered by Senator Bail Organa, and after the two were rescued from the Sith planet of Zigoola by Senator Amidala, Kenobi was taken to the Halls of Healing for treatment. Che had Kenobi put in a deep healing trance to mend his various injuries, including a broken leg. After a week, Che stated that he was fit to leave the Halls, but restricted him to the Temple precinct on \"pain of her most severe displeasure.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Che was a strict Jedi, and as such, could come across as harsh and a bit marshal. She could sometimes be blunt, and was infuriated with anyone who disrupted the healing of her patients."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Vokara Che, being an experienced healer, was promoted to Chief Healer, such were her skills."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}