{"url": "Vokk", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Vokk"}, {"tag": "p", "text": "Vokk was a male Human Sith apprentice who served the reconstituted Sith Empire during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vokk became a Sith apprentice sometime before the Cold War. Around 3643 BBY, he was aboard Grand Moff Rycus Kilran's ship when the Moff attacked the Republic cruiser Esseles in an attempt to capture the Republic ambassador Vyn Asara."}, {"tag": "p", "text": "During the assault, he was sent by the Moff with a squad of Imperial troopers to eliminate the group of Republic defenders who had disabled the tractor beam on the Moff's ship. Vokk entered the hangar where the group's shuttle was docked, and killed the security forces who were guarding Ambassador Asara."}, {"tag": "p", "text": "He began to Force choke her, but threw her aside when a group of saboteurs arrived in the hangar. He gladly engaged the group, calling them weak and spineless, and saying that they were nothing compared to the power of the dark side. This would prove false, though, as the apprentice fell to the combined might of the Republic defenders."}, {"tag": "h2", "text": "Powers and Abilities"}, {"tag": "h3", "text": "Force powers"}, {"tag": "p", "text": "Vokk was a powerful Force-user, and believed that the dark side of the Force rendered him and the Sith unstoppable. He was proficient in the use of Force lightning, telekinesis and Force choke."}, {"tag": "h3", "text": "Lightsaber training"}, {"tag": "p", "text": "Vokk was a practitioner of Jar'Kai, as he wielded two red-bladed lightsabers - one of which he would often throw at one of his opponents to keep them off-balance while he fought with the second."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}