{"url": "Bene/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi Purge victims", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Bene"}, {"tag": "p", "text": "Bene was a female Human Jedi Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human, Bene was discovered by the Jedi Order and inducted into their ranks, learning the ways of the Force at the Coruscant Jedi Temple. Selected by a Jedi Master at the start of the Clone Wars, a conflict between the Republic and the Confederacy of Independent Systems, Bene constructed a blue-bladed lightsaber and took up the rank of Commander in the Grand Army of the Republic."}, {"tag": "p", "text": "In the final days of the war, Padawan Bene was stationed at the Temple when Supreme Chancellor Palpatine, who was secretly the Dark Lord of the Sith Darth Sidious, betrayed the Jedi Order and issued Contingency Order 66 to the Grand Army which, in essence, made it illegal to be a Jedi. As the 501st Legion marched into the Temple and opened fire indiscriminately on the Order's members, Bene joined fellow Padawans in protecting the youngest Initiates. Backed into the Room of a Thousand Fountains, Padawans Bene and Whie Malreaux stood with Temple battlemaster Cin Drallig as Sidious' apprentice Darth Vader descended on the group. As Vader slew young Malreaux, the former Jedi reached out with the Force and strangled Bene while cleaving through Master Drallig's shoulder with his lightsaber. Her death, as well as the deaths of the younglings she had died protecting, was recorded on a security camera, and was viewed by Masters Yoda and Obi-Wan Kenobi when they searched the ruins of the Temple."}, {"tag": "p", "text": "Decades later, after the fall of the Sith and the resurrection of the Jedi Order, Master Luke Skywalker viewed the same holorecord as it was preserved in the memory banks of astromech droid R2-D2."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bene was played by Mousy McCallum, the daughter of prequel trilogy producer Rick McCallum."}, {"tag": "p", "text": "Bene appears in the first four episodes of LEGO Star Wars: The Yoda Chronicles, voiced by Tabitha St. Germain In the show, she is depicted as one of the four Padawans taught by Yoda, yet her role can be considered non-canonical within Star Wars Legends as her confrontation with Vader in \"Escape from the Jedi Temple\" contradicts her death in the Room of a Thousand Fountains."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}