{"url": "Vollen_Sor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unidentified species", "Category:Jedi Knights of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vollen Sor"}, {"tag": "p", "text": "Vollen Sor was a male Jedi Knight of the Old Republic in 3653 BBY. Sor and Keevo, his Rodian Padawan, were on the planet Alderaan during the Alderaan peace conference between the Galactic Republic and the Sith Empire. During the peace conference, Sor and Keevo witnessed Jedi Knight Aryn Leneer leave the planet to seek revenge for her deceased Master, Ven Zallow, who had died at the hands of the Sith."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vollen Sor was a male Jedi Knight of the Galactic Republic in service to the Jedi Order. Sor and Keevo, his Rodian Padawan, were both on the planet Alderaan during the time of the peace negotiations between the Sith and Jedi in 3653 BBY. They were in the Eeseen spaceport when rogue Jedi Knight Aryn Leneer was preparing to leave Alderaan to avenge her Master Ven Zallow, who had recently died at the hands of Sith Lord Darth Malgus during the Sacking of Coruscant. When Sor asked her what she was doing, she simply stated that she was doing something for Zallow. Sor, Keevo, and Leneer talked for a while in the spaceport, and Leneer said farewell and prepared to leave. Sor and Keevo followed her to her starship to find out what she was doing, but Leneer would not tell them. Leneer removed her Jedi robes, signifying her departure as someone other than a Jedi, and told Sor to tell Master Dar'Nala, a Jedi Master at the peace negotiations, that she was sorry. After Leneer left, Sor picked up her robes with the same delicacy he would use to bear a fallen comrade."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vollen Sor was a considerate Jedi Knight who saw hope for the Republic even though he thought that negotiating with the Sith was madness. He was concerned for Leneer when he found out that she was leaving Alderaan and going away as a being other than a Jedi. He was so distraught when she left, that he picked up her robes that she had left with the care that one would use for a comrade who had fallen in battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vollen Sor first appeared in Paul S. Kemp's novel The Old Republic: Deceived published on March 22, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}