{"url": "Volt_Cobra", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bounty hunter starships", "Category:Smuggler starships"], "nodes": [{"tag": "h1", "text": "Volt Cobra"}, {"tag": "p", "text": "The Volt Cobra was the personal starship of the bounty hunter Sana Starros. She used it numerous times to carry goods and assist her friends in the Alliance to Restore the Republic. During a mission to capture Chelli Aphra, the Cobra was shot down by Imperial Inspector Magna Tolvan, and Starros was forced to leave the craft behind."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Volt Cobra was armed with two laser cannons, mounted on top of the ship to have a full three-sixty view for their targets. It also possessed at least one escape pod."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Volt Cobra eventually came under the ownership of the smuggler Sana Starros. During 0 ABY, she took it to Hradreek to sell a pair of lightsabers, formally owned by the Sith Lord Darth Atrius, to two different customers. After barely escaping the grasp of Darth Vader, who had obtained one and wanted the other, Starros was force to retreat from Hradreek on the Cobra with her other Sith artifacts."}, {"tag": "p", "text": "Starros later went to a planet to confront another smuggler named Han Solo, who she had married for a job they had done together. Her, Organa and Solo briefly argued, as Solo tried to convince his friend, Leia Organa, that Starros was deceiving her. Before Organa could return to the Invictus and leave, Starros ordered the Cobra to shoot and destroy the shuttle, trapping Leia and Solo on the planet with her. Starros planned to sell Leia to the Imperials who were waiting above the planet and contacted the orbiting Imperial-class Star Destroyer. TIE fighters, along with TIE bombers, then entered the planet's atmosphere and landed nearby. However, after Han told Starros that he'd also be taken by the Empire for his affiliations with the Alliance to Restore the Republic, Starros let both him and Organa onto the Volt Cobra to escape the planet. The TIE fighters pursued them, but the Volt Cobra managed to jump to hyperspace before they could destroy it."}, {"tag": "p", "text": "Following the escape from the Monsua Nebula, the Volt Cobra travelled to Nar Shaddaa, where Solo and Organa intevened in a fight between Dengar and Chewbacca."}, {"tag": "p", "text": "Sometime later, the Volt Cobra was tasked with transporting Chelli Aphra to the rebel penetry Sunspot Prison, following her capture during the Battle of Vrogas Vas. Aphra managed to break out of her cuffs multiple times and during the fourth occasion, Starros shook the ship to knock Aphra over, before coming out of the cockpit to knock her out. The Cobra made it to Sunspot Prison and Aphra was put into her cell."}, {"tag": "p", "text": "At some point, Starros took the Volt Cobra to meet with Krawg pirates. There, she offered to sell them thirteen crates of E-11 blaster rifles for a 5000 credit downpayment and a further 15000 credits for the rest. The pirates agreed and she took the Cobra to Coruscant, where she met with Lando Calrissian. After telling him about her deal with the Krawg pirates, she revealed her plan to sell them the crates, sell them out to the Empire for a reward, and keep the blasters. They met with an Imperial officer and she offered the names of the pirates and blasters for 20000 credits. The officer eventually agreed and after leaving with the credits, Starros revealed that she only had one of the thirteen crates all along, with Jabba the Hutt owning the rest. After tricking Jabba into a a deal which further went against the Krawg pirates, she stole the rest of the crates and put them onto the Cobra. As they left Tatooine, the Krawg pirates attempted to destroy the Cobra. Lukcily for her and Calrissian, a Star Destroyer intervened and captured the pirates' ship. They took the Volt Cobra to Nar Shaddaa and Calrissian parted from her there."}, {"tag": "p", "text": "Following the rescue of the protocol droid C-3PO from a Star Destroyer, the Volt Cobra arrived to assist 3PO and his rescuer out of the system. The Cobra later traveled with the Millennium Falcon to Horox III after their rebel outpost was massacred."}, {"tag": "h3", "text": "Shot down"}, {"tag": "p", "text": "Sometime later, Starros was contacted by General Hera Syndulla to obtain encryption codes from Chelli Aphra, who, at that point in time, was imprisoned in Accresker Jail. She tracked the wreckage-prison to its next target, a crippled pirate station, and waited nearby in the Volt Cobra. Once battle begun, Starros flew down in search of Aphra. She found her attempting to escape, with a TIE fighter present. Assuming the TIE was trying to hunt her down, she shot at it, crippling the starfighter. Starros attempted to warn the pilot not to retaliate, but the pilot, Magna Tolvan, ejected from the exploding TIE with a rocket launcher, firing it straight into the port side of the Cobra, downing the craft. Starros escaped the crash however, and engaged her adversary."}, {"tag": "p", "text": "Syndulla attempted to contact the Volt Cobra a short while later, but found no response from the wreckage of the ship. Later on, Accresker Jail was floating above the Alliance affiliated planet Tiferep Major. Following her escape from the prison, Starros brought a small squadron of Alliance starfighters to find Tolvan and Chelli. Along the way, their shuttle picked up the Volt Cobra and Tan Leader was taken out by Darth Vader. They were then forced to give up their search Aphra but made it out with Tolvan."}, {"tag": "h3", "text": "Smuggling fugitives"}, {"tag": "p", "text": "Following the attack on the Mako-Ta Space Docks. Han Solo, Leia Organa and Luke Skywalker approached Starros for help. She took them aboard the Volt Cobra and they went in search of Chewbacca and the Millenium Falcon. They stopped at Barnahof, to meet with an informant named Bodo Linx, before travelling to the Dene Gois Cluster, in hopes of reaching Brentaal IV. However, a Star Destroyer blocked their path, and Solo, Skywalker and Organa were forced to leave the Cobra via an escape pod. The three reached the moon Hubin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Volt Cobra first appeared in the canon comic issue Star Wars 5, written by Jason Aaron. It was then identified as the Cobra in Star Wars 8, before obtaining its full name in Star Wars 10, both written by Aaron and pencilled by Stuart Immonen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}