{"url": "Von_Asch", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Von Asch"}, {"tag": "p", "text": "Air Marshal Von Asch was a renowned male Human Imperial starfighter tactician and consultant for the TIE/IN interceptor project during the Galactic Civil War. Asch trained many of the young pilots that eventually formed the nucleus of the Empire's TIE interceptor force, but the Air Marshal was taken into custody by the fledgling New Republic shortly after the Battle of Endor. General Lando Calrissian later recruited Asch into his new commando unit, Lando's Commandos, for his experience with TIE interceptors when a pirate group consisting of former TIE interceptor pilots began attacking New Republic convoys. During a tense briefing regarding a mission to combat the threat, the Air Marshal was able to extrapolate that the TIE interceptor pirates were most likely based in the Abraxas system by comparing the locales of the attacks with the fuel requirements of the TIE interceptors."}, {"tag": "p", "text": "The commandos traveled to the planet Radix located within the system and were soon ambushed by pirate forces when their local pilot, Kine, betrayed them. Lieutenant Harme Kiela, leader of the pirates and one of Asch's former students, admitted that their whole operation was orchestrated to bring Asch over to their side as their new leader. The Air Marshal promptly refused, stating that Kiela and the pirates no longer possessed any honor and had disgraced him by resorting to criminal methods. After the fighting erupted once more, Kine attempted to kill Asch's fellow commando, Isolde Siro, with a lightsaber, but the Air Marshal took the blow instead, saving Siro's life. Asch later recovered from his severe injury and the mission ended as a success when New Republic reinforcements arrived."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Von Asch was a male Human who attained the rank of Air Marshal in the Galactic Empire and was revered as a brilliant starfighter tactician. During the height of the Galactic Civil War, Asch worked as a project consultant for the TIE/IN interceptor project and began training Imperial pilots in the operation of the fightercraft. He took talented, young pilots such as Harme Kiela and turned them into some of the Empire's most skillful dogfighters. Asch's protégés eventually went on to form the backbone of the Empire's collective TIE interceptor force. After the Imperial fragmentation following the Battle of Endor, Asch was taken into custody by the New Republic."}, {"tag": "p", "text": "When a group of former TIE interceptor pilots-turned-pirate began attacking New Republic convoys, General Lando Calrissian recruited Asch and several other individuals of questionable backgrounds into a commando group to repel the threat, dubbing them \"Lando's Commandos.\" Asch was chosen for his expertise in TIE interceptor tactics and his familiarity with the specific pilots involved in the attacks. He willingly agreed to aid the New Republic in tracking down the pirates, whom he believed no longer possessed Imperial honor."}, {"tag": "p", "text": "During the initial briefing, Asch's reputation caused several other commandos to question the Air Marshal's loyalty. Fellow commando Isolde Siro argued that Asch should have been locked away in a prison barge for the deaths he may have caused while in Imperial service, but Calrissian vouched for Asch's importance in the coming operation. The Air Marshal proceeded to brief the rest of the team on the TIE interceptor's capabilities, and argued that the starship's most lethal aspect was its pilot. He concluded that the pirate TIE interceptor squadrons needed a command ship or a planet to refuel and rearm from, and extrapolated the Abraxas system as the most suitable location for the pirate base using the known locales of their attacks."}, {"tag": "p", "text": "Guided by a local pilot, Kine, Asch and the commandos searched through the Abraxas system in Calrissian's freighter, the Millennium Falcon, and discovered that the pirates were based on the planet Radix. Upon landing on the planet, the only heat signatures the commandos detected were those of five TIE interceptors patrolling the skies above Radix, far fewer than they had expected, which lead Asch to believe that they had been led into a trap. The team was soon ambushed by hidden pirate forces, prompting Calrissian to order Kine to keep an eye on Asch during the battle. Kine, however, betrayed Calrissian and shot him with his blaster, taking Siro hostage just as the pirate forces surrounded the commando team. Lieutenant Kiela, leader of the pirates, explained that the entire operation had been performed to rescue Asch, who he believed was being forced to aid the New Republic against his will."}, {"tag": "p", "text": "When the pirates requested that Asch become their new leader, the Air Marshal refused, claiming that they were mere bandits and mercenaries without honor, and had both disgraced the Empire and degraded all he had taught them. Realizing that he could not turn Asch to his cause, Kiela attempted to kill the Air Marshal, but was thwarted when a wounded Calrissian attacked the pirate with his blaster and called in air support from New Republic forces. In the ensuing chaos, Kine produced a lightsaber and attempted to slay the captive Siro, but Asch stepped in front of the commando and took the entirety of the saber attack, saving Siro's life. Though Siro promptly killed Kine, Asch was grievously wounded in the attack and laid in a pool of his own blood. Before succumbing to unconsciousness, Asch told Siro that she was strong in ways others could not perceive and that she had a destiny. The mission ended up a success in the end, and Asch recovered from his injury soon afterward."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The brown-haired and green-eyed Von Asch held the idea of personal honor in very high regard. He was very proud of the pilots he trained and thought of both them and himself as warriors. Asch had a very low opinion of criminal elements such as pirates and mercenaries and took Kiela's transformation to their way of life very personally. He typically held a calm demeanor, even in the face of criticism by his peers, but he was prone to violent outbursts when a matter of personal honor arose. Upon hearing Kiela's request to make him the new pirate leader, Asch struck the lieutenant across the face and angrily grabbed hold of the man's jowls as he began rebuking his actions. Asch also willingly tried to sacrifice his life for Isolde Siro's, admiring the woman's strength and believing she had a special destiny."}, {"tag": "p", "text": "Asch was very knowledgeable of the inner workings of a TIE interceptor and was thought of as one of the most distinguished starfighter tacticians in the Empire. He believed that the TIE interceptor was an ace's ship and that the fighter's most lethal aspect was its pilot. The Air Marshal was renowned for taking some of the best starfighter pilots in the Empire and turning then into exceptional dogfighters. He also had a reputation that was known to many, including several other members of Lando's Commandos, one of whom was astonished at learning Asch's identity. After the mission, Calrissian was baffled at the thought that Asch had taken on the role of the \"hero\" by saving Siro's life, as opposed to betraying the team and joining the pirates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Von Asch was created for the comic story \"Lando's Commandos: On Eagles' Wings\" by Ian Edginton, published in Star Wars Tales 5 in 2000. Although the stories told in the first twenty issues of Star Wars Tales were deemed to be outside of conventional Star Wars canon, both Asch and the events of the comic were canonized in the 2001 Star Wars Gamer 6 article Unusual Suspects by Andrew Hind, which continuously misspelled Asch's surname as \"Tarsh.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}