{"url": "Voon", "categories": ["Category:Legends articles", "Category:Krenher sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Voon"}, {"tag": "p", "text": "Voon was a Core Worlds planet. A part of the Krenher sector, it was situated on the Hyabb-Twith Corridor hyperlane, a zone long embroiled in conflict between the worlds Hyabb and Twith. Decades before 4050 BBY, the Nelori Marauders established their main base on Voon. The planet's location in the contested area allowed the Nelori to carry out raids against starships and worlds both along the Corridor and in the nearby star systems without any fear of pursuit or reprisal."}, {"tag": "p", "text": "Eventually, the Jedi Order dispatched a task force of Jedi Knights to eliminate the threat posed by the Nelori Marauders. A small group of Jedi pursued the Marauders to Voon, where the former crippled the Nelori fleet before being repulsed by a counter-attack by Marauder reinforcements. Another, larger group of Jedi soon arrived onto the planet in specially-modified stealth transports. However, when the Jedi infiltrated the fortress used by the Nelori as their base, they could find no trace of the bandits."}, {"tag": "p", "text": "The Arkanian-Sephi Jedi Arca Jeth then used the Force to detect signs of life below the fortress, in the subterranean pockets littering the planet's crust. Jeth then led his fellow Jedi into a large chamber underground, where the group faced an unexpected cave-in, followed by an ambush by the Nelori Marauders. Although the ensuing battle proved costly to the Jedi force, Jeth's use of the battle meditation technique allowed the Jedi to ultimately defeat the Marauders."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Voon was a terrestrial planet located in the Voon system, a part of the Core Worlds' Krenher sector. It was situated on the hyperlane known as the Hyabb-Twith Corridor, which connected it to the Hyabb and Twith systems."}, {"tag": "p", "text": "Voon orbited a single blue-white sun which illuminated the planet with a cool glare. Below its surface, the planet's crust was littered with empty subterranean pockets."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Main base of the Nelori Marauders"}, {"tag": "p", "text": "When a series of defeats led the Nelori Marauders—a band of warriors, outlaws, and pirates—to flee their homeworld Dachat, the group saw an opportunity for a new base on the Hyabb-Twith Corridor. The area surrounding the hyperlane had long been a zone of conflict between the planets Hyabb and Twith, and neither planet dared to dispatch patrol ships in the area and risk reprisals from the other world."}, {"tag": "p", "text": "As a result, when the Nelori Marauders established their main base on Voon decades before 4050 BBY, they could freely perform raids against starships traveling along the hyperlane. In addition, since other worlds were also discouraged from sending forces to the Hyabb-Twith Corridor, the Nelori could raid star systems neighboring the area and retreat back there without any fear of retribution."}, {"tag": "h3", "text": "Jedi intervention"}, {"tag": "p", "text": "Eventually, the expanding Nelori sphere of influence began to threaten the commerce traffic and the central member worlds of the Galactic Republic. In response, the Jedi Order, an organization of Force-sensitive peacekeepers affiliated with the Republic, dispatched a task force of Jedi Knights to eliminate the Marauders, thereby initiating a series of confrontations known as the Hyabb-Twith Campaigns."}, {"tag": "p", "text": "A small group of Jedi subsequently pursued Nelori starships into the Hyabb-Twith Corridor and proceeded to attack their base on Voon. The Jedi crippled the majority of the Nelori fleet, depriving the bandits of the ability to fight in space. However, Marauder reinforcements composed of the remained of their forces from nearby bases throughout the Corridor then arrived and forced the Jedi back in a fierce counter-assault, although two Jedi starships survived the confrontation and performed constant sensor sweeps of the planet, monitoring any arrivals and departures."}, {"tag": "h3", "text": "Victory on Voon"}, {"tag": "p", "text": "A group of thirty more Jedi Knights, including the Arkanian-Sephi hybrid Arca Jeth, arrived on Voon less than two days later to join their fellow warriors on all-out planet-side attack on the Nelori Marauders. To gain the element of surprise, the Jedi silently penetrated Voon's atmosphere in unarmed transports rigged with counter-sensor arrays and low-output power compensators. Shortly before the dawn of Voon's sun, the Jedi reinforcements dropped on the roof of the Nelori stronghold, swiftly infiltrating the fortress and searching its topmost levels for the Marauder forces. To the Jedi's surprise, however, the structure appeared to be completely abandoned, leading the Knights to wonder how the Nelori had slipped past the Jedi sensor sweep of the planet."}, {"tag": "p", "text": "The Jedi Knight Jeth then unsuccessfully attempted to use the Force to detect any Nelori forces in the lower levels of the stronghold. Still suspecting that the Marauders had not abandoned the fortress, Jeth proceeded to search the depths of the planet below the fortress and perceived an unusual feeling of living beings there. Jeth then led his companions toward the source of the sensation. When the group of Jedi finally entered a large subterranean chamber without having encountered any sign of the Nelori so far, the Knights began to argue among themselves over the trustworthiness of Jeth's sensation. At that point, all of the Jedi sensed a dark presence passing through them, causing them to search their surroundings for the feeling's source."}, {"tag": "p", "text": "A massive cave-in occurred in the chamber then, immediately injuring four of the Knights present, followed promptly by an all-out assault by a force of more than two hundred Nelori Marauders. In the ensuing fierce battle, although the Jedi put up an efficient fight against their enemy, the numbers of the former constantly diminished. Realizing the hopelessness of their situation, Jeth realized he had violated his own Jedi training by letting his emotions affect his judgment. Jeth then proceeded to apply the Jedi battle meditation technique, which allowed the Jedi warriors to strengthen their resolve and ultimately prevail over the Nelori. In the weeks following the Jedi's costly victory over the Marauders on Voon, Jeth led the Jedi in chasing down and defeating the remainder of the Nelori forces scattered throughout the Hyabb-Twith Corridor."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Following the Nelori Marauders' departure from their homeworld of Dachat, the group established their main base in a stronghold on Voon. A multi-floored structure, the fortress featured a broad, stepped roof, slitted windows, hollow hallways, and wide spiral staircases."}, {"tag": "p", "text": "At the ground level of the stronghold, a rough-hewed, sloped tunnel descended into the subterranean levels of the structure. One hundred meters lower, the passageway curved into a spiral that led further down into the depths of Voon. An hour-long descent along the spiral led to an immense cavernous chamber with rocky walls and ceiling."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Voon was introduced in the Tales of the Jedi Companion, a 1996 sourcebook authored by George R. Strayton and published for use with West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Voon system, and therefore the planet itself, in grid square K-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}