{"url": "Voorpee%27s_clones", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Articles with conjectural titles", "Category:Character stubs", "Category:Clones", "Category:Voorpaks"], "nodes": [{"tag": "h1", "text": "Voorpee's clones"}, {"tag": "p", "text": "During the Jedi Padawan Roan Novachez's third year at the Jedi academy at the Jedi Temple on Coruscant, hundreds of clones of the voorpak known as Voorpee were created. The clones were first used as part of a prank against Novachez when he was caring for the voorpak. Each time he returned him to his cage, one of his friends would run up to inform him that he had seen him elsewhere in the school. Novachez was left running around the school all day, retrieving the clones, left to wonder how Voorpee had escaped, as he had double-locked the cage. Later, the clones were used to create chaos at the school's talent show. The event happened as the Novachez and Gaiana attempted to perform a talent act with Voorpee, who had been trained to perform tricks, only to discover that he too had been replaced with a clone. The voorpak would not answer to any of the commands that Voorpee had been trained with as part of the act, then leaped onto Gaiana and urinated on her head. During the incident, Cyrus's arm was broken and he had to wear a sling and cast due to the school's bacta tanks being down for maintenance. The voorpaks were claimed by Gaiana, who took them to the Naboo Zoo over her spring break. The zoo was not able to accept all of the voorpaks, so Gaiana enlisted the help of a Voorpak Rescue Organization, which agreed to take in all of the remaining voorpaks but one. Gaiana talked her parents into letting her take in this last remaining voorpak as her personal pet. It was revealed at the end of the school year that the students Ronald Rinzler and Cronah were responsible for this and other pranks on Novachez throughout the school year, having teamed up against Novachez."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Voorpee first appeared in Jedi Academy: Return of the Padawan, these clones were only seen in Jedi Academy: The Phantom Bully."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}