{"url": "Voorpak/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Creature stubs", "Category:Articles with non-canon elements", "Category:Carnivorous creatures", "Category:Creatures of Naboo", "Category:Domesticated creatures", "Category:Mammals", "Category:Non-sentient species", "Category:Voorpaks"], "nodes": [{"tag": "h1", "text": "Voorpak"}, {"tag": "p", "text": "Voorpaks were a non-sentient but still quite smart species of puffy-looking creatures that were native to the Mid Rim world of Naboo."}, {"tag": "p", "text": "Diminutive carnivores, voorpaks were much beloved by many ladies of Naboo. Despite their beguiling appearance, they were brave and loyal, and could be quite fierce when provoked or frightened. They possessed a full set of needle-sharp teeth, as well as large eyes well suited for nocturnal vision. In the wild, they lived in small colonies that dotted the craggy rock outcroppings of the hill country. They were most active during twilight hours, prowling for water and prey."}, {"tag": "p", "text": "Due to the voorpaks' light weight, their bone structure could support eight legs without significant difficulty. Voorpaks emitted a soothing, cooing purr, which rose to a hum when alarmed. They rested with legs tucked under body to conserve heat. Their fur was extremely soft. Voorpaks came into heat once a year. They produced litters of three to five pups. For centuries, noblewomen and the aristocracy of Naboo kept voorpaks as mascots and pets, carrying them about in their pockets and sleeves. They also made great hand warmers in the winter. Their pleasant scent was also a much-admired quality."}, {"tag": "p", "text": "A Quermian diplomat of the New Republic had a pet voorpak."}, {"tag": "p", "text": "During Roan Novachez's second year at the Jedi academy on Coruscant, the students were given the opportunity to care for a pet voorpak named Voorpee, on loan from the Naboo Zoo. The voorpak returned in the next school year. This particular voorpak enjoyed eating insects."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}