{"url": "Voren_Na%27al/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Military enlisted personnel", "Category:Alliance Military officers", "Category:Galactic Alliance individuals", "Category:Historians", "Category:Humans", "Category:Journalists", "Category:Males", "Category:New Republic individuals", "Category:Tarkin family"], "nodes": [{"tag": "h1", "text": "Voren Na'al"}, {"tag": "p", "text": "Voren Na'al was a prominent Human male historian in the service of the Alliance to Restore the Republic and its various successor governments. He began his career as a reporter for the Galactic News Service. His experiences and imprisonment during the Imperial overthrow of the government of Corsin drove him into the arms of the Alliance. There, after a stint as a spy, he became a historian under Master Historian Arhul Hextrophon, tasked with compiling the histories of the Heroes of Yavin. Na'al traveled to Tatooine and Galvoni III to acquire information and context on the events preceding the battle, and conducted interviews with the participants, submitting the information in a report to Hextrophon. Subsequent reports included an attempt to discover the truth behind Han Solo and Chewbacca's adventures on Aduba-3, a 168,000-DSU report on the Rebel Alliance for Mon Mothma, an account of the events surrounding the Battle of Hoth and the tribulations of the Heroes of Yavin afterward, a report on the Battle of Endor, and a piece on the Battle of Turak IV."}, {"tag": "p", "text": "With the dawn of the New Republic, Na'al's historical works led him to continued advancement. He became the Director of New Republic Council Research and Assistant Historian to the Republic, and he created reports on Grand Admiral Thrawn's and the resurrected Palpatine's campaigns, as well as of Han Solo's experiences in the Corporate Sector years before. He also compiled the Oral History of the New Republic, and later edited and annotated \"Ten Years After: Notes on the Mature Organizational and Administrative Structure of the New Republic,\" an article by the Chief Historian of the Kellmer Institute."}, {"tag": "p", "text": "Na'al retired as Head of New Republic Council Research, becoming a history professor and marrying former deep-cover spy Rivoche Tarkin, with whom he had several children. After the Yuuzhan Vong War, he became archivist emeritus of the Historical Council of the Galactic Federation of Free Alliances, in which capacity he supervised the release of the second edition of an important historical chronicle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Voren Na'al was the son of a Human family devastated by the Clone Wars, a galaxywide conflict waged between the Galactic Republic and Confederacy of Independent Systems between 22 and 19 BBY. Na'al lost grandparents, aunts, and uncles in that conflict that he never had the opportunity to meet. As a result, he carried some prejudice regarding the idea of cloning into adulthood. Even as a boy, he was interested in the causes of galactic events. History and journalism became hobbies of his, nurtured by his journalism teacher, Arhul Hextrophon."}, {"tag": "p", "text": "His hobbies soon blossomed into a fledgling career, as Na'al became a stringer for the Galactic News Service. On the planet Corsin in the Greater Plooriod Cluster, Na'al was first exposed to the depredations of the Galactic Empire. Na'al was fortunate to get an assignment covering the prestigious swoop races there. While covering the opening matches, a platoon of stormtroopers burst into the press area and placed everyone under arrest. Na'al was kept in a detention cell for three weeks, visited only occasionally by an interrogation droid that asked no questions. No reasons were ever given for his incarceration, but later, Na'al discovered that the Galactic Empire had deposed the government of the world and replaced it with one dedicated to the New Order, dispensing with civil rights and placing the entire population under a police state. The imprisonment of the journalists had been a method of keeping them silent."}, {"tag": "p", "text": "Na'al was disturbed by this event, and realized he had two options: quit reporting and ignore the growing tyranny of the Empire, or go all-out and show the galaxy what the Empire was becoming. Before he had the opportunity to pursue the more reckless path, he had a chance encounter with his old teacher, Arhul Hextrophon. Hextrophon had been with the Alliance to Restore the Republic since its inception, and convinced Na'al that the young reporter could make a difference in the Galactic Civil War by joining the Rebellion."}, {"tag": "h3", "text": "Historian for the Rebellion and the Battle of Yavin"}, {"tag": "p", "text": "Na'al was initially made a spy, but was soon placed in the Historian Corp, a special Rebel squad under Major Hextrophon, the Alliance's Master Historian. While still freshly recruited, Na'al made the acquaintance of a Rebel-sympathizing Imperial cadet named Biggs Darklighter. When Darklighter discovered that Rivoche Tarkin, the niece of Grand Moff Wilhuff Tarkin, was quite willing to spy for the Alliance, he put her in contact with Na'al. Rivoche's precarious position as a deep-cover spy meant that Na'al was one of the few Rebels who knew of her existence, and also one of the most vocal advocates for extracting her before the Empire realized her role."}, {"tag": "p", "text": "Within a few years of joining the Rebellion, Na'al had earned the rank of Lieutenant. In 0 BBY, he and Hextrophon were at Massassi Outpost on Yavin 4 following the Alliance's victory over the Empire's Death Star battlestation at the Battle of Yavin. After the battle, they participated in the ceremony awarding the Medal of Bravery to Luke Skywalker, Han Solo and Chewbacca. Na'al was responsible for bearing one of the medals, which General Jan Dodonna handed to Princess Leia Organa of Alderaan, who awarded it to Skywalker."}, {"tag": "p", "text": "Hextrophon assigned Na'al to write an account of the Battle of Yavin and the events surrounding it, for inclusion into the Official History of the Rebellion, Volume One. Starting from the Rebel base at Thila, Na'al took a circuitous route via Yuga 2 and the Kuari Princess to Tatooine to begin his research, under the guise of being a reporter for the Imperial News Bureau. On Tatooine, he encountered the Squib trader Macemillian-winduarté and his business partner, the Jawa Aguilae, trying to peddle two droids, which Na'al succumbed to purchasing. By chance, these droids happened to be R5-D4 and an EG-6 power droid, both of which had been present when Jawas had captured and subsequently sold the droids R2-D2 and C-3PO to Skywalker's family. After thoroughly cleaning the two droids and interviewing them for all relevant information, he gave the power droid to a needy moisture farmer, and sold R5-D4 to Tour Aryon's assistant administrator, where the droid spied for the Alliance. While in Mos Eisley, he sought out Chalmun's Spaceport Cantina, and interviewed several of the patrons therein."}, {"tag": "p", "text": "He then traveled to the Imperial bureaucratic hub of Galvoni III, where he sliced into restricted computer files at the Imperial Records Office to acquire an overview of the first Death Star and its crew, only narrowly escaping capture. Upon his return to Thila, Na'al conducted interviews with the Heroes of Yavin themselves, including an interview with Luke Skywalker conducted from the gunner's seat of Skywalker's airspeeder during a patrol of the planet. All the information he acquired on his journey was compiled in a report to Hextrophon."}, {"tag": "p", "text": "At some point following the Battle of Yavin, individuals on Tatooine were accused of being Na'al and his companions, and subsequently wanted for questioning by the planet's Imperial authorities. Imperial Prefect Eugene Talmont was investigating a datatape left by Na'al on a prior journey to Tatooine, and hoped to interrogate the suspects so he would not have to spend time decoding the tapes. Encouraged to bribe Imperial government agent Beeyon Nace for information at Chalmun's Cantina, the suspects learned that the Prefect placed a 1000 bounty on Na'al. Learning Talmont kept the tapes within the planet's Regional Government Offices, the suspects subsequently broke into the building in order to tamper with them. The tapes were decoded, and Talmont found their apparent contents—a result of the individuals' tampering—to be completely worthless, and the suspects were let go in what was considered a case of mistaken identity."}, {"tag": "h3", "text": "Aduba-3 Assignment"}, {"tag": "p", "text": "In 2 ABY, Na'al was tasked by Hextrophon to ascertain the truth of Han Solo and Chewbacca's adventures on Aduba-3. He began by retracing Solo's steps after his departure from Yavin 4, confirming that he encountered the pirate Crimson Jack and his gang, but afterward, sketchy and contradictory information thwarted his attempts to compile a consistent historical narrative the duo's activities. On Aduba-3, Na'al compiled information on the planet from official planetary records and his own observations. He made contact with the Verpine Sacred Way priest known as Pera, who agreed to an interview after Na'al gave a sizable donation to the Sacred Way, and confirmed that Solo and Chewbacca had been in Tun Aduban spaceport. He also located the Wroonian Azoora in Locru's Central Saloon, and briefly interviewed her regarding the local swoop gang; however, her boyfriend cut the interview short by threatening Na'al with a non-consensual tracheotomy, forcing the historian to concur with graffiti in the saloon 'fresher that \"blue lady is trouble.\""}, {"tag": "p", "text": "Attempts to interview any of the surviving so-called \"Star-Hoppers of Aduba-3\" came to naught. As most of Aduba-3's population was transient, even finding an eyewitness to the event was fruitless. Second-hand stories conflicted, and Na'al believed them to be heavily tainted by Eight for Aduba-3: The Saga of the Starhoppers, a sensationalist Tri-Nebula Entertainment holodocumentary of the events."}, {"tag": "p", "text": "On his final day on Aduba-3, Na'al regarded the local farmer and former Starhopper Jimm Doshun as his only hope of getting to the bottom of things. Unfortunately, a death threat from the bounty hunter Valance made him unwilling to talk, and though Na'al interviewed his wife Merri, he found her to be unhelpfully credulous, repeating elements from Eight for Aduba-3 that strained Na'al's belief. As his transport was about to depart, he cut the interview short, leaving him despairing of ever knowing what happened on Aduba-3. He struggled with the report until his deadline had come and gone, ruled out requesting an extension due to budgetary constraints, and ultimately accepted the need to submit his partial reports to the BRT supercomputer Mistress Mnemos and send Hextrophon an apologetic missive."}, {"tag": "h3", "text": "The Battle of Hoth and its aftermath"}, {"tag": "p", "text": "Generally impressed with his work, Hextrophon tasked Na'al with generating an executive summary of a 168,000-DSU report on the growth, organization, equipment, activities and objectives of the Alliance for Mon Mothma. Na'al completed the summary in 3 ABY."}, {"tag": "p", "text": "Na'al was relocated from the base on Thila to Echo Base on Hoth. General Carlist Rieekan, realizing his job as a historian was largely a passive one, put him to work, first on courier duty delivering messages between ranking personnel while the station's communication equipment was still being adapted to the cold, and later in other noncombatant capacities."}, {"tag": "p", "text": "He was present in the command center when Bervin, a Rebel maintaining watch from one of the base's many perimeter posts, sent in a brief, panicked comlink call. He accompanied Major Bren Derlin to Bervin's post, only to find the sentry gone, with a blood trail leading through a caved-in wall into the Hoth night. Further attacks on sentries occurred, followed by the actual assault: a pack of Wampas bursting through the snowy walls of the base, driven into berserk rages by the high-pitched acoustic signaling of the base's astromech droids. The beasts outside Echo Base were driven off by the determination and weaponry of the Rebel forces, while the ones that had made it into the base were rounded up with recordings of the droids, stunned to incapacitation, and penned in non-vital areas."}, {"tag": "p", "text": "Na'al was again in the command center when General Solo brought in the remains of the self-destructed Viper probe droid, and aided Echo Base technicians in reconstructing some of the droids memory circuits. As a noncombatant, Na'al was supposed to evacuate aboard the Rebel transport Quantum Storm, the first transport off the icy world. Instead, he remained behind, assisting the evacuation efforts of the other transports and gathering holo-recordings of the Battle of Hoth from the trenches, though before long he discarded his holorecorder and datapad for the comfort of a blaster rifle. In the course of the battle, he broke his ankle in a cave-in, but successfully made it to the Thon's Orchard, one of the final transports to escape. He waited patiently at the rendezvous point for the Heroes of Yavin, who eventually arrived, allowing him to continue his research and write a detailed account of their travails. For his part in the Battle of Hoth, he was awarded the Mantooine medal of bravery, and his recordings helped Rebel tacticians analyze the battle."}, {"tag": "h3", "text": "The Battle of Endor and the Alliance of Free Planets"}, {"tag": "p", "text": "In 4 ABY, Na'al was present with the Alliance fleet mustering at Sullust in preparation for the attack on the second Death Star when the Heroes of Yavin returned from their successful rescue of Han Solo. Na'al regarded this event as one of the most inspiring events as his life. Na'al was a participant in the Battle of Endor and the subsequent celebration held by the Rebels and Ewoks at Bright Tree Village, where he became somewhat inebriated on a fermented grava berry brew, and was coaxed into dancing to the Starfarer's Return with several Ewoks."}, {"tag": "p", "text": "The day after the celebration (following the subsidence of his hangover), Na'al departed for Tatooine. His journey was interrupted when an Imperial Customs Frigate stopped his starship, but his cover identity as a stringer for the Galactic News Service, a role he was quite experienced in, went unchallenged by the officious Imperial Customs official. In Mos Eisley, Na'al found the city in the midst of a gang war as various factions vied to take control of the criminal empire of Jabba the Hutt, whom the Heroes of Yavin had killed in the rescue of Han Solo. While in the city, he brought news of the death of Emperor Palpatine to a small celebration being held in honor of the rescue of Diew Rejeff, a merchant and close associate of Chalmun. Na'al soon left Mos Eisley, hiring a repulsorcraft to take him to Obi-Wan Kenobi's hut, and then on to Jabba's Palace. There, he spent three days posing as a spice dealer, agreeing to supply Bib Fortuna with spice, to aid Ephant Mon in overthrowing Fortuna, to aid Ree-Yees in killing both Fortuna and Mon, avoiding being poisoned, and killing a Gamorrean guard in self defense, all while collecting information on the events surrounding the rescue of Han Solo."}, {"tag": "p", "text": "After returning from Tatooine, Na'al was briefly stationed on Endor, where he interviewed General Solo's strike team and the Ewoks who had participated in the ground battle, retraced their steps through the Endorian forest, and reviewed the efforts of Wicket and other Ewoks to reclaim the Endor shield generator bunker. However, his furlough on Endor was short-lived, as Mon Mothma gave him orders to take the first transport to the Imperial data storage facilities on Halowan and gather information on the Imperial command structure at Endor. With the assistance of Alliance Intelligence and the disruption of Imperial security procedures caused by the Battle of Endor, Na'al was able to capitalize on his cover as an agent of Fakir sector's Moff Lorin to get full access to everything he was looking for, despite the security code Intelligence had given him being out of date. The Imperial record-keeping system was so well organized, Na'al finished his research in a single day. Upon returning to the fleet, Na'al submitted his report on the Battle of Endor to Alliance High Command."}, {"tag": "p", "text": "Na'al had also been assigned to research the events of the Battle of Turak IV, and his information gathering on Halowan had included details regarding the forces of Imperial General Maltaz at the battle, including the two battalions of the Hell's Hammers that were involved in the attack on Turak IV. He combined the information he gathered on Halowan with interviews with Commander Torv Keist, a survivor of the Hitak Harriers, the Rebel unit that participated in the battle."}, {"tag": "p", "text": "A few weeks after the Battle of Endor, Na'al was tasked with presenting the report to the Provisional Council of the Alliance of Free Planets regarding the Invasion of Bakura. Na'al's report concluded by advocating for the suppression of information about the Ssi-ruuk to the galaxy at large, and for committing a task force to negotiate with the Ssi-ruuvi Imperium from a position of strength. These recommendations were provocative, leading to a challenge by Councilor Borsk Fey'lya that Na'al rebuffed."}, {"tag": "p", "text": "Following the believed death of Boba Fett and the Alliance's confiscation of his starship, Slave I, Na'al was in a position to influence what happened to the vessel. Lando Calrissian attempted to persuade Na'al that the ship should be rented to carnivals. Na'al was nearly convinced by Calrissian's idea, but Admiral Ackbar vetoed the plan."}, {"tag": "h3", "text": "Historian for the New Republic"}, {"tag": "p", "text": "When Moff Abran Balfour was deposed by the Laramus Base Irregulars mercenary organization, Na'al was dispatched to Parmic sector to examine the Moff's stronghold and any Imperial records stored there. While sifting through those files, he accidentally triggered a defense mechanism which opened a trapdoor. It dropped him into the midst of Balfour's menagerie, leading the timid historian to loudly scream in a manner humorous to the Irregulars. According to General Airen Cracken, this made Na'al \"uniquely qualified to discuss nonsentient life forms,\" a joke which Na'al did not find very funny."}, {"tag": "p", "text": "Prior to the Liberation of Coruscant, Na'al interviewed Wedge Antilles regarding the life of Baron Soontir Fel for the historian's Oral History of the New Republic. This work also contained an interview with General Lando Calrissian regarding his victory over Norulac pirates at the Battle of Taanab."}, {"tag": "p", "text": "Voren Na'al was eventually promoted to the positions of Director of New Republic Council Research and Assistant Historian to the Republic. He compiled reports on the campaigns of Grand Admiral Thrawn against the New Republic as well of those of the cloned Palpatine. He also began growing close to former New Republic Intelligence Service agent Rivoche Tarkin, who provided him with firsthand accounts of the devastation of Coruscant in her new profession as journalist."}, {"tag": "p", "text": "Shortly after the Battle of Mon Calamari, Na'al interviewed Han Solo on New Ralltiir regarding his exploits in the Corporate Sector, hoping to gather information useful to New Republic forces expanding into that region. He prepared for this interview by compiling a report on Solo's Imperial Navy career from records captured by New Republic Intelligence at the Ompersan data vault; he later sent this information to Hextrophon. At some point following the final defeat of Palpatine, Na'al interviewed retired Governor-General Nahdonnis Praji of Kaikielius, during which Praji recounted his only encounter with the reborn Emperor."}, {"tag": "p", "text": "In 17 ABY, Academician Na'al, in cooperation with New Republic Intelligence, edited and annotated \"Ten Years After: Notes on the Mature Organizational and Administrative Structure of the New Republic,\" an article by Donn Gulek, Chief Historian of the Kellmer Institute. This article, which detailed the structure of the New Republic after its most recent internal reorganization, was included in a New Republic Intelligence dossier on the Black Fleet Crisis."}, {"tag": "h3", "text": "Later years"}, {"tag": "p", "text": "Na'al eventually retired as Head of New Republic Council Research, becoming a history professor. He and Rivoche Tarkin were married, and had several children together. Their son Gideon, named after Rivoche's father, later co-authored Star Maps and Scripts: The Rakata Connection with Dr. Corellia Antilles. Nearly ten years after the destruction of Mount Tantiss, he enlisted the help of one of his students, the Devaronian Pollo Tipn, in investigating for Mon Mothma some unusual reports emanating from the Kathol sector, reports connected to Grand Admiral Thrawn."}, {"tag": "p", "text": "Following the Yuuzhan Vong War, Na'al became the archivist emeritus of the Historical Council of the Galactic Federation of Free Alliances. He oversaw the release of the second edition of an important historical chronicle, around the time of the events of the Killik conflict. This record included a comprehensive discussion of the Jedi and Sith conflict. For Tionne Solusar's 40 ABY guide to the Force, Na'al provided information on a Jedi who arrived on Dathomir in 30 BBY, identifying him as Quinlan Vos and indicating he stopped a Nightsister named Zalem from using the ancient Infinity Gate to devastate Coruscant. However, Na'al acknowledged that this information was drawn from a single unreliable source, the 28 BBY memoir of Ros Lai, an alleged former Nightsister."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Voren Na'al was an unimposing youth when he first volunteered for the Alliance, though his years recording the exploits of the heroes of the galaxy, and his adventures in documenting them, had made him a wiser and more experienced man late in life. During both phases of his life, however, he held great enthusiasm for the personalities he reported on; this occasionally led to a nearly unprofessional zeal in his writings, a trait which he was self-conscious of and for which he sometimes felt the need to apologize. His critics also found his writing to be overly focused on individual personalities. Nonetheless, his work was quoted by author Dr. Milanda Vorgan in her seminal work The Written Word: A Brief Introduction to the Writing Systems of Galactic Basic. He held his reporting to a high standard, never submitting any work to Hextrophon past deadline, or of which he could not be proud, until the frustrating assignment at Aduba-3 left him little recourse but to upload incomplete reports to Mistress Mnemos, with apologies to Hextrophon."}, {"tag": "p", "text": "Later in life, Na'al settled into his role as a family man, and turned down offers to explore abroad; it took a personal and persuasive request by Mon Mothma to convince him to go to the Kathol sector. His advancing age, and concern for the request of his wife that he not go alone, convinced him to take Pollo Tipn along as help."}, {"tag": "p", "text": "Na'al stood 1.8 meters tall. He was fair complected, with blond hair and brown eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Voren Na'al was a historian whose skills helped preserve a record of the Galactic Civil War, contributions that were memorable and valued by the Rebel Alliance. In particular, his straightforward style of reporting earned him respect and recognition amongst his peers. He was generally regarded as neither imposing nor remarkable, but he was intelligent, knowledgeable, dextrous, dedicated despite a slight cowardly streak, and quite lucky. He was adept with computers, having successfully sliced into the restricted computer files of the Imperial Records Office on Galvoni III and aided Rebel technicians in reconstructing valuable information from the remains of the probe droid Han Solo brought back to Echo Base. While Na'al was not regarded as skilled at intrigue, he nonetheless was briefly assigned by the Alliance as a spy, and later was able, with the assistance of Alliance Intelligence, to infiltrate the Imperial data storage facility on Halowan in the chaos following the Battle of Endor. He had little combat experience, but he survived a firefight or two prior to the Battle of Hoth."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Throughout his research missions during the Galactic Civil War, Voren Na'al carried with him a blaster pistol, datapad, holocam, falsified identification, and 700. At the Battle of Hoth, however, the grim reality of the Imperial advance led Na'al, who was an observer in the trenches outside Echo Base, to set aside his holorecorder and datapad and pick up a blaster rifle. In addition, Na'al kept a personal journal, wherein he kept private notes about the subjects whom he interviewed in the course of his research."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Voren Na'al originated as the in-universe \"author\" of several Star Wars: The Roleplaying Game sourcebooks published by West End Games (WEG), beginning with Galaxy Guide 1: A New Hope in 1989. He was created by author and designer Grant S. Boucher to provide an in-universe perspective on the subjects WEG covered in its works, and to leave room for uncertainty in these accounts, providing a gamemaster with a handy justification to ignore some facts in a sourcebook for his own campaign. The character's name is an anagram of the characters Aedon, Oren, and Ty Vaal from one of the author's unpublished manuscripts, while the illustrations of the character (young) are directly based on photos of the author that were provided to WEG."}, {"tag": "p", "text": "After WEG's bankruptcy, Na'al saw relatively little use. Pablo Hidalgo's 2001 article \"The Starhoppers of Aduba-3,\" from Star Wars Gamer 4, used Na'al to introduce uncertainty to its retelling of the Marvel Comics storyline begun in \"Star Wars 8: Eight for Aduba-3;\" by having Na'al express disbelief at the accounts he was hearing, it also implied that the outlandish camp of the original story was the actual truth. He re-appeared as author of the introduction to The New Essential Chronology in 2005; author Daniel Wallace noted that \"he seemed like the kind of guy who would get involved in a project like this.\" He was subsequently mentioned in several articles for Hyperspace, as well as in Jedi vs. Sith: The Essential Guide to the Force and The Essential Guide to Warfare."}, {"tag": "p", "text": "In 2012, the \"Rogues Gallery\" feature in Star Wars Insider 133 identified the two extras who bear the medals to General Dodonna as Na'al and Hextrophon, retroactively establishing that film as their first appearance. The actor playing Na'al was Derek Lyons, who also portrayed one of the Rebel Honor Guard members depicted earlier in the same scene. The film was the eighteen-year old actor's first. Lyons was chosen for both roles by the assistant director, Terry Madden, when he arrived at the studio for a fitting. His scenes were filmed at Shepperton Studios, rather than the main filming location at Elstree Studios in Borehamwood, due to the need for a large sound stage to represent the immense Grand Audience Chamber where the medal ceremony takes place. Lyons worked for two weeks on the movie, filming his scene as medal-bearer first, which took over a week as a result of the special effects logistics needed to make approximately one hundred actors portraying Rebels appear to be nearly a thousand. (In contrast, filming as the guard took only a few days.) While Lyons enjoyed both parts, he was more fond of his time as the medal bearer, as it included him in the film's final scene with the main characters."}, {"tag": "p", "text": "Lyons also appeared in Jan Dodonna's audience of Rebels during the Death Star plans briefing, and again in scenes set in the War Room during the battle itself. It is unclear whether he is portraying Na'al, the unnamed Rebel Honor Guard, or another character in these scenes, though Na'al expressly notes in Galaxy Guide 3: The Empire Strikes Back that he was not present for the events at the Battle of Yavin."}, {"tag": "p", "text": "The first edition of Galaxy Guide 1: A New Hope ends with Na'al formulating the beginning to a story he would tell based on his research. This beginning is the opening crawl for Star Wars: Episode IV A New Hope. The opening crawl is excised from the end of Galaxy Guide 1: A New Hope, Second Edition. In 1996, Na'al broke the fourth wall more directly, dispensing roleplaying advice about the galaxy, gamemaster characters, aliens, creatures, and planets directly to the players in Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}