{"url": "Vorhdeilo", "categories": ["Category:Canon articles", "Category:Bounty hunters", "Category:Cad Bane's group", "Category:Culisetto", "Category:Females"], "nodes": [{"tag": "h1", "text": "Vorhdeilo"}, {"tag": "p", "text": "Vorhdeilo was a Culisetto female bounty hunter prior to the Invasion of Naboo. At some point, Vorhdeilo worked alongside fellow bounty hunters Cad Bane, Aurra Sing, and Troo-tril-tek to assist Darth Maul in tracking down and capturing Eldra Kaitis. Vorhdeilo had a tendency to snack on the warm blood of freshly slain victims."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Meeting with Maul"}, {"tag": "p", "text": "The Culisetto female Vorhdeilo was one of four bounty hunters hired by the Zabrak Sith apprentice Darth Maul sometime prior to the Invasion of Naboo in the year 32 BBY. The Sith required aid in hunting down and killing the Jedi padawan Eldra Kaitis, who had been captured by the criminal Xrexus Cartel. After Vorhdeilo and her comrades Cad Bane, Aurra Sing and Troo-tril-tek discovered that the cartel had the padawan and planned to sell her at auction, they acquired invitations to the event by killing the Haddrex Gang, whose freighter Maul's DRK-1 Dark Eye probe droids had discovered."}, {"tag": "p", "text": "The group then found Maul on the moon Nar Shaddaa outside a bar surrounded by a group of four thugs, three of whom Sing and Bane shot in the back with their blaster pistols while Vorhdeilo killed the last with throwing knives. Bane informed Maul of their invitations while the Culisetto collected her knives, hoping to also feed on blood from the corpses; however, Sing warned her there was no time, as she had received word that several Jedi had been spotted nearby in Hutta Town and so Maul and the hunters needed to leave quickly."}, {"tag": "h3", "text": "Serving a Sith"}, {"tag": "p", "text": "The group then returned to the Haddrex's freighter where they had left Troo-tril-tek to interrogate the gang's protocol droid FE-B3. After Maul removed the droid's photoreceptor and blinded it, FE-B3 revealed that the auction was taking place on a space station in the Drazkel system. Using the gang's freighter, Maul and his bounty hunters then traveled to the space station and once there had FE-B3 calculate which of the other bidding parties was most likely to win. The droid predicted that a group of Moogans led by Jee Kra, and so while Maul attended the auction, Vorhdeilo, Bane and Sing boarded the Moogan's cargo ship and killed the crew that remained on board without using blasters."}, {"tag": "p", "text": "Jee Kra won the auction as predicted, and upon returning to his starship found the four hunters, Maul and the droid waiting for them. The Sith and his allies quickly dispatched the Moogan and took off in their vessel. Vorhdeilo and Troo-tril-tek were tasked with cleaning away the bodies while Bane and Sing piloted the ship and Maul imprisoned the padawan; however, the leader of the Xrexus Cartel, Xev Xrexus had predicted Maul's attack on the Moogan and rigged their vessel with explosives, which detonated as the ship left the station and disabled it."}, {"tag": "h3", "text": "The hunters become the hunted"}, {"tag": "p", "text": "The disabled ship quickly crashed upon the Moon of Drazkel with all onboard managing to survive the impact, although Troo-tril-tek was severely wounded and separated from the others. Realizing that they had been set up, the group spotted the rest of the auction bidders approaching in their vessels, as Xrexus had offered them the chance to hunt Maul and his allies for sport. The Sith ordered the group to split up and left with Kaitis, while Bane, Sing and Vorhdeilo set out to steal a ship they could escape on and destroy all vessels that might pursue them. The Culisetto noted that Troo-tril-tek was missing, but the trio assumed that he had been killed in the crash and wasted no times searching for him."}, {"tag": "p", "text": "A group of Trandoshans managed to follow the hunters' trail hoping it would lead them to the Jedi but found only Bane waiting for them at the end. The hunter challenged the Trandoshans' leader to a duel and he accepted, ordering his men to lower their weapons. With their foe unprepared, Vorhdeilo and Sing then ambushed the Trandoshans, with the Culisetto launching herself onto the leader from behind and Sing shooting with her blaster rifle from afar. Along with Bane, they quickly slaughtered the group and then moved on to where their Trandoshan prisoner ship had been parked."}, {"tag": "h3", "text": "Finding a ride"}, {"tag": "p", "text": "Vorhdeilo, Bane and Sing discovered the Trandoshan's vessel parked next to a Flarestar-class attack shuttle belonging to a group of Weequay who had been at the auction, and Sing pointed out that while the Trandoshan's vessel would be faster, the Weequay's would be carrying more valuable loot that they could take. Bane then used a smoke bomb to distract the two Trandoshan guards and kill them. While the Weequay guards were distracted by the Trandoshan's fate, Sing shot them in the back. One of the Weequay survived the shot, and Vorhdeilo asked Sing to leave him alive so that she could fed on him during their journey off-world."}, {"tag": "p", "text": "Sing and Vorhdeilo boarded the shuttle with their prisoner and took off, with Sing piloting the vessel. The Culisetto waited on the vessel's open boarding ramp to help Bane onboard as he used his rocket boots to catch up to his comrades. Using the Flarestar-class, Sing destroyed the other starships on the moon and then located Maul, who had killed Kaitis, FE-B3 and the remaining groups from the auction. After they picked him up he ensured they were compensated for their work, but had them drop him off on the cartel's space station so that he could kill Xrexus as well."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vorhdeilo had pink and yellow skin, red eyes and black hair. Maul considered her one of the most devious bounty hunters in the galaxy at the time that he hired her, and believed that while she was not strong in the Force, her desire for payment was great. Vorhdeilo spoke little and let Bane and Sing do most of the talking while they were together. She liked to feed upon the warm blood of her victims, preferring to do so while they were alive, but tolerating it if they were recently dead."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vorhdeilo wore a black skirt while working for Maul, with straps wrapped around her torso and limbs and tubing connected to the front. She carried four knives, which used both for throwing and hand-to-hand combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vorhdeilo was created by author Cullen Bunn and illustrator Luke Ross for the Star Wars: Darth Maul series of comic books, first appearing in the second issue, which was released on March 22, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}