{"url": "Voracious", "categories": ["Category:Legends articles", "Category:Carriers", "Category:Hutt Cartel starships", "Category:Slaver starships"], "nodes": [{"tag": "h1", "text": "Voracious"}, {"tag": "p", "text": "The Voracious was a starfighter carrier used by Zodoh the Hutt during his expansionary campaign into the Sith-dominated Grumani sector in 1032 BBY. It played an important role during the Aquilaris campaign as the Hutt crimelord's flagship and was responsible for coordinating his fleet of Stormdrivers; warships capable of creating artificial floods and storms. It was destroyed by agents of the Galactic Republic during the Battle of Darkknell, killing all crew onboard with the exception of Zodoh who was subsequently captured and executed by the Sith Lord Daiman."}, {"tag": "h2", "text": "Dimensions"}, {"tag": "p", "text": "The Voracious consisted of a large rectangular base with two large squares housing hangar bays. This rectangular section was loosely suspended to a massive circular ring by an unknown force field device. It was equipped with a hyperdrive and thus capable of long-distance interstellar travel. In its primary function as a starfighter carrier, the Voracious carried a large complement of Intruder-class starfighters along with a smaller number of twin-seater starfighters. Its hangar bay was equipped with artificial gravity and oxygen for ground crew and pilots to operate in the depths of zero gravity space. For space battles, the Voracious was also equipped with laser cannons and other anti-starfighter defense systems for naval engagements."}, {"tag": "p", "text": "In its frontal section, the Voracious also had a large rounded orange dome which served as a massive data processing center which doubled as a command deck for coordinating space battles. Under Zodoh, this frontal dome was used to coordinate his fleet of Stormdrivers, capital ships capable of generating artificial storms and floods. The rear section also had a smaller oval dome for unknown purposes. The decentralized nature of the ship enabled it to withstand small-scale explosions. However, damage to its large frontal dome with starfighter laser was capable of setting a chain sequence of explosions that could destroy the vessel."}, {"tag": "p", "text": "She was also equipped with a powerful tractor beam projector capable of trapping enemy starships. The Voracious also had sizable storage compartments for both consumables and trading goods since Zodoh also dealt in slaves and munitions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Voracious served as Zodoh's command ship and mobile headquarters during his expansionary campaign into the Grumani sector during the Republic Dark Age. It played an active role during the Aquilaris campaign by hosting a large data processing center within its central dome for coordinating a fleet of Stormdrivers, warships capable of vaporizing moisture and creating artificial storms. During the Battle of Capital Cay, Intruder-class starfighters launched from the Voracious were used to attack Sith Lord Daiman's forces at the port city of Capital Cay."}, {"tag": "p", "text": "Following the battle, Zodoh held a holoconference with the sector's Sith Lords in an attempt to browbeat them into cooperating with his plans to rule the sector. In return for keeping Daiman's forces preoccupied, he offered to become their supplier of munitions and slaves. However if they refused to cooperate, he threaten to the flood their worlds with his fleet of Stormdrivers. Leaving them to decide, Zodoh switched off the holotransmission. Following the capture of the Republic starfighter squadron Devil Squadron, Zodoh ordered a test demonstration on the water planet Aquilaris Minor. Zodoh was subsequently able to elicit the cooperation of the other Sith Lords in harassing Daiman's forces at the borders."}, {"tag": "p", "text": "The Voracious suffered some internal damage from a series of explosions during a successful escape attempt by Jenn Devaad, the Captain of Devil Squadron. The explosions were triggered by a series of rigged Deluge spice containers that had been outfitted with explosives. Jenn's attack was motivated by the murder of her squadron mates who were released through the airlock into deep space. Jenn subsequently managed to escape aboard a stolen Hutt starfighter."}, {"tag": "p", "text": "During the Battle of Darkknell, the Voracious led the attack on Darkknell, the capital world of Daiman's princedom. Its starfighters overwhelmed Daiman's defense force while its escorting fleet of Stormdrivers unleashed an artificial flood on Daiman. However, Zodoh's bid for power was foiled by the Jedi Knight Kerra Holt and Devil Squadron Captain Jenn Devaad, who had infiltrated Zodoh's fleet in a stolen starfighter. Kerra infiltrated the flagship and dueled with Zodoh while Jenn blasted a hole through the dome of the warship's data processing center; exposing the vessel to space. In revenge for the death of her squadron comrades, she destroyed the warship with a single laser blast, igniting it. This turned the tide of the battle in favor of the defending Daimanate forces."}, {"tag": "h2", "text": "Appearances"}]}