{"url": "Voroos", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Carnivorous creatures", "Category:Non-sentient species", "Category:Reptiles"], "nodes": [{"tag": "h1", "text": "Voroos"}, {"tag": "p", "text": "Voroos were a non-sentient, reptilian species of stationary predator that were found throughout the galaxy. Due to a lack of limbs, they could not chase prey, instead relying on camouflage and the use of their strong tongues to capture prey and pull it into their large mouths. Zoologists believed that the palak species of beetles were involved in voroos' reproduction, but the subject was poorly understood."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A non-sentient, six-eyed, predatory species of reptile, voroos measured between one and ten meters in diameter. The creatures camouflaged themselves to appear like natural geographical features, such as mossy hills and half-submerged tree trunks in swamps, or bare rocks and sand dunes in deserts. Lacking limbs, voroos had maws that were relatively large in comparison to the rest of their body, and were full of teeth and a strong, dexterous tongue. Though not particularly dangerous, voroos' teeth made it difficult to remove anything from their mouths without damaging it."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Voroos preferred moist environments like swamps but were able to survive in almost any habitat, including areas as extreme as deserts and tundras. They depended on their camouflage to catch prey, as they were unable to chase them due to their lack of legs. When a meal approached, voroos would wrap their tongues around the prey to pull it into their gaping mouths. Zoologists were unsure of exactly how voroos reproduced, although some theorized that near-microscopic beetles named palaks shared a large amount of their genome with voroos and, after swapping genetic material with them, carried the predators' fertilized gametes to new environments."}, {"tag": "h2", "text": "Voroos in the galaxy"}, {"tag": "p", "text": "Voroos could be found on many planets across the galaxy. Zoologists did not fully understand the species' method of reproduction, but a theory involving the palak species of beetle sharing genetic material with voroos was the subject of some study."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Voroos were mentioned in Creatures of the Galaxy, a 1994 sourcebook for West End Games' Star Wars: The Roleplaying Game. The concept and illustration of voroos were provided by Tom O'Neill, while the creature was designed by Chuck Truett."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}