{"url": "Vornskr", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Canines", "Category:Creatures of Myrkr", "Category:Force-sensitive creatures", "Category:Jungle and forest creatures", "Category:Nocturnal creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Vornskrs"], "nodes": [{"tag": "h1", "text": "Vornskr"}, {"tag": "p", "text": "The vornskr was a canine beast that could hunt using the Force."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The vornskr, native to the planet Myrkr, were a wild, vicious canine species that had the unusual ability to sense the Force. This ability evolved to help them hunt ysalamiri, but a side effect caused them to think that Force-sensitives were their favorite prey, including Jedi in their appetite."}, {"tag": "p", "text": "To counteract this hunting method, the ysalamiri developed the ability to project a \"Force bubble,\" inside which no Force abilities could be used."}, {"tag": "p", "text": "Vornskrs were primarily nocturnal hunters, and used their whip-like, mildly venomous tails to stun prey before finishing it off with their teeth. They were normally sedate during the day, but hunger or other factors would drive them to hunt during daylight hours."}, {"tag": "p", "text": "Before Jedi Master Mace Windu refined it into Vaapad, the Form VII style of lightsaber combat was referred to as the Way of the Vornskr."}, {"tag": "p", "text": "Tyber Zann was known to use such creatures within the Zann Consortium. After taking the younger vornskrs away, the pups were trained as effective hunters for enemy troops that managed to escape the confines of their imprisonment."}, {"tag": "p", "text": "The smuggler Talon Karrde kept two vornskrs, Sturm and Drang, as pets and guard animals, and considered offering them for sale as guard animals. He discovered that cutting off their whip-like tails was similar to castration, since it removed most of their hunting aggression, a fact he detailed in an article published in the Galactic Zoology Monthly."}, {"tag": "p", "text": "During the Peace Brigade attack on Yavin 4 during the Yuuzhan Vong War, Talon Karrde outsmarted the Peace Brigade by leading them into the hands of Kam Solusar and his wife Tionne. He achieved this by commanding his two vornskrs to find the Jedi and allowing the Peace Brigaders to follow the trail. Once he found the Jedi, the Peace Brigaders were effortlessly disposed of. During this pretended Jedi hunt, Talon Karrde convinced the Peace Brigaders into thinking that he was the owner of the last two remaining vornskrs. The Peace Brigaders seemed to believe him; however, the Yuuzhan Vong were informed by the traitorous New Republic Senator Viqi Shesh that the vornskrs hailed from Myrkr. The Yuuzhan Vong then used the species as a biological template for the voxyn."}, {"tag": "p", "text": "Vornskrs were also used as guards in the Dark Force Temple on Dromund Kaas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}