{"url": "Voss_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Outer Rim Territories species", "Category:Voss"], "nodes": [{"tag": "h1", "text": "Voss  (species)"}, {"tag": "p", "text": "The Voss were a sentient, humanoid species native to the planet of the same name, in the Voss system of the Allied Tion sector of the Outer Rim Territories. Their capital city was Voss-Ka, a fortified settlement atop a mountain. Their totalitarian society was defended by commandos and ruled by Force-wielding mystics, who served as seers and healers and whom the other members of the species considered infallible. The Voss population was small, vastly outnumbered by their homeworld's other native group, the Gormak—a species who saw the Voss as an aberration to be eliminated. For centuries, the Voss fended off the assaults of the Gormak. Following the Treaty of Coruscant in 3653 BBY, which ended the Great Galactic War and started the Cold War, off-worlders discovered the planet by chance, the Voss becoming known to both the Sith Empire and the Galactic Republic. The Empire attempted to conquer the planet, but the Mystics, forewarned by their gift of prophecy, revealed themselves to able to fend off the occupation forces. Following their mutual defeat, the Empire and Republic established embassies in Voss-Ka in an attempt to curry favor with the Voss."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Voss were humanoid sentients with a high rate of Force-sensitivity who displayed prominent sexual dimorphism. The male Voss had blue skin and bright orange eyes, while the females had red skin and azure eyes. The Voss did not have distinct pupils and possessed unique patterns of markings on their face, neck, and body, a trace of their shared ancestry with Gormak. Their voices had a slight mechanical tinge to it, making them sound somewhat like a droid or machine. Voss underwent a physical, developmental change during their marriage ceremonies and did not develop sexually prior to the performance of these rituals. With training, the Voss were able to access the Spirit World that existed on their homeworld to appear in faraway locations or to manifest as spirits after their death."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Voss species resided in an isolated mountain-top city of Voss-Ka and was vastly outnumbered on their homeworld by its other native sentient species, the Gormak, who were extremely hostile toward them. Most Voss live peacefully in Voss-Ka, caring for their families, cultivating the wild plants and maintaining equipment for the Voss commandos in the war against the Gormak, although some Voss did live outside the capital city, such as the Voss Mystics who resided in the Shrine of Healing. The Voss were great lovers of art, and their architecture featured a distinctive artistic style that had existed for thousands of years before contact with the Sith Empire and Galactic Republic, featuring monochromatic patterns with heavy reliance on symbolism. All Voss had two short names, connected by a hyphen, with the family name being the second one. For example, Bas-Ton was the brother of Therod-Ton and father of Phi-Ton and Yana-Ton, all of whom were descended from Zhi-Ton. Voss marriage ceremony known as the Rite of Ardor had the effect of fully awakening any mating instinct within the Voss that was typically suppressed in their society. As such, the Voss did not feel traits such as physical attraction until the ritual was conducted. Voss tended to be reserved, speaking very little, except during funeral rites and times of hardship, when Voss became outwardly emotional."}, {"tag": "h3", "text": "Voss Mystics"}, {"tag": "p", "text": "The entire Voss society was guided by Force visions of Voss Mystics, which were considered infallible without exception. The role of the Mystics dominated the life of Voss, with many potentials undergoing years of training and trials to become Mystics, ending in a pilgrimage across Voss, in which the potentials visited holy sites in the dangerous Gormak Lands and learned from their elders. The trials were dangerous, and some acolytes died while others failed, but those who passed the trials returned triumphantly to Voss-Ka to be recognized by the Three and joined the ranks of Mystics. Mystics often lived in seclusion of the Tower of Prophecy in Voss-Ka or at the Shrine of Healing in the Old Paths, the only significant Voss presence on the planet outside their capital. When Mystics experienced the rare visions, they were passed to the experienced Interpreters at the Tower of Prophecy to discern their meaning, who debated and meditated for as long as took before presenting their analysis to the Three, who acted on a decision which all Voss followed without exception. While visions were believed to always serve the greater good of the Voss people, in the short term they could bring great suffering. Over recoded Voss history, some visons led to a bloody civil war, mass starvations and destruction of half of Voss-Ka, but even that was only to spare the Voss from a worse fate, as a vision was never proven wrong, and ignoring them led to an even greater peril."}, {"tag": "p", "text": "In the Shrine of Healing the Mystics developed and practiced Voss healing ritual that allowed them to mend even the gravest of wounds, but at the cost of transferring the strength of another to heal the patient. Based on the holocron technology, the Mystics created the vitalicrons, machines designed to carry the memory and visions of those who went through the healing practices of the Mystics, which were then stored in the vault at the Shrine of Healing. Entire floors of the Shrine had special rooms with purpose known only to the Mystics, some of them dedicated for trials of potential Mystics or the Trial of the First Commando. An outcast sect of the Mystics called the Dream-walkers, not entirely embraced by the Voss society, practiced the ritual of Dream-walking in their encampment in the Mind healer's grove beneath Voss-Ka. Another ritual of the Mystics could restore even the most fractured mind, but was forbidden because it involved dream-walking alongside a Gormak, and was guarded by the Mystic Mar-Da. Despite their reliance upon and veneration of Force prophecies, the Voss held no formal knowledge of the Force and were uninterested in learning from either the Jedi or the Sith. The Voss Mystics were considered to be gray by the Jedi and the Sith for their non-standard perspective on the nature of the Force, as they belonged to neither order nor fully embraced either the light or dark sides of the Force."}, {"tag": "h3", "text": "Voss commandos"}, {"tag": "p", "text": "The Voss society revolved around their constant struggle to survive against the Gormak onslaught and although the Gormak sought the utter destruction of the Voss, Voss society held a strict law against attempting to wipe the Gormak out due to one of the visions of the mystics. Other than the Mystics, all adult Voss served a mandatory term as the Voss commandos, who defended Voss-Ka and its people against endless Gormak hordes. After their term some Voss returned to civilian lives, while other chose to stay and become commanding officers. All commandos were trained as scouts and in hand-to-hand combat, ensuring that every Voss was capable of defending themselves and understood the sacrifice necessary for the survival of their people. Voss commandos maintained multiple fortified outposts across the wildernes of Voss, while a special cadre of commandos protected the Shrine of Healing, patrolling the nearby hills for Gormak ambushes. The Voss were governed by the Three, who were chosen for either years, weeks or even hours according to the visions of the Mystics, and acted on the reports of the Interpreters, having little day-to-day contact with the Mystics themselves. Working from the Tower of Prophecy, the Three administered Voss-Ka, made policy decisions and coordinated the endless war against the Gormak. Voss laws were established by the Mystics, enforced by the commandos and judged by the adjudicators, a group created specifically for offworlders, as no Voss citizen would ever violate their rulers' edicts. The Voss viewed local predators mawvorr as their guardians or protectors due to their tendencies to attack the Gormak on sight and took steps to maintain the mawvorr population around Voss-Ka. Between the strong defenses and artistry of their home, as well as the guidance of their mystics, members of Voss society were generally pleased with the rule of the Voss Mystics, despite the totalitarian nature of their government."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Eternal War"}, {"tag": "p", "text": "In ancient times, at some point after the Second Great Schism, the Sith came to Voss, which at that point had only one native sentient species, the Gormak, whom the Sith viewed as primitive and ignored as they began to harvest the world's resources. However, the planet and the Gormak were irrevocably changed when the Jedi arrived and attempted to drive the Sith off Voss. Seeking allies among the natives, the Jedi agreed to teach some of the Gormak tribes how to use the Force, but the Gormak were unprepared for the knowledge. Those tribes underwent radical evolutionary changes within a few generations, becoming a new species named the Voss. The Jedi attempted to teach the Voss how to control their emotions and new powers, but the Voss instead attacked the Sith on the planet, bringing the new species in contact with the dark side of the Force. This caused the dark side to become manifest in a Sith structure on the planet, and this entity came to take the name Sel-Makor as it gained intelligence. Sel-Makor began to feed on violence and suffering, fueling its dark side powers and spreading corruption across the surrounding area, which became known as the Nightmare Lands, and the ancient Sith complex that the entity inhabited was known as the Dark Heart. After the extermination of the Sith, the Voss forgot their origins and founded the city of Voss-Ka atop the planet's highest peak, while the Jedi eventually died out or departed. Sel-Makor, meanwhile, influenced the Gormak's bloodlust and drove the far more numerous species to attack their cousins throughout the centuries so that he could feed off of their dark emotions."}, {"tag": "h3", "text": "Cold War"}, {"tag": "p", "text": "Following the Treaty of Coruscant that ended the Great Galactic War between the Sith Empire and the Galactic Republic, Voss was accidentally rediscovered by the larger galaxy around 3645 BBY. Upon learning of the Voss' prophetic abilities, Sith Emperor Vitiate ordered to conquer the planet, and General Khypes arrived in orbit with a battlecruiser and several army divisions in order to demand a surrender, having been alerted that the Voss capital of Voss-Ka was undefended. However, Khypes' cruiser exploded before he could contact the planet, and the ship's escorts were destroyed moments later. Realizing that they had underestimated the Voss, the Empire declared that Khypes had gone rogue, and both the Empire and the Republic began making diplomatic overtures to the Voss. The Voss decided not to allow these \"Outsiders\" into the Voss-Ka proper, but rather set a special Alien Enclave for them, containing both Republic and Imperial Embassy. The Voss species successfully maintained the neutrality of their planet, but the presence of the outsiders required the Voss to create Adjudicators specifically to govern the actions of the outsiders, with dangerous offenders force to take the Step of Harmony off the mountain into the gorge below. Since the Voss treated all outsiders equally, crime syndicates such as the Exchange could operate freely on the planet where Republic and Imperial law was not enforced, as long as they were not caught breaking the laws of the Voss."}, {"tag": "p", "text": "However, their efforts to gain Voss Mystics on their side were foiled by a secret society calling iteself the Star Cabal. An operative named Albathius arrived on Voss shortly after its discovery, and gained great influence among the Mystics, becoming known as the \"Shining Man\" and convincing the Voss to stay neutral from the Cold War between two governments for three thousand days, enough time for the Star Cabal to exert its own influence on the war and keeping the Voss from choosing a side. The Shining Man promised that in time, the Gormak, the Empire and the Republic would be eradicated, and no offworlders would come to Voss again, and was buried under Voss-Ka after his death. Not outsiders all came to Voss seeking a formal alliance or attempting to exploit their lax laws, as many offworlders also flocked to Voss in hopes of being cured of various ailments and afflictions untreatable elsewhere in the galaxy. They were forced to embark on a dangerous pilgrimage to the Shrine of Healing, necessary for the Voss healing ritual to take proper effect. The trials purified the spirit of the petitioner, ensuring that their affliction was dispersed amongst the ritual participants, rather than passed onto them."}, {"tag": "h3", "text": "Galactic War"}, {"tag": "p", "text": "Both galactic powers continued their diplomatic efforts on Voss until the Cold War ended and two governments engaged in another Galactic War elsewhere in the galaxy, while struggling to maintain neutrality on Voss. By 3640 BBY the Three consisted of Sonn-Vi, Gunta-Mer, and Nen-Ji. During that year Sith Lord Fulminiss learned the Voss healing ritual from the spirits of long-dead Mystics, and corrupted the ritual so that it twisted minds and drove its victims insane. Fulminiss traveled to the Dark Heart in order to meet with Sel-Makor, where he fell to the blade of the Jedi Knight known as the Hero of Tython, while Voss Commando Tala-Reh sacrificed herself to destroy Sel-Makor for good. Sith Lord Torius attempted to hold Voss-Ka hostage with a ZR-57 orbital strike bomb planted underneath the city, but the Mystic Ki-Ve foresaw that this plan would fail and the Voss did not intervene, allowing Torius to be stopped by Republic Special Forces Division Havoc Squad. Trying to gain an alliance with the Voss, both the Republic and the Empire lent aid to the Voss in their fight against the Gormak, the Sith aiding the Voss in destroying Gormegan-1, a starship built by the Gormak on Gormak King Jokull's orders, while the Republic helped the Voss to destroy the cannon the Gormak were building to use against Voss-Ka. However, in the process, the Voss discovered Jokull's ability to see the future, and enlisted the aid of outsiders in retracing the Gormak king's steps in the Nightmare Lands, soon learning the truth of their species' creation."}, {"tag": "h3", "text": "The Eternal Empire"}, {"tag": "p", "text": "In 3636 BBY the galaxy was invaded by the Eternal Empire of Zakuul that subjugated both the Republic and the Sith Empire within a year and placed dozens of massive battlestations called Star Fortresses in orbits of subjugated worlds to watch for possible uprisings. Voss Star Fortress was commanded by Exarch Andur Melor and protected by a shield bunker located in the Pelath-Ri Marches. In the face of a larger threat, the Voss and Gormak soldiers had united to defend their homeworld, ending the centuries-long war between the two species. Their alliance has proven surprisingly effective, with the meditative reserve of the Voss complimenting the ferocious strength of the Gormak to form a formidable army. In 3630 BBY, Eternal Empress Vaylin launched an Invasion of Voss, determined to hunt her brother Arcann and mother Senya Tirall who had taken refuge at the Shrine of Healing. Operatives of the Alliance that opposed Zakuul were already onworld, allowing the Alliance to scramble their fleet in response. The Eternal Fleet bombarded Voss-Ka and deployed ground troops in the city, and Theron Shan attempted to rally Voss commandos to its defense, but their forces were outmatched, and were forced to take shelter in the Tower of Prophecy along with the Mystic Sana-Rae. At the Shrine of Healing, Voss Mystics transferred Senya Tirall's strength to Arcann, healing his injuries and mending his broken spirit, allowing him to flee to his shuttle and escape into hyperspace. Vaylin has ordered the Eternal Fleet to burn her entire family regardless of casualties on Voss, but the tide of the battle was turned by the arrival of the Imperial Fleet that opened fire on the Eternal Fleet warships, destroying several of them and prompting the rest to flee in self-preservation. Although Voss was saved from the full destructive might of the Eternal Throne, it suffered heavy losses, with much of the planet devastated and thousands of Voss and Gormak killed."}, {"tag": "h2", "text": "Voss in the galaxy"}, {"tag": "p", "text": "After being exposed to the larger galaxy, several Voss left their homeworld to travel and explore the galaxy. Cavrus-Til traveled to the Republic capital of Coruscant, while Azula-Hej visited Alderaan. In 3640 BBY mystic-in-training Gaden-Ko was just starting his pilgrimage, when he lost all of his bodyguards at the Holy Path of Mir, after which the Jedi Consular known as the Barsen'thor offered to protect him on his pilgrimage and guided Gaden-Ko to become a Mystic. His first vision showed Gaden-Ko that his destiny was to help his new friend and the Galactic Republic in the Galactic War with the Sith Empire. Gaden-Ko gained a small entourage of Voss Commandos, healers, and interpreters as he joined the Barsen'thor's Rift Alliance, participating in the Capture of the Javelin and the Battle of Corellia during the Hunt for the Children of the Emperor."}, {"tag": "p", "text": "Later same year Darth Malgus proclaimed a new New Empire, and the top Sith ambassador on Voss Darth Serevin joined his cause and convinced some of the Mystics to follow him. Talsa-Ko and Queneth Li traveled with Darth Serevin to Ilum in the middle of the Battle of Ilum, where Talsa-Ko had a vision of bowing to the victor of a battle between Darth Serevin and his attackers. Eager to fulfill the vision, Serevin engaged the intruders at Fort Barrow, but was killed alongside Queneth-Li, leaving Talsa-Ko to beg the attackers to spare her life. In 3631 BBY Mystic Sana-Rae experienced a vision that showed her help Voss by joining the Alliance that opposed the Eternal Empire of Zakuul. She traveled to the Alliance base on Odessen and was put in charge of the Alliance's Force enclave, overseeing the training of her fellow Mystics, as well as other Force-sensitives. Being a Voss, and thus not aligned to either light side or the dark side of the Force, Sana-Rae was well respected by her peers, able to build up a cooperation of Sith and Jedi alike, and eventually fulfilled her vision by helping the Alliance save Voss from destruction by the Eternal Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Voss are a new species created for Star Wars: The Old Republic video game by BioWare, and were first introduced in the Holonet article on the game's website. The Voss are the result of BioWare writers' desire to add something new to Star Wars lore in the game, although they selected an obscure planet rather than creating one from scratch. The appearance of the Voss species was inspired from that of poison dart frogs. The overall presentation of the Voss was designed to make them feel isolated and harried by outside forces, and to have a mystic culture. Originally, mystics were considered as a player-controllable class but were rejected in favor of the Imperial Agent because there were already four other Force-using classes planned for the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}