{"url": "Voss_Parck/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Corulag residents", "Category:Empire of the Hand personnel", "Category:Heads of state of the Empire of the Hand", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males", "Category:Nirauan residents", "Category:Republic Navy captains"], "nodes": [{"tag": "h1", "text": "Voss Parck"}, {"tag": "p", "text": "Voss Parck was a Human male that served as a officer in the Republic Navy and later Imperial Navy who discovered the future Grand Admiral Mitth'raw'nuruodo and later served as the commander of Thrawn's Empire of the Hand. Hailing from a naval family on Corulag, Parck followed the expected career path and joined the Republic Navy, serving in the Clone Wars. Shortly after the Galactic Republic became the Empire, Parck came across Thrawn while chasing smugglers in the Unknown Regions. Impressed by Thrawn's tactical abilities, Parck offered him a position in the Empire and took him back to Coruscant, where Emperor Palpatine was greatly pleased with Parck's find."}, {"tag": "p", "text": "Parck remained attached to Thrawn's career, following the Grand Admiral on his mission to subjugate the Unknown Regions and its myriad aggressors. Deeply devoted to and admiring of Thrawn, Parck served as his right-hand man throughout the deployment, helping to bring many worlds under Imperial control and defeat the forces of Warlord Nuso Esva. When Thrawn returned to known space to take up command of the Empire's military forces, Parck was left behind as steward of the Empire of the Hand, an Imperialist territory that Thrawn had carved out of the Unknown Regions."}, {"tag": "p", "text": "Upon Thrawn's death, Parck assumed sole command of the Empire of the Hand, continuing its mission to pacify the hostile civilizations in the region, which he regarded as essential to the future of the galaxy. When a hoax proclaimed the return of Thrawn ten years after his death, Parck cautiously opened relations with the galaxy at large, retaining high-level diplomatic ties even after the impostor was exposed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "A Human male born to a Corulag family with a tradition of naval service, Voss Parck entered the Corulag Academy to begin a career as a military officer, following in the footsteps of his father and grandfather, who had both captained capital ships. There, he trained alongside several siblings and cousins and carried on a rivalry with one cousin in particular, which would last into their military careers, though Parck generally came out behind."}, {"tag": "p", "text": "Within a few years of graduating the academy, Parck attained the rank of captain in the Republic Navy, commanding the Victory-class Star Destroyer Strikefast by the end of the Clone Wars in 19 BBY. At the conclusion of the war, Supreme Chancellor Palpatine reorganized the Galactic Republic into an Empire with himself as Emperor. Parck, who was a great admirer of Palpatine, felt that the new Emperor would bring positive change to the galaxy and continued his service in the Imperial Navy, leading the Strikefast on a long-range exploratory assignment."}, {"tag": "h3", "text": "The discovery of Thrawn"}, {"tag": "p", "text": "Around one week after the Declaration of a New Order, Parck and the Strikefast were in pursuit of the Starwayman, a smuggler ship suspected of carrying arms for an anti-Imperial resistance group. The smugglers made a blind hyperspace jump into the Unknown Regions in an effort to shake their pursuers, but Parck would not be deterred and gave pursuit."}, {"tag": "p", "text": "When the ships emerged from hyperspace, the crew of the Starwayman attempted to take refuge on a nearby planet. Parck ordered the launch of the Strikefast's TIE fighters to pursue the freighter into the planet's atmosphere, but a problem with the launch racks prevented the launch of all but two of the starfighters, both of which were destroyed as they gave chase. The smugglers took refuge in a cave, and Parck dispatched a ground team and several starfighters to locate them and the two downed Imperial fighters. In the process, they discovered the abandoned dwelling of what appeared to be an unknown species. Although he was exasperated by the additional bureaucracy, Parck instructed his commander on the ground, Colonel Mosh Barris, to handle the potential first contact situation in accordance with the Empire's Unknown Alien Encounters Orders."}, {"tag": "p", "text": "Parck organized a technical team to send down in support of Barris. Meanwhile, Barris's troops found the body of one of the fighter pilots, clearly killed and scavenged for technology. Shortly thereafter, mysterious explosions began to plague the Imperial ground camp, followed by the crash of another TIE. When Barris contacted him to report these new developments, Parck correctly deduced that the dead pilot's comlink had been stolen by the unknown aliens, and had it cut out of the network."}, {"tag": "p", "text": "The next morning, Parck contacted Barris again. Barris had taken casualties and wished to simply raze the forest and pull out. Parck, however, was intent on finding the smugglers and the location of the resistance cell that they were supporting. Parck sent down two squads of stormtroopers to relieve Barris's Imperial Army troopers."}, {"tag": "p", "text": "At that point, the unidentified enemy—in fact an exiled Chiss by the name of Mitth'raw'nuruodo making clever use of Imperial supplies—began jamming the ground forces. Cut off from communications with Parck and suffering casualties from the mysterious attacks, Barris ordered a retreat and returned to the Strikefast. Parck quickly came to suspect that the alien Barris had encountered had stowed away aboard the shuttle that had brought the surviving troops back from the surface. The captain took Barris to the hangar control bay, where he ordered that the lights be dimmed. Parck's suspicions were confirmed when Mitth'raw'nuruodo sneaked out of the shuttle."}, {"tag": "p", "text": "The Chiss was captured and questioned by Parck, who asked what he had hoped to accomplish by sneaking on board and also sought to find the methods by which Mitth'raw'nuruodo had outmaneuvered the Imperials, though he had to reign in the overly hostile and anti-alien Barris. Impressed by his resourcefulness and intrigued by the alien's desire to protect his people from assorted dangers, Parck offered him a position in the Imperial Fleet, phrasing it as an opportunity to put the Empire's resources to work against the threats of the Unknown Regions. Thrawn—as Mitth'raw'nuruodo decided to use his core name among the Imperials—accepted the offer, and Parck abandoned the hunt for the smugglers in order to take what he saw as a more promising prize to the Emperor."}, {"tag": "h3", "text": "Thrawn and the Imperial Court"}, {"tag": "p", "text": "Palpatine was in fact greatly pleased by Thrawn's recruitment; several years earlier, Thrawn had aided Palpatine in destroying Outbound Flight, a Jedi mission to explore beyond the known galaxy, as it had passed through the Unknown Regions, and Palpatine had twice tried unsuccessfully to recruit Thrawn since. After bringing Thrawn to the Emperor, Parck's career saw a boost. On the other hand, Barris was shunted aside to backwater assignments, and his career plunged sharply, for which he always resented Parck."}, {"tag": "p", "text": "Parck remained associated with Thrawn throughout the Chiss's swift rise through the Imperial ranks. When Thrawn, who was an active player in Imperial Court politics, was ready to return to the Unknown Regions and exert the Empire's influence, he and Palpatine staged a court scandal. The political fallout forced Thrawn into exile on a lowly mapping expedition to the Unknown Regions, or so it was thought. Parck, who backed Thrawn in a move so clearly unprofitable that it became notorious among the court, was likewise exiled with him and demoted to the rank of commander. In fact, Parck was one of a few select individuals who knew that Thrawn's exile was staged and had quite deliberately put himself on the losing side in order to be assigned to the expedition, which was entirely orchestrated by Thrawn and Palpatine to allow Thrawn to conduct his mission of Imperial expansion in secrecy."}, {"tag": "h3", "text": "Mission to the Unknown Regions"}, {"tag": "p", "text": "Parck was assigned to the Imperial-class Star Destroyer Admonitor, Thrawn's new flagship, as first officer to Captain Dagon Niriz. Niriz despised Parck for having brought the alien admiral to the Empire, deeming him arrogant. In the initial stages of the journey, Thrawn assigned Niriz to demeaning tasks and frequently countermanded Niriz's orders in such a way as to look passive and weak-willed. This was, in fact, part of a ploy, of which Parck was aware, to strain Niriz's patience and loyalty in a test."}, {"tag": "p", "text": "Upon reaching the Unknown Regions, the Admonitor began scouting systems. In the fifteenth system searched the Imperials were approached by three unknown ships commanded by the Ebruchi Creysis, who claimed to be the ruler of the system. Deducing that the Ebruchi were pirates, Thrawn devised a plan to deal with Creysis and find his superiors. Taking the opportunity to further test Niriz, Thrawn shared the details of his plan with Parck but not Niriz. The admiral convinced Creysis that the Admonitor was a colonization ship and dispatched Parck to negotiate with Creysis as part of a fictitious \"Council of Colonists,\" taking a golden sculpture as a gift for Creysis's assistance. The admiral allowed Parck's Zeta-class shuttle to be captured by the Ebruchi. Niriz found Thrawn's performance intolerable, and so did General Larr Haverel, the ship's infantry commander. Haverel approached Niriz with a plan to mutiny, suggesting that their admiral could not possibly be so incompetent and must in fact be in league with Creysis. Niriz passed Thrawn's test when he refused to mutiny, sticking proudly to naval regulations and his sense of tradition and propriety."}, {"tag": "p", "text": "Parck took the opportunity to learn more about the Ebruchi while waiting for Thrawn to spring his trap. When Creysis sent the tracker-equipped sculpture to his masters to demonstrate the Admonitor's worth as a target, Thrawn launched his TIE fighters against the pirates. At the same time, stormtroopers erupted from Parck's captured shuttle, easily overwhelming the assembled pirates and rescuing Parck and the shuttle's crew. Parck returned to the Admonitor as Thrawn demolished Creysis's forces. With Creysis defeated, Thrawn's forces proceeded to lay waste to the base of the pirate's superiors."}, {"tag": "p", "text": "After the battle was over, Niriz submitted his resignation as captain of the Admonitor. Parck visited Niriz in his quarters, telling him that Thrawn had turned down his resignation. He informed the captain of the nature of Thrawn's test and the fact that Niriz had passed, as well as revealing the truth of their mission. Niriz took heart, and turned to the mission with much greater eagerness and respect for Thrawn."}, {"tag": "h3", "text": "Nuso Esva campaign"}, {"tag": "p", "text": "As they proceeded on their mission, more and more ships and resources were quietly transferred to Thrawn, giving him a small armada, and Parck was returned to his rank of captain. By 0 ABY, Thrawn's forces had come into conflict with Nuso Esva, a powerful warlord who had decimated several societies in the Unknown Regions. Esva repeatedly turned down Thrawn's offer of a treaty and launched a campaign against some of the territories that Thrawn had pacified. The worlds under Esva's control stretched to the edge of the Empire, and Thrawn believed that Esva was planning to extend his influence into Imperial Space. Several months after the shock Rebel victory at the Battle of Yavin, Thrawn returned to the Empire to seek help in his campaign against Esva, leaving Parck in command of Task Force Admonitor in his absence."}, {"tag": "p", "text": "While Thrawn was away, Parck led an attack force comprised of the Admonitor, two Strike-class medium cruisers, and four Carrack-class light cruisers into battle against elements of Nuso Esva's navy at Teptixii. With the enemy fleet composed of eight Firekiln capital ships and twenty-seven escort vessels, Parck knew that they posed a serious threat to his forces. While he waited for reinforcements to arrive, Parck had his escorts sweep in front of the Admonitor to block fire from the Firekilns, while the Star Destroyer focused on destroying the smaller enemy ships in order to leave the Firekilns vulnerable. Parck had the enemy ships pinned down when the Imperial-class Star Destroyer Chimaera arrived in the system. Parck was surprised to find another Star Destroyer in the Unknown Regions, but with his reinforcements still twenty minutes away, he contacted Captain Calo Drusan aboard the Chimaera and requested help in finishing off Esva's fleet. Drusan agreed and, as the Chimaera moved to outflank the enemy, Esva's forces fled to hyperspace."}, {"tag": "p", "text": "Following the battle, Parck was contacted by Drusan and Lord Odo, an apparent representative of the Emperor who was traveling aboard the Chimaera. Odo relayed to Parck a request from General Kauf Ularno of Poln Major in the Candoras sector for help in putting down a potential insurrection. Although not unsympathetic to the situation, Parck explained that his forces could not abandon their mission in the Unknown Regions and initially refused to help. However, upon receiving a transmission reporting the attempted assassination of the Candoras sector's governor, Bidor Ferrouz, by Rebel insurgents, Parck reluctantly agreed to assist. While the Admonitor traveled with the Chimaera, Parck contacted the rest of Thrawn's fleet, instructing them to rendezvous in the Poln system. He also sent a message to Thrawn to request his presence."}, {"tag": "p", "text": "Unbeknownst to most of the Imperials, the situation on Poln Major had been orchestrated by Nuso Esva in an attempt to lure Thrawn's forces into a trap. Thrawn, however, was one step ahead of the warlord and was waiting in the Poln system aboard the freighter Lost Reef. While Parck deployed his forces in orbit of Poln Major, Esva made his move. Having infiltrated the Chimaera under the guise of Lord Odo, he killed Drusan and locked the ship on a collision course with the Golan Space Defense SpaceGun defending the planet. Esva's fleet entered the system, and Parck moved to engage but, even after Thrawn and Commander Gilad Pellaeon of the Chimaera devised a plan to turn the Star Destroyer from its course and bring it back into the fight, the Imperials were heavily outgunned. Throughout the engagement, Thrawn and Esva mocked each other until Thrawn tricked Esva into revealing his intentions to dominate those who joined him. Only after relaying Esva's words to the Unknown Regions as a warning to others did Thrawn spring his own trap, sending a signal to the Dark Lord of the Sith Darth Vader, whose Death Squadron was waiting nearby. With the arrival of Vader's fleet, led by the Super Star Destroyer Executor, the battle turned in the Imperials' favor. Esva's Eastern Fleet was decimated, though the warlord himself escaped and, with two more fleets operating in the Unknown Regions, remained a significant threat. After the battle, Thrawn rejoined Parck aboard the Admonitor and the pair returned to the Unknown Regions."}, {"tag": "h3", "text": "The Empire of the Hand"}, {"tag": "p", "text": "Under Thrawn, Parck participated in numerous campaigns against the various aggressors within the region and was promoted to senior captain at some point prior to 8 ABY. Eventually, Thrawn organized his conquests into the Empire of the Hand. Thrawn placed his headquarters on the planet Nirauan, inside a building known as the Hand of Thrawn due to its distinctive shape. It was this fortress that gave the Empire its name. It was made up not only of conquests, but also of planets that willingly joined. This empire, unlike Palpatine's, was tolerant of non-humans, fitting Thrawn's meritocratic style. A major component of the Empire of the Hand was Syndic Mitth'raw'nuruodo's Household Phalanx, an organization of Chiss supporters of Thrawn who worked on the margins of and even deep within Chiss society to recruit numerous warriors to Thrawn's cause."}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine was killed at the Battle of Endor, and the Empire began to fragment and lose territory to the New Republic. Thrawn and Parck remained in the Unknown Regions to continue their work, but Thrawn, by this point a Grand Admiral, remained in contact with the mainstream Empire and had some degree of cooperation with Ysanne Isard, Palpatine's eventual successor. It was this connection that gained the Empire of the Hand another crucial servant, Imperial fighter ace Baron Soontir Fel. Over the years, Thrawn stopped Nuso Esva's expansion and began to push the warlord back. By 8 ABY, the remnants of Esva's fleet were in hiding, and the warlord had taken refuge on the planet Quethold, having manipulated the Quesoth Queen of the Red into an alliance. With several other threats requiring the Empire of the Hand's attention, Thrawn could not afford a lengthy blockade of Quethold and sought a decisive victory. While Parck was primarily charged with coordinating the search for Esva's scattered fleet, he joined Thrawn's senior officers and representatives of the Stromma—whose world had been liberated from Esva's rule by the Empire of the Hand—at a number of strategy sessions before the assault on Red City. During the battle, which Parck observed with Thrawn aboard the Admonitor, the Imperials tricked Esva into thinking that the Queen had betrayed him; Esva killed the Queen and was subsequently killed by her soldiers."}, {"tag": "p", "text": "Although Esva was defeated, Parck was concerned about possible reprisals from his followers. Thrawn, however, doubted that they would present much of a threat with their leader gone and decided that the time had come for him to return to the Empire and take command of the Imperial Fleet. While Thrawn left to rendezvous with Captain Gilad Pellaeon on the Chimaera, Parck took the Admonitor to the Chaos Triangle to oversee the process of rebuilding following the Esva campaign. In Thrawn's absence, Parck became an admiral and took command of the Empire of the Hand. Thrawn remained in contact with Parck, who was fully appraised of Thrawn's strategies as supreme commander. Conversely, Thrawn, who was well-known for his centralization of information within himself and minimal dispersal of it to his subordinates, informed no one within the Empire of the existence of the Empire of the Hand. This meant that when Thrawn was unexpectedly killed in 9 ABY by his bodyguard, the Empire of the Hand's existence was completely lost to the galaxy at large. Before Thrawn's death, the Grand Admiral left instructions that, were he ever to be reported dead, Parck was to continue his mission in the Unknown Regions and wait ten years for his return. As a result, Parck kept his attention turned outward as he continued the fight in the Unknown Regions, choosing not to reveal himself and the Empire of the Hand's plentiful resources to the Imperial Remnant. Not even the return of Palpatine drew Parck from the Unknown Regions."}, {"tag": "p", "text": "While waiting for Thrawn's return, Parck continued the Empire of the Hand's relentless campaigns against anything which threatened the Empire or the Chiss Ascendancy, whether the Chiss desired their help or not. Parck's top assistants in this period were General Fel and the Chiss officer Kres'ten'tarthi, the commander of the Household Phalanx. Parck also had some contact with the Chiss Ascendancy, despite the fact that the existence of the Empire of the Hand was officially unrecognized. Aristocra Chaf'orm'bintrano was at least one highly-placed Chiss official who was on speaking terms with Parck."}, {"tag": "h3", "text": "The return of Thrawn"}, {"tag": "p", "text": "Ten years after his death, as promised, Parck's known space contacts brought to his ears rumors of the return of Thrawn. Parck immediately dispatched scout ships to search out former Emperor's Hand Mara Jade, whom he saw as a perfect intermediary due to her Imperial past, New Republic connections, and close relationship with the galaxy's largest information broker, Talon Karrde. Having had no contact with Thrawn, Parck was unsure of the accuracy of the rumors and wished to be completely certain that the Grand Admiral had returned before revealing the Empire of the Hand's existence to the Imperial Remnant. Parck was in fact right to doubt, as the \"Thrawn\" of the rumors was in fact an impostor, hired as part of a scheme by Moff Vilim Disra to seize power within the Remnant. The timing was coincidental; Thrawn's actual promise was to be fulfilled by a clone grown in a secret sublevel of the Hand of Thrawn, to be awakened by a timed system which was continually reset by Thrawn up to his death."}, {"tag": "p", "text": "By triangulating the vectors of two of the scout ships, Jade followed them back to Nirauan, but was shot down over the planet. Jedi Master Luke Skywalker was contacted by Karrde and set off to rescue her. Eventually the two of them infiltrated the Hand of Thrawn, where Jade was captured and brought before Parck, Fel and Kres'ten'tarthi. Parck, by now an old and gray-haired man, revealed the basic history of the Empire of the Hand to Jade and offered her a position within it, stressing the vital nature of its mission. Jade, however, refused the offer. With further reports that Thrawn had returned to the Imperial capital world of Bastion, Parck decided to risk contact with the Empire. To stop Jade interfering, Parck ordered her detained until they had contacted Bastion and Fel suggested wounding Jade to force her into a Jedi healing trance which would prevent her escape. Before Parck's Chiss guards could act, however, the conference was broken up by Skywalker, who cut his way into the room and rescued Jade, escaping to the hidden sublevels of the base. The clone of Thrawn was killed in a flood of the lower levels caused by Skywalker and Jade's escape attempt, and before Parck could dispatch a scout craft to Bastion, Jade remotely steered her ship into the Hand's hangar, disabling the base's ships. Parck was left to clean up his damaged base, while the false Thrawn was exposed before Parck could make contact, keeping knowledge of the Empire of the Hand and its vast territories limited to Skywalker and Jade."}, {"tag": "p", "text": "In the chaos and vulnerability immediately after the attack on the Hand's hangars, the Hand was assaulted by a well-organized gang of pirates and fell to them, forcing Parck to evacuate the planet. However, this did not last, as Parck was back on Nirauan by 22 ABY."}, {"tag": "h3", "text": "Diplomatic dealings"}, {"tag": "p", "text": "Knowledge of the Empire of the Hand slowly leaked out, with Skywalker and Jade informing New Republic Chief of State Leia Organa Solo. The Imperial Remnant, under Thrawn's former protégé Gilad Pellaeon, also had some contact with Parck, though he chose not to ally himself with any particular group or engage in serious diplomatic relations. One group with which he did wish to have better relations was the Chiss Ascendancy, whose citizens provided much of the Empire of the Hand's manpower and which the Empire of the Hand existed to protect. However, as Thrawn was an exile from the Ascendancy and Chiss military doctrine refused to recognize the Empire of the Hand's tactics as moral, relations remained strained and unofficial despite Parck's wish for better cooperation."}, {"tag": "p", "text": "In 22 ABY, Parck was notified by the Chiss that the remains of Outbound Flight had been found. The Chiss intended to make a conciliatory diplomatic event out of the mission to recover its wreckage, and Parck forwarded their message to Skywalker and Jade—now married to Skywalker—who were invited along as representatives of the Jedi and New Republic. However, his message was intercepted by one of Talon Karrde's employees who had had family aboard Outbound Flight. Consequently, the Skywalkers arrived over Nirauan instead of at the rendezvous point contained in the message. They spoke with Parck, who had overcome whatever resentment the destruction of his hangar might have caused him, and Parck informed them of the Chiss Ascendancy's request. Unbenknownst to the Skywalkers, Chaf'orm'bintrano was using the diplomatic mission to lure the Vagaari—a species of nomadic slavers operating in the region—into an attack, allowing the Chiss to declare war on the threat, since Chiss military doctrine did not accept the idea of the preemptive strike. Knowing that the mission would come under attack, Parck sent his own representatives to the meeting: Commander Chak Fel and the four stormtroopers of the 501st Legion's Unit Aurek-Seven. Fel and his bodyguards were allegedly there to protect the Skywalkers, but were secretly charged with supporting Chaf'orm'bintrano's own forces."}, {"tag": "p", "text": "By the time of the Yuuzhan Vong War, General Baron Soontir Fel had become the public face of the Empire of the Hand in its dealings with the New Republic, and Parck had largely disappeared from the scene. By around the end of the war, the Empire of the Hand had disappeared from the galactic scene, leaving Nirauan abandoned. Speculation at the time included the Empire of the Hand's destruction or absorption by the Chiss Ascendancy. Chaf'orm'bintrano suggested to Luke Skywalker that the Empire of the Hand had served its purpose and would rise again when needed. Soontir Fel joined the Chiss Ascendancy proper and Luke Skywalker expressed a belief to Chief Navigator Peita Aabe of the Chiss Ascendancy that Parck had also \"joined the Chiss.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An avowed Palpatinist at the dawn of the Empire, Voss Parck believed strongly in order and obedience to government. He was committed to the Imperial Fleet as an institution and resented what he regarded as meddlesome political oversight which handcuffed its effectiveness. Showing great promise during his time at the Academy, Parck began his career as a dutiful and ambitious officer, seeking promotion in the Fleet. Despite achieving the rank of captain with a few years, however, Parck's career was entirely ordinary until his chance encounter with Thrawn and his priorities subsequently changed."}, {"tag": "p", "text": "Parck willingly accepted demotion and disgrace among the Imperial Court to join Thrawn in his mission to the Unknown Regions, where he became a zealous crusader determined to combat the region's myriad enemies, with no concern for personal gain or advancement. He genuinely believed in the cause, enough to unsettle Mara Jade during their interview. He was convinced that the mission of the Empire of the Hand was truly vital to securing the Empire and the galaxy as a whole, to the point that he was reluctant to abandon it to assist the Empire in preventing an insurrection in the Candoras sector. Such was Parck's level of devotion to Thrawn that, after the Grand Admiral's death, Parck waited patiently for his promised return rather than reveal the Empire of the Hand's existence to the Imperial Remnant."}, {"tag": "p", "text": "Though Parck began as Thrawn's discoverer, he quickly found the relationship reversed. Thrawn was already known to Emperor Palpatine and was greatly sought by him. Thrawn was promoted swiftly while Parck was left in his wake. Thrawn remained quite loyal to Parck, however, keeping him as his right-hand man throughout his career. Parck returned this loyalty in turn. He was deeply impressed by Thrawn's abilities and willingly shared in his supposed exile to the Unknown Regions, keeping faith in his commander's abilities, even when he did not fully understand his plans. Even after Thrawn's death, Parck continued to be loyal to him and remained utterly assured of his promise to return, to the point that Mara Jade considered him almost delusional."}, {"tag": "p", "text": "Parck was a highly intelligent man with a well-developed deductive skill similar to, though not as extensive as, that of Thrawn. Parck had in fact out-thought Thrawn at least partially in their first meeting, correctly predicting his stowing away on the shuttle. Thrawn, who was generally miserly with information, kept Parck within his confidences throughout his career and trusted him implicitly, often revealing details of his plans to Parck which were not known to his other protégés, Dagon Niriz and Gilad Pellaeon, and valued Parck's keen mind, along with his steadfast loyalty."}, {"tag": "p", "text": "Besides a firm grasp of tactics, strategy, negotiation, and information-gathering, Parck spoke multiple languages in addition to his native Basic, including Cheunh, Honoghran, Twi'leki, and Zabraki. He could also understand Quesoth Common Speak."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the early days of the Galactic Empire, Parck served as captain of the Victory-class Star Destroyer Strikefast. Following his demotion to commander, he served under Captain Dagon Niriz aboard the Imperial-class Star Destroyer Admonitor. Throughout his career, Parck wore a standard Imperial officer's uniform, complete with rank insignia and code cylinder. By his time in command of the Empire of the Hand, Parck carried a Chiss comlink and was armed with a Chiss charric and knife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Voss Parck was created by Timothy Zahn for the short story Mist Encounter, published in Star Wars Adventure Journal 7 on August 1, 1995. Zahn later reused the character in the short story Command Decision, published in Star Wars Adventure Journal 11 (1996), and Vision of the Future (1998), the second book in Star Wars: The Hand of Thrawn Duology, which dealt heavily with Thrawn's backstory. This placed Parck in command of the Empire of the Hand, though that organization's name was only given in the following Zahn book Survivor's Quest (2004), in which its organization and purpose were also fleshed out. While these appearances pushed the Empire of the Hand and the Chiss into the mainstream, Parck largely dropped out of the picture, with the primary face of the Empire of the Hand becoming General Baron Soontir Fel. The character subsequently went unused until the release of the novel Choices of One and the short story Crisis of Faith, both written by Zahn and published in 2011. To date Parck has only been written by Timothy Zahn, and his only other in-universe mentions are in the short stories Missed Chance and Red Sky, Blue Flame, and the novels The New Jedi Order: Dark Tide II: Ruin and The New Jedi Order: Force Heretic II: Refugee."}, {"tag": "p", "text": "Parck's position in relation to that of Dagon Niriz is unclear. At the outset of their expedition to the Unknown Regions, Niriz outranked Parck. However, Parck was clearly acting as Thrawn's right-hand man during Command Decision, while Niriz was left out of the loop. Choices of One shows Parck once more holding the rank of captain and in command of the Admonitor, while the Zahn short story Side Trip, set after the events of Choices of One, shows Niriz as captain of the Admonitor when Thrawn returns to known space in order to execute a small mission on behalf of Lord Vader. Parck is once again acting as captain of the Admonitor in Crisis of Faith, the ship's latest chronological appearance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}