{"url": "Vowrawn", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Dark Councilors", "Category:Dark Lords of the Sith", "Category:Heads of government and state", "Category:Males", "Category:Sith Masters", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Vowrawn"}, {"tag": "p", "text": "Emperor Vowrawn, known as Darth Vowrawn before his accession, was a male Pureblood Dark Lord of the Sith and one of twelve (later five) to serve on the Imperial Dark Council during the Great Galactic War, Cold War, and Galactic War. After the death of Empress Acina on Iokath, Vowrawn assumed the throne as Emperor of the Sith."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darth Vowrawn participated in the arrest of Lord Calypho along with two fellow Dark Councillors, including Darth Marr, within a structure on Dromund Kaas. The Dark Lord of the Sith also had at least one apprentice, an ambitious Sith Lord named Qet. To honor his master, Qet brought in a massive army of slaves to secretly build a great statue of Vowrawn in the jungles of Dromund Kaas - an edifice that became known as the Unfinished colossus."}, {"tag": "p", "text": "During the Galactic War, Vowrawn was one of the members of the Dark Council that opposed the ascendance of Darth Baras. This was especially the case after Baras claimed to have held the title of Voice of the Emperor. Vowrawn in this time had learned that Darth Baras was greatly aided by the prophetic words of a Force being known as the Entity that was kept chained under powerful enchantments on Corellia. Thus, he concluded that the only way to defeat Baras was freeing this dark spirit."}, {"tag": "h3", "text": "Battle of Corellia"}, {"tag": "p", "text": "During the restart of hostilities with the Galactic Republic, Vowrawn was in charge of Imperial efforts on Corellia, where he managed to hide his presence within the Incorporation Islands. He was protected by a cadre of Sith loyal to him in this time as he watched for assassins that were being sent by Baras. It was during this time he came into contact with Baras's former Sith apprentice, the new Emperor's Wrath and believed that the Sith was part of his enemy's plot to assassinate him. The Wrath was forced to fight through Vowrawn's retainers and kill Sith Lord Haresh, before Qet stood alone against him as the last line of defense. Vowrawn then revealed himself, seeing that the Wrath was much stronger than any of his followers and ordered Qet to stand down. He then requested that the Wrath not grant him the indignity of decapitation. The Wrath insisted to having been sent by the Emperor's Hands, not Baras, to protect him. Vowrawn remarked that nothing else could be gained by maintaining the deception, unless the Wrath was truly no longer in league with Baras. It was only after the Sith defeated the real assassin that Vowrawn was convinced of the Wrath's sincerity of being Baras' enemy. What's more, Vowrawn believed that the two of them together could dethrone Baras, much to the Wrath's delight. He then confessed his true motive behind leading the Corellia campaign - significant and vulnerable pillars of Baras' his bid. One agent held secrets to use as leverage, the other led Jedi in campaigns against Sith who defied Baras. If they were to \"disappear\", then Baras' support would be withdrawn. Vowrawn gave the Wrath the identity of the first spy, who was posing as Colonel Senks of the Corellia resistance. His stronghold in Labor Valley contained a myriad of escape tunnels, but Vowrawn passed the Wrath pulse disruptors that would lock Senks' secret passages so that he could be cornered and killed, though Vowrawn expressed regret that the Empire would lose a valuable agent. After arriving at the Wrath's ship, Vowrawn contacted his ally via holo, advising that if Senks wouldn't hand over his files, the Wrath should destroy his database to eliminate it all. After the deed was done, the Wrath had to leave the compound to avoid Baras eavesdropping on them."}, {"tag": "p", "text": "After the Wrath dealt with Senks, Vowrawn sends the Wrath to Axial Park, where his operative Shadow had gone to ground as Republic artillery bombarded the area. Shadow was supposed to provide the identity of Baras' Jedi spy. But upon meeting the Wrath, Shadow admitted that while he did not know the spy's identity, knew the location of the Jedi Enclave in the area. But while the Wrath fought through the Enclave to reveal the spy as Master Injaye, another unknown assailant made an attempt on Vowrawn, but with more fury than the last one. Vowrawn was impressed with how the Wrath's companions looked death in the eye and did not flinch."}, {"tag": "p", "text": "Vowrawn later rejoined the Wrath in a safehouse at the Capitol Square to free the Entity. However, Lord Draahg ambushed them before Vowrawn could begin releasing her bounds, imprisoning the Dark Councilor in a death field that threatened to disintegrate him. The Wrath was able to finally kill Draagh and to free Vowrawn. Once freed, Vowrawn confessed that he expected to die. Before performing the ritual to free the Entity, he had her confirm that Baras was viewing what had transpired through her, guessing that he must be twisting with fury."}, {"tag": "h3", "text": "Defeat of Baras"}, {"tag": "p", "text": "With Baras severely weakened, it was the time to finally expose him as the false Voice. Returning to Korriban, Vowrawn, arriving \"fashionably late\", authorized the Emperor's Wrath's entry into the Dark Council Chambers in order to ensure the final confrontation between Master and apprentice. Vowrawn urged his fellow Dark Councilors to stay their hand as they were all victims of a ruse perpetrated by Baras. In turn, Baras tried to make a desperate attempt out of greed or jealousy and called on the Dark Council to assist him in destroying his former apprentice, promising that the Emperor have informed him of Vowrawn's fate. Nonetheless, the Dark Council acknowledged the Wrath being supported by Vowrawn and allowed the Emperor's Wrath to duel Darth Baras and slay him, thus ending his plans to attain ultimate power in the Sith Empire. Relieved to be rid of his rival, Vowrawn, speaking on behalf of the Council, declared that the Wrath had free rein and answerable only to their ultimate Master."}, {"tag": "h3", "text": "Fall of Thanaton"}, {"tag": "p", "text": "Sometime afterwards, Vowrawn was present for Darth Thanaton's appeal for the execution of his rival, Lord Kallig. However, the latter interrupted the appeal. The Dark Council, curious to see why Thanaton had been unable to kill his rival, allowed them to finish their Kaggath before them. When Kallig succeeded in overpowering Thanaton, Vowrawn joined the other present Dark Councilors to observe the humiliated Dark Lord, before Darth Mortis snapped his neck with the Force, killing him. Kallig then took Thanaton's seat on the Council, taking the name Darth Nox and Thanaton's position as head of the Sphere of Ancient Knowledge."}, {"tag": "h3", "text": "Election of Darth Karrid"}, {"tag": "p", "text": "After the Battle of Corellia, the Dark Council met to discuss the successor to Darth Hadra's seat, since Hadra had died during the battle. Vowrawn supported Darth Marr's nomination of Darth Karrid, but after Mortis nominated Darth Gravus, Vowrawn suggested that the Council adjourn the meeting to ponder on the decision. When news arrived that Karrid had killed Gravus, the Council unanimously supported her nomination."}, {"tag": "h3", "text": "Reunion with the Wrath"}, {"tag": "p", "text": "Vowrawn later made contact with the Wrath on Rishi and informed them that advanced Opticron droids were spying on the latter. He provides a device to unveil these drones and advised to do so in secluded spots. Vowrawn departed the planet soon after, as the Hand was pursuing him for attempting to uncover their secrets, going as far as interrogating a Servant."}, {"tag": "h3", "text": "Conquest of the Eternal Empire"}, {"tag": "p", "text": "When the Eternal Empire invaded and conquered both the Sith Empire and the Republic, Vowrawn represented the Empire in pledging allegiance to Emperor Arcann alongside Senator Evran. By 3630 BBY, Vowrawn was serving as the Head of Civil Administration under Empress Acina, who declared herself Empress of the Sith after the rest of the Dark Council died or disappeared."}, {"tag": "h3", "text": "Ascension and the Third Galactic War"}, {"tag": "p", "text": "In 3629 BBY, the Sith battled the Republic and Eternal Alliance for control of a powerful superweapon. During said battle, Empress Acina was driven mad and then killed by the superweapon. Vowrawn subsequently assumed the throne of the Sith Empire."}, {"tag": "p", "text": "A short time later, Vowrawn used an enslaved Darth Malgus to invade Ossus, marking the beginning of the third Galactic War against the Republic and the Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Darth Vowrawn was a charming and sophisticated elder statesman who in the Cold War had served on the Dark Council for decades—no small feat in the Empire, where the tenure of new council members was often measured in weeks. His passionate, almost hedonistic pursuit of challenge was well known among his peers, who have learned never to underestimate his cutthroat enthusiasm. However, he did seem to genuinely care for his loyal bodyguards."}, {"tag": "p", "text": "Vowrawn reveled in the game of conquest and Sith power plays, driven to euphoria by all the rich details of his favorite sport. Many upstart Sith had attempted to best Vowrawn over the years through a variety of strategies, from complex schemes to bluntly direct surprise attacks. Although some scored temporary victories, Vowrawn's talent for adjusting his strategy on the move had left him the final victor in all these confrontations. He led the attempt to block Baras from being named Voice of the Emperor, and succeeded with the aide of Baras's former apprentice, the Emperor's Wrath. He also had many estates on all of the major Sith worlds."}, {"tag": "p", "text": "As the head of the Sphere of Production and Logistics, Vowrawn was excellent with numbers and was aware that the Empire was at a disadvantage to the Republic in terms of soldiers, resources, and allies. Like Darth Marr, he knew that the Empire needed to recruit more worlds to its side if it wanted to succeed in the war against the Republic. He also seemed to be against the Empire's anti alien policies, a sentiment shared with Darth Marr. This was demonstrated clearly, when he supported Darth Karrid's ascension to the Dark Council after the death of Darth Hadra and Karrid killed Darth Gravus, as well as when he took an alien apprentice."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "He was knowledgeable in ancient Sith rituals and magics which was the means he was able to release the Entity from her imprisonment."}, {"tag": "p", "text": "Given his quick defeat at the hands of Lord Draahg and his assumption that he stood little chance against the Emperor's Wrath, it's probable that age had withered his combat abilities by the time of the Cold War. However his true talents were in his formidable charm and cunning, successfully disguising himself as a Republic asset during the battle of Corellia and orchestrating the downfall of Darth Baras, not to mention remaining a member of the Dark Council longer than any of his peers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the Sith Warrior is a Pureblood Sith, upon meeting, Vowrawn remarks that he'll at least die by the hands of his own species. During the Sith Warrior Quest Line \"Protect Vowrawn\", there is a stage where a bounty hunter, hired by Baras tries to eliminate Vowrawn. After defeating the Bounty Hunter assassin, the Emperor's Wrath gains the Codex Entry \"Darth Vowrawn\" yet when you open the Codex, Vowrawn is portrayed as having orange eyes, whereas in-game, he has red eyes."}, {"tag": "p", "text": "Vowrawn is seen paying tribute to Arcann in Chapter II of Knights of the Fallen Empire, but in Chapter III, Lana states that Darth Acina was the only Dark Councilor not dead or absent. Following Chapter II of Knights of the Eternal Throne, the player will receive an in-game mail from him, proving that he is alive and serving under Empress Acina."}, {"tag": "p", "text": "In Game Update 5.2: War For Iokath, if the player sides with the Empire, and later chooses to monitor their allies to find a traitor, the monitors mention Acina sending messages to Vowrawn, and he becomes a suspect. If Acina was killed during the Iokath storyline, a news broadcast in the flashpoint \"A Traitor Among the Chiss\" states that Vowrawn ascended to the throne, now dubbed Emperor Vowrawn."}, {"tag": "p", "text": "An Imperial Loyalist or Republic Saboteur player is given the opportunity to have Lana Beniko kill both Darth Shaar and him on Mek-Sha. However, this is only the case if Acina is the Empress. If Vowrawn is Emperor, only Shaar can be killed as he will not be present on Mek-Sha."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}