{"url": "Voss_Mystics", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Force-based organizations", "Category:Voss culture", "Category:Voss Mystics"], "nodes": [{"tag": "h1", "text": "Voss Mystics"}, {"tag": "p", "text": "The Voss Mystics were the totalitarian rulers of the Voss species. They were talented healers and seers native to the planet of the same name, which was highly attuned to the Force. However, the Mystics possessed no formal knowledge of the Force and were uninterested in outsiders' opinions, and were considered to be Gray. The visions and talents of these mystics allowed the Voss to survive the attacks of another native species, a tech-savvy pre-flight species named the Gormak."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the planet Voss was rediscovered by the larger galaxy just after the Treaty of Coruscant, the Sith Empire schemed to conquer Voss while the Galactic Republic sought to defend it. The Voss Mystics foresaw both plots. Following the invasion attempt, an occupation fleet had disappeared and both galactic powers were forced to approach the Voss in peace to curry favor."}, {"tag": "p", "text": "Many Mystics inhabited Voss-Ka, a fortified mountain city, and the Shrine of Healing, where they employed commandos to defend themselves, guided by the Voss Mystics. The Voss had no formal knowledge of the Force and were uninterested in training from outsiders. They held an entirely different view of the Force and believed themselves to be its chosen people. They were considered to be Gray by the Jedi and Sith. The visions had by the Mystics were never wrong. A prominent feature of Voss-Ka was the Tower of Prophecy, displaying the high regard given to the visions of their mystics. An area of Voss known as the Nightmare Lands was said to have been covered in dense forests inhabited by tainted wildlife, corrupted Gormak, and Voss Mystics that had gone mad.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Voss Mystics were first introduced in a Holonet article for the Star Wars: The Old Republic video game. The Voss Mystics were confirmed as totalitarian rulers of the Voss in a developer blog about BioWare's world design process."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}