{"url": "Voss_commandos", "categories": ["Category:Legends articles", "Category:Military units", "Category:Voss commandos", "Category:Voss culture"], "nodes": [{"tag": "h1", "text": "Voss commandos"}, {"tag": "p", "text": "The Voss commandos were soldiers of the Voss, natives of the planet of the same name. The Commandos were said to have undergone disciplined training that allowed them to survive the attacks of another native species, a tech-savvy pre-flight species named the Gormak. The Commandos operated alongside the Voss Mystics, and were headquartered in the fortified mountain city of Voss-Ka. Jenar-Sei commanded a squad of Voss Commandos during the Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic War"}, {"tag": "p", "text": "During the Galactic War between Sith Empire and Galactic Republic, Voss became disputed territory as both factions sought an alliance with the Voss. The Empire and Republic assisted the Voss commandos and Voss Mystics in dealing with their ancient enemies, the Gormak. Some commandos disobeyed orders and ventured into the Nightmare Lands, becoming corrupted. They were later eliminated by forces allied to the commandos."}, {"tag": "p", "text": "The commandos protected the perimeter and the inner sanctum of the Shrine of Healing, a temple for Voss Mystics in training."}, {"tag": "h3", "text": "Supporting the Republic"}, {"tag": "p", "text": "In 3640 BBY, the Voss commando Abdan-Sho worked with the Republic scout Kelnu Velus and another individual to retrieve an experimental armor used by the Gormak. After the killing of his comrade, the commando Goren-Bo requested the help of a Republic-aligned individual to hunt down the nexu responsible, named Grellik."}, {"tag": "p", "text": "That same year, the First Commando Nakar-Sel presided over the Trial of the First, a ritualistic test against commando recruits, with a Republic team. The commando Nodin-Fe asked for the assistance of a Republic hero to find and bury the ancient Sith ship Evuk-Nosk, which the Gormak sought to use."}, {"tag": "h3", "text": "In league with the Empire"}, {"tag": "p", "text": "At the same time, a force of Voss commandos were engaged by the Gormak at the Pelath-Ri Marches, suffering casualties, but were later assisted by a Imperial individual who destroyed the Gormak and their weaponry. The Sith lord known as the Emperor's Wrath helped the commandos Biddeck-Va and Ono-Mi by eliminating several Gormak chieftains, but later turned against and killed them to acquire the Pendant of Bone in their possession."}, {"tag": "p", "text": "When the Shrine of Healing fell under attack by Gormak cannon fire, the commandos enlisted the assistance of an Imperial individual to destroy them. Kotal-De led a group of commandos with Imperial assistance to capture the Gormak King Jokull but was killed in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Voss commandos were first introduced in a holonet article for the Star Wars: The Old Republic video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}