{"url": "Vowail", "categories": ["Category:Canon articles", "Category:Articles with gameplay alternatives", "Category:Alliance Military members", "Category:Males", "Category:Members of the Smuggler's crew", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Vowail"}, {"tag": "p", "text": "Vowail the Hunted was a male Zabrak who joined the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire in order to seek redemption. He was active in the Anoat sector during the Iron Blockade of the sector by the Empire and joined the crew of the young thief known as the the Smuggler, who sent Vowail on a variety of missions throughout the sector."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vowail, known also as Vowail the Hunted, was a male Zabrak who arrived at a safe house belonging to the Alliance to Restore the Republic during the Galactic Civil War and demanded a chance to serve with them in their fight against the Galactic Empire. He was active in the Anoat sector while it was locked down during the Empire's Iron Blockade following the death of Emperor Palpatine in 4 ABY."}, {"tag": "p", "text": "Several months into the blockade, Vowail joined the crew of the Smuggler, a young thief who smuggled goods in the Anoat, and was dispatched on a variety of missions throughout the sector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vowail was a stoic warrior with a background in warfare who prefered to use stealth during combat. The only reason he ever gave for wanting to serve with the Alliance was the he needed redemption. He was a skilled jeweler and had black and orange skin with brown eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vowail wore a white shirt with a black jacket and a bandolier along with brown pants and boots. He used a blaster rifle in combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vowail the Hunted was created for the canon mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms, and released on September 10, 2015. The Zabrak serves as a unique five-star crew member available through the Premium Crane, an in-game shop where the player, as the Smuggler, can spend chromium, an in-game currency, in exchange for randomized loot ranging from three stars or better in quality."}, {"tag": "p", "text": "As such, the player does not need to acquire Vowail as a crew member. However, this article assumes 100 percent game completion of Star Wars: Uprising, which means the Smuggler acquired Vowail as a member of the crew and dispatched the warrior on Crew Runs. While on Crew Runs, Vowail provides a bonus to all Stealth Crew on the same Run and is strong on Crystal Finder Runs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}