{"url": "Vote_Snaplaunce", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Landspeeders", "Category:Starships of the Galactic Empire", "Category:TIE/sh VIP shuttles"], "nodes": [{"tag": "h1", "text": "Vote Snaplaunce"}, {"tag": "p", "text": "Vote Snaplaunce was a TIE/sh shuttle owned by Snaplaunce, the Ithorian mayor of Hweg Shul on the planet Nam Chorios. The shuttle was originally part of a collection of restored vehicles owned by a retired mechanic in the Imperial fleet who settled on Nam Chorios around 29 ABY, after which the shuttle was purchased by the Ithorian and renamed eponymously, a point expressed in red lettering over a vivid yellow paint job. Vote Snaplaunce was modified while in possession of its namesake, during which time it was converted from military to civilian use. Snaplaunce used the shuttle as a traveling campaign advertisement, and had a tendency to loan it to prominent visitors to his city."}, {"tag": "p", "text": "In 44 ABY, Snaplaunce loaned the shuttle to visiting Jedi Grand Master Luke Skywalker and his traveling companions. Master Skywalker, his son Ben Skywalker, and their erstwhile Sith ally Vestara Khai had made their way to Nam Chorios in pursuit of a dangerous entity known as Abeloth. Vote Snaplaunce then fell victim to sabotage, unbeknownst to its owner, and the shuttle was soon afterward attacked by Abeloth's allies in pursuit of the Jedi. A series of calculated malfunctions combined with the ship's disarmament for civilian usage resulted in its near destruction, and forced its occupants to reconstruct the crashed shuttle into a makeshift landspeeder to complete that leg of their quest, and then to abandon Vote Snaplaunce in the desert outside Hweg Shul."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vote Snaplaunce was originally a standard TIE/sh shuttle of the Imperial Navy. A standard TIE shuttle had a 7.8 meter-long hull based on the twin-cylinder design of the TIE/sa bomber. The starboard cockpit of a TIE shuttle held one pilot, and the port compartment could accommodate two passengers, one seated in front of the other. The front passenger seat had access to a secondary sensor board, and the rear seat had access to a secondary communications interface. With its twin ion engines, a standard TIE shuttle could reach 1,050 kilometers per hour in atmosphere but had no hyperdrive. Though armed with a single laser cannon, the TIE shuttle lacked deflector shields. Although the TIE shuttle was a starfighter-sized craft, it was less maneuverable than many other fighters, such as the T-65 X-wing starfighter."}, {"tag": "p", "text": "By the time it was acquired by Mayor Snaplaunce of Hweg Shul on the planet Nam Chorios, the shuttle had been disarmed, making it suitable for civilian use without a special weapons permit from the Bureau of Ships and Services, though the support systems for the cannon were not physically removed. When he purchased the ship, Snaplaunce proceeded to repaint it bright yellow, as opposed to the standard off-white color of most TIE series vessels, and emblazoned the ship with red lettering proclaiming an election motto, which was also registered as the shuttle's new name: \"Vote Snaplaunce.\" The vessel was assigned a registration number of XV 119. An emergency kit was stowed aboard which contained repair tools such as an arc welder, and food rations were carried that would sustain one average Human for two days. By 44 ABY, Vote Snaplaunce was still operational, but the shuttle's port engine had ten percent greater thrust than the starboard."}, {"tag": "p", "text": "Vote Snaplaunce suffered significant damage from both sabotage and a crash in 44 ABY during Jedi Master Luke Skywalker's pursuit of the entity known as Abeloth. Following the crash, the other members of Master Skywalker's party, Jedi Knight Ben Skywalker and Sith fugitive Vestara Khai, rebuilt Vote Snaplaunce from a wrecked starship into a jury-rigged landspeeder. Ben Skywalker was largely responsible for the design, which made use of the remaining functional components of the craft in a new physical configuration. The repulsorlift systems still functioned, and the wiring from the laser support systems was used to restore the port ion engine, while the starboard engine remained inactive. The wing arrays were partially dismantled and rebuilt into a wind rudder system controlled by pulley cables that ran through holes cut in the passenger compartment with an arc welder. Lacking the help of the damaged onboard computers, navigation was achieved with a datapad and overhead star patterns. The shuttle's intercom system was used to coordinate steering, and the shuttle-turned-landspeeder could achieve fifty kilometers per hour over flat ground. It was in that configuration that Vote Snaplaunce was abandoned by Skywalker's party and recovered by Hweg Shul authorities."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Acquisition"}, {"tag": "p", "text": "Around 29 ABY, approximately fifteen years before Luke Skywalker's second visit to the world, a mechanic who had left the Imperial fleet settled on Nam Chorios. He proceeded to sell several vehicles he had carefully restored. Among them was a TIE shuttle which had been disarmed. Though the class was not normally available for public sale, an Ithorian named Snaplaunce purchased the shuttle from the ex-Imperial, painted it bright yellow, and emblazoned it with a slogan for his campaign for mayor of the Chorian city of Hweg Shul, \"Vote Snaplaunce.\" Identified by the registry number XV 119, Vote Snaplaunce was also registered as the vessel's official name."}, {"tag": "h3", "text": "Turbulence"}, {"tag": "p", "text": "Luke Skywalker returned to Nam Chorios in 44 ABY, pursuing the being known as Abeloth. Now the Grand Master in exile of the New Jedi Order, he was accompanied by his son, Ben Skywalker, and Vestara Khai, a Sith of the Lost Tribe who had reluctantly accompanied the Skywalkers on their quest. In the course of their search for Abeloth, they were led to believe that the disappearance of a local researcher, Doctor Cagaran Wei, could be related to Abeloth's presence. At Wei's residence, they met with Mayor Snaplaunce. As a former member of the Hweg Shul municipal police, Snaplaunce had met Master Skywalker on his prior visit to Nam Chorios, and as mayor he now chose to be involved in investigating a possible crime against a prominent Newcomer—a non-native resident of the planet—and to meet with prominent visitors to his city."}, {"tag": "p", "text": "Investigation of Wei's residence and the logs of his landspeeder provided a lead on the doctor's whereabouts, indicating that he regularly traveled to a point four hundred eighty-three kilometers outside the city. Snaplaunce used the resources of his office to locate any points of interest at that distance, and Skywalker's team soon found themselves in need of transportation to an abandoned rock ivory processing plant northwest of Hweg Shul. Time was an important factor to the investigation, and a landspeeder would take hours to make the journey. Returning to the orbiting Koval Station to either retrieve their vessel, the Jade Shadow, or charter a shuttle from Koval Transport, would also take time. Snaplaunce thus decided to provide Vote Snaplaunce as a faster alternative."}, {"tag": "p", "text": "When the group reached the location where Vote Snaplaunce was parked, Master Skywalker was stunned, both by the presence of a weapon of his former enemy and the incongruity of what he considered to be its cheerful paint scheme and its sinister origins. He suppressed his dismay and held back some sarcastic comments as Snaplaunce explained the ship's history, briefed the Jedi on its eccentricities, and explained the flight restrictions in effect over Nam Chorios. The elder Skywalker took the controls, though he did not don a TIE pilot uniform, the younger Skywalker and Khai boarded the passenger pod, and the team set out to find Dr. Wei. Despite aerobatics being prohibited by the weapons platforms in orbit and the shuttle's own limited handling characteristics, Master Skywalker enjoyed traveling at a fair velocity while operating starfighter-style controls again. His enjoyment did not last long, however, as trouble came from behind the mountains."}, {"tag": "p", "text": "As the flight continued, Vote Snaplaunce was chased down by Ship, a semi-sentient Sith Meditation Sphere in the service of Abeloth. Ship was faster and, unlike the shuttle, was heavily armed. Using its mass-driver cannon, Ship attacked Vote Snaplaunce. Though the ferrous projectiles Ship hurled at the shuttle were detectable in space by the shuttle's sensor suite, in atmosphere the ship automatically reconfigured its detection to the smaller and lighter debris commonly found near the surface. Master Skywalker was therefore unable to detect the projectiles without a distracting amount of effort. He was further hindered by Vote Snaplaunce's inherently poor maneuverability, and the battle soon attracted the attention of Nam Chorios's orbital control."}, {"tag": "h3", "text": "Degradation"}, {"tag": "p", "text": "Koval Station Control hailed Vote Snaplaunce to command the ship to cease deviating from its flight plan. The elder Skywalker's lack of a TIE pilot helmet and its voice-activated communications, combined with his lack of familiarity with the shuttle's control systems, delayed his response to Koval Station. As the younger Skywalker managed to initiate a reply, the shuttle's electronics began to fail, and Koval Station began raining turbolaser fire in the shuttle's direction while Ship continued its pursuit. As Master Skywalker attempted to maneuver in such a way that the orbiting station could hit Ship, one of Ship's shots grazed the starboard wing of Vote Snaplaunce. The elder Skywalker struggled to retain control of the damaged craft, but he was suddenly assaulted through the Force by the death of a sentient being. The disturbance in the Force caused Master Skywalker to lose control of Vote Snaplaunce."}, {"tag": "p", "text": "Vote Snaplaunce plummeted and spun until Master Skywalker regained control and activated the shuttle's repulsorlift system. He dropped Vote Snaplaunce into a dust storm and Koval Station lost its weapons lock. Ship was stunned by the same Force trauma that affected Skywalker's team and fled. Although he briefly hoped that Koval Station had destroyed Ship, Master Skywalker realized that the death agony came from the destruction of a Tsil, the sentient crystal lifeforms that dotted the surface of Nam Chorios. Now that the team was relatively safe, the younger Skywalker plotted a course to their original destination. Although they had not been hit by weapons fire, the shuttle's engines continued to falter as they closed in on the rock ivory processing plant. Master Skywalker resolved to compensate Snaplaunce for the damage to his ship—unless, of course, Snaplaunce himself had arranged for Ship's ambush, or had sabotaged the ship. Within three hundred meters, the engines failed entirely, and Master Skywalker was forced to land the shuttle to prevent being blown away from their destination by winds."}, {"tag": "p", "text": "At the plant, Skywalker's team located Dr. Wei's body, and the trio reasoned out the probable sequence of events leading to his death. They determined that Wei had been used as bait to draw them out to the site and set them up for an ambush, and that either Snaplaunce was a conspirator or the sabotage was performed by someone who knew Snaplaunce had a tendency to loan Vote Snaplaunce to important visitors. The team inventoried their resources and evaluated the feasibility of repairing Vote Snaplaunce, which did not look promising. Ben Skywalker examined the shuttle and located the nature of the sabotage, a powerful capacitor set up to direct a surge into the ship's systems as soon as the ship received any lengthy signal from orbital control. Though it took only minutes to install, the system-wide damage it caused could take weeks to repair, and the younger Skywalker could not help admiring the saboteur's efficiency. As Khai was contesting his opinion, she realized that while the laser cannon was removed, its support systems had only been detached from the internal circuits. That fact provided the key to restoring any functionality to Vote Snaplaunce."}, {"tag": "h3", "text": "Rebirth"}, {"tag": "p", "text": "While Master Skywalker communed with the Tsils to continue the hunt for Abeloth, his son and Khai redesigned Vote Snaplaunce into a unique wind-steered landspeeder. Master Skywalker approved of his son's sketch but amended the repair plan to include moving the shuttle downhill from the rock ivory plant to avoid detection by Ship. They pushed it under a rocky overhang and covered it in sand, which successfully concealed it from an overflight by Ship. Skywalker's team could not affect repairs during the day due to the windstorms that regularly battered the wilderness on Nam Chorios during daylight, so they shared the old but still edible rations stored aboard Vote Snaplaunce and rested until dark. The Skywalkers shared the passenger pod, and Khai slept alone in the pilot pod—the Sith believed that Master Skywalker arranged this to protect Ben from succumbing to any impulsive acts that could further complicate their group dynamic."}, {"tag": "p", "text": "After dark, the trio resumed their repairs. Activating the repulsors, they removed the sand that they had used for camouflage by taking advantage of the repulsors' vibration combined with manual sweeping. They turned the remains of the shuttle's wing arrays into wind rudders controlled by a set of pulleys made from the shuttle's hatch-closing wheels and cables run through holes cut into the hull with an arc welder that was stored in the shuttle's emergency toolkit. The port ion engine was restored to life with the wiring salvaged from the decommissioned laser cannon. Ben Skywalker took a moment to take holocamera shots of their creation with his datapad, then the team planned their next move. Through his communion with the Tsils, Master Skywalker learned that the native Theran Listeners had been subverted; thus, much of the planetary population may have been turned against his team. They plotted a course back to Hweg Shul that avoided Human contact and stuck to flatlands—Vote Snaplaunce could not navigate hills or mountains in its new configuration."}, {"tag": "p", "text": "Though steering was difficult, the shuttle's new configuration could achieve a speed of nearly fifty kilometers per hour. Steering adjustments had to be coordinated by intercom to control the port and starboard rudder pulleys, with the Jedi shouting until they were both hoarse. Lacking the help of the shuttle's computer, Master Skywalker had to plot their course by celestial navigation, comparing the stars overhead with a map on his datapad. At the end of another night, Vote Snaplaunce was parked against a hilly ridge and the team rested through another day cycle. Though the group had not been able to restore the shuttle's communication systems, they were finally close enough to Hweg Shul for their personal comlinks to pick up broadcasts. They learned that Force storms were ravaging the city and Snaplaunce had been assaulted before the daily dust storms cut communications off again. The shuttle remained parked until nightfall. When darkness fell once more, they were able to drive Vote Snaplaunce the remaining distance to Hweg Shul."}, {"tag": "p", "text": "Just before dawn, Skywalker's team parked Vote Snaplaunce for the last time and powered it down just outside Hweg Shul. Completing their journey on foot, the group learned from public broadcasts that they were suspected of attacking Snaplaunce to steal his shuttle. As their hunt for Abeloth progressed, the team found themselves in need of transport once more, but Vote Snaplaunce was left alone as they stole a modified T-47 airspeeder parked outside a tapcafe. When Snaplaunce recovered from his injuries, he cleared the Skywalkers and Khai of suspicion for his attack. His own recollection of the incident corroborated official city telemetry of the shuttle flight, proving the group had been in the air by the time he was attacked on the ground."}, {"tag": "p", "text": "While Skywalker's team was continuing to track Abeloth, holojournalist Kandra Nilitz arrived on Nam Chorios with the Jedi Valin and Jysella Horn, who were still under the influence of Abeloth and had been compelled to find and assist her. After being abandoned by the Horns, she tried to track Master Skywalker's movements on the world. The reporter noted that Vote Snaplaunce was recovered outside Hweg Shul shortly before the theft and destruction of a T-47 airspeeder. Nilitz located the wreckage of the T-47 and found Master Skywalker and his team nearby. In exchange for her cooperation in his quest, Master Skywalker offered to tell her about Abeloth and the Lost Tribe of the Sith, or a detailed story about how his party got Vote Snaplaunce running again. The reporter accepted Skywalker's first story offer and declined the second."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "After being released from the Imperial Navy, the TIE shuttle went through a short succession of commanders. It was owned and operated by an ex-Imperial mechanic for some time before it was sold by the mechanic to Snaplaunce, the Ithorian mayor of Hweg Shul on Nam Chorios. Snaplaunce had a tendency to offer the shuttle to distinguished guests, and used it as a traveling campaign advertisement, naming it Vote Snaplaunce. Snaplaunce became familiar with the shuttle's various eccentricities, and briefed Luke Skywalker on them when he loaned the shuttle to the Jedi."}, {"tag": "p", "text": "Luke Skywalker, exiled Grand Master of the Jedi Order, borrowed the shuttle in 44 ABY during his hunt for the entity known as Abeloth. A distinguished starfighter pilot, Skywalker initially enjoyed his command of the shuttle, but a lack of extensive experience with the shuttle's particular control layout led to some difficulty in using its communication systems, though the issue was soon rendered moot by sabotage."}, {"tag": "p", "text": "During Master Skywalker's command of Vote Snaplaunce, he was backed up in the passenger pod by the other members of his team on the hunt for Abeloth. Master Skywalker's son, Jedi Knight Ben Skywalker, accompanied his father on his search for Abeloth after the Master's exile from Coruscant by the Daala administration. Ben Skywalker attempted to assist the Jedi Master with the secondary systems aboard Vote Snaplaunce during the battle with Ship, and was largely responsible for the shuttle's redesign into a landspeeder after its forced landing due to battle damage and system failure."}, {"tag": "p", "text": "Also accompanying him was Vestara Khai, a Sith of the Lost Tribe from the planet Kesh. Khai joined the Skywalkers' party on the hunt for Abeloth, initially as a prisoner, then as a fugitive from her own people after she was forced to kill a superior when he began to transform into another being of Abeloth's like. Khai won an argument with the younger Skywalker over control of the front seat in the passenger pod of Vote Snaplaunce and was therefore in charge of the secondary sensor board. She later assisted Ben Skywalker in the repair effort after the shuttle's landing, and took control of one of the wing pulleys as they flew back to Hweg Shul."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first and only appearance of Vote Snaplaunce is in Fate of the Jedi: Conviction by Aaron Allston, the seventh book of the Fate of the Jedi series, published in May 2011. Although TIE shuttles have been featured in numerous reference books, Vote Snaplaunce is the first TIE shuttle featured in a work of Star Wars fiction since the publication of Dark Knight's Devilry in January 1982."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}