{"url": "Voss", "categories": ["Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Allied Tion sector planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Voss locations"], "nodes": [{"tag": "h1", "text": "Voss"}, {"tag": "p", "text": "Voss was a terrestrial planet in the Voss system located in Allied Tion sector of the Outer Rim Territories. Originally only having one native sentient species known as Gormak, the planet was discovered by the ancient Sith who used Voss for its resources, until the Jedi arrived to drive them off. Seeking allies among the natives, the Jedi taught some of the Gormak tribes on how to use the Force, but the Gormak were unprepared and those tribes radically evolved into a different looking species named the Voss. The Sith were exterminated, while the Jedi left or died out, and the Voss settled on the mountain peak, establishing the city of Voss-Ka. The Voss society turned to Force-sensitives for guidance, as Voss Mystics received Force visions that proved true without exception, Interpreters made sure each vision's meaning was understood correctly, and the Three governed the entire Voss people. Nomadic Gormak came to view the Voss as abominations and became exceptionally hostile to them, attempting to purge them from the world. In return, all Voss spend time serving as Voss commandos, ensuring their survival against millions of Gormak, while the Mystics developed healing rituals to heal grave wounds."}, {"tag": "p", "text": "During the Cold War between the Sith Empire and the Galactic Republic Voss was discovered by the larger galaxy, and both governments tried to enter into an alliance with the Voss to benefit from the visions of their Mystics in the war. However, the Voss resisted direct conquest by foiling the Imperial Attack on Voss and remained stubbornly neutral thanks to the actions of the Star Cabal, whose agent Albathius convinced them to keep their neutrality for three thousand days. When the Galactic War broke anew between two powers, Voss became a battleground as both sides tried to gain favor by helping the Voss against the Gormak, while the Sith plotted schemes to present the Republic in a bad light, smuggle an army of cyberbeasts offworld or even hold the city of Voss-Ka hostage. During that time, the capture of Gormak King Jokull revealed to the Voss their shared origins with the Gormak, while a mission by the Hero of Tython resulted in the death of Sel-Makor, the source of corruption in the Nightmare Lands."}, {"tag": "p", "text": "When the galaxy was conquered by the Eternal Empire of Zakuul, the Voss and the Gormak ended their centuries long conflict and united in face of a larger threat. Voss Mystic Sana-Rae and Gormak warrior Rokuss traveled off-world to join the Alliance that opposed Zakuul and helped destroy the Star Fortress that dominated over Voss. Voss was later directly attacked by the Eternal Fleet, which destroyed the Shrine of Healing and dealt significant damage to Voss-Ka until the attack was repelled by the combined efforts of the Alliance, the Mandalorian warriors, and the Imperial fleet, though casualties still numbered in thousands. By the time of the Galactic Empire thousands of years later, Voss was controlled by the Tionese clans."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Voss had a temperate climate and solid terrain, with roughly half of the planet covered in rocky plateaus, unspoiled peaks, and verdant forests, while the other half lay under seas and oceans. Grasslands like those in the Serenity Valley gave way to unspoiled forests such as the Western Watchwoods, with occasional outposts by Voss commandos or small camps of the nomadic Gormak. Among Voss local predators were the mawvorr-also known as crysfangs—purple-skinned reptilians who were opportunistic hunters and preferred striking at wounded animals or wandering humanoids as opposed to carefully hunting and stalking their prey. Shaclaws, massive armored insects with powerful foreclaws used them for burrowing into the soil in search of the roots and subterranean mammals but were also capable of shredding flesh or armor of their enemies, aided by the fact that their tissue was contaminated by deadly toxins within minutes of dying. The largest and deadliest predator on the planet was the vorantikus, heavily muscled bipedal creatures who stalked the wilds as solitary hunters. Voss also had a population of uxibeasts, mammalian pack herbivores with a multitude of horns, who were believed to originate on Tython, but have been spread to other planets by the ancient Jedi."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Eternal War"}, {"tag": "p", "text": "In ancient times, at some point after the Second Great Schism, the Sith came to Voss, which at that point had only one native sentient species, the Gormak, which the Sith viewed as primitive and ignored as they began to harvest the world's resources. However, the planet and the Gormak were irrevocably changed when the Jedi attempted to drive the Sith off Voss. Seeking allies among the natives, the Jedi agreed to teach some of the Gormak tribes how to use the Force, but the Gormak were unprepared for the knowledge. Those tribes underwent radical evolutionary changes in the course of a few generations, becoming a new species named the Voss. The Jedi attempted to teach the Voss how to control their emotions and new powers, but the Voss instead attacked the Sith on the planet, bringing the new species in contact with the dark side of the Force. This caused the dark side to become manifest in a Sith structure on the planet, and this entity came to take the name Sel-Makor as it gained intelligence. Sel-Makor began to feed on violence and suffering, fueling its dark side powers and spreading corruption across the surrounding area. The entity twisted the minds of the animals and beings within his reach, and they became his crazed servants. The area under Sel-Makor's control became known as the Nightmare Lands, and the ancient Sith complex that the entity inhabited was known as the Dark Heart. After the extermination of the Sith, the Voss forgot their origins and founded the city of Voss-Ka atop the planet's highest peak, while the Jedi eventually died out or departed. Those Voss who could use the Force to see into the future became known as the ruling Mystics, and the Voss commandos protected the city. Sel-Makor, meanwhile, influenced the Gormak's bloodlust and drove the far more numerous species to attack their cousins throughout the centuries so that he could feed off of their dark emotions."}, {"tag": "h3", "text": "Cold War"}, {"tag": "p", "text": "Following the Treaty of Coruscant that ended the Great Galactic War between the Sith Empire and the Galactic Republic, Voss was accidentally rediscovered by the larger galaxy several years before 3640 BBY. Upon learning of the Voss' prophetic abilities, Sith Emperor Vitiate ordered to conquer the planet, and General Khypes arrived in orbit with a battlecruiser and several army divisions in order to demand a surrender, having been alerted that the Voss capital of Voss-Ka was undefended. However, Khypes' cruiser exploded before he could contact the planet, and the ship's escorts were destroyed moments later. During this time, the agents of the Emperor's Hand kidnapped a Voss from the surface for the Emperor's own purposes. Realizing that they had underestimated the Voss, the Empire declared that Khypes had gone rogue, and both the Empire and the Republic began making diplomatic overtures to the Voss."}, {"tag": "p", "text": "However, their efforts to gain Voss Mystics on their side were foiled by a secret society calling iteself the Star Cabal. An operative named Albathius arrived on Voss shortly after its discovery, and gained great influence among the Mystics, becoming known as the \"Shining Man\" and convincing the Voss to stay neutral from the Cold War between two governments for three thousand days, enough time for the Star Cabal to exert its own influence on the war and keeping the Voss from choosing a side. The Shining Man promised that in time, the Gormak, the Empire and the Republic would be eradicated, and no offworlders would come to Voss again, and was buried under Voss-Ka after his death. Around the same time, a Sith Lord named Darth Baras began to plot a long con on the Emperor. Learning of Sel-Makor's existence, Baras met with the entity and promised the Emperor's powers if Sel-Makor would imprison the Emperor, who was inhabiting the body of a Voss in a long line of the Emperor's Voices, and the inner chamber of the Dark Heart was a place where no Voss could leave after entering."}, {"tag": "p", "text": "At some point during the Cold War, a Gormak by the name of Jokull entered the Nightmare Lands and traveled to the Dark Heart, entering the cave known as the Dark Hollow where Sel-Makor was most powerful. Instead of consuming the Gormak's mind like he had done to so many others, Sel-Makor instead chose to awaken within Jokull his species' natural ability—the power to see visions as the Voss did. Horrified that he had been corrupted and seeing all Voss as being marked with evil because of their powers, Jokull returned to the Gormak Lands and became king of his people in order to wage war upon the Voss—so that the Gormak would never be corrupted like he was. The Emperor decided to investigate Voss himself around 3640 BBY and arrived on Voss in the guise of a Mystic, where he entered the Dark Heart only to find that he was trapped. The Emperor was forced to battle Sel-Makor for control of the Voss body he was inhabiting. Weakened by the loss of his avatars and desiring the Emperor's unimaginable power, the entity prevented him from releasing his spirit by committing suicide and attempted to suppress the Sith's mind."}, {"tag": "h3", "text": "Galactic War"}, {"tag": "p", "text": "Both galactic powers continued their diplomatic efforts on Voss until the Cold War ended and two governments engaged in another Galactic War elsewhere in the galaxy, while struggling to maintain neutrality on Voss. Trying to gain an alliance with the Voss, both the Republic and the Empire lent aid to the Voss in their fight against the Gormak. Under the suggestion of their top diplomat Darth Serevin, the Sith aided the Voss in destroying Gormegan-1, a starship being built by the Gormak on Jokull's orders, while the Republic helped the Voss to destroy the cannon the Gormak were building to use against Voss-Ka. However, in the process, the Voss discovered Jokull's ability to see the future, and they enlisted the aid of outsiders in retracing the Gormak king's steps in the Nightmare Lands, soon learning the truth of their species' creation."}, {"tag": "h4", "text": "The death of Sel-Makor"}, {"tag": "p", "text": "During the same year, Baras' apprentice had been appointed the new Emperor's Wrath at the Emperor's request by agents of his Hand, and the Emperor was able to communicate his situation to Servant Two of the Hand in a moment of strength. The Wrath, whom Baras had tried to kill at the beginning of his coup attempt, traveled to Voss and was able to locate the Emperor in the Dark Heart after gathering the Blessing of Oneness and the Pendant of Bone needed for entrance. The Emperor ordered his Wrath to kill the Voice and free his essence, but Sel-Makor refused to allow his prize to escape and seized full control of the Voice's body. The Wrath was forced to battle the possessed Voice, but managed to defeat the entity and drive him out of the Voice long enough to slay the Emperor's host. After taking a new host on the Imperial capital of Dromund Kaas, the Emperor continued preparations for his ritual, which would consume all life in the galaxy and channel it into the Emperor. To that end, he dispatched the Sith sorcerer Fulminiss to Voss, ordering the Sith Lord to utilize Sel-Makor's power to ensure the thousands of simultaneous deaths necessary to start the ritual. Fulminiss approached a young Mystic named Valen-Da and enlisted his help to enter the Voss sanctuary known as the Shrine of Healing."}, {"tag": "p", "text": "In the Shrine of Healing, Fulminiss learned a healing ritual from the spirits of long-dead Mystics, and corrupted the ritual so that it twisted minds and drove its victims insane. With Valen-Da, Fulminiss traveled to the Dark Heart in order to meet with Sel-Makor, but the Jedi Knight known as the Hero of Tython was attempting to foil the Emperor's ritual and tracked Fulminiss to the Dark Heart with the help of the Voss Commando Tala-Reh. Fulminiss fell to the blade of the Jedi Knight in battle, and Valen-Da then revealed the truth of his vision, that showed that the Commando would descend into the heart of Sel-Makor's power and destroy the entity once and for all at the cost of her own life. Tala-Reh descended the steps to confront the entity, and her sacrifice counteracted Sel-Makor's powers, destroying the creature with a burst of Force energy and sealing the heart of power when the chamber collapsed onto the pit."}, {"tag": "h4", "text": "The Sith machinations"}, {"tag": "p", "text": "Republic Special Forces Division Havoc Squad was assigned to Voss by General Elin Garza to stop Senator Evran from withholding thousands of Republic soldiers from the war effort for fear that the Empire would attack Voss again, despite the desperate need for troops elsewhere. Evran personally greeted Havoc Squad's Major in Voss-Ka and suggested that they should let the Imperials make the first move. Havoc Squad went after an Imperial agent codenamed Deadfall, known for spreading subversion on planets before the Empire invaded them. Havoc Squad fought their way into Deadfall's secret base beneath Voss-Ka, where they established a link with Evran's office for SIS agent Kellor. Deadfall soon arrived and attacked, forcing Havoc to kill him. Based on Deadfall's data, Kellor confirmed that the smuggler Pol Blex made multiple deliveries to Voss on the Empire's behalf. Havoc stormed Blex's hideout and learned from the Neimoidian that he had smuggled tunneling equipment and a ZR-57 orbital strike bomb that was stolen on Ord Mantell on Voss. After Havoc thwarted the Imperials in Gorma-Koss, they learned from Evran that Kellor had discovered the bomb's location, but was shot down and crashed into the Nightmare Lands. When Havoc found Kellor, they found the SIS agent succumbing to the Nightmare Lands' corruption, but before he expired, Kellor gave them the bomb's location. Havoc found the bomb and uncovered Sith Lord Torius' plan to use it to hold Voss-Ka hostage, thwarting the Sith's plan and killing him."}, {"tag": "p", "text": "Sith Lord Kallig, whose mind required healing after being overwhelmed by a Force walking ritual, traveled to Voss looking for the Forbidden Ritual that could help them. At the Imperial Embassy in Voss-Ka Kallig met with Imperial ambassador Athelis Kallis, who suggested that the Sith Lord seek out the outcast Dream-walkers cult. Kallig arrived at the cult's enclave at the Mind healer's grove and with the permission of their leader Asa-Ku, undertook their initiation ritual in order to learn their mind-healing ritual, which caused Kallig to go into the Spirit World. Upon returning to the waking world, Asa-Ku told Kallig to go to the Shrine of Healing, where Kallig was addressed by a disembodied voice of another Force ghost, this time a Voss called Mar-Da, who was the first dream-walker and stated that the mind-healing ritual was forbidden. Kallig forced Mar-Dato to reveal that a dream-rock in the Nightmare Lands could defeat the ghosts bound to Kallig by turning them to flesh and blood, but only a Gormak could use it. Journeying into Gorma-Koss, Kallig used dream-walking to communicate with a sympathetic Gormak named Hadrik, who was tired of the fighting between Voss and Gormak. Hadrik agreed to perform the ritual in exchange for passage offworld and traveled with Kallig into the Nightmare Lands, where they found the dream-rock, containing the spirit of a Voss named Dal-Rin. Dal-Rin instructed Hadrik on how to use the rock on the ghosts and defeat them. The pair proceeded to strip away the ghosts' disguises and bested them one-by-one, after which Kallig used the rock to heal themselves. Upon returning to the Voss Orbital Docking Station, Kallig and Hadrik found Voss commando Sor-Nak waiting for them, who declared that for taking a Gormak off Voss, his people would reject the Empire. To preserve Imperial interests, Kallig used a mind trick to make Sor-Nak forget about Hadrik."}, {"tag": "h4", "text": "Smugglers and bounty hunters"}, {"tag": "p", "text": "A bounty hunter working for Sith Lord Darth Tormen arrived on Voss to take out Thelonia Redrish, female Kuati General of the Galactic Republic heading the Republic diplomatic effort on Voss. Working with Imperial Ambassador Methias Yoran, the Grand Champion of the Great Hunt uncovered evidence that Thelonia was covertly launching strikes against Imperial holdings, and attempted to convince the Voss to hand her over. However, the General challenged the Champion's evidence at a Voss hearing and accused the Hunter of being a terrorist, arguing towards the Voss that the evidence was suspect and boasted that she undertook the pilgrimage to the Shrine of Healing. Yoran, eager to show the Empire in a good light, volunteered that the Champion also undertake the trials. Thelonia did not intend for the bounty hunter to succeed and convinced a Voss Mystic at the shrine that the Champion would interfere with the coming change to Voss. As the Champion evaded the attempted detainment, Thelonia journeyed to Gorma-Koss and surrendered herself to the Gormak, attempting negotiations with them. While the Gormak King Jokull would not listen to reason, a few dissidents among the natives journeyed with her to the Nightmare Lands, where she discovered inscriptions detailing that Jedi and Sith once battled on Voss and exploited the natives. However, she was then confronted by Champion and was defeated."}, {"tag": "p", "text": "A smuggler captain known as the Voidhound arrived on Voss in search of a trade of Gormak cyberbeasts transported offworld by the Exchange for the crime lord Rogun the Butcher. Voss Diplomat Lokir-Ka offered himself as government's contact for the smuggler, directing them to his Exchange contact Scratch in the Minev-Ra Caves. Scratch put the smuggler in contact with Jela Reneke, who was aware that the buyer was the Rogun's biggest bounty and ambushed the smuggler, leaving them alone among the evidence of Reneke's own illegal operation and tipping off the Voss Adjudicators. Lokir-Ka stalled the Adjudicators and allowed the Voidhound to escape. When the Voidhound later infiltrated the home of Reneke's partner Gormak Zak, Zak showed no hostility and explained that he came to despise Reneke, for she had committed an act considered atrocious by Gormak. To fulfill a special contract for the Sith Lord Wratchen, Reneke recruited Gormak to help her apply cybernetic enhancements to Nightmare Lands beasts and took a group of Gormak into the Nightmare Lands, where those who survived and returned went mad from the experience. Gormak Zak agreed to help the Voidhound and provided them Reneke's coordinates. Reneke, suffering from the Dark Heart's mind-rending influence, was meeting with Wratchen in Lab 68 when the Voidhound interrupted their meeting and killed both of them. Lokir-Ka insisted on bringing the matter before the Adjucators, and his wife Mirev-Ka led the proceeding while Lokir-Ka acted as a defendant. The Adjudicators found the Voidhound innocent of cyberbeast smuggling, but guilty of other things such as dealing with Gormak and venturing into the Nightmare Lands."}, {"tag": "h4", "text": "Gaden-Ko's rite of passage"}, {"tag": "p", "text": "The Jedi known as the Barsen'thor arrived on Voss seeking a Voss Mystic as an ally in their Hunt for the Children of the Emperor and met with the Republic Ambassador Sophia Farash, who assumed that the best way to gain the assistance of a Mystic would be to help one of the potentials finish the necessary pilgrimage. Gaden-Ko, a young potential Mystic who would be entitled to a large entourage of healers and Voss commandos if he passed the rites, had already embarked on his pilgrimage in the Old Paths region, and fearing for Gaden-Ko's safety, Farash asked the Jedi to follow him. The Jedi entered the holy grounds, which had been overrun by wild animals and was able to rescue and heal Gaden-Ko, who agreed to let the Jedi become his guide during the pilgrimage to the Shrine of Healing and went to a marker called the Ruins of Wisdom to pay respects to a holy figure called Lishi-Na. Once there, Gaden-Ko was attacked by a Sith Lord Shendan, who stabbed him in the back with a poisoned knife to frame the Republic for the murder of Gaden-Ko, as the blade was soaked with a Republic toxin. The Barsen'thor fought Shendan and defeated him and escorted the wounded Gaden-Ko to the Shrine of Healing, where they went straight to Orin-Va and Asha-Mu, two healers who tended to Gaden-Ko. Awake, Gaden-Ko shared with his guide that he believed that he needed to complete the next step of his pilgrimage, to contemplate beside an ancient carving at a holy place to receive a sign that would guide him. However, the carving had been shattered long ago and was scattered throughout the nearby city of Gorma-Koss, an area ruled by the Gormak."}, {"tag": "p", "text": "The Barsen'thor found the scattered pieces of the carving and assembled them at the Halls of the Righteous, where Gaden-Ko meditated at the carving, but no sign came. A squad of Voss commandos appeared just in time to save Gaden-Ko from a Gormak assassin who had infiltrated the sacred halls and had attempted to kill him. The commando leader explained that the Gormak operated a mining camp nearby where they mined valuable crystals. Believing that the appearance of the commandos was the sign Gaden-Ko had been looking for, the Jedi agreed to go to the Gormak camp and dismantle their mining operation. Gaden-Ko stated that the next stop of their journey was the Deep Cradle in the Dark Heart, located in the Nightmare Lands, and the Barsen'thor and Gaden-Ko entered the Deep Cradle, where they they found three altars signifying the three tenets of the Voss society—life, death, and duty. Gaden-Ko stopped to meditate at each altar, becoming a full-fledged Mystic. Gaden-Ko and the Barsen'thor returned to Voss-Ka, where they spoke with the Three—Sonn-Vi, Gunt,a-Mer and Nen-Ji—who informed the Jedi that Gaden-Ko's vision had been interpreted to mean that he had to leave with the Barsen'thor. Alongside Gaden-Ko, an entire entourage of three vision interpreters, seven healers and sixty Voss commandos led by Jenar-Sei joined the Jedi Master's crew, traveling aboard other ships belonging to the Rift Alliance. Gaden-Ko also vouched for the Republic before the Three, asking them to consider to have the Voss enter an alliance with the galactic government."}, {"tag": "h4", "text": "Imperial Intelligence activities"}, {"tag": "p", "text": "Imperial Intelligence agent Cipher Nine traveled to Voss in their Hunt for the Star Cabal and met with an Imperial agent surgically altered to look like a Voss named Bas-Ton in order to infiltrate the isolationist society. Learning of Albathius and suspecting him to be a Star Cabal member, Cipher Nine went to visit his tomb under Voss-Ka and opened the Shining Man's sarcophagus, finding his ashes and a scroll containing his prophecy. The agent learned that the Shining Man visited the Wellspring of Healing inside the Shrine of Healing and retraced Albathius' steps, learning that the recording of the Shining Man's visit to Wellspring of Healing existed in a vitalicron. Cipher Nine opened the genetically locked vitalicron with the genetic sample from the ash collected from the sarcophagus and played the recording, which suggested that the Shining Man somehow forged the scroll using ancient materials in the Nightmare Lands and used it to con a Voss Mystic. Cipher Nine ventured into Nightmare Lands and to the Chamber of Ashes, where they found the Shining Man's ship guarded by a Gormak named Xanar. The Gormak refused to believe that the Shining Man was dead and attacked the agent when Cipher Nine attempted to take the ship's computer. The agent killed the Gormak and had secured the data and was granted a meeting with the Three, revealing that the Shining Man was able to exploit his fake prophecy in order to convince Voss to stay neutral on behalf of the Star Cabal."}, {"tag": "h3", "text": "The Eternal Empire"}, {"tag": "p", "text": "In 3636 BBY the galaxy was invaded by the Eternal Empire of Zakuul. Having subjugated both the Republic and the Sith Empire within a year, Eternal Emperor Arcann placed dozens of massive battlestations called Star Fortresses in orbits of subjugated worlds to watch for possible uprisings. Voss Star Fortress was commanded by Exarch Andur Melor and protected by a shield bunker located in the Pelath-Ri Marches. The Gormak saw the Star Fortress as a source of the disease that affected their young, old and weak, and in the face of a larger threat, the Voss and Gormak soldiers had united to defend their homeworld, ending the centuries-long war between two species. Their alliance has proven surprisingly effective, with the meditative reserve of the Voss complimenting the ferocious strength of the Gormak to form a formidable army. In 3631 BBY a Gormak warrior Rokuss teamed up with the Commander of the Alliance that opposed Zakuul to take down the Star Fortress. Together they assembled a strike team that assaulted and destroyed the shield bunker protecting the Star Fortress before regrouping on the Alliance base on Odessen. From there, the Commander infiltrated the Voss Star Fortress and reached the Sun Generator room, where they disabled the safety features of the Sun Generator and killed Andur Melor. The Commander escaped on the shuttle, while the Sun Generator overloaded, vaporizing the entire Star Fortress. As the gratitude for ridding their world of the Star Fortress, Rokuss and his warriors stayed to fight for the Alliance, in which the Voss Mystic Sana-Rae already held a promiment position, overseeing the training of Force-sensitives."}, {"tag": "p", "text": "The next year, the Alliance defeated Arcann in the Battle of Odessen, and his mother Senya Tirall rescued her wounded son and fled into hyperspace in hopes of redeeming him. In Arcann's absence his sister Vaylin claimed the Eternal Throne and declared a bounty on her mother, who brought Arcann to the Shrine of Healing on Voss, hoping to use the Voss healing ritual to heal him. Having followed her mother's trail to Voss, Vaylin launched an invasion, determined to hunt her family down. At this time, Alliance operatives Theron Shan and Sana-Rae were already onworld and alerted the Alliance about the attack, allowing the Alliance Commander to scramble the fleet in response. The Eternal Empire began deploying ground forces to Voss-Ka, and the Eternal Fleet opened fire, causing buildings to collapse and fires to spread throughout the capital. Theron Shan attempted to rally Voss commandos to the defense, but their forces were outmatched, and he led a group to take shelter in the Tower of Prophecy."}, {"tag": "p", "text": "Emerging from hyperspace, the Alliance fleet arrived to Voss and engaged the Eternal Fleet, while a stolen Zakuulan shuttle allowed the Alliance Commander, Lana Beniko and Torian Cadera with a group of Mandalorian commandos to slip past the Eternal Fleet blockade and land in Voss-Ka. From the Republic District, the Alliance and Mandalorian forces engaged Knights of Zakuul and skytroopers, while the Eternal Fleet bombardment had completely obliterated the Imperial District plateau. The Commander and Lana met Theron at the Tower of Prophecy, where the group received a distress call from Senya, who pleaded the Alliance for aid, promising that Arcann would join their fight if healed. The Commander ordered Lana to led the Mandalorian forces towards the Shrine, while Theron and the Commander traversed the Old Paths that lead to the Shrine in the Storm Rider walker. Inside the Shrine, they met with Senya, who bargained for her son's life, but Vaylin ordered the Eternal Fleet to bombard the Shrine trying to kill them all. Senya asked the Commander to hold of Zakuulan forces so that the healing ritual could be completed and rushed to her son after they agreed. Senya single-handedly defeated a host of Zakuulan Knights, but as her position was about to be overwhelmed, she ordered the Voss Mystics to take her strength to heal her son. The Mystics complied and transferred her strength to Arcann, healing his injuries and mending his broken spirit, though this act left Senya comatose. Arcann awoke confused and, witnessing his mother's lifeless body, fled to his shuttle and escaped into hyperspace. At this point ,Vaylin has ordered the Eternal Fleet to burn her entire family regardless of casualties on Voss. Just as all seemed lost, the tide of the battle was turned by the arrival of the Imperial Fleet, led by Sith Empress Acina. Harrower-class dreadnoughts opened fire on the Eternal Fleet warships, destroying several of them and prompting the rest to flee in self-preservation. Although Voss was saved from the full destructive might of the Eternal Throne, it suffered heavy losses, with much of the planet devastated and thousands of Voss and Gormak killed."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "By the time of the fall of the Republic, Voss was solely known as an unremarkable mining world. In the early years of the Galactic Empire, the planet became part of the newly formed Allied Tion sector. The Empire attempted to create industries on the planet to rival Lianna, however the planet came under the control of corrupt Tionese clans. The mother of Imperial fighter pilot Harme Kiela was from a wealthy industrialist family on the planet."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Voss-Ka"}, {"tag": "p", "text": "The capital settlement of the Voss species was Voss-Ka, a fortified settlement spread across several mountain peaks and connected by bridges. On the eastern side was the Judicial Quarter with the Seeker's Hill, on top of which stood the Tower of Prophecy, from which the Three governed the Voss. After Voss was rediscovered and became visited by offworlders, the Voss decided not to allow these \"Outisiders\" into the Voss-Ka proper, but rather set a special Alien Enclave for them on the western side, which housed the Alien Enclave Market and the Ambassador Commons, containing both Republic and Imperial Embassy. Since all Voss obeyed the Three without question, there used to be no crime in Voss-Ka, but the presence of the outsiders required the Voss to create Adjudicators specifically to govern the actions of the outsiders, with dangerous offenders force to take the Step of Harmony off the mountain into the gorge below."}, {"tag": "h3", "text": "Gormak Lands"}, {"tag": "p", "text": "To the south of Voss-Ka lay the Gormak Lands, a region dominated by Gormak where they established Gorma-Koss, a massive settlement for thousands of Gormak who united their tribes into a sprawling expanse of huts, tents, high-tech defenses and technology. In the Gorma-Koss the Gormak constructed a Gormak cannon to threaten the Voss-Ka and a starship named Gormegan-1 which they intended to use to travel to the stars. These constructions were supported by the Tela Mining Operations, while the Gormak King Jokull stored treasures and trophies from his conquests in the underground vault known as the King's Hall. The Voss commandos kept watch over the Gorma-Koss from outposts at Koss Overlook, Camp Talanis and Outpost Skyline."}, {"tag": "h3", "text": "Old Paths"}, {"tag": "p", "text": "To the west of Voss-Ka was the region known as the Old Paths, where a Road to Renewal led to the Serenity Valley and the Shrine of Healing, an ancient Shrine of Voss Mystics and the only significant Voss presence outside of Voss-Ka. The Beastmark Hills in the south marked the border of the Flamewood, which ended at the Russet Slopes to the east, where a Ruined City stood, containing old traces of Jedi presence on Voss. A network of caves permeated the region, which included the Houk Syndicate Lair, the Mind healer's grove and the Minev-Ra Caves."}, {"tag": "h3", "text": "Pelath-Ri Marches"}, {"tag": "p", "text": "North of the Voss-Ka were the Pelath-Ri Marches, an area that used to be underwater until the Voss built the Err-Ka Dam on the north-eastern edge to hold back the floodwaters. The Crossing Woods covered the Pel-Ki Ridge and the Hills of the Ancients. When the Gormak invaded the region, they settled on the Fest Otur Island and began to cut down many of the trees and building monolithic structures, resulting in the Clear-Cut Forest and the Barrenwoods. The Voss commandos maintained Kri-Ta Outpost, Outpost Overseer, and Pelath Point in the area."}, {"tag": "h3", "text": "Nightmare Lands"}, {"tag": "p", "text": "The Nightmare Lands to the east of Voss-Ka were inhabited by maddened travelers and twisted creatures, corrupted by the influence of Sel-Makor. Tainted wildlife roamed the Twisted Forest and the Crafted Blight, a Defiled Brook ran from the Deepest Woods to the Sha-Thes Meadow, and the Lake of the Unseen provided a way for Voss Mystics to reach the Spirit World. At the center of the Nightmare Lands stood the Dark Heart, a complex maze of chambers, some being sealed while others broken from within, and a vast series of underground corridors that was the center of Sel-Makor's power."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Briefly mentioned in the \"Unusual Suspects\" article published in Star Wars Gamer 6 in 2001, Voss received no further appearances until 2009, when it was included the Appendix of The Essential Atlas and received additional information for the first time in the online article Xim Week: The History of Xim and the Tion Cluster. Voss was featured as one of the main planets in Star Wars: The Old Republic, which greatly expanded on its history, culture, inhabitants, and fauna. The penultimate planet visited during the class story, Voss features a unique storyline for each of eight classes, in addition to separate planetary story arcs for both Imperial and Republic factions, as well as a multitude of stanalone missions. Additional content on Voss was later added related to the Bounty Contract Week event, the Gree event, the Macrobinoculars and the Seeker Droid missions. Voss was revisited in the Knights of the Fallen Empire and Knights of the Eternal Throne expansions, the latter of which begins with a chapter set entirely on Voss during an attack by the Eternal Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}