{"url": "Vram_(Pyke)", "categories": ["Category:Canon articles", "Category:Males", "Category:Pykes"], "nodes": [{"tag": "h1", "text": "Vram  (Pyke)"}, {"tag": "p", "text": "Vram was the son of Marg and Tezzka Krim, the former of whom served as a leader within the Pyke Syndicate during the Clone Wars. Vram was also the older brother of Laalee. When his father Krim refused to merge the Pyke Syndicate with the larger Black Sun crime syndicate, Black Sun retaliated by kidnapping Vram, his mother, and sister. The Krim family was imprisoned at the Black Sun fortress on Mustafar in an attempt to force Marg to comply with their demands. Vram and his family were rescued by the Force-sensitive bounty hunters Asajj Ventress and Quinlan Vos, who reunited them with their father."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vram was a Pyke who lived on the planet Oba Diah during the Clone Wars. His father was the crime lord Marg Krim while his mother was named Tezzka Krim. Vram also had a younger sister named Laalee. In the second year of the Clone Wars, his father Marg became the leader of the Pyke Syndicate, a crime family that specialized in the distribution of illicit spices throughout the galaxy. When Marg rejected an offer by the rival Black Sun crime syndicate to merge their two groups, the Black Sun's leader Ziton Moj ordered the kidnapping of Vram, Laalee, and their mother Tezzka in an effort to force Marg to reconsider his decision."}, {"tag": "p", "text": "Vram and his family were imprisoned in the \"house\" at the top of a tower that dominated the Black Sun fortress on the volcanic world of Mustafar. During their imprisonment, Vram and his sister watched their mother being forcibly taken away by Ziton's Falleen guards. His father was greatly distressed by the loss of his family and unable to trust his men to rescue them, hired the Force-sensitive bounty hunters Asajj Ventress and Quinlan Vos to do the work. After learning the location of where Vram and his family were being housed, the two hunters infiltrated the fortress through an overhanging balcony."}, {"tag": "p", "text": "Vram and Laalee were peering through the window of their room when they saw the rescuers climbing over the balcony. While Ventress disabled the window's controls, Vos slipped through the now-open window and told the children that they were here to rescue them. He also told them to trust them and to keep as quiet as possible. The Force-sensitive Vos, an undercover Jedi, also managed to use his Force abilities to calm the children. While his sister cried, Vram told Vos that the Black Sun guards had taken away their mother."}, {"tag": "p", "text": "Shortly later, an alarm was raised and Black Sun sentries began making their way into the tower. Deciding that it was too risky to expose the children by fighting the guards, Ventress and Vos decided to use their Force powers to carry the children on their backs and leap down the battlements and boulders so that they could reach their lava flea steeds, which were parked nearby. While Laalee and Ventress managed to reach their lava flea safely, Vos, who was carrying Vram, was hit in the back by a blaster bolt. Vram lost his grip and descended towards a lava flow. However, Vos saved the boy from death by using the Force to levitate him to safety."}, {"tag": "p", "text": "Vram was unhurt but frightened by the near-mishap. He and his sister Laalee were taken to Vos' ship, the Banshee. While Ventress tended to Vos' wounds, Vram and Laalee listened to music in a corner of the hold. Later, Vos was able to use his psychometric abilities to examine Laalee's locket and find the location of their mother Tezzka. After securing Vram and Laalee to containment chairs, the two hunters proceeded with their mission to rescue Tezzka. Following a brief skirmish with Ziton and his men, Ventress and Vos managed to rescue Tezzka and flee Mustafar."}, {"tag": "p", "text": "Once aboard, Vram and Laalee were elated to be reunited with their mother, who hugged them tightly. Ventress and Vos then brought the Krims back to Oba Diah and reunited them with Marg. During the journey, Vos managed to develop a friendly rapport with Vram and his sister. Their father was so overjoyed by the safe return of his family that he gave Ventress and Vos twice the amount of money he had initially offered. Before leaving, Vram and Laalee unsuccessfully begged Vos to stay with them. Before leaving, Vos hugged them. The Krim family's respite was however short-lived because the Black Sun decided to send a fleet to Oba Diah to \"teach Marj Krim a lesson\"."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vram was a young child who was frightened by the kidnapping of his family at the hands of the Black Sun crime syndicate. He appeared to get on well with his younger sister Laalee and their parents Tezzka and Marg. As the older of the two children, Vram was the more talkative. Hem and Laalee befriended Quinlan Vos, the most approachable of their two rescuers. Vram and his sister were small enough to piggyback on Ventress and Vos' backs. He once experienced a near-death encounter when he almost fell into a lava flow during his rescue attempt on Mustafar but was saved by Vos, who used the Force to levitate him to safety."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vram and his family first debuted as a minor characters in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}