{"url": "Vul_Tazaene", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Kiffar", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vul Tazaene"}, {"tag": "p", "text": "Vul Tazaene was a male Kiffar security officer from the planet Kiffex. By 4 ABY, he was looking for a pair of identical twin con artists called the Tonnika sisters. He had also fallen in love with one of them, though he was not sure if it was Brea or Senni Tonnika. That year, Tazaene was present in the crime lord Jabba the Hutt's palace on the planet Tatooine when Jedi Luke Skywalker arrived in an attempt to rescue his friend Han Solo. Tazaene also accompanied the Hutt to his luxury sail barge, the Khetanna, when Skywalker and Solo were taken to be executed at the Great Pit of Carkoon. The captives fought back, however, and the sail barge was ultimately destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Kiffar male, Vul Tazaene hailed from the planet Kiffex during the Galactic Civil War. By the year 4 ABY, he worked as a security officer, and was searching for the Tonnika sisters, a pair of identical twin con artists. Tazaene also fell in love with one of them, although he was not sure whether it was Brea or Senni Tonnika."}, {"tag": "p", "text": "In 4 ABY, Tazaene was present in the palace of crime lord Jabba the Hutt on the planet Tatooine when Jedi Luke Skywalker arrived with the intent of rescuing his friend, Han Solo, who was held prisoner in the palace's dungeons. Tazaene was among the individuals present in the palace's courtroom when Skywalker attempted to negotiate Solo's freedom with the Hutt, during which Jabba dropped the Jedi into the palace's rancor pit. Tazaene and the others in the courtroom watched as Skywalker battled Jabba's rancor, during which the Jedi unexpectedly killed the creature. Following Skywalker's victory, Jabba sentenced him, Solo, and their companion Chewbacca to be executed at the Great Pit of Carkoon."}, {"tag": "p", "text": "Tazaene and other court members accompanied the Hutt on his luxury sail barge, the Khetanna, in order to witness the execution of Skywalker and his friends. However, the captives fought back against the Hutt's gang members, leading to the destruction of the sail barge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although he fell in love with one of the Tonnika sisters, Vul Tazaene was not sure which one. He was fair-skinned with no hair and had facial tattoos. During his time at Jabba's Palace in 4 ABY, Tazaene wore a black outfit with armor covering his shoulder. He laughed in delight during Luke Skywalker's battle with Jabba's rancor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vul Tazaene first appeared in 1983's Star Wars: Episode VI Return of the Jedi, in which he was portrayed by an uncredited extra. He was later given a name and brief backstory on a card in April 1998's Jabba's Palace Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}