{"url": "Vua_Rapuung", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Domain Rapuung", "Category:Males", "Category:Shamed Ones", "Category:Yuuzhan Vong warriors"], "nodes": [{"tag": "h1", "text": "Vua Rapuung"}, {"tag": "p", "text": "Vua Rapuung was a Yuuzhan Vong warrior who, in 26 ABY, attained legendary status among the Shamed Ones, the shunned underclass of his species. Once a commander well-known for his prowess and skill as a fighter, Rapuung lost both his rank and his status as a warrior following the end of an illicit affair with Master Shaper Mezhan Kwaad. To prevent Rapuung from revealing her heretical nature to others, Kwaad used her shaping arts to corrupt the warrior's ritual scarring and escalation implants; the commander was given the appearance of a Shamed One. Outcast from his caste and domain and his claims about the master shaper met with disbelief, Rapuung was forced to carry out menial duties on Yavin 4, the moon on which both he and Kwaad were assigned during the second year of the Yuuzhan Vong War. In the face of this ignominious fate, the former commander continued to trust adamantly in his redemption, as well as the specter of the heretic master shaper's own humiliation and disgrace."}, {"tag": "p", "text": "In order to effect these purposes, Rapuung followed what he perceived to be the will of Yun-Yuuzhan and allied himself with Anakin Solo, the young Jedi Knight whose friend Tahiri Veila had been captured by Kwaad. Fighting alongside the Jedi, Rapuung was eventually able to expose Kwaad, thus regaining his status and honor. However, the warrior's respect for Solo was such that Rapuung gave his life protecting Solo and Veila as they escaped Yavin 4. These unique actions had a profound effect on the Shamed Ones who witnessed the warrior's sacrifice, and the legend of Vua Rapuung provided the basis for the Jeedai heresy, the movement which ultimately helped topple the Yuuzhan Vong Empire during the Battle of Yuuzhan'tar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Life as a warrior"}, {"tag": "p", "text": "Born into Domain Rapuung, and named in honor of Vua'sa, the bestial first warmaster of the Yuuzhan Vong, Vua Rapuung demonstrated his potential and was considered a gifted and highly-skilled warrior. He was well-acquainted with Yuuzhan Vong military tactics, and was a capable opponent, even when unarmed. Those who fought alongside him, such as Tolok Naap and Rapuung's domain brother Hul, knew to respect the abilities and physical power of the warrior. Eventually, Vua Rapuung's qualities resulted in his escalation to the rank of commander."}, {"tag": "h3", "text": "The consequences of love"}, {"tag": "p", "text": "His fortune as a warrior and an officer of the Yuuzhan Vong, however, came to an abrupt end as he begun a clandestine love affair with a master shaper, Mezhan Kwaad, around the time of the Yuuzhan Vong invasion of the galaxy in 25 ABY. Unions between separate castes were taboo for the Yuuzhan Vong, and after a time Rapuung came to his senses, comprehending his blasphemy and the disrespect his love for Kwaad showed to Yun-Yuuzhan. The warrior broke off the affair, claiming to Kwaad that he could not anger the gods. Mezhan Kwaad, however, was a heretic, and she rounded on her partner, telling him that the existence of the gods was a lie. Although a shocked Rapuung tried to assure her that he would never divulge the secret of her heresy, Kwaad was paranoid. In fear of being discovered, she used her skill at shaping to cause Rapuung's many escalation implants and other scarrings to fail. The warrior was forced to watch as his own body began to rot, and as his ailments became obvious, he was outcast by his fellows, and was soon relegated to the lowest of all Yuuzhan Vong castes, that of the Shamed Ones. Vua Rapuung knew what his lover had done, but his dubious claims and ranting prejudiced many against him. Even the other Shamed Ones, for whom he had no respect, saw Rapuung as a madman."}, {"tag": "p", "text": "On Yavin 4, where the headquarters of the New Jedi Order had been overrun by the Yuuzhan Vong, Rapuung performed work suitable for a Shamed One. Answering to an executor, the former commander trawled the Unnh River for fish on a vangaak. Mezhan Kwaad, whom he occasionally remembered with something less than hatred, lived and worked only a short distance away from Rapuung, in one of the damuteks planted on the moon. Warriors like Tolok Naap, and Rapuung's own crèche brother Hul, whom he had fought alongside only a short time earlier, ostracized the former commander, and although they still respected his abilities, the warriors treated him as what he appeared to be—a Shamed One, unloved by the gods. This frustration and exile deeply affected Rapuung, and as he spent his days toiling, he began to have dreams. Sent to him as he saw it by the god Yun-Yuuzhan, these visions told the warrior of a young Jedi apprentice on a mysterious quest. Rapuung knew little of what was occurring on Yavin 4, or of the captured Jedi Tahiri Veila undergoing shaping at the hands of Kwaad, but he was able to observe the search parties heading out into the forests to flush out a hidden threat. Trusting in Yun-Yuuzhan's perceived guidance that this approaching Jedi was the only way of returning to former glory, Rapuung faked his own death on the river and set off to find the \"infidel\" whom he believed could be the answer to his torment."}, {"tag": "h3", "text": "Aiding Solo"}, {"tag": "p", "text": "Vua Rapuung made his way to a small cave behind a waterfall and set up camp there, storing his meager possessions and supplies in its dark recesses. The warrior had no weapons; he had forsaken the use of an amphistaff until he had reclaimed his lost honor. Using his skills as a tracker, diminished somewhat by his failing ears, Rapuung was able to find the Jedi, Anakin Solo, who was making his way to the shaper damuteks. Shadowing Solo as the Jedi continued on a straight-line course towards the ruins of the Great Temple, Vua Rapuung killed several of the warriors who were in pursuit of the Jedi, allowing the unknowing Solo to evade capture numerous times. Eventually, however, Solo was caught, exhausted, by Field Commander Sinan Mat—only the summoning of piranha beetles by means of the Force saved the Jedi, though he was again caught by a separate search party soon after. At this moment, Rapuung intervened, confronting the two Yuuzhan Vong warriors threatening Solo and dispatching them with ease. Taking a tizowyrm translation device from one of the slain, Rapuung told Solo he would help him, and took the confused Jedi to his cave, where he grudgingly patched up his new ally's wounds. The lack of the young Jedi's lightsaber—the weapon had been damaged during Solo's earlier encounter with a tsik vai scout craft—posed a slight problem for Rapuung, but the warrior was reassured that Anakin would aid him on his quest, with or without a weapon."}, {"tag": "p", "text": "Such close proximity with an \"infidel\" birthed a mixture of resentment, disgust and resignation in Vua Rapuung; he and Solo quickly came to blows when the Jedi inadvertently insulted the irascible former commander. Rapuung did not inform the Jedi of his own quest to expose Kwaad's treachery and restore his honor, and claimed that he did not care for Anakin Solo's respective goal—to rescue Tahiri Veila from Kwaad's shaping process. In the face of their many differences, the two reached an accord, as they both needed each other; Rapuung managed to restrain his anger when his ally once again insulted the Yuuzhan Vong, wary as he was of Solo's skill with the Force, and together they set off to face the hundreds of warriors on the moon. Immediately, Rapuung clashed with Solo over the direction they should take; with tsik vai patrolling the forests in their hunt for the Jedi, the Yuuzhan Vong warrior felt he knew best, but the Jedi was keen to find a vantage point from which they could plan their approach. Once they had found a ridge and looked out over the distant damuteks, Rapuung tried to persuade Solo that he was able to get them inside the compound by means of the Unnh River, as he knew that areas of the forest were trapped. However, the two were interrupted soon after they set off by the arrival of a tsik vai, and although the Jedi incapacitated the flier with a whirlwind of debris and foliage whipped up by the Force, Rapuung realized that the alarm had been raised. Already the other tsik vai began to weave lav peq nets between the trees; when his companion used phosphorous flares to burn the forest and thus evade the web, Vua Rapuung's rage at the use of machines to create fire clouded his vision and he attacked the young Jedi. The two fought quickly, and only when Anakin used the Force to club Rapuung with a rock did the Yuuzhan Vong stop, still disgusted by his consorting with such violation and how the gods whose favor he sought to regain would see his actions. Once he reminded himself that his argument was with Kwaad, Rapuung and Solo set off, evading the flames. The inferno was swift, however, and overcome by the smoke the two eventually collapsed. While saving his own life, Solo ensured that Rapuung survived—the Yuuzhan Vong warrior recognized his debt to the young Jedi, as unfortunate as he believed it to be."}, {"tag": "p", "text": "Having escaped both the tsik vai and the flames, Vua Rapuung led Anakin to the Unnh River, where he had trawled for fish not six days prior. On the way, the two unlikely allies discussed the Force, life, death and the rot which inflicted Rapuung; they disagreed on most, and, at Rapuung's often forceful requests, they did not dwell upon such subjects as the warrior's appearance. Waiting by the river's edge, Rapuung saw Qe'u, the Shamed One who had taken over his angling duties, and called the other Yuuzhan Vong over, before swiftly snapping his neck. Taking command of the vangaak Qe'u had been riding, Rapuung bade Solo enter the aquatic beast's stomach while they followed the river up to the damuteks, but not before both he and the Jedi argued over the value of life. Rapuung piloted the vangaak back towards the damuteks with Solo hidden in its belly, before eventually reaching the compound. There, Rapuung affixed Solo with a false yorik coral implant, so as to explain the young Jedi's presence as that of a slave whom he had found wandering in the wilderness."}, {"tag": "h3", "text": "Return"}, {"tag": "p", "text": "With Solo disguised as a slave and the broken lightsaber hilt hidden in a damutek's succession pool, Rapuung led his charge through the compound. As they walked past the other Shamed Ones, warriors, and workers, Vua Rapuung was spotted by his brother, Hul, and the two shared an uneasy conversation; Hul Rapuung, respectful yet pitying of his brother's status, offered to help Vua, but was rebuffed. Once Vua and Anakin were alone again, Rapuung finally told the other of his plight and desire for revenge against Mezhan Kwaad, before taking the Jedi to the executor for assignment to the lambent fields. Rapuung then left to scout out the damuteks, while carrying out the menial tasks to which he had become accustomed. The intendants who administered the base on Yavin 4, however, had long since grown wary of Rapuung's constant ranting and assertions of Kwaad's treachery; several days after his return, an attempt was made on the warrior's life, late at night. He killed his attackers and searched the damuteks, eventually finding Solo by the succession pool; Rapuung believed that they had to act immediately."}, {"tag": "p", "text": "Solo, however, had retrieved his lightsaber and wished to repair it using a lambent crystal, and as the weapon was crucial to the Yuuzhan Vong warrior's plans, he agreed that they could hide in the underground caverns beneath the ruins of the Great Temple while the Jedi rebuilt his lightsaber. Rapuung secured gnulliths and both he and Anakin made their way down the damutek roots, eventually discovering the caverns. There, they remained for two days. During the time he spent with the Jedi below the planet's surface, Rapuung once again argued with his companion over the Force and the nature of the Yuuzhan Vong—he believed that the Jedi, however despite how they purported themselves to be peaceful, were warriors as much as he was. Unknown to them, however, Mezhan Kwaad's experiments with Tahiri had become immersed in heresy, and the base commander, Tsaak Vootuh, discovered the master shaper's forbidden actions. Kwaad was arrested, to be taken with her adept Nen Yim and Veila to Warmaster Tsavong Lah for punishment. Once Solo rebuilt his lightsaber, both he and Rapuung crawled back through the damutek roots to the surface for a final showdown with their foe."}, {"tag": "h3", "text": "In pursuit of honor"}, {"tag": "p", "text": "Making use of Anakin Solo's Force-sensitivity to locate Veila, who Rapuung knew would be accompanied by Mezhan Kwaad, the Jedi and the Yuuzhan Vong warrior entered the shaper damutek. They were noticed instantly by a group of shapers, and an attempt was made to poison the two with a toxic gas as they raced through the corridors. Solo cut through the damutek's inner walls into a laboratory, where Rapuung intimidated a shaper into leading them to Kwaad's personal chambers. The unexpected presence of Tsaak Vootuh's personal guards surprised Rapuung, but he was a deadly foe even without an amphistaff. Alongside Solo, he quickly dispatched Vootuh's warriors, saving Anakin's life in the process. It was not long before they arrived at Kwaad's private shaping chambers; however, Vootuh was already leading the heretic master shaper away to his personal craft. Forestalled in their pursuit by the arrival of a group of warriors and Rapuung's old companion, Tolok Naap, the former commander was forced to confront his fellows. The warriors were shocked by Rapuung's alliance with a Jedi and they presumed him to be insane. Still, in respect to the rank Rapuung had once held, Naap offered his old comrade an amphistaff. Rapuung declined, and fought the six warriors unarmed, killing all of them in little over a minute. He and Anakin raced after Vootuh; Rapuung made Solo swear that he would have the Jedi's protection as he confronted his former lover and regained his lost honor."}, {"tag": "p", "text": "Both he and Solo climbed to the roof of the compound and quickly mapped out their route; when they saw that Commander Vootuh was about to board his personal vessel and return to the Yuuzhan Vong fleet, they moved swiftly through the shadows, emerging in a central space with parked yorik-et starfighters and other craft all around. The workers, Shamed Ones, and intendants who were tending to the vehicles failed to notice the Jedi and his Yuuzhan Vong ally racing towards Vootuh's vessel, but at the last moment the commander's personal guards spotted them, hurling a swarm of nang hul at the approaching duo. Rapuung was hit, but he and Anakin killed the trio of warriors and carried on, only to be overcome by another volley of the creatures. Vua Rapuung took one of the nang hul in the torso, which opened a serious wound in his abdomen, while Anakin was hit in the thigh. At that moment Commander Vootuh emerged from the shuttle's interior with Kwaad, Nen Yim, and Veila. In spite of his wounds, Rapuung managed to return to his feet and remind Solo of their oath together; remembering his pledge, Solo bade the commander force Kwaad to answer the questions of the wounded warrior. In the face of Vootuh's skepticism and Kwaad's refusal, Solo was without support. It was Hul Rapuung, watching with a crowd of Yuuzhan Vong at the base of the shuttle's ramp, who shouted that the master shaper should respond, if she had nothing to fear. Before the assembled masses, Commander Vootuh forced Kwaad to answer Rapuung's questions. Finally faced with the opportunity for redemption, the wounded warrior demanded to know if Mezhan Kwaad had deliberately given him the appearance of a Shamed One."}, {"tag": "h3", "text": "Redemption and death"}, {"tag": "p", "text": "Mezhan Kwaad admitted her actions, and denied the existence of the gods, promoting an uproar in the crowd. Before Vootuh, his three warriors, or Vua Rapuung could react, the master shaper's eight digits on her shaper hand extended into sharp points, lethally impaling the commander and his guards. Rapuung she speared through the thigh, and Solo's weapon arm was similarly wounded. As Kwaad attempted to make good her escape, ordering Nen Yim to drag Rapuung and Solo onto the shuttle, Tahiri Veila used the Force to lift Solo's lightsaber from the ground, and decapitated the master shaper. As the warriors at the base of the ramp closed in, Hul Rapuung called out to Solo, declaring that he would attain honor by dueling and killing Anakin."}, {"tag": "p", "text": "His status restored by Kwaad, his goals achieved, the mortally wounded Rapuung nevertheless rose to his feet and took up an amphistaff. Ignoring both Solo and Hul Rapuung as they told him to end his struggle, the redeemed warrior shouted his support for Anakin and the Jedi, leaping into the midst of the Yuuzhan Vong. With a swift blow he knocked his brother unconscious, sparing Hul's life. To grant Anakin enough time to escape on the shuttle, Vua Rapuung went on to slaughter many of the warriors facing him; the number of Yuuzhan Vong who fell to his blade soon caused his feet to be trapped by the corpses which piled up around him. With his footwork slowed, an amphistaff to the neck put an end to the warrior's rampage. As he died, Vua Rapuung was still able to crush the skull of the Yuuzhan Vong who had wounded him. With that, he fell—his sacrifice, however, had bought Anakin and Tahiri enough time to escape."}, {"tag": "h3", "text": "The pantheon of the Shamed"}, {"tag": "p", "text": "Vua Rapuung's redemption and final moments were observed not only by the assembled crowd of warriors, but Shamed Ones and other lower caste members who watched from the edge of the compound. In the days following the battle, after Jedi-aligned forces destroyed the damuteks and liberated the slaves, the Shamed Ones talked eagerly of the Jedi's role in restoring the honor of Vua Rapuung. A vague theory had been circulating among the Shamed Ones since the Jedi Knight Wurth Skidder had resisted breaking at the hands of a yammosk, and there were indeed those who believed that the Jedi were the salvation of the Shamed. Vua Rapuung and Anakin Solo served to provide a basis for this movement, which was to eventually become the Jeedai heresy. When Warmaster Tsavong Lah arrived on Yavin 4, however, he ordered that all who espoused this new heresy should be killed. Despite this, the story of Vua Rapuung escaped this purge. Several months later, it had circulated among the Shamed Ones as the legend of Vua Rapuung, which proved that the Jedi could restore the status of the lowliest Yuuzhan Vong caste."}, {"tag": "p", "text": "Two years later, the story had become convoluted, and often inaccurate. In some versions, Vua Rapuung died at Kwaad's hands immediately after he was redeemed, and it was Hul Rapuung and several others who defended Anakin and Tahiri as they escaped. Many among the warrior caste dismissed the story of Vua Rapuung as a lie. The essential message of the story remained the same, however, and when the disparate groups of heretics were united under a prophet, Yu'shaa—who was in fact the disgraced Yuuzhan Vong executor Nom Anor—the legend of Vua Rapuung became one of the heresy's central tenets, as it gave conclusive evidence that in the Jedi lay redemption. During the final battle of the Yuuzhan Vong War, the Jeedai heresy proved crucial in toppling Supreme Overlord Shimrra and the Yuuzhan Vong Empire. True to the legend of Vua Rapuung, the Shamed Ones were vindicated, and renamed the Extolled."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vua Rapuung was a passionate believer in the gods of the Yuuzhan Vong; he trusted in his dreams that Yun-Yuuzhan ordered him to fight alongside a Jedi. Religious conviction sustained him and he often repeated his faith in redemption as a mantra—his strong sense of belief ultimately overrode his natural dislike of Solo and hatred of technology. This did not allow Rapuung, however, to understand his ally; the frequent conflicts which erupted between the unlikely partners stemmed from misunderstandings and inadvertent rudeness. The warrior's innate pride and stubbornness were often the reasons behind his arguments with Solo, but he later was able to relent on occasion and put his trust in the young Jedi."}, {"tag": "p", "text": "Rapuung possessed a savage and ironic sense of humor. The warrior was often highly sardonic, even satirical during his quest for redemption. He was also able to challenge Solo's views on the Force and the Yuuzhan Vong, as his pragmatism and cryptic morality provided firm arguments against which the Jedi could not contend. Rapuung was, however, very secretive, refusing to speak of Mezhan Kwaad or his status until the final day of his journey with Solo. Notably, the warrior showed signs of pity, if not residual affection for Kwaad, and although he wished to see her humiliated and debased, she was not intended to be subjected to any physical vengeance."}, {"tag": "p", "text": "This somewhat peculiar combination of characteristics, further stressed during Vua Rapuung's swift loss of status, left many believing him to be insane. An intensity in Rapuung's actions, as well as the frequent abruptness with which he enacted them, caused Solo to consider the notion of the warrior's madness. Ultimately, however, the Jedi came to believe that the conflict within the former Yuuzhan Vong commander had resulted not in a loss of sanity but in a contrast of beliefs and deeds. Indeed, Vua Rapuung purported to have no interest or care for Anakin Solo and his quest, and yet finally sacrificed himself for the Jedi, albeit while on the brink of death. Of the characteristics which survived Rapuung's unnatural disgrace unscathed, passionate conviction and a steadfast loyalty remained the most apparent; loyalty to the gods, to his oaths, to his brother, and ultimately to the Jedi whom he fought alongside."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Even after swearing an oath not to wield an amphistaff until his honor had been restored, Vua Rapuung was a deadly foe. He had immense physical strength, at one point spearing a warrior through the eyes with his fingers and lifting the dead warrior into the air by the sockets, and on another occasion hurling a shaper across a room with a single punch. Unarmed and unarmored, he killed Tolok Naap and five other warriors in eighty seconds; with an amphistaff, he was able to hold off an entire crowd of Yuuzhan Vong. Vua Rapuung also possessed a formidable constitution, which contributed towards his ability to fight even once he had sustained crippling wounds. Although Rapuung's hearing and implants suffered following Mezhan Kwaad's actions, this did not overly hinder his prowess as a warrior."}, {"tag": "p", "text": "Vua Rapuung was well-versed in tactics and subterfuge, and while his desire for revenge often clouded his judgment, he was able to move stealthily and without a sound, even through the thick foliage and underbrush of Yavin 4. Demonstrating his fitness, Rapuung managed to keep pace with Anakin Solo as the Jedi moved with Force-assisted jumps; however, he often succumbed to fits of coughing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vua Rapuung was introduced in Greg Keyes' novel The New Jedi Order: Edge of Victory I: Conquest, which deals with the destruction of the Jedi Praxeum on Yavin 4 and Anakin Solo's quest to save his friend Tahiri Veila. As the novel delved deep into the belief systems and culture of the Yuuzhan Vong, Keyes felt he had a lot of creative freedom to explore the species and this was reflected in his creation of Rapuung, who acts as a foil for Solo throughout the novel, and is the means by which Solo's interpretation of the Yuuzhan Vong and the Force gradually evolves. By the end of Edge of Victory I: Conquest, Rapuung's and Solo's antagonistic partnership has developed into mutual respect, and Rapuung spends his last moments saving the Jedi. In Keyes' second New Jedi Order novel, The New Jedi Order: Edge of Victory II: Rebirth, the impact of Rapuung's actions for the Shamed Ones is explored. In both The New Jedi Order: Force Heretic I: Remnant and The New Jedi Order: Force Heretic II: Refugee, the warrior is shown to have entered into the epic cycle of the Jeedai heresy, the movement which served to turn the tide of the war in favor of the Galactic Alliance. Therefore, although he only appears in Edge of Victory I: Conquest, Rapuung nevertheless plays an important role in the metaplot of the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}