{"url": "Vult_Skerris", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:7th Fleet personnel", "Category:Aces", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males", "Category:Members of Defender Squadron One"], "nodes": [{"tag": "h1", "text": "Vult Skerris"}, {"tag": "p", "text": "Vult Skerris was a human male pilot who served as a captain in the Galactic Empire's naval forces during the Imperial Era. As an Imperial pilot, he flew a TIE/IN interceptor with red markings, and wore a TIE pilot flight suit with yellow stripes on the helmet and arms. Skerris was stationed at the elite Skystrike Academy, where he trained TIE pilot cadets as a flight instructor. In 2 BBY, he engaged Rebel Alliance forces near the planet Teralov and destroyed a transport delivering supplies to civilians and its escorts."}, {"tag": "p", "text": "In that year, Skerris dealt with cadets at Skystrike attempting to defect to the Alliance, led by the rebel Sabine Wren, but ultimately failed to prevent their escape. Sometime later, Skerris was placed in Grand Admiral Thrawn's Seventh Fleet and was personally chosen by the Grand Admiral to fly a prototype TIE/d \"Defender\" Multi-Role Starfighter to pursue the rogue Senator Mon Mothma into the Archeon Nebula. During the pursuit, Skerris shot down multiple Y-wings escorting Mothma, who was aboard the Ghost. The rebels escaped after Skerris' starfighter was struck by an ion cannon, causing it to drift into the nebula aimlessly."}, {"tag": "p", "text": "After recovering, Skerris was placed as the commander of Defender Squadron One, and led the unit in engaging Grysk Hegemony forces while Thrawn and the Sith Lord Darth Vader completed their mission on Batuu and later Mokivj. The pilot was later selected to fly a new prototype fighter, the TIE/D Defender Elite, by Thrawn on Lothal. However, Skerris did not get a chance to demonstrate its capabilities to the Grand Admiral when the ship was stolen by Wren and Ezra Bridger. Subsequently, Thrawn allowed the rebels to demonstrate its prowess and later authorized its destruction after he was satisfied with the results."}, {"tag": "p", "text": "Around 0 BBY, Skerris participated in defending the Imperial blockade in the Lothal system against a Rebel Alliance squadron, led by General Hera Syndulla. He ultimately died when Syndulla lured him into a trap that involved disabling his Defender's shields to let her shoot him down, sending him crashing into an Arquitens-class command cruiser, which in turn fell into an Imperial I-class Star Destroyer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Skystrike Academy"}, {"tag": "h4", "text": "Instructing cadets"}, {"tag": "p", "text": "Captain Vult Skerris of the Imperial Navy was an ace TIE fighter pilot who flew a TIE interceptor for the Galactic Empire during the Imperial Era, and served as a flight instructor at the elite Skystrike Academy on the planet Montross. He was among a number of aces promoted with the right to customize their flight suit and TIE fighter with yellow stripes and red markings, respectively. In 2 BBY, Skerris and two other TIE Interceptors took part in an attack on a rebel convoy heading to the planet Teralov to deliver supplies to civilians. Launching from an Arquitens-class command cruiser, Skerris and his fellow pilots wiped out the escort A-wings before strafing the rebel transport. The rebel captain pleaded for mercy and stressed that they were unarmed. However, Skerris was unmoved and fired a final salvo, which hit the transport's command bridge and destroyed the vessel."}, {"tag": "p", "text": "Following the attack on the transport, he took part in a simulated combat exercise at Skystrike. The exercise involved him and two cadets, Wedge Antilles and \"Ria Talla,\" flying in simulator pods while under the supervision of Instructor Goran. During the exercise, Skerris operated a simulated copy of the VCX-100 light freighter Ghost, which destroyed Antilles and Talla's simulated TIE fighters. In the debriefing following the exercise, Talla asked about the Ghost's model, to which Skerris responded that it was a transport that was modified for combat while exiting his simulator pod."}, {"tag": "p", "text": "Skerris then explained that the rebels who operated the Ghost were extremists who would use any means necessary to fight the Empire, and lectured Antilles and Talla on the merits of obeying orders. He then addressed the two cadets and made sure that they understood his orders. Unbeknownst to Skerris and rest of the academy's personnel, Talla was secretly an undercover rebel agent named Sabine Wren, a crew member of the Ghost. Wren was on a mission to extract Antilles and two other defectors, \"Hobbie\" and Rake Gahree, from the academy, motivated to abandon the Empire after learning about Skerris' attack on the rebel transport."}, {"tag": "h4", "text": "Dealing with defectors"}, {"tag": "p", "text": "During a spaceflight exercise, Skerris and two other TIE Interceptors accompanied several cadets as they participated in a mock dogfight. Wren, Antilles, Hobbie, and Gahree, who were among the cadets, attempted to escape in their TIE fighters. When the CR90 corvette Liberator arrived in Montross' orbit, Wren and the three cadets headed towards the corvette in order to board it and depart the area. In response, Governor Arihnda Pryce, who had arrived at the academy to uncover the defectors, activated the fighters' kill switches, detaching the solar collector panels and leaving them stranded in space. Under Pryce's orders, Skerris fired on one of the cadets' TIE fighters, and killed Gahree. The three Interceptors then proceeded to damage the Liberator, forcing the ship to flee into hyperspace and allowing the three remaining defectors to be captured."}, {"tag": "p", "text": "After Wren, Antilles, and Klivian escaped the academy in a stolen TIE bomber, Skerris pursued the fugitives in his TIE Interceptor. While flying through Montross' atmosphere, Skerris inflicted damage on the TIE bomber and caused it to lose altitude. However, the Liberator returned and forced Skerris to break off his pursuit. When the bomber attached itself to the corvette and left the atmosphere, Skerris continued tailing the vessel until it escaped into hyperspace with the defectors."}, {"tag": "p", "text": "Following the event, Skerris returned to the academy. Pryce later berated Goran, who requested that he be given a chance to confront the cadets who escaped and persuade them to return to the Empire. When Pryce pointed out that three of the academy's best students had left to join the Rebel Alliance, Skerris corrected the Governor, stating that he had killed one of the defectors, Gahree."}, {"tag": "h3", "text": "Hunting the rebellion"}, {"tag": "p", "text": "Sometime later, Skerris was inducted into the Seventh Fleet. He was chosen by Seventh Fleet Grand Admiral Thrawn to fly an experimental TIE/d \"Defender\" Multi-Role Starfighter that was equipped with a deflector shield and a hyperdrive, into the Archeon pass with two TIE Interceptors. Accompanied by an Arquitens-class command cruiser, they pursued a rebel convoy that was carrying the former Senator Mon Mothma, who was deemed as a traitor by the Empire. After catching up with the Ghost and its Y-wing fighter escorts, Skerris issued an ultimatum that they surrender Mothma. The rebels refused and instead sent the Y-wings Gold Three and Gold Four to engage the TIE, but Skerris quickly shot them down."}, {"tag": "p", "text": "Skerris then followed the Ghost, carrying Mothma, and its remaining escorts through the nebula, where he gained a lock on the starship. However, the Y-wing pilot Gold Five sacrificed herself to protect the ship by flying her Y-wing into his crosshairs. The rebels then diverted all power to their shields and flew close to a forming star. The TIE Interceptors were swiftly destroyed by the star's radiation due to their lack of shielding, leaving Skerris as the sole pursuer. Skerris broke off after the radiation damaged his fighter's deflector shields."}, {"tag": "p", "text": "After recovering, Skerris resumed engaging the Jedi Padawan Ezra Bridger and Gold Leader Jon Vander's Y-wings, and tailed Bridger's ship when it separated from Vander. However, he failed to destroy it and was hit with an ion blast from Vander's starfighter, as Bridger had intentionally baited Skerris in order get the Defender into the ion cannon's firing range. Disabled, Skerris' TIE Defender spun out of control further into the nebula. The Ghost, Bridger, and Vander exited the nebula and fled into hyperspace soon afterward, escaping two Star Destroyers that had attempted to capture them."}, {"tag": "h3", "text": "Mission to Batuu"}, {"tag": "h4", "text": "Engaging Grysk forces"}, {"tag": "p", "text": "Following the pursuit of Mothma and the Battle of Atollon, Skerris accompanied Thrawn and the Sith Lord Darth Vader aboard the Grand Admiral's Imperial I-class Star Destroyer, Chimaera. Skerris commanded Defender Squadron One during Thrawn's and Vader's journey to the Outer Rim planet Batuu. While in Batuu's orbit, Commodore Karyn Faro, who was placed in command of the Chimaera by Vader, deployed the First Legion's freighter, Darkhawk in order to capture an unidentified freighter, escorting by four smaller ships, belonging to the Grysk Hegemony, Commander Kimmund and the freighter's crew attempted to capture it under Vader's orders. Faro had also deployed Skerris and Defender Squadron One for assistance, unbeknownst to the Darkhawk's crew."}, {"tag": "p", "text": "Unable to jump to lightspeed in order to avoid detection, the Darkhawk drifted towards the vessel as the freighter had traveled deep within Batuu's gravity well. The Grysk vessel departed Batuu's orbit and attempted to flee after detecting the freighter. Piloting their TIE Defenders, Defender Squadron One then flew past the Darkhawk, and Skerris announced the unit's presence to Kimmund. The commander explained his crew's objective to capture the vessel intact, and asked if Skerris' unit could cripple and prevent it from escaping. The pilot obliged, and noted that Faro had also suggested the same action. When the Grysks fired upon the squadron, Defender Squadron One evaded their attacks and proceeded to damage the vessel. After Skerris and his squadron finished their attack run and created an opening in the ship's aft, the pilot asked Kimmund if the Darkhawk's crew required another entry point in the vessel for boarding. Instead, Kimmund requested that the squadron pursue the vessel's escorts, and Defender Squadron One obliged."}, {"tag": "p", "text": "Skerris then received new orders from Faro, which was to continue attacking the unidentified freighter and create an additional opening in the ship's forward starboard hatch. After breaking off from his squadron, he explained to Kimmund that the action would cause the Grysks to believe they would be boarded from there instead of the aft starboard. Hearing the pilot, Kimmund threatened to shoot the pilot down. However, Skerris reminded the commander that damaging his TIE Defender would anger Thrawn. When the Darkhawk's crew prepared to board the unidentified vessel, Skerris continued to hammer its forward hull. Thanks to Skerris' actions, Kimmund and his troopers successfully boarded the vessel, where they proceeded to engage the Grysk forces within, intending to seize the cargo they were in possession of."}, {"tag": "h4", "text": "Further engagements"}, {"tag": "p", "text": "When Kimmund's forces were unable to breach the area where the cargo was held, Skerris was contacted by the commander, who told him to attack the Grysk vessel's ventral cargo hatch. When the TIE pilot complied and prepared to carry out the task, he spotted a second ship making its way to the area where Thrawn and Vader had landed, and asked if he should give chase. On Kimmund's orders, Skerris destroyed the hatch and then broke off to pursue the other ship. Throughout the skirmish, Skerris and his squadron recorded images of the Grysk vessels."}, {"tag": "p", "text": "Following the engagement, Defender Squadron One returned to the Chimaera. Skerris collated the reports on the squadron's encounter with Grysks. He later participated in a meeting aboard the Star Destroyer with Thrawn, Vader, Faro, and Kimmund, where they discussed the Grysks' tactics. Skerris stated that his squadron believed the Grysk vessels were a fighter escort, but disregarded the notion after observing the vessels' lack of armaments. Vader asked the captain about the captured freighter's flight patterns, to which Skerris replied they were ordinary as the ships operated similar to small transports. The captain then asked what cargo the Grysk were carrying, and pointed out that the smaller ships began making their way to the freighter upon spotting his squadron."}, {"tag": "p", "text": "Sometime later, the Chimaera engaged Grysk forces in the Mokivj system, where they attempted to shift the position of the planet Mokivj's moons using their spacetugs. On Thrawn's orders, Defender Squadron One was deployed to disable one of the Grysk's escaping ships. However, the squadron was unable to intercept the ship in time, and Skerris reported it to Thrawn. The admiral then ordered the squadron to destroy the remaining ships, aided by the Chimaera's turbolasers. When the Chimaera managed to track down the escaped ship from before, Vader was placed in command of Defender Squadron One, much to the protest of Skerris. The squadron would go on to engage more Grysk forces with the Chimaera, and would emerge victorious."}, {"tag": "h3", "text": "Testing the TIE/D Defender Elite"}, {"tag": "p", "text": "Sometime after the mission to Batuu, Skerris was posted to Lothal, where the TIE Defenders were being produced. By that time, a new variant of the fighter was produced, the TIE/D Defender Elite, which possessed superior speed, weapons and shielding to the original. Skerris, who was given the honor of test-flying the new ship, brought the fighter to a remote airfield in the Outer Rim planet Lothal. After exiting the ship, he was greeted by Thrawn and Pryce, who had arrived aboard a Sentinel-class landing craft to witness a flight demonstration of the prototype performed by Skerris."}, {"tag": "p", "text": "While the pilot escorted them to the fighter, he was startled to spot Bridger battling Imperial troopers with his lightsaber, and expressed disbelief at the presence of a Jedi. Skerris was further surprised when the TIE Defender Elite, which was stolen by Wren in order to acquire its flight data recorder, lifted off and began blasting the surrounding area. Bridger then entered the fighter, which proceeded to lay waste to the depot and destroy most of the parked TIE fighters and Interceptors before strafing the landing strip where Skerris, Thrawn and Pryce all stood. Though Skerris attempted to persuade Thrawn to seek cover, the Chiss calmly faced the oncoming fighter down with his blaster and watched it streak over his head, narrowly missing the command tower."}, {"tag": "p", "text": "Skerris was then ordered by Thrawn, who saw the theft as an opportunity to test the prototype's combat prowess, to deploy three TIE Interceptors in pursuit. He then joined Thrawn and Pryce at the tower, observing the stolen Elite's progress. After two of the Interceptors were quickly destroyed, Skerris surmised it to be the work of the rebel captain Hera Syndulla. Thrawn dismissed the suggestion, stating that if Syndulla had been at the controls, all three fighters would have been eliminated much quicker, and concluded that Bridger was piloting the Elite. After the prototype's homing beacon was shut off, Thrawn deduced that Wren was the other rebel on board and had Pryce activate the ship's kill switch, causing the prototype to crash."}, {"tag": "h3", "text": "Dogfight above Lothal"}, {"tag": "p", "text": "Around 0 BBY, the Rebel Alliance deployed the Phoenix Squadron to launch an attack on Lothal, seeking to destroy the Imperial Armory Complex in the Capital City. Though severely outnumbered by the Imperial blockade in the Lothal system, the rebel fighters—led by Syndulla—destroyed many TIE fighters. Aboard the Chimaera, which was part of the blockade, Skerris was ordered by Thrawn to join the battle. The pilot exited the Star Destroyer aboard his personal TIE Defender Elite, and shoot down Phoenix Four and Phoenix Five in rapid succession before turning his attention towards Syndulla's X-wing. While pursuing Syndulla, she formulated a plan and headed straight for the Chimaera. When Skerris was in the Star Destroyer's line of fire, Thrawn ordered him to break off pursuit, but Skerris refused, citing that he almost had Syndulla in his sights."}, {"tag": "p", "text": "Mildly annoyed, Thrawn nonetheless ordered his gunners to open fire, hitting both Skerris and Syndulla. Though the Elite's shields withstood the barrage, they were disabled as a result, leaving his ship vulnerable along with Syndulla's. She then fired on the Chimaera's scanning array, damaging it and creating a cloud of smoke before flying through the narrow gap. Due to the Elite's larger profile, Skerris flew around the structure, and realized too late that he had played right into her hands as she fired on his unshielded ship, blowing off two of its wings. Helpless, Skerris screamed as his disabled fighter spun out of control and crashed into an Arquitens-class command cruiser, killing him instantly. The disabled cruiser then crashed into a nearby Star Destroyer, shearing off its command bridge. The event allowed the remaining rebel pilots to break through the blockade and enter the planet's atmosphere."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Shortly after Skerris' demise, Captain Benj Dobbs was placed in command of Defender Squadron One. Commodore Faro believed that the pilot's death over Lothal was the direct result of his arrogance. However, she also believed that Dobbs and his pilots could not match Skerris' skill in combat, and hoped that the squadron was able to rise up to the task should the Chimaera face another battle."}, {"tag": "p", "text": "The pilots of the Imperial 204th Imperial Fighter Wing were taught to fear the rebel-hunter TIE pilots Skerris, Valen Rudor, and Neosephine Calorda. During the 204th's attack, which took place several weeks after the Battle of Endor in 4 ABY, on the EF76 Nebulon-B escort frigate Hellion's Dare, the pilots of the New Republic's Hound Squadron listed those names when discussing how the 204th pilots were trained."}, {"tag": "p", "text": "Around 34 ABY, the master of the Knights of Ren, Kylo Ren, flew the advanced prototype TIE silencer—which incorporated various features from the TIE Defender prototypes flown by Skerris during the Imperial Era—while combating the enemies of the First Order. As a skilled pilot testing a prototype starfighter, he followed in the tradition of Skerris and Ren's grandfather, Vader."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a flight instructor and captain in the Imperial Navy, Skerris expected the best results and strict obedience to orders from his students at Skystrike. He was a ruthless pilot who was willing to shoot down unarmed opponents, including rebels and defectors like Gahree. He despised the Rebel Alliance and regarded them as \"extremists.\" He also strongly believed that orders from superiors were to be followed without question, which he made clear to Wren and Antilles at the academy. Skerris also derided the defecting cadets as \"young fools.\""}, {"tag": "p", "text": "Skerris' overconfidence in his piloting skills led him to disregard Thrawn's orders to disengage Syndulla's X-wing during the dogfight over Lothal. Syndulla's trap cost him not only his life, but also crippled a nearby cruiser and a Star Destroyer. Thus, the surviving members of the rebel squadron were provided with an opening to Lothal through the Imperial blockade."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Skerris was one of the Empire's most skilled pilots. Due to that status, Skerris was personally selected by Thrawn to fly the TIE Defender prototype and pursue Senator Mothma and her rebel allies through the Archeon Nebula. Flying his TIE, he was able to engage multiple enemy fighters without suffering damage to his ship thanks to its shielding. Despite his skills however, Skerris' starfighter was disabled by Vander, with Bridger's assistance, and it spun out of control. Skerris had high intelligence and average diplomatic skill, strength, speed, and fighting ability. He was not Force-sensitive."}, {"tag": "p", "text": "During the mission over Batuu, Skerris was able to cripple the Grysk vessel with the Defender's weaponry without destroying it completely, which allowed Kimmund's unit to successfully board the ship. Vader also regarded the pilot to be highly proficient when the Sith Lord suggested to Thrawn that the Defender's controls be made simpler, as he believed that not all Imperial pilots were as skilled at using them as Skerris. During the battle over Lothal, Skerris, piloting the TIE Defender Elite, quickly shot down multiple rebel pilots before engaging Syndulla, where his career came to an end."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time at Skystrike Academy, Skerris flew a TIE Interceptor with red markings, which denoted his skill in combat. During the pursuit of the Ghost, he piloted a TIE Defender prototype after he was personally handpicked as the test pilot by Thrawn. While stationed on Lothal, the prototype TIE Defender Elite that he flew had red markings, matching the pilot's Interceptor."}, {"tag": "p", "text": "As a TIE fighter pilot, Skerris wore a TIE pilot's uniform that had yellow stripes, and a helmet that featured a horned insignia. By the time of the battle in the Lothal system, the insignia was used on his TIE Defender Elite, which also sported gold markings that matched his uniform."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vult Skerris first appeared in the Star Wars Rebels episode \"The Antilles Extraction,\" which aired on October 8, 2016. He was voiced by Mario Vernazza. Prior to the episode's release, Skerris was first revealed in a trailer released on July 16 of that year."}, {"tag": "p", "text": "The horned insignia on Skerris' helmet and TIE Defender Elite was previously featured on AT-ST models created for the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, as well as its Kenner toy."}, {"tag": "p", "text": "In Timothy Zahn's 2018 novel, Thrawn: Alliances, Skerris was incorrectly referred to as a lieutenant despite being called a captain several times. In the Rebels episode \"Flight of the Defender,\" which takes place after Zahn's novel, Skerris was referred to as a commander, although this may be due to his position as commander of Defender Squadron One rather than his military rank as he was still referred to as a captain posthumously in 2019's Thrawn: Treason."}, {"tag": "p", "text": "Skerris appears in the 2020 mobile video game Star Wars: Starfighter Missions as an unlockable character and a possible boss at the end of a level, piloting a TIE Defender Elite."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}