{"url": "Vuchelle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Atrivis sector astronomical objects", "Category:Braxant Run", "Category:Imperial Remnant locations", "Category:Pentastar Alignment locations"], "nodes": [{"tag": "h1", "text": "Vuchelle"}, {"tag": "p", "text": "Vuchelle was an orange-colored astronomical object located in the Outer Rim Territories' Atrivis sector. Situated along the Braxant Run hyperlane, Vuchelle in 22 BBY became the site of attempted negotiations between a Jedi-led Galactic Republic task force and the pirates of Iridium, who had been committing raids against Republic convoys. The pirates attacked the Jedi task force but were eventually defeated, with one of their starfighters believed to have reentered Vuchelle's atmosphere and burned up as a result."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Vuchelle was an astronomical object located in the Vuchelle system, a part of the Atrivis sector in the New Territories portion of the Outer Rim Territories. The hyperlane known as the Braxant Run connected it to the Fedje system as well as the Isiring system in the neighboring Cassander sector. Vuchelle appeared orange-colored from orbit and had a sufficiently dense atmosphere for unprotected starships to burn up on reentry."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the date 13:3:28, the pirates of Iridium had been committing year-long raids on Galactic Republic grain and spice convoys along the Atrivis sector hyperspace routes, including ambushes near Vuchelle. In response, a joint Jedi Order–Judicial Department task force was dispatched from Coruscant, the Republic's capital planet. The task force attempted to initiate peaceful negotiations with the pirates in the Vuchelle system, but the raiders opened fire."}, {"tag": "p", "text": "In the ensuing confrontation that took place near Vuchelle, the Jedi defeated the pirate force, disabling or destroying most of the enemy craft. Following the skirmish, one of the pirates' Z-95 Headhunter starfighters was unaccounted for, and it was later reported in an issue of the CoCo District Edition of the HoloNet News that the fighter was believed to have succumbed to Vuchelle's gravity well and burned up in the astronomical object's atmosphere. Vuchelle fell within the borders of the Pentastar Alignment between 4 ABY and 12 ABY and was situated in the territory of the Imperial Remnant between 12 ABY and 13 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vuchelle was first featured in HoloNet News Vol. 531 #49, an in-universe issue of the HoloNet News written by Pablo Hidalgo and Paul Ens, illustrated by Joe Corroney, and published on the HoloNet News website on March 28, 2002. The 2009 reference book The Essential Atlas placed the Vuchelle system, and therefore Vuchelle itself, in grid square L-5."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}