{"url": "Vulptereen/Legends", "categories": ["Category:Legends articles", "Category:Carnivorous creatures", "Category:Deep Core species", "Category:Reptilian sentient species", "Category:Vulptereens"], "nodes": [{"tag": "h1", "text": "Vulptereen"}, {"tag": "p", "text": "Vulptereens were a barrel-shaped sentient species with shovel-like mouths from the planet of Vulpter."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Vulptereens had six tusks protruding outward from their snouts, a feeler on their snout, and two pointed ears on top. Their eyes were yellow-green, with black pupils capable of seeing in dark conditions, yet they lacked good depth perception. This resulted in the use of echolocation in these conditions."}, {"tag": "p", "text": "The species' two arms ended in clawed hands, that if dismembered could result in aphasia since they lacked a central brain. However, they were quite hardy when exposed to a variety of environments and did not succumb to toxic conditions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Vulptereen were native to the planet of Vulpter, a world that once contained a thriving ecosystem. The Vulptereen, however, transformed their verdant homeworld into a wasteland due to their over-industrialization."}, {"tag": "p", "text": "Sometime between 20,000 BBY and 15,000 BBY, the Vulptereens were discovered by the Galactic Republic, and joined the rest of the galactic community."}, {"tag": "p", "text": "However, the Trade Federation seized control of Vulpter around 32 BBY, which allowed the Neimoidians to exploit the Vulptereens. They forced them to drill tunnels that could be used as storage for the Trade Federation, and dumped the products that they could not sell on the planet."}, {"tag": "h2", "text": "Vulptereen in the galaxy"}, {"tag": "p", "text": "Vulptereens were known to be pilots, such as Dud Bolt, a podracer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "At one point, Randy Stradley, a writer for Dark Horse Comics, wanted to create a Vulptereen Jedi. However, he was told that \"they're not smart enough to be Jedi\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}