{"url": "Vulture%27s_Claw/Legends", "categories": ["Category:Legends articles", "Category:GS-100 salvage ships"], "nodes": [{"tag": "h1", "text": "Vulture's Claw"}, {"tag": "p", "text": "The Vulture's Claw was the freighter that belonged to the Trandoshan scavenger Gha Nachkt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Vulture's Claw was a GS-100 salvage ship owned by a Trandoshan named Gha Nachkt, who scoured hulking wrecks of starships left in the aftermath of space battles during the Clone Wars for parts, droids, and anything he could sell to the highest bidder. The ship had no problem defending itself from attackers, and Gha was able to catch opponents off guard long enough to get an advantage. It had a moderate defensive system with heavy arms delivery, yet the accuracy of the ship wasn't what enemies feared; it was its resilience. The Vulture's Claw was able to mitigate damage with its onboard computer and droid repair systems. Nachkt also hired himself out as a transport for troops or mercenaries in between salvage operations."}, {"tag": "p", "text": "R2-D2, having been lost after the Battle of Bothawui, later came into Nachkt's possession, who uncovered Republic military secrets within Artoo's memory. Realizing how much the secrets would be worth to the Confederacy of Independent Systems, Nachkt attempted to sell them to General Grievous."}, {"tag": "p", "text": "Anakin Skywalker and Ahsoka Tano, wearing simple cloaks to avoid being recognized as Jedi, boarded the ship to look for R2-D2. While they were attempting to search through a cargo hold filled with years' worth of junk, Anakin's replacement astromech, R3-S6 tripped up their progress, thereby activating Gha's IG-86 sentinel droids. Anakin, Ahsoka, and R3-S6 escaped the Vulture's Claw without recovering R2-D2."}, {"tag": "p", "text": "Gha Nachkt took the Vulture's Claw to the CIS listening post Skytop Station in orbit above Ruusan 2 in order to deliver Artoo to General Grievous. Nachkt was killed by Grievous when he raised his fee for transferring Artoo over to the Separatists. The Vulture's Claw was presumably destroyed when Skytop Station was blown up by Republic operatives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vulture's Claw has seats similar in design to those found aboard the Millennium Falcon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}