{"url": "Vuvrian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Inner Rim species", "Category:Insectoid sentient species", "Category:Spacefaring species", "Category:Vuvrians"], "nodes": [{"tag": "h1", "text": "Vuvrian"}, {"tag": "p", "text": "Vuvrians were a humanoid species with large, twelve-eyed insectoid heads, native to the Inner Rim planet known as Vurdon Ka. Averaging about two meters tall, Vuvrians were cordial, diplomatic, and inquisitive in nature. As a result of living on an almost idyllic homeworld—Vurdon Ka was a windless, predatorless world of mosses and trees—the species developed extremely sensitive skin, which declined in sensitivity as a Vuvrian aged."}, {"tag": "p", "text": "Vuvrians were natural problem solvers. Vuvrian Force-sensitives were not uncommon, but they made poor soldiers due to their extremely low pain threshold. Although they were important members of Galactic society, Vuvrians never made any attempts to colonize other worlds, preferring to stay on their peaceful home planet."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Vuvrians were lightly built, twelve-eyed bipedal insectoid sentients. They had an oblong-shaped head on top of their long, thin necks. They had twelve eyes, varying in size and color, and two long, thin antennae on their heads. They stood about 2 meters tall, with females displaying slightly thinner builds and more oblong-shaped heads. Many other species found the Vuvrians' appearance almost comical."}, {"tag": "p", "text": "As a species, the Vuvrians evolved a highly fine sense of touch, a survival mechanism developed in response to the few predators that called Vurdon Ka home. A Vuvrian's skin was so sensitive that an individual could, for example, feel the minute shifts in air temperature when another being walked into a room. Such heightened sense was often mistaken by other species for latent telepathic ability or even Force-sensitivity. Indeed, a number of Vuvrians excelled as Jedi, with their innate abilities augmented by the power of the Force. As a Vuvrian aged, however, their skin became increasingly wrinkled and less sensitive—a process that was accelerated in harsh offworld environments such as those found on Tatooine or Hoth. Vuvrians did not deal well with pain."}, {"tag": "p", "text": "Considered younglings until they reach eleven standard years old, Vuvrians reached adulthood at around eighteen. Society considered Vuvrians over the age of sixty to be elderly, and anyone over the age of eighty was thought to be venerable, commanding respect due to their old age."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Vuvrians as a species were intelligent and inquisitive in nature. A warm, sincere, friendly people, Vuvrians were very diplomatic, and were natural problem solvers. Although some species found the Vuvrians' physical appearance somewhat disturbing, it was difficult to resist their outgoing, charismatic personality, and their skill in oration and logical argument often meant others found it all but impossible not to see a Vuvrian's point of view. The species' genuine interest in learning about other cultures, and to help others solve problems, ingratiated many Vuvrians into the wider galaxy, and made it easy for a Vuvrian to notice the quirks in other species' cultures."}, {"tag": "p", "text": "Common Vuvrian names included Cimilak, Gwent, Kirrewa, Mylthea, Nilzilun, Scrin, Swiegel and Weelax."}, {"tag": "p", "text": "As well as their own language, Vuvrians could speak Galactic Basic Standard and read and write aurebesh."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Vuvrians never developed a great interest in offworld colonization, despite being long-standing members of galactic society. Rather than found colonies and enclaves outside their home system, Vuvrians were content to tour and observe the greater galaxy, although many found other worlds, and even space stations, paled in comparison to the paradise of Vurdon Ka. Curiously, it was noted that those Vuvrians who settled offworld tended to gravitate towards harsher climates, and xenobiologists were unable to explain why this was so."}, {"tag": "p", "text": "Vuvrians were more than happy to join the Galactic Republic. Many of the species' Force-sensitives joined the Jedi Order, including the Jedi Master Nystammall, who was ultimately killed by General Grievous during the Clone Wars.}}"}, {"tag": "p", "text": "Following the Clone Wars, many Vuvrians were employed by the Galactic Empire to negotiate trade contracts and rare disputes where even the military might of the Imperial regime was not practical or productive. Despite this, many Vuvrians also aided the Alliance to Restore the Republic during the Galactic Civil War, where they proved to be adept spies."}, {"tag": "p", "text": "Other Vuvrians were content to remain neutral during the conflict."}, {"tag": "h2", "text": "Vuvrians in the galaxy"}, {"tag": "p", "text": "Vuvrians, as natural problem solvers, could often be found in diplomatic or business-related fields, and many of the species became known as some of the greatest sales-beings, negotiators, and first-contact specialists in the galaxy. Vuvrians scouts and spies were not uncommon, but they made poor soldiers, due to their extreme intolerance to physical pain. Many Vuvrians were employed as law enforcers, and their twelve eyes distributed on all sides of their head—giving them omnidirectional vision—provided a huge advantage in that line of work."}, {"tag": "p", "text": "Wioslea was a female Vuvrian speeder merchant who resided on Mos Eisley on the planet Tatooine during the height of the Galactic Civil War. She bought Luke Skywalker's X-34 landspeeder for Spaceport Speeders, a local Mos Eisley company that bought and sold landspeeders and other vehicles. Wioslea was also a gambler. Due to outstanding gambling debts, at the time of Jabba Desilijic Tiure's death, she owed him about 1,000 Imperial Credits. Wioslea was also able to speak many languages, including Arconese, Aqualish, Huttese, Rodese, Sullustese, and Vregg."}, {"tag": "p", "text": "Nystammall was a male Vuvrian, who was a member of the Jedi Order during the Clone Wars, with the position of Jedi Master. He was stationed on the Wild Space world of Tovarskl with his former Master, a four-armed Eirrauc known as Puroth, during the Clone Wars. It was while stationed there that the two Jedi were killed by General Grievous. The cyborg then took their blue lightsabers as trophies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cantina Communications makes reference to a species of emotionless, multi-eyed insectoids said to be the best pilots in the galaxy. Though the cultural description is quite different from the Vuvrians, author John Chesterman may have had the Vuvrians in mind when making this reference."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}