{"url": "Vune_Willic", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Enlisted personnel of the Galactic Empire", "Category:Humans", "Category:Imperial Security Bureau personnel", "Category:Males"], "nodes": [{"tag": "h1", "text": "Vune Willic"}, {"tag": "p", "text": "Vune Willic was a Human male native to the world of Carida who became an Imperial Intelligence agent during the Galactic Civil War. He was assigned to Imperial Center, where he worked under Director of Imperial Intelligence Ysanne Isard. His first mission was to assassinate his grandfather, Korval Willic, accused of being a member of the Alliance to Restore the Republic. Willic carried out his mission without hesitation."}, {"tag": "p", "text": "Willic was later accused of attempting to assassinate Emperor Palpatine at the opening of the Galactic Games, though was in truth nothing more than a scapegoat used to cover up an Imperial security embarrassment. Willic was interrogated, and when faced with falsified images of himself committing various crimes, he confessed to his charges. His execution was shown live on the HoloNet several days later, and his time on Coruscant was ultimately made into an exhibit at the Imperial Heritage Museum."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Assassin"}, {"tag": "p", "text": "Vune Willic was brought up on the world of Carida, in the Colonies region of the galaxy, though his family had ancestral ties to Coruscant. At a young age, he joined the Academy of Carida, becoming an expert at engineering and architecture; he also led the academy sharpshooting team. Eventually he left his parents behind on Carida and joined Imperial Intelligence as an engineer. Willic was assigned to Imperial Center; the letter he wrote to his parents en route to the planet was the last time he ever communicated with them. He was awed by the sheer scale of Coruscant's architecture and found himself comparing it to that of his homeworld. When he finally reached what passed for Coruscant's surface, he met with Kirtan Loor, one of his superior officers. Loor allowed Willic several hours to get settled on his new planet of residence before he was given his first assignment; Willic spent the time with his grandfather, Korval Willic, who lived nearby."}, {"tag": "p", "text": "Less than a week into his time on Imperial Center he met with Ysanne Isard, the Director of Imperial Intelligence. He quickly realized that his skills as a sniper, rather than his knowledge of engineering and architecture, were what Imperial Intelligence saw in him. His first assignment was to assassinate a Rebel saboteur who lived in the area near Willic's grandfather. Isard had deduced that his grandfather's balcony would be an ideal vantage point for sniping the Rebel traitor in his home; armed with a disruptor rifle, which was fitted with a targeting scope that would set off an alarm when Willic was aiming at the specified target, he broke into his grandfather's home. As he prepared his sniper rifle, however, he was interrupted by the arrival of Korval. When he pointed the weapon in his grandfather's direction, the rifle began to whine, which implied that his grandfather was the Rebel agent who Willic had been sent to kill. Willic discerned that his grandfather was his target, and fired at him from a point blank range without hesitation."}, {"tag": "p", "text": "Willic killed his grandfather, and received a commendation, as well as another assignment from Isard."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "Several days later, Willic was accused of attempting to assassinate Emperor Palpatine. According to Imperial Intelligence, Willic fitted scan-shielded thermal detonators onto Palpatine's speaking platform at the opening of the Galactic Games on Imperial Center. They claimed that he killed Brot Gorrell and took his place as one of the engineers who constructed the platform so that he could bypass security and fit the charges. Palpatine's Imperial Guardsmen were able to discover the charges and disabled all of them bar one, which exploded just meters from the Emperor, though he somehow escaped unscathed. A HoloNet News report claimed that eyewitnesses, who refused to give up their names, saw Palpatine using the Force to apprehend a fleeing Willic."}, {"tag": "p", "text": "Willic was innocent and was being used as a scapegoat to cover up an attempt by several high-ranking Imperials to have Palpatine killed. The Empire wished to blame the attempt on the Rebels and wanted to tone down its seriousness for the public. Villic was taken into custody by the Royal Guardsmen and Imperial Intelligence operatives and was publicly tried for treason two days later. He was interrogated by a new interrogation droid model, the YI-5 Surveillance/Interrogation droid, which showed him falsified video records of the attempted assassination. After being tortured, the man from Carida confessed to the crimes, believing the false videos to be real, and was sentenced to death in an Imperial court of law. According to falsified Imperial documents, Palpatine believed Willic to be simply confused and requested that he simply receive life behind bars, though Isard was adamant that he be executed. His execution by firing squad was broadcast live on the HoloNet in order to discourage other Rebel activity. Meanwhile, Isard had the true conspirators killed in private."}, {"tag": "p", "text": "Willic's life story was later made into an exhibit at the Imperial Heritage Museum, named Imperial Justice: Triumph of the New Order. After liberating Coruscant, the New Republic altered the exhibit, adding real documents to the forged Imperial ones; included in these was a journal entry of Willic's."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vune Willic was loyal to the Empire, and never shirked duty, even when he wanted to. He completed his first mission—to kill his own grandfather—without indecision. Ultimately, however, his bravery was not repaid in kind; he was used and discarded by Isard despite having committed no crimes. Willic was a talented sniper, an expert on munitions and explosives, a budding engineer and architect, and an able slicer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vune Willic was created by Cory J. Herndon for an article named Coruscant: Center of the Empire, part of the Planet Hoppers series on the Wizards of the Coast website. It is his only appearance to date."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}