{"url": "Vylanthar_Merric", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic members", "Category:Humans", "Category:Imperials", "Category:Individuals of unspecified gender", "Category:Nobility", "Category:Scouts"], "nodes": [{"tag": "h1", "text": "Vylanthar Merric"}, {"tag": "p", "text": "Vylanthar Merric was a Human noble who lived during the reign of the Galactic Empire. Merric was raised on a planet that was favored by the Emperor and while still a youth, Merric was brought to the Imperial Court on the planet Coruscant. Merric initially sought to become an Imperial Advisor, but the noble's enthusiasm for the Empire began to wane after Merric began to move in more select circles and learned of the various atrocities that the Empire regularly committed. Following the destruction of the planet Alderaan by the Empire in 0 BBY, Merric left the court and joined the Rebel Alliance. Merric became a crew member aboard the transport Griffon's Wings and he served as part of an Alliance scouting team that was assigned to search for new plants on which the Alliance could build secret bases."}, {"tag": "p", "text": "A short time after the Battle of Yavin, the Griffon's Wings was dispatched by the Alliance to explore the planet Yorgraxx. However, after arriving in the Yorgraxx system, the Griffon's Wings was attacked by three Imperial Guardian-class light cruiser. The transport was forced to crash land on Yorgraxx and the impact knocked Merric and the rest of the vessel's crew unconscious. After coming around, Merric and the surviving crew encounted Arran Flekk and Vor Harkass, two Imperial scouts that were stranded on Yorgraxx, and the pair agreed to work with the crew of the Griffon's Wings to find a way off of Yorgraxx. Shortly afterward, the group investigated a nearby Sith fortress, where they encounted the Sith spirit Quorlac Fornayh and the Emperor's Hand Jallar Golin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Merric did not hate the Galactic Empire, but instead feared it and reasoned, on an intellectual level, that the Empire could not be allowed to continue to exist. Merric was multi-lingual and was fluent in Basic, Bothese, Cerean, Durese, Geonosian, Huttese, Kel Dor, Mon Calamarian, Rodese and Sullustese. In addition, Merric understood Shyriiwook and knew how to read and write the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vylanthar Merric was created by Robert Wiese and appears in the role-playing adventure Shadows in the Force, as a pre-generated character that a player of the adventure can choose to role-play as. The players have the choice of determining whether Merric has a male or female gender, and the character's canon gender is not revealed."}, {"tag": "h2", "text": "Appearances"}]}