{"url": "Vuutun_Palaa/Legends", "categories": ["Category:Legends articles", "Category:Lucrehulk-class Droid Control Ships", "Category:Trade Federation starships"], "nodes": [{"tag": "h1", "text": "Vuutun Palaa"}, {"tag": "p", "text": "The Vuutun Palaa was a Lucrehulk-class Droid Control Ship that powered the Trade Federation Droid Army on Naboo during the Trade Federation's invasion of the planet in 32 BBY. Headed by Captain Daultay Dofine, the ship was responsible for coordinating the invading battle droid armies on the surface of Naboo."}, {"tag": "p", "text": "During the invasion's final stages, it was the only ship that remained above the planet surface in order to maintain control of the droid army. Later, Bravo Flight attacked the Vuutun Palaa to end the invasion; the ship was later destroyed when a young boy, Anakin Skywalker, accidentally entered the ship and launched two proton torpedoes into the ship's starboard main reactor, causing a chain reaction that tore the ship apart, deactivating the droid army and ending the invasion."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Vuutun Palaa was a Lucrehulk-class Droid Control Ship that started its life as a crescent-shaped Hoersch-Kessel Drive, Inc. freighter and was converted by the Trade Federation into a vessel of war. Like others of its class, it carried three proton 2 engines and secondary proton 12 engines. It was armed with 42 quad turbolaser cannons, which were mounted on rotators and were mounted in groups of three, although the guns were primarily on the equatorial band and provided limited coverage. The guns themselves featured complex targeting routines to engage enemy starships."}, {"tag": "p", "text": "The Vuutun Palaa's two cargo arms could carry up to 1,500 droid starfighters, 50 C-9979 landing craft, 550 Multi-Troop Transports, and 6,250 Armored Assault Tanks, and 1,500 battle droid carriers. The hangars were divided into three zones. In inner zone 3, C-9979 landing craft were assembled there. The landing ships were loaded in hangar 2, where the massive ammunition dumps were located. Landing craft staged for launch out of zone 1. Each hangar had sliding bulkhead doors to the next zone. The outside of the hangars had docking claws with rotator assemblies and reinforced bracing. Multiple tractor beam projectors guided craft into zone 1. The hangar zones also were protected by ceiling-mounted laser turrets. Additional hangars within the inner wall of the cargo arms provided docking spaces for shuttles. Armored and sealed hangars for toxic materials were kept away from the main hangars. The Control Ship's droid starfighter squadrons could dock on roof power grids to power their onboard generators."}, {"tag": "p", "text": "The ship featured heavy deflector shielding. The symbol of the Trade Federation was painted on the bridge. The ship carried sixteen Receiver Stations to control the Trade Federation Droid Army, which had a maximum broadcast range of 16,500 kilometers. Along with the Receiver Stations, the ship had transmitters, monitor sensors, and two main reactors to power it all (one at the back of the third hangar zone on either side). The transmission antennas were made of exotic composite alloys to withstand extremely high signal strength, and drew power directly from the reactor, requiring additional power sources to be strung together. The Droid Control Ship was considered the most important vessel in the Trade Federation fleet. The ship carried numerous computers and the Control Brain Network to control the Trade Federation Droid Army. Without the Droid Control Ship, the Trade Federation's B1-Series battle droids were incapable of independent action. The bridge and main droid control computer were located on the center sphere."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, the Vuutun Palaa was left in orbit over the planet Naboo after the Trade Federation blockade broke up. Darth Maul, upon noticing that the blockade was gone save for the Vuutun Palaa when returning from Coruscant, was angered at this strategic blunder, as the ship itself was easily vulnerable of being infiltrated and destroyed from within. Maul was tempted to teach a lesson to the Trade Federation by sneaking onto the ship himself, although he soon decided against it. Captain Daultay Dofine and flight controller Tey How transferred their command from the Saak'ak to the Droid Control Ship. The Control Ship was attacked during the final stages of the invasion by Naboo's Bravo Flight using N-1 starfighters. DFS Starfighter Squadron was stationed onboard for defense."}, {"tag": "p", "text": "Bravo Flight engaged the Control Ship's complement of droid starfighters before moving in to attack the Control Ship directly. The Naboo pilot Palmer was captured in the tractor beams and drawn into range of the hangar's defensive guns. Her starfighter was then destroyed and killed . Another Naboo pilot destroyed one of the tractor beam emplacements, and Lieutenant Gavyn Sykes destroyed the other three, in order to remove the danger."}, {"tag": "p", "text": "The pilots destroyed 14 of the Control Ship's Receiver Stations, temporarily preventing the launch of additional droid starfighters. Around that time, a mercenary pilot appeared and shot down another N-1. The mercenary was pursued inside the Vuutun Palaa by Naboo pilot Rhys Dallows who destroyed assembly cranes and ceiling turrets."}, {"tag": "p", "text": "The young boy Anakin Skywalker, piloting an N-1 by a twist of fate, was hit by a droid fighter and sent into a spin; he regained control and flew into the right-hand hangar bay of the Droid Control Ship, although his ship was overheated. Lt. Sykes saw him fly in and reported it to the flight leader, Ric Olié, who ordered Sykes to provide cover. Sykes attacked the shield generator on the outside of the ship, destroying it."}, {"tag": "p", "text": "As Dallows followed the mercenary into the ship, another shield generator in the ship's third hangar restarted the shields, trapping Dallows, the mercenary pilot and Skywalker and blocking any help from Dallows' fellow pilots. Despite this, Dallows continued to follow the mercenary pilot. Skywalker, on the other hand, seemed helpless due to not being able to control his overheated ship, while OOM security battle droids approached Skywalker's ship commanding him to come out."}, {"tag": "p", "text": "When Skywalker's ship finally cooled down and rebooted, he began shooting at the droids before unintentionally launching two proton torpedoes into the starboard reactor core, starting a chain reaction which created a massive explosion that began destroying the ship. Frightened by what he had just done, Skywalker promptly fled the exploding ship. Meanwhile, at the ship's bridge, flight controller How reported the disturbance to Captain Dofine, who found it impossible as he thought the ship's deflector shields would have kept any starfighters from entering it, unaware that the temporary disabling of the shields ended up causing two of the starfighters to infiltrate it."}, {"tag": "p", "text": "At the same time, Dallows finally killed the mercenary pilot and escaped by destroying the shield generator in the third hangar bay, completely disabling the shields and opening a path outside. Just as all of the surviving starfighters retreated from the ship, cheering in victory, the puzzled ship crew inside Vuutun Palaa's bridge were caught by surprise when the chain reaction caused the ship's control computer console to malfunction and explode, killing Dofine, How and all other fellow ship crew members. The explosion happened just as the entire bridge and center sphere were destroyed. With the loss of Vuutun Paala, the droid armies on the planet surface were left without a signal to control them and all powered down, ending the invasion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Vuutun Palaa first appeared in materials relating to Star Wars: Episode I The Phantom Menace, released in 1999. In the Episode 1 DVD commentary, it was revealed the Droid Control Ship was portrayed by a physical model, and the battle was rendered using computer graphic effects. The explosion of the central core was filmed using a smaller sphere and then imposing it onto the real sphere. The ship went unidentified in its original appearances, and received its name in Del Rey's 2012 reference book The Essential Guide to Warfare."}, {"tag": "p", "text": "In the 2000 video game Star Wars: Episode I: Battle for Naboo, the player, flying as Gavyn Sykes, fought the Droid Control Ship in the game's final campaign mission. The game took place over two parts. The player fights a squadron of droid starfighters, and then engages the battleship. One of the tractor beam generators were destroyed in the inter-mission cutscene and the player had to destroy the other three. After a while, Skywalker automatically flew into the hangar and the player was ordered to provide cover by destroying the shield generator. Other portions of the ship, including the Receiver Stations, were able to be destroyed but had no effect on the game. The destruction of the shield generator was later confirmed as canon by Leland Chee on Christian J Simpson's StarWars.com Blog"}, {"tag": "p", "text": "The video game Star Wars: Starfighter was released in 2001. For the game's final campaign mission, players took the role of Rhys Dallows and were tasked with destroying the droid starfighters and Receiver Stations. After those targets were destroyed, a mercenary craft appears in a cutscene, and the player had to shoot it before the mercenary retreats inside the Federation battleship. The players then chased the mercenary through the ship. If the players chose to do so, certain secondary targets could have been destroyed to fulfill the mission's bonus requirements, although this was not necessary. After dueling and destroying the mercenary, Skywalker destroys the reactors at that time, and the players escaped by destroying a shield generator in the hangar. The game contradicts the movie by giving the Droid Control Ship missile launchers instead of turbolaser cannons near the engine block."}, {"tag": "p", "text": "The Droid Control Ship was re-imagined in LEGO form as a bonus level in the 2007 compilation LEGO Star Wars: The Complete Saga. Player(s) use their N-1 starfighters to attack targets on the Droid Control Ship. When enough targets are destroyed, a hatch opens and the player(s) fly inside, blowing up doors to reach the reactor. The reactor is protected by a shield, which drops on a timer, allowing the targets to be destroyed, resulting in the destruction of the vessel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}