{"url": "Vuul_Sarlin", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Males", "Category:Spice dealers", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Vuul Sarlin"}, {"tag": "p", "text": "Vuul Sarlin was a male Zabrak spice dealer boss who lived on the planet Corellia during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time following the Battle of Yavin, Vuul Sarlin was leading a group of spice dealers in the city of Kor Vella. Jaylon Geissler served as his right-hand. The group owned a warehouse in Kor Vella to stock the ryll spice distributed in the city. The spice was provided by a gang of ryll smugglers. For security reasons, Vuul Sarlin and his men ignored everything about this ryll smuggling ring, that was in fact the Chirq Council, best known as the Red Circle Gang. They had only one contact among the ryll smugglers, Ladonna Poe, who provided the ryll from a bunker in the Vella plains nearby."}, {"tag": "p", "text": "Circa 1 ABY, the Corellian Security Force started an investigation against the ryll smuggling ring following the increase of spice traffic in Kor Vella. A spacer working for Lieutenant Cope questioned a local spice addict known as Menchi Lerann. The man revealed that he bought his ryll from Vuul Sarlin and Jaylon Geissler. The spacer later interrogated Geissler but the spice dealer obviously refused to collaborate. However, after the spacer started to destroy some spice crates in the ryll warehouse, Jaylon Geissler reluctantly accepted to give Vuul Sarlin's current location: a small camp in the plains outside Kor Vella. The spacer therefore attacked the camp and defeated Vuul Sarlin's guards. Sarlin was forced to reveal everything he knew about the ryll smuggling ring. In return, the spacer agreed with removing Sarlin's name from the smuggling ring's database. The CorSec later assaulted the Ryll Smuggler Bunker and discovered the existence of the Red Circle Gang. The CorSec investigation eventually led to the disbandment of the Chirq Council."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vuul Sarlin appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Vuul Sarlin was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}