{"url": "WAC-47/Legends", "categories": ["Category:Legends articles", "Category:DUM-series pit droids", "Category:Galactic Republic droids", "Category:Masculine programming", "Category:Members of the 91st Mobile Reconnaissance Corps"], "nodes": [{"tag": "h1", "text": "WAC-47"}, {"tag": "p", "text": "WAC-47 was a masculine-programmed DUM-series pit droid during the Clone Wars. He served with Clone Commander Neyo and was later transferred to D-Squad."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stealth Mission"}, {"tag": "p", "text": "Around 20 BBY, WAC-47 helped D-Squad infiltrate a Confederacy of Independent Systems dreadnought and steal an encryption module used by the Separatists."}, {"tag": "p", "text": "Immediately, this overenthusiastic, bumbling droid went off on a bad start. He arrived at the Jedi Temple late, much to the displeasure of Mace Windu. When Colonel Meebur Gascon arrived, WAC was instantly at odds with the Colonel, often mistakenly referring to him as Corporal and contradicting Gascon's strict ways."}, {"tag": "p", "text": "When the other droids of D-Squad went to get modifications from the Parwan doctor Gubacher, WAC was instructed to stay with their ship, as he was supposed to only be the pilot. WAC was not happy with this, and when they were approaching the Separatist fleet, he set a collision course with the dreadnought. He was trying to show Gascon that he was more than a pilot, but Gascon was very angry with WAC anyway as their ship was caught in a tractor beam."}, {"tag": "p", "text": "At one point, the squad was faced with one of their objectives to remove two B2 super battle droids guarding the comm vault. WAC volunteered to distract them by claiming to have been sent by General Grievous to test the vault's security and locked them in an elevator, allowing the squad to go on."}, {"tag": "p", "text": "They successfully reached their destination with only the loss of M5-BZ. When they were about to extract their encryption module, the super tactical droid Aut-O burst into the room. R2-D2 turned the gravity in the room off, and a skirmish between D-Squad and the Separatists broke out. Aut-O was eventually defeated and the squad was able to escape safely with the module."}, {"tag": "p", "text": "On their way out of the dreadnought, WAC and R2-D2 paused at the destroyed body of M5-BZ. While Gascon did not approve at first, they were allowed to bring the droid with them for repairs once they got home."}, {"tag": "p", "text": "Although originally enemies, WAC seemed to grow on Gascon as he commended all of them for their bravery in the mission. This was the first time WAC correctly called Gascon a Colonel, as well."}, {"tag": "h3", "text": "Stranded"}, {"tag": "p", "text": "As the astromech got to work on BZ, WAC noticed blips on the ship sensors. He got up to inform Gascon that there were comets in their path, but added that he would at least have an excuse if his mission failed. Gascon hurried to the cockpit as the hyperspace window turned red. WAC dropped them out of hyperspace before they could collide, but the shuttle sustained damage in the middle of the swarm. The mechs managed to repair the damage, restoring power to the engines, but they were forced into a crash-landing on Abafar."}, {"tag": "p", "text": "Though Gascon insisted they stay at the ship, the mechs took off with the encryption module, hoping to find civilization. WAC chased after them, telling Gascon that perhaps the Republic would give himself a promotion by delivering the module, prompting Gascon to chase after the droids."}, {"tag": "p", "text": "As the group traveled across the featureless waste, Gascon once again began to lose his temper and claimed himself better due to his training and supposed mental flexibility while the droids \"merely\" acted on their programming. WAC, however, managed to point out the flaws in Gascon's reasoning, and a chance encounter with another shipwreck and the dead remnants of its crew teared the last shred of resolve from Gascon. In his desperation, he began to lose his mind, and as a result, when WAC impertinently announced himself the new leader of the group, he found himself overruled and abandoned by the others."}, {"tag": "p", "text": "WAC remained with Gascon as the Colonel bemoaned the hopelessness of his predicament. The pit droid told him that it was not in his programming to give up and asked Gascon why he feels this way. This restores Gascon's resolve, as he decides to think outside the box. At that moment, a stampede of native flightless birds rushed past them. The duo hitched a ride on the birds, Gascon reasoning that their instincts would lead them to safety. Sure enough, the birds brought them to the town of Pons Ora, where they found the rest of D-Squad. Before taking a much needed drink from an oasis, Gascon thanked WAC for helping him and field promotes him to the rank of Corporal. This pleases WAC, who goes on to boasting of his new rank to the astromechs."}, {"tag": "h3", "text": "Return home"}, {"tag": "p", "text": "As they made their way through town, Gascon and WAC separated from the rest of the squad so the former could get some much needed refreshment. But upon entering a diner, they were rudely shooed out by the Sullustan cook, Borkus. Though Gascon vowed revenge, WAC pointed out that he was unlikely to get it. The pit droid then spotted a swarm of insects scurrying to the side of the diner, where the garbage was. Though Gascon was disgusted by the thought of eating leftovers, he saw no alternative. But before he could take a bite, the diner's dish washer, Gregor, came out to dump more waste. He apologized to Gascon and offered to give him food on the side. However, the Colonel stared at Gregor, identifying him as a clone that apparently had amnesia. Before they could press any further, Gregor was called back into the diner."}, {"tag": "p", "text": "Gascon and WAC rendezvoused with the astromechs, who reported the presence of Separatists on the planet. Though Gascon's deductive reasoning, they found a landing zone, albeit heavily guarded. Gascon said they had to stealthily make their way to the docked shuttle, and the droids pointed out that the Separatists may have been on the lookout for them after their mission to the dreadnaught. Therefore, the group decided to enlist Gregor's aid. They followed the clone to his apartment and got his attention with a hologram of Captain Rex. R2 was able to identify him as a clone commando from his ID tag, presumed missing in action in the Battle of Sarrish. With his memory partially restored, Gregor agreed to help them and they went to the diner to search for his equipment, where they were confronted by Borkus, who had been secretly hiding his gear. D-Squad was able to get the drop on the Sullustan, leaving him bound on the diner floor. As they prepared to leave, Borkus revealed that the Separatists were mining Rhydonium to assault a Republic cruiser in orbit."}, {"tag": "p", "text": "Gregor provided cover fire for D-Squad as they made their way to the shuttle. But the battle droids attempt to stop them. One stray shot hit a fuel canister, knocking down BZ and Gascon inside him. Gascon urged WAC to leave him, an order he quickly complied with. He quickly met up with Gregor, who went back for Gascon and BZ and stayed behind to cover D-Squad's escape. As WAC got the shuttle in the air, he asked Gascon where Gregor was. The Colonel stated that the clone commando was sacrificing himself to ensure they survived to tell of his tale. D-Squad then departed Abafar for the Republic."}, {"tag": "p", "text": "D-Squad then disembarked on the Republic cruiser in orbit of Abafar, where they discovered that the ship had been commandeered by Separatists. Upon encountering surviving Republic droids, D-Squad learns that the Separatists have loaded large quantities of rhydonium aboard the cruiser, intending to use it as a explosive weapon at a space station in the Carida system, the site of the Republic Strategy conference."}, {"tag": "p", "text": "But before they could act on this information, Gascon and the Republic chased a buzz droid to stop it from alerting the other battle droids. They chased the buzz droid into one of the gun batteries, only to find a whole swarm waiting for them. Surrounded, Artoo created a ring of fire around his compatriots to keep the buzz droids from getting at them. M5-BZ then made a daring move to blow the buzz droids out the airlock. The Republic droids quickly magnetized their feet to avoid being sucked out, but Beezee wasn't so lucky and was sucked out into hyperspace along with the buzz droids."}, {"tag": "p", "text": "Vowing to not let Beezee's sacrifice be in vain, Gascon came up with a plan to thwart the Separatist plot. As he led the droids back to their shuttle, Artoo went for the bomb trigger, intending to reprogram it to trigger the rhydonium to detonate prematurely. Unfortunately, a super tactical droid was already prepping the detonator. Though Gascon wanted to go back for Artoo, WAC initiated takeoff. D-Squad managed to get to safety as Artoo managed to complete his task, destroying the cruiser before it could tear apart the station. Anakin Skywalker dispatched salvage teams into the wreckage in search of the heroic astromech, who managed to find Artoo and repair him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}