{"url": "WBY-102_FirstMate", "categories": ["Category:Legends articles", "Category:Third-degree droid models"], "nodes": [{"tag": "h1", "text": "WBY-102 FirstMate"}, {"tag": "p", "text": "The WBY-102 FirstMate was a specialized third-degree droid programmed to instruct people in sailing, caring for and navigating a multi-crewed sailing vessel. It was sheathed in waterproof hard plastic. It has an inflatable flotation bag designed to deploy if the droid was submerged in water."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The WBY-102 droid—commonly known as a \"Webby\"—was humanoid, with two arms and two legs, and built-in inertial compensators allowed the droid to remain steady on a boat's deck during rough weather. It was covered in a waterproof hard-impact plastic shell which was colored a deep blue, and its chest compartment contained an emergency flotation bag that could be deployed in the event of the droid's submersion in water. A comlink was linked to this feature, allowing the droid to broadcast a distress signal. The WBY-102 utilized an AA-1 VerboBrain for cognitive processing, and a vocabulator that allowed the droid to speak in a calm, confident voice. Visual and auditory sensors were installed, but were limited to a Human range."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The WBY-102 FirstMate was an uncommon variant of the WBY series of specialized third-degree droids designed to instruct Humans in the use of mechanical vehicles. The 102 variant was programmed to teach Humans how to sail, crew, and care for a multi-sail boat or yacht, and could also serve as a member of the crew itself. WBY-102 droids had a stable personality, and were completely unfazed by violent weather or seabourne disasters. The WBY-102 was less reliable, however, when confronted with stressful situations that lay outside its core programming, such was lightfights."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Seth Cambriel, a Rebel spy on the planet Spira owned a WBY-102 droid. During a mission to recover Alliance supplies from Spira's oceans, he used the droid to train a group of Rebel agents in the sailing of his yacht, the Cambus Gale."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}