{"url": "Wag_Too/Legends", "categories": ["Category:Legends articles", "Category:Healers and doctors", "Category:Lurmen", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wag Too"}, {"tag": "p", "text": "Wag Too was a Lurmen healer and son of the village leader, Tee Watt Kaa."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wag Too helped Commander Ahsoka Tano and Commander Bly heal General Anakin Skywalker after he sustained injuries during a battle. He agreed with the typical Lurmen way of peace and insisted upon incapacitating his enemies rather than killing them. He was able to successfully bring Skywalker back to the Lurmen camp, where he made a full recovery."}, {"tag": "p", "text": "After Lok Durd and his battle droid left the Lurmen camp, Wag Too had an argument with his father, Tee Watt Kaa; while he respected their people's beliefs, he did not agree with his father's pacifist attitude towards the Separatists, and asked if his father cared about the Jedi at all. Tee Watt Kaa said he had nothing against the Jedi, but they couldn't get involved with the Jedi without getting involved in their war. The camp later heard that the Separatists were coming back, strengthening Wag Too's resolve to defend themselves against the Separatists."}, {"tag": "p", "text": "During the battle, the droids destroyed the force field protecting the Lurmen camp. At this point Wag Too could no longer stand by, and led a group of Lurmen into the fight, using rope and such to knock over droids, passing between them with their speed and agility, and leaving them on the ground for the Jedi to finish off. When the battle was over, Wag Too gave the Jedi his thanks."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wag Too was a compassionate individual and was concerned for the welfare of his patients as shown when he asked Anakin Skywalker not to move out of concern that he would hurt himself. He also would not hesitate to stand up to his father if he felt it was necessary and unlike Tee Watt Kaa, he was willing to enter combat to defend his home. Nevertheless, Wag Too was still peaceful by nature and would prefer to stun his opponents rather than kill them. He was more grateful than his father was when Ahsoka Tano, Aayla Secura and Anakin Skywalker returned to protect their village and, inspired by the selflessness of the three Jedi, he entered the battle himself in order to help them."}, {"tag": "h2", "text": "Abilities"}, {"tag": "p", "text": "When Wag Too needed to get at high speeds, he would turn into a wheel-like shape like the local Amanin and roll. He was a skilled healer being able to heal Anakin Skywalker from life-threatening injuries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}