{"url": "Wald%27s_Parts", "categories": ["Category:Legends articles", "Category:Businesses", "Category:Junkyards", "Category:Mos Espa locations"], "nodes": [{"tag": "h1", "text": "Wald's Parts"}, {"tag": "p", "text": "Watto's Junkshop, later named Wald's Parts, was a junk shop owned by Watto, a junk dealer, in the city of Mos Espa on Tatooine. When Anakin Skywalker was a little boy, he worked here as well as his mother, Shmi and Anakin's Rodian friend W. Wald. Anakin and Wald worked as mechanics while Shmi was just a simple worker. The catch phrase was \"What do you want?\" or \"Hi chuba da nago?\" in Huttese. The shop's best customers were Jawas who were always looking for salvage."}, {"tag": "p", "text": "It was well-stocked despite being one of the city's smallest businesses. Watto based much of his business on his dealings with Jawas, and only accepted Tatooinian currency. The top of the shop featured a bell-shaped apex, which Watto built to resemble the nest from his homeworld."}, {"tag": "p", "text": "In 32 BBY, Qui-Gon Jinn visited Watto's shop looking for a hyperdrive replacement for the Queen's Royal Starship, a T-14 hyperdrive generator."}, {"tag": "p", "text": "After retiring, Watto turned ownership to Wald, who renamed it Wald's Parts."}, {"tag": "h2", "text": "Structure"}, {"tag": "p", "text": "For a simple-minded Toydarian like Watto, his shop was a fairly complex building. It stood out from many of the other stores and market booths that infested Mos Espa, which partially accounted for the greedy shopkeeper's success."}, {"tag": "p", "text": "The main area of the shop was the base of the building itself, where most of Watto's droid technology and smaller machinery was located. Moisture vaporators, calibration devices, moobian torsion valves and even a droid lubrication bath were some of the items included. Watto used a scenter to make it smell like his homeworld."}, {"tag": "p", "text": "Above the base was a strange bell-shaped top, held up by durasteel support rings, that attracted the most attention and therefore customers. It was meant to be reminiscent of the muck nests of Toydaria, and was in fact Watto's perch. Included in the nest was a trophy shelf of podrace memorabilia, including a victory chain won by Sebulba and a glove recovered from Bekk Tunit's crash site. It also included polyfiber netting containing Toydarian muck lake atmosphere. To maintain a comfortable temperature, the durasteel double walls of the shop were supported by a layer of coolant flowing in between. Warm air was vented out through slots in the shop's skirt and top."}, {"tag": "p", "text": "Outside was an arched portal leading into a junkyard, where Watto kept his largest vehicle parts, including turbine engines, hyperdrives, and various other machinery. This area was the main portion of his shop and earned him much wupiupi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The EVA Pod from the 1968 film 2001: A Space Odyssey can be seen in the background of Watto's junkyard."}, {"tag": "p", "text": "Robby the Robot used in a number of sci-fi films and made an appearance on Lost In Space, battling the good robot with the Robinson family, is also seen in Watto's store."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}