{"url": "Wade_Vox", "categories": ["Category:Legends articles", "Category:Alderaanians", "Category:Force-sensitives", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Wade Vox"}, {"tag": "p", "text": "Wade Vox was a Human male smuggler native to Alderaan and a Force-sensitive who participated in the Demolition games hosted by Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wade Vox was born to wealthy merchants on the planet Alderaan near the end of the Clone Wars. As a young man Wade was piloting one of his father's transports along the Corellian Run when his home planet was obliterated by the first Death Star. Distraught over his loss and left with very few options he took up risky smuggling jobs and eventually found himself on Tatooine where he quickly fell foul of Jabba Desilijic Tiure after refusing to pay a protection levy at the Mos Eisley spaceport. He was subsequently forced to compete in his underground \"demolition\" games."}, {"tag": "p", "text": "Vox would likely have been killed if not for his growing connection to the Force especially faced with such competitors as Boba Fett, he also learned that the X-34 landspeeder he had customized after purchasing from BoShek had belonged to none other than Luke Skywalker who had sold it upon his departure from Tatooine. Vox looked up to Luke as the last remaining Jedi, and felt that he too would one day achieve greatness."}, {"tag": "p", "text": "After the conclusion of the demolition tournament and with his new found freedom Vox followed his ambitions of exploring his connection to the Force at a deeper level when he constructed a crimson lightsaber, This in itself is a remarkable achievement due to his almost complete lack of training, a feat matched a decade or so later by Jaden Korr. Soon after doing so however, he was discovered by Aurra Sing who tried to take him out with a long range blaster. Vox deflected the shots with relative ease and evaded the notorious Jedi hunter almost to her satisfaction."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vox had a somewhat reckless and rebellious nature that would land him in trouble with such people as Jabba Desilijic Tiure and showed cockiness in his victories in the tournament."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Vox was a Force-sensitive and although had no formal training did show a degree of talent with this limited skill especially in his ability as a pilot much like a young Anakin Skywalker. He was able to generate a powerful Force attack from his speeder to cripple enemies for a short amount of time giving the impression that Vox must have spent some time practicing this or that he was naturally adept at this kind of Force power. Either way his flourishing abilities were worthy enough to gain the attention of Aurra Sing. Along with this is his building of a lightsaber which is near impossible for anyone without notable Force connection; just where and how he acquired the necessary parts for this task are unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wade Vox was featured as a playable character in Star Wars: Demolition and was voiced by Holt McCallany. An alternative ending to Demolition sees Vox thrown to the floor in Jabba's throne room much to the amusement of Jabba's court. Aurra Sing then stands over him and reveals a Vibroblade. The end of this sequence gives the impression that he comes to a sticky end."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}