{"url": "Wam_Lufba/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Desilijic servants", "Category:Males", "Category:Smugglers", "Category:Yuzzum"], "nodes": [{"tag": "h1", "text": "Wam Lufba"}, {"tag": "p", "text": "Wam Lufba, nicknamed \"Blam,\" was a freelance vermin exterminator who resided on Tatooine. A Yuzzum native of Endor's forest moon, the diminutive Lufba spent his younger days serving as a spotter for rugger hunting parties. Barred from becoming a legitimate hunter because of his size, Lufba actually possessed great natural accuracy with the Yuzzumi spear, but was never exploited by his colleagues. During the Imperial era, Lufba and a group of his fellow Yuzzum were captured by a poacher and taken to Tatooine. There, the poacher intended to give the Yuzzum to the crime lord Jabba Desilijic Tiure."}, {"tag": "p", "text": "Jabba was insulted by the offer, and threw the poacher and his quarry into his palace's rancor pit. While the other Yuzzum and the poacher were devoured by the beast instantly, Lufba picked up an old Czerka Arms 84-U hunting rifle that had fallen into the pit, and quickly dispatched three of the Hutt lord's guards. Impressed, one of Jabba's employees, Pote Snitkin, retrieved Lufba from the pit, and installed the Yuzzum as his henchman. Lufba would serve Snitkin on various smuggling runs, and was essentially freed in 4 ABY when Snitkin, Jabba, and most of the Hutt's other associates died in the destruction of the Khetanna. After a brief tour of the Outer Rim and the Centrality with fellow Yuzzum Joh Yowza, Lufba settled down and established his extermination business on Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Spotter"}, {"tag": "p", "text": "Wam Lufba grew up on the Forest Moon of Endor. Short in size, he was derided by his fellow Yuzzums and was not allowed to utilize the Yuzzumi spear during rugger hunts. He was, however, given permission to accompany the hunting groups in their expeditions, and would work as a spotter. He pinpointed the small, fluffy ruggers on the moon's savanna floors, but although he claimed to possess great accuracy with the Yuzzumi spear, he did not participate in the actual hunting."}, {"tag": "h3", "text": "Capture and employment"}, {"tag": "p", "text": "On one expedition, several years prior to 4 ABY, Lufba and four other members of his tribe were captured and rendered unconscious. Upon waking, they found themselves inside the cargo hold of a poacher's starship. They soon arrived on the arid world of Tatooine, where the poacher took his quarry to Jabba's Palace. Lufba and his fellow Yuzzum were placed before the Hutt crime lord Jabba Desilijic Tiure, as part of the poacher's efforts to pay off his debts to the Hutt. Jabba was insulted by the offer, and threw the Yuzzum and the poacher into his rancor pit."}, {"tag": "p", "text": "While the poacher and the other Yuzzum were devoured by the rancor, a panicking Lufba found a Czerka Arms 84-U hunting rifle that had fallen into the pit, ran into the beast's holding pen, and killed three of Jabba's guards with great accuracy. Before the rancor could round on him, Pote Snitkin, a Skrilling gunrunner in the Hutt's employ, retrieved Lufba. Snitkin then pleaded with Jabba, asking him to spare Lufba's life so the diminutive Yuzzum could aid him in his line of work. The Hutt agreed, placing Lufba in Snitkin's care."}, {"tag": "p", "text": "Lufba decided to hold on to the 84-U that had saved his life, and he was rarely seen without it. He soon earned the nickname \"Blam\" from Snitkin, who consistently took the Yuzzum with him on smuggling runs. Whenever he was at Jabba's Palace, Lufba would hunt rodents in the dungeons, or observe Hermi Odle, Snitkin's primary competitor. Lufba came to be seen as Snitkin's henchman, and Odle, in response to the Yuzzum's spying, had the Ugnaught Yoxgit observe the Skrilling and his associate in turn. Another Yuzzum, Joh Yowza, eventually arrived at the palace as well, to Lufba's delight. Yowza, a member of the Max Rebo Band, frequently conversed with Lufba in between performances, with the two eventually becoming friends."}, {"tag": "h3", "text": "Exterminator"}, {"tag": "p", "text": "In 4 ABY, Lufba was present in Jabba's throne room when Princess Leia Organa, disguised as a bounty hunter named Boushh, brought the Wookiee Chewbacca before Jabba. The act was part of a ruse to free Han Solo, who was a captive of the crime lord. At one stage in Organa and Jabba's banter, the disguised Princess produced a thermal detonator, threatening the crime lord and, by extension, putting the lives of everyone in the room, including Lufba's, at risk. The Hutt foiled their plans, however, and sentenced Solo, Chewbacca, Organa, and their friend Luke Skywalker to be executed at the Great Pit of Carkoon. Lufba chose not to go to the execution, since he sympathized with Skywalker, who had recently killed Jabba's rancor."}, {"tag": "p", "text": "News of what had happened at the Pit soon reached Lufba: Jabba was dead, and Snitkin along with him, while the captives had escaped. The Yuzzum realized that he was now free to do whatever he pleased, and left Jabba's Palace. He accompanied Yowza on a tour of the Outer Rim Territories and the Centrality before returning to Tatooine and establishing himself as an exterminator of womp rats and other vermin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wam Lufba was a persistent Yuzzum, highly skilled in the field of weapon accuracy. He insisted to his peers that he was adept in the use of a Yuzzumi spear, but was judged by his size rather than any real demonstration. These peers were later indirectly proven wrong when Lufba's skill with weaponry saved his life in the rancor pit of Jabba's Palace. He maintained a degree of loyalty to Snitkin and was even perceived as his henchman by others. Lufba had compassion for those who had suffered ordeals similar to his own and was happy in the company of other members of his species. Lufba had matted brown hair and yellow eyes. He wore no clothing other than a pair of forest boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Wam Lufba originated in Star Wars: Episode VI Return of the Jedi, as a background character seen fleetingly. Lufba was given identification and a backstory by Tim Veekhoven, writing as \"Sompeetalay,\" through the StarWars.com Hyperspace feature \"What's the Story?\""}, {"tag": "p", "text": "Veekhoven derived the name \"Wam\" from the British pop band Wham!, but had originally written the character's nickname as \"Blast\" instead of \"Blam,\" to which it was changed in the editorial process. Veekhoven, in his entry, made further connections to the ruggers from 2001's The Wildlife of Star Wars: A Field Guide, the Centrality from 1983's Lando Calrissian and the Mindharp of Sharu, and Czerka Arms from 1990's The Rebel Alliance Sourcebook, tying Lufba to a wide variety of elements from various sources in the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}