{"url": "Wan_Sandage/Legends", "categories": ["Category:Legends articles", "Category:Devlikk", "Category:Males", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "Wan Sandage"}, {"tag": "p", "text": "Wan Sandage, from the planet of Ord Radama, was a male Devlikk who was a Podracer pilot around the time of the Invasion of Naboo, and the father of Wan Sandage Junior. Racing with an Elsinore-Cordova Engineering TurboDyne 99-U Podracer, Sandage gained popularity on the planet of Ord Ibanna. Considered to be something of a playboy on his homeworld, Sandage had a following of female fans that watched his races with earnest, although due to his biological makeup he had a natural discombobulation that caused him to lose his sense of direction when off of Ord Radama. Sandage also held onto a rather one-sided rivalry with the Dug Podracer pilot Sebulba. Due to his species' naturally short lifespan, Sandage believed that in order to preserve his name into the record books he would need to overcome Sebulba in one major racing event. Willing to cheat to gain the upper-hand, Wan Sandage sought out the Glymphid assassin Aldar Beedo, who was a Podracer himself, to eliminate Sebulba during the upcoming Boonta Eve Classic of 32 BBY, in which Sandage would also participate."}, {"tag": "p", "text": "After paying two hefty sums of money to Beedo, the pair set out to eliminate the Dug. During the Boonta race, Beedo was unable to eliminate Sebulba, falling behind the Dug and finishing in third place. Sandage on the other hand never finished, crashing during the second lap after going off course and slamming into a Jawa sandcrawler. Sandage cobbled together what he could from his downed TurboDyne and rebuilt it for the Vinta Harvest Classic on the Gran held planet of Malastare. Beedo also accompanied Sandage again, and came close to shooting Sebulba down during the race with a blaster. The hit failed again, however. Wan Sandage eventually succumbed to senility and died during 29 BBY, prompting Aldar Beedo to drop his contract on Sebulba, instead opting to work for the Dug. Sandage's son carried on his father's legacy through 24 BBY. Wan Sandage Jr. proved his skill on numerous courses, but was commonly mistaken for the elder Wan Sandage."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wan Sandage, one of the few Podracers of his species, had been piloting since the age of two, using a Podracer fashioned on Ord Radama itself. On his homeworld, he attained great fame, but on other planets his sense of direction was distorted, rendering him constantly discombobulated."}, {"tag": "p", "text": "Upon meeting Sebulba, Sandage developed an intense, one-sided rivalry with the Dug racer, and became obsessed with defeating him before succumbing to senility at the age of nine. To this end, Sandage was prepared to resort to dubious tactics to ensure victory over the other pilot."}, {"tag": "p", "text": "Before the Boonta Eve Classic, Sandage enlisted the aid of the hitman Aldar Beedo to dispatch Sebulba midrace, leaving the path to victory open for Sandage. Beedo failed to eliminate Sebulba, though he managed to finish the race himself. However, during the third lap of the race, Sandage had lost control of his racer and crashed into a wayward sandcrawler after going off course. Sandage hired Beedo again, though, during the Vinta Harvest Classic race on Malastare, but again Beedo failed to eliminate Sebulba."}, {"tag": "p", "text": "Wan Sandage died during 29 BBY. His son, Wan Sandage Jr., continued to fly with Podracers. Ironically, Aldar Beedo ended up hiring himself out to Sebulba to work as an on-track bodyguard while replacing the Dug's former henchman, the Vulptereen Podracer Dud Bolt. This move gained Sebulba the rivalry of both Bolt and Sandage Jr."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rough draft and first draft of Star Wars contained a character named Count Sandage, a noble at the court of King Kayos on Aquilae. He counsels the king to yield to the Galactic Empire, and later betrays the royal family to Darth Vader. He was omitted from later drafts, but the name was later reused by George Lucas for the Podracer."}, {"tag": "p", "text": "Sandage's voice in Star Wars Episode I: Racer was provided by Bob Bergen. In pre-production of Star Wars: Episode I The Phantom Menace, Wan Sandage was originally the name of Neva Kee, and vice-versa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}