{"url": "Wallarand", "categories": ["Category:Legends articles", "Category:Balinaka culture", "Category:Holidays"], "nodes": [{"tag": "h1", "text": "Wallarand"}, {"tag": "p", "text": "The wallarand was a Balinaka holiday celebrated annually."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Balinaka celebrated the wallarand annually to express their artistic spirit as well as their continued struggle with the planet's nature. Every year, the site of the wallarand was selected by Galactic Crystal Creations, and then each community sent one artist to help carve the buildings and sculptures for the temporary city that would host the event. Work began with the arrival of Winter, as huge halls for meetings, temporary residences, and market place booths were carved out of the ice."}, {"tag": "p", "text": "As the time of the wallarand neared, all work on the planet ceased, as communities were allowed to begin preparations for the long trek to the city site. Every resident of Garnib, from Balinaka to immigrants, was expected to attend. Over the four days of the festival, friendships were renewed, deals were made, and romances blossomed. It was a time of constant festivals and parties."}, {"tag": "p", "text": "Each community also selected a spokesman to represent them to other communities and corporate officers. Fishing territories were redrawn, quotas for ice sculpture production were set, and any other differences or needs were discussed and debated with nearly all issues being resolved by the end of the wallarand. At the end of these meetings, every citizen was presented with a complete account of the financial status of Galactic Crystal Creations as they were also employees and stockholders. The citizens then selected new corporate officials and voted on what new projects and investments they felt the company should undertake."}, {"tag": "p", "text": "During the time that Garnib was controlled by the Galactic Empire, the wallarand was the most visible reminder of their status as Imperial subjects. Imperial troops were constantly seen patrolling the grounds of the wallarand, which was a source of tension, anxiety and resentment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}