{"url": "War_of_the_Bounty_Hunters_Alpha_1", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Articles with an excess of redlinks", "Category:Star Wars: War of the Bounty Hunters"], "nodes": [{"tag": "h1", "text": "War of the Bounty Hunters Alpha 1"}, {"tag": "p", "text": "War of the Bounty Hunters Alpha 1 is a canon one-shot and first issue of the crossover event Star Wars: War of the Bounty Hunters. It was written by Charles Soule, illustrated by Steve McNiven and Laura Martin, and first published by Marvel Comics on May 5, 2021. It features the prelude story \"Precious Cargo,\" in which Boba Fett takes on a job while delivering Han Solo to Jabba's Palace."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE STAR WARS COMIC EVENT YOU'VE BEEN WAITING FOR! The notorious bounty hunter BOBA FETT has finally landed his greatest prize – HAN SOLO, frozen in carbonite for easy transport. Fett will bring the smuggler to TATOOINE to collect the massive bounty placed on Solo's head by the fearsome crime lord JABBA THE HUTT. Sounds easy. What could go wrong?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Garkata Fighting Arena is depicted as having holographic displays surrounding its exterior, advertising the fighting matches. Many of these screens display characters and events taken from later in the issue, including Fett's fight with Wyrmen Lictor, his conversation with the Yarkora, and the death of Bigbot. Other holograms reuse art from Star Wars Legends sources, including images of a Nosaurian from The New Essential Guide to Alien Species and a Shistavanen from the Balance of the Force expansion of Star Wars: The Card Game."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}