{"url": "War_Sled", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic vehicles", "Category:Galactic Empire vehicles", "Category:Ground vehicles"], "nodes": [{"tag": "h1", "text": "War Sled"}, {"tag": "p", "text": "The War Sled was a large attack vehicle used by the Alliance to Restore the Republic and later, the Galactic Empire. The huge vehicle served as a mobile fortress for the Rebels on Akuria II, keeping them one step ahead of the Imperials as they performed hit and run attacks against their enemies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The War Sled was commanded by the Rebel Colonel Odan around the time of the Battle of Yavin. Odan and his crew of rebel soldiers were able to keep from being captured by the Imperials by remaining on the move, as the War Sled was able to move rapidly across the arctic tundra of the world, utilizing two large ski treads that kept it on top of the snow. Eventually, in an attempt to stop Odan and his forces, a group of snowtroopers was able to execute a sneak attack on the War Sled, causing a shootout to occur within the War Sled. The majority of the Rebel soldiers were either killed or captured, but Colonel Odan was able to escape, making his way to the Akuria Rebel Base, a hidden base being used by the Rebel sympathizing Akurians."}, {"tag": "p", "text": "Believing that Rebel soldiers would eventually come to try to contact Odan, the Imperials decided to use the War Sled as a ruse, placing an Imperial commander and crew within the sled, who would act as an impostor should the Rebels arrive. The plan was successful when the Rebel heroes, Luke Skywalker and Leia Organa arrived at Akuria II trying to contact Colonel Odan. After a staged attack against the Rebels, the impostor Odan \"rescued\" them and brought them aboard the War Sled. While they were on board, the Imperial commander tried to pry Rebel secrets out of them. However, Skywalker and Organa discovered the deception before they could reveal anything and tried to escape from the War Sled. The Imperials overpowered the two Rebels, and in a final effort to force at least one of them to talk, the Imperial commander strapped Skywalker into the cockpit and then fused the controls to send the War Sled and Skywalker into the Geyser Sea. The commander hoped that Organa would reveal the Rebellion's plan to save her friend."}, {"tag": "p", "text": "Luckily for Skywalker, the real Odan, alongside the Rebel droids C-3PO and R2-D2, rescued him from the War Sled before it plunged into the geyser sea. Using power skis that Odan had kept hidden within the War Sled, the Rebels were able to escape the doomed craft. Immediately after piloting their way off of the mobile fortress, the War Sled plunged into the geyser sea, destroying the vehicle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}