{"url": "Bera_Kazan", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems individuals", "Category:Females", "Category:Galactic Republic individuals", "Category:Humans", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Bera Kazan"}, {"tag": "p", "text": "Bera Kazan was a Human female smuggler and pilot of the Sarpazian Rose, a vessel marked with scratches and scorch marks from her various escapades. During the early stages of the Clone Wars, Kazan became a hired mercenary for the Confederacy of Independent Systems. Approximately one month after the first battle of the war, Kazan and the Chistori soldier Cydon Prax discovered the Force Harvester device on Raxus Prime. Shortly afterward, Count Dooku betrayed and imprisoned Kazan, intending to use her in an experiment that would test the lethal effects of the Force Harvester."}, {"tag": "p", "text": "Thus, Kazan was forced to join another prisoner—the Jedi Anakin Skywalker—in order to survive on the Separatist-occupied moon. Working together, Kazan and Skywalker successfully defended a Wookiee village against the Separatist Droid Army, with the battle ultimately won after the arrival of reinforcements from the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Prior to the outbreak of the Clone Wars in late 22 BBY, Bera Kazan was a criminal who engaged in illegal activities in order to gain credits. In addition to her occupation as a mercenary, Kazan also worked as a smuggler which she found to be a hazardous occupation, given the damage sustained to her personal starship—the Sarpazian Rose—after numerous close encounters with death."}, {"tag": "p", "text": "Bera Kazan joined the war on the side of the Separatists when Count Dooku hired her tracking services in order to locate the Force Harvester, an ancient power source that could be used to drain the life energies of all living beings within close proximity. Paired with a fellow mercenary named Cydon Prax, the two discovered the Harvester on the junk world of Raxus Prime. In the month that followed the first battle of the Clone Wars, the Separatists excavated the device, although their activities raised the suspicions of the Jedi High Council. A Republic task force, led by Jedi General Obi-Wan Kenobi and Jedi Commander Anakin Skywalker, was deployed to Raxus Prime where they engaged the Separatists' in battle. Skywalker pursued the fleeing Count, but was soon captured and transported to Alaris Prime, a moon located in the Alaris Expanse of the Kashyyyk system."}, {"tag": "p", "text": "At the same time, Bera Kazan had been betrayed and also imprisoned along with Skywalker and a group of Wookiee prisoners. After she informed Skywalker about the existence of the Force Harvester and Dooku's intention to test its power on them both, Kazan formed an alliance with the young Jedi Padawan in order to survive the Sith Lord's machinations. Moments after Cydon Prax activated the Harvester, Skywalker used his powers to break open the cage he shared with Kazan. At Kazan's insistence, he also freed the Wookiees from their cages. The two then stole a pair of STAPs and escaped the proximity of the life-draining energy wave that emanated from the Harvester. Along the way, they quickly warned a group of Wookiees to vacate their village in order to avoid the deadly effects of the Harvester."}, {"tag": "p", "text": "Having earned the gratitude of the local Wookiee population on Alaris Prime, Bera Kazan arranged for two maru beasts to serve as transport for her and Skywalker. Using stealth, they discreetly infiltrated a Separatist outpost where they stole an Armored Assault Tank, which they then used to infiltrate the enemy's base. After destroying several other tanks and dozens of battle droids, Skywalker used the Separatists' communications tower and contacted the Republic for military assistance. Afterward, Kazan and Skywalker withdrew to a Wookiee village where they prepared for a Separatist attack and the arrival of Republic reinforcements."}, {"tag": "p", "text": "When the Confederacy launched a ruthless assault on the village, Bera Kazan and Anakin Skywalker assisted a group of Wookiee warriors in the defense of their homes. They managed to repel several waves of droid attacks, preventing the Separatists from overwhelming their position, until a Republic Acclamator-class assault ship landed nearby and offloaded a contingent of clone troopers and several TX-130 Saber-class fighter tanks led by General Kenobi. Taking control of one of the tanks, Skywalker and his Jedi Master engaged the remaining enemy units while Kazan remained behind to secure the village with the Wookiees and clones. The destruction of the Harbinger, destroyed by Kenobi and Skywalker, signaled the Republic's victory as the remaining Separatists fully withdrew from Alaris Prime."}, {"tag": "p", "text": "Bera Kazan's assistance to Anakin Skywalker enabled the young Jedi to report his findings to the Jedi Council regarding the Force Harvester and its greater purpose as the power source of the Dark Reaper superweapon. The information proved critical in the Jedi's efforts to destroy Count Dooku's new weapon of mass destruction, leading to a preemptive strike on the planet Thule. As the Republic invasion culminated with a direct assault on the ancient Sith city of Kessiak, Skywalker confronted and destroyed the Dark Reaper, ending the crisis that began with the superweapon's reconstruction."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bera Kazan was a young female Human at the time of the Clone Wars. Despite her age, she proved to be a highly-skilled mercenary who possessed an array of talents, both as a smuggler and pilot. As a criminal outlaw, she initially had no reservations against her employment with the Confederacy and willingly aided an unlawful rebellion against the Galactic Republic. She was not personally committed to the Separatist cause, however. Her only inclination in serving Count Dooku was a desire for wealth in credits."}, {"tag": "p", "text": "Upon discovering that her usefulness to Dooku ended with the rediscovery of the Force Harvester, Kazan was bitter and resentful over the Count's betrayal despite the fact that she had honored her contract with the Separatists. She further incensed by the knowledge that her former employer intended to analyze the Harvester's power by using Kazan as a living test subject. As such, she was completely willing to switch her allegiance to the Republic and their Jedi protectors."}, {"tag": "p", "text": "Despite her criminal career, Kazan harbored a strong sense of compassion for life. During the activation of the Force Harvester, she refused to allow a group of Wookiees to die like animals in cages, beseeching Anakin Skywalker to free them. While traveling through the forest of Alaris Prime, she further displayed more concern for the Wookiees by asking Skywalker to activate a village's alarm system so that the inhabitants could flee the impending wave of the Harvester."}, {"tag": "p", "text": "As a pilot, Kazan was skilled in the use of a variety of vehicles, including tanks, STAPs and starships. She was also a capable beast rider as she demonstrated during her use of the maru as a transport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bera first appeared in the video game Star Wars: The Clone Wars and was voiced by Grey DeLisle, who also portrayed Senator Padmé Amidala in the same game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}