{"url": "Wandrella", "categories": ["Category:Legends articles", "Category:Creature stubs", "Category:Creatures of Mimban", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Worms"], "nodes": [{"tag": "h1", "text": "Wandrella"}, {"tag": "p", "text": "Wandrella were giant worms native to the plains and swamps of the planet Mimban, also known as Circarpous V, located in the Circarpous system. Mimban was a sparsely populated, largely unexplored world, allowing the Wandrella to have free roam over much of the planet. Notorious for their simple intelligence and rudimentary thinking, the Wandrella were omnivores with only basic tactics in hunting, demonstrated by their charging headlong after prey, flattening anything in their path."}, {"tag": "p", "text": "Wandrella had phosphorescent, cream-colored bodies with brown streaks, thick hides, plated underbellies, and could reach lengths of fifteen meters or more. Their heads consisted of dull eyes set in a large group of haphazardly-spaced spots similar to those of a spider, and powerful jaws surrounding a mouthful of jet-black teeth set in large concentric circles. Wandrella were slow to react to outside forces, possibly due to their nervous systems being too evenly distributed throughout their large mass to provide a vital center."}, {"tag": "p", "text": "One such creature came upon Luke Skywalker, Leia Organa, a Force-sensitive named Halla, and two Yuzzem during their search for the Kaiburr crystal, hidden in the Pomojema Temple, deep in the swamps of Mimban. The beast attacked and chewed their Swamp crawler to pieces, then perished when it tried to follow Luke and Leia down the Thrella well in which they hid, its tremendous weight causing part of the well to collapse, sending it falling into the seemingly bottomless pit below."}, {"tag": "p", "text": "A wandrella was also responsible for biting off the right side of Gargonn the Hutt's head on Circarpous V, but didn't prove to be lethal since Jedi Masters Mace Windu and Depa Billaba found him alive and well several years later on Nar Shaddaa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}