{"url": "Wanten", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Foot Patrol 7 members", "Category:Humans", "Category:Males", "Category:Officers of the First Order", "Category:Stormtrooper Commanders"], "nodes": [{"tag": "h1", "text": "Wanten"}, {"tag": "p", "text": "Wanten, designated TD-110 and DSS-0956, was a human male officer of the First Order and a former stormtrooper of the Galactic Empire. During the Galactic Civil War, TD-110 served on board the first Death Star in the days prior to the Battle of Yavin. He was also deployed to the Outer Rim world of Tatooine as a sandtrooper commander, attempting to reacquire the stolen Death Star plans from the rebel droids R2-D2 and C-3PO."}, {"tag": "p", "text": "Like other Imperial officers and soldiers, Wanten supported the First Order after the Galactic Empire surrendered to the New Republic and ultimately became a commander in its military forces. Stationed on Starkiller Base during the early days of the First Order/Resistance War, Wanten was killed by J-Squadron when the Resistance attacked the First Order superweapon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Wanten was born on Parsh around 20 to 13 BBY, where he was part of a clan that eked out a living on the harsh world. When the Galactic Empire arrived on the world, they put the clan to work in mines for them. At some point later, he became a stormtrooper in the Imperial Military and was designated \"TD-110\"."}, {"tag": "h3", "text": "Hunt for the rebel droids"}, {"tag": "p", "text": "In 0 BBY, he served as a sandtrooper commander, and led Foot Patrol 7 based in Mos Eisley on Tatooine following the secret mission to Tatooine. While on patrol in the city, he and his unit stopped and questioned an old man, a teenager, a protocol droid, and an astromech droid on a speeder eventually letting the group pass after TD-110 was unknowingly mind tricked into doing so. Foot Patrol 7 were later called to reinforce other units by Commander TD-4445 during a skirmish to prevent the Millennium Falcon from leaving one of the city's landing bays."}, {"tag": "h3", "text": "Serving aboard the Death Star"}, {"tag": "p", "text": "Wanten eventually traveled to the Death Star around the time Princess Leia Organa was rescued. Wanten had gained an awful headache as an aftereffect of the mind trick, which meant he had to give command of his troops to one of his subordinates. During his time on the Death Star, he realized that the droids he encountered in Mos Eisley were the droids the Empire had been looking for, as they contained the Death Star plans."}, {"tag": "p", "text": "On the way to Control Room 327 to control a skirmish there, he hit his head on the doorway and was briefly incapacitated, sparing him the death that met the other stormtroopers assigned there. Coming to, he noticed the droids that had eluded him and tried to shoot them in an attempt to redeem himself. However, he was stopped by a Moff who escorted him away for discipline. As a result of his mistakes, he was removed from his post on the Death Star. This allowed him to avoid its destruction in the Battle of Yavin that took the lives of his comrades. However, this left Wanten on Tatooine, who would later be disappointed about having missed the \"important\" battles, such as Endor and Jakku."}, {"tag": "h3", "text": "First Order service"}, {"tag": "p", "text": "Decades later, during the conflict between the First Order and the Resistance, Wanten served as a commander in the First Order military and was stationed on Vodran, where he hoped to eventually be promoted to the Bittelari Cluster. When the Resistance destroyed Starkiller Base, Wanten was rammed by a Griffin-class light shuttle by J-Squadron which killed him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human male, Wanten had a thick trunk, beady blue eyes, and a Corellian nose that made it difficult to wear a stormtrooper helmet comfortably. By 34 ABY, he was bald, and his once-athletic body had turned fat."}, {"tag": "p", "text": "Wanten was weak-willed, and therefore, easily susceptible to the influence of the Force. According to his subordinate Sardis Ramsin, he often said everything twice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wanten is a combination of multiple stormtrooper characters, and as such, multiple actors. The individual who played the mind-tricked sandtrooper on Tatooine was Anthony Forrest, who also portrayed the Legends character Laze Loneozner in a scene cut from the same film (A New Hope)."}, {"tag": "p", "text": "The head-bumping trooper was played by an uncredited actor in the 1977 film Star Wars: Episode IV A New Hope. While entering his scene, the actor playing the stormtrooper inadvertently bumped his head on a door frame. Wanten was later identified in the short stories \"Born in the Storm\" and \"Bump\" from the 2017 anthology book From a Certain Point of View as well as the novel Join the Resistance: Escape from Vodran, both of which were released on the same day."}, {"tag": "p", "text": "Laurie Goode once recalled bumping his head on set while playing a stormtrooper, leading many fans to believe that he may have portrayed the trooper. Michael Leader recalled a similar event, and when the actor died in 2016, at least one media obituary identified him as the actor."}, {"tag": "p", "text": "In the 2002 film Star Wars: Episode II Attack of the Clones, director George Lucas paid homage to the \"head-bumping stormtrooper\" bump scene by having Jango Fett bump his head on the door of the Slave I. In the 2004 DVD re-release of the Star Wars original trilogy, the scene was enhanced with a sound effect to draw more attention to it. In the DVD commentary of Attack of the Clones, Lucas suggested that Jango Fett's \"bumping-head trait\" was cloned into all the stormtroopers, implying that Wanten was a clone. However, this was contradicted by Wanten's backstory in From a Certain Point of View."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}