{"url": "War_on_Shu-Torun", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of Shu-Torun", "Category:Civil wars", "Category:Conflicts involving the Galactic Empire", "Category:Conflicts of the Mid Rim", "Category:Duels"], "nodes": [{"tag": "h1", "text": "War on Shu-Torun"}, {"tag": "p", "text": "The War on Shu-Torun was a civil war fought on the Mid Rim planet Shu-Torun in the year 0 ABY. Queen Trios, the recently appointed monarch of the Kingdom of Shu-Torun, faced an uprising among the ore-dukes of her homeworld. Trios' loyalist faction defeated the insurrectionists, led by Duke Rubix, with the military support of the Galactic Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the destruction of both Alderaan by the Galactic Empire and the Death Star by the Rebel Alliance, Sith Lord Darth Vader traveled to Shu-Torun. His mission was to reinforce their cooperation in supplying the Empire with ore. There, Vader was invited by Princess Trios, daughter of Shu-torun's king to a celebration. In truth, the king and his children planned to assassinate Vader."}, {"tag": "p", "text": "During the celebration, the King's guards attacked Vader but were cut down by the Sith Lord. Trios, claiming that the ore-dukes were behind, led Vader into a shaft. Lava came down from the shaft and Vader carried her. After surving, Trios attempted to shoot Vader, but lost her right hand. During this time, Vader sent two assassin droids, 0-0-0 and BT-1 to eliminate the King and his two other children, Prince Monthan and Princess Hollian. Vader gave Trios a small remnant of Alderaan and named her the new monarch of Shu-Torun."}, {"tag": "p", "text": "Following Vader's defeat of Commander Karbin at the battle of Vrogas Vas, Vader was sent by Emperor Palpatine to assist Grand General Cassio Tagge and Queen Trios in dealing with the ore-dukes rebellion."}, {"tag": "h2", "text": "The War"}, {"tag": "p", "text": "Trios and Vader lead stormtroopers against the ore-dukes' forces. The Emperor also had Dr. Cylo send Tulon Voidgazer to assist Vader and Trios. Voidgazer's drones were able to permanently disable the Delving citadel. Vader then met up with Cylo, Aiolin and Morit Astarte at the royal palace. There, they discussed continuing their attacks on other installations to deprive the ore-dukes of all their wealth and possessions. Trios, despite Vader's threats, reminded him that he must show her respect. Vader agreed on the condition that Trios would not question his decisions in public."}, {"tag": "p", "text": "Baron Rubix intercepted a transmission with Vader and Trios. Rubix assured himself that he could remind the queen that she was not safe at the Ancestral Retreat without his and the other Ore-dukes support. Rubix then took his Lava Leviathan and attacked the retreat. Despite Trios and her guards making their escape, Vader the Astarte twins attacked the Leviathan. Vader and the twins were able to board the ship and left it to sink into the lava. Trios, upon seeing the ore-dukes attack as sacrilege, decided to attack Rubix's delving citadel. Following the attack, Rubix spoke with the ore-dukes and told them they had a expect who could them win the war; Dr. Cylo. The doctor agreed to give them Vader."}, {"tag": "p", "text": "Vader, Trios, and Cylo then led the Shu-Torun Loyalist/Imperial Delving Fleet against Rubix's stronghold. Unfortunately Vader's ship veered offcourse and went into a lithoporoite stream. Vader, the the Astarte twins and their forces were then surrounded by Rubix's forces. Vader had 0-0-0 and BT-1 activate their droid commandos attack from above. During this time, Cylo told the queen they must call off the attack. However, Trios refused and decided to send her troops without the Empire's or her Chancellor Jooli's support."}, {"tag": "p", "text": "Vader tried to contact Trios but comms were jammed. Vader's stormtroopers and commando droids held off Rubix's troops. Trios, tired of Jooli doubting her ability to lead Shu-Torun, had her guards execute him. With Jooli dead, Trios ordered her troops to attack. Vader and the twins then went into a lava cavern, where they attacked him. 0-0-0 and BT-1 lead the commando droids against Rubix's troops. Vader fought the twins until Morit pushed Aiolin into the lava. Morit made his escape. Vader then pulled Aiolin out of the lava before she died. Aiolin gave Vader her memory circuits before dying. Vader discovered that Cylo was working with Rubix and rejoined 0-0-0 and their forces."}, {"tag": "p", "text": "Rubix's forces surrendered to Vader and 0-0-0's forces. Trios led her forces to Rubix's delving citadel. Despite being shot, Trios continued to lead her troops as the Empire arrived. Rubix, having lost contact with Cylo, spoke with his daughter Bixene about his men joining Vader. As Rubix and his daughter made their escape, they were confronted by Vader. Vader demanded his surrender. Rubix surrendered to and offered his citadel to Trios and recognized her as Queen. However, Trios, angry for the deaths of thousands of Rubix's hand, ordered his execution."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Trios then gave Bixen the title of Baroness and told her to order the remaining rebels to make peace. Trios assured that she would deal with the remaining Barons would be executed, but their lines would continue. Vader left Shu-Torun, but left behind a stormtrooper captain to act as Trios' advisor. Cylo and his abominations fled. They would attempt to hijack a new Super Star Destroyer, the Executor, but were dealt with by Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}