{"url": "Wargo", "categories": ["Category:Legends articles", "Category:Black Vulkars", "Category:Drovians", "Category:Males", "Category:Mandalorian Neo-Crusaders"], "nodes": [{"tag": "h1", "text": "Wargo"}, {"tag": "p", "text": "Wargo was a Drovian member of the notorious Tarisian swoop gang known as the Black Vulkars who later joined the rampaging Mandalorian Neo-Crusader army in the early stages of the Mandalorian Wars. Rarely seen without his close Zabrak friend Frazznik, the powerful and brutish Wargo worked for the Vulkar lieutenant Benno. In 3964 BBY, Wargo and Frazznik encountered the wanted fugitives Zayne Carrick and Marn Hierogryph, but instead of turning them in for a hefty bounty, they were convinced by Hierogryph to shake down a group of nearby Wookiees—and sustained a beating that cost Wargo several teeth. When the Mandalorians besieged Taris not long afterward, Wargo and Frazznik abandoned the Black Vulkars and joined the invading force, eventually being sent to a staging point on the planet Jebble in preparation for a raid on the Core World Alderaan. Wargo was caught on Jebble when the influence of the ancient Sith artifact known as the Muur Talisman turned thousands into mutated rakghoul beasts—although he fought against the monsters, Wargo eventually perished on Jebble."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Drovian male, Wargo lived in the Lower City of the Outer Rim planet Taris as of 3964 BBY, where he was an active member of the notorious swoop gang known as the Black Vulkars under the the Vulkar lieutenant Benno. That year, four Padawans at the Taris Jedi Tower were massacred. Surviving Padawan Zayne Carrick and local criminal Marn Hierogryph were blamed for the crime, and had extremely large bounties placed upon their heads. Wargo and his Zabrak friend Frazznik, also a Black Vulkar, were among the first two people to encounter Carrick and Hieorgryph as they attempted to flee pursuit from law enforcement and the Jedi Order—recognizing the two from news holos, Wargo and Frazznik attempted to accost them and steal the bounty. However, Hierogryph, who was securely in Wargo's grip, correctly surmised that Wargo and Frazznik were two of Benno's boys, and managed to convince them to let them go out of fear that they would feel Benno's wrath if they tried to collect on the bounty and got him involved in Upper City justice. In exchange, Hierogryph gave them a tip: that a group of Wookiees operating a nearby trash cart had secretly sewn stashes of spice into their pack animal's harness."}, {"tag": "p", "text": "The tip was actually a lie made up by Hierogryph on the spot, but it convinced Wargo and Frazznik to attempt to steal the Wookiees' cart and take the spice for themselves, a score they hoped would make their kick for the entire year. The would-be robbery went poorly, and one of the Wookiees knocked out four of Wargo's teeth. Soon afterward, the Mandalorian Neo-Crusaders—in one of the major early strikes of their war for galactic supremacy with the Republic—attacked and besieged Taris. While many of the swoop gangs attempted to battle the invaders, Wargo and Frazznik decided instead to join the rampaging horde, as Wargo was attracted by the potential to wreak havoc upon the galaxy. Wargo, Frazznik and a number of other Outer Rim criminals and malcontents who had elected to sign up with the Mandalorians were sent to a staging point on the ice planet Jebble, where they were meant to prepare for an eventual Mandalorian raid on Alderaan."}, {"tag": "p", "text": "Wargo and Frazznik soon found themselves joined by a pair of familiar faces: Carrick and Hierogryph, who had found themselves on Jebble after stowing away on the Mandalorian shuttle Mar'eyce, which had been on Taris for a successful expedition to find the ancient Sith artifact known as the Muur Talisman. Still vengeful for his thrashing at the hands of the Wookiees months earlier, Wargo attempted to assault Hierogryph, but was instead smashed in the face with the butt of a blaster rifle by a Mandalorian Rally Master who was attempting to keep order among the unruly hordes of new recruits. The blow cost Wargo several more teeth—soon afterward, the same Rally Master gave a speech to the assembled recruits that they would be attacking Alderaan, to Wargo's disbelief. However, the planned attack on Alderaan never came to pass, as the Muur Talisman's dark influence transmitted the rakghoul plague to many Mandalorians on Jebble, turning them into rampaging rakghoul beasts. Already familiar with the rakghouls because of their notorious presence in the Undercity of Taris, Wargo rallied a number of survivors to battle the rakghouls, including killing his Rally Master after he was bitten. Despite Wargo's resistance, the rakghouls swept through the Mandalorian ranks and transmitted the plague to everyone they touched, before all remaining life on the planet was exterminated by a salvo of nuclear bombs dropped by chief Mandalorian strategist Cassus Fett."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Almost always found at the side of his friend and companion Frazznik, Wargo loved nothing more than plunder and chaos, and was the muscle of the pair. Although Wargo lived on Taris and was an active member of the Black Vulkar gang, Wargo chose to join the invading Mandalorian army instead of fight against them like many swoop gangs did during their siege of Taris. However, Wargo was more interested in being part of a rampaging horde than actually following the rules and customs of the Mandalorian people, and was dismayed after learning that he would have to wear a uniform and respect ranks as a Mandalorian warrior. Wargo held a violent grudge against Marn Hierogryph after his trickery cost him a beating from several Wookiees, and had to be stopped by his Mandalorian Rally Master from attacking the Snivvian after encountering him on Jebble. A Drovian, Wargo had tan skin, yellow eyes and a tuft of brown hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wargo first appeared in Knights of the Old Republic 3, the third installment of the Star Wars: Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2006. Wargo later appeared in two issues in the 2008 story arc Star Wars: Knights of the Old Republic: Vector. In his comic appearances, Wargo was illustrated by Brian Ching and Scott Hepburn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}