{"url": "Warlord_of_the_Empire", "categories": ["Category:Legends articles", "Category:Galactic Empire ranks", "Category:Imperial awards", "Category:Imperial warlords"], "nodes": [{"tag": "h1", "text": "Warlord of the Empire"}, {"tag": "p", "text": "The title of Warlord of the Empire was a ceremonial title appointed by Emperor Palpatine to a select few Imperial military officers, primarily Grand Admirals, Grand Generals, and Grand Moffs, although the rank itself was technically higher than these ranks. Similar to the starfighter titles of Tan and Baron of the Empire, Warlord was only recognized by the most skilled and loyal soldiers of the Empire. The title was presented specifically to those Imperial officers who had a particular expressed interest in both ruthlessness and creativity, and were considered to not only repeatedly redefine the impossible, but to do so with inimitable panache. Unlike other standard military ranks, Warlords of the Empire did not have an assigned code cylinder or rank plaque, as it transcended distinctions among the various branches of the Imperial Military, and as such commanded universal respect. The rank was speculated to have been made in homage to the selfsame appellation accorded to those with the rank of generalissimi from the Atrisian Empire. Prior to the Empire's sound defeat at Endor, it was considered one of the highest honors the Empire could supply to its forces."}, {"tag": "p", "text": "Zsinj was the first officer to be awarded the rank, with Pashna Starkiller and Thrawn also receiving it."}, {"tag": "p", "text": "After the events of the Battle of Endor in 4 ABY and the disintegration of the Empire as a result of the Emperor's death, the term ended up being shortened to Warlord and being used as a very loose term for various soldiers with nonexistent integrity, due to the term being hijacked by various power-hungry officers in the leaderless vacuum. These false Warlords included small fish such as Inos Fonada and Walang Grazz; second-tier replacements such as Bliss Shargael and Jmanuel Tethys; megalomaniacs such as Admiral Blitzer Harrsk; ultranationalists such as Supreme Commander Ennix Devian; and superlative sadists such as Delak Krennel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}