{"url": "Warren_Sedoru", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Members of the Jedi strike team", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Warren Sedoru"}, {"tag": "p", "text": "Warren Sedoru was a male Human Jedi Padawan who lived during the Great Galactic War, the Cold War and the Galactic War against the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male born several decades before 3681 BBY, the Force-sensitive Warren Sedoru was trained as a Jedi and quickly became one of the most acclaimed Jedi Knights in the Jedi Order. When the resurgent Sith Empire reclaimed their holy world in the Battle of Korriban and began the Great Galactic War with the Galactic Republic, Sedoru was one of the first Jedi to lead counterattacks against Imperial forces. He scored several early victories against the Sith, fighting in dozens of battles across the galaxy on worlds such as Yavin 4 and Alderaan, but was critically injured during many of these conflicts."}, {"tag": "p", "text": "While he survived without cybernetics or prosthetics, Sedoru's connection to the Force began to diminish, and when the Treaty of Coruscant ended the war in 3653 BBY he became dedicated to peace. Giving up the rank of Jedi Knight, he became a Padawan to the Kel Dor Jedi Master Tol Braga."}, {"tag": "p", "text": "In the early days of the Galactic War, Sedoru was approached by his former Master for a new mission: the capture and redemption of the Sith Emperor himself. Braga also recruited the Hero of Tython, the Jedi Knight responsible for ending the Desolator crisis and the defeat of Darth Angral, and the Hero's former apprentice Kira Carsen to join the strike team he was forming."}, {"tag": "p", "text": "Sedoru was sent to Balmorra to obtain a cloaking device, possibly created by the Gree or the Rakata, the same technology used to hide the Emperor's fortress. But the device was located in the Balmorran Arms Factory, now an Imperial stronghold, so they'd require the aid of the local resistance. Eventually, the Hero was able to obtain the cloaking device, albeit forced to trade the Empire's data on cloaked weapons to a few hostile resistance fighters for it."}, {"tag": "p", "text": "Eventually, Braga's team was assembled on Tython to begin their mission. However, the Jedi Council asked to speak with them, explaining that their former team member, Jomar Chul, just had a vision of the Hero falling to the dark side. Though Chul and Jaric Kaedan believed the mission to be too risky to allow the Hero to accompany them, Grand Master Satele Shan and Master Bela Kiwiiks expressed confidence in the Hero's loyalty."}, {"tag": "p", "text": "The strike departed for Dromund Kaas and infiltrated the Emperor's fortress. But upon confronting the Emperor, he used his dark powers to convert the entire strike team to the dark side."}, {"tag": "p", "text": "Warren would later attack and board the Republic flagship Valiant along with a large number of Sith in an attempt to kill Admiral Dabrin on board after receiving the Republic codes. The Jedi Knight was able to confront Warren, and tried to convince to break away from the Emperor's power. Warren denied the Knight, and engaged the Jedi in a lightsaber duel. The Knight gained the upper hand. Badly injured from the fight, Warren tried to rise to his feet, but the Knight knocked him out. Dabrin then argued that Warren must be executed for fear of military secrets being leaked to the Empire but the Knight insisted he could be redeemed and told the Admiral to keep him imprisoned until the Jedi arrive to retrieve him. Warren mocked the Hero for their compassion before Dabrin knocked him out and stated that he will keep the fallen Jedi sedated as a precaution. Warren was sent back to Tython to be healed and redeemed."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Warren was among the strongest and most resolute Jedi of his time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Warren Sedoru was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts on December 20, 2011. He first appears in the Jedi Knight class story mission \"Lives in the Balance,\" and features heavily throughout the Act II storyline on Balmorra."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}