{"url": "Berchest/Legends", "categories": ["Category:Legends articles", "Category:Anthos sector", "Category:Berchest locations", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Inner Rim planets", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Berchest"}, {"tag": "p", "text": "Berchest was a major tourist destination, and later a trading planet, in the Anthos sector of the Inner Rim. It was an extremely beautiful world whose highly saline seas and strong tides result in immense crystal deposits on the planet's shores that the native Berchestians sculpted into entire cities. One of these cities was Calius saj Leeloo, or the City of Glowing Crystal. It was carved entirely from one massive crystal that was created over the centuries from salt deposits from the adjacent Leefari Sea and was considered one of the Twenty Wonders of the Galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet suffered a major groundquake in  22 BBY. It was liberated from the Confederacy of Independent Systems by Freedom's Sons in 21 BBY. Though the Clone Wars and Galactic Civil War cut into the planet's tourism, the planet was able to leverage its position on several important trade routes and turn itself into an important trade nexus. During the Thrawn campaign, Berchest was well behind Imperial lines, and Grand Admiral Thrawn used the world as a red herring for the New Republic's attempt to follow deployment of his new clone forces. It was ruled by Governor Raccyx Staffa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Berchest in the Fakir sector of the Core Worlds. The Fakir sector is actually located in the Inner Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}