{"url": "Warto", "categories": ["Category:Legends articles", "Category:Adubans", "Category:Boltrunians", "Category:Criminals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Warto"}, {"tag": "p", "text": "Warto was a male Boltrunian who served the Cloud-Riders under the leadership of Serji-X Arrogantus. Originally a laborer on a Corellian freighter, his behavior and temper addled his crewmembers. In turn, he was abandoned by his crew on Aduba-3, where he was forced to eke out a new existence lifting crates and strong-boxes at the local starport, while also mugging several of the weaker locals. He came to spend most of his free time at Locru's Central Saloon, consuming large amounts of strong nikta."}, {"tag": "p", "text": "One evening, Warto wrongfully convinced himself that the Wroonian Azoora was in fact his girlfriend, and was enraged when he saw a Corellian pilot, Han Solo, attempting to woo her. A brawl broke out, and Warto was subdued by Solo's first mate, the hulking Wookiee, Chewbacca. Scorned, Warto later sought to join a posse being formulated in Tun Aduban in order to earn enough money to buy his way offworld, but his enrollment was prevented by the aggravated Lepi, Jaxxon. When Warto learned that the posse was being assembled by Solo, he aligned himself with Serji-X Arrogantus and the Cloud-Riders, who had been terrorizing a local village. The Boltrunian tipped Arrogantus off to the formation of Solo's posse, and later joined the Cloud-Riders in raiding the village of Onacra. During the battle with Solo's posse, Warto was pulverized to death by Chewbacca."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A Boltrunian scorned"}, {"tag": "p", "text": "Warto was a green-skinned Boltrunian, who found work as a laborer on a Corellian freighter during the Imperial Period. His foul temper earned him no friends, and his fellow crewmen decided to abandon him on the remote world of Aduba-3. As a result, Warto developed a grudge against all Corellians. He managed to make a rather meager living preying on weaker individuals, mugging them. He also found work as a spaceport crater-buster, where he hauled strong-boxes for those who were unable to hire the services of a binary load lifter."}, {"tag": "p", "text": "Warto came to spend most of his time at Locru's Central Saloon in Tun Aduban, as he had a particular liking for strong nikta. One evening in 0 ABY, Warto convinced himself that the alluring and flirtatious Wroonian, Azoora, was actually his girlfriend. He was enraged when a Corellian smuggler, Han Solo, appeared to be seducing her, and grabbed him. Warto threatened the Corellian, warning him not to go near Azoora again. Solo played the innocent, and warned the Boltrunian to depart before his Wookiee co-pilot, Chewbacca, arrived. Warto scoffed at the threat, and Solo responded by smashing a chair against the Boltrunian's face. Enraged, Warto picked up the Corellian, and hurled him across the bar. A brawl broke out, before Chewbacca arrived. Undeterred, Warto struck the Wookiee several times, but Chewbacca appeared to be unaffected by the strikes. Warto was subsequently hurled through a plate-glass window."}, {"tag": "h3", "text": "Star-Hoppers and Cloud-Riders"}, {"tag": "p", "text": "When word spread around town that a posse was being formulated for an unspecified reason, Warto attempted to sign up. He saw it as an opportunity to finally get off Aduba-3 by raising enough credits to buy passage offworld. The man organizing the posse was interviewing candidates at Locru's inn, and a queue had formed. As the Lepi spacer Jaxxon prepared to enter the interview, Warto cut in front of him. The Lepi protested, and Warto responded by striking him. Incensed, Jaxxon sent the Boltrunian reeling with a punitive kick, preventing him from joining the posse. Warto later discovered that the posse was being assembled by Solo himself, in order to defend innocent farmers of Onacra village being terrorized by Serji-X Arrogantus and his Cloud-Riders."}, {"tag": "p", "text": "Warto elected to join Arrogantus instead, alerting him to Solo's activities. Arrogantus was impressed with the Boltrunian's strength and rage, and granted him the use of a skyspeeder that formerly belonged to someone who had fallen prey to a high-hound. Warto informed Arrogantus about Solo's actions, and the Cloud-Riders rode back to Tun Aduban, where they met the newly assembled posse, the Star-Hoppers of Aduba-3. When Solo noticed that Warto had joined the Cloud-Riders, the Boltrunian goaded him, but Arrogantus ordered Warto not to fire until word was given. Arrogantus and Solo bandied words before the Cloud-Riders rode off, in preparation for their fresh attack against Onacra."}, {"tag": "p", "text": "Warto later joined Arrogantus in an attack on Onacra. Noticing that the Star-Hoppers had not heeded Arrogantus' earlier warning, Warto resolved to give the defenders no quarter. However, his skyspeeder was grabbed by the telescoping arms of one defender, FE-9Q, and was brought to a halt. Warto was dismounted by Chewbacca, who then killed the Boltrunian with his bare hands. Warto was later profiled by historian Voren Na'al, who later added the details of his biography to the Alliance to Restore the Republic database, Mistress Mnemos."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Warto possessed a particularly short temper, and was not overly intelligent. His demeanor was enough to inspire his fellow crewmen to abandon him on the desolate world of Aduba-3. In order to eke out an existence, Warto elected to prey on those that did not possess his level of strength. The Boltrunian was also a drinker, and was able to convince himself that Azoora was his girlfriend—so complete was his self-deception that he became highly aggressive when a smuggler, and a Corellian no less, approached her. Warto was also impatient, cutting through the queue to enlist in Solo's posse."}, {"tag": "p", "text": "His chief desire was to get off Aduba-3, and ultimately that drove most of his actions. He was driven by vengeance, which was ultimately what led Serji-X Arrogantus to hire his services. The Boltrunian came to hate Solo and was more than willing to gun the Corellian down, but was forced to obey his new master instead. Warto also held a sense of derision for the Lepi, Jaxxon, labeling him a \"rodent\" and evoking a great deal of aggression from the spacer. Although he found Solo to be a fairly unchallenging physical combatant, Warto was outmatched by the Wookiee Chewbacca, whose strength the Boltrunian had originally dismissed with derision. Amongst Warto's skills was the ability to speak, read, and write Basic. He also wielded a blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Warto was created by Roy Thomas, Howard Chaykin and Tom Palmer for Star Wars 8 (1978). The character was killed off in the next issue, Star Wars 9 (1978). He later received a write-up in The Starhoppers of Aduba-3, published in Star Wars Gamer 4 (2001)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}