{"url": "Watcher_Three_(Galactic_War)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Cleanup", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Watchers"], "nodes": [{"tag": "h1", "text": "Watcher Three  (Galactic War)"}, {"tag": "p", "text": "Watcher Three was the call sign of a Human male Imperial Intelligence officer during the Cold War. Before joining the Intelligence, he managed HoloNet security for the Ministry of Logistics. Watcher Three maintained contact with Intelligence agent Ula Vii, who served under Supreme Commander Stantorrs in the Galactic Republic. In 3642 BBY, Watcher Three contacted the Imperial agent Cipher 9, warning the agent that the search for Darth Jadus had been put on hold by the Imperial Intelligence as the start of the Galactic War had taken priority over the search, and recalling the agent back to Headquarters to be briefed by Keeper."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3643 BBY, an Imperial agent was recalled to Dromund Kaas after a successful mission on Nal Hutta to deal with a rising terrorist movement. After the agent met with Keeper and Darth Jadus, Watcher Three struck up a conversation with the agent and explained the hierarchy of Intelligence. The agent soon went on to thwart the terrorists' attempts to cause a blackout in Kaas City, shortly before the terrorist leader, codenamed \"The Eagle\" destroyed the Dominator, Jadus' flagship, with the Dark Lord on board. The agent was then promoted to Cipher Nine to hunt down and dismantle the Eagle's network."}, {"tag": "p", "text": "Eventually, after Nine had eliminated the Eagle, Watcher Three rendezvoused with the agent on Nal Hutta, to analyze the Eradicator super weapon the terrorists had developed."}, {"tag": "p", "text": "In 3642 BBY, following Eradication Day, Watcher Three recalls Nine from shore leave to Dromund Kaas at the orders of the new Keeper, formerly Watcher Two."}, {"tag": "p", "text": "Some after Nine went to infiltrate Ardun Kothe's SIS team, the agent returned to the home world, claiming to be on official business. Unbeknownst to Watcher Three, Nine was infiltrating Intelligence archives for information on the Castellan restraints that was used to brainwash them, faking a power outage to hide their activity. When Nine emerged from the archives, Watcher Three insisted that the agent remain for questioning due to be un-monitored but Nine threatened him to remain silent."}, {"tag": "p", "text": "Around 3641 BBY, as war between the Republic and Empire taxed Intelligence's new genetically Watchers to their limits, Watcher Three saw Nine off before the Cipher Agent departed to investigate the Star Cabal, first by introducing Watcher Seven."}, {"tag": "p", "text": "By the time Nine arrives at Belsavis, Watcher Three shared a holo-conference with Keeper to relay what information they could find to the agent. Suspecting that the conspirators built Megasecurity Ward 23 to hide something important, Nine was assigned to go undercover as an escaped convict and enlist four talented inmates to breach the door to Belsavis. Nine later contacted Watcher Three after obtaining the services of SCORPIO, the former protector of Megasecurity Ward 23, who passed on what information she had on the Star Cabal, which included visitor records and technology inventories. Then suddenly, their transmission is interrupted as Pashon Cortess attacks Nine's ship in a brazen attempt to avenge his family. After Cortess was dealt with and communications were re-established, Watcher Three warned Cipher Nine that the conspirators know the agent's identity and will most likely send anyone who has an axe to grind with them. He then deferred briefing to Keeper, who assigned Nine to investigate the Tytun Rings for conspirator communications."}, {"tag": "p", "text": "Nine later returned to Dromund Kaas so the Watchers could compile a holo-recording of Hunter meeting with unidentified conspirators, discussing a grand, yet risky, plan. Unbeknownst to them, the recording contained a trap that would overwhelm a genetically enhanced mind, rendering Keeper and the other enhanced Watchers comatose, thus crippling Intelligence's operations. Watcher Three was then left the task of managing dozens of field agents lacking handlers, as well as solely assisting Cipher Nine. He sent the agent to Voss to follow up on a lead Keeper was investigating."}, {"tag": "p", "text": "After Nine had managed to obtain new information on the Star Cabal, Watcher Three recalled the agent back to HQ on orders of the Sith. When Nine arrived, Watcher Three was in the process of being Force choke by Lord Razer and was released when the Sith took notice of the agent. Razer declares that due to Intelligence wasting time chasing conspiracies and being unable to provide for the war effort, the Dark Council was dismantling the organization and its operatives being reassigned to military units and Sith Lords. After Razer had arrested Kaliyo Djannis and left, Watcher Three apologized to Nine to failing to prevent this disaster."}, {"tag": "h2", "text": "Appearances"}]}