{"url": "Watcher_Izax", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Eternal Empire individuals", "Category:Individuals of unspecified species", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Watcher Izax"}, {"tag": "p", "text": "Watcher Izax was the code name of a male sleeper agent of the Eternal Empire who was sent to the Core Worlds as a spy. Though considered strong and loyal by his compatriots, he abandoned the Eternal Empire during his mission, and his story served as a warning to Zakuulans about the allure of the Core Worlds."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Many years before 3630 BBY, the Eternal Empire spied on the outlands, a Zakuulan term for the Core Worlds, using a network of sleeper agents. The most successful of the agents was a male individual codenamed Watcher Izax. He shared his code name with the god Izax, the chief deity of the original Zakuulan pantheon before Emperor Valkorion claimed to have toppled them. The agent's career ended, however, when he abandoned the Eternal Empire for the outlands."}, {"tag": "p", "text": "In the year 3630 BBY, at the Palace of the Eternal Dragon on the Imperial capital world of Zakuul, the Grand Festival of Empress Vaylin was held in celebration of Empress Vaylin's war against the Alliance that opposed her. During the heavily-guarded festival, Watcher Izax's story was told by Captain Frem of the Knights of Zakuul to a group of other knights as a cautionary tale regarding the temptations of the outlands. Among the knights was an initiate named Alus, who opined that Watcher Izax was a fool who got homesick before being rebuffed by Frem, who said that the spy was stronger than Alus would ever be."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Watcher Izax was considered a loyal person by his people until he cut ties with the Eternal Empire. Although he betrayed the Empire, Zakuulans like Frem faulted the irresistible draw of the Core Worlds more than Watcher Izax's personality itself."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "The Eternal Empire considered Watcher Izax a strong person, capable of being an effective spy. After being sent to the Core Worlds, he achieved more success compared to his peers in the same role."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Watcher Izax was introduced via mention in BioWare's 2016 expansion Knights of the Eternal Throne to its 2011 massively multiplayer online role-playing game, Star Wars: The Old Republic. During the mission \"Chapter VI: The Dragon's Maw,\" Izax is mentioned in ambient conversation on the world of Zakuul."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}