{"url": "Wat_Tambor/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Accuracy disputes", "Category:Business owners and executives", "Category:Galactic Republic senators", "Category:Males", "Category:Separatist leadership", "Category:Skakoans", "Category:Techno Union members"], "nodes": [{"tag": "h1", "text": "Wat Tambor"}, {"tag": "p", "text": "Wat Tambor was a Skakoan male from the planet Skako. He was the Foreman of the Techno Union and Executive of Baktoid Armor Workshop, and also held the title of \"Emir.\" Beginning his career as the Techno Union Representative in the Galactic Senate, Tambor shot up through the ranks of the Union, quickly becoming Foreman. He agreed to help fund and supply Count Dooku's separatist government, the Confederacy of Independent Systems, and when war broke out between the Separatists and the Galactic Republic, Tambor began devising new ways to gain a technological advantage."}, {"tag": "p", "text": "In effort of multiple plots, including invading the planet Ryloth, and manufacturing C-B3 cortosis battle droids, Tambor was able to make a concerted contribution to the war effort. In the waning stages of the war, Tambor set up shop on Xagobah, where he was assailed by both Republic forces and bounty hunters. He was rescued by the Confederate General Grievous, and united with the Separatist Council. In 19 BBY, he was called back to his homeworld of Skako, where he was sent on a spiritual journey by the Elders of the Power Mounds. During his journey, he saw his future, and eventually went to the planet Mustafar to meet it. There, he was slain by Darth Vader, along with the other members of the Council, concurrent with the declaration of the New Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on Skako into the Crimlin clan, Tambor spent little time on his homeworld as a youth, as he traveled to Metalorn to pursue a career in industry and technology. Tambor was a rarity, as most Skakoans never left their homeworld. Metalorn's atmosphere was inhospitable to Skakoans, and as a result Tambor was forced to develop a full-body suit that mimicked the atmosphere of Skako. He would also spend considerable time at his private estate on Foundry. While on Metalorn, Tambor became a superb combat engineer. At some stage, he ascended to the position of Representative of the Techno Union in the Galactic Senate, with the aid of Hego Damask. Tambor returned the favor by allowing him to use Hypori as a training ground and supplied training guards for both the Sun Guards Plagueis employed and his new apprentice."}, {"tag": "p", "text": "Following the Incident at Dorvalla in 33 BBY, Supreme Chancellor Finis Valorum proposed that the Republic instigate the taxation of trade routes. Tambor, knowing that this would damage the Union, was not in favor of the motion, and was in luck when Senator Palpatine of Naboo proposed that the matter be resolved at a Trade Summit on Eriadu. However, things went awry at the summit, with several influential figures in the Trade Federation being assassinated. The taxation bill went on to be passed in the Senate."}, {"tag": "h3", "text": "Techno Union Foreman and Executive of Baktoid"}, {"tag": "p", "text": "Over the next decade, Tambor ascended to the role of Techno Union Foreman, and also became the Executive of Baktoid Armor Workshop. As Techno Union Foreman, Tambor was also charged with overseeing Haor Chall Engineering, and supervising Republic Sienar Systems and Kuat Systems Engineering development labs. Tambor was the most well known associate of the Federation's leader and Viceroy Nute Gunray. In 32 BBY, Baktoid saw a setback when their biggest customer, the Trade Federation, used its droids to invade the peaceful planet Naboo. When Republic officials learned this, they went about partially disarming the Federation, which also cut Baktoid's legs out from under them."}, {"tag": "p", "text": "Tambor, however, followed his partner Viceroy Gunray of the Trade Federation in joining Count Dooku's new Confederacy of Independent Systems. Dooku needed an army with which to decimate the Republic, and Tambor was able to oblige. However, the possible consequences of building an army in plain sight of the Republic would be risky, and so Tambor closed an array of Inner Rim Baktoid factories, citing revenue losses, and began producing weaponry and droids in secret Outer Rim factories, most notably on Geonosis. Tambor was able to satiate disgruntled shareholders with press releases, but his ploy did not fool everyone. Senator Lanus Wrede correctly hypothesized that Tambor was building droids in secret, but his opinions were dismissed by the media, due to the fact that there was supposedly no market in the Outer Rim. Republic investigations into the allegation also yielded no results, and shortly after, Wrede \"committed suicide\", although the accuracy of his claims pointed to foul play on the part of Tambor."}, {"tag": "p", "text": "When Senator Rodd of the Tapani sector, the Hutt Groodo, and the designer Hurlo Holowan conspired to destroy Fondor with the Sun Runner, an ancient ship imbued with the strength of power gems, Tambor had a bounty placed on their heads, seeking vengeance against those who would endanger his investments in the Fondor system. He offered the bounty, requesting that the quarry be delivered dead, to Cradossk of the Bounty Hunters' Guild, who accepted. Unbeknownst to Tambor, Dooku had also placed a bounty on the trio, with the intent of bringing them in alive, since he was impressed with the concept of their Sun Runner scheme and the ingenuity, ambition, talent, and secrecy they demonstrated. The Foreman was contacted by the Count, and Dooku convinced the Skakoan to call off the debt. Rodd, Groodo, and Holowan were all eventually brought in by the bounty hunter Jango Fett."}, {"tag": "p", "text": "In spite of his involvement with the Confederacy, Tambor still kept his hand in Republic politics, and made a token appearance at a Refugee Relief Movement fundraiser on Alsakan. Tambor could not actually consume the foods served there, but felt the need to be seen as sympathetic to the disenfranchised of the galaxy. Other secret members of the CIS in attendance were Passel Argente and Nute Gunray, as well as now-Supreme Chancellor Palpatine. The latter was in fact Darth Sidious, Dooku's master, though Tambor was not aware of this. Realizing that Dooku would reveal the Confederacy to the galaxy in the near future, Tambor reinforced the Union factory at Foerost with a security force of forty thousand battle droids, since the installation would be vulnerable in the Deep Core. In exchange for the seemingly copious amounts of battle droids, Tambor allowed government officials to continue their regular inspections of the facilities."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Tambor met with the other leaders of the Separatist Council on Geonosis to re-pledge their allegiance to Dooku. While there, Jedi Knight Obi-Wan Kenobi was caught sneaking around the Baktoid factories, and soon after, Senator Padmé Amidala and Jedi Padawan Anakin Skywalker were caught in the same act. The trio were sentenced to death, but were rescued by a team of Jedi led by Master Mace Windu. The Jedi were soon followed by a large Republic army, the size of which the Separatists had never predicted. After a long and bloody battle, the CIS was routed. Tambor was able to escape, but Baktoid had now lost one of its key secret factories."}, {"tag": "h4", "text": "Cortosis battle droid plot"}, {"tag": "p", "text": "Tambor sought new ways to gain an advantage against the Republic in his new role as Confederate combat engineer, and as a result, his Techno Union engineers on Metalorn devised the C-B3 cortosis battle droid, a modified version of the B2 super battle droid that was resistant to lightsaber attacks. Tambor obtained the required cortosis from crime lord Jabba Desilijic Tiure, and the droids made their combat debut on the capital of the Republic, led by none other than Count Dooku. Though Dooku was able to retrieve an ancient Sith artifact from the Jedi Temple, the droids were driven off by Anakin Skywalker and Republic officer Rom Mohc."}, {"tag": "p", "text": "When Tambor learned that the Jedi High Council was planning to send Skywalker to destroy the C-B3 factory on Metalorn, he began to fear for both his own life and the life of his project. He hired the bounty hunter Vandalor as his personal bodyguard, but his forces were unable to stop Skywalker's sabotage mission; Vandalor was killed by Skywalker and Tambor was arrested. With the factory destroyed, the idea of integrating cortosis into battle droids would go undeveloped and unused for the remainder of the war. Tambor was imprisoned on Delrian, but the Commerce Guild were privy to the layouts of the facility he was kept in. Two Skakoan members of Tambor's staff, along with the Clawdite changeling Nuri, were granted a visit to the Foreman's cell. Upon entry, the Skakoans decompressed their pressure cells, blowing themselves up and allowing Nuri to ferry Tambor to safety. He returned to his home in the Foundry city of Denus shortly afterward, where he recuperated in a hyperbaric recharge globe in order to heal his wounds from the ordeal."}, {"tag": "p", "text": "Upon his recovery, Tambor publicly decried Kuat's attempted robbery of Neimoidian technology. He also championed the defensive capabilities of CIS droids during the crisis. Tambor would once again face the press about the Republic's hiring of over 125 Givin scientists in an attempt to gain a technological advantage over the CIS. Tambor claimed, essentially, that it was data that would win the war, rather than advanced technology."}, {"tag": "h4", "text": "Conspiracy with Oviedo"}, {"tag": "p", "text": "Tambor sought to wreak his revenge, not by retaliating with military strength, but by sabotaging Republic munitions. He was able to convince Director General Lorca Oviedo of Oviedo Engineering, a munitions manufacturer, to meet with him on the remote and dangerous world of Asturias to discuss a business proposition. Oviedo was always accompanied by a clone escort, so to maintain the secrecy of the mission, Tambor ambushed the Director while he was in transit from Aviles Prime, ensuring the safety of the Director while doing maximum damage to his escort. Oviedo was prepared for this, and was able to escape harm. His ship was able to land on Asturias with a minimum of fuss, despite being hit, but Tambor's droids stormed in, executing the entire crew. While Oviedo was escorted away to the rendezvous, several of the clone commandos escorting the director managed to crash land on Asturias and escape the wreckage of their ship."}, {"tag": "p", "text": "Tambor himself was not in attendance, but rather communicated via a hologram. He felt that Oviedo's poor standing in the Senate might incriminate him by association, and at any rate, the planet's climate would not have agreed with his Skakoan temperament. He discussed with Oviedo the idea of sabotaging Republic supplies and munitions, which would both be profitable for Oviedo and beneficial to the CIS. Tambor also explained the need for the recent violent events, believing that an \"assassination attempt\" would effectively give Oviedo clemency in the eyes of the Senate. However, the clone commando escort had overheard the conversation, and were able to extract Oviedo, but sustained heavy losses in the process. Tambor ordered his troops to kill Oviedo should he be on the brink of escape, but they failed. Shortly after Oviedo had returned to the Republic capital of Coruscant, he passed away before he could relate the story."}, {"tag": "h4", "text": "Zygerria and Gha Nachkt"}, {"tag": "p", "text": "Tambor and Shu Mai, the leader of the Commerce Guild, were invited by Queen Miraj Scintel to Zygerria, which had recently allied itself with the Confederacy. An auction was to be held on the planet, in which the entire population of the Kiros Togrutan colony was to be sold into slavery. On arrival, Tambor told the Queen that he welcomed their new partnership, and she promised that she would not disappoint him. The auction began, but the Queen soon interrupted it to show the captured Kenobi to the crowd. Tambor was frightened by Kenobi's presence there, as he knew what the Jedi were capable of, despite the Queen's assurance that there was nothing to worry about. However, Skywalker was present, disguised as a slaver. When the Queen ordered Skywalker to whip Kenobi, Skywalker instead attacked Kenobi's guards, supported by his Padawan, Ahsoka Tano, astromech droid R2-D2, and Clone Captain CT-7567. Tambor's worries were confirmed, and he and Mai fled the planet."}, {"tag": "p", "text": "Tambor later chose to move against fellow Councilman Argente, the Magistrate of the Corporate Alliance. The Skakoan knew that Argente was suspicious of his movements, and Tambor used the Koorivar's mistrust to his own advantage. Knowing that Argente would seek out a spy droid to utilize against Tambor from the dealer Gha Nachkt, Tambor paid Nachkt to sell a spy droid to the Koorivar. As Tambor had predicted, Argente contacted Nachkt, and the Trandoshan dealer dutifully sold Tambor's protocol droid to Argente. Once the Koorivar had the droid, Nachkt contacted Tambor, and the Skakoan transmitted the dealer's reward to him. Tambor tuned into the droid's frequency, allowing the Foreman to directly spy on Argente and track his movements across the galaxy."}, {"tag": "h4", "text": "Conqueror of worlds"}, {"tag": "p", "text": "Tambor later took the title of Emir. As Tambor tracked Argente's movements, the Koorivar traveled to the Outer Rim planet Ryloth to meet with Twi'lek broker Artruk, whom Argente had hired to conceal treasures in his possession. Upon noticing the treasures, Tambor ordered his personal T-series tactical droid, TA-175, to move Ryloth to the highest priority for a Confederate invasion. Tambor soon invaded Ryloth, starving and subjugating the Twi'lek population to a harsh rule. The Skakoan blockaded Ryloth, placing Captain Mar Tuuk in charge of the Confederate fleet, while Tambor made headquarters for himself in Ryloth's capital city, Lessu. Tambor also placed tactical droid TX-20 in charge of the Confederate proton cannons stationed in the city of Nabat."}, {"tag": "p", "text": "However, the Republic soon launched a plan to invade and liberate the planet. After General Anakin Skywalker and his Padawan, Commander Ahsoka Tano, eliminated the Confederate blockade around Ryloth, High Generals Mace Windu and Obi-Wan Kenobi were able to move in with their transports. Kenobi and Ghost Company eliminated the cannons and also destroyed TX-20, and the Republic invasion forces were able to land. Tambor was not amused with Tuuk's and TX-20's respective failures, as he would be forced to take the blame for their faults."}, {"tag": "p", "text": "In a holographic conference with Tambor, Count Dooku, displeased with the Emir's weakening hold on Ryloth, ordered him to salvage what he could of the Twi'lek treasures on the planet and retreat before Windu arrived with his forces in Lessu. Dooku also ordered Tambor to liquidate whatever he could of Ryloth, as the massacre would show the galaxy the \"cost\" of a Republic victory. To accomplish this, Tambor dispatched a squad of Hyena-class bombers—and, at TA-175's recommendation, an army of ground forces—to begin destroying several Twi'lek villages in the area. However, Windu soon enlisted the help of the Twi'lek leader Cham Syndulla and Ryloth's resistance against the Confederate oppression. Tambor decided to wait for the last of several Multi-Troop Transports hauling the treasures, despite Dooku's order to retreat and bomb Lessu. TA-175, too impatient to wait for his master, departed aboard Tambor's shuttle, and the Skakoan was left stranded just as the Republic forces arrived in the city. Windu cornered Tambor; however, Dooku was intent on eliminating Lessu, even with Tambor's life in jeopardy. The Confederate Head of State ordered TA-175 to continue with the bombers' attack, but the intervention of Skywalker and Tano in their fighters prevented the destruction of Lessu. Tambor surrendered and was taken into Republic custody."}, {"tag": "p", "text": "Tambor eventually escaped from Republic captivity. When a downed Confederate transport on the Techno Union world of Mustafar fell prey to Republic slicers, Tambor moved to obliterate the slicing team and their clone reinforcements under the command of Clone Commander Cody and a Jedi Knight. Moving to destroy the information on the transport's computers before the Republic could access it, Tambor sent forth an army of droids fresh from Mustafar's foundries to besiege the Republic force, advancing his forces from two directions to attack the Republic's canyon position. Despite initially breaking through the clone defenses, Tambor was unable to prevent the slicers from retrieving the data. Nevertheless, Tambor continued to work against the Republic by operating with a spy among the Republic forces. When his agent was apprehended and incarcerated in the Republic's command center, Tambor dispatched his forces to liberate the prisoner but was unable to free him. As Tambor threatened several neighboring systems, he launched a massive counterattack on the Republic forces, which drew him into a trap at the canyon. While Tambor deployed battle droids and droid starfighters to destroy the Republic's command center, the Republic effectively dispatched them with tower-mounted blaster turrets. The clones were able to destroy a Hyena-class bomber that Tambor sent to attack them, escaping before Tambor could stop them."}, {"tag": "p", "text": "Tambor also sought to claim the icy world Orto Plutonia with TA-175 and a detachment of battle droids. However, a Jedi Knight thwarted Tambor's efforts to seize an Orto Plutonian Talz village, and Tambor was forced to retreat. Tambor also led the Techno Union's armies to invade the planet Iego, where the Separatists had once maintained a base. After being defeated by the same Jedi Knight who had been the cause of his latest losses, Tambor left his tactical droids in charge of the battle and escaped to a Munificent-class star frigate in the Kessel system. Using a tracking device that had been placed on Tambor, the Jedi Knight pursued the Techno Union Foreman and caused his frigate to crash on Kessel, where Tambor surrounded himself with forces led by TA-175. As the Jedi Knight battled through Tambor's forces to arrest the Techno Union Foreman, Tambor sent a squad of BX-series droid commandos into battle, but they were defeated as Tambor made his last stand against the Jedi."}, {"tag": "h4", "text": "Operations on Xagobah"}, {"tag": "p", "text": "In the later stages of the war, Tambor helped the Confederacy fortify their Outer Rim holdings. He travelled to Xagobah, which was the location of a large fortress that he had designed. While there, he lorded an unofficial rule over the Xamsters, and wreaked havoc on the flora and fungi of the planet, making the area around the citadel a natural deathtrap. His citadel was virtually impervious, due to the deadly mutated fungus that fed off a \"heart\" in the citadel's core. This made it a perfect staging ground for Confederate forces, and was also ideal for his own protection. The Republic, however, was not deterred, and dispatched Jedi General Glynn-Beti and her Padawan Ulu Ulix, along with General Skywalker, with a sizable force of clone troopers to breach Tambor's defenses. The attack, however, quickly transformed into a siege. The Republic dug in and battered away at the citadel, while Tambor continually sent out squads of droids to break enemy lines."}, {"tag": "p", "text": "Unbeknown to Tambor or the Jedi, high ranking officials in the Senate had placed bounties on the heads of the Separatist Council. Jabba Desilijic Tiure, with whom Tambor had dealings several years prior, acted as a fence for these bounties, and assigned Tambor's head to the young clone Boba Fett. It was Fett's first genuine bounty, and he was more than willing to accept, despite the danger and improbability of his success. While Fett made his way to the fortress, Tambor tried to break the siege by having a substantial ramship piloted towards the Republic forces, but his gambit failed when the young bounty hunter destroyed the ship. Eventually, Fett made his way into the citadel, and after fighting off several of Tambor's guards, came face to face with the Foreman in the citadel's core."}, {"tag": "p", "text": "In spite of his unwieldy appearance, Tambor was more than able to defend himself. Using a weapon built into his suit, he fired rays of energy at the young Fett, who dodged and returned fire. Tambor quickly evaded Fett's fire, while the tentacles of the citadel's living \"heart\" attempted to subdue the young clone. The duel between the two raged on for a while until Tambor called in the Kaleesh General Grievous. Fett, who had hidden from Tambor's repeated attacks, activated a holoshroud built-in to his suit, giving him the appearance of the notorious bounty hunter Durge. This failed to help Fett, since Grievous had no love for the hulking Gen'Dai, and the cyborg general had his troops open fire. Fett fled, with his holoshroud rendered useless, but Grievous caught up with him and subdued him. Before the general could land a killing blow, Fett touched some of the citadel's fungi, paralyzing him and rendering him, to the naked eye, dead. With his citadel crumbling around him, Tambor directed his concerns toward evacuation. While the Foreman was able to leave safely, he was pursued once again by Fett in space, but this time Tambor's retreat was successfully covered by Asajj Ventress."}, {"tag": "h4", "text": "Dealings with Bail Organa"}, {"tag": "p", "text": "On Metalorn, Tambor's troops had captured Jedi Master Shaak Ti, and in turn imprisoned her in the maximum security section of Metalorn's Unreal City. Shortly thereafter, Viceroy Bail Organa of Alderaan contacted Tambor, citing interest in applying Metalorn's infrastructure template to his homeworld. Meeting with Organa and his aides on Metalorn, he began giving the Viceroy a tour of the planet, spooling off facts and statistics about the economy of the system. Organa, however, expressed an interest in the prison facilities, which Tambor was only too happy to show off. Upon entry, however, Organa was able to pass a lightsaber to the captive Ti, allowing her to escape. Though Tambor called in droids to stop Ti and the Alderaanians, his efforts failed, and his adversaries escaped. As Organa's Tantive IV shot away from Metalorn, Tambor stood in a fit of rage, swearing revenge."}, {"tag": "h4", "text": "Quest for the Sacred Eye of the Albino Cyclops"}, {"tag": "p", "text": "At some stage after the incident on Metalorn, Tambor once again encountered Skywalker, this time losing his right eye to the \"Hero With No Fear\". Following this, Tambor was summoned to the Power Mounds on Skako, a holy place where the Elders read from the Book of the Boolmide. It was an honor reserved for few, and Tambor willingly accepted the call. Due to the loss of his eye, he was dispatched on a mission to retrieve the Eye of the Albino Cyclops, though he was warned not to take it for his own benefit. Clongor, the chief Elder, gave Tambor several of the sacred symbols from the book, and sent him on his way."}, {"tag": "p", "text": "Upon reaching the Gates of Grontessiant, where the Albino Cyclops was believed to reside, Tambor was stripped bare of his pressure suit and set upon by the Lord Being of the Swirblies. He encountered the Albino Cyclops, and imbued himself with the fabled eye, which allowed him to see his future that somehow involved the Techno Union world of Mustafar. The Elders sought to send him there, but they would soon be overruled by Confederate officials."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Grievous reunited Tambor with the rest of the Separatist Council, and sent them to the safe-world of Utapau for protection. Following his unsuccessful raid on Coruscant, however, the cyborg general relocated the Council to Mustafar, fulfilling the Albino Eye's prophecy. The move proved canny, since the Republic attacked and conquered Utapau shortly after the Council's departure. During the battle, Grievous was killed by Obi-Wan Kenobi, and since Dooku had perished over Coruscant, the Council was in control of the Confederacy. Nute Gunray, as head of the council, became the new Head of State, but the Council's \"rule\" would be short-lived."}, {"tag": "p", "text": "Darth Sidious, who was now Galactic Emperor, betrayed the Council, telling the Council members that they were to await the delivery of a \"reward\" for their efforts. The reward was in fact assassination, and was delivered personally by Sidious' new apprentice, Darth Vader. Tambor, along with Rune Haako, fled into the conference room away from Vader to hide. Vader—who as Anakin Skywalker had once captured Tambor—systematically executed the Council members. Before Haako could enter the room, he was cleaved through by Vader's lightsaber. After Vader located and cornered Tambor, Tambor pleaded for mercy, but his cries fell on deaf ears. Vader impaled Tambor through the chest without a second thought and moved on, eventually killing all present and destroying the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tambor was very proud of his accomplishments. He had the utmost faith in the systems he had devised for Metalorn and Xagobah, and would not shy away from advertising their advantages. He apparently had no care for the common people, and would constantly ignore their needs for the benefit of his productions. He also hoped that the system he had set up on Metalorn would be echoed by other worlds when the Confederacy had taken control of the galaxy. Unfortunately for Tambor, he would fail to see that event transpire."}, {"tag": "p", "text": "While he was renowned as a master strategist, Tambor was captured and taken into Republic custody several times. Despite his bulky pressure-suit, he was also a skilled combatant, able to hold his own against certain assailants. He understood the value of security, and was usually surrounded with bodyguards, although, should they fail, he could always rely on hidden weapons built into his suit."}, {"tag": "p", "text": "Tambor also valued his politically clean record. He always covered his tracks, and constantly tried to avoid making himself a target. Even after the Battle of Geonosis, Tambor hoped to stay politically clean, though he would eventually fail. Tambor was a very religious Skakoan, being one of the few to actually ascend to the Power Mounds. Despite this, he attempted to avoid his fate on Mustafar, though he failed, this time with fatal consequences."}, {"tag": "p", "text": "Tambor was skilled in several languages, able to read and write in both Binary and Skakoform, and well as being able to speak Basic, Sluissese, Verpine, Binary and Skakoverbal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wat Tambor was played by Christopher Truswell in Star Wars: Episode II Attack of the Clones. In the video game adaption of Revenge of the Sith, Tambor was played by voice-actor David W. Collins. In the 2008 Star Wars: The Clone Wars television series, he was portrayed by voice-actor Matthew Wood, who also voiced General Grievous, Poggle The Lesser, the battle droids and many others throughout the series."}, {"tag": "p", "text": "Though Tambor was developed for Attack of the Clones, he first appeared in James Luceno's Cloak of Deception. This was due to the fact that Luceno was privy to much of the Clones pre-production material, and was able to write it into his book, where suitable. Tambor was also written into the HoloNet News web series by Paul Ens and Pablo Hidalgo."}, {"tag": "p", "text": "Tambor's design was developed by concept artist Michael Murnane, who created an art deco look for the character that incorporated simple shapes and lines. In his film appearance, Tambor was entirely computer-generated."}, {"tag": "p", "text": "A line of dialogue originally belonging to Poggle the Lesser concerning the battle droids was later given to Wat Tambor himself, explaining that the Techno Union were the builders of most of the new droid army seen in Episode II."}, {"tag": "p", "text": "In the initial brainstorming sessions for Star Wars: Clone Wars, the artists at the Cartoon Network wanted Tambor to figure as a villain. That character, however, was already slated for another Clone Wars-project, so San Hill and the InterGalactic Banking Clan were instead featured."}, {"tag": "p", "text": "In the comic story Wat Tambor and the Quest for the Sacred Eye of the Albino Cyclops, his eyes are black. However, in the cover of the same comic, his only eye is shown as brown. A Skakoan that looks similar to Tambor appears in the comic Star Wars: The Clone Wars Volume 5: Deadly Hands of Shon-Ju, but this character has not been confirmed to be him."}, {"tag": "p", "text": "In 2008, Star Wars sound designer Ben Burtt listed Wat Tambor as his \"favorite Star Wars robot.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}