{"url": "Warwick_Davis", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Caravan of Courage: An Ewok Adventure actors", "Category:Ewoks: The Battle for Endor actors", "Category:Rogue One: A Star Wars Story actors", "Category:Solo: A Star Wars Story actors", "Category:Star Wars Rebels voice actors", "Category:Star Wars sequel trilogy actors", "Category:Star Wars: Episode I The Phantom Menace actors", "Category:Star Wars: Episode VI Return of the Jedi actors"], "nodes": [{"tag": "h1", "text": "Warwick Davis"}, {"tag": "p", "text": "Warwick Ashley Davis (born February 3, 1970) is an actor who has played various roles throughout the Star Wars films, most notably as the Ewok Wicket W. Warrick and Weazel."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "While playing Wicket in Star Wars: Episode VI Return of the Jedi, Davis also made a mockumentary made with help from Return of the Jedi's first assistant director, David Tomblin. The unreleased film was a fictional look at his decision to become an actor and act in the film and his transformation into an Ewok. Davis continued the role as Wicket in the made-for-TV movies Caravan of Courage: An Ewok Adventure and Ewoks: The Battle for Endor, and had four brief uncredited appearances in The Phantom Menace—one as Wald, the young Rodian friend of Anakin Skywalker; the other as Weazel, one of the gamblers at the podrace. Davis also had a cameo as a \"Tatooine street trader,\" and doubled Yoda in some of his \"walking\" scenes in The Phantom Menace (although Yoda was still voiced by Frank Oz)."}, {"tag": "p", "text": "He is probably best known as the title character in Willow, Professor Flitwick and Griphook in the Harry Potter films, and a murderous leprechaun in the long-running series of horror films of the same name. Warwick Davis also played the body of Marvin the Paranoid Android in the 2005 film version of The Hitchhiker's Guide to the Galaxy."}, {"tag": "p", "text": "In addition to his acting career, Davis is the co-founder of the talent agency Willow Management, founded in 1995. It specializes in representing actors under five feet tall. In 2004, his agency also began representing actors over seven feet tall. Several of the actors in his agency had also performed in Star Wars films, such as Kenny Baker (R2-D2), Mike Edmonds (Logray and co-puppetteer for Jabba the Hutt), Michaela Cottrell (Even Piell), Sarah Bennett, Danny Blackner, Peter Burroughs (who is also Davis's father-in-law), Paul Grant, Andrew Herd, Trevor Jones, Nicholas Read, Kiran Shah, Brian Wheeler (Unidentified Ewoks) and, although uncredited in the movies, Rusty Goffe (Kabe, Gonk droid, and a Jawa in A New Hope) and Raymond Griffiths (Gonk droid in The Phantom Menace)."}, {"tag": "h2", "text": "Work in Star Wars"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}