{"url": "Wasskah", "categories": ["Category:Canon articles", "Category:Arboreal moons", "Category:Kashyyyk system moons"], "nodes": [{"tag": "h1", "text": "Wasskah"}, {"tag": "p", "text": "Wasskah, also known as the forest moon of Trandosha, was a moon that orbited the planet Trandosha within the Kashyyyk system of the Mytaranor sector of the Mid Rim. Located in grid coordinates P-9, the moon had islands covered in dense forest. Wasskah was owned by a hunting guild led by the Trandoshan Garnac, who used Island Four, one of the moon's islands, as a hunting ground for sentient prey. It was here that the Jedi Padawan Ahsoka Tano was brought after being captured by Lo-Taren to be killed for sport. Tano managed to escape, however, with the help of some surviving younglings, the Wookiees Chewbacca and Tarfful, and the bounty hunter Sugi."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Wasskah was a moon of the planet Trandosha, located within the Kashyyyk system in the Mytaranor sector of the Mid Rim. It was located within Standard Galactic Grid coordinates P-9. The moon had a breathable atmosphere to several species, and its surface had islands covered in thorny forests with sandy beaches and massive pointed rock formations. The moon had a green hue when viewed from space. The forests formed by Rancor bramble were home to the convor, momong, and insects, along with the Marina Rung flower."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars between the Galactic Republic and the secessionist Confederacy of Independent Systems, Wasskah was controlled by the hunting guild led by the Trandoshan Garnac, who used it as a hunting ground for sentient prey. Jedi Padawan Ahsoka Tano was abducted from the planet Felucia during a battle by the hunter Lo-Taren and brought to Wasskah. Taken to Island Four and released so she could be hunted down, Tano met with a group of Jedi younglings, led by the distraught Corellian Kalifa. Kalifa was eventually slain by the Trandoshans, forcing Tano to lead the remaining survivors."}, {"tag": "p", "text": "As Tano and the younglings fought to stay alive, the Trandoshans brought a new set of victims to the moon aboard their prisoner ship. However, their transport was damaged when Tano and the younglings O-Mer and Jinx attacked it. One of the prisoners, the Wookiee Chewbacca, was able to flee with the younglings. The Wookiee suggested that they find parts to build a transmitter and call for help. They acquired the needed parts on one of Wasskah's sandy beaches, and took the Trandoshan Smug hostage in the process. With Smug's forced help, the survivors commandeered a Trandoshan hunting pod and made their way to the Trandoshan's floating hunting lodge. After an intense fight, the starship Halo arrived, carrying the Wookiee warrior General Tarfful. After receiving a distress call from Chewbacca, Tarfful had hired the services of the bounty hunter Sugi in order to enact a rescue mission. Tarfful and the Wookiees under his command disposed, successfully rescuing Tano, Chewbacca, and the younglings."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Wasskah was owned by Garnac and his hunting guild, and they had operations set up on Island Four. Their prisoners also dwelt on the island for as long as it took the Trandoshans to hunt them down and kill them. The Trandoshan bounty hunter Mundokk hailed from Wasskah and operated during the early reign of the Galactic Empire."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Island Four"}, {"tag": "p", "text": "Island Four was a base of operations for Garnac's hunting guild, and it was here that the hunters let Padawan Tano, Chewbacca, and the younglings loose to be hunted as prey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wasskah first appeared in the twenty-first episode of the third season of the animated television series Star Wars: The Clone Wars, titled “Padawan Lost,” which aired on April 1, 2011 on Cartoon Network. The moon was first identified as \"Wasskah\" in the episode guide for \"Padawan Lost\" on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}