{"url": "Watts", "categories": ["Category:Legends articles", "Category:Corulag residents", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Imperial Army pilots", "Category:Males"], "nodes": [{"tag": "h1", "text": "Watts"}, {"tag": "p", "text": "Lieutenant Watts was a male Human from Corulag and an officer who served in the Imperial Army and worked with the Kuat Drive Yards in developing All Terrain Scout Transport weaponry during the Galactic Civil War. In addition, he was a crack shot, as his gunnery skills were able to produce \"devastating results.\""}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Watts served under Major Marquand as the gunner of Tempest Scout 2 during the Battle of Endor. When Chewbacca and two Ewoks landed on Tempest Scout 2, Marquand ordered Watts to get the only Ewok he was aware of off their AT-ST. Watts peered out of the cockpit hatchway and was pulled out by the powerful Chewbacca, who threw him overboard, screaming during most of his 8.6-meter plummet to the ground. The Imperials, not knowing about his demise, later believed that Watts, alongside Marquand, had turned traitor when it became apparent that their walker was committing turncoat actions against them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Watts was played by his namesake, Return of the Jedi co-producer Robert Watts. Watts served in real-world armed forces, during which he obtained the rank of lieutenant. The character was originally supposed to be General Maximilian Veers, and Julian Glover was invited to reprise his role from Star Wars: Episode V The Empire Strikes Back. However, due to scheduling conflicts, Glover wasn't available on the day of filming, and Watts took over the part."}, {"tag": "p", "text": "Watts' CCG card subtly hints at his namesake's profession by stating \"Watts' gunnery skills produce devastating results.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}