{"url": "Watkins", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:New Republic Defense Force personnel", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Watkins"}, {"tag": "p", "text": "Watkins was a pilot who fought in the Galactic Civil War on the side of the New Republic. A member of Grey Squadron, a military unit under the command of the Jedi Knight X2, Watkins participated in a mission to the planet Dathomir in search of the Imperial warlord X1. On Dathomir, Watkins was killed when an Imperial saboteur planted a detonation pack on the pilot's X-wing starfighter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mission to Dathomir"}, {"tag": "p", "text": "Watkins was the name of a pilot active during the Galactic Civil War between the New Republic and the Galactic Empire. Watkins was a member of Grey Squadron, a New Republic military unit led by the Jedi Knight X2. At some point between the years 11 ABY and 19 ABY, Grey Squadron embarked on a mission to the planet Dathomir. Watkins and the other pilots were following intelligence reports indicating that X2's brother, the Imperial warlord X1, was operating on the planet."}, {"tag": "p", "text": "Watkins and the rest of Grey Squadron arrived on Dathomir using X-wing starfighters, landing amidst the planet's swamps to avoid detection. The squadron soon discovered an Imperial base that had belonged to X1. Now mostly abandoned, the base was being overrun by the Nightsister clan of the local Dathomiri Witches, who fought the few remaining Imperials left behind on the planet. While Watkins and most of the squadron remained with their ships at the landing site, X2 and three other squadron members cleared out the base from both the Nightsisters and X1's troops. X2 and Grey Squadron member Shara then went inside the base to extract data from X1's personal computer."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Meanwhile, one of X1's Imperials was able to infiltrate the squadron's landing site undetected, planting detonation packs onto the squadron's X-wings. When the explosives detonated, the sabotage resulted in heavy casualties for Grey Squadron, with Watkins falling victim to it, alongside fellow pilots Tavoy and Ryder."}, {"tag": "p", "text": "The surviving members of the squadron captured the Imperial saboteur responsible for the attack by the time X2 and Shara returned. Distraught at the loss of Watkins and his other squadron mates, X2 briefly let his anger take hold of him and Force-choked the Imperial, before Shara calmed him down. The remainder of Grey Squadron then proceeded to destroy an orbiting Imperial-class Star Destroyer and left the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Watkins was featured in the Nintendo DS edition of the video game Star Wars Battlefront: Elite Squadron, developed by N-space and released in 2009. Watkins was briefly mentioned as one of the Grey Squadron pilots killed during the mission to Dathomir, and neither the character's species nor gender were established in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}