{"url": "Watto", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Business owners and executives", "Category:Junk dealers", "Category:Males", "Category:Slavers", "Category:Soldiers", "Category:Tatooinians", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Watto"}, {"tag": "p", "text": "Watto was a male Toydarian junk dealer/human trafficker, who owned a shop in Mos Espa, Tatooine. He was the owner of Shmi Skywalker as well as her son, Anakin Skywalker, the young boy who would grow up to become both a revered Jedi Knight and a feared Sith Lord known as Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Fall of the Republic"}, {"tag": "p", "text": "Watto started his life as a soldier on Toydaria. However, he left Toydaria after he suffered an injury and went to Tatooine, where he watched Jawas sell used goods and decided to start his own business."}, {"tag": "p", "text": "Watto became a junk dealer living in Mos Espa where he owned a small shop. Watto won two slaves, Shmi Skywalker and her son Anakin, from Gardulla the Hutt in a bet. Watto discovered Anakin's natural podracing abilities and began to sponsor the boy in several Podraces. Despite this, Watto often bet against Anakin. Watto would also host podracing viewing parties for his gambling partners and friends in his private box. Aside from maintaining the droids at his shop, Watto also had Anakin polish parts of them."}, {"tag": "p", "text": "In 32 BBY, the Jedi Master Qui-Gon Jinn came to his store looking for parts for his ship. Qui-Gon didn't have enough money and was unable to negotiate a price with Watto, even failing to perform a mind trick on the Toydarian."}, {"tag": "p", "text": "The next day, Qui-Gon told Watto that he wanted to enter Anakin in the Boonta Eve Classic in exchange for parts for his ship. Watto agreed and entered Anakin but Watto bet on the Dug racer Sebulba. Qui-Gon placed a bet for Anakin's freedom despite Watto's warnings that Anakin was going to lose anyway. Anakin, however, won the race and left Tatooine with Qui-Gon to become a Jedi on Coruscant while Shmi remained with Watto."}, {"tag": "p", "text": "Years later, Watto sold Shmi to the moisture farmer Cliegg Lars, who bought her to live with him on his moisture farm. Four years after the Invasion of Naboo, Senator Amidala sent her handmaiden Sabe to track down Shmi and free as many slaves as she could. Sabe was unsuccessful in tracking down Watto or Shmi, being forced to instead waste time dealing with Watto's associates. During all these years, Watto continued with his faithful trade and even bought adjacent buildings to enlarge his shop, but he started to suffer great losses on gambling, leaving the future of his business unsure, aside from that he had no longer the necessary personnel and was forced to do all the hard work himself."}, {"tag": "p", "text": "In 22 BBY, shortly before the beginning of the Clone Wars, Anakin returned to Tatooine in search of his mother. Watto, after recognizing his former slave, asked him if he could help with some \"deadbeats\" who owed him a lot of money. After being asked about Shmi, Watto gave him all of the information he knew about Shmi after selling her."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "During his exile on Tatooine after Order 66, Obi-Wan Kenobi purchased a humidifier from Watto at an inflated price. After Kenobi was killed by Darth Vader on the Death Star, Kenobi found himself in a vision of his hut on Tatooine. He noted that the humidifier was not in the vision, among other recent additions that were missing. He then realized the vision was of an earlier time in his hut, from around three years into his exile."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Watto was proud of his business and distrusting of Republic credits, which he felt weren't \"real\" enough for the tough economy of an Outer Rim Territory planet like Tatooine. When Qui-Gon Jinn attempted a mind trick on him in order to get him to accept 20,000 credits in exchange for a T-14 hyperdrive generator, he shrugged it off, telling Jinn that as a Toydarian, mind tricks didn't work on him. Watto was a heavy gambler, and later lost the hyperdrive and Anakin in a bet he had wagered against the Jedi. After Anakin's departure, he started to suffer heavy losses on gambling."}, {"tag": "p", "text": "As the owner of Anakin and Shmi Skywalker, Watto was particularly not a kind master, even though the living conditions of the Skywalkers were more agreeable in comparison to their life in servitude to Gardulla the Hutt. However, Watto sometimes showed flashes of compassion: he allowed Anakin to go home early if he finished all his assigned tasks and Shmi to perform certain quieter duties at the comfort of her private work station."}, {"tag": "p", "text": "Watto's underestimation of Anakin proved to be a heavy blow to his business. Once Anakin left Tatooine and after he sold Shmi to the Lars family, Watto found himself with no help and was forced to do the hard job himself so his business could survive. Ill-used to the huge capabilities of his former slave, Watto wasn't able to find anymore servants with the sufficient technical knowledge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Watto was portrayed and voiced by actor Andrew Secombe in the 1999 film Star Wars: Episode I The Phantom Menace and its 2002 sequel Star Wars: Episode II Attack of the Clones. Secombe played Watto on set, to give animators a reference for lighting and eye-line."}, {"tag": "p", "text": "Conceived by Star Wars creator George Lucas, Watto's design was more avian in nature, featuring plumage and a beak. Later incarnations of the Toydarian featured a cigar and tentacles. When artist Terryl Whitlatch began designing the character, she began with an ugly, \"cherub-like\" design. Lucas suggested that he be given webbed, duck-like feet. Eventually, the basis for the character's face was derived from an early concept painting of the Neimoidian race by concept artist Doug Chiang, particularly the hooked trunk and the crooked teeth. As the character spoke frequently, animator Rob Coleman found lip-syncing Watto's lines with Secombe's delivery of the dialog to be difficult. To solve the issue, Coleman had part of Watto's teeth chipped away, so the character could speak out the side of his mouth, making the syncing process much easier. Sound designer Ben Burtt recorded himself opening and closing an umbrella to make the sound of Watto's wings flapping."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}