{"url": "Wayland_trap", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Battles of the Second Imperial Civil War", "Category:Battles of Wayland"], "nodes": [{"tag": "h1", "text": "Wayland trap"}, {"tag": "p", "text": "The Wayland trap was orchestrated by Darth Maladi in order to capture Cade Skywalker and use him as a test subject for a new creation of hers. Maladi would in turn use her new weapon to help Darth Krayt regain domination over the One Sith."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following Cade Skywalker's betrayal of Azlyn Rae and Bantha and Droo Rawk on Kiffex, Skywalker and his crew decided to lay low for a while. Leaving the planet, the Mynock flew to Zeltros, the homeworld of mechanic Deliah Blue, where Hutt Queen Jool, a friend of theirs, had just opened a Paradise cantina."}, {"tag": "p", "text": "Meanwhile, Darth Maladi maintained a secret laboratory on Wayland. Years earlier, the planet was selected as part of the Ossus Project, a massive undertaking orchestrated by the New Jedi Order to heal and restore worlds devastated during the Yuuzhan Vong War. Led by Cade's father, Kol, and Master Shaper Nei Rin, Yuuzhan Vong Shapers, overseen by Jedi escorts, set to work, and the initial results were wondrous to behold. However, agents of the One Sith, including Sith Lady Darth Maladi and rogue Yuuzhan Vong shaper Zenoc Quah, secretly sabotaged the terraforming processes under the orders of Darth Krayt. Soon on Wayland, the world's lush vegetation underwent mutations of a kind not seen since the Vong forcibly took populations as slaves for shaping. Painful bony growths sprouted from the skin of the natives in a plague that affected all the terraformed worlds, bringing the project to a catastrophic end."}, {"tag": "p", "text": "Following the death of Darth Krayt on Had Abbadon, Maladi feared that she would be disposed of by Darth Wyyrlok, who had claimed that Krayt was alive but in stasis recovering from his injuries. After sharing her concerns with Darth Nihl about Wyrrlok, Maladi convinced Nihl to go to Korriban to confirm Krayt's death, and then, when the truth was discovered, use it as he best saw fit. With Quah's help, Maladi started engineering a new weapon which would help Darth Krayt or his successor gain dominance over the One Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}