{"url": "Bergon", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Females", "Category:Humans", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Bergon"}, {"tag": "p", "text": "Bergon was a human female who served as a colonel in the Galactic Empire during the early stages of its reign. In 18 BBY, Bergon, along with Imperial Security Bureau Commander Jordo and Major Rantu, assisted Governor Wilhuff Tarkin in military operations on Mon Cala. After Rantu's forces were eliminated, Bergon led the assault against Ackbar's forces, but was killed when her skybase was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bergon was a human female that served as a colonel in the armed forces of the Galactic Empire. In 18 BBY, Bergon was present aboard the bridge of the Star Destroyer Sovereign in orbit of the planet Mon Cala with Commander Jordo, Major Rantu, and Governor Wilhuff Tarkin. Bergon questioned as too why they were planning a multi-stage complex assault when they could just use the XX-9's to bombard the planet, Tarkin responded that they were an Empire and the power of an Empire what was it controlled rather than what it destroyed, he also added that Mon Cala was a valuable world and that they would not destroy it. When the shuttle of Imperial ambassador Telvar was shot down, killing all aboard, Tarkin told a lieutenant to inform Bergon that she was to begin her phase of the operation."}, {"tag": "p", "text": "After the Battle of Dac City and overall Imperial assault of Mon Cala commenced, King of Mon Cala Lee-Char had fully evacuated his people from all surface cities, and subsequently deployed enormous ocean creatures which jumped above the ocean surface and crashed down near all Mon Cala surface cities, destroying them and all Imperial forces. Since Major Rantu was coordinating the invasion from a command center in Dac City, he was presumed lost. As a result, Tarkin informed Bergon that she was responsible for the next wave of the assault. Bergon accepted, and stated that she could deploy aerial landing platforms, that way Imperial Military forces would not be at risk of another devastating attack. She noted that conducting an underwater campaign from sky-bases would be difficult, but informed Tarkin that they would complete the objective."}, {"tag": "p", "text": "After deploying the sky-bases, Bergon coordinated from one in the northern hemisphere. After speaking with Tarkin, Bergon ascertained that Raddus was orchestrating resistance and consolidating his reefships in the polar regions of the southern hemisphere. Preferring not to divide her forces, she decided that she would eliminate Ackbar in the northern hemisphere. Tarkin warned her not to underestimate Raddus, but she remained confident that the enemy posed no threat."}, {"tag": "p", "text": "Before she could even finish her report to Tarkin, Ackbar's forces launched a surprise attack from underwater. Bergon scoffed at Ackbar for leading the attack personally and ordered an officer to scramble their TIE fighters, insisting that the attacking Mon Calamari wouldn't get anywhere near the base. As the TIEs moved to intercept, Ackbar's forces dove back below the surface, and drew closer to the sky-base until positioned directly underneath. Overwhelmed, the TIEs failed to prevent the attackers from launching clusters of missiles, which penetrated the deflector shields. Bergon ordered her crew to shoot them down, but the sheer number of missiles proved to be too many for their targeting systems. Realizing her fate had been sealed, Bergon could only utter \"no\" as the sky-base erupted into flames, fractured, and crashed into the sea below, killing Bergon and her crew."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the death of Bergon, a lieutenant informed Tarkin on the situation and how the Mon Cala forces were able to destroy the sky-base. Annoyed that this was another military tactic not discovered by Commander Jordo and the ISB, Tarkin ordered that Jordo be given a set of stormtrooper armor and be sent to the surface personally. Tarkin then stated that he sought to escalate the war, as two more Star Destroyers arrived over the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a firmly militaristic but ultimately short-sighted tactician, Bergon firmly believed in overwhelming force as the simplest and most effective means of neutralizing any threats to the Empire's sovereignty. A bold and outspoken officer, she questioned Tarkin's plans during the pacification of Mon Cala. She preferred to command from behind the lines and not enter battle herself."}, {"tag": "p", "text": "When presented with the challenge of coordinating the next Imperial assault wave from sky-bases, she noted that it would prove difficult, although she felt confident that her forces would get the job done."}, {"tag": "p", "text": "She displayed her non-human prejudices by derisively referring to the Mon Calamari and Quarren as \"finners\" and suggested devastating Mon Cala by orbital bombardment. She greatly underestimated the Mon Calamari and Ackbar, who she dismissed as an \"idiot\" for leading his forces in battle personally. In the end she would perish for her arrogance when Ackbar's forces overwhelmed her own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bergon made her debut in the canon 2018 comic Darth Vader: Dark Lord of the Sith 13, written by Charles Soule and pencilled by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}