{"url": "Waveskimmer", "categories": ["Category:Canon articles", "Category:Aquatic vehicles", "Category:Galactic Empire vehicles"], "nodes": [{"tag": "h1", "text": "Waveskimmer"}, {"tag": "p", "text": "A waveskimmer was a type of aquatic surface ship used by the Maritime Division of the Galactic Empire's Army."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The waveskimmer was a repulsorlift surface ship\nconsisting of a windowed cockpit supported by two sturdy legs angling down from either side. Each of those legs terminated in a pontoon that allowed the vehicle to float on the water's surface, and thus glide over it when propelled. Armament-wise, the waveskimmer boasted two forward-facing blaster cannons."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Waveskimmer were used by the Maritime Division, a special unit of the Galactic Empire's Army tasked with maintaining order on planetary waterways."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Leia Organa's team were chased by several waveskimmers during their mission on Sesid as part of Operation Yellow Moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Waveskimmers made their first canonical appearance in the 2015 novel Moving Target: A Princess Leia Adventure, which was written by Jason Fry and Cecil Castellucci. They were first pictured in Leia and the Great Island Escape, a Disney–Lucasfilm Press adaptation of Moving Target aimed at young readers, which used the appearance of the AQ-5 Waveskimmer from the Legends comic series Star Wars: Dark Empire."}, {"tag": "p", "text": "However, this depiction does not fit the textual evidence: Leia mentions stormtroopers on waveskimmers rather than in them. Several paragraphs later, it is mentioned that \"black shape of a riderless waveskimmer skittered over the waves.\""}, {"tag": "p", "text": "In fact, Jason Fry intended it as a reference to a single-person vehicle that appeared in Battle for the Golden Sun, a Star Wars Legends adventure book for use with West End Games' Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}