{"url": "We_Don%27t_Serve_Their_Kind_Here", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "We Don't Serve Their Kind Here"}, {"tag": "p", "text": "\"We Don't Serve Their Kind Here\" is a short story in the anthology From a Certain Point of View. The story, written by Chuck Wendig, focuses on the point of view of Wuher, the bartender of Chalmun's Spaceport Cantina."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The bartender Wuher is working on the day shift at Chalmun's Spaceport Cantina when the droid detector is not working. He witnesses C-3PO and R2-D2 entering the cantina with Obi-Wan Kenobi and Luke Skywalker. Wuher is waiting for the spacer Bims Torka, who supposed to deliver a shipment of Knockback Nectar from Jakku the previous day. Wuher manages the bar while Figrin D'an and the Modal Nodes play their gig. Wuher is also present when the smuggler Han Solo enters the cantina with his Wookiee co-pilot Chewbacca. Wuher is aware that Solo owes a debt to Jabba Desilijic Tiure. Shortly later, the Rodian bounty hunter Greedo enters the cantina."}, {"tag": "p", "text": "Wuher then attends to a patron named \"Roofoo\" and his Aqualish friend \"Sawkee,\" who wants to drink for free. Wuher stands his ground and Roofoo orders a couple of black fizzers for himself and his friend. Later, the smoker Jerriko tells him that the two patrons are actually the fugitive surgeon Cornelius Evazan and his friend Ponda Baba. Jerriko offers to dispatch Evazan but Wuher wants to avoid any trouble. While serving a Chadra-Fan patron, Wuher realizes that he has nothing but the bar and its patrons."}, {"tag": "p", "text": "Returning to the present, Wuher angrily tells Skywalker that his \"droids\" are not welcome at his cantina. As the droids leave, Wuher reflects on how he lost his parents to battle droids during the Clone Wars on Arkax Station, an incident which caused him to develop a hatred for droids. After Wuher serves Skywalker a drink, Wuher witnesses Ponda Baba and Evazan troubling Skywalker. Kenobi tries to tell the criminals to stand down but Evazan attacks Skywalker. In response, Kenobi slices off Ponda Baba's arm and wounds Evazan in the chest."}, {"tag": "p", "text": "When stormtroopers arrive in response to the incident, Wuher contemplates reporting the incident but decides not to report Kenobi since the Jedi saved him from a whole battalion of battle droids. Wuher is also present when Solo shoots Greedo dead. Reflecting on his past and the events of the day, Wuher ponders on whether he could change his destiny."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}