{"url": "Bergruutfa", "categories": ["Category:Legends articles", "Category:Creatures of the Mid Rim", "Category:Creatures of unspecified biology", "Category:Domesticated creatures", "Category:Grassland and plains creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Jungle and forest creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Bergruutfa"}, {"tag": "p", "text": "Bergruutfa were large grazing beasts from Teloc Ol-sen, best known as the mounts of the famed Teloc Hunters. Though their natural habitat was the plains, forests, and jungles of their homeworld, they were easily domesticated, and exported to many other planets."}, {"tag": "p", "text": "Bergruutfa were enormous quadrupeds ranging up to seven meters tall at the shoulder. Their hide was thick enough to stop blaster bolts, and their head was protected by even thicker plates of armor. Their skin was light brown to dark green in color, tending to lighten in the winter. Young bergruutfa were usually brown."}, {"tag": "p", "text": "Bergruutfa were generally mild-tempered social animals, traveling in herds which ranged from 30 to over 150 beasts. These herds ate massive amounts of vegetation, able to strip whole forests of leaves, fruits, and nuts. Only their young were subject to predation, because the size and thickly armored hide of adults allowed them to ignore the attacks of other, smaller animals without harm in the wild. The stronger animals in the herd would protect their young from predators and help to feed weaker bergruutfa."}, {"tag": "p", "text": "Like many social animals, they were highly intelligent and affectionate towards other members of their herd. This trait carried over to domesticated bergruutfa, who would if well-treated consider their handlers as part of their herd. Their strength made them excellent as cargo haulers in caravans, as working animals on farms, or even as guard beasts who could stop most intruders with a grunt and a head butt. Their size and armored hides also made them valuable war beasts. Their intelligence made them easily capable of learning their names and following commands from their handlers: in fact, they could even complete simple tasks without direct supervision. It also made them playful, playing such games as \"hiding\" objects and using their bulk to block their masters from retrieving their belongings. Mistreated or angered bergruutfa, however, were very dangerous and difficult to stop. Even their playful rough-housing could be dangerous."}, {"tag": "p", "text": "One of their less endearing traits was their near-constant production of saliva. This saliva served as a digestive aid which helped them break down tough vegetation. However, they often left large pools of saliva on the ground as they fed. Bergruutfa handlers were used to this trait, but people unused to the beasts often slipped in puddles of bergruutfa drool."}, {"tag": "p", "text": "Bergruutfa were exported to a wide variety of worlds as beasts of burden. Rebel SpecForce commandos sometimes used bergruutfa as riding beasts on missions during the Galactic Civil War. During a mission to acquire several bergruutfa for use at the new established Alliance base in the Eclorar sector, a group of Rebels encountered the Zulirian Swordmasters. One of the Rebels, who was using an extended vibroblade, was challenged to a duel by the Swordmaster Kaltor Naklian. The Rebel refused, and was subsequently murdered by Naklian. The Rebel group counterattacked, but were cut down by the Swordmasters."}, {"tag": "p", "text": "Weequay, when away from their homeworld of Sriluur and unable to worship at their thals, would sometimes capture bergruutfa and sacrifice them to their god, Quay as a substitute."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}