{"url": "Way_of_the_Dark", "categories": ["Category:Legends articles", "Category:Force philosophies"], "nodes": [{"tag": "h1", "text": "Way of the Dark"}, {"tag": "p", "text": "The Way of the Dark, or simply the Dark, was the name used by the Sorcerers of Rhand to describe their view of the universe, which was unrelated to the Force."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Effectively their philosophy was the polar opposite from the Potentium, but taken a step further. The Way of the Dark didn't just deny the existence of the Light side of the Force, it stated that the Force itself, both Light and Dark side, was irrelevant in scope compared to the Dark. This system stated that entropy and destruction was the universal constant that all things worked towards, going so far as to call it the \"will of the universe\". In the absence of life was the void, the foundation of truth, which to the Sorcerers became known as the One Truth. To them the Force, which was an energy field created by living beings, was itself fleeting and destined to fall to the Dark as the universe approached complete entropy: heat death."}, {"tag": "p", "text": "An initiate was taught that if one made destruction his primary goal, with whatever scheme he was taking part in being a secondary objective, then the Dark would effectively reward the initiate for the devastation caused by pushing the secondary objective to success."}, {"tag": "p", "text": "As a prime example of this, Cronal believed that Palpatine was able to achieve success against the Jedi and the Republic because his primary motive was the destruction of both parties. However, once he had achieved these goals and set about consolidating his rule and building the Empire, his focus shifted from destruction to creation, in total opposition to universal processes. Thus when before he could not fail, now he could never succeed."}, {"tag": "p", "text": "The power known as Darksight was considered the greatest among the followers of the Dark, as those who were fully aligned with the ways of destruction and chaos could perceive multiple futures and use their will to bring about the desired outcome. Supposedly, this ability transcended the more traditional applications of battle meditation by the Jedi and the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}