{"url": "Waxarn_Kel", "categories": ["Category:Legends articles", "Category:Galactic Alliance individuals", "Category:Humans", "Category:Jedi Knights of the New Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Waxarn Kel"}, {"tag": "p", "text": "Waxarn Kel was a young male Human Jedi Knight in the New Jedi Order during the Yuuzhan Vong War. Kel became infuriated by the New Republic Senate's lack of support for the Jedi. During the Battle of Ebaq 9, Kel was badly scarred and became filled with anger. He championed assertive strikes against the Yuuzhan Vong in order to prevent the new galactic government, the Galactic Federation of Free Alliances, from similarly turning against the Jedi. In the final stages of the war, during the Battle of Yuuzhan'tar, Kel flew a Zonama Sekotan fighter in defense of the living planet Zonama Sekot against the Yuuzhan Vong fleet attacking it. Kel was one of the Jedi to survive the war and attended Jedi Master Luke Skywalker's Conclave on Zonama Sekot."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Knight at war"}, {"tag": "p", "text": "A Human male, Waxarn Kel was a handsome youth by his species' standards, as well as a Force-sensitive. Due to his ability to use the Force, Kel joined Jedi Master Luke Skywalker's New Jedi Order, going on to achieve the rank of Jedi Knight. In 25 ABY, the extragalactic Yuuzhan Vong species launched an assault on the galaxy with the intention of total conquest. Superiority of numbers and mistakes made by the New Republic government allowed the Yuuzhan Vong to conquer a swath of territories as they advanced toward the Core Worlds. The Jedi, traditionally the protectors of the galactic government, were shunned by a sizable faction of the New Republic Senate due to several Yuuzhan Vong ultimatums that falsely stated that the invasion would cease if the Jedi were surrendered. Kel became embittered by the treatment of the Jedi Order, especially as many of its members were killed or turned in by the galaxy's inhabitants. He believed, nevertheless, that the Yuuzhan Vong should still be battled despite the New Republic's apathy. A series of victories eventually brought the Yuuzhan Vong to the heart of the galaxy, whereupon they captured Coruscant, the galactic capital."}, {"tag": "p", "text": "In 28 ABY, a year after Coruscant had fallen to the invaders, the New Republic Defense Force and its counterparts in the intelligence division orchestrated a trap for the Yuuzhan Vong military leader, Warmaster Tsavong Lah. Knowledge was deliberately leaked to the Yuuzhan Vong spy network to suggest that a New Republic stronghold known as the 'Final Redoubt' could be located in the Deep Core along with the government's leadership, war supplies and several members of the Jedi Order. The Yuuzhan Vong subsequently arrived in the Treskov system in the Deep Core and were trapped by several New Republic fleets over the moon Ebaq 9. Many Jedi fought in the battle, among them Waxarn Kel. The young Jedi Knight was severely scarred in the battle and his once handsome looks were disfigured. Once Warmaster Tsavong Lah had lost much of his armada to the trap, he abandoned hope of victory and led his personal fleet to Ebaq 9, where several Jedi were in fact re-arming and preparing to join the battle again. Lah landed thousands of warriors on the moon but Vergere, a Jedi of the Old Republic who had aligned herself with Jacen Solo—one of Kel's peers—sacrificed herself by crashing a starfighter into the Yuuzhan Vong warriors and wiping them out, thus saving the Jedi present on the moon."}, {"tag": "h3", "text": "Renewed vendetta"}, {"tag": "p", "text": "Kel recovered from the battle but kept the scars on his face, allowing them to heal naturally and permanently marr his features. The experience enhanced his belief that the Yuuzhan Vong should be fought again until they could be vanquished. As Chief of State Cal Omas re-organized the New Republic into the Galactic Federation of Free Alliances, the government began to regain its confidence following Ebaq 9. On the waterworld of Dac, the capital of the Galactic Alliance, a meeting of the Galactic Alliance Senate was convened to discuss the prosecution of the war. Similarly, Jedi Master Skywalker also called for a large number of Jedi to assemble on Dac to formulate new strategies in the struggle against the Yuuzhan Vong. Kel, who felt that the Jedi's role in the Battle of Ebaq 9 had vindicated the Order to its critics, expressed this opinion during the meeting. Skywalker, who was overseeing affairs, asked Kel to elaborate on his beliefs; the young Jedi Knight claimed that having played a key part in defeating the Yuuzhan Vong during the battle, the Order should press its advantage and prove Vergere's sacrifice to save Jedi worthy by launching a bold strike against the invaders. By doing so, Kel claimed, public opinion would remain behind the Jedi; there would be no doubts to their loyalty to the new government and they would avoid appearing weak. His beliefs were echoed by several other Jedi who had similarly suffered during the war."}, {"tag": "p", "text": "Skywalker, supported by fellow Jedi Master Kyp Durron, challenged Kel's assertions, attempting to remind the young Jedi Knight that a Jedi's loyalty was to the Force, rather than to a government that championed an aggressive strike. Kel spoke with the Jedi Master face to face in front of the congregation but was soon chagrined when Skywalker reminded him that strength and weakness were not the parameters by all which should be judged and that a Jedi should never forgot his or her vulnerabilities. Kel was chastised by the comments and fell silent, returning to his seat and allowing the next speaker to address the crowd. In the final stages of the war, he flew a Zonama Sekotan Fighter in defense of the planet against the Yuuzhan Vong. Kel was one of the Jedi to survive the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Waxarn Kel was introduced in The New Jedi Order: Force Heretic I: Remnant, the first in a trilogy of novels making up the final stretch of the nineteen-book New Jedi Order series. Kel's role is brief, lasting only several pages, but raises the question as to how the Jedi Order will respond to desires in the Galactic Alliance Senate to press home the advantage against the Yuuzhan Vong. The question of utilizing aggression to fight the Yuuzhan Vong and whether or not peace was desirable if attained at any cost were consistent themes throughout the series and ones which principal Star Wars characters such as Luke Skywalker and Leia Organa Solo, as well as Expanded Universe creations such as Jacen and Anakin Solo, grappled with as characters. Waxarn Kel did not appear again in the Force Heretic trilogy but made a brief appearance in James Luceno's The New Jedi Order: The Unifying Force, which was the last installment in the series. Kel received a brief mention in The Complete Star Wars Encyclopedia, published in 2008, although he has not appeared in any Expanded Universe literature subsequent to The Unifying Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}