{"url": "Wedding_of_Luke_Skywalker_and_Mara_Jade", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Weddings"], "nodes": [{"tag": "h1", "text": "Wedding of Luke Skywalker and Mara Jade"}, {"tag": "p", "text": "The Wedding of Luke Skywalker and Mara Jade took place in 19 ABY on Coruscant, shortly after the end of the Galactic Civil War. It consisted of two weddings: the first, a private ceremony held at Jedi Headquarters, was only open to members of the New Jedi Order. The second was a large public event that ex-Moff Derran Takkar tried to disrupt. Kam Solusar officiated and Talon Karrde gave Mara away."}, {"tag": "h2", "text": "Prelude to First Wedding"}, {"tag": "p", "text": "Leia Organa Solo, the groom's twin sister, announced her brother Luke and Mara's wedding on Coruscant. Many criticized it with the view that the wedding was an establishment for a \"Force Empire\", or peace package. Leia put C-3PO in to \"handle\" the crowd. The protocol droid started by discussing how he came to meet Luke, and drifted off topic, boring many. This spared Han the trouble of coming in blasting, mainly because he did not have enough clips. Leia told him to bring the Falcon next time."}, {"tag": "p", "text": "Later, Leia convinced Mara to try out dresses for the second wedding, under phrase \"minimal is maximal\". They went through at least seven: a brown dress that was revealing, a gown with a mask, a green luminescent, a dress based on Mara's parameters, a neo-Imperial cloak that resembled the groom's father, one meant for Hutts, and one that she refused to come out in. Tired of everything, Mara ran out into the streets of Coruscant."}, {"tag": "p", "text": "She ran into a lone Twi'lek, Jari'kyn, who was fired by her boss for making a better dress for the wedding. Mara admired Jari'kyn's designs and accepted her as the new designer."}, {"tag": "h2", "text": "The Unofficial Wedding"}, {"tag": "p", "text": "At the Jedi Temple, surrounded by their fellow Jedi, Kam Solusar married Luke and Mara. After joining their bonding stones, they were unofficially declared wedded. All assembled Jedi ignited their lightsabers in salute."}, {"tag": "h2", "text": "Prelude to the Official Wedding"}, {"tag": "p", "text": "At Luke's bachelor party at the Red Rancor, he was surprised by several friends: Han, Wedge Antilles, Chewbacca, Gavin Darklighter, Talon Karrde, Wes Janson, Kyle Katarn, Tycho Celchu, Derek Klivian, Kam Solusar, Corran Horn, Booster Terrik, and Lando Calrissian. Unfortunately, Luke was accidentally drawn into a brawl in an attempt to kill him; he was saved by Banner Sumptor, who had his moral and ethic issues with helping the Moffs stop the wedding. Also, Chik Apla was caught trying to assassinate Mara. The Moffs then came up with contingency plans: steal the dress, get inside the wedding, among other things."}, {"tag": "p", "text": "The next day, Mara, Leia, Tionne Solusar, Winter Celchu, Mirax Terrik Horn, and Iella Wessiri Antilles had their bachelorette party at a spa without telling their husbands. Enjoying the hot springs and the mud baths, the women beat Champion Squadron at slingball."}, {"tag": "h2", "text": "The \"True\" Wedding"}, {"tag": "p", "text": "On the day of the second wedding, the audience was waiting for Jari'kyn to arrive with the dresses. Unfortunately, a group of thugs, led by Anlys Takkar, Derran Takkar's wife, attempted to kill Jari'kyn and take the dresses. However, Banner turned on her and helped Jari'kyn get to the wedding on time to warn everyone. To keep the wedding going without causing a panic, Luke, Han, and Talon Karrde had to be present during the ceremony, while Rogue Squadron, Chewbacca, and the other Jedi dealt with the impending attacks. C-3PO and Jacen Solo were ushers. They took care of swoop gangs, attempts to gas the area, and dealing with thugs from the bar. Luckily, the latter were scared off by Booster Terrik, who was keeping the children asleep."}, {"tag": "p", "text": "Unfortunately, everything was a distraction for Derran, who had made his way through the sewers and entered the wedding as an Ithorian. When Admiral Gial Ackbar made the opening statements, Derran revealed himself and threatened to destroy all communications in the New Republic with a virus. Luke spoke to him, deducing that though he did not want peace, yet he could enjoy it. Takkar gave in and the ceremony continued. The virus would not have worked anyway, for the Republic had it shielded since they took Coruscant. Luke and Mara exchanged their vows and rings and were declared husband and wife. They then danced under the bright moonlight."}, {"tag": "h2", "text": "Guests"}, {"tag": "h3", "text": "Jedi wedding"}, {"tag": "h3", "text": "Public wedding"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Wedding of Luke Skywalker and Mara Jade was first mentioned in Timothy Zahn's 1998 novel Vision of the Future. It was then featured in the 1999-2000 comic book series Star Wars: Union. Star Wars creator George Lucas, however, disregarded the wedding as part of of his vision of the saga, stating that the story of the saga is the tragedy of Darth Vader and once he dies, the story ends."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}