{"url": "Weapons_Research_Facility", "categories": ["Category:Legends articles", "Category:Imperial military bases", "Category:Imperial research facilities"], "nodes": [{"tag": "h1", "text": "Weapons Research Facility"}, {"tag": "p", "text": "The Weapons Research Facility was an Imperial research and development center on the ice planet Fest. It was guarded by a deflector shield generator and a pair of missile turrets, as well as a number of outposts in the outlying vicinity. The facility was critical to the R&D of various Imperial Military programs, including the Dark Trooper Project, prior to its destruction by Rogue Squadron in 0 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Weapons Research Facility undertook projects that were overseen by a number of different Moffs. Moff Kohl Seerdon used the facility to construct AT-PTs. As part of the Dark Trooper Project, Moff Rebus had the facility process phrikite and tydirium into the super-strong alloy phrik. This, he used to armor his droid designs. The facility also held an Ewok prisoner."}, {"tag": "p", "text": "In 0 ABY, the facility was raided twice by the Alliance to Restore the Republic following the revelation of its existence after mercenary Kyle Katarn's capture of Rebus on Anoat. The Alliance had recently joined forces with the Atrivis Resistance Group, providing them more access to the sector. In the first raid, operative Kyle Katarn infiltrated the facility and stole a sample of phrik. During the second mission, a team of Rebel commandos penetrated the complex and stole three AT-PTs, but their escape was compromised, requiring Rogue Squadron to provide additional support. In the ensuing battle, the facility, outposts, and missile turrets were destroyed by Luke Skywalker following the destruction of its deflector shield generator."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Weapons Research Facility appeared in two video games: the 1995 first person shooter Star Wars: Dark Forces and the 1998 flight combat game Star Wars: Rogue Squadron. It was first depicted in the former as a phrik research facility and made its final appearance in the latter as an AT-PT factory which is destroyed in the game's eleventh mission."}, {"tag": "p", "text": "Interestingly, an enchained Ewok appears as an easter egg in the facility in Dark Forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}