{"url": "Webb_Taffral", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Webb Taffral"}, {"tag": "p", "text": "Webb Taffral was a male individual who was loyal to the Galactic Empire, despite having failed out of the Imperial Academy. He was the older brother of Dav Taffral, who had joined the Alliance to Restore the Republic. Months after the Battle of Endor, Webb was present at the Taffral home on the planet Saleucami for a family dinner with his father, Glen Taffral, and Dav, who had recently returned from his service with the Rebel Alliance. Webb gave up his brother's location to Imperial forces, prompting his father to stun him with a blaster."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Webb Taffral was an Imperial loyalist and attended the Imperial Academy. However, he failed out of the institution and, by the rebellion on Akiva in 4 ABY, had taken up residence in the Taffral home on the planet Saleucami. His father, farmer Glen Taffral, lived there with him, while his mother had died by that point. Prior to the events on Akiva, his younger brother, Dav Taffral, joined the Alliance to Restore the Republic and later became a member of the nascent New Republic."}, {"tag": "p", "text": "Webb was not enthused when Dav returned to their Saleucami home months after the Battle of Endor. His loyalty to the Empire led him to inform Imperial forces of his brother's location. During their family dinner, they ate in relative silence, until Dav asked for a food dish to be passed to him. Webb refused to comply, insulting his younger brother's rebel affiliation. An argument ensued between them, which quickly turned into a brawl. Webb attacked Dav first but was drunk on koja-rum and unable to land the first blow. Their scuffle was stalled by their father throwing a salad bowl at the wall. Glen ordered them to sit and explained that, in the end, the side they should pick is family because governments would come and go."}, {"tag": "p", "text": "Glen was soon interrupted by the sound of TIE fighters arriving over the Taffral home. Webb's face showing guilt, he revealed that he had given up Dav's location to the Empire. Glen quickly stunned him with a blaster, and he cried out as his face landed in a bowl of mashed chokeroot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Webb was loyal to the Empire and felt that his time at the Academy had made him a better man. His loyalties put him at odds with his brother, Dav, who was affiliated with the Rebel Alliance, a revolutionary organization that Webb considered to be full of terrorists. Webb's short temper caused him to argue with his brother, leading to a brawl in which Webb attacked first. His flung insults at Dav through his rage, further fueled by his drunkenness on koja-rum. Webb's loyalty to the Empire led him to give up Dav's location to Imperial forces, though he felt regret and guilt when the Empire arrived."}, {"tag": "p", "text": "Webb had a broad-shouldered, full-chested figure and a round belly. His hairline was trimmed close to the scalp, similar to that of his father, Glen. Compared to Webb, Dav appeared lean and scruffy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Webb Taffral appeared in Aftermath, a 2015 novel written by Chuck Wendig as the first installment in Star Wars: The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}