{"url": "Weapons_Depot", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military bases", "Category:Imperial military bases", "Category:Talus locations"], "nodes": [{"tag": "h1", "text": "Weapons Depot"}, {"tag": "p", "text": "The Weapons Depot was a large cache of weapons located on the planet Talus."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally owned by the Rebel Alliance, it was hotly contested during the Galactic Civil War as the Galactic Empire had been trying to get control of the weapons."}, {"tag": "p", "text": "After the Battle of Yavin, the Tralus and Talus Liberation Party, a group fighting for the independence of the Double Worlds from the Corellian system, shipped weapons, medical equipment and valuable artifacts to the weapons depot in order to obtain the support of the Alliance. Around 1 ABY, a spacer working for the Aqualish Omkoo fought several TTLP soldiers in the depot to retrieve old artifacts stolen from an Aqualish gravesite."}, {"tag": "p", "text": "Following the Battle of Restuss, the Rebellion lost control of the weapons depot that became the site of regular fighting between Rebel and Imperial forces. Both factions established small camps nearby to support their assaults."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Weapons Depot was a location in the 2003 massively multiplayer online role-playing game Star Wars Galaxies, prior to the game's closure on December 15, 2011. In the earliest version of the game, the Weapons Depot was a Rebel \"Factional NPC Base\" named Rebel Weapons Depot. Groups of Imperial players could attack Rebel NPCs and achieve several objectives to take control of the base. With the release of the \"Chapter 2\" update on August 1, 2006, the \"Rebel Weapons Depot\" was turned into the \"Weapons Depot\". It became one of the three bases that players of each faction could capture, along with the Naboo Weapons Development Facility and the Corellian Tactical Training Facility."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}