{"url": "Weeteef_Cyu-Bee", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Males", "Category:Partisan members", "Category:Sharpshooters and snipers", "Category:Talpini"], "nodes": [{"tag": "h1", "text": "Weeteef Cyu-Bee"}, {"tag": "p", "text": "Weeteef Cyu-Bee was a male Talpini who served as one of the most destructive members of Saw Gerrera's Partisans on Jedha. The diminutive Talpini could hide easily among the taller beings that congregated in the Holy city. A sniper, Cyu-Bee specialized in explosives, and built the sticky bombs used against the Imperial patrols of AT-ST walkers and TX-225 assault tanks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male member of the diminutive Talpini species from Tal Pi, Weeteef Cyu-Bee joined Saw Gerrera's Partisans on the moon of Jedha prior to the Galactic Civil War. He became a valuable member of the group, as well as being, pound for pound, one of the Partisans' most destructive fighters. His diminutive size allowed him to hide easily among the taller beings that crowded the streets of Jedha City, and for this reason his small stature earned him infiltration missions into the city. A sharpshooter known for carrying a blaster pistol, Weeteef also utilized a tibanna-jacked DH-17/E-11 hybrid custom blaster rifle, and was an explosives specialist. He custom-built sticky bombs used by the Partisans against Imperial patrol vehicles in the Holy City, where the clever bomb-builder used his creations to bring down All Terrain Scout Transports and TX-225 GAVw \"Occupier\" combat assault tanks."}, {"tag": "p", "text": "In 0 BBY, Weeteef participated in a skirmish against an Imperial patrol in Tythoni Square. Weeteef's fellow insurrectionists attacked a TX-225 and its stormtrooper escorts in an attempt to steal the kyber crystal containers under transportation. Weeteef hid behind a low wall, communicating with his compatriots via comlink, and opened fire after explosives were launched at the patrol. Following the battle, Weeteef returned to the Partisans' base in the Catacombs of Cadera, handing over his blaster while Jyn Erso was led through the chambers to meet with Gerrera."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Weeteef Cyu-Bee was created for the 2016 film Rogue One: A Star Wars Story, and is portrayed by Warwick Davis under an animatronic headpiece. His look was inspired by a piranha, and his name is a slang derivation of his tiny, sharp incisors (\"wee teeth\")."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}