{"url": "Weik/Legends", "categories": ["Category:Legends articles", "Category:Terrestrial planets", "Category:Weik locations", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Weik"}, {"tag": "p", "text": "Weik was a terrestrial planet located in Wild Space far from established hyperlanes and nearly disconnected from the rest of the civilized galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet of Weik was a nexus of Force energy, flowing freely among the mountains and fjords. While the light side aspects of the Force were strong on Weik, the dark side was pervasive. Although the planet developed a rich biosphere, Weik never developed sentient life. Located on the fringes of civilized space, visitors to Weik generally landed on the planet on accident. An untamed wilderness at the edge of its star's habitable zone, the planet was cool even at the equator. Heavy snows blanketed the planet during the winter months, making it difficult for life to survive. A planet with small, deep seas that froze over often, Weik's continents were crisscrossed by towering mountain ranges."}, {"tag": "p", "text": "The population centers of Weik were scattered and disparate, unable to unite around a single culture due to geographical obstacles. Inhabited for thousands of years, migration stalled after an initial diaspora occurred while the original colonists still had some of their technology. Organized around a feudal society, travel from one city-state to the next took months on narrow roads and across turbulent seas."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Settled by Core World colonists representing the diversity of the early Galactic Republic, tens of thousands of colonists were diverted from their desired route as their ship passed through the mass shadow of a black hole and was sent tumbling into Wild Space. Surviving long enough to find a hospitable planet to land, the crippled ship landed not a day too soon. Crash-landing in the shallows of a sea, the surviving colonists made it to land and settled into their new home. As rescue never came, towns became cities and cities became states. Despite the efforts to salvage what they could from their ship, industry never developed on the world and technology eventually vanished. Histories were lost as civilization struggled to be reestablished for generations; reinventing all of the galaxy's most basic innovations from nothing. Entering into an iron age at a time when their origins were fading into myths and legends, the fragmented governments of city-states were too far apart to form a functioning planetary government."}, {"tag": "p", "text": "The economy that developed on Weik was based around farming and simple labor. Caravans and ships moved rare goods across the world as global trade began to reemerge, though techniques used to farm the land required vast amounts of time and effort. Xenophobia and prejudices based on gender and species were unheard of, having been eliminated in the earliest days of the colony's foundation. Some relics from the past remained in use, though manufacture of these goods did not exist. The Force was viewed as magic by those who could touch it, with schools of magical theory rising and falling over the centuries to study the rituals of shamans and magicians. The powers of the Paladins of the Adamite Tower were similar to those of the Jedi Order, while the Skyholme Lucites studied the dark side of the Force. Other groups, such as the Cendiary Priests and the Skyholme Astromancers practiced a more neutral study of the Force."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}