{"url": "WeeGee", "categories": ["Category:Legends articles", "Category:Masculine programming", "Category:Second-degree droids", "Category:Sulonese"], "nodes": [{"tag": "h1", "text": "WeeGee"}, {"tag": "p", "text": "WeeGee, nicknamed Weeg, was the Katarns' multi-purpose droid, hand-built by Morgan Katarn."}, {"tag": "p", "text": "The shape of an inverted \"U or V\", WeeGee was equipped with an extremely powerful, four-jointed heavy-duty arm that ended with a C-shaped grasping appendage. It was three times stronger than the left arm, which had a Human-shaped hand designed for using tools. WeeGee hovered two meters off the ground using a repulsorlift from an Imperial speeder bike and steering jets from a probe droid. On top of the drive assembly was a vertical sensor stack that contained WeeGee's oval-shaped optical lens. WeeGee communicated via beeps and whisles like a standard astromech-unit and wore a tool belt around his \"waist\"."}, {"tag": "p", "text": "WeeGee was considered part of the Katarn family, and was programmed by Morgan to protect his son Kyle at all costs. Probably not having been exposed to any memory wipes, the droid had developed a personality of its own."}, {"tag": "p", "text": "During the Subjugation of Sulon, the Ghost Battalion stormed into the Katarn homestead looking for Morgan, who, however was out. As Koyo and Santo opened the door to the workshop, WeeGee hurled a partially disassembled servo mechanism towards their leader. The commandos threw an antipersonnel grenade, and Santo put a beam through WeeGee's speaker grill to mute him. WeeGee considered against further resistance, and silently transmitted an electronic warning to Morgan."}, {"tag": "p", "text": "WeeGee remained out of commission and left dumped on the floor in one of the rooms in the Katarn House, which was guarded by enemy forces. Some years later, however, Kyle managed to sneak into the house and find him. Kyle activated the droid and had him decrypt and play back the message on a holodisc left by his father, which contained a message revealing the location of the Valley of the Jedi. It was also WeeGee that gave Kyle Qu Rahn's lightsaber on the behalf of Kyle's father."}, {"tag": "p", "text": "Together WeeGee and Kyle snuck out from the Katarn homestead via a secret underground tunnel. Somewhere in the tunnel they were attacked by a wardroid which WeeGee destroyed using his heavy duty arm. With the assistance of Jan Ors in the Moldy Crow and an old T-4 transport, WeeGee and Kyle managed to escape the enemy forces that guarded the Katarn House. WeeGee happily joined a maintenance team servicing the New Republic Defense Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the game Star Wars: Jedi Knight: Dark Forces II. Kyle does not escape the house together with WeeGee, but leaves him behind. He later appears again when Kyle and Jan use him to decipher the data in 8t88's head. WeeGee somehow shows up in the Valley of the Jedi after Jerec's defeat."}, {"tag": "p", "text": "However, the novella Dark Forces: Rebel Agent irreconcilably contradicts the story; Kyle does not have the heart to leave the droid behind, because he considers WeeGee to be the only family he has left, and decides to bring him along and leave him in Jan's custody. The fact that WeeGee reappears with Kyle and Jan later, both in the novella and the game, gives credence to the belief that he left Sulon with Kyle at one time or another."}, {"tag": "p", "text": "In one level at the beginning of Jedi Knight, it is possible to destroy WeeGee by dealing sufficient damage, although the droid can withstand a lot of damage. WeeGee explodes, instantly killing the player if he is close enough, and Qu Rahn says, \"For you the choice is the dark side.\" The player also shifts closer to the dark side by about a twentieth of the morality scale meter. However, the player can be redeemed by choosing light side powers and avoiding civilian casualties. This is obviously non-canon, since WeeGee is shown later in the game and in other works."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}