{"url": "Wenda", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Cyborgs", "Category:Females", "Category:Humans", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Wenda"}, {"tag": "p", "text": "Wenda was a human woman with long, black hair and a cybernetic implant in her left eye. Wenda and her friend Bett were pirates who led a criminal gang. A year after the Battle of Jakku, Wenda and Brett met with the former stormtroopers Corlac and Terex. Corlac convinced Terex that Wenda and Bett shared his plan to rebuild the Old Empire. They managed to persuade Terex to help them access the former Imperial Shipyards above Rothana. In secret, Wenda along with Corlac and Bett planned to kill Terex once he had out lived his usefulness. Terex however learned of their plot and killed them by blowing up the master control station using the corvette Carrion Spike's weapons."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wenda lived during both the Imperial Era and New Republic Era. She and the humanoid woman Bett ran a ship repair and salvage operation on the planet Kaddak. Wenda and Bett were also the leaders of a criminal gang that became known as the Ranc gang. Wenda and Bett were old associates of Corlac, who served as an Imperial stormtrooper during the Battle of Jakku. A year after the Battle of Jakku, Corlac traveled to Kaddak with his old comrade Terex to re-establish contact with his old associates."}, {"tag": "p", "text": "At some point, Corlac brought Terex to a meeting at a cantina with Wenda and Bett. Corlac managed to convince Terex that Wenda and Bett could help them rebuild the \"Old Empire\" if Terex helped them to gain access to the Rothana Imperial Shipyards. Wenda and Bett listened as Corlac recounted how Terex used to work at the Rothana shipyards before being dispatched as a stormtrooper to Jakku. Corlac claimed that Wenda and Bett had agreed to help them in exchange for any ships or parts they could not use. Terex was convinced by Corlac's arguments and agreed to help the criminal bosses gain access to the shipyard. In truth, Corlac had no intention of rebuilding the Empire and had connived with Wenda and Bett to build a pirate fleet."}, {"tag": "p", "text": "Later, Wenda and Bett along with their underlings including Wisper and Zumgi waited as Terex unlocked the shipyard's external doors. Wenda praised Terex for his work and instructed Wisper to take his team back to the shuttle and secure the shipyard. She warned him to be careful in case there were still security staff lingering around."}, {"tag": "p", "text": "After their gang had secure the shipyard, Wenda and Bett met with Corlac in the control station to discuss their progress. When Corlac opined that Terex would become a problem for their plans, Wenda replied that they would deal with it when they got there and warned them not to hasten things until Terex had finished fixing Grand Moff Wilhuff Tarkin's ship Carrion Spike. When Bett asked what was so important about that ship, Corlac explained that the Carrion Spike was equipped with a cloaking device and advanced surveillance systems. Corlac then advocated killing Terex because he had become an obstacle to their criminal enterprise."}, {"tag": "p", "text": "However, Terex had repaired the Carrion Spike's surveillance systems and learned of Corlac's plot. He then used the ship's weapons systems to obliterate the control station, killing Wenda, Bett, and Corlac. Terex then took control of the Ranc gang before joining the First Order who sought to overthrow the New Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wenda was a human woman with long black hair, fair skin, and a cybernetic left eye. She wore a purple vest over a white shirt and brown trousers. Wenda and Bett owned a large ship repair and salvage operation which doubled as a criminal gang. She was an associate of Corlac and shared his dream of creating a fleet of pirate starships using the resources of the Rothana Imperial Shipyards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wenda first appeared in the 2016 comic Poe Dameron 9, written by Charles Soule and illustrated by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}