{"url": "Welkins", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Republic Strategic Information Service personnel"], "nodes": [{"tag": "h1", "text": "Welkins"}, {"tag": "p", "text": "Welkins was a Human male who served the Galactic Republic during the Cold War against the Sith Empire. During the war he served as an agent of the Republic Strategic Information Service and was sent to the planet Taris, where he was tasked with investigating reports of the sale of the chemical Titroxinate on the planet's black market. He discovered the source of the chemical being sold was an old ChemWorks Factory in the ruins of Taris, and he sent a group of Republic heroes on a mission to clear it out, recovering any Titroxinate they found their and bringing it back to him. The heroes succeeded in their mission for which he rewarded them individually."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Welkins was a male Human alive during the Cold War, a galaxy-spanning conflict between the Galactic Republic and the Sith Empire following the Great Galactic War. During the war, Welkins served as part of the Republic's forces and was assigned to the Republic Strategic Information Service, the Republic's military intelligence agency. Within this organization he held the rank of agent and was assigned to the Republic-held planet of Taris within the Taris system of the Outer Rim Territories."}, {"tag": "p", "text": "The planet's huge ecumenopolis was at the time still under reconstruction as part of the Taris Resettlement Initiative after the devastating bombardment by the Sith Lord Darth Malak during the Jedi Civil War as well as the effects of the Rakghoul plague. Whilst on the planet Welkins learned of the sale of a chemical known as Titroxinate, which was believed to have partially caused the Rakghoul plague, on the world's black market. Investigating the sales he eventually discovered that the source of the chemical being used by the sellers was an ancient ChemWorks Factory, which was soon to collapse, but still contained canisters of Titroxinate."}, {"tag": "p", "text": "Stationed at Waypoint Station Draay, the closest Republic base to the factory, Welkins hoped to retrieve the chemicals from the factory and asked that a group of trusted Republic heroes, who were each pursuing their own mission on Taris, do so whilst they were there. The group, which consisted of the smuggler known as Hotshot, the Jedi Hero of Tython, the Jedi consular who would become Barsen'thor and the leader of Havoc Squad at the time, the four traveled to the factory where they fought numerous Rakghouls and successfully recovered the Titroxinate stored there. Upon their return the heroes brought the canisters of chemicals back to Welkins, for which he thanked them and rewarded each with a piece of equipment and credits."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Welkins was a tanned Human male with brown hair and eyes who spoke fluent Galactic Basic. He was overweight for a Human despite his military profession and wore armor whilst on Taris to defend himself from the planet's many dangerous inhabitants."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Welkins first appeared in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears on the Republic version of Taris and gives players the quest Toxic heirlooms in Waypoint station Draay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}