{"url": "Wernell_Covington", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wernell Covington"}, {"tag": "p", "text": "Wernell Covington was a Human male who lived in the city of Narmlé on Rori during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wernell Covington was a wealthy land owner who lived on Rori, a moon of Naboo. Sometime during the last decade of the Old Republic, his beloved daughter Felicia was kidnapped. Despite attempts to pay the ransom and the best efforts of law enforcement officers, Felicia was killed by the kidnappers. She was jettisoned into space from the starship on which she was being held. Covington was traumatized by the awful fate of his daughter and became committed to the task of avenging her death. During almost three decades, Wernell Covington tracked all the murderers one by one and even personally killed a number of the kidnappers. By the time of the Battle of Yavin, Covington's age and diminishing wealth forced him to turn to someone else to eliminate the remaining two perpetrators. To that end, he hired a spacer to investigate the whereabouts of the remaining kidnappers. The spacer was recommended to him by an associate, Lieutenant Varias of the Corellian Security Force. With the help of Horace Korr, a retired Corellia Times reporter, the spacer was able to identify the two kidnappers: Jurgen Nath and Vladlun Travan. An associate of Covington in the Narmle Militia was later able to provide the last known locations of the criminals. The spacer eventually tracked the murderers to their bunkers. The spacer succeeded in killing them, allowing Covington to live out his days in peace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wernell Covington was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Wernell Covington was added to the game with the release of the \"Game Update 12\", on August 10, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}