{"url": "Wentell_Pron", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Republic individuals", "Category:Males", "Category:Rodians", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Wentell Pron"}, {"tag": "p", "text": "Wentell Pron was a Rodian male smuggler who worked with the Galactic Republic army during the Cold War. He stayed on the planet Ord Mantell during part of the war, where he aided in the fight against the Mantellian Separatist Movement in the Ord Mantell Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wentell Pron was a Rodian male who worked as a smuggler during the Cold War, a conflict between the reconstituted Sith Empire and the Republic. During the he helped the Galactic Republic's army and worked with them on the Republic held planet of Ord Mantell in the Bright Jewel system of the Mid Rim. Whilst stationed on the planet he and all Republic forces aided the corrupt local government in fighting the Mantellian Separatist Movement."}, {"tag": "p", "text": "During the civil war he stayed in Fort Garnik, a Republic stronghold on the planet, where he worked with another Rodian named Tweeta. Pron looked to make new connections in the smuggling world whilst on the planet and Tweeta would direct anyone she met who she suspected shared her trade to him."}, {"tag": "p", "text": "Tweeta at one point in the war directed a Smuggler who worked with Rendia Freight to Wentell. The smuggler paid the Rodian at least once to teach them a number of combat and smuggling techniques."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time at Garnik, Wentell Pron wore a jacket colored in red, brown, and yellow, along with a pair of brown and yellow pants and boots. He was armed with a blaster pistol which he kept attached to his belt at the hip when not in use."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wentell Pron is a Non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is the first Smuggler class trainer in the game and the only one on Ord Mantell. It is not possible for players of the Imperial faction to interact with Pron as there is currently no way Imperial characters can travel to Ord Mantell."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}