{"url": "Wenton_Chan/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Alliance Starfighter Corps personnel", "Category:Corulag residents", "Category:Humans", "Category:Males", "Category:Red Squadron personnel", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Wenton Chan"}, {"tag": "p", "text": "Wenton Chan was a Human male from the Core World of Corulag, where he gained flight experience by piloting T-16 skyhoppers. During the Galactic Civil War, Chan volunteered to serve the Alliance to Restore the Republic, joining their starfighter corps and flying a T-65 X-wing starfighter. By 0 BBY, he held the rank of lieutenant. Chan was assigned to Red Squadron as Red Eleven, and was stationed at Yavin Base on Yavin 4. Once the location of the hidden base had been discovered by Imperial forces, Chan was part of the Rebel starfighter forces mobilized to attack the Death Star, the Empire's planet-destroying superweapon. During the subsequent battle, Chan was killed in combat, although the Alliance managed to secure victory by destroying the battlestation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male born on the Core World of Corulag, Wenton Chan grew up in a wealthy, privileged family. He learned to fly by piloting T-16 skyhoppers, but eventually left his family and homeworld due to their Imperial connections. Chan became a smuggler and gunrunner, before eventually joining the Alliance to Restore the Republic during the Galactic Civil War. He chose to serve in the Alliance Starfighter Corps due to his skill behind the controls of a starfighter, and was assigned to the Griffon Flight Wing. By 0 BBY, Chan had attained the rank of lieutenant, and had been transferred to Red Squadron stationed at the hidden headquarters of the Alliance, Yavin Base, on the moon Yavin 4. Chan had the call sign Red Eleven, and led the unit's third flight."}, {"tag": "p", "text": "Following the destruction of the planet Alderaan, Yavin Base was discovered by the commanders of the Galactic Empire's new superweapon, the Death Star. Imperial forces, under the direction of Lord Darth Vader and Grand Moff Wilhuff Tarkin, had planted a homing beacon on the freighter Millennium Falcon. The ship's crew and passengers—which included the smuggler Han Solo and his Wookiee partner Chewbacca, as well as the Jedi Knight Obi-Wan Kenobi and the farmboy Luke Skywalker—had infiltrated the battlestation in the Alderaan system. On board, they effected the rescue of Princess Leia Organa, Alderaan's former senator and a high-ranking member of the Rebel Alliance. They were allowed to flee the Death Star—carrying the plans of the new battlestation with them—so that the Empire could track them to the hidden Rebel base. General Jan Dodonna, commander of Yavin Base, analyzed the plans and found a weakness—a thermal exhaust port, located in one of the Death Star's surface trenches, would be vulnerable to a proton torpedo assault. A successful attack would trigger a chain reaction that would destroy the station."}, {"tag": "p", "text": "Following the homing beacon concealed on the Millennium Falcon, the Death Star entered the Yavin system. As the Death Star approached Yavin 4, the starfighter squadrons at the base mobilized to meet the incoming threat. Under the command of Garven Dreis, Chan launched in his T-65 X-wing starfighter alongside the other members of Red Squadron. During the battle, Chan was killed in combat; however, the Alliance managed to secure victory when another member of Red Squadron, Luke Skywalker, completed a dangerous run down the target trench and released proton torpedoes into the thermal exhaust port. The Death Star was destroyed, saving the personnel at Yavin Base and ending the threat the battlestation posed to the galaxy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite a privileged childhood, Wenton Chan rejected his family due to their connections to the Galactic Empire, opting for a life living on the fringe, and, eventually, as a Rebel pilot. A talented flyer, Chan was able to quickly transition from the T-16 skyhopper to the T-65 X-wing starfighter. Like nearly all Rebels, he volunteered for service with the Alliance, willingly risking his own life to defeat the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wenton Chan first appeared in 1977's Star Wars: Episode IV A New Hope as an unnamed Rebel fighter pilot during the hangar launch sequence prior to the attack on the Death Star. Eighteen years later, Decipher, Inc. released the Star Wars Customizable Card Game; one of the cards in the Premiere Limited set identified the pilot as Wenton Chan, a Corulag native. 1998's Star Wars Encyclopedia established that he was a member of Red Squadron during the Battle of Yavin, while 2008's The Complete Star Wars Encyclopedia gave him the callsign of Red Eleven. In 2012, The Essential Guide to Warfare included Chan in a roster of Red Squadron at the Battle of Yavin, and expanded on his background. An X-wing pilot figure in a LEGO set released that same year was later identified as Wenton Chan in a display at the 2014 San Diego Comic Con."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}