{"url": "Wes_Janson/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Combat instructors and training officers", "Category:Humans", "Category:Impersonators", "Category:Jedi Coalition personnel", "Category:Males", "Category:Rakehell Squadron personnel", "Category:Red Squadron personnel", "Category:Rogue Squadron personnel", "Category:Sharpshooters and snipers", "Category:Tierfon Yellow Aces personnel", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Wes Janson"}, {"tag": "p", "text": "Wes Janson ((pronounced /Wěs Jǎn'-sǔn/)) was an ace starfighter pilot of the Alliance to Restore the Republic and New Republic. Janson first joined the Alliance prior to the Battle of Yavin, but contracted an illness that prevented him from flying in that engagement. He later served with Rogue Squadron, the Rebellion's most elite starfighter squadron. As a key member of the Rogues, he fought at the battles of Hoth and Endor, among others. After Endor, Janson flew in multiple engagements as part of Rogue Squadron, including covering the defection of Imperial Grand Vizier Sate Pestage. Following that mission, Rogue Squadron was temporarily disbanded and Janson, along with his good friend Derek Klivian, were assigned to train new pilots. He would later go on to serve with Wraith Squadron, the New Republic's pilot/commando unit. Janson was the first executive officer of the squadron and saw action both in space and on the ground during commando missions against Warlord Zsinj. After Zsinj was defeated, Janson transferred back to Rogue Squadron. Janson eventually reached the rank of Major after years of service fighting against the Galactic Empire, including in campaigns against Prince-Admiral Delak Krennel and Grand Admiral Thrawn, as well as a diplomatic mission to Adumar."}, {"tag": "p", "text": "Janson retired from active service after the end of the Galactic Civil War, but returned to serve the New Republic by leading a group of volunteers during the Yuuzhan Vong War. The Yellow Aces were heavily involved at the Battle of Borleias, garnering a reputation as an elite unit. After the Yuuzhan Vong surrender, Janson retired again, but peace was fleeting. He would once again return to combat in the Second Galactic Civil War, joining Rakehell Squadron in support of Luke Skywalker's insurgency against Jacen Solo, who had fallen to the dark side. Janson flew in the Battle of Centerpoint, providing cover for Jedi infiltration teams."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Galactic Civil War"}, {"tag": "p", "text": "Wes Janson, a native of Taanab, originally joined the Rebel Alliance as a member of the Tierfon Yellow Aces, a BTL Y-wing starfighter training squadron during the early years of the Galactic Civil War. The group was based out of the Tierfon Rebel Base. The aim of the Yellow Aces was to engage pilots in technically \"active\" missions, but to avoid pitting them against too hazardous of a situation in preparation for more dangerous duties in the future."}, {"tag": "p", "text": "As a member of the Yellow Aces, Janson racked up an impressive kill record and earned a tremendous reputation. However, it was on one of his first missions with them that Janson was faced with a difficult decision. The Yellow Aces were tasked with ambushing an Imperial convoy carrying supplies that the Alliance needed badly. When the convoy arrived at their destination, its armed escort was larger than anticipated. One pilot, Kissek Doran, was suddenly struck with panic and tried to leave the group. With the prospect of compromising the entire ambush party if he was detected by the Imperials, Janson and Jek Tono Porkins were ordered to bring him back. Since using his ion cannon would give away their position, Janson was forced to use his lasers, destroying the fleeing pilot—it was his first kill."}, {"tag": "p", "text": "Nevertheless, Janson's service with the Yellow Aces was considered exemplary. He was quickly promoted to Lieutenant and was awarded the rank of True Gunner for \"consistent excellence and superior performance as an officer and a gunner,\" according to General Jan Dodonna at a Tierfon Fighter Base awards ceremony. While with the Yellow Aces, Janson formed a strong friendship with Porkins, nicknamed \"Piggy.\" Coming out of the same training class, they quickly bonded. Janson would often recall some rather tall tales of their days together at Tierfon. He also met Tomer Darpen in the squadron, whom he would later encounter on Adumar."}, {"tag": "p", "text": "With the destruction of Alderaan and the threat of the Death Star, the Yellow Aces were placed on \"full active\" duty. An emergency list was compiled of pilots who would be transferred to Yavin Base. Wes Janson was on that list. However, at the time of the transfer, Janson was stricken with Hesken Fever, having contracted it while on a scouting mission, and was unable to go. Even though the ailing Janson firmly insisted on his ability to fly, a replacement was named to fill his slot on the transfer list. That someone was Jek Porkins. Porkins never returned from the assault on the Death Star, and Janson often blamed himself for the death of his friend. From that point forward, he vowed to fly to honor his fallen friend. Future heroics would help alleviate some of the guilt and pain he carried with him."}, {"tag": "h3", "text": "Joining Rogue Squadron"}, {"tag": "p", "text": "Wes Janson was among the first crop of pilots to join the new Rogue Flight under the command of Rebel pilot and aspiring Jedi Knight Luke Skywalker after the destruction of the Death Star. With the Rogues, Janson was permanently assigned to the roving Alliance High Command group. He performed well in several skirmishes during the Thila evacuation, helping Rogue Flight prove their worth. Six months after Yavin, he participated in the campaign against Moff Kohl Seerdon, including action at the Raid on Balmorra, where he helped to cripple the Empire's production of AT-AT walkers for some time; and the Second Battle of Thyferra, which saw the death of Seerdon."}, {"tag": "p", "text": "As a member of the Rogues, Janson became immediate friends with fellow pilot Wedge Antilles. The two would often fly as one another's wingman. During several training maneuvers, Janson saved his friend's T-65 X-wing starfighter from being painted by target-drone beams by destroying them long before Antilles realized there was a problem. The two also shared numerous interests, including a mutual appreciation for both Corellian ale and sabacc."}, {"tag": "p", "text": "On one mission, while scouting for a new Rebel base location, Janson and the rest of the Rogues were on Kwenn Space Station. After they observed the Empire taking over a freighter, the Stellar Manx, the Rogues decided to investigate. Three pilots, Wedge Antilles, Tycho Celchu, and Janson, disguised themselves and entered Hangar 872-H. While viewing the Stellar Manx, they were confronted by a group of stormtroopers. The three Rebel pilots evaded the troopers and eventually liberated the crew of the freighter from Imperial custody, as well as capturing the ship itself. During this operation, they discovered that the Stellar Manx was on a secret mission bound for Bonadan to meet with Frap Radicon to research gravity well technology. This plan was later disrupted by the Rebel Alliance."}, {"tag": "p", "text": "Janson also flew a T-47 airspeeder on a terrestrial mission alongside Antilles some time after the Battle of Yavin. During the mission, while dogfighting against Imperial TIEs, Antilles requested that Janson take a look at his speeder and check it for problems. A flabbergasted Janson reported that Antilles had a Wookiee hanging from his craft—Chewbacca. Thankfully for the Wookiee and Antilles, the Rebels pulled off a mid-air boarding maneuver that allowed Chewbacca to steal a TIE fighter and return safely."}, {"tag": "p", "text": "When High Command relocated to the newly established Echo Base on the planet Hoth in 2 ABY, Janson was transferred there along with the rest of Rogue Group. Due to his renowned gunnery abilities and the supplement of pilots serving with Rogue Group to operate their two-seated T-47 airspeeders, Janson was assigned to be Antilles' rear gunner. When the Empire located Echo Base and launched a subsequent assault in 3 ABY, Janson and Antilles were able to bring down the first AT-AT walker during the battle, employing a tactic that involved using the speeder's harpoon and tow cable to trip the walker's legs. Their snowspeeder was shot down during the battle, though Janson and Antilles suffered no major injuries. They abandoned their craft and made it safely back to the base where they prepared to evacuate. Janson then manned the rear gunner position of a BTL-S3 Y-wing starfighter, with fellow Rogue Derek \"Hobbie\" Klivian at the controls, for the run through the Imperial blockade of the planet. Along with Antilles and Skywalker in their X-wings, the three ships ingeniously used the Tallon split to help the GR-75 medium transport Thon's Orchard escape into hyperspace. From there, Janson regrouped with the rest of the Rogues at the secret rendezvous point.\nAntilles would later tell new recruits about him and Janson being stranded on Hoth for months, with Janson eventually being slain at the hands of scavengers, only to have Janson emerge, alive and well."}, {"tag": "h3", "text": "Helping the search for Solo"}, {"tag": "p", "text": "During Luke Skywalker and Leia Organa's attempt to rescue Han Solo from the bounty hunter Boba Fett, Janson, as part of Rogue Squadron, was based on the moon of Kile at a temporary facility set up for them. Skywalker's plan had them attack two entire wings of TIE Fighters, plus two Imperial-class Star Destroyers in a surprise raid on Gall. The real purpose of the assault was to make a distraction, allowing the Millennium Falcon and the Outrider to reach Fett's craft and rescue Han."}, {"tag": "p", "text": "When the Imperials launched more TIE fighters, Skywalker called for a retreat as the Rogues were beginning to take casualties. However, Janson's astromech droid suddenly took control of his X-wing. Programmed by a bribed technician, his ship began shooting at Skywalker's X-wing, with Janson powerless to stop it. Thankfully for Janson, Skywalker managed to disable Janson's rogue droid without causing any injury to him."}, {"tag": "p", "text": "Later, Janson and the other Rogues participated in a space brawl over Coruscant against forces of the Black Sun criminal empire while escorting the Millennium Falcon to safety from a mission to rescue Leia Organa from Black Sun captivity. Ultimately, the intervention of the Imperial Navy, particularly the Executor, resulting in the destruction of the Black Sun leader's skyhook allowed the Rogues and the Falcon to escape in the confusion."}, {"tag": "h3", "text": "Endor and beyond"}, {"tag": "p", "text": "Janson flew with Red Group in the Battle of Endor, where he rendered \"meritorious service\" as a pilot. He also flew in the Battle of Bakura. After returning from Bakura, Janson and Tycho Celchu were assigned to ground patrol on the surface of Endor in search of an Imperial patrol that the native Ewoks had told the Alliance about. During the patrol, Janson and Celchu were attacked by a gorax—however, Janson's skill with a blaster pistol allowed him to kill the beast with a single blast to the eye. After the incident, they were recalled to base and given a new assignment under Luke Skywalker."}, {"tag": "p", "text": "On this mission, Janson accompanied Skywalker, Celchu, Ten Numb and Antilles to Corellia as part of the under-strength Rogue Squadron. Janson and the other Rogues, having not found any trace of the Empire, were enjoying themselves in a local tapcafe when they were attacked by Imperial forces, who had come to reclaim the planet. Recovering from the assault, the Rogues counter-attacked and pursued Imperial General Weir. Weir, however, escaped Corellia after capturing Numb. Janson, Antilles, and Skywalker pursued Weir on speeder bikes, but Weir managed to escape on a transport. Celchu and the R2 units brought the pilots their craft and the Rogues pursued the fleeing general. Distracted by a suicide fighter attack on a civilian convoy, Rogue Squadron was delayed long enough for Weir to flee to Tralus, but Skywalker, Janson, and the others followed them into Tralus's tunnels. With the aid of native Selonians, the Rogues tracked down Weir's base and attacked it in an attempt to save Numb. Janson and R2-D2, splitting up from the others, were able to find Numb, but the Sullustan pilot had already been killed. After returning from the mission to Tralus, Antilles took over the squadron, with Janson continuing to be a part of the squadron even after its reorganization."}, {"tag": "h4", "text": "Shot down on Cilpar"}, {"tag": "p", "text": "On a mission to Cilpar Janson was shot down by enemy TIE fighters, and crash-landed on the planet, breaking his leg and a number of ribs in the process. Celchu managed to land his fighter and find the injured Janson, and carried him to a nearby cave, tending to his wounds while waiting for rescue, though Janson was unimpressed by Celchu's cooking."}, {"tag": "p", "text": "While in the cave, Celchu and Janson met up with Winter, who was disguised as Princess Leia. Winter gave Celchu a new assignment, sending him to impersonate an Imperial officer and infiltrate the local garrison while she stayed with Janson. While Janson and Winter were in the cave, Janson was able to learn Celchu's history from her."}, {"tag": "p", "text": "After some time Winter left Janson for a short period, and went to check on Celchu's fighter—however, during the inspection the fighter took off with her inside of it. Having managed to return to the cave after defeating a flight of TIE fighters, Winter and Janson remained in hiding. However, a member of the local resistance who was aiding the Rogues was actually an Imperial spy. He brought the Empire to the cave and both Winter and Janson were captured and taken to the local Moff's palace, with Winter being mistaken for the real Princess Leia. Having arrived at the palace, the Imperials kept Janson in the infirmary due to his injuries rather than a cell or even in the Moff's company, as Winter was."}, {"tag": "p", "text": "The successful attacks from an anti-Imperial insurgent named Elscol Loro and Antilles' Rogues allowed the Rebels to capture the Moff and rescue Janson, liberating Cilpar from the Empire in the process."}, {"tag": "h4", "text": "Mission to Mrlsst"}, {"tag": "p", "text": "Following his rescue on Cilpar, Janson remained convalescent in a Lambda-class shuttle while the other Rogues, with Elscol Loro newly added, were tasked with the escort of a convoy to Mrlsst—along the way they fought off an attacking Imperial fleet. During the defense, the Wookiee Groznik, in the shuttle with Janson, grew quite anxious at Loro being placed in danger due to his life debt to her, which aggravated Janson. Spending the first few days or so in a Mrlssti hospital, Janson was present when a warrant was issued for their arrest after they were implicated in stealing the datacards of the Phantom Project, an experimental weapon desired by both the Empire and Rebellion, though the datacard was actually a fake. Breaking out of the hospital on the repulsor bed and still clad in pajamas, Janson, accompanied by several other Rogue pilots, Groznik, and smuggler Mirax Terrik, made their way out of the city, chased by Imperials. Shooting out the safety control on Janson's repulsor bed, the Rogues flew up to the top of Mrlssti's greenstalk trees, finding refuge in a treetop village, and out-distancing their pursuit."}, {"tag": "p", "text": "Janson, apparently healthy enough to fight, joined Plourr Ilo and Klivian in rescuing Antilles, who had been captured by the Empire. Little did they know that Antilles had already managed to escape from Imperial custody. The group was mostly united when the Empire decided to attack Mrlsst out of vengeance for the destruction of the Phantom Project datacards. Janson helped defend the planet from the attack, and the use of another experimental Mrlssti superweapon forced the Empire to withdraw after heavy losses."}, {"tag": "h4", "text": "Battle on Tatooine"}, {"tag": "p", "text": "Following their return from Mrlsst, Janson—now fully recovered—and the other Rogues went to Tatooine in support of an Alliance agent (later revealed to be Winter). Janson, Klivian, Ilo, and Dllr Nep were sent to check out the local lowlifes and to investigate the intensity of the gang wars that had sprung up in the wake of Jabba the Hutt's death. Janson's group went to a local cantina on Nep's recommendation, which Janson later reflected was a bad idea—he thought the band was awful, Ilo got into a barfight, and the group was kicked out. Outside of the cantina, the group was hired by a Devaronian to cause some trouble at a local ranch, but without bloodshed, since his original employees had been beaten by Ilo. Janson agreed, for the price of eight hundred credits, over Ilo's objections, having noticed the man's military-grade blaster. Janson wanted to play along until he could determine what the Devaronian was actually planning, not knowing that the target was the Darklighter farm where Antilles, Celchu, Loro, and Winter were. Janson's group was to be a diversion to allow Winter unnoticed access to Darklighter's safe, but another group of raiders attacked the Darklighter residence first and a pair of Rodians stole the datadisks that Winter sought."}, {"tag": "p", "text": "Accompanied by the Devaronian, the group set out for the farm, but stopped after they noticed that it had already been attacked. Janson attempted to interrogate the Devaronian, but he refused to answer and resisted them. Winter and Celchu flew by on a speeder in pursuit of the Rodians, but their speeder was shot down, and they joined Janson's group, where Winter identified the Devaronian as her associate, Kapp Dendo. Winter then returned to the Darklighter farm and wrested a copy of the data disk from Darklighter. The next morning, Janson and the other Rogues took flight in their X-wings, heading for the arms cache location that Winter had decrypted. The cache was actually weapons and gear pirated from the Eidolon, looted by Firith Olan, who launched TIE Interceptors after them. Handily defeating Olan's fighters, they pursued his ship into space, but the arrival of Imperial fighters, who were also after Olan, prevented them from disabling his craft, and he escaped to Ryloth."}, {"tag": "p", "text": "While Antilles, Loro, Celchu, and Winter journeyed to Ryloth on a freighter, Janson, Ilo, Nep, and Klivian remained behind on Tatooine. Unfortunately for them, the Empire retrieved Olan before Antilles could and obtained valuable information from him. Upon their return from the Twi'lek homeworld, the Rogues were reunited and gained the aid of Sixtus Quin and his ex-Imperial commandos. Pursuing the Imperials back to the location of the Eidolon, Janson and the other Rogues flew cover while Winter landed Sixtus and his men in a two-pronged attack on the Imperial forces hidden there. Despite Celchu and Ilo being shot down, the X-wing pilots destroyed the TIEs while Sixtus's men successfully secured the base and killed the Imperial leader, Captain Semtin."}, {"tag": "h4", "text": "Trouble on Eiattu"}, {"tag": "p", "text": "Approximately one month after the events on Tatooine, Rogue Squadron received a new recruit by the name of Feylis Ardele. Ardele was recruited by Admiral Ackbar due to her experience and proficiency in flying the TIE Series fighters, and during a training simulation, she managed to shoot down Janson."}, {"tag": "p", "text": "While the squadron was getting to know its new pilot, Antilles and Celchu were introduced to the Grand Duke Gror Pernon, the uncle of the Rogue's own Plourr Ilo. The Grand Duke told those gathered of the problems being experienced on his homeworld of Eiattu, and also of Plourr Ilo's royal lineage—which effectively made her a Princess of Eiattu. Pernon asked for Rogue Squadron to escort Ilo back to her homeworld so that she could try and mend the wounds of the broken world."}, {"tag": "p", "text": "Janson, along with the remainder of Rogue Squadron, accompanied Ilo on her homeward trek. Once on Eiattu, Janson, Klivian, and a number of the other Rogues decided to ride a group of trained thuvasaurs and explore the wild countryside. During their sightseeing, Janson and the others came under intense fire from Imperial ground forces who had been in pursuit of the People's Liberation Battalion (PLB). During the firefight, Janson got in touch with Antilles and requested immediate air support—the Rogues, accompanied by Count Rial Pernon, responded to the call and drove off the Imperial air cover that was strafing Janson and the others. Following the skirmish, Janson and the other grounded Rogues were unable to be extracted, but were instead found by the members of the PLB and taken back to the rebel camp. That night, Janson met the PLB leader Harran, who was actually an Imperial spy—the real Harran was Harrandatha Estillo, a deceased prince of Eiattu and the younger brother of Plourr Ilo."}, {"tag": "p", "text": "The following day, soldiers of the PLB led the Rogues back the city where Antilles and the others were. Upon arrival, Janson and Hobbie were debriefed by Antilles and Celchu on what had happened during the previous day's firefight, and what they had witnessed during their stay with the PLB. The gathered pilots came to the conclusion that there was something suspicious about the way the Imperials had acted the previous day and that they were probably hiding something in the swampy area. Janson, Klivian, another Rogue pilot named Nrin Vakil, and some of the others organized themselves into a squad and went back to the swamp to aggressively patrol the area for any signs of the Imperials—however, Janson and his patrol were ambushed by a number of scout troopers, with Vakil appearing to have been killed. Janson and the patrol, minus Vakil, were captured and taken back to the Imperial stronghold."}, {"tag": "p", "text": "While in Imperial custody, Janson learned that Harran was actually an Imperial spy and in league with Moff Leonia Tavira. Janson's and the others captivity had coincided with a PLB attack and subsequent showdown between Ilo and the spy claiming to be her long-dead brother. Meanwhile, Vakil, who had managed to survive the Imperial ambush, made his way to the prison where the captured Rogues were being detained, and set them free."}, {"tag": "p", "text": "The conflict on Eiattu came to an end with the capture of the fake Harran, Moff Tavira being driven from the planet, and with Ilo assuming the royal office and deciding to stay and help fix the planet from which she came."}, {"tag": "h4", "text": "Search for the Starfaring"}, {"tag": "p", "text": "Returning from Eiattu, the Rogues, minus Ilo, were sent to search for the Starfaring, a ship with a crew of Bothans that disappeared somewhere in the Malrev system. Using his Sullustan hearing, Nep guided the squadron down onto a forested planet to where the Starfaring was, but they were attacked by a group of TIEs and Antilles was shot down."}, {"tag": "p", "text": "Making camp for the night with the Bothans at the Starfaring's landing site, Janson and the others planned to search for Wedge the next day. Janson and Klivian were intrigued and attracted to the female Bothan dancers, but were distracted when they went to aid Vakil when he got in a fight with some of the Bothans. Janson and the other Rogues were beaten up, though not severely. Suddenly, the entire camp was attacked by the irrukiine beasts wielding Imperial blasters and the Rogues and Bothans joined together to beat the beasts off. After the attack, Janson and Celchu stood first watch, though apparently afterwards Janson spent the night with one of the Bothan females. The next day, the Rogues and some of the Bothans went in search of Wedge, but were attacked by irrukiine upon approaching a large temple that served as a focal point for Sith dark side powers. Janson and the others retreated, and were joined by Antilles, who had escaped captivity in the temple during the confusion of the firefight. However, Klivian and Herian were injured and Nep, drawn to the \"music\" generated by the temple, remained behind."}, {"tag": "p", "text": "Wedge took Tycho and Janson on a short flight in their X-wings to get away from the Bothans. Wedge informed them that a Devaronian named Cartariun was using the temple to control the irrukiine and was trying to take over the world. As they approached the temple from the air, Cartariun sent irrukiine in TIEs after them, guiding the normally-savage beasts with the Force in a manner similar to battle meditation. As the Rogues battled through the horde of TIEs, Janson told the others that he was damaged and had his astromech fake damage to the ship, but actually was duping the enemy. His gambit paid off and several TIEs were destroyed that way. The assault was broken off when Nep managed to resist the lure of the Temple long enough to distract Cartariun. Janson and the other airborne Rogues returned to the Starfaring, only to learn that Girov Dza'tey, the Bothan commander, had betrayed them to take over the temple and that Girov was a trained military officer."}, {"tag": "p", "text": "Wedge conferred with the Bothan second-in-command and convinced him to launch a ground assault while the Rogues attacked the Temple from the air. Janson helped the mostly recovered Klivian into his fighter, and the squadron launched their airborne assault to destroy the temple. Unfortunately for them, Girov had taken over the temple and, as a trained officer, was more adept at controlling the irrukiine and was using TIE Interceptors to augment his firepower. As the battle became more desperate, the injured Herian, in mental contact with Nep, took a grounded X-wing to the temple, guided in by Dllr's mind. Arriving just in time to cover the attack, Plourr Ilo returned with a squadron of Z-95 Headhunters. Herian crashed her ship into the temple, destroying it. The Rogues and Ilo's fighters easily mopped up the remaining fighters, now uncoordinated, but both Herian and Nep perished."}, {"tag": "h4", "text": "Battle for Brentaal IV"}, {"tag": "p", "text": "Following the events in the Malrev system, the Rogues were tasked with performing a reconnaissance sweep in Imperial space of Brentaal IV of the Bormea sector—Wedge, Vakil, Ilo, Celchu, and Janson were tapped for this mission. Following a short skirmish with a flight of Imperial TIE fighters, Vakil managed to get the information that had been requested on the planets defenses, The sweep was a considered a success."}, {"tag": "p", "text": "Once Janson and the others had returned to the Rebel base, Wedge and Tycho were presented with four new pilots to replace the Rogues' depleted ranks. Dar Keyis, Standro Jcir, Avan Beruss, and Xarcce Huwla were all added to the Rogues' roster. After the new pilots were introduced to the other Rogues and shown to their quarters, Admiral Ackbar advised Antilles and Celchu that Rogue Squadron would be supporting Colonel Horton Salm and Aggressor Wing in the upcoming offensive in the Bormea Sector. The plan called for a foothold to be gained by capturing one of Brentaal IV's two moons and using it as a staging area for the larger attack against Brentaal IV itself."}, {"tag": "p", "text": "Janson and Rogue Squadron, along with Aggressor Squadron, attacked their objective in the Bormea Sector, but were encountered by an unidentified Imperial fighter squadron which began to harry the attacking Rebel starfighters. Shortly after the confrontation began, Klivian's X-wing was unexpectedly hit and he crash-landed on the moon's surface, though not before ejecting from his doomed craft. For the most part, the attack went off without any other trouble and Alliance troopers were able to capture the Imperial hangar on the moon. Once the Rogues and Aggressors had pulled back to the Rebel base at Delta-Nine it was discovered that the unidentified Imperial squadron was actually the 181st Imperial Fighter Group which was under the command of Baron Soontir Fel."}, {"tag": "p", "text": "Following a short rest on Delta-Nine, Janson and the Rogues were transferred to the newly captured Brentaal Moonbase, and were provided a briefing for the upcoming battle. During the briefing it was reported the Fel had recently been spotted on Brentaal IV, and that it was imperative that the Rogues engage and prevent Fel and the 181st from hitting the Alliance ground troops. Not long afterwards, Rogue and Aggressor squadrons flew to Brentaal IV and began the attack—although the spaceport of Oradin was captured, Fel and the 181st managed to cause the Rebel forces severe damage. Both Wes Janson and Ibtisam were shot down, and Aggressor Squadron was hit badly, losing a number of its pilots."}, {"tag": "p", "text": "Once on the ground, Janson and Ibtisam were recovered by Alliance Intelligence agents led by Kapp Dendo. They were taken to the Intel agents' hidden base and shown the plans for the upcoming attack on Vuultin. Not long after, the attack began and the Rogues and Aggressors were once again on the offensive. Fel and the 181st engaged the Rebels, and during the fight Standro was shot down and killed. Meanwhile, Dendo, Janson, and Ibtisam led a ground assault against a massive air-defense network that Admiral Lon Isoto had had constructed. During the assault, Janson received a minor shoulder wound from stormtroopers who were defending the complex. Even though Janson was wounded, he and the others managed to set a number of explosive devices at key points and destroy the air defenses, thus taking pressure off of the attacking Rebel starfighters and allowing Rebel assault ships to land with ground forces. The Rebels managed to capture Brentaal IV and drive the Imperials from the sector—following the battle, Janson and Ibtisam were reunited with Rogue Squadron. Additionally, the Rebellion captured Baron Soontir Fel, and he agreed to fly for the Rebellion."}, {"tag": "h4", "text": "Mission to Corellia"}, {"tag": "p", "text": "Shortly after Fel joined the Rogues, Antilles sent Janson, Klivian and Ilo to Corellia to try and retrieve Fel's wife, Wynssa Starflare. The three successfully reached Corellia and made their way to the Fel estate, where they learned from CorSec Captain Corran Horn that two-year-old Fyric Fel had been kidnapped earlier in the day. They left the Fel Estate and returned to their ship, only to have Fyric's mother Ajai Fel approach and ask them to help her find her child in exchange for the location of Wynssa."}, {"tag": "p", "text": "Plourr took charge, arranging a meeting in an alley with the kidnappers. Their leader told her that if she beat his Weequay, they would trade the money for the child. Ilo defeated the Weequay, but the kidnappers double-crossed them and captured the three Rogues, planning on executing them. Luckily, CorSec agents Horn and Iella Wessiri arrived and helped the Rogues defeat the kidnappers, but Post got away."}, {"tag": "p", "text": "Returning to their ship, the Rogues and CorSec agents planned a raid on Post's estate to retrieve the child. The assault easily defeated Post's guards, but Post appeared at an upper-story window with a gun to Fyric's head. Todr Fel, armed with a blaster rifle, shot Post through the head and Ilo caught Fyric as he fell. Janson and the other Rogues then retrieved all the Fels from Corellia, departing in their freighter, as Horn promised to delay filing his report. As they left, their freighter was attacked by Ugly starfighters, and though Janson tried to evade them, their escape was made possible by Corran Horn's skill in an X-wing fighter, shooting down three of the four attackers."}, {"tag": "h4", "text": "Escort on Axxila"}, {"tag": "p", "text": "After their return from Corellia, Janson and the Rogues responded to a distress call, fending off a group of pirates during a training mission. While Celchu and Fel accompanied Princess Leia (actually Winter in disguise), Han Solo, and Chewbacca to a diplomatic conference on Eiattu and Antilles and the real Leia went to meet with Imperial Vizier Sate Pestage in a secret lair on Axxila, Janson and the other Rogues were elsewhere on Axxila. Recognizing a group of pirates in a cantina as ones they had fought earlier, they followed them back to their hangar, but the encounter turned violent when the pirates realized they were there. Also, a different group of the same pirate organization captured Celchu and Winter on Eiattu and brought them to Axxila also, but the two eventually escaped in a Y-wing. This was not to be the last time the Rogues encountered Kavil's Corsairs, who were in fact led by Leonia Tavira, the Moff they had encountered on Eiattu."}, {"tag": "p", "text": "Responding to Celchu's call for help, Janson and the some of the other Rogues scrambled in their fighters and cleared the pirate fighters off of Tycho while the other pilots fought with some of the pilots on the ground. They were still heavily outnumbered, but the arrival of the Millennium Falcon with Solo and Fel aboard helped even the odds and the entire group was reunited at the Rogue Squadron hangar on Axxila. However, the arrival of Admiral Delak Krennel and the Reckoning disrupted their plans, forcing them to go to ground. Fel and Celchu captured a TIE fighter and a secure Imperial comlink, and Fel gave Krennel an AT3 Directive to withdraw from Axxila long enough for them to escape. With Krennel gone, the Falcon and the Rogues left Axxila, their mission completed."}, {"tag": "h4", "text": "Extraction from Ciutric"}, {"tag": "p", "text": "After their mission to Axxila, the Rogues earned some R&R, during which Janson tried to solicit the attentions of an attractive female officer named Reina Faleur, only to find that she already had a date—with Antilles. However, their vacation was cut short by an urgent mission to rescue Sate Pestage, who had been compromised by Director of Imperial Intelligence Ysanne Isard for his deal with Organa. Admiral Ackbar assigned Rogue Squadron to work with Winter and Kapp Dendo to retrieve Pestage from Ciutric IV. Janson and the other Rogues, along with Aggressor Wing, entered the space around Ciutric and targeted the local fighters while Dendo's men retrieved Pestage. With friendly ground troops taking fire, the Rogues also provided close air support to the commandos. As they were making their escape, they were trapped by the Reckoning and the Interdictor Binder. The Rogues, Dendo's troops, and Pestage fled to the night side of Ciutric while Aggressor made their escape to get help."}, {"tag": "p", "text": "Pinned down on groundside, Antilles had Dendo's men take an Imperial communications outpost so he could get a message out. However, they still had to fend off TIE fighters hunting them, and Ibtisam was shot down and killed during a dogfight, which also informed Krennel of their location. The Rogues were swarmed by TIEs from the Reckoning, but some help arrived in the form of Mirax Terrik in the Pulsar Skate and Aggressor Wing with General Horton Salm, and though Janson's R2 unit was shot out in the fight, no other pilots were killed or shot down."}, {"tag": "p", "text": "Mirax and Antilles planned an assault on Binder and Reckoning to allow Dendo's men to escape with Pestage, and used the Pulsar Skate as a decoy. While the pilots dealt with the capital ships and fighters, Dendo's team fled from Imperial ground troops pursuing them, but Pestage deserted them for the Imperial forces and Krennel. He paid for his treachery when Krennel crushed his throat and became a new warlord, one of many in the fractured Empire."}, {"tag": "h4", "text": "Service over Mindor"}, {"tag": "p", "text": "Shortly thereafter, TIE Defenders being flown by a warlord known as Shadowspawn began raiding a number of merchant ships. The fighters proved difficult for the New Republic to track down and none of the pilots had been taken alive, so Commander Antilles devised a plan that had Rogue Squadron disguise themselves inside a hollowed-out shell that resembled the luxury liner Corellian Queen. After the ship's route had been relayed to Shadowspawn's forces, a group of TIE Defenders arrived to intercept the craft. Janson participated in the subsequent ambush, shooting down at least one TIE Defender with specially modified torpedoes that exploded into hundreds of metal flechettes. His wingman, Klivian, had his fighter disabled in the skirmish, and after the remaining Defenders fled, Janson returned to retrieve his wingman, who was drifting in space. As he pulled his fighter alongside Klivian's in preparation for attaching a tow cable, Janson took the opportunity to take several images of the hapless Klivian sitting in his craft, plugging breaches in his cockpit with the severed ends of his artificial limbs, which was much to the merry Taanabian lieutenant's delight, and little to Klivian's."}, {"tag": "p", "text": "Following their successful mission, the Rogues assisted in bringing Mandalore Fenn Shysa to the world of Mandalore for a series of negotiations with other Mandalorian Supercommandos. Janson later accompanied Rogue Squadron to the world of Mindor, which had been revealed by a transponder contained in the torpedo flechettes of the Rogues to be the stronghold of Shadowspawn and where Luke Skywalker had led the Rapid Response Task Force in order to deal with the warlord. The Rogues arrived later, escorting Leia Organa to Mindor after the Rapid Response Task Force had failed to contact anyone else and following a rescue attempt led by Chewbacca and Han Solo on the Millennium Falcon. They soon found that the Rapid Response Task Force was being battered by waves of Shadowspawn's starfighters after having been damaged by gravity mines."}, {"tag": "p", "text": "Organa soon boarded the Falcon and headed for the surface, where Skywalker's cruiser, Justice, had crashed. Rogue Squadron was called upon to guide them through the belt of asteroids surrounding Mindor, which were swarming with hostile starfighters. After the Falcon landed, the squadron battled their way back up into orbit, attempting to clear an escape path through the mines and hostile fighters. They were able to use their craft's repulsorlifts to use the orbital debris around Mindor to their advantage, knocking large pieces of rock into nearby hostile starfighters, who were not equipped with repulsorlifts. The Rogues were also charged with aiding the remaining ships of the Rapid Response Task Force in fending off waves of starfighters, many of whom made suicide runs against the New Republic vessels. The New Republic flotilla did receive reinforcements in the form of a Mon Calamari Star Cruiser commanded by General Lando Calrissian, who took command of the beleaguered fleet."}, {"tag": "p", "text": "However, as orbital debris was triggering stellar flares in Mindor's sun, Taspan, Janson, the Rogues, and the rest of the New Republic fleet were ordered by Calrissian to descend towards Mindor's surface, using it as a shield from the surges of intense radiation pulsing from the star. From there, the New Republic launched an assault on Shadowspawn's base, attempting to seize the anti-orbital weapons before Mindor rotated enough to bring them to bear against the surviving New Republic fleet. The Rogues flew cover for the assault, but were forced away after the dormant volcano around which the installation was built was blasted into space by gravitic effects. Skywalker, who had infiltrated Shadowspawn's base, managed to order the Imperial troops to take his orders, as they believed that he was the Emperor. The Jedi ordered the Imperial troops to stand down, and the New Republic vessels began evacuating personnel from the flying volcano, when Shadowspawn regained control over the Imperial stormtroopers and starfighter pilots, ordering them to make suicidal attacks on the New Republic presence. As the TIEs turned to attack, Janson was part of a desperate defense that attempted to destroy as many TIE fighters as possible before they rammed into the New Republic vessels. Skywalker eventually was able to cut off Shadowspawn's control, which slew the rest of the Imperials and allowed the New Republic forces to escape the system."}, {"tag": "h3", "text": "Wraith Squadron"}, {"tag": "p", "text": "Eventually, Janson and his good friend Derek Klivian left frontline combat duty and were tasked with building and training new starfighter units, resulting in the creation of both Corsair Squadron and Gauntlet Squadron, as well as the ill-fated Talon Squadron. As an experienced pilot, Janson's services as a trainer were highly sought."}, {"tag": "p", "text": "When Wedge Antilles and the rest of the reformed Rogue Squadron left the New Republic to hunt down Ysanne Isard, the New Republic needed a Rogue Squadron to keep up appearances of the famous X-wing unit. In response, they created a temporary Rogue Squadron led by Klivian and Janson and filled by former Rogues and new recruits. After Antilles' return from Thyferra, this squadron met them over Coruscant, demonstrating their formation flying prowess before landing. Once the Rogues were reinstated into the New Republic, the ersatz squadron was disbanded, and some of its members incorporated into the returning Rogues. Janson (along with Klivian) was officially restored to active duty in Rogue Squadron by High Command as a reward for assembling the temporary replacements."}, {"tag": "p", "text": "Shortly after, Antilles put Rogue Squadron under the command of Tycho Celchu and Klivian while he and Janson formed a new unit, Wraith Squadron, with Janson as the executive officer. Wraith Squadron was an experimental group comprised largely of rejected pilots and wash-outs that doubled as both a commando unit and a starfighter squadron. Antilles felt that this sort of unit was necessary after his experiences against Isard and well-suited to the overall New Republic campaign to wipe out the most prominent Imperial warlords, particularly Warlord Zsinj. Janson served as Antilles' second in command of Wraith Squadron and helped select the squadron members. Antilles also told Janson and Klivian of the destruction of Talon Squadron and brought in the only survivor, Myn Donos into the Wraiths."}, {"tag": "p", "text": "One of the ironies of the Wraiths came to fruition when a man by the name of Kell Tainer was selected for the squadron, with a specialty in demolitions. He was the son of the late Kissek Doran and had changed his name when word reached him that his father had turned coward in the middle of battle. There was much angst between Janson and Tainer at first, but as the campaign against Zsinj and his affiliates wore on, the two came to terms with one another, especially when Janson and Tainer both realized that the stiffness around each other wasn't a sign of aggression, but of fear. The two pilots eventually resolved their differences and dropped their long-standing hostility and mistrust of the other."}, {"tag": "p", "text": "Janson was one of the chief training officers for the new squadron, putting the pilots through a series of exercises that challenged their skill and their ability to adapt to situations. On a proton torpedo drill, he arranged for their fighters to lose targeting, forcing them to aim manually and on another instance, dictated that each pilot was graded by the performance of their wingman. The training process whittled down the number of candidates until there were ten new pilots in the finalized squadron roster, at the time dubbed Gray Squadron. Janson was assigned as Gray Eleven and given command of Three Flight."}, {"tag": "h4", "text": "Night Caller"}, {"tag": "p", "text": "Gray Squadron (shortly renamed \"Wraiths\" by Tyria Sarkin) were originally based at Folor, but were forced to evacuate when Zsinj-allied Admiral Apwar Trigit attacked. The Wraiths, having barely finished their training hastily evacuated. Janson helped escort the straggling freighter Borleias, shooting several TIEs off of it. However, they were pulled out of hyperspace by an Empion mine which also disabled their X-wings. Janson and most of the squadron set down on the hostile world of Xobome 6 to effect makeshift repairs. Thanks to some unorthodox tactics and improvised weaponry, the Wraiths left in orbit were able to capture a mine-laying vessel, the Night Caller. Posing as the actual crew of the vessel, Janson and the other Wraiths used the ship to gather intelligence on Trigit's and Warlord Zsinj's activities. A rendezvous with New Republic forces allowed them to become officially commissioned as a squadron and they renamed themselves Wraith Squadron, but Janson and Antilles grew concerned about the lack of emotional and personal stability among some of the pilots, such as Kell Tainer and Tyria Sarkin. The former at this point still demonstrated visible unease around Janson and the latter had attacked another pilot after being asked to consider cheating to improve her scores. It seemed to Janson that this group of rejects and wash-outs might be headed for disaster."}, {"tag": "p", "text": "Wedge and Janson, as senior officers, stayed somewhat aloof from the other pilots, interacting with them only in an official manner. The Wraiths conducted several infiltration and intelligence gathering missions on Zsinj-allied businesses, including a commando raid on Xartun. On this mission, Janson and the other Wraiths broke into a production facility that had been shown earlier to a disguised Loran and sabotaged it. While stormtroopers attempted to attack the intrusion party, Janson held them off until the rest of the intruders could rejoin them. They escaped just before the destruction of the Zsinj-allied production facility."}, {"tag": "p", "text": "During their Night Caller charade, the Wraiths suffered their first casualty, Jesmin Ackbar, when a group of pirates attacked them. Janson and the others fended off the attack, with Janson scoring an aerial kill and helping compel the swift surrender of the pirates. However, despite the loss, their missions continued and Janson was able to resolve his difficulties with Tainer as well. Following their success, they were contacted by Zsinj, who ordered the ersatz Night Caller crew to help attack the New Republic alongside Admiral Trigit."}, {"tag": "p", "text": "On a subsequent infiltration mission to Storinal, Janson posed as an expatriated Bakuran Senator, helping infect an Imperial shuttle with Bunkurd Sewer Disorder, which led to a supply ship that was supposed to rendezvous with Night Caller being infected and thus unable to expose their cover. The mission also resulted in the Wraiths stealing two TIE fighters to equip the Night Caller with. The Wraiths then engaged another corvette and a frigate belonging to Zsinj in the Battle of Talasea, and were able to maintain the charade of being Zsinj's crewmen by pretending they had barely survived the engagement that had destroyed the corvette and frigate."}, {"tag": "p", "text": "The culmination of their Night Caller escapades was the ambush and destruction of the Star Destroyer Implacable, commanded by Apwar Trigit. The Wraiths led Trigit and his Star Destroyer to attack what was ostensibly a defense of a Zsinj-allied business on Ession, but was actually a New Republic trap. In that battle, Janson scored several combat kills, but was unable to rescue Wraiths Grinder or Falynn Sandskimmer, who had flown into a hole in the Star Destroyer's power cells to destroy it from within, and both perished, though the Star Destroyer and Admiral Trigit also were destroyed."}, {"tag": "h4", "text": "Hawk-Bats"}, {"tag": "p", "text": "Returning to Coruscant for some downtime, the Wraiths narrowly escaped capture by a group of impostors posing as military police after they got into a bar fight, and Janson suffered a blaster graze along his ribs in a brawl with the impostors, but the wound was not serious. After their successful use of the Night Caller, the Wraiths decided to pose as a pirate group, the Hawk-Bats, to cause further damage to Zsinj as well as gather more information. In their first mission, they stole several TIE Interceptors from an Imperial base to complete their squadron's complement of starfighters—they had not received replacements since sustaining losses and they needed craft for their piratical charade. Janson participated in the mission on the ground, using his blaster skills to good effect by shooting several stormtroopers. In between missions, Janson returned to Coruscant to pick up cargo and orders for the Wraiths, and also a stuffed Ewok doll that would play heavily into his tricks. Meanwhile, several members of the squadron posed as the Hawk-bats, wreaking havoc on the relatively defenseless world of Halmad in order to persuade the locals to seek aid from Zsinj, thus drawing him out."}, {"tag": "p", "text": "On his next mission, Janson, paired with new member Dia Passik, joined in a dogfight over Halmad with a large group of starfighters from the recently arrived Iron Fist, Warlord Zsinj's flagship. The Wraiths largely escaped, save for Ton Phanan who was shot down and later died. To facilitate their escape, they destroyed a refueling tanker that Iron Fist had tractor beamed, causing damage to the hangar bay. This action also caused Zsinj to offer employment to the Hawk-Bats. However, the grueling missions, coupled with recent casualties, wore the Wraiths down."}, {"tag": "p", "text": "Janson was kept busy working with Antilles to maintain stability among the unit and interpreting data to use against Zsinj. While analyzing the defenses of Zsinj's target, Janson believed that the target was Coruscant, but Antilles correctly determined that it was actually the shipyards at Kuat, and Zsinj was trying to steal the newest Super Star Destroyer in production there. Janson also helped set Dia Passik, his wingmate, up with Garik \"Face\" Loran at a formal dance, and the two later developed a romantic relationship."}, {"tag": "p", "text": "During Zsinj's attempt to steal the new warship, Janson and several of the Wraiths stayed on Mon Calamari Star Cruiser Mon Remonda in their X-wings as part of an anti-Zsinj task force under Han Solo in order to ambush Zsinj in his escape from Kuat while other Wraith pilots infiltrated the new battleship and served as pirates flying for Zsinj. The mission and subsequent ambush, which Janson took part in, was largely a success, with the Razor's Kiss destroyed, although Iron Fist escaped."}, {"tag": "h4", "text": "Defeat of Zsinj"}, {"tag": "p", "text": "With the Razor's Kiss destroyed, the Wraiths abandoned their Hawk-Bats scheme temporarily and rejoined Han Solo's flagship, the Mon Remonda, while continuing their intelligence and sabotage missions. Wraith Squadron at this point was reorganized, with Garik Loran being promoted to the commander of the unit. Although Janson was the senior officer of the two lieutenants, he had never wanted (or intended) to stay with the Wraiths past their initial formation period, and was perfectly at ease taking orders from the much younger officer, remaining XO of the unit. And although Antilles technically rejoined Rogue Squadron at this point, it did not even slow down Janson from his continuous teasing and practical jokes against the commander."}, {"tag": "p", "text": "The Wraiths then continued their activities as part of Solo's fleet, which led to Zsinj engaging Solo's force in a major battle in order to eliminate what had become a nuisance to the warlord. In a fleet battle against a large part of Zsinj's fleet, including Iron Fist, Janson, the Wraiths and the Rogues destroyed two Carrack-class cruisers, but Janson's craft was disabled by an ion cannon. He was rescued, and Solo's fleet escaped to fight another day."}, {"tag": "p", "text": "The Wraiths then decided to follow up on new leads to explore the empire of businesses that Zsinj seemed to be amassing to support his military. On an intelligence gathering mission to Saffalore, the Wraiths investigated Binring Biomedical, but were ambushed by Zsinj's forces after being funneled into a trap. Janson was burned when the Wraiths fell through a trapdoor into a crematorium, but they escaped, capturing Dr. Edda Gast, a top scientist for Zsinj, in the process, despite moderate injuries to most of the pilots. Janson later earned a commendation for bravery for his actions, which he received after finishing bacta therapy. In response, Zsinj activated a number of sleeper agents in an effort to kill numerous high-profile New Republic leaders. After Wraith Tyria Sarkin was forced to shoot down a brainwashed A-wing pilot trying to kill Han Solo, Janson was able to talk with her and help her recover, due to his own experience of shooting down a friendly pilot."}, {"tag": "p", "text": "On a mission to Kidriff 5, Janson and three other pilots flew TIE Interceptors to ascertain the security of the planet, and later linked up with a decoy YT-1300 freighter dubbed the Millennium Falsehood in mimicry of the Millennium Falcon as a lure for Zsinj. Once they were reunited, Janson and the other Wraiths and Rogues covered the Falsehood on its egress from the planet, pursued by enemy starfighters, which they engaged and fended off. During the last stages of the battle, Wraith pilot Myn Donos deliberately fired on a fellow Wraith, Lara Notsil, after Garik Loran unintentionally revealed that Notsil had been an Imperial Intelligence agent directly responsible for the destruction of Donos's Talon Squadron before Notsil had defected. Notsil escaped, fleeing to Zsinj as a double agent, and the Wraiths returned to Mon Remonda. Donos was placed on probation, and eventually sought advice from Janson, who convinced him to have fun and let himself go more often. The advice helped, and Donos eventually returned to active flying status. Janson was also the target of Wedge's revenge for his many pranks when he was tricked into walking naked into a room with all the Wraiths inside."}, {"tag": "p", "text": "Janson, still in a TIE Interceptor (his X-wing being used by members of Wraith Squadron who did not have their own fighter, nor TIE fighter experience), and the Wraiths would later fly escort missions for Nova Squadron's B-wing starfighters in attacks on Iron Fist in the Battle of Vahaba and the subsequent Battle of Selaggis, the latter made possible by the efforts of Wraith Squadron member Lara Notsil, who had pretended to join Zsinj so she could sabotage and kill him from within his organization. In the battles, Janson destroyed several more TIE Interceptors. Zsinj's fleet was crippled at Selaggis and the warlord was killed by Han Solo not long afterward, ending that campaign."}, {"tag": "h3", "text": "Return to Rogue Squadron"}, {"tag": "p", "text": "Upon his return to Rogue Squadron, Janson participated in the Thrawn campaign, culminating in the Battle of Bilbringi. Shortly before the Bilbringi mission, he, Antilles, Klivian, and Celchu were part of a New Republic disinformation attempt to convince the Empire that Tangrene was the original target. They encountered Aves, a member of the Talon Karrde criminal organization, and convinced him that their target was Tangrene. Janson believed that Aves was going to sell the information to the Empire, but little did they know that a massive smuggler force was going to hit Bilbringi also. The cooperation of the two sides and the death of Thrawn allowed the New Republic to be successful in the battle."}, {"tag": "p", "text": "With Thrawn's assassination and the Empire again retreating, the New Republic decided to launch an offensive against Prince-Admiral Delak Krennel's Ciutric Hegemony as an example to the other Imperial warlords. Following the Thrawn campaign, Admiral Ackbar insisted on promotions for several members of the squadron, including Janson to Major along with Klivian, and led to Janson assuming command of Two Flight of the Rogues. As preparations for the Ciutric campaign geared, Janson also participated in a raid on Commenor to help free some of the Lusankya prisoners after a prisoner named Urlor Sette showed up at a Rogue Squadron victory celebration and was gorily killed by a device planted in him. Janson and the Rogues were able to easily defeat the meager resistance on the ground, and intelligence garnered from the rescued prisoners revealed that Ysanne Isard, believed to be dead over Thyferra, was still alive."}, {"tag": "p", "text": "Janson flew in the Battle of Liinade III, helping engage Krennel's TIEs in space and then making runs against ground targets in preparation for the New Republic's occupation of the world. Upon learning of the possibility of a Death Star-like superweapon being constructed near or inside nearby Distna, the Rogues and Nrin Vakil were assigned to reconnoiter the system, with Janson predicting that they would later finish the job by killing the superweapon.\nHowever, the entire superweapon was a hoax designed to kill the Rogues. Upon arrival, they were ambushed by six squadrons of TIE fighters. In the ensuing battle, Janson acquitted himself well, as did the rest of the squadron, but was shot down, and left drifting in vacuum. While the rest of the surviving Rogues were rescued by a group of TIE Defender pilots, Janson was stranded, fated to die of exposure. The timely arrival of the Errant Venture saved him, as Booster Terrik's investigative team had discovered Krennel's trap. Terrick's crew recovered Janson and he recovered with the aid of bacta. However, Antilles and the other Rogue pilots were rescued and taken elsewhere by the Defender pilots. They assumed Janson had died."}, {"tag": "p", "text": "After the Battle of Ciutric and defeat of Krennel, Janson was happily reunited with the other Rogues, who had covertly infiltrated Krennel's forces posing as TIE Defender pilots. Antilles, in particular, was quite pleased to see his long-time friend alive and well."}, {"tag": "p", "text": "Following his recovery, Janson continued to serve in Rogue Squadron, which helped in the fight against the Invid pirate group. Janson helped disable the Booty Full after it tried to attack the liner Glitterstar. That was not the Rogues' only run-in with the Invids, either. The squadron was also present at the Battle of Xa Fel, where the Invids attempted to engage a New Republic force blockading the planet."}, {"tag": "h4", "text": "Mission to Adumar"}, {"tag": "p", "text": "In 13 ABY, Antilles was selected by the New Republic to be sent as an ambassador from the New Republic to Adumar. Wedge was instructed to bring along three of the New Republic's best starfighter pilots. Celchu, Klivian and Janson were chosen to accompany Antilles. The four soon, under the designation of Red Flight, landed in the largest nation of Adumar, Cartann, where they met with Tomer Darpen, their diplomatic liaison, the documentarian Hallis Saper, and their local guide Cheriss ke Hanadi.Janson had known Darpen from his days in the Tierfon Yellow Aces, jokingly referring to him as \"Ejector\" Darpen from an ejection seat mishap during Darpen's combat days. The four pilots were invited to a state dinner, where they were well-received and feted courtesy of Cartann. Janson was quick to adopt local customs, such as the blastsword, and wild clothing tastes, including cloaks that glowed and had flatscreen panels sewn onto them."}, {"tag": "p", "text": "The mission was quickly complicated when the New Republic pilots learned of the Adumari fascination with death duels, on ground and in the air, and of the presence of Imperial 181st pilots competing with them for the Adumari's regard. The Red Flight pilots were also hampered by the subversion of Darpen, who was trying to manipulate them. Another complication was an assault on them by four assailants, who were swiftly defeated. Still, the pilots tried to represent the New Republic well, flying the local Blade-32 superiority fighters in practice duels against each other as well as against Adumari pilots. Although they had initially been honored guests of Adumar, showered with gifts, attention, nicknames, (Janson was \"the darling one\") and of course, demonstrating their skills as pilots, Antilles and the others grew increasingly disturbed by the situation on Adumar. Having learned that New Republic Intelligence agent and a former romantic interest of his, Iella Wessiri, was undercover on Adumar, Antilles asked Janson to accompany him to Wessiri's residence. Janson agreed, though Antilles left him outside her apartment to stand watch while Antilles stayed the entire night with Wessiri as the two renewed their relationship. The next day, Janson's and Antilles' difficulties grew even after a visit to Allegiance, the New Republic Star Destroyer in orbit. The Adumari fascination with casually engaging in lethal honor duels disgusted the pilots. When their guide, ke Hanadi, who had been smitten with Antilles, learned that he was newly engaged with Wessiri, she engaged herself in an endless string of duels in an attempt to throw her life away. Janson intervened after she was injured in a duel, insulting and defeating Thanaer ke Sekae in a blastsword duel."}, {"tag": "p", "text": "However, the situation for the New Republic continued to deteriorate. Their relationship with Cartann was ruined when the perator of Cartann announced that he was creating a planetary government, annexing all other nations of Adumar. While the Imperial pilots agreed to join him, the four Rogues declined the offer. Darpen then betrayed the Rogues, goading the perator to send them to their deaths and cutting off communications with Allegiance that had brought them to Adumar. As their punishment, they were forced to run the gauntlet of armed citizenry eager for the honor of killing them. Janson and the other Rogues had to dodge the blasters of over a hundred people, escaping down the streets of Cartann's capital to a local airbase, where Blade-32s awaited them to take them to Allegiance. Janson's skills with a blaster pistol were valuable in their running of the gauntlet of mob fire, killing or injuring many of their attackers. Boarding their Blades, Red Flight engaged in a desperate 4 on 30 dogfight against Adumari fighters, emerging victorious, but with all of their craft too badly damaged to reach space. Janson was shot down, but ejected and he and Klivian escaped on the ground. The intervention of sympathetic Adumari pilots allowed the other Rogues to escape, and the help of New Republic Intelligence agent Iella Wessiri allowed them to escape to a friendly nation threatened by Cartann."}, {"tag": "h4", "text": "Adumari Civil War"}, {"tag": "p", "text": "After negotiating to ensure that Adumar would be united after the conflict, Antilles agreed to take command of an alliance formed by the other nations of Adumar not allied with Cartann, Janson joined him in a massive airstrike on Cartann. The pilots were still in local craft, which placed them at a competitive disadvantage against the Imperial pilots flying TIE Interceptors. Though the Adumari Union achieved the element of surprise, they were outnumbered and outgunned. However, a group of commandos and intelligence personnel located the New Republic X-wings and Red Flight quickly blasted open a tunnel access of the perator's palace before taking to the skies to challenge the Imperial pilots. Having shot down three of the four TIEs, Red Flight also accepted the surrender of numerous Cartann squadrons after their perator was captured."}, {"tag": "p", "text": "Only days after Cartann was defeated and Adumar united and preparing to join the New Republic, Janson and Red Flight again took to their fighters, this time to defend against an Imperial attack force ostensibly sent to aid Cartann. Janson fought in the battle, shooting several TIE Interceptors off of Antilles. The New Republic and Adumari force was victorious over the Empire, and, mission accomplished, the pilots returned to the New Republic."}, {"tag": "p", "text": "Some time after their successful mission, Janson, Celchu, and Klivian were interviewed by Hallis Saper aboard the Errant Venture as part of a holodocumentary on Adumar she was composing. In particular, Janson described the Adumari fascination with the blastsword and other aspects of the culture, even wearing his favorite cloak from Adumar as a memento of the trip."}, {"tag": "h4", "text": "The end of the Galactic Civil War"}, {"tag": "p", "text": "Janson, still with Rogue Squadron as of 19 ABY, was present under Garm Bel Iblis's command during the Caamas Document crisis, and was one of the first to learn of the Bothan role in the attack on Caamas on Morishim, as he knew a little Morish. A native speaker was telling the public about the Bothan involvement and Janson translated the man's speech for the others. Janson, Celchu, Antilles, and Lando Calrissian went to the place of the Old Recluse—said to be the source of the information—only to find a fully equipped Imperial communications center that had fallen into local hands. Before they could fully investigate it, they were summoned back to their craft to intercept an Imperial Star Destroyer chasing a corvette. Despite the Rogues' efforts, the Star Destroyer captured the corvette and fled, though Lando did manage to intercept part of a transmission from the ship. Unbeknownst to them, the corvette was carrying Colonel Meizh Vermel, an aide of Gilad Pellaeon's who was carrying a meeting request for Bel Iblis, though Janson figured it was a simple theft-and-defection on the part of the corvette."}, {"tag": "p", "text": "Sometime after the end of the Galactic Civil War, Janson, along with many other Rogue pilots, retired from active duty. Janson was invited to the Wedding of Luke Skywalker and Mara Jade in 20 ABY as one of the guests. Janson was late for the wedding, but when he arrived, Antilles met him and enlisted his and Klivian's help. Antilles had caught word that a swoop gang hired by Imperials was intent on disrupting the wedding. When they attacked, Janson and several other former Rogue pilots, including Celchu, as well as Jedi Kam Solusar and Chewbacca, fought them off. Janson and Klivian were sent to stall a group heading for the annex buildings, but were unarmed and outnumbered. The swoop gang members threatened to beat them when smuggler chief Booster Terrik emerged from the annex and threatened the swoop gang with bodily harm if they woke the children he'd been babysitting. Awed by Terrik's reputation and his quick knock-out punch delivered to one of the gang members, the others withdrew."}, {"tag": "h3", "text": "The Yuuzhan Vong War"}, {"tag": "p", "text": "Janson later went on to found the volunteer squadron of A-wings and E-wings called the Taanab Yellow Aces during the Yuuzhan Vong War. This squadron arrived to help Wedge Antilles and his New Republic forces in the defense of Borleias in 27 ABY following the Battle of Coruscant. Flying in escort of the transport Reckless Abandon, Janson and his fighters fended off groups of alien coralskipper fighters as New Republic fighters from Borleias arrived to escort him and his group to the planet. After the coralskippers were defeated, Janson flirted with Jaina Solo without knowing her identity. Upon landing on the planet and being welcomed by Antilles, Janson was informed who \"Twin Suns Leader\" was, to his surprise and chagrin. Janson then told Antilles that he and his pilots were on permanent assignment to assist the defense of Borleias."}, {"tag": "p", "text": "Janson and the Aces acquitted themselves well in the New Republic military as an elite starfighter squadron along with Twin Suns, Vanguard, Blackmoon and Rogue Squadrons during the Yuuzhan Vong siege of the planet. The Yellow Aces fought with distinction at Borleias, helping protect the pipefighter decoys in order to distract the Yuuzhan Vong from a strategic retreat. As the Yuuzhan Vong began a final push, Janson's Yellow Aces and the other elite squadrons escorted the pipefighters up for one last deception, only to abandon their charges and jump to assist the Star Dreadnought Lusankya, which was encroaching on the Yuuzhan Vong command worldship. With Janson and the rest of the New Republic's elite squadrons flying cover for the massive ship and fending off waves of coralskippers, Lusankya executed Operation Emperor's Spear, ramming the giant warship into the worldship to destroy it. Following the destruction of the worldship and the recapture of Borleias, Janson and the rest of the New Republic forces withdrew. The defensive action at Borleias allowed the New Republic to reorganize itself after a series of defeats and a new government dubbed the Galactic Federation of Free Alliances was formed, unifying much of the galaxy to combat the Yuuzhan Vong."}, {"tag": "p", "text": "At Selvaris, some four years into the war, Janson and the Yellow Aces helped the Galactic Alliance liberate captured troops from the turncoat Peace Brigade and the Yuuzhan Vong. Janson's squadron was tasked with destroying the forward gunships of the prisoner convoy. The prisoner transports were quickly secured and Janson's squad shifted to an escort role, protecting the transports as Yuuzhan Vong reinforcements arrived in the form of advanced stingcrawler fighters, which easily punched through the Galactic Alliance lines and inflicted heavy damage. The Aces suffered casualties from their assault, but managed to escape with most of the transports. Janson and the Aces went on to participate in the Recapture of Coruscant, with his squadron helping escort the initial wave of troop transports to touch down on the galactic capital. When one transport was attacked by grutchin creatures and went out of control, the Yellow Aces followed it down to the surface, using their lasers to pick off the grutchins, but were unsuccessful in saving it. The Galactic Alliance was ultimately successful in retaking the planet and forcing the capitulation of the Yuuzhan Vong, ending the war."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "In 40 ABY, war broke out again as numerous star systems seceded from the Galactic Alliance to form the Confederation, resulting in the Second Galactic Civil War. During the war, Jacen Solo fell to the dark side of the Force and seized power in the Galactic Alliance, resulting in a schism between the New Jedi Order and the Galactic Alliance. As the Jedi and their Hapan allies formulated plans to neutralize Solo, now styling himself \"Darth Caedus,\" Caedus responded by kidnapping the daughter of the Queen of Hapes. To prevent her from being held hostage, Luke Skywalker devised a mission that would both free the young Hapan princess Allana as well as neutralize the Centerpoint Station weapon, which the Galactic Alliance sought to seize."}, {"tag": "p", "text": "Janson was one of many veteran pilots recruited by Wedge Antilles to support Luke Skywalker's combined mission, meeting with Skywalker on Endor and learning of the Jedi's intention to free Allana. Janson flew with the other pilots in Rakehell Squadron as Rakehell Twelve during the operation to destroy Centerpoint Station and rescue Allana. Upon arrival in the Corellia system, the Rakehells first flew cover for the infiltration team that boarded Solo's flagship by pretending to chase a shuttle containing the boarding party into its hangar bay."}, {"tag": "p", "text": "The Rakehells then repeated their procedure on a second shuttle, faking a chase that led to the subsequent insertion of a second Jedi-led team onto Centerpoint Station. Galactic Alliance fighters rose to challenge the Rakehells at that point, leading to the Janson battling against his former unit of Rogue Squadron. Both squadrons inflicted casualties on each other, but as a Confederation assault force arrived to contest Centerpoint Station, the Rogues were called to respond, leaving the Rakehells unengaged. Once Allana was rescued, the Rakehells then flew cover for the Millennium Falcon extracting the boarding party from Solo's ship by distracting hostile gunners with their strafing runs. Furthermore, the other sabotage party was successful in destroying Centerpoint Station, resulting in a total success for the Jedi faction in the battle. The Rakehells and their accompanying transports then withdrew to a space station orbiting Gyndine. Janson survived the battle and the Jedi ultimately slew Caedus not long afterward to end the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Janson had dark brown hair, brown eyes, and stood at a height of 1.7 meters. He was regarded as a joker, despite being a lethal opponent, being particularly accurate with blaster pistols and starfighter-grade weaponry. According to Skywalker, Janson was only truly happy when he was manning the guns of a Y-wing or an airspeeder. He was known for having a short temper, often having to be pulled out of cantina fights. Janson was described as observant, using what he noticed as fodder for his witty remarks, mockery, or jokes. He was generally cheerful and light-hearted, even in the face of opposition or boredom."}, {"tag": "p", "text": "Janson also considered himself a ladies' man, frequently seeking the attention of women he considered attractive. His flirtatious nature was amplified by a dark side temple on Malrev IV, leading to his solicitation of a female Bothan. Janson's casual flirtations also led to him accidentally trying to attract the attention of Jaina Solo—he was shocked when he learned of her identity and regretted his pursuit."}, {"tag": "p", "text": "He enjoyed playing pranks on his fellow squad mates. He believed in having fun today, because tomorrow might not come. During his time in Wraith Squadron, he developed the character Lieutenant Kettch, a fictional Ewok starfighter pilot. Kettch became a recurring theme in Janson's pranks. This originated when he claimed that a candidate for Wraith Squadron was an Ewok, and then it circulated among the Wraiths, including the time Wraith slicer Castin Donn reprogrammed Antilles' TIE Interceptor to make his voice sound like an Ewok. This led to Antilles being forced to fly into battle, against Imperial forces, while wearing a stuffed Ewok in his lap. When the stuffed Ewok doll started showing up everywhere and appeared to move on its own, Antilles attached a transponder to it, leading to the discovery that Janson was placing the doll in those places. The Wraiths got back at Janson by convincing him that the real Kettch had gotten loose and he had to strip naked and cover himself in Ewok food to find and recapture it. The joke only ended when Lara Notsil found a real Ewok that fit Kettch's description exactly. She found this hilarious."}, {"tag": "p", "text": "Due to his mischievous nature, Janson was not considered suitable to leave behind on the ground on Adumar to conduct sensitive diplomatic negotiations by Antilles. However, Janson was loyal to his friends and fellow pilots despite any good-natured grumbling or teasing he gave them when they needed his help. Janson was willing to keep watch all night long for Antilles during a covert rendezvous between Antilles and Iella Wessiri, and also placed his life at risk in order to save both Antilles and Cheriss ke Hanadi from possibly fatal injuries by engaging in a blastsword duel against an experienced duelist."}, {"tag": "p", "text": "Janson did have a serious side though, that exhibited itself through grim, angry determination. It didn't come out often, but Janson apparently was in this mood when fighting or flying against an enemy of his. Janson also abandoned his typical jesting nature when discussing the incident where he was forced to kill fellow Rebel pilot Kissek Doran. Janson likewise displayed his serious side in a series of interactions with Doran's son, Kell Tainer, which ultimately led to the resolution of the conflict between them."}, {"tag": "p", "text": "During his career as a pilot and soldier, Janson was noted for his bravery, particularly during commando missions. Kell Tainer noted that Janson could probably make a fort out of all his bravery commendations. During ground combat, Janson was calm and controlled under fire, using his blaster skills to good effect or placing charges to destroy key facilities."}, {"tag": "p", "text": "Post-retirement, Janson developed a sense of responsibility and initiative when he found, trained, and commanded the volunteer fighter squadron Taanab Yellow Aces. Janson remained with the squadron for over two years of the Yuuzhan Vong War, ruefully citing his responsibility to them as reason enough to remain with the squadron instead of transferring back into Rogue Squadron. His light-hearted and playful side remained, but Janson was still a skilled-enough pilot and trainer that his squadron was considered an elite unit alongside Rogue and Twin Suns Squadrons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though Janson only had a few moments of screen time in Star Wars: Episode V The Empire Strikes Back, his character received considerable attention in the Expanded Universe, as he was featured extensively in the X-Wing: Rogue Squadron comics, novels in the X-wing series, as well as several later EU novels. In his Rogue Squadron comics, Janson's cheerful and jesting nature was established by writer Michael Stackpole, as were his blaster pistol and gunnery skills."}, {"tag": "p", "text": "Janson's novel appearances have mainly occurred in works written by Aaron Allston: X-Wing: Wraith Squadron, X-Wing: Iron Fist, X-Wing: Solo Command, X-Wing: Starfighters of Adumar, The New Jedi Order: Enemy Lines II: Rebel Stand, and Legacy of the Force: Fury. In the latter two novels, Allston brought Janson's character into the New Jedi Order and Legacy eras with small cameos, while he played a larger role in the three Wraith Squadron books. Janson has also been featured as a minor character in novels by other authors including Timothy Zahn, Matthew Stover, and Michael Stackpole, as well as the Star Wars: Union comic."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Wes Janson was portrayed by Ian Liston in The Empire Strikes Back. During filming of The Empire Strikes Back, a call was put out for an actor, not an extra, to play an AT-AT gunner. That was Liston's original role in the film, but he was later asked by an assistant director with whom Liston had previously worked to take the role of Janson since the original actor had fallen ill. Thus he ironically played both an Imperial and a Rebel, and in one sequence of the film is in effect trying to shoot himself down. Regarding his scenes as Janson with Wedge Antilles, Liston revealed in 2005 that the two actors were never actually on set together—Liston's double took his place when the scene focused on Denis Lawson (Antilles) and vice versa. In Star Wars: Rogue Squadron, Janson is voiced by Terence McGovern."}, {"tag": "h3", "text": "Continuity errors"}, {"tag": "p", "text": "Janson's non-canon death was written in Marvel Star Wars 78: Hoth Stuff!. The story was later retconned to be a tall tale that Wedge would tell new recruits, only to startle them with Janson's appearance."}, {"tag": "p", "text": "Janson's helmet, like most, is modeled from Star Wars: Episode IV A New Hope, where it is worn by Puck Naeco. However, due to an editing gaffe, Naeco and his helmet can only be seen when Theron Nett gets shot down later, as seen here."}, {"tag": "p", "text": "In West End Games' first edition of Galaxy Guide 3: The Empire Strikes Back, in Wedge's entry, his gunner is named \"Derit Janson.\" Any other mention of Janson in the book uses the name \"Wes.\" The error was corrected in the second edition. In Star Wars: X-Wing Rogue Squadron: Requiem for a Rogue, Janson's homeworld is incorrectly listed as \"Taanad.\" In X-Wing: Wraith Squadron during the Battle of Ession, Janson was mistakenly listed as flying an X-wing during part of the battle. Author Aaron Allston has stated that this was a mistake and Janson is in a TIE fighter throughout the battle."}, {"tag": "h3", "text": "Author and actor comments"}, {"tag": "p", "text": "Aaron Allston, whose works have often featured Wes Janson, has stated that Janson is one of his favorite characters to write out of the characters which he did not invent. Janson has appeared or been mentioned in eight of Allston's novels. Ian Liston has followed the books and other appearances of Janson and called them \"great fun.\" Liston has met Allston more than once and approves of the direction taken with Janson's character as a practical joker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}