{"url": "Whisper_Bird", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Mu-class shuttles"], "nodes": [{"tag": "h1", "text": "Whisper Bird"}, {"tag": "p", "text": "The Whisper Bird was a Mu-class shuttle that belonged to the Graf family during the early Imperial Era."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Whisper Bird was a Mu-class shuttle that belonged to Auric and Rhyssa Graf. As a Mu-class, it had folding wings, which were colored bronze."}, {"tag": "p", "text": "It was equipped with a hyperdrive, life support, and food processor. A rear airlock could be used for egress into space. It was also equipped with safety protocols to prevent the pilot from taking certain risky or dangerous actions, though these could be disengaged at the pilot's discretion."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Graf family used it during their cartography journeys during the Clone Wars. Their children Lina and Milo Graf were both born and reared aboard that shuttle. The shuttle shared its name with an avian creature native to Yavin 4."}, {"tag": "p", "text": "After the parents were abducted by the Empire, the children piloted it away from the planet Auric had jokingly named \"Graf-World\". The two kids, along with Morq and CR-8R, continued to use the vessel during their search for the parents. It was ambushed by disgraced Imperial Navy Captain Visler Korda and the droid RX-48 aboard the stolen scout ship Star Herald over Xala's moon. The Whisper Bird landed on a geyser on the ice moon, where it then sunk through the ice, causing irreparable damage to all systems. The Graf kids were ultimately able to escape and steal the Star Herald themselves."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Whisper Bird appears in Cavan Scott's and Tom Huddleston's young readers book series Adventures in Wild Space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}