{"url": "Whilce_Portacio", "categories": ["Category:Real-world articles", "Category:Comic book inkers", "Category:Comic book cover artists"], "nodes": [{"tag": "h1", "text": "Whilce Portacio"}, {"tag": "p", "text": "Whilce Portacio was the inker on Marvel Star Wars #107."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born in Sangley Point, Cavite City, Philippines, Portacio started out as an inker at Marvel Comics in 1985. Later he was given assignments as a penciller as well. Portacio became noted for his work on such titles as The Punisher, X-Factor, and the Uncanny X-Men. However, in 1992, Portacio left Marvel to co-found Image Comics with six other high-profile artists. he quickly withdrew from Image, however, due to his sister's illness. He eventually published his title Wetworks through Jim Lee's Wildstorm imprint in 1994. Other notable series that Portacio has worked on include Stone and Marvel's controversial Heroes Reborn storyline within Iron Man."}, {"tag": "p", "text": "In August, 2000, Portacio fell into a diabetic coma as a result of a failing pancreas. He woke up a week later, thirty pounds lighter, and unable to walk, stand or even draw. Only six months later he was able to pick up a pencil and draw. According to his blog, \"My mind could see what I wanted to draw but my hand couldn't accomplish it.\""}, {"tag": "p", "text": "In 2006, Portacio returned to his artistic duties at Wildstorm on Wetworks vol. 2, which was being written by Mike Carey. Unfortunately, Portacio's reputation for being unable to maintain a steady work schedule caught up with him again as Wetworks vol. 2 suffered from numerous delays and Portacio ended up leaving the book with issue #6, but he continues to illustrate cover art monthly since leaving as the book's interior artist. The new Wetworks series was short-lived though, lasting only 15 issues. He also began art duties on the new monthly DC Comics series Batman Confidential."}, {"tag": "p", "text": "On June 9, 2008 it was announced that Portacio would be the new artist on Spawn starting in October 2008 with issue #185, providing pencils with Spawn creator Todd MacFarlane returning as co-writer with Brian Holguin as the new creative team."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}