{"url": "Whistler", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Antilles's Rogues", "Category:Corellian Security Force officers", "Category:Masculine programming", "Category:R2-series astromech droids", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Whistler"}, {"tag": "p", "text": "Whistler, also called Xeno, was the astromech droid of Corran Horn. He was the same R-series model as the legendary R2-D2."}, {"tag": "p", "text": "Just like almost every standard astromech droid, Whistler's metal body was silver and white. Whistler had green details—the color of CorSec and Corran's X-wing."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An R2-series astromech droid, Whistler was programmed by CorSec with an enhanced sensor package and software useful for piecing together case elements to assist in detective work. Horn personally modified Whistler with escape and evasion subroutines."}, {"tag": "p", "text": "Whether a product of the enhanced creativity of his CorSec software or Horn's habitual choice to forgo memory wipes, Whistler developed a near-Human personality. Horn even speculated that Whistler uploaded elements of his personality and then retrieved them after the memory wipe. Like R2-D2, Whistler went so far as to develop a sense of humor; he even joked to Mirax Terrik that he wished to be Pulsar Skates navigator after Horn's retirement. Whistler often served as an imposed guardian of Horn; almost like a chaperone, or a brother. When Corran Horn was being antisocial after first joining the Rogues, Whistler encouraged him to spend more time with the squadron."}, {"tag": "h3", "text": "Prior to Corran joining the Rebellion"}, {"tag": "p", "text": "At the time Corran Horn left CorSec and Corellia, he took his X-wing and Whistler with him. During the two years on the run, Corran became an aide to a series of incompetent Imperial Military Prefects on Garqi, under the alias Eamon Yzalli."}, {"tag": "p", "text": "During this time, Corran took his X-wing out on frequent night flights. On one such flight, Corran's starboard engine sucked in a rdava-bird and broke. In order to get the parts he needed to make repairs to his ship, he contacted the Duros trader Lai Nootka; however, Nootka and the crew of his ship, the Star's Delight, were arrested and imprisoned, and the spare X-wing parts they were smuggling led prefect Mosh Barris to believe Garqi had become a hotbed of Rebel activity.\nWhile Corran attempted to devise a plan to get the spare parts for his X-wing out of the guard's hands, Whistler, going by the code name Xeno had organized a \"Rebel\" cell among students at Garqi Ag University, over computer networks, although the extent of the cell's actions was limited to vandalism using rebellious symbols and slogans. One of the members of this cell, Dynba Tesc, was arrested after they traced paint that she used to paint an anti-Imperial slogan on the side of the Imperial court to her personal account. When Barris was unable to get any useful information from her after two days of interrogation, he decided to have her executed. At the same time, Corran found out that his former Imperial Liaison Officer at CorSec, Kirtan Loor, was coming to inspect Garqi."}, {"tag": "p", "text": "Corran devised a plan that would simultaneously save Dynba and the crew of the Star's Delight and allow him to get his X-wing repaired in time to get off Garqi before Loor arrived, while also framing Barris for treason and the murder of \"Eamon Yzalli\". He proposed to Barris that instead of executing Tesc, he could allow her to stage an escape with her fellow Rebels and the crew of the Star's Delight, but sabotage the ship's shields, allowing them to shoot down the ship while it was escaping, destroying the entire cell. Corran pointed out that Barris could time the plan to coincide with Loor's arrival to display his efficiency in dealing with Rebels to the Intelligence officer. Barris approved, and Corran began executing the plan."}, {"tag": "p", "text": "Corran went to Tesc, claiming to have had a change of heart about the Empire, which had destroyed Eamon Yzalli's supposed home world of Alderaan, and could not bear to see her executed. He gave her a rank cylinder which identified her as Intelligence agent \"Kirtana Loor,\" and allowed her to take custody of the Star's Delight's crew, contact her conspirators, and escape. He meanwhile had the spare X-wing parts transferred to the Star's Delight, but reported to Barris that some of the parts had been stolen, reportedly believing someone had stolen them to repair their private T-47 landspeeder. In reality, he had stolen the parts to repair his X-wing. He then had Barris report that \"Eamon Yzalli\" had been executed for \"anti-Imperial behavior\", so that Tesc would take leave without him."}, {"tag": "p", "text": "The Star's Delight took off, and Mosh Barris sent TIE fighters in pursuit. Corran had originally planned to only use the Star's Delight's escape as a diversion for his own; however, he was forced to change his plans when he found out that the code to activate the shields had not been communicated to the crew as planned. He took off after the freighter in his X-wing, and communicated the code to activate the shields to the crew. He destroyed all four of the attacking TIEs and escaped along with the ship to the Rebel Alliance."}, {"tag": "p", "text": "After hearing about the battle, Rebel Captain Dromath attempted to convince Corran to join the Alliance. While initially reluctant, Corran agreed to join when he heard that Rogue Squadron was being reformed, and he might be good enough to join it."}, {"tag": "h3", "text": "After Corran Horn joined the Rebellion"}, {"tag": "p", "text": "Whistler also developed a very tight bond with Wedge Antilles's astromech droid R5-G8, or \"Gate\". After Rogue Squadron was captured by Ysanne Isard, Whistler and the other astromechs were fitted with a restraining bolt and deactivated for the duration of a joint Imperial-Rogue Squadron mission to defeat Prince-Admiral Delak Krennel. Whistler, however, had been reconfigured inside from his time with Corran as part of the Corellian Security Force, so the restraining bolt only communicated to him the signals from the controller, as opposed to actually shutting him down. Whistler used his security programming to re-activate Gate and slice into base floor plans and escaped. The two then booked passage to Oradin. The pair reached Talon Karrde and through him reached Mirax Terrik."}, {"tag": "p", "text": "At the time of one of his missions, Corran discovered that Whistler had a recorded message from his father outlining his Jedi heritage. While on a search for his kidnapped wife, Mirax, Corran asked the droid to play the message."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Whistler may have been the first astromech droid featured in the Star Wars universe to have a nickname not based on its numerical identification. Most subsequently-featured astromech droids have nicknames of their own."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}