{"url": "Who%27s_Pulling_the_Strings%3F", "categories": ["Category:Canon articles", "Category:Galactic Empire stubs", "Category:Imperial propaganda", "Category:Paintings and posters"], "nodes": [{"tag": "h1", "text": "Who's Pulling the Strings?"}, {"tag": "p", "text": "Who's Pulling the Strings? was a propaganda poster conceptualized by Imperial chief informational officer Ferric Obdur and illustrated by the artist Filris Parbert following the Battle of Endor. It featured a Hutt flanked by two New Republic soldiers on strings, implying a connection between the criminal underworld and the Republic. While Obdur did not particularly care for the poster's subtlety, Grand Admiral Rae Sloane, public leader of the largest Imperial remnant, approved it for dissemination throughout the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "In the center of Who's Pulling the Strings? was a large, green-skinned Hutt wearing a bandolier and belt with pouches and a holster attached, facing the right side of the poster with his head angled slightly towards the poster's front. He was depicted with glowing, neon green eyes, an orange New Republic starbird tattooed on his right arm, as well as a datapad in his hands. Standing on both sides of the Hutt were two faceless New Republic soldiers wielding DH-17 blaster pistols, each connected to several strings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Who's Pulling the Strings? first appeared in the novel Aftermath: Life Debt, written by Chuck Wendig and released on July 12, 2016. It was first identified as Who's Pulling the Strings? and first pictured in the reference book Star Wars Propaganda: A History of Persuasive Art in the Galaxy, written by Pablo Hidalgo and released on October 25, 2016, in which it was illustrated by Russell Walks."}, {"tag": "p", "text": "The image of the Hutt used in Star Wars Propaganda's depiction of Who's Pulling the Strings? was originally drawn by William O'Connor for use in the Star Wars Legends reference book The New Essential Guide to Alien Species, which was released on October 31, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}