{"url": "White_Current", "categories": ["Category:Legends articles", "Category:Articles which may contain original research", "Category:Force philosophies"], "nodes": [{"tag": "h1", "text": "White Current"}, {"tag": "p", "text": "The White Current was the Fallanassi interpretation of the Force, and was often used in the creation of illusions and concealment, rather than for anger, protection, healing, aggression, or any other reason. The White Current was uniquely different from other aspects and schools of thought in that the Current was the immersion of oneself in the actual flows and ripples within the Force itself, rather than the Force as a whole."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The White Current was found by the Force-sensitives of the planet of Lucazec, primarily that of the Fallanassi of the village of Ialtra. The Fallanassi there, unlike other Force-sensitives, had no desire to physically affect their surroundings; instead, they desired to focus solely on the mind, spirit and body, and how these three entities formed a single individual. These studies and explorations eventually gave way to the discovery that these three aspects flowed and formed eddies and whorls within the Force, which they named the White Current. The White Current, they quickly found, was an aspect within the Force, created by the mind, body, and spirit. Manipulation of, and immersion within, the current allowed for extreme manipulation of these three aspects. However, Fallanassi techniques allowed for little to no manipulation of other aspects of the Force. Because of this, Adepts of the White Current were capable of manipulating powers and abilities that directly pertained to the mind and how the current interacted with the body and spirit, but had no control over physical manifestations of the Force such as telekinesis."}, {"tag": "p", "text": "Practitioners of the White Current also gained the ability to sense the White Current around them, which allowed them to sense sentient beings by the ripples they made in the Current. This power allowed them to detect the presence of cloaked or invisible sentient beings - through the Force or technology - as well as their approximate numbers."}, {"tag": "p", "text": "Full Force immersion in the White Current could shield skilled practitioners from vision and electronics, including automated starship sensors. Long after the Fallanassi learned to immerse themselves in the White Current, they learned how to take objects and even places with them. Permanent Fallanassi illusions shielded the Jedi Praxeum on Yavin IV, as well as Fallanassi settlements. The White Current could even be used to make entire starships invisible, as demonstrated by the Fallanassi apprentice Akanah Pell during the Black Fleet Crisis. These ongoing effects did not require sustained meditation, but they did draw upon the presence of their creators or other Masters. For example, over-deployment of Jedi Masters weakened and compromised the permanent illusion which protected the Jedi Praxeum, causing the Invasion of Yavin 4."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}