{"url": "White_Squad", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Republic commando squads"], "nodes": [{"tag": "h1", "text": "White Squad"}, {"tag": "p", "text": "White Squad was an elite special forces squad of clone commandos within the Grand Army of the Republic that operated during the Clone Wars. Comprised of four clones of the Mandalorian bounty hunter Jango Fett, White Squad was led by Sergeant RC-1013. Six months after the start of the Clone Wars at Geonosis, beginning the galaxy-spanning war between the Galactic Republic and the Confederacy of Independent Systems, White Squad was tasked with a mission to Ord Mantell where they were to recover a diplomatic package that had been bound for Supreme Chancellor Palpatine from a gang of Trandoshan bounty hunters who had stolen it with the intent to sell the item to the Confederacy. During the course of the mission, three of the four commandos were killed by the Trandoshan mercenaries; the squad's sergeant was the only survivor, killing the last of the Trandoshans and recovering the package as ordered."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The four members of White Squad were clones of Mandalorian bounty hunter Jango Fett, born on the aquatic world of Kamino, located in the remote Wild Space region of the galaxy. Trained as clone commandos and deployed in opposition to the Confederacy of Independent Systems as part of the Galactic Republic's Grand Army following the outbreak of the Clone Wars, White Squad served as part of the Grand Army's Special Operations Brigade with their commando comrades, and operated out of Arca Company Barracks on Coruscant. Six months after the Battle of Geonosis, White Squad's soldiers were summoned to the headquarters of Republic Intelligence, along with the commandos of Blue Squad. There, they were briefed by an Advanced Recon Commando intelligence officer who informed the squad that a diplomatic package from Malastare intended to be delivered to Supreme Chancellor Palpatine, had in fact been stolen by a group of Trandoshan bounty hunters. The yellow-marked ARC trooper tasked the squad with traveling to the planet Ord Mantell, where the bounty hunters intended to sell the package to the Confederacy, and recover the package from the Trandoshans."}, {"tag": "p", "text": "On Ord Mantell, Blue Squad ambushed the Trandoshan mercenaries on the steet, but were killed when the Trandoshans threw a number of thermal detonators from their landspeeder while attempting to escape. At he order of White Squad's sergeant, RC-1013—a man known by the nickname of \"Sarge\"—White Squad's ordnance specialist destroyed one of the Trandoshan speeders with a missile launcher, while the squad sniper killed the pilot of a second speeder, causing it to crash. As the final speeder fled the scene with the package onboard, White Squad rushed to pursue, boarding a speeder piloted by the squad's fourth man and tracking the bounty hunters toward the industrial yards. Arriving at an open courtyard, the squad split up to search for the Trandoshans and it was the commando who had piloted their speeder who came across them: the Trandoshans were meeting with a squad of Confederacy battle droids, who opened fire on the soldier, killing him. Sarge quickly threw an EMP grenade through the door, shorting out the B1 and B2 battle droids, before White Squad poured in and destroyed the damaged droids with their DC-17m blaster rifles. Once the droids were destroyed, the commandos set their sights on a blast door at the rear of the building and the squad demolitions expert set a charge on the door that blew an entrance for the soldiers. The surprised Trandoshans rushed behind their speeder for cover as the clone commandos stormed the room with weapons firing. The squad's explosives man was shot and killed by one of the bounty hunters, but a grenade from Sarge left the Trandoshans dead. However, the Trandoshan leader had been hiding, and once the commandos' guard had been dropped, he struck from behind: firing a shot from his wrist blaster, he struck the ordnance module on the squad sniper's pack, detonating it and killing its wearer. As Sarge had been knocked down by the blast as well, the Trandoshan leader attempted to flee again, but Sarge jumped onto his back, dragging him down. Holding him by the neck, Sarge ejected the vibroblade on his right hand's knuckle plate and stabbed the bounty hunter in the chest, uttering that it was revenge for his squad's deaths. The sergeant then retrieved the package the clones had been sent after, and solemnly left to deliver it to Republic Intelligence as instructed."}, {"tag": "p", "text": "The package was later delivered to Chancellor Palpatine, who regarded the item inside as little more than an unimportant trinket, which he had Galactic Senate Vice Chair, Mas Amedda, relegate to a storage closet with a number of other similar political gifts. With his squad dead, Sarge was reassigned to a new commando unit, Aiwha Squad, which he would lead up to the end of the Clone Wars and the rise of the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2005, the third volume of the Clone Wars Adventures comics introduced two squads of Republic commandos with the story The Package. Though unnamed in the story itself, Wookieepedia uses the conjectural title of \"White Squad\" for the squad led by Sarge, in contrast to the equally conjectural \"Blue Squad\" for the sake of reference. White Squad's leader, Sarge, would go on to make a further appearance in the fourth volume of the Clone Wars Adventures comic story, Orders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}