{"url": "Who%3F_What%3F_Where%3F", "categories": ["Category:Canon articles", "Category:Games"], "nodes": [{"tag": "h1", "text": "Who? What? Where?"}, {"tag": "p", "text": "Who? What? Where? was a game in which the participants would list who they wanted to be informed first of their death, what they believed would kill them, and where it would happen. Members of the New Republic's Riot and Hound Squadrons played the game while in the Oridol Cluster several weeks after the Battle of Endor in 4 ABY."}, {"tag": "p", "text": "Around 5 ABY, members of a New Republic squadron led by Lieutenant Wyl Lark played Who? What? Where? whilst traversing underground tunnels at the planet Troithe. Later that year, during the Battle of Jakku, the New Republic pilot Vitale played the game over an open comm channel with a pilot of the Galactic Empire's 204th Imperial Fighter Wing.  Another New Republic pilot named Chass na Chadic gave her own turn of Who? What? Where? before making her final attack run before being downed."}, {"tag": "h2", "text": "Rules"}, {"tag": "p", "text": "In Who? What? Where?, each participant had to list three things. Who? was for who the individual wanted to first hear of the participant's death. What? was for what the participant believed would kill them. Where? was for the location of the individual's death."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Passing time"}, {"tag": "p", "text": "Several weeks after the Battle of Endor in 4 ABY, the New Republic EF76 Nebulon-B escort frigate Hellion's Dare and its two escort squadrons, Riot Squadron and Hound Squadron, were pursued into the Oridol Cluster by forces of the Galactic Empire's 204th Imperial Fighter Wing. Following the second attack, some of the New Republic pilots stayed up late in the frigate's recreational room. Upon suggestion of the Hound Squadron pilot Rawn and a subsequent majority support from the group, they played Who? What? Where?, the Ishi Tib Sata Neek going first."}, {"tag": "p", "text": "Rawn questioned whether they were specifying their ideal or accurate deaths, Neek confirming that they were doing the latter. Neek's submission was followed by ones from the pilots Fadime, Rep Boy, Kamala, Wyl Lark, Heater and Chass na Chadic. The Riot Squadron pilot Skitcher declared Chadic the winner before he could have his go and the pilots stopped playing the game after."}, {"tag": "h3", "text": "A game of life and death"}, {"tag": "p", "text": "Around 5 ABY, Lieutenant Wyl Lark led his own makeshift squadron of starfighters, airspeeders and skimmers during a campaign against Imperial forces in the Deep Core's Cerberon system. While the squadron traveled through underground tunnels at the planet Troithe, the airspeeder pilot Gorgeous Su suggested Who? What? Where?. Debating on who would go first, the pilots nominated the Y-wing pilot Nath Tensent, who did his turn. After contesting the specificity of Tensent's What?, Sergeant Vitale went next, followed by Su, the elderly pilot Denish Wraive, and the insectoid Prinspai, before the game was interrupted by the arrival of a pilot of the 204th."}, {"tag": "p", "text": "Later that year, during the Battle of Jakku, Wyl Lark led a starfighter wing against the 204th. In the ensuing dogfight, Vitale played Who? What? Where? with a 204th pilot over an open comm channel, much to the annoyance of another pilot. As the fighting progressed, Chass na Chadic gave her own submission of the game, which was similar to her turn in the Oridol Cluster, over the channel before she made a bombing run which resulted in the loss of her B-wing starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Who? What? Where? first appeared in the 2019 novel Alphabet Squadron, the first installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}