{"url": "White_(droid)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "White  (droid)"}, {"tag": "p", "text": "White was a feminine protocol droid of a slim and exquisite make likened as a work of art. With a smooth and delicate contour similar to that of a human replica droid, White, as her name suggested, was coated with pure and simple white paint that glistened in the light instead of a human replica droid's cloned skin. Serving as the assistant of the Knights of Silver Dawn leader, Li Yu, in a largely independent star system in the Oplovis sector around 82 BBY, the Jedi Sean observed that while White was similar to a replica droid, her white coating made her seem disdainful of imitating humans."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A protocol droid, White was the assistant of Li Yu, the head of the Knights of Silver Dawn. Together, Li and White operated in a largely independent star system in the Oplovis sector around 82 BBY. When Li found a heavily injured Sean stowing away aboard his battleship, Li rejuvenated the human with bacta treatment. Sean, a Jedi Padawan who fought the Vermilion Birds while disguised as a rogue member of their pirate crew, shortly regained consciousness and found himself bound by magnetic binders on the starship, and awoke to be interrogated by Li and White."}, {"tag": "p", "text": "While the pair interrogated Sean, White was alerted to the Vermilion Birds' attempt to contact Li. After Li spoke with his pirate contacts through a hologram installed within White, dismissing the pirates' demand for him to turn over his wanted captive, White remarked that Li was speaking nonsense. Li explained that he did so out of concern for their captive's presence, and told White to let Sean go contrary to the droid's advice for Li's safety."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "White possessed feminine programming and a slim and exquisite make that was likened by Sean as a work of art. With a smooth and delicate contour similar to that of a human replica droid, the protocol droid was coated with pure and simple white paint that glistened in the light as her name suggested. The droid's white coating was contrary to a human replica droid's cloned skin, leading Sean to observe that White seemed disdainful of imitating humans."}, {"tag": "p", "text": "White had five slim fingers on one hand, with the palm of her other hand bearing a hologram projector. The droid assisted Li Yu with his criminal business, being alerted to incoming calls for Li. White spoke with a soft, feminine voice, and provided commentary and advice on Li's actions. Sean analysed that White was more dangerous an opponent than Li Yu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "White appears in the Chinese webnovel The Vow of Silver Dawn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}