{"url": "Whorm_Loathsom/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Kerkoiden", "Category:Males", "Category:Separatist admirals and generals"], "nodes": [{"tag": "h1", "text": "Whorm Loathsom"}, {"tag": "p", "text": "Whorm Loathsom was a Kerkoiden male who hailed from the planet Kerkoidia and served both in his homeworld's planetary forces and as the general of the Retail Caucus's military forces in the Confederacy of Independent Systems. An accomplished commander, his numerous victories during the Clone Wars led him to infamy throughout the Inner Core. In 22 BBY, Loathsom captured the planet Christophsis, and the Galactic Republic dispatched Jedi-led clone trooper forces to liberate the planet. After being forced to retreat, Loathsom launched a counterattack, advancing his battle droid troops behind a deflector shield that rendered the Republic's artillery useless."}, {"tag": "p", "text": "High Jedi General Obi-Wan Kenobi pretended to surrender to the Kerkoiden in order to gain time for Jedi General Anakin Skywalker and his Padawan, Ahsoka Tano, to eliminate the shield generator. Loathsom eventually lost patience with discussing Kenobi's terms of surrender and threatened to kill the Jedi. After Skywalker and Tano destroyed the generator, however, Loathsom himself was captured. With his shameful defeat and capture on Christophsis, Loathsom was taken to Coruscant, where he was tried by the Republic and found guilty of treason, as his service in his Republic-aligned homeworld's planetary forces made him a member of the Republic Military. As of 19 BBY, he was still incarcerated within the Republic military base's high-level prison on Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Capturing Christophsis"}, {"tag": "p", "text": "The Kerkoiden male Whorm Loathsom came from the Expansion Region planet Kerkoidia and served in his homeworld's planetary forces. During the Clone Wars, he joined the Confederacy of Independent Systems as the general of the Retail Caucus's military forces and a leader within the Retail Caucus itself. His creative strategies won many victories for the Confederacy, including a string of military campaigns, leading him to become considered a legend throughout the Southern Core and winning himself the respect of Republic strategists based on the galactic capital, Coruscant. He proved his bravery while battling the Republic and was even seen by some as a hero on the Separatist side. In 22 BBY, in the seventh week of the war, the Confederacy set its sights on capturing the Outer Rim planet Christophsis. Loathsom's forces invaded the crystalline world and, via a massive planet-wide holotransmission, Loathsom told the planet's Christophsian inhabitants to submit to Separatist rule."}, {"tag": "p", "text": "As the Galactic Republic dispatched a contingent of the Grand Army of the Republic—under the command of High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker—to liberate Christophsis, the Dark Acolyte Asajj Ventress arrived on the planet and met with Loathsom. Ventress relayed intelligence to Loathsom on the Republic's plan to ambush the Separatist Droid Army from a double-towered business center, which had been collected and transmitted by her spy, Clone Sergeant Slick. Loathsom and Ventress used Slick's information to prepare an ambush against the Republic. Shortly thereafter, Skywalker and Kenobi went to the Confederacy base to conduct an investigation behind enemy lines. After engaging the Jedi in a lightsaber duel and forcing them to flee, Ventress relayed further orders to Loathsom through a tactical droid, telling Loathsom to delay the Jedi as long as possible while she left to execute a mission for her Master, Count Dooku."}, {"tag": "h3", "text": "Battling the Republic"}, {"tag": "p", "text": "With an army of greater size than the Republic had expected, Loathsom launched an assault on the Jedi and their clone trooper forces. As the Republic established a base in the planet's capital, Crystal City, Loathsom set out to destroy the Republic's command center with his battle droid troops before the base could be completed. Loathsom deployed his forces at the Republic's landing zone, but after his B1-Series battle droids, BX-series droid commandos, droid-piloted Single Trooper Aerial Platforms, and NR-N99 Persuader-class tanks did not succeed in breaching the Republic defenses, he sent more powerful droidekas and OG-9 homing spider droids to cut through the Republic's tower-mounted turret emplacements. When that, too, failed, he targeted a Republic refugee camp and besieged it with his forces just as the Republic was setting up a defense of the camp. Despite deploying droid starfighters and moving his ground troops forward under the protection of mobile super tank shield generators, Loathsom was unable to destroy the refugee camp, but he did not relent in his campaign for Christophsis. With his army spread thin over the world, Loathosm dispatched his battle droids in two groups to meet up at a rendezvous point on the planet. When his two battle groups were ambushed by Republic forces, Loathsom pressed his attack and sent forward several large octuptarra magna tri-droids. However, his forces were defeated by Clone Commander Cody and a Jedi Knight thanks to covering fire from the Republic Venator-class Star Destroyer Dauntless. After several days of fighting, the Kerkoiden was forced to retreat."}, {"tag": "p", "text": "Loathsom soon returned to attack the Republic's base in Crystal City, advancing B1, B2, and tri-droids in the front lines while he followed behind with a group of Armored Assault Tanks. However, the Republic's AV-7 Antivehicle Cannons forced the Confederate tanks to halt their progress. Learning of the enemy's artillery, Loathsom had an OOM command battle droid turn the troops around, and after his forces had pulled back, he set up a deflector shield in preparation for another attack on the Republic army. He then dispatched his forces in two groups from the south and the east to beleaguer Crystal City. Kenobi and Alpha Squad halted the south force's approach, but Bravo Squad was unable to stop the east force's advance. Loathsom then led his east battle group and advanced behind his expanding deflector shield, which effectively negated the Republic's long-ranged artillery."}, {"tag": "p", "text": "Loathsom sent his battle droids to destroy the Republic's cannons while he followed with lines of droid tanks. Because of the Confederacy's deflector shield, the Republic troops were unable to stop the advancing droids, and Kenobi had his troops protect the cannons while he gained time by stalling Loathsom. The Kerkoiden general cornered Kenobi with his Armored Assault Tank and a squad of super battle droids and DSD1 dwarf spider droids. Kenobi \"surrendered\" to Loathsom, forming some crystal rubble into a table with the Force, and the two seated themselves to discuss the \"terms of surrender.\" Over a cup of tarine tea, brought by Loathsom's LEP servant droid, LEP-96M3, the discussion of the Kenobi's surrender continued. Loathsom became increasingly impatient with Kenobi as he finally realized that Kenobi was stalling. Overturning the crystal table, Loathsom ordered his troops to seize the Jedi General. Loathsom demanded the Jedi's surrender and threatened to kill him. At that moment, however, Skywalker and his recently apprenticed Padawan, Ahsoka Tano, destroyed the deflector shield generator, causing the shield to recede and expose Loathsom's troops to long-range artillery. Kenobi broke free of the battle droids and captured Loathsom in a headlock."}, {"tag": "p", "text": "As the battle droids began to fire, LEP-96M3 was destroyed, and the Kerkoiden ordered his droid squad to stand down. With its renewed artillery usage, the Republic was able to defeat the Confederate forces, and Loathsom was taken prisoner, bound by handcuffs. Republic reinforcements arrived on Christophsis, and Loathsom was shamed with his defeat in a battle that would have been a sure Separatist victory."}, {"tag": "h3", "text": "Within custody"}, {"tag": "p", "text": "Following his capture, Loathsom was taken to Coruscant. There, he was tried and swiftly found guilty of treason, as Kerkoidia was still recognized as a member of the Republic, making him a member of the Republic Military for his service in his homeworld's planetary forces. After being interrogated by Republic Intelligence and having all useful information extracted from him, Loathsom was sent to solitary confinement, eventually ending up in the high-level prison of the Republic military base. As of circa 20 BBY, two years after his capture, he was still serving out a sentence in the prison alongside other captured Separatist comrades, including Techno Union Foreman Wat Tambor and Geonosian Archduke Poggle the Lesser. The clone troopers of the Coruscant Guard who oversaw prison security kept him under close surveillance in his solitary cell. Loathsom remained in Republic custody through 19 BBY, when the Republic became the first Galactic Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gruff and guttural, Whorm Loathsom was a cunning and accomplished commander who served the Confederacy of Independent Systems, proving his bravery in battle with the Republic on numerous counts. His strategies in battle led the Separatists to numerous victories, and he prided himself on his leadership skills. He saw nobility to war and believed that opponents should respect each other instead of behaving like savages, sometimes dismissing the losses to clone troopers and his own battle droids as expendable. Hailed as a hero by some on the Separatist side, Loathsom had faith in the Confederacy's causes, telling the people of Christophsis to submit to Confederate rule once his forces seized the world. He recognized the merits of a strategic retreat; when he realized that his droids would be useless against the Republic's heavy cannons on Christophsis, he ordered his forces to retreat and set up a deflector shield. However, he often overestimated his abilities as a Separatist leader. He was considered a legend throughout the Inner Core, but his supreme vanity and ego sometimes got in the way of his role as a general, resulting in orders and decisions formed more out of arrogance than of strategy."}, {"tag": "p", "text": "Notorious for being equally cruel and vain, Loathsom was not impervious to flattery, as evidenced by his reactions to Obi-Wan Kenobi's comments on his abilities, and his overly prominent ego, as well as his good manners, allowed Kenobi to stall him while Anakin Skywalker and Ahsoka Tano destroyed the shield generator. Loathsom loathed the fact that some did not afford Kerkoidens the respect that they deserved and was influenced by remarks on his species, rising to the bait and civilly discussing Kenobi's surrender when the Human Jedi Master implied that Kerkoidens were less civilized than Humans. His eagerness to teach the Republic a lesson or two sometimes caused his comments to lack respect when addressing associates such as Asajj Ventress. When Loathsom finally realized that Kenobi was stalling for time, he acted on his anger and overturned the crystal table where they were seated. He was quick in attempting to force Kenobi to surrender, but was later shamed after he was defeated and captured."}, {"tag": "p", "text": "Loathsom formed an attachment to his LEP servant droid, LEP-96M3, who had learned to perform his duties exactly as the Kerkoiden liked. He was subsequently saddened when the droid was destroyed on Christophsis, missing his servant considerably. Standing 1.75 meters tall, Loathsom had red eyes and bluish gray skin. He was able to speak both Galactic Basic Standard and Kerkoidese. In battle, he wore the ceremonial uniform of a Kerkoiden cavalier and a fauld in honor of his victories during the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Whorm Loathsom was created for the 2008 Star Wars: The Clone Wars film, which served as an introduction to the television series of the same name. First mentioned in the film's novelization and the book Star Wars: The Clone Wars: The Visual Guide, Loathsom made his debut in the film's junior novelization, which was written by Tracey West."}, {"tag": "p", "text": "Details relating to Loathsom's backstory were released in the January 2009 sourcebook The Clone Wars Campaign Guide by Wizards of the Coast, and he was also identified as the first of his species—Kerkoiden—to appear in Star Wars canon. Loathsom later appeared in the television series' first season episode \"The Hidden Enemy,\" aired on February 6, 2009, which served as a prequel to the 2008 film. He did not have a speaking role in the episode, however. Loathsom also appeared in The Clone Wars: Shadowed, the webcomic leading into the television episode. His fate after the events of The Clone Wars film was elaborated upon in the October 2009 Star Wars: The Clone Wars – The Official Episode Guide: Season 1."}, {"tag": "p", "text": "In the film, Loathsom was voiced by Corey Burton, who also provided the voice for Count Dooku and Ziro Desilijic Tiure. Burton voiced Loathsom with a Scottish accent, and this was evidenced further in Shadowed, with the accent being put into text and expressions. The Kerkoiden was based on concept art for a Neimoidian that was drawn by Doug Chiang during production for Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "2010 saw Loathsom being featured as one of the antagonists in the \"Republic Defender\" mini-game of the Star Wars: Clone Wars Adventures video game, which detailed the sections of the Battle of Christophsis following \"The Hidden Enemy\" and preceding The Clone Wars film. In 2011, Loathsom was featured in the non-canonical video game LEGO Star Wars III: The Clone Wars. Loathsom appears in the \"Republic Assault\" mission set on Christophsis, which involves the Confederacy and the Republic fighting for control of Crystal City. Completing the mission results in Loathsom being locked in the brig of the Venator-class Star Destroyer Resolute, which acts as the in-game Republic hub. By using the bounty hunter Robonino, it is possible to release him from his cell, making Loathsom available for purchase and later use in the Free Play mode of the game."}, {"tag": "h3", "text": "Fate after Christophsis"}, {"tag": "p", "text": "In February 2013, Loathsom made a brief appearance in the fifth season episode \"The Jedi Who Knew Too Much,\" on a security camera screen as one of the prisoners in the Republic military base. His inclusion in the episode conflicted with information established in The Official Guide: Season 1, which stated that he had eventually escaped from Republic custody. The episode's online guide on StarWars.com referred to his capture during the events of The Clone Wars film, while Holocron continuity database manager Leland Chee also noted that he was \"still\" in prison. This article therefore assumes that the details regarding his escape have been overridden in Star Wars canon. The following details the original information from The Official Episode Guide: Season 1."}, {"tag": "p", "text": "After being tried and found guilty, Loathsom is transferred to solitary confinement on the prison world of Akrit'tar. He eventually trades his prison cell for house arrest in a rustic but still elegant castle in the outbacks of Kerkoidia. Weeks after the transfer, Loathsom's castle is raided by Separatist operatives, and he is spirited away from Republic captivity. Star Wars: The Clone Wars Comic UK 6.9 implies that he returns to Separatist service, as he is said to be massing a new Confederate fleet in the Metellos system, but the magazine does not indicate a specific timeline for those events."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}