{"url": "Wialu", "categories": ["Category:Legends articles", "Category:Fallanassi", "Category:Females", "Category:Heads of government and state", "Category:Humans", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Wialu"}, {"tag": "p", "text": "Wialu was a Human female and leader of the Fallanassi who used the White Current to create a \"phantom fleet\" which aided the New Republic in its defeat of the Yevethans."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Leading the Fallanassi"}, {"tag": "p", "text": "A strong leader during the time of the Galactic Republic, Wialu helped the Fallanassi group to grow to a very large number on the world of Lucazec. The ability of the Fallanassi to create huge force illusions concerned Palpatine and after his induction as Emperor, the Fallanassi were one of the first groups to be targeted. Luckily, through use of force illusions the Fallanassi were amazingly adept at hiding their presence. Wialu decided to wait out the Emperor and continue to hide on Lucazec."}, {"tag": "p", "text": "However, unbeknownst to Wialu, they had a traitor in their midst. The young woman Talsava, had sold out the location of the Fallanassi to the Empire. With information on the Fallanassi's whereabouts, General Tagge descended on Lucazec to force a quick surrender. Tagge offered terms of surrender that included the Fallanassi swearing fealty to the new Emperor. Conferring with a council of Fallanassi that included the traitor Talsava, Wialu decided to reject Tagge's offer."}, {"tag": "p", "text": "Luckily, the Empire's iron grip had not closed tight enough to risk open bombardment of Lucazec, so Tagge took another road. Using carefully crafted politics, Tagge was able to discredit the Fallanassi in the eyes of their neighbors, forcing them to flee the system. Wialu lead the Fallanassi to J't'p'tan, a small world in the Koornacht Cluster. The other residents of the world, the H'kig monks, were suspicious of the Fallanassi until Wialu orchestrated a compromise in which the Fallanassi protected the H'kig's Temple of the Infinite Spirit through force illusions in payment for sanctuary."}, {"tag": "h3", "text": "Judging the Traitor"}, {"tag": "p", "text": "At an unknown time, Wialu became aware of Talsava's treachery and convened with the rest of the council on her fate. For her crimes, Talsava was exiled from the Fallanassi forever. However, because Talsava had a young child by the name of Akanah, Wialu offered to allow the child to stay with the Fallanassi. Talsava refused and fled to the world of Carratos. Some time later, Talsava came to her senses and contacted the Fallanassi about helping train her daughter in the powers of the Fallanassi. Wialu sent a young woman, Nashira, to aide Talsava in teaching her daughter."}, {"tag": "h3", "text": "Conflict with the Yevetha"}, {"tag": "p", "text": "Many years later, Akanah reunited herself with the Fallanassi, and Wialu learned that she had tricked a young man by the name of Luke Skywalker to help her by claiming that Nashira, her former teacher, was Luke's long lost mother. Luke came to Wialu to learn more about his supposed mother Nashira. However, Wialu refused to give Luke any information about Nashira because he was not a member of the Fallanassi."}, {"tag": "p", "text": "To make up for her subterfuge, Akanah convinced Wialu and the rest of the Fallanassi to help create Force illusions of the New Republic fleet over N'zoth. The ships helped draw fire away from the Republic ships leading to less casualties. Soon after the Battle of N'zoth, Wialu and the Fallanassi left J't'p'tan aboard the star liner Star Morning."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "She passed away at the end of the Yuuzhan Vong War, and Akanah replaced her as leader of the Fallanassi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}