{"url": "Widdle_Warrick/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Ewoks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Widdle Warrick"}, {"tag": "p", "text": "The Ewok Widdle Warrick, nicknamed Willy, was the second-oldest son of Deej and his wife Shodu. He had two brothers, Weechee and Wicket, and one sister, Winda. Widdle was notable among the Ewoks for being a glutton and accident prone. He and his elder brother Weechee would frequently challenge each other. He was the black sheep of the Warrick family, and often the butt of jokes for other Ewoks. In his younger years, he infrequently displayed cowardice. Nevertheless, he was capable of committing feats of great bravery, like his brothers, especially at the Battle of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In his younger years, Willy enjoyed various adventures in the wake of his young brother Wicket, even though Willy was accused several times of being a coward. One day, he came to discover a diamond in the forest that could give courage to an Ewok. His brother Weechee had disappeared after a smooth race, and Willy, encouraged by the diamond, wanted to save his brother. While Willy unknowingly lost the diamond, he succeeded in his rescue, thus independently saving his brother with his own courage."}, {"tag": "p", "text": "During a fishing trip, Willy's father, Deej, cut himself on a poisonous fungus, resulting in him falling deathly ill. In order to save his life, the village shaman Logray required three ingredients to concoct a healing potion: a star urchin from the land of the dandelion warriors, a lantern-bird feather, and a Frosch egg. The potion had to be made before sunset, so to acquire these items in time, Logray assigned each of Deej's three sons the task of retrieving one of the ingredients. Willy was told to acquire a lantern-bird feather; however, during Logray's briefing, Willy drank a potion which caused him to bounce and float. After being scolded by Logray, he was towed outside with a rope by his brothers using rocks as ballast. After they split up, Willy discovered a lantern-bird nest in a high tree. He discarded the rocks Logray used to weigh him down in order to float his way to the nest. He grabbed a feather, but before he could escape, the mother lantern bird returned and sat on the nest, trapping him."}, {"tag": "p", "text": "He remained trapped until Wicket, Mring-Mring, and Teebo found him (at which point the floating effect had worn off) and took him to the Frosch cave, where Weechee was in trouble. After rescuing him, the group was pursued by Frosch, who surrounded them at the edge of a cliff. Willy and the others attempted to scale the cliff to a plateau. However, he fell and, in a bizarre turn of events, scolded the Frosch, who were temporarily nonplussed by his sudden display of foolhardy bravery. Willy's courage ran out when he realized that the Frosh were about to attack, and he surged up the cliff past his stunned companions to the top. The group was then trapped until Mring-Mring told the Ewoks to focus their minds and imagine a giant, winged creature that could carry them to safety. Though skeptical, the Ewoks thought hard, and Mring-Mring transformed himself into a giant avian. The Ewoks climbed aboard his back, and they flew back to the village, where they delivered the ingredients to Logray just before sunset. With the potion made, Deej was healed, and Willy joined his family in celebration."}, {"tag": "p", "text": "Willy received the Blue Wings of Strength from Logray when he was part of the caravan that went to rescue Jeremitt and Catarine Towani from the gorax."}, {"tag": "p", "text": "Willy later took part in the Battle of Endor. He, Wunka, and Chewbacca hijacked the AT-ST Tempest Scout 2, turning the tide of the battle to the advantage of the Rebel forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tony Cox played Widdle in Star Wars: Episode VI Return of the Jedi, Caravan of Courage and The Battle for Endor. In Ewoks, John Stocker voiced Widdle during the first season."}, {"tag": "p", "text": "An action figure, as well as the StarWars.com original Databank, placed Widdle in Return of the Jedi at the Battle of Endor. In Star Wars Insider 100, Leland Chee confirmed that Willy was one of the Ewoks who hijacked Tempest Scout 2 along with Chewbacca."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}