{"url": "Wicket_Finds_a_Way:_An_Ewok_Adventure", "categories": ["Category:Real-world articles", "Category:Ewok Adventure books"], "nodes": [{"tag": "h1", "text": "Wicket Finds a Way: An Ewok Adventure"}, {"tag": "p", "text": "Wicket Finds a Way: An Ewok Adventure is a 1984 children's book written by Melinda Luke and published by Random House."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Wicket travels to Logray's hut in hopes of becoming his apprentice as a medicine man. However, Logray feels that Wicket is too young, headstrong, and hasty to become a medicine man, which saddens Wicket. He and Logray soon learn that Latara is sick and that Logray will need some of the fuzzynettle plant in order to make medicine that will heal Latara. Logray explains that a group of Ewoks would be sent the following morning to retrieve the plant. However, Wicket is concerned for Latara, so, unbeknownst to the others, he goes looking for the plant himself. He rides Baga, his pet bordok, into the forest to find the plant. They travel all night. Suddenly, Wicket finds that he has traveled off the main path and is lost. He then reallizes that he can use the night stars as a guide to find his way home. He, along with the help of Baga, digs through the snow until they find the plant. They retrieve some of it and begin the journey back to Bright Tree Village. They arrive at dawn the next morning. Wicket gives the plant to Logray, who thanks Wicket and uses the plant to make medicine for Latara. The next day, Logray announces that he wants Wicket to be his apprentice, as Wicket has shown that he has the primary trait of a medicine man: his love for those he takes care of."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Lumat is referred to only as \"Latara's father\" and Bright Tree Village is called simply \"Ewok Village.\""}, {"tag": "h3", "text": "Timeline"}, {"tag": "p", "text": "Baga is called Wicket's pet, although other sources show him to be Kneesaa's. While Wicket and Teebo did train the bordok before giving him to Kneesaa (in Rites of Power), she named him. So while no official published timeline of these stories exists, it is likely that this story takes place after Rites of Power and that Wicket was borrowing Baga for a while."}, {"tag": "p", "text": "This story ends with Logray taking on Wicket as an apprentice. In The Ice Demon, we see Wicket trying to use some magic that Logray has taught him, but Wicket ends up deciding that it is not for him. So Wicket Finds a Way likely takes place before The Ice Demon."}, {"tag": "h2", "text": "Sources"}]}