{"url": "Wildfire_(adventure)", "categories": ["Category:Real-world articles", "Category:The DarkStryder Campaign adventures"], "nodes": [{"tag": "h1", "text": "Wildfire (adventure)"}, {"tag": "p", "text": "Wildfire is an adventure in The Kathol Outback, and is part of The DarkStryder Campaign. It is set in 8 ABY."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While stationary in deep space performing maintenance and processing astronavigation data, the New Republic corvette FarStar picks up an unidentified ship on long range sensors. They discover an Imperial assault shuttle adrift and enveloped by energy discharges. Believing that DarkStryder technology may be responsible for the ship's plight, along with the sensors registering life forms on the vessel, Captain Kaiya Adrimetrum orders a rescue operation. The team manages to extract the personnel, and the last computer logs before the vessel is destroyed. The crew of the FarStar learn that the Qektoth Confederation was behind the shuttle's distress, and that the survivors have been infected with a biochemical agent."}, {"tag": "p", "text": "The FarStar travels to Uukaablis, hoping to find medical facilities to cure the Imperial crewmen. However, despite the Uukaablians vast medical knowledge, they have no cure. They direct the crew of the FarStar to Drigor Tarrens, a former member of the Qektoth Confederation. Medical personnel on the FarStar learn that the crew has also been exposed to the biochemical agent, and the First Officer, Gorak Khzam deserts his post following the revelation of his past as a slaver by Uta T'Cha. He steals the Muvon and flees the planet."}, {"tag": "p", "text": "Meeting with Tarrens, he directs them to a research facility in the Qu'mock system. After arriving in the system, the FarStar launches a boarding party to secure data from the station. During the mission, the Qektoth attack cruiser Scourge engaged the FarStar in battle. As the station prepares to self-destruct, Tarrens - infected with the agent himself after his contact with the FarStar crewmembers - assists the New Republic in their effort. With the data retrieved, the Uukaablians concocted a cure for the agent."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Sources"}]}