{"url": "Wilhuff_Tarkin/Legends", "categories": ["Category:Legends articles", "Category:Articles with an excess of redlinks", "Category:Cleanup", "Category:Articles in need of updating", "Category:Biologists", "Category:Coruscanti", "Category:Death Star residents", "Category:Diplomats", "Category:Eriaduans", "Category:Galactic Empire science and engineering personnel", "Category:Galactic Republic governors", "Category:Grand Moffs of the Galactic Empire", "Category:Humans", "Category:Judicial Forces officers", "Category:Males", "Category:Philosophers", "Category:Pilots", "Category:Poets", "Category:Republic Navy admirals", "Category:Slavers", "Category:Spies", "Category:Tarkin family"], "nodes": [{"tag": "h1", "text": "Wilhuff Tarkin"}, {"tag": "p", "text": "Wilhuff Tarkin was a Human male who was one of the most powerful individuals in the Galactic Empire, a Grand Moff who shaped Imperial doctrine and was the driving force behind the creation of its key embodiment, the Death Star. Born on Eriadu to the powerful and militaristic Human Tarkin family, the ambitious Tarkin began his career by serving in the Republic Outland Regions Security Force. He then retired and entered politics, becoming lieutenant governor of Eriadu and the Seswenna sector, before returning to the military in order to serve Supreme Chancellor Palpatine as an agent of the secret Sith Lord's New Order movement. It was in that time that Tarkin learned of his friend Raith Sienar's designs for the Expeditionary Battle Planetoid and, convinced of the potential of the design, presented Palpatine with the plans for what would become the Death Star."}, {"tag": "p", "text": "Tarkin gained increasing stature as a vocal supporter of Palpatine and received notice as the Seswenna sector's governor throughout the Clone Wars. At one point, he served as a captain under Jedi General Even Piell, where he and his crew were held in the Citadel, a Separatist prison, and escaped with the help of a strike team of Jedi and clone troopers. Later on, he had been promoted to Admiral. He was present during the capture of Boba Fett after the Battle of Xagobah. In the last days of the Clone Wars, Palpatine appointed Tarkin as the first Moff, and when the Galactic Republic became the Galactic Empire, the new Emperor Palpatine gave him oversight of the construction of the Death Star. Tarkin soon formulated the Tarkin Doctrine, which helped solidify his reputation as the greatest architect of the Empire save Palpatine. The Tarkin Doctrine called for rule of the galaxy through fear of overwhelming force, and recommended the creation of superweapons such as the Death Star to create terror of Imperial reprisal that would stifle any thoughts of rebellion. Delighted, Palpatine made Tarkin the first Grand Moff, giving him control of nearly the entire Outer Rim."}, {"tag": "p", "text": "As Grand Moff, Tarkin ruled with the same unyielding ruthlessness he had helped enshrine in Imperial doctrine, often cooperating with Darth Vader. As the long-delayed construction of the Death Star stalled, Tarkin created the secret Maw Installation to refine the design, placing it under the control of his mistress and protégée, Admiral Natasi Daala. With the aid of the Maw Installation's scientists, the Death Star was finally made operational in 0 BBY. Confident he could destroy the Rebel Alliance opposing the Empire, Tarkin began his campaign of fear by destroying Alderaan, a hotbed of Rebel sentiment. Tarkin then allowed prominent Rebel Princess Leia Organa, captive aboard the Death Star, to escape and lead the Death Star to the secret Rebel base on Yavin 4. There, seconds away from annihilating the Rebel headquarters, Tarkin died when Luke Skywalker destroyed the Death Star, a victim of his own belief in the Death Star's invincibility."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Ambition and ascent"}, {"tag": "p", "text": "Wilhuff Tarkin was born into the Tarkin family, an old, wealthy and powerful clan that had originally been granted the world of Eriadu and still remained dominant in the politics and business of Eriadu and the Seswenna sector, as well as carrying strong influence in galactic politics. He and his younger brother, Gideon Tarkin, grew up in a family steeped in tradition, prestige, and accomplishment in politics, science, the arts, and the military. Tarkin's older cousin was Ranulph Tarkin, senator for the Seswenna sector and a leading militarist—and after his 44 BBY death in the Stark Hyperspace War, a war hero. Though Tarkin took pride in his family's history of service to the Galactic Republic and accomplishments on Eriadu, he resented the lack of respect his Outer Rim-based clan received in comparison to the aristocratic families of the Core Worlds, fueling in him a burning ambition to excel."}, {"tag": "p", "text": "As a young man, Tarkin enrolled in a military academy, in accordance with the Tarkin family's strong military tradition. Driven to live up to every aspect of the family legacy, young Wilhuff Tarkin cultivated expertise in multiple fields, establishing a reputation as an intellectual prodigy with a well-rounded mind. He displayed great aptitude as a tactician in the course of his schooling, drafted starship designs that inspired the design of interdictor craft, broke new ground in xenobiology theory, and demonstrated great talent as a poet and philosopher. A keen analyst of the political situation, Tarkin perceived the Galactic Republic to be a decaying institution, and envisioned a new future for the galaxy. His vision was a militant one, authoritarian and Humanocentric, and he possessed a driving ambition to rise to the ranks of power, where he could affect change."}, {"tag": "p", "text": "After graduation, he and his brother Gideon joined the Republic Outland Regions Security Force, a military policing force that kept the Outland Regions, a Rim area that included Eriadu, safe from piracy. Tarkin was a fast riser who achieved the rank of commander, and during the course of his service visited Coruscant, capital of the galaxy, several times. There, around 39 BBY, he befriended Raith Sienar, heir to the Republic Sienar Systems shipbuilding concern and an accomplished engineer who was near Tarkin's age."}, {"tag": "p", "text": "Still a young man, Commander Tarkin retired from the military in order to seek a political career on Eriadu. With the aid of his family's political heft and numerous connections, Tarkin was elected the lieutenant governor of Eriadu and the Seswenna sector by 33 BBY, dwelling in an elegant mansion on Eriadu City's bay. A rising politician, Tarkin was acquainted with Senator Palpatine of Naboo, himself an influential member of the Galactic Senate—and secretly the Sith Lord Darth Sidious, in which guise he appealed to Tarkin's speciesism and convinced Tarkin to serve his agenda. Tarkin gained a measure of notoriety in galactic political circles for his militant views, while on Eriadu he was known as a foe of the Eriaduan branch of House Valorum. Though he was subordinate to the sector governor, Tarkin was an active force in Eriaduan life, taking a strong hand in political, military, and economic affairs."}, {"tag": "p", "text": "When, in 33 BBY, Palpatine saw profit in manipulating the competition between Lommite Limited and InterGalactic Ore, two rival lommite companies from nearby Dorvalla, Lieutenant Governor Tarkin arranged a contract with each company to deliver lommite to Eriadu on short notice, casting it as a competition for a long-term supply contract that could provide one company with dominance over the other. Tarkin set up a ceremony on an orbital habitat, scheduled for the arrival of the contesting shipments, featuring himself, the heads of each company, and the executive officers of Eriadu Manufacturing and Valorum Shipping and Transport, Eriadu's two main lommite consumers. The two convoys, however, were sabotaged, and collided upon exiting hyperspace early. The disaster forced Lommite Limited and InterGalactic Ore into a merger as Dorvalla Mining, which granted its shipping rights to the Trade Federation. The power of Neimoidian Trade Federation Viceroy Nute Gunray, a pawn of Palpatine, increased as the result of his involvement in the deal."}, {"tag": "p", "text": "When Supreme Chancellor Finis Valorum suggested the taxation of the former free trade zone of the Mid and Outer Rim as part of a deal allowing the Trade Federation to increase its defense allotments to respond to attacks by pirates and the Nebula Front terrorist movement, Palpatine suggested a conference be held on Eriadu to iron out the issue. Tarkin hosted the Supreme Chancellor at his seaside mansion, which was overrun with security personnel well before he was able to personally receive Valorum. Tarkin was in fact complicit in Palpatine's scheme to murder most of the Trade Federation Directorate at the summit, which would place the Neimoidian faction serving Darth Sidious at the head of the Trade Federation."}, {"tag": "p", "text": "As Tarkin was about to leave with Valorum for the opening of the Eriadu Trade Summit, the Jedi assigned to protect Valorum informed the Supreme Chancellor of evidence of a Nebula Front conspiracy to assassinate him. Though Valorum was reluctant to show fear by increasing his protection, Tarkin convinced him to take some precautions. Tarkin authorized Eriaduan security forces to take any necessary measures to ensure the Supreme Chancellor's safety, instructing them to put efficacy over legality. Valorum, though, was not the true target, and the Nebula Front was able to carry out the assassination of almost the entire Trade Federation Directorate as Tarkin watched in Seswenna Hall. Valorum assigned the Judicial Department to investigate the incident, but, serving Palpatine's interests, Tarkin stonewalled the effort by claiming Eriaduan jurisdiction, then ensuring that the investigation stalled until most evidence had been lost."}, {"tag": "p", "text": "Valorum was weakened in the wake of the scandal, and in 32 BBY, he was ousted from the Supreme Chancellorship and replaced with Palpatine. Tarkin had previously attempted to curry favor with multiple factions, but he saw a sea change in the political situation and moved to ally himself more closely with Palpatine's administration. He became connected to the secretive but emergent New Order movement quietly building in the government, which agreed with Tarkin's authoritarian, militaristic, and Humanocentric beliefs. Tarkin left office, and Supreme Chancellor Palpatine reactivated Tarkin's commission and moved him to Coruscant, where he became a valuable agent of the New Order. Tarkin kept a small but prestigiously located apartment high in Prime Senate Spire. Tarkin's service earned him the right to wear robes of senatorial favor, a distinguishing honor that signified exceptional service to the Galactic Senate."}, {"tag": "p", "text": "One of Tarkin's assignments was to monitor the Jedi and work to prevent any increases in their power. In the course of his surveillance, he learned that young Jedi Padawan Anakin Skywalker had a habit of repairing droids, and placed a broken droid, programmed to spy, so that Skywalker would come across it. The young Jedi restored the droid to functionality and allowed it to roam the halls of the Jedi Temple, which gave Tarkin the ability to eavesdrop on many sensitive private conversations, including Jedi High Council meetings. Tarkin was also secretly involved with a Trade Federation-aligned association of assassins that targeted the Jedi."}, {"tag": "h3", "text": "Zonama Sekot"}, {"tag": "p", "text": "In 29 BBY, Tarkin attended a secret meeting in which he learned that Palpatine had, after three years, forced a resolution to the fallout from the attack the Trade Federation had staged on Naboo over the taxation of the trade routes. The Trade Federation security forces were to be disbanded and disarmed, their assets turned over to the Republic. The main focus for Tarkin, however, was a mission to seek out Zonama Sekot—a mysterious and remote planet, considered half legend but rumored to produce extraordinary living starships—and obtain one of its starships, or even control over the planet."}, {"tag": "p", "text": "He came afterward to see his old friend Raith Sienar, who had by that time ascended to control of the Sienar business empire, and whom Tarkin knew to secretly have a Sekotan ship. Tarkin explained to Sienar the nature of Zonama Sekot and asked for his expertise, but did not bring up the ship when Sienar pretended unfamiliarity with the planet. During the meeting, Tarkin observed and was fascinated by Sienar's designs for an Expeditionary Battle Planetoid, a massive space station designed to control star systems, which featured a giant turbolaser powered directly by the station's core. Tarkin saw tremendous potential in the concept, especially if the defensively potent design's weapon was upgraded to provide sufficient power to ruin a world; fear of such a weapon's visitation, he believed, would solve the ancient problem of how to keep order in a galaxy too large for any fleet to patrol effectively and deny support to guerrilla movements."}, {"tag": "p", "text": "Soon afterward, Tarkin was forced to put his plan into action abruptly when he found that the Jedi were sending a mission of their own to Zonama Sekot. Tarkin, using a tracker he had planted on Sienar, followed the engineer into his secret hall of engineering failures, bringing Ke Daiv as a bodyguard, and demanded that Sienar provide access to the tracking beacon he had built into the ship Star Sea Flower—the transport used by the Jedi expedition—during a refitting. He then asked Sienar to command the venture to Zonama Sekot, an offer the other man accepted. He briefed Sienar on the expedition, which was to consist of decommissioned Trade Federation ships and their crews, which had not yet been turned over to the Republic, as well as Daiv, who would report back to Tarkin. They then had to wait for the Jedi ship to reach Zonama Sekot, allowing them to learn the planet's location through the tracking device. During that time, Tarkin imposed on Sienar to show him the Sekotan ship that Sienar owned, though there was little to be learned from the dead craft. Once the Star Sea Flower emerged from hyperspace, Tarkin rushed Sienar to his task force and sent him off. Observing his lackluster forces, Sienar accused Tarkin of rigging the situation so that Sienar would fail, but the commander denied that allegation."}, {"tag": "p", "text": "As Sienar's expedition drew on with no report, Tarkin sent Sienar a message asking for an update. Sienar, seeking to bring Tarkin running, sent a reply that falsely stated that Daiv had failed in an attempt to assassinate him and had been sent on a suicide mission, and that Sienar had found something magnificent and required no assistance. Having played on his contacts in the Senate for greater support, Tarkin rushed a task force of Republic vessels, stronger than the one he had assigned Sienar, to Zonama Sekot in order to take control of the situation, and activated the hidden programming he had buried in Sienar's droid starfighters to impel them into an attack on the planet—the conflict justifying Tarkin in taking a more militaristic approach when he arrived. Sienar was able to disable most of the droids before they launched, but Tarkin had Captain Kett, captain of Sienar's flagship Admiral Korvin, place Sienar under arrest. Sienar would not comply with Tarkin's request that he be given access to the new programming with which he knew Sienar had equipped his droid complement, so Tarkin transferred to the Admiral Korvin and escorted his former friend to his own flagship, Rim Merchant Einem."}, {"tag": "p", "text": "Tarkin launched the invasion with his own forces, justifying it as a police action involving a starship chase he observed in the atmosphere. He deployed sky mines and droid starfighters, giving the planet's inhabitants no warning. He was surprised when the world deployed greater defenses than he had expected, launching waves of ships that brought down many of Tarkin's starfighters. Tarkin located one large Sekotan ship that had set down on its own, and landed with his forces to capture it. He recognized the pilot as Anakin Skywalker, a member of the Jedi expedition to the planet, and took him and the ship aboard the sky-mine delivery ship he had used as a landing craft. Tarkin questioned the boy about the ship, nearly provoking him into attacking Tarkin with the Force. The Star Sea Flower began boarding the ship in a rescue effort led by Skywalker's Jedi Master, Obi-Wan Kenobi, and Tarkin rushed from the hangar bay. The Jedi escaped in the Jabitha, their Sekotan ship, while Tarkin had to abandon the minelayer, which the Jedi had rigged with explosives, in an escape pod that he shared with Sienar."}, {"tag": "p", "text": "Recovered by the Rim Merchant Einem, Tarkin launched a renewed assault on the planet. To his shock, Zonama Sekot engaged massive engines and the entire planet jumped to hyperspace. The effect of its jump hurled Tarkin's fleet into chaos, while the Jedi escaped. Tarkin managed to limp his fleet home and, called before Palpatine, presented him with Sienar's plans for the Expeditionary Battle Planetoid, taking sole credit for the design. Sienar, uneasy with the design, did not dispute him, and the design allowed Tarkin to redeem his failure to secure Zonama Sekot for Palpatine, who was interested in the concept. Palpatine began work on bringing the project to fruition himself, having the plans refined by engineer Bevel Lemelisk in collaboration with Geonosian engineers, while Republic researchers worked on component systems. Having been cut out of the process, Tarkin believed that Palpatine had ultimately abandoned the plans."}, {"tag": "h3", "text": "The Clone Wars begin"}, {"tag": "p", "text": "Tarkin was known for his support of Palpatine and intellectual argumentation in favor of the Chancellor's moves to consolidate power, and frequently advocated Palpatine's policies before the Galactic Senate, a venue in which he had great success. Tarkin had many friends within the Senate, as well as in the business realm, contacts that allowed him to further rise in influence. By 22 BBY, Tarkin was serving as the governor of Eriadu and the Seswenna sector. His brother, Brigadier Gideon Tarkin, served as his Minister of Security, while relative Shayla Paige-Tarkin represented the sector in the Senate. Under Tarkin, the sector remained loyal to the Republic, even as the region became a hotspot of activity for the growing Separatist movement and the neighboring Sluis sector seceded."}, {"tag": "p", "text": "In 22 BBY, the Clone Wars broke out between the Republic and the secessionist government, the Confederacy of Independent Systems. Eriadu was a major Republic stronghold during the war, a significant forward position surrounded by heavily armed Separatist sectors—and it was under Tarkin's command. Gideon Tarkin commanded the Republic's fleet in the area. Eriadu and Sullust were the region's key fortresses, but in the second year of the war, Sullust defected to the Confederacy. Tarkin's brother commanded a major offensive directed against Sullust, losing the Battle of Sullust but seizing much of the Sluis sector from the Separatists. While Gideon Tarkin was holding off the enemy, Governor Wilhuff Tarkin, too, made a name for himself in the Clone Wars. Not all was fighting, as he engaged in multiple negotiations with the Separatists, and was aided in many of them by Jedi Master Luminara Unduli."}, {"tag": "p", "text": "Even with his position as Governor during the Clone Wars, Tarkin was able to be recommissioned into the Republic Navy as an officer. While serving as Captain of a Venator-class Star Destroyer under the command of Jedi General Even Piell, Tarkin and Piell undertook a mission to find the Nexus Route, a strategically valuable hyperspace route which would lead into both the heart of the Galactic Republic and the Confederacy of Independent Systems. During the mission, however, they were ambushed and attacked by Separatist forces. Before they were boarded, Piell and Tarkin each memorized half of the information regarding the Nexus Route before erasing it from the ship's computer files. After being forced to surrender, Tarkin and Piell, along with other officers were taken as prisoners to the Citadel, a Separatist prison on Lola Sayu. Once Piell was freed from captivity by a rescue team led by the Generals Obi-Wan Kenobi, Anakin Skywalker and Commander Ahsoka Tano, Piell informed his liberators that Captain Tarkin possessed the other half of the Nexus Route coordinates. Making their way towards the prison cell holding the Republic officers, the Jedi succeeded in freeing Tarkin and the clone officers."}, {"tag": "p", "text": "Although initially surprised to see his Jedi superior officer again, and elated to be redeemed from capture, Tarkin quickly became pessimistic about the overall situation since they were still in the heart of enemy territory. After taking a moment to consider General Kenobi's escape plan, Tarkin interjected with an idea of his own—to keep the group, small as it already was, together in order to improve their chances of both protecting the valuable information and escaping from the Citadel. Although he tried to convince the group that greater strength could be found in greater numbers as opposed to a divided group, General Piell concurred with General Kenobi and told Tarkin to accompany General Skywalker's group. Tarkin, slightly annoyed that his idea was flat-out rejected, nonetheless did as commanded and followed Skywalker, Tano and a group of clones into the old tunnels beneath the Citadel."}, {"tag": "p", "text": "After Skywalker commented on how everything was proceeding according to Kenobi's plan thus far, Tarkin once again gave voice to his pragmatism by asking what would happen if things stopped going according to plan. Although slightly annoyed by the outspoken and opinionated Republic officer, Skywalker insisted that Tarkin trust him because of the fact that Jedi can be quite good at improvising whenever plans failed. When Tarkin claimed that he only trusted those who took action, Skywalker retorted that he only trusted those who understood the concept of gratitude, reminding Tarkin that he would still be a helpless prisoner if it weren't for the efforts of the Jedi."}, {"tag": "p", "text": "While Skywalker's Padawan, Tano, took point, Tarkin lacked faith in the young Padawan's ability to lead the group. Captain Rex tried to assure Tarkin that his experience with Ahsoka enabled him to trust in her abilities, but Tarkin was hardly convinced and dismissed the clone's assessment of Tano with silence. As the group continued to make their way to the rendezvous via the old tunnel system, Tarkin became increasingly impressed with the layout of the Citadel and its virtually impregnable status—much to the surprise of Tano. Tarkin merely chided her for being short-sighted and explained that their entire ordeal only proves the Citadel's strategic worth, thus causing him to lament on how the fortress was seized by the Separatists rather than the Republic. Skywalker agreed with Tarkin's point of view of the matter."}, {"tag": "p", "text": "Meanwhile, Tarkin admitted that while Skywalker had managed to earn his trust, the rest of the Jedi Order fell short in that regard. Not only did Tarkin find their tactics ineffective, he also felt that the Jedi Code was far too restricting in the sense that it prevented its adherents from escalating their efforts to win the war. Rather than feeling offended, Skywalker found Tarkin's argument enlightening and agreed that the Jedi were not doing enough to defeat the Separatists, thus providing a sense of common ground between the two."}, {"tag": "p", "text": "By the time they reached the shuttle's location, the Separatist garrison had already caught on to them and proceeded to cut off their only means of escape. Tarkin argued that a forward charge was necessary in order to reach the shuttle and use its weaponry to annihilate their attackers. Before anything could be done, however, the shuttle was destroyed and the group was forced to retreat as they became quickly overwhelmed by the enemy's numbers."}, {"tag": "p", "text": "Once they were provided with a set of coordinates to the location where they would be rescued, Tarkin wondered what the group's contingency plan would be if the Jedi failed to rescue them, much to the annoyance of General Piell. When Skywalker tried to caution Tarkin against arguing with a Jedi superior officer, Tarkin was unfazed and declared that he stood by his principles without hesitation or compromise. He also did not care much for his standoff with General Piell, feeling confident that his career was perfectly secured as he had fallen into the favor of Supreme Chancellor Palpatine. Skywalker responded by mentioning his own friendship with the Chancellor, thus further impressing Tarkin and allowing the two to develop a greater sense of mutual respect."}, {"tag": "p", "text": "After another short skirmish with the Separatists, Tarkin and most of the group emerged unscathed—but General Piell fell in battle. Tarkin was visibly dismayed to learn that prior to the general's death, Piell shared his half of the intel with Tano. When the group made it to their destination, they found their position assaulted by the Separatists led by the Citadel's sadistic caretaker Osi Sobeck. As the Jedi and clones held their ground, Sobeck was momentarily disarmed and at the mercy of Tarkin. Seizing the opportunity, Tarkin confidently approached Sobeck and attempted to execute him, but failed as Sobeck swiftly retaliated and nearly killed Tarkin. However, Tarkin was rescued just in time by Tano, who used her lightsaber to stab Sobeck in the back. At that moment, the Jedi rescue team arrived and was able to shuttle the group off of the planet and back to the safety of Coruscant."}, {"tag": "p", "text": "After arriving at the Jedi Temple, Tarkin and the group were welcomed back by Jedi Masters Yoda and Mace Windu. But when Yoda moved to debrief Tarkin and Tano on the information regarding the Nexus Route, Tarkin insisted that his orders strictly forbade him from sharing the information with anyone other than Chancellor Palpatine. Likewise, Tano promised Piell that she would only share her half of the information with the Jedi Council, thus creating an obvious stalemate. Yoda assured everyone that he would speak with the Chancellor in order to reach a reasonable compromise. Before departing to report to the Chancellor, Tarkin congratulated Skywalker and the two shook hands, thus solidifying their new-found friendship. Aside from voicing his wish that more Jedi were like Skywalker, he suggested that he would inform the Chancellor of Skywalker's valor on Lola Sayu. As Tarkin disembarked to give his report to the Chancellor at the Republic Executive Building, Kenobi confessed his disapproval of the new friendship between his former Padawan and Tarkin. Skywalker remained resolute in his defense of the Republic captain, however, and believed that Tarkin's hardline stance was exactly what the Republic needed, especially in a time of crisis when the Separatists threatened to split the galaxy in half."}, {"tag": "h3", "text": "New allies and enemies"}, {"tag": "p", "text": "Later in the war, Tarkin was promoted to Admiral and was present at the Republic strategy conference held in the Carida system on the space station Valor. At the conference a Venator-class Star Destroyer that had been hijacked and loaded with explosive rhydonium by the Separatists approached the station, and Tarkin attempted to contact the ship, but received no reply. He then scanned the ship and discovered it was loaded with the explosives. However, the Star Destroyer was destroyed by the astromech droid R2-D2, saving the Republic personnel at the conference. Nonetheless, after being debriefed on the event, later known as the Carida Incident, Tarkin, deeply disturbed at the event (which occurred during a military plan by the Jedi Order without apparent Military authorization to retrieve a Separatist decryption module, and utilized some droids and an inexperienced tactical commander) and the very narrow aversion of a disaster, wrote a memorandum requesting for gradually phasing the Jedi out of military command of the Clone Wars if the Galactic Republic were going to win it, as he feared that as long as the Jedi Order stayed in command of the Grand Army of the Republic, the Republic would continue to suffer defeats at the hands of the Separatists and eventually lose the war."}, {"tag": "p", "text": "Admiral Tarkin attended the funeral for the victims of the Bombing of the Jedi Temple Hangar. Afterwards, he informed Ahsoka Tano and Anakin Skywalker that the accused perpetrator of the bombing, Letta Turmond, was being transferred from the Jedi Temple to military custody. Tano protested this method of handling the situation, but Tarkin explained that because Turmond was not a Jedi and clones had been killed in the bombing, the Republic military had jurisdiction. Skywalker scolded Tano for becoming angry, and after Tano had left, he lamented to Tarkin that his Padawan still had much to learn."}, {"tag": "p", "text": "Later, Tarkin informed Tano that Turmond wished to speak with her and Tano consented. While Tano was with Turmond in her cell, Turmond was strangled with the Force, and Tano was arrested because it was assumed that she was Turmond's killer. Tarkin visited Tano in her cell and showed her the recording of the incident, which, without sound, made it seem as though Tano was reaching toward the floating Turmond to choke her, rather than help her. Tarkin ordered that no one be able to visit Tano, much to Skywalker's dismay, but Tano was soon able to escape from the military base where she was being held."}, {"tag": "p", "text": "Ahsoka Tano was soon recaptured, and Tarkin came before the Jedi Council on behalf of the Senate to request that Tano be expelled from the Jedi Order so that she could be tried by a military tribunal. It was feared that a trial by the Jedi would seem biased. The Jedi Council obliged, and Tano was tried before a jury of senators, with Tarkin heading the prosecution and Padmé Amidala heading the defense. Tarkin declared that he would prove Tano guilty of both the Temple bombing and the murder of her cohorts, and asked that the death penalty be used as punishment. Amidala argued that Tano was being framed, because if Tano was truly guilty, she would not have made the evidence against herself so obvious. Tarkin cast doubt on Tano's claims by mentioning that Tano had been seen with the Separatist war criminal Asajj Ventress."}, {"tag": "p", "text": "Eventually, the arguments concluded, and the jury reached a decision. As Supreme Chancellor Palpatine started to read the verdict, Anakin Skywalker and members of the Jedi Temple Guard arrived in the courtroom with the Jedi Barriss Offee. Offee confessed to having committed the crimes of which Tano was accused, and the charges against Tano were dropped, though as a result of feeling betrayed and disillusioned, Tano refused to return to the Jedi."}, {"tag": "h3", "text": "Gaining authority"}, {"tag": "p", "text": "During the course of the Clone Wars, Tarkin discovered the world of Omwat. He recognized the native Omwati; an enclave of the species existed on Coruscant, but their homeworld had lost contact with the galaxy since that colony had been established. Tarkin had been impressed with the mental ability of the Coruscanti Omwati, and decided that Omwat could prove a useful resource. He kept its location secret, hoping to have a future opportunity to exploit the intellect of the species."}, {"tag": "p", "text": "In the closing months of the Clone Wars, Palpatine implemented the Sector Governance Decree, which placed regional and planetary military governors in control of the Republic's systems. Admiral Tarkin, who had risen rapidly to prominence in Palpatine's government, was the first man appointed as a regional governor and given the ancient title of Moff. Tarkin was among twenty elite Moffs given control of a Sector Army, one of the major divisions of the Grand Army of the Republic, and a military territory, the Greater Seswenna, corresponding to the Sector Army's area of operations. These oversized territories, crossing normal sector boundaries, were referred to as oversectors. Tarkin's appointment drew attention, and he was profiled in a HoloNet News feature on the new system of Moffs. Commanding a mixed force of clone troopers and the Outland Regions Security Force in the Eighteenth Army to defend the besieged salient around Eriadu, the actions of Tarkin and his army were feted in Republic propaganda."}, {"tag": "p", "text": "When the Outer Rim Sieges began and the Separatists were forced on to the defensive, Tarkin's Greater Seswenna territory fell under the Praesitlyn theatre. Deployed from Eriadu, Tarkin and his troops broke out from the salient and besieged the Separatists worlds of Triton, Sluis Van and Xagobah. During the Battle of Xagobah, Anakin Skywalker—by then a leading Jedi Knight whom Tarkin found to be a trustworthy ally—captured bounty hunter Boba Fett. Fett insisted that he had information vital to the Republic's war effort, and demanded to see Chancellor Palpatine. Skywalker, not trusting Fett, sent him to Coruscant with instructions to turn himself over to the custody of Tarkin, whom Skywalker trusted to handle the matter. Tarkin traveled to the galactic capital and met Fett at the Jedi Temple. Tarkin left Fett in visitors' quarters while he attended to business with members of the Senate, but Fett sneaked out and attempted to kill Jedi Master Mace Windu, who had killed Fett's father Jango Fett. Palpatine covered up the incident after buying Fett's silence regarding the information the bounty hunter carried, which could have exposed Palpatine's secret scheme to orchestrate the Clone Wars to his own ends."}, {"tag": "h3", "text": "Imperial potentate"}, {"tag": "p", "text": "In 19 BBY, the Clone Wars ended with the defeat of the Separatists. Palpatine declared the Jedi enemies of the Republic, accusing them of treason, and initiated a purge of the Order. He also issued the Declaration of a New Order, converting the Republic into the Galactic Empire, with himself as emperor. The plans for Sienar's battle station, developed with a superlaser capable of destroying planets, were put into effect with the long-delayed construction of what became known as the Death Star—though Tarkin himself did not care for the name, regarding it as overly melodramatic. Tarkin, having thought the project dead, was shocked to learn that Palpatine had secretly followed through on the plans Tarkin had presented him a decade before, even beginning construction over Republic-occupied Geonosis without Tarkin's knowledge, and was frustrated that he had been left out of the development process."}, {"tag": "p", "text": "Tarkin, who as Moff had been granted a special purview over the development of military technology, was entrusted with control over aspects of construction of the Death Star—and he hoped to gain total oversight of the project. Palpatine and his new Sith apprentice, Darth Vader, visited Tarkin early on to observe the construction of the Death Star. The Death Star's construction soon fell behind schedule, plagued by labor shortages, supply problems, failures on the part of contractors, and engineering dilemmas. The superlaser, the major technological innovation of the project, was not fully worked out, and the Hammertong Project continued research on the design. Repeated attempts at sabotage set back the problem, and intelligence leaks caused Tarkin to move the station's location completely, with Seswenna and Patriim among the early locations, delaying the massive project's progress."}, {"tag": "p", "text": "Palpatine soon arranged for Tarkin to meet with Vader to coordinate a response to the arrival of several fugitive Jedi, whom Tarkin had been monitoring, on Kashyyyk. Tarkin proposed that, rather than simply hunting down the Jedi, Vader implement a larger plan to invade Kashyyyk on the justification that it was harboring Jedi and enslave many native Wookiees for use as labor on the Death Star project. Tarkin hoped that the use of the strong and technologically skilled Wookiees would allow the project to return to pace. Vader did so, and Tarkin covertly moved the new slaves to the construction site. He reported on his cooperation with Vader to Palpatine, explaining that Imperial officers were unsure of the mysterious cyborg. Tarkin, however, was pleased with Vader, and asked permission to continue partnering with the Sith Lord. Tarkin was one of few Imperial officers to see potential in cooperating with Vader, and worked closely with the Dark Lord of the Sith in the course of his career. Over time, Tarkin investigated Vader's origins, and found that the powerful Jedi Knight Anakin Skywalker had been reported dead on Mustafar, with no body produced, around the same time that Vader emerged in his life-support suit. Though he was not certain, Tarkin thought it likely that the two were one."}, {"tag": "p", "text": "As the Empire established itself, Tarkin was a driving intellectual force behind the new regime, second only to Palpatine in giving shape and vision to the Galactic Empire. He offered scholarly arguments that supported the philosophies Palpatine articulated in rousing speeches, and early in the Empire's day, Tarkin authored the key work Visions of the New Order, which quickly became a foundational text for the Commission for the Preservation of the New Order and its agencies. Tarkin was also a key Imperial military leader, known for the brutal tactics he used to gain his victories. Moff Tarkin was among the highest-ranking personnel within the Empire, enjoying a rare exemption from security checks. Within a month after the war's end, Tarkin was granted the first of the powerful new Imperator-class Star Destroyers, Executrix, as his flagship."}, {"tag": "p", "text": "During his tenure as Moff, Admiral Garoche Tarkin, an officer under Tarkin's charge and his son, went missing, believed to have vanished during a mission in the Atoan system. Seeking the Emperor's aid, Tarkin was appointed Vader for assistance, which he met with distaste, believing Vader's priorities to be petty and insufficient for the Empire's needs. Nonetheless, Tarkin followed the Emperor's command, and, as insurance, sent Captain Shale with Vader to ensure the mission's success. As the mission came to a head, Shale gave a grim reminder to Vader that, if it ended in failure, Vader's command would come to an end at Tarkin's hands. The mission's success was vital to the Emperor as well; though he saw Garoche Tarkin as easily replaceable, he valued Tarkin's skills, and had no desire to allow the Moff to be distracted. However, Vader suggested that the death of his son could render Moff Tarkin more powerful; fueled by revenge, Tarkin could become a machine of destruction against the Atoan insurgents. Pondering Vader's plan, the Emperor approved, and ordered him to carry on. The mission to the Atoan system was turned around when Shale betrayed Vader, realizing the Sith Lord's intent to murder Tarkin's son. Garoche himself was in fact disillusioned with his father's will, realizing that he had killed innocents in his name. Garoche, Shale, and the remnants of the insurgency were themselves killed when Vader caused a cave-in on top of them; Garoche's death enraged Tarkin, causing him to grow thirsty for revenge and, in the Emperor's eyes, rendering him much more powerful, just as the Sith Lords had conspired."}, {"tag": "p", "text": "During his tenure as Moff, Tarkin came across a report that a probe had found an isolated stable pocket within the Maw black hole cluster. Suspecting that a secret safe spot within the notoriously dangerous cluster would prove a valuable asset, Tarkin erased the report before the data was passed beyond his desk. He then sent a surveying team that found other routes into the zone and confirmed that a base could be safely built within, then had the team killed to keep the area secret. Tarkin began considering uses for the location, but did not come up with any immediately. He made another acquisition when, at a fueling station on Ryloth which Tarkin was in the process of expanding into a major refueling depot for the Imperial Navy, he met Tol Sivron, an outcast former Twi'lek Clan Council member. Tarkin took Sivron into his service and found the Twi'lek a competent manager."}, {"tag": "p", "text": "Early in Tarkin's Imperial career, high taxes on Ghorman prompted a sit-in protest at the spaceport. Tarkin, sent to collect the taxes from the defiant population, refused to yield, and landed his ship atop the peaceful protesters. Dozens were killed and hundreds injured in Tarkin's display of the consequences for defying the Imperial government. Despite public outrage at the Ghorman Massacre—which convinced Senator Bail Organa to join Senator Mon Mothma in covertly plotting rebellion against the Empire—Palpatine declined to issue Tarkin any punishment; instead, he was soon promoted."}, {"tag": "p", "text": "Months after the Empire was declared, Tarkin met with Palpatine and Ferus Olin, a former Jedi Padawan and anti-Imperial resistance fighter to whom Palpatine had offered amnesty if he would meet with the Emperor. Tarkin explained to Olin that the data systems of Samaria had become corrupted and were disrupting services and identification systems. Palpatine requested that Olin, a computer expert, resolve the problem. After Palpatine threatened to have his partner, Roan Lands, executed, Olin accepted the task, the first step of Palpatine's plan to corrupt Olin."}, {"tag": "p", "text": "Having joined the Empire, Olin became a propaganda figure on his adopted homeworld of Bellassa, where Tarkin and Vader initiated the Bellassan Project. They gathered a group of scientists—uncooperatives ones were forced to participate by the kidnapping of their families—to work on engineering problems related to the Death Star project, and hoped to use Bellassa's factories to manufacture components."}, {"tag": "h3", "text": "Grand Moff Tarkin"}, {"tag": "p", "text": "In an 18 BBY personal communique to the Emperor, Tarkin proposed means to ensure Imperial security as a culmination of military and political theories he had long been developing. Frustrated by cross-sector criminal and rebellious activity and the problem of jurisdictional conflicts, he called for the retooling of the oversector concept, proposing that oversectors be tailored to control unstable galactic hotspots and be assigned greater forces than usual in an attempt to root out rebellious activity before it could take hold. Each oversector, capable of crossing sector boundaries, would be controlled by a single official who answered directly to Palpatine. The installation of HoloNet transceivers aboard all flagships within an oversector would provide enhanced communication. The philosophy of power with which Tarkin suggested unrest be fought was that of rule through fear of force, rather than direct exercise of force. Displays of power, most vitally through the use of terror-inspiring superweapons, would, Tarkin suggested, stifle dissent and rebellion. The presentation of a seemingly invincible weapon of ultimate power would play upon the fearfulness and awe of the citizenry to render all thought of assault against the Empire forgotten. It was therefore Tarkin's recommendation that the Empire invest strongly and continually in the innovation of ever more powerful weapons of warfare. According to this philosophy, once the Death Star was active, no one would dare act against the Empire. Terror at the prospect of planetary annihilation would ensure compliance and order. Palpatine chose to officially recognize Tarkin's proposal, which became known as the Tarkin Doctrine, and Tarkin's theory became a central tenet of Imperial policy."}, {"tag": "p", "text": "The Tarkin Doctrine so pleased Palpatine that he immediately had his close aide, Imperial Advisor Ars Dangor issue a response in his name conveying the Emperor's embrace of the Tarkin Doctrine and promotion of Tarkin to the rank of Grand Moff, the position created for the officials in charge of oversectors. Tarkin was the first man promoted to the new title. He answered only to Palpatine and was given authority over Oversector Outer, an expanded version of the Greater Seswenna sector that covered nearly the entire Outer Rim and some of the Mid Rim—the largest territory of any Imperial governor—and total control of the Death Star project. Pacifying the unruly Outer Rim Territories was considered among the most difficult assignments available in the Empire, but Tarkin was determined to tame the entire galaxy."}, {"tag": "p", "text": "Tarkin, looking to advance his position, sought out a wife. He married Thalassa Motti, of the influential Motti family of Phelarion, for her contacts and money. Tarkin had no love for his wife, who remained on Phelarion overseeing her family's megonite moss mines, but the Lady Tarkin was devoted to him. At one point, a re-emergent Nebula Front faction on Eriadu kidnapped Shella Motti, Tarkin's niece by marriage. Furious, Tarkin hired a group to rescue her. The situation was complicated when Motti refused to return, even hiring a bounty hunter of her own to counter Tarkin's agents."}, {"tag": "p", "text": "Around the time of his marriage, Tarkin learned of a promising tactician, whose advances had revolutionized Imperial doctrines, performing exceptionally under a pseudonym on the Caridan Imperial networks. Tarkin began investigating, spending months and requiring the services of two underground slicers to uncover the mystery tactician's identity. He discovered that this seeming genius was in fact Natasi Daala, a Carida graduate serving as a kitchen corporal. He journeyed to Carida to meet her, and found that Daala was sure she had been shunted aside because of her sex. Seeing in her a potentially great officer, and concerned that the Caridan administration intended to transfer her to meteorological station to further hide their embarrassment at overlooking her talent, rather than promote her, Tarkin assigned her to his personal staff."}, {"tag": "p", "text": "Smitten with Daala, he began an affair, finding with her the passion that his marriage to Thalassa Tarkin lacked. In addition to being Tarkin's mistress, Daala was also his protégée; he tutored her in tactics and strategy and guided her ascent through the ranks. Tarkin's relationship with Daala led to some rumors among subordinates that she had only obtained her rank by sleeping with the Grand Moff. Enraged when he overhead one young officer mutter a complaint to that effect, Tarkin had the lieutenant ejected in a spacesuit with a day's supply of air and piped his open comm over the intercom of his flagship so the entire crew were forced to listen as he raged, pleaded, and died. After that incident, Tarkin heard no further whispering."}, {"tag": "p", "text": "Though he spent little time on Coruscant, Grand Moff Tarkin was a major figure in the Imperial Court. He was recognized as the definitive voice on policy and philosophy, second only to Palpatine. At court, Tarkin had powerful allies, such as Darth Vader, Imperial Ruling Council member Janus Greejatus, and Imperial Advisor Lord Rodin Hlian Verpalion, a close friend of Tarkin who admired the Grand Moff. In addition, Tarkin cultivated a cadre of ambitious subordinates, supporters, and clients, such as Baron Merillion Tarko, whom Tarkin had promoted to the rank of Moff; Moff Ariss Lyjan of the Nuiri sector; distant relative Admiral Sander Delvardus, who commanded the Seswenna sector's fleet; and Commodore Lord Tion."}, {"tag": "p", "text": "As one of the Empire's most powerful men, Tarkin was involved in a great deal of intrigue. To hide his secrets from political rivals, Tarkin routed many of his more sensitive matters through the Ubiqtorate base on Yaga Minor, over which he exercised a great deal of control. He implemented two access stations on an extended walkway to keep civilian researchers out of the rest of the base, keeping his own business more secure. To further protect himself, the Grand Moff kept spies within the commands of officers he mistrusted. It was not only his secrets Tarkin had to safeguard, but the Emperor's as well; Tarkin was among only a handful of high-ranking figures familiar with Palpatine's secret agents, the Emperor's Hands."}, {"tag": "p", "text": "In 6 BBY, Tarkin was part of the graduation ceremony at the Academy of Carida, in which he congratulated valedictorian Han Solo and salutatorian Soontir Fel. Fel's response—that the honor of his class rank paled in comparison with the honor of serving the Empire—impressed Tarkin, and the Grand Moff made a point to watch Fel's career. In the same year, Tarkin paid a visit to Viceroy Bail Prestor Organa of Alderaan, a man suspected of disloyalty to the Emperor, where he found himself struck by a water balloon dropped by Organa's daughter, Princess Leia Organa."}, {"tag": "p", "text": "Tarkin's exploits were not all political; he carried out the Atravis Sector Massacres, and in 5 BBY, Tarkin commanded the subjugation of defiant Mon Calamari. The prominent Mon Calamari leader Gial Ackbar was enslaved and entered into the service of Tarkin's subordinate naval officer commanding the conquest. To please Tarkin, however, the officer gave Ackbar to the Grand Moff as a servant. Ackbar served as a personal aide and as a chauffeur, piloting Tarkin's shuttles. Tarkin came to have a vague fondness for the reliable servant, considering him like a pet. He would often hold forth on his tactics to Ackbar in self-satisfaction, gloating about his plans to subjugate yet more worlds."}, {"tag": "p", "text": "When, in 5 BBY, Gideon Tarkin died in the Erhynradd Mutiny, Wilhuff Tarkin took Gideon's daughter, Rivoche, into his home. As a girl in her early teens, with her family dead, Rivoche expressed her grief in frequent tantrums. Never a warm family man at the best of times, Tarkin disciplined his niece by sending a friendly serving girl and her family to a penal asteroid. Rivoche quickly learned to behave for her uncle, who soon sent her to an elite preparatory academy on Clær, where she learned to fill her role as an elite socialite."}, {"tag": "h3", "text": "Building the Death Star"}, {"tag": "p", "text": "Construction of the Death Star, meanwhile, had been delayed interminably by sabotage, accidents, political maneuvering, administrative roadblocks, disputes with unions, and, importantly, problems with the plans. After several years, critics began to doubt the central concept the station, the superlaser, believing it would not function. Tarkin privately worried that they might be correct. In any case, it was clear that the Death Star plans contained numerous flaws."}, {"tag": "p", "text": "Tarkin decided that the best remedy would be to create a prototype as a proof of concept. In 3 BBY, Tarkin created the Maw Installation to solve the problems in the design, complete the Hammertong Project's work by proving the superlaser, create a model Death Star, and engineer yet more superweapons. The Grand Moff had several asteroids moved into the hidden stable zone he had found within the Maw and built a hidden scientific facility into the interlinked asteroids; the workers were then killed to keep the think tank secret. He brought together a wealth of elite engineers, including head designer Bevel Lemelisk, Ohran Keldor, and Umak Leth to contribute to the design, all of whom he personally vetted. Necessary scientists who did not volunteer were kidnapped. Tarkin appointed Tol Sivron the director of the facility, having been impressed with the alien's managerial skills, and hired the Devaronian lawyer and administrator Yemm, whom he had met and found suitable at an Eriadu function, for an administrative position. Tarkin altered the records of military personnel assigned to the base to list them as dead, keeping their presence secret."}, {"tag": "p", "text": "In order to maintain strict secrecy and to hide his mistress, he assigned Daala to guard the facility, with orders to remain at her post and capture or destroy any stray ships that came across the well-hidden facility. He promoted her to admiral and presented her with four Imperial-class Star Destroyers as her fleet, personally taking her in a shuttle to observe them while under construction and impart to her the magnitude of power he was granting her. Communication with the station was only possible through a communications circuit Tarkin controlled; the Emperor was the only other being to know of the Maw Installation's existence."}, {"tag": "p", "text": "Finally in a position to exploit the Omwati, he forced the planet's children to take an abilities test and collected hundreds of the highest-scoring children. The primary program took ten ten-year-old children from Omwat and forced them through an advanced education program, for which Tarkin recruited noted experts Nasdra Magrody and Ohran Keldor as professors, hoping to form genius engineers. The children labored for two years in an orbital education sphere over Omwat; those that suffered breakdowns from the tremendous pressure and pace of the accelerated program, or simply failed an examination, watched as their home cities were destroyed by orbital bombardment. Qwi Xux was the only one to make it through the process, and Tarkin placed her at the Maw Installation under Lemelisk."}, {"tag": "p", "text": "Tarkin quite enjoyed Lemelisk's enthusiasm for the project, and was greatly pleased with his technological innovations. Tarkin demanded that Lemelisk's team integrate heavy defenses, comparable to those of a Core planet, into the design, and also that they ensure the station would be self-sufficient. Tarkin was disappointed that Lemelisk was not able to include much shielding in the design, but his demands were otherwise met. The engineers produced an amended set of plans that solved the problems detected in the earlier specifications, and Tarkin and Lemelisk presented the revised designs to Palpatine, who was elated that the Death Star's potential was soon to be reached and approved construction of a prototype. The design team was able to build the desired Death Star prototype as a proof of the superlaser concept, and used it to further refine the design into a form ready for renewed construction efforts. Tarkin was delighted by the functional prototype, issuing Lemelisk, Xux, and Sivron medals immediately upon seeing their work."}, {"tag": "p", "text": "After nearly two decades, the Death Star was little more than an incomplete framework. With the prototype having worked out most problems with the design, Tarkin restarted work on the Death Star with new energy. He removed Lemelisk from the Maw Installation, bringing him to oversee construction in the field. Tarkin charged the remaining scientists to create yet more powerful and devastating superweapons, such as the World Devastator and Sun Crusher projects, and insisted that they be ready within nine years. After moving the Death Star from site to site in attempts to avoid sabotage by rebels against the Empire, the station's framework was finally emplaced over the Empire's most secure prison planet, Despayre, in the Horuz system. The planet's convicts were conscripted into the labor force—harshly overseen by Major Calders to Tarkin's great approval—and Tarkin assembled the largest force of construction droids in history to work toward the massive station's completion. The Horuz system was heavily exploited for its natural resources, and fabrication systems and laboratories were erected in orbit to forge building materials and produce technical components. The entire project was carried out in strict secrecy, with a strong security detail in the system and a shield generator on Despayre that projected a protective field over the Death Star's frame. An entire branch of the Imperial Navy, Battle Station Operations, was created to man the station. Tarkin had a corps of elite soldiers created for station security, who received advanced training and were trained for intense loyalty."}, {"tag": "p", "text": "Tarkin relied upon three major aides and advisors in constructing and running the station: Admiral Conan Antonio Motti, General Cassio Tagge, and General Moradmin Bast. Motti, a relative of Tarkin's wife, was his chief aide, and commanded the forces guarding the project; Tarkin believed him an overrated officer. He had far more respect for the abilities of Tagge, the other of his two joint seconds in command, who was charged with operational security and was to be responsible for the day-to-day running of the station itself once the Death Star was operational. Tagge's conservative belief that the Imperial Senate was necessary for the smooth running of the Empire diminished Tarkin's regard for him, however, and Tagge in turn thought little of Tarkin. Motti and Tagge's constant feuding over military doctrine and political position frustrated Tarkin, who wanted the station to run smoothly. Bast was Tarkin's primary personal aide. Other officers were vital to Tarkin's ability to run the station as well, such as Colonel Wullf Yularen, the Imperial Security Bureau officer responsible for briefing the Grand Moff."}, {"tag": "p", "text": "When Lemelisk expressed dissatisfaction with the work of untrained Despayre inmates, whose shoddy work was leading to mistakes and delaying construction, Tarkin responded by executing the current workforce and bringing in strong and technically proficient Wookiee slaves. In 3 BBY, Tarkin presided over another invasion of Kashyyyk, leading his forces onto the planet personally and demanding that Wookiee leaders provide workers. When they refused, Tarkin's forces fired on the planet, rounded up Wookiees, and executed any who resisted. Tarkin kept some hostages in camps on Kashyyyk, using them to threaten the construction workers into compliance, along with drugs and negative-stimulation transmitters."}, {"tag": "p", "text": "Due to further delays, Darth Vader visited the under-construction Death Star for the first time, met by Tarkin and Lemelisk. Lemelisk, to Tarkin's annoyance, complained to Vader of obstruction by the Wookiee slaves, Vader reviewed the records of construction foremen and had Tarkin call a meeting of crew supervisors. In front of the others, Vader executed the two least efficient foremen and had their bodies mounted on the Death Star's framework. Tarkin was pleased to see that future construction work sped up."}, {"tag": "p", "text": "Tarkin, meanwhile, heard rumors that the rebellious movements against the Emperor were beginning to coordinate, and saw signs of the emergence of a unified rebel government. When the Alliance to Restore the Republic was formed in 2 BBY, Tarkin was confident that the Empire, with its Death Star, would easily defeat this Rebel Alliance. Seeing them as a similar threat to the Separatists of the Clone Wars, Tarkin believed that destruction of Rebel bases and cowing of those who held Rebel sympathies would be sufficient to destroy their cause, and dismissed worries that the Rebel Alliance posed a significant threat to the Empire's military, especially with the Death Star on its way to completion. Rebel leader Mon Mothma, in recruiting for the Rebellion, used Tarkin's own words in speeches against the Empire, denouncing the doctrine of rule by fear. Tarkin himself came under direct Rebel attack at one point in 1 BBY. His shuttle, Illirium, was scheduled to rendezvous with the Imperial-class Star Destroyer Allecto, but came out of hyperspace to find Rebel fighters attacking Allecto. The Rebels turned their attention to Tarkin's shuttle, which was safely escorted to the Star Destroyer by TIEs that eliminated the Rebel attackers."}, {"tag": "p", "text": "When at another point Palpatine became disappointed with delays on the Death Star, he sent Vader to convey his displeasure to Tarkin, who was at the moment supervising the Horuz system efforts from his flagship, Havelon. While Vader was in transit, Tarkin had to deal with a case of sabotage that had destroyed an oxygen tanker and damaged a major dock. Once Vader arrived, Tarkin gave the Dark Lord of the Sith a brief tour of the construction efforts, then had him interrogate the suspects in the sabotage, as Tarkin had yet to receive interrogation droids at the assembly site. Once Vader was confident that he had suppressed the sabotage activity, content that the construction was proceeding apace, he departed the system, leaving Tarkin without the annoyance of having the Emperor's watchdog present."}, {"tag": "p", "text": "When resources and labor for the Death Star proved insufficient, Palpatine gave Tarkin permission to divert Vader from the Sith Lord's mission at the time—investigating a traitor within the Imperial hierarchy—in order to lead the conquest of Geonosis. Once it became clear that the Geonosians had allied themselves with the Rebel Alliance, Tarkin instructed Vader to inflict punitive damage on the local population as a lesson in the consequences of rebellion. Once the planet was under Imperial control, Tarkin was able to extract the needed slaves and materials."}, {"tag": "p", "text": "Tarkin then received reports that ex-Imperial officer Han Solo—whose graduation as valedictorian Tarkin had attended—began raiding Imperial prisons on Kashyyyk to free Wookiees, with assistance from the Rebellion. Tarkin and Vader marshaled a response that drove Solo off the planet and saved the prisons. With Wookiee and Geonosian labor, Tarkin found himself ahead of schedule on the Death Star."}, {"tag": "p", "text": "Palpatine compelled both Tarkin and Vader to attend Colonel Maximilian Veers's demonstration of the All Terrain Armored Transport on Carida. Tarkin was dismissive of the weapon of war, insisting that the Death Star would supersede ground assaults, even after witnessing Veers's lone walker fend off a surprise Rebel raid on the demonstration. Palpatine, however, remained highly enthusiastic about the walker. Tarkin oversaw a retaliatory attack in response to the disruption, destroying the Rebel base on Jabiim from which the raid had been launched. The base's data archives finally revealed the identity of the Imperial official who had been collaborating with the Rebellion and had facilitated their operations at Kashyyyk and Carida: Moff Kalast. Despite evidence that Kalast may have provided the Rebellion with information about the Death Star, Tarkin was unconcerned, as he believed that the Rebels had no hope of defeating the battle station. A fleet under Tarkin attempted to arrest Kalast over Atzerri, but Kalast fled before he could be apprehended. Tarkin was able to procure an Immobilizer 418 interdictor, which allowed Vader to pin down Kalast and successfully capture the traitor."}, {"tag": "p", "text": "As the Death Star was building, Rivoche Tarkin held her debutante cotillion. She had begun to question her uncle's beliefs, and after the cotillion, she began spying for Alliance Intelligence, passing on secrets from Grand Moff Tarkin's household to Alliance Intelligence chief Airen Cracken, unsuspected by Tarkin—though, still loyal to her family, she refused to endanger Tarkin personally. Luckily for Tarkin, he had not shared the Death Star's existence with his niece, who spent her time socializing with her many suitors, all Imperials of high rank."}, {"tag": "p", "text": "That year, Tarkin delivered the commencement address for the graduating class of Prefsbelt Fleet Camp, in which he declaimed the need to sweep away the Rebel Alliance and compel order through the exercise of raw power. He also hinted at the existence of the Death Star, to be revealed once it became operational shortly. After the ceremony, Tarkin mingled with other officers at a reception and spoke with Captain Soontir Fel. Fel, who had attracted Tarkin's eye at his own graduation, had had an excellent career as a pilot and had now become a training officer at Prefsbelt IV. His cadet squadron had performed excellently, and Tarkin extended Fel an invitation to join his personal bodyguard squadron, an elite posting. When two of Fel's most promising students, Biggs Darklighter and Derek Klivian, led a mutiny and defected to the Rebel Alliance shortly into their first posting, though, Fel was disgraced, and Tarkin withdrew his offer."}, {"tag": "p", "text": "As Tarkin grew increasingly desirous of Daala's comforting presence at the construction site, where he was overseeing operations, he made a snap decision to summon his mistress, deciding that the Maw Installation would be safe enough without her presence. While she was present, the danger of sabotage reemerged when the Star Destroyer Undauntable suddenly exploded. Tarkin, wanting to avoid more scrutiny from Palpatine and a visit from Vader, had Motti report the incident as an accident resulting from poor maintenance of the old ship. Meanwhile, he assigned Daala to investigate the matter and unmask the saboteur herself. She was able to determine that the bomb used had been shipped through the high-security Regional Naval Supply Area at Gall and been manually triggered by a saboteur, showing a wider conspiracy with dangerous resources. Despite further investigation, though, she was unable to find the culprit, and Tarkin could keep her away from the Maw Installation no longer, so she returned."}, {"tag": "p", "text": "While the Death Star was under construction, Tarkin continued to think of yet more ways to battle the Rebellion. He looked into interdiction technology, and working with Frap Radicon, who had helped engineer the Death Star, was able to create an advanced gravity well projector that he believed could revolutionize the war against the Rebellion. Tarkin made plans to experiment with the technology on Delrakkin, a relatively remote world, intending to stage a Rebel attack on Delrakkin, which had begun to produce bacta for the Rebellion, in order to discredit the Rebellion as having attempted to take over Delrakkin's bacta industry. The survivors would then be given contaminated Imperial bacta, which would introduce a virus to eliminate the population and clear Delrakkin for experiments in Tarkin's new interdiction technology."}, {"tag": "h3", "text": "Destroyer of worlds"}, {"tag": "p", "text": "Tarkin himself could not spend all his time supervising the construction, and returned to Eriadu. When the Death Star was nearly operational, he set out for the Death Star to take command. He and Lemelisk, in a shuttle piloted by Ackbar, were ambushed by Rebel Y-wings as they left Eriadu. Ackbar shut down the shields and allowed the Y-wings to attack, telling Tarkin that this was his final revenge. Tarkin and Lemelisk ejected in an escape pod and were recovered by Motti's Star Destroyer, which arrived unexpectedly in an unsolicited effort to escort Tarkin. The Rebels recovered Ackbar, causing Tarkin to mourn the loss of the previously reliable servant."}, {"tag": "p", "text": "Palpatine was scheduled to arrive aboard the station for its commissioning, but decided not to travel; he would send Vader as his representative to Tarkin. Knowing that Tarkin's ambition could prove dangerous, Palpatine intended that Vader would keep watch over him. In fact, though Tarkin was well aware of the potential power he stood to wield as commander of the planet-destroying station and dreamed of using it to rule, he was certain that Palpatine understood the threat and had measures in place to prevent any move against his position as Emperor. Considering the attempted overthrow of Palpatine suicidal, Tarkin had no thought of rebellion, even when several ambitious Imperials, including Motti and Imperial Advisor Greejatus, frequently attempted to subtly suggest that Tarkin use the station to seize power."}, {"tag": "p", "text": "When the Grand Moff learned that the Imperial base on Danuta had been penetrated by Rebel agents and there was a possibility that the plans for the Death Star had been stolen, he contacted Vader, who had not yet arrived on the station, and asked the Emperor's agent to determine if the plans had been stolen and, if so, recover them. Tarkin then learned that a full set of blueprints had been stolen and conveyed to the Toprawa Relay Station. He thought there little risk that the Rebels might be able to use the plans to destroy the Death Star, believing that they would only prove the station's invincibility. He could not, however, abide the thieves' penetration of security and defiance of the Empire."}, {"tag": "p", "text": "Soon after, the Lucrehulk-class carrier Fortressa arrived in the Horuz system and deployed five hundred fighters. Tarkin commanded the defense of the station, and was surprised to receive a transmission from Daala indicating that she was returning to the station and had come under attack. Seeing an opportunity to put the superlaser to work, the Grand Moff contacted Superlaser Fire Control and issued the order to target the Fortressa. The firing was a success, vaporizing the large enemy ship using only four percent of the superlaser's total power."}, {"tag": "p", "text": "While TIEs mopped up the enemy fighters, Tarkin received the news that Daala had suffered a head wound during the attack on her ship. He had Daala rushed to surgery and, concerned that the Rebels clearly knew the location of the station, had the Death Star moved. As it was unready for a sustained hyperspace jump, he ordered the station piloted to the other side of Despayre, its coordinates kept tightly restricted among the command staff of the Death Star and its Star Destroyer escorts. He then checked on Daala, learning from the surgical team that she had suffered brain damage that would likely cause some memory loss, but had come to no other harm. As Daala was supposed to be at the Maw, Tarkin did not want her presence at the Death Star used against him. He had all records of Daala's visit erased and, as soon as she was able, sent her back to the Maw, where she was instructed to maintain that she had never left and had suffered an injury in the course of her duties there."}, {"tag": "p", "text": "With the hull complete and interior construction nearly finished, Tarkin decided to leave the system, but insisted on testing the superlaser's destructive potential first by targeting Despayre. Though Motti questioned the decision, Tarkin believed there would be little political backlash from the obliteration of the prison world, and insisted that the weapon's power be tested before they moved on to military targets. Tarkin evacuated the military forces keeping order on Despayre, then fired. At one-third power, the beam ignited the planet's atmosphere, creating a cataclysm that killed all life on the planet. After more than an hour of recharging for each shot, second and third firings shattered the already ruined world."}, {"tag": "p", "text": "Vader, chasing the stolen blueprints, captured the ship that had received the transmitted plans in the Tatoo system, with Princess Leia Organa, doing her father's rebellious bidding, aboard. The plans, however, had been placed in the droid R2-D2, which had been ejected in an escape pod, and were not recovered. Vader brought Organa back to the Death Star for interrogation, intending that she would reveal the location of the secret Rebel base. Tarkin signed an execution order for the young Senator immediately upon her capture, ready to kill her once her usefulness was over. Vader, on behalf of the Emperor, personally conveyed to Tarkin the news that Palpatine, as Tarkin had long known he would, had abolished the Imperial Senate; the rule of the galaxy would now be fully in the hands of the gubernatorial hierarchy. Tarkin announced the Senate's dissolution as he and Vader entered a meeting of the Death Star's leadership. When Motti insulted Vader's competence in regard to the stolen plans and denigrated the power of the Force, Vader used his abilities to choke the fractious admiral, until Tarkin instructed Vader to relent and moved on to his intent to destroy the Rebellion once the location of its headquarters was extracted from Organa. Tarkin made a swift and brief journey to Coruscant for a meeting with members of the Death Star's design team, but the engineers were captured during the rendezvous, though Tarkin himself remained safe."}, {"tag": "p", "text": "Vader made use of an IT-O Interrogator droid to question Organa, but she refused to yield the location. With the Death Star at last declared operational—and Motti having once more hinted that Tarkin should overthrow the Emperor, a suggestion Tarkin again brushed off—and Palpatine having given Tarkin wide latitude to put the superweapon to use, the Grand Moff decided to compel her cooperation by holding her homeworld hostage, then destroying Alderaan—and with it the problems the peaceful world and its leader, suspected Rebel and hated enemy of Tarkin, Bail Organa, posed the Empire. He directed that the station travel to the Alderaan system, where he had Leia Organa brought to the overbridge. Tarkin offered her a choice: watch as the Death Star destroyed Alderaan, or give him the location of the Rebel headquarters. Organa admitted the location of the base as Dantooine. Considering the undeveloped planet too minor a target, Tarkin proceeded with the destruction of Alderaan nonetheless, believing the Core World a much more significant demonstration of Imperial might and unwillingness to brook rebellion. With one blast, the Death Star annihilated Alderaan, a respected ancient world and a Core Founder of the Galactic Republic, and killed Bail Organa, a key leader of the Rebellion."}, {"tag": "p", "text": "Tarkin dispatched scouts to Dantooine to confirm the base's location, but they found only an abandoned site; Organa had given him only the location of a former base. Outraged at his inability to force her compliance, Tarkin ordered that the Rebel woman be executed immediately. Before that instruction could be carried out, Death Star forces captured a freighter that had ventured into the Alderaan system. The Millennium Falcon, it was the same ship that had shot its way off Tatooine while suspected of carrying the Death Star plans. Vader, believing that the ship's occupants were intending to return the plans to Bail Organa on Alderaan, hatched a plan to allow the occupants to stage a rescue of Leia Organa, then let them escape with a tracking beacon aboard the Millennium Falcon. Vader was certain that they would take Organa to the Rebel stronghold, revealing it for destruction. Tarkin saw the plan as a dangerous gamble, but went along. When Vader realized that former Jedi Council member Obi-Wan Kenobi was among the passengers of the freighter, Tarkin insisted that the Jedi Master could not be allowed to escape. Vader stalked off to meet Kenobi, and as Tarkin watched remotely, killed him in a lightsaber duel just before the Millennium Falcon's crew escaped with Organa."}, {"tag": "p", "text": "The homing beacon's signal led them to Yavin 4, the fourth moon of the gas giant Yavin Prime. Before arriving there, Tarkin deposited on Carida the high-level design personnel who had remained aboard the Death Star to observe Alderaan's destruction and ordered Admiral Termo to take the Star Destroyer Liquidator to Delrakkin for a rendezvous with the Death Star after Yavin 4 was destroyed, intending to put his plan to eliminate the planet's population into place. Concerned with possible delays or difficulty in reporting, Tarkin provided Termo with three holorecordings and instructions to play the recordings at certain times for his orders if the Death Star did not arrive or Tarkin did not contact him in time. The third recording was in fact meant for Palpatine in the event that Tarkin should fail at Yavin, fully disclosing his interdiction advances."}, {"tag": "p", "text": "The Death Star emerged from hyperspace on the far side of Yavin, and began moving into range. As the station closed with Yavin 4, Motti made one last attempt to flatter Tarkin's power and hinted at a coup. Tarkin demanded that Motti speak plainly, and the admiral suggested that Tarkin could at least use the threat of his control of the Death Star to secure a position as second-in-command of the Empire, or share power with the Emperor, and kill Vader. Tarkin rebuffed most of Motti's suggestions, finally stating that he would consider Motti's statements later, though without showing much interest in the proposal."}, {"tag": "p", "text": "In defense, the Rebels launched a force of starfighters. Tarkin, believing the small fighters could pose no threat to his gargantuan battle station, declined to intercept the fighters with TIEs, instead allowing the turbolaser defenses to deal with the fighters. Vader, less confident in the defenses, launched his personal escort of fighters. When the Rebels persisted in their attack, Tarkin wondered what they were targeting, but Motti convinced him that the enemy stood no chance against Vader, who was swiftly eliminating the Rebel squadrons, and that in no case could Tarkin abandon the Death Star and show weakness; it would be political suicide. When Bast informed Tarkin that an analysis had shown a weakness that the starfighters seemed to be targeting, the Grand Moff, still supremely confident in the invulnerability of his battle station, and also unwilling to risk his career if he fled and the Death Star wasn't destroyed in either case, scoffed at Bast's suggestion that he ready an evacuation ship. Vader and his pilots shot down several Rebels, but could not prevent Luke Skywalker from firing a pair of proton torpedoes into a vulnerable thermal exhaust port. Bast's analysis proved correct; as Tarkin's order to fire was being carried out and he was gleefully anticipating his moment of greatest glory—the destruction of the Rebellion by the superweapon he had so long championed—the chain reaction reached the Death Star's reactor and destroyed the battle station, annihilating Tarkin as thoroughly as he had obliterated Alderaan."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "With the Death Star lost, the Empire covered up its existence and suppressed any news of its defeat in the Battle of Yavin. Imperial sources alleged that Alderaan had been accidentally destroyed by a superweapon of its own construction, while Tarkin and his chief officers were announced to have died in a shuttle crash at the Tallaan Imperial Shipyards resulting from an equipment malfunction. Tarkin was lionized in reports as a steadfast, loyal, and important servant of the Emperor. Satellite recordings of Alderaan's destruction, however, were smuggled out of the system by Rebel agents, and underground news sources began broadcasting the truth. The Empire quickly changed its story, announcing that the Death Star had destroyed Alderaan after finding evidence that the planet was developing a Rebel biowarfare initiative. The Empire likewise admitted that there had been no accident at Tallaan, issuing warrants for Han Solo and Chewbacca, the smuggler crew of the Millennium Falcon who had returned at the last minute to cover Skywalker and allow him to destroy the Death Star, on charges of Tarkin's murder. Instead of creating fear, the destruction of Alderaan followed by the failure of Tarkin's battle station embarrassed the Empire, stirred public outrage against the government, convinced galactic citizens that the Empire could be defeated, and inspired hope and enthusiasm among the Rebels, thoroughly backfiring."}, {"tag": "p", "text": "In Tarkin's absence, Termo attempted to carry out Tarkin's task at Delrakkin, but was unsuccessful. Following Tarkin's recorded orders to report to Yavin after the attack if the Death Star still had not appeared, Termo was attacked and defeated by the Rebels. Palpatine recovered Tarkin's third message and attempted to follow through on the project, but Rebel agents destroyed the experimental gravity well projector and killed Radicon, foiling the scheme."}, {"tag": "p", "text": "In the immediate wake of Tarkin's death, his surviving subordinates began to maneuver for power, fighting to inherit his vast authority, while his enemies added to the confusion by attempting to usurp his power. The confusion ended when Tarkin was replaced as Grand Moff of Oversector Outer by Ardus Kaine, a similar New Order hardliner. After the death of Palpatine, Kaine turned Oversector Outer into a warlord fiefdom based on New Order principles, known as the Pentastar Alignment. Admiral Delvardus, Tarkin's relative, held Eriadu and the surrounding area as the Eriadu Authority, becoming a warlord in his own right."}, {"tag": "p", "text": "Tarkin was survived by his wife and niece, as well as his lover Daala. The Lady Tarkin was determined to avenge her husband's death, obsessed with the war against the Rebellion. She renamed the city where she oversaw the megonite moss mining operations Port Tarkin, and erected a monument in his honor. Rivoche Tarkin continued as a Rebel agent for two more years before she was exposed to the Empire and extracted by the Rebel Alliance. Throughout her time with the Rebellion, however, she refused to speak ill of Tarkin; she had learned well to maintain the family honor."}, {"tag": "p", "text": "Daala spent over a decade hidden within the Maw, abiding by her orders to remain at her station and avoid contact, until Han Solo, Chewbacca, and Kyp Durron stumbled across her. She was devastated to learn that Tarkin was dead and the Death Star destroyed, and began a rampaging campaign against the New Republic, intending to use the Maw Installation's superweapons to destroy the new government. She failed, but in 12 ABY, she formed the Imperial Remnant, a successor state to the Empire, with Admiral Gilad Pellaeon, himself a former subordinate of Tarkin. Decades later, Daala became the Chief of State of the Galactic Federation of Free Alliances, the successor state to the New Republic. By that time she had reevaluated her former relationship with Tarkin and abandoned her formerly worshipful regard for him."}, {"tag": "p", "text": "Tarkin's death did not end the rule of the Tarkin Doctrine. Instead, Palpatine's close adviser Ars Dangor issued a declaration to the military that the Empire would inflict more terror than ever in suppressing the Rebellion. Palpatine had Lemelisk begin work on another superlaser platform, dubbed the Tarkin in memory of the Grand Moff—which a Rebel team destroyed while under construction—and yet another Death Star, this one even larger and more advanced. In 4 ABY, it too was destroyed by the Rebellion, which, along with the death of Emperor Palpatine by Darth Vader's hands, dealt the Empire its most grievous blow since the Battle of Yavin."}, {"tag": "p", "text": "Rebel historian Voren Na'al insisted that Tarkin's loss was an irreplaceable one for the Empire. Even three years later, Imperial leaders felt that Tarkin's death had left a void in the Empire's power structure. Tarkin's reputation was such that, nearly a decade after his death, a physical resemblance to Tarkin was enough to inspire an instinctive respect. Numerous Imperial facilities bore the Tarkin name, such as the Tarkin superweapon, Tarkin Detention Facility on Ruul, the Tarkin's Teeth training ground on Carida, and the Deep Core fortress world Tarkin's Fang. The Coruscant Opera on Coruscant produced a play entitled The Agony of Tarkin. Tarkin was not remembered entirely positively within the Empire; among those Imperials unsettled by the destruction of Alderaan and the existence of the Death Star, some scapegoated Tarkin as a rogue agent whose use of the Death Star did not represent the Empire as a whole."}, {"tag": "p", "text": "On Eriadu, Tarkin was remembered with the Tarkin Memorial Conference Center in Eriadu City. Tarkin's homeworld remained staunchly Imperial well into the New Republic's reign, only reluctantly capitulating to the new government once it became an economic necessity. Its connection to Tarkin continued to be exploited, though. For decades, Tarkin merchandise remained available on Eriadu, including caricatured statuettes for tourists."}, {"tag": "p", "text": "Tarkin's legacy was not altogether negative for the Rebel Alliance. Ackbar's recovery by the Rebel Alliance provided them with numerous military secrets that Ackbar had been able to access. Ackbar used the training Tarkin had unwittingly given Ackbar during his frequent discourses on tactics to his slave, his observations of Tarkin in action, and his own military genius to become Alliance Supreme Commander, a critical figure in the victory of the Rebel Alliance and New Republic over the Empire and one of the era's most noted military minds. Also, some of Tarkin's personal journals were recovered by the Rebel Alliance, giving them critical information."}, {"tag": "p", "text": "Nothing could redeem Tarkin's reputation within the Rebellion and New Republic, however. Among those horrified by his atrocities, Tarkin's memory was cursed. Alderaanians especially loathed him, and the word tarkin entered Omwatese with the meaning of \"demon\" or \"butcher.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wilhuff Tarkin was a determined man with an iron will and tremendous ambition, stoked in his youth by resentment at what he perceived to be a lack of respect for the accomplishments of his Outer Rim-based family. As a young man, Tarkin channeled his ambition into grand plans to bring about the grand, militant future that he believed would replace the Galactic Republic, which he perceived as a decaying institution on its way out. To achieve his goals, Tarkin had a strong sense of duty, putting his professional assignments ahead of his personal life and desires."}, {"tag": "p", "text": "Tarkin could display a charming and charismatic side when he wished, but would shift swiftly to ruthlessness when necessary. In either case, he projected a dominating personal presence, and was deeply persuasive, with an aura of command nearly unmatched in the Empire. Tarkin had a sense of his own dignity, refusing to show weakness, strong emotion, or inappropriate behavior before subordinates, from whom he demanded nothing short of excellence. Among the few feelings he displayed was impatience with subordinates who took up his time unnecessarily or were roundabout in their reports, as well as anger at failure and opposition."}, {"tag": "p", "text": "Though he presented a front of calmness and rational efficiency, Tarkin was exceedingly prideful, short-tempered, and capable of great spitefulness. Tarkin enjoyed authority, taking pleasure in causing fear in his subordinates and telling victims of Imperial attack that they were to blame for bringing Imperial retaliation upon themselves."}, {"tag": "p", "text": "Tarkin was quite self-confident, estimating his own chances of success highly and dismissing obstacles in his path. He gloated over his successes, even before achieving them. He did not like to take risks, but often considered his own position so strong as to limit the actual risk involved. His incredulity at the idea that Rebel starfighters could successfully destroy the Death Star ultimately caused his death. Even in his last moments, confronted with the fact that a successful proton torpedo strike would overload the reactor, Tarkin refused to accept that he could be defeated on the cusp of his climactic victory, that the superweapon on which he had so long labored could be brought low by a mere starfighter. For all his confidence, though, Tarkin was willing to listen to advice from trusted subordinates; he believed that a good officer should not dismiss suggestions out of hand, and he was willing to change his position when it proved necessary."}, {"tag": "p", "text": "Tarkin preferred brute force to elegance. He was authoritative and militaristic, and responded to most problems with an application of force. He saw extravagant punishment as a valuable object lesson, believing that a ruthless example would provide the only genuine deterrent to a determined opponent. In his notorious Tarkin Doctrine, he articulated a slightly more nuanced view, calling for the use not of direct force, but of the fear that force would be used in order to keep the population in line. He believed that the Death Star posed so great a threat that, once it was used and its power demonstrated, no one would dare rise against the Empire."}, {"tag": "p", "text": "Tarkin was a man of absolute ruthlessness. The lives of others meant little to Tarkin; he regarded the deaths of those in his service to be trivial, and was willing to destroy entire planets in order to ensure stability for the Galactic Empire. To him, beings were just assets to be managed, and lives could be expended like any other resource. Tarkin killed those who failed him, and was willing to destroy an entire planet simply to make an example."}, {"tag": "p", "text": "A Humanocentrist throughout his life, Tarkin disliked non-Human species and also did not care for the supernatural powers of the Jedi. Though he found it distasteful, he was not above using non-Humans when they were useful, so long as Humans were the ones in control. Tarkin's speciesism was one of the main avenues through which Palpatine, as Darth Sidious, appealed to Tarkin early in his career. Even after playing a key role in formulating and articulating New Order ideology, with its emphasis on Human High Culture, Tarkin was not slavishly bound to it, and was willing to use nonhumans within the Imperial hierarchy when they proved useful."}, {"tag": "p", "text": "Despite these traits, he did initially have some reservations as to some of the more heinous orders from Palpatine. This ultimately resulted in Palpatine orchestrating his son's \"kidnapping\" (in actuality, defection) by the natives of Atoa and later death in their hands (in actuality, his death came at the hands of Darth Vader when he attempted to collapse the temple they were in in order to commit suicide) in order to make him a more vicious ally of the Empire and thus a more willing servant."}, {"tag": "p", "text": "With simple personal tastes, Tarkin was not an indulgent man. He surrounded himself in the trappings of luxury expected of his position, but took little pleasure in them, preferring more spartan, militaristic confines. Tarkin did enjoy mobility; he was uncomfortable with the idea of being confined to one planet, much less a smaller location."}, {"tag": "p", "text": "A man of tremendous intellectual power, Tarkin cultivated his mental abilities as a youth, demonstrating extensive ability in multiple disciplines. He was an accomplished philosopher and poet, and provided major developments in starship design and xenobiology. A polyglot, he commanded High Galactic, Bocce, Sullustese, Shyriiwook, and Dosh in addition to his native Galactic Basic Standard. Furthermore, Tarkin was adept in both the political and military fields. A master of high-level politics, he was also an outstanding commander in the field, an expert in grand strategy as well as fleet and siege tactics. His tactics were instrumental in the cultivation of Admiral Ackbar's military mind."}, {"tag": "p", "text": "Tarkin had great aptitude as an administrator. He was highly efficient and known for keeping careful track of resources and personnel, always recalling a potentially useful asset. As an administrator, Tarkin took pride in his military background, believing it important to occasionally remind his subordinates that he was in fact a man of practical experience who was still willing to work in the field. A skilled political jouster in addition to being a military man, Tarkin saw politics as a softer and more elegant form of warfare, but warfare nonetheless. He made good use of his domineering presence in diplomacy, preying on opponents' fears to force acquiescence."}, {"tag": "p", "text": "Deeply devoted to the Death Star project, Tarkin saw it as his personal dream and would not tolerate obstruction of the project, especially after the frustration of nearly twenty years of delays. Defiance of his will, or simple incompetence in carrying it out, enraged him. To him, the Death Star was like his own child, and he was awed by its power, passionate about its potential, and extremely proud of his accomplishment in building it."}, {"tag": "p", "text": "Tarkin had a close working relationship with his Emperor, of whom he had long been a major supporter. He was willing to speak frankly to Palpatine and unafraid to disagree with the Emperor. Though Tarkin was ambitious, self-confident, and of the opinion that, with the Death Star under his control, he would be the most powerful man in the galaxy, he did not underestimate the Emperor. Sure that a move against the powerful and well-prepared Emperor would result only in failure, Tarkin had no real intention of overthrowing Palpatine, though he dreamed of some day being in the position to fulfill his ambitions."}, {"tag": "p", "text": "Though Tarkin had a good working relationship with Darth Vader, whom he found efficient and considered an ally in the Imperial hierarchy, he was also unsettled by Vader's supernatural powers and mysterious nature, and disliked when Palpatine used Vader as a check on Tarkin himself. The pair respected but did not trust or personally like each other. Despite Vader's lofty position, Tarkin was among few Imperial officials willing to interrupt, stand up to, and direct Vader, behavior Vader tolerated."}, {"tag": "p", "text": "Personally cold, Tarkin was not a man for trust or friendship, believing them outmoded in the new order of things. He saw connection as a matter of alliance for mutual benefit and advantage to be exploited. He was not a family man, and felt little love for his wife, whom he had married purely due to political concerns. The closest he has come to having any sense of caring for his family was with his son, Admiral Garoche Tarkin, which was exploited by Palpatine to ensure he became a more efficient officer in the Empire. Tarkin was capable of some basic feelings of warmth; he saw his slave, Ackbar, much like a pet. When in a mood to hold forth, Tarkin would offer instruction to Ackbar, and enjoyed explaining his own tactics to the slave."}, {"tag": "p", "text": "There was one person, though, for whom Tarkin was capable of affection. Tarkin found Natasi Daala physically appealing, but it was her intellect, ambition, and ruthlessness that drew him to her. Though he did not consider her his equal, he could not be truly attracted to a woman who was not at least close to his level in intelligence and competence. She was also the only person who could make him laugh, a trait he valued. Though he maintained a veneer of formality as her superior, their private interactions were far more casual than Tarkin's norm, and he allowed her to call him Wilhuff even in a professional setting, though before others they were always strictly formal. Tarkin allowed himself to be charmed by Daala, but he was able to resist her appeal and immediately shift to cold professionalism when circumstances demanded. In his affair with Daala, Tarkin found release from the stress of his position, seeing the admiral as an invigorating diversion from political concerns. He knew that she put her career ahead of her relationship with him, and it did not bother him; instead he considered it a sign of the driven, confident, and ruthless personality that attracted him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Grand Moff Tarkin was created for the 1977 film Star Wars: Episode IV A New Hope, originally titled Star Wars. Tarkin, one of the film's primary antagonists with Darth Vader, was portrayed by veteran actor Peter Cushing. Tarkin's name appeared in the rough draft of Star Wars as the Grande Mouff Tarkin, an Aquilaean religious leader with a single line of dialogue during a meeting of the Aquilaean Senate. The role of the villainous governor was associated with the character Crispin Hoedaack, an ambitious young official assigned to conquer Aquilae, the planet of the script's heroes. Hoedaack perished when the heroes destroyed the Imperial space fortress. In the second draft, there was no governor, only Darth Vader, and the Grande Mouff Tarkin was the commander of the Kesselian Dragoons and the leader of a faction at the Rebel base that distrusted the Force connection of the Starkiller and instead relied on technological battle analysis before eventually being convinced to trust the Starkiller's battle plan. In the third draft, the Grand Mouff Tarkin, commander of the Kesselian Dragoons, was the leading Rebel general, who conceived the battle plan used against the Death Star. He effectively filled the role of General Dodonna in the finished film, while in this version General Dodana played the role of the cowardly and doubting general filled by Tarkin in the previous draft. In the final script, the role of the villainous governor allied with Vader was restored, and writer George Lucas assigned the Tarkin name to the governor, with Dodonna as the Rebel general. Once Darth Vader had become conceptualized as a masked character, Lucas believed he needed a strong, visibly human villain to complement Vader. Lucas believed that Tarkin would serve the role of the main villain, serving as the personification of the Empire in the place of the Emperor himself."}, {"tag": "p", "text": "Cushing was originally approached to play Obi-Wan Kenobi, but Lucas decided that Cushing was perfect for the role of Tarkin, and Cushing agreed to portray the villain. Cushing, who chose his roles based on what he felt viewers would like to see him do, felt that audiences would enjoy the film and like seeing him as Tarkin. Cushing was Lucas's first choice for the role. On set, Cushing was extremely pleasant to his co-stars, making it difficult for Carrie Fisher, playing Leia Organa, to muster the required animosity toward Tarkin's character on camera. The costume department was unable to procure boots large enough for Cushing, so he wore the small boots for the few necessary long shots, but spent most of the shooting in a pair of slippers. The slippers found for Cushing were women's, making it difficult for his co-stars to keep a straight face when playing against him."}, {"tag": "p", "text": "Tarkin first appeared not in the film, but in the novelization of the film, released months before Star Wars premiered. The novel also identified his rank as Grand Moff, as did the credits of the film, but in movie dialogue he was only identified as \"Governor Tarkin.\" Among more minor variations between the novel and the finished film, the novel portrays Tarkin as present during Leia Organa's interrogation, in contradiction of the film. Tarkin's first name was only revealed in 1994, seventeen years after his first appearance, in Star Wars Screen Entertainment."}, {"tag": "p", "text": "Tarkin was voiced by Keene Curtis in the Star Wars radio drama, which included expanded scenes between Tarkin and Vader and an added subplot involving Motti attempting to convince Tarkin to overthrow the Emperor. Tarkin has also been voiced by Nick Jameson in Star Wars: X-Wing and by Paul Darrow in Star Wars: Empire at War."}, {"tag": "p", "text": "In the prequel Star Wars: Episode III Revenge of the Sith, Lucas decided to include Tarkin. Concept artist Iain McCaig suggested using unused footage from A New Hope and digitally animating Cushing's lips to match dialogue. McCaig also created the only concept art image for the character, which Lucas approved. Animation director Rob Coleman spoke with Christopher Lee, a close friend of Cushing, about the possibility of using a digital model of Cushing. Ultimately, actor Wayne Pygram was hired and was able to achieve the likeness of a young Tarkin through the use of prosthetic makeup."}, {"tag": "p", "text": "In the Cartoon Network animated television series Star Wars: The Clone Wars, Tarkin's character is voiced by Stephen Stanton after researching Cushing's performances and then tried to imitate what Cushing might have sounded like in his mid-thirties and soften to give a level of humanity."}, {"tag": "p", "text": "The Essential Guide to Characters and The New Essential Guide to Characters listed Tarkin as having naturally black hair, and novels depicting Tarkin as a younger man shared that description. Though Tarkin's hair was mostly gray in A New Hope, he still showed some hair with Peter Cushing's natural auburn color, though, and had no black in his hair. When the younger Tarkin appeared visually for the first time in Revenge of the Sith, he had auburn hair in accordance with Tarkin's previous film likeness, and all further depictions have used this appearance."}, {"tag": "p", "text": "Tarkin was given two five star cards in the game Star Wars: Force Collection."}, {"tag": "p", "text": "Tarkin appeared in the non-canon comedic Star Wars Tales story \"A Death Star Is Born\", a parodic scene of Tarkin's presentation of the Death Star plans to Palpatine. Tarkin also appeared in the Tales comic \"Prey\", in which he ordered bounty hunter Boba Fett to capture Han Solo as an object lesson to deter desertion. Tarkin then suggested that Vader, who was unhappy with the hiring of Fett, capture Solo himself, leading to a fight between Fett and Vader during which Solo escaped."}, {"tag": "p", "text": "Tarkin plays only a minor role in the Star Wars Infinities version of A New Hope, a non-canon alternate version of the film's story. In its story, Luke Skywalker failed to destroy the Death Star at Yavin. Tarkin captured the Rebel leadership as they attempted to evacuate Yavin 4, and remained commander of the Death Star in orbit over Coruscant. Five years later, Skywalker, Han Solo, and Yoda led an attempt to rescue Leia Organa from her Imperial brainwashing, and Yoda mind-tricked Tarkin into giving him control of the station, which he used to destroy the fleet in orbit over Coruscant. Yoda then rammed the Death Star into Coruscant as the others fled the planet with a redeemed Organa, killing Palpatine."}, {"tag": "p", "text": "As Kenner had never produced a Grand Moff Tarkin action figure during the run of the original films, despite his prominence, Kenner designers wanted to remedy that omission in their proposed The Epic Continues toy line, designed in 1984 for release in 1986. To maintain interest after the films, The Epic Continues was designed around a proposed new storyline taking place after the films. In order to fit Tarkin into that line, the designers intended to establish that Tarkin had escaped the Death Star and gone into hiding, emerging after the events of the film trilogy to take control of the Empire. The storyline, and with it the product line, was rejected by Lucasfilm authorities, and so neither it nor the Tarkin toy saw production. It was not until 1997 that a Tarkin figure debuted."}, {"tag": "p", "text": "A major continuity issue involving Tarkin is his involvement in the Ghorman Massacre. The original source for the incident, the The Rebel Alliance Sourcebook, portrayed Tarkin as an Imperial naval captain who was promoted after the incident. The Essential Chronology specified that Tarkin was promoted to Moff. Later sources, however, established that Tarkin was promoted to Moff before the Empire was even created, and served as governor of the Seswenna sector immediately prior to that promotion. This article has retained the substance of the Ghorman story, but placed it prior to Tarkin's promotion to Grand Moff, maintaining its context within the early establishment of the Empire."}, {"tag": "p", "text": "Wilhuff Tarkin was originally planned to have his own war portrait in The Essential Guide to Warfare, with Jason Fry planning to portray him in a manner closer to the original draft for A New Hope (i.e., planning to use the Death Star to challenge Palpatine's rule and blowing up Coruscant), as well as viewing Darth Vader as nothing less than a tool largely because of his injuries. This however, ended up cut due to time constraints."}, {"tag": "p", "text": "Wilhuff Tarkin also appeared in the tongue-in-cheek in-universe StarWars.Com blog \"Planet Earth Abandons Death Star Project In Face Of Superior Galactic Imperial Power,\" where he commented that he probably wouldn't have allowed the Death Star to be created, or used by the primitive population of Earth, viewing it as a threat to the stability of the Galactic Empire, and likewise expressed his belief that only an enlightened person such as the Galactic Emperor, their ruler, would use the battlestation to protect and defend the Empire. At the time the blog had been written, the United States Government had rejected a petition requesting the development of a Death Star, citing its cost and time to create the resources necessary to develop the station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}