{"url": "Willer_Clines%27_House", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Residential buildings", "Category:Tazan locations"], "nodes": [{"tag": "h1", "text": "Willer Clines' House"}, {"tag": "p", "text": "Willer Clines' House was located in Tazan City on the planet Tazan, half a kilometer from Tazan starport. It was the residence of Rebel sympathizer Willer Clines and his daughters, Flaenella and Jastina. Sometime after the destruction of Alderaan, a Rebel Alliance mission to the planet resulted in the house being the location of a firefight with Imperial stormtroopers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The house was located on a corner in Desander Section, a low-income but respectable section of Tazan City, and was a half kilometer's distance from Tazan starport. Two-storied, the house was constructed of stone with wooden doors and shutters. The ground floor had a lounge that opened out onto the street. The lounge was small and neat, with walls painted lime green. Some local art work adorned the walls, as well as a flat-holo of Willer Clines' daughters, Flaenella and Jastina. The only modern technology in the room was a standard comm terminal. The lounge was separated from a kitchen by a woven curtain. There were two other rooms on the ground floor, as well as two refreshers. A staircase leading to the second story was located in an alcove off the lounge."}, {"tag": "p", "text": "Outside the house was a well-maintained garden, containing a number of flowerbeds of local plants. A barbeque pit was built into the angle of the wall, and there was also a small outbuilding in which Clines kept his landspeeder."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This house was owned by Willer Clines, a balding Human with two daughters. Clines was a Rebel sympathizer, which was discovered by the Imperial presence on the planet. The Imperials kidnapped his daughter, Jastina, to use as leverage over Clines, and, believing he had semi-regular contact with the Rebellion, they set up a watch on his house. When a group of Rebel agents arrived on the planet sometime after the destruction of Alderaan, they came to the house in order for Clines to arrange transport and directions to their objective. Clines entertained them in the lounge, while eight stormtroopers monitored the conversation from the back room, and another two guarded the outside. When they felt the Rebels had revealed all they would about their mission, six stormtroopers entered the lounge while two remained out back. The two outdoor troopers circled to the front of the house to cover any potential escape. The troopers were forced to enter the lounge one-by-one, and quickly engaged the Rebels in a firefight."}, {"tag": "p", "text": "The Rebels managed to escape the Imperials and were met outside by Flaenella Clines, who quickly arranged transport for them away from the house and on to the nearby Imperial Data Processing Facility, where her sister was being held. There, the Rebels attempted to rescue Jastina, as well as continue their mission of infiltrating the facility, obtaining new TIE/LN starfighter communications protocols, and destroying the installation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Willer Clines and his house appear in the roleplaying adventure Ultimate Core Dump, written by Megan Robertson for the RPGA affiliated with Wizards of the Coast. The house is the setting for the third encounter during the adventure, and its outcome is left open; however, some options are suggested. In the first, presented above, the players escape outside and are met by Flaenella. She helps them escape, either on the landspeeder from the outbuilding or by obtaining swoops from a neighbor down the road. In the second option, the players defeat all the stormtroopers, although this is said to be unlikely. They then meet with Willer and Flaenella at their leisure. In the third option, some or all of the players are captured and arrested. This does not end the adventure, though, as they can later break out of an Imperial cell and continue their mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}