{"url": "Will_Scotian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Blue Squadron personnel", "Category:Brentaalans", "Category:Humans", "Category:Males", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Will Scotian"}, {"tag": "p", "text": "Will Scotian was a Human male who hailed from the planet Brentaal IV, where he grew up dreaming of becoming a hero and finding fortune among the stars while watching transports take off from Brentaal's immense spaceport. Scotian learned to pilot simple cargo skiffs for a local freight hauler and apprenticed aboard bulk freighters before joining the Rebel Alliance as a starfighter pilot. Scotian loved pushing his fighter to the limit, which proved adventurous during his training. He registered an outstanding combat record while serving at the Rebellion's Oracle Base in the Brak sector and later fought in the Battle of Hoth in 3 ABY. Scotian's excellent combat record soon convinced Rogue Leader Wedge Antilles to request his transfer into the elite Rogue Squadron. Scotian flew under the call sign Rogue Two."}, {"tag": "p", "text": "Scotian participated in Rogue Squadron's failed mission to help Luke Skywalker, Princess Leia Organa, and Lando Calrissian rescue the carbonite-encased Han Solo from the bounty hunter Boba Fett on the moon of Gall in 3.5 ABY. During the Battle of Gall, Scotian and Rogue Squadron fought to hold off two Imperial II-class Star Destroyers and 144 TIE starfighters while the Rebels sneaked into the Imperial Enclave on Gall's surface in pursuit of Fett. Two TIE Fighters badly damaged Scotian's X-wing starfighter early in the engagement, forcing him to evacuate the combat zone, while Fett eventually escaped with Solo."}, {"tag": "p", "text": "By the years of the New Republic, Scotian's service with Rogue Squadron had come to an end, although he experienced a short return to the squadron in 7.5 ABY, following the liberation of the galactic capital planet of Coruscant from Imperial control. The regular members of Rogue Squadron had resigned their commissions in the New Republic to wage an unsanctioned war against the forces of de facto Imperial leader Ysanne Isard, which prompted the New Republic to organize a temporary, ersatz Rogue Squadron, consisting of former squadron members, including Scotian, for morale purposes. Once Isard was defeated, the real Rogue Squadron returned to the New Republic, and Scotian returned to his previous unit."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Hoth and joining the Rogues"}, {"tag": "p", "text": "Will Scotian, a Human male native of the Core World Brentaal IV, grew up dreaming of becoming a hero. In his youth, Scotian often watched transports taking off from Brentaal's huge starport, and, like many of his peers who did the same, he yearned to make a fortune out among the stars. Scotian began his piloting career by learning to handle simple cargo skiffs for a freight hauler near his home. Later, he apprenticed aboard bulk freighters, one day abandoning his job and jumping ship to join the Alliance to Restore the Republic's struggle in the Galactic Civil War."}, {"tag": "p", "text": "Scotian began training to pilot starfighters while with the Rebel Alliance, which proved to be something of an adventure because of his brash nature. He enjoyed pushing his fighter to the limits and soon compiled an outstanding combat record while serving at the Rebellion's Oracle Base in the Brak sector. Eventually, Scotian received a brief posting to Echo Base, the Alliance High Command's secret headquarters on the Outer Rim Territories ice planet Hoth, where he served with Blue Squadron under the call sign Blue Three. However, the Galactic Empire discovered Echo Base in 3 ABY, forcing the Rebels to begin hastily abandoning their compromised Hoth outpost."}, {"tag": "p", "text": "As the Rebels prepared to evacuate Echo Base in the face of imminent Imperial invasion, Scotian attended Princess Leia Organa's pre-battle briefing with a group of fellow pilots from Rogue Flight, Blue Squadron, and Green Squadron. Leaning over the top of an X-wing starfighter's laser cannon, Scotian listened as Organa explained that Echo Base's pilots had the responsibility of either piloting or flying fighter escort for the Rebels' GR-75 medium transports through the waiting Imperial blockade in Hoth's orbit under the protection of the base's powerful v-150 Planet Defender ion cannon. Although the Battle of Hoth proved to be the Rebellion's worst battlefield defeat of the war, in which forty-two pilots died and seventeen of the Rebels' thirty evacuation transports were lost, the majority of base personnel safely escaped the planet. Scotian himself survived as well."}, {"tag": "p", "text": "Following the Rebel defeat at Hoth, Scotian soon earned a position with the elite Rogue Squadron, whose pilots had covered Echo Base's evacuation. Scotian's stellar combat record at Oracle Base caught the attention of Rogue Leader Wedge Antilles, who requested the young pilot be transferred into the squadron, which continued to serve the Alliance Fleet as a rapid response team in the months following Hoth. Scotian flew under the call sign Rogue Two, the eventual successor of former Rogue pilot Zev Senesca, who died during the Battle of Hoth. Scotian's self-confidence in his abilities helped him fit in well with the Rogues. He learned much from his fellow pilots, but his brashness still tended to result in reckless and unconventional maneuvers."}, {"tag": "h3", "text": "To rescue Han Solo from Gall"}, {"tag": "p", "text": "In 3.5 ABY, Scotian and the Rogues sneaked into the Zhar system of the Outer Rim Territories to set up a small temporary command base on the moon of Kile, as part of a mission to help Luke Skywalker, Leia Organa, and Lando Calrissian rescue the carbonite-frozen Han Solo from the bounty hunter Boba Fett. The Rebellion had learned that Fett was holding Solo at the Imperial Enclave on the nearby moon of Gall, in preparation for delivery to the crime lord Jabba the Hutt. Scotian and the Rogues planned to attack the Imperial Enclave's naval forces in orbit over Gall, which they hoped would create enough of a distraction to allow Organa and Calrissian in the Millennium Falcon, and the mercenary Dash Rendar, piloting his ship, the Outrider, to sneak in and free Solo."}, {"tag": "p", "text": "Scotian and the Rogues were on hand in their X-wing starfighters to welcome the Millennium Falcon's arrival in the Zhar system. They escorted Organa, Calrissian, and Skywalker, the latter flying his own X-wing, to the Rebels' moon base on Kile, where the group prepared for their upcoming rescue mission. Despite Skywalker joining Rogue Squadron as the unit's thirteenth member, flying as honorary Rogue Leader, the Rebels were vastly outnumbered. Scotian's squadron was required to keep occupied two Imperial II-class Star Destroyers and their combined complement of 144 TIE starfighters. During the ensuing Battle of Gall, Scotian was forced to quickly evacuate the area after Rogue Squadron met the first wave of attacking TIE Fighters. Two TIEs had maneuvered into pursuit of Scotian's X-wing, and though Rogue Six, Wes Janson, warned him of the threat, Scotian suffered laser damage to his fighter's R2 unit and overhead canopy."}, {"tag": "p", "text": "Scotian was able to patch his canopy's leak and resolved to continue fighting, claiming he still maintained manual and weaponry control on his fighter, but Skywalker nevertheless ordered him to return to the Rogues' base on Kile. There were simply too many enemy fighters to risk Scotian's continued presence. Scotian left what turned out to be a failed mission for the Rebellion. Rogue Squadron held off the bulk of the Imperial Enclave's naval forces, despite losing Rogue Five, Dix Rivan, in the process, but Organa and Calrissian failed to rescue Solo from Fett, who escaped Gall with his carbonite-encased prisoner."}, {"tag": "p", "text": "In the days following the Gall mission, Rogue Squadron abandoned its base on Kile and returned to the Alliance Fleet. No sooner had the Rogues arrived, however, than they received a message requesting their assistance to help Skywalker, Organa, and Calrissian escape from the clutches of the Black Sun crime syndicate on the Imperial capital planet of Coruscant. Rogue Squadron engaged both Imperial and Black Sun forces in a three-way battle in orbit over Coruscant, in which Skywalker and party escaped, and Black Sun suffered a crippling defeat."}, {"tag": "h3", "text": "An ersatz Rogue Squadron"}, {"tag": "p", "text": "Scotian survived to see the Rebel Alliance's eventual transition into the New Republic, following the massive Imperial defeat at the Battle of Endor in 4 ABY, although at some point his service with Rogue Squadron came to an end. Scotian returned to Rogue Squadron in 7.5 ABY, albeit in a temporary role, following the New Republic's defeat of de facto Imperial ruler Ysanne Isard and the resulting Liberation of Coruscant from Imperial control. The official members of Rogue Squadron had resigned their commissions with the New Republic and their positions in the squadron to wage an unsanctioned civilian campaign to defeat Isard, who had escaped from Coruscant, once and for all. In the true Rogue Squadron's absence, the New Republic cobbled together an ersatz Rogue Squadron, consisting of former squadron members, for appearance's sake to maintain morale. Among those brought back was Scotian."}, {"tag": "p", "text": "Following the final defeat of Isard, the real Rogue Squadron accepted an offer to return to the New Republic with their positions reinstated, leaving the temporary Rogue Squadron members, including Scotian, to return to their original units. The ersatz Rogue Squadron escorted the real Rogues through the skies of Coruscant upon their triumphant return to the New Republic capital. In one last show of bravado before disbandment, Scotian and his squadron engaged the real Rogue Squadron in a friendly competition of precision flying that wowed the Coruscanti crowds who had gathered to welcome back the returning unit."}, {"tag": "p", "text": "Lieutenant Derek \"Hobbie\" Klivian, the temporary Rogue Squadron's commanding officer, provided Wedge Antilles with the personnel files of his temporary unit for inspection before it was disbanded. Antilles was in the infancy stage of creating a new starfighter–commando unit, eventually named Wraith Squadron, although Scotian was not selected for inclusion."}, {"tag": "p", "text": "Will Scotian was not related to Pedna Scotian, a Chev pilot who later served with Rogue Squadron during the New Republic campaign to defeat rogue Imperial Warlord Zsinj, circa 7.5 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Growing up watching starships depart from the large spaceport on Brentaal IV, Will Scotian always dreamed of finding adventure and fortune among the spacelanes. He received his chance after joining the Rebel Alliance as a starfighter pilot. His starfighter training was a bit adventurous, since Scotian enjoyed pushing his craft to its limit, but he nevertheless demonstrated excellence in combat. Scotian's exceptional abilities earned him a position with the elite Rogue Squadron, where his blaster-sure personality helped him fit in well with his fellow pilots."}, {"tag": "p", "text": "If there was ever a fault in Scotian's combat abilities, it was that he was overaggressive and often had to be ordered to withdraw from a combat zone, even if his starfighter was badly damaged, such being the case during the Battle of Gall. Scotian would never willingly leave a battle, believing he was invincible and that heroism in a crippled starfighter was just part of his job description. Scotian had brown hair and light skin."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Scotian commanded knowledge of planetary systems, street survival, and starfighter tactics. He also possessed mechanical ability in astrogation, repulsorlift operation, space transports, X-wing starfighter piloting, and starship gunnery."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Scotian's equipment during his Rogue Squadron career circa 3.5 ABY included a blaster pistol, comlink, and his Rebel flight suit. He similarly donned a flight suit during the Battle of Hoth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "The character \"Will\" first appeared in the May 1996 novel Shadows of the Empire, by Steve Perry, in which he is one of two Rogue Squadron pilots downed during the Rebel Alliance mission to rescue Han Solo from Boba Fett on Gall. The character was provided a last name, \"Scotian,\" and a brief background history to complement his involvement in the novel in the subsequent June 1996 Shadows of the Empire Sourcebook, by Peter Schweighofer."}, {"tag": "p", "text": "The December 2013 Rogues Gallery department from Star Wars Insider 146 later established Scotian as being one of the Echo Base Rebel pilots present during Princess Leia Organa's Battle of Hoth briefing in the 1980 film Star Wars: Episode V The Empire Strikes Back. The film is therefore now retroactively considered to be the character's first appearance in Star Wars canon.  In the film, he was portrayed by actor David Stone."}, {"tag": "h3", "text": "Relationship to Pedna Scotian"}, {"tag": "p", "text": "A character named Pedna Scotian, also a Rogue Squadron pilot, appears in the February 1999 novel X-Wing: Solo Command, by Aaron Allston. The Complete Star Wars Encyclopedia, released in 2008, confirms that there is no familial relationship between Will Scotian and Pedna."}, {"tag": "p", "text": "Allston envisioned that Will Scotian helped rescue Pedna, a Chev slave, during a Rebel Alliance raid on mercenaries supporting the Empire in his post-Rogue Squadron days. Recognizing the Human cultural trend of having two names, Pedna, who did not know her own family or clan name, adopted the surname \"Scotian\" in honor of her rescuer. Months after Will Scotian was transferred back to his unit after serving in the temporary Rogue Squadron during the events of Allston's novel X-Wing: Wraith Squadron, Pedna Scotian was likewise transferred into Rogue Squadron, but no one knew if her assignment was because of her flying skills or some sort of administrative error, such as someone believing he was actually transferring Will Scotian into the squadron. Nevertheless, these events simply reflect Allston's personal backstory for the characters and have never been officially included in Star Wars canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}