{"url": "William_Shakespeare%27s_The_Empire_Striketh_Back:_Star_Wars_Part_the_Fifth", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:William Shakespeare's Star Wars"], "nodes": [{"tag": "h1", "text": "William Shakespeare's The Empire Striketh Back: Star Wars Part the Fifth"}, {"tag": "p", "text": "William Shakespeare's The Empire Striketh Back: Star Wars Part the Fifth is a non-canon book by Ian Doescher. It was released on March 18, 2014. The book is a retelling of Star Wars: Episode V The Empire Strikes Back as if it was penned by William Shakespeare."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "Hot on the heels of the New York Times best seller William Shakespeare's Star Wars comes the next two installments of the original trilogy: William Shakespeare's The Empire Striketh Back and William Shakespeare's The Jedi Doth Return. Return to the star-crossed galaxy far, far away as the brooding young hero, a power-mad emperor, and their jesting droids match wits, struggle for power, and soliloquize in elegant and impeccable iambic pentameter. Illustrated with beautiful black-and-white Elizabethan-style artwork, these two plays offer essential reading for all ages. Something Wookiee this way comes!"}, {"tag": "h2", "text": "Internal Flap"}, {"tag": "p", "text": "The saga that began with the interstellar best seller William Shakespeare's Star Wars continues with this merry reimagining of George Lucas's enduring classic The Empire Strikes Back."}, {"tag": "p", "text": "Many a fortnight have passed since the destruction of the Death Star. Young Luke Skywalker and his friends have taken refuge on the ice planet of Hoth, where the evil Darth Vader has hatched a cold-blooded plan to capture them. Only with the help of a little green Jedi Master — and a swaggering rascal named Lando Calrissian — can our heroes escape the Empire's wrath. And only then will Lord Vader learn how sharper than a tauntaun's tooth it is to have a Jedi child."}, {"tag": "p", "text": "What light through Yoda's window breaks? Methinks you'll find out in the pages of The Empire Striketh Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}