{"url": "William_Shakespeare%27s_Star_Wars", "categories": ["Category:Real-world articles", "Category:William Shakespeare's Star Wars"], "nodes": [{"tag": "h1", "text": "William Shakespeare's Star Wars"}, {"tag": "p", "text": "William Shakespeare's Star Wars is a series of non-canon books by Ian Doescher presenting the films of Star Wars as if they were plays written by the famous playwright William Shakespeare, containing his popular phrasing and word choice. The series consists of three titles covering the original trilogy: William Shakespeare's Star Wars (Verily, A New Hope) (Star Wars: Episode IV A New Hope), William Shakespeare's The Empire Striketh Back: Star Wars Part the Fifth (Star Wars: Episode V The Empire Strikes Back) and William Shakespeare's The Jedi Doth Return: Star Wars Part the Sixth (Star Wars: Episode VI Return of the Jedi). The three titles are available together in one set as William Shakespeare's Star Wars Trilogy: The Royal Imperial Boxed Set."}, {"tag": "p", "text": "William Shakespeare versions of the prequel trilogy have been published, with William Shakespeare's The Phantom of Menace: Star Wars Part the First released on April 7, 2015, William Shakespeare's The Clone Army Attacketh: Star Wars Part the Second released on July 7, 2015 and William Shakespeare's Tragedy of the Sith's Revenge: Star Wars Part the Third released on September 8, 2015."}, {"tag": "p", "text": "William Shakespeare's The Force Doth Awaken: Star Wars Part the Seventh, a Shakespeare version of the sequel trilogy title Star Wars: Episode VII The Force Awakens, was published on October 3, 2017. William Shakespeare's Jedi the Last: Star Wars Part the Eighth based on Star Wars: Episode VIII The Last Jedi was released on July 10, 2018."}, {"tag": "p", "text": "Per an interview with author Ian Doescher, Lucasfilm is not planning on works related to the Star Wars Anthology Series."}, {"tag": "p", "text": "Doescher indicated in a tweet on December 21, 2019 that he had begun work on William Shakespeare's The Rise of Skywalker, based on Star Wars: Episode IX The Rise of Skywalker. The title was later announced as William Shakespeare's The Merry Rise of Skywalker: Star Wars Part the Ninth, and was released on July 28, 2020."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}