{"url": "Winged_xendrite", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Creatures of the Inner Rim", "Category:Flying creatures", "Category:Insectivorous creatures", "Category:Reptavians", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Winged xendrite"}, {"tag": "p", "text": "The winged xendrite was an insectivore native to Xend. It was exported to various planets throughout the galaxy in attempts to control insect infestations. The hunting strategy of the winged xendrite was much more like that of amphibians than avians. Using their relatively small legs as hooks and securing themselves with their coiled tails, the xemdrites hung from tree branches, with artificial structures serving as substitute in urban areas, and caught insects using their sticky tongue. Early reports on the xendrites assumed that used a sieve or net strategy, flicking their tongues out at random and catching insects by chance, but closer studies proved that the xendrites chose specific targets, striking them with a 98% accuracy rate. The most common reason for the introduction of Xendrites into a planet's ecosystem is to control the spread of inscer-borne diseases. Unfortunately, the ecological balance of a planet is much more complex than most individuals assume, and the introduction of a new species usually produces more problems than it solves. The Winged Xendrites have no natural predators on Xend.  Instead, their population is controlled completely by the amount of available food. An increase (or decrease) in the insect population is immediately followed by a proportional change in their population of Xendrites. However, this system of ecological balance which works so well on Xend, is not sufficient to control the population of Xendrites on many of the planets to which they are imported in most cases, a planet which had previously complained of having too many insects soon finds itself to have far too many Xendrites."}, {"tag": "h2", "text": "Sources"}]}