{"url": "Wings_of_the_Master", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Wings of the Master"}, {"tag": "p", "text": "\"Wings of the Master\" is the seventh episode of the Star Wars Rebels animated television series' second season. It is the twenty-second episode of the series overall. The episode premiered on November 11, 2015 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "With the rebels in desperate need of a ship with heavy weaponry, Hera seeks out a master engineer who has built a powerful new starfighter prototype."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Traveling through hyperspace, Phoenix Squadron is on its way to Ibaar to help the people who are in distress. The Empire has doubled their work quotas and cut their rations. Unless the rebels are able to get any food supplies to the Ibaarian people, the weakest among them will starve. They soon arrive at Ibaar and discover an Imperial blockade, led by Agent Kallus, is waiting for them. Agent Kallus threatens to destroy them unless they surrender, but the rebels proceed with their mission and prepare for battle. A-wing fighters are deployed and assume attack formation. TIE fighters are also deployed and move in on Phoenix Squadron. Hera Syndulla instructs Phoenix Leader to keep the TIEs occupied while the rest of them proceed with the mission in getting their supplies to the surface. The TIEs are the first to open fire and the fight to get through the blockade begins. The blockade opens fire as well and the transport ship carrying the supplies takes a heavy beating. Syndulla instructs the crew to maintain course. Agent Kallus orders all ships to focus fire on the transport, determined not to let the rebels pass. The transport losses forward shields, and just when the Rebels think they'll get through the transport is destroyed. Defeated, the rebels are forced retreat to hyperspace and return to the fleet, losing Phoenix Leader in the process."}, {"tag": "p", "text": "Upon returning, the rebels are trying to figure out a new strategy to get the supplies through the Imperial blockade. Everyone agrees they have to complete this mission but also know their fleet will not stand a chance against that blockade. Even with the entire fleet it still won't be enough. Just then, Rex steps forward with an alternative. He tells them about an engineer named Quarrie he has been in contact with, who has no love for the Empire and claims to have built a prototype heavy assault starfighter: a blockade buster he calls it. However, Rex also says that Quarrie will only discuss his ship in person on the planet Shantipole, much to the shock of all the pilots. They all know that Shantipole is a death trap and any ship that goes there never comes back. Kanan Jarrus volunteers to send Syndulla but declines. She says she needs to remain with the fleet and lead the next run on the blockade, but Jarrus insists on her taking this assignment. He knows they cannot beat that blockade with what they currently have and need a better ship, one with better firepower and with the best pilot at the controls. After coming to a final agreement, the Ghost crew head for Shantipole. Upon arriving, a reluctant Syndulla takes the Phantom down to the surface with Garazeb Orrelios and Sabine Wren, while Jarrus, Ezra Bridger, and Chopper pick up the remaining supplies for the people of Ibaar. Upon entering the atmosphere, Syndulla brings up why it's so hard to land on Shantipole. When flying in the upper atmosphere their ship will not be able to maintain power, resulting in disastrous consequences. Suddenly, a bolt of lightning strikes them, damaging the Phantom's systems. Falling fast they come out of the clouds and find themselves over a canyon of pinnacles. Syndulla struggles to navigate the crippled the Phantom through the pillar forest and they soon spot a landing field where Quarrie is said to live. Damaged but all in one piece, they make it with a bumpy landing."}, {"tag": "p", "text": "They nearly go off the edge of the platform but are saved by Quarrie, who has been expecting them. He greets them warmly and gives his complements on Hera's landing. Despite knowing how dangerous Shantipole is to ships, Quarrie says it's the perfect place to test them and is also the last place the Empire would look. Quarrie brings them to the main hanger and shows them his prototype Starfighter; the Blade Wing, prototype of the A/SF-01 B-wing starfighter. Despite judging its appearance, Quarrie assures them that his ship is one of his most advanced designs. He says it's fast and masters great firepower. Syndulla is delighted and looks forward to taking it out for a spin, but much to her disappointment Quarrie won't let her, as he will only allow the right pilot to fly his ship. However, he does offer to help them fix the Phantom."}, {"tag": "p", "text": "While making repairs, Syndulla asks Quarrie why he couldn't just transmit the plans for his ship to Rex rather than risk their lives to come to him. Quarrie says he won't just hand over his ship to any pilot and then asks why she risked her own life to come to his planet. Syndulla begins to tell him about her childhood. When the Clone Wars came to Ryloth, her mother hid her below ground but she would peek out to see the Republic ships fly over as they fought to liberate her world. She dreamt nothing more than to fly alongside with them. For freedom, Syndulla made difficult decisions when she chose to leave her family and learn how to fly. Then she chose to use her abilities to help others in need. Syndulla cannot explain it clearly to Quarrie, all she can say is she needs to be up there. Even when there are explosions all around her and things are at their worst, she feels like she's at her best. Touched by her words, Quarrie allows Syndulla to fly his ship. Meanwhile, Jarrus, Bridger, and Chopper arrive at a transport ship and pick up the remaining supplies for the people of Ibaar. Jarrus reveals to Ezra that unless Syndulla gets back they are going to transport the supplies with the Ghost, much to Bridger's concern as he knows the Empire will make them their primary target. Despite the dangers, Jarrus knows the people of Ibaar are counting on them and he is not willing to let them down."}, {"tag": "p", "text": "Back on Shantipole, Syndulla prepares the Blade Wing for take-off. When Wren and Orrelios learn from Quarrie that this will be the Blade Wing's maiden flight and there are chances it may not fly, it's too late to warn Syndulla as she takes off and goes down after the engines suddenly cut out. But then she emerges and takes to the sky. Syndulla flies the Blade Wing through the canyon without any further problems. She takes it for a climb and once high above the pillar forest she takes a dive. Then after passing Wren, Orrelios, and Quarrie, she begins testing the weaponry. Using a wrecked ship as a target, she fires the wing guns which don't cause much damage, despite being told it mastered great firepower. Quarrie instructs Syndulla to pull the leaver on her right which activates the Blade Wing's multi-cannon. She turns about and fires a huge blast of energy, destroying the wrecked ship in one shot. The Blade Wing passes a successful test flight and Syndulla flies it back to the landing field. Just then, they receive a transmission from Jarrus. Syndulla tells Jarrus the good news and also hears from him that they are going to commence their second attack on the blockade. The people of Ibaar are becoming more desperate and are at their breaking point. Syndulla says they need to move now but Wren has some bad news. She reveals that even though it still has the power to fight, the energy drain from the multi-cannon's firing system has killed the hyperdrive, leaving it unable to travel at lightspeed. Quarrie admits there are a few problems with the ship that need seeing too, but Syndulla knows there is no time for that as the fleet needs them. When Quarrie reveals that he upgraded the Phantom with a hyperdrive, Syndulla is delighted while everyone else is puzzled."}, {"tag": "p", "text": "Meanwhile, the rebel fleet arrives back at Ibaar and commence their second attack on the blockade. The Imperials discover the Ibaarians' supplies are aboard the Ghost and commence attack. Through heavy fire, the rebels noticed the cruisers are closing their path. They find themselves cut off, and Jarrus is just about to swing around and make another pass when Syndulla, Orrelios, Wren, and Quarrie emerge from hyperspace with the Blade Wing attached to the Phantom. The Blade Wing detaches and joins the fight. The Imperials detect the new vessel but Agent Kallus shows less concern about it. The rebels allow Syndulla and Wren to fly ahead, and once in sight of a target they fire the Blade Wing's multi-cannon, instantly destroying one of the Arquitens-class command cruisers. Agent Kallus is left speechless as the rebels successfully pass through the blockade and drop off their supplies for the people of Ibaar. With the mission completed, the rebels depart from Ibaar, leaving Agent Kallus defeated once again."}, {"tag": "p", "text": "Later on, Commander Jun Sato expresses his compliments to Quarrie's ship and tells him that Senator Bail Organa has found a shipworks willing to manufacture more of his B-wings in secret. Quarrie accepts as long as it's under his supervision. Syndulla also thanks Quarrie for all his help in saving the people of Ibaar, but Quarrie points out that it was actually her victory since she actually flew the ship. Commander Sato complements on Syndulla's heroics and surprisingly promotes her to Phoenix Leader, accepting Jarrus' recommendation."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}