{"url": "Wisper", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Humanoids", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Wisper"}, {"tag": "p", "text": "Wisper was the leader of the Ranc gang. He served Wenda and Bett before transferring his allegiance to Terex in 7 ABY. After Terex joined the First Order, Wisper led the Ranc gang. When Terex returned to take back control of the gang in 34 ABY, Wisper objected but was assassinated by one of his underlings, Zumgi. The Ranc gang then joined Terex in hunting for the Resistance starfighter pilot Poe Dameron."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wisper was a criminal who lived during the New Republic Era. He was a member of Wenda and Bett's Ranc gang, which doubled as a ship salvage and repair operation. In 7 ABY, he accompanied the Ranc gang and the former stormtroopers Terex and Corlac to the Rothana Imperial Shipyards. Wisper and the others watched as Terex used his technical expertise to unlock the Rothana Imperial Shipyards, allowing the gang to take over the shipyards and use them to build a pirate fleet."}, {"tag": "p", "text": "After Terex killed Corlac, Wenda and Bett for plotting to kill him, Wisper asked if their deaths had been caused by a misfire. Terex confirmed that it was not an accident and that he was taking control of the Ranc gang. Wisper and the others affirmed their allegiance to Terex. Wisper and Zumgi became Terex's lieutenants and helped him to manage the Ranc gang. Wisper was present when two alien pirates including a Rodian presented tribute to Terex including a set of First Order stormtrooper armor. Terex decided to join the First Order since he shared the organization's desire to rebuild the Old Empire."}, {"tag": "p", "text": "In 34 ABY, Terex returned to take control of the Ranc gang. He wanted to use the gang to destroy the Resistance and boost his status in the First Order. When Terex entered the Sliver's Level 72 and sat at his favorite table, Wisper and the rest of the gang greeted him. Wisper had received news of Terex's presence in the Sliver and welcomed him back. When Wisper asked what he was doing here, Terex replied that he had come to retake control of the Ranc gang. Wisper objected and tried to shoot Terex but Terex restrained him with his vibroblade."}, {"tag": "p", "text": "Wisper protested that Terex had given up the Ranc gang when he joined the First Order. Terex responded that he was a criminal and that Wisper was mistaken to have thought that he was no longer a criminal. When Terex asked if the rest of the Ranc gang would join him, Wisper tried to assert his leadership by claiming that he had made them rich. Zumgi then shot Wisper in the chest and reaffirmed the gang's loyalty to Terex."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wisper was a pale humanoid man with almond eyes and long white hair that went down to his shoulders. He wore a blue clothes and a black cape. Wisper wielded a blaster. He and the rest of the Ranc gang accepted Terex's coup. Wisper became one of his lieutenants. While Wisper made the Ranc gang rich, he never commanded the level of respect that Terex did."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wisper first appeared in the 2016 comic Poe Dameron 9, written by Charles Soule and illustrated by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}