{"url": "Winslau_Da%27k", "categories": ["Category:Legends articles", "Category:Fallen Jedi", "Category:Individuals of unspecified species", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Winslau Da'k"}, {"tag": "p", "text": "Winslau Da'k was a male Jedi student of a Master of the Jedi Order. Da'k was lost to the dark side of the Force after an encounter with Dark Lord of the Sith Darth Vader, and he imprisoned his old Jedi Master in a fortress on the Unknown Regions world of Morcanth."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive, Winslau Da'k was trained by a Jedi Master as a student in the ways of the Force."}, {"tag": "p", "text": "At the conclusion of the Clone Wars, the implementation of Order 66 killed the majority of the Jedi and effectively disbanded the Jedi Order. At some point afterward, Da'k encountered Dark Lord of the Sith Darth Vader, who corrupted him to the dark side of the Force unbeknownst to Da'k's master. The corrupted student surprised and overcame his master, and imprisoned him in an underground base on Morcanth, a planet located deep in the Unknown Regions in disputed space between three local warring species. Da'k lived a life of wealth and comfort in his fortress, which was also inhabited by a small entourage of servants and guards. The power-mad student incessantly assaulted the old Jedi Knight who had trained him, attempting to attain mastery over the man and gain knowledge before destroying him."}, {"tag": "p", "text": "Weakened by his student's assaults and desperate, Da'k's Master used the last of his diminishing power to reach out across space for help, touching the minds of a group of Force-sensitive individuals who experienced visions and dreams of him beckoning to them from Morcanth. Morcanth had been renamed on modern star-charts, and was thus a mystery to the group until they uncovered old charts that used the name. Upon journeying there, the group evaded the three warring races, neutralized Da'k's bevy of guards, and finally overcame Winslau Da'k himself, freeing the Dark Jedi's former master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}