{"url": "Beru_Whitesun_Lars_(short_story)", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Beru Whitesun Lars  (short story)"}, {"tag": "p", "text": "\"Beru Whitesun Lars\" is a short story in the anthology From a Certain Point of View. The story was written by Meg Cabot, and focuses on Beru Whitesun Lars."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following her and her husband Owen Lars' deaths at the hands of stormtroopers, the late Beru Whitesun Lars reflects on the role that her adopted nephew Luke Skywalker played in her life. She recalls bustling around the kitchen serving blue milk and haggling with Owen to let Luke attend the Imperial Academy. She speculates that if Owen had let Luke go, they would probably still be alive. She tells the reader that she took a cooking class in school and that the teacher had told her that her blue-milk cheese was the best she had ever tasted. Beru talks about her childhood dreams of setting up her own cafe or restaurant in Anchorhead. Beru then talks about how she and Owen struggled with infertility."}, {"tag": "p", "text": "The question of fertility treatments was resolved when Obi-Wan Kenobi arrived with an infant Luke in his arms. Beru regards taking Luke as the best decision of her life. She recalls that he was a \"sweet, happy little boy\" who was no trouble at all. Beru recalls seeing Luke grow into a nineteen-year old man and washing his leggings. Beru opines that Luke had too much of the best parts of his father in him. Beru also recalls that she was present at the funeral of Luke Skywalker's grandmother Shmi Skywalker Lars, where she served blue milk and cheese to everyone after. She also looks back on telling Owen that they were going to raise Luke as their own. Despite her and Owen's deaths, Beru rests comfortably with the knowledge that Luke Skywalker went off with Ben, met Princess Leia Organa, destroyed the Death Star, and saved the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}