{"url": "Beru_Whitesun_Lars", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Females", "Category:Humans", "Category:Moisture farmers", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Beru Whitesun Lars"}, {"tag": "p", "text": "Beru Whitesun Lars, born Beru Whitesun, was a human female from the planet Tatooine. She was married to Owen Lars, the stepbrother of Jedi Knight Anakin Skywalker, whose son, Luke Skywalker, they raised during the reign of the Galactic Empire. Lars was killed along with her husband by Imperial stormtroopers, who also burned down the Lars moisture farm. With their deaths, Skywalker left his homeworld and joined the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "During her youth, Beru Whitesun had a dream of setting up her own cafe or restaurant in Anchorhead. She had this dream because during her school years, she entered in a cooking class, and the teacher told Whitesun that her blue-milk cheese was the best he had ever tasted, prompting her to have such dream as the instructor said that it appeared that she was born to make blue-milk cheese."}, {"tag": "h3", "text": "Before the Empire"}, {"tag": "p", "text": "Whitesun eventually fell in love with Owen Lars, son of the moisture farmer Cliegg Lars, so they began dating. Shortly before the outbreak of the Clone Wars, Shmi Skywalker Lars, Owen's stepmother, was abducted by Tusken Raiders, an event that brought Anakin Skywalker, Shmi's son, and Senator Padmé Amidala, to the Lars moisture farm, where they were received by Cliegg. Skywalker arrived too late to save his mother, who passed away in his arms, prompting him to slaughter the Tuskens. When he returned, a funeral was held at the farm. During the funeral, Whitesun served blue milk and cheese to everyone."}, {"tag": "p", "text": "Three years later, Whitesun had already married Owen and taken on his last name. Both alone after Cliegg's death, Owen and Beru decided to have a child, but problems of infertility precluded them to have one, leading them to consider seeing one of the fertility droids at Mos Eisley. When the galactic conflict came to a close, Beru and Owen became the guardians of their new nephew, Luke Skywalker, after his father turned to the dark side of the Force and became Darth Vader and his mother died in childbirth. Obi-Wan Kenobi, the Jedi Master and friend of Anakin, delivered infant Luke to the Lars homestead. After receiving Luke, Beru told Owen that they would be raising his stepbrother's son as their own."}, {"tag": "h3", "text": "Raising Skywalker"}, {"tag": "p", "text": "For the next nineteen years, Lars and her husband raised Skywalker like a son. Lars would often defend Skywalker's interests against Owen, who was overprotective of him out of fear that he would follow in Anakin's footsteps and try to become a Jedi Knight. A year after the Great Drought, Owen was abducted by the Wookiee bounty hunter Black Krrsantan for unpaid water taxes to the Hutt crime lord Jabba Desilijic Tiure. Lars sought after her husband armed with a rifle, telling a nine year old Skywalker to stay safe within the homestead."}, {"tag": "p", "text": "In 2 BBY, Kenobi, following a brief confrontation with the former Sith apprentice Maul, visited the Lars moisture farm but watched from a distance. Kenobi heard Lars calling out to a seventeen year old Luke from within the homestead, and saw Skywalker running back toward the house against a binary sunset."}, {"tag": "p", "text": "By 0 BBY, Skywalker, now nineteen, wanted to explore the wider galaxy, having never left Tatooine. Though Owen refused numerous times to let Skywalker go when he wished to leave home and join the Academy, Lars convinced her husband to let Skywalker go after staying on for only one more season. This decision coincided with the aftermath of the theft of the Death Star plans and Darth Vader's capture of Princess Leia Organa over Tatooine."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Around this time, Skywalker and Owen purchased two droids from a Jawa sandcrawler that stopped by their homestead. These two droids were the protocol droid C-3PO and the astromech droid R2-D2, who were being hunted by the Empire. Before dinner, Skywalker cleaned the two droids in the garage where he found a message from Organa meant to be received by Kenobi. Skywalker told his aunt and uncle about this recording at the dinner table which prompted discussion about the relationship between Kenobi and Skywalker's father. Owen also discussed Skywalker staying another season on the farm, which Lars intervened and tried to reason with her husband that Skywalker shouldn't stay on the farm forever. In this conversation she likened Skywalker with his father, an idea that Owen was not fond of. After dinner Skywalker returned to the garage and found that R2-D2 had fled the homestead. The next morning Skywalker told Lars that he'd had some chores to do and went with C-3PO to look for R2-D2, who was secretly carrying the stolen Death Star plans. A concerned Owen could not find Luke, who was supposed to have the two droid to the south ridge by midday. He spoke to his wife about it, who told him that Skywalker had left early to complete some chores and that he had taken the two droids with him. While Skywalker was away, however, Imperial stormtroopers, who were searching for plans located in R2-D2's memory banks, were led to the Lars homestead by Owen's purchase of the droids from the Jawas. A squad of stormtroopers killed Beru and Owen and burned their home."}, {"tag": "h3", "text": "Post-mortem"}, {"tag": "p", "text": "Beyond from the realm of the living, acknowledging her and her husband's deaths, Lars reflected on the role that Skywalker played in her life, remembering herself bustling around the kitchen serving blue milk and haggling Owen to let their nephew attend the Imperial Academy. As she speculated that had Owen let Skywalker go, they could be still alive, Lars remembered various moments of her life, finally resting comfortably with the knowledge that Skywalker went off with Kenobi, met Organa, destroyed the Death Star battle station and saved the galaxy."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite the recent loss of his adoptive family, Skywalker did not grieve until soon after the battle, when his love interest, Nakari Kelen, was killed on the planet Omereth. Kelen's death provided Skywalker a moment to consider his losses, and he wept upon thinking of his uncle and aunt. Skywalker later returned to Tatooine to recover Kenobi's journal, which contained stories of the Jedi's few encounters with the Lars family."}, {"tag": "p", "text": "In the weeks after the Battle of Yavin, Darth Vader searched for the pilot responsible for destroying the Death Star, discovering that the pilot was the son he never knew he had. Vader, accompanied by Doctor Chelli Lona Aphra, revisited the abandoned homestead and followed Skywalker's trail. While assessing the destruction, Aphra speculated that Skywalker might have never left Tatooine, had his family been spared."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In contrast to her husband Owen, who was mainly gruff and cranky, Beru Whitesun Lars was warm. She loved her nephew who she regarded as her son in all but name. She always spoiled Skywalker every time she had a chance."}, {"tag": "p", "text": "Lars was a human female who stood at 1.65 meters. She had brown hair, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Clone Wars, Beru wore light robes in various shades of brown and blue."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Beru Lars has existed in one form or another since the rough draft of \"The Star Wars\" in 1974. In this draft, Beru and Owen Lars are anthropologists; there is also a character named \"Clieg Whitsun.\" In the 1975 version of the script, the Larses own a moisture ranch, but they are the parents of Skywalker's cousin, Leia. In a later version of this story, Beru protects Skywalker from violent outburst by Owen. However, by an early 1976 version, the character is finalized and the element of the Larses being killed by Imperial stormtroopers is added."}, {"tag": "p", "text": "British actress Shelagh Fraser was cast to play Aunt Beru in Star Wars. Fraser's first day of shooting was April 1, 1976; the shots of the Lars' charred skeletons were filmed a few days prior. When post-production on the film began, sound mixer Derek Ball traveled to Fraser's house and recorded additional dialogue. In the mono soundmix of the first release of Star Wars, different takes for Beru's lines were used. All subsequent home video sound mixes use the same take that was used in the initial theatrical Dolby mixes."}, {"tag": "p", "text": "In the 1981 National Public Radio Star Wars radio drama adapted by Brian Daley and directed by John Madden, Beru was voiced by Anne Gerety.[source?]"}, {"tag": "p", "text": "On July 7, 2000, StarWars.com announced that sixteen-year-old Australian actress Bonnie Maree Piesse would be playing the role of a younger Beru in Episode II. Piesse would approach Beru as being a little shy, the idea being that it was the introduction of Luke into her life that matured her. George Lucas wanted to make sure that Beru's costume was similar to the one worn in the first film to help establish a visual connection. Her wardrobe was also partially inspired by that of Skywalker's friend Camie in A New Hope. The first time fans would hear the name \"Beru Whitesun\" was in September 2000, when Lucasfilm began registering domain names featuring names of characters and other things from the upcoming film. This same month, Piesse and the crew were filming the Tatooine scenes in Tunisia. Lucas also filmed part of a scene for Episode III in which a stand-in actor playing Obi-Wan delivers baby Luke to Owen, played by Joel Edgerton. However, this would be changed during the Episode III shoot in September 2003. Lucas filmed Ewan McGregor handing the baby to Piesse, with Owen being played by a stand-in—Edgerton would be shot and added in almost a year later. Lucas made this change because he \"felt it would be better if Luke were handed over to a woman.\""}, {"tag": "h3", "text": "Deleted scenes"}, {"tag": "p", "text": "At least one shot of Beru did not make the final 1977 cut of Star Wars: before the family dinner scene, there is a shot of Beru filling a pitcher of blue milk from a dispenser in a portion of the kitchen not visible in the film. Also, a popular production still from the film reveals that the dinner scene was shot, or at least rehearsed, with the family members sitting in different seats than in the film."}, {"tag": "p", "text": "A more substantial Beru scene was cut from Attack of the Clones: after Anakin Skywalker returns to the farm with his mother's body, Beru helps Amidala prepare a meal, featuring blue milk, for Skywalker, having a short conversation with Amidala about Naboo and her own reluctance to travel. Nonetheless, this scene does appear in the film's novelization. A shot of Beru and the Larses waving goodbye to Anakin and Padmé was also shot but not used in the final film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}