{"url": "Wion_Dillems", "categories": ["Category:Canon articles", "Category:Alliance Fleet officers", "Category:Green Squadron personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wion Dillems"}, {"tag": "p", "text": "Wion Dillems was a human male pilot who served in the Alliance to Restore the Republic during the Galactic Civil War. During the war, Lieutenant Dillems served as Green Twelve after the spot was vacated by Puck Naeco."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wion Dillems was born in the wilds of Yelsain among the rustic Tree Dweller tribes in the dense forests. He, unlike his compatriots, was drawn to technology because he could fly at unbelievable speeds. He eventually joined the Alliance to Restore the Republic and became a rebel pilot on standby on the MC75 Star Cruiser Profundity. Dillems replaced Puck Naeco as Green Twelve, after the man injured his ankle in a rough landing. He came to fly with Green Squadron."}, {"tag": "p", "text": "At some point prior to 0 BBY, Dillems was scheduled Shift Cycle 3 of an X-wing flight patrol mission along with fellow pilot Lt. Attico Wred (Green Four). Their mission was to route from Yavin to Gordian Trace Relays, perform a flyby of surrounding space, then after verifying visual and sensor all clear, perform close uplink of passive relay recordings."}, {"tag": "p", "text": "Later, he took part in the Alliance's assault on the planet Scarif. During the battle, Green Squadron engaged Imperial starships above the Shield Gate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wion Dillems was portrayed by Dion Williams in the 2016 film Rogue One: A Star Wars Story, but his role was not listed in the credits. Dillems' helmet design resembles that of the helmet worn by Puck Naeco in A New Hope and Wes Janson in The Empire Strikes Back, as well as an unidentified Blue Squadron pilot in Rogue One."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}