{"url": "Wolff_Kalos", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles with gameplay alternatives", "Category:Alliance Military officers", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wolff Kalos"}, {"tag": "p", "text": "Wolff Kalos was a male Rebel Alliance officer who operated on Rori during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, Wolff Kalos was based on Naboo's moon of Rori. Serving under General Garax Hadriin, he was stationed in a small base in the jungle but spent most of his time working from the city of Narmle."}, {"tag": "p", "text": "Around 1 ABY, Wolff Kalos was involved in the hunt for Cal Handro, a missing pilot who had vanished after crash-landing on Rori. The smuggler was transporting a new kind of spice for the Rebel Alliance in the Naboo system when he crashed. He was thus wanted by the Black Sun criminal syndicate and the by Galactic Empire. Rebel Officer Veega Madish was originally tasked to rescue the pilot but the situation evolved when the Alliance discovered that Handro used to smuggle slaves for Imperial-aligned Trandoshan slavers. Wolff Kalos was ordered to capture the pilot, now considered as a traitor. Cal Handro had taken shelter at the estate of an old friend, the wealthy gambler Tierce Martano. However, he was finally found by Black Sun henchmen who attacked the estate. Martano contacted both Wolff Kalos and Imperial Officer M'Kae to negotiate the location of the pilot in exchange for help against the Black Sun."}, {"tag": "p", "text": "Before Tierce Martano could get an answer from Kalos or M'Kae, he was rescued by a group of spacers who eliminated all Black Sun forces. These spacers were recruited by Rebel Officer Madish to find the missing pilot. As Martano wished to get rid of Handro, he eagerly accepted to give the location of Handro to the spacers who contacted Wolff Kalos. The latter immediately sent agents to pick Cal Handro and transferred him to a Rebel Safe House. However, the Empire also got the information and promptly dispatched a group of mercenary to attack the building. Although the spacers arrived rapidly to help the Rebel forces, the pilot used the diversion to escape with a group of Imperial agents. Handro accepted the help of the Empire and eventually left Rori aboard a Warlord Heavy Cruiser."}, {"tag": "p", "text": "While Cal Handro was about to leave the Naboo system, Wolff Kalos dispatched the Rebel spacers to interrogate Officer M'Kae, Tierce Martano's Imperial contact, because they suspected him to be involved in Handro's escape. Since the Imperial officer was not eager to reveal anything, Kalos ordered his agents to attack a small Imperial Base on Rori where M'Kae was stationed in order to collect incriminating evidence on the Imperial officer. After a successful assault, that also resulted in the death of Imperial General Korra, M'Kae finally revealed that Cal Handro was about to leave the system to Kashyyyk. The spacers rushed to the nearest spaceport and launched in space to intercept Cal Handro's ship. Piloting their own starfighters, the spacers attacked the Imperial cruiser and its escort. Cal Handro eventually died in the explosion of the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wolff Kalos was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Wolff Kalos was added to the game with the fourth chapter of the \"Secrets of the Syren\" quest line, released with the \"Publish 21\", on August 4, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss."}, {"tag": "p", "text": "Due to the nature of some characters in Star Wars Galaxies, Veegoa Madish's appearance was randomized during each server reset. Therefore, the canonical species of Madish remains unidentified, though the character always appeared as a male."}, {"tag": "p", "text": "In the fourth chapter of \"Secrets of the Syren\", the player had to choose to side with either the Empire or the Rebels. The story diverged at this point since Cal Handro would always join the faction opposed to the player. With the Empire, the player would be working for Officer M'Kae and would have to force Wolff Kalos to reveal the location of Cal Handro, through bribery or by threatening Kalos's family."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}