{"url": "Witches_of_the_Mist", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Witches of the Mist"}, {"tag": "p", "text": "\"Witches of the Mist\" is the fourteenth episode of the Star Wars: The Clone Wars television series' third season. It aired on January 21, 2011."}, {"tag": "h2", "text": "Official summary"}, {"tag": "p", "text": "\"Anakin and Obi-Wan, sent to track down the mysterious figure behind the deaths of several Jedi, soon find themselves on the trail of the monstrous apprentice that Ventress has created: Savage Opress, who has been trained in the ways of the Sith by Dooku."}, {"tag": "p", "text": "Dooku sends Opress to Toydaria to capture King Katuunko. The monstrous apprentice clashes with the Jedi, and in the course of the battle he kills the king. Opress returns to Dooku's flagship having failed his Master. It is then that Ventress strikes, with Opress at her side, against Dooku. A three-way battle for dark side supremacy ends with Dooku triumphant, Ventress fleeing, and a disillusioned Savage abandoning his loyalties to the Sith. He returns to Mother Talzin, who gives him a new task. To seek the Outer Rim for his long-lost brother....\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Delta Squad returns to the Jedi Temple on Coruscant with the bodies of Master Halsey and his padawan Knox from Devaron after the Devaron massacre there and reports to the Jedi. Obi-Wan and the others immediately suspects the handiwork of another assassin in Count Dooku's employ, but the savageness with which the killings were performed mystifies them. Surveillance material recovered from Devaron finally reveals the face of the killer. Startled to see that this brutal warrior comes from the same stock as his long-dead enemy Darth Maul, Obi-Wan is sent to Dathomir by Masters Yoda and Windu to uncover the killer's origins."}, {"tag": "p", "text": "Obi-Wan and Anakin travel to the village where Savage Opress has been raised. Obi-Wan's hopes of solving the matter peacefully are dashed when a group of armed Dathomiri surrounds them, forcing them to resort to \"aggressive (but non-lethal) negotiations\" until Anakin takes the village headman, Brother Viscus, hostage. Viscus refers them to Mother Talzin of the Nightsisters, and the Jedi leave under a tense, but non-violent air for the witches' abode. Once there, the two are brought to Mother Talzin, who after some stalling reveals the name of their subject and where he can be found. With things running tight, Talzin assigns Ventress to join her servant and strike at Dooku immediately before the deception is discovered, even though Opress is not yet ready."}, {"tag": "p", "text": "Meanwhile, Count Dooku has begun training Opress in the skills of the Sith. Dooku proves to be a harsh taskmaster as he strives to stir Opress' rage and hatred in order to unlock the power of the Dark Side within him, torturing and agitating his disciple with demeaning criticism and Force lightning. After the first training has been completed, Dooku sends Opress on yet on another mission, this time to Toydaria: he is supposed to capture King Katuunko and bring him to Dooku alive."}, {"tag": "p", "text": "Opress storms the royal palace, slices his way through the Toydarian Guard and captures the king by rendering him unconscious. Anakin and Obi-Wan, having just arrived, try to stop him, but Opress pins them down, destroys their ship and escapes with Katuunko to the Count's Separatist frigate. However, while trying to stop Katuunko from getting away, Opress inadvertently kills him via Force choking, which enrages Dooku who starts angrily electrocuting Opress with Force lightning. Opress pleads with Dooku for forgiveness, to which Dooku replies that forgiveness is not the way of the dark side. Just then, Ventress enters Dooku's cabin and, after reasserting her control over Opress, they attack the Count in concert. However, during the fight Opress is repeatedly hit and weakened by Dooku's Force lightning, and as both Ventress and Dooku criticize him for his \"weakness,\" Opress snaps and turns against them both by choking them. Dooku escapes through an emergency hatch, with Ventress following him in pursuit, leaving Opress to face the two Jedi, who have followed him with a Toydarian ship."}, {"tag": "p", "text": "Weakened and outmatched, Ventress finally retreats in an escape pod, and Dooku sends his battle droids to eliminate Opress. The Jedi and Opress flee Dooku's ship. Wounded and despondent, Opress flees back to Mother Talzin, who sends him to find his long-exiled brother in the Outer Rim to train under his tutelage. With the promise to return yet more powerful, Opress departs for the Outer Rim."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The spar between Dooku and Opress ends with Dooku looming over his apprentice, positioning the two lightsabers at Opress' throat in a scissor-like formation. Dooku meets his demise in identical fashion in Revenge of the Sith."}, {"tag": "p", "text": "Delta Squad, having debuted in the Star Wars Legends video game Star Wars: Republic Commando, appears in this episode, marking the first appearance of a clone commando unit in the series. However, the game's voice actor for RC-1138, Temuera Morrison—who also played the clone troopers in the prequel trilogy and in some other products—did not return for the brief exchange of dialogue between the commando and Jedi. Instead, Boss was voiced by Dee Bradley Baker, who provided the voice for all other clone troopers in the Star Wars: The Clone Wars TV series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}