{"url": "With_You_Among_the_Stars", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Songs"], "nodes": [{"tag": "h1", "text": "With You Among the Stars"}, {"tag": "p", "text": "\"With You Among the Stars\" was a song by Plexo-33. By the time of the Galactic Empire, during or after 3272 LY and approximately five years before the Battle of Yavin, the song was considered to be an \"oldie.\""}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "\"With You Among the Stars\" was a ballad by Plexo-33 which some considered \"treacly.\" The first notes of the song featured a glissando that was recognizable to those who had heard it before."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The song was considered an \"oldie\" by approximately 3272 LY and five years before the Battle of Yavin. Merei Spanjaf, a Human female resident of the planet Lothal, hated the song. When she awoke one morning and heard her datapad playing \"With You Among the Stars,\" which she thought of as a \"treacly ballad,\" she was so irritated that she immediately launched herself out of bed to silence it as she immediately recognized the glissando. She then switched the music to a heavy-isotope remix."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"With You Among the Stars\" was described as being heard on the datapad of Merei Spanjaf, the girlfriend of the main character, Zare Leonis, in Servants of the Empire: Rebel in the Ranks. This 2015 novel is part of the Servants of the Empire series that serves as a side series to Star Wars Rebels, a Disney XD series that depicts the efforts of a resistance group against the Galactic Empire. Though the song itself is new to the Star Wars universe, Plexo-33, known as a band in text=Star Wars Legends but not described as such in Servants of the Empire: Rebel in the Ranks, appeared in sources such as \"Top-Selling Sound Slugs\" from HoloNet News Vol. 531 53 and Star Wars Galaxies: An Empire Divided in the Star Wars Expanded Universe. These are both now considered part of Star Wars Legends, making both sources no longer canon. Author Jason Fry considered the moment where Spanjaf silences \"With You Among the Stars\" to be a funny and revealing character moment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}