{"url": "Bes%27uliik", "categories": ["Category:Legends articles", "Category:MandalMotors products", "Category:Mandalorian starfighter classes"], "nodes": [{"tag": "h1", "text": "Bes'uliik"}, {"tag": "p", "text": "The Bes'uliik was a cutting-edge starfighter created by MandalMotors after the Yuuzhan Vong War, the first prototypes of which entered service with the Mandalorians in 40 ABY, during the Second Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A Bes'uliik was originally designed for a crew of three, or two with an increased weapons/fuel loadout, although the earliest production prototypes were flown by single pilots. The fighter was designed to be versatile, capable of being everything from a planetary-attack bomber to a long-range \"hunter-killer\". The spaceframe measured fifteen meters long, with a wingspan of a little over half its length. The hull was a plain, clean-lined \"V\"-shape with a squared-off tail and a dark gray finish with high-tech baffled exhausts to enhance its stealth capabilities. The four blasters and two additional weapons mountings were all located on the underside of the fuselage. The cockpit hatch hinged at the top for entry and the bottom edges for ejection, but there were also side hatches, and on the prototype, these bore the mythosaur logo stenciled in a lighter gray color. Inside, the cockpit made use of advanced display technology, and control systems that could be activated simply by where the pilot was looking. The fighter was also able to tilt vertically on its tail section, to land and take off in a tiny area, approximately eight-by-four meters."}, {"tag": "p", "text": "Late in the design process, the design was modified to add a protective layer of beskar armor, the legendary Mandalorian iron. The designers considered applying this as either as an outer skin or part of a laminated composite spaceframe. The initial prototype was completed with an ultra-thin beskar outer skin, but there was also some discussion of a heavier layer of solid hull armor. Although this would render the fighter heavier, there were also hopes that a new alliance with the Verpine engineers of the Roche asteroid field would extend to a technology exchange, enabling the designers to lighten the underlying spaceframe structure to compensate, or to improve fuel economy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Bes'uliik was originally designed as the Kyr'galaar, a name which seems to have meant \"death-hawk\" It was conceived after the Yuuzhan Vong War as a single development prototype combining all the new ideas being produced by MandalMotors designers—a necessarily economizing approach, as their energies were focused on reestablishing commercial production of existing designs. In 40 ABY, when a lode of beskar was found 100 kilometers north of Enceri, it was realized that the powerful armor could also be applied to the new fighter. This was originally hinted to Mand'alor Boba Fett by his lieutenant Goran Beviin soon after the discovery, and formally suggested by Jir Yomaget of MandalMotors when he showed Fett the new design shortly afterward. It seems to have been at around this time that the name was changed to Bes'uliik, or \"iron beast\", in honor of the ancient Basilisk war droids of the Mandalorians' warrior past (the name of which was Bes'uliik in the original Mando'a). Fett and Yomaget decided that, for export versions, the fighter's armor and capabilities would be significantly reduced, but half of the production run would be retained for \"defense\" of Mandalore and the Mandalore sector, with the full capabilities of the prototype, and possibly with even heavier armor."}, {"tag": "p", "text": "The first Bes'uliik was quickly completed and put into testing, and very soon after, four spaceworthy (and even combat-ready) prototypes were complete. At this point, these fighters were deployed as a combat flight, led by Fett in person, to destroy factories on Murkhana in a punitive raid on behalf of their Verpine allies—and also to display the new fighter's capabilities to potential buyers. The extent of Mandalorian confidence in the new fighter's abilities can be gauged by the fact that Fett gave Murkhana advance warning of exactly what they were going to target. At first Murkhana targeted the small group of ships with several squadrons of standard fighters. The defenders then realized how powerful the ships were, eventually having the entire fleet bombard the small group. Most of the shots ricocheted off harmlessly, allowing Fett and his team to easily accomplish the raid with little to no damage. Luke Skywalker piloted a Bes'uliik during the Battle of Uroro Station in 40 ABY against Jacen Solo's personal Star Destroyer."}, {"tag": "p", "text": "Several years later, several squadrons of the starfighter were contracted under the command of Mirta Gev to defend a monolith in the Chiloon Rift controlled by two Columi brothers. Some of them were destroyed by the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}