{"url": "BesGas_Three", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Bespin locations", "Category:Industrial facilities"], "nodes": [{"tag": "h1", "text": "BesGas Three"}, {"tag": "p", "text": "BesGas Three was a floating tibanna gas refinery that was located above the Outer Rim world of Bespin, built shortly before the outbreak of the Clone Wars. Fearing rebuke by the decidedly anti-droid citizens of the Galactic Republic during the Clone Wars, the droid workers of BesGas Three hijacked the refinery, taking it into the depths of Bespin's life zone, and erasing it from all data registries. For twenty-five years, the refinery and its inhabitants would go undisturbed."}, {"tag": "p", "text": "In 3 ABY, it was discovered accidentally by a droid named Spanner. As the droid workers of BesGas Three learned, the galaxy had not decided to outlaw droids following the Clone Wars. Hoping to return to civilization, the droids attempted to contact Cloud City, but their timing proved to be disadvantageous, as within hours, the Galactic Empire seized the floating settlement. In the process, the droids of BesGas Three were mind-wiped and absorbed into the Empire's own droid pool. In 36 ABY, the refinery became involved in a siphoning scandal involving the Dark Nest."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "BesGas Three was made up of a large saucer-shaped platform, which featured a large tower that ran through the center, and many storage tanks. The central tower housed the habitation and storage decks. To harvest the tibanna gas from Bespin's atmosphere, BesGas Three used multiple intake fans, which would freeze over time. Other maintenance problems included clogged transfer pipes, which needed to be cleaned out manually."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Fleeing possible retribution"}, {"tag": "p", "text": "BesGas Three was a tibanna gas refinery that was built just prior to the pan-galactic Clone Wars. When the wars broke out, strong anti-droid sentiments wracked the Galactic Republic, due to the use of droid armies by the Confederacy of Independent Systems. Fearing for their own survival, a group of labor droids working on the refinery hijacked the station and took it down to the lower levels of Bespin's life zone, the area of the planet's atmosphere where a number of native species lived. The droids feared that if the Republic won the war, droids would be outlawed throughout the galaxy."}, {"tag": "p", "text": "When the Confederacy attacked Bespin, independently operated harvesting platforms such as BesGas Three were neutralized, as the invaders hoped to commandeer the facilities for their own use. BesGas Three itself was thought to have been destroyed in the carnage, but in reality, the droids had erased the refinery from all data registries."}, {"tag": "h3", "text": "Re-emergence"}, {"tag": "p", "text": "BesGas Three remained hidden until 3 ABY. In the twenty-five years since its \"disappearance,\" the labor droids had lived in peace, constantly tweaking the refinery and, due to the high pressure in the low areas of the Life Zone, performing constant maintenance upon one another. The droids had no idea of the state of change that the galaxy had experienced over the years, until an LE-series repair droid named Spanner stumbled upon BesGas Three. Spanner had fled Cloud City following a droid revolt instigated by EV-9D9, and was heading for Tibannopolis before reaching BesGas Three accidentally."}, {"tag": "p", "text": "The BesGas Three droids learned from Spanner that their predictions had been inaccurate, and that droids were still widespread in the galaxy. Acting upon their new information, the droids brought BesGas Three into close proximity of Cloud City, in the hopes of re-establishing contact. Their timing, however, was disadvantageous—only hours later, the Galactic Empire annexed Cloud City and assimilated the BesGas Three droids into their own pools, issuing mind-wipes in the process. BesGas Three once more was refining gas, but this time under the Imperial banner."}, {"tag": "p", "text": "BesGas Three continued to operate for decades. In 36 ABY, Verpine tappers under the influence of the Dark Nest, an aggressive and violent faction of the Killik species, came to BesGas Three and siphoned a considerable amount of tibanna gas from its reserves for profit. Jedi Knights Jaina Solo and Zekk, who were investigating the multiple reports of gas siphoning, caught the tappers in the act. After a small dogfight that resulted in the blackout of several residential decks of BesGas Three, Solo and Zekk chased the tappers away from the refinery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BesGas Three made its first appearance in Troy Denning's Dark Nest II: The Unseen Queen, where it served as a location for the book's opening. Eventually, BesGas Three was given a backstory by Tyler Fisher, through StarWars.com's \"What's The Story?\" feature. The original submission form identified BesGas Three as the refinery that had made its first appearance in the 1997 Special Edition release of Star Wars: Episode V The Empire Strikes Back. It was in turn based on an original concept drawing by Ralph McQuarrie, which went unused in the original 1980 cut of the film but was then salvaged for the later re-release. McQuarrie's art was showcased in 1995's The Illustrated Star Wars Universe. The Databank entry for BesGas Three would also use McQuarrie's original concept art as an illustration. Fisher initially found the prospect of writing about a refinery daunting, but when he noticed how unusually close it was to Cloud City, he decided to set about explaining just why it was there in The Empire Strikes Back."}, {"tag": "p", "text": "His initial idea was that BesGas Three contained the brain of one of IG-88's sleeper drones, who, when detecting IG-88B on Cloud City, would be drawn to its master. Fisher dispensed with the idea, however, and began researching the Databank entries for Lando Calrissian, Cloud City, and Bespin. In Calrissian's entry, he discovered that the character had initially been written as a clone trooper who had survived the Clone Wars. Remembering that Bespin was the site of a battle from the Clone Wars, he took inspiration from Calrissian's original concept and decided to tie BesGas Three to the earlier conflict. His initial idea was to have the platform populated by clones, but rejected the idea due to several reasons, including the platform's living conditions and lack of food, as well as a lack of motivation on the part of the clones."}, {"tag": "p", "text": "Settling on the idea of droids populating the platform, Fisher then found himself having to come up with a reason for them to come out of hiding at the time of The Empire Strike Back. He remembered that in A Bad Feeling: The Tale of EV-9D9 from Tales from Jabba's Palace, the character EV-9D9 had created chaos for droids residing on Cloud City, and supposed that one droid fleeing Cloud City would be able to come across BesGas Three. Fisher's original droid character, \"Spanner,\" was made a LE-series repair droid, as he believed that the model had not been seen much outside the Shadows of the Empire multimedia project. Originally, Fisher's entry left the fate of the droids unknown, but the StarWars.com authors altered this, and had them mind-wiped by the Empire. The tidbit about Jaina Solo and Zekk's exploits at the end of the entry was also added by the editors, as Fisher did not see any point in recounting the events of The Unseen Queen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}