{"url": "Bes%27bev", "categories": ["Category:Legends articles", "Category:Edged weaponry", "Category:Mandalorian weapons", "Category:Wind musical instruments"], "nodes": [{"tag": "h1", "text": "Bes'bev"}, {"tag": "p", "text": "A bes'bev was a traditional Mandalorian flute. Forged from beskar iron, a bes'bev was a combination of musical instrument and melee weapon. At one end, a bes'bev was cut to a sharp tip, similar to a quill stylus, and this bladed end made the instrument ideal for stabbing and drawing blood. A bes'bev was also hard and sturdy, and could be hefted as a club should the need arise."}, {"tag": "p", "text": "By the year 20 BBY, the Mandalorian soldier Wad'e Tay'haai had come into possession of an ancient bes'bev. Tay'haai's flute was colored the same dark violet as the plates of his Mandalorian armor, and he took to carrying the instrument on his belt. Tay'haai was a skilled bes'bev musician, and knew how to play a number of songs with the instrument, including the traditional tune Vode An. In 19 BBY, at the home of his former Cuy'val Dar contemporary Kal Skirata, Tay'haai performed for the Skirata clan, and encouraged Skirata's adopted son Bardan Jusik to give his bes'bev a try."}, {"tag": "p", "text": "During the reign of the Galactic Empire, the underground musical group known as Boba Fett and the Assassin Droids came into possession of a bes'bev, incorporating the instrument into their performances. While on a promotional tour for the release of their first album, the group came to blows with their opening act, fellow band Dead Rebels. In the midst of Dead Rebels' rendition of \"Death Star Diva,\" their lead singer was struck and rendered unconscious with the bes'bev by a member of Boba Fett and the Assassin Droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The bes'bev was first introduced to the Star Wars universe in the Republic Commando novel Order 66, authored by Karen Traviss and published September 16, 2008. The Mandalorian instrument appeared again in Traviss' subsequent novel, Imperial Commando: 501st. In 2014, a bes'bev was mentioned in Edward Erdelac's StarWars.com blog entry Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}