{"url": "Womp_rat/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Food creatures", "Category:Non-sentient species", "Category:Omnivorous creatures", "Category:Rodents", "Category:Saprophagous creatures", "Category:Scavenger creatures"], "nodes": [{"tag": "h1", "text": "Womp rat"}, {"tag": "p", "text": "Womp rats were large, omnivorous rodents native to Tatooine, widely considered to be pests. They were slightly larger than two meters in size. There were three species of womp rats: ones that lived in Beggar's Canyon, ones that lived in the Jundland Wastes, and swamp womp rats. It was not unheard of for people to have domesticated womp rats as pets, but Luke Skywalker and his friends used to \"bulls-eye\" womp rats while flying T-16 skyhoppers, for fun and target practice."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "While womp rats were opportunists and fond of carrion and refuse, they were also predators, though most of their prey were old, sick, or generally weak. Their normal prey included smaller animals, such as profoggs and Scurriers. Womp rats traveled in packs to overwhelm larger prey items, such as Dewbacks and Banthas. These packs consisted of up to 20 individuals. When they bite, their teeth set in and the animals will not release their hold, even if they are killed; Owen Lars had seen a bantha with a desiccated womp rat skull still biting down on it."}, {"tag": "p", "text": "With lengths of up to 3 meters, womp rats were vicious, mean mammals, and were often used for target practice. Some womp rats on Tatooine were prone to Gray Rot."}, {"tag": "p", "text": "Womp Rats were also very fast and stealthy. They could have had the ability to cloak themselves with the Force since Ki-Adi-Mundi and Aurra Sing both found out that they could barely sense them with the Force aiding them."}, {"tag": "p", "text": "Easy targets were sometimes called \"sitting womp-rats\"."}, {"tag": "p", "text": "Given its repugnant bestial qualities, it therefore may be somewhat surprising for some to learn that a popular flavor of soup on Tatooine was \"Cream of Womprat soup\", often prepared by Beru Whitesun Lars."}, {"tag": "p", "text": "The Jundland Wastes womp rat appeared shortly after Imperials arrived on Tatooine, and some have speculated it was a mutated form of the Beggar's Canyon womp rat, affected by chemicals from Imperial waste dumps. Some of its mutations include a larger size, slower reproduction rate, and lower numbers than Beggar's Canyon womp rat. Their ears are also elongated and winglike."}, {"tag": "p", "text": "Another variety, the swamp womp rat, was found on a few fringe worlds as well as on Cularin."}, {"tag": "p", "text": "The Grunge fever disease was known to be spread by womp rats."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, as he led the Ghostling children to freedom through Mos Espa's subterranean sand drains, young Anakin Skywalker was attacked by a womp rat. Anakin knew its unmistakable growl from his time working in Watto the Toydarian's junkyard, knew that the foul creature could grow to be as big as a man and could carry off children and full-grown Jawas. But by using the same beamdrill that he employed to break his friends Kitster, Pala, Dorn and the Ghostlings out of their Mos Espa Grand Arena cells (as they awaited their execution by Gardulla the Hutt), the fledgling hero was able to overpower the vermin. By setting the tool's plasma beam for a long, narrow ray, the beamdrill shot forth a searing white stream of superheated gas like a flamethrower, slicing the womp rat in two."}, {"tag": "p", "text": "The Beggar's Canyon womp rat reproduced at an alarming rate. Once it reproduced to such a point that the population could not be kept in check, and womp rats were hunting Jawas and raiding storehouses. The Imperial prefect of Tatooine and the Affiliated Moisture Farmers then passed a bounty ordinance of ten credits per rat. Luke Skywalker and his friend Biggs Darklighter got enough womp rats to upgrade their T-16 skyhoppers and have enough money for the Academy."}, {"tag": "p", "text": "After the Battle of Yavin, Animal Control officer Entha Kandela tasked a spacer to eliminate womp rats around Mos Eisley to prevent propagation of grunge fever in the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Mutant Womprat appears in the game Super Star Wars as boss of Level 6: Land of the Banthas, fought by Luke Skywalker. The creature was accompanied by several smaller Womp Rats."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Rogue Squadron II: Rogue Leader, the player must play a minigame in the training session where they strafe womp rats."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}