{"url": "Wolfpack/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Wolfpack"}, {"tag": "p", "text": "The Wolfpack was a clone trooper squad in the Grand Army of the Republic's 104th Battalion that served under Jedi General Plo Koon and Clone Commander Wolffe during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Members of the Wolfpack became reputed for being experts at difficult extractions under fire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Wolfpack's members included Marshal Commander Wolffe, Sergeant Sinker and Sergeant Boost. Following the attack on the Venator-class Star Destroyer Triumphant by the Malevolence in the Abregado system, Plo Koon, Wolffe, Sinker, and Boost were trapped in an escape pod and fought off battle droids searching the wreckage for surviving clones. They were saved by General Anakin Skywalker and Commander Ahsoka Tano."}, {"tag": "p", "text": "Due to the loss of so many members at the Battle of Abregado, Wolffe and the other members of the Wolfpack changed the color of their armor from a rusty red to a dark grey blue, to honor their fallen brothers with a melancholy color. The Wolfpack also changed their symbol to more match the markings on Wolffe's helmet."}, {"tag": "p", "text": "Soon after the Battle of Abregado, the surviving members of the Wolfpack donned Cold Assault Gear and participated in the Battle of Khorm. After the battle, Wolffe received reinforcements to replenish the Wolfpack's numbers."}, {"tag": "p", "text": "After the addition of new recruits, the Wolfpack helped Koon and Tano rescue Generals Skywalker and Mace Windu from the collapsing bridge of the Star Destroyer Endurance on Vanqor following Boba Fett's sabotage of the cruiser."}, {"tag": "p", "text": "Later, two members of the Wolfpack, Wolffe and Comet, helped in the rescue mission to Lola Sayu, to retrieve Koon, Anakin Skywalker, Tano, and the other survivors of the raid on the Citadel. They later participated in the Second Battle of Felucia with Koon, Skywalker and Tano."}, {"tag": "p", "text": "Later in the war, the Wolfpack was sent on a relief effort to the planet Aleen where catastrophic groundquakes had inflicted mass casualties among the natives. Soon after, they participated in the rescue of Jedi Master Adi Gallia from the hands of General Grievous."}, {"tag": "p", "text": "They later were sent to Kadavo to rescue Jedi Obi-Wan Kenobi, Anakin Skywalker, Ahsoka Tano and the kidnapped Togrutan slaves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}