{"url": "World_Between_Worlds", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Force planes"], "nodes": [{"tag": "h1", "text": "World Between Worlds"}, {"tag": "p", "text": "The World Between Worlds, also known as Vergence Scatter, was a mystical plane within the the Force that served as a collection of doors and pathways existing between time and space, linking all moments in time together."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Chain Worlds Theorem, visualized in the Jedi sacred texts and written by an unattributed figure, described the World Between Worlds."}, {"tag": "p", "text": "The World Between Worlds was accessible from the ancient painting of the Mortis gods that decorated the exterior of the Lothal Jedi Temple. Loth-wolves were intrinsically tied to the realm and could traverse through it in a manner similar to hyperspace travel. Sith follower Minister Veris Hydan of the Galactic Empire believed that gaining access to the World Between Worlds would give one control of the universe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the discovery of the Jedi temple on Lothal, the power-hungry Sith Lord Darth Sidious, ruler of the Galactic Empire, deployed Minister Veris Hydan with the Imperial Military to the site in search of an entryway to the World Between Worlds in his lust for power."}, {"tag": "p", "text": "The Sith's designs were thwarted when the Jedi Padawan Ezra Bridger discovered world's key, and was able to unlock and enter the World Between Worlds first. After saving Ahsoka Tano from the past by pulling her into the realm, Bridger became adamant in also changing the fate of his master, Kanan Jarrus. However, Tano reasoned with the Padawan that they would all be dead without Jarrus' selfless sacrifice, telling Bridger that she understood the pain of being unable to save one's master, citing her own experiences, and taught Ezra Bridger to let go. Turning away, the pair resolved to close the portal to the realm to prevent others from accessing it, only to encounter Darth Sidious, who tried to enter the realm using the Force users. Bridger and Tano, however, were able to return to their own times, with Bridger closing the portal and causing the Lothal temple to collapse, taking Hydan with it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The world between worlds was created for the Star Wars Rebels television series. It was identified in the season four episode \"A World Between Worlds.\" While developing the world between worlds, Rebels showrunner Dave Filoni had conversations with Star Wars creator George Lucas about it. During the Star Wars Rebels Remembered panel at Celebration Chicago in April 2019, Filoni confirmed that the concept for the world between worlds had been inspired by the Wood between the Worlds in C.S.Lewis' Chronicles of Narnia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}