{"url": "Wooof/Legends", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Kadas'sa'Nikto", "Category:Males", "Category:Pilots", "Category:Slaves", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Wooof"}, {"tag": "p", "text": "Wooof was a male Kadas'sa'Nikto smuggler in the employ of Jabba Desilijic Tiure, working as one of the crime lord's best pilots on the planet Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Nikto smuggler of the Kadas'sa'Nikto subspecies, Wooof served the Hutt crime lord Jabba Desilijic Tiure, honoring his species' ancient contract of voluntary enslavement to the Hutts."}, {"tag": "p", "text": "Wooof was one of Jabba's best pilots, and often flew the Hutt's space yacht the Star Jewel, though Wooof himself was more comfortable behind the controls of a starfighter. The Nikto pilot also served Jabba as a skiff guard, in his palace, and aboard his sail barge the Khetanna."}, {"tag": "p", "text": "In 4 ABY, Wooof was present in Jabba's court on Tatooine for the arrival of Jedi Knight Luke Skywalker, watching as he petitioned the Hutt for the release of his Rebel compatriots. When Skywalker was captured and sentenced to death, along with his allies, in the Great Pit of Carkoon, Wooof observed the execution from the lower deck of the Khetanna, taking refreshments served by the Jedi's astromech droid R2-D2. As Skywalker escaped and boarded the sail barge, Wooof rushed to the upper deck, charging the Jedi Knight alongside the Gamorrean Thok, and was struck by his own blaster fire, deflected back at him by his opponent's lightsaber."}, {"tag": "p", "text": "Some time later, Wooof was killed by the explosion of the Star Jewel near the Pit of Carkoon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to Leland Chee, the Kadas'sa'Nikto, in the Throne Room, wearing the Kama-like fur clothing was originally named Klaatu (an original production name), but has since been renamed Wooof by Decipher. On July 6, 2011, Chee revealed that Wooof and Klaatu are separate characters, in his Keeper of the Holocron blog on Facebook.com."}, {"tag": "p", "text": "Klaatu was named for Klaatu barada nikto, a phrase from the 1951 film The Day The Earth Stood Still. \"Klaatu\" is the name of the humanoid alien protagonist in the film."}, {"tag": "p", "text": "The \"Klaatu\" action figure made by Kenner in 1983 is based on Wooof's likeness. In the same year, Kenner also produced a \"Klaatu (in Skiff Guard Outfit)\" action figure which bears the likeness of the real Klaatu. The two characters are in fact different. Wooof wears Kama-like fur clothing while Klaatu wears white coveralls. A new Wooof action figure, bearing the correct apparel, was included as part of the 2010 Hasbro lineup."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}