{"url": "Wookiee_collaborators", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Wookiee culture", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Wookiee collaborators"}, {"tag": "p", "text": "Wookiee collaborators were those Wookiees who had aligned themselves with Chuundar, the Chieftain of Rwookrrorro Village before and during the Jedi Civil War and the opening skirmish of the Rebellion on Kashyyyk."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to ascending to the post of leader of his village, Chuundar helped Czerka Corporation gain a foothold on the Wookiee homeworld of Kashyyyk, where they established a trade in selling Wookiees into slavery. When Zaalbar, his younger brother, found out about his activities, he attacked Chuundar with his claws. Branded a madclaw by the laws of his people, the younger Wookiee attempted to reveal what was going on, but their father, Freyyr, who was then the leader of Rwookrrorro, did not believe him as a result of his dishonor, but also because, according to tradition, he believed the elder boy. As a result, Zaalbar was banished from his home, where he was soon captured by Czerka."}, {"tag": "p", "text": "Some twenty years later Zaalbar returned, accompanied by the amnesiac Revan, to whom he had sworn a life debt. By this time Czerka Corporation was well established on what it called Edean, having secured a steady supply of Wookiee slaves thanks to their alliance with Chuundar, who had by then spread lies about his father's madness. When Freyyr found out that his younger son had been telling the truth, he too attempted to reveal Chuundar's treachery, but by then he had no allies. The elder Wookiee was cast out of his leadership role, which was taken over by his son, backed by allies within Czerka. Forced to flee, Freyyr made his way to the Shadowlands, where the ex-Jedi Jolee Bindo helped him to \"lose his pursuers.\" There he stayed, until Revan and Jolee found him again. Explaining the current situation to him, Revan convinced the former chieftain to once more challenge his son and reclaim Kashyyyk for the Wookiees, having secured for him the severed blade from Bacca's Sword from the hide of a terentatek."}, {"tag": "p", "text": "The situation came to a head when, in the throne room of Rwookrrorro Village, Freyyr, Revan, Jolee and Zaalbar confronted Chuundar, his Czerka allies, and his Wookiee collaborators. In the wake of the fierce melee and firefight that followed, Chuundar lay dead, leaving his father to reclaim the title of Chieftain. Those who had followed Chuundar now followed Freyyr instead, and so began the Wookiee Rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Within the game Star Wars: Knights of the Old Republic, Revan and his party encounter several sets of Wookiee collaborators on Kashyyyk. All that are not killed presumably switch their allegiance, becoming Wookiee Rebels as they wrest control of their world from the Czerka Corporation."}, {"tag": "h2", "text": "Appearances"}]}