{"url": "Wooly", "categories": ["Category:Legends articles", "Category:Named pets"], "nodes": [{"tag": "h1", "text": "Wooly"}, {"tag": "p", "text": "Wooly was a domestic draught animal, found by Master K'Kruhk on Arkinnea, while he together with Master Zao, Padawan Chase Piru and a group of younglings from the Soaring Hawkbat Clan were escaping from the Arkinnea Militia. Having left a refugee camp where, as Master Zao sensed, there was an unknown danger, the Jedi headed for the uninhabited lands. As they wouldn't have been able to escape fast enough on foot, K'Kruhk took a draught animal and a wagon at one of the farms. The younglings liked the animal at once and named it Wooly."}, {"tag": "p", "text": "In the wagon the group made their way into the mountains, with Piru driving, pretending to be a local farmer, and the others hiding inside the wagon. They managed to successfully pass a militia patrol, but in the mountains they were spotted by the pilots of an ore carrier, also belonging to the Arkinnea Militia. K'Kruhk cut the yoke with his lightsaber and rode on Wooly's back to draw the pursuit away from the others. The ore carrier chased him with members of the militia shooting at him from the hatch. K'Kruhk was riding through the forest, hiding from their shots among the trees, and then stopped and diverted the carrier's course with the Force, so that the transport touched the ground and exploded. Seeing that another militia's ship was approaching, K'Kruhk sent Wooly in one direction and walked on foot in another direction to throw the pursuers off his track. Meanwhile, Zao, Piru and the younglings met a group of Arkinnea natives called Yunu, who recognized them as Jedi and showed them the way to the ruins of an abandoned Jedi outpost."}, {"tag": "p", "text": "After some wandering about the forest, Wooly found the way to his new owners as well, to the great joy of the younglings. Some days later they were joined by K'Kruhk and established a secret settlement in the old temple, keeping Wooly with them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}