{"url": "Besalisk", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Besalisks", "Category:Deep Core species"], "nodes": [{"tag": "h1", "text": "Besalisk"}, {"tag": "p", "text": "Besalisks were a humanoid sentient species with four arms and an inflatable wattle that were native to the planet Ojom. Dex's Diner owner and friend of Jedi Knight Obi-Wan Kenobi, Dexter Jettster, was a Besalisk, as was Pong Krell, a Jedi Master who fell to the dark side of the Force after having a vision of the Jedi's demise during the Clone Wars."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Besalisks were a sentient species of humanoids with four arms. The superior arms dominated over the inferior ones. They could average in height between 1.88 and 2.36 meters and had skin ranging from green to brown. Their large hands and feet both ended in four digits and large brown nails. Besalisks were thick-set, and could have bloated stomachs. Besalisks also possessed a bony, three-pronged headcrest and an inflatable wattle. They had wide mouths, and some Besalisks had large, pudgy lips, though not all. Besalisks could sport black or brown hair on both their faces and their heads and could have yellow eyes. At least one Besalisk was known to be Force-sensitive."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Besalisks were known to be industrious and hardworking. A Besalisk saying was \"If your neighbors trouble you, send your rodents to their nest\"."}, {"tag": "h2", "text": "Besalisks in the galaxy"}, {"tag": "p", "text": "Around the start of the Clone Wars, Dexter Jettster was a Coruscant diner owner and friend of Jedi Knight Obi-Wan Kenobi. During this time, he successfully identified a Kamino saberdart to Kenobi, characterizing them by the cuts on their side due to his days as a prospector. He went on to inform Kenobi about the Kaminoans who were reputable cloners and kept to themselves but were welcoming to those who brought credits."}, {"tag": "p", "text": "During the Clone Wars, Pong Krell was a Jedi Master known for his reputation as a successful general and for having the highest casualty rates of clone troopers under his command. Prior to the Battle of Umbara, he foresaw the demise of the Jedi Order and the Republic. He immersed himself in the dark side in order to survive and he attempted to sabotage the campaign, sending his clones on strategically inept missions, so he could become the Sith apprentice of Separatist leader Count Dooku. However, this was revealed by the clone troopers of the 501st Legion after he sent them against their fellow clones, claiming they were Umbarans disguised as clone troopers. He proceeded to cut down multiple clones with his double-bladed lightsabers but was stunned by clone trooper Tup. He was later executed by another clone, Dogma."}, {"tag": "p", "text": "By the time of the Galactic Empire, a Besalisk subcommunity existed on the planet Gorse. This included Drakka, owner of Drakka's Diner, Lal Grallik, enterprising chief of Moonglow Polychemical, a mining and refinery company, and her husband Gord Grallik, the security chief. Both Gralliks were murdered by Denetrius Vidian of the Empire."}, {"tag": "p", "text": "At the same time, several Besalisks worked for Vidian at Calcoraan Depot on the planet Calcoraan."}, {"tag": "p", "text": "Later during the Empire's reign, Galus Vez was a starship parts dealer who owned the space station Osisis Station. He worked with the Spectres from Lothal until he no longer wanted to be associated with them when Imperial inspections of his station increased. When they visited again, Vez refused to sell them the parts they needed and chose to challenge the groups pilot, Hera Syndulla, to a race. Should Syndulla win the race, Vez promised to hand over the parts, but should he win, then Vez would take the rebels' ship. Syndulla raced him in the race and won, but Vez attempted to capture the rebels anyway. However, the Spectres anticipated this, and the group destroyed one of Vez's cargo vessels and used it as a distraction to disarm him and take out his men. They then forced Vez to hand over what they needed."}, {"tag": "p", "text": "Snes worked as muscle at Club Deeja, an entertainment establishment in the city of Keren on the planet Naboo, as well as at least two other Besalisks, one which was green skinned, and another whose skin was brown. Shortly after the Battle of Yavin, the club's owner, Mul Sanaka, tried to set a trap for the Alderaanian Princess Leia Organa within his club. Snes was given the job of disarming the princess and her companions before leading them inside. However, Snes accidentally revealed the trap to Organa, resulting in the princess attacking her and eventually defeating her and Sanaka."}, {"tag": "p", "text": "During the Galactic Civil War, Gadren was a Besalisk who served as a member of the Alliance to Restore the Republic's 61st Mobile Infantry. During the Siege of Inyusu Tor, he lost one of his four arms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Besalisks first appeared in the 2002 film Star Wars: Episode II Attack of the Clones through Dexter Jettster. They were never identified on-screen but were named in the Star Wars Legends book Star Wars: Attack of the Clones: The Visual Dictionary, also from 2002, by David West Reynolds (author). For Attack of the Clones, actor Ronald Falk was filmed for Dexter Jettster's scenes, digitally removed, and Jettster was replaced, made entirely with computer-generated imagery."}, {"tag": "p", "text": "Sometime during the production of Attack of the Clones, the Lucasfilm art department had created multiple alien models in the hope one would go on to become Jettster. Inspected by director George Lucas, he narrowed it down to two possible models. Asked for his opinion, Visual effects supervisor John Knoll preferred a different model, that looked similar to Besalisks, stating animation possibilities for its wattle. Lucas then suggested combining the top of one of the models he chose with the rest of the head of Knoll's preferred model. This became the Besalisk species. Many of the unused models became other species, such as Skakoans."}, {"tag": "p", "text": "Concept art for Star Wars: The Clone Wars exists depicting Besalisk Jedi Master Plun Kil. The artwork was created by lead character designer Kilian Plunkett and was intended for the second season of the show, though it ultimately did not appear."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}