{"url": "World_Brain", "categories": ["Category:Legends articles", "Category:Named creatures"], "nodes": [{"tag": "h1", "text": "World Brain"}, {"tag": "p", "text": "The World Brain, known as pazhkic Yuuzhan'tar al'tirrna in Yuuzhan Vong, was a dhuryam tasked with overseeing the Vongforming of Coruscant during the Yuuzhan Vong War. Thirteen dhuryams were bioengineered by Master Shaper Ch'Gang Hool in 27 ABY, and each were given a domain aboard the Seedship. Using hordes of telepathically-controlled slaves, the dhuryams competed to manage the growth of their domain, knowing that only the most successful dhuryam would be chosen to become the World Brain."}, {"tag": "p", "text": "The young Jedi Knight Jacen Solo proved a defiant slave to one of the dhuryams, resisting its commands. The stubborn dhuryam vainly began a bitter campaign against Solo, to the detriment of its domain, which fell behind its competitors. Out of necessity, the dhuryam compromised with Solo, allowing him to do as he pleased once it benefited the domain. Solo ultimately helped the dhuryam wipe out its competition, killing its twelve rivals on the day the World Brain was to be selected. Solo also attempted to murder his own dhuryam, only to be foiled by the Yuuzhan Vong ally Vergere. With no other alternative, the Yuuzhan Vong installed the surviving dhuryam in the World-Well on Coruscant, and it began to coordinate the planet's terraforming. However, Jacen Solo later convinced the World Brain to intentionally sabotage the project and frustrate the Yuuzhan Vong."}, {"tag": "p", "text": "The World Brain performed Solo's mandate diligently until Supreme Overlord Shimrra brought it into line. When Solo and the Galactic Alliance attacked Coruscant, the World Brain again sided with its old ally, helping to defeat Shimrra. After the war's conclusion, the World Brain agreed to help the Galactic Alliance undo the Yuuzhan Vong's changes to Coruscant. It was accidentally killed by Alema Rar over ten years later, having left the World-Well for fear of assassination by Bothan anti-Yuuzhan Vong extremists."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Nursery"}, {"tag": "p", "text": "After the Yuuzhan Vong species fled their galaxy, they took with them genetic samples of creatures known as dhuryams from their long lost homeworld, Yuuzhan'tar, preserving them for millennia. Related to yammosk war coordinators, the dhuryams were fully-sentient telepathic overseers, who could mentally meld many various elements to direct the worldshaping of a planet. In 28 ABY, the Yuuzhan Vong conquered the world of Coruscant in their new galaxy, and wished to terraform it to resemble their erstwhile homeworld; in order to do this, they needed a dhuryam to act as the planet's World Brain and supervise the world's transition."}, {"tag": "p", "text": "Thirteen dhuryams were bioengineered aboard the Seedship that was en route to Coruscant with the matériel needed to reshape the planet in Yuuzhan'tar's image. In a process overseen by Master Shaper Ch'Gang Hool and Executor Nom Anor, the thirteen dhuryams would be placed in the Nursery aboard the Seedship, where each would be given a domain and flocks of slaves to telepathically control. The dhuryams were tasked with coordinating the development of their domains' ecologies as best they could; at the end of the process, one dhuryam would be chosen to become the World Brain and the rest would be disposed of. The creatures knew the consequences of failure, so they were desperate to succeed. To prevent them sabotaging each other, Yuuzhan Vong warriors were installed around the lake wherein the dhuryam's hive-island was situated."}, {"tag": "p", "text": "One particular dhuryam had a recalcitrant slave in Jacen Solo, a young Jedi Knight who had been captured by the Yuuzhan Vong at Myrkr. Like every slave controlled by this dhuryam, Solo had a Yorik-Kul implanted in his body, which allowed the dhuryam to cause him intense pain as it pleased, until he carried out the task desired by the creature. However, unlike the other submissive slaves, Solo refused to acquiesce to the dhuryam's commands, instead enduring the pain. Solo's stubborn master began an embittered conflict with its defiant slave, causing the young Jedi endless pain for several days in succession. When it realized this had no effect on Solo, the dhuryam used the implants to manipulate Solo's body into jerking spasms, but could still not control him fully."}, {"tag": "p", "text": "However, the dhuryam had expended so much of its attention on the vendetta against Solo that other duties were neglected, and its dominion fell into a state of disrepair, becoming the least cultivated of the thirteen domains. Belatedly realizing this, the dhuryam made a tacit pact with Solo, allowing him to do what he wished as long as it did not hinder the development of the dhuryam's domain. As it happened, Solo's medical assistance to injured slaves gave the dhuryam a more industrious workforce, and the domain began to flourish, becoming a lush and teeming expanse of land. In Solo's opinion, it had overtaken its rivals and his dhuryam was the most worthy of selection. The dhuryam and Solo, once fierce enemies, began to develop a rapport. As it could not communicate with Solo via language, the pain from the Yorik-Kul was the only means of communicating with Solo: the creature sent him occasional twangs of affection and encouragement, directing the young Jedi towards medicinal flora to help him in his role as the domain's medic, and providing him with other slaves to act as his assistants. However, occasional tension did surface; when Solo began treating injured slaves belonging to the dhuryam's rivals, his master resuming its conflict with him for a day, but Solo refused to give in. Their bond strengthened after this, until Solo could convey images and emotions to the dhuryam, and vice versa."}, {"tag": "h3", "text": "Day of reckoning"}, {"tag": "p", "text": "On the eve of the tizo'pil Yun'tchilat—the ceremony by which the triumphant dhuryam was selected—Solo and the dhuryam came to another agreement: Solo would kill the rival dhuryams if, after it was selected as World Brain, his own dhuryam would ensure the survival of the thousands of slaves aboard the Seedship when the seedfall onto Coruscant occurred. Hidden caches of rudimentary weapons were furtively stored up in the domain for the slaves to use during the attack on the rival dhuryams. When the selection ceremony began, a shreeyam'tiz was taken to the Nursery to disrupt the dhuryams' telepathic links with their slaves—this was to prevent any eleventh-hour sabotage the dhuryams might have planned. However, Solo's dhuryam had faith in the Jedi's ability to perform his duty. Effectively blind and deaf, the twelve other dhuryams waited in fear and worry, desperately hoping they would awake as the newly chosen World Brain. Solo's dhuryam, however, waited in anticipation, ready to strike when Solo disabled the shreeyam'tiz. The shreeyam'tiz used the Yorik-Kul implants to conveniently gather the slaves around the coraltree basal of their respective domain while teams of Yuuzhan Vong shapers and warriors assessed the work of each dhuryam. Solo defied the Yorik-Kul's pain to resist, and, using his newly-discovered Vongsense to utilize the various creatures of the Nursery as weapons, attacked the shreeyam'tiz and its assignment of guards."}, {"tag": "p", "text": "When Solo killed the shreeyam'tiz, each dhuryam was reconnected with their slave-links. While his brethren were disoriented by this unexpected awakening and the disarray Solo had caused in the Nursery, Solo's own dhuryam quickly organized and armed swaths of its slaves with the hidden weapons. Sacworms filled with sparkbee honey were used as incendiary grenades; before long, the entire Nursery was thrown into a state of chaos, as Yuuzhan Vong warriors clashed with hordes of slaves. The other dhuryams called their slaves to the hive-island to defend them, but Solo's dhuryam sent out armed slaves in teams of five to create further distractions while Solo and his own team moved towards the hive-island. Solo murdered each and every of the rival dhuryams, before moving on to his own one with bloodthirsty intentions; the dhuryam, so used to compliance it was unfamiliar with the concept of betrayal, had not expected this and was totally defenseless."}, {"tag": "p", "text": "Just before he could strike a fatal blow, Solo was faced with the Fosh Vergere. A former Jedi-cum-Yuuzhan Vong ally, she had acted as Solo's unwanted mentor aboard the Seedship. Vergere attempted to dissuade Solo against killing his friend, but Solo, hoping to ruin the Yuuzhan Vong's projects to Vongform Coruscant, decided to slay the dhuryam regardless. Vergere was forced to intercede and paralyze him. The dhuryam had survived the Nursery, unlike his fellows, and had to be chosen as the World Brain. The panicked Shapers gave immediate control of the Seedship to the surviving dhuryam in a desperate attempt to retrieve the situation. It was pronounced as World Brain of the new Yuuzhan'tar—Pazhkic Yuuzhan'tar al'tirrna in Yuuzhan Vong—with little pomp or ceremony. The new World Brain quickly broke off much of the Seedship as it neared Coruscant, sending each piece down to the planet to sprout and spread the various Vongforming seeds. Despite Jacen Solo's botched attempt at betrayal, the dhuryam kept up its side of the bargain, ferrying the slaves planetside on the individual seedships before the Yuuzhan Vong could have them executed."}, {"tag": "p", "text": "The immobile dhuryam was installed in the Well of the World Brain on Coruscant, in what used to be the Senate Building. The World Brain was located at the heart of mountain of impenetrable wall of yorik coral that had enveloped the existing building, resilient to concussion missiles and orbital bombardment: the Yuuzhan Vong claimed that only planetary destruction could kill the World Brain. Aside from Nom Anor and Ch'Gang Hool, only a select few were allowed to enter the well. The World Brain worked quickly in Vongforming the urban metropolis of Coruscant, replacing it with organic Yuuzhan Vong constructs. The World Brain was privy to a constant flow of information from every part of the planet which, along with its own judgment, it used to discern what steps were to be taken. Despite Ch'Gang Hool's claims that he was in charge, in truth the dhuryam controlled Coruscant, creating the new planet's topography as it desired."}, {"tag": "h3", "text": "Agent of Chaos"}, {"tag": "p", "text": "Jacen Solo was on Coruscant, and had claimed to have defected to the Yuuzhan Vong and converted to their religion, but the Yuuzhan Vong refused to allow him access to the World-Well. Solo was presented with a pretext for entering the World Brain's home when the Yuuzhan Vong held a huge ceremony outside the former Senate Building, during which Solo claimed he would sacrifice his fellow Jedi Ganner Rhysode, a captive of the Yuuzhan Vong. Instead, Solo and Rhysode stole into the World-Well and sealed it off from any pursuers. While Rhysode fended off the eventual Yuuzhan Vong attacks, Solo made to communicate with the World Brain. The dhuryam enveloped Solo in its many tentacles, drawing him close and baring its fangs; it had not forgotten his betrayal. Solo used their connection to send his compassion and understanding to his friend, emphasizing their bond and claiming that if one killed the other, they would be killing part of themselves. The World Brain listened to Solo, as he incited it to conspire against the Yuuzhan Vong. Rather than working directly against the Yuuzhan Vong, Solo wanted his friend to ensure that the Vongforming process on Coruscant was fraught with persistent glitches and minor setbacks. The Yuuzhan Vong, with neither the time nor resources to replace the World Brain, would have to learn lessons in compromising and adapting. The World Brain, having forgiven Solo's betrayal, agreed; Solo fled Coruscant with Vergere."}, {"tag": "p", "text": "The World Brain remained in telepathic contact with Solo, even though the young Jedi was offplanet. It carried out its new mandate dutifully, creating an itching plague, which affected all of a Yuuzhan Vong's skin and spread quickly, until nearly every Yuuzhan Vong on Coruscant was affected. Although Yuuzhan Vong custom decreed that they should merely ignore the discomfort, many members of the Elite succumbed to the plague's stresses. The plague was first noticed on the day of Supreme Overlord Shimrra's arrival on the planet, adding to the Yuuzhan Vong's chagrin. An anti-fungal balm was eventually developed by Shaper Nen Yim, though it could only kill the fungus on contact and there was a high chance of re-infection; the plague was still ubiquitous on Coruscant for over a year."}, {"tag": "p", "text": "The World Brain also looked out for specific times of importance to the Yuuzhan Vong, and sought to sabotage them. Hundreds of high-profile captives were scheduled to be executed in a ceremony at the Square of Sacrifice attended by Shimrra, Warmaster Tsavong Lah and High Priest Jakan, but the World Brain ruined it. It made the maw luur that digested the area's sewage regurgitate all of the pestilent fluid into the square, repulsing the Yuuzhan Vong and curtailing the ceremony. The World Brain sabotaged several more ceremonies in the same fashion. Harvesting was disrupted by the overheating of lambent crystals, which caused fires. Defective lungworms began to emit harmful hydrogen sulfide instead of oxygen. Several times the World Brain had flocks of transport envelopers abscond for a time, causing panic among their carers. It engineered a surplus population of stink-beetles, which splattered into many Coruscant's newly-Vongformed buildings."}, {"tag": "p", "text": "The dhuryam had become the Yuuzhan Vong's bane, creating discord on Coruscant. The malfunctioning Vongforming process contributed to the disillusionment suffered by many low-ranking Yuuzhan Vong, and to the Jeedai heresy that followed. It was assumed that the World Brain suffered from some sort of illness. Ch'Gang Hool was held responsible and executed, but his replacement, Yal Phaath, could do nothing to halt the onset of problems created by the World Brain, and he himself was soon replaced by Qelah Kwaad. A team of shapers was tasked with bringing the dhuryam into line, to little effect, and the shapers came under increasing pressure from an irate Shimrra. The situation was so desperate that the priest Harrar postulated that Shimrra may have engineered the Jeedai heresy crisis and the emergence of the dissident prophet Yu'shaa to distract from the World Brain's failures, although this was not the case. Solo opted to continue the small scale disruption he and the World Brain had planned; his compassion for the Yuuzhan Vong prevented more drastic action."}, {"tag": "h3", "text": "Realignment and reunion"}, {"tag": "p", "text": "Jacen Solo had a rival for the World Brain's attention in Shimrra, the Supreme Overlord, with whom it was in direct contact. Shimrra came to regard the dhuryam as a sort of unruly child, one he could influence but not fully control. Slowly, he was able to assuage the World Brain more and more; eventually several sacrificial ceremonies were conducted without incident. The Vongforming of the planet progressed significantly, and the Yuuzhan Vong began to warily trust the dhuryam. Nom Anor suspected that Shimrra was merely tricking the World Brain, making it think that it was necessary for the planet's development that the maw luur retained the sewage. In truth, Jacen Solo was in the Unknown Regions; so far from Coruscant, his link with the dhuryam dwindled and eventually disappeared allowing Shimrra to influence the dhuryam until, by 29 ABY, it firmly under Shimrra's thumb."}, {"tag": "p", "text": "Soon after the World Brain acquiesced to Shimrra, the sentient, mobile planet Zonama Sekot arrived in the Coruscant system, altering Coruscant's orbit and causing volcanic eruptions and groundquakes. Galactic Alliance forces—including Jacen Solo—subsequently launched an attack on the planet. Shimrra had the World Brain set Coruscant ablaze to deter any attempts to occupy the world, convincing the dhuryam that in doing so, it was preventing the damage caused by Zonama Sekot's close passage. However, the brain became embroiled in an internal turmoil, as it was damaging all that it had created and reneging on its agreement with Solo to disrupt the planet's development in moderation. It considered simply ignoring Shimrra's commands and rectifying the situation itself, but having become so used to working with a partner, the dhuryam was unable to break free from the Supreme Overlord's influence."}, {"tag": "p", "text": "The World Brain was saved from its mental anguish by the arrival of Jacen Solo on Coruscant and the reignition of their bond. So distracted by the bedlam on Coruscant, the World Brain did not initially notice Solo's presence. When it did, the dhuryam pleaded desperately for some constructive course of action to take, and Solo pledged to help it. He began to coax his friend into siding with the New Republic against Shimrra, but the dhuryam was difficult to persuade. Solo's parents Han Solo and Leia Organa Solo arrived in the World-Well with the turncoat Yuuzhan Vong priest Harrar and forced Master Shaper Qelah Kwaad to attempt to placate and communicate with the dhuryam. Kwaad, not knowing of Solo's contact with the dhuryam, assumed only Shimrra could communicate with it, but endeavored to try. Before she could, the dhuryam, in constant contact with Solo, made its mind up, siding with Solo against Shimrra. It reigned in the Tu-Scart and Sgauru biots which were halting Solo's path to Shimrra's Citadel. The World Brain had Tu-Scart and Sgauru assist Solo and his cohorts in reaching the Citadel, and shook the building's foundations. Like the Jeedai heretics, the World Brain had begun revolting against its Yuuzhan Vong masters."}, {"tag": "p", "text": "Luke Skywalker killed Shimrra and Solo killed his puppet-master, Onimi, and the Sekot Accords brought the war to the end. During the discussions between Yuuzhan Vong Warmaster Nas Choka and Galactic Alliance Admiral Traest Kre'fey, the issue of the World Brain was raised. Kre'fey petitioned Choka to order Yuuzhan Vong shapers to persuade the dhuryam to undo some of the Vongforming and help return Coruscant to its previous state. Kre'fey had no qualms about retaining the World Brain's presence on Coruscant, seeing it as a symbol of compromise. The dhuryam was initially reticent about altering the work it had done, but Jacen Solo interceded and won over his friend."}, {"tag": "h3", "text": "Demise"}, {"tag": "p", "text": "The World Brain performed as agreed on Galactic Alliance-controlled Coruscant, reversing much of the Vongforming process. However, remnants of the Yuuzhan Vong's biological alterations to the world still remained in 40 ABY, over a decade after the Sekot Accords. Unfamiliar with such a foreign creature, some Coruscanti saw the World Brain that resided on their homeworld as a beast. Solo maintained infrequent visits, sometimes years apart, to see his friend. The dhuryam established telepathic connections with some of the savages of the Coruscant underworld, known as Ferals, who performed the World Brain's bidding. When Solo became head of the Galactic Alliance Guard, a newly formed secret police, he augmented his own spy network with the World Brain and its Ferals. Before long, Solo's old friend and its allies was providing him directly with far more intelligence than any of the GAG's other assets."}, {"tag": "p", "text": "During the Second Corellian Insurrection in 40 ABY, Solo had the World Brain spy on Corellian terrorist cells on Coruscant. At the same time as the Corellian crisis, a group of Bothans formed the True Victory Party, which advocated circumventing the Sekot Accords to resume the Bothan species' genocidal war against the Yuuzhan Vong. The remaining Yuuzhan Vong had been relocated to Zonama Sekot in the Unknown Regions after the war's end, so the World Brain was one of the Bothans' prime targets, and the dhuryam knew this. It grew increasingly paranoid about the Bothan threat, until it eventually left the World-Well of its own volition, relocating in the heart of Coruscant's underworld. Here, the dhuryam was constantly surrounded by its Ferals, becoming known by the sobriquet \"It.\""}, {"tag": "p", "text": "The World Brain continued to supply Solo with information regarding the Corellians, but shortly after its relocation Solo paid a furtive visit to his old friend. The dhuryam was deeply concerned about its safety, and Solo's claims that he had the situation under control helped little. Their meeting was fraught with tension; Solo was angry with the dhuryam for leaving the World-Well, while the dhuryam wanted Solo to expel all Bothans from Coruscant, something he could not do. The dhuryam suspected that Solo had been followed, and its telepathy indicated that there was an assassin in the building. In truth, it wasn't a Bothan, but Alema Rar, formerly of the New Jedi Order, who planned to kill Solo to avenge Rar's grievances with Solo's mother Leia."}, {"tag": "p", "text": "Rar used a blowgun to fire a poisoned dart at Jacen Solo, but the Dark Lady of the Sith Lumiya, who had also been trailing Solo, Force pushed him out of the dart's path: instead, it struck the World Brain's huge eye, sending the dhuryam into frenzied convulsions. Rar fled, and Solo—distraught and furious at his friend's pain—was only prevented from giving chase by Lumiya, who insisted they do what they could to help the dhuryam. The poison proved fatal, however: the dosage was enough to kill a Human within minutes, but the much larger World Brain suffered a more protracted agony, before finally succumbing to the dart's toxins. The Ferals, lacking the impulse control provided by the World Brain, began to riot. Solo was dismayed, and, believing the True Victory Party responsible for the loss of his friend, began a bloodthirsty vendetta against suspected members of the party with a string of assassinations against Bothan politicians on Coruscant. Ultimately, the World Brain's death contributed towards Solo's spiral towards becoming Darth Caedus, Sith Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of the World Brain was created by Matthew Stover for 2002's The New Jedi Order: Traitor, part of The New Jedi Order series of novels. The World Brain featured prominently in Part One of the novel, before reappearing briefly in Part Three. It was subsequently mentioned in several later works in The New Jedi Order, before appearing in the series' final installment, James Luceno's The New Jedi Order: The Unifying Force, in 2003. It also played a minor role in the subsequent Star Wars: Legacy of the Force series, receiving brief mention in Aaron Allston's Legacy of the Force: Betrayal and Karen Traviss's Legacy of the Force: Bloodlines, both in 2006. Troy Denning featured the character in the opening chapter of Legacy of the Force: Tempest (2006), killing it off. Allston again referenced the character briefly in Legacy of the Force: Fury, published in 2007."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}