{"url": "Wooley/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 212th Attack Battalion"], "nodes": [{"tag": "h1", "text": "Wooley"}, {"tag": "p", "text": "\"Wooley\" was the nickname of a Galactic Republic clone trooper who served in the 212th Attack Battalion's Ghost Company, under High Jedi General Obi-Wan Kenobi. When the Confederacy of Independent Systems launched an invasion of Ryloth, Kenobi and the 212th were sent to liberate the planet. After landing, Wooley and his unit were tasked with eliminating the Confederate proton cannons defending the city of Nabat so that the Republic transports could land. After destroying the city's outer Confederate defenses, Wooley accompanied Clone Commander CC-2224, nicknamed \"Cody,\" and fellow troopers Waxer and Boil, to scout ahead."}, {"tag": "p", "text": "Cody and Wooley went to investigate Nabat's central courtyard and discovered that the Twi'leks of the city were being held by the Confederate battle droids to serve as \"living shields\" surrounding the artillery. After reporting their findings back to Jedi Masters Kenobi and Mace Windu, Wooley and his company moved out. Meanwhile, Waxer and Boil—with the help of the young Twi'lek Numa, who they had encountered on their own patrol—had found a way to free the captives; while Wooley and and his fellow troopers created a diversion, Kenobi, Waxer, and Boil freed the Twi'lek prisoners and destroyed the proton cannons. The main body of Republic troops was able to land on Ryloth and eventually liberate the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper nicknamed \"Wooley\" was born on the planet Kamino as a clone of the Mandalorian bounty hunter Jango Fett. Wooley served in Ghost Company, a 212th Attack Battalion detachment under the command of Clone Commander CC-2224, nicknamed \"Cody,\" and High Jedi General Obi-Wan Kenobi. After Techno Union Foreman Wat Tambor invaded the planet Ryloth around 21 BBY, the Galactic Republic mounted an offensive to liberate the Separatist-occupied world. General Anakin Skywalker and his Padawan, Commander Ahsoka Tano, were able to destroy the Separatist blockade surrounding the planet, allowing the ground invasion forces of Kenobi and Jedi Master Mace Windu to move in and approach Ryloth."}, {"tag": "p", "text": "Kenobi, Cody, Wooley and the rest of Ghost Company boarded the Crumb Bomber and other LAAT/i gunships and attempted to land in the city of Nabat. However, Confederate J-1 semi-autonomous proton cannons attacked the Republic transports above, and Windu tasked Kenobi with taking out the cannons to allow the main body of ground troops to land. After landing, Kenobi and Ghost Company managed to destroy the outer defenses of the droid positions and moved into Nabat."}, {"tag": "p", "text": "Shortly after Ghost Company established a base, Kenobi ordered Wooley, along with Cody and troopers Waxer and Boil, to scout ahead. Splitting up from Waxer and Boil, Wooley and Cody went to investigate the city's courtyard and discovered that Nabat's Twi'lek inhabitants were being held prisoner by the droid forces as \"living shields\" to protect the Confederate proton cannons. Wooley believed that freeing the prisoners would not be easy, though Cody responded that there was always a way. The two clones returned to their base and reported their findings to Kenobi and Windu—the latter of whom was unable to land and was present as a holograph—and Ghost Company moved out to the village. However, Wooley and his company were attacked by gutkurr creatures, which had been starved and then released by the tactical droid TX-20, the leader of the Confederate forces stationed in Nabat."}, {"tag": "p", "text": "Kenobi managed to lure the gutkurrs into an alley with the Force, and Wooley and his group destroyed a bridge above the entrance, collapsing the structure and trapping the creatures. Waxer and Boil then emerged from an underground tunnel with the young Twi'lek Numa, who they had encountered on their own reconnaissance of the city, and Kenobi learned from the Twi'lek that she could lead them to the prisoners. Wooley and the rest of Ghost Company created a diversion by attacking the droids, while Kenobi, Waxer, and Boil freed the prisoners and also managed to take out the proton cannons. With the proton cannons destroyed, Windu and his forces were able to land on the planet and eventually liberate Ryloth."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When Kenobi ordered Cody to take the best scouts in Ghost Company to reconnoiter ahead, Cody chose Wooley, among others, to accompany him. After Wooley and his commander discovered the Twi'lek captives, Wooley expressed his doubt about the mission's potential success. As a clone of Jango Fett, Wooley was 1.83 meters tall."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In combat, Wooley wore white Phase I clone trooper armor and was armed with a DC-15A blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wooley was first featured in \"Innocents of Ryloth,\" an episode of the Star Wars: The Clone Wars TV series, which aired on March 6, 2009. Like all clone troopers in the series, Wooley was voiced by Dee Bradley Baker. Wooley was also featured in the young readers book The Clone Wars: The Battle for Ryloth, though he was not addressed by name by Commander Cody."}, {"tag": "p", "text": "Wooley was originally mentioned during the Battle of Christophsis in the The Clone Wars film. A clone trooper would have called to Wooley, informing him that another trooper required a medic. However, the reference to Wooley was removed by the film's release in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}