{"url": "Worrt", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Amphibians", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Worrt"}, {"tag": "p", "text": "Worrts were a non-sentient species that hailed from the desert of the planet Tatooine. These squat, large-mouthed creatures caught prey by sitting stationary in the sand and then using their purple prehensile tongues to wrap around passing rodents or insects."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Worrts were squat and spiky creatures whose appearance bore similarities to that of chubas. They had brown, warty skin and measured 1.50 meters in height. They were quadrupeds with dexterous forelimbs. A worrt's head featured a pair of sensitive cranial palps, two bulbous eyes that could be yellow in hue, two nostrils, and a large mouth. That mouth contained a purple prehensile tongue, and strong teeth laced with a venom potent enough to kill a bantha. The eyelids of the worrts could keep sand out of their eyes, and their saliva was also capable of jamming a blaster. Worrts lay large amounts of small, soft eggs which were harvested for food and used as ingredients in drinks served at cantinas."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Worrts were predatory creatures who lived on desert planets. Worrts fed mostly on insects and rodents. When hungry, a worrt would settle into the sand, becoming indistinguishable from a rocky outcropping, and wait for a prey to pass by it. When its victim came close enough, the predator threw its purple prehensile tongue out of its mouth and wrapped it around the prey. The worrt's prehensile tongue then snapped back, throwing the food down its throat, devouring it whole and belching loud."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The chuba-like worrts lived in the desertic wastes of Tatooine, a suns-scorched planet located in the Outer Rim Territories. The most notable worrt in the galaxy may have been the one lived on the road to Jabba the Hutt's Palace in the Dune Sea of Tatooine around the time of the Battle of Endor. Three years later, Han Solo and Lando Calrissian encountered a worrt named Korrg kept by the pilot Taka Jamoreesa. Around thirty years after the Battle of Endor, a Nu-Cosian traveling merchant and storyteller named Bobbajo kept a worrt named J'Rrosch as a pet. A worrt was held in a tank at Oga's Cantina in Batuu's Black Spire, where it laid fresh eggs every day that were used as an ingredient in drinks, such as Jabba Juice and Carbon Freeze."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A worrt first appeared in the 1983 movie Star Wars: Episode VI Return of the Jedi, the third installment in the original trilogy of Star Wars. Like many of the creatures seen at Jabba's Palace in the movie, the worrt was portrayed by a puppet. Its production nickname was simply \"road creature.\""}, {"tag": "p", "text": "Oga's Cantina bar at the theme park Star Wars: Galaxy's Edge has an animatronic worrt above the bar, and uses popping pearls to portray the worrt's eggs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}