{"url": "Wound_in_the_Force", "categories": ["Category:Legends articles", "Category:Force phenomena"], "nodes": [{"tag": "h1", "text": "Wound in the Force"}, {"tag": "p", "text": "A wound in the Force, also known as an echo or hole in the Force, was a type of catastrophic disturbance in the Force; it was a weakness in the fabric of the Force, caused by a traumatic event. The Force existed in all life, and when many lives were extinguished, especially in a short period of time, a wound was created."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Wounds in the Force were created whenever a massive loss of life occurred. All life in the galaxy was interconnected and when a significant number of lives were suddenly ended, the Force sustained a localized injury much like a sentient who had lost a limb. The epicenter of the wound became a dark place, filled with the reverberating echoes of the pain, terror, and suffering of the life forms who had lost their lives. Wounds in the Force were most often centered in astrographical locations where traumatic events took place, such as Malachor V or Alderaan, but they could also form within individuals such as Meetra Surik or Darth Nihilus."}, {"tag": "p", "text": "Sometimes when there is a close connection between two force-sensitive individuals (twins like Luke Skywalker and Leia Organa Solo or the master-apprentice-relationship between Satele Shan and Kao Cen Darach) and one of them is killed, the other one can feel it across the whole galaxy."}, {"tag": "h3", "text": "Echoes"}, {"tag": "p", "text": "Wounds in the Force cast echoes throughout space much like the ripples in a pool of water. They coursed through the Force like a scream that only Force-adepts could hear. When a great tragedy took place, such as the destruction of Alderaan or the Battle of Malachor V, a Jedi could feel the reverberations of the disaster from half-way across the galaxy. Such echoes caused distortion in the Force itself much like white noise. Any Force-user who was within close proximity to a wound could not be easily sensed due to the interference."}, {"tag": "h3", "text": "The dark side"}, {"tag": "p", "text": "Historians have theorized that the life-destroying effects of the dark side could cause a breach in the Force—especially when wielded by one as powerful as a Sith Lord. Such a hypothesis never gained universal acceptance, but it did help to explain how such potent dark side users as Darth Sidious were able to long hide their dark side affinity from the Jedi High Council. It also explained why the dwellings and tombs of the Sith such as those on Dxun, Onderon, Korriban, and Yavin 4, remained dark and corrupted locations for millennia after they were abandoned."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mandalorian Wars"}, {"tag": "p", "text": "In 3960 BBY, a wound in the Force was created at Malachor V during the final battle of the Mandalorian Wars when a superweapon known as the Mass Shadow Generator was triggered by the Jedi General Meetra Surik. Surik possessed an innate ability to easily form powerful Force bonds with those around her. Although she remained largely unaware of it, her unique skill allowed her to greatly influence her companions, and it made her a natural leader. However, during the battle of Malachor V, her gift became a liability. When she ordered Bao-Dur to activate the Mass Shadow Generator, thousands of military personnel that Surik had befriended and led into battle were killed almost instantly. Incapable of enduring the psychic backlash of the destructive energies that she had unleashed, she was only able to survive the ordeal by instinctively severing her connection to the Force. Thereafter, Surik was deafened to the Force, but she continued to project the echoes of the suffering that she had witnessed."}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "During the Jedi Civil War, circa 3959–3956 BBY, Darth Revan made use of several locations that were believed to be the epicenters of large wounds in the Force—the Trayus Academy on Malachor V, Freedon Nadd's tomb on Dxun, the Sith Academy on Korriban, and the Rakatan Temple of the Ancients on Lehon—all these locations served as secret Sith bases. Throughout the war, Jedi were captured and brought to those locations, where the ravenous and corruptive effects of the great breaches in the Force weakened their wills so that Revan and his loyal servants could easily lure them to the dark side. In such places, he converted hosts of Jedi into loyal Dark Jedi and Sith assassins for his Sith Empire."}, {"tag": "h3", "text": "Dark Wars"}, {"tag": "p", "text": "During the Dark Wars, the conflict that followed the Jedi Civil War, circa 3956–3951 BBY, the remaining Sith began to heavily experiment with ancient Sith techniques that Darth Revan had rediscovered while observing the devastating series of tragic events that characterized the Mandalorian Wars, and, specifically, how those events affected the Revanchist Jedi who took part in them."}, {"tag": "p", "text": "Darth Traya, Darth Sion, and Darth Nihilus, the leaders of the remnants of Revan's Sith Empire—now known as the Sith Triumvirate—learned how to create and make use of wounds in the Force in order to hide their presence, leech power from the destruction of other lifeforms, and to hunt down the remaining Jedi, through the Force. They and their legion of Sith assassins grew stronger with every kill they made, but in order to retain the power that they had acquired, they had to continually kill and feed on the life forms around them."}, {"tag": "p", "text": "When the Jedi Council faced Surik, once more, years after they had exiled her from the Jedi, for joining the Mandalorian Wars, Master Vrook Lamar told her of her nature."}, {"tag": "p", "text": "At that point in time, the Jedi Masters could see that if she allowed herself to fall to the dark side, she could have become a predator of life like Darth Nihilus—a Sith Lord who had abandoned his very humanity in his phenomenally destructive quest to acquire greater power and satisfy his ever-present hunger."}, {"tag": "p", "text": "Surik returned to Malachor V to confront Darth Traya, as well as to seal the wound left there. Bao-Dur's remote was also on the planet—sent by its maker—to reactivate the downed Republic ships to power the Mass Shadow Generator. After Surik defeated Traya, she ordered the Generator's activation, destroying the planet and sealing the wound, once and for all."}, {"tag": "h3", "text": "Great Jedi Purge and Galactic Civil War"}, {"tag": "p", "text": "More than a century before the Battle of Yavin, the Sith Master of Darth Tenebrous became known to successive Sith Lords for opening a hole in the Force, making Jedi consciously aware of the dark side of the Force for the first time in eight centuries."}, {"tag": "p", "text": "After the rise of Palpatine, Yoda fled to the planet Dagobah, where he hid in the shadow of a Dark Side Cave. He chose to live in that Force nexus because it provided some concealment against those who were hunting him."}, {"tag": "p", "text": "In 0 ABY, Moff Tarkin created a wound in the Force when he used the first Death Star to destroy the planet Alderaan—an event that killed every living thing on the planet, almost instantaneously. Such a catastrophic event sent shock waves through the Force which Obi-Wan Kenobi was able to detect, even though he was in the Outer Rim Territories, which were a substantial distance from Alderaan. Even Nova Stihl - an untrained Human male with a high Midi-chlorian count - was affected by the wound in the Force. At the moment of Alderaan's destruction he had been taking a sonic shower in an attempt to relax. Feeling the deaths of so many nearby was enough to cause him to pass out for an extended period of time. He awoke later with the sonic shower still working over him and a nose bleed."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "In 11 ABY, Kyp Durron destroyed the Carida system with the Sun Crusher and the echoes of the disturbance were felt by the students of the Jedi Praxeum on Yavin 4. The slaughter of the Eol Sha colonists on the planet Dantooine also created echoes that were felt by Jedi trainee Gantoris. Yet another disturbance felt by the students on Yavin 4 was the massacre on Pydyr by Kueller in 17 ABY."}, {"tag": "p", "text": "Leia Organa Solo also felt the deaths of her father and Darth Sidious in the orbit of Endor where the Death Star was destroyed in the Battle of Endor while she was waiting for the Noghri delegation. She even fainted for a few minutes because the dark side was so powerful in this place."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "The destruction of Sernpidal was felt in the Force by Luke Skywalker."}, {"tag": "p", "text": "During the Mission to Myrkr, Anakin Solo was killed and his death sent ripples through the Force. This was felt by his mother, Leia Organa Solo, as well as many other Jedi."}, {"tag": "p", "text": "Ben Skywalker, born during the Yuuzhan Vong's invasion of the galaxy, was able to sense pain and suffering so acutely that he shut himself off from the Force and refused to use it throughout the early years of his life."}, {"tag": "p", "text": "The deaths of the crews of the Hapan Royal Navy during the Battle of Fondor were felt by Teneniel Djo and caused her to miscarry her child."}, {"tag": "h3", "text": "Lost Tribe of Sith emergence"}, {"tag": "p", "text": "In 44 ABY Abeloth's Destruction of Tahv caused a tsunami of pain felt by members of Lost Tribe of Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}