{"url": "Besh-type_personal_starfighter", "categories": ["Category:Legends articles", "Category:Slayn & Korpil products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Besh-type personal starfighter"}, {"tag": "p", "text": "The Besh-type personal starfighter was a craft whose design was based heavily upon that of the B-wing starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Besh was tough and had excellent structural characteristics. It had decent speed, but was outmatched by most military or state-of-the-art vehicles. The vessel was easier to fly than its Rebel predecessor as a result of its design changes."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "Compared to the earlier B-wings, the Besh-type had significantly scaled down armaments, along with numerous other modifications, to make the starfighter more suitable for private ownership. The cockpit was shifted toward the center of the fighter, with the engines placed toward the ends of the central wing. The B-wings rotating cockpit was eliminated, and the Besh had the cockpit in the middle of the starfighter. This was done to eliminate the disorientation caused by evasive maneuvers, and to help the pilot judge the dimensions of the ship in flight. It retained the folding S-foils for stability."}, {"tag": "p", "text": "The Besh was equipped with moderately powerful fire-linked laser cannons that were mounted on the end of the S-foils. While the weapon systems were scaled back in comparison to the B-wing, the underlying connections and internal design specifications were still there. Many fringers used this to extensively modify their Besh."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Besh resonated with individuals who longed for a time before the Empire came to be. Since it was a private starfighter, it was often used by individuals and organizations who needed a tough ship to travel the more hazardous and less civilized parts of space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}