{"url": "Besh_gate", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chorlian sector", "Category:Outer Rim Territories space stations"], "nodes": [{"tag": "h1", "text": "Besh gate"}, {"tag": "p", "text": "Besh gate was a battered space station orbiting the planet Zygerria in the Outer Rim Territories, active during the Galactic Empire's reign and in use by the Zygerrian Thanda clan for business transactions. Around this time, a group of selected individuals infiltrated Besh gate, disguised as couriers for one of these transactions, and neutralized Thanda's clan representative, Atlee Thanda, and his guards."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "By the time of the Galactic Empire, Besh gate, a space station orbiting the planet Zygerria in the Outer Rim Territories' Zygerria system, was old and badly maintained. The miasma resulting from heavy starship activity and the neglect of the station itself emitted a powerful foul smell within the facility. Besh gate could be connected to some ships with the use of an umbilical. It was composed of twelve docking bays gathered around the central section."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Empire's reign, Brevis Taug, a shipping magnate who was funding the construction of a fleet of slave ships for the Zygerrian Thanda clan, would transfer funds to a Hutt-controlled company on Junction, which would then pass the funds on to Besh gate, where Atlee Thanda—a member of Thanda clan and an up-and-coming slaver—ultimately received them."}, {"tag": "p", "text": "Eventually, a group of individuals were assigned to infiltrate the space station, passing as couriers during one of these transactions and then neutralizing Atlee Thanda. The disguised group succeeded in reaching the facility aboard the ship Skinchanger, noticing several other ships docked. After the Skinchanger was ordered to dock, the group made its move and infiltrated Thanda's ship, the Scourge,—which was connected to Besh gate—using an umbilical which had at least two Zygerrian guards at its entrance. The group engaged Zygerrian guards under the command of Thanda's majordomo, Liskran Dulce, and ultimately succeeded in neutralizing Thanda. Afterward, the individuals were hailed for their fine work, and the Scourge's databanks turned out to be a valuable source of information about the operations of several other Zygerrian clans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Besh gate space station was first mentioned in the 2003 mini-adventure Zygerrian Takedown, a supplement for the Star Wars Roleplaying Game, published by Wizards of the Coast. Among the outcomes of the adventure in the station, players can choose to either kill or capture Atlee Thanda, winning more points with the latter option. The mini-adventure incorrectly places the Chorlian sector, and therefore Besh gate, in the galaxy's Wild Space region, but this information has been retconned by 2008's The Complete Star Wars Encyclopedia—in which Besh gate was indirectly mentioned within the entry for Zygerria—and 2009's The Essential Atlas."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}