{"url": "Wrist_blaster/Legends", "categories": ["Category:Legends articles", "Category:Blaster weaponry", "Category:Personal weaponry"], "nodes": [{"tag": "h1", "text": "Wrist blaster"}, {"tag": "p", "text": "A wrist blaster was a blaster that was worn and fired from the wrist."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "There were two types of wrist blasters. One type was worn on the wrist by humanoids. Due to its inconspicuousness, it was popular with assassins, diplomats working in hostile territories, and other nobles who hated being completely unarmed. This wrist blaster was worn as a bracelet and looked like an ordinary piece of jewelry. The bulk of the wrist blaster contained the power cell, which was powerful enough to deliver the same damage as a blaster, but contained enough energy for only a single shot. Special alloys masked the wrist blaster from sensors that scan for weapons. Owning this type of weapon was illegal in all but specific, highly regulated circumstances. Variants of this type of wrist blaster included the wrist laser such as the Dur-24 wrist laser worn by bounty hunter Boba Fett."}, {"tag": "p", "text": "The second and more powerful type of wrist blaster was mounted on battle droids such as the B2 super battle droid. It had all the capabilities and firepower of a blaster rifle. Other battle droids with similar wrist blasters included the C-B3 cortosis battle droid, the A-series assassin droid, the B1-A air battle droid, and the B2-AA Air Assault Super Battle Droid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, bounty hunter Chata Hyoki used a wrist blaster. Another known user was Sith Lord Darth Nihl, who used it in conjunction with his long-handle lightsaber, making him a deadly foe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "B2 super battle droids with wrist blasters appeared in 2002 with the release of Star Wars: Episode II Attack of the Clones. In the 2004 video game Star Wars: Battlefront, wrist blasters are the B2's primary weapon. Other wrist blasters appeared in the comics The Weapons Master! and Legacy 1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}