{"url": "Wurokkk%27s_musical_piece", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Songs"], "nodes": [{"tag": "h1", "text": "Wurokkk's musical piece"}, {"tag": "p", "text": "The avant-garde Wookiee composer Wurokkk wrote a musical piece for the touring smazzo percussion group Shluur as an experiment meant to subliminally encourage aggression in members of the Bith species on their homeworld of Clak'dor VII. The experiment proved successful when some Bith began behaving erratically, even violently, a week after attending performances."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The musical piece, composed for a smazzo percussion ensemble, used vibrations based on Bith biorhythms and brainwave patterns to incite aggressive behavior in members of that species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The piece was composed by the Wookiee male Wurokkk, a dangerously avant-garde arranger for the galactic touring smazzo group Shluur. Created as an experiment, the piece was performed during a two-week series of sold-out performances by Shluur in the Purghom Musical Performance Hall on the Outer Rim planet Clak'dor VII."}, {"tag": "p", "text": "The intent of the experiment was to cause violent behavior in members of Clak'dor VII's native Bith species. The experiment succeeded when, after a week of performances, some Bith who had attended the Shluur concerts began shouting and damaging property, with one even throwing a datapad at another. The violence eventually grew into riots that almost leveled the planetary capital of Weogar."}, {"tag": "p", "text": "The resulting aggression from the Bith caused their shocked government to investigate Wurokkk. After it was discovered that every Bith showing aggression had attended multiple Shluur concerts, the Bith government had the Wookiee, along with the entire band, escorted off-planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wurokkk's musical piece was introduced in \"Beat of a Different Drum,\" an adventure hook presented in the Star Wars Roleplaying Game sourcebook Geonosis and the Outer Rim Worlds, which was published in March 2004 by Wizards of the Coast. In the scenario, players take on the role of investigating the violence caused by the musical piece and escorting Wurokkk off-planet."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}