{"url": "Wukkar/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Core Worlds planets", "Category:Corellian Run", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Wukkar locations"], "nodes": [{"tag": "h1", "text": "Wukkar"}, {"tag": "p", "text": "Wukkar was a heavily-populated planet located within the Wukkar system of the Core Worlds. Part of Galactic Republic space since the Republic's inception, Wukkar became a part of the Galactic Empire until surrendering to the New Republic. It was later occupied by the Yuuzhan Vong species during their invasion of the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Wukkar was a planet located in a star system of the same name in the Core Worlds, situated along the Corellian Run between the Ixtlar and Kailor systems; this made it a part of the Core Worlds portion of the Slice known as the Arrowhead. It was one of the most highly populated worlds in the Core; planets in its sector of space averaged between 100 and 500 billion inhabitants in 25 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Wukkar was located in a region of the Core that was explored by galactic society prior to the formation of the Galactic Republic. It remained in space controlled by the Republic for nearly 25,000 years, until the Republic gave way to the Galactic Empire regime in 19 BBY."}, {"tag": "p", "text": "Up until 0 ABY, the planet's capital, Iltarr City, was the home of Avrak Villachor, the local sector chief of the Black Sun criminal syndicate. However, after a heist at his estate, most of his forces were killed or scattered. Villachor agreed to cooperate with the Empire and left the Black Sun after that event."}, {"tag": "p", "text": "The Empire was opposed by the Rebel Alliance, which scored a major victory at the Battle of Endor in 4 ABY. Afterward, the Alliance reorganized itself as the New Republic, which pressed on with its war against the Empire. Wukkar was one of the Core Worlds, along with Alsakan, Grizmallt, and Coruscant, that surrendered fairly quickly to a New Republic fleet led by Admiral Gial Ackbar."}, {"tag": "p", "text": "During the Yuuzhan Vong War of 25–29 ABY, Wukkar was one of many planets in the Slice occupied by the invading Yuuzhan Vong species. In the last two months of the war, Yuuzhan Vong forces began to pull back from the Slice. This allowed the Galactic Alliance, the successor state of the New Republic, to attack the Yuuzhan Vong forces occupying the planet Corulag."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wukkar was created in a lone statement about the Core Worlds in the Dark Empire Sourcebook, written by Michael Allen Horne and published by West End Games in 1993. It would not be mentioned again until another stand-alone mention in the 2003 novel The New Jedi Order: The Unifying Force, written by James Luceno, followed by an entry in 2008's The Complete Star Wars Encyclopedia and a map placement for the Wukkar system in 2009's The Essential Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}