{"url": "Wroshyr_tree", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Plants of Kashyyyk", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Wroshyr tree"}, {"tag": "p", "text": "The wroshyr tree was a species of giant, long-lived, cone-bearing trees found on the planet Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "There existed over 1,000 different varieties of wroshyr trees that were adapted to growing everywhere on Kashyyyk, except at the poles. One such variety was the tropical wroshyr of Wawaatt Archipelago, which averaged 300 to 400 meters in height. The deep-forest variety was much bigger, reaching several kilometers in height. Another variety was the white wroshyr, which went extinct millennia before the last decades of the Republic Era."}, {"tag": "p", "text": "Wroshyrs trees lived up to 50,000 years and formed seed-bearing cones every 100 years."}, {"tag": "h2", "text": "Ecology"}, {"tag": "p", "text": "The wroshyr dominated the landscape and environment of Kashyyyk. In fact, they formed the backbone of a complex, multilayered vertical ecosystem, extending from their roots to their crown. Many animals, parasites (like the wroshyr louse), and other plants (like the zha-raratha vine and the needle blossom)) grew on, or lived within, wroshyrs."}, {"tag": "h2", "text": "Uses by Wookiees"}, {"tag": "p", "text": "Wroshyr trees were an integral part of the lives of Kashyyyk's native sentients, the Wookiees, who referred to themselves as \"The People of the Trees.\""}, {"tag": "h3", "text": "Habitation"}, {"tag": "p", "text": "Wroshyr trees were so immense that entire communities could live within their trunks. In the deep forests, Wookiee towns and cities expanded outside the wroshyr trunks by building platforms resting upon the interlocked branches of close-growing trees. One such city was Rwookrrorro, the birthplace of Chewbacca. In coastal regions where the wroshyrs were smaller and did not grow so thickly together, like that of the town of Kachirho, Wookiee settlements consisted of individual tree communities."}, {"tag": "h3", "text": "Timber"}, {"tag": "p", "text": "Wroshyr wood had extraordinary qualities. It was slow to burn, capable of taking hits from a turbolaser and suffering only a little charring and splintering. On the downside, cutting it required proton-teeth saw blades, and even those sometimes broke in midspin, leading to lethal injuries to their operators. Nevertheless, uninhabited wroshyrs were exploited for timber, for both domestic uses and offworld export. Examples of domestic uses included the platforms and balconies of Wookiee settlements, as well as certain weapons and starship interiors."}, {"tag": "h3", "text": "Sap"}, {"tag": "p", "text": "The Wookiees used the sap of the wroshyr trees to make medicine, food, and beverage, and as a base material to produce fuel, oils, and chemicals. Sap could also be distilled to produce sapwater, a slightly sweeter form of water."}, {"tag": "h3", "text": "Amber"}, {"tag": "p", "text": "By the time of Obi-Wan Kenobi's apprenticeship, the white wroshyrs had long gone extinct. However, there remained lumps of their fossilized resin, which were called meryx and were considered the single rarest gemstone in the galaxy."}, {"tag": "h3", "text": "Other products"}, {"tag": "p", "text": "The leaves and bark of wroshyrs were also used in the manufacture of textiles, weapons, furniture, utensils, and decorative artifacts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}