{"url": "Wurrek/Legends", "categories": ["Category:Legends articles", "Category:Invertebrates", "Category:Predatory creatures", "Category:Species of undefined sentience", "Category:Subterranean creatures"], "nodes": [{"tag": "h1", "text": "Wurrek"}, {"tag": "p", "text": "The wurrek was a dangerous pest that inhabited starships and were considered as much of a nuisance as mynocks, though the wurrek did not harm ships, but rather the crew as well as droids."}, {"tag": "p", "text": "They possessed an unusual appearance in that they lacked any organ that would be defined as a head and were covered with a fine scale that made it measure a meter in length. To compensate for the lack of a \"head,\" the wurrek possessed numerous sensor clusters that allowed it to \"see\" its surroundings and was located on its dorsal side. This \"sight\" allowed them to detect both vibrations as well as light. In addition to this, they possessed six tentacled arms, which were used to both manipulate their environment and to feed their tooth-filled mouths. When sighting prey—or threatened by an attacker—the wurrek would often attack with its sharp teeth making them difficult creatures to capture as they did not fear death. While the tentacles would also be used to climb obstacles."}, {"tag": "p", "text": "The wurreks would often be found more at home in caves or caverns that were high from the ground which explained their use of their tentacles. What made these creatures despised by starship crews was their voracious appetite and the lengths the beast would go to achieve it. As such, it was common that they would \"break into\" starship cargo using their teeth while searching for food. This would often result in starships being rendered into a mess while the wurrek went on its search and was deadly for the crew as the wurrek would always attack first. It was even more dangerous when a wurrek discovered spice, as this drove them into a wild frenzy."}, {"tag": "h2", "text": "Sources"}]}