{"url": "Wutzek", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Force-sensitives", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wutzek"}, {"tag": "p", "text": "Wutzek was a Force-sensitive demon, the last of his kind. He was imprisoned for many centuries by an evil cult called the Five. The Five used an Angle Trap Cage to create a dimensional paradox that Wutzek could not escape. Centuries later, sometime after the Battle of Yavin, Chewbacca changed the alignment of the Angle Trap Cage, allowing Wutzek to escape.  Wutzek destroyed and devoured the cult, then pondered the fate of the heroes who freed him. Out of gratitude for ending his centuries of incarceration, mockery, and abuse at the hands of the Five, Wutzek allowed Chewbacca, Han Solo, and Leia Organa to go free. Wutzek then burst out of the Five's warship, destroying it, and was now free to roam about in Imperial-controlled space unchecked."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Wutzek was of a non-corporal, energy-based alien species. Its body produced a shifting, swirling, pulsating, and shimmering array of bluish-white light. Wutzek was capable of telepathy, having shown its history to Chewbacca through vivid mental imagery. When not communicating, the being emitted a faint crackling sound when encountered in atmosphere. After disintegrating the bodies of the members of the Five, Wutzek claimed to have also absorbed their souls. Unharmed by the destruction of the Five's warship, Wutzek survived easily in the vacuum of space; freed of its confines, he expanded to a size larger than the fleeing Millennium Falcon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wutzek has a major role in the apocryphal novella, Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon by Joseph Bongiorno. In this story, Wutzek is a Celestial and one of the original creators of the galaxy; his designation as a demon is an epithet hurled at him by one of his enemies. Wutzek, dissatisfied with mortal life, decides to create children closer to his godlike nature, but they unexpectedly take form from his own negative traits: Tilotny from his vanity, Horliss-Horliss from his remoteness, Cold Danda Sine from his impatience, and Splendid Ap from his apathy. When his children learn that Wutzek intends to destroy them, they flee, and Tilotny and Cold Danda Sine together introduce evil into the universe and breed monstrous demigods to plague the galaxy."}, {"tag": "p", "text": "Ages later, after his children and grandchildren have ravaged the galaxy, Wutzek tricks Tilotny and Cold Danda Sine into destroying themselves and convinces Splendid Ap to redeem himself (Horliss-Horliss having already been redeemed of his own accord). Wutzek tries to confront Tilotny's firstborn Typhojem on the planet Garn, but his evil grandson imprisons him in an \"angle-trap\" in which he seemingly dies. Wutzek re-forms millennia later, however, and destroys Typhojem's sister Tharagorrogaraht. He then watches over his children's dark realm, Otherspace, where he is once again imprisoned in an angle-trap by the Five, a cult devoted to Tilotny and her children, until he is freed once more by Chewbacca."}, {"tag": "p", "text": "In the epilogue, Wutzek appears to the spirit of Arhul Hextrophon, who has been killed by beings from Otherspace, and guides him \"beyond shadows\", where Hextrophon beholds the destiny of the universe and is transfigured into a spiritual being himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}