{"url": "Wurth_Skidder", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Humans", "Category:Jedi Guardians", "Category:Jedi Knights of the New Jedi Order", "Category:Kyp's Dozen personnel", "Category:Males", "Category:New Republic individuals", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Wurth Skidder"}, {"tag": "p", "text": "Wurth Skidder was a Jedi Knight who died during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Skidder studied under Luke Skywalker at the Jedi Praxeum on Yavin 4, and was one of the older Knights in the class above the Solo children. In 20 ABY, with many of the senior Jedi at the wedding of Mara Jade and Luke Skywalker on Coruscant, he and Ganner Rhysode were left in charge of the Praxeum. In the early phases of the Yuuzhan Vong War, Wurth Skidder was one of Kyp Durron's protégés and supporters. Skidder's rash actions in the Osarian-Rhommamool conflict in 25 ABY helped save Leia Organa Solo from her attackers, but only fueled hostilities between the neighboring worlds."}, {"tag": "p", "text": "In the Battle of Ithor, Wurth was one of many Jedi to defend the Tafanda Bay. He fought valiantly, but suffered a severe fracture to his arm from a Yuuzhan Vong amphistaff. In the months after Ithor, Wurth found his way back to the frontlines on Gyndine. He helped New Republic troops fend off Yuuzhan Vong ground forces from inside his commandeered All Terrain Scout Transport until he had to retreat. Leia Organa Solo was on Gyndine, helping with the evacuation, when Skidder arrived. She tried to convince him to join her aboard the transports, but after promising to come back, Skidder disappeared and missed his ride. Wurth allowed himself to be captured."}, {"tag": "p", "text": "He was put aboard a yammosk carrier ship known as Crèche commanded by Commander Chine-kal. The vessel was carrying Randa the Hutt, and Wurth was put to work massaging the yammosk's tentacles. He used the Force to connect to the yammosk's mind and tried to persuade it that Randa was going to betray Chine-kal, but the yammosk saw through his lie and alerted Chine-kal of his being a Jedi. He was then \"broken\" by the Yuuzhan Vong after being tortured."}, {"tag": "p", "text": "Wurth later died after Jedi Master Kyp Durron and fellow Knight Ganner Rhysode tried to rescue him as they blasted their way through the ship's hull with the Dozen-and-Two Avengers and fought off many Yuuzhan Vong. Wurth knew it was too late and had them rescue the other prisoners, including Roa. By the time Kyp and Ganner reached him, Wurth Skidder was already too far gone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}