{"url": "Wyle_Ulbreck", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Moisture farmers", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Wyle Ulbreck"}, {"tag": "p", "text": "Wyle Ulbreck was a Human male who resided on the desert planet Tatooine in the years surrounding the fall of the Galactic Republic. During a sixty year career as a moisture farmer, Ulbreck became very wealthy and, by the time of the Galactic Empire, operated a large ranch north of the Jundland Wastes where he lived with his wife, Magda. More than twice the size of any other nearby moisture farm, Ulbreck's farm was staffed by numerous farmhands and guarded by private security personnel."}, {"tag": "p", "text": "Confident in his own security, Ulbrek was one of the few settlers in the region not to join the Settlers' Call, a group led by the moisture farmer Orrin Gault which provided mutual defense for its members against the frequent attacks by the native Tusken Raiders. By 19 BBY, Gault was heavily in debt and began attacking his neighbors disguised as a Tusken Raider in the hopes of convincing them to join the Settlers' Call so that he could use the membership fees to pay off his debts. Ulbreck was among those targeted, but was able to escape the attack after the intervention of the self-exiled Jedi Master Obi-Wan Kenobi. Although Gault attempted to frame the Jedi for the attacks, Kenobi was able to reveal the truth to Ulbreck and the other settlers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Moisture farmer"}, {"tag": "p", "text": "Wyle Ulbreck was born around 94 BBY, during the last decades of the Galactic Republic. Sometime around 79 BBY, the young Human became a moisture farmer on the desert planet Tatooine in the Arkanis sector of the Outer Rim Territories, using moisture vaporators to extract water vapor from the barren planet's atmosphere. During a sixty year career, Ulbreck saw it rain four times, only twice more than he claimed to have encountered a krayt dragon, a carnivorous reptile native to Tatooine."}, {"tag": "p", "text": "Ulbreck spent most of his early career working alone, but in later years was able to hire farmhands and increasingly delegate work. By 19 BBY, Ulbreck employed a small army of farmhands to work on the ranch he owned near the Pika Oasis, north of the rocky region known as the Jundland Wastes. Ulbreck's ranch was vast, more than twice the size of that of his largest competitor in the region, Orrin Gault. At the center of the ranch was Ulbreck's home, a cluster of bubble-like buildings larger than many of the other homes in the desert. Ulbreck shared his home with his wife, Magda, but the pair had no children. One of the wealthiest farmers in that region, Ulbreck was well known for his frugal nature and famously kept most of his fortune in aurodium-plated ingots buried beneath his home's septic system."}, {"tag": "p", "text": "Due to his distrust of others, Ulbreck rarely visited the towns of Anchorhead and Mos Eisley. For over twenty years prior to 19 BBY, he was, however, a regular customer at Dannar's Claim, a store and bar located at the Pika Oasis which was run by Annileen Calwell following the death of her husband, Dannar, in an attack by the indigenous Tusken Raiders in 27 BBY. The threat of the Tuskens led Orrin Gault to form the Settlers' Call, a fund into which many settlers in the region paid and which was used to provide weapons and vehicles for their mutual defense. Gault tried on several occasions to convince Ulbreck to subscribe to the Setters' Call Fund, but Ulbreck preferred to employ his own security personnel, operating out of barracks east of his house."}, {"tag": "h3", "text": "Anchorhead incident"}, {"tag": "p", "text": "At the conclusion of the Clone Wars in 19 BBY, the Galactic Republic was restructured into the Galactic Empire under the rule of Emperor Palpatine. The Republic's long-time guardians, the Jedi Order, were accused of treason and virtually wiped out by Imperial forces, assisted by the former Jedi Anakin Skywalker, who had fallen to the dark side of the Force and become the Dark Lord of the Sith Darth Vader. Shortly after the rise of the Empire, Ulbreck visited Anchorhead to meet with a vaporator parts supplier. Having had a big fight with Magda that morning, Ulbreck was not eager to return home, so stopped at the Junix's Joint cantina and ended up falling asleep at the bar after several hours and half a dozen lum ales. When he finally awoke and stood up to leave, Ulbreck lost his balance and fell, but was caught and helped back to his stool by a man in a brown cloak. Unbeknownst to Ulbreck, his helper was the Jedi Master Obi-Wan Kenobi, one of the few surviving Jedi, who had come to Tatooine to deliver Skywalker's infant son Luke safely out of reach of his father to his uncle and aunt, Owen and Beru Lars."}, {"tag": "p", "text": "While Kenobi was asking Ulbreck and the Duros bartender for directions, a fight broke out in the cantina between a Wookiee customer, a group of Rodian henchmen to the local crime lord, Jabba the Hutt, and a group of youths, comprising Orrin Gault's children, Mullen and Veeka, Annileen Calwell's son, Jabe, and Gault's farmhand Zedd Grobbo. Ulbreck took cover, but Kenobi went to join the fray, leaving Skywalker with the bartender's wife, Yoona, until a nearby blaster shot caused her to panic and hand the baby over to Ulbreck as she ran to join her husband. Ulbreck watched as the Wookiee easily picked up Jabe Calwell and threw him towards a wall, only for Kenobi to use the Force to redirect the young Human safely behind the bar. Kenobi used Calwell's blaster to shoot the light overhead, leaving the bar illuminated only by the blue glow of Kenobi's lightsaber. By the time Kenobi collected Skywalker from Ulbreck moments later, the Rodians were dead and the shootout was over."}, {"tag": "p", "text": "Unable to explain Calwell's survival, the strange blue light or the fate of the Rodians, Ulbreck attributed what he had seen to alcohol and gave up drinking. A few days later, he was traveling to Dannar's Claim in his dilapidated ST-101 repulsortruck when the engine overheated, leaving him stuck in the desert. Concerned that somebody would steal his vehicle if he left it alone, Ulbreck contacted Gloamer, the mechanic at Dannar's Claim, for assistance. It soon arrived in the form of Orrin Gault, who had offered to take some coolant to Ulbreck. After Gault finished refilling the coolant in the ST-101, he attempted once more to sign Ulbreck up for the Settlers' Call Fund, citing a Tusken Raider attack on the Bezzard family's farm a few days earlier, which had been stopped by the arrival of armed Settlers' Call members. Ulbreck, however, was quick to point out that they had arrived too late to save Tyla Bezzard's father, Lotho Pelhane, and insisted that he had faith in his own security."}, {"tag": "h3", "text": "Tusken attacks"}, {"tag": "p", "text": "One week later, most Pika Oasis residents traveled to Mos Espa for the annual Comet Run Podrace, leaving Ulbreck as one of only a handful of customers at Dannar's Claim. Among the other customers was Obi-Wan Kenobi, who had settled in the area after leaving Skywalker with his aunt and uncle. Ulbreck almost recognized Kenobi from the Anchorhead incident, but quickly dismissed it and thereafter paid the other no mind. Kenobi eventually went outside with Annileen Calwell, leaving a sleeping Ulbreck and the Rodian Bohmer alone. Ulbreck woke to the sight of Tusken Raiders entering the store. Bohmer was caught by the attackers and seriously wounded, but Ulbreck wedged himself behind the store's weapons counter, and used the weapons there to keep the Tuskens at bay."}, {"tag": "p", "text": "The settlers soon started to return and helped Calwell and Kenobi fight more Tuskens outside, but Ulbreck was in danger of being overwhelmed in the store. Help came when Kenobi entered, setting off a fire extinguisher and using the resulting haze of chemical retardant as a cover while he attacked the Tuskens with his lightsaber. When the haze cleared, over a dozen Tuskens lay dead. As Calwell activated the Settlers' Call and more settlers arrived, the surviving Tusken Raiders fled. Kenobi claimed that Ulbreck had been the one to kill the attackers while he provided a distraction; Ulbreck's recollection was unclear, but he was quick to take the credit and began telling the story to anybody who would listen. Orrin Gault organized a retaliatory strike on the fleeing raiders, which resulted in the deaths of 48 Tuskens. Ulbreck, however, did not accompany them and was adamant that the incident proved the ineffectiveness of the Settlers' Call."}, {"tag": "p", "text": "Several days later, Ulbreck was once more in Dannar's Claim when he received a call informing him that Tusken Raiders had attacked one of his landspeeders, chasing away a security team and stealing both the landspeeder and the new vaporator it carried. As he headed home through Gault's land, Ulbreck encountered Gault and his children. Gault tried again to convince Ulbreck to join the Settlers' Call, suggesting that the Tusken Raiders had turned their attention to Ulbreck's land since the massacre the other day had driven them further away from the Pika Oasis. Ulbreck, however, was still unconvinced and once more declined. In response to the Tusken attack, he assigned more sentries to patrol vehicles."}, {"tag": "p", "text": "The following evening, Ulbreck was smoking a cigarra on his porch when four Tusken Raiders approached the ranch. The Tuskens quickly incapacitated Langer, a relative of Magda's who was on duty as night watch, and fired on Ulbreck, leaving him pinned down and unable to reach his rifle. Ulbreck shouted a warning to his wife inside the house, but the attackers kicked in the side door and threw a smoke grenade inside. Magda stumbled outside and was grabbed by one of the attackers. When Ulbreck attempted to reach his wife, one of the Tuskens struck him with the butt of a blaster rifle, breaking his nose and sending him crashing to the deck. The attackers dragged Magda in front of Ulbreck and the leader approached her with a knife. At that moment, Kenobi jumped down from the roof, knocking the knife from the lead Tusken's hands. As the others released Magda to fight the new arrival, she and Ulbreck reached the nearby garage and fled in Ulbreck's repulsortruck."}, {"tag": "p", "text": "By the time Ulbreck's security staff secured the ranch, both Kenobi and the Tusken Raiders had gone. However, a scout saw the Tusken Raider Plug-eye, who had led the attack on Dannar's Claim days earlier, leaving the area and Ulbreck assumed that she was also behind the attack on his ranch. Early the next morning, Ulbreck went to see Gault and declared his intention to join the Settlers' Call Fund. Gault quickly gathered the settlers and Ulbreck's security personnel at Dannar's Claim. Ulbreck's memory was unclear on what role Kenobi had played, but he was able to confirm that the newcomer had been present during the attack and Gault seized on this to denounce Kenobi as a traitor who had directed the Tusken Raiders to Ulbreck's, knowing that it was not protected by the Settlers' Call."}, {"tag": "h3", "text": "Showdown with Kenobi"}, {"tag": "p", "text": "The posse set out to catch Kenobi at his home on the outskirts of the Jundland Wastes. Spotting him leaving on a speeder bike, they followed as Kenobi took shelter in the Roiya Rift, a rocky labyrinth where the local Tusken Raiders were known to hide. The settlers waited outside the rift to prevent Kenobi's escape, but before they could deploy smoke charges to flush him out, a stampede of banthas emerged from the Rift and charged toward them. Ulbreck and the others took cover as the banthas charged straight into their vehicles, overturning several. Moments later, a speeder bike emerged from the rift. Thinking Kenobi was attempting to escape, the vigilantes opened fire, but when the speeder bike crashed, they discovered that what had appeared to be the driver was only a duffel stuffed with Tusken clothing. As the settlers gathered around the downed speeder bike, they heard Kenobi's voice, projected by the Force, reveal that he had found the clothing at Gault's ranch. Gault, he explained, had been using the Settlers' Call Fund to pay off his debts to the banks and Jabba the Hutt; when membership had started to decrease, Gault and his children had taken to attacking his neighbors, disguised as Tuskens, in an effort to scare them into joining the Fund."}, {"tag": "p", "text": "Ulbreck was angry to learn that Gault had been behind the attack on his ranch. He and the other settlers confronted the Gaults, but were interrupted by the arrival of a skiff carrying the Nimbanel Mosep Binneed and several of Jabba the Hutt's minions, intent on recovering the money Gault owed to the Hutt crime lord. When Annileen Calwell also arrived moments later, she confirmed what Kenobi had told the settlers and revealed that she had told Binneed where to find Gault. Veeka Gault angrily grabbed Calwell's arm, prompting Ulbreck and the other settlers to turn their weapons on the Gaults. Bineed insisted that Gault be turned over to him, but Ulbreck refused to be bullied and fired on Binneed's skiff, killing the Klatooinian gunner Jorrk. The other settlers followed Ulbreck's lead and a firefight broke out between the settlers and the criminals."}, {"tag": "p", "text": "The Gaults used the distraction to flee into the rift, taking Calwell with them. Their escape was short-lived, however, as Kenobi and the Tuskens had formed a truce to stop the Gaults. Outside the rift, the brief fight ended with Binneed deciding to cut his losses and ordering a withdrawal. As the settlers celebrated their victory, an injured Veeka Gault fled the Rift, followed shortly by Calwell. Ulbreck was relieved to see that Calwell was unhurt, but disappointed to learn that he would not get to confront Orrin and Mullen Gault, neither of whom had survived."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Having worked hard from a young age, Wyle Ulbreck became a successful moisture farmer, owning a ranch significantly larger than any other in the region. His success made him wealthy, but Ulbreck was notoriously frugal, spending as little as possible and burying the majority of his fortune beneath his home's septic system. Ulbreck was not fond of other beings, even those who worked for him, who he believed would steal from him if he left them alone for too long. His attitude was often reciprocated by others and even his own staff did not like to spend time with him. He was particularly distrustful of city dwellers and droids, who he refused to do business with in the belief that they were programmed to steal for their Jawa masters. In addition to Jawas, he had a low opinion of the Sand People, who he did not consider capable of logical thought. Although he cared for his wife, Ulbreck and Magda frequently argued. Ulbreck would seek peace from his wife by spending most days at Dannar's Claim, although Annileen Calwell suspected that this was to Magda's benefit as much as Ulbreck's. At night, Ulbreck would seek refuge outside his home, allowing him to smoke cigarras, despite being forbidden by both his wife and his doctor. As well as cigarras, Ulbreck was partial to alcohol, although he quit drinking after witnessing Obi-Wan Kenobi defeat some of Jabba the Hutt's minions in Anchorhead, believing that he had imagined the whole thing as a result of intoxication."}, {"tag": "p", "text": "Ulbreck prided himself on knowing his way around Tatooine, although there were few places on the planet he liked. His long life on the planet had left him with numerous stories and theories which he liked to share with others whenever he got the chance. As Dannar's Claim's best customer, he spent twenty years regaling Annileen Calwell and her regular customers with the same stories, ranging from the four times he had seen it rain on the desert planet to his encounters with krayt dragons. One visitor described Ulbreck's tales as transcendental loops which defied the laws of physics and storytelling. When Kenobi rescued Ulbreck from the Sand People attack on Dannar's Claim, Ulbreck was quick to accept Kenobi's explanation that the elderly farmer had killed the attackers. He soon started telling the story to anybody who would listen, filling in the blanks with his imagination."}, {"tag": "p", "text": "Ulbreck viewed the Settlers' Call with derision and frequently rejected Gault's attempts to enlist him. He had no interest in protecting those around him and believed that his own security personnel were sufficient to protect his own lands. As owner of the largest ranch in the area, Ulbreck would have been required to pay a higher membership fee than his peers, which he objected to out of principle and believed would have been squandered by Gault and the other members. Ulbreck refused to be pushed around by anybody; he remained defiant even when Gault threatened Magda during the attack on Ulbreck's farm and opted to fire on Jabba the Hutt's thugs rather than allow them to take Gault during the showdown at the Roiya Rift. When he learned that Gault had been killed, he was frustrated that he would not get to see the man brought to justice."}, {"tag": "p", "text": "By the time of the Galactic Empire, Ulbreck was elderly and balding with white facial year and a gravelly voice. He was in good shape for his age, but no longer performed manual labor, instead delegating to his numerous farmhands."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wyle Ulbreck was created by John Jackson Miller for the 2013 novel Kenobi. Kenobi was originally envisioned as a comic book and early drafts of the story did not include Ulbreck, who was only added after Random House picked up the story as a novel. Random House suggested adding a prologue that included Obi-Wan Kenobi, who otherwise would not appear until much later in the book. Miller used Ulbreck as an unreliable narrator for the prologue, his drunken state allowing him to witness Kenobi using the Force to deal with a bar fight without understanding what had occurred."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}