{"url": "Wynn_Dorvan", "categories": ["Category:Legends articles", "Category:Clerical workers and assistants", "Category:Galactic Alliance bureaucrats", "Category:Galactic Alliance Chiefs of State", "Category:Gamblers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Wynn Dorvan"}, {"tag": "p", "text": "Wynn Dorvan was a Human male who served as a member of the second Galactic Alliance Triumvirate and later, as the Chief of State of the Galactic Alliance. Dorvan began his career as a mid-level bureaucrat in the early years of the New Republic, where his honest nature earned him the trust and respect of New Republic Chief of State Leia Organa Solo. In the aftermath of the Second Galactic Civil War, Dorvan came to the attention of the newly elected Chief, Natasi Daala, and accepted a position in her administration. Impressed with his efficiency, Chief Daala eventually promoted Dorvan to be her Chief of Staff."}, {"tag": "p", "text": "However, in 44 ABY, amid Daala's handling of a very public stand off with the New Jedi Order and her brutal methods in dealing with galaxywide slave uprisings, Dorvan began to reconsider his position in her administration. As Dorvan drafted his resignation, however, the acting Grand Mastership of the Jedi Order passed from the easily controlled Kenth Hamner to the more martial Barabel Jedi Master Saba Sebatyne, who quickly acted to neutralize the threat Daala posed to the galaxy by staging a coup against her."}, {"tag": "p", "text": "In place of the Office of the Chief of State, the Jedi Order created a ruling Triumvirate to govern the Alliance, representing the Order, the military and the Senate respectfully. Grand Master Sebatyne refused Dorvan's resignation and he initially stayed on to act as her political advisor, before being promoted to act as a member of the Triumvirate along with Sebatyne and Senator Haydnat Treen, in lieu of General Merratt Jaxton."}, {"tag": "p", "text": "When the Order withdrew from the Triumvirate, it was widely expected that Dorvan would be elected Chief of State, however, Klatooinian Senator Padnel Ovin was elected as interim Chief of State due to his lack of political saavy which made him an ideal puppet. Ovin retained Dorvan as Chief of Staff and, realizing that something was afoot in the Senate, they allied with Admiral Nek Bwua'tu and Eramuth Bwua'tu in a secret club that could root out the conspiracy in the government. They discovered that a majority of the newly-elected members of the Senate were in fact members of the Lost Tribe of Sith and that they were planning a covert takeover of the Galactic Alliance. Dorvan assisted Han Solo in saving his wife Leia from the clutches of the Sith who had had her arrested on bogus charges while Ovin distracted them by opposing a recall on his election in the Senate. Although the escape was a success, Dorvan was captured by members of the Lost Tribe as he returned to his office."}, {"tag": "p", "text": "For the next month, Dorvan was tortured by Abeloth, the new leader of both the Lost Tribe and the Galactic Alliance. Feigning going over to her side, Dorvan secretly awaited the day when the Jedi would return to Coruscant. When the Jedi begun eliminating Sith imposters all around Coruscant, Dorvan advised Abeloth to pull her forces back into the Jedi Temple where the Jedi would be forced to follow. However, Abeloth predicted the Jedi move and, when Dorvan killed her Rokari Kem avatar, it was revealed that Abeloth had been manipulating him from the start. Before she could kill him, he was saved by Jysella Horn and her brother Valin."}, {"tag": "p", "text": "After the Jedi succeeded in defeating the Lost Tribe and Abeloth, Dorvan was elected interim Chief of State by the Senate and took on the hard task of restoring order to the Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Initially, Wynn Dorvan served in the New Republic as the underdeputy of tenolodium reserves. During this time, he discovered a lucrative skimming operation run by his supervisor. Instead of using the knowledge to secure himself a cut of the products, Dorvan risked his life to inform the current New Republic Chief of State Leia Organa Solo. This led to a great deal of trust and respect developing between Organa Solo and Dorvan. From that time on, he rose rapidly through the ranks of both the New Republic and its successor, the Galactic Alliance. Eventually he became the personal aide and later Chief of Staff to Chief of State Natasi Daala."}, {"tag": "h3", "text": "Chief of Staff"}, {"tag": "h4", "text": "Jedi psychosis"}, {"tag": "p", "text": "When Jedi Knight Jysella Horn succumbed to an enigmatic illness, it was Dorvan who first saw the news on the HoloNet and informed Daala. Afterward, Daala congratulated Dorvan on his work and presented the idea of a promotion. Dorvan declined, stating jokingly that if he was in a higher position he would have people under him, which was not to his liking. Regardless of Dorvan's wishes, Daala appointed him as her Chief of Staff and assigned a personal assistant in the form of Twi'lek Desha Lor."}, {"tag": "p", "text": "When he learned of Daala's plans to use Mandalorian commandos to ensure the Jedi's cooperation, Dorvan secretly contacted Han and Leia Solo and told them of the development. He had originally intended to use Jagged Fel to contact them indirectly, and this drove a wedge between Jag and his future in-laws when he kept the secret to himself and Jaina."}, {"tag": "p", "text": "Later, Dorvan alerted Daala to the suicide of Cha Niathal, and witnessed firsthand the psychosis plaguing Jedi Knights when the Jedi Sothais Saar became paranoid and delusional in Dorvan's presence. Only Dorvan's quick thinking enabled him to survive."}, {"tag": "p", "text": "Dorvan later developed a friendship with redeemed Jedi Raynar Thul who had lunch with him every day on the steps of the Jedi Temple. When the Temple came under siege and Kani Asari's murder at the hands of the Mandalorians, Dorvan saved Thul's life when he went to have lunch on the steps. This convinced Dorvan to remove Asari's body from the steps, overruling the Mandalorians' decree that she would stay there as a reminder to the Jedi of the Mandalorian terms."}, {"tag": "p", "text": "He also owned a chitlik called Pocket. During the Tendrando Arms Celebrity Sabacc Charity Challenge, Dorvan was onboard the Errant Venture when Captain Booster Terrik started firing on orbital mirrors in front of the Chief of Staff, ostensibly to force Daala to release his grandchildren. But this was in fact a distraction to draw the Sixth Fleet's attention away from the Jedi Temple to insure the secure launch of their StealthXs to reinforce Luke Skywalker on Pydyr. The Errant Venture then escaped into hyperspace, taking Dorvan and many other Coruscanti elite with him. Dorvan emerged as the tournament's winner and was said by many to be planning his retirement. He was evacuated, along with the others, on Borleias where he was immediately returned to Coruscant to be debriefed by Daala."}, {"tag": "p", "text": "When the leader of the Klatooinian resistance movement against slavery, the Sapience Defense Front, Grunel Ovin, committed suicide by exploding the ship Fireborn while on his way to his trial, Daala decided to use Mandalorians against the Klatooinians. Dorvan obeyed and gave the mobilization order but, fed up with Daala's growing paranoia and bloodlust against those who defied, started to draft his letter of resignation. When Daala's decision to send the Mandalorians to Klatooine was leaked to the press, Daala proved how paranoid she had become and she had even lost trust in Dorvan himself, suspecting him to be the leak."}, {"tag": "h4", "text": "Political coup"}, {"tag": "p", "text": "At the same time, a coup was launched by the Jedi Order to remove Daala from office. Unbeknownst to either party, another group of conspirators had also planned to stage a coup against Daala. The latter incapacitated Daala with a stun bolt, having managed to take over her security detail by order of Admiral Sallinor Parova, one of the conspirators. The former made a deal with Senator Haydnat Treen, the leader of the conspiracy, to build a joint transition government: a Triumvirate composing of Saba Sebatyne, the acting Grand Master of the Jedi Order, Senator Treen and General Merratt Jaxton, Chief of Starfighter Command. The Senate approved of this. Dorvan was kept under unofficial house arrest in his office for the duration of the coup. He was later brought to Master Sebatyne who informed him of the changes of government. Dorvan resigned as Chief of Staff, claiming that he didn't want to be part of a government who wanted to destroy Natasi Daala for whom he still held some respect. He is later convinced to stay by Sebatyne and takes back his resignation with his first task as the Triumvirate's Chief of Staff to be to find ten worlds who would give Daala a fair trial. He also convinced Sebatyne not to drop the charges against former Jedi Tahiri Veila since she was being tried for a valid reason and not because of Daala's personal prejudices. Dorvan also believed that this would curtail the Jedi Order's critics to about half."}, {"tag": "h3", "text": "Galactic Alliance Triumvir"}, {"tag": "p", "text": "Sometime afterwards, Dorvan was appointed to replace General Jaxton as Triumvir although the reason for this change is not elaborated upon. Thus, he was charged with overseeing the admission or rejection of the new star systems that had been free by slave uprisings into the Alliance. When Luke Skywalker returned to Coruscant and announced that the Jedi were pulling out of the capital and becoming an independent entity no longer aligned with the Alliance, plans were made for the Senate to elect Dorvan as sole interim Chief of State until a formal election could be held. However, Senator Treen's conspiracy had taken this as a means to ensure that their plans to reform the Empire would occur. The Senate eventually elected new Senator and former terrorist leader Padnel Ovin as the interim Chief of State. However, Ovin realized that this was a plot to use him as a puppet and, knowing that Dorvan was better at politics than him, asked him to remain as Chief of Staff."}, {"tag": "p", "text": "During a Senate session, Dorvan helped to free Leia Organa Solo from prison, using secret passage leading from Chief of State's office to Jedi Temple Meditation Garden. On his way back Dorvan was captured by three Sith from the Lost Tribe until he was approached by Kem, who was actually Abeloth in disguise. She shed her disguise to reveal her true form, much too Wynn's horror. He was captured and brutally tortured by Abeloth for the next few days and, much to her surprise, refused to give up any valuable information. Abeloth decided to have Wynn as her aide in order to plan her rule on the planet until the Jedi began striking at the Lost Tribe across the planet. During the Liberation of Coruscant, the Sith retreated into the Jedi Temple under advice from Wynn."}, {"tag": "p", "text": "While the Sith were preparing for the arrival of the Jedi, Dorvan was tricked by Abeloth into killing her Rokari Kem avatar via secretly-stolen blaster so that she could transfer her essence into the Jedi Temple's computer core. Dorvan would be trapped in the core's room until he was found by Jysella Horn during the Jedi strike team's mission of getting the Temple open to Admiral Nek Bwua'tu's commandos. In spite of Abeloth's power, Dorvan managed to escape with the help of the Jedi survivors so that he could reconvene in a meeting with the Jedi Council and several political and military officials to discuss how best to defeat Abeloth and the Sith. Dorvan was adamant that killing Abeloth through orthodox means would be impossible, i.e. she would be able to see an attack planned by Admiral Bwua'tu coming even before he decided it. This was only compounded by the apocalypse that Abeloth was causing on Coruscant."}, {"tag": "p", "text": "Following the defeat of Abeloth and the Sith, it took three months to repair the damage that Abeloth had done to Coruscant. Dorvan was elected as Chief of State of the Galactic Alliance but the surviving public decided that the Jedi Order was to be forever exiled from Coruscant, overriding his veto. Luke Skywalker conceded to the consensus, believing that the Jedi can't afford to allow Coruscant to be a target, but still left a few Jedi bodyguards to protect Dorvan."}, {"tag": "p", "text": "Some time afterwards, Dorvan was approached by Garik Loran, who had secretly reassembled Wraith Squadron to expose and capture Generals Stavin Thaal and Borath Maddeus as both members of the Lecersen Conspiracy. Dorvan rewarded Loran by appointing him to Maddeus' former position as head of Galactic Alliance Security."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}