{"url": "Wyl_Lark%27s_squadron", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:New Republic stubs", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Wyl Lark's squadron"}, {"tag": "p", "text": "This squadron  was of a mixed starfighter and airspeeder unit, formed by the New Republic during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the 204th Imperial Fighter Wing, led by Colonel Soran Keize, attacked New Republic forces above Troithe, it resulted in many losses and members scattered across the Cerberon system. Due to a shortage of New Republic pilots and starfighters, Nath Tensent and Wyl Lark, the only Alphabet Squadron pilots on Troithe following the attack, formed a makeshift squadron, which consisted of a handful of 61st Mobile Infantry to fly as pilots, and a few salvaged airspeeders as well as an antique Clone Wars V-wing. The rusting airspeeders needed to be refurbished and retrofitted with weaponry to prepare them for combat. When deciding who was going to command the squadron, Tensent refused to take on the role, despite his previous experience leading his own squadron, and deferred to Lark to carry the burden of responsibility."}, {"tag": "p", "text": "Lark brought together the pilots from those with any type of flying training, namely Prinspai, Gorgeous Su, Ubellikos, Vitale, and Denish Wraive. In conjunction with the highest ranking troopers of Twilight Company, Lark agreed to a plan to seize the Core Nine mining megafacility as a redoubt. They set off on the long journey across the continent. Unfortunately for them, Shadow Wing had the same idea, and they were set upon by TIE scouts. Gorgeous Su, and the twenty soldiers on her airspeeder, sacrificed themselves to  ensure the caravan would escape."}, {"tag": "p", "text": "Later, when they arrived at the facility, the attack began. Tensent blew a hole in the wall so the soldiers could infiltrate. Lark called out orders to his unit, but both Prinspai and Ubellikos were shot down, and Wraive had to withdraw. They were rescued by the arrival of Vanguard Squadron, and ultimately re-secured the planet."}, {"tag": "h3", "text": "Reorganization"}, {"tag": "p", "text": "Following the fighting on Troithe, General Hera Syndulla was assigned a new flagship, a refitted Star Destroyer, Deliverance. Wyl Lark was promoted to commander of the Deliverance's starfighter wing. The remnants of his hodgepdge assault force of skimmers and cloud cars were reassigned to a newly formed Wild Squadron, which continued in the same vein as the dissolved squadron by being a place for misfit pilots and misfit starfighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Wyl Lark's squadron appeared in the 2020 novel Shadow Fall, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}