{"url": "X-70B_Phantom-class_prototype", "categories": ["Category:Legends articles", "Category:Sith Empire starship classes", "Category:Stealth ship classes", "Category:X-70B Phantom-class prototypes"], "nodes": [{"tag": "h1", "text": "X-70B Phantom-class prototype"}, {"tag": "p", "text": "The X-70B Phantom-class prototype was a prototype starship of the reconstituted Sith Empire used by Imperial Intelligence."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The sleek appearance of the X-70B Phantom was designed to pass for a civilian luxury shuttle, despite its array of hidden components. Its bridge was shielded by the forward armor plating, and was equipped with advanced, precision flight instruments."}, {"tag": "p", "text": "Its interior featured custom wood panelling and cushioned seating, and within the X-70B was a luxurious central lounge with a gaming table and recessed food coolers, as well as a long-range communications holoterminal. Attached to the lounge was a medical bay, behind which was a spacious cargo bay. The X-70B also included a conference room, intended for both briefings and entertainment of potential intelligence sources."}, {"tag": "p", "text": "X-70Bs were so technologically advanced they were never mass-produced. Instead, they were elite vessels bestowed upon only the most trusted intelligence agents for the most vital missions to the Empire during the Great Galactic War. The ships were coated with a sensor-resistant exterior and equipped with the most sophisticated equipment and weapons. Their powerful sensor arrays had the ability to scan the interiors of other ships, even over large distances."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Exal Kressh, Sith apprentice to the Sith Emperor, piloted an X-70B prototype when she defected from the Emperor's service. She first traveled in her ship to an unidentified planet in the Peragus system, before she was pursued by a fellow Sith apprentice, Teneb Kel. She then used it to escape from the destroyed Lenico Colony Blue and return to Korriban in the Horuset system shortly before the Republic attack on Korriban."}, {"tag": "p", "text": "Another of these ships would be given to be used as the personal ship of an Imperial Agent named Cipher Nine in order to travel across the galaxy on various operations from transport to space battles."}, {"tag": "p", "text": "Darth Serevin used an X-70B during the Battle of Ilum where he oversaw Darth Malgus's New Empire forces. His ship was captured during the battle and used to deliver a strike force to Malgus' space station, which eliminated the false emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The X-70B is the Imperial Agent class ship in Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}