{"url": "X-7", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Assassins", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "X-7"}, {"tag": "p", "text": "X-7 was a Human male assassin created by Rezi Soresh in an experiment to make the perfect assassin. He was used to hunt down Luke Skywalker, but in the process rediscovered his emotions. After a run-in with Skywalker on Belazura, X-7 betrayed Soresh and died in the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hunt for Skywalker"}, {"tag": "p", "text": "Rezi Soresh, an Imperial commander, found X-7 and took care of him, removing his past and emotions in an effort to shape him into the perfect assassin. X-7 was paired with six other individuals in Soresh's brutal training program, but outlasted the rest to become Soresh's personal assassin."}, {"tag": "p", "text": "After the Battle of Yavin, Soresh chose X-7 to infiltrate the Rebel Alliance and find who fired the shot that destroyed the Death Star. X-7 gained the Rebels' trust by changing his identity to \"Tobin Elad\" and destroying a TIE/LN starfighter that he hired to shoot at the Millennium Falcon as it was on its way to Muunilinst on Rebel business. He eventually was able to sabotage the Millennium Falcon's weapon's system and track down Leia Organa."}, {"tag": "p", "text": "Once there, they met up with General Carlist Rieekan, and attempted to form a movement for the Rebellion. They later met Ferus Olin under the disguise of Fess. They continued building trust for the Rebels until Leia was captured by a group of survivors from Alderaan and was handed over to the Galactic Empire for revenge. The Alderaan refugees were going to give her a serum to make her reveal everything she knew. However, X-7 stopped the interrogation and gave it to her himself, asking her who destroyed the Death Star. She revealed Skywalker's name. After discovering the name of his target, X-7 was going to kill her but was stopped when Skywalker himself arrived. The assassin would have killed him there, but he had to report to Soresh. Skywalker released Organa and they went back to the Rebel base."}, {"tag": "p", "text": "When the group returned to Yavin 4, X-7 proceeded to plant explosives in Luke's speeder bike and put the evidence in Solo's room. When Skywalker started the bike, it exploded, but he leapt from the bike and survived, though he was severely injured. X-7 then attempted to suffocate the wounded prey, but a gathering crowd discouraged him from continuing. Solo appeared to blame for the attempted assassination, but when he was locked in a cell, Chewbacca rescued him and together they fled Yavin IV. X-7 then crept into Luke's room attempting to poison him with a Sennari poison. However, Skywalker, along with Organa, R2-D2 and C-3PO, were gone, headed to Tatooine for Biggs Darklighter's funeral. X-7 hacked into Skywalker's computer files and found an invitation to Biggs' funeral. As that appeared to be the best lead he had, he departed for Tatooine. Once there, he told Bossk, who was also after Skywalker, where to find him. However, Skywalker defeated Bossk. X-7 was on an overhang with a sniper rifle, ready to execute Skywalker. Solo then appeared and put a blaster to X-7's head, who responded by whirling around with his blaster, starting a standoff. Chewie rushed out of an Anchorhead cantina, followed by Skywalker and Organa. Solo told them of 'Elad's' identity, and the Rebels believed him over the traitor. X-7 blasted off with a hidden jetpack, vowing to finish the mission later. Ferus Olin then appeared to Organa once again, revealing that he had sent Solo an anonymous tip, as Olin had not trusted Elad."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "For the first time in his life, X-7 had failed. Not sure what to do, he fled the area. Soresh contacted him and told him to report back for reconditioning. But staying with the Alliance had exposed him to a comradeship he had not known before. X-7 disobeyed Soresh and set out on his own to kill Skywalker. Not long after, X-7 hired several pilots. He first put a test on them, during which most were either killed or ran. Six survived, one of them being Lune Divinian. He then set them loose on Rogue Squadron, who at the time happened to be on Kamino. The pilots ambushed the Rebel pilots, but several more mercenaries were killed. Two crashed on an abandoned cloning facility and faced off the Rebel pilots. Little did they know the Imperials were conducting bio-engineering projects. The creatures killed the other mercenary, forcing Divinian to work with Skywalker to escape the planet. When the Rebels returned to the planet, they imprisoned Divinian."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "In the Great Temple, Divinian refused to cooperate with the Rebels. Eventually, a commando team sprung Divinian from his cell. After the Rebels investigated his room, they discovered he had been taken to Belazura by Rezi Soresh. When the Heroes of Yavin traveled to the planet, they met up once again with Ferus Olin. They would create a plan to raid the Imperial base on Belazura. But to do that, they needed X-7's help. However, during that time, X-7 had confronted Soresh and demanded his true identity. Soresh gave him codes for access to an Imperial database that included his real identity; Soresh believed the information had been erased and thought his search would be fruitless. However, X-7 discovered his place as Project Omega's most successful product and his real name: Trever Flume. Flume had been believed to have been killed on Belazura in 12 BBY at the age of nineteen, but his body had never been discovered. Instead, he had been taken by the Imperials, undergone facial surgery to dismiss any questions about his identity, and been reconditioned, along with six others."}, {"tag": "p", "text": "X-7 then went through a thorough search to who he really was. It led him to the grave of the Divinian family, where he questioned locals and found he was the brother of the mercenary he had hired to finish Skywalker, Lune Divinian. Div was at the Divinian family home when X-7 journeyed there, however, and both wanted the truth. Div listened to X-7's story, and believed it. He and the Rebels let him in on the planned attack on the Imperial base. After the attack started, it became apparent it was a trap set by Soresh. Soresh contacted X-7 and told him to finish his job. Unsure of what to do, X-7 was confronted by Divinian. In the end, X-7 shot Divinian in the shoulder, stunning him. He resolved to finish Div and had a fight with his brother and Ferus Olin. X-7 was stabbed through the heart by Ferus Olin, ending his hunt for Skywalker. However, with his last words, he asked Div if he really mattered to someone, ever. Conflicted, Div finally gave in and told him that he had mattered to someone."}, {"tag": "p", "text": "Rezi Soresh would later become a fugitive from the Empire for his actions. In his final attempt to gain his revenge against Skywalker, he was killed and his body left to vaporize when the sun went supernova."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "X-7 could change his appearance and even his actual self by using custom Medpac. He could use his small durasteel mallet to crush his nasal bones. He used a bone fuser to set his bones in different ways if necessary. If his eyes needed changing he would use a colored lens and sometimes would print different drawings and tattoos on himself. He was also an accomplished pilot and sniper. During the course of a mission, he would relentlessly pursue his target. Until he met Skywalker, he had never failed."}, {"tag": "p", "text": "X-7 also had the artificial trait to be a Force blank, meaning he had no connection to the Force. This was first realized by Ferus Olin when protecting Princess Leia Organa on Delaya. He described X-7 as the Force flowing around him, not through, and his body merely being a hollow shell. This is the only known instance of a Force Blank being artificially created in history."}, {"tag": "p", "text": "When he masqueraded as Tobin Elad, his eyes were described as \"dead.\" Despite a complete reconditioning by Soresh, he was still able to feel emotions. These emotions confused him and led to his ultimate demise. Also, to refer to those emotions, he started to feel angry at Skywalker for escaping death one too many times. He thought he was broken for having wants and for having flashbacks of memories that seemed to belong to another person, another life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "X-7 was created for the Star Wars: Rebel Force series written by Alex Wheeler. To date, it is his only appearance in \"Star Wars\" canon. In the fifth book, he is told he was a reconditioned Trever Flume. The author hints that this fact is actually true, but X-7's true identity still remains somewhat uncertain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}