{"url": "X-45_sniper_rifle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Blaster sniper rifles", "Category:SoroSuub Corporation products", "Category:Sporting blaster rifles"], "nodes": [{"tag": "h1", "text": "X-45 sniper rifle"}, {"tag": "p", "text": "The X-45 sniper rifle was a highly accurate sporting sniper rifle produced by the SoroSuub Corporation. The X-45 was available from as early as the Clone Wars, throughout the rule of the Galactic Empire, and into the administration of the New Republic. One of the few downsides of the weapon was its fragility, as it had to be carried in a special case and only extracted when needed. The bolt it fired was thinner than a normal blaster bolt but was much more lethal, a result of its being overfocused in the barrel. The weapon was initially marketed as a civilian weapon called the Riflette, but the X-45 quickly became popular with assassins and was re-categorized for military use."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The X-45 sniper rifle, manufactured by the SoroSuub Corporation, was a medium-sized sporting blaster rifle noted for its high accuracy, especially if the target was within a fifty-meter range and the shooter fired in controlled single shots. The energy beam it fired was overfocused in the barrel, which resulted in a thinner but much more lethal blaster bolt. Using the X-45 allowed the shooter to pick off his target without drawing too much attention. The rifle had a long computerized targeting scope that was nearly the same length as the X-45's body, a stock, and a clip capacity of twenty-five shots. The X-45 weighed four kilograms and had a maximum range of 500 meters. The rifle could be disassembled and put into a specially made case. The X-45's major drawback was its extreme fragility, so the rifle was normally carried in the case until it was needed. The entire process of unpackaging and assembling the rifle took some time. The X-45 cost between 750 and 1,000 credits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The X-45 sniper rifle was SoroSuub's attempt to carve out its share of the sporting blaster market. The sniper rifle was developed at some point before the second year of the Clone Wars. During that time, a group of adventurers known as the Heroes of Cularin were investigating a murder that had occurred on the resort moon of Dorumaa in the Cularin system. Echari Di'San, the President of the Cularin Trade Alliance, was accused of killing a man named Rysko Barnt in the local Cantina Oceana. Determined to help Di'San prove his innocence, the Heroes of Cularin tried to meet a waiter called Hukno Rit, who could testify on Di'San's behalf. However, when they arrived to pick Rit up, they found him dead and were attacked by a well-trained strike team armed with X-45 sniper rifles. The strike team had been dispatched by Thon Larimhor, the man who had set Di'San up. The Heroes of Cularin survived the encounter and eventually managed to expose Larimhor."}, {"tag": "p", "text": "Advertised as a sporting blaster rifle called the \"Riflette,\" the X-45 was released to civilian markets during the regime of the Galactic Empire. The accurate and commonly available rifle quickly became popular with assassins, so it was eventually reclassified as a military weapon. During the New Republic's rule over the galaxy, the X-45 sniper rifle was included in Gundark's Gear Datalog, an illegal database run by the notorious arms dealer Gundark. The database included annotations from smugglers, thieves, mercenaries, and other outlaws on some of the items. A note filed under the X-45's entry, left by an individual with the screen name Aiden around 10 ABY, stated that Aiden had often used the X-45 rifle while working as a \"freelance troubleshooter.\" Aiden praised its accuracy, but also provided a note explaining how to increase it even more, up to thirty percent, by taking a targeting package from a security droid, or other similar fourth degree droid unit, and patching it into the X-45's computerized scope."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The X-45 sniper rifle was first mentioned in \"Blasters for Hire,\" an article written and illustrated by Anthony P. Russo and published in Star Wars Adventure Journal 3 on August 1, 1994. The rifle was subsequently mentioned in several other reference books, for both West End Games' Star Wars: The Roleplaying Game and Wizards of the Coast's Star Wars Roleplaying Game. Its first mention in an in-universe work was in Sean Stewart's 2004 novel Yoda: Dark Rendezvous. The X-45 was subsequently featured in Plea Bargain, a year five adventure in the Living Force RPG campaign. In 2008, it received in an entry in The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "There are several discrepancies regarding the X-45 rifle. Although The Complete Star Wars Encyclopedia states that the rifle was first produced during the reign of the Galactic Empire, Plea Bargain and Yoda: Dark Rendezvous see the rifle being used during the Clone Wars, years prior to the Empire's rule. However, other sources only state that the rifle was released to civilian markets during the Empire's rule, not excluding the possibility of it being produced earlier. Additionally, \"Blasters for Hire\" and the Gundark's Fantastic Technology: Personal Gear reference book give the X-45's price as 750 credits. However, Arms & Equipment Guide and Ultimate Adversaries sourcebooks place the price at 1,000 credits. This article assumes that the rifle's price varied between these estimates."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}