{"url": "X-30_%22Lancer%22_target_blast_pistol", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Cleanup", "Category:SoroSuub Corporation products", "Category:Sporting blaster pistols"], "nodes": [{"tag": "h1", "text": "X-30 \"Lancer\" target blast pistol"}, {"tag": "p", "text": "The SoroSuub Corporation X-30 \"Lancer\" target blast pistol was a lightweight and easy to use sporting blaster. The Lancer was one of the most popular sporting blasters on the market, specifically designed with competition shooters and hunters in mind; it was optimized for range, accuracy, and stopping power."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Built to the SoroSuub Corporation's exacting standards, the Lancer was a sleek, modern-looking sporting blaster pistol with a long barrel and a weighted, finely-balanced stock, designed for hunters and competition shooters."}, {"tag": "p", "text": "The Lancer was designed with an custom-formulated, highly volatile mix of blaster gasses and a supercharged actuating module to fire an intense, highly concentrated beam over longer ranges. Superior galven patterns in the barrel reduced beam degradation and dispersal, which allowed the pistol to maintain effectiveness beyond other blaster pistols in its class."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Among the most popular models of sporting blaster, Lancer pistols were relatively common in the Outer Rim Territories, appealing to the need for a pistol with both power and a light weight. Many pilots of speeders and atmospheric craft kept a Lancer in an easy-to-reach storage locker, and many starships include them in their escape pods and emergency kits for self-defense. They were also popular among scholars and explorers for their reliability and easy handling, as well as big game hunters who enjoyed the challenge of pistol hunting."}, {"tag": "p", "text": "During the Galactic Civil War, both Rebel and Imperial personnel made use of the Lancer. Rebel pilot Lieutenant Netrem Pollard wielded a Lancer pistol as the leader of Dagger Squadron.\nLater,  during the Battle of Endor, the Alliance's Princess Leia Organa used the Lancer, as did many Rebel starfighter pilots, Imperial gunners, and AT-ST drivers in that same conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}