{"url": "X-34_landspeeder/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles in need of updating", "Category:Landspeeders", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "X-34 landspeeder"}, {"tag": "p", "text": "The X-34 was an open-air/sealed cockpit civilian landspeeder manufactured by SoroSuub Corporation. One famous owner was Luke Skywalker."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Durable if not stylish, the X-34 featured holographic displays, a computer for ground navigation, and a number of repulsor counterbalances for smooth and steady travel over rough terrain. Its maximum altitude was 1 meter (100 cm), but its usual cruising altitude was roughly 10 cm above ground level. It utilized three turbine engines to propel the vehicle forward. Its repulsorfield generator housing was located behind the cockpit. Its power circuit was located in front of the cockpit."}, {"tag": "p", "text": "The X-34 retailed for roughly 10,550 credits new, 2,500 used. It was light and unarmored and lacked weapon mounts, making it unsuitable for military applications, unlike the Flash speeder or the Rebel combat speeder, also manufactured by SoroSuub."}, {"tag": "p", "text": "The open-air landspeeder could be piloted through the use of a steering wheel and foot pedals, and featured a retractable duraplex windscreen. In addition, the vehicle cockpit featured holographic displays as well as a computer for ground navigation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The X-34 landspeeder was active by the Invasion of Naboo in 32 BBY. Eventually, the popularity of the X-34 waned considerably when SoroSuub began manufacture of the XP-38 sport landspeeder, a similar but sleeker model. Luke Skywalker owned a X-34 while growing up on Tatooine, and repaired his X-34 only a short time before he sold it to Wioslea in 0 BBY. A few years later, Skywalker's X-34 landspeeder would later fall into the hands of Wade Vox, who used it as he participated in Jabba Desilijic Tiure's demolition games."}, {"tag": "p", "text": "While they were thought to be obsolete over a century prior, by the year 137 ABY the X-34s were still employed. Imperial Moff Nieve Gromia provided agent Gunn Yage with a 4-seater version to help her infiltrate Mos Eisley."}, {"tag": "h2", "text": "Cultural impact"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The X-34 used in A New Hope was built on the chassis of a Bond Bug."}, {"tag": "p", "text": "In The Phantom Menace, a green X-34 is seen in the background on Tatooine. This is the same speeder that was used in the making of A New Hope, only repainted."}, {"tag": "p", "text": "Roleplaying game sources claim a top speed of 330 km/h, but the SWCCG card Luke's X-34 Landspeeder and sources like The Complete Star Wars Encyclopedia list a top speed of 250 km/h."}, {"tag": "p", "text": "Some sources like The Official Star Wars Fact File give the speeder a length of 7.4 meters. This is however too long in comparison to the driver."}, {"tag": "p", "text": "In the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike, Skywalker's X-34 was drivable in the training mission."}, {"tag": "p", "text": "In Children of the Jedi it is named a \"T-70\"."}, {"tag": "p", "text": "Hasbro incorrectly called it the XP-34 landspeeder for their Star Wars Die-Cast TITANIUM SERIES."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}