{"url": "X-Wing_Rogue_Squadron_%C2%BD", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: X-Wing Rogue Squadron"], "nodes": [{"tag": "h1", "text": "X-Wing Rogue Squadron ½"}, {"tag": "p", "text": "X-Wing Rogue Squadron ½ is a promotional one-shot issue of the Star Wars Legends comic book series Star Wars: X-Wing Rogue Squadron. It was written by Michael A. Stackpole and Mike W. Barr, with art by Gary Erskine, and it features a story set in 0 BBY, immediately before the Battle of Yavin."}, {"tag": "p", "text": "The issue was first published on February 1, 1997 by Dark Horse Comics, and it was distributed through Wizard Entertainment. It was reprinted in Star Wars: X-Wing Rogue Squadron: Requiem for a Rogue (1999) and Star Wars Omnibus: The Other Sons of Tatooine (2012). A digital edition was published by Marvel Comics in 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Before the Battle of Yavin, the Rogue Squadron gets in a dogfight with TIE fighters. Plus, who is the new member of Rogue Squadron?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story begins with the members of Rogue Squadron playing sabacc in a cantina on Commenor. During the game, Wedge Antilles receives a card that says \"Hangar Bay 31,\" and the group leaves. As they arrive in the hangar, a group of men try to extort money from them by claiming that they stopped their landspeeder from being stolen. They quickly attack and disarm the men before meeting up with their contact, Nera Dantels."}, {"tag": "p", "text": "After confirming Wedge's code, she leads them to her ship, the Starduster, and shows them her cargo: several astromech droids. As they leave the planet, a stormtrooper contacts Folor Base and informs them that the ship is leaving."}, {"tag": "p", "text": "Before Rogue Squadron can make the jump to hyperspace, they are attacked by a squadron of TIE fighters. The battle starts in their favor, but Cesi Eirriss' X-wing is damaged, and another squadron of TIE fighters appears. Realizing that there was not enough time to eject and get aboard the Starduster, Eirriss tells Rogue Squadron to jump to hyperspace, and she crashes into the enemy ships."}, {"tag": "p", "text": "After completing the hyperspace jump, Rogue Squadron and the Starduster arrive at Yavin 4 with the astromech droids. Rogue Squadron is then informed that they have a replacement pilot, Luke Skywalker."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}