{"url": "X-Wing_Second_Edition_Core_Set", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Second Edition"], "nodes": [{"tag": "h1", "text": "X-Wing Second Edition Core Set"}, {"tag": "p", "text": "The X-Wing Second Edition Core Set is the base component for the Star Wars: X-Wing Second Edition miniatures game from Fantasy Flight Games. It received a limited early release beginning August 2, 2018 at the Gen Con tabletop-game convention, while its official retail release was on September 13, 2018."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Enter the next era of interstellar combat in the Star Wars galaxy! Out of the X-Wing Second Edition Core Set, you can start to assemble your own squadron of iconic starfighters from across the Star Wars saga and engage in fast-paced, high-stakes space combat with iconic pilots such as Luke Skywalker and Iden Versio. With refined gameplay that focuses on the physical act of flying starships, X-Wing Second Edition lets you create your own Star Wars space battles right on your tabletop. Intuitive mechanics create the tense atmosphere of a firefight while beautifully pre-painted miniatures draw you deeper into the action. Man your ships and enter the fray!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The X-Wing Second Edition Core Set contains two TIE/ln fighter miniatures and one T-65 X-wing miniature, along with all of the maneuver templates, dials, cards, dice, and rules that you need to play the game."}, {"tag": "h3", "text": "Miniatures"}, {"tag": "h3", "text": "Mission scenarios"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Rebel Pilot"}, {"tag": "h4", "text": "Imperial Pilot"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "h4", "text": "Damage cards (Core Set only)"}, {"tag": "h3", "text": "Tokens"}, {"tag": "h4", "text": "Mission tokens"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}