{"url": "X-Wing:_Wraith_Squadron", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: X-Wing"], "nodes": [{"tag": "h1", "text": "X-Wing: Wraith Squadron"}, {"tag": "p", "text": "X-Wing: Wraith Squadron is a Star Wars Legends novel written by Aaron Allston. It is the fifth volume of the Star Wars: X-Wing novel series, and it was first published by Bantam Spectra on February 2, 1998. A sequel, X-Wing: Iron Fist, was published later that year."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "They are the galaxy's most elite fighting force. And as the battle against the Empire rages, the X-wing pilots risk life and machine to protect the Rebel Alliance. Now they must go on a daring undercover mission—as the crew of an Imperial warship."}, {"tag": "p", "text": "It is Wedge Antilles' boldest creation: a covert-action unit of X-wing fighters, its pilots drawn from the dregs of other units, castoffs and rejects given one last chance. But before the new pilots can complete their training, the squadron's base is attacked by former Imperial Admiral Trigit, and Wraith Squadron is forced to swing into action—taking over an Imperial warship and impersonating its crew. The mission: to gain vital intelligence about Trigit's secret weapons, to sabotage the admiral's plans, and to lure him into an Alliance trap. But the high-stakes gamble pits Wraith Squadron's ragtag renegades against the Empire's most brilliant master of guile and deception."}, {"tag": "p", "text": "Are they up to the challenge?"}, {"tag": "p", "text": "If not, the penalty is instant death."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}