{"url": "X2-4", "categories": ["Category:Legends articles", "Category:Capital cities", "Category:Uffel locations"], "nodes": [{"tag": "h1", "text": "X2-4"}, {"tag": "p", "text": "X2-4 was the name of the droid city on Uffel. The original settlement on Uffel was built around the crashed ship which brought QS-2D, R4-S2, R4-J9 and their Twi'lek masters to the moon, killing the Twi'leks in the landing. This settlement was abandoned in order to create X2-4, a larger city for the droids' facilities. X2-4's spaceport was in actuality one massive droid, perhaps the largest ever built."}, {"tag": "p", "text": "The mining of Uffel and the production of droids were X2-4's principal industries. Many of the droids produced on Uffel were sold to help finance the city, but others become new citizens. Since the droids could work continuously and had little desire for money, much of Uffel's income was spent on improvements and expansion of X2-4."}, {"tag": "p", "text": "The droid city had strong defenses. X2-4 produced its own line of highly skilled war droids for local defense (including its leader, HG-211) and covered them with several droid-based space weapons platforms, designed by its creation G-8Y5. Uffel's thick red-brown atmosphere also aided in the defense. In 33 BBY, four pirate vessels attempted to attack X2-4. This served as a successful test of the defense systems, with only one of the vessels managing to reach the surface, where the war droids were able to deal with its crew."}, {"tag": "p", "text": "The droids did not bother to make X2-4 atmospherically sealed, so those who visited X2-4 to conduct business had to wear breath masks and pressure suits. There were some residences for visitors to stay at near the spaceport, and visitors were usually restricted to the vicinity of the spaceport except for during official inspection tours."}, {"tag": "p", "text": "Although the initial mining operation was constructed with financial help by Riboga the Hutt, QS-2D was able to buy Riboga's part in a later date, becoming the sole owner and administrator of the city. Nevertheless, QS-2D maintained the fiction that it was still owned by a living, but reclusive, Twi'lek master by the name of Gor Kolomo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}