{"url": "XR-85_tank_droid", "categories": ["Category:Legends articles", "Category:Arakyd Industries products", "Category:Droid tank classes", "Category:Galactic Empire vehicles", "Category:Fourth-degree droids"], "nodes": [{"tag": "h1", "text": "XR-85 tank droid"}, {"tag": "p", "text": "Manufactured by Arakyd Industries, the XR-85 tank droid was a treaded, automated tank that was part of the Galactic Empire's arsenal."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Arakyd Industries XR-85 tank droid was armed with a heavy particle cannon, two forward light turbolasers, four twin heavy repeating blasters (two at the front, two at the back), and one aft Golan Arms DF.9 laser cannon (for anti-personnel duty)."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The earliest models were roughly the same size as the All Terrain Personal Transport, allowing multiple units to be carried inside a Sentinel-class landing craft. They were used to protect bases, attack Rebel uprisings, and keep the peace on Imperial worlds. However, the prototypes were too expensive for mass production."}, {"tag": "p", "text": "Around 0 ABY, three XR-85s were deployed to attack the wrecked Rebel starship Nonnah. Around the same time, a group protected the Weapons Research Facility on Fest. Many of those units were destroyed in battle there with Rogue Squadron."}, {"tag": "p", "text": "Later models, produced after Grand Admiral Thrawn's return and subsequent campaign, were over twice the size of a standard Imperial AT-AT and more inexpensive and practical to mass-produce. They utilized a pirated Industrial Automaton R7 droid brain matrix, used in the R7-series astromech droid, which made each droid far more independent and intuitive than earlier generations of combat droids."}, {"tag": "p", "text": "Tank droids fought on Coruscant during the Imperial Civil War."}, {"tag": "p", "text": "Cost-cutting by the crumbling Empire made the XR-85s a good alternative to other assault vehicles, as it became more difficult to find or train qualified crew. The production of tank droids was increased in order to bolster ground forces wherever possible."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tank droids first appeared in the Star Wars: Dark Empire comic book, and later appeared in the 1998 video game Star Wars: Rogue Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}