{"url": "X4_Gunship/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Black Sun starship classes", "Category:Gunship classes", "Category:X4 Gunships"], "nodes": [{"tag": "h1", "text": "X4 Gunship"}, {"tag": "p", "text": "The X4 Gunship was an assault gunship built by the Incom Corporation and employed by the Rebel Alliance in their fight against the Galactic Empire during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The ship's multiple decks provided adequate room for passengers and cargo. It was heavily armed with two forward mounted guns, three dorsal mounted turrets and three mounted turrets on its ventral surface. It also carried the heavy shields and armor typical of gunships, along with the relatively slow speeds and maneuvering."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The X4 was designed by Incom to help fill the critical gap in Alliance forces-a lack of heavy-hitting warships. Used as a convoy escort and raider, the gunship was also designed for maximum compatibility, with most of its equipment capable of using the same spare parts used to maintain the Alliance's starfighter forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This gunship, also known as the \"Assault Gunboat\" or \"Rebel Gunboat\" was introduced in the Jump to Lightspeed expansion of Star Wars Galaxies as a NPC ship. They were found in the Kessel system and deep space, but also spawn during several missions."}, {"tag": "p", "text": "In November 2007 Star Wars Galaxies developer Thomas \"Hanse\" Eidson asked the pilot community on the official Galaxies forums for input on the name and in-universe description of the ship. The final name Hanse chose was inspired by a suggestion by forum member \"SonofKashyyyk\" while the description is based on a suggestion by forum member \"LeaphChausew\"."}, {"tag": "p", "text": "The 3 dorsal engine pods on the ship bear a slight resemblance to the R200 Ion Jet Engines found primarily on the Y-Wing."}, {"tag": "p", "text": "With the introduction of Chapter 8 in January 2008, the X4 gunship became available to players as a multiplayer ship available to Rebellion ace pilots. It was one of several ships made playable in Chapter 8 along with the AEG-77 Vigo, the Ye-4 gunship, and the N-1 starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}