{"url": "XQ1_Platform", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic space stations", "Category:Space station classes", "Category:XQ Platforms"], "nodes": [{"tag": "h1", "text": "XQ1 Platform"}, {"tag": "p", "text": "The XQ1 Platform was a common space installation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "XQ1's were made of a single, large central hub module with three large docking bays protruding from the center.\nWhile some were used for military purposes, there were many others that were converted to carry out different missions. The station's armament was variable according to its intended mission. Typically, each XQ1 carried six laser cannons and six turbolaser batteries to defend itself. While this wasn't impressive, it was more than enough to destroy any starfighter, and to hold against targets as big as corvettes."}, {"tag": "p", "text": "These stations also carried three squadrons of starfighters to assist in defense. Typically they were of the TIE series, but other ships could just as easily be used.[source?]"}, {"tag": "p", "text": "The platform has variable uses. The Galactic Empire used it to extend its control across remote star systems. Many corporations used it in commerce and scientific research."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The XQ1 design, first released less than five years before the beginning of the Galactic Civil War, was produced in large numbers by Bengel Shipbuilders due to its quick assembly time (a few weeks) and multipurpose capabilities. It was originally designed for use at Ord Thoden until the Corporate Sector Authority purchased large numbers of the stations."}, {"tag": "p", "text": "Many were used as simple stations and outposts by various organizations. The Galactic Empire, Rebel Alliance, Corporate Sector Authority, and a number of businesses used the platforms for research and development, command posts, and customs stations. This diversity of usage made it a popular choice for a light space installation.\nThe stations were used by the Galactic Empire as a command post to extend Imperial control in the Outer Rim Territories and remote star systems."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}