{"url": "Xamster/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Outer Rim Territories species", "Category:Reptilian sentient species", "Category:Xamsters"], "nodes": [{"tag": "h1", "text": "Xamster"}, {"tag": "p", "text": "Xamsters were a species of sentient reptiles who hailed from the Outer Rim planet Xagobah. Xamsters were characterized by their large ears, red or green eyes, and bicuspid beaks. Their scaly skin ranged in color from yellow to purple and sported several spiky crests. The reptiles stood slightly over one meter tall on two short legs with splay-toed feet. They had formidable claws and fangs. Their brains were capable of quickly and efficiently processing sensory input."}, {"tag": "p", "text": "The Xamsters cohabited with the myriad fungal lifeforms on Xagobah, caring for the malvil-trees and enjoying food, shelter, and useful spores in return. Much of Xamster technology centered on the harvesting and implementation of spores. Members of the species tended to be polite and peaceful with outsiders. Xamsters could be found off-world; the podracer Neva Kee participated in the Boonta Eve Classic of 32 BBY, for example."}, {"tag": "p", "text": "During the galaxy-spanning Clone Wars, Xamsters found themselves confronting Separatist forces led by Wat Tambor of the Techno Union. The Separatist leader sequestered himself in a citadel called Mazariyan and enslaved Xamsters to defend him from the forces of the Galactic Republic. When Republic forces did arrive, they, too, drafted Xamster soldiers, and the species' population centers thinned to the point that not enough Xamsters remained to tend to the malvil-trees. A young bounty hunter named Boba Fett arrived during the Battle of Xagobah and befriended a member of the species named Xeran. With the help of this Xagobah native's knowledge of spore-based technology, Fett infiltrated Mazariyan and allowed the Republic to rout Tambor and his forces."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Xamsters were sentient, bipedal reptiles who walked on squat, bowed legs ending in flat feet with four splayed toes and dark, raised nails. Their arms, in contrast, were long, thin and muscular, and terminated in clawed, four-fingered hands. Members of the species ranged in height from as small as 1.07 meters to taller than a twelve-year-old Human. Each Xamster had a bulbous abdomen, which narrowed to a sunken chest and a long, thin neck. The reptiles were covered in loose folds of scaly skin that ranged in pigmentation from purple to green and yellow. This coloration could vary in a single individual: for instance, the Xamster Neva Kee featured one hue on the back of his torso and head, and the outside of his arms and legs; while scales of another color covered his belly, neck, and throat, and the insides of his arms, legs, and ears. Three crests of spiky growths punctuated the Xamster hide: one ran from the midpoint of the spine to the posterior, another ran down the length of the belly, and a third went from the dome of the head down the back of the skull."}, {"tag": "p", "text": "The head itself was dominated by two bat-like ears that stood erect at both sides of the elongated, high-domed skull. The ears could be parti-colored, with insides and outsides of different hues. The cranium angled from a point in the back downward to the visage. The face tapered to a beak with two sharp, downward-curving points. Although this beak lacked lips, Xamsters were able to smile, a gesture that revealed their mouthful of white, razor-sharp teeth. Two small nostrils on the beak facilitated respiration, and two large, ellipsoidal eyes with pointed ends peered from beneath bony eye sockets. These lidless orbs could be jade green or red. The Xamster brain was specialized to process sensory information quickly."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Xamsters lived in communities deep within the fungal forests of their homeworld. They coexisted symbiotically with the fungi: a family of Xamsters bound themselves to a particular type of fungus known as a malvil-tree and treated it like a beloved pet or even a member of the family. The reptiles gave their own malvil-tree a name and tended to its growth and feeding. In return, the tree permitted the Xamsters to take up residence inside it and obeyed simple commands, like raising or lowering its branches to afford the caretaker a better look at the surrounding terrain. Most importantly, the family was able to harvest the tree's spores. They could use these fungal products for diverse tasks. For example, certain spores could be used to coat someone's eyes, granting the ability to peer through the fog of spores that shrouded the surface of Xagobah. Malvil-tree spores also granted safe passage through the forest to those who coated themselves in it; otherwise, other hungry trees might mistake the traveler for a meal. Xamsters knew of other useful fungi as well, including Xabar, which could be used to make a potent form of spice with the power to paralyze the user. Although offworlders used Xabar to simulate death and, they hoped, gain a glimpse of the afterlife, Xamsters used its coma-inducing properties to fake death and thus escape enemies."}, {"tag": "p", "text": "By the time of the Clone Wars, Xamsters had adopted the same technology used throughout the galaxy to supplement their fungal tools. For example, members of the species fought with blaster rifles during hostilities on their world. Although some Xamsters went nude, others wore pouches to carry possessions, and others wore simple clothing, such as robes. Those engaged in fighting on Xagobah wore purple-gray camouflage to blend in better with their planet's terrain."}, {"tag": "p", "text": "Xamsters were naturally kind and non-violent. They spoke a language of sharp clicks and guttural growls. Their laughter especially sounded like growling, although a smile conveyed that the deep rumbling noise indicated amusement and humor rather than anger. The species reckoned time based on what they called the \"turns of Xagobah.\" Some Xamsters went by two-part names, such as Neva Kee, while others introduced themselves by one name alone, such as Xeran."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Xamsters evolved on Xagobah, a world that circled a blue sun and that was covered in such a prevalence of fungal lifeforms that violet spores permeated the fetid air and covered the surface in a thick, purple haze. While offworlders who visited the planet had to keep out of the world's harsh sun to avoid being burned, and wear breath masks or take antidotes to counteract harmful spores, lest they be poisoned, Xamsters evolved to tolerate such conditions and to live closely with their planet's most dominant form of life. The reptilian species learned to harness these native fungi, cultivating certain species to harvest specific spores that could perform helpful tasks. In particular, the fungus known as the malvil-tree became an integral part of Xamster culture as families learned to domesticate them for shelter and spore cultivation."}, {"tag": "p", "text": "Representatives of the galaxy beyond Xagobah first reached Xagobah's region of space sometime between 3000 and 1000 BBY. The world lay on an offshoot of the Rimma Trade Route that ran from the Colu to Sharlissia systems. As the planet became integrated with the galaxy, Xagobah became part of the Mayagil sector of the Outer Rim Territories."}, {"tag": "p", "text": "Offworlders became more common on the world, some drawn to learn a martial art called Tal-Gun, and others by the Mayagil sector's amenability to smugglers. Off-world interests also brought war to the region, and from 1,004 to 1000 BBY, Xagobah fell within the confines of the Sith Empire during the New Sith Wars."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "At some point between 52 and 32 BBY, Xagobah became a pawn of Sith Lord Darth Sidious as he manipulated the politics of the Galactic Republic behind the scenes, setting the stage for his alter-ego, Palpatine, to become the emperor of the entire galaxy. When the conflict known as the Clone Wars erupted—thanks to Sidious' machinations—the Confederacy of Independent Systems consolidated its forces in the Rim and sent General Grievous to capture Xagobah."}, {"tag": "p", "text": "In 20 BBY, Xagobah gained a new resident: Wat Tambor, head of the Techno Union and a high-ranking leader in the Confederacy. Tambor molded the native fungi to his will, bioengineering them to form a huge, pyramidal fortress known as the Mazariyan Citadel, a supposedly impregnable redoubt in which he sequestered himself. Meanwhile, Tambor and his forces rounded up Xamsters from the forests of Xagobah to press them into his service; those who refused were summarily executed. By 19.5 BBY, Tambor had embedded himself in a swarm of droid tanks, spider droids, and top-of-the-line battle droids."}, {"tag": "p", "text": "The Galactic Republic sent clone troopers under the command of Jedi Master Glynn-Beti to take Tambor into custody. They besieged Mazariyan while Republic starships battled the Confederacy in space around the planet. When the Republic commanders realized that they could not sustain their siege with the manpower they had available, they also took to rounding up Xamsters to force them to fight for their side. Such conscripted soldiers were paid for their service, but they were not given the chance to turn down their summons to military duty. The ongoing hostilities thus forced scores of Xamsters to take up arms, most of whom had never before handled a weapon. Xamsters died in great numbers, and their sylvan communities thinned out to such an extent that family malvil-trees went untended and began to die off."}, {"tag": "p", "text": "A Xamster named Xeran lost most of his family to the fighting, leaving him the sole custodian of the family malvil-tree, Malubi. In 19.42 BBY, Xeran came across a young Human boy trapped inside a carnivorous fungus called a flimmel tree. The boy blasted his way out, leading Xeran to suspect him of being yet another violent offworlder—little did the reptile know that the Human was actually a twelve-year-old bounty hunter by the name of Boba Fett, who had been sent to Xagobah by his boss, Jabba Desilijic Tiure, to capture Wat Tambor for the Republic. Xeran led the boy to his family malvil-tree and eventually came to trust the stranger's story that he was an enemy of Wat Tambor's. In the end, the Xamster decided to help the young bounty hunter in his quest. He provided the Human with different types of spores that could aid him in penetrating Mazariyan and apprehending the Separatist leader inside."}, {"tag": "p", "text": "During the encounter, the young Fett felt sympathy for the plight of Xeran and his people. This only fueled his determination to take Tambor's head back to Jabba. The Xamster's gifts proved instrumental in gaining entry to the fortress, but once inside, Fett found Grievous, who proved more than a match for the young Human. The boy used Xeran's Xabar fungus to fake his own death and avoid being killed by the Separatist leaders. Although Fett failed to capture Tambor, he allowed the Republic forces to also breach the hideout, sending Tambor and Grievous to flight. Their departure obviated the presence of the Republic ground forces, who also left, and the Xamsters of Xagobah were once again left in peace, albeit as a Republic-held world."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "After Palpatine's maneuverings secured him the throne of the Galactic Empire, the Alliance to Restore the Republic launched the Galactic Civil War. When the Empire was defeated at the Battle of Endor in 4 ABY, the government splintered into squabbling factions. Xagobah fell within the domain of one of them, the Eriadu Authority. By 9 ABY, however, the world and its general region of space had become part of the holdings of the New Republic, the successor to the Alliance; it remained within New Republic territory until at least 11 ABY. The population of the world was somewhere between 10 and 100 million c. 25 ABY. Over a century later, in 137 ABY, the Xamster homeworld had fallen into territory controlled by Darth Krayt's Galactic Empire, but it fell within the sphere of influence of the Galactic Federation of Free Alliances, the government that Krayt had toppled."}, {"tag": "h2", "text": "Xamsters in the galaxy"}, {"tag": "p", "text": "One Xamster who became well-known off Xagobah was Neva Kee, who made a name for himself on the professional Podracing circuit. Kee's unorthodox racing tactics earned him a reputation as a maverick. This status was exemplified by his unusual Podracer, a Farwan & Glott FG 8T8-Twin Block2 Special, which, unlike most other vehicles in the races Kee entered, had its engine and body joined as a single unit. Kee's rebellious nature earned him many enemies in the sport, but it also garnered the adulation of a large base of fans, who treated Kee as a superstar. Nevertheless, the Xamster kept his cool and single-mindedly pursued his goal to dominate his sport. In 32 BBY, Kee was the favored racer on the Baroo Coast track on the planet Baroonda. The Xamster's ambitions were brought to an end during the Boonta Eve Classic Podrace on Tatooine that same year: the pilot strayed from the course in the second lap, never to be seen again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The art department of Industrial Light & Magic created the Xamster Neva Kee for the Podracing sequence of Star Wars: Episode I The Phantom Menace, released in 1999. During the preproduction process, as early as 1996, concept sketches by Terryl Whitlatch were considered interchangeably for both Kee and Wan Sandage, another Podracer pilot. After George Lucas chose the final versions of these two characters, the production team sculpted a detailed character maquette of Kee. Although the podracer pilots were intended to be clothed in The Phantom Menace, and concept drawings of Kee in podracing gear were generated, photographs of the nude maquette have since appeared in numerous sources as Kee himself, rather than as production art. In the final film, Kee appears only as a low-resolution computer-generated character seated in his racing vehicle."}, {"tag": "p", "text": "Several sources provide a brief outline of Kee's career, and he appears in the video game Star Wars Episode I: Racer. The game gives his unusual podracer good traction but a poor top speed. Aside from Kee's story, for years little was known about the species as a whole aside from their appearance. Finally in 2004, author Elizabeth Hand expanded on the Xamsters and their culture in her novel Boba Fett: A New Threat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}