{"url": "Xagobah/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Planet stubs", "Category:Arboreal planets", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Mayagil sector planets", "Category:Techno Union planets"], "nodes": [{"tag": "h1", "text": "Xagobah"}, {"tag": "p", "text": "Xagobah was a planet located in the Xagobah system, just inside the border with the Outer Rim Territories, and was the homeworld of the Xamster race."}, {"tag": "p", "text": "The Xagobah system had a blue sun."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "From space, Xagobah appeared to be a cloud-covered world that was shrouded in purplish mists. This was caused by the incredible amount of spores and pollen found in its atmosphere, given off by all manner of trees and fungi. While most of the planet's spores were harmless, some varieties caused certain changes in off-worlders. As such, taking an antidote prior to exposure was recommended for those unaccustomed to the planet's environment. The fungi that produced these billions of spores resembled giant mushrooms and were found in a variety of forms. Carnivorous varieties like the flimmel tree and Xabar fungus had the ability to immobilize their prey through the use of a green, sheet-like adhesive, or through the injection of a paralyzing toxin. The malvil-tree, on the other hand, was a far more docile fungus, with numerous tree-limb like tendrils that could actively move, pick up objects, and support members of the native Xamster population."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to Separatist occupation of Xagobah, the native Xamster race, reptilian-looking practitioners of the Tal-Gun martial arts technique, lived in relative peace. Xamster families held bonds with malvil-trees, which seemed to possess some sort of sentience, but after the war found the planet, Xamsters were either used as laborers or hired by the Republic to fight the droid armies of the Mazariyan. This left the native population devastated and the malvil-trees largely unprotected. Little is known as to what happened to them after the end of the war."}, {"tag": "p", "text": "In 21 BBY, the planet was conquered by the Confederacy of Independent Systems. During the Outer Rim Sieges, there was a CIS buildup at the world, headed by Wat Tambor of the Techno Union. Here, Tambor experimented on the native plant species and bioengineered many of them to serve his own ends."}, {"tag": "p", "text": "The planet was liberated by the Galactic Republic in 20 BBY, though around this same time, the Iron Knight, Firkrann, was killed in a duel with General Grievous on the planet."}, {"tag": "p", "text": "It was during the liberating battle that young Boba Fett attempted to collect a bounty on Wat Tambor's head, but failed. Asajj Ventress had supposedly helped Wat Tambor escape by damaging Boba's ship, the Slave I; however, Ventress had already been betrayed by Dooku at this point, and fled into hiding to escape the war. Boba's true assailant could have been Ventress herself, but was likely another."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}