{"url": "Xamar", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Jedi Masters of the Jedi Order", "Category:Jedi Seers", "Category:Khil", "Category:Males", "Category:Members of the Jedi Covenant", "Category:Republic Navy officers"], "nodes": [{"tag": "h1", "text": "Xamar"}, {"tag": "p", "text": "Xamar was a male Khil trained as a Jedi by Krynda Draay following the Great Sith War, who later took part in the Padawan Massacre of Taris. After being discovered to be Force-sensitive as a youth, he was taken to the Draay Estate on Coruscant to be trained as a Jedi Consular, along with a group of other talented students. Together, this group's abilities were far greater than the sum of their parts, and their teacher, Krynda Draay, believed they were the group she had prophesied would vanquish the threat of the Sith. After completing their training, Xamar and the others were inducted into the secret, cabalistic Jedi Covenant, and formed the First WatchCircle, though he spent some time serving with both the Republic Fleet and the navy of his homeworld. Early in the Mandalorian Wars, the First WatchCircle took on a group of Padawans on Taris, with Xamar training a Nagai named Gharn."}, {"tag": "p", "text": "However, the WatchCircle had a vision of one of the Padawans turning to the dark side and slaying them all, and they decided to kill each of their Padawans to prevent it from happening. Xamar was far more cautious about the massacre than his peers, but ultimately slew Gharn with his lightsaber. One of the Padawans, Zayne Carrick, escaped, and the WatchCircle made him a scapegoat for the murders, but was unable to apprehend him. After Covenant members Raana Tey and Feln had been killed inadvertently by Marn Hierogryph, the WatchCircle's leader, Lucien Draay, assigned Xamar to Republic Admiral Saul Karath's flagship, Courageous, to try to prevent Carrick from reaching Coruscant and exposing the Covenant to the Jedi Order proper. In Xamar's earlier vision, he had been killed by friendly fire while aboard a Republic ship; rather than waiting to meet his fate, he decided to take the initiative and make his own luck. He fled the Republic ship, captured Carrick personally, and presented him to the Jedi Council. Xamar confessed to killing the Padawans and supplied the Council with information on the Covenant. Enacting a plan formulated by Xamar and the Council, the Khil took Carrick to the Draay Estate, pretending to have captured him by force, though things went awry, and his plot was foiled by Krynda's retainer, Haazen. A force of Jedi Knights supplied by the Council arrived, and Xamar clashed blades with a number of Covenant members before fleeing outside. There, he was killed when an overhead Republic ship fired on his position."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Seer"}, {"tag": "p", "text": "Xamar was a Khil born on the planet Belnar around the time of the Great Sith War. He was found to be Force-sensitive as a youngling and was taken to the Jedi Order on Coruscant for training, like many Khil before him. He had strong precognitive skills, often seeing vivid visions with glimpses of the future, and was ultimately taken in by famed Jedi Master Krynda Draay for training as a Consular at her estate on Coruscant around 3993 BBY. Draay had previously renounced the Jedi and refused to train any more apprentices after the death of her husband in the Great Sith War, though she agreed to take on a number of students, including Xamar, because of their exceptional talents. Alongside the young Khil, the group included Feln, a Feeorin; Raana Tey, a Togruta; and a number of Miraluka, among them Q'Anilia."}, {"tag": "p", "text": "Krynda trained each of them in the arts of divination for a number of years, and Xamar in particular grew extremely loyal to her. Krynda's son, Lucien Draay, also frequented the estate during their training, though he had no precognitive abilities and only a basic command of the Force, so Krynda had little interest in him. Instead, Draay's aide Haazen trained Lucien, though he also gave the other students training in the more physical elements of being a Jedi. Xamar was taught to wield a lightsaber efficiently, and became a reasonably skilled combatant, though he and his fellow Consulars paled in comparison to Lucien Draay, who was a skilled warrior like his late father. Five years after first beginning their training, and with all the Miraluka except Q'Anilia no longer part of the group, Xamar and his peers engaged Lucien in a lightsaber sparring session, with Haazen looking on. Lucien made short work of them, incapacitating first Feln and then Raana Tey, before knocking Xamar's weapon from his hand and throwing the young Khil to the ground. Lady Krynda arrived in the hall immediately after her son defeated Q'Anilia; furious that her precious students were being attacked, she told Haazen, in front of Xamar and the others, that the group was the one she had foreseen and the one she was waiting for, who would \"do what must be done.\""}, {"tag": "p", "text": "Krynda believed that her four talented seers would be able to locate and prevent the re-emergence of the Sith; together, their Force seeing abilities were far more concentrated and effective than when they meditated alone, and Krynda hoped they would be able to foresee any Jedi turning to the dark side. After they were Knighted, Krynda inducted them into the Jedi Covenant, a secretive Jedi cabal founded by Krynda and Haazen, which was dedicated to using whatever means necessary to stop the Sith. The Covenant was unknown to the Jedi Council, and its members were not above breaking the Jedi Code and using illegal means to achieve their ends. Xamar, Feln, Q'Anilia, and Raana Tey formed the First WatchCircle, along with Lucien Draay, who would act as de facto leader and an intermediary between them and the Covenant. The First WatchCircle would be paired together on assignments, carrying out the normal day-to-day duties of Jedi, but they were constantly on the watch for potential future Sith. Haazen's contacts ensured that they were never split up by the Council. Xamar was somewhat wary of being in such a secretive group, and he often found himself wishing all their actions were done through the proper channels. He became close friends with Q'Anilia, though he often clashed with Lucien Draay. Xamar was a cautious individual, unlike the often brash Draay; however, Xamar was content to let Draay lead the group once Krynda kept him in check, knowing the Human Jedi was a better leader than he was."}, {"tag": "h3", "text": "The Rogue Moon Prophecy"}, {"tag": "p", "text": "Though the Khil were a peace-loving species, they had their own navy, to which even Khil Jedi were called to serve. At some point in his life, Xamar returned to Belnar to serve for a time, and he kept his naval uniform long afterward. He also had considerable experience working with the Republic fleet, and had a keen knowledge of capital ships. Eventually, Xamar, Feln, Q'Anilia, Raana Tey, and Draay were made Jedi Masters. Several years before 3964 BBY, the First WatchCircle was posted to the Outer Rim world of Taris. Inhabiting a satellite Jedi Tower, they each took a Padawan learner; Xamar's was Gharn, a talented Nagai Jedi. Around this time, Xamar began investigating rumors that the Muur Talisman, an ancient Sith artifact created by Sith Lord Karness Muur, was buried on Taris, and he began to search for it on behalf of the Jedi Covenant. His search yielded no results, but he hoped to continue until he found the talisman. Additionally, he spent much time researching the talisman; he learned that it could turn nearby sentients into subservient creatures, but that it had no effect on Force-sensitives. He compiled a report and sent it to the Covenant on Coruscant, suggesting that a Covenant Shadow should be sent on a mission to help him locate it and neutralize its threat once the Padawans' training was completed."}, {"tag": "p", "text": "Xamar and his comrades continued training their Padawans for a number of years, until they were close to Knighthood. In 3964 BBY, all ten of the Masters and Padawans made the short journey to Taris's rogue moon, where the Padawans would face a trial—their last before they would either be granted or denied Knighthood—which involved attempting to find their way back to camp while blindfolded. As Draay and the others explained to their students, meteorites rained down on the planet constantly, making every step potentially their last. Xamar and the three other Consulars in the WatchCircle hoped to spend the time it took their students to return to the base camp meditating, as Q'Anilia believed the Force would flow freely on the rogue moon. They had a droid designated T1-LB set up a force field to protect them from the debris, and went about using the collective meditation techniques taught to them by Lady Krynda."}, {"tag": "p", "text": "Almost immediately after beginning, the four each saw a vivid precognitive vision—dubbed the Rogue Moon Prophecy—one after the other. Raana Tey saw herself perish on Taris, Feln on his homeworld of Odryn. In Xamar's vision, he was with the Republic fleet, about to achieve victory over the Mandalorians, before the ship he was in was fired on by another Republic vessel. He perished in the vision, as did Q'Anilia; a mysterious figure in a red environmental suit was responsible for each of their deaths. Draay roused them from their collective trance before long, and they expressed to him their interpretation of the policy: that the Sith would return, and that one of their Padawans, who were each wearing a red environmental suit, would turn to the dark side and kill each of them. Raana Tey advocated killing each of the Padawans then and there in order to vanquish the threat, to which Feln agreed, believing it was a clear message from the Force. Xamar was far less certain, claiming that the Force's swirling, ever-changing nature may have clouded its meaning."}, {"tag": "p", "text": "Each of the Consulars, Xamar included, knew what they saw, and Draay opined that they had to act, and quickly. Xamar clashed with him, wanting to return to Taris and contact Coruscant to get Krynda's approval before doing anything. The Khil refused to take part in any massacre of the Padawans, unless the four told the Covenant leadership what they had seen. Draay was swayed, and promised to make contact; in the meantime, they would return to Taris and act like usual. Draay also Force pushed T1-LB off the edge of a cliff, seemingly destroying the only evidence of their plot."}, {"tag": "p", "text": "After their Padawans had completed their assignments, Xamar and his peers returned with them to Taris, showing no indications that anything had changed. They believed that the prophecy would not come true for some time, so were content to bide their time and see what would happen. However, not long after the Rogue Moon Prophecy, Q'Anilia fainted, informing the others that something had changed, and that something bad would happen soon. Assuming it was related to the Rogue Moon Prophecy, Draay informed the other WatchCircle members that they would shift their plans forward and carry out the murders as soon as possible after getting approval from the Covenant on Coruscant. Draay claimed to have contacted Krynda, though he had in fact told only Haazen of their vision and plan. Xamar was still unsure about the plan, though Draay refused to tell him exactly what Krynda had supposedly said, but merely that she had approved of the massacre. Xamar grudgingly relented and agreed to do his part in the killing. They decided to carry out their plan at the students' Knighting ceremony, and beforehand held a banquet for each of the Padawans and any of their friends or relatives on Taris. The Masters felt it was important to make their apprentices' last day pleasant. After they had carried out the killings, their cover story would claim that Shad Jelavan, one of the Padawans, was refused Knighthood and, enraged, slew his classmates before being put down by the Masters."}, {"tag": "h3", "text": "Massacre and hunt"}, {"tag": "p", "text": "Later that evening, the Masters held the private Knighting ceremony in the Jedi Tower. They each had their lightsabers ready at hand, pretending that wearing them was a traditional aspect of the ritual. Before they could make use of the lightsabers, though, they had to wait for Padawan Zayne Carrick, who was late as usual. While they waited, Shad Jelavan noticed that Draay, Carrick's master, was carrying his lightsaber also, leading the young Knight-to-be to believe that his good friend had also been selected to become a Knight—something that was not expected, as Carrick was largely considered a buffoon by student and Master alike. Trying to buy time before Carrick's late arrival, Xamar, Draay, and Raana Tey attempted to persuade the Padawans that he was ready, though Jelavan and the others disagreed, and sensed that their masters were lying. The Padawans confronted them, and feeling they had no other option, the four members of the First WatchCircle drew their blades, and slew each of their Padawans."}, {"tag": "p", "text": "Carrick arrived moments later, to see Xamar standing over Gharn's lifeless body, lightsaber still in hand, alongside the other Masters, who were in similar poses. He immediately turned around and fled toward the elevator shaft. Draay attempted to persuade him to stop and accept his fate, but Carrick refused and pried open the elevator shaft doors with his lightsaber before jumping into the dark abyss. Xamar and the others jumped down in pursuit, following Carrick into a droid storage chamber, though he managed to escape them. They eventually reached him as he mounted an airspeeder, to which petty criminal Marn Hierogryph was chained. Xamar held back with Q'Anilia as Raana Tey, Feln, and Draay gave chase in airspeeders of their own. Raana Tey and the others were unsuccessful, and soon returned to the Jedi Tower. The bodies of the Padawans were taken to a morgue by droids, and the four Jedi Consulars attempted to use divination to discern where Carrick had fled to. Before long they had a vision of him and Hierogryph in the Taris Undercity, which Xamar reported to Draay."}, {"tag": "p", "text": "Xamar remained at the Temple while the other four Jedi Masters traveled to the Undercity in search of Carrick. He contacted Tarisian Sector Constable Noana Sowrs of the Taris Civil Authority, informing her of the situation and, per Draay's instructions, using Carrick as a scapegoat, claiming he had killed his peers. Sowrs believed the story and agreed to send all available personnel in search of Carrick and Hierogryph. In contacting her, however, Xamar alerted those on Coruscant to what had transpired, and he was soon prompted to provide details. Alarmed, he delayed them as best he could, stalling until he could contact Draay and receive further instruction. Constable Sowrs informed the Khil Master that her personnel had made a number of sightings of Carrick and his accomplice on their way toward the refugee camps near the Undercity. Xamar contacted Draay, asking him what he should report back to Coruscant, though Draay was uninterested—he only wanted news of Carrick. Xamar relayed Sowrs' information to him; Draay and the others eventually located Carrick, but he was able to escape aboard the starship Last Resort and leave Taris."}, {"tag": "p", "text": "Draay had a few more close encounters with Carrick, but was ultimately unable to apprehend him. On the rogue moon of Taris, Carrick uncovered T1-LB's remains and watched the droid's last recording, learning of Xamar's and his peers' prophecy. The Covenant put out a bounty on Carrick. After a short time, he was captured by Twi'lek bounty hunter Valius Ying, who took him to the Jedi Tower. Xamar gathered with the other Masters to meet with Carrick; they hoped to discuss their actions with him and tell him about their motives before killing him. Ying and Carrick were scanned for weapons by a security droid before entering the Masters' meeting chamber, though Hierogryph was not with him, to Draay's anger. Ying claimed to have found Carrick alone and theorized that his comrades had perished on the rogue moon, though the Consulars were able to discern that Hierogryph still lived, and sensed some deceit in Ying. Disregarding the fact that Ying had only brought Carrick and not his accomplice, the Masters told him that they were part of a Jedi Covenant dedicated to rooting out the Sith, and recounted their actions on the day of the massacre to him. Draay then killed the bounty hunter and told Carrick that Hierogryph and his other accomplices would also perish, as they knew too much, before the five Masters prepared to finally murder Carrick."}, {"tag": "p", "text": "As they prepared to strike him down, however, the power and security measures suddenly failed, and a bomb exploded above them. The glass dome that acted as the Tower's roof collapsed and rained glass down onto the Jedi, and a being wearing a red enviro-suit and wielding a lightsaber burst into the chamber. Xamar and his colleagues had dropped their lightsabers and were unable to stop the intruder—whom they believed could have been the Sith Lord of their vision—before the individual reached Carrick. The possible Sith revealed herself to be Jarael, one of Carrick's accomplices, and used low-gravity booster jets to propel her and Carrick out of the chamber. Xamar and the others filed out onto the Tower's roof, but Carrick escaped again aboard The Last Resort."}, {"tag": "h3", "text": "Facing the Council"}, {"tag": "p", "text": "The Jedi Council on Coruscant soon learned of the Padawan Massacre of Taris, and they were not impressed in the slightest by the five Masters' inability to recapture Carrick after having allowed him to escape twice. Around the same time, the Mandalorian Neo-Crusaders began encroaching on the Republic territory near Taris, but neither the Republic nor the Jedi sent reinforcements to protect the planet. The local populace, infuriated, began rioting and kidnapped Sector Constable Sowrs' children. For three weeks the Jedi Masters remained in their Jedi Tower, with Raana Tey wanting to do something to stop the riots. However, ultimately, it would not be their mandate, as the Council contacted Draay and Xamar to inform them that the five Masters were being recalled to Coruscant for an audience with the Jedi Council. The Councilors weren't happy with the results of their collaboration, and felt that their authority had been undermined. Xamar could not disagree with them, and was resentful towards Draay for what he saw as his poor handling of the entire Carrick situation. He expressed his frustration and anger in front of his colleagues through sarcasm when he and Draay announced the Council's intentions to Tey, Feln, and Q'Anilia. Moments later, a hologram transmission sent by a droid arrived, bearing Lucien Draay's name. The hologram was of Zayne Carrick, and he vowed to track down each of the Masters and kill them. If someone gave him or herself in and absolved Carrick of any blame, the fugitive Jedi said he would spare them. Carrick ended the transmission by saying that, should he go over to the dark side as prophesied, then the Masters were to blame."}, {"tag": "p", "text": "In response, the Jedi Masters traveled to Coruscant immediately. Using his contacts in Republic Security, Xamar inquired about the hunt for Carrick, but he was told that their resources were stretched too thin with the Mandalorian Wars to devote much to finding Carrick. Xamar and the other three seers in the WatchCircle subsequently met with Draay outside the Draay Estate, where he had been refused entry to see Krynda. After Xamar reported the situation, Draay contacted Republic Security's administrator, berating him and informing him that Xamar would be sent to oversee their efforts. He also threatened to send over Raana Tey, widely considered to be rash and wild, in Xamar's place if the administrator did not intensify his efforts immediately."}, {"tag": "p", "text": "The four of them later traveled to the Jedi Temple to meet with the High Council. As they entered the chambers, they encountered Revan and Alek, two renegade Jedi who were taking the fight to the Mandalorians, against the Council's wishes. The Council, including Masters Vandar Tokare, Vrook Lamar, and Atris, was dissatisfied with the fact that, although they were supposed to be their students' mentors as well as guardians, they had allowed them to be killed. Draay requested that the Council allow him and his peers to put these wrongs right and lead the search for Carrick, though Lamar vehemently denied them that right. He was suspicious about how the five of them continued to end up working together on assignments, and claimed that it would stop that day. They were to be reassigned to separate postings, and the hunting of Carrick would be left for others to carry out. This prompted an angry outburst from Raana Tey, but Draay was able to control her, and they left the chambers without further disruption."}, {"tag": "p", "text": "Xamar wanted to inform the Council of their vision and the potential danger presented by Carrick's future, but when he voiced this outside the Temple, the others disagreed. They argued that if the Council was unable to act when faced with the threat of the Mandalorians, they would certainly ignore prophecies about a potential Sith Lord. The Masters then parted ways to carry out the assignments given to them by the Council. Xamar was still in occasional contact with Draay, who wanted them to keep up their attempts to locate and detain Carrick. However, Carrick's threat on Taris was not idle, and Raana Tey was killed on that world—just as the prophecy had predicted."}, {"tag": "h3", "text": "Later actions"}, {"tag": "p", "text": "Xamar and Feln returned to the Draay Estate for Tey's memorial ceremony, meeting with Draay and Q'Anilia. The memorial was held in a garden courtyard at the estate, where a large statue of Tey had been erected. During the service, however, Xamar, Feln, and Q'Anilia found themselves in a trance-like vision; they were back on Taris, fighting off hordes of rakghouls, a species of deformed mutant which inhabited the lower levels of the planet. In the vision, Q'Anilia realized that the rakghouls—which were supposed to be mindless creatures—were using intelligent thought. Xamar attempted to guide the sightless Q'Anilia to safety, though Feln was unable to help him as he was himself occupied with organized rakghoul attacks—orchestrated by a mysterious figure wearing what Xamar knew was the Muur talisman. The three Consulars were unsure if what they were seeing was happening in the present or the future; as if in reply, an apparition of Zayne Carrick appeared, along with three other men, each of them telling that the vision was happening in each of their respective time-frames."}, {"tag": "p", "text": "With that, their vision ended, and they returned to the physical world. Draay was furious with them for their perceived disrespect of Tey, though Xamar dismissed his comments, telling Draay that knowledge could not be called upon whenever it suited them. Xamar and Q'Anilia informed Draay that they had seen the Muur talisman, which caught his attention. The talisman was an ancient Sith artifact that predated the reign of Naga Sadow, which, when worn, allowed the user to access ancient and mysterious powers. The rakghouls were known to be native only to the planet Taris, Zayne Carrick's last known whereabouts, and the Consulars believed that the rakghoul plague in their vision could be started by Carrick if they did not act. Feln volunteered to travel to Taris and find the talisman, but Draay knew that the Council would never allow it, so he opted to send one of his Covenant Shadows, Celeste Morne, to track down Carrick and bring the talisman to a storehouse on Odryn. Morne had performed well in previous assignments, capturing items such as the Eye of Horak-mul, and though Xamar had some doubts that she was too young, she was approved by the four remaining WatchCircle members."}, {"tag": "p", "text": "Morne was dispatched immediately to Taris and was given the report Xamar had made some time prior, back on Taris. Things went awry, however, with both Morne and the talisman disappearing on the planet Jebble; the Covenant believed that Carrick had had a hand in both incidents. Xamar was with Q'Anilia when Feln was killed trying to apprehend Carrick on Odryn—killed with his own weapon, just like in the vision. Xamar and Q'Anilia attempted to reach Draay, but were unable to contact him for many hours. They finally met with him in the Draay Estate, and informed him what they had seen, but he already knew. Draay berated Q'Anilia for losing control and displaying her anguish that the prophecy was coming true, informing them that things had become serious. Draay was in a furious mood, and a defiant Xamar asked him if it hadn't been serious when they committed mass murder on Taris. This prompted an irate response from Draay, who throttled the diminutive Xamar against the wall."}, {"tag": "p", "text": "After Draay released Xamar, Q'Anilia asked to be allowed admission to see Lady Krynda; he refused, telling her and Xamar that any such liberties would have to wait until they had washed their hands of Carrick. Afraid that Carrick and his accomplices might come to Coruscant and give the Jedi Council evidence of the Sith artifact containment facility they'd discovered on Odryn, Draay informed Xamar that he would be posted with the fleet in Coruscant's orbit to prevent Carrick from setting foot on the galactic capital. Admiral Saul Karath of the Inexpugnable-class tactical command ship Swiftsure, part of a blockade fleet in orbit, had already been contacted by Draay and had agreed to take on Xamar—Draay told him that Carrick was planning to raid Coruscant on behalf of the Mandalorians. The Rogue Moon Prophecy—and Xamar's fate in it—still loomed large in the Khil's mind, and he tried to persuade Draay to discuss the situation until they found a course of action that was satisfactory to all, but Draay refused. Xamar had the most experience of all of them working with the Republic Fleet, and it was imperative that they prevent their prophecy about the Sith Lord from coming true. After Draay had left, Q'Anilia approached Xamar, asking him what he would do; she saw little sense in running toward his death, and pleaded with him to stay. Xamar knew he could not run away from his fate, either, but he knew he had other options."}, {"tag": "h3", "text": "Defection"}, {"tag": "p", "text": "Xamar felt that Draay was no longer competent to lead the remainder of the WatchCircle, and he knew that Draay had lied to him about having gotten Krynda's approval before the Padawan Massacre of Taris. He decided to take things into his own hands. He reported aboard the Swiftsure as ordered, but decided that he would do whatever necessary—no matter what the personal cost was for him or Draay—to protect Krynda, to whom his ultimate loyalty lay. Xamar arrived on the Swiftsure in his traditional Khil naval uniform worn decades previously, in an attempt to impress Admiral Karath before changing back into his blue Jedi robes. Xamar met with Karath on the flagship's bridge, and the admiral bragged to him about the fleet's capabilities. Karath was derisive of the Jedi and disliked them in general, and was not particularly keen on having Xamar aboard his ship—Carrick's supposed imminent raid was the only reason he permitted it in the first place. Xamar picked up on Karath's opinions, and questioned him about them; Karath replied that he felt staying at home and protecting Coruscant—on the Jedi Council's orders—was a waste of time and resources, when the Mandalorians were showing weakness after a defeat on Jebble."}, {"tag": "p", "text": "Karath had noted Xamar's knowledge of how the ship functioned, though, so he was one of few Jedi to earn the admiral's respect. There was one aspect of the bridge that eluded Xamar's knowledge, though: Karath explained that all the ships in the fleet were slave-rigged to a central computer on the Swiftsure's bridge, which could predict enemy movements and orchestrate a preemptive attack on them. Xamar was somewhat disconcerted by this, as it left little time for sentient contemplation, and with everyone working in tandem could result in friendly fire—which Xamar knew all about, and wished to avoid at all costs. Karath explained that while he agreed with the Khil's assessment, the upper echelons of the Republic Navy called the shots, and he was desperate enough to retain his command after the disastrous Battle of Serroco to follow whatever measures they wished him to."}, {"tag": "p", "text": "A short time later, Carrick's ship arrived in the system, and Karath dispatched a starfighter squadron to intercept it. After it evaded the squadron, Karath had his ships fire on it simultaneously, so that it was unable to avoid all the shots. After Carrick's shields were broken down, Karath believed that Carrick would be easy pickings for the superior firepower of the Republic, though Xamar was quick to caution him—Carrick did not achieve his ends through brute force, but via other, more subtle methods. Karath recommended that Xamar take a starfighter into the fray, promising not to inadvertently fire on him. Once again reminded of the prophecy, Xamar left the bridge to report to the hangar bay, though he had no intention of going near a starfighter."}, {"tag": "p", "text": "Using the Force, Xamar learned that in a short time Carrick's accomplices would crash his ship into the hangar bay, and the fugitive Jedi would steal one of the Republic's freighters and escape to Coruscant. He decided to take a leap of faith and act on the information; he boarded the ship that his visions had shown Carrick would steal, stowing away for a time while Carrick and Hierogryph came aboard. He remained hidden until they reached Coruscant's surface, where he revealed himself and took the two hostage. He sensed that Jedi Councilors Vrook Lamar and Vandar Tokare were nearby, and took his two captives with them. After eavesdropping on a conversation of theirs with Alek Squinquargesimus and Shel Jelavan, in which Tokare stated that action could only be taken against the supposed Jedi Covenant that Jelavan claimed existed, Xamar appeared with his captives and stated that he might tell them everything he could about the Covenant, depending on what they could offer him."}, {"tag": "p", "text": "Xamar ultimately handed Carrick and Hierogryph over to the Jedi, and agreed to go before the Council. He testified to the Councilors, telling them everything he knew about the Covenant's illegal activities, and agreed to accept whatever fate they decreed for him, with a single caveat: that Krynda be given full immunity if and when action was taken against the Covenant. The Council agreed, and they went about formulating a plan to halt the machinations of Haazen and Lucien Draay."}, {"tag": "h3", "text": "Friendly fire"}, {"tag": "p", "text": "They formulated a simple plan which involved Xamar and Carrick infiltrating the Draay Estate. Xamar would escort Hierogryph and Carrick into the estate to meet with Draay; Carrick would hold a false, hollowed version of the Muur talisman and wear contact lenses to make it appear as if he had gone to the dark side. Xamar would demand that they take Carrick to Krynda's chambers for her to examine him. From there, Carrick and Hierogryph would create a distraction while Xamar took Krynda outside the Estate's gate; en route, he would disable the estate's security measures and a large number of Jedi, led by Vrook Lamar, would storm the building and apprehend the Covenant's leaders. If anything went awry, Carrick's lightsaber was hidden in the false amulet."}, {"tag": "p", "text": "Xamar contacted Draay and arranged to take the two captives to the Draay Estate. The two sentries posted at the entrance insisted on having a look at Carrick themselves to discern if it was indeed him, and the Council's ruse deceived them. Xamar was permitted entrance, and Hierogryph was amazed at how many Jedi he saw serving the Covenant. The Khil Master explained that the Order was not a united front as most galactic citizens were led to believe, that many factions, such as the Covenanters who wished to take preemptive measures against the Sith, and the Revanchists who wished to take defensive measures against the Mandalorians, were in surreptitious conflict with the Jedi Council, who chose to do neither."}, {"tag": "p", "text": "They eventually reached Lucien Draay, and Xamar told him a false story about Carrick's capture. Draay wanted to kill Carrick there and then, but Xamar claimed that if Carrick died, the talisman might turn another to the dark side who they'd have to deal with. He said that Carrick should be taken to Krynda for examination post haste. Just then, Haazen arrived, agreeing with Xamar, but informing them that Krynda was busy meditating with Circle Culu at the time; he volunteered to examine Carrick himself instead. Knowing that their plan had been compromised, Carrick whispered to Xamar, telling him to open the gates; Carrick himself would find and retrieve Krynda. The fugitive Jedi made a diversion, claiming to have unearthed a number of other Sith artifacts on Odryn, and that he was invincible because of them. Playing along, Xamar told Haazen and Draay that he had found a number of such artifacts aboard their ship, and volunteered to retrieve them and return them to the estate. While Haazen studied Carrick, Xamar traveled to the entrance and used a computer terminal to open the estate's gate—allowing a large Jedi strike team to gain entry."}, {"tag": "p", "text": "The strike team engaged the Covenant sentries, and Xamar ignited his own lightsaber and joined the fray. He implored the Jedi sent by Vrook Lamar to do as little harm to the Covenanters as possible, because they were ultimately all Jedi. He fought with his fellow Jedi outside the Estate, contributing to an ever-growing list of killed. During the fighting, an overhead bridge exploded, and many Jedi suggested that a bomb had been set off; Xamar, however, knew it had come from above. The debris rained down upon the Khil Master, injuring him; he had just moments left, though, as he realized that Karath's fleet was firing upon the Jedi outside the Estate. Xamar perished in fiery explosion, caused by friendly fire just as the prophecy predicted. Haazen, who had in actualityy gone to the dark side himself, had always planned to turn the Republic fleet against the Jedi by installing the slave system in the first place in name of the Draay Trust; Xamar's previous concerns were not unjustified."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like most Khil, Xamar was very cautious, and he often clashed with Lucien Draay during his time in the First WatchCircle. Draay's modus operandi involved acting what Xamar saw as arbitrarily and often hastily, while the Khil Jedi preferred more patient methods, usually wanting to seek approval from the Covenant—or, more specifically, Krynda—before acting. In the aftermath of the Rogue Moon Prophecy, Xamar refused to take part in the killings unless Draay contacted his mother and sought her approval; ultimately, it took a lie from Draay to persuade Xamar. Xamar was fanatically loyal to Krynda, so such so that he was willing to risk—or, if it came to it, give—his life for hers. He recognized that she was extremely important, being one of the few Jedi seers still alive after the harrowing Great Sith War. Thus, he was happy to give up his freedom to the Jedi Council in exchange for Krynda's full immunity. He also insisted on playing a part in her kidnap from Draay Estate."}, {"tag": "p", "text": "Xamar held all life in very high regard. While the other First WatchCircle members had little doubts about killing their Padawans after the vision, Xamar was unsure, and thought it would be a tragedy if they misinterpreted the prophecy and killed their learners needlessly. Lucien Draay saw the killings as merely part of their mission to stop the Sith, but to Xamar they were much more—and still weighed heavily on his conscience months later. During Xamar, Feln, and Q'Anilia's vision at Raana Tey's memorial, when they were fighting the rakghouls, Xamar attempted to protect the vulnerable Q'Anilia, unlike Feln, whose only concern was with his own safety. Later, during the Jedi attack on the Draay Estate, Xamar told Vrook Lamar's Jedi strike team to do as little harm as they possibly could to the Covenant members guarding the Estate—they were all Jedi and had the same overall goals, even if their methods of achieving these goals differed greatly, and, in Xamar's estimation, none deserved death."}, {"tag": "p", "text": "Xamar stood apart from many of his peers on the WatchCircle in many ways. He was more honest than Feln and Raana Tey; he wanted to tell the Jedi Council of the prophecy and its implications during their audience on Coruscant, while the others wanted to keep it secret and deal with it themselves. Additionally, the fact that he and his peers were operating in the shadows, unsanctioned by the proper authorities, concerned him greatly, while others relished being free of any rules. He was less violent than Feln; more clearheaded than the passionate Raana Tey; and more defiant towards Lucien Draay than Q'Anilia, often questioning his orders and using sarcasm in his presence. He and Draay had many differences, and for a time Xamar acknowledged that Draay was a better leader than he, but ultimately he felt that Draay had gone corrupt with power and was incompetent. Xamar was not particularly ambitious and rarely had designs on leading any groups; he theorized that this came with the intricate knowledge he held of the future, and that those who could not see the future, such as Draay—who he was often dismissive of—were more likely to seek personal success."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Xamar was a talented Jedi seer, and one of Lady Krynda Draay's most promising students as a youth. After the loss of her husband in the Great Sith War, Krynda refused to train any Jedi for over five years; it was a testament to the abilities of Xamar and his peers that she came out of retirement to train them. While Xamar's ability to see the future was great, when he worked with the other students his powers were enhanced. Sometimes visions came to Xamar and the other WatchCircle members when they least expected them, and nothing could be done to stop them coming; other times, he and his peers actively sought out the future, traveling to serene locations to attune their relationship with the Force. The Rogue Moon Prophecy came as a result of the WatchCircle traveling to one of Taris' moons to meditate; they hoped to search the future, but weren't trying to find anything in particular, unlike during the hunt for Zayne Carrick, when Xamar and his peers used their divinatory skills to find out where Carrick would flee to. At other times, such as Raana Tey's funeral, the visions would come unexpectedly, often leaving Xamar disoriented and unsure where he was after they had ended."}, {"tag": "p", "text": "Xamar was also a competent military commander, serving with his species' navy for a time early in his life, as well as working with the Republic Fleet on numerous occasions. He had a keen knowledge of capital ships, and his knowledge garnered him much respect from the likes of Saul Karath, who were dismissive of most Jedi."}, {"tag": "p", "text": "Though the less physical aspects of being a Jedi appealed to him most, Xamar was able to wield a lightsaber in some capacity. As a youth, he was given rudimentary training by Haazen, though whenever Xamar and the other Consulars-in-training sparred with Lucien Draay, they always came off worse. Later, during Zayne Carrick and Jarael's raid on the Jedi Tower, Xamar could do little to stop Jarael, who was wielding a lightsaber. Xamar was diminutive in size and was not a violent being; as such, Draay was able to throttle him with ease later in life. Xamar again had to use his lightsaber during the Jedi attack on the Draay Estate, in which he acquitted himself well, fending off many Covenanters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xamar, pronounced \"ZAY-mar,\" was created by John Jackson Miller for the Knights of the Old Republic comic series, debuting in Commencement, Part 1 in January 2006. Neither his name nor his species was revealed in that issue, but in response to a question from a fan on Miller's StarWars.com blog jokingly asking if the character was the same species as Doctor Zoidberg from Futurama, Miller revealed that he was in fact a member of the Khil race, introduced by West End Games' Wanted by Cracken over twelve years previously. Xamar's name was then revealed a month later in Knights of the Old Republic 2; John Jackson Miller purposely revealed his and Feln's names after the other Jedi Masters' were given so as not to overwhelm readers with too many new names in the inaugural issue. Xamar subsequently appeared in the prelude issue Crossroads, all the subsequent issues of the Commencement arc—albeit through a hologram and in a number of flashbacks in two issues—before much of his backstory was revealed in Knights of the Old Republic 9."}, {"tag": "p", "text": "Xamar did not reappear for a number of issues, though he was given a biography in the Knights of the Old Republic Handbook and was illustrated in Ryder Windham's Jedi vs. Sith: The Essential Guide to the Force in late 2007. Xamar returned briefly for issue 25, before playing a much larger role in three later issues, Exalted, Part 2, Turnabout, and Vindication, Part 1; he perished in the latter. All of the works Xamar appears in have been written by his creator, John Jackson Miller, but he has been depicted by a variety of illustrators, including Brian Ching, Scott Hepburn, Bong Dazo and Alan Robinson, with Michael Atiyeh coloring all images."}, {"tag": "p", "text": "According to John Jackson Miller, the events surrounding the Jedi Covenant depicted in the Vindication story arc of Knights of the Old Republic bear some similarities to the Watergate scandal of the 1970s. Thus, some fans asked if Xamar's role in the episode was based upon that of \"Deep Throat,\" a secret source which provided information on the scandals to the media. Miller, however, commented on his blog that Xamar's role was more similar to that of John Dean, who acted as a court witness during the scandal's investigation, as Dean was \"further inside the conspiracy when he testified.\""}, {"tag": "p", "text": "In The Essential Guide to the Force, Xamar and his colleagues are stated to have fought in the Great Sith War; however, this is impossible, as they only began training some years afterward, as established in Flashpoint Interlude: Homecoming. In Turnabout, Part 1, artist Alan Robinson depicted Xamar in his traditional Jedi outfit while aboard the Courageous, so as to make him more easily recognizable as he was in prior issues. However, author John Jackson Miller intended for Xamar to be wearing a naval uniform, and included a line of dialogue in which Xamar stated that his uniform was real. Miller has stated that readers should assume Xamar was wearing the uniform when he first boarded the ship but later changed into his Jedi robes. There is a possibility that Xamar's line about his uniform will be changed in the comic's trade paperback printing."}, {"tag": "p", "text": "When John Jackson Miller first created the character of Xamar, he wanted to depict the \"sibilant sing-song speech pattern\" given to the Khil by previous sources. He opted to triple occasional instances of the letter \"s\" appearing in Xamar's dialogue to show that this particular piece of continuity had not been overlooked. However, as Xamar became a more prominent character in KotOR—and thus began to have more lines—Miller found that the triple \"s\"es were occurring too regularly, so cut them entirely out of much of Xamar's dialogue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}