{"url": "Xa_Fel_(species)", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Core Worlds species", "Category:Human and Near-Human species"], "nodes": [{"tag": "h1", "text": "Xa Fel  (species)"}, {"tag": "p", "text": "The Xa Fel were a Near-Human race that inhabited Xa Fel in the Kanchen sector of the Core Worlds."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Xa Fel were, at one point, nearly genetically identical to baseline Humans. The poisoning of their homeworld from the facilities of Kuat Drive Yards, however, left them disfigured and damaged at the genetic level. Even new generations of Xa Fel were born disfigured. They were covered with blisters and sores, with their skin pockmarked and torn.[source?] They were vastly undernourished and tended to have terrible respiratory problems, due to the high acid content in their atmosphere. If a Xa Fel visited a \"clean\" world, they would commonly choke or faint due to the intense purity of the air. Before the devastation of their world, the Xa Fel had an average lifespan of 120 years. Decades later, this was more than halved; most Xa Fel never lived past 50 years."}, {"tag": "p", "text": "They seemed to have an innate aptitude for maintaining and repairing machinery and vehicles, with a particular knack for starships."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Xa Fel were one of the countless \"lost\" colony worlds—Humans who had spread out from the Core. While the culture originally had a tribal government, this was supplanted by a corporate hierarchy when Kuat Drive Yards took over their world. Ever after, they were trapped in a spiral of poverty, practically enslaved by Kuat Drive Yards. They were distrustful of visitors from other planets, particularly despising anyone representing a corporate entity."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Old Republic, Kuat Drive Yards built sprawling facilities on their homeworld, with cost as their only concern. There was no oversight to protect the Xa Fel, and no environmental protections were created, leading to widespread pollution and devastation."}, {"tag": "p", "text": "During the time of the Galactic Empire, environmental clean-up crews had started work on the planet, but the Imperials showed little interest in supporting their efforts. The New Republic, on the other hand, attempted to reverse the damage to the planet and its people."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}