{"url": "Xagobah", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Empire planets", "Category:Outer Rim Territories astronomical objects"], "nodes": [{"tag": "h1", "text": "Xagobah"}, {"tag": "p", "text": "Xagobah was an astronomical object in the Outer Rim Territories which produced war resources for the Galactic Empire during the Galactic Civil War. The Rebel Alliance's 61st Mobile Infantry fought the Empire there as part of a campaign in 3 ABY. In 5 ABY, New Republic forces led by General Ria undertook a campaign against an Imperial-Royalist coalition at the astronomical body."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Xagobah was an astronomical object located in the galaxy's Outer Rim Territories that was located within the vicinity of the Rimma Trade Route. Home to the Xamster species, including the podracer Neva Kee, Xagobah was known for its large and dangerous canyons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Xagobah produced resources for the Galactic Empire's war effort. In 3 ABY, the astronomical body was targeted by the Rebel Alliance's 61st Mobile Infantry three weeks into the company's campaign Operation Ringbreaker. A resulting battle was fought between the Empire and the 61st, the latter faction completing it's mission before moving on. The 61st's campaign was examined by the Rebel Alliance Intelligence Service, and General Crix Madine listed Xagobah among the targets in a report on Operation Ringbreaker's first phase. The report was later gathered by archivist Hendri Underholt and included in a compilation of information called the The Rebel Files."}, {"tag": "p", "text": "After the Battle of Endor in 4 ABY, the Empire was splintered and the Alliance became the New Republic. In 5 ABY, the Empire still controlled Xagobah, in coalition with royalists on the astronomical object. The New Republic General Ria led a campaign to drive the coalition off of Xagobah. The general spoke about her efforts at Xagobah at a meeting with other leading members of the New Republic Military regarding the progress of the Galactic Civil War as a whole. As the operation progressed, there was a turn in events which Ria found to be dark. The general soon attended another meeting with the New Republic's military leadership, where she summarized the dark turn but expressed confidence in the campaign's imminent end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xagobah was first mentioned in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}