{"url": "Xanadu_Blood/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunter starships", "Category:Captured starships", "Category:Rogue-class starfighters", "Category:Stealth ships"], "nodes": [{"tag": "h1", "text": "Xanadu Blood"}, {"tag": "p", "text": "The Xanadu Blood was a heavily modified Rogue-class starfighter, given to Cad Bane by the Confederacy of Independent Systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Confederacy of Independent Systems gave the Xanadu Blood to the Duros bounty hunter Cad Bane on behalf of the Dark Lord of the Sith, Darth Sidious. Bane first mentioned the Xanadu Blood's origin in 22 BBY when he was contacted by Sidious via hologram inside the Duros' hideout on Coruscant. After suggesting for a heavily modified starfighter, Sidious agreed to the bounty hunters demands. First using his fighter on the planet Devaron, Bane encountered Jedi Padawan Tyzen Xebec and clone trooper Commander Ganch on the planet, and fired the Xanadu Blood's laser cannons at the Republic force."}, {"tag": "p", "text": "After Devaron, Sidious gave the bounty hunter a new assignment: capture potential Force-sensitive infants and bring them to the Outer Rim planet of Mustafar. Bane used the Xanadu Blood to deliver infants from Glee Anselm, Rodia, and Naboo to Mustafar—for Sidious. However, while the bounty hunter was about to capture Gungan youngling Roo-Roo Page on Naboo, he was captured by Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano. Along with Bane, the Xanadu Blood was brought onboard the Venator-class Star Destroyer, Resolute. The fighter was examined by Skywalker and Tano to find clues about Bane's kidnapping mission. However, prior to being captured, Bane erased the fighter's navigation computer records, although the two Jedi found out that Bane visited Mustafar sometime during his mission by finding volcanic ash on the hull of the Xanadu Blood."}, {"tag": "p", "text": "Sometime afterward, Bane retrieved the ship from the Republic. He would use it to land on Tatooine to receive payment for stealing the floor plans of the Republic Executive Building. Bane later used the Xanadu Blood to travel to the Hutt Grand Council on Nal Hutta to present Ziro Desilijic Tiure to the Hutts after he freed the corrupt Hutt. Bane and Todo 360 then traveled in the ship to Teth to recapture Ziro, and faced Jedi Obi-Wan Kenobi and Quinlan Vos. After a fierce duel, Todo and Bane returned to the ship and escaped, the Jedi forced to jump off and hang from the edge of the stone platform as it took off and hindered their pursuit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xanadu is the name of a location in China and also of a 1980 film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}