{"url": "Xendor", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Admirals and generals", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Legions of Lettow", "Category:Males"], "nodes": [{"tag": "h1", "text": "Xendor"}, {"tag": "p", "text": "Xendor was a male Human general of the Legions of Lettow, a group of Force-sensitives who studied and wielded the dark side of the Force. A Kashi Mer Dynasty exile, he spoke out against the teachings of the Jedi and this philosophical disagreement eventually lead to open war with the Jedi Order. With his lover Arden Lyn at his side, he fought in the war of the First Great Schism and was eventually killed on the day of the Legions' defeat at Columus."}, {"tag": "p", "text": "Lyn survived, but was placed in a deep trance following a confrontation with Jedi Master Awdrysta Pina. As the New Sith Wars raged, rumors abounded of Xendor's return in the form of the enigmatic Dark Underlord. By the time of the Imperial Period, Xendor took on new life as a popular curse uttered by smugglers. During this time, Lyn was awoken from her preserving trance, and she made several attempts to resurrect Xendor. She was eventually slain by Emperor Palpatine, a Sith Lord."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The First Great Schism"}, {"tag": "p", "text": "A Force-sensitive Human of the Kashi Mer Dynasty, Xendor was exiled after he began to embrace and follow Bogan, the darker aspects of the Force, in conjunction with the use of the Teräs Käsi martial art. Upon departing home, Xendor took with him a talisman marked with the sigil of his house. Taking refuge with the Jedi Order on their fortress world of Ossus, Xendor became a well respected Jedi Knight. During his time on Ossus, Xendor became increasingly outspoken about what he saw as the Order's progressively more close-minded attitude towards other Force-traditions and the study of the Bogan. During this time, Xendor met a Steel Hand of Palawa named Arden Lyn and began to learn about the philosophies of Palawa, eventually taking her as a lover."}, {"tag": "p", "text": "Xendor, able to bear his frustration no longer, approached the High Council and requested their blessings in opening a new Jedi academy far from Ossus to focus on the darker aspects of the Force, the Bogan. When the Council refused, Xendor quietly broke with the Order and traveled to the planet Lettow to open an academy which focused its teachings on the Bogan. Drawing on Force traditions such as the Dai Bendu, the Followers of Palawa, the Kashi Mer Guardians of Breath, the Baran Do, and the Chatos Academy, Xendor's academy drew a trickle of interest which quickly grew into a large following. It was these acolytes which named their new group the Legions of Lettow, as they believed that they would one day be forced to defend their traditions from the Jedi High Council's wrath."}, {"tag": "p", "text": "Sometime during Xendor's life, he traveled to a dead planet where the Force was worshiped as a trio of beings. He would later recount the tale to Arden Lyn, telling her of the Daughter, the embodiment of the light side, and the Son, the embodiment of the dark side. When Lyn asked about the Father, he cryptically replied that he might have been the Force itself. When asked what he had discovered, Xendor simply laughed and told her that there were many truths to the Force—the existence of the triad had no bearing on the truth of the Force, any more than the views of the Legions or the Jedi did."}, {"tag": "p", "text": "Taking the rank of general sometime in the 24,500s BBY, Xendor lead the Legions of Lettow in open warfare against the Jedi Order. Known to history as the First Great Schism, Xendor took the war directly to Ossus in a pre-emptive strike against the Jedi. During the battle, Xendor's forces were pushed back and forced to commit troops to several fronts as the Order pushed the Legionnaires towards the galaxy's core. In an attempt to ally with the Galactic Republic against the Jedi Order, he accused the Jedi of attempting to subvert the Republic for their own ends. Xendor was ignored and branded as a warlord by the Republic. Campaigns were fought on Chandrila, Metellos, Brentaal IV and Coruscant until the Jedi leader, Awdrysta Pina managed to come into direct battle with Xendor on Columus. Known as the Green Blade, Master Pina and his Jedi Knights were able to separate Xendor's vanguard from the bulk of his army through the use of a strong Force meld. Cutting through powerful warriors such as Sethul Asaiage and Tun Bohoi, Pina eventually dueled Xendor and slew him in hand-to-hand combat, and his spirit plunged into Chaos. News of this was transmitted to even Jedi Padawans on far-flung worlds, signifying what was thought by some to be the immediate end to the war."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "On the day that Xendor died, the Legions lost the Battle of Columus, with the sole survivor being Jedi Padawan Danzigorro Potts. Before dying of his own mortal wounds sustained in the battle, Potts made a recording on a datacard that would become and remain famous for thousands of years after the First Great Schism. In it, the Padawan speculated on just how and why Xendor had been able to sway so many to his cause. In the wake of Columus and Xendor's death, Arden Lyn led the defeated Legions of Lettow. In the aftermath of the schism, she was hunted down by Jedi Master Awdrysta Pina, forcing Lyn to destroy her assailant with Xendor's Kashi Mer talisman. Prior to perishing, Pina used the technique of morichro to stop Lyn's heart, and as a result, the Follower of Palawa fell into a deep and long trance that preserved her."}, {"tag": "p", "text": "The First Great Schism would prove to be the first of several conflicts between the light and dark sides of the Force. Over the centuries, various wars stemming from the dispute between the two schools of thought would be waged, at a tremendous loss of life. During the New Sith Wars instigated by Darth Ruin in 2000 BBY, an enigmatic figure known only as the Dark Underlord rose to power. Speculation abounded as to his origins, with one theory suggesting that he was in fact the returned spirit of Xendor. The Dark Underlord was eventually destroyed by the Jedi Master Murrtaggh."}, {"tag": "p", "text": "Around two dozen millennia after the First Great Schism, Arden Lyn was woken by Imperial Inquisitors—Dark Jedi in the service of the Sith Lord Palpatine. Instead of being annihilated, Lyn was converted to Palpatine's cause and served him as one of the Emperor's Hands. In turn, he promised her that he would summon Xendor's spirit back from Chaos. Lyn soon realized that Palpatine did not intend to make good on his promise and participated in an attempted coup against him led by Grand Admiral Demetrius Zaarin in 3 ABY. When that failed, she scoured the galaxy for the Kashi Mer talisman that she had possessed in her earlier life, hoping to regain the influence she had enjoyed during the Schism. She also intended to resurrect Xendor herself with the power of the talisman. Lyn was later personally slain by Palpatine."}, {"tag": "p", "text": "During Palpatine's reign, Xendor's name would be frequently taken in vain by smugglers such as Han Solo and Lando Calrissian. The phrase \"Minions of Xendor\" became a popular curse during this time, particularly with Solo. In 36 ABY, Xendor found his way into the writings of New Republic historian Voren Na'al, and four years later, into the writings of Jedi historian Tionne Solusar. The contents of Danzigorro Potts' data card, known popularly as the Columus Data Card, were collected in Solusar's writings. The card had been the inspiration for at least three operas on Coruscant, but had been decried by historian Ingo Wavlud as mere Jedi propaganda. Even by this stage, Xendor's origins remained a mystery, at least to the New Jedi Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A courageous and powerful Human man, Xendor posed the first true threat to the Jedi Order. By highlighting and emphasizing the routine and, in the view of his followers, stifling nature of the Jedi way, he was able to sway legions of Jedi to his cause—even experienced Jedi Masters. He simply told the Jedi that he did not have to follow orders, and in doing so secured his place in galactic history. Xendor had dark skin and dark hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xendor was first mentioned in A. C. Crispin's The Paradise Snare, where the name was used repeatedly in various curses uttered by characters. The name was mentioned in much the same capacity in the two other books in that series, The Hutt Gambit and Rebel Dawn. The character of Xendor was greatly embellished upon by Abel G. Peña in his article The Emperor's Pawns, which was published in Star Wars Gamer 5. Further, fleeting mentions were made by Daniel Wallace in The New Essential Chronology, as well as by Drew Karpyshyn in the article Heritage of the Sith, published in Star Wars Insider 88. Peña once again used the character briefly in Evil Never Dies: The Sith Dynasties, and Ryder Windham would, in 2007, expand upon the character once more in Jedi vs. Sith: The Essential Guide to the Force. The 2012 reference book Book of Sith: Secrets from the Dark Side provided a picture of Xendor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}