{"url": "Xaverri", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Females", "Category:Humans", "Category:Performing artists"], "nodes": [{"tag": "h1", "text": "Xaverri"}, {"tag": "p", "text": "Xaverri was a Human female traveling magician and illusionist who performed across the galaxy several years before the Battle of Yavin. Constantly roving and usually alone, Xaverri never settled down due to the pain she experienced in her past. She despised the Empire and worked against it on numerous occasions. On the moon Nar Shaddaa, she fell in love with the smuggler Han Solo after a performance and had a relationship with him for some time before leaving him. Xaverri would later aid Solo twice after their relationship ended—the first in the Battle of Nar Shaddaa, where she helped the inhabitants of the Smuggler's Moon fight off an Imperial starfleet and the second on Crseih Station, where her advice helped prevent Solo from falling under the mind-controlling influence of the alien entity Waru."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "In the society of her birth, the Human female's surname was listed last after a series of ancestral ties, so she took no other name than simply her surname, \"Xaverri.\" Born at some point before the year 29 BBY, Xaverri was a trained stage magician by around the age of thirty, traveling the galaxy and reputed to be \"one of the best illusionists in the galaxy.\" Much of the profits she earned went to finance protection money to the Galactic Empire for her homeworld and friends, though even that was not always successful. However, the Empire killed her husband and children, embittering her and creating a vast need inside her to take revenge on the entity that had robbed her of her family. On most of her tours, she spent much time trying to find ways to inflict damage on the Empire. Her past she kept secret, choosing to live alone after the death of her loved ones. Her solitude and lack of companionship was largely her choice, though, augmented by her natural suspicion and distrust of others."}, {"tag": "h3", "text": "Dealings with Solo"}, {"tag": "p", "text": "While on a week-long tour on the moon Nar Shaddaa, smugglers Han Solo and Chewbacca went to see her show and were captivated by her performance. After the show, Solo and his Wookiee friend went backstage and met the magician, who was pleased to meet both their acquaintances, and her knowledge of Shyriiwook left a favorable impression on Chewbacca. Solo, who was already attracted to Xaverri, invited her out for a post-performance snack, and she agreed. The two started going out and on their fourth date, Xaverri revealed her past to Han, who in turn shared his own background and troubles with the Empire. She also told Solo that that was the first tour where she hadn't spent her spare time plotting against the Empire. Han offered his services as an assistant for her show and a pilot, and she agreed to take him on, as her current assistant, Glarret, was getting on in years and was not a skilled pilot anyway. Shortly after Solo signed on as her assistant, Xaverri and Solo deepened their relationship to an intimate level."}, {"tag": "p", "text": "By popular demand, her tour was held over for additional time on Nar Shaddaa, after which she departed with Solo and Chewie for other locations. Xaverri spent six months on tour with Solo, alternately performing stage shows and scamming Imperial officials. During the former, Xaverri continued to use her array of illusions to entertain audiences while also adding in segments featuring Chewbacca's Wookiee strength and with Solo onstage in a costume of his own as her assistant. As before, her shows were successful and enthralled audiences across the galaxy. During their sabotage activities, the duo duped any number of bureaucrats and officials. One such occasion, Xaverri helped con the Assistant Secretary to the Sector Moff of the D'Aelgoth sector out of his life savings and placed him under suspicion for treason. However, two of their scams were not as successful. In one botched scheme, she and Han were forced to run through the countryside, evading pursuit by hiding up to their necks in a swamp, until Chewbacca was able to pick them up in her ship."}, {"tag": "p", "text": "As much as she enjoyed the companionship of Han Solo, Xaverri left him on the luxury moon of Velga, taking her ship, the Phantasm, and striking out on her own. She felt that being around him and Chewbacca had made her too soft, too vulnerable, and too attached to him. Realizing that she had to leave him in order to maintain her hard-edged recklessness, she left a message on a datapad for Solo and the Wookiee, wishing them both well. For her part, she planned on taking a short rest before starting a new tour—and continuing her campaign against the Empire."}, {"tag": "h3", "text": "Battle of Nar Shaddaa"}, {"tag": "p", "text": "Some time later, Han Solo called upon Xaverri for her aid in the impending Battle of Nar Shaddaa. The Empire planned on razing the moon and its millions of inhabitants, and while Han and other smugglers had mustered up a fleet of smuggling freighters and privately owned craft, along with Drea Renthal's mercenary fleet, they needed a diversion to distract the Imperial Navy. Xaverri readily agreed to create an illusion, although she admitted it would be difficult. Using the holoprojectors from the casinos on Nar Shaddaa and the traffic control buoys in orbit around Nar Shaddaa, Xaverri engineered a deception that would generate the image of an approaching mercenary fleet while jamming the sensors of the Imperial vessels."}, {"tag": "p", "text": "In the days prior to the battle, Xaverri worked closely with fringe slicer Salla Zend, also a former girlfriend of Solo's, as they worked to prepare the equipment necessary for the deception. While Xaverri told Han that the Imperials would only be fooled for a few minutes, Solo was satisfied. The battle proceeded largely according to the plan set forth by the smugglers, with the Imperial capital ships being drawn into an ambush point. At that moment, Xaverri activated her illusions, fooling the Imperials and causing them to turn towards the perceived threat. That lapse was enough to allow Renthal's fleet to hit them from the rear with heavy firepower, which led to the destruction of two bulk cruisers and one Dreadnaught. After such heavy losses, the Imperial fleet withdrew and the smugglers emerged victorious. After the battle, Xaverri left to continue her work both as a stage magician and against the Empire, bidding farewell to Solo once more and again wishing him happiness. Throughout the years, she continued her predations against the Empire, never quenching her thirst for revenge no matter how many schemes she pulled off. Never again did she seek companionship or a family, due to her vow to always be alone."}, {"tag": "h3", "text": "Crseih Station"}, {"tag": "p", "text": "Years later, Xaverri sent out rumors of strange phenomena in the guise of reports of lost Jedi on Crseih Station to bring Han Solo, now married to Leia Organa Solo, and Jedi Luke Skywalker out to investigate. Crseih Research station, which orbited near a crystallizing white dwarf star and a black hole, had once been used by the Empire for research. She slipped into their room one night after they arrived there with the aid of the droid C-3PO. Xaverri's presence surprised both Han Solo and Skywalker, and she told Solo that her efforts had been somewhat hampered by the New Republic and its \"honorable ways.\" However, she did feel that the events on Crseih were a threat to the New Republic and led Han, Luke, and C-3PO to the hall of Waru, a strange alien being from another dimension that alternately healed and consumed those who approached it as it yearned for a way to return to its own dimension. Xaverri approached Waru, whom she had some prior contact and pleasant conversation with before, even to the point of providing it with a gift. The alien's influence on her was enough to cause her to sink to her knees and she looked exhausted after the encounter."}, {"tag": "p", "text": "Over Solo's objections, they remained to observe Waru at work, then left, with Solo having to tug Skywalker, who was entranced by Waru, along with him out of Waru's hall. Solo expressed his opinion that Waru was a trick, but Xaverri angrily responded that it was impossible for it to be a scam; she would have spotted it. Having lived in Waru's compound for a hundred days to gain its trust, she felt that it was a danger to the New Republic, not to mention the sizable faction of admirers and even worshipers he had collected. Still, she returned to Waru's compound, as she had done many times, to observe the being in action."}, {"tag": "p", "text": "Later, Solo returned after he learned Xaverri was still near Waru. He met up with her just in time to witness Waru kill an Ithorian seeking healing from it, though she was annoyed that he had not done as she wished and waited until she called for him. However, the experience did convince Solo of the danger of Waru. Xaverri then revealed that Waru had been summoned to Crseih by experiments performed by the Imperial Procurator of Justice. She also announced that the Procurator and Waru had formed an alliance that would bring considerable power. Solo, still distressed by his experience with Waru, was shaken, but Xaverri assured him that they would stop Waru together. Han drifted off into sleep while sitting down, but Xaverri carried him to his bed and laid him there and remained by his side throughout the night, though she did not offend his modesty as she knew he had a family. She helped calm him down after he had nightmares of Waru, reminding him that his nightmares of losing his family were just dreams—hers were real."}, {"tag": "p", "text": "The incident later caused some friction between Luke Skywalker and Solo, as Skywalker, fallen under the influence of Waru and with his control of the Force slipping due to resonance from the crystal star, was suspicious of Xaverri. As Solo again pulled Skywalker away from Waru, they encountered Xaverri again. Despite Solo's offer to take her with them back to the New Republic, she refused in favor of continuing her work beyond the law. Before they were out of sight of Waru's compound though, Han spotted the Procurator of Justice, Hethrir, who was bringing Solo's son Anakin to Waru. Solo, Xaverri, and Skywalker quickly moved to rescue the toddler from Hethrir, aided by the recently arrived Leia Organa Solo, Rillao,—the Procurator's former mate—and Chewbacca. Even as they snatched Anakin Solo away, Skywalker agreed to let Waru take him instead. Han and Leia Solo dove into Waru's expanse to save Skywalker, who had already been engulfed, pulling him out and saving him from Waru. Meanwhile, Xaverri helped capture Hethrir's minions and allies, taking them to deal with in her own way. Once again, she said goodbye to Solo and also to his wife, leaving the station in her ship shortly before the crystal star collapsed into the black hole's event horizon, releasing deadly radiation that sterilized Crseih."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Xaverri had black hair, dark brown eyes, and stood slightly shorter than 1.8 meters. Xaverri had a large stage presence and was seen as beautiful and exotic in her performances. However, she was an embittered woman, forever grieving for the loss of her family and seeking revenge against the Empire, to the point where she willingly chose solitude and to distance herself from others in order to pursue revenge. She kept to herself largely, though Han Solo managed to work through her emotional barriers to see her true character. Underneath, Xaverri was a loving, intelligent person with a sense of humor, but that part of her was buried under her hate for the Empire."}, {"tag": "p", "text": "Her years of hard living and deception made her suspicious and wary, though she was quite knowledgeable and skilled in a number of disciplines. Xaverri also had numerous ways of obtaining information. To her, all of these strengths and abilities were weapons to use in her private war. She would go to any length to harm the Empire, pursuing her vendetta against it with reckless abandon."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Husband"}, {"tag": "p", "text": "At one point, Xaverri had a husband whom she loved. However, her husband, along with her children, were killed by the Empire. Emotionally devastated, Xaverri dedicated her life to avenging their deaths."}, {"tag": "h3", "text": "Han Solo"}, {"tag": "p", "text": "After they met on Nar Shaddaa, Solo and Xaverri quickly developed a close and intimate relationship which lasted six months. The two worked well together and their strengths complimented the other, in addition to the fact that they enjoyed each other's company. Xaverri found Solo courageous and dashing, while he thought she was exotic and extraordinary. Xaverri and Solo loved each other, but her quest for vengeance caused her to put aside her feelings for him and leave him, though they would encounter each other twice afterward. Solo would later reflect that he might have had a future with her if she had not left him."}, {"tag": "h2", "text": "Talents"}, {"tag": "p", "text": "Xaverri was a skilled magician who had a knack for spectacular and dramatic shows. Her shows featured her, usually wearing some sort of sparkly garment slashed in places to expose skin, performing a variety of illusions for the crowd's pleasure. Shortly after being introduced, she would go straight into her acts, performing increasingly difficult feats. Some of her tricks included lasering a volunteer from the audience in half, then lasering herself in two pieces, also. She also appeared to teleport both herself and some Rodian batwings from one glassine cage to another one located on the other side of the stage in a single instant. Xaverri also released a flock of Kayven whistlers onto the audience, except that the animals, like the rest of her tricks, were a mere illusion. While on Nar Shaddaa, her grand finale was to create an impression that the audience was floating in space and on a collision course with a rogue dwarf star. Even Han Solo, an experienced con man, pickpocket, and card shark, could not determine how her illusions were arranged."}, {"tag": "p", "text": "Xaverri was a talented illusionist of great skill, such that she could fool Imperial sensors into believing that a battlefleet was approaching them. She was also trained as a gymnast and contortionist and used weapons such as vibroblades and daggers in some of her acts. She was also an accomplished con artist, easily surpassing the schemes of Garris Shrike in the eyes of Han Solo. Furthermore, Xaverri had knowledge of piloting, which allowed her to fly her own ship, the Phantasm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xaverri was first introduced by Vonda N. McIntyre in the 1994 novel The Crystal Star, but her character and past relationship with Han Solo were later fleshed out in greater detail by A. C. Crispin in the book The Hutt Gambit in 1997. In 2012, she was mentioned in The Essential Reader's Companion, in which it was incorrectly stated in the section of the book that detailed the plot of The Hutt Gambit that Xaverri made her first appearance in the novel The New Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}