{"url": "Xer%27s_Campaigns", "categories": ["Category:Legends articles", "Category:Battles in the Tion Cluster", "Category:Battles of Xer's Campaigns", "Category:Conflicts of the Outer Rim Territories", "Category:Pre-Republic events and conflicts"], "nodes": [{"tag": "h1", "text": "Xer's Campaigns"}, {"tag": "p", "text": "Xer's Campaigns were a series of military campaigns launched by Pirate Xer in the Pre-Republic era between 25,150 BBY and 25,130 BBY. They allowed him to become King of Cron and conquer all the Tion Cluster, excepting the Livien League."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 27,000 BBY, Human colonists aboard sleeper ships from the Core Worlds had settled the Tion Cluster while the galaxy was ruled by the Rakata Infinite Empire. In the aftermath of the Rakatan Civil War, the Infinite Empire was expelled or withdrew from its scattered colonies, leaving much of its technology behind to its former slaves. By 25,200 BBY, the year of Xer's birth, the Humans of the Tion had formed three states: the Kingdom of Cron, the Kingdom of Barseg, and the Livien League."}, {"tag": "p", "text": "Xer's homeworld, Argai, was nominally part of the Kingdom of Cron, then centered around an arc of worlds from Janilis VII to Algor, but the distant world on the edge of the Ihala Spiral was routinely ignored by the royal court on Chandaar. Like many Argaians, Xer turned to piracy, becoming a prominent pirate chieftain. Hailed the Lord of Argai, he seized Dravione and proclaimed the Kingdom of Argai. Xer moved down the Ihala Route, and within a decade had expanded his kingdom to Panna."}, {"tag": "p", "text": "In response to the growing power of Argai, King Ferece of Cron summoned Xer to Chandaar, where he offered the pirate-lord noble titles in exchange for an oath of fealty. Offended by the offer and perceiving Ferece and his court to be weak, Xer resolved to conquer the Kingdom of Cron."}, {"tag": "h2", "text": "The Conquests"}, {"tag": "h3", "text": "The Cronese Sweeps"}, {"tag": "p", "text": "Assembling a fleet at Panna, Xer destroyed a Cronese fleet gathering at Duinarbulon before conquering Chandaar and putting Ferece to flight. Proclaimed Xer VIII, King of Cron, Xer suborned the kingdom and took as hostages the heirs of those nobles and warlords he considered useful, and destroyed the families of those he did not. Xer's teenage son Xim gained a feared reputation in the Cronese Sweeps, killing everyone in the Timber Palace of Pasmin, setting the royal barges of Eibon adrift into the heart of the Ihala Spiral, and razing the High Fane of Xo on Nuswatta, converting the theocracy to Xer's service."}, {"tag": "h3", "text": "The Three Allied Kingdoms"}, {"tag": "p", "text": "The Cronese Sweeps created a united, expansionist Kingdom of Cron and a battle-tested navy. Xer soon prepared to conquer beyond Cron's borders, targeting the Three Allied Kingdoms, an alliance of Cadinth, Jaminere and Barseg on his north-rimward flank. Xer moved along the Cadinth Run and conquered the three kingdoms, as well as worlds such as Arcan IV, Corlax 4, and Lianna."}, {"tag": "h3", "text": "The Back Spiral"}, {"tag": "p", "text": "Xer then conquered beyond the Ihala Spiral. Moving from Algor, he moved north up the Spiral, winning victories at Caluula, Brigia and Tion. After the conquest, Xer built gleaming palaces on Raxus Prime and deeded the world to his concubines and their retainers. The world ultimately became known as \"the Circlet of the Tion\"."}, {"tag": "h3", "text": "The Livien League"}, {"tag": "p", "text": "The Livien League, a confederation of worlds built around Livien, Desevro and Kanaver, was the only military power in the Tion to successfully defy Xer. Xer's attempts to move into the League from Corlax and Barseg were defeated at Amarin, and again at Lorrad. In the aftermath, Xer ended his campaign against the League and paused to consolidate his conquests."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Seeing he had overstretched himself, Xer suspended his conquests and spent the remainder of his rule forging Cron into an empire, extending its network of hyperspace beacons along the Back Spiral and the Cadinth Run and creating an efficient bureaucracy. Xer still harbored ambitions for the League, however. He organized Cron into three provinces ruled from Chandaar, Raxus Prime and Cadinth, but court rituals referred to the Four Thrones of Cron: those three worlds and the still-independent Desevro."}, {"tag": "p", "text": "The Livien League would later be conquered by Xer's son and heir Xim."}, {"tag": "h2", "text": "List of battles"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}