{"url": "Xi_Charrian/Legends", "categories": ["Category:Legends articles", "Category:Insectoid sentient species", "Category:Mid Rim species", "Category:Xi Charrians"], "nodes": [{"tag": "h1", "text": "Xi Charrian"}, {"tag": "p", "text": "Xi Charrians were a hive-minded species from Charros IV who communicated through a complex variety of clicks. They followed the Xi Char religion, and were founders of the Haor Chall Engineering company."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Their short bodies were covered in chitinous plates, and were quadrupedal, with pointed, \"scissor-action\" feet. Xi Charrians' heads were teardrop-shaped and had red eye-slits."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Xi Charrians founded a fanatical religious order known as the Xi Char which was dedicated to high-precision manufacturing. The Xi Char formed Haor Chall Engineering, a company in which their zealots worked tirelessly to produce experimental starfighters and engine technologies. Haor Chall was one of the more unusual manufacturers in the galaxy, creating huge cathedral factories, such as Workshop Xcan, for their production lines. Notable Haor Chall designs included the Hailfire-class droid tank, the C-9979 landing craft, the Vulture-class droid starfighter, and the Scarab-class droid starfighter. It was rumored that the Trade Federation arranged a merger between Hoar Chall Engineering and Baktoid Armor Workshop, although this was never confirmed by Baktoid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Xi Charrians were native to the planet Charros IV, located in the Charros system of the Taldot sector, a region of space in the Mid Rim, and about three hyperspace jumps from the Inner Rim Territories."}, {"tag": "p", "text": "The Jedi Council became aware of a Sith Lord named Sidious coordinating the Clone Wars. One avenue in their attempts to track down his identity led them to the mechno-chair of Trade Federation viceroy Nute Gunray. Discovering Gunray had been in contact with Sidious through a hyperwave receiver built in to the chair, the Jedi Order tried to trace the chair's origins. The chair had been engraved by a Xi Charrian, who had signed his name with his personal sigil."}, {"tag": "p", "text": "During the Clone Wars, a Republic taskforce of clone troopers led by Jedi Knights invaded Charros IV. They successfully destroyed the Haor Chall factories, effectively crippling the company. The company's remaining assets were absorbed by Sienar Fleet Systems, including Haor Chall's patent on the Hoar Chall Ring Drive Gel."}, {"tag": "h2", "text": "Xi Charrians in the galaxy"}, {"tag": "p", "text": "t'laalak-s'lalak-t'th'ak crafted the mechno-chair used by the Neimoidian Nute Gunray. The mercenary Vana Sage once contacted a rogue Xi Char engineer who helped her design a unique starfighter. Dubbed the Guardian Mantis, the stealth fighter was exceedingly fast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}