{"url": "Xexto", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Outer Rim Territories species", "Category:Xexto"], "nodes": [{"tag": "h1", "text": "Xexto"}, {"tag": "p", "text": "Xexto were a sentient species of slight, spindly, six-limbed aliens who were native to the planet Troiken. Xexto were highly dexterous, enabling them to participate in the highly dangerous sport of Podracing. Slingshots were extremely popular with Xexto, since their multiple sets of limbs made the weapons convenient to use. Gasgano, a famed Podracer pilot, was a Xexto, as was the pickpocket and pawn shop owner Ferpil Wallaway. A Xexto known as Sister Six worked as an assassin during the Galactic Civil War, while Captain Perrili of the bulk freighter Romary was a smuggler and Resistance contact."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Adapted to live in woodland habitats, Xexto were a sentient alien species identifiable by their pale-colored skin, and six long limbs, which afforded them a total of twenty-four digits. They used their bottom pair of limbs as legs. Atop a tall, thin neck, each Xexto had a head that featured a thin mouth and two black or red eyes. At least one Xexto, the Podracer pilot Gasgano, exhibited purple-colored skin above his eyes, a trait that not all members of the species possessed. Female Xexto could grow eyelashes and brown hair. A slight Xexto, Gasgano stood at a height of 1.22 meters."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Slingshots of various kinds were popular on the Xexto homeworld of Troiken, as a Xexto's extra sets of limbs made the weapons more convenient for them to use. Because of their dexterity, Xexto were able to participate in the deadly sport of Podracing."}, {"tag": "h2", "text": "Xexto in the galaxy"}, {"tag": "p", "text": "Originating on the planet Troiken, Xexto were commonly found in the galaxy's Outer Rim Territories, but at least one inhabited Coruscant, the capital planet of the Galactic Republic and later the Galactic Empire, following the Battle of Endor. At the time of the Invasion of Naboo during the last decades of the Republic, an ill-tempered Xexto named Gasgano participated in the famed Boonta Eve Classic Podrace, which was held on the desert world of Tatooine. Piloting an Ord Pedrovia Podracer, he raced on behalf of the crime lord Gardulla the Hutt and finished in second place. The Tatooine city of Mos Espa hosted a small population of Xexto, one of whom was a food vendor. A Xexto delegation was present in the Galactic Senate on Coruscant when Queen Padmé Amidala of Naboo moved for a Vote of No Confidence in Supreme Chancellor Finis Valorum's leadership."}, {"tag": "p", "text": "During the Age of the Empire, a Xexto pawn shop owner and pickpocket named Ferpil Wallaway lived on the agrarian Outer Rim world of Lothal. Wallaway distributed tickets for \"the Commissioner,\" an individual who ran Gladiator Night, an illegal sporting event held on Lothal. He was visited at his pawnshop by \"the Commissioner\", who was in reality an Imperial lieutenant named Jenkes. With his illegal activities in danger of being discovered by the bounty hunter Bossk and the street urchin Ezra Bridger, Jenkes murdered Wallaway in order to tie up loose ends. The Xexto assassin Sister Six, a former Central Isopter cultist, worked with the Son-tuul Pride criminal syndicate during the Galactic Civil War before deciding to join the Alliance to Restore the Republic. During the Cold War between the New Republic and First Order, a female Xexto smuggler known as Perrili served as captain of the Xexto-crewed bulk freighter Romary and a Resistance contact in the galactic underworld."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Xexto species was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. The primary Xexto who was featured in the film was Gasgano, a Podracer pilot who competed in the film's Podracing sequence. Several other Xexto appeared in the stands observing the race. The species was identified by name in canon through Gasgano's character entry in StarWars.com's now-discontinued Encyclopedia."}, {"tag": "p", "text": "The species' appearance was primarily developed by concept artist Terryl Whitlatch. Along with some rudimentary designs, Whitlatch also designed the species' bone structure, which was meant to serve as an anatomical reference for the film's designers. A detailed sculpt was created based on Whitlatch's art, and in the film, Gasgano and the other Xexto were rendered entirely with the use of computer-generated imagery."}, {"tag": "p", "text": "Despite being a member of the Xexto species, Ferpil Wallaway bears a striking resemblance to a Quermian, which, in the non-canon Star Wars Legends continuity, was a species of genetically-modified Xexto. However, any canon connection between the two species has yet to be confirmed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}