{"url": "Xim%27s_Expansionist_Period", "categories": ["Category:Legends articles", "Category:Conflicts of the Outer Rim Territories", "Category:Pre-Republic", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Xim's Expansionist Period"}, {"tag": "p", "text": "Xim's Expansionist Period is a term used to refer to the first twenty years of Xim the Despot's reign. It was during this time that he conquered most of the Tion Cluster, including the Livien League, and the surrounding regions: the Thanium Worlds, the Far Indrexu and the Kiirium Reaches. This period ended with the Xim Wars."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In a series of campaigns, Xim's father Xer VIII had carved out an expansive empire within the Tion Cluster known as the Kingdom of Cron. However, Xer's expansion had been halted after his defeat by the Livien League at the Battles of Amarin and Lorrad. Despite this, the Kingdom of Cron's court rituals still referred to the Four Thrones of Cron - Chandaar, Raxus Prime, Cadinth, and the still-independent capital of the League, Desevro."}, {"tag": "p", "text": "In 25,130 BBY, Xer retired and relinquished the throne to his son Xim, who had earned a reputation for brutality and military skill in the Cronese Sweeps. Xim resolved to complete his father's conquest of the Livien League."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Conquest of the Livien League"}, {"tag": "p", "text": "Xim's forces quickly smashed the League at the Battle of Jhantoria. Xim prepared the raze the League's capital of Desevro as an example to those who would oppose him. However, Xim was dissuaded from this course of action when Maslovar Tiatiov, the military ruler of Desevro, showed him the world's first-class military academies and bureaucracy, explaining to him the Desevrar tradition of training the sons of outlying worlds as janissaries and civil servants."}, {"tag": "p", "text": "Impressed, Xim spared Desevro and proclaimed it the Fourth Throne. The Desevrar philosophy would fuel the later stages of Xim's Expansionist Period. With the Four Thrones under one crown, the Kingdom of Cron was proclaimed Xim's empire."}, {"tag": "h3", "text": "The Thanium Worlds"}, {"tag": "p", "text": "The second stage of the Expansionist Period was the conquest of the Thanium Worlds from 25,126 BBY to 25,116 BBY. Spinward of Xim's empire, these planets took their name from the world of Thanium, the Fifth Throne where Xim established his military headquarters. Moving from Barseg to Thanium, one force moved to conquer Maldont, and from there split to take Pesegam and Thule, while another force took Ethain and Far Thanium."}, {"tag": "p", "text": "Another force moved from Thanium to take Galuch, Mossak, Galidraan, Draukyze and Rhen Var. Finally, a third force from Arcan conquered Nardolin, Vartholium, Ethullum and Bynas."}, {"tag": "p", "text": "Xim's empire conquered numerous worlds, built new hyperspace beacons for the empire's navigational network, and prepared to settle a wave of Tionese colonists. Species that were considered \"worthy\" by the Despot, such as the Vurk and Stenax, were enslaved; others were exterminated. Empty worlds were settled by Tionese colonists, their numbers steadily increasing as part of Xim's strategy of conquest. The Thanium Worlds became the largest and richest of Xim's new provinces."}, {"tag": "p", "text": "Xim's spinward push ended at Far Thanium, Vynx, and Thule, just inside what later generations would call the Gordian Reach. Beyond Thule was the Radama Void, an empty expanse that determined the direction of Xim's next conquest."}, {"tag": "h3", "text": "The Far Indrexu"}, {"tag": "p", "text": "Xim's forces then turned rimward, moving from Kanaver to Janodral Mizar, before splitting to conquer Makem Te and Quermia, and turning south to Tinatorn and Pakuuni. The second force moved from Janodral Mizar to Utavurk and Yutusk, before encountering a fierce challenge at the Battle of Ranroon: the Queen of Ranroon, Hylei Indrexu Cortess, fought Xim's invading janissaries for every inch of ground on her planet. Despite being defeated, Indrexu clearly made a strong impression on Xim, who renamed the Ihala Spiral nebula to the Indrexu Spiral in her honor, and the Far Indrexu became the sixth province of Xim's empire, with Yutusk as the Sixth Throne."}, {"tag": "h3", "text": "The Kiirium Reaches"}, {"tag": "p", "text": "Concurrent to the war in the Thanium Worlds was the conquest of the Kiirium Reaches from 25,120 BBY to 25,096 BBY. Rich in the then-valuable military resource kiirium, the Reaches were a vital addition to Xim's military-industrial complex, and three forces moved to conquer the region. One moved from Pakuuni to Xoraes via Ulonsus. The second moved from Caluula to Dellalt, then to Balshebr and Astigone. From there it moved via Kveror to Gwynhes, where it linked up with the third force sent from Murkhana to take Huronom and Far Barseg. Both forces then moved to conquer Gwynhes Minor. Huronom and Astigone then became the Seventh and Eighth Thrones of the empire."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "It was after the conquest of the Kiirium Reaches that Xim first learned of the Hutts after encountering Sakiyan and Nimbanel traders. Knowing from these stories that the Hutt Empire could not be conquered outright, he hoped to coexist with them while at the same time preparing for war. Diplomatic contact between the Hutts and the Tion broke down, however, beginning the Hutt–Xim conflict in 25,102 BBY that would see the end of Xim's empire."}, {"tag": "p", "text": "Hylei Indrexu Cortess was a debated historical figure for millennia after Xim's wars. According to the later Hutt dramatist Direus'Pei in his play Evocar, Xim murdered his father after discovering that he had taken Indrexu as his wife. Other scholars considered this a pure literary invention, with some totally dismissing Indrexu's existence. Still other scholars accepted her existence but argued about her role in Xim's empire and her ultimate fate. To some she was a minor figure, a fixture at Xim's court whose name endured; to others she was the pivot around which the empire turned, and even the very cause of the Cronese Wars, Xim's expansion and everything thereafter."}, {"tag": "h2", "text": "Xim's military"}, {"tag": "p", "text": "Xim the Despot's military was extremely advanced for its day, built from lost Rakatan technology. The scale of his armies and conquests meant that numerous examples of Xim's weaponry survived to the Galactic Civil War era. Xim's infantry were divided into several castes. Most were janissaries taken from occupied worlds, trained from childhood to serve as soldiers. They wore armor and helmets of lightweight ceramic alloy and carried either slugthrowers or heatbeams, which used lasers to generate jets of plasma. Heatbeamers wore tough, fireproof padded gloves and kamas as protection against their weapons' superheated exhausts. The kama would later be adopted by the Thyrsus Sun Guard and by the Mandalorian people as part of their culture."}, {"tag": "p", "text": "Among Xim's elite units were the Duinarbulon Star Lancers, who wore gloss-black ceramic armor and carried advanced (for the time) beam-tubes, distant ancestors of the blaster. The infantry was supported by tracked tanks, armored groundcars, and floaters armed with beam-tube cannons. Elite vehicles were armored with kiirium to reflect energy weapons. Xim's most famous soldiers were the War-Robots of the Guardian Corps, three-meter tall battle droids armed with heatbeams, particle dischargers, and pulse-wave cannons. The War-Robots were typically kept in reserve for use as shock troops."}, {"tag": "p", "text": "Xim's warships were smaller than Imperial-era craft and were all unique designs, since the ancient Tionese saw warship construction as an art form as opposed to an industry. Under the Anaxes War College System, the bulk of Xim's warships would be considered frigates or corvettes, and included Argaian hemiolia, Livien cutters, Thanium star-glaives, and Cronian battlebirds in mixed squadrons. Larger vessels, around the size of a cruiser, included Cronese harpices, Brigian penteconters, Thanium polyremes, Yutuski rakehells and Xolochi Dreadnoughts. Xim's flagships included the Eibon Scimitar and the Deathknell."}, {"tag": "p", "text": "Xim's naval weapons were primarily torpedos, concussion missiles, and pulse cannons, which melted enemy hulls and disrupted circuitry with blasts of radiation. The Despot's ships were armored with kiirium, a superconducting alloy that gave each ship a mirrored hull that could reflect enemy energy weapons. Mytag crystals were used in communications and sensor systems to protect them from electromagnetic attack. Bordhell fuel slugs gave Xim's warships unparalleled range and speed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}