{"url": "Xim%27s_empire", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Interplanetary governments", "Category:Outer Rim Territories governments", "Category:Pre-Republic", "Category:Tion Cluster historic states", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Xim's empire"}, {"tag": "p", "text": "Xim's empire was the massive empire created by Xim the Despot's conquests, and which fractured on his death."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The empire had its origins in the Kingdom of Cron, a fiefdom carved out during the Cronese Sweeps by Xer VIII, the pirate who became Xim's father. Based on Argai and containing at least thirteen other planets, it was the first territory ruled by Xim when he came into power in 25,130 BBY."}, {"tag": "p", "text": "The first ten years of Xim's reign were known as his Expansionist Period. During this time he conquered much of the Tion Cluster, including the Livien League in 25,130 BBY which was established within it. At its height, Xim's empire included thousands of worlds and stretched from the Radama Void to the Maw. Xim established a secret police, the GenoHaradan, and used terror tactics including mass executions to maintain order. He also pioneered the construction of war droids to bolster his combat forces. Xim used orbital fortresses during his campaigns. At the height of the empire's power, Xim held palaces on Argai and Raxus, great vaults on Dellalt, and a monolithic statue on Desevro."}, {"tag": "p", "text": "However, Xim's swath of conquest would soon bring him into conflict with the Hutt Empire, the preeminent power in the galaxy and already a historic enemy of his Tionese subjects. For some time, they had quarreled over control of the Si'Klaata Cluster. It was during this period that the orbital fortress now known as Terman Station was placed near Sriluur in the Periphery. In 25,102 BBY Xim decimated the Hutt colony world of Ko Vari. However, shortly after, the Hutts under Kossak in turn destroyed an entire fleet of Xim's at the First Battle of Vontor."}, {"tag": "p", "text": "Shortly later, a second battle was fought at Vontor, with an inconclusive result. This led to the Hutts imposing the Treaty of Vontor on the Vodrans, Niktos, Klatooinians, and Weequay, gaining those species' services as mercenaries. In the third battle for Vontor in 25,100 BBY, Xim's forces were totally decimated, with his treasure ship, the Queen of Ranroon, being one of the few forces of his to survive. Xim was captured and taken to Nal Hutta, where he died a prisoner in Kossak's palace."}, {"tag": "p", "text": "Following the death of Xim, his empire quickly collapsed under the Hutt invasion. The Kingdom of Cron reasserted its independence, and new states such as the Jaminere Marches and the Honorable Union of Desevro & Tion were quickly formed out of the former territory of the empire. During the Tionese War (24,000 BBY), the Tionese crumbled under the Galactic Republic."}, {"tag": "p", "text": "The GenoHaradan would continue to exist for at least the next 20,000 years, evolving into a criminal syndicate. Xim would continue to be a hero of the Tionese people for millennia, despite his brutish ways."}, {"tag": "h2", "text": "Economy and society"}, {"tag": "p", "text": "Occupying thousands of worlds, Xim's empire became extremely wealthy, with an economy generally geared towards war fighting: shipyards and factories on Jaminere, Cadinth and Thanium provided the equipment and materiel for Xim's war machine. Other worlds built merchant ships and beacons, and Tionese artisans sought to outdo each other: Xim expanded or built vast palaces on Raxus Prime, Amarin and Argai, and a royal retreat at Nuswatta."}, {"tag": "p", "text": "The famous Forbidden Gardens of Nuswatta perhaps exemplified the nature of Xim's rule: for all but Xim's court, gazing upon the Gardens brought the death sentence, and according to legend they were tended by a cadre of slaves blinded at birth. Other rumors told of failed military officers, traitors, or conquered enemies being executed there. Xim also controlled his conquests through his dreaded secret police, the GenoHaradan, and the use of terror tactics such as mass executions."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "Xim the Despot built a powerful military-industrial complex from lost Rakatan technology. The scale of his armies and conquests meant that numerous examples of Xim's weaponry survived to the Galactic Civil War era. Xim's infantry were divided into several castes. Most were janissaries taken from occupied worlds, trained from childhood to serve as soldiers. They wore armor and helmets of lightweight ceramic alloy and carried either slugthrowers or heatbeams, which used lasers to generate jets of plasma. Heatbeamers wore tough, fireproof padded gloves and kamas a protection against their weapons' superheated exhausts. The kama would later be adopted by the Thyrsus Sun Guard and by the Mandalorian people as part of their culture."}, {"tag": "p", "text": "Among Xim's elite units were the Duinarbulon Star Lancers, who wore gloss-black kiirium ceramic armor and carried advanced (for the time) beam-tubes, distant ancestors of the blaster. The infantry was supported by tracked tanks, armored groundcars, and floaters armed with beam-tube cannons. Elite vehicles were armored with kiirium to reflect energy weapons. Xim's most famous soldiers were the War-Robots of the Guardian Corps, three-meter tall battle droids armed with heatbeams, particle dischargers, and pulse-wave cannons. The War-Robots were typically kept in reserve for use as shock troops."}, {"tag": "p", "text": "Xim's warships were smaller than Imperial-era craft and were all unique designs, since the ancient Tionese saw warship construction as an art form as opposed to an industry. Under the Anaxes War College System, the bulk of Xim's warships would be considered frigates or corvettes, and included Argaian hemiolia, Livien cutters, Thanium star-glaives, and Cronian battlebirds in mixed squadrons. Larger vessels, around the size of a cruiser, included Cronese harpices, Brigian penteconters, Thanium polyremes, Yutuski rakehells and Xolochi Dreadnoughts. Xim's flagships included the Eibon Scimitar and the Deathknell."}, {"tag": "p", "text": "Xim's naval weapons were primarily torpedos, concussion missiles, and pulse cannons, which melted enemy hulls and disrupted circuitry with blasts of radiation. The Despot's ships were armored with kiirium, a superconducting alloy that gave each ship a mirrored hull that could reflect enemy energy weapons. Mytag crystals were used in communications and sensor systems to protect them from electromagnetic attack. Bordhell-type fuel slugs gave Xim's warships unparalleled range and speed."}, {"tag": "h2", "text": "Astrography"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}