{"url": "Ximpi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Avian and airborne sentient species", "Category:Ximpi"], "nodes": [{"tag": "h1", "text": "Ximpi"}, {"tag": "p", "text": "The Ximpi were a sentient species of small, winged humanoids with gray skin, broad heads and pointed ears. A number of Ximpi were in the employ of the crime lord Papa Toren. Those individuals would translate Toren's otherwise unintelligible mumbles to his discussion partners and, if necessary, protect him from harm."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "The Ximpi were a species of small, winged humanoids with gray skin, broad heads and pointed ears. They could converse in Galactic Basic Standard and the alien crime lord Papa Toren's language."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The diminutive Ximpi were native to the Galactic Frontier planet of Shuraden and had some understanding of the workings of the greater High Republic, including the mysterious Jedi Order. Around the year 232 BBY, the Ximpi Kanrii encountered two Jedi, Keeve Trennis and her Master Sskeer, as they trained on the planet. Although the small Ximpi did not know whether the planet actually had a place within the Republic, Kanrii still believed that the Jedi had come to protect them."}, {"tag": "h2", "text": "Ximpi in the galaxy"}, {"tag": "p", "text": "At least two Ximpi served the crime lord Toren during the Imperial Era and the New Republic Era. One of these Ximpi was killed when the gravity shield at Megalox prison collapsed, causing him to crash to the ground."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ximpi first appeared along with Papa Toren in the first issue of the Marvel comic book miniseries Star Wars: Lando, which was written by Charles Soule and illustrated by Alex Maleev. Although no name for the species was presented in the comic, Soule later revealed that he called the creatures \"elves\" in his scripts. It would not be until 2020 that the Ximpi received their official name, which was mentioned in a preview for the 2021 comic book The High Republic 1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}