{"url": "XoXaan", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Wookieepedia Featured articles under probation", "Category:Exiles", "Category:Females", "Category:Force ghosts", "Category:Individuals of unidentified species", "Category:Sith healers", "Category:Sith Lords of the Sith Empire", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "XoXaan"}, {"tag": "p", "text": "XoXaan was a humanoid female who, along with eleven other Jedi defectors, became the first Lords of the Sith. As Marchioness of the Dark Jedi's Black Legions, XoXaan fought in the cataclysmic Hundred-Year Darkness war only to be defeated and exiled from the Jedi Order following a rout on the world of Corbos. Guilty of high treason, XoXaan was among the beaten Dark Jedi that were banished from the Republic, only to discover Korriban, where they found and enslaved the aboriginal Sith species. Christened as the first of the Sith Lords, XoXaan and her contemporaries instituted a religion that centered around worship and practice of the dark side of the Force."}, {"tag": "p", "text": "Though other Sith Lords possessed similar talents, XoXaan was noted amongst her peers for her skills in dark side healing. She recorded her knowledge in a holocron, which was entombed with her in Korriban's Valley of the Dark Lords. Her spirit waited thousands of years for someone to come along whom she felt was worthy of her Sith teachings, and found one such student in the ex-Jedi A'Sharad Hett. From XoXaan's spirit and holocron, Hett learned the ways of the dark side, and eventually created a new Sith Order based on her teachings. After Hett assumed the mantle of Dark Lord of the Sith under the moniker Darth Krayt, he constructed a massive statue in reverence of XoXaan—who was considered his first and greatest Sith teacher—within the Temple of the Sith on the planet Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Exile"}, {"tag": "p", "text": "XoXaan was a humanoid female member of the Jedi Order during the Old Republic era. She was aligned to a movement within the Order of beings who sought to further delve into the Force through exploration of its dark side, and was embittered with the Order's refusal to embrace contemporary philosophy. A rift spread between the opposing schools of thought, and the proponents of the light took up arms against XoXaan and her allies in a war that spanned one hundred years. As Marchioness of the Dark Jedi's Black Legions, at the climax of the conflict XoXaan and her forces waged a final battle against the Jedi Order on the Outer Rim planet Corbos. XoXaan fought on the surface of the world alongside fellow Dark Jedi Karness Muur and Baron Remulus Dreypa, and her forces were defeated by the Jedi, bringing the war to an end. She survived the conflict with eleven allies, among them Dreypa, Muur, Sorzus Syn, and commanding High General Ajunta Pall. Rather than execute the defeated, the Jedi Order exiled and banished them from the Galactic Republic into deep space, left to contemplate the error of their ways."}, {"tag": "p", "text": "Pursuing rumors of an ancient Kingdom of the Sith, XoXaan and her fellow exiles traveled into Sith Space. Along the Nache Bhelfia route, they discovered what would become the five sacred Sith worlds: Khar Delba, Krayiss, Rhelg, Ziost, and Korriban. They arrived on the last and encountered the native Sith people in 6900 BBY. After weeks spent deciphering the native culture, they installed themselves as overlords of the Sith and were worshipped as gods known as the Jen'jidai. Ajunta Pall claimed dominion as Dark Lord of the Sith; Xoxaan, along with her colleagues, took up the mantle of Sith Lord and began the creation of a Sith-dominated empire. As XoXaan progressed further in the ways of the Sith, she developed a talent for healing through the dark side of the Force, and was renowned amongst her fellow Sith Lords for it. At some point XoXaan passed away, but not before recording much of her knowledge within a Sith holocron. She was laid to rest within Korriban's Valley of the Dark Lords in her own mausoleum, along with her holocron. Though her flesh had died, XoXaan's spirit resided within her holocron and waited for one she felt had—like her—found the teachings of the light side to be lacking. More than four thousand years passed, and eventually, XoXaan's wait ended with the arrival of A'Sharad Hett, a bounty hunter who had once been a Jedi Master."}, {"tag": "h3", "text": "Training a Dark Lord"}, {"tag": "p", "text": "XoXaan sensed Hett's presence on Korriban while he tracked a bounty named Resk. After killing him, Hett felt XoXaan call to him from the depths of her tomb. He followed the voice and was led inside XoXaan's resting place, where he found the door to her burial chamber. After shattering it with the Force, Hett discovered XoXaan's holocron, which released her spirit upon activation. Sensing the darkness within the bounty hunter, the spirit of XoXaan introduced itself to Hett and offered to initiate him in the ways of the dark side, an offer he accepted."}, {"tag": "p", "text": "As his Master, XoXaan's spirit taught Hett for years, instilling in him the traditions of the original Sith Lords and enhancing his skills through use of the dark side. However, Hett did not initially intend to fully embrace the dark side, and tried to convince himself that he could feign his status as a Sith Acolyte. He only wanted to learn enough about the dark side through XoXaan's teachings to further his own goals, which included toppling the perpetrator of the Great Jedi Purge—Darth Sidious, reigning Dark Lord of the Sith, and his apprentice, Darth Vader."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "When Hett completed his training under XoXaan, he exited her tomb prepared to execute his mission against Darth Sidious, only to find that a New Republic had replaced Sidious's Galactic Empire. Dejected, Hett left known space, where he was captured in the Unknown Regions and imprisoned by scouts from the extra-galactic Yuuzhan Vong species, who also tortured and implanted their slave seeds in him. Combined with XoXaan's teachings, these experiences led to his rebirth as Darth Krayt and the formation of his One Sith Order. After Krayt conquered Coruscant, he placed a gigantic statue of XoXaan within the new Temple of the Sith, in honor of his mentor."}, {"tag": "p", "text": "By 137 ABY, the Vong implants within Krayt had ravaged his body, to the point that he felt as though his death was on the horizon. Darth Wyyrlok III, Krayt's chief lieutenant, delved deep into ancient Sith lore hoping to find a way to cure his Master. He even consulted XoXaan's considerable knowledge of dark side healing for any potential secrets; however, Wyyrlok found that XoXaan's teachings proved unsatisfactory and was thus forced to search elsewhere for answers."}, {"tag": "p", "text": "By that same time, XoXaan's temple on Korriban had been restored to a habitable capacity, and was among other structures that were reconditioned and put to use by the One Sith. Her temple was furnished with stasis chambers and laboratories; its medical facilities would be used to rehabilitate several Sith Lords, who had all suffered grievous wounds and subsequent defeat in battle on Had Abbadon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many of her original brethren, XoXaan was a Sith Lord who found the way of the Jedi unsatisfying. She believed that the teachings of the Jedi were flawed and that a greater truth lay in the path of the dark side. She also felt that the galaxy was empty and that Sith-inspired rule was required to fill it. When the Dark Jedi encountered the native Sith on Korriban, XoXaan was among those who played off of their naiveté, allowing the Sith to treat them as deities. She also adopted their customs, including the creation of holocrons, a secret that could be traced back to the ancient Sith king Adas. As a Sith Master, XoXaan reserved her teachings for those whom she believed had experienced her same disillusion with the Jedi Order, one who believed that the truth lay in the path of the dark side."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "XoXaan used the power of the dark side to conquer beings she considered inferior, such as the malleable Sith race she and her colleagues enslaved on Korriban. XoXaan was well-versed in Sith lore and stored what she knew within the recesses of her own holocron. Her knowledge included dark side healing techniques, though Darth Wyyrlok found that none of them were able to successfully remove the slave seeds from Emperor Krayt's body. She wielded a yellow-bladed protosaber and she also possessed the Yoke of Seeming, a Sith artifact that allowed its wearer to take on whatever appearance they desired."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "XoXaan was first mentioned in the fourteenth issue of the Star Wars: Legacy series, Claws of the Dragon, Part 1, written by John Ostrander. As there was no context given in the comic as to what XoXaan was—or even how the word was capitalized—questions arose on the forums of TheForce.Net on who or what it meant, and what the spelling and correct pronunciation was. Artist Jan Duursema, who co-authored Claws of the Dragon and the subsequent comics in which the character appeared, established that the name was capitalized as \"XoXaan\", and that the pronunciation was \"Zoh-Zaahn.\""}, {"tag": "p", "text": "XoXaan's backstory was minimally explored by Ostrander in Legacy's seventeenth issue, Claws of the Dragon, Part 4, in which she only appeared in flashbacks of Darth Krayt's path down the dark side. XoXaan was drawn by Jan Duursema for Claws of the Dragon, Part 4, as well as in her next appearance, Legacy 30. In Vector 11, once again by means of flashbacks, XoXaan was established to be connected to the character of Karness Muur, who was the main antagonist of the Vector story arc. Along with Muur, Ostrander named XoXaan as one of the Dark Jedi exiles of the Hundred-Year Darkness, whose original appearance was in Star Wars: Tales of the Jedi — The Golden Age of the Sith. In Book of Sith: Secrets from the Dark Side by Daniel Wallace, XoXaan is identified as one of only twelve survivors of the Hundred-Year Darkness."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}