{"url": "Xiytiar-class_heavy_transport", "categories": ["Category:Canon articles", "Category:Galactic Empire starship classes", "Category:Transport classes", "Category:Xiytiar-class transports"], "nodes": [{"tag": "h1", "text": "Xiytiar-class heavy transport"}, {"tag": "p", "text": "The Xiytiar-class heavy transport was a large cargo ship manufactured by TransGalMeg Industries, Incorporated. They were unarmed transports primarily owned by large corporations and the Galactic Empire, who could afford the overhead costs of providing protection for the ships from criminals."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Xiytiar-class heavy transports were sturdy vessels shaped like a lopsided dumbbell and comparable in size to Mobquet's Mb-C1 heavy transport. The ship was designed to operate with a crew of ten people. A full complement consisted of a pilot, a co-pilot, a loadmaster and an engineer assisted by six technicians. Though difficult, the ship could be run by a skeleton crew of two beings."}, {"tag": "p", "text": "The Xiytiar-class was very slow, but compensated with the latest in navicomputer, hyperdrive and cargo-management systems. Xiytiars had no weapons, and therefore relied on defensive escort ships for protection from pirates and other criminal organizations. The larger forward section contained the command deck, living quarters as well as the cargo holds, accessible though a large hatch on the nose of the ship. The midship area housed the sensor systems, cables, machinery and a narrow walkway connecting the forward and aft engineering section. The rear of the ship held the drive and power systems, primary computers core and shield generators."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Xiytiar-class transport was primarily purchased and utilized by large corporations. Because they were not well equipped for transporting valuable cargo, the Galactic Empire's merchant marine used Xiytiar transports to haul bulk food supplies and heavy equipment across the galaxy. A nomadic collective calling themselves the Wanderers owned seven of the lumbering vessels and traveled from system to system as a kind of traveling trade bazaar."}, {"tag": "p", "text": "At one point, the owners of the Xiytiar-class transport Double Down attempted to increase their profits by hauling a cargo of highly valuable merchandise without any defensive escort ships and a skeleton crew. Word leaked about the ship and several pirate groups attacked the vessel at the same time in an attempt to claim the prize."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}