{"url": "Xucphra_Corporation", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Medical companies"], "nodes": [{"tag": "h1", "text": "Xucphra Corporation"}, {"tag": "p", "text": "The Xucphra Corporation, known simply as Xucphra, was one of two bacta-producing and distributing corporations in the galaxy. The Human-controlled company was based on the planet Thyferra."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 44 BBY, along with the Trade Federation, it was one of the secret instigators of the Stark Hyperspace War and also sabotaged the supply to drive up prices. Adol Bel was one of Xucphra's directors at that time. The Ashern used this information in 32 BBY to discredit Xucphra, and governmental control of Thyferra went to the native Vratix but it continued to be the galaxy's main producer of bacta."}, {"tag": "p", "text": "When the Clone Wars begun, Xuphra and Zaltin again seized control of the planet. In the Imperial Period, the Galactic Empire granted, along with the Zaltin Corporation, the sole rights to produce and market bacta for the entire galaxy. The two corporations made up a monopoly known as the Bacta Cartel. Xucphra, however, was the more pro-Imperial company and was the first to be granted a license.[source?] Erisi Dlarit's family were involved with Xucphra; her uncle had discovered the contamination introduced in Lot ZX1449F."}, {"tag": "p", "text": "Ysanne Isard became Head of State of Thyferra backed up by Xucphra and she gained control of both the planet and the Xucphra Corporation, which had yielded to Isard and helped to instigate a civil war in the hopes of gaining sole control of the Bacta Cartel. As a result of the company's assistance in the takeover, Zalxuc City was renamed Xucphra City."}, {"tag": "p", "text": "It still existed as of the Yuuzhan Vong War when it supplied the Coronet Medcenter with bacta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Episode III video game adaption for the PlayStation 2 and Xbox, the word XUCPHRA unlocks the cheat Unlimited Health."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}