{"url": "Xorrn/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Confederacy of Independent Systems planets", "Category:Desert planets", "Category:Factory worlds", "Category:Ferra sector planets", "Category:Xorrn locations"], "nodes": [{"tag": "h1", "text": "Xorrn"}, {"tag": "p", "text": "Xorrn was a mineral rich planet located in the Ferra sector within the Outer Rim Territories. Xorrn was a young planet. As the surface of the planet had only recently begun to cool, the natural resources of the planet were easily accessed. However the unstable crust and prohibitive start-up costs prevented nearly all mining operations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the Clone Wars, Geonosians used Xorrn to illegaly build battle droids. The Geonosians tried to erect their traditional hive spires on the planet, though all collapsed before their completion because of Xorrn's thin crust. To overcome the problem the Geonosians started to reverse build their spires, excavating them instead of erecting. This allowed Xorrn to become the Geonosians' best-kept secret. Millions of battle droids were produced by the hives on Xorrn without the Republic even noticing. Making the Geonosians the only ones thus far to find any success on the planet. The secrecy of the Geonosian operations on Xorrn didn't last long."}, {"tag": "p", "text": "A short while after the outbreak of the Clone Wars, Xorrn was discovered by the Republic. The planet became a target of numerous Republic attacks. When several assaults at Xorrn and other Geonosian worlds failed, the Republic decided not to waste anymore losses on capturing the planet. The sector fleet bombarded the Geonosian hives, destroying dozens of Trade Federation Core ships in the process. They still lay scattered around the planet's surface at the time of the Galactic Civil War, when Xorrn was the location of another battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}