{"url": "Xorem", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Republic Army personnel"], "nodes": [{"tag": "h1", "text": "Xorem"}, {"tag": "p", "text": "Xorem was a Human male who served the Galactic Republic as part of the Republic Army during the Cold War. He was stationed on the planet Ord Mantell during part of the war, where he fought against the Mantellian Separatist Movement in the Separatist War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Xorem was a Human male who served in the Galactic Republic's army during the Cold War, a conflict between the Sith Empire and the Republic. During the war he held the rank of Lieutenant and was deployed on the Republic held planet of Ord Mantell in the Bright Jewel system of the Mid Rim. While stationed on the planet he and all Republic forces aided the corrupt local government in fighting the Mantellian Separatist Movement."}, {"tag": "p", "text": "During the civil war Xorem was stationed with in the Republic stronghold, Fort Garnik. The Separatist movement attacked and captured the island of Mannett Point located near the Fort and while doing so destroyed the bridge connecting the island to the mainland. This trapped many citizens on the island preventing them escaping the conflict. This angered Xorem, particularly as a associate of his, Doctor Jaen Kett, was amongst those trapped."}, {"tag": "p", "text": "Xorem then asked other Republic individuals to find Kett and safely return him to Garnik. They successfully located the doctor who was hiding in the island's medical center where he was caring for several children orphaned in the attack. He refused to leave the island without the children and told the pair that they must return to Xorem and request a number of boats and other supplies to safely evacuate the children and Kett himself from the island. The pair returned to Xorem and informed him of Kett's request which he initially declared would be hard to fulfill but agreed to upon advice from the pair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Whilst stationed in Garnik Xorem wore a blue and white uniform. He was armed with a black blaster pistol which he kept in a holster strapped across his chest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Xorem is a Non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is involved in a single quest, victims of war, available to characters of the trooper or smuggler classes. It is not possible for players of the Imperial faction to interact with Xorem as there is currently no way Imperial characters can travel to Ord Mantell."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}