{"url": "YT-2400_Freighter_Expansion_Pack", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Miniatures Game Wave V"], "nodes": [{"tag": "h1", "text": "YT-2400 Freighter Expansion Pack"}, {"tag": "p", "text": "The YT-2400 Freighter Expansion Pack is a supplement to the Star Wars: X-Wing Miniatures Game from Fantasy Flight Games. The expansion features a detailed miniature of the YT-2400 light freighter. It was released on November 26, 2014 as part of the game's fifth wave of expansions."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A fast and resilient light freighter, the YT-2400 features no fewer than thirteen weapon emplacement points, making it an attractive vessel for smugglers, mercenaries, and other individuals looking for a heavily armed transport. Although a stock YT-2400 light freighter has plenty of space for cargo, much of that space is often annexed to support modified weapon systems and oversized engines."}, {"tag": "p", "text": "The YT-2400 Freighter Expansion Pack brings this formidable light freighter to your table as a Rebel starship with two attack, two agility, five hull, and five shields."}, {"tag": "p", "text": "The highlight of the YT-2400 Freighter Expansion Pack is its detailed miniature starship, which is enhanced by one new mission, three debris cloud tokens, a maneuver dial, all requisite tokens, and four ship cards, including one for the famed smuggler Dash Rendar."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The YT-2400 Freighter Expansion Pack contains one YT-2400 Freighter miniature, plus a maneuver dial and action tokens, as well as pilot and upgrade cards."}, {"tag": "h3", "text": "Mission scenario"}, {"tag": "h3", "text": "Ship components"}, {"tag": "p", "text": "NOTE: The YT-2400 Freighter (like the VT-49) expansion pack does not include any ID tokens. Also, like the YT-1300, Firespray-31 and the VT-49, the YT-2400 Freighter has Target Lock as an action, but the expansion pack does not include any Target Lock tokens."}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Pilot cards"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "h4", "text": "Reference cards"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}