{"url": "YT-1000_light_freighter", "categories": ["Category:Canon articles", "Category:YT-1000 light freighters", "Category:YT-series freighter classes"], "nodes": [{"tag": "h1", "text": "YT-1000 light freighter"}, {"tag": "p", "text": "The YT-1000 freighter, also known as the YT-1000 transport, was a starship model designed to transport passengers and cargo on interstellar journeys. The ship was circular in design, with an outrigger cockpit sandwiched between a pair of rectangular mandibles. YT-1000 was considered outdated by 14 BBY, being already in use for more than a century."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The YT-1000 freighter was a saucer-shaped starship that had a front-facing, centered cockpit that was surrounded by a pair of mandibles. The cockpit had large transparisteel windows that were retrofitted from Barloz-class freighter cockpit canopies. The freighter was 28 meters in length and was manned by a crew of two. It had consumables for two months and could reach speeds of 740 kilometers per hour. A stock YT-1000 was equipped with sublight engines, a navigation computer, sensor suite, and a Class 3 primary hyperdrive with a Class 16 backup hyperdrive. The freighter came armed with a standard laser cannon. A new YT-1000 was priced at 85,000 credits, while used ones were priced at 20,000."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The YT-1000 worked both as a freighter and as a transport. It could carry up to four passengers and had a cargo capacity of 75 metric tons."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "The YT-1000 freighter was designed by the Corellian Engineering Corporation as an experimental departure from their YG series and as a possible replacement to the \"tired\" Barloz-class freighter. Inspiration for the new freighter was taken from the ancient XS stock light freighter. As such, the YT-1000 was designed as a saucer-shaped freighter, with a cockpit centered atop the hull."}, {"tag": "p", "text": "CEC released the YT-1000 as a limited run to largely positive response. Surveys indicated consumers liked the design of the YT-1000, but would be willing to pay more for a larger, more modular ship."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The YT-1000 freighter was succeeded by the YT-1200 transport and the YT-1210 transport. Neither ship was more significantly advanced than the YT-1000, but the two introduced the the side mounted cockpit that would be common on subsequent YT-series freighters."}, {"tag": "p", "text": "In 14 BBY during the Age of the Empire, a YT-1000 freighter known as the Reticent was captured by Imperial Moff Wilhuff Tarkin and Darth Vader. The Reticent was at least a century old and was owned by a Koorivar captain who acquired it in 17 BBY from an information broker named Knotts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The YT-1000 freighter made its first ever appearance in the Gamemaster Toolkit: Live-Action Adventures, a gamebook published by West End Games in 1996. In Star Wars Canon, the YT-1000 first appeared in the 2014 James Luceno novel Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}