{"url": "Y-85_Titan_dropship/Legends", "categories": ["Category:Legends articles", "Category:Dropship classes", "Category:Galactic Empire starship classes", "Category:Incom Corporation products"], "nodes": [{"tag": "h1", "text": "Y-85 Titan dropship"}, {"tag": "p", "text": "The Y-85 Titan dropship, colloquially known as the walker dropship, was an important dropship used to deploy AT-ATs, prefabricated garrison bases and AT-STs onto planetary surfaces."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Y-85 could accommodate four AT-ATs in addition to four AT-STs. Walkers were held by cranes, clamped along the sides, in battle-ready configuration, and could be quickly deployed via drop-down floor hatches. The Y-85 was armed with two forward twin laser cannons for defense.\nThe walker dropship could also be used to deploy AT-AT swimmers and TIE fighter boats straight into any body of water."}, {"tag": "p", "text": "Because of the Y-85's size, it could only fit inside larger Imperial ships. The launch bays of smaller vessels, like Star Destroyers, could only hold landers like the Theta-class AT-AT barge due to their smaller hangar apertures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Y-85 was only reluctantly used by Imperial forces because it was manufactured by the Incom Corporation, a company that also built the Rebel Alliance's X-wing starfighters."}, {"tag": "p", "text": "The Executor relied on these dropships to deploy its garrison bases when necessary. The Y-85 was credited with delivering walkers to the Hoth surface before the assault on Echo Base."}, {"tag": "p", "text": "Some of these dropships were also used by the United Warlord Fleets in the attack on the Jedi Praxeum in 12 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Early Expanded Universe sources claimed that an Imperial-class Star Destroyer carried 12 \"landing barges\" of unspecified class. It was stated that these barges were each capable of holding 4 AT-ATs or 8 AT-STs, as well as 1,000 troops."}, {"tag": "p", "text": "The author Curtis Saxton found it doubtful that such a large craft could fit inside the hangar of a Star Destroyer. He later served as a consultant during the writing of the book Inside the Worlds of Star Wars Trilogy. This book was not only the first official source to fully depict and name the Y-85, but also confirmed that Imperial-class Star Destroyers only have hangars large enough for single-walker landing barges."}, {"tag": "p", "text": "An earlier nonfiction book, Star Wars: Incredible Cross-Sections, by David West Reynolds, had also portrayed a single-walker barge inside the hangars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}