{"url": "YT-2000_transport", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:YT-2000 light freighters", "Category:YT-series freighter classes"], "nodes": [{"tag": "h1", "text": "YT-2000 transport"}, {"tag": "p", "text": "The YT-2000 transport was a model of freighter produced by Corellian Engineering Corporation. One such vessel, the Stellar Sun, was owned by the human Rikarda."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The YT-2000 transport, was a model of freighter in the YT-series conceived by Corellian Engineering Corporation. The YT-2000 was a saucer-shaped starship, 29.4 meters in length, with a centrally positioned cockpit sandwiched between two large mandibles, much like the YT-1930 transport. However, unlike the YT-1930, the YT-2000 had its cockpit extended past its mandibles, providing the pilot with a clearer, unobstructed view. The standard cockpit also doubled as a lifeboat that could break away from the ship in an emergency."}, {"tag": "p", "text": "The YT-2000 had heavier shields and weapons than most civilian freighters; the stock model was armed with 2 double laser cannons. The freighter could carry 115 metric tons of cargo, 15 more than the YT-1300 model. The YT-2000 transport had a Class 2 main hyperdrive and a backup Class 12 operated by a hyperdrive system and navicomputer. The YT-2000 was piloted by a crew of 4, and could carry up to 7 passengers."}, {"tag": "p", "text": "The YT-2000 could reach speeds up to 800kph and had consumables for 3 months. A new model cost 150,000 credits while a used one went for 45,000 credits"}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The YT-2000 was a freighter admirable for its extensive cargo capacity, strong defensive systems, amazing maneuverability, and several opportunities for modification. Corellian Engineering Corporation hoped its detachable cockpit would appeal to safety minded crew."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The YT-2000 transport was developed by Corellian Engineering Corporation for the civilian market during the Imperial Era, when the Rebel Alliance rose up against the Galactic Empire. Prior to the ships release, corporate spies leaked the YT-2000's design specifications to competing shipyards. This prompted CEC to rush the YT-2000 into production without properly testing the ship's system and design. Intended as an overall improvement to the YT-1300, the YT-2000 was criticized for being \"somewhat touchy\". Despite this, the YT-2000 proved popular with consumers, but was discontinued early after CEC unveiled the YT-2400 light freighter."}, {"tag": "p", "text": "During the reign of the Galactic Empire, freighter captain Rikarda owned a YT-2000 transport known as the Stellar Sun. Rikarda used the Stellar Sun to transport gambler Lando Calrissian to the planet Zyzar in order to rescue his puffer pig."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The YT-2000 class was created as part of the backstory for the Otana, the personal transport of the game's protagonist in the Star Wars Legends video game Star Wars: X-Wing Alliance. The starship class was introduced to canon in 2016 in the comic strip Puffer Problems and named in 2018 through its inclusion in the YT-1300 Millennium Falcon Owners' Workshop Manual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}