{"url": "YT-1300_light_freighter", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles to be split", "Category:Alliance to Restore the Republic starship classes", "Category:Resistance starship classes", "Category:YT-1300 light freighters", "Category:YT-series freighter classes"], "nodes": [{"tag": "h1", "text": "YT-1300 light freighter"}, {"tag": "p", "text": "The YT-1300 light freighter, also known as the YT-1300 Corellian freighter, was a type of light freighter manufactured by the Corellian Engineering Corporation that saw operation in the galaxy during the final days of the Galactic Republic and the reign of the Galactic Empire. By the year 0 BBY, it was considered an outdated model. The Millennium Falcon, a smuggling vessel that became part of the Rebel Alliance fleet, was a YT-1300 of the YT-1300f variety."}, {"tag": "h2", "text": "Details"}, {"tag": "p", "text": "The Corellian YT-1300 was used as a freighter and transport, and some saw service as intermodal tugs in orbital freight yards. The vessel's side-mounted cockpit and front-facing mandibles allowed it to push containers, although the design was modular enough to allow enterprising captains to modify their ships. Standard YT-1300s possessed powerful engines and stock hyperdrives. It had a central passage tube that ran from the ventral to the dorsal hull. At each end was a transparisteel window labelled as an observation deck, but weapon turrets could be installed. The YT-1300 was renowned for its durability and its modular design that allowed for multiple configurations beyond the stock configurations designated by the Corellian Engineering Corporation."}, {"tag": "h2", "text": "Configuration"}, {"tag": "p", "text": "While the YT-1300 was highly customizable, there were some configurations that were considered standard by Corellia Engineering Corporations."}, {"tag": "h3", "text": "YT-1300p"}, {"tag": "p", "text": "The YT-1300p was configured to be primarily a passenger carrying ship. It had a small cargo capacity and there was three passenger compartment modules. Each module had three bunks, a small refresher, and storage for personal items. Two of the bunks could be reconfigured as bunk beds, while the third was restricted to a single bed due to the curvature of the hull. This allowed a maximum of five passengers per compartment. There was a small cargo hold in the front of the ship that was serviced by a freight loading room between the mandibles that allowed the YT-1300p to carry a maximum of 25 metric tons. It was equipped with two Class-6 escape pods in the port and starboard passenger tubes. Due to the escape pods, boarding was done by a retractable ladder in the passenger tube. The tubes also had a hatch that allowed them to be used as airlocks. It had three retractable landing legs."}, {"tag": "h3", "text": "YT-1300f"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The YT-1300f was configured to haul cargo and had minimal living space. It had reinforced framework to support heavier loads, and the passenger compartment modules were all replaced by modules dedicated to freight. There was a main hold and a smaller fore cargo hold. Two aft cargo holds were on either side of the engineering bay. The tractor beams and freight-loading arms were more powerful than the YT-1300p. The freight elevator in the engineer bay had stronger hydraulics than the one installed on the YT-1300p. Due to its specialization for cargo hauling, it only had 2 bunks in the main hold, and a small refresher. It had five retractable landing legs to support the heavier weight of the ship and its cargo."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "YT-1300fp"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The YT-1300fp was CEC's design that was meant to be a balance between having space for freight and passengers."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Options"}, {"tag": "p", "text": "The YT-1300 could be configured with a fully armored hull for operation in hostile environments. All viewports were covered and a heavy-duty sensor arrays were used to navigate. Due to the increased weight of the armor, the cargo capacity was less than a standard YT-1300."}, {"tag": "p", "text": "External cargo pods were available to be mounted on the dorsal side of the hull. They could be used to almost double the cargo capacity of the YT-1300, but care had to be taken to ensure the extra weight would not cause issues with the ship or require sensor or weapon emplacements to be relocated to the ventral hull."}, {"tag": "p", "text": "Pontoons could be fitted to the freighter for water landings. There were inflatable and rigid designs. The rigid pontoons were usually used for ships that regularly serviced water worlds, while the inflatable pontoons could be filled either with pressurized gas from dedicated tanks or by using the landing jets to redirect atmospheric gases into the pontoons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}