{"url": "YT-2400_light_freighter", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Empire starship classes", "Category:YT-2400 light freighters", "Category:YT-series freighter classes"], "nodes": [{"tag": "h1", "text": "YT-2400 light freighter"}, {"tag": "p", "text": "The YT-2400 light freighter, also known as the YT-2400 transport, was a class of YT-series light freighter. During the Imperial Era, this model of freighter was used by both the Galactic Empire and the Alliance to Restore the Republic. The YT-2400 also saw use under cargo haulers and pirates."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Exterior and Hull"}, {"tag": "p", "text": "The YT-2400 light freighter was a stock cargo hauler produced by the Corellian Engineering Corporation (CEC) as a part of their YT-series line of starships. The YT-2400 had the same basic disc-shaped hull most YT-series had, but was set apart by its tubular cockpit that was connected to the hull by two starboard bracing arms. Behind the cockpit was the ship's main escape pod, capable of ferrying six passengers. Opposite the primary escape pod and inside the YT-2400's cargo area was a secondary escape pod. The YT-2400's hull was protected by reinforced bulkhead frames and double-armored plating. The freighter was 18.65 meters in length and 28.5 meters in width. Despite sharing many parts with the CEC YT-1300 light freighter, the YT-2400 was more compact and maneuverable, and could be easily operated by a single pilot."}, {"tag": "h3", "text": "Armament"}, {"tag": "p", "text": "A stock YT-2400 light freighter came equipped with dual laser cannons mounted on Corellian 1D servo turrets. The freighter was armed with 2 of these units, one dorsal and one ventral. The YT-2400 also had 13 weapon emplacement points built in for ease of modification. The stock configuration used 6 of these emplacements, leaving 7 free."}, {"tag": "h3", "text": "Speed and energy"}, {"tag": "p", "text": "The YT-2400 light freighter could reach atmospheric speeds up to 800 kph. The freighter came with a Class 2 hyperdrive and a Class 12 backup hyperdrive, both backed by a Navicomputer. The standard YT-2400 was equipped with deflector shields. Powering the freighter was a power core that output nearly twice the amount of other YT models. This extra energy allowed for oversized engines and additional modifications."}, {"tag": "h3", "text": "Storage and capacity"}, {"tag": "p", "text": "A YT-2400 light freighter was manned by a crew of 3 and had room for 6 passengers. Crew quarters and living areas were located within the ship's bracing arms. Not as spacious as other YT-series models, the YT-2400 made up for this with it's ease of modification and extra cargo space; being able to haul 150 metric tons worth."}, {"tag": "p", "text": "A new YT-2400 light freighter was worth 130,000 credits, while a used was 32,000."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The YT-2400 light freighter was a compact starship used for hauling cargo and the transportation of troops."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The YT-2400 light freighter was developed and produced by Corellian Engineering Corporation. CEC promoted their YT-2400 as having the best features of a YT-1300 light freighter, in a smaller, more compact design. Upon release CEC noted that customers preferred the wide bar engine popularized by the YT-1300, which the YT-2400 lacked. Although CEC did not offer cylindrical engines as a standard option for the YT-2400 they did authorized the release of modification kits that enabled the installation of cylindrical engines. After unveiling the YT-2400, CEC discontinued their YT-2000 transport model early, despite its good sales."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "During the Batonn insurgency, in the Age of the Galactic Empire, Imperial Admiral Thrawn and ensign Eli Vanto used a YT-2400 freighter known as the Slipknot to pose as weapons smugglers in order to board Nevil Cygni's Nomad starship. The freighter was destroyed when the pair needed a distraction to escape the Nomad ship."}, {"tag": "h3", "text": "Early rebellion against the Galactic Empire"}, {"tag": "p", "text": "The Wookiee Lohgarra captained a YT-2400 light freighter known as the Mighty Oak Apocalypse (often referred to as MOA). In 3 BBY, Lohgarra agreed to transport Apprentice Legislators Amilyn Holdo and Leia Organa aboard the MOA to the planet Pamarthe. Lohgarra and the MOA would later join the Rebel Alliance fleet during the Galactic Civil War."}, {"tag": "p", "text": "A rebel cell known as Iron Squadron used the YT-2400 freighter Sato's Hammer as their home base. Once belonging to the famed Jun Sato, the dilapidated ship served the young rebels well when it helped them damage an Imperial cruiser. Iron Squadron leader, Mart Mattin, would later take Sato's Hammer and leave the Rebellion before eventually deciding to rejoin Iron Squadron."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "A YT-2400 light freighter known as the Outrider operated during the time of the Galactic Civil War. In 0 BBY the Outrider left Mos Eisley, Tatooine."}, {"tag": "p", "text": "A YT-2400 light freighter was held by the Galactic Empire at the Imperial Impound Yard on Novka. During a Rebel attack on the Impound yard the freighter was stolen by Tula Markona"}, {"tag": "p", "text": "Rebel mercenary Saponza and his associate used at least one YT-2400 light freighter to transport troops to and from Saponza's homestead."}, {"tag": "p", "text": "A YT-2400 light freighter was present during the Battle of Hoth."}, {"tag": "p", "text": "In 5 ABY, Imperial defector Ralsius Paldora claimed that a YT-1300 light freighter's hyperdrive failed 1.22 more times than a YT-2400's."}, {"tag": "p", "text": "While on the Entropian Hive, New Republic pilot Yrica Quell witnessed a YT-2400 leaving the asteroid base. Quell likened the dented starship to one her mother had flown."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "In 35 ABY, YT-2400 light freighters were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation and development"}, {"tag": "p", "text": "The YT-2400 light freighter (specifically, the Outrider), was created for the Star Wars Legends multimedia project Star Wars: Shadows of the Empire. Early concept art of the Outrider was created by game designer, lead artist and animator of the 1996 video game Star Wars: Shadows of the Empire, Jon Knoles. Another early design for the ship was created by artist Kilian Plunkett. Ultimately, the final design of the Outrider was provided by Lucasfilm Ltd. concept art director Doug Chiang. Lucasfilm editor Allan Kausch provided Chiang with a basic outline on what the Outrider should look like; \"comparable to the Millennium Falcon\" but not too similar. Originally pincer-like in form, Chiang's Outrider design was finalized by 1994. The \"one-angle view\" sketches were passed on to Jon Knoles, who then created schematics of the YT-2400 at various angles. The schematics were tweaked and tuned before the design was built as a computer model."}, {"tag": "p", "text": "According to Lucasfilm Story Group member Pablo Hidalgo, Doug Chiang confirmed that the design for YT-2400 light freighter was originally created for the 1997 re-release of Star Wars: Episode IV A New Hope, which was in development at the same time as Shadows of the Empire, and the design of the ship was repurposed as the Outrider."}, {"tag": "p", "text": "The YT-2400 light freighter made its first canon appearance in the re-release of Star Wars: Episode IV A New Hope, where the Outrider is seen in the background taking off from Mos Eisley as Luke Skywalker, Obi-Wan Kenobi, C-3PO and R2-D2 arrive."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "There is some discrepancy regarding the YT-2400's length. The 2018 reference book Star Wars Encyclopedia of Starfighters and Other Vehicles states that the YT-2400's length is 21 meters. However, the reference book YT-1300 Millennium Falcon Owners' Workshop Manual released later in 2018 claims that the YT-2400's length is 18.65 meters. As YT-1300 Corellian Freighter Owner's Workshop Manual is the most recent source, this article gives it precedence."}, {"tag": "p", "text": "The YT-1300 Corellian Freighter Owner's Workshop Manual also states that the YT-2400 light freighter was introduced after the release of the YT-2000 transport, and that the YT-2000 transport was created \"during the period that the Rebel Alliance rose up against the Galactic Empire\". However a YT-2400 light freighter is present in a panel of the 2017 comic book Darth Maul 2 which takes place around 32 BBY, 13 years before the creation of the Galactic Empire. This article assumes that the YT-2400 light freighter's inclusion in Darth Maul Part II was an \"Easter egg\" inserted by the comic's illustrator, Luke Ross, and not a canonical appearance."}, {"tag": "p", "text": "In the novels Thrawn, Lost Stars and Leia, Princess of Alderaan the freighters Slipknot and Mighty Oak Apocalypse are never stated to be YT-2400 light freighters. They are only depicted as such in the comic book adaptation of Thrawn, Star Wars: Thrawn, and the Japanese webcomic adaption of Lost Stars."}, {"tag": "h3", "text": "Non-canon history"}, {"tag": "h4", "text": "Disney Infinity 3.0"}, {"tag": "p", "text": "The YT-2400 light freighter makes two appearances in the 2015 video game Disney Infinity 3.0. In the Rise Against the Empire playset a YT-2400 is visible flying over Tatooine. In the The Force Awakens playset, after completing the mission \"Blasting Pad\", a YT-2400 will land near Takodana Castle while in free roam or during a mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}