{"url": "Yaddle%27s_Tale:_The_One_Below", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 5"], "nodes": [{"tag": "h1", "text": "Yaddle's Tale: The One Below"}, {"tag": "p", "text": "Yaddle's Tale: The One Below is a 16-page comic published in Star Wars Tales 5, featuring the Jedi Master Yaddle. The comic takes place sometime before the Battle of Naboo, telling the story of how and why she was granted the title of Master and her seat on the Jedi Council. It was collected in Star Wars Tales Volume 2 and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While discussing the possibility of knighting Yaddle, the Jedi Council revisit the story of her training under the tutelage of Polvin Kut, two hundred years prior."}, {"tag": "p", "text": "On a mission to liberate the colonies of the Advozse warlord Tulak the duo are betrayed on Koba, leading to Kut's death. The Padawan Yaddle is taken hostage by the warlord but is impervious to his interrogations, warning him 'Rule by terror you do, die by fear you will'."}, {"tag": "p", "text": "In time, Tulak tires of the colony and leaves Koba. Before he leaves, he seals Yaddle in a pit with the hope that he can use her as a future bargaining tool; however, she is soon forgotten. She is confined for a century, surviving on food and water provided by wardens left behind when Tulak left. Over the generations, the primitives come to speak of her as The One Below. During this time, Yaddle hones her Jedi skills."}, {"tag": "p", "text": "Eventually, a groundquake brings down the roof of her pit, allowing her to escape. Seeing the destruction of the nearby village, she remains on the planet to aid the Kobans. Bringing the citizens to prosperity, she is quietly content with her work until the day Kalut, Tulak's son, returns to Koba, claiming it as his heirloom. Forced to fight, Yaddle defeats him, finally finishing her master's mission."}, {"tag": "p", "text": "On hearing the story, the Jedi Council, in particular Yoda wants her to continue her Jedi training but, are swayed to initiate her as a Jedi Master."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "As the comic is part of a Star Wars Tales issue preceding Issue #21, its original level of canon was unclear. However, the contents of the story have now been referenced in the novels Cloak of Deception and Jedi Quest: The Shadow Trap, as well as in The Official Star Wars Fact File, so it has largely been canonized. There are some small issues with the framing story, as Oppo Rancisis is present on the Jedi Council for the confirmation of Yaddle in some of the panels of the comic, but Oppo is elsewhere stated to be trained by Yaddle. Additionally, the lightsaber colors of the Masters do not match previously established blade colors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}