{"url": "Yaddle", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Jedi High Council members", "Category:Members of Yoda's species"], "nodes": [{"tag": "h1", "text": "Yaddle"}, {"tag": "p", "text": "Yaddle, a Force-sensitive female being of the same species as Grand Master Yoda, was a Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. She trained a Thisspiasian Padawan, Oppo Rancisis, who eventually joined Yaddle on the High Council by the time of the Invasion of Naboo."}, {"tag": "p", "text": "In 32 BBY, Qui-Gon Jinn brought the Chosen One Anakin Skywalker to the Jedi Temple on Coruscant where he met Yaddle and the Jedi elders. After the Battle of Naboo, Yaddle took a less active role in the Jedi Order's affairs and was no longer on the High Council by the time of the Clone Wars."}, {"tag": "p", "text": "In 14 BBY, Yaddle was remembered and mentioned by name by the Latero pilot Greez Dritus, who speculated on her fate during the Great Jedi Purge with his Jedi associates. In 12 BBY, the Sith Lord Darth Vader encountered apparitions of several Jedi, including Yaddle, while experiencing a series of Force visions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Yaddle was born in 509 BBY. A member of the same species as the legendary Jedi Yoda and Grogu, she was found to be Force-sensitive and was taken to the Jedi Temple to be trained in the ways of the Jedi. Eventually, she was promoted to the rank of Jedi Master and was given a seat on the Jedi High Council on which she remained for some time. Yaddle trained many Padawans, including the Thisspiasian Oppo Rancisis, who eventually took up a seat alongside her in the High Council. Yaddle devoted a large amount of her time on scholarly endeavors, spending a lot of time studying in the Jedi Archives. Despite this, she was also an active Jedi in the field as well."}, {"tag": "p", "text": "On the eve of his becoming Master Dooku's newest Padawan, Yaddle caught the twelve-year-old Qui-Gon Jinn practicing with his lightsaber in the Temple's sparring room late at night and ordered him to go to bed."}, {"tag": "h3", "text": "Naboo Crisis"}, {"tag": "p", "text": "During the Invasion of Naboo in 32 BBY, Yaddle was present in the Jedi Council Chamber inside the Temple on Coruscant, when fellow Jedi Master Qui-Gon Jinn presented himself to the High Council with daunting news that the Sith, the ancient enemies of the Jedi had returned to the galaxy. She was also present during the evaluation of Anakin Skywalker, a 9-year-old Force-sensitive child, who Jinn believed was the Chosen One that was prophesied to bring balance to the Force. The High Council initially agreed that they would not accept him into the Jedi Order, however, they reversed their decision as Jinn's dying wish was for Skywalker to be trained. Following the Battle of Naboo, Yaddle decided to take a less active role in Jedi affairs and she had stepped down from the Council by the time of the Clone Wars. Her seat on the Council was taken by Jedi Master Shaak Ti."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 19 BBY, the Order was destroyed when Supreme Chancellor Sheev Palpatine, secretly the Dark Lord of the Sith Darth Sidious, activated Order 66, forcing clone troopers of the Grand Army of the Republic to turn on the Jedi and kill them. Whilst the Order was destroyed, a small number of Jedi were able to survive."}, {"tag": "p", "text": "In 14 BBY, while traveling in hyperspace, Greez Dritus asked if Jedi would come out of hiding if the Order was rebuilt. When Cere Junda questioned if he meant anyone specific, Dritus told her that whilst growing up on Lateron he had heard tales of a legendary green, pointy-eared Jedi Master. When Junda asked if he was speaking about Yoda, Dritus responded that he was talking about Yaddle."}, {"tag": "p", "text": "Shortly after the Battle of Fortress Vader, Darth Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Yaddle along with several Jedi with their lightsabers ready to battle him. However, Vader defeated all of the illusions with Yaddle being amongst the last to fall, slashed through the chest as the words \"Let the past die\" resounded in Vader's mind."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yaddle was highly sought after for her great wisdom, and was also known for her quietness, patience and kindness. She looked up to Grand Master Yoda, who belonged to the same species as her but was nearly twice her age. Yaddle had auburn hair that she wore in a pair of long plaits, green-gold eyes, green skin and a height of 0.61 meters. She was regarded as legendary by some of the population of the planet Lateron."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Yaddle was skilled in little-known and deadly Jedi powers such as morichro, an ancient art that enabled the user to slow the opponent's bodily functions to the point of death."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Yaddle wore Jedi robesand wielded a green-tipped lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yaddle was created for the 1999 film Star Wars: Episode I The Phantom Menace. Although she is not addressed by name in the film, she is identified in the credits. Her puppet was operated by Phil Eason. The model for Yaddle was originally created by concept artist Iain McCaig as a sketch for a young Yoda, but was later put in the movies as Yaddle, a female member of Yoda's species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}