{"url": "Yag-prime", "categories": ["Category:Legends articles", "Category:Givin culture", "Category:New Republic space stations", "Category:Orbital stations", "Category:Yag-prime locations"], "nodes": [{"tag": "h1", "text": "Yag-prime"}, {"tag": "p", "text": "Yag-prime was an Empress-class space station orbiting the Givin homeworld Yag'Dhul. It played a crucial role in many battles which includes the Bacta War and the Battle of Yag'dhul."}, {"tag": "h2", "text": "Construction"}, {"tag": "p", "text": "The station had a central disk with thick expanses of living quarters above and below. Multiple thin towers rose from the middle of the disk, which made the station look like it had been impaled on spears. Three wedge-shaped causeways for launch-and-recovery purposes stabbed out into space from the central disk."}, {"tag": "p", "text": "Due to construction costs space was a very premium commodity. Refresher stations and dining facilities were communal. While there were private rooms for dinner meetings, all of the food was prepared in a central galley and delivered to the half-dozen dining facilities on the base. Those same rooms also served as lounges and recreation facilities. The internal corridors were strikingly small, designed to make it easier to defend against a stormtrooper assault. It is not known if this feature was common to all Empress-class stations, or if the design was also constructed by groups outside the Rebellion."}, {"tag": "p", "text": "There were twenty-five living levels above the docking facility and twenty-five below. The main docking area contained ten levels with the middle six dealing with cargo transfer and storage while the outer two on each side contain crew housing, small shops and the tapcafes Hyperspace and Flarestar."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Warlord Zsinj"}, {"tag": "p", "text": "By 6 ABY, however, Yag-prime had been seized by the forces of Warlord Zsinj, although the running of the station was in the hands of a Twi'lek merchant named Valsil Torr. Zsinj used the station to store a large quantity of bacta which had been seized from a New Republic convoy, but the New Republic was notified by Qlaern Hirf of the Ashern. Rogue Squadron and Defender Wing soon arrived with a group of assault shuttles and freighters where they successfully took control of the station and recovered the bacta after a short battle. The damage to the space station was repaired by Givin, as they can survive in vacuum."}, {"tag": "h3", "text": "The Bacta War"}, {"tag": "p", "text": "Yag-prime played a prominent role in the Bacta War. After resigning their commissions, Wedge Antilles and the rest of Rogue Squadron were looking for an appropriate base of operations in their fight against Ysanne Isard. Pash Cracken, a former member of the squadron, was tasked to render the station inhabitable in order to prevent Zsinj from using it again. Instead, he falsely reported the station as destroyed to his superiors. Shortly after the Rogues then moved in."}, {"tag": "h4", "text": "Under Booster Terrik"}, {"tag": "p", "text": "After the Pulsar Skate returned after its mission to recover the remaining Eidolon materials on Tatooine, they brought along Booster Terrik to the delight of Antilles. He then offered to act as the station manager due to the promise of it not being boring and being pitted against Fliry Vorru in a war of trade and information."}, {"tag": "p", "text": "Terrik made many changes to the station, such as lowering the station temperature by an average of five degrees. He refused to heat unoccupied portions of the station thereby lowering its operating costs. By leaving the tapcafs and stores warmer to encourage the people in congregating and patronizing those establishments, he managed to make profits since the station's vendors were paying him a percentage of their own profits and were funneling all their supply needs through him."}, {"tag": "p", "text": "Shortly after advising Antilles of the folly of closing the station to outsiders, Terrik reopened the station to trade in order to generate capital for Antilles' operation. His plan was to have people bring them information and equipment instead of having them go out and get it, and to develop suppliers who were in their debt because of the station. By doing this, he discouraged the people who frequented the station in betraying them to Isard."}, {"tag": "p", "text": "In accordance to the secret plans made with Wedge Antilles and Tycho Celchu, Booster Terrik made many modifications to the station. He purchased many proton torpedoes, Concussion Missiles and Targeting Sensors from Talon Karrde. The sensors were fitted into the Station while the torpedoes and missiles were fitted into a series of freighters ranging in size and including a Corellian Light Freighter."}, {"tag": "h4", "text": "Defying Lusankya"}, {"tag": "p", "text": "Shortly before the decisive Battle of Thyferra, Isard's spy Melina Carniss was allowed to learn that the Rogues were based on Yag-prime. As Antilles intended, Isard sent her Star Destroyers Lusankya and Virulence to destroy the station. When Isard's ships arrived, Antilles' small fleet jumped to hyperspace toward Thyferra. Terrik then caught Lusankya in Yag-prime's tractor beams and activated the gravity well projector, pinning it in place despite its attempts to break free by setting the engines to full reverse. After his offer of surrender was rejected by Captain Joak Drysso, Terrik then activated the torpedo targeting sensors, gaining over three-hundred locks upon Lusankya, enough to destroy the huge ship."}, {"tag": "p", "text": "In reality though, it was all an elaborate bluff orchestrated by Antilles. The station had no proton torpedoes, which were all aboard the small fleet of freighters that jumped with Antilles towards Thyferra. All the station had were the targeting locks."}, {"tag": "p", "text": "At this point Captain Lakwii Varrscha of Virulence quickly intervened, moving her ship into the path of the tractor beams and allowing Lusankya to escape, abandoning its TIE Fighter escort which were then destroyed when Pash Cracken's Ace Squadron was pulled out of hyperspace by the gravity well projector. Believing she had been caught in a New Republic trap, Varrscha surrendered to Terrik, who promptly took command of Virulence and took it to Thyferra, where it would play a crucial role in the battle."}, {"tag": "p", "text": "Shortly after the Bastion Accords were signed in 19 ABY, the station was ceded to the Givin, who used it to defend the Yag'Dhul shipyard complex, and stocked it with a unit of their own swift starfighters."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Yag-prime was commanded by Dodecian Illiet. It was on Yag'Dhul Station that the Rodian Jedi Kelbis Nu realized Nom Anor's true identity. He managed to escape the station but was killed by agents of the Peace Brigade on Eriadu. Shortly after, Anakin Solo, Tahiri Veila and Corran Horn arrived on the station aboard a commandeered Yuuzhan Vong scout ship, with a warning of impending invasion from the Yuuzhan Vong. They were interrogated by Dodecian Illiet and after a few hours, were set free when their warning of an invasion was proven true."}, {"tag": "p", "text": "While on their way to the storage lockers of Ring 1-C to obtain vac suits, they were attacked by Yuuzhan Vong warriors and Nom Anor, who was wearing a ooglith masquer to pose as a Givin. A duel ensued between Anakin and Shok Choka when Anor declined Corran's challenge. Anakin was able to defeat Choka and the three escaped and managed to reach Docking Port 12 Berth 13 where a ship was waiting for them."}, {"tag": "p", "text": "It is not known whether the station survived the Battle of Yag'Dhul"}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The station was a trade staple in the region for a long time, according to Booster Terrik. It was very compact to an average human and delicate, with the danger of suffering explosive decompression. Its walls were covered with fractal patterns and notation in some sort of script, presumably written by the Givins."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yag-Prime, as it is described in X-Wing: The Krytos Trap and depicted on the cover of the book, bears striking similarity to the design of space platforms in the video game Star Wars: TIE Fighter, and may have been based on such stations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}