{"url": "Yablari/Legends", "categories": ["Category:Legends articles", "Category:Agriworlds", "Category:Galactic Republic planets", "Category:Vorzyd sector planets"], "nodes": [{"tag": "h1", "text": "Yablari"}, {"tag": "p", "text": "Yablari was an agrarian planet located within the Vorzyd sector's Yablari system of the Outer Rim Territories. Located along the Perlemian Trade Route, Yablari's agricultural technology was highly advanced and prolific."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Yablari was home to the native sentient species, the Anomid, who were known as wealthy pacifists. The world was also predominantly used as an agriworld. While the world was sometimes prone to mass droughts, the land was fertile and good for growing plants."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Joining the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY, the planet's native Anomid's had discovered hyperdrive technology centuries before being discovered. Driven to search for fertile soils offworld during a severe drought, the Anomids' first encounter with alien life was a world which hosted a small Duros colony. Opening the world to galactic trade was the paving of the Perlemian Trade Route, which allowed curious Anomid to leave the world and begin a 15,000 year long period of mass social and cultural adventurism."}, {"tag": "p", "text": "During the Great Sith War, the Krath laid siege to the planet's star system and was able to emerge victorious after open conflict with Republic forces there. While the Sith were driven off at the conclusion of the war, decades later the planet was annexed by Darth Revan's Sith Empire during the Jedi Civil War."}, {"tag": "p", "text": "The Anomids' Central Council later agreed to support the Galactic Empire for the good of their people. Rebel operatives, on the other hand, liked to befriend Anomid travelers who might be persuaded to give money to the cause. Some Rebel safeworlds used Anomid food technology to stretch limited supplies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}