{"url": "YVH_2-4S", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Masculine programming", "Category:YVH-series battle droids"], "nodes": [{"tag": "h1", "text": "YVH 2-4S"}, {"tag": "p", "text": "YVH 2-4S, also known as Two-Four-S, was an advanced YVH S-series battle droid with masculine programming produced by Tendrando Arms during the Yuuzhan Vong War. In 27 ABY, he and another YVH droid were part of a mainly Jedi strike team tasked with going to the Yuuzhan Vong–controlled planet of Myrkr and eliminating the threat of the voxyn, a group of genetically-engineered predators who could hunt the Jedi through the Force. After commandeering the corvette analog Exquisite Death from its Yuuzhan Vong owners, YVH 2-4S and the strike team inserted themselves onto the Baanu Rass worldship, which was orbiting Myrkr. There, 2-4S and the group rescued a pair of Dark Jedi whom the Yuuzhan Vong had imprisoned. However, soon after arriving on the worldship, YVH 2-4S was destroyed when he sacrificed himself to eliminate two enemy coralskippers that had happened upon the team's location. The mission continued, however, and the voxyn were eliminated despite the loss of many members of the team."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Taking the Exquisite Death"}, {"tag": "p", "text": "An advanced militaristic YVH-Series battle droid, YVH 2-4S—also referred to as Two-Four-S—was produced by the company Tendrando Arms around 27 ABY, during the Yuuzhan Vong War in which the extra-galactic Yuuzhan Vong invaded the galaxy and engaged the New Republic in war. That year, the Yuuzhan Vong's shaper caste genetically engineered the dangerous voxyn beasts to hunt the Jedi Knights, who were protecting the New Republic, through the Force. Voxyn attacks soon began to take a heavy toll on the ranks of the Jedi as the beasts hunted and killed them. In response, a Jedi strike team was formed to deal with the threat, as the Jedi had discovered that the shapers were using a voxyn queen as a genetic template for all the other voxyn that they had cloned into creation. Additionally, the Jedi also found that the location where the Yuuzhan Vong were creating the voxyn was in the vicinity of the planet Myrkr, which was controlled by the invaders."}, {"tag": "p", "text": "YVH 2-4S and another YVH-Series battle droid, YVH 2-1S, accompanied the strike team of seventeen young Jedi, including the Solo siblings Jaina, Jacen, and Anakin. Because the team's destination was behind Yuuzhan Vong lines, it had to find a way to reach Myrkr unharmed, and thus a plan was formed and implemented. Entrepreneur Lando Calrissian, the owner of Tendrando Arms, took the two war droids and the seventeen young Jedi near enemy lines in his starship, the Lady Luck, where he met up with the Yuuzhan Vong corvette analog Exquisite Death. Under the pretense of trading the Jedi on his ship for the lives of the refugees whom the invaders had captured over the planet Talfaglio, Calrissian had his crew \"seize\" the Jedi and bring them to Commander Duman Yaght of the Exquisite Death."}, {"tag": "p", "text": "While the captured Jedi staged a brief diversion in the form of a standoff to ensure that they were the only target of attention, 2-4S and 2-1S exited the Lady Luck via its disposal chute along with an equipment pod full of useful supplies. They attached the equipment pod to the bottom of the boarding craft that Yaght had used to get to Calrissian's ship, and when the Yuuzhan Vong took the Jedi back to the Exquisite Death, the war droids came with them, unbeknownst to Yaght and his troops. The Jedi endured torture while the Yuuzhan Vong ship took them deeper into enemy territory, but when the Jedi decided that the Exquisite Death had taken them far enough, Anakin signaled to 2-4S and 2-1S to aid them via a voice-activated implant on his body. 2-4S penetrated the hull of the vessel with ten coma gas canisters to knock out the crew. After blowing a hole in the outer hull, 2-4S sealed that hole to the open equipment pod that they had brought with them by using emergency patching foam, while 2-1S stood guard inside the vessel. On their way to rescue the captive Jedi, the two war droids encountered the Exquisite Death's three voxyn, and after using thermal detonators against them, the droids believed that the voxyn had been killed. Both YVHs then burst into the room where the Jedi were being held and dispatched two warriors, both of whom had been trying to kill the Jedi members of the strike team."}, {"tag": "p", "text": "Once the Jedi were freed, the guards killed, and the weapons in the arsenal handed out, the team set out to eliminate any other Yuuzhan Vong aboard who had escaped the effects of 2-4S's coma gas, as well as to rescue Jedi Ganner Rhysode, who was being held captive elsewhere. As the team began its sweep of the ship, 2-4S was at the very back of the group and was tasked with covering the Wookiee Jedi Lowbacca as he inserted flechette mines into the Exquisite Death's system ducts. After one of the voxyn—which had survived the initial encounter with the YVH war droids—detonated one of the mines in the ducts, 2-4S was sent back to look out for Jaina, who was with another part of the team. Jaina and 2-4S kept the wounded beast in the ducts and eventually killed it, though another voxyn had managed to survive and engaged part of the strike team before being driven into the ducts. In the end, the team seized the Exquisite Death completely, killing Yaght and rescuing Rhysode, without any casualties in the process."}, {"tag": "h3", "text": "Myrkr"}, {"tag": "p", "text": "The group used the Yuuzhan Vong vessel to reach Myrkr and, upon approaching the planet, found that the worldship Baanu Rass was in nearby orbit. Because the Jedi sensed Force-sensitives on the worldship with the voxyn, the strike team could not go through with their primary plan, which was to destroy the voxyn cloning facility with a baradium missile. They also speculated that since the Yuuzhan Vong were keeping Force-sensitives hostage, they must have some ysalamiri, creatures who could create a bubble in which the Force was not usable, to ensure that prisoners did not escape. Nearing the worldship, Anakin sensed that they were being led into a trap and had the others arm and ready the missile. Moments later, a matalok enemy ship appeared over the Baanu Rass and positioned itself between the Exquisite Death and the loading area to the voxyn cloning facility on the worldship. After the commander of the matalok contacted the team and demanded that they surrender, the crew of the Exquisite Death fired the missile at the enemy vessel. The matalok was completely destroyed, but other Yuuzhan Vong forces soon surrounded the strike team's vessel, aware that the Exquisite Death was no longer under their control."}, {"tag": "p", "text": "With the Bith Jedi Ulaha Kore flying the captured ship as enemy vessels attempted to apprehend it with arresting tentacles, the rest of the strike team, minus 2-1S, packed themselves into five Yuuzhan Vong cargo pods. After 2-4S blew a hole in the hull of the Exquisite Death, the first pod that was dropped out through the hole was a decoy pod filled with explosives. When one of the pursuing vessels caught it with a set of tentacles, the pod exploded, leading the Yuuzhan Vong forces to believe that all of the pods were bombs. The other four pods fell out of the ship as the Exquisite Death pulled away from the Baanu Rass, and Kore led the pursuing ships on a chase. The Jedi used the Force to slow down their pods as they neared the surface of the worldship, though 2-4S's pod, the fourth one, was not decelerated. Still, the YVH droid survived the crash. Meanwhile, 2-1S was launched from the captured vessel in a shuttle and, after leading more ships away, sacrificed himself in an explosion to take out as many enemy forces as he could."}, {"tag": "p", "text": "The strike team's pods were destroyed with thermal detonators to make it appear as though they were indeed bombs, and 2-4S and the team set out for the voxyn cloning facility's loading area. Before long, two coralskippers approached the area where the pods had landed, and 2-4S and the team were forced to hide in the dust until they passed. After they resumed their course for the spaceport, the Jedi sensed Kore's death through the Force, as her pursuers had caught up to the Exquisite Death. Before they reached the spaceport, the group had to pass through a deadly swath of senalak plants, which prompted the Rodian Jedi Jovan Drark to use a Force wave to fell the plants in their way. Reaching the spaceport, they found that it was a landing pit in the ground surrounded by a colonnade barrier, which could be accessed via a series of living airlocks."}, {"tag": "p", "text": "In need of a distraction, Anakin used the Force to flick a capsule filled with the mating pheromones of ysalamiri into one of the airlocks that some service crew had opened. Just then, 2-4S reported that an enemy frigate was coming toward the spaceport. Soon, the mating pheromones drew a group of ysalamiri out of the colonnade, and the distraction to the Yuuzhan Vong forces was enough to allow the strike team members to don their holoshroud disguises and approach the spaceport. Rhysode and 2-4S covered the rest of the strike team as they made their way to the spaceport, and they soon joined them on the other side of one of the airlock valves. The plan was to get to the place where the ysalamiri were being kept, which would be where the Force-sensitives were being imprisoned, and then steal a rescue shuttle in the spaceport."}, {"tag": "h3", "text": "Freeing the Dark Jedi"}, {"tag": "p", "text": "On its way toward the ysalamiri, the group encountered a Yuuzhan Vong who engaged them in conversation. However, despite Jedi Tahiri Veila's help translating the language, Rhysode managed to accidentally insult the being, which caused the Yuuzhan Vong to leave. When they reached the ysalamiri area, the Force abilities of the Jedi were temporarily taken away due to the presence of walking olbio trees, which had ysalamiri in their leaves, in the corridor that led to their destination. The group members used their disguising holoshrouds to reach the first pair of guards and killed them before switching their hologram devices off. While Jacen, Rhysode, and 2-4S watched the entrance to the ysalamiri room, the rest of the strike team disposed of the ysalamiri and the remaining guards, leaving a single shaper left."}, {"tag": "p", "text": "That shaper was soon killed by one of two captured Dark Jedi in the room, Lomi Plo, via the Force, as all of the Jedi and Dark Jedi in the room could use the Force now that the ysalamiri were no more. Plo and the other Dark Jedi, Welk, were the Force-sensitives whom the Jedi in the strike team had sensed when they arrived over Myrkr, and they allied with the strike team in order to destroy the voxyn. However, the group in the ysalamiri room was interrupted by Rhysode and Jacen, who reported that a shuttle had arrived from the frigate that had earlier approached the Baanu Rass. The shuttle contained Executor Nom Anor, the feathery Fosh Vergere, and over a hundred warriors, all tasked with capturing the Solo twins, Jacen and Jaina. Because the spaceport had become a danger to 2-4S and the group, as the Yuuzhan Vong whom they had earlier insulted had pointed Anor and the others in their direction, Plo suggested that they head to the voxyn cloning facility via a training course that the shapers used to teach the voxyn to hunt Force-sensitives."}, {"tag": "p", "text": "Although most of the team did not trust the Dark Jedi, they had no choice but to follow Plo there. Soon, they came to a canyon passage, where Lowbacca and Rhysode laid a series of mines, before they proceeded to enter a side trail that branched off the corridor. Shortly after leaving the corridor, 2-4S reported that the mines had been detonated by their pursuers. When a pair of coralskippers passed by overhead before diving down toward the treetops that covered the team, Anakin had 2-4S secure the intersection while the rest of the team descended into a swampy area. The war droid fired upon the lead coralskipper, destroying it, but the other one sprayed a deadly chemical mist near the team's location. Using his propulsion rockets, 2-4S rose into the air, firing upon the other ship, but was struck by plasma from the coralskipper. 2-4S steered himself into his opponent and, using his self-destruct charges, took out the enemy craft."}, {"tag": "p", "text": "In the end, the team managed to kill the voxyn queen, ending the threat to the Jedi, though many of the team's members perished on the mission."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Description"}, {"tag": "p", "text": "As a fourth-degree YVH S-series war droid, 2-4S was designed to kill members of the Yuuzhan Vong species with ease. Programmed with a masculine personality, he was armored in laminanium, which was strong and had self-regenerating properties, and was armed with a blaster cannon and targeting minirockets. He also possessed propulsion rockets and self-destruct charges, though he had a sensor package that lacked deep-space detection. The droid had a built-in comlink that could contact other YVHs and was additionally able to function in zero-gravity conditions, such as in space. As a YVH S-series droid, 2-4S had black-colored, star-spangled camouflage armor and sounded much like the war droid line's creator, Lando Calrissian."}, {"tag": "h3", "text": "Personality"}, {"tag": "p", "text": "During the fight with the coralskippers, 2-4S used his self-destruct charges to take out the last enemy craft after he was critically damaged. Jacen Solo considered the YVH a valuable and respected part of the strike team."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "YVH 2-4S was first mentioned in the 2001 novel Star by Star, written by Troy Denning as part of The New Jedi Order series. The New Jedi Order Sourcebook, from 2002, incorrectly claims that 2-1S was the last war droid to fall on the mission, while Star by Star has 2-4S perishing last."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}