{"url": "Yabol_Opa/Legends", "categories": ["Category:Legends articles", "Category:Alsakan planets", "Category:Colonies planets on the Perlemian Trade Route", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Yabol Opa"}, {"tag": "p", "text": "Yabol Opa was a Colonies planet located on the Perlemian Trade Route. A member of the Galactic Republic since at least 22,000 BBY, Yabol Opa allied itself with the planet Alsakan during its long struggle against the Republic's capital world, Coruscant. By 22 BBY, the University of Yabol Opa stretched across the entire surface of the planet, which had become a part of the Galactic Empire by three years later."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Yabol Opa was a terrestrial planet located in the Colonies' Yabol Opa system. It was situated between the Delle and Ifmix systems on the super-hyperroute known as the Perlemian Trade Route, which served as a dividing line between the regions known as the Northern Dependencies and the Slice. In addition, around 22,000 BBY, hyperlanes connected Yabol Opa to the Belnar and Perave systems. That set of smaller hyperspace routes persisted until the Great Sith War of 3996 BBY but had ceased to exist by the onset of the Mandalorian Wars in 3976 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Space surrounding Yabol Opa was explored between 27,500 BBY and 25,000 BBY, and the planet had become a member of the Galactic Republic by 22,000 BBY. During the First through Fifth Alsakan Conflicts, which collectively spanned from approximately 17,018 BBY until 12,700 BBY, Yabol Opa affiliated itself with the Core Worlds planet Alsakan in the latter's political struggle against the Republic's capital world, Coruscant, and its allies."}, {"tag": "p", "text": "The Republic's Third Sector Army was charged with engaging the military forces of the Confederacy of Independent Systems in Yabol Opa's vicinity during the first campaigns of the Clone Wars of 22 BBY–19 BBY, and the planet had become a part of the Galactic Empire by 17 BBY. As part of their invasion of the galaxy, at some point between 26 ABY and 27 ABY, the extra-galactic Yuuzhan Vong attacked and conquered the Yabol Opa system, and it remained under the control of the invaders by 27 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "When the Galactic Republic began to expand through the blazing of the Perlemian Trade Route in 25,000 BBY, Yabol Opa became a thriving world that was home to the great University of Yabol Opa. By 22 BBY, that establishment of higher education had grown to encompass the surface of the entire planet. The Grand Warden—and the absolute ruler—of the University of Yabol Opa at that time was Solokin Sakellar, who maintained a skyscraper lodge on the galactic capital, Coruscant. The population of Yabol Opa around 25 ABY numbered between ten and one hundred million."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet-wide University of Yabol Opa was first mentioned in the 2003 reference book Inside the Worlds of Star Wars: Attack of the Clones, authored by Simon Beecroft. The 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, identified the planet by its name and placed it in grid square M-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}