{"url": "Yam%27rii/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Insectoid sentient species", "Category:Spacefaring species", "Category:Wild Space species", "Category:Yam'rii"], "nodes": [{"tag": "h1", "text": "Yam'rii"}, {"tag": "p", "text": "The Yam'rii, also known as the Huk, were a sentient species of insects who hailed from the planet Huk. They had mantis-like bodies, with large, multifaceted eyes, thin torsos, knobby carapaces, and pointed feet. Some members of the species had large, clipper-like forelimbs that could be used as weapons, while others featured two fingers instead. They stood two meters or more in height and walked about on two legs. Members of the species were known as stealthy predators who were easily angered. They loved meat and eggs and had no compunctions about eating the eggs of other sentient species."}, {"tag": "p", "text": "After gaining access to hyperspace technology, the Yam'rii began an aggressive expansionist phase during which they sought out valuable materials for trade on nearby worlds and founded colonies to exploit them. They eventually reached the nearby planet Kalee, where they enslaved the native Kaleesh. The reptilian captives fought back, and the two species were soon embroiled in a war. After years of fighting, the Kaleesh gained the upper hand under the leadership of a warrior named Qymaen jai Sheelal—who later rechristened himself Grievous. The Yam'rii were driven from their colonies and almost wiped out as the Kaleesh destroyed whole settlements and killed even civilian Yam'rii. The insectoids orchestrated several corrupt deals with members of the Galactic Republic to put a stop to the hostilities, and the Kaleesh were saddled with devastating punitive measures while the Yam'rii were portrayed as victims and thus faced no sanctions. Decades later, the Yam'rii were part of the Galactic Federation of Free Alliances. During the Swarm War, however, Yam'rii were among the insectoids who became Joiners and fought alongside the Killiks."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Yam'rii were sentient, bipedal insects. They were distantly related to both the sentient Verpine and vespid insects. The Yam'rii had both male and female sexes."}, {"tag": "p", "text": "Members of the species were considered strange-looking by many non-Yam'rii. Their giant, mantis-like bodies stood two meters or more in height and were divided into three major sections: head, thorax, and abdomen. They were strong, burly creatures, although they remained stealthy despite their size. Yam'rii were carnivorous, subsisting on meat and eggs—and, according to rumor, their own kind. Yam'rii blood was green in color."}, {"tag": "p", "text": "Large, multifaceted eyes dominated the beings' wedge-shaped heads. These orbs could be either gray or red. At least some members of the species had pupil-like spots on their eyes. Nostrils lay below the eyes, although in most Yam'rii these were imperceptible. A mass of bumplike protrusions at the front of the head acted as a mouth and taste organ, known to shudder at the prospect of a meal. In some specimens, the maw could be opened wide to reveal white teeth. Dual knobby crests grew from the beings' heads with other bumps in between. A spiky ridge ran along the back of the head."}, {"tag": "p", "text": "A long, narrow neck supported the head on broad, rounded shoulders. In many Yam'rii, both the neck and thorax were diamond-shaped in cross-section, with the more acute edges toward the front and back. Other members of the species had two rows of raised bumps on the front and back of the torso instead. The midsection was dominated by two arms held before the body mantis-like, the first of the double padded joints bent upward and the second downward. In most Yam'rii, these arms were shaped like giant clippers: the upper limb had a barbed, serrated cutting edge on its underside, and the lower part of the limb narrowed to a point; together, both halves acted like shears. Other Yam'rii, however, had two fingers and a thumb instead, trading deadly, natural weapons for the ability to perform fine manipation. Yam'rii forelimbs could grow so large as to drag the ground when the being walked. The thorax tapered greatly at the waist, where the round, bulbous abdomen began. This posterior section came to a point in the back and featured striations along its length. The species' legs had a single knee joint and ended in jagged, pointed feet; these were bifurcated into two digits in those Yam'rii with fine manipulator forelimbs."}, {"tag": "p", "text": "Yam'rii were encased in hard carapaces that were knobby, striated, and colored gray, brown, or green. A lighter shade sometimes re of the and abdomen. Members of the species wore minimal clothing, such as cloth skirts, belts, or bandoleers with pockets for carrying possessions."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Yam'rii hailed from the planet Huk, a world near the Kalee system just outside Bitthævrian space. They were a technological culture with full access to hyperspace-capable spacecraft and modern droids. In fact, the manufacturer Industrial Automaton gave its LOM-series protocol droid series insectoid features in the hopes of appealing to Yam'rii and other insectoid consumers."}, {"tag": "p", "text": "Members of the species were known for their quick tempers and lust for the property of others. They showed little concern for non-Yam'rii; members of the species were known to eat the eggs of sentient species such as Quor'sav, for example, so mothers and caretakers of such creches had to keep careful watch when in a Yam'rii's company. After years of war, the species came to be regarded as downright savage by their wartime enemies. During these conflicts, the species was ruled by warlords. Nevertheless, some Yam'rii did integrate into galactic society and form relationships with members of other species."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Evolution and expansion"}, {"tag": "p", "text": "The Yam'rii descended from non-sentient insects. At some point in their evolutionary path, they split from the line that would eventually become their distant relatives, the Verpine. The Yam'rii regarded the planet Huk, located in Wild Space, as their homeworld."}, {"tag": "p", "text": "Sometime between 1000 BBY and generations before the Clone Wars, the Yam'rii established contact with the greater galaxy and gained access to hyperspace technology. They formed ties with the Galactic Republic and established themselves as important trading partners of the Trade Federation. The insectoid species decided it would be in their best interest to gain access to greater stores of natural resources, such as rarefied minerals and ore, to trade on the galactic market. Settlers thus set off from Huk to colonize nearby planets, including the rainforest world Abbaji and its neighbor Tovarskl, and to exploit the raw materials they afforded. Expansionist zeal blinded the species to any concern for pre-existing lifeforms or sentient species on the worlds the Yam'rii claimed."}, {"tag": "p", "text": "The Yam'rii eventually reached the nearby Kalee system. On the planet Kalee, they encountered a relatively primitive reptilian species known as the Kaleesh. Circa 60 BBY, the Yam'rii planted a colony on the world and began gathering the few resources they could find. These were deemed inadequate, however, and the insectoids turned to exporting a commodity they deemed much more lucrative: the Kaleesh themselves. The insectoids corralled the reptilian species by the hundreds, eventually enslaving and selling millions on the galactic market."}, {"tag": "h3", "text": "The Huk War"}, {"tag": "p", "text": "Several years before the Clone Wars, the Yam'rii's new subjects rose up and began the conflict that came to be known as the Huk War. The Yam'rii found themselves crossing barbed cutter limbs with the slaves' Lig swords, shoni spears, and slugthrowers. For two generations, the Yam'rii resisted the uprising and tried to contain it. The rebellious Kaleesh proved to be formidable adversaries, however. The Yam'rii came to be regarded by their enemies with more and more balefulness, and the word Huk took on a pejorative air, meaning not a race or a planet, but \"soulless bug.\""}, {"tag": "p", "text": "Years into the war, the tide began to turn. The Yam'rii found themselves losing several key battles, such as their assault on Shrupak, considered the holiest temple in the Kaleesh religion. Several new Kaleesh resistance leaders sprang up, the companion warriors Qymaen jai Sheelal and Ronderu lij Kummar among them. The Yam'rii suffered defeat after defeat at the hands of Sheelal and his forces, and they soon found themselves on the defensive on Kalee."}, {"tag": "p", "text": "The Yam'rii scored a key victory when they killed Kummar on the beaches of Kalee's Jenuwaa Sea and, it seemed, drove Sheelal into hiding. The triumph was short-lived, however; Sheelal resurfaced, now calling himself Grievous and leading a corps of eight elite Kaleesh generals, many of whom had led their own rebel forces across the planet. United behind Grievous in a pan-Kaleesh army known as the kolkpravis, the enemy found a new spirit, and the Yam'rii lost thousands to Kaleesh attacks. The Yam'rii made the decision to cut their losses and abandon their Kalee colony to their former slaves."}, {"tag": "p", "text": "Grievous, however, was unsatisfied with this concession. Yam'rii colonists on nearby worlds soon found themselves besot by Kaleesh invaders who had adopted Yam'rii technology and organized behind Grievous and his eight elites. The Yam'rii were forced fully on the defensive as they lost battle after battle and colony after colony—the settlers wiped out to the last Yam'rii regardless of whether they were military or civilian. The Yam'rii were pursued even into their home system: the planet Huk itself was overrun by Kaleesh warriors. The enemy seemed unstoppable, rampaging as far afield as Tovarskl. With their numbers so severely depleted, the Yam'rii realized that they faced nothing less than the extinction of their species."}, {"tag": "p", "text": "The Yam'rii pulled strings with their allies in the Trade Federation to compel the Republic to stop the Kaleesh's retribution. After several backroom deals the Republic decided to intervene in the conflict, and the Republic Judicial Department dispatched fifty Jedi under the command of Jedi Masters T'chooka D'oon and Jmmaar to mediate a settlement. The Yam'rii claimed that the Kaleesh were the aggressors in the conflict, and corruption ensured that the Galactic Senate pressured the Jedi to believe them. The Jedi did as they were told: they chastised the Kaleesh for their belligerence, ordered them to pay war indemnities, demanded the return of worlds they had conquered, and imposed economic sanctions. Several Kaleesh leaders faced war trials. Despite the Kaleesh's protestations that they were the victims, the war finally came to an end with a Yam'rii victory."}, {"tag": "p", "text": "Now with the full support of the Republic, the Yam'rii reclaimed their erstwhile colonies. They destroyed those structures the Kaleesh had built during their occupation, including burial grounds considered sacred to the reptilians. The Kaleesh petitioned the Republic and the Trade Federation to put a stop to the desecration, but the galactic government stood behind the Yam'rii."}, {"tag": "p", "text": "The Galactic Republic's response to the Yam'rii crisis established precedent for the use of paramilitaries by the galactic government. Supreme Chancellor Finis Valorum cited the precedent in arguing for a similar response to problems on the planet Yinchorr."}, {"tag": "h3", "text": "Later conflicts"}, {"tag": "p", "text": "Unbeknownst to the insectoids, Grievous and his kolkpravis made one final push to punish them for desecrating burial grounds on the colony world Oben, but his ship was crashed by the InterGalactic Banking Clan—IGBC—a commercial organization looking to bring the Kaleesh into their control as an enforcer. Bentilais san Sk'ar, one of Grievous' lieutenants, survived the crash-landing and eventually led another attack on Oben. The Yam'rii fled, ceding control to the Kaleesh."}, {"tag": "p", "text": "For a time, the Yam'rii were left to their own devices. However, after the formation of the Confederacy of Independent Systems and the outbreak of the Clone Wars in 22 BBY, the Yam'rii colonists on Tovarskl received some unexpected guests: their one-time foe Grievous and an army of battle droids. The Kaleesh, having been turned into a cyborg by the IGBC and, via his affiliation to that organization, now a general for the Confederacy, ordered the droids to attack. The Yam'rii on the world were slaughtered."}, {"tag": "p", "text": "Huk remained outside the influence of various galactic governments until at least 17 ABY. Eventually, the Yam'rii joined the Galactic Federation of Free Alliances. By this time, they were still commonly referred to as the Huk. When the Swarm War broke out in 36 ABY, disgruntled Yam'rii on Huk received overtures from the Killiks encouraging them to overthrow their government and side with the Colony against the Galactic Alliance. Some Yam'rii responded and became Joiners, addicted to the Dark Nest's black membrosia. Alliance operatives Han Solo, Leia Organa Solo, and C-3PO saw them among other targeted insectoid species in the nest known as Lizil. Knowing that such a coup, if it came along with others around the galaxy, would spread the Alliance forces thin, Jedi arrived to stymie any rebellion. In 137 ABY, after the fall of the Galactic Alliance to the forces of Sith Lord Darth Krayt, the Yam'rii were once again isolated and outside the reach of extraplanetary governments."}, {"tag": "h2", "text": "Yam'rii in the galaxy"}, {"tag": "p", "text": "Yam'rii were aggressive expansionists who founded numerous colonies on disparate worlds, conquering any who stood in their way. Although many members of the species distinguished themselves in war, a few earned a name for themselves in other pursuits."}, {"tag": "p", "text": "Kitik Keed'kak was one such being. She was a powerfully built, sly, and stealthy member of her species. Although she was handy with all sorts of technology, her love for eggs consumed her to the point that in 0 BBY, she was virtually stalking the Quor'sav mother Kal'Falnl C'ndros to eat the avian's brood. Keed'kak had a penchant to upbraid and excoriate anyone who distracted her from her goal—with the exception of her friend, the young Human thief Swilla Corey. Keed'kak was drinking at the Mos Eisley Cantina on the planet Tatooine in 0 BBY on the same day that Obi-Wan Kenobi and Luke Skywalker were looking for passage to Alderaan. At the moment Kenobi sliced up the Aqualish thug Ponda Baba, Keed'kak was directing Corey to a Pacithhip spacer in the cantina named Ketwol. She later left the cantina as the stormtrooper Davin Felth entered the building."}, {"tag": "p", "text": "A Yam'rii of the fingered variety, Rek, was a majordomo and bodyguard who worked for the Black Sun gangster Grappa the Hutt in the days of the New Republic. Rek was stationed at Grappa's base on the planet Genon. In 11 ABY, Rek was present when Grappa received the prisoner Forma from the pirate Sol Mon. The Yam'rii later accompanied Grappa to the planet Smarck to meet the smuggler Macus Kayniph. When Grappa later murdered Kayniph at his palace on Genon, Rek was among those gassed by his master to cover up the killing and make it appear to be part of a larger accident."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Stuart Freeborn designed the model that would become the Yam'rii in England during production of the cantina sequence of Star Wars: Episode IV A New Hope, released in 1977. The actual prop used in the film was a puppet constructed by the special effects team in London and filmed on set as part of principal photography. The character was referred to as the \"Praying Mantis\" during production. An uncredited Jack Purvis, the same actor who portrayed the chief Jawa in the film, hid under the alien's skirt and operated it via strings attached to its limbs. Despite being one of the most intricate and complex props created for the scene, the Praying Mantis is difficult to spot in the final film."}, {"tag": "p", "text": "The species was first identified as the Yam'rii—and the individual seen in A New Hope as Kitik Keed'kak—in Decipher's Star Wars Customizable Card Game in 1995. The card featuring the character established several key features of the species, such as their great strength and love for eggs. The card's statistics make Keed'kak one of the more physically powerful characters in the game, although she is immediately lost if the card representing the Quor'sav mother Kal'falnl C'ndros is present at the same location. The same character appears in the background of Pablo Hidalgo's A Hunter's Fate: Greedo's Tale webstrip."}, {"tag": "p", "text": "Nearly thirty years after the \"Praying Mantis\" appeared in A New Hope, Labyrinth of Evil and The Eyes of Revolution detailed an insectoid species known as the Huk. The sources revealed that the Huk had fought a long war with another species, the Kaleesh, and their leader, General Grievous. Abel G. Peña decided to merge the Huk and the Yam'rii in his article Unknown Soldier: The Story of General Grievous. At the time he wrote the article, little was known about either. He had always considered the Yam'rii to be one of the more interesting-looking and compelling of Star Wars' various insectoid races. Joe Corroney provided the illustrations for the article, including a piece in which Grievous—in his guise as Qymaen jai Sheelal—and his partner, Ronderu lij Kummar, defend the Shrupak temple from the insectoids. Corroney reports in his blog that he enjoyed creating the piece because the Yam'rii are in his opinion \"otherworldly and unique looking.\" He cites the illustration as one of his favorite Star Wars works because it reminds him of a B-monster movie. The novel Darth Plagueis, published in 2012 by Del Rey and written by James Luceno, mentions a \"Yam'rii crisis\" sometime before the Clone Wars. Little context is provided about the conflict, so its relationship to the Huk War is unclear."}, {"tag": "p", "text": "While Peña's article was in editing in 2005, the novel Dark Nest III: The Swarm War, by Troy Denning, was published. It includes a scene in which the droid C-3PO describes the Huk as \"vespid\"—wasp-like—rather than mantid, like the Yam'rii have been depicted. Peña speculates that this must refer to some aspect of the species other than their appearance, but he admits that this is currently a discrepancy. The entry for the Yam'rii in The Complete Star Wars Encyclopedia says that \"it was believed that the Huk species was an offshoot of the Yam'rii,\" implying that the two were not in fact the same. This contradicts other entries in that same work, however, so it is assumed to be an error."}, {"tag": "p", "text": "Mantis-like aliens appear in a few sources but have not been specifically identified as Yam'rii. For example, one such character walks by in the Coruscant crowd in Clone Wars Chapter 21, and a mantid bounty hunter with serrated arms is a member of the Guild Council, the leading body of the Bounty Hunters' Guild, in The Mandalorian Armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}