{"url": "Yarin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Botanical sentient species", "Category:Yarin"], "nodes": [{"tag": "h1", "text": "Yarin"}, {"tag": "p", "text": "The Yarin were a sentient species whose appearance resembled that of trees; their limbs were reminiscent of branches, while their skin had a wooden texture. The species was mobile but slow moving. In 24 ABY, a Yarin served as Harbormaster on the Dac resort known as Crystal Reef. He loaned his personal submersible to the Jedi Knight Cilghal and her companions from the Yavin 4 Jedi Praxeum."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Yarin were a sentient species that resembled trees, with skin that looked like wood. They had branch-like arms and branching hands, as well as root-feet that they sometimes dangled in water. They were slow moving and spoke ponderously, occasionally swaying on the spot."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Yarin had their own language, in which the word \"elfa\" meant \"fish so small, it's not worth catching,\" and they could also speak Basic. Their laughter sounded like wheezing to Human ears."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Yarin were active in the galaxy by at least 24 ABY. In that year, a male Yarin served as the Harbormaster at the Crystal Reef resort on the ocean world of Dac. He was responsible for hiring out submersibles and other watercraft to the tourists at the resort. On one occasion he was approached by a Human girl Anja Gallandro, who wanted to use a submersible to travel under the polar icecaps and destroy a stash of andris spice being stored there by the criminal Czethros. While the girl was unable to secure one on her own as she had no booking, the Yarin gladly lent his personal submersible, Elfa, to the Jedi Knight and Ambassador Cilghal, impressed by her status and position. She was also accompanied by the Jedi trainee Jacen Solo, Tenel Ka and Zekk, who were friends with Gallandro. Together, they were able to destroy the andris spice, encountering a rare Great Arctic Skra'akan along the way, which attacked the minisub. When the Jedi team returned to the Yarin, the Elfa had sustained considerable damage. Nevertheless, the Yarin was far more concerned with their own well-being than the condition of his craft. Their encounter with the Skra'akan, however, excited him, as he believed that experience conveyed good luck. He hoped his craft might have captured some of the encounter on hologram so that he could display the footage at Crystal Reef."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Yarin were created by Kevin J. Anderson and Rebecca Moesta for their young adults reader Young Jedi Knights: Crisis at Crystal Reef, published in 1998. A similar individual appears in their earlier book Young Jedi Knights: Jedi Under Siege, described as \"one of Master Skywalker's Jedi, a slow-moving, long-lived plantlike creature\" and as a \"treelike Jedi.\" Another talking tree appears in \"Party Ewok,\" an episode of Ewoks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}