{"url": "Yaret-Kor", "categories": ["Category:Legends articles", "Category:Incendiary weaponry", "Category:Starship-mounted projectile weapons", "Category:Yuuzhan Vong weapons"], "nodes": [{"tag": "h1", "text": "Yaret-Kor"}, {"tag": "p", "text": "The Yaret-Kor, more commonly known as a plasma cannon, volcano cannon or lava cannon, was the primary intership weapon of the Yuuzhan Vong fleet. As with all other Yuuzhan Vong bio-technology, the Yaret-Kor was an organic creation."}, {"tag": "h2", "text": "Function"}, {"tag": "p", "text": "The Yaret-Kor operated on a basic principle wherein the cannon took in stone or other massive materials, and then heated the materials up and expelled them towards an opposing ship as a flaming projectile. The size of both cannon and projectile was dependent upon the type of vessel it was linked to. Yorik-et starfighters, for example, were armed with up to three plasma cannon that released small, flaming rocks. One starfighter-scale Yaret-Kor was noted to be more powerful than all four laser cannons on a New Republic T-65 X-wing. Larger vessels, such as miid ro'ik warships, had an arsenal of multiple cannons, able to launch larger projectiles in steady streams. Koros-Strohna worldships carried hundreds of cannons of varying sizes, though these weapons had a slow rate of fire and were not grown for anti-starfighter defense."}, {"tag": "p", "text": "The Yaret-Kor's plasma projectiles were powerful enough to melt through the hull of a New Republic starfighter, and collisions could easily knock fighters off their flight paths or stun enemy pilots. These weapons were difficult to counter, even with the advantage of deflector shields; the best counter was point defense. Since Yaret-Kor cannons were grown into yorik-et vessels, it was often difficult to distinguish between ship and cannon, with no easy way to determine the size of the weapon."}, {"tag": "p", "text": "As an organic weapon, the Yaret-Kor held many other advantages over conventional, laser-based weapons. Yaret-kor could heal over time, and did not require a power source. They refueled by consuming various materials, thus negating the need to return to specially-designated areas to restock. Additionally, the plasma cannons fitted to yorik-et coralskippers also served as a means of propulsion, in conjunction with the vessel's dovin basal. The opposing force created when the Yaret-Kor fired actually propelled the starfighter through space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}