{"url": "Yarna_d%27al%27_Gargan", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Askajians", "Category:Females", "Category:Jabba's dancers", "Category:Slaves", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Yarna d'al' Gargan"}, {"tag": "p", "text": "Yarna d'al' Gargan was a female Askajian whose father was a tribal chief back on her homeworld of Askaji. She was captured by slavers and transported to the desert planet of Tatooine, where the Hutt crime lord Jabba Desilijic Tiure bought her. As an enslaved being, she was forced to serve him as a dancing girl at his palace. While working alongside a young Twi'lek called Oola, she was present for Oola's execution and the arrival of Luke Skywalker at the palace. She escaped after Jabba's death and recovered her kidnapped cublings from his townhouse."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Yarna d'al' Gargan was an Askajian female with dark brown hair who came from Askaji, a planet in the Outer Rim Territories. Her people lived in tribes led by chiefs, one of whom was her father, and she would dance for the honor of her tribe. She was married to Nautag and the mother of four cublings. One day, however, she and her family were captured by slavers and brought to the desert planet Tatooine, where the Hutt crime lord Jabba Desilijic Tiure bought them. When Nautag attempted to rebel, the Hutt fed him to his pet rancor, Pateesa, and Yarna's cublings were sent to Jabba's townhouse in Mos Eisley."}, {"tag": "p", "text": "Jabba kept numerous enslaved dancers at his palace in the Dune Sea. Yarna became one of the dancing girls, and although she hated the Hutt, she became close to some of his palace regulars and knew how to avoid Jabba's temper. Considering her to be his favorite performer, one of Jabba's whims was forcing her to wear makeup to look more like his mother, and her increased size was meant to resemble a Hutt's. Her slow and deliberate dances contrasted with those of the young Twi'lek Oola. She was present when Oola resisted the Hutt and was fed to his rancor, and for Luke Skywalker's arrival to rescue his friend Han Solo, but Yarna was not brought along on the sail barge when it went to the Great Pit of Carkoon. The Hutt had captured Leia Organa, but she used her chain to strangle the Hutt to death. Thanks to Organa's actions, Yarna escaped Jabba's palace and was reunited with her cublings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yarna d'al' Gargan was portrayed by Claire Davenport in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. Director Richard Marquand cast her after having directed her in Birth of the Beatles, a 1979 biopic about The Beatles, in which Davenport played a nude model. Marquand said, \"I selected the fat lady, because I think fat ladies are wonderful.\" He originally envisioned the character as a daughter to Jabba the Hutt."}, {"tag": "p", "text": "Nilo Rodis-Jamero, costume designer of Return of the Jedi, said that Yarna d'al' Gargan's six breasts were decided upon in a conversation while under the influence of alcohol. Her costume used a foam latex prosthetic on her stomach, which was fabricated by Industrial Light & Magic and shipped to London for filming."}, {"tag": "p", "text": "The character was not named Yarna d'al' Gargan during the production of Return of the Jedi. In 2006, Holocron continuity database keeper Leland Chee identified a production name \"Weeba Weeba\" as assigned to a human rancor keeper. However, research by Pablo Hidalgo for a StarWars.com blog post in 2013 uncovered that during production of Return of the Jedi, Davenport's character was known as Wiebba-Wiebba."}, {"tag": "p", "text": "After the film, Kenner Products began designing an action figure of Gargan for the toy line Star Wars: The Power of the Force. Lucasfilm put a stop to production in its intermediate prototype stage, apparently considering the six-breasted dancer inappropriate for a children's toy. Her first action figure was released in 2008 as part of Hasbro's Star Wars: The Legacy Collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}