{"url": "Yan%C3%A9", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Articles needing illustration", "Category:Galactic Republic individuals", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Naboo resistance members", "Category:Naboo Royal Handmaidens"], "nodes": [{"tag": "h1", "text": "Yané"}, {"tag": "p", "text": "Yané, born Suyan Higin, was a human female in the service of the Royal House of Naboo. She worked as a weaver, working her loom to make blankets for a hospital, before her recruitment by Captain Quarsh Panaka. She was one of the many royal handmaidens in service of the Queen Padmé Amidala. When Amidala left Naboo for Coruscant, Yané along with Saché, stayed behind and helped the resistance there fight back the Trade Federation's invasion. Yané often volunteered to help Naboo's orphans, and after she left Amidala's service she devoted more of her time to that cause."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Suyan Higin was born on Naboo prior to the Invasion of Naboo. She was a seamstress, using a loom to craft fabric and yarn into blankets. She worked in a market to sell her products and was skilled enough to dye her own yarn, embroider, and make fabric that was waterproof or even fireproof. At one point, Higin was making blankets for the Theed Hospital when she was approached by Quarsh Panaka, who was the Head of Security for the recently elected Queen Padmé Amidala. After inquiring about her skills, Panaka asked her to become one of the queen's Naboo Royal Handmaidens. Higin, eager to do good, agreed to serve."}, {"tag": "p", "text": "Upon meeting Queen Amidala and the other handmaidens, Higin was quick to notice that one of Amidala's headpieces could be remade to be lighter and more comfortable if it was made out of Karlini silk. Changing her name to Yané, she became in charge of liaising with the various palace staff. Over time, she assembled a medical profile on the queen."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "When the Trade Federation blockaded and eventually invaded the planet, Yané and her fellow handmaiden Saché stayed behind while Queen Amidala and the other handmaidens escaped with the Jedi. She and Saché were captured and incarcerated in Camp Four. They began to collaborate with fellow prisoners Mariek Panaka, Sergeant Tonra, and several other guards. Yané and Saché shared a cot in their small tent."}, {"tag": "p", "text": "The two girls were tasked with recording information that the group was discovering about their droid captors, in order to create a plan of escape. Yané shredded silk and planned to weave codes into the rest of the pieces as a form of communication. When Saché was arrested by battle droids due to her walks around camp, during which she delivered the codes Yané wove, Yané ordered the royal guards not to interfere. She and the others listened while Saché screamed from the torture, knowing that if Saché broke, their information gathering would be revealed."}, {"tag": "p", "text": "During their incarceration, Yané and Saché became close after having had an awkward, tense relationship."}, {"tag": "h3", "text": "Life after being a handmaiden"}, {"tag": "p", "text": "After her service as a handmaiden ended, when Padmé Amidala stepped down from being queen, Yané bought a large house where she intended to take in children who had been displaced by the Occupation. Mariek Panaka had cousins living near the house, whom she volunteered to help Yané with getting the house furnished before she moved in. Saché, with whom she had a very close, likely romantic relationship, would also live in the house with her. Some time after Padmé began work as a Republic senator, Yané began to foster a set of twins."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yané had brown hair, brown eyes and light skin. As a weaver, she preferred to use a manual loom instead of a machine so she could pay close attention and have more control."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Yané was played by Candice Orwell in Star Wars: Episode I The Phantom Menace. The character's name is given in the film's closing credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}