{"url": "Yashuvhu", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Chiss Ascendancy planets", "Category:Jungle planets"], "nodes": [{"tag": "h1", "text": "Yashuvhu"}, {"tag": "p", "text": "Yashuvhu was a planet on the near fringes of the Unknown Regions. It was a lush and temperate world that featured mountains and jungles, including the Yashaka Mountains. Sometime during the Old Republic era, Human settlers had landed on the planet but lost contact with the galactic community. The descendants of the settlers, known as the Yashuvhi, also had an established Force tradition which dated to the descendants of a legendary Jedi who crashed on the planet sometime during the years of the Galactic Republic."}, {"tag": "p", "text": "Yashuvhu was rediscovered by the broader galaxy when the Republic's exploration vessel Pathfinder III made contact with the planet. Among those who eagerly learned from the crew of the vessel was the Force-sensitive Valara Saar. She traveled offworld with the intent of joining the Jedi Order, but was unsuccessful. After briefly wandering the galaxy, she returned to Yashuvhu and became known as the \"Prophetess,\" a spiritual leader and protector of her people. She later expelled the Chiss Ascendancy, which had discovered the planet. Even though the world was forgotten by the Republic sometime following the Great Jedi Purge, it was rediscovered by Luke Skywalker and a team of Jedi who were searching for information on Zonama Sekot in the Expeditionary Library on Csilla."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Yashuvhu was an isolated planet located on the near fringes of the Unknown Regions along the eastern border of Chiss Space. It was a lush terrestrial world, with a temperate climate and a mixed terrain of jungles, forests and mountains. One such group of mountains were the Yashaka Mountains in which Valara Saar, locally known as the Prophetess, took residency. One of the native species to Yashuvhu was the non-sentient duuvhal, a type of warm-blooded reptilian creature that lived within the forests and jungles of the planet. As a means of blending into their environment, the creatures had green feathers covering their bodies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime during the Old Republic, Human colonists arrived on Yashuvhu but had lost contact with the rest of the galaxy. As a result, the planet and its people became long-forgotten. According to documents found in the Chiss Expeditionary Library, the colonizing Humans arrived approximately three millennia before the Yuuzhan Vong War, though they may have arrived even earlier. Millennia before the planet's rediscovery by the Galactic Republic, however, an unidentified Jedi traveling near the planet in hyperspace crashed onto the surface of Yashuvhu. After surviving the crash, the marooned Jedi discovered that there were Humans already residing on the planet. According to the Yashuvhi legend, the stranded Jedi was a Human who settled with the local population and started a family. From his descendants came a Force tradition and bloodline of Force-sensitives. Along with an ancient scroll that contained a portion of the Jedi Code, a series of legends continued to be passed down until the time of the planet's rediscovery."}, {"tag": "p", "text": "Sometime prior to the rise of the Galactic Empire, the planet was discovered by the Republic exploration vessel Pathfinder III. The encounter was intended by the Republic as a first-contact mission to discover new worlds. While the crew of the vessel communicated with the natives, they were asked if the Jedi had returned to live among them and if any knowledge of the Jedi could be shared. After learning enough of the local language to communicate, the crew of the Pathfinder III explained as much as possible about the Jedi Order to an eager audience. One such inquirer was a Force-sensitive female named Valara Saar."}, {"tag": "p", "text": "Valara Saar convinced the crew of the Pathfinder III to take her offworld with the hope of becoming a Jedi. Even though she learned some basic skills, she was not able to join the Order and wandered the galaxy briefly. Ultimately, she resettled in a small isolated hut within the Yashaka Mountains. There, she became a teacher of the Force to those on Yashuvhu and was known as the Prophetess. She was also responsible for protecting her planet from a perceived threat by the Chiss Ascendancy, which had also discovered the world. Initially, Saar did not meet with the leaders of the Chiss contact team. When the Chiss tried to approach her residence in the mountains uninvited, however, they were forced to hastily retreat due to her formidable combat techniques and Force abilities. During the confrontation, Saar wielded what appeared to have been a lightsaber, and the entire event was documented by the Chiss after their retreat."}, {"tag": "p", "text": "The planet was largely, though not entirely, forgotten by the broader galactic community by the time of the Yuuzhan Vong War. The coordinates of the planet were available to R2-D2 in 28 ABY during the hunt for Zonama Sekot. According to the information available, the planet had been labeled as nonhostile by Imperial first-contact specialists and further indicated that the citizens of Yashuvhu had some knowledge of the wandering planet. Therefore, the team of Jedi aboard the Jade Shadow, led by Luke Skywalker, planned to visit the planet. More information regarding Yashuvhu and its inhabitants was later discovered by the Jedi Master and the team of Jedi who were searching the records within the Chiss Expeditionary Library on Csilla for any mention of Zonama Sekot. In the process of their research, Skywalker discovered the teachings of Valara Saar. Also included in the Cheunh text was how the Chiss had been expelled from the planet by the one known as the Prophetess. Altogether, however, the Chiss largely ignored the existence of the planet and its inhabitants."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Yashuvhi"}, {"tag": "p", "text": "The Yashuvhi were descendants of Humans who had attempted to settle the planet sometime during the Old Republic era. According to Chiss records, the Human population arrived a little more than three thousand years prior to its rediscovery by Luke Skywalker, though they may have arrived even earlier. The Human population lost contact with the rest of the galaxy and began to form their own culture and society, including the evolution of the Yashuvhi language. Upon their arrival, the crew of the Pathfinder III discovered that the Yashuvhi language was a heavily evolved derivative of Galactic Basic Standard. During their first contact mission, the crew also discovered that the Yashuvhi were of sizable population but scattered across the planet."}, {"tag": "p", "text": "The Yashuvhi had a Force-based tradition which stemmed from the arrival of a Jedi thousands of years before Luke Skywalker rediscovered them. The Jedi, who was believed to have been Human, settled within the society and started a family. His descendants continued the bloodline of untrained Force Adepts. One such descendant was Valara Saar, who would eventually become one of the planet's key spiritual leaders and protectors."}, {"tag": "h3", "text": "Duuvhal"}, {"tag": "p", "text": "The duuvhal was a predator that lived in the jungles and forests of Yashuvhu. It was a non-sentient creature that preyed upon the smaller animals in its natural habitat. The duuvhal was reptilian in nature, though it was warm-blooded. It featured emerald green feathers which covered its skin and allowed it to blend into its environment. It was approximately the size of a small dog, but very quick for its size. Though it had a venomous bite, it rarely attacked Humans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Yashuvhu first appeared in the role-playing supplement Meet Valara Saar: Force Adept by Wizards of the Coast author Cory J. Herndon. The planet, along with Valara Saar, was mentioned in the book The New Jedi Order: Force Heretic II: Refugee, published the following year."}, {"tag": "p", "text": "No definitive date has been established for the rediscovery of Yashuvhu by the vessel Pathfinder III. While the Star Wars Roleplaying Game covers the eras of the six Star Wars films, no date can be derived any more precisely than the era in which these events took place."}, {"tag": "p", "text": "An exact date for the settling of Yashuvhu has not been confirmed in canon and remains ambiguous. The Chiss records state that the planet was inhabited about three thousand years prior to its rediscovery by Luke Skywalker. On the other hand, the role-playing supplement Meet Valara Saar: Force Adept states that the Jedi who became marooned on the planet arrived \"many thousands of years\" prior to the lifetime of Valara Saar. The Jedi who arrived came after the planet had been settled by the Yashuvhi."}, {"tag": "p", "text": "A minor continuity issue arises within the mentions of Yashuvhu in The New Jedi Order series. Contact between the New Republic and Yashuvhu is uncertain, though hinted at in the text of The New Jedi Order: Force Heretic I: Remnant. In this book, the team of Jedi aboard the Jade Shadow set course for Yashuvhu but no mention of their arrival is recorded. The only mention of contact with regards to the broader galaxy was the knowledge provided by Imperial Remnant first-contact specialists, indicating that the planet had at least been identified, though no further explanation or story development is provided. Furthermore, the mention of Yashuvhu in Force Heretic II: Refugee indicates that information regarding Yashuvhu and its population was unknown to Luke Skywalker and his team as he read through the books found in the Expeditionary Library."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}