{"url": "Yasto_Attsmun", "categories": ["Category:Canon articles", "Category:Cyborgs", "Category:Individuals of unidentified species", "Category:Males", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Yasto Attsmun"}, {"tag": "p", "text": "Yasto Attsmun was a tyrannical baron from Listehol who owned the yacht Undisputed Victor. During the Cold War between the Resistance and the First Order, he spent time on the planet Cantonica where he hosted parties every night aboard his yacht while sailing on the Sea of Cantonica. During one yacht party, the baron spoke with the arms dealer Jerdon Bly, who was murdered by Attsmun's masseuse Lexo Sooger. In order to cover his escape, Sooger then spread word that there was a fire onboard the yacht, causing the baron and his guests to quickly evacuate. In the year 34 ABY, Attsmun was hosting another party on board his yacht where he made unsuccessful romantic advances toward the club owner Ubialla Gheal."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The constant host"}, {"tag": "p", "text": "Baron Yasto Attsmun was a male alien from Listehol who spent time on the planet Cantonica during the Cold War between the First Order and the Resistance. He constantly hosted parties aboard his yacht the Undisputed Victor as it sailed on the Sea of Cantonica, with many guests returning night after night. While on the world, he was a patron of Zord's Spa and Bathhouse in the city of Canto Bight, where he was a client of the Dor Namethian masseur Lexo Sooger."}, {"tag": "p", "text": "During one of Attsmun's parties, he spoke to the arms dealer Jerdon Bly at the stern of the Undisputed Victor shortly after the yacht had left the Canto Bight boathouse. The baron asked about an arms deal that Bly was brokering the following day with the First Order, after which Bly demanded that Attsmun introduce him to Lady Centada Ressad, another guest aboard the yacht. After the baron had made introductions between the pair, Bly asked to be left alone with Ressad and Attsmun was happy to oblige, departing to speak with another cluster of guests."}, {"tag": "h3", "text": "A party interrupted"}, {"tag": "p", "text": "Shortly after Bly and Attsmun parted ways, Sooger was discovered disguised as a waiter in a restricted area of the yacht by one of the baron's guards. Sooger, who had orders to kill Bly from Contessa Alissyndrex delga Cantonica Provincion, lied to the guard and told him that the baron had sent him down a drink in order to celebrate winning a bet on a fathier race. The guard believed the lie and left Sooger alone, who then lured Bly down to the quiet area of the the Undisputed Victor and murdered him. In order to cover his escape, the masseur spread word that there was a fire onboard the yacht, causing the baron and all his guests to evacuate."}, {"tag": "p", "text": "After the cold war erupted into open conflict between the two factions involved in the year 34 ABY, Attsmun was hosting another party aboard his yacht. During the festivities, he stood at the vessel's railing with Ubialla Gheal, owner of a nightclub in Canto Bight. The pair clinked their glasses of drink together, but Gheal turned down advances made by the baron."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Attsmun was an alien with white hair. He was a tyrant who was not known for his generosity and never deigned to acknowledge servile beings or look at them. While speaking with Bly, he acted politely to the arms dealer but oozed contempt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yasto Attsmun was created for the film Star Wars: Episode VIII The Last Jedi, but prior to its release date on December 15, 2017, an image of the character was first revealed in an issue of People magazine. The character then appeared in the short story \"Hear Nothing, See Nothing, Say Nothing\", which was written by Rae Carson and released as part of the Journey to Star Wars: The Last Jedi promotional campaign for the film on December 5, also before the film itself was released."}, {"tag": "p", "text": "Concept art of Attsmun was produced by creature concept designer Jake Lunt Davies for the film with the title \"Casino Alien 11\". The character was also included in another concept piece by concept artist Adam Brockbank titled \"Yacht Version 1\". Attsmun's dialogue in the film was performed by director Rian Johnson and consists of three words: \"Pablo Rayne Kiri\". These are a reference to Lucasfilm Story Group members Pablo Hidalgo, Rayne Roberts and Kiri Hart respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}