{"url": "Yavid", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Endorians", "Category:Males", "Category:Sanyassans"], "nodes": [{"tag": "h1", "text": "Yavid"}, {"tag": "p", "text": "Yavid was a Sanyassan male and a soldier in the Sanyassan Marauders. Born into Sanyassan aristocracy, Yavid was constantly looked down upon due to his short stature. As a result, he became sadistic and ill-tempered—traits that would serve him well with the uncouth and raucous Marauders. He studied military history and technique and became a general among the Marauders. When the Sanyassan Marauders were exiled due to their criminal and violent nature, they stole a star cruiser and became pirates in the Moddell sector. Their technological expertise, however, was sorely lacking, and they eventually found themselves stranded on the Forest Moon of Endor."}, {"tag": "p", "text": "The leader of the Marauders, King Terak, began claiming Endorian territory for himself, with Yavid leading the military campaigns to defend them from outside aggressors such as the Phlogs, and the Duloks. Yavid also had diplomatic skills, which allowed him to secure a truce with Morag, a powerful Tulgah witch. In 3 ABY, Yavid commanded the Marauder troops in the Battle of Endor against the Ewoks of Bright Tree Village. The battle was disastrous; King Terak was slain along with a considerable amount of troops. In the ensuing power vacuum, Yavid attempted to claim the throne, but he lacked the proper skills to do so effectively."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Sanyassan Marauder general"}, {"tag": "p", "text": "Lacking in height for a Sanyassan, Yavid was born into aristocracy on Sanyassa IV. However, Sanyassan culture dictated that social standing was gained by force, rather than birthright, and Yavid found himself at a disadvantage due to his size. He studied military technique and history, and became an astute tactician. Eventually, due to his disadvantages, he developed an explosive temper and a sadistic nature, gaining himself a reputation amongst his peers."}, {"tag": "p", "text": "Yavid joined the Sanyassan Marauders, a group of violent and unruly criminals. They saw themselves as pirates, but the Sanyassan populace saw them only as uncouth, and had them exiled. With only a limited understanding of technology, they searched the Moddell sector for suitable prey in a ship they had stolen. However, they soon crashed on the Forest Moon of Endor."}, {"tag": "p", "text": "With no way of leaving Endor, King Terak, the leader of the Marauders, decided to carve out a piece of territory for himself. He lacked military knowledge and skill, however, so he appointed Yavid as his general. Utilizing his talent, Yavid was able to maintain Terak's barren territory, and he kept it safe from invaders such as the Phlogs and King Gorneesh's Dulok Army. He also used his diplomatic skills to deter Morag, the Tulgah witch, who, if she had devoted her resources to it, could have easily taken Terak's castle and land."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Terak had learned of the existence of what he referred to as \"the power\"—a power cell that powered starships. He captured fellow castaway Salak Weet and learned of a ship hidden in the forest, which he and his Marauders could use to leave Endor. Weet perished in Terak's dungeons, but the king was not satisfied. A considerable amount of time later, he heard of another ship that was located near Bright Tree Village, an Ewok settlement. Believing that he might finally get his hands on \"the power,\" he roused the troops and personally led an attack on Bright Tree Village, with Yavid participating."}, {"tag": "p", "text": "The attack was successful; many Ewoks were captured, and \"the power\" was retrieved from a ship owned by the Towani family. The Towanis themselves had all been killed, save for Cindel, who had been captured along with the Ewoks. Towani and Wicket Wystri Warrick escaped Marauder custody, however. Back at Terak's Keep, Yavid was given custody of \"the power.\" The Nightsister Charal, to Terak's anger, was unable to unlock the secret of \"the power,\" and as a result, she was dispatched to retrieve Towani from the forest."}, {"tag": "p", "text": "Towani was captured and brought to Terak. When Yavid presented \"the power\" to her, she too could do nothing to unlock its secrets, and she was subsequently locked in the dungeon with the captive Ewoks. While Yavid was enjoying the usual court festivities with Terak, Noa Briqualon—Weet's former shipmate—and Warrick infiltrated the castle, and liberated the Ewoks and Towani. Terak, livid, had Yavid rally all the Marauder troops for combat. Once again, the king chose to participate in the battle personally, and with the help of Charal, the Sanyassan Marauders tracked the Ewoks to the location of Briqualon's hidden ship."}, {"tag": "p", "text": "The Marauders, with Terak leading them, ventured into the forest, wary for Ewok traps and retaliation. A fierce battle ensued, with the Marauders sustaining heavy losses. Teek, Briqualon's companion, was able to sabotage Yavid's war effort by lighting a fire near the Sanyassan's blurrgs, causing them to stampede. Though Yavid initially set off after them in pursuit, he gave up, and joined the battle wholesale. Briqualon, at that time, was able to use \"the power\" to get his ship's systems on line, and he used his laser cannons to decimate the Marauder ranks. The majority of the Marauders, along with Yavid, retreated back to the castle, but Terak was slain by Warrick, leaving the Sanyassans without a king."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "With Terak dead, there was a power vacuum amongst the Marauders. Yavid, being the senior ranking Sanyassan, attempted to seize power. But he lacked the skills to rein in the unruly Marauders, and was unsuccessful in his claim. Eventually, the Sanyassans turned on one another and afterwards Zakul became their new King."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Being short was looked upon as being a weakness in Sanyassan culture, and as such, Yavid was constantly belittled by his peers during his youth. He developed a short and violent temper, but balanced it with deep studying and an understanding of tactics. He was able to vent his pent up anger amongst the Sanyassan Marauders, who were made up of cutthroats and criminals of the same temperament. Yavid was not afraid to fight alongside his men in battle, and even had diplomatic skills to complement his more violent side."}, {"tag": "p", "text": "In moments of frustration or activity, he was known to display his emotions physically. He stood 1.1 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yavid first appeared in the 1984 television movie, Ewoks: The Battle for Endor. In the film, the character is credited only as \"Lieutenant,\" and is played by Roger Johnson. The backstory of the character was developed by Nathan O'Keefe through the StarWars.com Hyperspace feature \"What's The Story?,\" where his name was given to the first time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}