{"url": "Yearo_Seville", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Yearo Seville"}, {"tag": "p", "text": "Yearo Seville was a Human male and a member of the Seville pirate clan during the time of the Galactic Civil War. He had nine parallel scars on his cheek. During Seville's youth, the droid MdZ-BLK tried to kill its owner, the Seville matriarch Darion Seville—who was also Yearo's mother—but Yearo saved her and disposed of the droid, sending it to kill Gorbu Dalo, a rival Hutt pirate. Seville was also involved in the abduction of Crying Dawn Singer, a Shashay cultural hero. The operation was only one of the many moves in an important conspiracy of Braig Farool, governor of the planet Narg, to depose and replace Moff Nile Owen of the Rayter sector. The pirate then allied himself with agents of the Galactic Empire to annihilate the fleet of the rival Vallaido pirate clan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Yearo Seville, a Human male, was the son of Darion Seville, the matriarch of the Seville pirate clan. Darion liked to have her droids fight each other, but during one such duel, the droid MdZ-BLK attempted to kill her. Yearo intervened and ionized the droid, saving his mother's life. Afterward, he sent the droid as a gift to the Hutt Gorbu Dalo, a rival pirate, in the hope that the droid would kill Dalo. MdZ-BLK indeed murdered the Hutt, but the droid then stole a freighter, loaded it with explosives, and sent it to crash against the Seville family compound. Seville, however, was not killed during this attack."}, {"tag": "p", "text": "Seville, an ambitious person, joined a ring of smugglers and killed more than one hundred sentients before he was fifteen years old. Eventually, he created his own pirate gang and obtained a space yacht he called Seville's Star. At some point, Seville also owned and customized a CRX-Tug, which had been prepared to accept a one-legged pilot. Seville then sold the Tug to a procurement officer of the Alliance to Restore the Republic, claiming that the ship had been used in Imperial shipyards and that it retained secret information in its memory. However, Seville was lying, and the memory core had been fused. The Alliance then christened the ship Worthless Fool."}, {"tag": "p", "text": "Circa 1 ABY, Seville was approached by Nak Farool, Special Assistant to Moff Nile Owen of the Rayter sector. Farool was looking for a scoundrel who could kidnap Crying Dawn Singer, a Shashay cultural hero, and then pretend to be a leader of the Alliance to Restore the Republic asking for a ransom. This would stall diplomatic meetings between the Alliance and the Shashay. Once this was done, Seville had orders to hand over the Shashay to the Galactic Empire. Farool would then stage a charade of a rescue, and the Empire would gain notoriety among the Shashay, while Seville would receive money for his services."}, {"tag": "p", "text": "However, Nak Farool conspired along with his brother, Governor Braig Farool of Narg, to depose and replace Moff Owen with this plot. Nak Farool ordered Seville to take Crying Dawn Singer to Narg and deliver him to Farool, instead of to Owen. Seville accepted the conditions and kidnapped Crying Dawn Singer and his entourage during the opening of the Sector Performing Arts Center, using an airspeeder provided by Farool. Seville took his prisoners to an Imperial base on Najarka and tortured them to death, except for Crying Dawn Singer, who survived, and the droid KL-6T-LF7V/T, who was only disconnected. KL-6T-LF7V/T was identified as an undercover Rebel agent, and Seville was asked to leave it at Najarka, where Owen would pick it up while the pirate took Crying Dawn Singer to Laim."}, {"tag": "p", "text": "Once in Laim, Seville recorded a holotransmission asking for an unacceptable ransom as he had been ordered to. He also battered Crying Dawn Singer and claimed to be a leader of the Rebel Alliance. The message was broadcast, along with several other forgeries of Nak Farool, but the Alliance tracked it to Laim. The Shashay, however, believed the message to be true, and threatened to go to Moff Owen if the Alliance failed to return Crying Dawn Singer. Seville then took Crying Dawn Singer to Narg and handed the Shashay over to Farool. At this point, members of the Rebel Alliance were following Seville's steps in an attempt to recover Crying Dawn Singer."}, {"tag": "p", "text": "His mission accomplished, Seville left Narg. Farool's implication was discovered by the Alliance and by Owen, and he was harassed by agents of his many enemies. Farool lost his mind and, megalomaniacally, believed that he had disgraced Seville, the Alliance, Owen, and all the sectorial powers. The Rebellion rescued Crying Dawn Singer from the hands of the governor, and the Shashay took up diplomatic relations with the Alliance again."}, {"tag": "p", "text": "Still at large, Seville made a deal with the Galactic Empire. The Empire agreed to reinforce the Seville clan fleet in an attack against the fleet of the Vallaido pirate clan, who had been enemies of the Sevilles for generations. While the Vallaido fleet was destroyed, a number of Vallaidos survived. One of these survivors was Siro Simito, who decided to join the Alliance to Restore the Republic in response to Seville's actions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A dark-haired Human male with a mustache, Seville had nine parallel scars on his left cheek. He could also be identified because he enjoyed eccentric, lavish clothes and because he used a gold-plated blaster pistol and a drommanarg snuff pouch. Although he was not particularly tall or burly, he was threatening in his careful composure. Ruthless and greedy, Seville was known to manipulate his subordinates into paranoia for his own safety. He was considered the most sanguinary and wicked outlaw in the Rayter sector."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yearo Seville first appeared in The Abduction (1992), a roleplaying adventure for West End Games' Star Wars: The Roleplaying Game. The book included Seville's roleplaying statistics. According to those, Seville was a skillful crewman and was not specialized in any responsibility except command, but was apt for several of them. He was also a good fighter in both close and long distances, and was excellent at intimidating and conning people. However, the adventure included no situation in which Seville was entitled to use these skills, as the player characters never really meet him in person. Seville disappears from the plot after leaving Narg, and as such there are no alternate paths affecting him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}