{"url": "Ycaqt", "categories": ["Category:Legends articles", "Category:Amphibians", "Category:Creatures of unspecified diet", "Category:Creatures of Velmor", "Category:Domesticated creatures", "Category:Grassland and plains creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Ycaqt"}, {"tag": "p", "text": "A Ycaqt was a large reptilian herd animal native to the planet Velmor. Strong, stubborn and fast for their size, ycaqt mainly survived on a diet of plankton, using their massive maws to gather and filter up to 20 kilograms of water at a time. Despite their imposing stature, ycaqt had a generally peaceful temperament, and preferred to run away from predators unless cornered. Ycaqt were important parts of Velmor's culture and tradition, and were notably used for ceremonial festivals as well as for herding and sport activities."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Large, hairless reptilian herd animals with mottled orange skin, ycaqt were native to the Mid Rim planet Velmor. Ycaqt had flat heads bisected by a large maws which they used to scoop up to 20 liters of water at a time—the delicate baleen within filtered the water a ycaqt captured, allowing them to feed on the plankton that formed the largest part of their diet."}, {"tag": "p", "text": "Their rounded bodies were supported by two large hind legs with broad, three-toed feet, along with a tail that aided their balance. Very strong animals, ycaqt were able to carry up to 350 kilograms of weight, and drag up to 1,750. However, they were surprisingly fast for their size, able to outrun most predators on Velmor. Ycaqt could be ridden by bipedal sentients, who commonly did so on saddles."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Although the ycaqt's imposing maw appeared an intimidating weapon, ycaqt actually attacked with its tail, as biting could damage the baleen it used to filter water and feed upon plankton. However, it was rare to find a ycaqt in a scrape—the large herd animals were regarded as generally peaceful, if very stubborn, beasts. In fraught situations they were more likely to simply run away, only choosing to fight when cornered. Their peaceful temperament attracted the interest of offworld herders, although their intractable nature and their dislike for non-temperate or tropical environments meant they did not often fare well off Velmor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ycaqt were long an important part of Velmorian culture—Velmorian knights rode ycaqt into battle in ancient times, and they were often used in precoronation festivities for Velmor's rulers. For example, the Mrid Hunt was an important tradition before the crowning of a new King of Velmor, where attendees would ride ycaqt into the planet's forests, searching for small, elusive mrids. Knowledge of the ycaqt eventually spread beyond Velmor, and the beasts drew interest from offworlders looking to acquire ycaqt for herding or sporting purposes. By the era following the Galactic Civil War, ycaqt could be found on worlds such as Froswythe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ycaqt first appeared in Star Wars 49, written by Mike W. Barr and released in 1981. During the comic, the beasts were illustrated by Walter Simonson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}