{"url": "Yavin_8/Legends", "categories": ["Category:Legends articles", "Category:Moons of Yavin", "Category:Rocky moons", "Category:Type I atmosphere moons"], "nodes": [{"tag": "h1", "text": "Yavin 8"}, {"tag": "p", "text": "Yavin 8 was one of three habitable moons that orbited the gas giant world of Yavin Prime. Located in the Yavin system in the Gordian Reach sector of the Outer Rim Territories, it was a cold and arid moon and the home of the Melodie species."}, {"tag": "h2", "text": "Geographic features"}, {"tag": "p", "text": "Yavin 8 was an arid, cold world covered in vast expanses of snow and brown tundra. Though water was abundant on Yavin 8 because of its vast expanses of snow and tundra, it was only found in liquid form within the rivers and lakes of its equatorial purple mountain ranges. Occasionally, the snow and tundra melted during spring thaws which resulted in floods."}, {"tag": "p", "text": "Yavin 8's equatorial mountain ranges were inhabited by the moon's sole sentient species, the Melodies. They were amphibious humanoids that spent the rest of their lives underwater once having reached the age of twenty in which they changed their form during the Changing Ceremony. A humanoid race also lived on the moon. The race earned the enmity of Emperor Palpatine, who initiated its genocide. The only survivor was Tarron Neb."}, {"tag": "p", "text": "Other lifeforms native to the moon included various fish species that inhabited the moon's rivers and lakes and several predatory species including the bird-like Avril, the serpentine Reel, the rodent-like Raith and the spidery Purella."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Due to its remote location, Yavin 8 was largely unknown to the rest of the galaxy. In 3997 BBY, during the Sith Lord Exar Kun's reign over the Massassi of nearby Yavin 4, he imprisoned their children in a spherical Dark side device known as the Golden Globe for the purpose of both controlling the Massassi and to drain the life energies of its trapped captives. The desperate Massassi parents came to Yavin 8 to seek help and met the children of the Melodies. The children took them to their Elders but they could offer no help since they were unable to leave the waters."}, {"tag": "p", "text": "Thus, the Massassi engraved messages in the rocks and caves of Yavin 8 so that somebody may read them some day and come to their aid. However, these messages were written in the Massassi tongue, which made it difficult for non-speakers to understand them.\nWorse, the Massassi were wiped out in 3996 BBY during the Jedi/Republic assault on the jungle moon. This piece of history would only be preserved in the form of legends by storytellers known as \"Keeper of Legends\"."}, {"tag": "p", "text": "Millennia later, during the Imperial Period, the Melodies were discovered by the Rodian Suz Tanwa though they were only officially discovered in 22 ABY by Luke Skywalker's New Jedi Order which had set up a Jedi Praxeum on Yavin 4. On that same year, a young Melodie named Lyric left her home of Sistra to study at Master Luke Skywalker's Jedi Praxeum on Yavin 4 after being discovered to be Force-sensitive. Her parents allowed her to go because of the dangerous conditions of their homeworld. Later, when Lyric returned to Yavin 8 to undergo the Changing Ceremony in 22 ABY, Jedi trainees Anakin Solo and Tahiri Veila escorted Lyric to her homeworld to undergo the Changing Ceremony. During their trip, they fell under attack by native carnivores including an avril, a reel, a purella and a number of raiths though Anakin, Tahiri and their Melodie allies fought them off."}, {"tag": "p", "text": "It was also from the Keeper of Legends Aragon that Anakin and Tahiri learned about the existence of the ancient Massassi carvings. They discovered these carvings in a cave. During their trip on Yavin 8, Anakin and Tahiri also met Sannah, whom they discovered to be Force-sensitive and took her with them during their home trip to Yavin 4. Later, Sannah assisted them in translating the ancient Massassi carvings. They then learned of the origins of the Golden Globe and how to defeat it."}, {"tag": "p", "text": "Shortly after the Yuuzhan Vong destroyed the Jedi Praxeum in 26 ABY, the Yuuzhan Vong presumably conquered Yavin 8. The extragalactic invaders also unleashed deadly Jedi-hunting Voxyn on the moon. Among their victims were Lyric."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars 5 was the first source to indicate three of Yavin Prime's moons could support life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}