{"url": "Yavin_Coalition", "categories": ["Category:Legends articles", "Category:Task forces", "Category:Yavin Coalition"], "nodes": [{"tag": "h1", "text": "Yavin Coalition"}, {"tag": "p", "text": "The Yavin Coalition was a joint task force formed by Jedi Grand Master Satele Shan and the Dark Council's de-facto leader Darth Marr to deal with the threat posed by Revan and his followers in 3637 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "While Revan's ultimate goal was to force Sith Emperor Vitiate into a physical form on Yavin 4 so that he could be killed, he also set a trap for the Imperial and Republic fleets above Rishi. Nova Blades pirates were hired to attack shipping lines, rerouting the hyperlanes to lure both fleets into the system. Once there, a signal jammer would prevent any communications within both fleets, while saboteurs placed on each vessel would sabotage the systems, allowing both fleets to annihilate one-another, after which the Revanite ships would move in to wipe out the survivors."}, {"tag": "p", "text": "The Revanite plot nearly succeeded, but after two fleets led by Jedi Grand Master Satele Shan and Dark Council's de-facto leader Darth Marr engaged each other in the Battle of Rishi, the jammer on the planet's surface was disabled by the associate of Lana Beniko and Theron Shan. They contacted both fleets and revealed to them the Revanite deception, providing the full list of traitors aboard both fleets as proof. This convinced both leaders to order a ceasefire, after which they agreed to meet in a neutral location in Raider's Cove. With the threat of the Sith Emperor being reborn posing a threat to every living thing, both sides agreed to put aside their differences to stop Vitiate from consuming all life in the galaxy."}, {"tag": "h3", "text": "Conflict on Yavin 4"}, {"tag": "p", "text": "Acting largely on their own, without the approval or the knowledge of anyone else in the Galactic Republic or the Sith Empire, Darth Marr and Grand Master Shan formed the Coalition from the present portion of their fleets and traveled to the moon of Yavin 4 seeking to stop Revan's plans. The Coalition established a Command Post not far from the Revanite's position but was initially unable to do much more than that, as soldiers from both sides were vary of each other and had difficulty working together. A series of sensor beacons was established along the perimeter, granting the Coalition both an eye on the Revanite activities and an insurance against a mutual backstabbing."}, {"tag": "p", "text": "It was discovered that the Revanites have taken over an Imperial Guard Academy, incursion into which led to the capture of the surviving Imperial Guard Commandant Iven. Iven revealed that the Revanites were using the Temple of Sacrifice as their base and that Revan was planning to use an artifact that could bring the Sith Emperor back to the life at the cost of killing every living thing on the moon except those inside the Temple. In spite of the increasing conflict between the Revanites and the Coalition, both Satele Shan and Darth Marr could detect a large light side presence on the moon, which was revealed to be none other than the Force ghost of Revan himself, who after the battle of the Foundry was self being divided into two halves, representing his light and dark side. Revan's light side half was capable of becoming one with the Force, but was unable to do so without his darker counterpart, who still existed in physical form and was the one seeking to bring Vitiate back to life."}, {"tag": "p", "text": "The complex locking mechanisms of the Temple were disengaged, but a large host of Revanites still stood between the Coalition forces and the Temple. Once the old rivalries between the Republic and Imperial soldiers were smoothed out, both sides were finally able to work together as a unified force and a team of 8 of the greatest Republic and the Imperial's strike team stormed the Temple. The team engaged against the remaining Revanite Commanders as well as the fauna of Yavin IV. Resulting in the defeat of Revan and the destruction of a HK-47 model. Revan's ritual was stopped, and the artifact was destroyed, but Revan himself escaped the Temple and retreated to a small sanctuary nearby. To stop him once and for all, the Coalition leadership went to face Revan face to face, consisting of Darth Marr, Satele Shan, her son Theron Shan, Sith Lord Lana Beniko, Wookiee smuggler Jakarro, as well as Shae Vizla, who ended her exile on Rishi to personally face the worthiest of all opponents."}, {"tag": "p", "text": "The Coalition forces engaged Revan in open combat and eventually defeated him, but their victory was short-lived, as all of the fighting on the moon caused enough death to allow Vitiate to return to life regardless. His spirit left the moon without possessing a physical body, while the dark half of Revan was confronted by his light counterpart, who convinced him to join back together and become one with the Force."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Although the Coalition achieved victory, it was agreed that Vitiate's return posed a threat to them all. While Republic and the Empire were still at war with one another, Marr and Shan came to a mutual conclusion that they would renew their alliance when Vitiate was sighted again. For the time being, the Coalition was dissolved and both fleets returned to their original factions, although both sides left small garrisons on the moon to deal with the remaining pockets of Revanite activities. Both leaders were unable to act fast enough when Vitiate reemerged on the Sith world of Ziost, where he performed his ritual that killed all life on that world. Darth Marr then led a strike team to pursue their former Emperor into Wild Space, inviting many of Yavin veterans to join their side, but unfortunately they came into contact with the hidden Eternal Empire of Zakuul. In the first skirmish with the Eternal Fleet Darth Marr's task force was largely destroyed with few survivors, while Marr himself was taken captive and executed by his former Emperor."}, {"tag": "p", "text": "Though the Coalition disbanded, several of its former members went on the forge what would later be known as the Eternal Alliance, based off of the Coalition as they fought against the Eternal Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Yavin Coalition plays a critical role in Star Wars: The Old Republic: Shadow of Revan expansion. Apart from featuring heavily in the story, players can also perform daily repeatable mission for the Coalition members and increase their reputation status with the Coalition for various rewards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}