{"url": "Yavin_4", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic moons", "Category:Galactic Empire moons", "Category:Jungle moons", "Category:Moons of Yavin", "Category:New Republic moons", "Category:Type I atmosphere moons", "Category:Yavin 4 locations"], "nodes": [{"tag": "h1", "text": "Yavin 4"}, {"tag": "p", "text": "Yavin 4,  also known as Yavin, was the jungle-covered fourth moon in orbit around the red gas giant Yavin Prime. Prior to and during the Galactic Civil War, it hosted the headquarters of the Alliance to Restore the Republic, a group of resistance fighters that opposed the dominant Galactic Empire. Following a major battle that took place around Yavin, the Alliance went on the run, and eventually relocated its headquarters to Hoth."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The surface of Yavin 4 was divided into several continental masses, two of which were Starloft and Wetyin. Notable natural formations included Massassi Valley, Skygazer Hill, and the Ferra Groves. The verdant world had a comfortable, temperate climate but a challenging ecosystem and dangerous predators."}, {"tag": "p", "text": "The moon's landmasses were covered by dense jungles and rain forests whose flora included purple-barked Massassi trees, grenade fungi, bioluminescent orchids, and climbing ferns. Yavin 4 also had swampy areas. The moon, however, was completely lacking in any mineral resources of significance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Five thousand years before the Battle of Yavin, the ancient warrior race of the Massassi lived on Yavin 4 and constructed the Great Temple. Being enslaved by the Sith, the Massassi species would be extinct by the time the Alliance to Restore the Republic would utilize the temple during the Galactic Civil War as a base of operations against the then-dominant Galactic Empire. It was from this base that Operation Fracture was dispatched to Jedha. Shortly following this, Alliance snub fighter squadrons with orders to destroy the Death Star were also launched from Yavin 4. After the space battle and the related award ceremony, the rebels evacuated the base to escape any retaliatory strike by the Empire."}, {"tag": "p", "text": "After the temple was abandoned by the rebels, a Special Galaxy Reporter was sent to Yavin 4 to write a travel advertisement about the ruins."}, {"tag": "p", "text": "Later, a rebel force was sent to the moon in order to seize leftover data centers from the previous rebel occupation. However, the Empire managed to discover the plot and also sent forces to secure them for its own purposes. In the time before the Battle of Hoth, multiple battles between Alliance and Imperial forces would occur on the moon's surface."}, {"tag": "p", "text": "Around six months after the Battle of Endor and after leaving the rebellion, Shara Bey and Kes Dameron settled down on Yavin 4 and planted the twig of a Force-sensitive tree on the moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yavin 4 first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy."}, {"tag": "p", "text": "The real-world location of Yavin 4 is the ruins of an ancient Mayan city at Tikal, Guatemala. Most of the shots of approaches to Yavin 4 from space are just repeats or copies of the Millennium Falcon approach in A New Hope, the only change being a ship replacement."}, {"tag": "p", "text": "Yavin 4 is erroneously listed as a planet in the 2016 reference book Star Wars: The Visual Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}