{"url": "Yavin_4_Incursion", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Disciples of Ragnos campaign", "Category:Battles of Yavin"], "nodes": [{"tag": "h1", "text": "Yavin 4 Incursion"}, {"tag": "p", "text": "The Yavin 4 Incursion took place in 14 ABY when the Disciples of Ragnos infiltrated Yavin 4 in attempt to drain Force energy from one of the Massassi temples and steal data from Luke Skywalker's records."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A group of Disciples of Ragnos, led by Tavion Axmis, landed in the jungle on Yavin 4. Among the group were also the Kothos twins. Their objective was to drain Force energy from a Massassi temple and store it into the Scepter of Ragnos."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "About the same time, the Yavin Runner II was arriving from Coruscant with new Jedi students on board. Among these students were Jaden Korr and Rosh Penin. Axmis seized the opportunity and shot down the Yavin Runner II which crashed several kilometers west of the Jedi Academy. Luke Skywalker then dispatched a shuttle and a rescue team of Jedi to pick them up. This served as a perfect diversion for Axmis's second objective. In the meantime, Alora, Axmis's apprentice, snuck into the Academy, sliced into Skywalker's personal records and stole data from it."}, {"tag": "p", "text": "During the crash, Korr and Penin were separated from the rest of the survivors and were instructed to make their way to the temple. On their way they had to fight a few howlers. When they arrived at the temple they spotted two stormtroopers. After Korr defeated them he was attacked by a Sith cultist whom he also defeated. He then approached the temple and interrupted Axmis while she was draining Force energy from the temple and she knocked him unconscious. By the time he was woken up by Kyle Katarn, the Disciples of Ragnos were already gone with their mission complete."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}