{"url": "Yavin_Prime/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Confederacy of Independent Systems planets", "Category:Galactic Alliance planets", "Category:Galactic Republic planets", "Category:Gordian Reach planets", "Category:High-gravity planets", "Category:Infinite Empire planets", "Category:Jedi planets", "Category:New Republic planets", "Category:Outer Rim Territories gas giants", "Category:Sith planets", "Category:Yavin system", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Yavin Prime"}, {"tag": "p", "text": "Yavin Prime, also known as Yavin (Yavin pronounced: YAH-vin), was a bright red gas giant in the Gordian Reach sector (part of the Bright Jewel Oversector)."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "It was located on the backward Gordian Reach, a hyperspace route from which the sector got its name. Yavin was best known for its moon, Yavin 4, which was the location of the Rebel Alliance's base prior to its discovery and near destruction in the Battle of Yavin. Of its overall total of 26, Yavin had two other moons that were habitable; Yavin 8 and Yavin 13."}, {"tag": "p", "text": "Yavin's atmosphere was made up of thick clouds swept about by violent, hurricane-force winds. Any craft that entered the atmosphere without the benefit of a tracking beacon would quickly become lost, its pilot disoriented by the buffeting winds. It was believed these storms lasted all the way to the surface without letting up. The immense atmospheric pressure was also something to contend with, and could easily crush an unprotected ship. It was for these reasons that Yavin was chosen as the initial location for disposing of the Imperial Sun Crusher superweapon. However, the Sun Crusher's superstrong hull proved resistant to Yavin's dense atmosphere and was quite space-worthy when later recovered by Kyp Durron."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Yavin system was conquered by the Rakata during the reign of their Infinite Empire, but later abandoned."}, {"tag": "p", "text": "After the Great Sith War, Yavin Station orbited the planet and was used for corusca gem \"fishing\" until it blew apart in 3956 BBY and crashed on Yavin 22. Shortly after the Battle of Yavin, Baron Orman Tagge constructed Achtnak Turbine Station, hidden within the gas giant, from which he launched TIE attacks on Massassi Station; Achtnak was destroyed by Luke Skywalker. Lando Calrissian later established GemDiver Station in the giant's orbit, for the \"fishing\" of corusca gems. GemDiver Station was attacked by the forces of the Shadow Academy."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the Yuuzhan Vong took Yavin along with the rest of the Yavin system in 26 ABY following the capture of the Jedi Praxeum."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly states that Yavin Prime is in the Sumitra sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}