{"url": "Yerj", "categories": ["Category:Legends articles", "Category:Barabel", "Category:Bounty hunters", "Category:Force-sensitives", "Category:Males", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Yerj"}, {"tag": "p", "text": "Yerj was a black-scaled Barabel male Force-sensitive bounty hunter and slave."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During his first years Yerj was a slave to a master he never met, in a place known as a \"training facility\" that might be intended for Force-sensitive children. Yerj suffered daily beatings apparently for anything he could do, and he spent the nights coughing blood or learning to stitch his own injuries. The following day, he would be beaten again if there was any blood in the bed or if the stitches were bent."}, {"tag": "p", "text": "Apparently, the beatings stopped when he was a teenager. By then, Yerj was big enough to start beating smaller children himself—with the weaker ones dying. He was so good at this, that he began training older children to beat the smaller children—again, with the weaker ones dying. As he grew, Yerj began training adults."}, {"tag": "p", "text": "At some point, at least two people tried to escape the training center. Yerj was assigned to stop them. He tracked the fugitives, brought them back and then killed them remorselessly. There might have been other missions after that one. Yerj proofed that he was good both physically and mentally, even developing some dark side abilities. He harnessed his own rage and was at the same time trustworthy, at some level content with his slave status. He was a frightful, seven foot tall presence with slit-red eyes. However, he was an easy bleeder, with his blood having trouble to coagulate."}, {"tag": "p", "text": "Around 31 BBY, Chevin slaver Phylus Mon was interested in Yerj and bought his contract. Phylus Mon injerted an explosive near Yerj's heart. The device would kill Yerj should Phylus Mon die for any reason. The bomb could be deactivated if hit by an ion weapon, but Phylus Mon did not allow any ion weapon in his ship, the Animiasma. This mechanism was a security measure that Phylus Mon used in every one of his slaves. At the same time, Phylus Mon paid his slaves and insisted in calling them employees—but at the same time, all of them knew they could not leave Phylus Mon's service or they would die."}, {"tag": "p", "text": "Yerj began working as a tracker and bounty hunter for Phylus Mon, although initially he had no direct contact with the Chevin. Yerj enjoyed his work, and the assignments were more important every time. For more than a decade, Yerj continued with it, becoming known in Phylus Mon's ranks."}, {"tag": "p", "text": "During this time, Yerj's hardest work was the hunt of a female Jedi. Although Yerj managed to kill her, he never really broke her. This technical victory haunted Yerj for the following years: He wanted to defeat the \"coward\" Jedi and proof that their light side was a mere excuse to justify their uselessness."}, {"tag": "p", "text": "In around 20 BBY, Phylus Mon decided to take Yerj in a mission to the Cularin system onboard the Animiasma (which she had never boarded before). Yerj was not informed of the details, but he was introduced the other members of the team. He despised all of them as inferior to him, although Yerj was respected and even liked by the others."}, {"tag": "p", "text": "Yerj and the other minions attacked the Almas Sith fortress in Cularin system. The fortress entrance was being protected by six Jedi, but Phylus Mon sent no less than thirteen minions, including his Wampa bodyguard Ku-Kak. Phylus Mon's team killed four of the Jedi and defeated the other two."}, {"tag": "p", "text": "In the fortress, Phylus Mon performed a Sith ritual to transform Yerj and the others in Sith battlelords: After a dangerous, life-threatening process, they were supposed to rise as powerful military commanders that could use Force powers to deal with insubordination of their troops. However, something went wrong with the ritual: Yerj and the other prospective Battlelords were stripped of their Force-essences, which would be stored in a large crystal."}, {"tag": "p", "text": "Phylus Mon left the fortress with the crystal, but without Yerj and the other empty bodies. Those bodies would then be found by a search team sent by the Jedi in the Almas Academy. The bodies were sent to the Academy. There, the Jedi tried their best to recover the lost essences and restore them to their previous state."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "One player character in A Mon Alone can, at a certain point, enter this non-player character's body and use Yerj's statistics until his essence can be freed (which means Yerj's essence re-enters Yerj's body and the PC's essence returns to the PC's inconscious body), or until Yerj's body is killed in action. The text explains that some of the final scenes are so dangerous that they could easily kill the player characters - leading to the players getting angry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}