{"url": "Yerbana", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Outer Rim Territories planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Yerbana"}, {"tag": "p", "text": "Yerbana was a terrestrial planet located in the Outer Rim Territories. In 19 BBY, during the Outer Rim Sieges of the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, a battle was fought on the world between the 501st Legion and 212th Attack Battalion of the Grand Army of the Republic, and the Separatist Droid Army. The battle resulted in a Republic victory after Jedi General Anakin Skywalker came to the aid of fellow Jedi General Obi-Wan Kenobi and the 212th. He managed to defeat the Separatists by faking a surrender and drawing out the super tactical droid that was leading the droid forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Yerbana was a terrestrial planet in the Outer Rim Territories. It had an atmosphere that was breathable to humans. Yerbana's surface was partially covered in fog and had oceans; rocky landmasses covered in green vegetation; and large, deep chasms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Outer Rim Sieges of the Clone Wars between the Galactic Republic and the secessionist Confederacy of Independent Systems, in 19 BBY, Yerbana was the site of a battle. The fighting took place on the planet's surface and in its atmosphere and was between the forces of the Grand Army of the Republic's 501st Legion and 212th Attack Battalion, and the Separatist Droid Army. The Battle of Yerbana was fought on multiple fronts, with the 501st, under the leadership of Jedi General Anakin Skywalker, and the 212th, under Jedi General Obi-Wan Kenobi, fighting separately. Eventually, Skywalker and the 501st were victorious in their engagement and moved to assist Kenobi and the 212th, who were struggling to make advancements on a large bridge outside a nearby city."}, {"tag": "p", "text": "Upon arrival on the bridge, Skywalker informed Kenobi that the 501st had come to his aid and teased him for hiding behind cover while the inhabitants of the nearby city suffered at the hands of the Separatists. Skywalker's plan started with him calling for a ceasefire and declaring surrender to the droid forces in an attempt to draw the enemy's super tactical droid into the open. Meanwhile, Clone Captain CT-7567, nicknamed \"Rex,\" led clone jetpack troopers of the 501st underneath the bridge."}, {"tag": "p", "text": "After the tactical droid appeared in the open, having come out to see why the droid army had ceased fire, Skywalker pulled the droid toward him with the Force and decapitated it with his lightsaber. The clones underneath then proceeded to activate their jetpacks and fly up over the bridge, flanking the droid army on both sides. The Republic's forces quickly defeated the droid army, and Skywalker and Kenobi were soon called back to a Venator-class Star Destroyer to receive a communication from the former Jedi Ahsoka Tano."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Yerbana was home to a city with towering skyscrapers. On the outskirts of the city, a massive bridge stretched over a deep chasm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yerbana was first pictured in the official trailer for Season Seven of the animated television series Star Wars: The Clone Wars, which was released on January 22, 2020. The planet first appeared in \"Old Friends Not Forgotten,\" the season's ninth episode, which was released on April 17, 2020 on Disney+. Concept art for Yerbana was created by Andre Kirk, while the planet's lighting concept was done by Molly Denmark."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}