{"url": "Betrayed", "categories": ["Category:Real-world articles", "Category:Star Wars: The Old Republic cinematic trailers"], "nodes": [{"tag": "h1", "text": "Betrayed"}, {"tag": "p", "text": "Betrayed is the fifth cinematic trailer released by BioWare for the video game Star Wars: The Old Republic, and serves as a reveal trailer for the Knights of the Eternal Throne. Released on October 7, 2016, the video depicts the story of Vaylin. The video runs at six minutes and nine seconds."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Senya Tirall carries her daughter Vaylin out of the asylum on Nathema. She gazes into her daughter’s face and remembers a scene from when Vaylin was a little girl. Young Vaylin plays with her mother in a forest on Zakuul, and she finds a small branch that resembles an animal. The two return to the capital city, where Vaylin holds the carved toy in the air with the Force, but Senya stops her and ties it to her hand."}, {"tag": "p", "text": "With the toy strapped to her arm, Vaylin joins Senya as her twin brothers Thexan and Arcann fight the Knights of Zakuul in an arena. She wishes to be in the arena for herself and tries to use the Force to move an old suit of armor from one of the Knights when she is alone in the woods. The armor doesn’t budge, and Vaylin screams, releasing a shockwave that resonates through the forest."}, {"tag": "p", "text": "A few years later, Vaylin fights with the Knights in the arena. She is knocked down but dusts herself off as Senya tells them to begin again. The lead Knight charges her, but Vaylin uses the Force to suspend him and the others in the air. She concentrates, causing the Knight’s armor to crack. Senya stops her and examines the Knights, who fell when Vaylin stopped concentrating, and they both look nervously at Valkorion."}, {"tag": "p", "text": "Valkorion takes Vaylin to an asylum on Nathema, where he plans to have the Nathema Zealots restrain her powers so that she will not surpass his own. Vaylin is locked away on Nathema for years, and the Zealots shave her hair and place tattoos on her arms to make her permanently darker. Senya has a vision of Vaylin’s suffering and secretly travels to Nathema to rescue her daughter. They are confronted by a party of Knights on a bridge outside the asylum, and Senya kills them before beckoning Vaylin to join her. Vaylin refuses, and Valkorion arrives with the Zealots. Senya is captured by the Knights and taken away from Nathema."}, {"tag": "p", "text": "Several years into the future, Senya explores a devastated field on Ord Mantell, using her lightsaber to see in the dark. The field is full of dead Knights, and Vaylin’s old toy is lying in a puddle. Senya sees a darkly clad figure approaching from a distance and readies herself for a fight, and the figure uses the Force to engulf the field in fire. Senya’s lightsaber is yanked away, and she grans one from a dead Knight just before Vaylin attacks her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}