{"url": "Yeppau", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Criminals", "Category:Males", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Yeppau"}, {"tag": "p", "text": "Yeppau was a Toydarian who served as one of the Hutt crime lord Graballa's henchmen during the Galactic Civil War. He accompanied Graballa on his quest to find the Kyber Saber crystals."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Enter Rowan"}, {"tag": "p", "text": "Yeppau served the Hutt crime lord Graballa, who ran an ore mine in the Belgaroth asteroid field. Following the Battle of Hoth, Yeppau held a poster while Graballa corresponded with his wealthy cousin Jabba via hologram and attempted to obtain start-up funds for his beachside resort and bufffet. Jabba refused to help his cousin's business venture."}, {"tag": "p", "text": "Yeppau was present aboard Graballa's flagship Rancor's Fist when Graballa held an audience with the Force-sensitive boy Rowan Freemaker and his B1-series battle droid Roger. Rowan had obtained the second Kyber Saber crystal from the Belgaroth mine but refused to help Graballa obtain more. Yeppau witnessed Rowan's older siblings Kordi and Zander, and the undercover Sith agent Naare's successful attempt to rescue Rowan and Roger."}, {"tag": "h3", "text": "Race for the Kyber Saber"}, {"tag": "p", "text": "Later, Yeppau held up a second poster while Graballa made a second attempt to convince Jabba to loan him money to build his beachside resort and buffet. However, Jabba rejected his proposal a second time. When Graballa asked how his presentation went and whether it could be better, the Toydarian replied yep. After the bounty hunters Dengar, Baash, and Raam returned with information on Rowan and his family, Graballa set up a trap for the Freemakers on the planet Tatooine. Yeppau accompanied Graballa's henchmen when they confronted the Freemakers at a derelict sandcrawler in the Dune Sea."}, {"tag": "p", "text": "Yeppau accompanied his master to the Freemaker Garage where they discovered that the Freemakers had escaped. Instead, they met the Sith agent Naare who agreed to help Graballa track down the Freemakers in return for sharing the Kyber Saber crystals. Yeppau was present aboard Rancor's Fist after Naare stole the fifth Kyber Saber crystal from Rowan on the ocean planet of Ningoth. During the pursuit, the fleeing Freemakers' ship StarScavenger generated a wave that flooded the ship's engines with seawater."}, {"tag": "p", "text": "Yeppau was aboard the Rancor's Fist while Graballa and Naare waited to hear a signal from the Freemakers. The Freemakers had discovered that Naare had been tracking their movements using Roger's transmission pack and had switched off. After Roger reattached the transmission pack during an attempt to save the Freemakers and Jek-14 on the junkyard planet Zoh, Graballa and Naare traveled there. They then raced the Freemakers to the ice planet of Hoth where the seventh Kyber Saber crystal had been hidden."}, {"tag": "p", "text": "After the Rancor's Fist crash landed on Hoth, Yeppau helped Baash and Raam to dig out the massive starship from the snow. Yeppau was later present when Graballa and Naare confronted Rowan, who agreed to surrender the seventh Kyber Saber crystal in return for safe passage for his family. However, Rowan had swapped the crystal with an ice shard. As a result, Naare was unable to reforge the Kyber Saber."}, {"tag": "p", "text": "Following the debacle on Hoth, Yeppau agreed with his master Graballa's remarks that they should give an angry Naare some time to herself. Yeppau kept Graballa informed about the efforts of his spies to find the Freemakers. After the Kubaz Garindan reported Zander and Kordi's presence on Tatooine, Yeppau informed Graballa. The Hutt was initially upset that Garindan had not sighted Rowan. However, Naare then came up with a plan to lure Rowan out of hiding by hurting his family. While this plan worked, Naare then turned on Graballa and his henchmen and used the Force to drive them out. Later, Graballa captured Naare and froze her in carbonite as punishment for her treachery. He was seen helping Baash and Raam to erect Naare's frozen body."}, {"tag": "h3", "text": "The Embersteel entanglement"}, {"tag": "p", "text": "When Graballa visited the Mygeeto Auction House in an attempt to find wealthy investors for his beachside resort and buffet, Yeppau along with Baash and Raam escorted the Hutt crime lord there. While Baash and Raam mingled in the food court, Yeppau accompanied Graballa to the luxury terrace. Yeppau and Graballa soon encountered Kordi, who was impersonating the Clawdite princess Alo Kortessi."}, {"tag": "p", "text": "While Yeppau held up a datapad, Graballa tried to convince \"Kortessi\" to invest in his resort. Kordi took the opportunity to slip away. When Graballa asked if she was not coming back, Yeppau indicated this was so and Graballa tried to sell his beachside venture to the other nobles. Yeppau presumably returned with Graballa and his entourage to the Rancor's Fist after Baash and Raam accidentally bought a Theta-class H-2 executive star shuttle."}, {"tag": "h3", "text": "Trapping Rowan"}, {"tag": "p", "text": "Later, Yeppau accompanied Graballa and his other minions who were mining a planet in order to obtain kyber crystals for the Empire's second Death Star. After Darth Vader confronted Graballa for his lack of progress, Graballa confided about his parlous state with Yeppau, telling him that they needed a new scheme. Yeppau then passed Graballa the Freemakers' business card, giving the Hutt the idea to use Rowan to lead them to more kyber crystals."}, {"tag": "p", "text": "After receiving a tip-off from Furlac, Graballa captured the Freemakers at the Wheel, seeking to collect an Imperial bounty on Rowan. Yeppau accompanied Graballa and his minions, which included the bounty hunters Dengar, Bossk, IG-88, and 4-LOM. However, the Freemakers managed to escape after Kordi engineered a fight between the organic and droid bounty hunters."}, {"tag": "h3", "text": "Meeting with Lord Vader"}, {"tag": "p", "text": "Prior to the Battle of Endor, Yeppau accompanied Graballa when the Hutt delivered a shipment of kyber crystals from Jedi Master Baird Kantoo's crystal planet to Lord Vader aboard the second Death Star. When Graballa tried to entice Lord Vader to invest in his beachside resort, Yeppau presented pictures of the hologram. However, Lord Vader hurled Graballa against the wall."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yeppau was a green-skinned Toydarian male with orange eyes and a pair of wings. He was present at his master's side and his work included holding up posters. Yeppau was only known to utter \"Yep\". His other duties including digging the Rancor's Fist out of the snow on Hoth and helping Baash and Raaam to erect Naare's frozen body onto Graballa's throne room wall."}, {"tag": "p", "text": "Yeppau remained loyal to his master, accompanying him to an auction on Mygeeto, the Wheel, and the second Death Star. Yeppau suggested that Graballa hunt down Rowan during a bleak time in the Hutt crime lord's fortunes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yeppau was voiced by Danny Jacobs in the LEGO Star Wars: The Freemaker Adventures who also voiced Raam in the same series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}