{"url": "Yendor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance Military enlisted personnel", "Category:Corona Squadron personnel", "Category:Males", "Category:New Republic Defense Fleet officers", "Category:Resistance members", "Category:Rutian Twi'leks", "Category:Ryloth residents"], "nodes": [{"tag": "h1", "text": "Yendor"}, {"tag": "p", "text": "Yendor was a Rutian Twi'lek male pilot who fought for the Alliance to Restore the Republic and later the New Republic as a member of Corona Squadron. He held the rank of private. He later served in the New Republic as an emissary to the senate from his homeworld of Ryloth, when he informed the Senate about the Nikto crime lord Rinnrivin Di's cartel, that was threatening Ryloth's external trade. As a result, Senators Leia Organa and Ransolm Casterfo traveled to the planet Bastatha to investigate and discovered that Yendor's concerns were valid. Later, Yendor hosted Leia when she and her team visited the Ryloth archives to look for information on Rinnrivin and his cartel."}, {"tag": "p", "text": "Yendor retired as a politician and became a scholar, starting a family during this time and becoming the father of Charth and Hahnee Brethen. He eventually became a grandfather when Charth had two children of his own. He was transferred by the newly formed Ryloth Defense Authority to a remote base away from Lessu, Ryloth's capital. Yendor provided shelter for Leia and the Resistance when they arrived on the planet, assisting them in their operations with his two children. When the First Order began attacking the base, Yendor covered their escape and led them off-world."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "After joining the Rebel Alliance, Yendor was posted to Echo Base on the frozen planet of Hoth. Five days after arriving at Echo Base, Yendor encountered the protocol droid C-3PO while re-calibrating the base's thermal units. In addition, Yendor cleaned out the tauntaun stalls at the base; a task which he found unpleasant and smelly. During the Battle of Hoth, he served as the former TIE fighter pilot and the Imperial defector Thane Kyrell's gunner aboard a snowspeeder. Following Luke Skywalker's cue, the Rebel pilots used their harpoon guns to topple several Imperial AT-AT walkers. Yendor and Thane were among the rebels that escaped the Imperial assault and fled offworld."}, {"tag": "p", "text": "As a member of Corona Squadron, Yendor flew under the callsign \"Corona Two\" piloting the T-65B X-wing starfighter during various engagements with Imperial TIE fighter squadrons. After Thane admitted that he had met his lover Ciena Ree, an active Imperial Navy Lieutenant Commander, on the planet Jelucan, Yendor joined his comrades in expressing their dismay. When Yendor suggested that the \"Imperial woman\" would have killed them, Kyrell defended his actions and stressed that none of his wing mates were endangered."}, {"tag": "p", "text": "Yendor and his fellow pilots later flew in a dogfight in the Hudalla system, narrowly escaping an Imperial ambush. Yendor later participated in the Battle of Endor, a major victory for the Rebellion that ended in the deaths of Emperor Palpatine and Darth Vader. Yendor continued his service after the Rebel Alliance was transformed into the New Republic. After the Contessa left Corona Squadron to stand for the presidency on her homeworld, Yendor took over the position of Corona Leader, defending the Mid Rim planet of Naboo from invading Imperial forces."}, {"tag": "p", "text": "After driving off a third Imperial attack on Naboo, Yendor invited his fellow pilots to visit the Gungan city of Otoh Gunga to try out a local dessert that took four hominids to eat and was reputed to induce its consumers into a sugar coma. However, Thane declined because he was still mourning for Ciena, whom he believed had perished during the Battle of Endor. During the Galactic Civil War, Yendor spoke to Princess Leia Organa at least a dozen times and the two became acquaintances."}, {"tag": "h3", "text": "Return to Ryloth"}, {"tag": "p", "text": "In the year 5 ABY, Yendor fought along with a rebel group against Imperial remnants on Ryloth. His group was one of the first to discover the Empire had abandoned their garrisons on the planet, and that Ryloth had regained its independence. Yendor was then elected as Ryloth's ambassador to the still forming New Republic. After the New Republic relocated its capital to Nakadia, Yendor was spotted by the former Imperial loyalty officer Sinjir Rath Velus chatting with Senator Nim Tar."}, {"tag": "h3", "text": "Representing Ryloth"}, {"tag": "p", "text": "Following the end of the Galactic Civil War, Yendor continued to serve as Ryloth's emissary for the following twenty-four years. While Ryloth did not join the New Republic, the planet still traded with the new galactic government. About six years before the destruction of the Hosnian system, Ryloth's offworld trade and economy was threatened by the smuggling operations carried out by the Kajain'sa'Nikto crime lord Rinnrivin Di's cartel. In response, Yendor was dispatched by his government to the Galactic Senate on Hosnian Prime to appeal to the Republic for help."}, {"tag": "p", "text": "During a Senate hearing, Yendor stressed that the New Republic had pledged to ensure that organized crime would not become as powerful as during the Age of the Empire. While the Republic had promised financial regulations and comprehensive patrols of the shipping lanes, these regulations were only enforced sporadically and no patrols had been dispatched to Ryloth for the past twenty years. Yendor's report was greeted with apathy from several Centrist and Populist senators, who questioned the accuracy of his information and insisted that the Senate had no jurisdiction because this was an intrasystem matter."}, {"tag": "p", "text": "However, the Populist Senator Organa and her Centrist colleague Ransolm Casterfo agreed to investigate Rinnrivin's cartel on behalf of the Galactic Senate. Their mission took them to Bastatha where they discovered that Rinnrivin maintained a base on the subterranean world. As their investigation continued, Organa's pilots Joph Seastriker and Greer Sonnel discovered that Rinnrivin's cartel had links to a paramilitary group called the Amaxine warriors."}, {"tag": "p", "text": "Yendor later greeted Leia when she and her entourage including C-3PO visited Ryloth to search the planet's archives for information about Rinnrivin. Upon receiving Leia, the two former comrades chatted about their time at Echo Base and Corona Squadron. Yendor also greeted C-3PO, whom he recognized from his Echo Base days. After meeting Joph and Greer, Yendor led his guests to the archives, which consisted of paper scrolls and documents. There, the New Republic officials discovered that Rinnrivin was a minor spice broker who had inexplicably become the leader of a major crime syndicate in the past seven to ten years. Later, Leia and Casterfo discovered that a mysterious entity was using Rinnrivin's cartel and the Amaxine warriors as proxies to destabilize the New Republic."}, {"tag": "h3", "text": "First Order–Resistance war"}, {"tag": "h4", "text": "Meeting an old friend"}, {"tag": "p", "text": "By 34 ABY, after the formation of the Ryloth Defense Authority, Yendor and his people were transferred from Ryloth's capital city, Lessu, to a remote desert base as a contingency plan for future attacks on the capital. He started a family of his own, becoming the father of Charth and Hahnee Brethen, with Charth eventually having two children of his own. He left behind his career as an emissary and became a scholar, aiming to preserve Ryloth's history in his library."}, {"tag": "p", "text": "Days after the Resistance's crippling loss to the First Order at the Battle of Crait, he was visited by his old friend Leia, escorted by his children. The two exchanged greetings and caught up on what they were doing since the last time they met, and later began discussing the Resistance and the assistance they required. Yendor stated that Ryloth could not break its neutrality in the ongoing conflict, but Leia clarified that they only needed a safe haven for a short period of time as their only available ship was the Millennium Falcon. She then informed him of Luke's passing, and how the Resistance's numbers dwindled greatly, confirming the rumors he had heard earlier. Realizing that the Jedi were extinct, Yendor was then assured by Leia that their future was secure while eyeing Rey, who promptly introduced herself to the Twi'lek. Yendor praised the girl's skills, reminiscing about his days as a pilot in the Rebellion."}, {"tag": "p", "text": "Leia continued to discuss terms with Yendor, but was interrupted by Charth, who pointed out that they did not have the facilities necessary to accommodate hundreds of fighters, but was told they would only need to house the Falcon. After some thought, Yendor decided to discuss the decision with the government in the capital, but stated that Chancellor Drelomon and General Ishel would oppose them, and warned Leia of the consequences if the First Order discovered them. Charth voiced his concerns, claiming that housing the Resistance as refugees would not be enough convince the First Order, but Yendor held his stance, stating that his days as a freedom-fighter had not concluded yet. He offered Leia a lavish room within the RDA's headquarters, but she declined and instead resided in the Falcon."}, {"tag": "h4", "text": "Preparations"}, {"tag": "p", "text": "When the First Order entered Lessu, Yendor dispatched his daughter to find out the reason for their sudden appearance, discovering that they were on a diplomatic mission. After hearing back from Hahnee, he immediately informed Leia of the urgent situation that had developed during her stay. He entered the Falcon with her permission and informed her of the First Order's presence, explaining that the Resistance had less than five days before the Chancellor made a decision. The Twi'lek assured her that he would do everything in his power to buy them enough time. He also revealed that the following day would be the Twi'lek holiday, the Longest Night, which would create an opportunity to bring in the additional Resistance ships with ease."}, {"tag": "p", "text": "After the remaining Resistance forces had arrived, Yendor's library was converted into a war room. While they planned a series of operations on various worlds, he thanked everyone in the room for their bravery in standing against the First Order, remembering how Ryloth once stood against tyranny during the Clone Wars. When Maz Kanata contacted them and provided a partial list of prisoners, one name stood out to Yendor and Leia, an individual with the initials \"R. C.\" They speculated that the individual could in fact be their old ally Ransolm Casterfo, who was imprisoned on Corellia. With the teams embarking on their respective missions, he stayed behind with Leia, monitoring their operations while his son Charth traveled to Corellia with Poe Dameron, Suralinda Javos, and Finn. After they had left, the two discussed how royalty always felt imposing on their peace. Leia commented that her presence had the same effect. The conversation was interrupted when he pointed out that Rey had been waiting to speak with her. Tensions suddenly rose when the proximity alarm was activated, with Yendor alerting everyone to the First Order's presence, who had discovered the Resistance and began attacking the base."}, {"tag": "h4", "text": "Escaping Ryloth"}, {"tag": "p", "text": "During the attack, Hahnee lost her life while warning everyone that the government had revealed the Resistance's location. Yendor defended the southern end of the base's hangar with a number of RDA fighters, covering Leia and her team's escape to their respective vessels. After everyone had successfully boarded their ships, Yendor contacted her through a comlink while ordering two men to head to the surface-to-air cannon and fend off the First Order. Leia, with a heavy heart, informed the Twi'lek of her daughter's death. After a brief period of silence, Yendor acknowledged the fact. Leia stated that she died valiantly, to which Yendor replied stating that valiant deaths did not exist, only death in its purest form. After she confirmed his grandchildren's safety, he ordered her to reunite them with their father. Leia later contacted Yendor again offering him to fly an X-wing and replace a Phantom Squadron pilot that died in the attack. He agreed and headed towards her position, terminating their communication. After everyone was accounted for, Yendor and the other X-wing pilots led the Resistance ships off the planet. Following their escape from Ryloth, Yendor and Orrimaarko prepared assignments for prisoners who were rescued from Corellia."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yendor was first and foremost a pilot, and far more comfortable in that role than as a soldier or any kind of general. However, he firmly believed in the Rebellion's cause, and was willing to do whatever was required of him to help defeat the Empire. As a dedicated rebel pilot, Yendor despised the Galactic Empire and failed to understand his squadron mate Thane Kyrell's love for the Imperial officer Ciena Ree. Yendor regarded his fellow Corona Squadron pilots including Thane as friends and once invited them to try out a Gungan dessert following the Naboo Sieges."}, {"tag": "p", "text": "Yendor was initially reluctant to serve as an ambassador, but ultimately acclimatized well to the role, passionately defending Ryloth's rights in the Galactic Senate. As Ryloth's emissary, Yendor was concerned with advancing his planet's independence and economic interests. He viewed Rinnrivin Di's cartel as a threat to Ryloth's independence and well-being. Despite the passage of time, Yendor had a good memory and could recall meeting fellow rebel veterans like Senator Organa and C-3PO during the Galactic Civil War."}, {"tag": "p", "text": "After reuniting with his old friend Leia, Yendor was initially reluctant to provide refuge to the Resistance. She reminded him that he was once a rebel, but he replied stating that though he was still a rebel deep down in his heart, he explained that he had a duty to protect his people, including his family. After she convinced him that they only needed temporary shelter, he became sympathetic to the their cause and dedicated his time and effort in assisting them during their stay on the planet, taking part in planning future operations. Yendor firmly believed that death existed in its simplest form without valiance, even after hearing the news of his daughter's death. Despite his old age, he did not hesitate to pilot an X-wing again when offered the chance by Leia."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Yendor was a skilled pilot and gunner, and a competent leader, despite his reservations. He also grew into an effective diplomat as a member of the New Republic senate, convincing at least Princess Leia of the threat posed by Rinnrivin Di. After becoming a scholar, Yendor dedicated the remainder of his life to preserving Rylothian history. Decades after the Galactic Civil War had ended, he was still able to pilot an X-wing, leading Resistance ships as they escaped Ryloth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yendor first appeared in Lost Stars, a young adult novel written by Claudia Gray as part of Journey to Star Wars: The Force Awakens and was first pictured in the novel's webcomic adaptation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}