{"url": "Yinchorri_embargo_act", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Republic laws and acts", "Category:Yinchorri culture"], "nodes": [{"tag": "h1", "text": "Yinchorri embargo act"}, {"tag": "p", "text": "The Yinchorri embargo act was a measure passed by the Galactic Senate in 33 BBY."}, {"tag": "p", "text": "When the Yinchorri joined the Galactic Republic a generation before the Battle of Naboo, they became voracious technophiles, being driven to achieve, buy, or steal as much advanced technology they could get their hands on. As they were also extremely aggressive, their theft of much high-grade military equipment (such as starships from the Golden Nyss Shipyards and cortosis armor) made them potential threats to long-lasting peace of the galaxy."}, {"tag": "p", "text": "Following the news of a Yinchorri attack on Mayvitch 7 in 33 BBY, Supreme Chancellor Finis Valorum had Mace Windu dispatch two Jedi, Jedi Knight Naeshahn and her Padawan, Ebor Taulk, to Yinchorr as negotiators. Several days later, their mutilated bodies were deposited on Valorum's doorstep."}, {"tag": "p", "text": "The Jedi Council sent an investigative team to the Yinchorri system while Valorum began negotiating for a trade and technological embargo on the system with other senators. Due to the influence of both Palpatine's dark side powers and political machinations, the deliberations took much longer than either Valorum or the Jedi expected."}, {"tag": "p", "text": "After calling in every favor Valorum was owed since 38 BBY and making concessions to a group of leading senators Valorum managed to get the Senate to vote to approve the sanctions, as well as dispatch four Judicial Forces attack groups to the Yinchorr system to end the uprising."}, {"tag": "p", "text": "After receiving their concessions from Valorum, the measure received the support of Tikkes, Onaconda Farr, Yarua, Bail Antilles, Com Fordox, Horox Ryyder, Tendau Bendon, Mot-Not Rab, and Palpatine. Opposing the measure were Orn Free Taa, Connus Trell, Chom Frey Kaa, Toonbuck Toora, Edcel Bar Gane, and Po Nudo."}, {"tag": "p", "text": "His responsibility in the deaths of the Jedi during the uprising, the slow reaction from the Senate, and the using up of his political capital in passing the Act left Valorum's administration stagnant, and was the first step down the path that resulted in him being removed from office the next year."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}