{"url": "Yevethan_Purge", "categories": ["Category:Legends articles", "Category:Battles of the Black Fleet Crisis", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Yevethan Purge"}, {"tag": "p", "text": "The Yevethan Purge, also known as the Cleansing or Great Purge, was an act of xenocide carried out by the Duskhan League in 16 ABY. A highly xenophobic species, the Yevetha aimed to exterminate the \"vermin\"—all non-Yevethan sentient life—from the Koornacht Cluster by military force. To keep the Purge quiet, Nil Spaar sparked a political crisis in the New Republic. While the galactic media covered the scandal on Coruscant, Yevethan warships began their missions in the isolated Koornacht Cluster."}, {"tag": "p", "text": "The purge was primarily carried out by the Imperial warships of the former Black Sword Command and saw virtually no casualties on the side of the attackers; the sole fatalities among the Yevethans were a starfighter pilot who was shot down by Plat Mallar while flying one of Polneye's six TIE/IN interceptors, and a weapons master who committed ritual suicide to atone for the \"failure\" that allowed the pilot to die. The sole survivor was Plat Mallar whose testimony of the events on Polneye helped sway public opinion in favor of military intervention against the Dushkan League."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Due to its remote location in the Deep Core in the anomaly-ridden space west of the galactic capital Coruscant, the Koornacht Cluster had been sparsely settled throughout the millennia and had little strategic importance. Approximately 2,000 star systems made up the cluster, which was named after Aitro Koornacht, a palace guard on Tamban who befriended the astronomer that first discovered it. Despite this high concentration of star systems, only a hundred or so planets bore life and only six produced sentient lifeforms, with the most notable being the Yevetha."}, {"tag": "p", "text": "A relatively young species, the Yevetha had developed their civilization in isolation from other sentients. The combination of their rapid evolution, isolation, and the harsh environment of N'zoth, produced a culture of xenophobia. This also established an internal concept of superiority. Following the Clone Wars, the young Galactic Empire expanded into the previously untouched Cluster and subjugated N'zoth and its nearby star systems. The Yevetha were enslaved by the Imperials, who stationed the naval forces of the Black Fleet and its support facilities, which together were known as the Black Sword Command, in the cluster along with several shipyards."}, {"tag": "p", "text": "Driven by humanocentrism and the need to strike fear into subjugated peoples, the Imperial colonial masters committed numerous torturous atrocities. The Imperial Governor of the Cluster took several females as pleasure slaves for his staff, and gave the males to his stormtroopers for target practice. The mutilated bodies were then put on display at schools and sacred sites. They were also broadcast on public information channels that all Yevetha were forced to watch twice a day. When subjugation was not working as well, children were taken from their parents."}, {"tag": "p", "text": "However, many Yevetha used their enslavement to learn much about the art of ship building. After several years of Imperial rule, they began plotting a rebellion, of which Nil Spaar of the Spaar clan was one of the leaders. In his tenure, he put an end to quiet acts of sabotage, encouraging the Yevetha to cultivate the trust of the Empire so they could turn on them later. Eventually, after the Yevetha had the virtual run of the shipyards, Spaar had his chance."}, {"tag": "p", "text": "Eight months after the Battle of Endor, in which Palpatine was killed and the Empire began a slow decline, the Yevetha seized the moment. The Imperial fleet at the shipyards was undermanned and poorly defended, with many of the ships incomplete or damaged—a perfect opportunity for a surprise insurrection. Imperial forces in the Koornacht Cluster were being withdrawn to assist in the defense of the Core Worlds, and security was lax, so much so that Spaar knew the circumstances, procedure, and schedule of the supposedly sudden Imperial departure."}, {"tag": "p", "text": "The Imperial Commander Jian Paret was ordered to retreat and destroy the repair yard. Before they could initiate their withdrawal, the Yevetha under the leadership of Nil Spaar and his second-in-command Dar Bille seized control of the vessels undergoing repairs, the operational warships and the yards. The Yevetha repeated their operation across the Black Fleet and took command of the entire armada. The Intimidator, the largest of the ships captured, they renamed the Pride of Yevetha. All Imperials were killed or enslaved, with 300,000 prisoners held on the moon Pa'aal ."}, {"tag": "p", "text": "On a strategic level, the Yevethan Uprising brought the Koornacht Cluster fully under Yevethan control. Spaar became very popular for his actions, and not long afterwards, he killed Viceroy Kiv Truun of the Duskhan League, becoming viceroy himself. Spaar became known as the darama, the chosen one of the Yevetha. As viceroy, his rule over the Duskhan League of all Yevethan worlds was nothing short of autocratic."}, {"tag": "p", "text": "Some time after the Yevetha took control of the Imperial vessels, Spaar toured the outer regions of the Koornacht Cluster in the Beauty, a captured Imperial CR90 corvette. The trip was enlightening to Spaar, who realized how close outsiders were to Yevethan settlements, as well as the extent of galactic development near the Koornacht Cluster."}, {"tag": "p", "text": "Over the next decade and a half, the Yevetha developed their technical capabilities, developed advanced technologies in the form of starship shielding, gravity bombs, Aramadia-class thrustships and D-type fighters. More importantly, they established the Duskhan League, which grew to encompass thirteen worlds."}, {"tag": "h3", "text": "Deception as Foreign Policy"}, {"tag": "p", "text": "In 16 ABY, the Dushkan League came out of its isolation to engage the New Republic, which was enjoying a period of peace marked by increased member applications, economic prosperity and military innovation, as well as the development of a bloated and divided bureaucracy. A delegation led by now-Viceroy Nil Spaar arrived at Coruscant, supposedly to seek a peaceful coexistence. Given their xenophobia and view of all non-Yevethan species as 'Vermin' however, it is more likely that they were there on a mission to sow confusion and disruption prior to their planned war of extermination."}, {"tag": "p", "text": "Using the New Republic's lack of intelligence on the Dushkan League and Senatorial political infighting to his advantage, Nil Spaar extended his negotiations with Chief of State Leia Organa Solo over a period of weeks. Pressured by military and intelligence advisors who sought answers, and potentially an ally against the Core Imperial strongholds, Organa Solo entered the discussions, only to find herself on the receiving end of a political plot to throw the New Republic into confusion. During this period he played into her empathy towards a species subjugated by the Empire, allowing him to cultivate assets on Coruscant."}, {"tag": "p", "text": "Unfortunately (or fortunately perhaps for the Yevetha), the Commander of the Fifth Fleet, General A'baht had sent astrographic survey ships to the areas around that of the Dushkan League. The New Republic had lacked accurate Star Charts of the Deep Core areas formerly belonging to the Empire, a fact which had made the General uncomfortable in the Fifth Fleet's search for the missing Black Fleet. The fleet itself, and the Astrogator-class probe Astrolabe, were searching outside the space claimed by the League, but that did not stop the Yevethan warship Purity from destroying the unarmed surveying ship, claiming it had violated their space."}, {"tag": "p", "text": "Spaar used this as his opportunity to set off a series of political machinations that sowed confusion amongst the New Republic. First, he accused Organa Solo of \"warmongering\" and begged for the Yevetha to be left in peace. Weary of going to war, many New Republic citizens expressed outrage towards the Chief of State and several member worlds even went as far as submitting articles of withdrawal. With the diplomatic outcome a complete catastrophe, Leia ordered the Fifth Fleet to return from the Falax sector to Coruscant—leaving the Black Fleet now completely unhindered to carry out Spaar's plans."}, {"tag": "h3", "text": "Initiating the Cleansing"}, {"tag": "p", "text": "Having departed from Coruscant following a political barrage with Chief of State Organa Solo, Nil Spaar arrived back in the Koornacht Cluster aboard the consular vessel Aramadia. Upon arriving, it was greeted by the Yevethan Super Star Destroyer Pride of Yevetha. After three transfers by ferry to the Pride, Nil Spaar himself arrived onboard the warship escorted by his honor guard and Proctor Vor Duull. He was immediately greeted by Proctor Dar Bille who informed the Viceroy that he had mustered the Black Fleet ready for combat."}, {"tag": "p", "text": "By 16 ABY, the Black Fleet consisted of 25 Imperial-designed starships of various classes. However, the experimental test-bed EX-F was unavailable for combat since its intricate propulsion system was a constant frustration to the Yevetha. Earlier, Bille himself had seen to the execution and replacement of the Proctor of the Dreadnaught-class heavy cruiser Blessings for incompetence."}, {"tag": "p", "text": "During a rousing speech to the crew of the warships, Spaar declared the Koornacht Cluster as the sole preserve of the Yevetha and ordered the \"cleansing of all vermin settlements\" within the vicinity of that region. Second-in-command Dar Bille then personally dispatched the Black Fleet to do his master's command. The assembled warships dispersed across the Cluster to carry out their task of exterminating the thirteen non-Yevetha colonies."}, {"tag": "p", "text": "In the first hours of the Cleansing, the cruiser Star Dream was dispatched against the small Brigian mining colony of New Brigia on the edge of the Cluster. The cruiser first landed a force of Yevethan soldiers in dropships, who massacred the settlers including the miner Negus Nigekus. Several miners at Pit 4 committed ritual suicide by throwing themselves at the blasters of the Yevethan troops."}, {"tag": "p", "text": "After the resistance had been destroyed, a broad-hulled cargo shuttle landed to seize the chromite ore and processing machinery. Less than an hour after it had landed, the shuttle took off again and moved away as the Star Dream sterilized the settlement with salvos from its heavy batteries. Its mission complete, the cruiser returned through hyperspace to N'zoth with a cargo of plundered chromite."}, {"tag": "p", "text": "However on J't'p'tan, the Force-sensitive Fallanassi sect received a vision of the impending genocide through the White Current. Under the directions of their leader Wialu, they protected themselves, the H'kig and their temple by creating the illusion that the temple had already been destroyed, and there was nothing left to kill. The Yevethan ships thus passed over the target."}, {"tag": "h3", "text": "Resistance on Polneye"}, {"tag": "p", "text": "The most populous world within the Cluster was the former Imperial military port world of Polneye which was home to 300,000 sentients of various species. Its government was a small nation state of eight consolidated cities including Nine South, Eleven North and the ghost town of Fourteen North. Three Black Fleet warships under the command of Proctor Jip Toorr were tasked with the assault on Polneye: Devotion, Honor and Liberty'."}, {"tag": "p", "text": "Upon arrival, a sensor-scrambling atmospheric ionization field was detected by the Yevethan warships, preventing accurate bombardment of surface installations. To ensure timely completion of their mission, a trio of TIE/rc starfighters were launched as spotters. Ground-based traffic control systems detected the TIE/rc scouts, but the local denizens were unaware of their purpose."}, {"tag": "p", "text": "Moments later, orbital turbolaser fire commenced on Polneye's cities, guided and adjusted by the scouts. Of Polneye's eight major cities, only Ten South survived the bombardment, although a troop transport landed before the conclusion of the battle. Four of six defensive TIE/IN interceptors, flown by rookie Polneyi pilots from the 10S Technical Institute including Plat Mallar, launched to engage the scouts. Plat Mallar scored a kill on one TIE/rc, but the other Polneyi TIE/IN interceptors were destroyed before they could secure any kills."}, {"tag": "p", "text": "Despite this minute loss, Jip Toorr severely lambasted the weapons master of the Devotion for the death of the TIE/rc pilot. Humiliated because of a loss of face, the weapons master ran out of the deck and committed suicide. A still furious Toorr then ordered the deployment of starfighters to destroy the Polneyi TIE/IN Interceptors."}, {"tag": "p", "text": "Plat Mallar escaped the battle on board his TIE/IN Interceptor and attempted to flee to the nearest population center Galantos. However as the TIE/In was not equipped with an in-built hyperdrive, such a journey would take three standard years. With the life-support system losing power, the Grannan recorded an account of his life and the massacre just as he slipped into unconsciousness. Days later, near death, he was found by elements of the New Republic Fifth Battle Group."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "With Nil Spaar at its helm, the Pride of Yevetha exterminated the inhabitants of the Kubaz colony before conquering the Imperial Remnant agriworld of Pirol-5. By the end of the campaign, the Black Fleet had wiped out colonies of Brigians, Corasgh, Grannan, Kubaz, Morath, the H'kig and the Polneyi. The survivors were taken hostage and imprisoned onboard several Aramadia-class thrustships. Two of these planets were to be resettled with Yevethan colonists. For this purpose, the previous inhabitants were genocided. The future colonists would be transported on thrustships to their new homes."}, {"tag": "p", "text": "Following the purge, Spaar and the Aramadia returned home. Spaar was greeted by thousands of adoring Yevetha, who now viewed him as god-like. Once on N'zoth, Spaar traveled to Giat Nor, the planet's capital city. As the ruler and hero of the Yevetha, he was free to choose anyone as a mate. In addition to his darna, he chose fifteen females to be his mates, and accepted the blood sacrifice of several nitakka, who willingly gave their lives for the viceroy."}, {"tag": "p", "text": "In response to the genocide, Organa Solo had decided that no other worlds would fall to the Yevetha unchallenged, and the Fifth had been sent as a strong show of force. However, the Yevetha also had a mole on Coruscant, in the form of Belezaboth Ourn, a consul for the Paqwepori, who informed the Dushkan League of the Fifth Fleet's redeployment to Koornacht after the New Republic had learned of the Yevethan Purge. To foment even more dissonance in the New Republic's public opinion of their own leadership, Spaar and his agents hijacked the official holofeed of Channel 1, allowing him to address the entire New Republic at once."}, {"tag": "p", "text": "Spaar, however, told the citizenry that the Yevetha had fallen under attack and even claimed that attacks on all non-Yevetha in the cluster, which had killed millions, had been orchestrated by the New Republic against the Duskhan League. In truth, the Yevetha, who viewed all other species as vermin, had begun to eliminate all others in the Koornacht Cluster. Many believed Spaar, and the New Republic Senate was divided as a result. Immense pressure was placed on Organa Solo, who knew Spaar's allegations were false, and that the Yevetha were aiming for dominance of Koornacht."}, {"tag": "p", "text": "However, the Grannan Plat Mallar survived the genocide by fleeing on a TIE/IN interceptor from Polneye. A New Republic patrol ship 5P8 encountered his fighter near the edge of the Koornacht Cluster and took him to Coruscant. There, his personal testimony and the combat records from his starship helped changed public opinion in the New Republic against the Dushkan League."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}