{"url": "Yin_Vocta", "categories": ["Category:Legends articles", "Category:Anomids", "Category:Business owners and executives", "Category:Crime lords", "Category:Information brokers", "Category:Lianns", "Category:Males", "Category:Medical professionals"], "nodes": [{"tag": "h1", "text": "Yin Vocta"}, {"tag": "p", "text": "Yin Vocta was a male Anomid businessman on the planet Lianna. He was the enigmatic owner of Bantha Traxx and the long-term friend of Kaylo NaKuda. He was also a crime lord."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Yin Vocta graduated top of his class at the prestigious Lunis-Medix Medical Academy. He was a skilled surgeon who performed countless cybernetic enhancements on the assassin Haelon Tice. He spent many years on Tatooine but was never associated to Jabba the Hutt's criminal organization. He eventually made his way to Lianna where his company, Vector Technologies, sometimes called VecTech purchased the abandoned nightclub Club Vortex and completely refurbished it as Bantha Traxx. It was rumored that Yin had set up a secret deal with Lady Valles Santhe in order to acquire the property. Both VecTech and Bantha Traxx became very profitable. Yin actively sought out the best and brightest bands to play at his club, including BoSS Code, Proton Overload and Dengar and the Destroyers. Up-and-coming bands would play at his annual 'Gathering of the Herd' event and was considered to be an opportunity for a band to get a big break."}, {"tag": "p", "text": "Yin also ran a criminal empire and was not against assassination. He also had a rivalry with Jabba's organization and paid Divv for information all of Jabba's spies on Lianna. He then sent out his two assassins, Haelon Tice and R'Kayza to kill them all."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yin was mysterious with being intimidating. He was polite, charming, and had a good sense of humor. He was also detested violence although he did carry weaponry for self-defense. Despite his social nature and non-violent attitude he had no qualms issuing orders to kill to his associates."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Yin was an expert surgeon who specialized in cybernetics. He was also a master at charm and negotiations and was a consummate host. He was also skilled in Anomid sign language and was knowledgeable with the languages, cultures and practices of numerous worlds. Finally he was quite skilled with his wrist vac."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yin Vocta was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Brian Schomburg."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}