{"url": "Ylesia/Legends", "categories": ["Category:Legends articles", "Category:Hutt Space planets", "Category:Slavery worlds", "Category:Spice producing worlds", "Category:Terrestrial planets", "Category:Ylesia locations"], "nodes": [{"tag": "h1", "text": "Ylesia"}, {"tag": "p", "text": "Ylesia was a tropical world located in Hutt Space. It was controlled by the Besadii Hutts. The planet was used as a slave colony dedicated to spice production covered up as a religious retreat."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ylesia was a tropical world consisting of three small continents. It was located on the Shag Pabol hyperlane."}, {"tag": "p", "text": "Ylesia was the homeworld of the nonsentient reek, an ungulate species raised on ranches on the planet and its Codian Moon. The creatures were exported to numerous worlds, including Ithor, Iridonia, and Geonosis, resulting in various breeds used for a wide array of purposes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic Era"}, {"tag": "p", "text": "Four thousand years before the Galactic Civil War, Ylesia was already one of the major spice-production worlds in the galaxy. The product was shipped from Kessel or Ryloth and processed, and then a number of spice runners made the journey from there to Nar Shaddaa, bringing warm slave bodies on the return trip to work the Ylesian spice factories."}, {"tag": "h3", "text": "Rebellion Era"}, {"tag": "p", "text": "In 10 BBY, the Besadii Hutts controlled the planet and purported it to be a religious retreat, but it was in fact a scheme to trap willing slaves in order to process spice. The Besadii would use male t'landa Til to produce what they called the Exultation, a contrived religious ceremony that would grip most sentients in a powerful and addictive pleasure."}, {"tag": "p", "text": "The t'landa Til of Ylesia would go on \"missionary\" journeys, giving the Exultation to crowds. This taste of the Exultation was often enough to ensnare those who were looking for something more to life. Workers were tricked to the planet, becoming \"pilgrims\" of the \"Cult of The One and The All.\" The pilgrims were then exploited as slaves in the planet's numerous spice-processing factories. One such victim was Bria Tharen. During this period, the planet was ruled by High Priest Teroenza, the leader of the cult. Han Solo's first piloting job was on Ylesia."}, {"tag": "p", "text": "During the following years, the fledgling Rebel Alliance mounted several more or less successful attacks on the planet, disrupting the spice production and reducing profits but generally causing little lasting damage. Rebel and Imperial forces were engaged in a skirmish there in 1 BBY, resulting in the capture of the frigate Salvation. In 0 BBY, however, a Rebel and smuggler raid, led by Han Solo and Bria Tharen, succeeded in shutting down the factories, at least temporarily, and freeing the slaves, and Teroenza was killed."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Ylesia was taken from the Hutts. It was given to the Peace Brigade to use as their headquarters. A raid by the New Republic, in which Jaina Solo was present, resulted in the capture of the Peace Brigade president, Thrackan Sal-Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Paradise Snare states that Ylesia had no moon; however, The New Essential Guide to Alien Species states that the Codian Moon was a moon of Ylesia. The Essential Atlas presumably places the Codian Moon in the Codia system on the opposite side of the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}