{"url": "Bettie-Bot_VJ", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles that are known by a nickname", "Category:BD-3000 luxury droids", "Category:Entertainers"], "nodes": [{"tag": "h1", "text": "Bettie-Bot VJ"}, {"tag": "p", "text": "One particular droid of the LeisureMech Enterprises BD-3000 luxury droid line, the Bettie-Bot VJ, was responsible for a music program on the Grand Army of the Republic broadcast system of the HoloNet during the Clone Wars. The clone troopers at Rishi Station were listening to her show just before they fought for their lives in 22 BBY, at which time she dedicated a song to the Mud-Jumpers of the 224th before being shut off as their commanding officer entered the room."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A LeisureMech Enterprises–manufactured, feminine-programmed BD-3000 luxury droid, a model nicknamed \"Bettie-Bot,\" hosted a program as a \"VJ\" on the Grand Army of the Republic broadcast over the HoloNet in 22 BBY, during which she played music for Republic clone troopers fighting in the Clone Wars."}, {"tag": "p", "text": "One group of clones stationed at the Rishi Station listening post on the Rishi moon tuned in to the Bettie-Bot's program during their downtime from scanning the region for Confederate forces heading for the planet Kamino. During the program, the Bettie-Bot sent a shout-out and dedicated her next song to the 224th Mud-Jumpers unit fighting on Mimban. However, the clones at Rishi Station had to terminate the holoprojector broadcasting Bettie-Bot's show to defend against a Confederate assault on the Rishi moon."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Bettie-Bot was a feminine personality–programmed BD-3000 luxury droid who broadcasted during the Clone Wars. She had her own show, as a \"VJ,\" on the Grand Army of the Republic broadcast HoloNet channel, where she played songs for people who tuned in, which included clone troopers. She occasionally chose to dedicate a song to a person or group, such as she did for the 224th. A BD-3000 was skilled linguistically, able to translate 1.5 million forms of communication with its language processors."}, {"tag": "p", "text": "While the Bettie-Bot's music was important for morale, some within the Grand Army found her jatz music to be outdated and turgid, and were lured to the CIS Shadowfeed instead for better musical selections, such as the leap-jump remixes played by the Separatist propagandist known only as \"Ryloth Resa\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Bettie-Bot, working as a \"VJ,\" appears as a hologram in the Star Wars: The Clone Wars television series episode entitled \"Rookies,\" voiced by Gwendoline Yeo. It premiered on October 24, 2008."}, {"tag": "p", "text": "The Bettie-Bot's character origins go back to the conceptual stages of Star Wars: Episode III Revenge of the Sith. Senator Bail Prestor Organa was originally to have a BD-3000 luxury droid aide working in his office. George Lucas described the female droid as the automated equivalent of Bettie Page, a famous pin-up model; thus she was named the \"Bettiebot.\" Although the scene was ultimately cut, the droid did appear, briefly, in other scenes of the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}