{"url": "Yoda%27s_Hut", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Dagobah locations"], "nodes": [{"tag": "h1", "text": "Yoda's Hut"}, {"tag": "p", "text": "Yoda's Hut was the last residence of Yoda, Grand Master of the Jedi Order, during his years of self-imposed exile on Dagobah. Initially, Yoda used the E3-standard starship lifeboat that had brought him to Dagobah as a temporary shelter. However, the lifeboat started to degrade within a year due to the planet's swampy environment, which forced the Jedi to construct a small house for himself. He chose to build it on a knoll at the base of a great gnarltree between a sweet water lagoon and an area where he could gather yarum seeds."}, {"tag": "p", "text": "Yoda used pieces of his lifeboat and crafted wattles from gnarltree roots to create his hut, along with mud, stones, and bark. With several open windows and two circular entries, he surfaced the interior with smooth, white adobe clay, which made for a clean, attractive, and, most importantly, dry home. He also incorporated the backup power supply from the lifeboat."}, {"tag": "p", "text": "The humble hut included a sitting room with a wooden stump for a table and a kitchen area. In the middle of his home, Yoda cooked at a small stove. Behind the stove was a storage area with windowsills covered in drying seeds, berries, and herbs. In the back of the shelter was a sink with running water and Yoda's spice collection, along with a few clay pots and bowls. A sleeping loft hung above with sleeping mats and blankets, though in his final years Yoda slept on the ground level. Tools and keepsakes were kept stored away in a nook. The sitting area made up the rest of the building."}, {"tag": "p", "text": "The open doors and windows, due to the hut's proximity to the lagoon, resulted in Yoda being visited by many creatures; he would often find snakes, lizards, butcherbugs, and spiny bograts scampering across the floor. He didn't mind the company, and only swept the venomous ones back outside."}, {"tag": "p", "text": "The Grand Master died there in 4 ABY in the presence of his apprentice Luke Skywalker. With the hut vacant, it was reclaimed by the swamp and the many creatures Yoda befriended during his stay. Sometime later, the hut was destroyed by Dagobah's torrential rains."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}