{"url": "Yo%27gand%27s_Core", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Combat tactics", "Category:Gravitational superweapons", "Category:Yuuzhan Vong culture"], "nodes": [{"tag": "h1", "text": "Yo'gand's Core"}, {"tag": "p", "text": "Yo'gand's Core was a battle tactic employed by the extra-galactic Yuuzhan Vong species to destroy entire planets. A warlike race, the Yuuzhan Vong utilized biotechnology in all spheres of life; one of the many creatures they made use of was the dovin basal, an organism capable of manipulating gravitational fields. During a war to gain control of the Yuuzhan Vong galaxy, the warrior Yo'gand was confronted by the forces of a rival warrior, Steng, who was based on the heavily fortified world of Ygziir. Rather than fight Steng's forces directly, Yo'gand created an innovative tactic. He secretly installed a dovin basal on Ygziir and instructed the creature to harness Ygziir's moon through gravitational manipulation. The dovin basal then pulled the moon in closer to Ygziir until its orbit decayed and it crashed into the planet, wiping out the bulk of Yo'gand's enemies in a single strike. Use of the tactic proliferated and the Yuuzhan Vong species eventually left the ruins of their galaxy and headed into the Intergalactic Void in search of a new home."}, {"tag": "p", "text": "Thousands of years passed before the tactic of Yo'gand's Core was employed again. When the Yuuzhan Vong finally reached another galaxy and selected it for invasion, an advance force was sent first to pave the way for the main Yuuzhan Vong fleet. To lessen the chances of detection, the leader of the advance force decided to wipe out the well-populated planet Sernpidal, utilizing Yo'gand's Core to convince the other inhabitants of the galaxy that a freak natural disaster had occurred. Sernpidal's moon Dobido was subsequently pulled out of orbit and impacted with the planet, destroying both spheres. Yo'gand's ancient tactic was again made use of in 26 ABY, when Hosk Station, an Esseles-class space station built into the surface of the moon of the planet Kalarba, was dragged down onto the world, destroying the planet and leaving the Kalarba system strewn with radioactive material. Although the principal purpose of Yo'gand's Core was that of a terror tactic, several variations existed and it was used for a number of reasons, such as cracking a planet open in order to harvest resources beneath its crust, pulling unwanted objects out of orbit, or reconstructing star systems."}, {"tag": "h2", "text": "Purpose"}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "Yo'gand's Core was designed to wipe out entire planetary bodies quickly and efficiently, without the need for extended conflict. Against opponents who were unaware of the tactic, it could be employed without the tactician needing to reveal his presence. Furthermore, by positioning the dovin basal in a certain location, or through instruction of the creature, the Yuuzhan Vong could ensure that the satellite hit the planet at a precise location, such as upon a city or an ocean, if this was their wish. The Yuuzhan Vong's ancient strategy also had its use as a terror tactic and was used to instill fear in those whom it affected. It was not always used in isolation of military conflict; the satellite was sometimes brought down on the planet during a battle for tactical purposes, to prove Yuuzhan Vong dominance, or to pull unwanted objects, celestial or artificial, from orbit. Due to the gravitational disturbances wrought by the destruction of planets, as well as the radiation that could sometimes be spread, the tactic could render whole systems inaccessible or uninhabitable."}, {"tag": "h3", "text": "Resource harvesting"}, {"tag": "p", "text": "Notably, Yo'gand's Core was also utilized for the purpose of generating new resources. Many planets harbored a wealth of minerals beneath their crusts which were largely unobtainable from the surface. When a moon impacted upon a planet's surface, tremendous forces subsequently shook the world and eventually caused it to fracture. The result was an asteroid field full of rich minerals that the Yuuzhan Vong could use in the construction of their organic starships. Younger ships were given fragments of destroyed worlds to break down and digest. Shipwombs, the Yuuzhan Vong equivalent of shipyards, were thus ideally located in the ruins of shattered planets, where vast resources could be obtained close at hand. Lastly, Yo'gand's Core could be used to bring smaller meteorites down upon a planet's surface that contained desirable resources such as water. It was thus a prominent element of Yuuzhan Vong terraforming."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "For all its cataclysmic potential, Yo'gand's Core took only a matter of days to destroy a planet. The Yuuzhan Vong would drop a powerful dovin basal onto the planet, within a crater of their own making if they desired secrecy or protection for the creature. Sometimes it was not one but instead a number of dovin basals that were seeded on the planet, although in recorded cases only one was deployed. Once placed on the planet's surface, the dovin basal was instructed to use its gravitational field manipulations to anchor itself onto the planet's core while simultaneously latching onto a passing satellite. Although any object, such as floating cities or space stations could theoretically be pulled out of orbit on to the planet's surface, it was typically a moon if the goal was the destruction of the entire world. The dovin basal was forfeit once the process became irreversible, although the Yuuzhan Vong typically did not bother to attempt to retrieve the creatures, especially since evidence of dovin basals would be lost with the planet. If the dovin basal did come under attack, however, it was able to refocus all of its gravitational manipulation on the core and drag itself deeper underground."}, {"tag": "p", "text": "Every time the moon's orbit brought it over the point at which the dovin basal was located, its orbit would decay sharply, bringing it closer to the planet's surface. As each successive orbit decayed further, the orbits became more rapid. As the moon came closer to the planet, phenomena would begin to occur on the surface. Winds would pick up, becoming erratic and forceful. Groundquakes and the sudden creation of fissures would become a regular occurrence, leading to the collapse of natural or artificial structures such as mountains or city buildings. If bodies of water were present on the planet, tidal patterns were also offset by the moon's descent, leading to rushing and chaotic seas that created floods and tsunamis. Once the moon broke atmosphere massive compressive forces arose due to the sudden arrival of a significant mass. As this occurred, the moon would also begin to suffer the effects of atmospheric entry, trailing flames due to the friction of its approach. Once the moon's orbit was broken and it had entered the atmosphere, Yo'gand's Core became irreversible. Tremendous upheavals of the ground became commonplace and winds picked up to titanic speeds, becoming so forceful that they could knock spacecraft out of the sky and topple entire buildings. Any detached debris would be picked up by the winds and hurled around, proving lethal to any remaining inhabitants."}, {"tag": "p", "text": "As the moon began its final, fiery descent, the massive compression that was the result of its full entry into the atmosphere would cause compounds such as air to burst, triggering sweeping firestorms. At the moment of impact, the atmosphere essentially detonated and was torn away entirely, leaving the affected planet incapable of supporting atmospheric lifeforms. The impact of the moon typically dislodged the planet from its orbit and created a giant cloud of planetary and satellite fragments at the location of the collision. Once the planet was rendered uninhabitable, it was not long before other effects of the collision manifested themselves. The force of the moon's impact typically caused the planet to break apart into gigantic fragments and dispersed a wide field of debris that could sometimes form into an asteroid field. The loss of a planetary body also typically caused the star system to become unstable, creating large fluctuations in gravity and offsetting hyperspace entry and exit points."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation and the Cremlevian War"}, {"tag": "p", "text": "Circa 15,000 years before their invasion of the galaxy, the extra-galactic Yuuzhan Vong were engaged in brutal internecine warfare that threatened to bring extinction to the species. The Cremlevian War was fought for years between different Yuuzhan Vong tribes. The warrior Yo'gand, faced with a rival domain on the planet Ygziir, who were heavily entrenched and possessing resources to resist a frontal assault, decided to try a new approach to vanquishing his opponents. Making use of a dovin basal, Yo'gand placed the creature on Ygziir and instructed it to pull the planet's moon down onto the surface, precisely where the encampment of Warmaster Steng, Yo'gand's rival, was located. The resulting impact destroyed Ygziir, wiping out all of Yo'gand's enemies on the planet, except Steng, whom Yo'gand defeated in single combat. As such, the tactic was credited with unifying the Yuuzhan Vong, and the Battle of Ygziir proved the turning point of the conflict. Due to the nature of the tactic and the dovin basal's anchorage to the target planet's core, it became known as Yo'gand's Core. Following the end of the Cremlevian War, the unified Yuuzhan Vong embarked on a war for supremacy in the galaxy. Although the Yuuzhan Vong found a way to counter the tactic with other dovin basals, the tactic proliferated during the conquest of their galaxy and was later credited with rendering it uninhabitable due to the destruction of so many worlds. The destruction of their galaxy and of their homeworld, Yuuzhan'tar, forced the Yuuzhan Vong into the Intergalactic Void, whereupon they wandered for millennia in search of a new home. Eventually, the species set its sights upon another galaxy, which they approached with the intention of total conquest. For millennia the tactic of Yo'gand's Core went unused, as the long journey through the Intergalactic Void meant that there were no planets to conquer."}, {"tag": "h3", "text": "During the Yuuzhan Vong War"}, {"tag": "h4", "text": "Sernpidal"}, {"tag": "p", "text": "Only when the Yuuzhan Vong invasion was launched in 25 ABY against the inhabitants of the galaxy that had been targeted by the Yuuzhan Vong did the tactic come back into play. Its first use was against the planet Sernpidal in the Julevian system. Once the Praetorite Vong, who acted as the advance force of the main Yuuzhan Vong fleet, had established their first base on the icy planet Helska IV, they looked toward expansion. Prefect Da'Gara, who led the Praetorite Vong, believed that any further expansion was risky unless Sernpidal, a nearby world that saw a sizable amount of communications and shipping traffic, was somehow silenced. Unwilling to initiate a fullscale assault due to the unwanted attention such action would bring, Da'Gara asked his peer, Executor Nom Anor, for advice on how to proceed. Anor agreed that Sernpidal was too well-connected a planet on a galactic level for the Yuuzhan Vong invasion to go unnoticed there and together he and Da'Gara considered other means by which the planet could be silenced without the galaxy immediately being made aware of the invaders' presence. Eventually, Da'Gara alighted on the idea of utilizing Yo'gand's Core, as the Sernpidalians and the rest of the New Republic would be unaware of what was causing the moon's descent and assume it was a natural phenomenon. Any New Republic warships sent out to investigate could subsequently be destroyed."}, {"tag": "p", "text": "Prefect Da'Gara sent forth his agents to install a large dovin basal east of Sernpidal City, the major population center on the world. Sernpidal had two moons, one of which was named Dobido—a small satellite twenty kilometers in diameter and ideal for the purposes of the tactic. The dovin basal, secretly installed in a crater in an unpopulated field, latched onto Dobido and the planet's core and began the process of decaying the moon's orbit. The Yuuzhan Vong instructed the dovin basal to bring Dobido down directly on Sernpidal City. As Dobido continued its orbits, its trajectory became lower and lower each time it passed over the dovin basal's location. The inhabitants of Sernpidal began to worship the moon as Tosi-karu, a Sernpidalian goddess whom they believed had arrived. Chaos and panic struck the city and a mass exodus began as many realized what was occurring. On other parts of the planet, settlements were wiped out by the many natural disasters the moon's descent precipitated. A coastal village south of Sernpidal City was leveled in a tsunami while groundquakes began to demolish buildings and mountain ranges. The rising winds made evacuation efforts difficult as fleeing ships were buffeted out of the sky. The arrival of the light freighter Millennium Falcon brought with it Jedi Anakin Solo, along with his father Han Solo and first mate Chewbacca. The crew was able to study Dobido's descent patterns and realized that its orbit was affected every time it passed over a certain location. Along with the Mayor of Sernpidal City, Anakin Solo investigated, discovering the dovin basal and firing a blaster shot at the creature. By this time, Dobido's orbit was sufficiently decayed and the moon's impact was inevitable. The creature retreated further toward the planet's core but was eventually killed when the mayor leapt down the crater with a thermal detonator and eliminated it."}, {"tag": "p", "text": "The death of the dovin basal did nothing to prevent the descent of Dobido; the moon, having already breached the atmosphere, began its final descent toward Sernpidal City, trailing flames and instigating massive disasters across the world. As the air burst due to the titanic compressive forces caused by the moon's fall, sweeping firestorms and winds caused chaos and destruction in the cities. In total, 20,000 people escaped the planet, due chiefly to the relief efforts of Han Solo, captain of the Millennium Falcon. Millions perished in the resulting impact, however, as Dobido collided with Sernpidal and exploded, tearing the atmosphere away. Among the dead was the Wookiee Chewbacca, one of the Heroes of Yavin. Sernpidal was left uninhabitable following the impact. Dobido's impact, having torn away the atmosphere entirely, pounded loose a chunk of one hemisphere, and left Sernpidal wobbling off its orbit. The planet fragmented over time, fracturing into large and small chunks that left an asteroid field dispersed across the system. The Yuuzhan Vong used the ruined planet to create a shipwomb—the invaders' equivalent of a shipyard—in which a new worldship could be constructed to house the young, infirm or elderly members of the species. The fragments of Sernpidal were broken down by Yuuzhan Vong creatures and harvested for minerals. In terms of its role as a terror tactic, Sernpidal's demise spread fear among the citizens and leadership of the New Republic as it proved the vast potential of the Yuuzhan Vong for destruction. The Yuuzhan Vong commander Shedao Shai later threatened the planet Ithor with the same fate during his negotiations with Jedi Knight Corran Horn, although on this occasion Yo'gand's tactic was not employed."}, {"tag": "h4", "text": "Kalarba and other theaters"}, {"tag": "p", "text": "Ten months after the destruction of Sernpidal the Yuuzhan Vong made use of Yo'gand's ancient tactic again, this time on the planet Kalarba and its famed satellite, the Esseles-class Hosk Station. Part of Warmaster Tsavong Lah's campaign to sever the Corellian Run trade route, the Battle of Kalarba was a loss for the New Republic that witnessed the destruction of the planet. As with Sernpidal, the Yuuzhan Vong placed a large dovin basal on the surface and instructed it to harness Hosk Station, an ancient space station that had been built onto the surface of one of the planet's two moons, and drag it down onto Kalarba. On this occasion, however, Yo'gand's Core was accompanied with military support. A Yuuzhan Vong fleet invaded the Kalarba system and attacked the New Republic presence there once the descent of Hosk Station was underway. Hosk Station took heavy punishment from the weapons of the Yuuzhan Vong vessels as it fell; the space station's defenses were crippled and it began its descent to Kalarba's surface in ruins. The resulting impact destroyed Kalarba and Hosk Station, distributing radioactive material across the Kalarba system that rendered it uninhabitable for centuries. The Yuuzhan Vong had no use for the system and moved on with their advance upon the Core Worlds."}, {"tag": "p", "text": "At the Battle of Duro, which took place a short time after the devastation of Kalarba, a variation of Yo'gand's Core was used. In Duro's orbit were twenty or so floating cities, which housed the Duros population who had long ago left the polluted surface of their homeworld. Viewed as abominations by the technology-hating Yuuzhan Vong, the cities were marked for destruction. Although some were rammed or demolished by warships or other creatures such as an ychna, the rest were dragged to the surface by dovin basals and destroyed upon impact, among them Orr-Om and Bburru."}, {"tag": "p", "text": "Later on in the war, at Borleias, Supreme Commander Maal Lah placed a dovin basal on the planet's moon and used it to latch onto the numerous orbital defenses protecting the world. To make the assault of the planet easier, Lah had planned for the dovin basal to then sweep the orbital defenses aside so that the planetary invasion could commence. The tactic was not utilized in this case, however, as Warmaster Tsavong Lah, directing his subordinate, came to believe that a different strategy was necessary in order to take the world quickly. In the Yuuzhan Vong restructuring of the Coruscant system, following the conquest of Coruscant, in the image of the star system of their ancient lost homeworld, Yuuzhan'tar, dovin basals were also placed on the surface of the planet to drag meteorites down on to the surface that contained water, bringing natural rain to Coruscant for the first time in thousands of years."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yo'gand's Core was introduced in The New Jedi Order: Vector Prime, the first installment in Del Rey's New Jedi Order series. The tactic was notable in Vector Prime as it resulted in the death of Chewbacca, who, while not the first movie character to die in the Expanded Universe, was certainly the most well-known. It proved a way for Del Rey to add an element of tension into the novels, removing the \"protective bubble\" that had surrounded the heroes. In her novel The New Jedi Order: Balance Point, released in 2000, author Kathy Tyers used Yo'gand's Core in the opening sequence of the book, in which Jaina Solo combats the Yuuzhan Vong over the doomed planet of Kalarba."}, {"tag": "p", "text": "Due to Chewbacca's death and several other elements of the novel that a number of Star Wars fans found displeasing, author R. A. Salvatore came under, in some cases, fierce criticism. Among the criticisms were questions about how the science of the Yuuzhan Vong worked and the opinion that tactic of Yo'gand's Core was unrealistic and implausible. Salvatore had in fact obtained the idea for a device capable of manipulating gravitational fields from a 1950s science-fiction film he had watched. Although he was uncertain whether gravitational manipulation to the extent portrayed in Vector Prime was theoretically possible, Salvatore decided that a number of other scientific Star Wars elements, such as the lightsaber, were never explained scientifically and thus dovin basals did not deserve undue criticism."}, {"tag": "p", "text": "Dobido's fiery descent onto Sernpidal's surface and the Wookiee roaring his defiance at the incoming moon became an oft-referenced Expanded Universe scene, placed in Abel G. Peña's article 20 Most Memorable Moments of the Expanded Universe and in other online polls."}, {"tag": "p", "text": "The tactic was erroneously named Yo'Gand's Core in The New Jedi Order Sourcebook and its creator referred to as Yo'Gand. The mistake was repeated in 2009 with the publication of The Essential Atlas. As all other sources and novels in which the tactic or its creator are referred to uses the lower case lettering, this article assumes the correct spelling to be Yo'gand. In the Databank entries which refer indirectly to the tactic, it is also stated that more than one dovin basal was placed on Sernpidal; as Vector Prime refers only to one and states that the gravitational manipulation ended with its death, this article assumes the Databank entries are in error. The New Jedi Order Sourcebook does state that several dovin basals are seeded on the designated planet, although once again, this cannot have been the case with Sernpidal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}