{"url": "Ylesian_white_worm", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of unspecified diet", "Category:Creatures of Ylesia", "Category:Food creatures", "Category:Species of undefined sentience", "Category:Worms"], "nodes": [{"tag": "h1", "text": "Ylesian white worm"}, {"tag": "p", "text": "Ylesian white worms were a species of worm that lived in mud and were native to the planet Ylesia. They were white in color and relatively lengthy in size. Members of the Hutt species enjoyed eating them."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ylesian white worms were a species of long, white-colored worms. Their life cycle included a grub stage, during which the worms were small enough in size that several could fit into the hand of a Hutt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ylesian white worms evolved on the planet Ylesia, in the Cha Raaba system of the region of the galaxy known as Hutt Space. They were eaten by members of the sentient, slug–like Hutt species, although it would take millions of the worms to sate a single Hutt's appetite. The Hutt crime lord Jabba Desilijic Tiure ate handfuls of live Ylesian white worms from a large basket filled with the creatures to the point of overflowing whilst he viewed a Podrace at the Mos Espa Grand Arena in the year 22 BBY. On Ylesia, members of the T'landa Til species, working as priests, would bathe in red-colored mud in which Ylesian white worms could be found, as the Corellian smuggler Han Solo discovered to his horror when he joined a pair of T'landa Til in such a mud hole around the year 10 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ylesian white worms first appeared in the 1997 novel The Paradise Snare, the first story in The Han Solo Trilogy, written by A. C. Crispin, although they were not named in the book. The species was first named and pictured in the 1998 reference book The Essential Guide to Planets and Moons, written by Daniel Wallace and illustrated by Brandon McKinney and Scott Kolins. They then appeared again in the 2003 young readers novel Boba Fett: Hunted, written by Elizabeth Hand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}