{"url": "Ylenic_It%27kla", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Alderaanian Resistance members", "Category:Alderaanians", "Category:Caamasi", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Consulars", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Ylenic It'kla"}, {"tag": "p", "text": "Ylenic It'kla was a Caamasi Jedi Knight of the Old Jedi Order. Born to the Kla clan of Caamas, he became one of the few Caamasi to join the Jedi, where he served as a negotiator and mediator. It'kla also befriended Human Jedi Nejaa Halcyon. When the Clone Wars broke out, It'kla was not able to fight at the Battle of Geonosis, but only seven days later, he went on a mission to Corellia with fellow Jedi Aayla Secura in a complicated plot that he worked on with Halcyon to help the Techno Union scientist Ratri Tane defect to the Republic."}, {"tag": "p", "text": "Later in the war, It'kla joined Halcyon and another Jedi he knew as \"Desertwind\" on a mission to investigate the return of the Sith. Pursuing a number of archaeological thefts to Susevfi, they encountered the Dark Jedi Nikkos Tyris and his followers. Tyris was defeated, at the cost of Halcyon's life, and It'kla returned the late Jedi's effects to Halcyon's family, whom he helped to take care of afterward. It'kla survived the Great Jedi Purge and the Destruction of Caamas, relocating to Alderaan to become the Trustant of that world's Caamasi Remnant and a personal aide to Viceroy Bail Organa. It'kla helped in the formation of a resistance to the Empire, serving as a representative of the Alderaanian Resistance at Bria Tharen's meeting on Cloud City and aiding fellow Purge survivor Rahm Kota in his own search for Organa. He died when the Empire's Death Star destroyed Alderaan in 0 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Knight of the Republic"}, {"tag": "p", "text": "Ylenic It'kla was born to the Kla clan of Caamas, along with at least one sibling, a sister. When he became a Jedi, one of a rare few Caamasi to do so, It'kla brought great pride to his clan. He left Caamas, and by 28 BBY, had become a Jedi Knight. For almost their entire shared lives, It'kla was friends with the Corellian Jedi Nejaa Halcyon, and the Caamasi visited Corellia at least once, serving in the position of mediator. A pacifist, It'kla spent much of his Jedi career mediating and counseling, as well as using his piloting skills in service to the Jedi Order. It'kla rarely used his lightsaber, preferring to solve situations with negotiation or diplomacy."}, {"tag": "p", "text": "In 22 BBY, the Clone Wars broke out with the Battle of Geonosis. It'kla did not fight at Geonosis, though he would say later that he would gladly have done so. Within days, a Techno Union scientist named Ratri Tane fled to Corellia, seeking asylum for himself and his family and carrying stolen prototype technology—sabotaged in case the Separatists ever retrieved it—as insurance to protect his family. When Nejaa Halcyon learned of this, he contacted It'kla to serve as a liaison with the Jedi Council for a plan he was working on. Halcyon, It'kla, and Jedi Master Mace Windu decided to move Tane and his family off Corellia. Meanwhile, Halcyon would pose as Tane, and Jedi would be sent to Corellia to distract any Separatist agents and force them to move against \"Tane\", giving the Jedi of Corellia—if not Corellia itself—cause to side with the Republic."}, {"tag": "p", "text": "Windu chose the Jedi Knight Aayla Secura to join It'kla on the mission, and seven days after Geonosis, he called It'kla and Secura to the Jedi Temple to brief them. Secura was not let into the entire plan, and told instead that they were being sent to retrieve the real Tane. Leaving Coruscant from a commercial spaceport to attract as little attention as possible, It'kla and Secura flew the smuggling vessel Flare, carrying supplies for Corellians and Republic expatriates. Landing in the city of Coronet, the two Jedi, in their guise as traders, sold off their goods, while It'kla put out the word that they were looking for passengers. Two buyers pointed the Jedi to the Homestar cantina. At the cantina, Secura spotted Halcyon—believing him to be Tane—and a pair of Gotals, who had the ability to detect Force-usage. The two Jedi moved towards Tane, as did the Gotals; however, a Toydarian named Lorfo, one of those in on It'kla's plan, caused a distraction around Secura to draw the Gotals' attention. One Gotal opened fire on Secura while the other moved after Halcyon; a number of other cohorts revealed themselves when Secura drew her lightsaber, and a firefight began between them and the two Jedi. It was soon interrupted by agents of the Corellian Security Force, who briefly interrogated It'kla and Secura before allowing them to leave, but Halcyon was gone by then."}, {"tag": "p", "text": "The Jedi had carried a tracking device, meant to lead It'kla to the hideout of the criminals who had taken him, but it failed to work. When It'kla found himself unable to locate Halcyon, Lorfo approached the two and offered to lead them to Tane. At the warehouse where the criminal boss, Tendir Blue, was hiding, Lorfo alerted Blue to their presence, and the Jedi were taken hostage. Halcyon was brought out in front of them, Blue's blaster trained on him, and Blue explained that they had taken the sabotaged prototype technology Halcyon had been carrying. Blue revealed that he also had been provided battle droids by the Separatists, as they too trained their guns on the Jedi, and It'kla and Secura were disarmed. Meanwhile, Halcyon projected an image of his plan for escape into Secura's head; when the Gotals sensed the Force was being used, Blue shot Halcyon, who turned the energy into an act of telekinesis and sent his own lightsaber flying into Secura's hand. As she dealt with the droids, Halcyon disabled the Gotals with the Force, and It'kla stood guard over the downed criminals. At last he revealed Halcyon's true identity and the extent of the plan to Secura. She had a suggestion to improve it, though: their original idea was to implant a memory in Blue's head that would convince him the prototype was real, which Secura believed would be unraveled by the Separatist leader Dooku. Instead, she chased him off the planet, pretending that he had killed It'kla and she was seeking vengeance. It was successful, and Blue went back to Dooku unknowingly carrying the sabotaged technology."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "p", "text": "With the start of the Clone Wars, It'kla took up guarding the planet Alderaan, and he met the Alderaanian Viceroy Bail Organa. Meanwhile, with the Sith having returned only about a decade prior, the Jedi Council asked Nejaa Halcyon to research the rumors about them. It'kla, insisting that his talents for discussion would prove useful, joined his friend; another Jedi, a general whom It'kla knew as \"Desertwind\", led them. After over a month of searching, they found a looted archaeological dig that led them to the world of Suarbi. The locals on Suarbi proved unhelpful, slowing the search and showing an allegiance to what seemed to be Sith cultists living among them. The three Jedi eventually located an area of the moon Susevfi where a void in the Force seemed to exist, and they could not use their powers. There, in an ancient arena underneath a duracrete dome, they found three of their \"Sith\"—actually Dark Jedi who had been thought lost in the conflict on Baltizaar. The Jedi attempted to persuade the other three from their path, but the Dark Jedi leader, the Anzati Nikkos Tyris, attacked. Each of the Jedi moved to take on a Dark Jedi in combat; It'kla's opponent was able to injure him in the flank with her lightsaber, but It'kla got beneath her guard and bisected her. He was only then able to see how the other battles were progressing. Tyris, who had been fighting Halcyon, had disarmed his opponent and was preparing to kill him. It'kla tried to send the Jedi's lightsaber back to him, but as Halcyon dove for his blade, Tyris impaled him. Mortally wounded, Halcyon was able to absorb enough of the lightsaber's energy to crush Tyris with the Force. The dark side energy that exploded from Tyris' body brought down the dome, and Desertwind was able to hold it up long enough for It'kla to pull Halcyon to safety. Shortly thereafter, Halcyon died and vanished into the Force. It'kla and Desertwind made their way via Susevfi's capital, Yumfla, back to Corellia."}, {"tag": "p", "text": "There, It'kla delivered Halcyon's personal effects to his family, asking them not to inquire about the details of the mission. At the Galactic Museum's request, he donated Halcyon's lightsaber to them. Sad at the loss of his friend, It'kla increased his commitment to the Order and helped take care of Halcyon's family. When Supreme Chancellor Palpatine declared himself Emperor and turned on the Jedi, It'kla was able to develop the skills in the Force he needed to avoid the architects of Palpatine's Great Jedi Purge."}, {"tag": "h3", "text": "Alderaanian advisor"}, {"tag": "p", "text": "It'kla was on Alderaan, visiting a friend, when his homeworld of Caamas was immolated in a surprise attack by an unknown enemy. The Jedi convinced his friend to provide a home on Alderaan for displaced Caamasi; along with the other leaders of the ravaged world, he also decided that the Caamasi Remnant needed to spread out to a number of new settlements. Bail Organa found It'kla a job as one of his personal advisors, placing him as Trustant of the Alderaanian Caamasi Remnant."}, {"tag": "p", "text": "In 2 BBY, Bria Tharen, a member of the Corellian Resistance against the Galactic Empire, summoned a number of resistance groups from across the galaxy to Cloud City to discuss combining their efforts. It'kla, along with the Humans Winter and Hric Dalhney, represented Alderaan. It'kla did not speak much, and while little was accomplished at the meeting—Dalhney vociferously opposed violent action—Winter promised to speak with Organa further about it. Organa eventually set out to find other Jedi, and when he traveled to Felucia in search of Jedi Master Shaak Ti, he left word with It'kla. Organa vanished upon landing, and when Rahm Kota, a fellow escapee of the Purge, contacted It'kla in search of him, the Caamasi told him as much, and Kota was able to help rescue Organa. Though the viceroy was integral in the creation of a new Rebel Alliance, which It'kla became a part of, it drew the eye of the Empire to Alderaan. It'kla was on the world when the Empire's first Death Star arrived in 0 BBY. Sensing his impending fate, he could do nothing but give in to the will of the Force as Alderaan was annihilated, killing him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Before his death, It'kla transferred a memnis—a kind of memory that Caamasi could share with each other—of the Susevfi battle to his nephew Elegos A'Kla. Eleven years after It'kla's death, A'Kla provided it to the Jensaarai, a group of Force-users formed out of Tyris' teachings. Though they had been laboring under a misapprehension about the Jedi and their motives for decades, after seeing the events from It'kla's point of view, the Force sect was able to be coaxed into once again opening dialogue with the Jedi Order. Shortly before this, the Jedi Knight Corran Horn had received his own vision of It'kla and the Susevfi duel from the perspective of his grandfather, Nejaa Halcyon. A'Kla later made the journey to the remains of Alderaan to leave a gift in It'kla's memory, and Horn asked him to leave one of his own in Nejaa Halcyon's name."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ylenic It'kla was a pacifist, striving for harmony and peace like many of his species, and among the Jedi, he was often called upon to counsel and mediate. However, It'kla believed that refusing to take action when the peace of others was threatened was the point at which pacifism turned to evil, and he would take action if necessary. Though he did not fight in the Battle of Geonosis, and he was grateful he did not carry the memories of it, it was something he later said he would have done gladly. It'kla placed great stock in nobility of character; he took responsibility for those he took under his care, from the family of Nejaa Halcyon after the other Jedi's death to the planet of Alderaan when war struck."}, {"tag": "p", "text": "It'kla had an inquisitive nature, and behind a quiet front, he was possessed of power and confidence. The Caamasi believed doubts were important to have, as they kept one from arrogance and hence the dark side of the Force. He counseled against fear, emphasizing that the Jedi could offer freedom from that fear that brought people to the dark side."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Possessed of strength, speed, and power, and a long reach that gave him an advantage in lightsaber dueling, It'kla had the capabilities to be a formidable warrior. It'kla possessed a green lightsaber; though he rarely used it, he was an able fighter. He was also, however, versed in the art of peaceful discussion, and he used negotiation where possible. The Caamasi was a skilled pilot, a talent the Jedi Order used."}, {"tag": "p", "text": "It'kla had a strong sense of smell. He remembered the identities of others chiefly by scent, rather than name. The Caamasi could project the equivalents of smells through the Force into the minds of other beings; strong odors could be used in this way to immobilize them. Typical of his species, It'kla could produce memnii, a kind of stored memory that could be shared with other Caamasi and Jedi. When the Jedi Purge began, the Caamasi developed new Force techniques to escape Emperor Palpatine's agents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ylenic It'kla was created in Michael A. Stackpole's I, Jedi, where the character only appears in the form of visions to Corran Horn. He would make his only live appearance in the short story Elusion Illusion, also by Stackpole, where he was illustrated by Jan Duursema. It'kla's fur, described as golden with purple stripes in both Jedi and Illusion, appears gray with black stripes in the story's illustrations."}, {"tag": "p", "text": "A timeline discrepancy occurs in Power of the Jedi Sourcebook, where it is implied that the fight with Nikkos Tyris occurs before the Clone Wars; however, this is not only contradicted by I, Jedi, but all stories during the Clone Wars where Nejaa Halcyon appears, including Elusion Illusion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}