{"url": "Yorik-vec_assault_cruiser", "categories": ["Category:Legends articles", "Category:Yuuzhan Vong starship classes"], "nodes": [{"tag": "h1", "text": "Yorik-vec assault cruiser"}, {"tag": "p", "text": "The Yorik-vec assault cruiser was an assault cruiser used by the extragalactic Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As with all Yuuzhan Vong starships, the Yorik-vec was a living vessel created from yorik coral. This bioship filled the gap between starfighters and light warships in the Yuuzhan Vong fleet. The Yorik-vec was designated as 'salt' by New Republic starfighter pilots."}, {"tag": "p", "text": "The Yorik-vec was armed with the yaret-kors used on coralskippers and corvettes, though the cruiser introduced two variations on the design. The first, the Yorik-vec's chief weapon, was a turret-mounted version of the weapon appendage found on coralskippers, while the second consisted of twin Yaret-Kors. The Yorik-vec also used a dovin basal for propulsion and defense."}, {"tag": "p", "text": "Its crew consisted of two pilots and three gunners. Though classified as an assault cruiser - the same class as the 850 meter-long Ralroost of the New Republic Navy, the vessel required only five personnel to operate."}, {"tag": "p", "text": "Two Yuuzhan Vong piloted the ship via cognition hoods, which allowed pilot and vessel to share thoughts and commands - while the remaining three manned the yaret-kors. The Yorik-vec could also accommodate a further eight passengers or the equivalent of 100 metric tons of cargo."}, {"tag": "p", "text": "While the Yorik-vec could transport troops and cargo, it did not feature the external appendages necessary to transport coralskippers into battle, as most other warships did. The Yorik-Vec was deployed as a warship rather than a troop transport or cargo carrier."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A number of Yorik-vec were part of the initial invasion forces which participated in the early stages of the Yuuzhan Vong War. Several were attached to an armada—approaching the planet Artorias—which was being led by Commander Azca. These assault cruisers were called into action when an \"infidel\" vessel called the Pythea discovered the Yuuzhan Vong fleet; the Yorik-vec were dispatched to cripple the enemy vessel in order to allow a boarding party to capture its occupants."}, {"tag": "p", "text": "Yorik-vec were also used during the later stages of Tsavong Lah's Battle Plan Coruscant operation, during which the galactic capital fell to the extragalactic Yuuzhan Vong empire. The ships were also used up until the end of the war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}