{"url": "Yoda:_Dark_Rendezvous", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Clone Wars novels"], "nodes": [{"tag": "h1", "text": "Yoda: Dark Rendezvous"}, {"tag": "p", "text": "Yoda: Dark Rendezvous is a Star Wars Legends novel written by Sean Stewart. It is a part of the Clone Wars multimedia project, and it was first published by Del Rey on November 23, 2004, along with an audiobook version."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The savage Clone Wars have forced the Republic to the edge of collapse. During the height of battle, one Jedi Knight escapes the carnage to deliver a message to Yoda on Coruscant. It appears that Dooku wants peace and demands a rendezvous. Chances are slim that the treacherous Count is sincere, but with a million lives at stake, Yoda has no choice."}, {"tag": "p", "text": "The meeting will take place on Vjun, a planet steeped in evil. The challenge could not be more difficult. Can Yoda win back his once promising pupil from the dark side, or will Count Dooku unleash his sinister forces against his former mentor? Either way, Yoda is sure of one thing: This battle will be one of the fiercest he'll ever face."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Clone Wars rage across the galaxy. Grand Master Yoda receives a message from his former Padawan, Count Dooku. In the message, Dooku concedes that the conflict has gotten out of hand and that he is willing to come to a truce. Dooku invites Yoda to meet him on the planet Vjun, where they will organize the cease-fire. After conferring with his fellow Jedi Masters from the Council, Yoda decides that the chance to end the war outweighs the perils of a trap."}, {"tag": "p", "text": "To cover for the secret meeting, the Jedi contract famous actor and Yoda impersonator Palleus Chuff to act as a decoy while Yoda departs for Vjun. Disguised as Yoda, Chuff leaves on a publicized mission to Ithor. However, upon Chuff's arrival at Ithor, his ship is ambushed and destroyed by Asajj Ventress, who was seeking to assassinate the Jedi Master. Yoda's perceived death is a significant blow to the Republic's morale. Meanwhile, Yoda travels to Vjun, accompanied by Jedi Masters Jai Maruk and Maks Leem and their Padawans, \"Scout\" and Whie."}, {"tag": "p", "text": "During a spaceport layover, Ventress, accompanied by the bumbling but brave Chuff, manages to catch the quintet and unleashes a dangerous new type of battle droid. While the other Jedi fight the droids and Ventress, Yoda seeks to rescue Chuff. Both Maruk and Leem fall to the droids and Ventress. Yoda, however, manages to divert Ventress's attention, and the three Jedi escape with Chuff in tow."}, {"tag": "p", "text": "On Vjun, Count Dooku awaits Yoda in the Château Malreaux, the manor of the long-since waned aristocratic House Malreaux. As the Jedi land on Vjun, they are forced to separate. Yoda goes to meet with Dooku, and the Padawans follow a mysterious disruption felt in the Force. The Padawans are captured by Ventress. She reveals to Whie that he is a member of House Malreaux, and the insane Lady Whirry Malreaux is his mother. Ventress holds Scout in a tight Force grip and tries to bring Whie to the dark side of the Force. Whie is able to resist."}, {"tag": "p", "text": "Meanwhile, Yoda meets with Dooku. They engage in a debate about the Force and reminiscence about Dooku's childhood at the Jedi Temple. Yoda encourages his former apprentice to leave the dark side and Darth Sidious forever. Dooku is emotionally stirred, and Whirry arrives with news: Anakin Skywalker and Obi-Wan Kenobi have arrived at the mansion, having been dispatched by the Jedi Council."}, {"tag": "p", "text": "Convinced that the legendary duo are replacements for him, Dooku is overcome by jealousy and throws Whirry out of a window. Yoda saves her and begins a duel with Dooku. Dooku activates an orbital missile targeted at the house and escapes with Ventress. Yoda succeeds in stopping the missile. With Kenobi, Skywalker, and the Padawans, Yoda returns to Coruscant. Elsewhere, Dooku laments the knowledge that everyone he had ever loved, including Yoda, has forsaken him."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Yoda: Dark Rendezvous is a part of the Clone Wars multimedia project. The Clone Wars timeline contained within Dark Rendezvous dates the events of the novel to thirty months after the Battle of Geonosis, following the events of Jedi Trial and preceding the events of Boba Fett: A New Threat. However, this timeline was retconned by the animated television series Star Wars: The Clone Wars, and a cohesive timeline has not been described."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}