{"url": "Yol_Areebi", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Criminals", "Category:Guineo", "Category:Males", "Category:Slavers"], "nodes": [{"tag": "h1", "text": "Yol Areebi"}, {"tag": "p", "text": "Yol Areebi was a male Guineo criminal who was alive during the waning years of the Galactic Republic. By 32 BBY, Areebi had worked as a slaver and was wanted by the Republic Security Force for taking kidnapped members of a native species from the Forest Moon of Endor to be used slave labor in an illegal mining facility in the Cron Drift. During that year, Areebi worked at Haugg Nerf Industries, a nerf-packing plant used as a front for selling death sticks, which was located in the Industrial District of the planet Coruscant. There, the Mandalorian bounty hunter Jango Fett claimed the bounty on Areebi while Fett was infiltrating the facility in search of information on Komari Vosa, the leader of a secretive criminal organization known as the Bando Gora."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Guineo criminal, Yol Areebi lived during the last years of the Galactic Republic. By the year 32 BBY, Areebi had worked as a slaver, including an instance in which he took abducted members of a species native to the Forest Moon of Endor to an illegal mining facility in the Cron Drift for use as slave labor. However, when he was in the Industrial District on the Republic's capital planet of Coruscant, the Republic Security Force placed a bounty on his head for bringing slaves to the mining facility. The bounty mentioned Areebi's last known location as the Industrial District and offered 2,000 credits for capturing him alive and 1,000 credits for killing him. At that time, Areebi was affiliated with a number of slavers and thugs-for-hire."}, {"tag": "p", "text": "While he was in the Industrial Sector in 32 BBY, Areebi worked for Haugg Nerf Industries, a nerf-packing facility run by an individual named Groff Haugg as a front for the sale of death sticks, a type of illegal narcotic. That year, the Mandalorian bounty hunter Jango Fett infiltrated Haugg Nerf Industries in order to search for information that would lead him to Komari Vosa, a former Jedi who was leading the Bando Gora, a secretive criminal cult rumored to be behind the increased demand for death sticks."}, {"tag": "p", "text": "After fighting through most of Haugg Nerf Industries in search of Haugg, Fett encountered Areebi in one of the facility's corridors. Areebi merely cowered as the bounty hunter approached and captured him to claim the bounty on his head."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As was common among members of the Guineo species, Yol Areebi stood over two meters tall with hairless skin of a pale yellow color. A known associate of various slavers and hired guns, Areebi was not above supplying an illegal facility with abducted individuals to be used as slave labor."}, {"tag": "p", "text": "However, Areebi did not act bravely when confronted by Jango Fett in Haugg Nerf Industries, where he cowered instead of fighting back."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While working at Haugg Nerf Industries, Areebi wore a yellow jumpsuit that had a gray plate on its front with two tubes running from it to the two silver-colored tanks attached to the back of his suit. The jumpsuit also had white stripes along the sleeves and around its collar. In addition to wearing the jumpsuit, Areebi wore light-gray gloves, dark-gray boots, and a pair of gray goggles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yol Areebi first appeared in Star Wars: Bounty Hunter, a video game produced by LucasArts and released in December 2002. Before appearing in the game, he received an entry in Star Wars: Bounty Hunter: Prima's Official Strategy Guide, the game's corresponding guide, which was published by Prima Games and released in November of the same year. In the game, Areebi is one of five bounties located in the Industrial District, which is the second level on Coruscant, the game's second world."}, {"tag": "p", "text": "In addition, Areebi is the only Guineo character in the game who will not fight; Areebi will merely cower if approached by the player. The game also does not describe the species of the Endor natives that he supplied to the illegal mining facility. Native species of the moon include Duloks, Ewoks, Gorphs, and Yuzzums. In Bounty Hunter, the player controls Jango Fett, and since claiming Areebi's bounty is not essential to completing the game, the player has several different ways to go about doing so. The player can ignore Areebi entirely, kill him and not claim the bounty, kill him and claim the bounty, or capture him and claim the bounty. This article assumes that Fett captured Areebi alive, as doing so gives Fett the maximum reward possible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}