{"url": "Yorik-et", "categories": ["Category:Legends articles", "Category:Starfighter classes", "Category:Yuuzhan Vong starship classes"], "nodes": [{"tag": "h1", "text": "Yorik-et"}, {"tag": "p", "text": "The yorik-et, referred to as a coralskipper or skip by New Republic forces, was the Yuuzhan Vong version of a starfighter during their invasion of the galaxy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The yorik-et was a bioship made from yorik coral, since the Yuuzhan Vong despised mechanical technology as an abomination. It was grown instead of manufactured so no two coralskippers looked alike. Despite this, every coralskipper shared some basic features, such as a dark canopy, and a triangular body. The coralskipper's pilot could communicate with the craft via a special mask called a cognition hood at the cockpit."}, {"tag": "p", "text": "The coralskipper's weapon was a Yaret-Kor, a small appendage at the front of the vehicle which released a searing magma rock that could seriously damage enemy craft. The coralskipper also possessed two plasma projectors at the front of the ship, sometimes referred to as 'rock spitters'. The coralskipper refueled and rearmed by eating rocks, small asteroids, and stellar debris. However, like any living organism, coralskippers aged and died."}, {"tag": "p", "text": "Also, hidden beneath the front of a yorik-et was a small creature that resembled a heart called the dovin basal. Because it was living, it pulsed and shuddered constantly, similar to a Human heart. The dovin basal was the most important part of the bioship because it functioned like a miniature black hole, creating a powerful supergravity field when activated. This field could be used to overload the shields of an enemy starfighter and could also act as the coralskipper's own shield by drawing laser fire and missiles into the yawning maw of the miniature singularity."}, {"tag": "p", "text": "Like all classes of Yuuzhan Vong spacecraft, the coralskipper utilized the dovin basal as a means of propulsion, which became a weakness to exploit when destroying the coralskipper. When propelling the craft, the dovin basal was not capable of defending the craft as efficiently as it could when remaining stationary."}, {"tag": "p", "text": "Coralskippers were strictly space vehicles, and performed poorly in planetary atmospheres. Coralskippers were not capable of traveling for long-range travel in space and had to rely on a larger vessel to transport them across long distances."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first recorded cases of of the Yorik-et craft was during the initial stages of the Yuuzhan Vong invasion in 25 ABY, which was spearheaded by the Praetorite Vong who had brought thousands of such fighters onboard their worldships to the ice planet of Helska IV. The Dozen-and-Two Avengers first encountered the craft and were left with only a single survivor of the attack when the vessels' dovin basals were used to strip the shields from the enemy craft. They were later used in an attack on the planet Dubrillion, though they were repulsed by the planetary defenders. A single downed Yuuzhan Vong craft was later examined by Lando Calrissian; the evaluation gave an insight into the extragalactic invaders and their technology. During the Battle of Helska IV, the coralskippers were coordinated by a Yammosk, which destroyed numerous New Republic starships before the ice planet of Helska IV was destroyed in a New Republic attack."}, {"tag": "p", "text": "These vessels fought throughout the Yuuzhan Vong War. In the last year of the war, a new type of fighter was developed to support Supreme Overlord Shimrra's Slayers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}