{"url": "Yomin_Carr", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Domain Carr", "Category:Males", "Category:Yuuzhan Vong warriors"], "nodes": [{"tag": "h1", "text": "Yomin Carr"}, {"tag": "p", "text": "Yomin Carr was a male Yuuzhan Vong who belonged to the warrior caste. Tasked as an advance agent, he was sent by the Praetorite Vong political faction to a new galaxy in preparation for the Yuuzhan Vong's imminent invasion. Masquerading as a Human male, Carr joined the research team at the ExGal-4 station on Belkadan in 25 ABY, where a group of scientists were searching for life outside the known galaxy. Keeping his origins and his goals a secret from those around him, he waited for a Yuuzhan Vong worldship that he knew would enter the galaxy at the point known as Vector Prime at a predetermined time. After it was spotted entering from the Intergalactic Void, Carr convinced the others on Belkadan that it was likely no more than an asteroid, per his orders from Prefect Da'Gara, a leader of the Praetorite Vong."}, {"tag": "p", "text": "However, a team of three went to investigate the occurrence from a position on Helska IV despite Carr's explanation. During their investigation, the ExGal-4 team was abducted by the Yuuzhan Vong; meanwhile, on Belkadan, Carr utilized dweebits—an insect-like Yuuzhan Vong lifeform—to convert the atmosphere to toxic gases. Carr also disabled communications, and while the gases killed those who ventured outside, Carr, revealing himself as an alien enemy, slaughtered the others. However, the Jedi Masters Luke and Mara Jade Skywalker arrived on the planet soon after, having received a distress signal. Following their landing on Belkadan, Jade entered into a fierce duel with Carr, eventually killing the Yuuzhan Vong warrior."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "Yomin Carr of Domain Carr was a male Yuuzhan Vong of the warrior caste, and a member of the Praetorite Vong, the advance group sent to prepare for the planned invasion of the galaxy. On the orders of Prefect Da'Gara, one of his superiors, he joined the research team at ExGal-4 on Belkadan, using an ooglith masquer to disguise himself as a Human and a tizowyrm to enable him to understand Basic, the standard language of the galaxy. The station was staffed by several individuals, led by the scientist Danni Quee, and they were hoping to find extragalactic life."}, {"tag": "p", "text": "Carr was known by his fellow station workers as a very diligent worker, always arriving early, and staying late. He was also distant from the others, rarely joining them for dinner or games they played to alleviate boredom. One member of the team, a Twi'lek named Tee-ubo Doole, was attracted to Carr, whom she believed was a mysterious-natured Human. Little did the crew know that Carr was plotting to betray and kill all of them to prevent word of the Yuuzhan Vong invasion from spreading. Carr had chosen the ExGal-4 site because he knew the location where the Yuuzhan Vong ships would enter the galaxy, a small hole in the border separating the galaxy from the Intergalactic Void, known as Vector Prime."}, {"tag": "p", "text": "In 25 ABY, after Carr had been working at the station a short time, he spotted an object that broke through from outside the galaxy, signaling the start of the invasion. Carr contacted Executor Nom Anor, another Yuuzhan Vong stirring up unrest in another part of the galaxy, and informed him that the invasion had begun. Under orders from Anor, he then sabotaged the station's communications tower. He also released several dweebits, beetle-like life forms that would drain the atmosphere of oxygen, releasing poisonous gases into it instead. As he re-entered the room, he was greeted by Danni Quee, who informed him that they had spotted an extragalactic object. Carr feigned curiosity, as the group debated over the nature of the object. They eventually came to the conclusion that it was an asteroid. However, some still argued that it was impossible for an object to enter from outside the galaxy, arguments spurned by Carr, who said that it could be an asteroid reflected off the border. He insisted that they make sure it was extragalactic before contacting the New Republic, so as to avoid possible embarrassment in case it was not from outside the galaxy. However, the rest of the team remained ignorant as to Yomin Carr's true goal."}, {"tag": "h3", "text": "Sabotage"}, {"tag": "p", "text": "The team decided to send three people in the old Spacecaster ship assigned to the outpost. Danni Quee would go, and she asked Carr if he would like to accompany her, feeling that he deserved it for his diligent work. However, Carr declined, claiming that as he had only worked there for a short time, there were several more worthy than him. His real reason was simply that he had to eliminate the rest of the crew, and he had orders not to come near the Yuuzhan Vong base. Eventually, it was decided that two others, Bensin Tomri and Cho Badeleg, would go with Quee."}, {"tag": "p", "text": "Before the ship took off, Carr went to work on it, on the guise of repairing the pressure pump. However, he was actually sabotaging the vessel, disabling the communications. Carr then went to his room, where he contacted Prefect Da'Gara using a villip, a Yuuzhan Vong communication device. He informed Da'Gara that a team was heading for Helska IV, where the \"asteroid\" had crashed. Da'Gara promised to crush them, although when Carr informed him that the woman called Danni Quee was worthy of an honorable death, the prefect agreed to grant her that honor. Carr also assured Da'Gara that the other workers would be dead within a few days."}, {"tag": "p", "text": "Shortly after ending this conversation, Garth Breise knocked on Carr's door. The station transmitter had not been working, and so Breise and Carr had been given the job of fixing it to allow the station to send communications. Carr knew that it was his sabotage which was causing the tower's electronics to fail. He could also smell the methane/sulfur mix released by the dweebits, but was aware that it had not yet reached critical levels, and that no one else could smell it. Breise found several broken cables at the base of the tower, and as there were several dweebits massing around the building, he believed they were the cause of the troubles. The two climbed up the communications tower, watching the Spacecaster lift off as they reached the top. As soon as it passed out of sight, Carr turned on Breise, forcing him off the tower, to fall one hundred meters to the bottom. Watching him fall, Carr felt gleeful, although he regretted that Breise might land on some of the dweebits, which he considered his pets."}, {"tag": "p", "text": "Four station workers then set out after receiving a call from the Spacecaster, warning them of strange clouds approaching. After Breise's body had been discovered, they had decided to investigate the massive storm, actually toxic clouds of methane and sulfur. The group soon realized it was poisonous and deadly to them, after their jetpacks failed to function due to lack of oxygen. The group members, realizing that someone should be able to tell the rest of the team about the toxic clouds, decided to sacrifice their oxygen so that Jerem Cadmir could make it back to warn the others. Cadmir ran into Carr on his way back. Initially delighted to see him, but his joy soon turned to horror. Carr revealed that he had caused this, and that the planet would be overwhelmed within two days. Cadmir was stunned at Carr's betrayal, but then the warrior revealed himself. Removing his ooglith masquer, he told Cadmir that for his efforts in attempting to warn the others, he deserved an honorable death. He then killed Cadmir by breaking his neck and headed back for the station, not bothering to put his disguise back on. One scientist, Lysire Donabelle, encountered him and was swiftly killed. Carr then proceeded to murder the other members of the team. Meanwhile, Yuuzhan Vong coralskipper starfighters attacked the Spacecaster above Helska IV, killing Tomri and Badeleg, while Quee was taken captive."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "A short time later, the Jedi Masters Luke and Mara Jade Skywalker arrived at ExGal-4. They had received a report from the Jedi Kyp Durron that Belkadan's communications were down, and decided to investigate. Hiding in the shadows, Carr observed the visitors, but jumped into action after seeing the droid R2-D2, which he saw as a perversion of life. Carr chased the astromech until he ran into Jade Skywalker. Carr mocked her, and then attacked, throwing a thud bug at her. Jade dodged it, and shot him with her blaster. However, his vonduun crab armor easily stopped the shot, stunning the woman. Jade then drew her lightsaber. Carr responded by throwing a dozen thud bugs, all of which she blocked. Though he attempted to stop her with adhesive blorash jelly, hoping to stick her feet to the ground and prevent her from moving. Jade was able to cut through it, freeing her feet."}, {"tag": "p", "text": "She charged towards Carr, lightsaber ready. The warrior countered with his amphistaff, a Yuuzhan Vong melee weapon. After a brief duel, during which Carr found her to be his equal, she killed him, stabbing the warrior in the heart."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Yuuzhan Vong would lose Helska IV, though Belkadan remained under their control for eventual use as a shipbuilding world. Many of the Yuuzhan Vong blamed the Praetorite Vong for the loss at Helska IV, accusing the faction of overstepping its bounds in attempting to take control of the invasion itself. When the main fleet arrived a short time later, the species retaliated swiftly, taking the war to the New Republic for what would be four long years of fighting, though the Yuuzhan Vong were eventually defeated. Carr's death helped show the Yuuzhan Vong the skill of the Jedi, who were able to best even elite warriors in combat. Mara Jade remembered him as a very fierce fighter who pushed her to the edge of her abilities."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though Carr appeared to be nothing more than a quiet Human devoted to his job on ExGal-4, he was much more. Viewed as a mysterious, silent newcomer, Carr in fact was a cunning warrior. He desired to slay all the workers at the station and had to work to keep his bloodthirsty instincts in check. However, he respected the ExGal-4 station leader Danni Quee, and so persuaded Da'Gara to grant her an honorable death. Carr would himself grant this fate to Jerem Cadmir, as he felt that the Human was strong and resourceful in returning to the ExGal compound in extreme conditions."}, {"tag": "p", "text": "Though Yuuzhan Vong despised technology used by the inhabitants of the galaxy, as it was not organic like theirs, Carr worked with this kind of technology on many occasions. Although he disliked touching it, he knew it was necessary, and so became one of the few Yuuzhan Vong to utilize non-organic technology, and even become proficient in it, able to perform maintenance on spaceships. However, Carr still despised machines, especially droids."}, {"tag": "p", "text": "Carr was very devoted to the Slayer god, Yun-Yammka, the Yuuzhan Vong god of war. He kept a small statue of the god in a coffer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yomin Carr was created for The New Jedi Order: Vector Prime, the first book in the New Jedi Order series. He plays a role similar to Executor Nom Anor, stirring up discord, albeit on a much smaller scale. Although Vector Prime notes that Nom Anor infected a group of New Republic diplomats with coomb spores, Galaxy of Intrigue mistakenly states that Carr was responsible."}, {"tag": "p", "text": "A miniature figure of Yomin Carr was designed for the Star Wars Miniatures' Alliance and Empire expansion set."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}