{"url": "Young_Jedi_Knights:_Jedi_Under_Siege", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Young Jedi Knights", "Category:1996 releases"], "nodes": [{"tag": "h1", "text": "Young Jedi Knights: Jedi Under Siege"}, {"tag": "p", "text": "Young Jedi Knights: Jedi Under Siege is a Star Wars Legends young-adult novel written by Kevin J. Anderson and Rebecca Moesta. It is the sixth volume of the Star Wars: Young Jedi Knights series, and it was first published by Berkley Boulevard on September 1, 1996. The novel was reprinted in Young Jedi Knights: The Rise of the Shadow Academy (1996) and Young Jedi Knights: Jedi Sunrise (2003)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The day of reckoning is at hand for the young Jedi Knights. The Shadow Academy—with its army of Dark Jedi and Imperial stormtroopers—has appeared in the sky over Yavin 4. And when a commando raid destroys the shield generator protecting the Jedi academy, there is only one option: to fight."}, {"tag": "p", "text": "Now Jacen and Jaina, along with Luke Skywalker and their friends, must trust in the Force and do battle with their sworn enemies—the Dark Jedi Zekk, his master Brakiss, and the loathsome Nightsister Tamith Kai. Victory means a new legacy of Jedi coming of age. Defeat means a final cloak of darkness over the entire galaxy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "An Imperial scout trooper disables the shield generator of the Jedi Academy, leaving Yavin 4 open for a swift attack. Now fully-trained Jedi with their own lightsabers, the young Jedi Knights quickly work together to stop the incoming threat. After Luke briefs all of his students for the battle to come, the twins disband to try and fix the generator and to call for help."}, {"tag": "p", "text": "While Jacen and Zekk's good friend Peckhum blast into space to send out a call for help, they are chased by TIE fighters flown by Zekk's former friends. After sending out a distress signal, Jacen and Peckhum dive back into the atmosphere of Yavin 4, about to be obliterated by TIEs. They are saved by Qorl, an Imperial pilot. Meanwhile Lowie and Tenel Ka attack the landing platform that is unloading Dark Jedi into the jungles of Yavin 4. Eventually Tenel Ka tracks down her nemesis, Tamith Kai, and engages her in a fierce lightsaber battle. Soon after the platform explodes, and while Lowie and Tenel Ka escape, Tamith Kai does not."}, {"tag": "p", "text": "Jaina, on a mission to repair the shield generator, is confronted by her former friend-turned–Dark Jedi Knight Zekk. In the end, Zekk saves the Jedi by stopping them from returning to the Academy, which is destroyed by a bomb placed in the main audience chamber. Luke tries his best to turn his former student Brakiss back to the light side, and they engage in a lightsaber duel. Luke is soon victorious, and Brakiss flees back to the Shadow Academy. But as the Jedi's reinforcements arrive—in the form of Lando Calrissian and his GemDiver Station—the Emperor's guardsmen, who have been faking the Emperor's existence, reveal the face of the Emperor. The Emperor panics and engages the Shadow Academy's self-destruct. The Dark Jedi's base is instantly destroyed, with Brakiss on it. The Jedi are battered, bruised, and barely alive, but the Dark Side has lost."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}