{"url": "Young_Jedi_Collectible_Card_Game", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Young Jedi Collectible Card Game"], "nodes": [{"tag": "h1", "text": "Young Jedi Collectible Card Game"}, {"tag": "p", "text": "Young Jedi was a card game produced by Decipher; it ended print in 2001, although the Players Comittee would continue supporting until 2003. It was designed to be an intermediary product, meant to get players between the skill level of Pokemon and SW:CCG. It was based around Star Wars: Episode I The Phantom Menace only."}, {"tag": "p", "text": "Decipher maintained a World Championship tournament for Young Jedi every year in which Decipher still had the license. The Players Committee held one year of Worlds for Young Jedi, and produced a few virtual sets, although production of virtual cards and the championship series were later dropped due to lack of interest."}, {"tag": "h2", "text": "How To Play"}, {"tag": "p", "text": "First, you build your deck. This is done with the 6x10 rule. In the lower right corner of the card are 6 circles, each with a different color. Red, Blue, Yellow, Orange, Green and Purple. A 7th deckbuilding dot was added in later, white. For more information on that, see Enhanced Menace of Darth Maul. You build a deck by getting 10 cards of each dot together. Red, Blue and Green dots are characters. Orange is Weapons and Yellow are battle and effect cards. Purple is your locations (of which you have to have one of Tatooine, Naboo and Coruscant) and star fighters and transports. Once that is done, you have a deck. Next, you get an opponent who has a deck of the opposing side. If you are Dark Side, then your opponent builds a Light Side deck. To find out which planet you will be on, you both draw \"destiny.\" Turn over the first card on the deck, look at the number in the upper right hand corner. It should be in a blue or red die (this is supposed to be Watto's Chance cube). The highest number wins and chooses a location. The location is placed horizontally in between each player."}, {"tag": "p", "text": "After choosing a location, you then draw 6 cards. There are three phases to each turn. The first phase is \"deploy.\" You get up to 6 \"counters\" a turn. Those are the little silver bars under the small picture in the corner. Certain effect cards modify this, but you generally get six counters a turn. You only deploy Character, Effect and Weapon cards to the field. If this is the first turn, you deploy face down. This is a FIRST TURN ONLY MOVE. After this, you deploy face up until the next planet hits the table. It is called the \"hidden card rule.\" Battle cards, rimmed in red, only deploy during combat. Characters and weapons are placed at the location card, effects are played on the table either to your right or left, but not near the location. As of the \"Duel of the Fates (YJCCG)\" card game, you can take your starships and transports and put them into a \"hyperspace\" pile. This gets them out of your hand, and it doesn't cost any counters. You can also transport characters off the old planets during this step. If you have any transports either in your hand or in your hyperspace pile, you can initiate \"starship combat\" by attempting to evacuate your old characters. Your opponent can \"intercept\" your transport. Several battle cards were created during Duel of the Fates (YJCCG) expansion that deal specifically with starship combat. If your transport is successful, you place that transport in the discard pile, but all characters and weapons go back on the bottom of your reserve deck. If you weren't successful, you place the ENTIRE transport pile in the discard pile AND take the damage listed on the card."}, {"tag": "p", "text": "Which is the second phase of the turn, combat. You can only do this turn if your cards are no longer \"hidden,\" and you have characters there (see next step, even up). Battle is simple. You declare a battle. You take your characters and weapons deployed on the current planet and make a 'battle plan.' Your opponent will do the same. You also call out the number of 'battle cards' you wish to use. Going from left to right, and bottom to top you create your plan. The bottom-most card will the first, since after your plan is done you put it FACE DOWN. The proper order of cards in the plan are \"Battle, Weapon and Character.\" So, if you want Darth Maul fighting first with his lightsaber and a battle card, the proper order would be \"Battle Card, Darth Maul's Lightsaber and Darth Maul.\" Once your plan is in place, you then put them face down to the left of the location card on the table."}, {"tag": "p", "text": "Flip the cards over and if you have any \"chance cubes\" with ? marks in them, you draw destiny for those cubes. You total the power, and your opponent does the same, and whoever has the highest total power wins that combat. If your character lost, you take \"damage\" from your deck. Place the card (and any weapon/battle cards) in the discard pile and take the top cards (=to the damage number listed in the lower left of the card that was defeated) and place them in your discard pile. You can't get them back, by the way. Rinse and repeat until all cards have gone. If you are the ATTACKER (ie, you instigated the fight), and you have cards left over at the end of combat, your opponent takes \"breakthrough\" damage. You count the number of cards left (not including any weapon cards or battle cards [which just get discarded at the end of the phase]) and your opponent takes that many cards off the top of their reserve deck and places them in the discard pile. It pays to attack. Also, any destiny draws go to your hand."}, {"tag": "p", "text": "The final phase is Even up. This is where you draw cards up to six, or discard down to six. Also, you can discard your ENTIRE hand and draw back up to six. Either way, you need to have six cards in your hand. Also, this is where you check your..."}, {"tag": "h2", "text": "Victory Conditions"}, {"tag": "p", "text": "You can win one of three ways:"}, {"tag": "h2", "text": "Expansions"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}