{"url": "Young_Jedi_Knights:_Shadow_Academy", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: Young Jedi Knights", "Category:1995 releases"], "nodes": [{"tag": "h1", "text": "Young Jedi Knights: Shadow Academy"}, {"tag": "p", "text": "Young Jedi Knights: Shadow Academy is a Star Wars Legends young adult novel written by Kevin J. Anderson and Rebecca Moesta. It is the second volume of the Star Wars: Young Jedi Knights series, and it was first published by Berkley Boulevard on September 1, 1995. The novel was reprinted in Young Jedi Knights: The Rise of the Shadow Academy (1996) and Young Jedi Knights: Jedi Shadow (2002)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Dark Jedi Brakiss—the student Luke Skywalker expelled from his academy—has learned much since he left. Enough to master the dark side of the Force. And enough to establish his own school for training Jedi—the Shadow Academy."}, {"tag": "p", "text": "But now Brakiss has been given an even greater task. Not only must he create a sinister legion of Dark Jedi to serve the Empire, he must undertake a challenge not even Darth Vader and the Emperor could meet: Kidnap the heirs of the Skywalker bloodline, and turn them to the dark side of the Force…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While on a tour of Lando Calrissian's GemDiver Station, Jacen, Jaina, Lowbacca, and Em Teedee are caught in the middle of an Imperial raid and kidnapped. After being informed of what happened by Lando, Luke Skywalker embarks upon a rescue mission in search of the missing Jedi trainees. Feeling guilty because she was not with her friends and therefore could not help them, Tenel Ka accompanies him."}, {"tag": "p", "text": "Meanwhile, aboard an assault shuttle that figured prominently in the attack on GemDiver Station, the Solo twins and Lowbacca meet Tamith Kai, the woman who led the attack. The students learn from her that their destination is the \"Shadow Academy\" where they will be trained to use the dark side of the Force in the service of the Second Imperium. Once they arrive at their destination, Brakiss, one of Luke's former students and the headmaster of the Shadow Academy greets them and reiterates most of what Tamith Kai told them. Jacen, Jaina and Lowbacca are then confined to their own separate cells."}, {"tag": "p", "text": "Because GemDiver Station, and by extension Lando's Corusca gem broker, was the only way that the kidnappers could obtain the industrial-grade gems that were used to drill through the station's thick hull, Luke and Tenel Ka travel to Borgo Prime under the assumed names of \"Iltar\" and \"Beknit.\" They make their way through the seedy spaceport to an even more disreputable bar named Shanko's Hive. Several bribes later, they finally meet Lando's broker, whose professional ethics are tossed out of a viewport when presented with a bribe. Luke and Tenel Ka learn that a Nightsister purchased many industrial-grade gems from him. The pair leave and make haste to Dathomir."}, {"tag": "p", "text": "At the Shadow Academy, Brakiss and Tamith Kai attempted to sway the three Jedi trainees into using the dark side of the Force. After they disrupted Brakiss's attempts to extol upon the virtues of the dark side of the Force, Jacen, Jaina, and Lowbacca were once again separated. Splitting the training of the new recruits between each other, Brakiss took charge of Jacen and Jaina while Tamith Kai focused her efforts on Lowbacca."}, {"tag": "p", "text": "Brakiss believed that the best way to indoctrinate the twins would be to give them what they want. Knowing that one of Jacen's desires is to have his own lightsaber, Brakiss gave him one and allowed him to practice with it, dueling the Shadow Academy's holo-remotes. Jaina is made to do the same thing, however, she quits, insisting that she wants to see her brother again. Brakiss informed her that she may see her brother after one more dueling session. During this session, Jacen was brought into the training room. However, both of them were disguised as Darth Vader by the training room's holoprojectors."}, {"tag": "p", "text": "Qorl, the TIE/LN starfighter pilot who sparked the kidnapping attempt by relating his encounter with the Solo twins to Brakiss after returning to \"his Empire\" questioned the wisdom of making the twins duel each other. Brakiss, initially unreceptive to the criticism, decided that Qorl's concerns have merit and orders the holoprojector to be turned off. The twins, both drawing upon their anger toward Brakiss and Tamith Kai to bolster their strength were shocked to discover that they are battling each other. With that the duel ends."}, {"tag": "p", "text": "Tamith Kai utilized her penchant for sadism in her efforts to turn Lowbacca to the dark side. After Jaina was punished by Brakiss for disrupting his lecture, Lowbacca belied his tendency to be quick to anger. Tamith Kai decided to exploit this anger by subjecting him to unbearable temperatures, flashing lights, ice cold jets of water, and ear-piercing sounds emanated from a hardened sonic generator. She informed him that the only way that he will be able to end his ordeal will be to damage the sonic generator. The only way to do that will be to tap into the dark side. Despite Lowbacca's attempts to project a strong sense of resolve, they end up coming to naught when he gives up and smashes the sonic generator beyond repair. Tamith Kai later rewarded Lowbacca by giving Em Teedee back to him. However, the little droid had been reprogrammed to be loyal to the Second Imperium. \"The Empire is your friend,\" the Em Teedee said. However, the words of the little droid had the opposite effect of what was intended on Lowbacca. The young Wookiee reaffirmed his commitment not to be indoctrinated."}, {"tag": "p", "text": "On Dathomir, Luke and Tenel Ka told the Council of Sisters of the Singing Mountain Clan that the two of them must be allowed to infiltrate the Nightsisters in order to find the twins and Lowbacca. The Council was at first hesitant to allow them to do so, but a visit by two recruiters from the Great Canyon Clan—the clan of the Nightsisters—convinced them to allow Luke and Tenel Ka to do so. After an overnight journey, the pair made it to the Great Canyon Clan's encampment, passing themselves off as willing recruits for the new order of Nightsisters. After being tested for their aptitude in control of the Force, Luke and Tenel Ka were picked up by a quantum armored supply shuttle named the Shadow Chaser."}, {"tag": "p", "text": "While aboard the Shadow Chaser, Luke and Tenel Ka were subjected to further tests by Garowyn, the Nightsister who captained the vessel. From Garowyn they learned where they were being taken: the Shadow Academy. Since the course to the Shadow Academy had already been programmed into the navicomputer by Garowyn, it was safe for Luke to hurl her into an escape pod and jettison it. The Shadow Chaser finally reached its destination and reverted out of hyperspace in the middle of nowhere. The Shadow Academy then decloaked right in front of them, its hangar doors opening."}, {"tag": "p", "text": "After yet another sadistic exercise, Jacen decided that it was time for him to escape from the Shadow Academy with Lowbacca and his sister. He broke out of his cell and freed his sister and his friend. Despite his new-found loyalty to the Second Imperium, Em Teedee helped them escape as well, but in the process set off an alarm which alerted Qorl, and in turn, Brakiss and Tamith Kai to the escape attempt. The Jedi trainees made their way to the hangar where a recently arrived vessel had landed. They were surprised to see Luke and Tenel Ka exit the vessel. They got into the Shadow Chaser while Luke and Tenel Ka went about the task of closing the doors to the hangar bay."}, {"tag": "p", "text": "In the process of doing so, Luke and Tenel Ka encounter a squad of stormtroopers, as well as Brakiss and Tamith Kai. The threats are dealt with but the docking bay's space door will not open for them. However, Qorl, believing that the new recruits have been more trouble than they are worth, decides to let them go free. The Shadow Chaser vanishes into hyperspace as recriminations fly between Brakiss and Tamith Kai."}, {"tag": "p", "text": "Back at Luke's Jedi Praxeum, Lowbacca and Jaina set about the task of creating a schematic of the Shadow Chaser, which her mother allowed Luke to have. Meanwhile, Jacen tells Luke that his time at the Shadow Academy taught him that he is not ready for the responsibility that comes with having a lightsaber of his own. Luke ominously predicts that because Brakiss is intent on forming a new order of Dark Jedi, Jacen might have to develop that responsibility all too soon."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}