{"url": "Young_Jedi_Knights:_Return_to_Ord_Mantell", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Young Jedi Knights", "Category:1998 releases"], "nodes": [{"tag": "h1", "text": "Young Jedi Knights: Return to Ord Mantell"}, {"tag": "p", "text": "Return to Ord Mantell is the twelfth book in the Star Wars: Young Jedi Knights series. It includes a twelve-page preview of the next book in the series, Trouble on Cloud City."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Jacen and Jaina"}, {"tag": "p", "text": "When the Galactic Empire died, they were born—a new hope for the New Republic. The young twins of Han Solo and Princess Leia have grown strong with the Force, thwarting the evil Nolaa Tarkona and destroying the Emperor's Plague. Now, with their friends Lowbacca the Wookiee and Tenel Ka, the future heroes of an already legendary saga continue their training."}, {"tag": "p", "text": "Han Solo's past is about to catch up with him. When he and the twins take the Millennium Falcon to Ord Mantell for a high-speed race, they meet a battle-hungry woman wielding a lightsaber. Her name is Anja Gallandro, and she knows more about Han's history than he likes. But Anja Gallandro guards an even more devastating secret—a secret that could mean disaster for the entire Solo family."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Having survived encounters with the Second Imperium and the Diversity Alliance, the Solo twins and their father Han Solo, along with fellow Jedi trainee Zekk, journey to Ord Mantell on the Millennium Falcon to participate in the Blockade Runners Derby. At the Derby, they encounter Anja Gallandro, who reveals that she is the daughter of Gallandro, a former enemy of Han Solo. However, she guards an additional, deadly secret that could be disastrous for the Solos."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Young Jedi Knights: Return to Ord Mantell gives Jaina and Jacen Solo's age as sixteen years old. However, since Return to Ord Mantell is set in 24 ABY and they were born in 9 ABY, the Solo children cannot be older than fifteen."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}