{"url": "Young_Jedi_Knights:_Lightsabers", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Book stubs", "Category:Incomplete lists", "Category:Star Wars: Young Jedi Knights", "Category:1996 releases"], "nodes": [{"tag": "h1", "text": "Young Jedi Knights: Lightsabers"}, {"tag": "p", "text": "Young Jedi Knights: Lightsabers is the fourth book in the Star Wars: Young Jedi Knights series."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Publisher's summary"}, {"tag": "p", "text": "Luke Skywalker has come to a grim conclusion. With the threat of a new generation of Dark Jedi being trained at the Shadow Academy, he knows the New Republic will need all the fighters it can muster. At last, it is time for the young Jedi Knights to build their lightsabers."}, {"tag": "p", "text": "But there is more to mastering the ancient weapon than mere swordsmanship. Each student must learn about the mysterious bond between Jedi and lightsaber. For Jacen and Jaina, success will mean growing stronger in the Force. But for one of their friends, failure will mean tragedy..."}, {"tag": "h3", "text": "Plot summary"}, {"tag": "p", "text": "With the growing threat of the Second Imperium and the Dark Jedi being trained at the Shadow Academy, Luke decides, against his better judgment, to accelerate the training of his students, and asks them to build and start using their own lightsabers. The young Jedi Knights proudly rise to the challenge, but tragedy strikes when Jacen injures Tenel Ka while sparring, resulting in the loss of her arm. The princess is carried back to Hapes in shock."}, {"tag": "p", "text": "On Hapes, Tenel Ka is once again exposed to her grandmother Ta'a Chume's schemings, as the old woman tries to initiate her to Hapan politics, and persuade her to renounce her Jedi training. Jacen, Jaina and Lowbacca arrive later in a welcome respite, but this does not last; after an unknown assassin detonates a bomb in the royal palace, Ta'a Chume determines that their lives are all in danger, and she and the Jedi trainees retire to an isolated Island in the middle of the Hapan ocean."}, {"tag": "p", "text": "Even there, however, they are not safe; they barely escape another assassination attempt from a group of Bartokk killers. Upon their return to the mainland, the Queen Mother orders Ambassador Yfra, who was responsible for the attacks, arrested. Tenel Ka has determined that she wishes to continue her training, and returns to Yavin 4 with her friends, and constructs a new lightsaber."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Lightsabers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}