{"url": "Ysalamir", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Arboreal creatures", "Category:Creatures of Myrkr", "Category:Domesticated creatures", "Category:Force-sensitive creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Lizards", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Ysalamir"}, {"tag": "p", "text": "Ysalamiri were lizard-like tree-dwellers about 50 centimeters in length native to the planet Myrkr, most known for their ability to repel the Force by creating a Force-neutral bubble. This ability evolved in response to predation by the Force-sensitive vornskrs. Many ysalamiri grouped together would expand their Force-neutral bubble by varying distances – sometimes by kilometers."}, {"tag": "h2", "text": "Anatomy"}, {"tag": "p", "text": "Adult ysalamiri grew up to 50 centimeters and hatched their young from bubble-like eggs."}, {"tag": "p", "text": "Ysalamiri sank their claws into the Olbio trees on which they lived and drew nutrients. It was very difficult to remove a ysalamir from its tree without killing it, although Talon Karrde's smugglers found a way, enabling Grand Admiral Thrawn to do it as well. Thrawn used ysalamiri for defense by attaching them to a back harness or a nutrient frame which allowed him and his men to remain safely inside the ysalamiri's Force repelling bubble. He used this trick to gain the attention of cloned Dark Jedi Master Joruus C'baoth and accelerated the Spaarti cloning process without the usual side-effects (which occurred when similar Force imprints interfered with one another)."}, {"tag": "p", "text": "Ysalamiri did not actually negate the Force; since all existence was infused with Force energy, this would not be possible. Rather, they projected a bubble inside which users were unable to exert any influence over the Force. A single bubble measured up to 10 meters in diameter; large groups of ysalamiri could extend their collective bubble by kilometers, but only in great numbers."}, {"tag": "p", "text": "Miriskin was a commodity supposedly made from ysalamir skin."}, {"tag": "h2", "text": "Ysalamiri in culture"}, {"tag": "p", "text": "Having long admired the tenacity of the ysalamiri, the Jedi Order named a form of lightsaber combat, Makashi, after the creature."}, {"tag": "p", "text": "Tyber Zann was known for keeping ysalamiri in cages to prevent Force users from being able to cause too much damage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ysalamiri first appeared in the 1991 novel Heir to the Empire by Timothy Zahn. According to Zahn, the idea of a creature that could impede a Jedi's access to The Force was the first idea he had for the story after hearing from his agent about the offer to write a book series that continued the story of Star Wars after Star Wars: Episode VI Return of the Jedi. The author initially received many complaints from readers regarding Thrawn's explanation in Heir to the Empire that ysalamiri could \"push back\" the Force on the grounds that the Force was created by all living beings and could not be \"pushed back\" in that manner. He would clarify that Thrawn's explanation was inaccurate and ysalamiri simply supress the level of the Force present, a distinction that was later shown more clearly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}