{"url": "Beware,_the_Gamorrean_Flu!", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "Beware, the Gamorrean Flu!"}, {"tag": "p", "text": "\"Beware, the Gamorrean Flu!\" is the last of five animated short videos released on May 4, 2017 to promote the second season of LEGO Star Wars: The Freemaker Adventures. It was released on the LEGO Star Wars website. On June 17, \"Beware, the Gamorrean Flu!\" and the other four short videos were released in an omnibus episode called \"A New Home\" that was released on the LEGO Star Wars website."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Freemakers undertake a daring mission to save two of the Rebellion's finest heroes: LANDO CALRISSIAN and CHEWBACCA."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Aboard the Home One, Admiral Ackbar is visited by Rowan, Kordi, and Zander Freemaker, who inform him that they have experienced very few accidents. Kordi adds that they had no accidents yesterday and notices that the Admiral seems upset about something. Admiral Ackbar informs them that two of their best agents are trapped behind an Imperial blockade. Without a fuel intermixer, they are stranded. Even if they had one, Ackbar doubts that they can reach the rebel agents."}, {"tag": "p", "text": "Zander, Kordi, and Rowan volunteer and joke about getting arrested. The Freemakers fly the StarScavenger towards the blockade. They soon encounter a Gozanti-class cruiser. The Imperial officer aboard tells them to prepare to be boarded. However, the Freemakers have prepared for this scenario and pretend to be sick with the Gamorrean flu. The Imperials cut their way aboard the StarScavenger and are led by Durpin and Plumestriker, the Imperial officers whom the Freemakers had encountered earlier on Kashyyyk and Hoth."}, {"tag": "p", "text": "Plumestriker recognizes the Freemakers as being on the Empire's Most Wanted list. Durpin announces that they are under arrest. Pretending to be sick, Kordi begs for help and claims they have contracted the Gamorrean flu. Zander and Rowan play along. Durpin is convinced and starts to panic. However, Plumestrike points out that humans cannot catch the Gamorrean flu and orders the stormtroopers to arrest them and confiscate their cargo, which turns out to be a sealed container. Durpin begins to feel sick and asks Plumestriker to check if he has a fever."}, {"tag": "p", "text": "The Freemakers are thrown into a holding cell aboard Durpin and Plumestriker's Gozanti cruiser. However, Kordi and Rowan joke that the Imperials won't expect what is coming next. Rowan uses the Force to levitate Roger out of the cargo box and to reassemble him. Outside, the stormtroopers wish that something unexpected will happen. Roger knocks out the guards with one of his legs and frees the other Freemakers. Kordi sends Zander and Roger to the engines to power up the ship."}, {"tag": "p", "text": "Roger complies but trips over one of the unconscious stormtroopers. Rowan then retrieves his lightsaber from the cargo box and uses it to cut a hole in the panel and steal the fuel intermixer. This causes the ship to lose power. The Freemakers escape the Gozanti cruiser aboard the StarScavenger while Durpin panics about contracting Gamorrean flu. He asks Plumestriker to feel his glands. Plumestriker sighs."}, {"tag": "p", "text": "Meanwhile, the Freemakers land on the planet and are greeted by a grateful Chewbacca and Lando Calrissian. Chewbacca roars and hugs them. The StarScavenger and the Millennium Falcon then fly back to the rebel flagship Home One. Lando thanks them for helping him twice and credits Ackbar with recruiting them. The Freemakers are proud to help the Rebel Alliance, and Rowan thanks the rebels for giving them a home. Roger interjects to reveal that he left one of his legs behind on the Imperial cruiser and asks if they could go back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}