{"url": "Yub_Nub!", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: All-Stars"], "nodes": [{"tag": "h1", "text": "Yub Nub!"}, {"tag": "p", "text": "Yub Nub! is the sixth episode in the LEGO Star Wars: All-Stars television series. It debuted on November 10, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "At the Resistance base on the planet D'Qar, Rose Tico is struggling with a hypershaft coil on an MG-100 StarFortress SF-17 bomber. When Rose asks for help, Roger says he sure can. When Rose asks him to help her tighten the hypershaft coil, Roger says that his help won't come in the form of physical labor but rather a valuable life lesson of persistence. Rose says she doesn't have time for it but Roger proceeds to read \"Yub Nub\", Chapter 299 of his autobiography From Trenches to Wrenches: The Roger Story."}, {"tag": "p", "text": "Following the destruction of the second Death Star, spirits were high among the rebels and Ewoks at Bright Tree Village on Endor. An Ewok playing drums with stormtrooper helmets accidentally knocks Roger in the head. Roger complains his head is not a percussion instrument and says that all this rattling are depleting his energy reserves."}, {"tag": "p", "text": "An Ewok child offers him a bowl but Roger tells him that he prefers something more ion–based. The Ewok walks away and comes back with a charging cable. As Roger charges up, he tells the Ewok child that they are going to be best friends forever. The Ewok hugs him and sits on his lap."}, {"tag": "p", "text": "The following morning, Zander Freemaker wakes up Roger and tells him they have got places to be. The Ewok child asks Roger to stay but he apologizes and says duty calls. The Freemakers depart in the StarScavenger. Roger tells Kordi and Rowan Freemaker that he is going to miss that little guy. Just then, the Ewok resurfaces. Zander warns Roger that he knows their rules about Ewoks while Rowan adds that the Ewok child belongs to his family."}, {"tag": "p", "text": "Roger brings the young Ewok home and tells him \"I go and you stay.\" The Ewok child tries to follow but Roger tells him to stay. The distraught Ewok says \"Yub Nub.\" Returning to the StarScavenger, Roger breathes a sigh of relief and says that is the hardest thing he has ever done. However, the Ewok still stows aboard the ship. In desperation, Roger ties him to a tree but the Ewok child still follows. Roger then dumps him outside the village before taking off in a 74-Z speeder bike."}, {"tag": "p", "text": "Returning to the present, Roger tells Rose \"he was sorry to leave the little Ewok behind but that sometimes you have to be...\" Roger is interrupted by the Ewok who clings on to him. Rose finishes off that he has to be persistent. Roger finishes by saying \"Yub Nub.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}