{"url": "Bevven", "categories": ["Category:Legends articles", "Category:Imperial Navy officers of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bevven"}, {"tag": "p", "text": "Bevven was a commodore serving in the Imperial Navy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Commodore Bevven was in command of the Imperial Navy element during the raid on Picutorion, alongside High Colonel Theol Drost. During the battle, Tensiger's 6th regiment penetrated an Alliance to Restore the Republic-held tracking station, although the Alliance were resisting heavily with BTL Y-wing starfighters flying top cover. Bevven and Drost discussed the tactical ramifications of deploying TIE/LN starfighters to support the ground assault; Bevven was afraid that the Y-wings would decide to assault the fleet and wanted to send the fighters in waves to make attack runs and then return, while Drost knew that picking off the Y-wings piecemeal would endanger the ground assaults. As Bevven began to order TIE reinforcements to launch, he was interrupted by Mar Barezz, an officer of the Imperial Security Bureau."}, {"tag": "p", "text": "Barezz relayed information to Bevven and Drost that two of the troopers in the ground assault, Captain Ganig and Sergeant Stecker, were tagged as \"sensitive\" by the ISB for failing to observe doctrine and being in contact with a suspected Alliance sympathizer named Linds. Barezz had no proof that either man planned to defect, but they had been decorated as heroes by the Commission for the Preservation of the New Order for their actions during the Battle of Sagma, and Barezz was sure they would be decorated again if they captured the tracking station. He suggested that the TIE reinforcement be delayed until Ganig and Stecker were dead. Bevven looked to Drost for consent as the troopers were his to command, then ordered the TIE reinforcements to delay their assault for ten minutes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}