{"url": "Yushyn", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Mining Guild employees", "Category:Moyn"], "nodes": [{"tag": "h1", "text": "Yushyn"}, {"tag": "p", "text": "Yushyn was a Moyn male who worked as the boss of a Mining Guild Asteroid Belt Gas Refinery around the year 3 BBY. Staffed by Rodian employees, Yushyn's facility refined Clouzon-36 gas, which was used as fuel by the Galactic Empire. When a group of space-faring creatures called purrgil began eating the gas, he ordered his staff to kill them to prevent losing the resource."}, {"tag": "p", "text": "During a round of purrgil shooting, the refinery was attacked by a band of rebels who were trying to steal some of the fuel for the Rebellion and their own starship, the Ghost. Yushyn was dragged down into the planetoid's depths by a purrgil during the confrontation, which ended with the rebels destroying the refinery and making off with the fuel."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mining Guild boss"}, {"tag": "p", "text": "Around 3 BBY, the Moyn Yushyn was under the employ of the Mining Guild as the boss of an Asteroid Belt Gas Refinery built on a small planetoid in the far reaches of space. The facility was used to collect and refine Clouzon-36 gas and was staffed by members of the Rodian species."}, {"tag": "p", "text": "When a herd of deep-space creatures called purrgil approached the facility to feed on the gas, Yushyn sent out a pair of the Guild's modified TIE fighters to destroy them. Yushyn later found two of his Rodian workers firing on the purrgil from the refinery with one of the base's blaster cannons and questioned why the creatures were still present. After learning that his starfighters had stopped responding to hails, he demanded that the cannons in the base keep firing on the purrgil until all of them were dead. The TIEs had, in fact, been destroyed by the Ghost, a rebel starship. Its crew was searching the area for the refinery with plans to steal its fuel for their own ship and the rest of the Rebellion's Phoenix Squadron. Using the purrgil as a distraction, three members of the Ghost's crew dropped into the refinery from the ship's position in the planetoid's upper atmosphere and began battling the Rodian workers."}, {"tag": "h3", "text": "Battling the rebels"}, {"tag": "p", "text": "While Jedi apprentice Ezra Bridger covered the rebels on a captured cannon, his Master, Kanan Jarrus, and the Mandalorian Sabine Wren began securing a landing zone for the Ghost to begin refueling. Having been alerted to the attack, Yushyn ordered his men to protect a shipment of Clouzon-36 fuel destined for the Galactic Empire at all costs and then made his way out of the refinery to join the battle. Ordering his remaining two fighters to launch and attack the rebels, who were attempting to load the Imperial shipment onto the Ghost, Yushyn demanded that the thieves surrender to him. The fighting ceased momentarily as the refinery boss waited for the rebels' answer, but it erupted again when the purrgil emerged from the Clouzon-36 surrounding the refinery and attacked the Guild TIE fighters, having allied with Bridger."}, {"tag": "p", "text": "Yushyn ordered his men to concentrate fire on the Ghost rather than the purrgil when he saw that the rebel crew had finished loading the shipment and were taking off. Heading off on his own to try and provide cover for his men, Yushyn suddenly found himself trapped on one of the refinery's walkways between a pair of purrgil. He yelled at the creatures and attempted to leap from the walkway after one lunged at him but was grabbed up in its mouth and dragged down into the planetoid's depths beneath the refinery. Having collected the fuel they needed, the rebels then fired upon the refinery from the Ghost and destroyed it, leaving the planetoid alongside the purrgil, who had consumed their share of gas."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The famously grumpy Yushyn led the operation at the Mining Guild refinery with an unrelenting fervor and was an overbearing boss, speaking Galactic Basic Standard to his Rodian workers. He considered the purrgil disgusting and coldly ordered his men to kill them in order to stop them from consuming gas. Yushyn was covered in brown fur and skin, and had two black eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Yushyn wore a turquoise-and-yellow uniform that closely matched the outfits worn by the Rodian employees of the Mining Guild refinery. Unlike the Rodians, Yushyn's uniform featured a white utility vest with two pouches at his upper torso and the Mining Guild logo adorned on the front and back. Yushyn also wore a pair of black boots. He flew in a Mining Guild TIE fighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yushyn first appeared in \"The Call,\" the fifteenth episode in the second season of the animated television series Star Wars Rebels, which first aired on February 10, 2016. He was voiced by Fred Tatasciore, who also provided dialogue for one of the episode's Rodian workers."}, {"tag": "p", "text": "The character's design was based on a piece of alien bounty hunter concept art drawn by Ralph McQuarrie for Star Wars: Episode V The Empire Strikes Back. Concept art of Yushyn for Star Wars Rebels was produced by artist JP Balmet. The 2016 magazine Star Wars: Build the Millennium Falcon 64 erroneously refers to Yushyn as a Rodian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}