{"url": "Yuuzhan_Vong_empire", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Outer Rim Territories governments", "Category:Slaver organizations", "Category:Yuuzhan Vong Empire"], "nodes": [{"tag": "h1", "text": "Yuuzhan Vong empire"}, {"tag": "p", "text": "The  Yuuzhan Vong empire, also known as the Empire of the Yuuzhan Vong, was a theocracy of Yuuzhan Vong tribes, an\nextra-galactic species emerging from another galaxy. Functioning as a theocracy presided by a god-king, the Supreme Overlord was the Yuuzhan Vong's link to their gods, and the only one capable of addressing Yun-Yuuzhan."}, {"tag": "p", "text": "After several decades of preparations, scouting and provocations, the Yuuzhan Vong swiftly conquered much of the Outer Rim. Opposed by the New Republic, the Yuuzhan Vong then launched a devastating invasion of the New Republic and  eventually established a vast, if short-lived, dominion over the galaxy."}, {"tag": "p", "text": "After the war, the remains of the empire withdrew to the living planet of Zonama Sekot, where it then disappeared into the Unknown Regions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Despite the victory achieved in taking the enemy capital, the warrior caste had suffered horrible casualties at this point, which forced the Yuuzhan Vong to consolidate their newly acquired territory. In order to compensate for the loss in strength, they forced a reorganization of their forces as ordered by the Supreme Overlord, and placed slave troopers and auxiliaries to defend these positions."}, {"tag": "p", "text": "This inability resulted in the empire defeat during the Battle of Yuuzhan'tar, when the Galactic Alliance retook Coruscant from the invaders and killed Supreme Overlord Shimrra."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "The ruler of the empire was the Supreme Overlord, who was aided by the Great Council  consisting of the heads of the four castes. The Warmaster, High Prefect, and High Priest were known to sit on the Council. In the event of the Supreme Overlord's death, there was typically an heir present who would ascend to the leadership of the Yuuzhan Vong empire. Amongst their politics, it was considered a duty to punish insubordination of lower ranking individuals; in fact, it was typically expected that a newly risen leader had killed their predecessors."}, {"tag": "p", "text": "Local planets were ruled by the Intendant caste, with Prefects administering the worlds under their command. However, a few systems were known to have been granted to select Domains. The members of the Priest caste were charged with managing ceremonies and ensuring the loyalty of the masses. As events in the war progressed, the Yuuzhan Vong noted a disturbing rise in clandestine meetings among the lower castes such as the Shamed Ones, who began to venerate the Jedi. The Order of Yun-Yuuzhan were noted as being a powerful political force within the empire, until their ranks were executed by Tsavong Lah."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "The Yuuzhan Vong empire's military consisted chiefly of the Warrior caste, who led both the fleets and ground forces. Support elements included the servitor race known as the Chazrach, as well as slaves who were converted into Thralls through the use of surge coral. There were certain elite elements within the military of the empire, which included the Praetorite Vong. The warriors of the Yuuzhan Vong gained infamy for being brave, having little fear of death, rarely retreating and never surrendering. This made them potent warriors who were obedient, following the chain of command as well as being disciplined. However, these same strengths were also weaknesses; the warriors rarely employed other tactics than those initially planned, and the fact that they were obedient meant that they were largely inflexible, and only obeyed their superiors. Their bravery meant that they could be foolhardy, as well as prone to charging into situations that might require second thought. This changed somewhat during the rule of Warmaster Nas Choka, who encouraged his subordinates to change their thinking and allowed them to retreat in engagements in order to preserve their forces."}, {"tag": "p", "text": "Communications from outsiders that contacted a Yuuzhan Vong fleet typically spoke to the lowest ranking warrior within the fleet. If the speaker managed to convince this individual of their worth, then the warrior would alert a superior of their find. Thus, the speaker would end up speaking to a higher ranking warrior, and had to prove their worth once more. Through this, a person speaking to a Yuuzhan Vong fleet often had to prove themselves through the various warrior ranks. With every success, a speaker came closer to addressing the commander of the fleet. It was noted that this was a way of alerting the senior officer of the most worthy finds that demanded the commanding warrior's attention. Military analysis and communication was often handled by the yammosk war coordinators and Battle Tacticians."}, {"tag": "p", "text": "There were a number of different military units utilized by the Yuuzhan Vong. These included pod troopers, who were deployed from orbit in yorik coral shells onto a planetary environment. There were also the paratroopers, who dropped from ships in the atmosphere of a planet on membranous parachutes. Another aerial unit included warrior caste soldiers, who were carried in the air by large mynock-sized creatures for deployment in various locations on the battlefield. There were also highly trained warriors known as Hunters that were employed by the Yuuzhan Vong for stealth attacks and tracking missions. In addition, there were an elite sect of Yuuzhan Vong warrior caste known as Nuun, who made use of the Cloak of Nuun to camouflage themselves in their surroundings. Near the end of the war, the Yuuzhan Vong Shapers were also involved in breeding a new type of soldier dubbed Slayers."}, {"tag": "p", "text": "New Republic Intelligence noted that, in the initial stages of the war, that the Yuuzhan Vong possessed thousands of capital ships that traveled in flotillas of up to seventy-five vessels. Amongst their ranks were warships that were the equivalent of Super Star Destroyers, with firepower levels that were the equivalent to the heaviest models of turbolasers and ion cannons."}, {"tag": "h4", "text": "Strategies"}, {"tag": "p", "text": "During the war, the Yuuzhan Vong were involved in numerous tactics that were used against the inhabitants of the galaxy. These included:"}, {"tag": "h4", "text": "Tactics"}, {"tag": "p", "text": "In addition to these stratagems, the Yuuzhan Vong made use of their various biots for specialist tactics against the enemy. This included the devastating Yo'gand's Core tactic, which involved dropping a moon onto a planet as well as the deployment of planetary shielding teams who inserted a dovin basal onto a planet, which stripped a world of its orbiting defenses. Yuuzhan Vong interdiction vessels became known for waiting just outside their assigned locations and suddenly revealing themselves in order to ambush any vessels passing through that region of space."}, {"tag": "p", "text": "After the defeat of Warmaster Tsavong Lah at the hands of Jacen Solo, the Yuuzhan Vong began a program aimed at sacrificing the Jedi in order to curry favor with the gods. This became known as the Solo Project, and was an attempt by the Yuuzhan Vong to capture Jacen Solo along with his twin Jaina Solo in order to pit them against one another."}, {"tag": "p", "text": "The band of collaborators known as the Peace Brigade were used extensively by the empire, who used them to subvert the planetary governments, provide them with information, and to serve as escorts for their supply lines. The Yuuzhan Vong also made use of a technophobic terrorist group, the Red Knights of Life, as another supporting element in their forces."}, {"tag": "h3", "text": "Foreign relations"}, {"tag": "p", "text": "At the time of the Yuuzhan Vong War, the empire's relations with any of its neighbors were virtually nonexistent due to the fact that it was waging a holy war to cleanse the galaxy of anything not inherently Yuuzhan Vong. The Yuuzhan Vong believed that the galaxy, or \"Promised Land\", was rightfully theirs and that they owned all of known space. To that end, they attempted to educate the inhabitants in the ways of the Yuuzhan Vong and their gods. The invaders also took note of the wide diversity of races within the Promised Land, like those which they themselves had eliminated in their home galaxy long ago as part of a costly campaign that saw the destruction of countless worlds. During the invasion, the Yuuzhan Vong sought to destroy simply what they needed to in order to accomplish their goals."}, {"tag": "p", "text": "The Yuuzhan Vong regularly dispatched spies wearing Ooglith masquers allowing them to infiltrate galactic society and subvert it from within. In at least one operation, the Deception sect was used to deploy a bioweapon against the Jedi. Furthermore, as part of the far-reaches destabilization program, the Yuuzhan Vong attempted to encourage conflict between the various governments in the galaxy. This included an attempt to frame the Chiss for an attack on the Esfandia base."}, {"tag": "h2", "text": "Territory"}, {"tag": "p", "text": "The territory of the Yuuzhan Vong consisted of the planets that were conquered during the battles before the conquest of Coruscant. This stretched from the invasion corridor, starting with the Vector Prime entry point, all the way from the Outer Rim to the Core Worlds. During the later stages of the War, the Yuuzhan Vong were also making incursions into the Unknown Regions, sparking a number of skirmishes with the Chiss government."}, {"tag": "p", "text": "During the initial invasion, the Yuuzhan Vong made use of the central part of the Tingel Arm as a way of moving their forces in the direction of the Core Worlds. By the latter stages of the war, the Yuuzhan Vong empire began to suffer from some of the same problems as the New Republic and its successor, the Galactic Alliance, due to the fact that it now comprised enough territory and resources that it was difficult to adequately protect all of its space."}, {"tag": "p", "text": "The empire's reasons for conquering a world often varied; planets such as Belkadan and Tynna were terraformed and used for production of vital materiel such as dovin basals and villips, while the worlds of Malastare and Brentaal IV were captured to lock up supply lines and establish strategic rendezvous points for Yuuzhan Vong fleets. Others still, like Kalarba and New Plympto, were destroyed outright. Regardless of the purpose a given planet would ultimately serve, each successful attack expanded the Yuuzhan Vong empire's territory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}