{"url": "Yuuzhan_Vong_galaxy", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Other galaxies", "Category:Yuuzhan Vong culture"], "nodes": [{"tag": "h1", "text": "Yuuzhan Vong galaxy"}, {"tag": "p", "text": "The Yuuzhan Vong galaxy was the home galaxy of the Yuuzhan Vong and their original homeworld of Yuuzhan'tar, the planet Zonama Sekot, the reptoid Chazrach, and possibly the Silentium and the Abominor droid civilizations, along with their creators. The galaxy once was home to a vast number of sentient species; however, the Yuuzhan Vong killed off all of them in acts of genocide, save the Chazrach, whom they instead enslaved. The Yuuzhan Vong referred to it as the \"ancestral galaxy.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Eons ago, a species of star-shaped organics created the Silentium to resemble their form, in much the same way that humanoid sentients created bipedal droids. Though the organics were wiped out by a radiation storm from a nearby supernova, their droid creations lived on. These droids continued to reproduce and improve themselves, and developed a culture based on the prime numbers of five, seven, and eleven."}, {"tag": "p", "text": "Many of them took on the form of geometric shapes, with the circle being the \"holiest\" of shapes. Thousands of the wisest members of the droid race created powerful fifty-kilometer spheroid bodies. Two influential members of this giant variety included The One and The Other, and the others were collectively called The Rest. This culture of order and symmetry was soon challenged by the chaotic Abominor, self-constructing droids with a lust for power. The two droid species fought a galactic war, ignoring their galaxy's native organic species, particularly the Yuuzhan Vong, until the organics fought back and forced both droid powers to flee their galaxy. This war devastated the Yuuzhan Vong home galaxy and triggered the Yuuzhan Vong's hatred of machinery and xenophobia toward other sentient lifeforms."}, {"tag": "p", "text": "Following this war, the Yuuzhan Vong went on a crusade to cleanse their galaxy of all forms of mechanical technology. They conquered much of their galaxy and either exterminated or enslaved conquered species. Among the species they conquered were the reptoid Chazrach, which became slave soldiers for the Yuuzhan Vong."}, {"tag": "p", "text": "With much of the galaxy in their hands, the various Domains fractured and turned against each other, resulting in the devastating Cremlevian War. During the conflict, much of their galaxy was destroyed including their homeworld of Yuuzhan'tar. The exact details of the destruction of their homeworld is lost to the passage of time. However, it is known that the planet produced a seed which eventually became Zonama Sekot."}, {"tag": "p", "text": "Separated from their original symbiosis with their homeworld, the Yuuzhan Vong were stripped from the Force and experienced great pain. Thus, the species saw pain as the only way to get back to that symbiosis and practiced body modifications on themselves. In place of their homeworld, the Yuuzhan Vong created several deities which would govern nearly every aspect of their civilization."}, {"tag": "p", "text": "Towards the end of the war, Steng emerged as the first Warmaster. A rival Warmaster, Yo'gand, invented the Yo'gand's Core tactic, in which he crashed the planet Ygziirs own moon into it, demolishing both. The destruction of Ygziir resulted in the death of Steng and the end of the war. Eventually, Yo'gand united the Domains into a single socio-political entity and became the first Supreme Overlord of the Yuuzhan Vong."}, {"tag": "p", "text": "However, with much of their galaxy ruined, the Yuuzhan Vong began a long trek to another galaxy in search of a new home. For millennia, the species was forced to travel through the Intergalactic Void in massive worldships. During this period, the Yuuzhan Vong nearly destroyed themselves. Violence and competition had been built into their society, and without an external target, they focused their aggression against each other. Though there were no all-out wars in the magnitude of the Cremlevian War, the Domains continued to fight each other for the favor of the Supreme Overlords. Upon the discovery of the Galaxy and the living planet Zonama Sekot, the early scouts reported back on the worlds they'd discovered, ripe for colonization and conquest."}, {"tag": "p", "text": "Supreme Overlord Quoreal, however, was reluctant to invade, on account of the threat that Zonama Sekot posed. But a member of the Intendant caste, Shimrra Jamaane, realized that the very society of the Yuuzhan Vong was falling apart and that they needed a common cause to rally behind and unite them. Not long after Quoreal's decision not to attack was voiced, he was deposed and assassinated in a coup orchestrated by Jamaane, who promptly reversed his predecessor's decision and ordered the invasion, thus beginning preparations for the Yuuzhan Vong War. Yuuzhan Vong spies and infiltrators were dispatched into the Galaxy in the decades leading up to 25 ABY. The conflict would become the most devastating in galactic history, with aftereffects that would continue to be felt throughout the galaxy for over a century to come. Shimrra eventually ended up falling under the influence of the disgraced shaper Onimi, who eventually became the secret Supreme Overlord."}, {"tag": "h2", "text": "Known planets"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}