{"url": "Yuuzhan_Vong_(language)", "categories": ["Category:Legends articles", "Category:Articles with unencyclopedic tone", "Category:Pages needing citation", "Category:Languages", "Category:Yuuzhan Vong phrases"], "nodes": [{"tag": "h1", "text": "Yuuzhan Vong  (language)"}, {"tag": "p", "text": "Yuuzhan Vong was the language spoken by the extra-galactic Yuuzhan Vong species and their Chazrach slaves. It was a highly guttural language, and Basic speakers often thought of it as sounding like coughs and snarls. Few Yuuzhan Vong learned to speak Basic (which they considered \"clicky\"), and instead prefered to use tizowyrms as translators."}, {"tag": "p", "text": "The Deception sect, the followers of Yun-Harla spoke their own dialect of Yuuzhan Vong."}, {"tag": "p", "text": "According to C-3PO, Yuuzhan Vong was similar to Janguine."}, {"tag": "h2", "text": "Grammar"}, {"tag": "h3", "text": "Word order"}, {"tag": "p", "text": "The most common word order in Yuuzhan Vong was Verb-Object-Subject (VSO), except when the verb was to be, in which case the order was Subject-Verb-Object (SVO).  Adverbs and adjectives followed the part of speech they modified."}, {"tag": "h3", "text": "Pluralization"}, {"tag": "p", "text": "The plural form of a Yuuzhan Vong noun was formed by adding -'o: Yun (god) and Yun'o (gods)"}, {"tag": "h3", "text": "Possessive and genitive constructions"}, {"tag": "p", "text": "Singular possessives in Yuuzhan Vong were usually formed by affixing the item to the possessor: Yun'tchilat  '(a) god's will'. Plural possessives took the ending -tu: nom'o-tu tchilat 'the enemies' will'. Some nouns, however, could not take a possessive marker, and so the marker was affixed to the item possessed instead. The ending -te was used for nouns ending in \"t,\" and -tu for items ending in other letters: tchilatte Yun-Yuuzhan (Yun-Yuuzhan's will), or canbin-tu ro'ik (the enemy's fort). There was also a special respective prefix, Al', used with names and titles; Al'Shimrra (Shimrra's). Note that possessive pronouns had no special form, but always took a possessive suffix: tiu-tu (mine)."}, {"tag": "h3", "text": "To be"}, {"tag": "p", "text": "The Yuuzhan Vong had two words for the Basic verb to be: \"pryozz,\" and \"sos.\" The former was used with the first and second person (a broad transcription would be \"am\"), while sos was used with the third person (corresponding somewhat to \"is\"). Like Mando'a, Yuuzhan Vong often left out the verb to be, so \"the youths are enemies\" could be said as \"Yenagh'o sos nom'o,\" or \"Yenagh'o nom'o.\""}, {"tag": "h3", "text": "Articles"}, {"tag": "p", "text": "There were no regular articles in Yuuzhan Vong; indefinite and definite forms of nouns were derived entirely from context. There was, however, an emphatic definite article tur; or the, which was used exclusively for emphasis. There was also a rarely used singular emphatic definite article sen; or the only, used to signify an object's uniqueness."}, {"tag": "h2", "text": "Known phrases"}, {"tag": "h2", "text": "Vocabulary"}, {"tag": "p", "text": "It must be noted that the following section contains words derived from the above phrases, and may not be accurate in all cases."}, {"tag": "p", "text": "Note that Yuuzhan Vong have no words for amnesty, mercy, sorrow, forgive, or forgiveness, as such a concept was unknown in their culture of sacrifice and unquestioning obedience. The words bioengineer and scientist are also not present, as the duties of these professions are encapsulated by the Shaper caste."}, {"tag": "h3", "text": "Nouns"}, {"tag": "h3", "text": "Verbs"}, {"tag": "h3", "text": "Adjectives and adverbs"}, {"tag": "h3", "text": "Pronouns"}, {"tag": "h3", "text": "Prepositions"}, {"tag": "h3", "text": "Other words"}, {"tag": "h2", "text": "Idioms"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}