{"url": "Yuuzhan_Vong_War", "categories": ["Category:Legends articles", "Category:Conflicts involving the Chiss Ascendancy", "Category:Conflicts involving the Empire of the Hand", "Category:Conflicts involving the Hutt Clan", "Category:Conflicts involving the New Jedi Order", "Category:Conflicts involving the New Republic", "Category:Conflicts involving the Yuuzhan Vong", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Deep Core", "Category:Conflicts of the Expansion Region", "Category:Conflicts of Hutt Space", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Conflicts of the Unknown Regions", "Category:Conflicts of Wild Space", "Category:Galactic Alliance", "Category:Invasions", "Category:New Jedi Order", "Category:Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "The Yuuzhan Vong War (25–29 ABY), also known as the Great War by the Yuuzhan Vong, was a pan-galactic conflict which arose when the Yuuzhan Vong, a nomadic  warlike species which had long ago fled the destruction of its own galaxy, invaded the galaxy. After several decades of preparations, scouting and provocations, the Yuuzhan Vong entered the galaxy at a point codenamed Vector Prime and swiftly conquered much of the Outer Rim."}, {"tag": "p", "text": "Chief of State Borsk Fey'lya's ill-prepared and inefficient New Republic government was unable to prevent the extra-galactic species from driving inexorably toward the Core. Coruscant, the galactic capital, was conquered and remade by the invaders two years after the invasion had commenced, by which time countless species had been rendered extinct and entire planets were now uninhabitable."}, {"tag": "p", "text": "Using advanced biotechnology in every field of life, the Yuuzhan Vong were masters of adaptation and subterfuge, as well as brute force and terror tactics. The beliefs that the invasion was divinely ordained and that the galaxy was theirs by right were reinforced by Supreme Overlord Shimrra Jamaane and the priest caste, the conduits to the gods all Yuuzhan Vong worshiped. Thus the species attacked with ferocity, their invasion stalling only once the fleet, under command of Warmaster Tsavong Lah, had overextended itself. A vendetta against Luke Skywalker's New Jedi Order, a heretical movement brewing among the lower castes, and rumors that their long-destroyed homeworld haunted the Unknown Regions were only a few of the factors which caused the stagnation of the Yuuzhan Vong empire. After their swift advance, technological parity soon emerged between the New Republic and the Yuuzhan Vong. The Mandalorians led by Boba Fett joined the Yuuzhan Vong empire in it's quest to conquer the galaxy, this however was a ruse and the Mandalorians were actually double agents, later joining the rest of the forces defending the galaxy. Once the New Republic had recovered from the loss of its capital, the Yuuzhan Vong were dealt a disastrous defeat at Ebaq 9."}, {"tag": "p", "text": "Wracked with internal tensions as it was, the Yuuzhan Vong Empire was still able to neutralize many of the threats facing it, including the Yevetha and the Ssi-ruuk, before going once more on the offensive. The New Republic, which was reformed under Alderaanian Chief of State Cal Omas into the Galactic Federation of Free Alliances, was brought to the brink of defeat, and moved toward the fatal deployment of Alpha Red, a pathogen hostile to the Yuuzhan Vong, in response to a renewed Yuuzhan Vong advance upon its temporary capital at Dac. This dangerous end to the war was averted when Zonama Sekot, a seed of the lost living homeworld of the Yuuzhan Vong, emerged over Coruscant, its arrival precipitating the final battle of the conflict. Skywalker and other leading Jedi, who had located Zonama Sekot and urged its return, defeated Shimrra Jamaane and the true master of the Yuuzhan Vong, Onimi, during the battle, while fleets of warships clashed once more in space. The Yuuzhan Vong War ended with the deaths of the Supreme Overlord and the surrender of Warmaster Nas Choka's armada. The resulting Sekot Accords, which stipulated disarmament and amnesty for the Yuuzhan Vong, proved deeply unpopular for many; both the Yuuzhan Vong, and the aftermath of their devastating war, played a major role in events to come."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "The Cremlevian War"}, {"tag": "p", "text": "Tens of thousands of years before the Battle of Yavin, the Yuuzhan Vong were a Force-sensitive species dwelling on the sentient, living world of Yuuzhan'tar in a distant galaxy. At some point, they were caught up in the war between the Silentium and the Abominor droid species. Threatened with extinction, Yuuzhan'tar granted the Yuuzhan Vong the ability to develop new weapons and technology from living things, eventually defeating their droid enemies and driving them from their galaxy."}, {"tag": "p", "text": "After this victory, however, the Yuuzhan Vong continued waging war on other species in their galaxy, conquering a number of worlds, and also began warring amongst itself. At some point, the two most powerful tribes—one led by Warmaster Yo'gand and another led by Warmaster Steng—clashed. The resulting conflict known as the Cremlevian War saw the destruction of many planets. It came to a close around 15,000 BBY, when Yo'gand used a technique that was later named after him, to drop a moon on the planet Ygziir, which was allied with Steng. The tactic destroyed the planet, and killed many of the leaders of Steng's faction, who were stationed on Ygziir. Steng was also killed in the battle, bringing the war to an end. The war left the Yuuzhan Vong's galaxy ruined; the Yuuzhan Vong living homeworld of Yuuzhan'tar was one of the worlds that had suffered. The war had turned the Yuuzhan Vong to violence, and Yuuzhan'tar stripped the bloodthirsty species of their ability to touch the Force. The Yuuzhan Vong began worshiping pain and espousing a philosophy of violence and death to all who opposed them. After thousands of years of ferocity and destruction, the galaxy had been stripped of its resources, and was in ruin. The Yuuzhan Vong departed their galaxy to wander the Intergalactic Void."}, {"tag": "h3", "text": "Early encounters"}, {"tag": "p", "text": "The earliest confirmed contact between members of the galaxy and the forces of the Yuuzhan Vong was retroactively discovered to be the first recorded slivilith encounter, shortly after the Freedon Nadd Uprising of 3998 BBY. Sliviliths were later discovered to be shaped bio-forms sent by the Praetorite Vong as a form of probe for the pending invasion. By 3963 BBY, at least one Yuuzhan Vong scout had reached the outermost regions of the galaxy. In that year, a group of Mandalorian Neo-Crusaders under Canderous Ordo encountered a rock-like vessel later known as a Yorik-stronha, disguised as an asteroid in the Crispin system. It fled beyond the edge of the galaxy once discovered. Also during that general time period, it is a near certainty that a member of the Yuuzhan Vong's shaper caste made contact with Regent Torphceris of the Argazdan Redoubt in the final days of the Kanz Disorders, and aided in the design of the infamous Slave Pits of Lorrd."}, {"tag": "p", "text": "Between 229 and 89 BBY, a seed of Yuuzhan'tar, released by the planet in the Cremlevian War, arrived in the Gardaji Rift. It would become the living world Zonama Sekot."}, {"tag": "h3", "text": "Escalation"}, {"tag": "p", "text": "Prior to 32 BBY, the Yuuzhan Vong shaper Onimi added yammosk tissue to his brain. As a result, he became the first Force-sensitive Yuuzhan Vong in millennia. However, the effect it had on his body was to shame him among the Yuuzhan Vong. Using the telepathic powers granted to him by the Force, however, Onimi was able to influence Shimrra Jamaane, the head of Domain Jamaane, who took Onimi as his familiar and jester."}, {"tag": "p", "text": "In 33 BBY, a lost Yuuzhan Vong warrior was held prisoner aboard Cog Hive Seven, where it soon became the reigning champion in the station's violent gladiatorial matches. It was ultimately killed by Darth Maul. The next year, at the time of the Invasion of Naboo, an advanced force of Yuuzhan Vong—termed \"Far Outsiders\" by the planet's inhabitants—discovered Zonama Sekot. Noting the similarity to Yuuzhan'tar (without drawing the connection), the advanced force attempted to colonize it. However, when the Yuuzhan Vong attempted to settle, Zonama Sekot's biosphere killed off the Yuuzhan Vong flora and fauna, provoking outrage from them. Although Sekot attempted to negotiate with them, they began an assault upon the planet."}, {"tag": "p", "text": "After two years of Sekotan defense, at a high cost, the assault was called off after the arrival of the Jedi Knight Vergere, who demanded the attack cease in return for going with the Yuuzhan Vong. Agreeing with the ceasefire, the Yuuzhan Vong force departed with the Jedi toward the Unknown Regions. When he learned of Zonama Sekot, Supreme Overlord Quoreal began to waver. The Yuuzhan Vong soon learned that Zonama Sekot was no longer in its original system, and there was no evidence that the planet had been destroyed. Worried about the possibility of once more encountering Zonama Sekot, he developed the opinion that it would be best to move on to another galaxy. However, Jamaane, under the influence of Onimi and with the support of some of the more aggressive Yuuzhan Vong Domains, launched a coup. Quoreal was murdered and Jamaane took his place, ensuring that the invasion would go forth as planned."}, {"tag": "p", "text": "In 27 BBY, during the initial stages of the Outbound Flight Project, the upper echelons of the Republic government, including Supreme Chancellor Palpatine, were aware of the \"Far Outsiders\" at least in the abstract. Around this time, a Yuuzhan Vong scout force in the Unknown Regions fought with a Chiss fleet led by Admiral Ar'alani. Soon after this battle, the Chiss Force Commander Mitth'raw'nuruodo was convinced by Palpatine, in his Sith alter ego Darth Sidious, to destroy the Outbound Flight lest it draw the \"Far Outsiders\" into the main galaxy."}, {"tag": "p", "text": "In 25 BBY, a group of Yuuzhan Vong landed on the obscure planet Bimmiel and began surveying the surrounding sectors for their coming invasion. After the formation of the Galactic Empire in 19 BBY, Imperial scientists ran into the Yuuzhan Vong on that planet."}, {"tag": "p", "text": "Although it was not known for sure if the upper echelons of the Imperial government knew about the Yuuzhan Vong, Emperor Palpatine retained a degree of knowledge of the \"Far Outsiders\", and justified the accelerated growth of the Imperial Military after the Clone Wars as preparation to combat extra-galactic threats. Furthermore, sometime between being dispatched back to the Unknown Regions in 3 ABY at the time of the Battle of Hoth, and his return in 9 ABY, Mitth'raw'nuruodo, now serving the Empire as Grand Admiral Thrawn, encountered another advance Yuuzhan Vong force hiding in the Unknown Regions. The threat of the advancing invaders was one of his primary motivations to reunify the Empire, as he felt that the Empire stood a much better chance against the Yuuzhan Vong than did the New Republic."}, {"tag": "p", "text": "The Yuuzhan Vong of the advanced scouts shared the sentiment that the Empire would be a strong foe. After the formation of the Imperial Interim Council in 11 ABY, following the final death of Palpatine, Yuuzhan Vong agent Nom Anor was tasked to infiltrate the Council. He did so and manipulated its leader, Xandel Carivus, arranging the deaths of many Councilors and furthering the internecine strife that led to the fatal fracturing of the Imperial Remnant."}, {"tag": "p", "text": "It was roughly around this time that the Yuuzhan Vong began meddling in the high politics of the Ssi-ruuvi Imperium; they installed one of their own, E'thinaa, into a high military position, and manipulated the rise to power of the Keeramak with the goal of eventual use of the Ssi-ruvi in their invasion. Around 22–23 ABY, contact was made between a representative of the Yuuzhan Vong and the Miskara of the Vagaari Empire, who agreed to aid in the future invaders' preparations for war. The Vagaari, who believed the Yuuzhan Vong would annihilate their enemies, began using Yuuzhan Vong biotech in exchange."}, {"tag": "p", "text": "In 24 ABY, Yuuzhan Vong agent Yomin Carr infiltrated the ExGal Society, stationing himself at the ExGal-4 base located along Vector Prime at Belkadan."}, {"tag": "h2", "text": "The war"}, {"tag": "h3", "text": "Early invasion"}, {"tag": "h4", "text": "Vector Prime"}, {"tag": "p", "text": "By 25 ABY, the Yuuzhan Vong's preparations had advanced to the point that they were ready to begin their invasion. The fleet of Koros-Strohna worldships entered the galaxy in the northern quadrant at the very edge of the New Territories at the point codenamed Vector Prime. The advance force, the Praetorite Vong, undertook a series of clandestine operations to weaken the main invasion corridor. The Yuuzhan Vong planned to secure undefended worlds around Vector Prime to regroup and mass their forces, before advancing through the New Territories to the heart of the galaxy. This campaign would sever trade lines and allow them to identify a weak point in the defenses of the Core Worlds so that they could make a hook-shaped turn to take Coruscant."}, {"tag": "p", "text": "On Belkadan, a team of scientists from ExGal-4 were charting the abyss for extra-galactic life. Finally they discovered an asteroid heading for the nearby Helska system. Yomin Carr began killing many of the ExGal-4 workers, save for the few that went to Helska IV to investigate the extragalactic object that had landed there. He also unleashed deadly toxins into the atmosphere, making it virtually uninhabitable, and killing all local wildlife. The extra-galactic object, a Praetorite Vong worldship commanded by Prefect Da'Gara touched down on the icy, uninhabited Helska IV, where they unloaded a massive, tentacled creature known as a yammosk, or \"war coordinator\"."}, {"tag": "p", "text": "On the distant world Rhommamool, the invaders, through Anor, disguised as the leader of the Red Knights of Life, stirred up rebellion between Rhommamool and its neighbor Osarian. The Osarian-Rhommamool conflict had the potential to disrupt traffic along the vital Corellian Run hyperlane beyond the Expansion Region, so the New Republic was distracted from the invasion of the New Territories. Anor was also responsible for infecting Mara Jade Skywalker and a hundred others with coomb spores, a fatal Yuuzhan Vong microorganism. Once war had broken out between the two worlds, Anor faked his own death. This allowed him to move on, as well as escalating the conflict and diverting the New Republic's attention from the true target."}, {"tag": "p", "text": "Da'Gara's worldship was noticed by the Dozen-and-Two Avengers, a New Republic starfighter squadron led by Jedi Master Kyp Durron. The Avengers and the ExGal team arrived in the Helska system, only to be ambushed by a group of coralskippers, killing all but Durron, his apprentice Miko Reglia and Danni Quee, an Ex-Gal scientist. Kyp Durron managed to escape; Reglia was captured, as was Danni Quee. Reglia was strenuously tortured by the yammosk, but the Praetorite Vong spared Quee this, seeing her fit to die an honorable death."}, {"tag": "p", "text": "The Praetorite Vong then used their yammosk to coordinate an attack on the world Sernpidal. Knowing that Sernpidal's relatively high population and trade links would constitute a threat of discovery, the Praetorite Vong used the ancient Yo'gand's Core tactic to crash the planet's moon Dobido into the surface. At the same time, Han Solo, along with his son Anakin and the Wookiee Chewbacca, had been on a delivery run for Lando Calrissian to the planet. Seeing the devastation being wrought by the moon, Anakin accompanied Sernpidal City's mayor to find the source of the problem. They discovered that the Praetorite Vong had planted a gravity-manipulating dovin basal creature east of Sernpidal City to draw its smallest moon toward the planet. The mayor sacrificed himself to kill the creature but this was too late to stop the moon from plummeting from the sky. Han, Chewbacca and Anakin managed to save many civilians, but while rescuing a small child, Anakin was knocked from the ship by some debris. Chewbacca rescued him and hauled him back into the ship before he was separated from the others. Anakin made the decision to fly away in order to save the others as the moon crashed down, killing Chewbacca."}, {"tag": "p", "text": "As the Millennium Falcon fled Sernpidal, it was followed by Praetorite Vong forces to Dubrillion, a planet administrated by Calrissian. The Praetorite Vong attacked Dubrillion quickly and fiercely, though they were narrowly defeated."}, {"tag": "p", "text": "Leia Organa Solo, unable to fully convince Chief of State Borsk Fey'lya of the threat posed by the Yuuzhan Vong, was only able to amass one Star Destroyer, the Rejuvenator, for a counterattack at Helska IV. The Republic went forward and attacked the Helska system. Though Quee was rescued by Jacen Solo during the fighting, the Rejuvenator was destroyed, and Miko Reglia was killed. What few ships the Republic had left retreated and regrouped. A follow-up force eventually returned with a fleet of shieldships, using them to accelerate Helska IV's natural evaporation, freezing the entire planet and killing the yammosk. The planet then exploded under the pressure of the rapid expansion of the ice, killing all Praetorite Vong still on it. It was with this battle that the war properly began, though the Yuuzhan Vong would not act for the next two months, using the time to amass their fleet further."}, {"tag": "h4", "text": "The fall of the northern quadrant"}, {"tag": "p", "text": "Though the scale of the threat posed by the Yuuzhan Vong was now clear, the Republic did not alter its basic strategy. The Defense Force's strategic posture was determined by Supreme Commander Admiral Sien Sovv and the Chief of Staff, Commodore Turk Brand. Both had great reputations from tactical engagements in the Galactic Civil War, but were later criticized in a Confederation scandoc as having no knowledge of how to fight a war strategically. The New Republic Defense Fleet positioned itself to protect the major hyperlanes leading to the Core and Colonies (as well as the borders of the Bothan sector at the insistence of Chief of State Borsk Fey'lya) while the Republic built up its forces. Sovv and Brand sought to engage the Yuuzhan Vong from a position of strength on a battlefield of their own choosing to defeat them decisively. Their strategy was fundamentally based in their perception of what had allowed the Rebel Alliance to decisively defeat the Empire at the Battle of Endor."}, {"tag": "p", "text": "However, Sovv and Brand neglected other tactics that had also served the Rebellion, including commerce raiding, pinpoint strikes, and local defense. This made the New Republic appear weak in the early stages of the war, and while the New Jedi Order took a more proactive stance, their lack of numbers meant that the Yuuzhan Vong were able to advance early with great ease: within a year of the start of the invasion, culminating in the Battle of Duro the Yuuzhan Vong would capture the majority of the territory they would hold during the war."}, {"tag": "p", "text": "The Yuuzhan Vong under the command of Supreme Commander Nas Choka advanced from Sernpidal south along the Veragi Trade Route in two prongs. They sent a scout group to Bimmiel, where the remains of the renowned warrior Mongei Shai lay. However, scientists had landed on the planet and had already taken Shai's bones for examination. The Yuuzhan Vong turned on the scientists, but were stopped by Jedi Knights Corran Horn and Ganner Rhysode. Horn killed the two Yuuzhan Vong in a duel, which earned him the hatred of the Yuuzhan Vong commander Shedao Shai."}, {"tag": "p", "text": "From Sernpidal, the Yuuzhan Vong returned to and conquered Dubrillion and Destrillion before moving onto Dantooine, where refugees from Dubrillion that had been evacuated by Lando Calrissian were being sheltered, precipitating a terrible massacre. During the battle, the Yuuzhan Vong first unleashed legions of reptoid Chazrach slave soldiers and beetle-like thrall herders, both creatures from their galaxy. Among those on the New Republic side were Anakin Solo and his older brother, Jacen. The two brothers would discover that these Chazrach were entirely mindless and were merely the Yuuzhan Vong's equivalent to battle droids. They slaughtered dozens of Chazrach and Luke Skywalker also destroyed a thrall herder, causing much of the enemy force to scatter and allowing the refugees to escape Dantooine before the enemy conquered it."}, {"tag": "h4", "text": "Revelation on Garqi"}, {"tag": "p", "text": "Following Dantooine, the Yuuzhan Vong secured Garqi and the western Braxant Run, and attacked Ciutric, securing the Rimward Celanon Spur for an attack on the hyperspace crossroads at Agamar. The successful conquest of Agamar opened the Braxant Run for the Yuuzhan Vong, potentially allowing them to advance all the way to Dorin in the Expansion Region."}, {"tag": "p", "text": "In response, a team of Jedi led by Corran Horn and Jacen Solo traveled behind the lines to occupied Garqi. There they were attacked and surrounded by Yuuzhan Vong led by the warrior Krag Val. During their last defense, the Jedi retreated into a grove of bafforr trees, transplanted from Ithor. As the Yuuzhan Vong approached, the pollen from the trees triggered a fatal allergic reaction in their Vonduun crab armor which caused it to suffocate them. With the Yuuzhan Vong distracted, the Jedi escaped to Ithor."}, {"tag": "h4", "text": "The devastation of Ithor"}, {"tag": "p", "text": "In response, the Yuuzhan Vong advanced down the Celanon Spur to Ithor, the only other planet known to have the correct conditions to naturally grow bafforr trees, beginning the Battle of Ithor. During the battle, the extragalactic invaders attacked the floating city of Tafanda Bay until Jedi Knight Corran Horn offered to duel Shedao Shai in single combat. If Corran defeated Shedao, the Yuuzhan Vong would withdraw from the planet; however, if Corran lost, Shai would get back the body of his ancestor Mongei Shai and the Yuuzhan Vong would have Ithor. As part of the deal, a week-long peace accord was agreed to, which allowed the Republic to evacuate as many Ithorians as they could. Meanwhile, Sien Sovv legitimized the deployment of New Republic forces to Ithor, cooperating with Grand Admiral Gilad Pellaeon and the Imperial Remnant, who deployed an Imperial Navy task force to the planet."}, {"tag": "p", "text": "The duel took place as agreed and Corran fought Shai in a fierce duel on the planet's surface. Though Corran bested his rival, Shai's second-in-command Deign Lian answered to a higher authority, Warmaster Tsavong Lah. The latter ordered Lian to unleash a biological weapon from the Kor Chokk flagship Legacy of Torment which reduced all life on the planet to little more than black swamps of acidic ash. The Legacy was later destroyed when it crashed into Ithor, causing more carnage and contributing much to the anti-Jediism of the galactic public. Many people came to revile the Jedi, blaming them for the invasion. The Peace Brigade, a collaborationist organization of galactic beings that supported Yuuzhan Vong operations, was formed through Yuuzhan Vong agents. This organization also helped the Yuuzhan Vong capture Jedi."}, {"tag": "h4", "text": "Elan's plot"}, {"tag": "p", "text": "The next move by the Yuuzhan Vong was a plot by the priest Harrar and Commander Tla to use the deception sect priestess Elan to assassinate the Jedi, whom the Yuuzhan Vong saw as their most dangerous adversary. To do this, Elan pretended to be a defector and left with her servant, the former Jedi Knight Vergere, for Republic space. To convince the New Republic that her defection was genuine, Elan gave the Republic information on the planned attack on Ord Mantell, which had become a significant transit hub for refugees since the invasion began. A joint New Republic-Imperial Remnant force defeated the attack, and Elan was transported to Bilbringi aboard the Queen of Empire."}, {"tag": "p", "text": "However, the Peace Brigade mercenary Reck Desh mistakenly believed that the Yuuzhan Vong wanted Elan returned, and attacked the Queen of Empire at Bilbringi. Han Solo meanwhile, still reeling from the death of Chewbacca, was on a personal mission to stop Desh and became embroiled in the battle. Han rescued Elan and Vergere, but Elan had already used her poison to kill Desh and his men. Onboard the Millennium Falcon, Elan attempted to kill Han, but the poisons only ended up killing her instead. Vergere fled, but not before giving Han her tears, which were used to stop the effect of the coomb spores that were killing Mara Jade."}, {"tag": "p", "text": "The fiasco had failed to kill a single Jedi, and the heavy casualties caused by the Battle of Ord Mantell led an enraged Supreme Commander Nas Choka to return Harrar and Tla to the Outer Rim, away from the front lines."}, {"tag": "h4", "text": "The debacle of Fondor"}, {"tag": "p", "text": "After Ithor, the Republic suffered a devastating defeat at the First Battle of Obroa-skai. This shocked the government into action, but it was too late; Yuuzhan Vong forces were moving en masse into the galaxy. Obroa-skai would give the Yuuzhan Vong a position from which to push on to the Perlemian Trade Route to Brentaal IV when they began their conquest of the Core."}, {"tag": "p", "text": "Sien Sovv placed his hopes in the Northern Line, an expanse of fortress worlds stretching from Bilbringi to Bogden to Contruum to guard against an attack into the Core. However, the Yuuzhan Vong bypassed it: from Ciutric, the Vong pushed down the Salin Corridor to take Columex and Belderone before advancing to Boonta. They eventually struck a deal with the Hutts that allowed them to pass through Hutt Space unharmed."}, {"tag": "p", "text": "Following this came over six months of New Republic defeats. The New Republic was without a significant victory since the start of the war, which utterly demoralized their forces. Unrestrained panic spread throughout worlds in the path of the invasion, many of which surrendered without a fight. New Republic forces going into battle came to expect defeat. Nas Choka's forces rapidly took Randon, Gyndine and Daalang."}, {"tag": "p", "text": "However, the Yuuzhan Vong's treaty with the Hutts meant that the Republic was able to predict where the invaders would strike next as the Hutts shifted their resources away from a strike area. Additionally, to avoid alienating either side, the Hutts opened a back channel to the New Republic and funnelled them intelligence on the Yuuzhan Vong's targets. This allowed the Republic to foresee the Yuuzhan Vong's attack on Tynna, leading them to trust Hutt intelligence."}, {"tag": "p", "text": "However, aware that the Hutts were leaking information to the Republic, the Yuuzhan Vong and Choka used this to their advantage. Choka leaked information to the Hutts that his next targets were Corellia and Bothawui. Seeking a decisive battle, Sovv laid a trap for the Yuuzhan Vong in the Corellian system, planning to use Centerpoint Station to decimate the enemy fleet. Instead, the Yuuzhan Vong advanced down the Shipwrights' Trace and attacked the shipyards at Fondor. Choka's plan was nearly undone when, at a diplomatic meeting, Borga the Hutt goaded him into revealing the location of the yammosk earmarked for the Fondor operation aboard the clustership Crèche at Kalarba, and he was forced to accelerate his plans to pre-empt a Jedi raid. Choka seeded the routes from Fondor to Bothawui with dovin basal mines to delay a Republic counterattack, while the assault turned into a full-scale battle when last-minute Republic diplomacy with the Hapes Consortium secured a fleet of Battle Dragons, which arrived under the command of Prince Isolder to engage the Yuuzhan Vong forces."}, {"tag": "p", "text": "In attempting to reinforce Fondor, the New Republic Third and Fifth Battle Groups suffered serious losses from the dovin basal mines, while the First Battle Group lost half its strength. During the battle, Anakin Solo hesitated over whether or not to use Centerpoint Station against the Yuuzhan Vong. However, the infamous Thrackan Sal-Solo, Han Solo's cousin, made the decision for him and fired the weapon himself, destroying the Yuuzhan Vong fleet but devastating much of the allied Hapan fleet in the process. On top of fleet losses, the battle destroyed the New Republic's second-largest shipyard."}, {"tag": "h3", "text": "The conquest of the Core"}, {"tag": "h4", "text": "The Battle of Duro"}, {"tag": "p", "text": "Following the Battle of Fondor, the Yuuzhan Vong's push toward the Core was delayed; the Yuuzhan Vong leadership considered Fondor to have been an extremely poor showing on their part. Consequently, Supreme Commander Choka left the main campaign to begin a conquest of the Hutts, while the fanatical Warmaster Tsavong Lah took personal command of the campaign."}, {"tag": "p", "text": "Following Fondor, the Yuuzhan Vong cut the Rimward leg of the Corellian Run by conquering Kalarba, Druckenwell, Rodia and Falleen in the Outer Rim. Before the first year of the conflict was over, the Ailon Nova Guard, awed by the military might of the Yuuzhan Vong, began aiding the invaders in their Inner Rim campaigns and would eventually lead Yuuzhan Vong vanguards against weak points in the defenses of Cona, Manaan, and Zeltros."}, {"tag": "p", "text": "Soon arose the problem of the growing number of refugees from conquered worlds, something the Republic could not ignore. Thus, the Senate Select Committee for Refugees, or SELCORE, was formed to administer caring and settlement for refugees of planets conquered by the invaders. SELCORE selected Duro as its ideal haven and began terraforming the planet to house the refugees."}, {"tag": "p", "text": "With the Perlemian Trade Route and the Corellian Run both severed, Warmaster Lah turned his attention back to the Core Worlds. From their Gyndine base, the Yuuzhan Vong attacked ancient worlds such as Commenor and Cato Neimoidia. On Duro, SELCORE's operations were sabotaged by Executor Anor in the guise of a Duro scientist named Dr. Dassid Cree'Ar. Soon afterwards, as 26 ABY dawned, the planet was attacked by the Yuuzhan Vong. During the battle, Warmaster Lah tortured Leia Organa Solo before he was defeated and wounded by Jacen Solo. Despite the efforts of the New Republic, Duro fell and was recreated in the Yuuzhan Vong image."}, {"tag": "h4", "text": "Hunting the Jedi"}, {"tag": "p", "text": "From the surface of Duro, Lah addressed the galaxy and offered a ceasefire, promising an end to the bloodshed if the galaxy surrendered the Jedi Knights. For strategic reasons, the New Republic saw the ceasefire as welcome: Sovv took the decision to attack Duro as meaning that the Northern Line was impregnable, and that a few months of rest would allow him to rebuild the Defense Force at a faster rate than the Yuuzhan Vong. Lah, meanwhile, used the pause to replenish his forces with new ships from a Shipwomb established amid the ruins of Sernpidal."}, {"tag": "p", "text": "Lah's offer of bounties for captured Jedi encouraged thousands to take up a new line of work in Jedi-hunting. Over the next months, citizens of the New Republic, along with fringe elements and the Peace Brigade, responded to Lah's ultimatum and began turning Jedi over to the Yuuzhan Vong. Devaron and Ando, both threatened by the Yuuzhan Vong, carried out the warmaster's directions."}, {"tag": "p", "text": "Luke Skywalker saw distressing parallels to Order 66 and the Great Jedi Purge. In response, he, Solo, and sympathetic elements within the New Republic Search and Rescue Corps established the Great River, an underground network of safehouses and transport routes to move Force-sensitives out of harm's way. A base was established amid the ruins of the old Imperial Maw Installation in the Maw black hole cluster near Kessel, while a new Jedi headquarters was established on the planetoid Eclipse in the Deep Core."}, {"tag": "p", "text": "A dangerous new development occurred when the Yuuzhan Vong learned of the vornskrs of the conquered planet Myrkr. The creatures were able to detect Force-sensitives, and consequently appeared to be a new means of tracking and eliminating the Jedi. Yuuzhan Vong warrior Tsaak Vootuh passed this information onto the shaper caste and Master Shaper Yal Phaath took notice. Phaath was placed in charge of a new project, and vornskrs were obtained and experimented upon aboard the Baanu Rass, an ancient worldship over Myrkr. By crossbreeding the vornskr with the fero xyn, a Yuuzhan Vong organism, the voxyn queen was created, from whose tissue thousands of the Jedi-hunting creatures could be cloned and dispatched across the galaxy."}, {"tag": "p", "text": "As the pogrom against the Jedi intensified, the collaborationist senator for Kuat, Viqi Shesh, revealed the location of the Jedi Praxeum on Yavin 4 to the Yuuzhan Vong. The Peace Brigade and a small Yuuzhan Vong force invaded Yavin 4, intent on reshaping the academy students into Force-wielding Yuuzhan Vong. Without permission, Anakin Solo set off on his own to rescue the students, arriving as the attack commenced. The Kushiban Jedi Master Ikrit was killed as the students were forced to flee and Solo's childhood friend Tahiri Veila was captured and subjected to the Shaper caste's experiments. Solo joined forces with Vua Rapuung, a Yuuzhan Vong Shamed One, to rescue Veila, while Rapuung aimed to redeem himself by confronting the Master Shaper Mezhan Kwaad who had intentionally shamed him in order to conceal her heretical beliefs."}, {"tag": "p", "text": "The pair found the already partially-altered Veila and exposed Kwaad, who was placed under arrest for heresy. Kwaad killed her guards and attempted to escape, but was cut down by Veila. Rapuung, his honor restored, was mortally wounded while helping the two Jedi escape Yavin 4. A new heretical movement that would spread among the Shamed Ones and Worker caste, Jeedai heresy, was born as a result of his sacrifice."}, {"tag": "h4", "text": "The conquest of Hutt Space"}, {"tag": "p", "text": "In response to their duplicity surrounding Fondor, Choka moved swiftly to exact revenge on the Hutts, thereby diverting criticism of him for the heavy casualties under his command. Choka's fleet arrayed itself over Nal Hutta, and initiated a blockade of the Hutt capital, along with the Smugglers' Moon, Nar Shaddaa. The system was placed under a state of siege—the Hutts could rely on no New Republic aid after their double-dealing, and were soon mired in fighting of a scale unseen since the war with Xim or the Hutt Cataclysms. Choka's adversary, Borga the Hutt, defended the capital with only the support of half the kajidics, a force unable to contend with the size of the Yuuzhan Vong armada. With no space fleet threatening his position, Choka ordered Nal Hutta and its moon to be re-created. Both were remotely bombarded with missiles packed with biotoxins and bacterial agents. While Nal Hutta, a world of bogs and muddy marshes, was seen as pestilent, Nar Shaddaa, as an ecumenopolis, was viewed as a religious abomination. Some of the microbes broke down the duracrete on the moon into sand, digesting the buildings. Others attacked metal and transparisteel; the high towers of Smugglers' Moon began to crumble and fall. Further bacteria attacked the Hutts themselves—those who had remained—and wiped out the crime lords in their palaces. Some of the Hutts were told they were welcome to serve the Yuuzhan Vong, while others were not as fortunate, such as the Besadii. Those of the clan who could escape fled to the worlds of Gamorr and Tatooine, long recognized as Hutt holdings."}, {"tag": "p", "text": "Meanwhile, Borga the Hutt attempted to open negotiations with Warmaster Lah in order to win some conscessionas while it was still possible. The Hutt asked for Tatooine to remain in the hands of the Hutts, but ultimately trade talks failed, and the Hutts prosecuted a fierce resistance campaign against their onetime allies. The Yuuzhan Vong also took the planet Ylesia, once a major Besadii holding and, having killed the Hutt administrator and accepted the government's capitulation, grew yammosks in its oceans and allowed the Peace Brigade to use the planet as their headquarters. The world became a police state."}, {"tag": "p", "text": "Supplied by their smuggler contacts such as Booster Terrik, the Hutts made Choka's campaign difficult, and the long, exhausting struggle to take over such a large area of the galaxy raised the Supreme Commander's status considerably. The Hutts successfully used ancient war-robots from the time of Xim against the Yuuzhan Vong for a time, and a resistance group, the Sisar Runners, was subsequently formed under the leadership of the Hutt Embra. Having formed a coalition of displaced crime lords who wanted to take their territory back from the Yuuzhan Vong, Embra hired mercenaries and other out of work fringers in his quest to reclaim Hutt Space. Choka ordered a portion of his forces to travel to an abandoned Trade Federation battleship drifting near Ylesia, where a cell of Klatooinian mercenaries was striking from; Choka wanted them exterminated. The Yuuzhan Vong fought through forces of old battle droids successfully and terminated the mercenaries, but learned that Embra had not fled Hutt Space, but was hiding in the deepest bowels of Nar Shaddaa. Choka dispatched his men and a number of Chazrach slaves to find and kill Embra. The Hutt's forces managed to outwit them, destroying the controller for the Chazrachs, and Embra ultimately survived, as did her resistance group."}, {"tag": "h4", "text": "The fall of Coruscant"}, {"tag": "p", "text": "The attack on Yavin 4 may have been a deliberate provocation to end the cease-fire; however, it ended decisively with the Yuuzhan Vong attack on Yag'Dhul at the end of 26 ABY. With Anor's advice, Lah aimed to take the strategic hyperspace crossroads of the Rimma Trade Route and the Corellian Trade Spine at Yag'Dhul, and from there move on to poison the bacta fields of Thyferra. However, Anakin Solo, Tahiri Veila, and Corran Horn were present for the attack and foiled it."}, {"tag": "p", "text": "With Jedi starfighter raids out of Eclipse proving a nuisance, the Yuuzhan Vong moved to distract the Jedi: they intercepted a commercial liner on which two Jedi, the Rar sisters, were hiding. To track down the Jedi, the Yuuzhan Vong unleashed their newest weapon; a voxyn. The voxyn killed Alema Rar's sister as the Jedi escaped. Voxyn were smuggled onto a number of worlds deep in New Republic space, including Corellia, where one slew Jedi Master Eelysa. Leia and Han Solo managed to stop an attempt at smuggling voxyn onto Coruscant. In response, a Jedi strike team led by Anakin Solo, and consisting of Jacen and Jaina Solo, Lowbacca, Tenel Ka, and Zekk, among others, went to Myrkr and destroyed the voxyn breeding facility, though most of the team was slain. Anakin himself died while covering the retreat of the remaining Jedi, his body overwhelmed with Force energy as he achieved oneness with the Force. Jacen Solo was captured by the Yuuzhan Vong after he successfully killed the voxyn queen."}, {"tag": "p", "text": "With the Jedi distracted and the New Republic fleet believing that the Yuuzhan Vong were planning to attack the Core from the south, Warmaster Lah was ready to attack the galactic capital of Coruscant in 27 ABY. Initiating Battle Plan Coruscant, Lah smashed through the Northern Line at Bilbringi and Borleias, capturing systems such as Reecee as preliminaries to a pincer movement on the capital."}, {"tag": "p", "text": "Sovv concentrated three fleet groups above Coruscant. Information from Han Solo allowed him to destroy the second-largest Yuuzhan Vong fleet, advancing from Reecee, in a battle at the Black Bantha protostar, but the main Yuuzhan Vong force advanced too quickly for the Republic. They emerged above Coruscant, with the defensive minefields doing little damage. The attackers used refugee ships to bombard the planetary shield until it collapsed, then attacked the planet's surface. The Republic commanders struggled against the onslaught, unwilling to fire on the refugee ships. Eventually Garm Bel Iblis did so, causing conflict with the other commanders and weakening Coruscant's defense."}, {"tag": "p", "text": "The treacherous Senator Shesh attempted to kidnap Luke Skywalker and Mara Jade Skywalker's baby son Ben. However, this was foiled by Leia and her Noghri bodyguards, and Shesh was wounded in the process. Han and Leia then attempted to save Chief of State Borsk Fey'lya, but he dispatched them to rescue Luke and Mara instead. Fey'lya then confronted Tsavong Lah's subordinate Commander Romm Zqar, detonating a bomb that killed himself, twenty-five thousand Yuuzhan Vong warriors, and destroyed much of the Imperial Palace."}, {"tag": "p", "text": "The Yuuzhan Vong captured Coruscant after a long battle and Republic forces scattered across the galaxy. The Yuuzhan Vong began Vongforming the planet and renamed it Yuuzhan'tar after their old home world."}, {"tag": "h3", "text": "The Republic in crisis"}, {"tag": "h4", "text": "Defense at Borleias"}, {"tag": "p", "text": "With the capture of Coruscant, the New Republic effectively ceased to exist as a functioning state. In the aftermath of Coruscant's fall, Fleet Group Three, retreating from Coruscant under the command of General Wedge Antilles, attacked and retook the lightly-defended Borleias from the Yuuzhan Vong. Antilles planned to use the Pyria system as a waystation for refugees fleeing Coruscant, and soon afterwards, the remnants of the New Republic's government led by Senator Pwoe arrived. With Borsk Fey'lya's death, Pwoe had proclaimed himself Chief of State in the chaos that had followed Coruscant's fall, and he commanded Antilles to hold the system in a delaying action until the Advisory Council could evacuate to Kuat."}, {"tag": "p", "text": "The Myrkr strike team, meanwhile, fled to Tenel Ka's homeworld of Hapes. Jaina Solo was reunited with her friend Jagged Fel and the group became embroiled in Ta'a Chume's plot to replace the current Queen Mother Teneniel Djo with Jaina Solo. At the same time, an invasion force led by Tsavong Lah's son Khalee Lah invaded the Hapes Consortium. Although Chume succeeded in assassinating the Queen Mother, Tenel Ka took command and led the Hapes forces to victory in the Battle of Hapes. Khalee Lah was killed in the battle, and Chume was arrested."}, {"tag": "p", "text": "At Borleias, Antilles led an epic defense of the system, assisted by Rogue Squadron, Wraith Squadron, and many of the pilots whom he had led in the capture of the planet from the Empire many years earlier. With the aid of the Executor-class Star Dreadnought Lusankya, they repelled two Yuuzhan Vong assault fleets, one led by Wyrpuuk Cha and another by Czulkang Lah, father to the Yuuzhan Vong warmaster. In days of fighting, Antilles inflicted extreme casualties on the Yuuzhan Vong attackers, culminating in Operation Emperor's Spear, the use of the Lusankya as a sacrificial ramship to destroy the Domain Hul worldship commanding Vong forces."}, {"tag": "p", "text": "The tactical victory at Borleias proved to have great political importance, as it gave credibility to New Republic politicians such as Cal Omas, who were determined to continue the war, and discredited the defeatist politics of Pwoe."}, {"tag": "h4", "text": "The Republic regroups"}, {"tag": "p", "text": "The New Republic regrouped on the traditional Rebel redoubt of Dac in the Calamari sector, although the self-elected Chief of State Pwoe remained on Kuat. Sovv remained in command of the Defense Force, and his staff quickly concluded that the Yuuzhan Vong had taken unsustainable losses in the conquest of Coruscant, and were now committed to defending exposed positions in the Core Worlds."}, {"tag": "p", "text": "Despite the growing stresses of maintaining such a large empire, to many the Yuuzhan Vong still appeared to be unbeatable: planets that were not conquered outright often capitulated, or collapsed internally due to the efforts of collaborators. At this time, the Yuuzhan Vong controlled most of the Core, the Inner Rim, and the galactic eastern area of the Mid and Outer Rims. The New Republic was reduced to a wedge of the southwest Outer Rim, a small pocket connecting Kashyyyk and Mon Calamari, the Deep Core, and other minor areas. With its numbers shrinking from the past years of war, the New Republic now was being faced with unified forces as their enemies conquered more and more planets."}, {"tag": "p", "text": "The last months of 27 ABY and the beginning of 28 ABY were dominated by the reconstruction and reorganization of the New Republic Defense Force while the Yuuzhan Vong fortified the Core. Meanwhile, Grand Master Skywalker led a mission to occupied Coruscant where a team of Jedi confronted and killed the dark Jedi Irek Ismaren, dubbed \"Lord Nyax\". During the mission, Senator Shesh committed suicide when confronted by her enemies."}, {"tag": "p", "text": "Throughout this conflict, many believed that Jacen Solo, who was captured at Myrkr, was dead. Jacen's mother, Leia Organa Solo, did not believe this and felt that Jacen was still alive somewhere, though many, such as Jacen's sister, Jaina, insisted to Leia that Jacen was dead. It was soon revealed that Jacen was alive but was being held on Coruscant by the former Jedi Vergere. Vergere taught Jacen of different aspects of the Force, which he used to gain control of the future World Brain, a Yuuzhan Vong organism to be used to coordinate the terraforming of Coruscant. However, she also tortured him, putting him through the Embrace of Pain. Finally, the Yuuzhan Vong were convinced that Jacen had been turned to their side. This was a ruse, and when Jacen was ordered to kill Jedi prisoner Ganner Rhysode, he disobeyed and instead helped Ganner to escape. In an epic duel at the Well of the World Brain, in the ruins of the Senate Building, Ganner sacrificed himself to protect the altered World Brain and Jacen and Vergere escaped back to Republic space."}, {"tag": "h4", "text": "The election of 28 ABY"}, {"tag": "p", "text": "Within the New Republic government, Senator Pwoe's defeatist policies cost him much of his support and a new election for the position of Chief of State was held. Unlike previous elections, there was no clear winner and the four main candidates Cal Omas, Fyor Rodan, Cola Quis and Ta'laam Ranth prepared for the recount. Luke and the Jedi feared what would happen if the vehement anti-Jedi candidate Rodan was elected and favored Omas, who had been one of his greatest supporters under Fey'lya's government."}, {"tag": "p", "text": "Attempting to break the impass, Omas offered Quis a seat on the Commerce Council in return for his support but this was still not enough to win the election. The arrival of the Smugglers' Alliance changed the election considerably as their leaders Lando Calrissian and Talon Karrde decided to help Omas out and they made donations to some of Rodan's more questionable supporters. In the second vote, Omas and Rodan were level, leaving Ranth with the choice of who would be elected. Supreme Overlord Shimrra, fearing that Omas's election would ruin his plans for a quick victory, ordered that he should be assassinated."}, {"tag": "p", "text": "The smugglers then made their move, persuading the Senators they had bribed to throw their support behind Omas and Ranth was convinced to back Omas for a seat on the Justice Council. It was then that the Yuuzhan Vong launched an attempt to kill Omas and his chief supporter Triebakk, but they were stopped by Mara Jade Skywalker. Omas won with a resounding victory and established the High Council and reorganized the New Republic to continue the war against the Yuuzhan Vong."}, {"tag": "h3", "text": "Taking the offensive"}, {"tag": "h4", "text": "Hunting the Supreme Overlord"}, {"tag": "p", "text": "All was not going as well as hoped for the Yuuzhan Vong. The terraforming of Coruscant had been sabotaged by Jacen Solo when he escaped the planet with Vergere. Following a period of mourning, the Bothans declared a state of ar'krai genocide against the Yuuzhan Vong in retaliation for the death of Borsk Fey'lya. The Defense Force then prepared to attack the weary Yuuzhan Vong. Admiral Gial Ackbar, though retired and advanced in age, began advising the reforming Defense Force and its commanders on the best ways to take the fight to the Yuuzhan Vong. Fleets were reorganized and new units were trained and equipped. The former Supreme Commander invigorated the beings in the New Republic military, giving them back their pride and confidence."}, {"tag": "p", "text": "The first major action of 28 ABY was a raid on Obroa-skai after the New Republic Intelligence Service received information that Supreme Overlord Jamaane was at last entering the galaxy proper. The NRI was mistaken, however, as Shimmra had already been slipped through to Coruscant in secret, and the raid resulted only in the death of Supreme Commander Komm Karsh. More devastating to the Yuuzhan Vong, however, were the materiel losses: the destruction of Karsh's worldship and two large troop transports represented the loss of the only strategic reserve the Yuuzhan Vong had had left from beyond the galaxy. From then on, the Yuuzhan Vong could expect no further assistance from beyond Vector Prime, as an enraged Jamaane pointed out to Warmaster Lah. At that same meeting, Master Shaper Ch'Gang Hool was duly executed by Shimmra for failing to bring the World Brain under control."}, {"tag": "p", "text": "Republic forces launched several subsequent attacks on the Yuuzhan Vong, attacking Duro, Wayland, Bimmisaari, Gyndine and Nal Hutta, delivering numerous defeats to the Yuuzhan Vong. The victories tempered the rebuilt Defense Force and boosted morale. In a strategic assault on Ylesia, the Republic managed to destroy the Peace Brigade and capture its leaders Sal-Solo and Pwoe."}, {"tag": "h4", "text": "Alpha Red"}, {"tag": "p", "text": "As the war progressed toward a major clash between the New Republic and the Yuuzhan Vong, a new weapon was revealed that sent terror into Luke and his Jedi Order. It was revealed that Dif Scaur, the Director of New Republic Intelligence, had employed Lurrian and Chiss scientists to develop the Alpha Red virus, a pathogen deadly to the Yuuzhan Vong, from the bafforr pollen that was discovered by the Jedi on Garqi."}, {"tag": "p", "text": "The Jedi were horrified by this but, despite their warnings, Omas was persuaded to use the weapon in an attempt to win the war. However, before the weapon could be used, Vergere sabotaged it, delaying Alpha Red for many months. The Republic was forced to resort to Ackbar's strategy, and Cal Omas promised Luke that Alpha Red would only be used as a last resort."}, {"tag": "h4", "text": "The Battle of Ebaq 9"}, {"tag": "p", "text": "After determining their weaknesses, Ackbar developed a trap for the Yuuzhan Vong. Feeding the Yuuzhan Vong spy network within the New Republic false intelligence, Ackbar convinced them that Cal Omas and several Jedi were hiding in the \"Final Redoubt\" on the secluded moon of Ebaq 9 in the Deep Core. Warmaster Lah, already at odds with the Supreme Overlord over the numerous losses his forces had sustained during the war, was driven to attack Ebaq 9 instead of going after the Corellian system and Centerpoint Station as he had planned. Taking a large portion of the fleet into the Deep Core, Lah launched his attack on the planet's apparently-weak defenses."}, {"tag": "p", "text": "The gas giant Ebaq was at the foot of a dead-end hyperlane, and Ackbar's plan went into action as, a bit at a time, the Republic fleet emerged behind Lah's fleet. Too late the Warmaster realized he had been tricked. As his fleet was trapped and decimated, Lah led a personal invasion of the moon in an effort to kill the Jedi there. However, Vergere arrived and crashed her fighter through the base's protective shield. The Yuuzhan Vong force was wiped out when the base was opened to raw vacuum, but the act also cost Vergere her life."}, {"tag": "p", "text": "However, Lah had survived and he stormed through the base in the hope of killing the few Jedi that remained in the vicinity. He found Jaina Solo, Lowbacca and Tesar Sebatyne surveying the remains of the Yuuzhan Vong force, and the Warmaster launched a desperate attack to regain his honor, incapacitating Sebatyne and badly wounding Lowbacca before engaging in a vicious duel with Solo. However, the woman who would become the Sword of the Jedi bested him and stabbed Lah through the neck, killing him. With Lah's death, the Yuuzhan Vong had suffered their worst defeat since the invasion had begun."}, {"tag": "p", "text": "The Battle of Ebaq 9 was a victory beyond all expectations. In the aftermath, Omas, convinced that the weak confederate nature of the New Republic could not fight the war to victory, used the political capital gained to reorganize the government as the Galactic Federation of Free Alliances, also called the Galactic Alliance. Incorporating a new federal system, the new Galactic Alliance focused itself to defeating the Yuuzhan Vong threat and restoring peace to the galaxy. Meanwhile, Anor, disgraced by the failure of the mission at Ebaq 9, fled the wrath of Supreme Overlord Shimrra and disguised himself as a Shamed One. He took the guise of the prophet Yu'shaa and began stirring up the Jeedai heresy on Yuuzhan'tar."}, {"tag": "h3", "text": "Regaining ground"}, {"tag": "h4", "text": "The Yuuzhan Vong counterattack"}, {"tag": "p", "text": "The New Republic victory at Ebaq 9 was substantial, but not decisive; it failed to break the Yuuzhan Vong defenses surrounding the Core, and instead the now increasingly insane Supreme Overlord Jamaane lashed out. Choka was recalled from Hutt Space and named Warmaster. Meanwhile, the Vong launched attacks on N'zoth—driving the Yevetha to the point of extinction—Bakura and the Ssi-ruuvi Imperium, and conquered Barab I, Rutan and Belderone. The Imperial Remnant, neutral since the Battle of Ithor owing to Pellaeon's misgivings about the New Republic's war effort, was also attacked. Pellaeon was believed killed at the Battle of Bastion."}, {"tag": "p", "text": "The Galactic Alliance had hoped to persuade the Imperial Remnant to become a member state, but with Pellaeon's apparent death, the Alliance's most vocal opponent in the Remnant, Kurlen Flennic, was already making his move for power. However, Pellaeon had survived the battle and commanded the counter-attack at the Battle of Borosk, which devastated the Yuuzhan Vong fleet led by B'shith Vorrik."}, {"tag": "p", "text": "However, Vorrik outmaneuvered Pellaeon's fleet and attacked Flennic's fleet at Yaga Minor. Flennic, unknowingly with the help of the Dark Lady Lumiya, held the Yuuzhan Vong off long enough for Pellaeon's force to arrive, forcing Vorrik to withdraw to the Core. Afterward, Pellaeon persuaded the Remnant to ally with the Alliance, breaking Flennic's position in the process."}, {"tag": "h4", "text": "Operation Trinity"}, {"tag": "p", "text": "After a year of preparation, the Galactic Alliance Defense Force at last began its final campaign for the liberation of the Core Worlds. The Galactic Alliance First Fleet, based at Kashyyyk, began a complex series of feints and strikes to cut off Coruscant from the major systems in the Inner and Mid Rims, codenamed Operation Trinity. Three major attacks were launched within a month or so of time—one at Duro, another at Fondor, and the last at Bilbringi."}, {"tag": "p", "text": "Fondor was a decisive victory, though Duro was a costly feint designed to draw forces away from the attack on the Fondor system, and proved to be politically damaging to the Alliance's reputation among Duros. The Second Battle of Bilbringi, however, was nearly a disaster for the Alliance; orchestrated by Supreme Commander Sovv and three of his other\ncommanders, Admiral Kre'fey and Generals Antilles and Bel Iblis, the attack coincided with the Yuuzhan Vong's release of the mabugat kan. This organism was designed to destroy HoloNet relays and disrupted the Galactic Alliance's communications network, preventing the Alliance from co-ordinating the three fleets involved in the operation and derailing the attack. The Alliance fleet was saved by the means of a complex ruse involving the feigned overload of the Mon Mothma's main reactor, which encouraged the Yuuzhan Vong to pull back and allowed the Alliance fleet to escape."}, {"tag": "h4", "text": "Into the Unknown Regions"}, {"tag": "p", "text": "Vergere had claimed that the mysterious, long-lost world of Zonama Sekot, where she had been taken prisoner by the Yuuzhan Vong many years before, held the solution to the war. Grand Master Skywalker led a team of Jedi to search for the mysterious planet, first traveling to the Imperial Remnant in the hopes of persuading it to join with the new Galactic Alliance. In the aftermath of the Battle of Yaga Minor, Pellaeon agreed to an alliance, and also granted them navigational data for the Unknown Regions, and Captain Arien Yage and the Widowmaker to help them on their way."}, {"tag": "p", "text": "Skywalker's team headed into Chiss space to obtain information on the Unknown Regions and, hopefully, Zonama Sekot. They paused at Munlali Mafir before arriving at the Chiss capital of Csilla, where the Jedi searched the Chiss libraries for the missing planet. Later, the Jedi located Zonama Sekot in the Klasse Ephemora system, but so did the Yuuzhan Vong. Sekot drove off the Yuuzhan Vong attackers as the Jedi landed on its surface, and the Jedi opened negotiations with the living world to help them in the war."}, {"tag": "p", "text": "Jeedai heretics including Anor, disguised as Yu'shaa, along with the shaper Nen Yim and the priest Harrar, also arrived on the planet, where they discovered that many of the species from their galaxy could be found there. Furthermore, Yim discovered that Sekotan technology was extremely similar to that of the Yuuzhan Vong, and concluded that her people had gone terribly astray. A plot by Anor to destroy the living world was foiled, though he stole one of Zonama Sekot's living starships and fled back to Yuuzhan'tar in the hopes of regaining favor with the Supreme Overlord."}, {"tag": "h4", "text": "Rallying the galaxy"}, {"tag": "p", "text": "Solo, Organa Solo, and Twin Suns Squadron headed out to find powerful allies to help in the war. Meanwhile, thanks to the actions of the First Fleet and Mandalorian Supercommandos led by Boba Fett, the Perlemian Trade Route had re-emerged as an invasion corridor. However, in response to the failure of the Trinity plan, the Yuuzhan Vong launched strikes on the as-yet untouched shipyards at Hakassi and Kuat, before moving on to the Alliance redoubt at Mon Calamari."}, {"tag": "p", "text": "Half the Defense Force lay in wait in the Calamari system, but the Defense of Mon Calamari was a desperate engagement that only ended in the Galactic Alliance's favor when, in the Core Worlds, Zonama Sekot emerged from hyperspace over Yuuzhan'tar. Horrified, Supreme Overlord Jamaane withdrew Choka's forces from Mon Calamari and the rest of the galaxy to defend his capital against the living world."}, {"tag": "h3", "text": "Galactic victory"}, {"tag": "p", "text": "The Galactic Alliance fleet thundered down the Perlemian Trade Route to force an end to the war above Yuuzhan'tar. The Battle of Yuuzhan'tar was a furious engagement above the Vongformed Coruscant. Han Solo and Leia Organa Solo managed to rescue hundreds of high-ranking Alliance prisoners facing sacrifice to the enemy's gods while Luke Skywalker and a team of Jedi assaulted Shimrra's Citadel. In the end, Supreme Overlord Jamaane was killed by Skywalker; his familiar Onimi, the true mastermind behind the invasion, was slain by Jacen Solo, who had achieved his ultimate goal in experiencing Oneness with the Force in the process, and the Yuuzhan Vong were defeated. In the face of the Supreme Overlord's death and incredible losses, Warmaster Choka ordered the Yuuzhan Vong to surrender. Though many chose suicide, those who survived were placed under Zonama Sekot's jurisdiction."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Zonama Sekot revealed itself to be the seed of the long-dead original Yuuzhan Vong homeworld. One of the terms of surrender the Galactic Alliance placed before the Yuuzhan Vong was that they were to help rebuild Coruscant. The Galactic Alliance moved its temporary capital to Denon, but would revert to Coruscant after the rebuilding was complete."}, {"tag": "p", "text": "After the cease-fire, the remaining Yuuzhan Vong were recalled from across the galaxy to Zonama. The living world, with its Yuuzhan Vong, disappeared back into the Unknown Regions where its new inhabitants could live in peace and establish their relationship with Sekot. They planned to abolish their caste system and eliminated the posts of Warmaster and Supreme Overlord, although Choka seemed to remain their de facto leader. A few dozen shapers remained behind on Coruscant to assist in the rebuilding, but some scattered Yuuzhan Vong forces in outlying portions of the galaxy refused Choka's call to surrender, continuing to fight for at least several more months."}, {"tag": "p", "text": "Many Bothans, however, were unforgiving for the death of Fey'lya, and refused to end their state of ar'krai genocide against the Yuuzhan Vong, sending ships into the Unknown Regions to hunt for Zonama. By 36 ABY, however, their primary efforts had been foiled by the Alliance, which had impounded the ships detailed for the expedition."}, {"tag": "p", "text": "Though the Yuuzhan Vong had terraformed many planets in Hutt Space, the affected worlds proved oddly resistant to the invaders' biotech, and within a decade of the conflict's end the Hutts had reclaimed most of their territory and were seeking to dominate reconstruction efforts in surrounding regions. In the Centrality, an independent territory between Hutt Space and the Cron Drift, fear of the Yuuzhan Vong prompted Fleet Admiral Sris Lehhett to install himself as Scrivinir in a bloody military coup, replacing Ottdefa Tavell Geen, who went into exile on Coruscant. The invasion also brought a flood of refugees to the region, resulting in overpopulation and scarcity of jobs. Ailon suffered crippling economic sanctions due to the Ailon Nova Guard's support of the Yuuzhan Vong during the war."}, {"tag": "p", "text": "The Yuuzhan Vong War devastated countless worlds, leaving around 300 trillion beings dead and millions of homeless refugees. Despite this, the Galaxy was more unified than it had ever been before, and was willing to work hard to repair the damage inflicted by the long and costly war."}, {"tag": "p", "text": "Six years after the end of the war, a major consequence from the invasion would take form in the Dark Nest Crisis and the Swarm War, thanks to the reappearances of Raynar Thul, Lomi Plo and Welk, who were lost in the war during the Mission to Myrkr at the height of the invasion."}, {"tag": "p", "text": "The Dark Nest Crisis was not the only consequence of the war, however. During the latter half of the Yuuzhan Vong's invasion, while young Jedi had been sheltered away from the conflict in the the Maw, most of those young Jedi were having their minds subtly corrupted by the far-reaching influence of the ancient entity known as Abeloth, who would later begin using those Jedi years later to try to fulfill her diabolical machinations."}, {"tag": "p", "text": "Jacen Solo's defeat of Onimi convinced him to embark on a galactic sojourn for five years after the war in order to expand his knowledge and experience with the Force. That, combined with his prior tutelage to Vergere, ultimately led him down the path of the dark side of the Force leading up to the Dark Nest Crisis. By 40 ABY, eleven years after the end of the war, Solo would take over the Galactic Alliance for a full year during the Second Galactic Civil War as the Sith Lord Darth Caedus before his own sister, Jaina, struck him down in combat; in effect, Jaina's defeat of her own brother saw the completion of the Yuuzhan Vong's prophecy of the fabled twins engaging in fatal combat."}, {"tag": "p", "text": "In large part because of the Yuuzhan Vong's actions during the war, they were mistrusted by most of the galaxy even decades later, with many still believing them to intend to engage in galactic conquest. This eventually came to a head with the failed Ossus Project, where an attempt at restoring devastated planets via the Yuuzhan Vong's terraforming process ended disastrously by making the planets even less hospitable than before. In actuality, the disaster for the project was not of the Yuuzhan Vong's doing, but rather perpetrated by the renegade Yuuzhan Vong Zenoc Quah and the One Sith faction of the Order of the Sith Lords created by Darth Krayt which, combined with the Jedi's protection of the Yuuzhan Vong, ended up resulting in the creation of Darth Krayt's Galactic Empire after it split from the successor state to the Imperial Remnant, the Fel Empire. These events would give rise to the Sith–Imperial War and the Second Imperial Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Yuuzhan Vong War is the centerpiece conflict of The New Jedi Order, a multi-author book series published by Del Rey between 1999 and 2003. The war appears in all of the nineteen novels, three eBook novellas, and three short stories that make up the series, and the beginning and end of the Yuuzhan Vong War appear in The New Jedi Order: Vector Prime and The New Jedi Order: The Unifying Force, the first and last novels of the series respectively. According to the timeline that appears in all Del Rey novels, The Unifying Force was originally set in 30 ABY, making the Yuuzhan Vong War a five-year conflict. However, the 2005 reference guide The New Essential Chronology placed the Recapture of Coruscant in 29 ABY, and subsequent sources have adhered to the retcon."}, {"tag": "p", "text": "The New Jedi Order was originally conceived by Bantam Spectra and Dark Horse Comics as an alien invasion storyline featuring different antagonists, but the storyline never reached production, as Del Rey acquired the Star Wars publishing license. In 2009, Dark Horse announced the Star Wars: Invasion comic book series, which was set in the Yuuzhan Vong War's first year, tying into the novels while charting its own story. The series was ultimately cancelled after three arcs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}