{"url": "Yuthura_Ban", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Jedi trainees of the Jedi Order", "Category:Redeemed Jedi", "Category:Sith Masters", "Category:Sith of Revan's Sith Empire", "Category:Slaves", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Yuthura Ban"}, {"tag": "p", "text": "Yuthura Ban was a Twi'lek female born on the planet Sleheyron at some point before the Jedi Civil War. Originally enslaved to Omeesh the Hutt, Ban wounded Omeesh and eventually escaped Sleheyron, although she was abandoned on an uninhabited planetoid by the crew of a cargo ship she stowed away on in order to flee her homeworld. However, the Jedi Order rescued her and began training Ban in the ways of the Force, where she reached the rank of Padawan. However, she eventually abandoned the Jedi due to her hatred for slavery, and joined the Sith at the Sith Academy on the planet Korriban, eventually becoming the apprentice of the Academy's Headmaster Uthar Wynn."}, {"tag": "p", "text": "In the final year of the Jedi Civil War—a galactic conflict between the Dark Lord of the Sith Darth Malak's Sith Empire and the Galactic Republic—Ban encountered the Jedi Revan who, as the reconditioned former Dark Lord, was searching for the Star Forge, a Rakatan space station under the control of Revan's former apprentice Darth Malak. Ban was convinced by Revan to approve him for enrollment in the Sith Academy, with Uthar Wynn placing her in charge of teaching Revan and the other students the ways of the Sith. However, Ban conspired with Revan to murder Wynn at the final trial, so that she could gain his position as the Academy Headmaster."}, {"tag": "p", "text": "During this time, Ban also aided Revan in his quest to gain more prestige with Wynn, and Revan learned about her past as a slave and Jedi. When Revan succeeded in gaining prestige with Wynn, Ban accompanied him and Wynn to the ancient Sith Lord Naga Sadow's tomb, where Revan was tasked with reaching the Rakatan Star Map and retrieving a Sith lightsaber. After the Jedi completed the tests, Ban and Revan turned against Wynn after he ordered the former to kill the latter. Ban turned against Revan, who, after defeating her, spared her life and convinced her to return to the light side and the Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi training"}, {"tag": "p", "text": "Yuthura Ban, a Force-sensitive Twi'lek female, was born on the Outer Rim planet Sleheyron during the era before the Jedi Civil War. She was enslaved at a young age to the slave master Omeesh the Hutt. Filled with anger over her predicament, Ban sought vengeance by strengthening her determination not to simply be \"nothing.\" At some point, she was alone with Omeesh in his bedchambers, and Ban stabbed the Hutt, who was intoxicated, and escaped his compound. Ban fled the planet by stowing aboard a cargo ship. Upon discovering her, the ship's crew abandoned her on a desolate planetoid to die."}, {"tag": "p", "text": "However, she was eventually rescued by the Jedi Order, who recognized her potential with the Force, and decided to train her in the ways of the Jedi, despite her advanced age. Though Ban advanced to the rank of Padawan, she was unable to let go of her anger towards her former oppressors and all others who would practiced slavery, having been brought up in such conditions and so being able to empathize with their position. Seeing the apparent Jedi inaction over the matter as intolerable and unable to resolve her differences with the Order, Ban abandoned her Master and the Jedi teachings, swearing to find a new means to achieve the power necessary to combat what she considered to be the wickedness of slavery throughout the galaxy."}, {"tag": "h3", "text": "Uthar Wynn's apprentice"}, {"tag": "p", "text": "After abandoning the Jedi path, Ban wandered the galaxy until she arrived on the Sith homeworld of Korriban, which was the headquarters of the Dark Lord of the Sith Darth Malak's Sith Empire. As the Jedi and the Sith warred with each other, Ban sought refuge at the Sith Academy. Upon her acceptance, Ban was initiated in the ways of the Sith and willingly gave into her emotions. The Sith at the academy considered her rage and hatred to be her natural talent and ability; coupled with her anger towards the Jedi and hatred of slavery, Ban experienced a quick rise through the ranks."}, {"tag": "p", "text": "Her prowess with a lightsaber and her unbridled anger drew the attention of the Academy's headmaster, Sith Master Uthar Wynn. Wynn took Ban on as an apprentice, teaching her to use her hatred to become a weapon of the Empire. As the apprentice to the headmaster, Ban gained high authority in the Academy, including having the final word on whether a hopeful would be admitted into the Academy or not."}, {"tag": "h4", "text": "Redemption"}, {"tag": "p", "text": "After a time, Ban's thirst for power led her to devise a plot to overthrow her master, a plan involving a promising new recruit to the Sith, within whom the Force bristled with startling intensity. Though sensing something odd about the young Human, Ban hadn't suspected that she had, in truth, enlisted the services of Revan, the deposed Dark Lord of the Sith, on his journey around the galaxy searching for the Star Maps."}, {"tag": "p", "text": "Taking to each other quickly, Ban let Revan in on her plan to usurp power at the Academy. Together with her powerful new ally, Ban and Revan attacked Headmaster Wynn and managed to slay the Sith Lord. With Wynn dead, Ban was ready to take over control at the Academy, and in a calculated—if not entirely desired—act of betrayal, she turned on Revan to ensure that no other being would seek to overthrow her. Despite her power, Ban was no match for Revan and was overpowered. She yielded to Revan, who allowed her to live, and by sparing her, Ban was convinced that she had walked the wrong path and allowed Revan to redeem her. Renouncing her title at the Academy, Ban departed Korriban and returned to Dantooine to seek redemption in the eyes of the Jedi Council."}, {"tag": "p", "text": "Darth Malak had attacked Dantooine, however, and the Jedi Enclave was destroyed through orbital bombardment by his flagship, the Leviathan. Ban's fate was lost to history when all records were destroyed during the First Jedi Purge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Even though she herself was still an apprentice, Yuthura Ban was also a lead instructor and mentor at the Sith Academy. She respected initiative and cunning in her students and was not considered short of either herself. Like most of the Force-sensitives at the academy, she wore the uniform of a Sith officer as opposed to robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Yuthura Ban was voiced by Tamara Phillips. Different from most characters, Ban wielded a lightsaber shoto as her weapon instead of a regular lightsaber. Yuthura Ban's home planet Sleheyron was originally planned to have appeared in Knights of the Old Republic—after it was scrapped; however, it was written into Ban's background as a tribute to the effort that had been put into planning it."}, {"tag": "p", "text": "If Revan plays through Korriban after being imprisoned on the Leviathan, he or she can question Ban about what the Sith Lord used to be like. If the player mentions that he/she is Revan, Ban will not believe him, though if the player chooses to do so again after defeating Ban and sparing her life, she realizes he is telling the truth, and sees that he is no longer the Dark Lord he once was; alternatively, after the attempted coup, if Uthar Wynn is favored and Ban defeated, he will recognize Revan and devote the Academy to him. When Ban asks who Revan's \"companions\" are the player has the option of saying \"they are just my slaves.\" Despite her past, this doesn't seem to bother her much even though she hates slavers. Most members of your party will play along, although some may question. There are many choices for the player to make in Star Wars: Knights of the Old Republic regarding Ban's fate. The most extreme light side choice is outlined above, with the other options detailed below."}, {"tag": "h4", "text": "Options"}, {"tag": "p", "text": "On Korriban, various options in the Sith Academy are present to the player, who plays as Revan. Revan can tell Uthar Wynn about Ban's plans to betray him and, after doing so, Wynn instructs Revan to perform a small task that will ensure Ban is weakened via poison by the time of the final trial—making her considerably easier to defeat. It is up to the player whether or not to do as Wynn asks. A second choice is that, after informing Wynn of Ban's plot, Revan can then go on to tell Ban about Wynn's plotting against her. It is up to the player whether or not to inform Ban about the poison; if so, then she takes precautions against it. In response to this news, Ban tells Revan to poison Wynn's bed and provides the poison and access to his room. Revan can again choose whether or not to do this. If the player doesn't tell Ban about the poison, there is the option of poisoning them both. After Revan passes the prestige trials to enter the tomb with Ban's help and completes the assignment therein, Wynn tells Revan to fight Ban to pass the final trial and show no mercy. Depending on the player's previous choices, the player will obtain different reactions from Ban and Wynn throughout this section of the game, for example Ban won't be surprised by Wynn's attempt to turn Revan on her if you have informed her of his plot and Wynn won't be poisoned if you didn't undertake Ban's task."}, {"tag": "p", "text": "Sample light side choices after the duel in the tomb of Naga Sadow, a deceased Sith Lord, include Revan siding with Ban and the two of them killing Wynn. Ban then turns on Revan and is defeated. If the player befriended Ban earlier, and after the Jedi enclave is destroyed, Revan then reveals his real identity and tells Ban to abandon the Sith, which leads the Sith to attack Revan after Ban left. An alternate light side choice is that Revan destroys Wynn for Ban. Once done, Ban battles Revan and is defeated. If the player learned about Ban's former life, it is possible to convince her to return to the light side. If succeeded, the player can meet her in the courtyard on Dantooine where she describes being accepted there and even brought her old Master to tears upon her return, this is only possible of course if the player locates the Korriban Star Map before at least two others, or else Revan will not be able to even go to Dantooine to see her there. A third alternate light side choice is that Revan sides with Ban and they kill Wynn. Once done, Ban battles Revan and is defeated. She pleads for mercy and Revan spares her life but does not return her to the path of the light. She leaves unharmed and takes up mastery of the Academy, in Wynn's place. It is also possible, as a Jedi, that Revan sides with neither Sith and kills both."}, {"tag": "p", "text": "Sample choices which take the player to the dark side of the Force include Revan siding with Ban and the two of them killing Wynn. Once done, Ban battles Revan and is defeated. She pleads for mercy but Revan strikes her down, killing her. Another alternate dark side choice is that Revan sides with Wynn and kills Ban. Depending on the actions taken while on Korriban, Wynn may attack. If not, Revan may choose whether or not to kill Wynn, or to allow him to live and keep mastery of the Academy when Revan leaves. The third and final dark side choice is that, as the only \"true Sith,\" Revan sides with neither Ban nor Wynn and instead kills both."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}