{"url": "Yush_Baskalar", "categories": ["Category:Legends articles", "Category:Biologists", "Category:Engineers", "Category:Force-sensitives", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Yush Baskalar"}, {"tag": "p", "text": "Yush Baskalar was a scientist who worked with the Thaereian military in researching genetics and cybernetics."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As a child, Baskalar had been identified as a Force-sensitive and taken to be trained at the Jedi Temple on Coruscant. He was soon sent away because of his violent tendencies. By the time he returned home, his family had died in an accident while moving to another system. He had a lasting hatred of the Jedi for that reason."}, {"tag": "p", "text": "Yush Baskalar had an interest in science, and excelled in such diverse fields as droid manufacturing, cybernetics, and Near-Human genetics, partly because of his Force sensitiveness. He worked at a university doing advanced genetics research for the Galactic Republic, but was then dismissed for conducting questionable experiments. He was approached by Qar Jalunn, who offered unlimited resources to continue his research. Baskalar balked when he learned he had to work with the Thaereian military, but Jalunn convinced him to continue on."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yush Baskalar was a short, stooped man with narrow shoulders. He was bald, with thick black eyebrows. His mouth was in a perpetual grimace, and he had a small x-shaped scar on his right forehead, which he tried to hide by turning away in conversation. Overall he moved slowly and awkwardly, which belied the nimbleness of his hands."}, {"tag": "p", "text": "Baskalar hated everyone he worked with. He was easily annoyed, which caused his eyelids to twitch. He slurred and spoke with a guttural accent. He was focused in his work, and his ultimate goal was to destroy the Jedi Order."}, {"tag": "h2", "text": "Sources"}]}