{"url": "Z-95_Headhunter", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starfighter classes", "Category:Galactic Republic starfighter classes", "Category:Resistance starfighter classes", "Category:Z-95 Headhunter models", "Category:Z-95 Headhunters"], "nodes": [{"tag": "h1", "text": "Z-95 Headhunter"}, {"tag": "p", "text": "The Z-95 Headhunter, also referred to as the Z-95 starfighter or simply the Z-95, was a multi-purpose starfighter jointly manufactured by Incom Corporation and Sublights Products Corporation. Despite being considered outdated, the Z-95 was durable and adaptable to a variety of different roles, which led many to recognize it as a versatile and respectable snub-fighter of its era. Countless variants of the Headhunter were produced, including one model designed specifically for the Grand Army of the Republic's clone pilots during the Clone Wars. The Z-95 was the forerunner of Incom's popular T-65B X-wing starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Though already outdated by the time it entered production, the multi-purpose Z-95 Headhunter starfighter boasted endurance and adaptability and was largely recognized as a respectable and versatile snub-fighter of its era. Equipped with two pairs of engines, the Z-95 was originally manufactured without a hyperdrive, though it could be retrofitted with a rudimentary one. However, as it lacked an astromech socket, its pilot was forced to pre-program hyperspace routes or force-feed its navicomputer jump coordinates provided by data chips. The Z-95 was also noted for its cramped one-man cockpit."}, {"tag": "p", "text": "Despite these drawbacks, the Z-95 featured internal environmental controls and a pair of wingtip-mounted, high-powered blaster cannons. It also boasted concussion missile launchers and a center-mounted ion cannon, which was capable of penetrating deflector shields. The Z-95 was the forerunner of Incom's incredibly successful T-65B X-wing starfighter, which implemented technologies and designs tested in the Z-95. Another successor to the Headhunter was the Z-96, introduced after the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prolific starfighter"}, {"tag": "p", "text": "Jointly manufactured by Incom Corporation and Subpro, the Z-95 Headhunter entered production during the Clone Wars and spawned countless variants. The Galactic Republic made its own mark on the Headhunter's large production run with a clone-specific model. Reaper Squadron was one unit that flew Headhunters. Decades after the end of the war, the wreckage of one of Reaper Squadron's Z-95s was recovered from Castilon's Karavian Trench by Synara San."}, {"tag": "p", "text": "Even after the war had ended, Z-95s were extremely common. Idryssa Barruck flew a Headhunter during her time with Saw Gerrera's Partisans, and several modified with basic hyperdrives and upgraded weaponry were used by Berch Teller's rebel cell in its fight against the Galactic Empire. Hask Taff, a member of Teller's cell, used several Headhunters to craft a false holovid that was transmitted to the Empire's Sentinel Base. The signal was meant to deceive the Imperials into believing that their Rampart Station had fallen under attack, thus inciting them to protect the station and leave Sentinel Base vulnerable. However, Moff Wilhuff Tarkin, the base's commander, detected that the message was a fraud and instead set a trap for the insurgents, who were immediately ambushed upon entering the system and forced to retreat into hyperspace. The rebels later used Z-95s to attack an Imperial convoy near the Gulf of Tatooine; all but one were obliterated, as Teller used the remaining Headhunter to escape to the planet Christophsis while the rest of his cell was captured and summarily executed. A gang of Pakiphantos also used Z-95s modified with proton cannons. The gang tried to capture the Millennium Falcon on Dhandu 3, but were outflown or outgunned."}, {"tag": "h3", "text": "Venerable snub-fighter"}, {"tag": "p", "text": "During the Galactic Civil War, the Alliance to Restore the Republic continued to use Z-95s. Despite being slightly slower and less maneuverable than its successors, including the T-65B, the Z-95 proved a close-air-support staple of the Rebel Alliance Starfighter Corps. The TIE fighter pilots of the Imperial Navy referred to Z-95s as \"skulls.\" During a battle on Portocari, Rebel Headhunters killed an Imperial pilot named Barsay."}, {"tag": "p", "text": "Though they had long been retired from military use, Z-95s were a favorite among smugglers, gangsters, pirates, and a variety of others seeking to do both legitimate and illegitimate business twenty-nine years after the end of the Galactic Civil War. In one instance, Resistance pilot Poe Dameron acquired three Z-95s for a covert mission designated Operation: Sabre Strike. He later used another Z-95 during a heist carried out by the Resistance's Black Squadron."}, {"tag": "p", "text": "Pilots with the Citizens' fleet flew Z-95s during the Battle of Exegol in 35 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Z-95 Headhunter made its first appearance in the new Star Wars canon in the mobile game Star Wars: Commander, published by Disney Interactive on August 21, 2014. Before that, it was referenced in the clone Z-95 starfighter entry in the now-discontinued StarWars.com Encyclopedia. This entry, including the Z-95's mention, has since transferred over to the Encyclopedia's current replacement, the Databank. The Z-95 Headhunter was originally created for the 1979 Star Wars Legends novel Han Solo at Stars' End, written by Brian Daley as the first entry in The Han Solo Adventures trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}