{"url": "Yuzzum/Legends", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Sentient species of Endor", "Category:Yuzzum"], "nodes": [{"tag": "h1", "text": "Yuzzum"}, {"tag": "p", "text": "Yuzzums, or Yuzzumi, were sentient, neckless, furred and round-bodied humanoids from the forest moon of Endor."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Members of the species were generally humanoid, with round bodies covered in thick fur and long, spindly limbs. Nevertheless, the species showed a great deal of genetic diversity. Some had wide, toothy mouths, while others had fangs. Their eyes ranged from black to yellow in color. Yuzzum feet were also variable, with some groups having hooves, some having pawlike feet, and others claws. Some Yuzzums had long, pointed ears, while others had no ears to speak of. Most Yuzzums were quite tall, although shorter individuals were born occasionally. These dwarf Yuzzums were often social outcasts."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Yuzzums lived in small groups that traveled the plains of Endor's moon. They spent much of their day hunting rodents, such as ruggers, that lived in the tall grasses. Some Yuzzums had learned to domesticate the arachnoid rakazzak beasts as mounts to aid them in the hunt. Although a few Yuzzums had no technology at all, other groups fashioned primitive spears and forked lances for use in hunting and self-defense."}, {"tag": "p", "text": "The Yuzzums spoke a language known as Yuzzum. The tongue was very musical in nature, and it may have been the basis for Ewokese. In fact, the Yuzzums sometimes encountered the Ewoks (as well as the other species of Endor's moon), and many Ewoks could understand the Yuzzum language. When C-3PO was communicating with the Ewoks shortly before the Battle of Endor, he spoke to them using the Yuzzum language. Nevertheless, Yuzzums were not averse to eating woklings. One group of Yuzzums served Morag, the Tulgah witch."}, {"tag": "p", "text": "Yuzzums were sometimes exported as pets, despite the fact that they were sentient. Their musical language made them naturals to find work as singers. One of the performers in Jabba the Hutt's court, Joh Yowza, was a Yuzzum. Jabba once received a shipment of these creatures in lieu of payment from one of his smugglers; all of them were fed to the rancor but Wam Lufba, whose impressive show of marksmanship saved his life. Other Yuzzums formed colonies on other worlds around the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}