{"url": "Z-6_jetpack/Legends", "categories": ["Category:Legends articles", "Category:Jetpacks", "Category:Mitrinomon Transports products"], "nodes": [{"tag": "h1", "text": "Z-6 jetpack"}, {"tag": "p", "text": "The Z-6 jetpack was a model of jetpack produced by Mitrinomon Transports and commonly used by the Mandalorians. Many famous Mandalorians used this type of jetpack, including Jango Fett and, in a modified version, Boba Fett."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The jetpack included a targeting computer, flight gyros, and a missile. The Z-6's fuel tank held enough fuel for one minute of continuous operation (20 three-second blasts). Each three second blast moved the wearer up to 100 meters horizontally or 70 meters vertically. A user of standard height and weight could reach a top speed of 145 kilometers per hour with a maximum range of two kilometers. Directional thrusters featured gyro-stabilizers to apply counterthrust for maneuvering and landing."}, {"tag": "p", "text": "The top of the jet pack had a turbo-projected magnetic grappling hook with 20-meter lanyard (replaceable with 100 meters). A winch inside the launcher lifted up to 100 kilograms. The grappling hook unit was replaceable with an anti-vehicle homing missile."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Both Jango and Boba were thwarted by their jetpacks after sustaining damage in battle: while fighting Obi-Wan Kenobi on Kamino, Jango crashed after grappling Obi-Wan with a cable when Obi-Wan anchored the tether to a structure on the landing platform. Jango's jetpack detached itself and flew out of control, exploding against a column. His other jetpack also failed him after being damaged by a reek during the arena battle on Geonosis while combating the Jedi Master Mace Windu, leaving him without escape before his execution by the Jedi's lightsaber."}, {"tag": "p", "text": "Around 1 ABY, the Death Watch bunker was found on the forest moon of Endor. Inside, various spacers who could get past the super battle droids and Death Watch soldiers could gain access to materials that would allow them to build the jetpack, as well as Mandalorian armor."}, {"tag": "p", "text": "Years later, while battling Luke Skywalker over the Great Pit of Carkoon, Boba Fett's jetpack was activated by Han Solo, launching him into the side of Jabba's sail barge and into the sarlacc, but it was the only thing that helped him escape soon after."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}