{"url": "Z-95_Headhunter_Expansion_Pack", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Miniatures Game Wave IV"], "nodes": [{"tag": "h1", "text": "Z-95 Headhunter Expansion Pack"}, {"tag": "p", "text": "The Z-95 Headhunter Expansion Pack is a supplement to the Star Wars: X-Wing Miniatures Game from Fantasy Flight Games. The expansion features a detailed miniature of the Z-95 Headhunter. It was released on June 26, 2014 as part of the game's fourth wave of expansions."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In many ways, the Z-95 Headhunter was the precursor to the X-wing. Though the Z-95 was later outclassed by the X-wing in most respects, it could perform a tighter turn and was cheap, durable, and reliable enough that the Rebel Alliance continued to make use of it throughout the Galactic Civil War, most commonly in close air support roles."}, {"tag": "p", "text": "The Z-95 Headhunter enters X-Wing as the Rebel starfighter with the lowest squad point cost. None of the four ship cards in the Z-95 Headhunter Expansion Pack weigh in at more than nineteen squad points, and at just twelve points, the Bandit Squadron Pilot ties the Imperial's Academy Pilot as the starfighter with the game's lowest point cost value. However, the Z-95 Headhunter isn't designed to fly like a TIE fighter; it comes, instead, with the focus and target lock actions, as well as the ability to load and fire a missile."}, {"tag": "p", "text": "Accordingly, the Z-95 Headhunter Expansion Pack comes with two missile upgrades, the Assault Missiles and the deadly Ion Pulse Missiles."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The Z-95 Headhunter Expansion Pack contains one miniature, plus a maneuver dial and action tokens, as well as pilot and upgrade cards."}, {"tag": "h3", "text": "Ship components"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Pilot cards"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "h4", "text": "Reference cards"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}