{"url": "Z-95_Headhunter/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Alliance to Restore the Republic starfighter classes", "Category:Confederation starfighter classes", "Category:Galactic Republic starfighter classes", "Category:Hutt Cartel starfighter classes", "Category:Z-95 Headhunter models", "Category:Z-95 Headhunters"], "nodes": [{"tag": "h1", "text": "Z-95 Headhunter"}, {"tag": "p", "text": "The Z-95 Headhunter was a starfighter designed jointly by Incom and Subpro Corporations years before the Invasion of Naboo. Its resilience and longevity meant it remained a staple of private and low-priority government starfighter forces long after its introduction."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Considered one of the most capable fighters of its day, it boasted a distinctive bubble canopy and a set of triple blasters mounted at the ends of each of its two variable geometry wings; later versions dispensed with the swing wings and bubble canopy in favor of more precise maneuvering thrusters and canopy instrumentation. Its sleek yet rugged design was attributed to Seti Ashgad, a scientist in Incom's Hyperdrive Design Division."}, {"tag": "p", "text": "It was named after the Coromon headhunter, a predator native to the Coromon Islands on Fresia, the planet where Incom was headquartered."}, {"tag": "p", "text": "The Z-95 was smaller in size than its successors: the Incom/Subpro ARC-170, designed during the Clone Wars, the clone Z-95 starfighter, also made in the Clone Wars, and the Incom T-65 X-wing, designed shortly before the outbreak of the Galactic Civil War."}, {"tag": "p", "text": "Though the Z-95 still enjoyed considerable use in the years following the establishment of the New Republic, it was clearly outclassed by fighters developed in the decades since its original release. When compared to the T-65, it was slower, less maneuverable, had lighter armor and shielding, and was not as heavily armed."}, {"tag": "p", "text": "It was fairly inexpensive and reliable, making it a favorite amongst smugglers, Outer Rim organizations, local system defense forces, and bright-eyed youngsters with dreams of becoming fighter jockeys. Pirate groups such as the Nebula Front also used the Z-95. Also, despite the later T-65 being more maneuverable, the Z-95 was known to be able to perform a tighter turn."}, {"tag": "p", "text": "Owing to its longevity, it was not surprising that many variants of the Z-95 came into existence due to the efforts of starship mechanics and hotrod pilots throughout the galaxy; these included a split-wing version, a courier version that could accommodate a single passenger, variants with various alternative weapons loadouts, and a trainer version, the Z-95XT Trainer, that was commonly used by the Rebel Alliance until replaced by the T-65X, the trainer variant of the X-wing."}, {"tag": "p", "text": "Later model variants had the Zr-390 navicomputer system from Narmox installed."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic service"}, {"tag": "p", "text": "The Z-95 was first constructed for the Galactic Republic before the Clone Wars. The prototype for the Z-95 was the Onyx Star, developed at the Bahalian Shipyards."}, {"tag": "p", "text": "After Subpro and Incom ended their partnership, Incom reportedly bought the intellectual property rights and proprietary systems of the Z-95."}, {"tag": "p", "text": "One notable Z-95 was the Dicer flown by the Bothan pilot Eelo Begraas around 31 BBY. He painted it red-on-black, a color scheme that was immediately identifiable to his opponents. Such was Begraas' reputation that the mere sight of the Headhunter was enough to send many opposing pilots into hysterics."}, {"tag": "p", "text": "Nirama, crimelord of the Cularin system, used Z-95s both as his sponsored ships for the races of Eskaron, and to provide armored transport to some of his main minions."}, {"tag": "p", "text": "One year before the start of the Clone Wars, Jedi Master Obi-Wan Kenobi, while on a mission to Fondor, piloted a Z-95 owned by Fondor's Senator Rodd to infiltrate and destroy a Groodo the Hutt-fabricated counterfeit of the ancient Corellia StarDrive transport, the Sun Runner. While successful in the task, he was forced to retrieve his Padawan Anakin Skywalker who, piloting a Rodd-owned CloakShape fighter, was forced to crash-land on the Fondorian jungle-moon Nallastia."}, {"tag": "p", "text": "A Headhunter variant, the clone Z-95 starfighter, saw use during a Republic campaign to retake the planet Umbara. Also, Headhunters participated in the Outer Rim Sieges against the Confederacy of Independent Systems. After the war, the Z-95 would fall into the hands of parties other than the newly-formed Galactic Empire, such as pirates and other underworld groups."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Though outdated by the time of the Galactic Civil War, Z-95 Headhunters were well respected starfighters that were available to buy from various merchants, and were still in common use as late as the Second Galactic Civil War."}, {"tag": "p", "text": "Han Solo piloted an early model Z-95 Mark I while leading the defense of an outlaw tech base in the Corporate Sector against CSA IRD-A fighters. However, by this period, they were considered obsolete compared to other fighters."}, {"tag": "p", "text": "The Rebellion used Z-95t Headhunters in close air support roles. The temporary Alliance covert squadron, Bandit Squadron, also used Z-95s. The m'Yalfor'ac Order in Guiteica was also known to use these by-then obsolete fighters around 2 ABY. N'dru Suhlak piloted a Z-95 with an expanded cockpit to carry passengers."}, {"tag": "p", "text": "Mara Jade used a hyperdrive-equipped Headhunter during the Thrawn crisis. Her Headhunter had a single center-mounted ion cannon instead of the standard concussion missile launchers. Jaina Solo's first ship, Crystal, was also a Z-95 Headhunter, and Jaden Korr flew a hyperdrive-equipped Headhunter named Far Wanderer on missions to different worlds such as Bakura, Hoth, and Korriban. Another prominent member of the New Republic to use a Headhunter was Tycho Celchu, during the reforming of Rogue Squadron; however, the armaments were significantly weakened as at the time he was considered an Imperial spy. Five Headhunters were also used to great effect in the closing stages of the mission to retake Coruscant in 7 ABY, by Corran Horn, Erisi Dlarit, Rhysati Ynr, Pash Cracken, and Asyr Sei'lar. The four Z-95s that survived the conflict—Corran's was destroyed during his capture—were sold off to various museums to raise funds for Rogue Squadron's attack on Thyferra."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the Z-95 is a one-person ship, with N'dru Suhlak's modified unit accepting one passenger, the RPGA adventure The Price of Business featured a Z-95 that took Len Markus and some other fifteen people from Genarius to Cularin. This might be a heavily modified ship, a typo (there was one different Z-95 in the same story), or poor research in part of the text author."}, {"tag": "p", "text": "In Star Wars: Empire at War, the sign of the Z-95 is used to represent the V-wing fighter. In Star Wars: Empire at War: Forces of Corruption, this is fixed."}, {"tag": "p", "text": "In the game Star Wars: Jedi Starfighter, if the player enters HEADHUNT as a cheat code, the player can fly the Z-95 during missions."}, {"tag": "p", "text": "For its appearance in the Star Wars: The Clone Wars television series beginning with the episode \"Darkness on Umbara,\" the Headhunter was originally designated as a separate class, the \"Z-85 Headhunter.\" This was later rectified in the episode's guide, which corrected the ship name to read simply \"Headhunter,\" giving no indication that the Headhunter in The Clone Wars was intended to be different from the original Z-95."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}