{"url": "Z-6_rotary_blaster_cannon", "categories": ["Category:Canon articles", "Category:Weapon stubs", "Category:BlasTech Industries products", "Category:Personal blaster cannons", "Category:Rotary blasters"], "nodes": [{"tag": "h1", "text": "Z-6 rotary blaster cannon"}, {"tag": "p", "text": "The Z-6 rotary blaster cannon was a blaster cannon used by the Galactic Republic and the Separatist Alliance during the Clone Wars. Later, during the reign of the Galactic Empire, these weapons were used by both the Imperial Army's Heavy Weapons Stormtroopers and Rebel Alliance's Heavy Soldiers during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "The Z-6 rotary blaster cannon was a model of blaster cannon manufactured by Merr-Sonn Munitions, Inc. and BlasTech Industries. It was created in an attempt to solve the two problems limiting blaster fire-rate: recharge time and overheating. To solve these problems, the Z-6 was created as a chaingun. The weapon was equipped with six small, rotating blaster cannons distributed around a large cooling cell. Each cannon contained its own active chamber, which fired while turning. The Z-6 was capable of firing 166 shots per second without the risk of overheating or throwing its user into the air. It was extremely heavy and required its user to stand still to be used with precision. On top of its weight, troopers equipped with the Z-6 would also have to carry its energy cartridges. Replacing the weapon's cartridges took multiple minutes, and would force its user to leave the battlefield during that time. Merr-Son engineers attempted to find solutions to these problems, but none of them were satisfactory, which tainted the Z-6's popularity."}, {"tag": "h3", "text": "Usage during the Clone Wars"}, {"tag": "p", "text": "During their training on Kamino, every clone trooper was trained to operate the Z-6 rotary blaster cannon. However, only heavy weapons experts utilized the weapon voluntarily during battle. The blaster cannon was almost exclusively used by the Galactic Republic during the Clone Wars, as it was too heavy for the Confederacy of Independent Systems's B1-Series battle droids."}, {"tag": "p", "text": "In 22 BBY, clone trooper CT-782 \"Hevy\" used a Z-6 rotary blaster cannon to defend Rishi Station before sacrificing himself to warn the Republic in an attempt to stop a Separatist attack on Kamino. During the Battle of Umbara, clone trooper \"Hardcase\" used a Z-6 blaster cannon. At the Battle of Ringo Vinda, the 501st Legion and Clone Commander Doom's unit relied heavily on the Z-6 to attack Admiral Trench's forces. When the Separatists invaded Scipio, Commander \"Thorn\" used a Z-6 nicknamed \"the Hammer.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}