{"url": "Z9", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Galactic Republic droids", "Category:Galactic Republic military personnel", "Category:Masculine programming", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "Z9"}, {"tag": "p", "text": "Z9 was a masculine-programmed R5 series astromech droid who served the Galactic Republic and belonged to Admiral Wilhuff Tarkin during the Clone Wars. Z9 was present on the space station Valor along with Tarkin shortly before the Republic strategy conference was set to begin there. When the final Republic cruiser—secretly under Separatist control—arrived for the conference at a dangerous approach speed, Z9 attempted to hail the ship's crew but could not make contact. The Separatist plan to ram Valor with the cruiser was foiled after a Republic squad managed to detonate the incoming ship, saving Valor and much of the Republic fleet around the station."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Z9 was a masculine-programmed R5 series astromech droid who served the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. Z9 was owned by Republic Navy Admiral Wilhuff Tarkin. In the year 20 BBY, the Republic strategy conference, a meeting of several Republic Military officers and the Jedi High Council to discuss the ongoing war effort, was to be held aboard the space station Valor in the Carida system. Z9 and Tarkin were both present on the station shortly before the start of the conference, as they awaited the arrival of one final cruiser. Unbeknownst to Z9 and the others on Valor, the last cruiser had been overtaken by the Separatists, who had loaded the ship with rhydonium, a volatile fuel, and planned to ram the cruiser into the station."}, {"tag": "p", "text": "As the last cruiser emerged from hyperspace, those present on Valor noticed that the ship was coming in fast and showed no signs of stopping. Z9 attempted to hail the cruiser's crew, to no avail. As the ship continued its approach, the rhydonium on board suddenly detonated before the cruiser could reach the station. This premature explosion was triggered by the Republic's D-Squad, a group of spy droids that had boarded the vessel prior to its arrival in the Carida system. While Valor and the Republic fleet over the planet Carida were bombarded with debris, the station itself—which Z9 was still aboard—and many of the Republic vessels remained intact."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The R5 unit Z9's plating was colored light gray and red. Like other R5 units, Z9 stood at 0.97 meters, or 1.29 meters with the inclusion of his head-mounted antenna. As the secretly-Separatist-controlled Republic cruiser rapidly approached space station Valor, Z9 was quick to attempt to make contact with the incoming ship from aboard the station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Z9 appeared in the thirteenth episode of the animated television series Star Wars: The Clone Wars' fifth season, \"Point of No Return,\" which aired on January 12, 2013. While Z9 is depicted as an R5 astromech, there are two shots in the episode that erroneously show Z9 as a different model of astromech droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}