{"url": "Zachary_O%27Halleran", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Dark Jedi", "Category:Former Jedi", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Zachary O'Halleran"}, {"tag": "p", "text": "Zachary O'Halleran, also known as ZC-04, is a former student at Coruscant Jedi Academy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Zachary O'Halleran was born to two entrepreneurs around the same time as his future schoolmate Christina Starspeeder. As a preteen/teenager, he attended the Jedi academy based at the Jedi Temple on Coruscant and excelled in the Jedi arts, becoming one of the school's top-performing students. He had romantic feelings for Christina Starspeeder and asked her out, but she disapproved of his antagonistic and cunning nature and refused him."}, {"tag": "h3", "text": "Final year at the academy"}, {"tag": "p", "text": "Eventually, Victor began attending the academy. On the first day back at school, Zachary immediately recognized him as the younger brother of Christina, of whom his obsessive and romantic feelings had not decreased at all. He told him he did not have to think he was uncool and guided him to his dormitory, as he did not know the way there on his own. However, he surprised him by laughing at Coleman and Emett's ambitions to become actors. Yoda sternly told him he had somewhere to be. With a curt bow, O'Halleran left Victor's dorm to see to the affair."}, {"tag": "p", "text": "For the remainder of the semester, Zachary O'Halleran pretended to form a genuinely intimate connection with Victor, when in fact he was attempting to use him to tell him the kind of things he could do that Christina would consider charming. However, he had very little initial success. The two ate lunch together the morning after they met, after he invited him to sit with him and his posse. One of Zachary's posse members, with his obvious approval, got him in trouble as a practical joke by stealing his sandwich, leading to a food fight and Victor receiving detention from Mr. Zefyr."}, {"tag": "p", "text": "After Spring Break, Zachary asked Victor if Christina told him anything positive relevant to him, but Victor denied this, infuriating him. Considering an entire semester wasted, Zachary took out his anger by punching the locker door repeatedly and storming off. Although Victor perceived this as innocent heartache, the two began to fall apart when Zachary began hitting on Maya Phoenix and began hanging out with him. Seeing a chance to spite Victor for his lack of progress, Zachary overheard him asking Maya if she wanted to go to the dance with him. Thinking quickly, Zachary used the Force to spill paint on Maya and frame him."}, {"tag": "p", "text": "During the final examinations, Zachary, being devastated and enraged by Victor's estrangement with him, attempted to set him up to fail by telekinetically causing the stones Victor was supposed to lift to spin around haphazardly from behind a shaft. Unfortunately for him, Artemis Oophanoe noticed what was going on and interfered by pushing him against the shaft using the Force, breaking his eye contact and concentration, thwarting him."}, {"tag": "p", "text": "That evening, Zachary arranged to fight Victor by locking Maya, Artemis, Coleman and Emmett in four unused lockers, hoping their suffering would lure Victor to him, as he had meant for him to sense it with the Force. Taking the bait, Victor nearly succeeded in freeing his friends, but Zachary leaped in front of them and confronted Victor. He blamed Victor for turning his would-be girlfriend against him. In the middle of the hallway, he locked Victor in a one-sided duel. Just as Zachary overpowered the smaller and less experienced Padawan, Christina came and smashed Zachary into a wall, and as he lay dazed, she destroyed the locker door and freed Maya and Emett. Yoda then came to the rescue and freed Coleman and Artemis. Zachary was subsequently expelled."}, {"tag": "h3", "text": "Impersonating ZC-04"}, {"tag": "p", "text": "Two years later, he pretended to be a droid principal named ZC-04. When Mr. Zefyr came to suspect his true colors, ZC-04 panicked and finagled his way to the rank of principal, granting him the authority to expel Mr. Zefyr in order to cover up his tracks. However, his use of the Force gave him away and he was exposed by Victor during the school play. After his security droids manufactured by his parents were taken down, Zachary attempted to flee, but Victor used the Force to trip him. Mr. Zefyr pulled him out of his costume as Yoda lamented that Zachary's jealousy of Christina Starspeeder had corrupted his heart. Zachary was last seen being dragged from the auditorium by Mr. Zefyr. He was presumably taken into custody and arrested for theft, fraud, and attempted murder."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zachary seemed to represent all the aspects a Jedi Knight shouldn't be, as he was domineering, conceited, and overconfident rather than genuinely courageous, noble, and loyal to friends, despite having a posse that followed him around and sometimes started fights on his behalf. He looked down on other students and laughed at Emett and Coleman when they stated their ambition to join the Drama Club. He could also be sneaky and manipulative, as was evidenced by the lengths to which he was willing to go in his obsessive, single-minded pursuit of Christina Starspeeder. He tried manipulating Victor into telling him how to charm her and attempted to beat him up when he realized what he really wanted from him. To seek revenge, he cleverly locked four of his friends in lockers hoping he would sense their pain in the Force, and as a finishing touch stole Artemis' asthma breather, another example of his cunning."}, {"tag": "p", "text": "While Zachary never truly gave up on his obsessive pursuit of Victor, he did briefly date Maya Phoenix. However, this was solely to get under Victor's skin, as he remorselessly imprisoned her in a locker and later showed absolutely no regard for the continuation of what mattered most to her, the Drama Club."}, {"tag": "p", "text": "Zachary is also somewhat hypocritical. Curiously, while he claimed Drama Club was full of \"nerf herders\", he seemed to be an expert in the field, much more so than Victor, a trait Maya fondly acknowledged despite Victor bitterly claiming that such people were a dime a dozen."}, {"tag": "p", "text": "As ZC-04, Zachary was a cold, bitter, intolerant, absolutist, callous, strict, and emotionless administrator who loved his new authority and reveled in the despair he could wreak with it. As Yoda once stated, because of his lot in life and greed driven by seeing Christina and Maya distancing themselves from him, Zachary delighted in striking back at the academy that had, to him, cost him the girl he was obsessed with, the result of a suppressed desire for revenge."}, {"tag": "p", "text": "Although Zachary's parents were enabling and would eventually help him pull off the ZC-04 facade, he had little regard even for them, as he scorned Victor for heeding his mother's advice over his own. He ditched his posse members when he was expelled and never attempted to contact them in his droid disguise. It is likely that he did not care for Christina as a person and instead gravitated to her immense power. Thus, it would seem he was so arrogant and cruel that he was indifferent to everyone, regardless of their status or perception of him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Zachary O'Halleran was formidable in his mastery of the Force, effortlessly using it to control the actions of other Jedi initiates, lifting them into the air and hurling them into walls. Artemis even claimed he was stronger in the Force than Victor and all his friends combined. Indeed, Zach effortlessly defeated Artemis in a straight duel, catching him off guard with a Force kick. Although Victor did not have enough experience to face him as a first year, by his third year he was the only student who could duel Zach on even footing."}, {"tag": "p", "text": "Zach was also a considerably gifted actor, as he impersonated ZC-04 for an entire year, with his one huge flaw being that he used the Force in his guise as a droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zachary is the main antagonist of the Victor Starspeeder trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}