{"url": "Zak/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Clone naval officers", "Category:Clone trooper captains"], "nodes": [{"tag": "h1", "text": "Zak"}, {"tag": "p", "text": "\"Zak\" was the nickname of a clone trooper captain who served in the Republic Navy during the Clone Wars. He was tasked with transporting Jedi Grand Master Yoda to the neutral moon of Rugosa to meet with the Toydarian King Katuunko, in order to urge the nearby planet of Toydaria to side with the Galactic Republic. In orbit of the moon, Zak's Consular-class cruiser was ambushed by two Confederate frigates, and Yoda was forced to take an escape pod to the surface of Rugosa, leaving Zak and the ship to retreat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zak was the nickname of a clone trooper captain born and raised on the planet Kamino to fight in the Galactic Republic Navy. After the outbreak of the Clone Wars on Geonosis in 22 BBY, Zak and his clone brothers joined the fight against the Confederacy of Independent Systems."}, {"tag": "p", "text": "During the war, the Republic sought to build a base in the Outer Rim Territories, and Supreme Chancellor Palpatine arranged negotiations to take place with the Toydarian King Katuunko on the coral moon of Rugosa. The Confederacy, however, intercepted the transmission on their newly built listening post, Skytop Station. Jedi Grand Master Yoda, along with several Coruscant Guards, was sent to Rugosa in a Consular-class cruiser under the command of Captain Zak. Shortly after arriving in Rugosa's system, Zak attempted to make contact with the Toydarian royal delegation, but the transmissions were jammed by the Confederacy."}, {"tag": "p", "text": "When Zak reported this to Yoda, their cruiser was suddenly ambushed by two Confederate Munificent-class frigates that had dropped out of hyperspace. The Confederate frigates were larger and more heavily-armed than the Republic vessel, and quickly weakened the cruiser's shields. Zak ordered his pilots to return fire and wanted to retreat immediately, more concerned about Yoda's safety than completing his mission. However, the Jedi Master ordered Zak to launch an escape pod to take him to Rugosa's surface so that he could continue his mission. Zak was concerned that the pod would be shot down by the frigates, but Yoda ordered the Captain to launch all of the pods to distract the Separatists. Once Yoda had departed, Zak and the Republic frigate escaped to hyperspace. Yoda safely reached the moon's surface and successfully completed the mission."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zak was trained on Kamino, where he was raised to be loyal to the Republic as well as his Jedi commanders. He would have aborted his mission to Rugosa in order to save Yoda, and because the general's safety was at risk, Zak was bold enough to question Yoda's plan to travel in an escape pod to the moon's surface. Zak's calm demeanor allowed him to bring the Republic cruiser to safety once Yoda had departed the ship. Zak had black hair, brown eyes, and tan skin. As a Human male clone of Jango Fett, he stood 1.83 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zak first appeared in \"Ambush,\" the first episode in season one of the Star Wars: The Clone Wars television series. He was first identified by name in the young readers book that was based on the episode. Like all clone troopers in the television series, Zak was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}