{"url": "Zaerdra", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Hidden Beks", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Zaerdra"}, {"tag": "p", "text": "Zaerdra was a pale-skinned female Twi'lek who lived in the Lower City of the Outer Rim world of Taris during the time of the Mandalorian Wars and the Jedi Civil War. A member of the Hidden Beks, a swoop gang that was one of the largest in the Lower City, she served as the personal bodyguard of the organization's leader, Gadon Thek. She participated in resistance activities undertaken by the Beks against the Mandalorian occupation of Taris in 3963 BBY. A devoted ward of Thek, she met the fugitive Jedi Padawan Zayne Carrick with suspicion when he returned to Taris while looking for his comrade, the Snivvian con-artist Marn Hierogryph. Zaerdra also held fellow Bek Griff Vao in low esteem, threatening him if his sister, Mission, was ever caught rummaging in her belongings."}, {"tag": "p", "text": "Some seven years later, during the height of a street war between the Beks and a rival gang, the Black Vulkars, which had been taken over by former Bek Brejik, she greeted the amnesiac former Dark Lord of the Sith Revan, accompanied by Republic officer Carth Onasi, with open hostility. Her indignant warnings forced Thek to apologize to his guests and to remind Zaerdra that he could still take care of himself. After Thek recruited the pair to reacquire a prototype accelerator that the Vulkars had stolen, she objected to the gang leader allowing Revan to ride the swoop that the accelerator had been installed on for the Tarisian Season Opener."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mandalorian invasion"}, {"tag": "p", "text": "A member of the Hidden Beks, a swoop gang hailing from the Lower City of the Outer Rim world of Taris, Zaerdra served as the personal bodyguard of Gadon Thek, the gang's leader. When the Mandalorians laid siege and eventually invaded the strategically-located planet, the gang, including her, became a large part of the resistance, hiding in the lower levels of the planet-wide city. When Zayne Carrick, who had been framed by the Jedi Covenant for the murder of four of his fellow Padawans, arrived looking for his Snivvian companion Marn Hierogryph, the Beks at first intended to hand him over to Constable Noana Sowrs. Those plans changed, however, after Carrick's discovery that Bek gang members Brejik and Griff Vao had kidnapped Sowrs' children prior to the invasion."}, {"tag": "p", "text": "Because of this, Thek ordered Zaerdra to give Carrick his lightsaber back, and accepted the fugitive into the gang. It was Zaerdra who transported the Constable's two sons, Nahk and Tallie, who were flown to where Sowrs and her own resistance group had agreed to meet the Beks. In order to get there, however, the Beks, along with Carrick and Zaerdra, were forced to fight their way through a group of Mandalorian Neo-Crusaders who were firing at them from the streets of the Lower City. After a confrontation between the Beks and members of the Constable's resistance movement over the presence of Carrick, which was further complicated by the arrival of Jedi Master Raana Tey, Sowrs was reunited with her children, after which Zaerdra helped Carrick to his feet."}, {"tag": "h3", "text": "The Bek–Vulkar gang war"}, {"tag": "p", "text": "At some point over the next seven years, Thek lost his sight in a swoop bike accident; however, he remained in control of the gang. Zaerdra's bodyguard duties, which she always took very seriously, were amplified when Brejik left the gang to become the leader of the rival Black Vulkars. The jilted former Bek, who had expected to be appointed as the blinded Thek's replacement, tried everything he could to kill the elder swoop racer and as many Beks as possible in an ongoing street war that would claim many lives, gang member and civilian alike. The conflict between the Beks and Vulkars continued through the outbreak of the Jedi Civil War and the occupation of the planet by the Sith Empire."}, {"tag": "p", "text": "At the height of the war, the amnesiac former Dark Lord of the Sith, Revan, along with Republic officer Carth Onasi, arrived in the Lower City after escaping the destruction of the Republic ship Endar Spire. The pair was searching for another Padawan, Bastila Shan, whose talents with battle meditation were crucial to the Republic's war effort against Darth Malak's forces. Acting on a tip-off from Mission Vao, a friend of the Beks who had introduced herself at Javyar's Cantina, the pair of Republic fugitives inquired at the Hidden Bek base about rumors they had heard of escape pods impacting in the Undercity of Taris. After pledging support for the Beks, they were allowed in; however, they were warned by the lookout about Zaerdra's nature. When Revan and Onasi walked up to the gang leader's desk, Zaerdra was and continued to be suspicious of them, even speculating that Revan might be a Sith agent. Thek, however, had a feeling that this wasn't the case, and told the pair what he knew about the pods, revealing Shan's whereabouts and that she had been offered up as a prize in the Tarisian Season Opener swoop race. When he and Revan made a deal to retrieve a prototype accelerator that the Vulkars had stolen in order to race in the Opener under the Bek banner and, thus, win Shan's freedom, she maintained a steely vigil."}, {"tag": "p", "text": "Zaerdra's suspicions proved to be baseless, however, when Revan, whom the Vulkars had attempted to recruit to their side, returned with the swoop bike accelerator. Thek planned to have Revan ride in the race on a bike with the accelerator installed, proposing this over Zaerdra's objection that the gang needed their best rider on that particular swoop. Accepting Thek's offer despite the instability of the prototype, Revan took first place for the Beks. However, Brejik accused him of cheating, and announced that he was withdrawing the Vulkars' share of the victory prize—the captive Shan. When the Jedi freed herself from the neural disruptor that had \"restrained\" her, the shocked Vulkar ordered his gang to attack Revan and the other Beks present. The resulting lightfight killed Brejik."}, {"tag": "p", "text": "Eventually Malak, who had had the planet quarantined after its conquest by the Sith in an attempt to find Shan, grew frustrated with the increasingly fruitless search. He then ordered Admiral Saul Karath to prepare the Sith fleet for an orbital bombardment. Virtually the entire surface of the planet was wiped clean of life in the resulting fusillade of turbolaser fire, with few if any buildings left standing."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Twi'lek female with a pale face and violet lekku, Zaerdra was a rough-and-tumble swoop rider who knew how to fight and was always ready for combat, due to her habit of wearing a suit of medium armor. She took her duties both to the gang and her charge very seriously. After Thek's swoop accident and subsequent blindness, she became even more fiercely protective of him. This mentality became so deep that Thek was forced almost routinely to tell her to back off, reminding Zaerdra that he could still look after himself. As a result of her duty, she was extremely suspicious of outsiders, meeting Zayne Carrick with ill-disguised contempt; seven years later, she greeted Revan with outright hostility. Zaerdra was also quite possessive, threatening Griff Vao, who she already didn't like, if his little sister, Mission, ever rummaged through her belongings again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zaerdra was first introduced in the computer and video game Star Wars: Knights of the Old Republic. She would later appear, albeit some seven years earlier in continuity, in the Knights of Suffering story arc of the Knights of the Old Republic comics. In both media, she serves as the personal bodyguard of Gadon Thek. Along with many characters depicted in this story arc, such as Griff Vao, Gadon Thek and Brejik, she was drawn wearing the same type of gear in which she had appeared in the game."}, {"tag": "p", "text": "If the player, as Revan, takes the dark path throughout the game, he can turn on the Beks by accepting to assassinate Gadon for Kandon Ark. After the deed the player returns to Kandon, who will reward the player by allowing him to ride in the swoop race for the Black Vulkars. In his assault on the base Revan can kill Zaerdra, who is still standing in the main room."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}