{"url": "Zalla", "categories": ["Category:Canon articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Shape-shifting individuals"], "nodes": [{"tag": "h1", "text": "Zalla"}, {"tag": "p", "text": "Zalla, also known as the Emerald Witch, was a female individual who was gifted with abnormal powers. Her sister, Queen Bellan of Rendel, imprisoned her due to her powers. Zalla escaped, overrunning the planet with plants and driving Bellan away. When the smugglers Han Solo and Chewbacca were tricked into landing on Rendel by Bellan, they managed to defeat Zalla, ending the effect of her powers. As Zalla lost her powers, her plants began to wither away, and she disintegrated into nothing."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imprisoned"}, {"tag": "p", "text": "Born on Rendel, Zalla was the sister of Bellan. As a child, Zalla discovered she had unique powers, which included being able to manipulate plant life and transform into a creature similar to a bird. Despite their differences, she and her sister had a friendly relationship between them. When Bellan became the queen of Rendel, she imprisoned Zalla, afraid that she would use her powers against her. While she was a prisoner, a seed landed in her cell, carried by a gust of wind. Zalla used her powers on the seed, causing it to grow into a dense forest of thorn-covered vines. Bellan fled Rendel, vowing to get revenge on her sister."}, {"tag": "h3", "text": "Witch of Rendel"}, {"tag": "p", "text": "Alone on the planet, Zalla became known in myths as the \"Emerald Witch of Rendel\", defending herself from anyone who landed there. No longer queen, Bellan hired smugglers and other starship pilots to go to Rendel, tricking them into thinking they had to deliver cargo there. When Bellan's unknowing recruits arrived on the planet, Zalla would use her powers to kill them, letting her plants absorb their life force."}, {"tag": "p", "text": "When the Barbadelan Karamu landed on Rendel with his droid SV-3, Zalla trapped him in the vines, using her powers to drastically increase his age. Several days later, Bellan hired the smugglers Han Solo and Chewbacca to deliver a tooka statue to an art collector. When Solo arrived, Zalla watched him from above in her bird form. As he went to deliver the statue, she caused the vines to trap him. The vines fed on Solo's life force, aging him like Karamu."}, {"tag": "p", "text": "As Solo questioned what had happened, Zalla landed in front of him, transforming out of her bird form. She explained the truth about the mission he had received from Bellan, telling him that it was another one of her sister's attempts to defeat her. However, Solo revealed that he had not come alone, and Chewbacca charged towards them, shooting the vines with his bowcaster."}, {"tag": "p", "text": "Solo retrieved the tooka statue and threw it at Zalla, breaking it. As the statue broke, it released a cloud of gas that began to kill the vines. An angered Zalla threatened Solo, attempting to trap him with her vines. She twisted a vine around Solo's arm, but her powers began to fade as the vines died, and Solo broke free. Zalla fell to her knees in despair as all her plants began to die around her. As Solo, Chewbacca and Karamu escaped Rendel in the Millennium Falcon, Zalla herself turned to dust, dissolving and fading away."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite Zalla's defeat, one of her flowers had taken root inside the Millennium Falcon, gone unnoticed by either Solo or Chewbacca. The story of Zalla was eventually told to Milo and Lina Graf, who told the tale to her crew after they became stranded on Mustafar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zalla had yellow eyes and green skin. Once a kind, friendly child, Zalla's imprisonment shaped her into becoming resentful and angry towards her sister, forcing her to flee her homeworld. Overconfident due to her powers, Zalla underestimated the chances of Bellan defeating her, and was unable to believe that she had been defeated."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Different to the rest of her kind, Zalla had powers that set her apart from her sister. She could control and manipulate plant life, able to grow and move a forest of vines which swarmed across Rendel. She also possessed the ability to transform into an avian creature, and could fly in both her bird and humanoid forms, using a pair of cape-like wings. Zalla depended on her powers—when the forest she created withered away, Zalla died as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zalla first appeared in the flashback section of the 2018 canon comic Star Wars Adventures: Tales from Vader's Castle 3, written by Cavan Scott and illustrated by Corin Howell. Scott originally gave Zalla and Bellan the names Helza and Ana, after Elsa and Anna, the two sister protagonists from Disney's 2013 animated film Frozen, but he later made a note to change the names to something less obvious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}