{"url": "Zam_Wesell", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Assassins", "Category:Bounty hunters", "Category:Clawdites", "Category:Denon residents", "Category:Females", "Category:Sharpshooters and snipers"], "nodes": [{"tag": "h1", "text": "Zam Wesell"}, {"tag": "p", "text": "Zam Wesell was a Clawdite female bounty hunter who lived during the last years of the Galactic Republic. As a Clawdite, Wesell possessed the ability to physically alter her appearance—a power which she used to assume the visage of a human female. Prior to the beginning of the Clone Wars, the bounty hunter Jango Fett enlisted Wesell's aid to assassinate Senator Padmé Amidala of Naboo in 22 BBY. Her efforts ultimately failed, however, resulting in Wesell's death at the hands of Fett before she could identify him as the would-be assassin to Amidala's Jedi bodyguards."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "A Clawdite female, Wesell was born on the planet Zolan. She was trained by the Mabari until she desired wealth and journeyed to Denon to employ her skills and training as an assassin. At some point, Wesell worked with bounty hunter Jango Fett, and became both his frequent accomplice and sometime partner."}, {"tag": "h3", "text": "Assassination plot and death"}, {"tag": "p", "text": "In 22 BBY, Wesell was hired by Fett to assassinate Naboo Senator Padmé Amidala to prevent her from speaking up against the Military Creation Act. Sometime later, Wesell bombed the Senator's cruiser when it reached Coruscant. However, Amidala herself wasn't on the cruiser. Instead, it was her handmaiden, Cordé. After receiving the news, Wesell told Fett that she had bombed the ship, but she used a decoy. Fett then gave her some kouhuns and told her to be careful while holding them as they were very poisonous. Wesell sent a droid to do it for her, but two Jedi had been assigned to protect the senator: Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker. Skywalker quickly killed the kouhuns and Kenobi grabbed the droid. While the droid was speeding through an express way, Wesell shot it with her projectile rifle which caused Kenobi to start falling through Coruscant's atmosphere."}, {"tag": "p", "text": "Wesell quickly fled in her speeder but Skywalker jumped on top of it and crashed it. Wesell was able to flee into the Outlander Club. Skywalker was about to dash in but Kenobi reminded his Padawan that Wesell had gone in to hide, not to run. Wesell shapeshifted into her Clawdite form in the speeder and Skywalker told Kenobi he knew that she was a changeling and was a female. Kenobi said they should be extra careful in searching for her. As the pair were in the club, Wesell was about to shoot Kenobi, but Kenobi sensed her and chopped her arm off with his lightsaber. Wesell screamed in pain and fell to the ground. Kenobi carried Wesell outside and asked her if she knew who she was trying to kill. Wesell answered that she knew it was a Senator from Naboo. Then she was asked who hired her. Reluctant to reveal her employer's name, Wesell answered that it was merely a job. Skywalker then pressured her to tell them and Wesell was about to say who it was when Fett, who had been watching the whole interrogation, shot her in the neck with a Kamino saberdart. Wesell then said her final words and died shortly after."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wesell preferred to strike her targets from afar, utilizing long-range sniper rifles or remote probe droids."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a changeling was able to assume the appearance of anyone she chose, including her targets. She was capable of taking on any humanoid form. As she died, she reverted from speaking Galactic Basic Standard to Clawdite, before cursing Jango Fett in Huttese."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zam Wesell first appeared in Attack of the Clones played by Leeanna Walsman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}