{"url": "Zam_Wesell/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Assassins", "Category:Bounty hunters", "Category:Clawdites", "Category:Females", "Category:Sharpshooters and snipers"], "nodes": [{"tag": "h1", "text": "Zam Wesell"}, {"tag": "p", "text": "Zam Wesell (pronounced /zæm.wɛzˈɛl/ or /zæm.ˈwɛs•əl/) was a shapeshifting Clawdite bounty hunter from the planet Zolan. In her true form, Wesell was a reptilian-like humanoid, although she often appeared as a Human woman with short blonde or bronze-colored hair. She trained in the ways of the Mabari warriors on her homeworld before eventually being labeled a heretic and fleeing to the commercial center of Denon. To escape, Wesell took the form of a human woman and took a job in personal security. Over time, she moved up through the ranks by honing her skills, gathering equipment, garnering finances and making valuable contacts which altogether allowed her to begin a career in bounty hunting."}, {"tag": "p", "text": "Wesell first encountered the bounty hunter Jango Fett in 32 BBY during his search for Bando Gora outlaw leader Komari Vosa. After assisting Fett in his scheme to defeat Vosa, the two began to develop a friendship that was propagated by their periodic partnership on various contracts. One such contract arose in 27 BBY when the two bounty hunters were seeking the Infant of Shaa ancient artifact and superweapon on behalf of the Dug Fernooda. Originally pitted against each other, the pair agreed to work together to capture the idol. It was then revealed to Wesell that a seedy underworld general planned to use it to destroy the Republic capital world of Coruscant. At Wesell's lead, Fett joined in the hunt to retrieve the artifact and save Coruscant. During this incident, Wesell made use of her developed shapeshifting abilities. This skill was also employed in her other exploits, such as the hunt for Kuati Hurlo Holowan, which was subcontracted by Jango Fett."}, {"tag": "p", "text": "In 22 BBY, with the rise of the Separatist Crisis, Confederate leader Count Dooku contracted Jango Fett to eliminate Senator Padmé Amidala on behalf of Nute Gunray. In turn, Fett subcontracted the bounty to Wesell, who attempted to kill the senator by destroying the senator's starship with an explosive device. The explosion, however, only served to kill Amidala's decoy and other passengers aboard the vessel. Amidala had arrived separately on another ship and was unscathed by the blast. Not pleased, but undeterred, Wesell met with Fett and schemed to use two venomous arthropods to kill the vulnerable senator. The attempt was foiled, however, by the alert presence of Jedi Anakin Skywalker and Obi-Wan Kenobi who had been stationed in the senator's apartment. The Jedi easily killed the arthropods and Kenobi leaped through the apartment window to grab hold of the droid which Wesell had used to deliver the predators."}, {"tag": "p", "text": "The droid began its return to Wesell, but the bounty hunter spotted the stowaway Jedi. Skywalker, at the same time, commandeered an airspeeder and began pursuit. After chasing Wesell through the skylanes of Coruscant, Skywalker was able to force the Clawdite to crash her airspeeder in a busy street of the Uscru Entertainment District. Wesell fled into a nearby locale and prepared to ambush the Jedi. She approached Kenobi from behind but was easily defeated and dragged from the club into a neighboring alley. There, she was silenced by her friend, Jango Fett, with a toxic dart before she could divulge his identity."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (—22 BBY)"}, {"tag": "p", "text": "Zam Wesell was born on the continent Sultur of Zolan, a planet in the Mid Rim. She was a member of the Clawdite species, which had turned into changelings due to genetic engineering gone awry centuries prior to her birth. Over time, known Clawdites, the off-shoot race of Zolanders, were ostracized, secluded in ghettos, and extensively persecuted. Wesell was raised in this oppressed society which was perpetually either on the brink of war or embroiled in it."}, {"tag": "p", "text": "While on Zolan, Wesell was trained in the ways of the Mabari, an ancient religious order of warrior-knights. Raised from a young age by the order, she craftily honed her fighting skills and achieved third level mastery of the Mabari martial arts. During this time, she also developed a desire for profit and became aggressive in her actions. Calling herself a \"progressive,\" Wesell's avarice was met with disapproval from more traditional Zolanders that held strong religious convictions; the natives expressed disdain for her chosen profession of assassinations and bounty hunting. Furthermore, the Mabari held to the belief that those who did not show their true face were the worst of all sinners. As a shapeshifter, Wesell was able to conceal her identity long enough to reach an aptitude in the Mabari martial arts. Eventually, however, the truth that she was a Clawdite was exposed."}, {"tag": "p", "text": "Identified as a sinner and heretic, Zam Wesell disguised herself as a Human businesswoman and fled Zolan for the commercial planet Denon. There, she took up employment in corporate security. The Clawdite garnered a reputation as she rose through the ranks to become a sergeant. In a carefully calculated move, she took the well-paid position of executive bodyguard. Wesell, however, was more interested in even greater esteem and profit. During her time on Denon, Wesell honed and refined her skills, gathered finances and equipment, and made contacts in order to turn her attention to bounty hunting. She had also firmly established an identity as a young, petite, attractive Human woman, which was a useful tool in gaining contacts for her work."}, {"tag": "p", "text": "It was during this time that Wesell met another Clawdite who lived on Denon and attempted to start a family. Through this relationship, she bore a daughter named Sone. Wesell felt confined in the family-life on Denon and decided to set her sights elsewhere. Having acquired the needed resources, Wesell departed Denon to pursue bounty hunting professionally, and she earned a considerable profit by employing her shapeshifting skills during jobs. Of her earnings, she sent large sums of money to radicals on Zolan who fought for the emancipation of the Clawdite species."}, {"tag": "h3", "text": "First partnership with Jango Fett (32 BBY)"}, {"tag": "h4", "text": "Encounter on Oovo IV"}, {"tag": "p", "text": "In 32 BBY, Wesell launched an attempt to capture Bendix Fust, a Mordageen smuggler who was wanted by the Malastarian Dug, Sebolto. Sebolto, a crime lord and king, placed the bounty of fifty-thousand credits upon Fust's head. The Mordageen, however, was interned on Oovo IV, an asteroid which housed a maximum security prison. At the same time, Mandalorian bounty hunter Jango Fett was also in pursuit of Fust, seeking the same reward. The Clawdite stowed-away aboard a supply vessel bound for Oovo IV and sneaked into the prison. Wesell and Fett independently—and unaware of each other's presence—snaked through the prison and arrived at Fust's cell. Wesell arrived first, mere moments before Fett, and ordered Fust to leave with her. Fett watched from a ventilation shaft as the Mordageen resisted, and Wesell used a gas grenade to subdue him."}, {"tag": "p", "text": "To cover her escape, Wesell staged a prisoner riot. The Clawdite had not foreseen the arrival of Jango Fett, and their mutual interference botched any previously devised plans for escape. Wesell had originally planned to leave Oovo IV via the supply transport that she had previously used, but with the guards alerted to the presence of both her and Fett, the original plan was not possible. Improvising, she stumbled upon Fett's ship, Jaster's Legacy, and attempted to hijack it. Prison guards, however, opened fire on Wesell as Fett arrived. The two dispatched the guards and, upon approaching each other, aimed their weapons in a standoff. Wesell proposed that since both were professionals, it would be more beneficial to barter than perish on behalf of a criminal such as Fust. Fett agreed, and Wesell stated that she simply wanted a ride off the asteroid and a share of the bounty."}, {"tag": "p", "text": "While they deliberated, a Firespray-class patrol ship swooped in and destroyed the Jaster's Legacy. The Mandalorian and Clawdite were then forced to work together in order to flee the asteroid. Fett instructed Wesell to stay with Fust and keep watch while he proceeded through the prison to destroy the shield protecting the asteroid. Once the shield was down, Fett planned to move into the hangar and commandeer a Firespray-class ship for escape. While Wesell waited for the Mandalorian bounty hunter, Fett destroyed the three power reactors and, keeping with the newly devised plan, proceeded to the hangar. Inside the hangar, he defeated a security droid and stole a Firespray-pursuit special. Upon take-off, he fired into the hangar, destroying the other vessels before gathering Wesell and Fust and departing the asteroid."}, {"tag": "h4", "text": "Mission to Malastare"}, {"tag": "p", "text": "Wesell sat behind Fett in his newly acquired Firespray-class ship as he piloted it out of hyperspace and into the Malastare system. As they approached the planet Malastare to meet with Sebolto, Wesell inquired whether they were going to turn Fust over to the Dug crime lord together and split the bounty evenly. Fett responded that only Wesell was going to approach Sebolto, while he himself executed \"other plans.\" At that moment, Wesell realized that Fett was working another, larger job and demanded that she be involved. Fett retorted that the Clawdite had been lucky not to die at his hands, but that while he was only using her as a tool for his own purposes, she might find the arrangement beneficial in the end. The Mandalorian devised a plan to infiltrate Sebolto's compound through the jungle while Wesell went to the compound proper with Fust. Wesell dropped Fett off in the jungle and the weapons were removed from the ship so that they could not be confiscated when it was searched. Wesell's mission was to spend time with Sebolto in order to allow Fett time to cross through the jungle and the canyon which isolated the compound. Wesell took the ship and headed directly for the compound, while Fett began his journey through the jungles."}, {"tag": "p", "text": "Wesell arrived at the compound and the vessel was searched. She approached Sebolto with Fust and, turning the bounty over, recounted the tale of how Fust had been extracted from Oovo IV. The tale impressed the Dug crime lord, and he invited her to stay for dinner. He also provided accommodations for the bounty hunter to \"freshen up.\" She reported these developments to Fett and noted that time was running out. Fust was being tortured, and she was unwilling to dine with the crime lord. Shortly thereafter, Fett arrived at the top of the cliff. Wesell left the compound to help the Mandalorian across but encountered several guards. Fett, holding to the plan, dispatched with the guards, allowing Wesell to send a skiff across the canyon for Fett to cross."}, {"tag": "p", "text": "Wesell inquired as to Fett's motives, and the Mandalorian revealed that he was searching for Sebolto's death stick factory. She recounted that Fust was taken through a secret doorway in the throne room. Fett handed Wesell his sniper rifle, at her suggestion, to help cover him on the ascent back to the palace. Dispatching with guards as they attacked, the pair overcame the physical obstacles of a raised bridge, high cliffs, and a waterfall. Reaching the compound, Wesell directed Fett to the building with the throne room. The Mandalorian remarked that he was going alone and wanted Wesell to return to the ship. He then approached Sebolto and chased him into the death stick factory, where the Dug crime lord fell to his death. As Fett was attempting to find the secret landing site used for smuggling material, Wesell reentered the facility. Not willing to leave without receiving her reward for Fust, she took as much loot as she could carry before proceeding to the Firespray-class ship."}, {"tag": "p", "text": "When Fett found the secret landing site, he was approached by a skiff piloted by Montross, an exiled Mandalorian warrior and rival bounty hunter. Fett called on his communicator for Wesell to bring around the ship, to which he received no response. Montross taunted his rival while Fett destroyed the skiff with a missile launcher. Wesell then brought the ship around, all the while overhearing part of the confrontation between Montross and Fett. The ad hoc pair then departed Malastare; however, Montross had placed a tracking device on the ship to follow their pursuits. Once in space, Wesell pressed Fett for more answers about his larger job. Connecting statements by Montross about Komari Vosa to his pursuits of Sebolto, she surmised that he was after the failed Jedi Padawan who had become the cult leader of the Bando Gora via private invitation. With his secret objectives exposed, Fett expounded a few more details of his hunt, making a connection between the Hutts and the Bando Gora. After briefly conversing, Wesell, at Fett's instruction, set course for the planet Tatooine."}, {"tag": "h4", "text": "Intrigue on Tatooine"}, {"tag": "p", "text": "Approaching Tatooine, Jango Fett contacted Rozatta, a Toydarian who was his confidant and informant for various bounties. The Toydarian commented favorably on the presence of Wesell and her appearance. Rozatta then provided information about the Hutts which had originally been provided to her by Watto, a fellow Toydarian. On Tatooine, Jabba the Hutt and Gardulla the Hutt were feuding for control of the planet. Rozatta noted that a Hutt was never seen without something being offered. She suggested pursuit of Longo Two-Guns, a criminal wanted by Jabba, dead or alive. Uncertain as to which Hutt was allied with the Bando Gora, Fett decided that he and Wesell should split up. Fett would go to Jabba for information while Gardulla would be visited by Wesell. As they split up, Fett went in pursuit of Longo Two-Guns, hoping that securing this bounty posted by Jabba would allow the Mandalorian an audience with the Hutt crime lord. Simultaneously, Wesell began to search for Gardulla's palace. By the time Wesell discovered the location of the palace, however, Fett had discovered from Jabba that Gardulla was dealing with the Bando Gora."}, {"tag": "p", "text": "While conversing with Jango Fett about the connection between Gardulla and the Bando Gora, Wesell spotted guards approaching her position outside of the palace. She was captured by the guards and taken into Gardulla's stronghold, where she was placed in a cell. Fett sneaked into the palace and found the cell where Wesell was being held. She informed him that the vault contained a computer and was located in the throne room, and added that the vault was accessible by a medallion that the Hutt wore. Despite her pleas for release, Fett stated that it was too dangerous to let her out, surmising that the guards would be alerted to an empty cell. He told her to trust him, and stated that he would return. Wesell, however, distrusted Fett and feared being fed to Gardulla's krayt dragon. Feeling betrayed, she alerted the Gamorrean guards, who then cornered Fett and rendered him unconscious."}, {"tag": "p", "text": "Fett was brought before Gardulla, where the Hutt revealed that Wesell was a shapeshifter, and mentioned her plans to sell her for profit. Fett was stripped of his weapons and armor and fed to the krayt dragon. Escaping, however, he dispatched all the guards, laid waste to the palace and confronted Gardulla. Gardulla chastised him for his efforts and his desire to gain access to her vault. Fett pushed the Hutt into the beast area, where she was consumed by her krayt dragon. In order to escape the palace, Fett terminated the dragon and proceeded to the holding cells to speak with Wesell. Once the Mandalorian arrived in the concourse of the cells, Wesell pleaded for her freedom, and he, in turn, scolded her for turning him in. Armed with the information from Gardulla's vault and Wesell remaining locked in the cell, Fett departed, stating his intent to bring down Vosa."}, {"tag": "h4", "text": "End of the hunt"}, {"tag": "p", "text": "With the help of Rozatta, Jango Fett discovered the location of the Bando Gora monastery on Kohlma, a moon of Bogden. The Mandalorian proceeded to Kohlma but was immediately overwhelmed by Bando Gora slaves and brought before Komari Vosa. During this time, Wesell escaped the cell in Gardulla's palace and discovered the location the cult leader. Following in pursuit, she arrived on the moon and sneaked into the compound. As Fett was being tortured, Wesell had secretively positioned herself in the chamber behind a wall, out of sight from the cult leader. The Clawdite drew her blaster and prepared to turn the corner. Vosa sensed Wesell's presence, however, and invited her to reveal herself. Disgusted and surprised, Wesell turned the corner, her weapon aimed at Vosa. Instead of firing immediately, the bounty hunter hesitated, allowing time for the cult leader to draw her twin red-colored lightsabers. Reacting, Wesell opened fire, only to have the blasterfire deflected back at her, though she managed to kill the two cultists flanking the Dark Jedi. In the foray, Wesell was struck and fell to the ground wounded. As Vosa approached, Wesell took aim at the binds holding Fett hostage and fired, striking the binds. Freed, the Mandalorian grabbed his weapons from a nearby surface and opened fire on Vosa while she retreated deeper into the monastery."}, {"tag": "p", "text": "Wesell struggled to lift herself as Fett approached her. She told the Mandalorian that they were \"even,\" and he calmly instructed her to remain in place and save her strength. Fett then continued in pursuit of Vosa, and the Mandalorian bested her in the skirmish that ensued. Out from the shadows appeared Tyranus, the man who had contacted Fett about the pursuit of Vosa. He commended Fett for his work and offered the bounty hunter a chance to be used as a template for the clone army being created for the Republic. Fett agreed under the condition that he receive the first clone, unaltered. He then departed the monastery, carrying the wounded Wesell to his Firespray-class ship, which had been newly named Slave I."}, {"tag": "h3", "text": "Crossed contracts"}, {"tag": "p", "text": "Five years after the hunt for Komari Vosa, Zam Wesell pursued a contract against Dreddon the Hutt, a crime lord and Outer Rim arms dealer. The contract had been placed by Antonin, a Vigo in the Black Sun crime syndicate and rival of Dreddon. Wesell disguised herself as a redheaded Human female and joined the Hutt's harem. She then convinced the crime lord to have his staff depart for the evening, leaving the two alone. Having manipulated the Hutt, the bounty hunter placed a micro-bomb into the amorphous creature that the Hutt consumed."}, {"tag": "p", "text": "Before she departed the compound, Jango Fett arrived, looking for Dreddon. Wesell grabbed a blaster which she had hidden and fled out of sight. She noted Fett's presence and became immediately proud that she had killed the Hutt who had employed Fett on recent bounties. She also believed she had the upper hand, being positioned out of sight with her blaster drawn and at the ready. Fett saw the dead corpse of Dreddon and immediately turned to see Wesell, wearing a metal bikini, appear from behind a curtain with a blaster drawn. Even though he recognized Wesell, Fett quickly drew his own blaster and proceeded to ask if the lifeless Hutt was of her doing. Replying affirmatively, she noted that she was fulfilling a contract."}, {"tag": "p", "text": "Fett was angered by the death of Dreddon. He had come to the Outer Rim to be paid by the crime lord for fulfilling a contract: the death of Vigo Antonin. Upon this revelation, Wesell was in turn outraged that Fett had killed the Black Sun Vigo who had hired her. The two bounty hunters realized that their contracts crossed and neither was going to be paid. Even after arguing about their situation, the pair remained in a stand off. After a short period, Wesell aimed her weapon away from Fett, approached him and then sashayed out of sight, telling the bounty hunter to take care of himself until the next time their paths crossed."}, {"tag": "h3", "text": "Infant of Shaa incident (27 BBY)"}, {"tag": "h4", "text": "Stealing the artifact"}, {"tag": "p", "text": "Shortly after Wesell and Fett crossed contracts, both bounty hunters were contacted by Fernooda, a Dug on Coruscant. Working for the underworld Annoo-dat General Ashaar Khorda, Fernooda contracted the two bounty hunters to steal the Infant of Shaa, a religious artifact from Seylott. Wesell and Fett were contacted separately and unaware of each other's involvement upon accepting the contract. The prize was fifty thousand credits to capture the artifact, which Fernooda claimed had been stolen from his employer by a Seylott native."}, {"tag": "p", "text": "Wesell traveled to Seylott to acquire the Infant of Shaa and discovered Fett already in the process of doing so. She waited, allowing Fett to clear the path to the idol. All the while, however, she remained in tow as he progressed through the jungles to some ruins, dispatching with fauna and a native Force-sensitive priest in the process. As Fett began to depart the ruins, Wesell sneaked behind the Mandalorian and ambushed him. With the tip of her blaster in his back, she ordered him to slowly turn around. The Clawdite took the idol and asked to see under Fett's helmet, to which he obliged. With Wesell distracted, a large arthropod—locally known as the guardian of the idol—attacked, grabbing Wesell with its tongue. The artifact fell from her grasp and was picked up by Fett. The Mandalorian ran from the scene with Wesell shouting for help."}, {"tag": "p", "text": "Upon exiting the ruins, Fett reconsidered leaving Wesell to perish, and he turned around and ran toward the arthropod beast. On his approach, Fett shot its tongue with his blaster. He grabbed Wesell and asked her to drop any explosives she carried. As she released the explosives, the pair fell down a chasm in the ruins. The explosives detonated on the surface next to the beast, killing it. Fett's jetpack, however, malfunctioned, and the pair fell to the bottom of the chasm with the Mandalorian landing on top of his Clawdite associate. Uninjured, Wesell grabbed Fett's helmet and returned it to him, jokingly asking if she could have the artifact in exchange. Seeing how he had returned to save her, she allowed the Mandalorian to leave with the idol and collect the bounty."}, {"tag": "h4", "text": "Conspiracy exposed and defeated"}, {"tag": "p", "text": "Shortly after the Infant of Shaa was turned over to Ashaar Khorda, Wesell learned that the Annoo-dat had planned to use the artifact—which could cause planet-devastating explosions—as a means of destroying Coruscant. She quickly traveled to Jango Fett's residence in Tipoca City on Kamino, hoping to recruit him to assist in a scheme to save the galactic capital. When she landed on Kamino, Jango Fett was outside playing with his son, Boba. There, the young Boba and Zam Wesell were first introduced to each other. Following the introductions, Wesell began her petition to the elder Fett. Jango Fett was initially unimpressed with the prospect of partaking in a mission to save Coruscant for free. Telling him that the blood of innocent beings would be on their hands still did not fully persuade the Mandalorian; rather, Fett retorted that he needed to remain with his son. Wesell responded by questioning how many \"sons\" would be orphaned in such a catastrophe. The appeal resonated with Fett, who himself had been an orphan. Persuaded to join in the effort, the pair boarded Slave I and departed for Coruscant."}, {"tag": "p", "text": "Arriving on Coruscant, Wesell took the shape of the Dug criminal Fernooda in an attempt to infiltrate Khorda's inner circle. While in disguise, she asked around about the happenings. She later remarked that no one was willing to speak on any matter, even to \"Fernooda.\" Nevertheless, Wesell was able to learn that Khorda had not yet been seen on Coruscant. Yet, he was planning to use the idol at the planet's power relays, where the explosion would set of a planet–devastating chain reaction. She surmised that he was laying low, attempting to keep both the general populace and his cohorts unawares to knowledge of his presence."}, {"tag": "p", "text": "As Wesell returned to her more normative Human appearance and dressed, she discussed the next course of action with Fett. The Mandalorian urged searching at the power relays of the planet's core; an explosion there, he stated, would cause a chain reaction. The difficulty, however, was discovering which power relay Khorda was accessing. While browsing the lower levels, they discovered guards who had been murdered. The pair assumed they were on the right trail and continued onward. At the same time, Jedi Master Yarael Poof was searching for the artifact and its possessors. The two bounty hunters and the Jedi Master entered the power relay station from opposite ends as Khorda, accompanied by some of his followers, was about to activate the Infant of Shaa."}, {"tag": "p", "text": "Cornered, Khorda ordered his thugs to kill the Jedi Master and the two bounty hunters. A firefight ensued as the unlikely trio began to dispatch Khorda's minions. During the fight, Fett was knocked off the walkway by a Wookiee thug, and Wesell was shot in the left shoulder. Fett, using his jetpack, ascended over the walkway and eliminated the Wookiee. Wesell remarked that her wound was clean and that she would be fine. The Mandalorian also realized that Khorda still possessed the idol, although he was battling with Yarael Poof. Flying by usage of his jetpack, Fett proceeded further down the walkway toward Khorda and attacked Fernooda. As Fett assailed the Dug, Khorda activated the idol. Yarael Poof severed Khorda's right hand and used the Force to take the activated artifact into his possession. Khorda, however, stabbed the Jedi Master with a blade, causing him to lose concentration. The idol fell and bounced toward the edge of the walkway as Fett killed the Annoo-dat general. Wesell reached for the artifact as it bounced off the walkway. Using her shapeshifting abilities, she increased the length of her arm and caught the tumbling idol. The artifact was still in an activated state, however, so she turned it over to Master Poof. The wounded Jedi used his ability with the Force to bind together the energies within the artifact. With the Infant re-stabilized and inactive, Poof collapsed on the walkway, dead."}, {"tag": "p", "text": "Coruscant had been saved by Master Poof's sacrifice, and the pair of bounty hunters decided to return the artifact to Seylott. Arriving on the planet, Wesell returned the Infant of Shaa to its Mother—the large carved stone structure within the religious site. As they turned from the artifact, Wesell and Fett spotted a large crowd of Seylotts that had gathered. The bounty hunters peacefully approached, and the crowd parted. Wesell and Fett walked through the parted crowd and were met by a priest, to whom Wesell apologized for having taken the idol earlier, and the priest responded that the secrets of the idol were to die with the people of the planet. Additionally, he urged Wesell and Fett never to return to Seylott. Upon leaving the planet, the bounty hunters returned to Kamino—specifically, the residence of Jango Fett. Wesell flirted with Fett, stating that there was truly a man under the mask. After kissing him on the cheek, she departed, disappearing into the heavy rain as Boba Fett came to greet his father."}, {"tag": "h3", "text": "Fondor terrorists"}, {"tag": "h4", "text": "Tracking Holowan"}, {"tag": "p", "text": "While completing a job on Esseles, in the Darpa sector, Wesell learned through the local cantina that Jango Fett had arrived on the planet. Disguised as a hunched, withered woman, Wesell approached Fett and his son Boba in the docking bay where Slave I was parked. Using the codeword \"ruffelluff,\" Wesell revealed her identity to Fett, who ushered her into his ship. Inside, Wesell shifted her appearance to her common Human identity, surprising the young Boba."}, {"tag": "p", "text": "Although the rendezvous had not been planned, Fett was in need of Wesell's services. He showed her a hologram of the Kuati Hurlo Holowan and asked if she could imitate the woman. Replying affirmatively, Fett gave Wesell a bandage and a vest and revealed a plan to learn her location. Fett had already captured Senator Rodd of Fondor and was searching for Holowan. The plan involved using Wesell, disguised as Holowan, to get information from Rodd regarding the woman's whereabouts. Wesell donned the apparel and changed into the appearance of Holowan."}, {"tag": "p", "text": "Entering into the cell on Fett's ship, Slave I, where Rodd was being held, Wesell commented that she had killed the bounty hunter who had caught the senator. Wesell fumbled with the keys, intentionally stalling the release of Rodd while they conversed. Once enough information was learned, Fett stormed into the cell area and surprised the senator. Grabbing Wesell by the neck, he dragged her out and sealed Rodd in. Wesell then shifted back to her more normative Human appearance."}, {"tag": "p", "text": "Fett was experiencing a conundrum. He needed to transport his son, Boba, back to Kamino, but did not want to risk losing Holowan. He revealed that the Trandoshan bounty hunter Cradossk and his son Bossk were in hot pursuit and that they hoped to kill Holowan on behalf of Wat Tambor, a Techno Union Foreman. Offering her assistance, Wesell took the subcontracted bounty of catching Holowan alive for the large sum of one hundred thousand credits. While she was initially fearful of the razor eaters—large automatons which possessed the ability to crush beings with their jowls—that protected the Kuati, the amount of credits to be won sealed the deal. The bounty hunters agreed to meet near Commenor, a planet in the Colonies, once Wesell had captured Holowan."}, {"tag": "p", "text": "Having learned from Senator Rodd that Holowan was the daughter of a wealthy Kuati merchant house patriarch, Wesell left Slave I and searched the Curamel Intergalactic Spaceport for a vessel to commandeer. Inside a docking bay, Wesell spotted a Subpro Corporation StarNailer-class fighter. The bounty hunter knew that this vessel would allow her to reach Kuat, located at the outer edge of the Core Worlds, faster than most civilian craft, and she also hoped that news of the theft of such a costly and expensive vehicle would reach and be circulated across the HoloNet. Hoping that law enforcement agencies throughout the galaxy would be looking for this vehicle, she knew that she would be arrested within moments of arriving at Kuat. Rather than directly trying to infiltrate the heavily defended world—an almost impossible task on one's own—she intended to evade the planet's tight security altogether by slipping in as a legitimate captive. Stealing the Subpro vehicle, Wesell piloted it away from Esseles and toward the Kuat system."}, {"tag": "p", "text": "The StarNailer-class fighter was reported stolen by its owner, and upon entering the Kuat system, two law enforcement vehicles immediately came beside the ship Wesell was piloting. Locking on with their tractor beams, they ordered her—although unaware of her true identity—to surrender. In a weak and quavering voice, Wesell offered her surrender and killed the engine. Wesell then altered her appearance again and hid some explosive polymer under a layer of fake skin. The patrol ships towed the vessel to a docking bay at the Kuat Passenger Port. When Wesell departed the ship, under arrest, she identified herself as Marby Welcus of Corellia. The bounty hunter appeared as a thin, timid-looking old man who acted as a disoriented and confused simpleton. The guards removed Wesell's blaster and ushered \"Welcus\" across the docking bay."}, {"tag": "p", "text": "Wesell was taken to a small cell in the docking bay. She noticed that Bossk had also come to Kuat but was resisting arrest and being held by force. Once in the cell, she took the explosive polymer that she had hidden and placed it on the door. The explosion was muffled, but the door was blasted open. Exiting the cell, she ignored Bossk, who was growing angry with the commotion in the corridor. The shape-shifter spotted the guard and altered her shape to mimic him and took his uniform, donning it over her bodysuit. Disguised as the guard, she left the detention area and retrieved her belongings from a locker, dispatching another guard in the process. From there, she proceeded into the public lobby."}, {"tag": "p", "text": "Wesell decided to drop the disguise as the security officer and entered into a public restroom adjacent to the lobby. There, she returned to her standard Human appearance. Returning to the lobby, she noticed the Kuat City Express, a ferry bound for Kuat City. When a final boarding call was announced, Wesell watched as a merchant came running toward the ferry. He dropped his bag and turned to retrieve it. Wesell, however, snatched the bag, and held it in front of the man with a taunting gesture. The bounty hunter stepped behind some storage containers, and the man—who had identified himself as Khoss of Knylenn—followed in pursuit. Out of sight, Wesell knocked the merchant unconscious and took his ticket for the ferry. She took Khoss's seat when she boarded the ferry, remarking that Khoss was unavailable to travel that day, and napped as she traveled to Kuat City."}, {"tag": "p", "text": "Upon arriving in Kuat City, Wesell furthered her disguise by purchasing a hooded cape that concealed most of the head and the body. Paying for it with the money stolen from Khoss of Knylenn, she surmised that the clothing would allow her to move freely as a Kuati citizen. Stopping at a kiosk, she inquired of a protocol droid about the location of the House of Holowan. The droid directed the bounty hunter to Holowan Terrace, and Wesell traveled to the location."}, {"tag": "h4", "text": "The Shape-shifter strikes"}, {"tag": "p", "text": "From the hovertrain stop on Holowan Terrace, Wesell could see the imposing mansion. Traveling one block north, Wesell spied two guard droids on patrol atop the walkway which crossed a moat. Changing her face to that of Hurlo Holowan, she attempted to cross. Her voice, however, failed the recognition test and the droids attacked. Wesell, however, easily dispatched the droids, shooting one and kicking the other into the moat. Arriving at the front door, it was open and unlocked. Wesell began to suspect that a trap had been set."}, {"tag": "p", "text": "Crossing through the mansion, Wesell passed into the courtyard, the door closing behind her. She spotted a woman on an upper balcony wearing a red gown and black cape. The bounty hunter recognized the woman as Holowan, but Wesell—also appearing as Holowan—caused the woman alarm. Three guard droids attacked Wesell at the woman's orders, but Wesell destroyed them. With the woman running from the scene, Wesell climbed a statue and jumped for the balcony. Reaching the balcony, she ran in pursuit of Holowan, who was darting toward an open window. Setting her blaster to stun, she shot the woman, who fell to the ground. When Wesell arrived to check Holowan's pulse, she realized that the being was not Holowan, but rather another Clawdite who had been in disguise."}, {"tag": "p", "text": "When the Clawdite decoy awoke, Wesell asked where Holowan was hiding. Under threat of force, the decoy pointed to a staircase and mentioned that it led to a laboratory. Wesell fired her weapon into the Clawdite's hip, stunning the being once again. She then hid the decoy in the closet and continued her pursuit. While descending the stairs, Wesell changed her appearance back to her common Human form."}, {"tag": "p", "text": "The door to Holowan's laboratory was locked, but Wesell was able to slip through a window above the door. The bounty hunter saw the true Holowan standing at a worktable. When Zam asked Holowan to put her hands up, however, the woman flipped a switch. Wesell braced herself against the wall as the floor retracted and a razor eater ascended from the exposed pit. The droid attacked Wesell, but the Clawdite quickly responded. She fired at the photoreceptors to blind the droid, then jumped at it, knocking it off balance. The droid fell back into the pit and was crushed by the floor closing up. Holowan still refused to surrender, unleashing a monstrous felinx, which was larger than any Wesell had seen before. As the feline creature attacked, Wesell stunned its jaw and a hind leg. As a result, the felinx retreated, and Wesell turned her attention to Holowan."}, {"tag": "p", "text": "Commandeering Holowan's personal craft, Wesell took Holowan to the bridge and tied her to a seat. The Clawdite was unimpressed with the anti-theft device that was covering the controls and had been programmed to shock any potential thief. Wesell coerced Holowan to attempt the deactivation procedure; the Kuati failed and was rendered unconscious by the device. With Holowan now subdued, Wesell pulled out her universal key and decoded the device, unlocking the ship's controls. Even though two law enforcement vehicles attempted to stop Wesell from piloting out of the Kuat system, the bounty hunter evaded them and successfully put the ship into hyperspace. While traveling to relatively close Commenor for the trade—of Holowan for credits—Wesell slept."}, {"tag": "p", "text": "Arriving at Commenor, Wesell scanned for Jango Fett's Slave I. Eventually, the two ships docked together, and Fett boarded Holowan's craft. Fett gave Wesell a heavy leather case that contained her payment in exchange for Holowan, who was still unconscious and tied to a seat on the bridge. Wesell helped load Holowan into a cage on Slave I and conversed with her cohort for a short time about the mission. Fett told Wesell of his troubles with Cradossk, and how he hoped to avoid any unnecessary attention directed at his son, Boba. Wesell and Fett then returned to the cage Holowan was being held in, to interrogate the Kuati woman. Learning that Fett's next target was on Balmorra, the bounty hunters parted ways."}, {"tag": "h3", "text": "Conspiracy to assassinate Senator Padmé Amidala (22 BBY)"}, {"tag": "h4", "text": "First assassination attempt"}, {"tag": "p", "text": "Around 22 BBY, Jango Fett was hired by Count Dooku, also known as Tyranus, on behalf of Trade Federation Viceroy Nute Gunray with the charge to assassinate Senator Padmé Amidala of Naboo. The job was then subcontracted by Fett to Wesell. Using her skills as a shape-shifter, Wesell learned the location and time of Amidala's arrival. The Clawdite's scheme involved planting explosives on the senator's cruiser. Posing as a reporter to the drunk and disillusioned Naboo Lieutenant Theomet Danlé, Wesell convinced the young man to plant a \"listening device\" aboard Amidala's shuttle in an effort to expose political corruption. Danlé obliged and, unknowingly, set the explosive device. When the cruiser arrived on the Coruscant landing platform, it exploded. Danlé was among the casualties in the explosion."}, {"tag": "p", "text": "Although Wesell succeeded in destroying the Naboo Royal Cruiser, the explosion killed the senator's decoy, Cordé. The senator herself had arrived in an N-1 starfighter. The explosive device, however, also had a flaw. A technical hitch in the triggering mechanism also allowed the senator to escape unharmed. Nevertheless, the explosion was not traced to Wesell, but rather, it was believed to have been caused by disgruntled spice miners from the moons around Naboo."}, {"tag": "h4", "text": "Second assassination attempt and death"}, {"tag": "p", "text": "Following the first attempt on Senator Amidala, the senator was put in the protective care of the Jedi. In an attempt to draw out her attacker, Amidala crafted a plan to sabotage her apartment's automated security devices. With the security cameras and sensors in her apartment turned off, Amidala decided to entrust her safety to Obi-Wan Kenobi and Anakin Skywalker. The only protective measures in place were the astromech droid R2-D2's sensors and the two Jedi, who were assigned to wait in the anteroom and use the Force to detect any trouble."}, {"tag": "p", "text": "After being reprimanded by Jango Fett, Wesell was given deadly kouhuns, multipedal, poisonous arthropods from Indoumodo, which the Mandalorian considered more subtle. For the second attempt, Wesell loaded the clear cylinder of insects into a special receptacle of her custom-made assassin droid ASN-121 and programmed the droid with the location of Amidala's apartment. In further preparation, she disabled the ability for the droid to reroute its electrical circulation into its outer shell to prevent the electrical signature from alerting the apartment's security sensors. She also instructed the droid to remain near the kouhuns to monitor the attack."}, {"tag": "p", "text": "With Wesell waiting on the roof of the Trade Federation office tower, the droid arrived outside the apartment. It bypassed the security screen surrounding the window by emitting disruptive energy beams from the tips of its wings. The droid then cut a hole in the pane with a laser cutter. The droid discharged the insects and began to monitor their progress. The droid R2-D2, which was scanning the room for intruders, was unaware of the predatory arthropods. Anakin Skywalker and Obi-Wan Kenobi, however, detected their presence through the Force from the anteroom."}, {"tag": "p", "text": "Barging in on the slumbering senator, Skywalker killed the arthropods with his lightsaber before they could attack their prey. Outside the apartment window, ASN-121 was following its directive to remain and observe. Kenobi spotted the droid and leaped out the window, grabbing hold of the droid's body. The droid, following the next step of its instructions, began a jaunt at high speeds amongst the Coruscant skyscrapers. The droid was unhindered by Kenobi's added weight and returned to Wesell. The bounty hunter, however, spotted the Jedi clinging to the droid. Taking her sniper rifle, she reasoned that the death of Jedi that died from falling a great height would raise far less suspicion than one that was killed with a slug. As such, she fired upon the droid rather than Kenobi, and destroyed the machine. Kenobi began plummeting toward the planet surface while Wesell attempted to escape."}, {"tag": "p", "text": "Skywalker arrived upon the scene as his Master was in free-fall. Catching Kenobi with a commandeered open-top XJ-6 airspeeder, the Padawan continued the pursuit of Wesell's Koro-2 all-environment exodrive airspeeder, a vehicle she at some point had stolen from a Mining Guild world. Spotting the Jedi, Wesell took her speeder on a nosedive—plunging 2,670 meters toward the lower levels of Corusca Circus. With the Jedi relentlessly pursuing her, Wesell flew through the exhaust flames of the Kerdos Company recycling plant, hoping that the flames would scorch her adversaries in the open-top speeder. Seeing the pair still chasing her and unharmed by the flames, Wesell fired at the couplings of a nearby electrical plant, causing the Jedi's speeder to be inundated by electrical shock."}, {"tag": "p", "text": "Skywalker, an expert pilot himself, quickly caught up to Wesell. The bounty hunter steered her craft into a network of skytunnels, aiming once again to lose the pursuing Jedi. Skywalker did not chase directly into tunnel, but opted to travel an alternate route. Wesell wove through the local network of tunnels, reaching speeds of 400 kilometers per hour. Upon exiting the network at the Cybot Galactica droid research institute, the bounty hunter was surprised when Skywalker suddenly landed upon her airspeeder. The Jedi ignited his lightsaber and sliced at the windscreen, knocking out the guidance systems. Wesell shot the lightsaber out of Skywalker's hand, but the ensuing struggle caused Wesell to misfire her blaster pistol, damaging the control pipes. Meanwhile, Kenobi, who was behind Wesell at this point, captured Skywalker's lightsaber and later returned it to him."}, {"tag": "p", "text": "The Koro-2 airspeeder began to plummet toward the surface, crashing on Vos Gesal Street in the Uscru Entertainment District, near the Outlander Club. Having been chased for over one hundred kilometers, Wesell crawled from the crash site and fled into the club."}, {"tag": "p", "text": "Inside the Outlander Club, Kenobi instructed to his Padawan to search the premises while he went for a drink at the bar. Kenobi's plan was to be an easy target to draw out the attacker. Wesell hid until the two Jedi separated, then slowly approached the seemingly vulnerable Jedi at the bar. To secure the accuracy of her shot, she continued approaching the Jedi with her weapon drawn while Kenobi, through a disturbance in the Force, sensed the bounty hunter's intentions. In an instant, Kenobi ignited his lightsaber, spun around, and severed Wesell's arm below the elbow."}, {"tag": "p", "text": "Kenobi and Skywalker took the wounded bounty hunter and dragged her from the club, setting her in an adjacent alley behind the club for interrogation. Wesell was initially reluctant to give any information about who had hired her, replying that it had simply been a job. As Skywalker pressed her, however, Wesell prepared to divulge the information. Suddenly, Jango Fett, who had been observing the situation, fired a toxic dart into the Clawdite's neck. The dart released a lethal, but painless toxin into Wesell. As the toxin raced through her amorphous body, she used her final breath to curse Fett in Huttese. Wesell quickly perished, and her body reverted to its natural Clawdite form."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During her career as a bounty hunter, Wesell was credited with the assassination of Senator Jubben and Baron Wazado. This was confirmed when the status log of her ASN-121 assassin droid was salvaged by Republic officials in the undercity. The log provided answers to several previously unsolved assassinations and served as a warning to many other senators. Additionally, Wesell's daughter, Sone, disappeared following her mother's death."}, {"tag": "p", "text": "Fett held some regret for having killed Wesell with the saberdart. Over the years, the pair had developed a positive relationship. Furthermore, Fett was visibly disturbed upon his return to Kamino. His son, Boba Fett, was also saddened by the death. Kenobi was initially unable to identify the saberdart found on Wesell's corpse with the help of the Jedi analysis droids. As a result, he turned to his friend Dexter Jettster, who ultimately directed Kenobi to Kamino and Jango Fett."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "On the one hand, Zam Wesell was a skilled, dedicated, and callous bounty hunter. She possessed an extraordinary self-discipline which was used to develop skills as a shapeshifter and in combat. She was confident—at times overly confident—in her abilities and did not appreciate being underestimated. Additionally, on two occasions, Jango Fett chastised Wesell for acting less subtly than she should have. Yet, Wesell was not a compulsive fighter. When in the line of duty, she was level-headed and carefully measured. She could also act stealthily as she saw fit. Nevertheless, Wesell's motives were clear. She was driven by money and did not care which side she fought for as long as her client was willing to pay well. With her skills as a shapeshifter, she often took assassination contracts. As a result, Wesell was ruthless toward her bounties, viewing them explicitly as marks who, in her opinion, probably deserved their fates in any case. Still, the Clawdite enjoyed leading the life of the outlaw and read books about famous outlaws of the past and the bloody battles of Galactic history."}, {"tag": "p", "text": "Conversely, Wesell also had a conscience. Even though she enjoyed the profit, Wesell found no pleasure in the kill itself. While she initially cared more about herself during the hunt for Komari Vosa, Wesell returned to aid Fett in the final showdown on Kohlma. Her intervention allowed Fett to overwhelm Vosa and defeat the Bando Gora leader. Similarly, Wesell was not willing to allow the entire planet of Coruscant to be destroyed without a fight during the Infant of Shaa incident. Instead, she appealed to Jango Fett and the pair—along with Jedi Yarael Poof—defeated the terrorists that planned to use the idol at the planet's power relays. Wesell also developed a friendship with Jango Fett and his son, Boba, that evolved into a caring relationship."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Jango Fett"}, {"tag": "p", "text": "Zam Wesell and Jango Fett first developed a partnership in 32 BBY, and the two evolved into a highly efficient team. Even though they seldom worked together on a job, Fett subcontracted many jobs, even some of the most dangerous tasks, out to Wesell. By the time of the Clone Wars, Fett desired to spend more time with his son, and this arrangement was profitable for both, for it allowed the money-driven Wesell to expand her career while Fett could be selective with the tasks he took. On subcontracted jobs, Fett was then able to monitor from a safe distance, preserving his life so he could live for his son, Boba. Yet, Fett trusted Wesell with these most dangerous jobs. He admired her skills, and the pair held a mutual respect for each other."}, {"tag": "p", "text": "While Wesell and Fett maintained a professional relationship, Wesell was able to get closer to Fett than anyone other than his son Boba. Wesell was sometimes flirtatious in her conversations with the Mandalorian and was granted a chance to see the face of the bounty hunter, which was most often hidden under the mask. Wesell also enjoyed teasing Fett, but the pair declined to further the relationship beyond friendship so that it would not adversely affect either of their careers."}, {"tag": "p", "text": "Even though Boba Fett regarded Wesell as his father's only friend, Jango Fett believed he was forced to silence Wesell after the failed assassination attempt on Coruscant. He was saddened by the events that led to her death, and was visibly disturbed upon his return to Kamino. He held regret for having terminated her life and retreated to walking alone in the rain and fishing at his home on Kamino prior to the arrival of Obi-Wan Kenobi. One consolation for him, however, was that the dart which killed Wesell released a painless toxin."}, {"tag": "h4", "text": "Boba Fett"}, {"tag": "p", "text": "Zam Wesell was first introduced to Boba Fett in 27 BBY when she traveled to Kamino during the Infant of Shaa incident. From that point, the Clawdite developed a friendship with the young son of Jango Fett. By 22 BBY, their friendship had developed to the point that the young Fett viewed Wesell as a maternal figure. They readily exchanged jokes, and Boba missed Wesell when she was absent for long periods of time. She also encouraged the young Mandalorian to read, promoting the excitement that could be found from doing so. Following the failed assassination of Senator Amidala, Boba learned of Wesell's death from his father through periodic conversation upon Jango Fett's return. As the realization of her death developed, Boba became sad and all the enjoyment in his life was sapped away. Wesell became greatly missed by Boba, and his existence became even more lonely. Later in his life, Boba remarked that Wesell—along with the Kaminoan Taun We—were the only two female beings he knew growing up, and also implied that this was the reason why he failed to become a family man."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Shape-shifting"}, {"tag": "p", "text": "Over her career, Zam Wesell was often believed to be a Shi'ido by those who were aware of her shape-shifting abilities. While she never refuted this belief, she was in fact a Clawdite. As a Clawdite, Wesell was endowed with the ability to alter her physical appearance at will. For her species, however, this process was extremely painful and it took great skill to achieve. Nevertheless, Wesell developed skills in her shape-shifting and became highly skilled at self-alteration. Some of her abilities that she fostered were different from those of a more normative Clawdite. For example, Clawdites typically did not possess the ability to mimic an exact replica of an individual. Nevertheless, Wesell was able to closely replicate the appearances of other individuals such as the Dug Fernooda, Hurlo Holowan, and a Kuati Security Guard. In the first instance, Wesell was able to converse with Fernooda's associates without being suspected."}, {"tag": "p", "text": "When mimicking the two Kuati individuals, Wesell did not properly replicate the vocal sounds that each person made, although their appearance was sufficient enough to fool their acquaintances. Furthermore, the abilities that Clawdites possessed were traditionally confined to the alteration of skin color or texture. They could not create extra flesh or other limbs to imitate wings or reconfigure their bodies into non-humanoid shapes. Wesell possessed an ability to mimic a Dug, however, which required some bodily reconfiguration. On another occasion, she created a small lobe of extra skin to hide explosives from the Kuat authorities. Additionally, she was able to manipulate her right arm, on one occasion, to a significant length in order to catch the Infant of Shaa before it fell into the core of Coruscant. It was speculated that such ability came from a net gain or loss of water content within Wesell's body."}, {"tag": "p", "text": "University of Sanbra scientists noted that Clawdites typically could not maintain an altered form for more than a few minutes. However, they conceded that rumors abounded about those who had developed the ability to sustain an appearance indefinitely. In those cases, it was believed that the being's internal structure had been liquefied. Furthermore, most Clawdites only possessed the ability to either alter the skin tone or, at most, appear as a member of another humanoid species. Regardless, Wesell had developed her skill beyond the overwhelming majority of Clawdites. Among these extremely rare traits, for example, Wesell was able to maintain a form even while sleeping, and she possessed the ability to mimic the form of almost any other species for any demanded period of time in spite of the physical pain it caused her. Most often, however, she held the appearance of a young, attractive Human woman, which she found beneficial to making connections. Additionally, she was able to readily assume the forms needed to help accomplish her task, and could easily blend into any group of people or organization."}, {"tag": "h3", "text": "Tactical skills"}, {"tag": "p", "text": "As a bounty hunter, Wesell was considered one of the best of her generation. She was a shrewd and intelligent huntress who was skilled at martial arts. During her years on Zolan, Wesell had advanced to the third level of fighting in the Mabari order of religious warriors, and further honed her skills during her tenure on the corporate world of Denon. She was willing to put her body in any position in order to take the necessary shot at a target, but she preferred to hit her marks either from afar or immediately next to the target. Wesell was a skilled pilot as well. She trusted heavily in her skills, which she displayed when she whipped through the Coruscant skylanes at nearly four hundred kilometers per hour after the second attempt to assassinate Senator Amidala. Yet, her most important skill was her shape-shifting ability."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Airspeeder"}, {"tag": "p", "text": "Wesell often commandeered vehicles for her more routine missions to prevent herself from being traced. She used her personal craft, however, when she needed the security of its performance. Measuring 6.61 meters in length, the Koro-2 Exodrive airspeeder, built by Desler Gizh Outworld Mobility Corporation, featured no armaments for defense; although, Wesell did originally plan to upgrade the vehicle with a blaster cannon. Wesell stole the green craft from a mining colony controlled by the Mining Guild. As a result, the airspeeder was a versatile vehicle originally intended for the hazardous atmospheres of hostile worlds. It had limited air intake and could sustain an internal atmosphere for about two weeks. The craft was flexible even in large urban areas, although it was not intended for such."}, {"tag": "p", "text": "For propulsion, the forward mandibles of the craft irradiated the air around them, inducing ionization and making it conductive. The electrified airstream then magnetically propelled to the rear of the craft. Therefore, the craft was literally forced forward by the electrified matter moving from one end of the craft to the other. In urban areas, however, outdoor power lines were known to cause problems with the propulsion fields and made steering the craft difficult. The propulsion mechanisms also caused an aural howl to be heard as the vehicle passed, as well as left radiation and a foul stench in its wake."}, {"tag": "p", "text": "Wesell's Koro-2 airspeeder was a versatile vehicle used for many of her missions. It had a hidden locker for her assassin/sentry droid ASN-121, situated behind the driver's seat; a rifle, which was stored in a covert forward mandible compartment; and special oils for Clawdite shapeshifters. All totaled, the craft could carry up to eighty kilograms of cargo weight and maintain speeds of 800 kilometers per hour in the process."}, {"tag": "p", "text": "In 22 BBY, she used the craft as her getaway vehicle in the plot to assassinate Senator Padmé Amidala. When the plot was foiled, Wesell attempted to flee the scene and boarded her airspeeder. Anakin Skywalker and Obi-Wan Kenobi chased the bounty hunter through the traffic lanes of Coruscant until Skywalker jumped from his airspeeder to the surface of Wesell's. Using his lightsaber, he punctured a hole in the craft, causing the bounty hunter to lose control. As a result, the vehicle plummeted to the surface, crashing in the Entertainment District. Wesell fled her burning craft, leaving it to be scrapped and scavenged. By the time the authorities had arrived on the scene, the vehicle had been stripped to the airframe hull."}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "Wesell used specially designed armor and apparel which could be used even as she employed other humanoid forms. The boots, for example, could be used with other types of limbs other than Human feet. Lining the bodysuit were elastic bands, placed at strategic locations, which remained taut during changes. Moreover, the bodysuit could stretch to accommodate a new form."}, {"tag": "p", "text": "The purple armor had other features apart from its versatility when shapeshifting. The material had dark, subtle colors that blended into shadows of buildings and other objects. A veil was used to cover the lower part of her face, hiding her appearance. The armor was also equipped with a direct-to-lungs breathpack. Hoses from the breathpack could connect to the couplings grafted into Wesell's ribcage. Moreover, Wesell wore a Mabari armorweave blast-sink skirt and shin guards on her boots. The skirt was able to absorb or deflect blast fire from grenades and other energy-based explosive devices, and offered protection for attacks from behind."}, {"tag": "p", "text": "While decorative instead of protective, Wesell wore an ancient Mabari artifact as a cape seal. This artifact included a Mabari emblem and markings, which indicated her rank as a third-level fighter within their order. Other inscriptions were located on the armor breastplate. Additionally, her Mabari combat gauntlets and her helmet also included intricate etchings from the Mabari holy books."}, {"tag": "h3", "text": "Arsenal"}, {"tag": "p", "text": "Wesell kept an arsenal of a blaster pistol, rifle, and explosives at her disposal, using them when the situation demanded. She was also skilled with gadgets and technology, relying on them while working as a bounty hunter. Among these gadgets were a universal key; a comlink that scrambled outbound signals; and specially-equipped electro-goggles, attached to her helmet, that displayed targeting information in a single language."}, {"tag": "p", "text": "Her blaster pistol was a KYD-21 model, composed in part of a Hadrium alloy. The blaster also featured a guard-less trigger that allowed for rapid firing. Due to its small and compact size, it could be easily hidden. Therefore, Wesell preferred the weapon when she needed to appear nonthreatening or to close in inconspicuously on a target. It also could shoot up to seventy-five shots before needing to recharge. Wesell used the blaster pistol in the years leading up to the Clone Wars. Most specifically, she drew her weapon upon her approach toward Obi-Wan Kenobi in the Outlander Club. After her death, the KYD-21 later fell into the possession of Boba Fett, who awarded it to the individual that slayed the bounty hunter named \"Project Durge.\""}, {"tag": "p", "text": "Although she did not prefer the use of projectile weapons, Wesell began to adopt the use of a projectile rifle to use for long-range shots. The rifle was included in her arsenal at the insistence of Jango Fett, and she stored it in a mandible of her airspeeder. It was a versatile weapon that featured an Optical/Thermal imaging scope which provided for extreme accuracy. The rifle would eventually be used to destroy her assassin droid, ASN-121, during the plot to assassinate Senator Amidala."}, {"tag": "p", "text": "Due to her experience, Wesell also carried a universal key and explosives to use as part of her arsenal. She kept explosives as part of her arsenal during the Infant of Shaa incident, when she was attacked by a giant Seylott beast. During the encounter, she employed these devices to kill the creature. Wesell also created her own explosive polymer, which she put to use while escaping a cell on Kuat during the hunt for Hurlo Holowan. The explosives were able to be concealed while the authorities took her blaster and universal key."}, {"tag": "h3", "text": "Assassin droid"}, {"tag": "p", "text": "Zam Wesell's personal assassin droid was a custom-made creation by the Malkite Poisoners upon her request. To hide its true origins, the Malkite Poisoners created the automaton from commonplace parts. The droid was equipped with a wide array of features, including unprecedented environmental awareness and stealth abilities. It also possessed an infrared photoreceptor, an eavesdropping recorder, a tangle net, and a stinger blaster. These tools were specifically installed for use on stealth missions. Furthermore, the droid's narrow shape minimized the profile for pursuers or those attacking from ahead, creating a smaller target."}, {"tag": "p", "text": "The droid was constructed with a powerful repulsorlift engine which was rated military-plus. Powered by fusion generator, the repulsorlift allowed the droid to reach near-orbit altitudes. Because it was independently powered, the repulsorlift ensured good balance for the droid, even under unusual loads. The automaton also had the ability to reroute its electric current to its metal posterior, shocking stowaways or any item which would interfere with it."}, {"tag": "p", "text": "Wesell had the ability to equip the droid with a variety of implements and weapons, such as a harpoon gun, sniper blaster, gas dispenser, spy sensors, flamethrower, durasteel drills and cutters. All of these were easily installed into the central tool socket, which was designed to accommodate these items. The central socket also had the ability to hold canisters, which could have been filled with toxic biological agents or explosives."}, {"tag": "p", "text": "During the second attempt on the life of Senator Amidala, Wesell loaded the ASN-121 assassin droid with a canister of kouhuns. She also disabled the ability to redirect its electrical current, hoping to minimize its electric signature. After using its tools to dispatch the creatures, the droid was forced into a retreat when it was spotted by Obi-Wan Kenobi. Kenobi jumped through the apartment window and grasped the droid. Kenobi's weight of 63 kg neither deterred nor slowed the droid. The droid, however, was able to shock Kenobi using its electro-defense grid as he rode it through the skylanes of Coruscant. ASN-121 also attempted to remove the clinging Jedi by brushing up against a skyscraper. In an attempt to kill the Jedi, Wesell used her sniper rifle and shot the droid, causing Kenobi to plummet toward the planet surface. The wreckage of the droid was later salvaged and a status log of Wesell's bounties was recovered at that time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development and portrayal"}, {"tag": "p", "text": "The character of Zam Wesell was played by actress Leeanna Walsman in Attack of the Clones. Walsman also provided the voice for the same character in the game Star Wars: Bounty Hunter. However, Wesell was voiced by Diane Michelle in the Star Wars: Galactic Battlegrounds expansion pack Clone Campaigns."}, {"tag": "p", "text": "Wesell was originally created as an antagonist in Attack of the Clones. Early drafts of the Episode II scripts referred to Wesell as a \"C.A.T.,\" a Corporate Alliance Trooper, instead of \"Zam Wesell.\" Her first appearance in canon, however, was in the one-shot comic Star Wars: Jango Fett which predated the film by two months. Wesell was not originally conceived as a changeling or shapeshifting being. Rather, this concept developed well after principal photography for Attack of the Clones had begun. As a result, Walsman was originally unaware of Wesell's species type. The transformations and alien appearance were created digitally by superimposing a \"mask\" over Walsman's face. Wesell, as a changeling, was then included in the one-shot Star Wars: Jango Fett and in the tenth issue of Star Wars Gamer."}, {"tag": "p", "text": "Details and background information for Zam Wesell were created with the one-shot comics Star Wars: Jango Fett, Star Wars: Zam Wesell, and the game Star Wars: Bounty Hunter. Subsequent appearances in Boba Fett: The Fight to Survive and The Life and Legend of Obi-Wan Kenobi further expanded her role in the life of Boba Fett and provided more details about the plot to assassinate Senator Padmé Amidala. Wesell was drawn upon heavily in the creation of the backstory for Theomet Danlé and the first failed attempt on Senator Amidala by the user \"winstonvalleyjedi\" in the online Hyperspace feature What's The Story? Additionally, while Wesell did not appear in LEGO Star Wars: The Video Game, she made a non-canonical appearance in LEGO Star Wars: The Complete Saga."}, {"tag": "p", "text": "The inspiration for Zam's timid old-man persona \"Marby Welcus\" appears to have been \"Marcus Welby\" of the popular longplaying television series of the 1970s, Marcus Welby, M.D."}, {"tag": "h3", "text": "Continuity issues"}, {"tag": "h4", "text": "The New Essential Guide to Characters"}, {"tag": "p", "text": "Unlike other sources, The New Essential Guide to Characters lists much of Wesell's vital information as \"unknown.\" This, however, does not pose direct conflicts with other established sources, but the Guide directly offers the possibility that much of Wesell's backstory may have been prefabricated in-universe by the character as a web of carefully concocted lies. For example, Wesell's gender is listed as \"unknown\" in the Guide, but is confirmed as female in sources such as the Databank. Furthermore, while all sources call the character \"Zam Wesell,\" the Guide states that it may not be her real name."}, {"tag": "h4", "text": "The Official Star Wars Fact Files"}, {"tag": "p", "text": "A minor inconsistency arises between the The Official Star Wars Fact Files and the video game Star Wars: Bounty Hunter. The video game takes place in 32 BBY, five years before the crossing of contracts between Dreddon the Hutt and Vigo Antonin. Yet, Fact Files 53, 65, and 71 state that Wesell's first encounter with Jango Fett was at Dreddon's palace."}, {"tag": "p", "text": "Another continuity issue arises in Fact File 101, which states that Wesell, in preparation for the first assassination attempt on Senator Amidala, planted an explosive device on the landing platform where the senator was expected to land. Wesell then staked out over a kilometer away and detonated the bomb when she saw Amidala's decoy, believing it was Amidala herself, step out of the vessel and onto the platform. This conflicts with Wesell's Databank entry, which states that Wesell posed as a reporter and conned a drunk Theomet Danlé into planting the explosive on the ship. Whether or not Wesell staked out the landing pad in this situation is not stated, but the Databank cites the explosion as having come from the bomb planted inside the vessel."}, {"tag": "h3", "text": "Non-canon and ambiguously canon appearances"}, {"tag": "p", "text": "The LEGO model for Wesell does not appear in LEGO Star Wars: The Video Game, as the model was unused. However, the character and the attempt to assassinate Padmé Amidala both make non-canonical appearances in LEGO Star Wars: The Complete Saga. The game also includes the speeder chase between Wesell and the Jedi Anakin Skywalker and Obi-Wan Kenobi. Wesell has an appearance in the Wizards of the Coast scenario Two Jedi Walk Into a Bar. In this role-playing scenario, the player revisits the Outlander Club following the speeder chase in 22 BBY and creates a what-if situation in which Jango Fett wanted to keep Wesell alive and help her escape the Jedi rather than meet her ultimate canonical fate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}