{"url": "Zann_Consortium/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Zann Consortium"}, {"tag": "p", "text": "The Zann Consortium was an underworld consortium and crime syndicate led by Tyber Zann which sabotaged and interfered with Rebel and Imperial affairs during the Galactic Civil War. During the course of the war, it amassed considerable power and wealth, eventually becoming a major nuisance—and even threat—to both the Empire and the Rebellion."}, {"tag": "p", "text": "The Consortium became more powerful after the Battle of Endor due to Tyber Zann's discovery of Palpatine's hidden vaults and the elimination of its main rivals: Jabba the Hutt and Prince Xizor.\nThe Zann Consortium gained most of its technology through its affiliation with the black market, and its Defilers, which were known for traveling to hostile systems and setting up illegal outposts which promoted piracy and sabotage."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation and dissolution"}, {"tag": "p", "text": "The Zann Consortium was formed at some point before 0 ABY. Led by crime lord Tyber Zann, the movement spread corruption throughout the galaxy and at some point joined forces with the Black Hole Pirates. Zann worked closely with affiliate Jabba the Hutt and learned much from the corpulent gangster. Zann then stole a valuable Sith holocron from Jabba, but was arrested by Imperial forces on Felucia and sent to Kessel. Moments before his arrest, Zann entrusted the holocron to his partner, Urai Fen. He evaded capture and escaped the planet with the artifact."}, {"tag": "p", "text": "Concerned for the survival of the Consortium, Urai Fen contacted allies of the Consortium on Kamino. Kamino then served as a base for a very limited time, but the Kaminoans, with very few resources, could not contribute much. The Consortium then decided to relocate to Ryloth, so Fen moved Consortium forces from Kamino to Ryloth. He led the Consortium to victory over the Imperial forces on Ryloth, the only remaining obstacle to the group's use of the planet, and laid low until Tyber Zann was ready."}, {"tag": "h3", "text": "Escape from Kessel and reformation"}, {"tag": "p", "text": "Zann continued to languish in the prisons of Kessel until Jabba the Hutt, gloating at Zann's capture, released him from his cell while delivering a message broadcast via an MSE-6 droid. However, Zann was already planning his escape by engineering a prison riot and slipping out amongst the chaos. Urai Fen was already in orbit of the planet and was promptly contacted by Zann. Fen then landed on the planet with help from Han Solo and Chewbacca in the Millennium Falcon."}, {"tag": "p", "text": "A bounty hunter sent by Jabba the Hutt caught up with an unarmed Zann as he left his cell, only to be killed by Fen, who gave Zann back an upgraded version of Zann's old pistol. Tyber and Urai managed to bribe and fight through the security checkpoints and past stormtroopers and a few Phase II dark troopers, breaking other prisoners free as a distraction to aid them in his escape. The pair finally made their rendezvous with an impatient Solo, and Zann left the prisoners to their fate and made his exit in the Millennium Falcon. After his departure from Kessel, Tyber Zann began his campaign to restore the Consortium to power in the galaxy."}, {"tag": "h3", "text": "Accumulation of power"}, {"tag": "p", "text": "The Palace on Ryloth was the only Consortium asset remaining to the Consortium together with a handful of mercenary soldiers. In order to announce to the galaxy that the Zann Consortium was back in business, Zann had Fen assassinate the Imperial Governor on Honoghr. A racketeering operation was promptly set up on Shola followed by a series of raids on Mandal Hypernautics. This gave the Consortium a modest supply of funds and ships while power was quietly being built up. Zann was obsessed with gaining revenge on the Empire and heard that the Emperor stored his fortune in private vaults. Planning to rob them, Zann decided to scout the Yavin system once the news broke of the destruction of the Death Star, reasoning that it was standard operating procedure for personnel on Imperial stations to eject data pods before they were destroyed. Tyber commanded a small fleet and rummaged through the remains of the first Death Star in orbit around Yavin Prime. After engaging Rebel Alliance forces in the area commanded by Wedge Antilles, he found a data pod containing discovered plans for the Eclipse-class dreadnought, which was currently under construction in the Kuat Drive Yards, as well as plans for the Aggressor-class destroyer. Zann planned to seize the Eclipse, as it was going to be the Emperor's personal flagship (as the Executor was the personal flagship of Darth Vader)."}, {"tag": "p", "text": "While Zann was battling both the Rebels and Imperials in the Yavin system, Jabba the Hutt struck at the Consortium on Ryloth, destroying the barracks there as well as hitting other Consortium assets across the galaxy. This prompted Zann to deal with the Hutt threat once and for all. Consortium agents had discovered that Jabba the Hutt was coordinating his forces through a relay station on Saleucami, which was swiftly captured by Urai Fen. This then pointed the Consortium in the direction of Hypori, where Zann had a final showdown with Jabba inside an old Confederacy of Independent Systems battle-droid factory. After shutting down the automated production lines and bribing the Trandoshan bounty hunter Bossk, Zann had Jabba by the throat, demanded the bounty on his head removed, the attacks on Consortium personnel and property ceased and the permanent secession of Saleucami and Hypori to the Consortium in exchange for letting him go. Jabba agreed on the provision that Hutt Space was to be left alone. The factories on Hypori would now churn out second generation Droidekas."}, {"tag": "p", "text": "The Zann Consortium continued to operate behind the scenes, establishing its presence on numerous planetary systems across the galaxy. It dealt extensively in slaves, particularly on Sullust, Kashyyyk, Dac and Naboo, some of which were used as cannon fodder during Consortium ground operations. Kidnapping of Imperial and Rebel officials was not beyond the Consortium—perhaps the most famous \"victim\" being Bevel Lemelisk, who was abducted from Kuat. Zann also became embroiled in the downfall of Black Sun leader Prince Xizor, framing him for stealing tibanna gas from Bespin, despite the arrival of Imperial reinforcements, including Darth Vader."}, {"tag": "p", "text": "Shortly after the Battle of Endor, Tyber managed to capture the Eclipse and destroyed another Super Star Destroyer. Zann proceeded to steal billions of credits, technical data spanning decades, and priceless works of art from Emperor Palpatine's personal vault network, thus ensuring that the Consortium expand to galactic levels. After his theft, Tyber decided to abandon the Eclipse, as it would be a \"target even the Rebels could not ignore.\" The Eclipse was later recovered by Imperial forces, who continued its construction. Zann also decided to let the Rebel Alliance form their New Republic, as he viewed its creation as an opportunity to allow him to \"own a senator.\""}, {"tag": "p", "text": "The Consortium was also intent on discovering the mysteries of the ancient Sith holocron, stolen from Jabba while he was making a deal with the Galactic Empire on Felucia. However, Silri, a Nightsister in Zann's employ, stole the holocron during the theft on Coruscant before they could decipher it, and unlocked its secrets. The artifact led her to an ancient Sith tomb, with thousands of Sith soldiers frozen in carbonite."}, {"tag": "p", "text": "The Zann Consortium fleet had been defeated for a number of years by the time Admiral Natasi Daala's fleet emerged from the Maw Installation and initiated her series of attacks on the New Republic in 11 ABY."}, {"tag": "h3", "text": "Missions"}, {"tag": "p", "text": "Only one mission before the theft of Jabba's artifact and the dissolution of the Consortium is known, but known missions from that point onwards included:"}, {"tag": "h2", "text": "Tactics"}, {"tag": "p", "text": "The Zann Consortium used its extensive crime network to influence the warring factions during the Galactic Civil War, siphon their credits, and sabotage their operations when necessary. It dealt in multiple illegal operations, such as establishing widespread racketeering jobs on many worlds; bribery, piracy, slavery, and corrupting local militia on planets, as well as intimidating or kidnapping individuals who defied the Consortium. One particular means of income was offering military protection to planets that wanted no part in the ongoing Galactic Civil War. They also extorted money from miners. The Consortium also constructed palaces on various worlds to serve as its financial centers."}, {"tag": "p", "text": "With access to the black market, Zann had several unique technologies at his disposal, including buzz droids and stealth generators, that allowed undetected movement across the galaxy. The Zann Consortium also hired bounty hunters such as Bossk and IG-88 to eliminate certain targets in order to further its influence."}, {"tag": "h2", "text": "Structures"}, {"tag": "h2", "text": "Military units"}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "The Consortium used a powerful army to gain victory during battles on land. They used either black-market technology or their own, depending on the conditions."}, {"tag": "h4", "text": "Infantry"}, {"tag": "h4", "text": "Droid Works"}, {"tag": "h4", "text": "Black Market Technology"}, {"tag": "h4", "text": "Vehicles"}, {"tag": "h3", "text": "Fleet"}, {"tag": "p", "text": "The Zann Consortium used starfleets in space combat, utilizing both black-market technology as well as their own. Most of these were built at Consortium space stations."}, {"tag": "h4", "text": "Starfighters"}, {"tag": "h4", "text": "Transport ships"}, {"tag": "h4", "text": "Corvettes"}, {"tag": "h4", "text": "Frigates"}, {"tag": "h4", "text": "Capital ships"}, {"tag": "h4", "text": "Known ships"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}