{"url": "Zane_(SIS)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Republic Strategic Information Service personnel"], "nodes": [{"tag": "h1", "text": "Zane  (SIS)"}, {"tag": "p", "text": "Zane was a Human male Senior Agent of the Republic Strategic Information Service during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3643 BBY, Zane was obsessed with finding the mythical Imperial prison and black-ops research station, Dusk 9, and obtain its intel. For this objective, he developed a plan to install Republic troopers implanted with tracking devices to be purposely captured by the Imperials, ostensibly to scout the Imperial penal system so the SIS could rescue POWs, hoping that one of them would be transferred to Dusk 9. Of the many thousands of troopers he enlisted, this included the elite Republic sniper squad, the Deadeyes. The Deadeyes were captured on Nar Shaddaa but their members were split in several prison camps. Their capture caught the attention of Havoc Squad member, Aric Jorgan, who was formerly the Deadeyes' CO."}, {"tag": "p", "text": "Upon hearing from an angry Imperial diplomat that Havoc Squad stormed an Imperial detention center, Zane confronted Agent Jonas Balkar, accusing him of having staged the attack. Just then, Havoc arrived to claim responsibility for the attack. Wanting to bar the elite squad from interfering with his plan, Zane claimed he was attempting to get the Deadeyes back by peaceful means and attempted to use his rank to intimidate Havoc from further interference."}, {"tag": "p", "text": "Zane later learned that Jorgan had reached out to a contact of Balkar's in Signal Intelligence to decrypt a set of coordinates as to where the Deadeyes were shipped and intercepted his holofrequency, warning Havoc Squad to walk away. But this only made Jorgan suspicious of his interest in the Deadeyes and made him more determined and thus found another means of decrypting those coordinates."}, {"tag": "p", "text": "Zane later gave Havoc a call after their rescue of Torve from Tatooine. He expressed that while he understands Havoc's concern for their comrades but their continued interference threatened to jeopardize his plan. Jorgan angrily tells him that his operation was falling apart and demanded that he rescue the Deadeyes or stay out the way, to which Zane refused, so Jorgan terminated the transmission."}, {"tag": "p", "text": "Eventually, Zane realized that the Imperials didn't consider their captives of interest, so Zane bugged himself and allowed himself to be captured, figuring that the brass at Dusk 9 couldn't resist an SIS agent but he was put on a labor camp on Hoth along with Hal, Berix and some other Deadeyes and  in the end was located by Jorgan. Annoyed, Zane explained the Deadeyes' true mission and stated that because of Havoc's interference, he would have to retry his mission elsewhere."}, {"tag": "p", "text": "When Jorgan found out that two of his former comrades, Trace and Koplin, had died from the cold, he grew angry. Drawing a blaster on Zane, he accused him of making false promises to his former squad. He demanded to know how many other soldiers had died for his fool's errand. Zane smugly pointed out that Jorgan couldn't kill him with witnesses around. However, the Deadeyes stated that they would just say that the Imperials killed him. Growing terrified, Zane turned to the Havoc CO, who ordered Jorgan to stand down, promising that Zane would answer for what he had done, the right way. Jorgan then relented. Zane subsequently told Jorgan that he would see him imprisoned for attempting to murder him. The CO retorted that he would also have every soldier in the Republic gunning for him or could use Havoc Squad's prestige to counter his claim, so Zane agreed to silence. Jorgan then called for a shuttle for his remaining men."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the trooper player chooses a dark side option, he/she can let Jorgan kill Zane."}, {"tag": "h2", "text": "Appearances"}]}