{"url": "Zarro", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Females", "Category:Humans", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Zarro"}, {"tag": "p", "text": "Zarro was a human female who lived during the time of the Galactic Civil War. Around the time of the Battle of Yavin, her homeworld of Andelm IV was dominated by the gangster Jaum, who forced her and her father, Arrax, to work as slaves in the Andelm beetle caverns after they defaulted on a loan. To increase productivity, Jaum intended to sell his slave labor force to the Galactic Empire so that he could buy droids. Seeking to free her family and the other miners, Zarro stood against Jaum and enlisted the help of the Wookiee warrior Chewbacca. Together, they succeeded in defeating Jaum and keeping the Empire from establishing a presence on the Outer Rim world."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Enslavement"}, {"tag": "p", "text": "Zarro was a young human girl who lived on the planet Andelm IV during the Age of the Empire. She was the daughter of Arrax. At a young age, Zarro's mother left her and Arrax to travel on a starship offworld. Following the Battle of Yavin, Zarro and Arrax became indebted to the local gangster Jaum when they failed to repay a loan. The loan was pegged to Imperial Credits, which had taken a hit as a result of the events at Yavin 4. With her father unable to repay their loan, Jaum forced Zarro and her father to work as slave miners in the Andelm beetle caverns."}, {"tag": "p", "text": "Zarro employed debtors as forced laborers to harvest Andelm beetle larvae, who were processed into Dedlanite, a substance used in the manufacture of blasters. Unwilling to see his daughter suffer, Arrax smuggled his daughter out of the mines in a crate full of larvae. He warned her not to go home and never to return to the mine. Despite reaching the surface, Jaum's guards soon noticed her disappearance and tried to pursue her. Zarro managed to flee on a speeder to a city on Andelm IV. She went to the Andelm IV council for help only to discover that Jaum had also bribed the council to turn a blind eye to his mining operations."}, {"tag": "p", "text": "In desperation, Zarro tried to sell her stolen air speeder to a Besalisk junk dealer. However, the junk dealer was in the pay of Jaum and tried to apprehend her. One of Jaum's henchmen tried to pursue her but he was elbowed in the face by a Wookiee traveler named Chewbacca, who had come to buy a flight stabilizer for his damaged A-wing starfighter. However, Chewie lacked sufficient funds to buy the stabilizer and was forced to gamble at a casino where he managed to double his funds. Shortly later, Zarro fled into the casino while being pursued by Jaum's Shistavanen enforcer Tyvak and several guards."}, {"tag": "h3", "text": "A new ally"}, {"tag": "p", "text": "Sensing the young girl's plight, the Wookiee motioned for her to hide under his table under the gangsters had left. Despite not being able to speak the Wookiee language, Zarro managed to befriend Chewie and shared a bowl of stew with him. After the Wookiee had purchased his flight stabilizer, Zarro tried to lead him back to Jaum's camp. However, the Wookiee instead returned to his A-wing fighter and began repairing the damaged vessel. While Chewie was repairing the fighter, Zarro tried to appeal for him to free her dad and the other miners. Preoccupied with reaching the Wookiee homeworld of Kashyyyk for a family reunion, Chewie expressed indifference until Zarro mentioned that she had escaped slavery. With the Wookiee willing to help, Zarro hugged him."}, {"tag": "p", "text": "The following day, Zarro and Chewbacca returned to Jaum's beetle caverns. Zarro came up with a plan which involved Chewie searching for a stable air vent. Her role was to allow herself to be recaptured by Jaum's men so that she could enter a hollowed-out section of the mine. The two kept in touch with transmitters. As planned, Zarro was brought before Jaum, who doubled her shifts and halved her rations. Upon finding her father and the other miners, Zarro reassured them she had come back to rescue them. While digging through the hollowed-out section, Zarro was stopped by Jaum and his enforcers."}, {"tag": "p", "text": "Assembling his slaves, Jaum informed them that he would be selling them to the Galactic Empire in return for buying droids to man his factory. When the miners objected, Jaum shot one man and then ordered his guards to execute the other miners. Before the guards could execute them, Chewie dug through the tunnel and ambushed them from behind. Using his strength and muscles, the Wookiee overpowered the guards. After thanking Chewie, Zarro warned the Wookiee that he could not fire his bowcaster in the mine due to the flammable nature of the larvae. Instead, the Wookiee used a decrepit GNK-series power droid to refashion an improvised rod."}, {"tag": "p", "text": "Chewie then used the rod to disable Jaum's wheeled battle droid, knocking the machine out of service. Chewie then quickly incapacitated another guard by crushing him with the GNK droid. Zarro and her father followed their rescuer with Arrax handing the Wookiee back his bowcaster. However, Jaum's enforcer Tyvak used a blaster to ignite a stockpile of Andelm beetle larvae in the loading bay, which caused an explosion that trapped the miners underground."}, {"tag": "h3", "text": "Escaping Jaum's mine"}, {"tag": "p", "text": "Despite Jaum and Tyvak's best efforts, Zarro, Chewie, Arrax, and the other miners survived the cave-in. Zarro helped to douse a flame on the Wookiee's left leg. After helping the Wookiee to lift up a girder, Zarro and her father led the Wookiee to find the other miners. On they way, they escaped a swarm of adult Andelm beetles, which had been let loose by the break down of electricity. Chewie managed to save them from being devoured by the beetles by using his bowcaster to shoot down a girder, causing tons of soil and rock to crush the insects. Shortly later, they managed to find the other miners and the guard whim Chewbacca had crushed with the old GNK power droid."}, {"tag": "p", "text": "While the other miners met to discuss how to dig themselves out of the mine, Chewie came up with an idea to climb through a sinkhole. While skeptical that the Wookiee's plan would succeed, Zarro and her dad still supported it. With much effort, Chewbacca managed to crawl through the sinkhole and topple a dead tree above. Chewie succeeded in digging out a pit wide enough for Zarro and the other miners to climb out with a rope. When her father Arrax suggested fleeing offworld on the next ship off Andelm IV, Zarro insisted that the planet was their home and refused to consider being a refugee offworld."}, {"tag": "p", "text": "Pointing out to the ruined forest around them, Zarro reiterated that if they failed to stop Jaum, they would lose everything. When Arrax responded that he did not like the Empire but was unwilling to lose his daughter to the Rebellion, she responded that she was not trying to join the Rebellion but rather wanted to keep the Empire off Andelm IV. Arrax asked his daughter to assist with treating the wounded but Zarro pointed out they had plenty of help. Unable to get her father's permission to fight Jaum, she made up the lie that she was going to help the Wookiee repair his ship. Unwilling to argue with his strong-willed daughter, Arrax relented."}, {"tag": "h3", "text": "Stopping Jaum"}, {"tag": "p", "text": "That evening, Zarro and Chewbacca traveled to her friend Sevox's bunker, which was located near the spaceport. Sevox was a blind mechanic who relied on a protocol droid named I-7. Zarro ran errands for the reclusive mechanic, who rarely left his bunker. Sevox was initially alarmed by Zarro and the Wookiee's presence but he agreed to let them borrow some gear for a \"special project\" and to share his food. Chewie eventually found an old broken-down R5 repair droid, which he fitted with explosives. Zarro nicknamed the droid \"Boomer\"."}, {"tag": "p", "text": "Despite thinking that Chewie and Zarro's plan was foolish, Sevox and his droid agreed to let Zarro drive the group to the spaceport. On the way, the companions learned that an Imperial Star Destroyer was orbiting Andelm IV. Sevox allowed Zarro and Chewie to use his lab as a hiding place but not to tell the Empire that he had hidden them. As a final favor, Zarro agreed to bring Sevox the head of an Imperial RA-7 protocol droid since Sevox was interested in its optics. In addition, Sevox also advised her not to let the Imperials think that she was part of Rebel Alliance. Unknown to Zarro, Chewie was part of the Rebellion and had played a role in the destruction of the Death Star."}, {"tag": "p", "text": "Despite Zarro's optimism that they would have taken care of Jaum before Imperial forces arrived, she and Chewie found that the Andelm IV spaceport had been locked down by Imperial stormtroopers and scout troopers. The spaceport had been locked down in order to allow Jaum to deliver a shipment of dedlanite to the Imperial Commander Kai. Zarro and Chewie managed to secure entry into the spaceport by disguising themselves as one of his henchmen and a war droid respectively. The two companions tried to plant \"Boomer\" aboard the waiting Imperial landing craft but were stopped by Jaum, who demanded that she take off her helmet."}, {"tag": "p", "text": "At that point, Chewie attacked the stormtroopers and exchanged fire with Jaum and his men. Zarro then sent Boomer up the landing craft's ramp but the droid was knocked out by a stray blaster bolt. While telling Chewie to distract Jaum and Tyvak, she pushed the droid aboard the shuttle and set a timer. Meanwhile, Chewie unleashed an engine which burned Tyvak and knocked out the AT-ST walker. Before Jaum could flee aboard the landing craft, Zarro sneaked down the ramp and rejoined Chewie. As Jaum departed, they exchanged fire to his shuttle. Having achieved their mission to bomb Jaum's shipment and maybe take out the Star Destroyer, the two embraced. Zarro praised the Wookiee for taking out the Imperials and their walker."}, {"tag": "p", "text": "Their victory celebration was short-lived because they were then detained by several Scout troopers. Zarro feigned delight and claims that they had survived a firefight with a spice-addicted Jaum. However, the scout troopers detained the two friends under orders from Commander Kai, who wanted to question them. Zarro and Chewie were taken aboard an Imperial shuttle to Kai's Star Destroyer. On the way, the two knocked out the stormtrooper escorts and the crew. Zarro also told the Wookiee to let her do the talking."}, {"tag": "p", "text": "Upon landing, Zarro slid down the ramp with her blaster and was greeted by Commander Kai, who demanded her and Chewie's surrender. However, Zarro defiantly replied that she took her orders from him. Chewie also destroyed an RA-7 protocol droid and overpowered the three remaining stormtroopers around him. Having gained the Commander's complete attention, Kai claimed that she had come to help the Empire. She told him that Jaum was a gangster and a rebel spy who was trying to defraud the Empire, adding that he did not even own a mine. She also pointed out that Jaum's droid \"Boomer\" was crammed with explosives."}, {"tag": "p", "text": "When Jaum arrived, she told him that she had told the truth about him to the Empire. At that moment, the Imperial landing craft exploded, damaging the hangar's force field. Zarro and Chewie escaped death by fleeing aboard a TIE/sa bomber. Before Chewie could free the starship from its moorings with his bowcaster, Zarro tried to start the launch cycle but accidentally activated a thermal detonator. The force of the decompression eventually broke the TIE bomber free of its moorings, and it tumbled down to Andelm IV. Despite losing its left wing, the bomber survived atmospheric re-entry and crash-landed on Andelm IV. Meanwhile, Jaum was taken prisoner by Commander Kai, who believed that he was a rebel spy and had him tortured by an IT-O Interrogation Unit."}, {"tag": "h3", "text": "Parting with a friend"}, {"tag": "p", "text": "Despite Zarro's pleas, Chewbacca was unable to stay on Andelm IV since he had to leave for a family reunion on Kashyyyk, the Wookiee homeworld. She also noticed that Chewie was carrying a box, which turned out to be a gift for one of his children. Nevertheless, she thanked the Wookiee for saving her planet from being conquered by the Empire. Out of gratitude, Chewbacca gave her the golden medallion he had received for his services during the Battle of Yavin. Chewie had given it to her because the medal had clashed with his warrior vibe. Before parting, the two friends embraced one last time."}, {"tag": "p", "text": "Taking Jaum's green landspeeder, she greeted her father, who had initially mistaken her for Jaum. Arrax was troubled by the rumor that Zarro had been taken captive by the Empire. A jubilant Zarro then told her father that Jaum had been taken by the Empire and that they were going to give his speeder a \"good home.\" When her father asked about the Wookiee, she told Arrax that he had politely declined her offer to stay because he had an \"important mission\" to attend. While she did not know Chewie and his background, she surmised that he was fighting a greater war and had saved her homeworld from being taken over by the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zarro was a brave, headstrong Human girl who had a strong sense of justice. While she loved her father Arrax, she could sometimes be stubborn and persistent in doing things her own way. She was small-build, thin, slim, and athletic. Zarro was also a good runner and was able to outrun several adult foes on more than one occasion. She also had a cheerful and friendly temperament. Despite not being able to speaking the Wookiee language, Zarro was able to form a friendship with the rebel Chewbacca, who could understand Galactic Basic Standard."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Despite her young age, Zarro knew how to drive landspeeders, a skill that came in handy on at least three occasions. Due to her time as a forced laborer in Jaum's mine, she was familiar with Andelm beetles and their incendiary larvae. She was also a master of disguises and came up with the idea of disguising herself as a hooded alien and Chewie as a \"war droid\" during their mission to sabotage Jaum's plan to open up Andelm IV to Imperial exploitation. Zarro was also a feisty fighter and fought stormtroopers on one occasion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zarro is a character created for the Marvel comic book series Star Wars: Chewbacca, written by Gerry Duggan and with art by Phil Noto. In designing the look of the character, Noto described her as \"kind of a skate-punk tomboy.\" He felt it fun to create a teenaged Star Wars character from scratch, as most younger characters appeared as Padawans or the kids in the 1980s Star Wars: Ewoks television films. Noto complimented Duggan's writing for the character, saying that pairing her with Chewbacca made it \"easy to know the character.\""}, {"tag": "p", "text": "On the cover of Chewbacca 1, Zarro's shirt has the word \"TROUBLE\" written in Aurebesh on its front. In the actual comic, her shirt actually says \"ELBUOONGT\" in upside-down Aurebesh, which is a misspelled version of \"trouble\" spelled backwards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}