{"url": "Zaril", "categories": ["Category:Canon articles", "Category:B'omarr Monks", "Category:Defel", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Zaril"}, {"tag": "p", "text": "Zaril was a Defel male thief who masterminded a raid on a Jedi vault on Alaris Prime. He was successful at stealing and hiding treasures from the vault, but was pursued across the galaxy by the Jedi. Desperate to escape, Zaril visited the B'omarr Order on Tatooine, and had his brain removed from his body, assuming his crew of droids would return to rescue him. However, his droids were destroyed by the Jedi, and Zaril's brain remained in the catacombs of Jabba's Palace. Crakka, a cousin of Jabba the Hutt, attempted to steal Zaril's brain to find the location of his treasure, but they were caught by Jabba. Zaril's brain was damaged when Crakka dropped the jar it was contained in, and the location of his treasure was lost."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "An audacious heist"}, {"tag": "p", "text": "Centuries before the era of the Galactic Empire, Zaril operated as a thief, leading a band of droids. Zaril was the mastermind behind a heist on Alaris Prime, raiding a Jedi vault that contained a vast collection of artifacts. Zaril's raid was successful, and he managed to escape with treasure from the vault, hiding it in a secure location. However, the Jedi Order were alerted to the theft, and pursued Zaril across the galaxy."}, {"tag": "p", "text": "While Zaril managed to escape, he became desperate to evade his Jedi pursuers. Traveling to Tatooine, Zaril met with the B'omarr Order, choosing to undergo the monks' brain removal procedure so that he could hide from the Jedi. Zaril's brain was removed from his body, and the Defel assumed that his crew of droids would eventually return to rescue him. However, the rescue mission Zaril had expected never came, as the Jedi had managed to find and destroy his crew of droids. Zaril's brain remained within the catacombs of the B'omarr Monks, and his treasure could not be found."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After some time, the catacombs, located underneath Jabba's Palace, came to be owned by the crime lord Jabba the Hutt. Crakka, a cousin of Jabba, visited the palace in hopes of stealing Zaril's brain from the catacombs and learning the location of the treasure. Crakka and her beastmaster Dagra Van stole the jar that contained Zaril's brain, but, in their escape, Crakka dropped the brain, which was retrieved by Jabba. Zaril's brain was attached to a B'omarr droid walker, but the fall had damaged it beyond repair, and the knowledge that Zaril held was lost."}, {"tag": "p", "text": "The Rebel Alliance lieutenant Thom Hudd eventually heard the story of Crakka and Zaril's brain from an associate of his on Batuu. He recounted the tale to distract Vaneé, a servant of the Sith Lord Darth Vader, while trapped in Vader's fortress."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zaril was a daring thief, choosing to undertake a heist of Jedi property. However, he became desperate to escape their pursuers, and incorrectly assumed he would be saved by his band of droids. A Defel male, Zaril had black fur and red eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a thief, Zaril could organize and embark on an audacious heist, and managed to escape capture when the Jedi attempted to chase him."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Zaril wore a red cloak during his heist on Alaris Prime, and was assisted by a crew of droids. While on Tatooine, Zaril used a landspeeder to travel to the B'omarr Monks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zaril first appeared in Star Wars Adventures: Return to Vader's Castle 4, written by Cavan Scott, illustrated by Nicoletta Baldari, and published by IDW Publishing on October 23, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}