{"url": "Zarra_(rifle)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Personal weapons", "Category:Rifles"], "nodes": [{"tag": "h1", "text": "Zarra  (rifle)"}, {"tag": "p", "text": "Zarra was the name of rifle used by a sergeant serving with the Alliance to Restore the Republic during the Galactic Civil War. At some point following the Battle of Yavin, the sergeant had not informed anyone of his reason for choosing \"Zarra\" as the name of his rifle."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Zarra was a rifle with a small targeting scope and a long barrel with holes running down its length. While the most of the barrel was silver-colored, the coloration of the gun gradually changed to black near the trigger and dark gray on the stock. A Human-sized species needed two hands to wield Zarra effectively."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A Human sergeant who served with the Alliance to Restore the Republic that fought against the Galactic Empire during the Galactic Civil War gave his rifle the name \"Zarra\" many years before the Battle of Yavin. At some point following the battle, the sergeant still carried the rifle, but he had not told anyone the origins of his weapon's name."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rifle known as Zarra was featured in 2008's Champions of the Force, the first set of Sony Online Entertainment's Star Wars Galaxies Trading Card Game, a virtual card game created to go along with the 2003 MMORPG Star Wars Galaxies. The card game was shut down at the same time as Star Wars Galaxies, which was closed on December 15, 2011. Zarra was created for the Rebel Sergeant card, which was illustrated by the artist Svetlin Velinov. While the card did not specify what model of rifle Zarra was, the weapon was similar in appearance to the E-17d sniper rifle, the DLT-20A blaster rifle, and the pulse cannon."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}