{"url": "Zatt", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Nautolans"], "nodes": [{"tag": "h1", "text": "Zatt"}, {"tag": "p", "text": "Zatt was a male Nautolan Jedi youngling who was a member of the Jedi Order during the Clone Wars. He participated in the gathering alongside: Petro, Gungi, Byph, Ganodi, and Katooni. The six younglings were led by Ahsoka Tano and instructed by Yoda."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Gathering"}, {"tag": "p", "text": "Around two years into the Clone Wars, Zatt traveled to the planet Ilum to gather his kyber crystal so he could build his own Jedi lightsaber. He traveled with fellow Jedi younglings Petro, Katooni, Byph, Gungi, and Ganodi. They were led by Padawan Ahsoka Tano, and when they reached the caves, Jedi Master Yoda instructed them to go in, but if they took too long they would be trapped in the caves as the entrance was freezing up. Zatt greatly relied on technology to find his crystal, but his scans were showing the crystals to be everywhere, yet he could not see any. He eventually gave up, throwing his scanner at the cave wall and then he found his crystal as he had shown he could use the Force to find it, not technology."}, {"tag": "h3", "text": "Pirate encounter"}, {"tag": "p", "text": "On their way back to Coruscant aboard the Crucible, the six younglings were introduced to the basics of designing and styling their lightsabers by the architect droid professor Huyang. They then started to create their lightsabers, but the Weequay pirate Hondo Ohnaka and his pirate gang attack the ship before anyone properly finished. Zatt and Ganodi went to the cockpit to hide, whilst the others went to the hold but were caught before they could get there. Padawan Tano managed to force the pirates out of the ship through a vacuum caused by the Crucible breaking away from the pirates' ship but she was pulled out the gap too and captured by the pirates."}, {"tag": "p", "text": "The younglings discovered the ship was leaking coolant soon after, and therefore the group had to land otherwise the ship would blow up. The nearest planet was Florrum, the location of Ohnaka's base, so when the got there they left the astromech droid R2-D2 and Ganodi with the ship. The rest of the younglings infiltrated the pirates through a troupe of the Dug Preigo. They waited until the right moment to steal back Tano's lightsabers and free her from the pirates and escape on a stolen speeder."}, {"tag": "h3", "text": "Encountering Grievous"}, {"tag": "p", "text": "As they attempted to flee, the younglings and Tano were recaptured when the Crucible crashed. The pirates escorted them back to the base only to find it overrun by Separatists, led by General Grievous. Realizing that they needed to work together, the younglings formed an alliance with Ohnaka and his gang, before making their way to a secret starship vault that Ohnaka had kept secret."}, {"tag": "p", "text": "Katooni and Ohnaka went onto the ship when the younglings were separated from the rest of them, and soon they encountered Grievous. Tano managed to fend him off until Ohnaka arrived, before they all escaped and made their way to a nearby Republic starship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}