{"url": "Zardra", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Bounty hunters", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Zardra"}, {"tag": "p", "text": "Zardra was a tall bounty hunter with long, dark hair."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zardra had partnered herself with a fellow bounty hunter named Jodo Kast, and together they decided to stake a claim on a bounty for two spice-jackers known as the Thig Brothers. They tracked the Thigs to a bistro called the Red Shadow on the grime-filled streets of Taboon in the Stenness system. Four Weequay servants passed through carrying a Hutt known as Mageye on top of a palanquin. Mageye was en route to cut a deal with another Hutt named BolBol. The entourage made the mistake of getting into the middle of the firefight at the Red Shadows. Zardra and Jodo hemmed the Thig Brothers into a crossfire and opened fire on them. During the excitement, the Weequay servants dropped Mageye's litter, allowing the Hutt to slide down on top of Zardra. Unable to muscle her way out from beneath the Hutt on her own, Zardra shoved a gauge six thermal detonator into his mouth, blowing him to bits. The death of Mageye soon reached the ears of Jabba the Hutt. After losing favor with Jabba the Hutt, Gorm the Dissolver accepted a 50,000 credit bounty to bring Zardra to heel."}, {"tag": "p", "text": "Circa 0 BBY, Zardra tried to collect a 40,000-credit bounty posted by the Empire on Dharus, a Rebel privateer. Understanding that Dharus could easily attack the Jesoni-class liner Culroon Minstrel, Zardra boarded the ship. Dharus' intelligence was restricted to Imperial activities, and as such the pirate was unaware of the independent bounty hunter ambushing him — his contacts mistakenly believed Zardra to be a harmless Imperial aristocrat. Dharus and his crew attacked the Minstrel and, once they had boarded the ship, Zardra defeated them and captured Dharus. The Empire gave Zardra the bounty."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Zardra was cautious and meticulous. She would analyze her target, the local populations, any escape routes and alternatives for each hunt. This sometimes led her to lose her target, but she preferred to be alive to try again rather than to stumble into a deadly situation."}, {"tag": "p", "text": "It was noted that she had an \"exotic, deadly scent.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}