{"url": "Zay_Versio", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Dross Squadron personnel", "Category:Females", "Category:Humans", "Category:Inferno Squad personnel"], "nodes": [{"tag": "h1", "text": "Zay Versio"}, {"tag": "p", "text": "Zay Versio was a human female starfighter pilot who lived during the era of the New Republic. She was the daughter of Del Meeko and Iden Versio, as well as the granddaughter of Garrick and Zeehay Versio on her mother's side of the family. Despite her family's past ties to the Galactic Empire, Zay and Iden fought against the First Order after Meeko was executed by Gideon Hask during the waning days of the Cold War. Hask was ultimately killed by Meeko's family, although Zay lost her mother as well. After the destruction of Starkiller Base, General Leia Organa instructed Zay to find allies for the Resistance in the Outer Rim Territories. To help rebuild the Resistance, Zay underwent a mission together with Dross Squadron to recover some old starfighters on Bracca. Zay answered the call to help destroy the Sith Eternal fleet, during the Battle of Exegol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born sometime before the mission to Pillio aboard the Corvus, Zay Versio was the daughter of Del Meeko and Iden Versio."}, {"tag": "h3", "text": "Joining the Resistance"}, {"tag": "h4", "text": "Mission to Athulla"}, {"tag": "p", "text": "During the Cold War, Zay and her mother, Iden Versio, were piloting X-wing starfighters through an asteroid field when Shriv Suurgav, Versio's Rebel comrade whom Zay regarded as an uncle, told them to come to the Corvus regarding something urgent. Suurgav told them that Zay's father, Del Meeko, was missing, and they set out to find him. This led them to Athulla, where they were contacted by an Athullan who asked if they had his people, only to realize Meeko was not there. Before they could learn anything beyond the name \"Project Resurrection,\" the transmission was cut off by a Jinata Security fleet under the command of Leema Kai, who led the kidnappings of Athullans."}, {"tag": "p", "text": "She and Iden then went to their X-wings, and a dogfight ensued between the Corvus, Iden, Zay, and J-Sec, who were using starfighters from the Clone Wars. During the dogfight, Iden shot down three modified GR-75 medium transports and disabled Kai's flagship, the Opportunity, while Zay drew attention away from Iden. This prompted Kai to engage them in a heavily modified Naboo starfighter armed with seismic charges. When Kai was killed, Zay told Iden the Opportunity had surrendered as she threatened to fire the Corvus's concussion missiles all at once, but revealed to Iden it was a bluff."}, {"tag": "h4", "text": "Mission to Vardos"}, {"tag": "p", "text": "They later discovered fully what Project Resurrection was and that Protectorate Gleb was holding Del prisoner on Vardos, Iden's homeworld, which had been devastated by Operation: Cinder thirty years ago. Zay stayed on the Corvus, as Iden didn't want her to \"stare her mother's past in the face.\" Not long after, the Corvus was shot down by the Retribution, Gideon Hask's flagship, in an attempt to kill her, but she had gotten out in an escape pod just before the ship crashed and was destroyed. She then ripped out the pod's distress beacon and set up a makeshift sniper's nest, firing on both Jinata Security and First Order troops. She was later relieved when Shriv and Iden found her. When the fighting was over, Iden told Zay that Hask had killed Del and that she would find a way onto his Star Destroyer and get revenge, but Zay talked her out of it, stating it wouldn't bring him back. The plan was altered to boarding the ship to get any intelligence for the Resistance. They then set off to the ship in stolen TIE fighters, flying in sync with other TIEs while Iden's ID10 seeker droid, Dio, scanned for possible entrances. But their cover was blown, and a dogfight ensued. Dio later found an opening through a heating port by the starboard engines, so they blasted it open and flew in just as the Star Destroyer prepare to jump to hyperspace."}, {"tag": "h4", "text": "Sabotaging the Retribution"}, {"tag": "p", "text": "Successfully boarding the ship, the trio made its way into a small command room, where Shriv discovered the schematics for a Mandator IV-class Siege Dreadnought but couldn't get the schematics to the Resistance while the ship was in hyperspace. So Iden devised a plan to force the ship out of hyperspace by destroying the hyperdrive, while Shriv went to find an escape ship. Zay jokingly commented that she understood why Shriv was a nervous wreck around her. After fighting to an armory and grabbing explosive charges, they fought their way to the hyperdrive. There, she began placing charges on key areas while Iden covered her from incoming stormtroopers. Before heading to the last area, Dio began diverting reinforcements so they had a clear path, but just after Iden finished planting the final charge, Hask snuck up on her and held her at gunpoint, taunting Iden to shoot him. But she threw down her weapon, as she didn't want to risk hitting Zay. Disappointed with her cowardice, he prepared to shoot Iden, but Zay broke free of his grasp and redirected his shots before falling off the catwalk. Iden grabbed her at the last minute and threw her back up before Hask went to finish off Iden, but Zay tossed her pistol to her mother, and Hask was shot off the catwalk and down into the hyperdrive core, killing him and avenging her father."}, {"tag": "p", "text": "Zay and Iden made their way to an observation room and set off the charges, ripping open a hole underneath the ship and forcing it out of hyperspace prematurely. Happy that the plan worked, Iden suddenly collapsed in pain, revealing she had been shot by a stray bolt from Hask's blaster. Worried and saddened, Zay tried to figure out a way to help her mother, but Iden told her it was too late for her, telling her that as long as they stayed strong and kept fighting, even if it meant dying, they would make a difference. After telling her she needed to get Dio to the Resistance and saying she loved her, Iden succumbed to her wound and died, leaving Zay devastated and alone with Dio before watching Starkiller Base implode into a star. Shriv then contacted them, stating he found a ship but it'd be a tight fit only for Zay to tell him Iden was dead. Remembering Iden's last words, they arrived at D'Qar, the Resistance headquarters, as it was evacuating and had a short conversation with General Leia Organa, a rebel veteran and the Resistance leader. She gave her sympathy upon hearing of Iden's death but asked for her help in finding the Resistance's allies in the Outer Rim Territories, to which she agreed. Organa then wished them good luck."}, {"tag": "h3", "text": "Gathering allies"}, {"tag": "p", "text": "Sometime after the Battle of Crait, Zay contacted Organa and informed her they had some promising leads and whilst she hadn't found the allies Organa had asked for, they had tracked down some friends of Iden who once served the Empire but weren't aligned with the First Order. While doubting in recruiting them, Organa ultimately gave her approval to Zay as Iden had proven that some of the fiercest rebel fighters used to be on the other side before realizing that the peace and order they desired came at a too high price."}, {"tag": "p", "text": "She and Shriv recruited Carlist Rieekan, who had served as a general in the Rebel Alliance. They reunited with Organa on Ryloth. Zay and Shriv were later part of the mission to steal starfighters from the planet Bracca."}, {"tag": "h3", "text": "Battle on Exegol"}, {"tag": "p", "text": "During the Battle of Exegol, Zay and Inferno Squad arrived with the rest of the citizens' fleet that Lando Calrissian had amassed to help stop the Sith Eternal's Star Destroyer armada."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zay Versio was a young woman with brown hair, brown eyes, and fair skin. As the daughter of former Imperial special agents, she was mature for her age and a skilled fighter. She got along very well with Shriv Suurgav, who took on a father-like role in her life, especially after the loss of her parents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zay Versio was created for the single-player campaign of Star Wars Battlefront II and first appears in the Resurrection DLC, where she is portrayed by Brittany Volcy. The character was designed by character artist Lauren Kelly for the game, and her character art was titled Zay Meeko."}, {"tag": "p", "text": "After the initial campaign revealed that Iden Versio and Del Meeko had a daughter, some fans and media outlets speculated that they were the parents of Rey, the protagonist of the Star Wars sequel trilogy. The release of the Resurrection DLC officially put those rumors to rest by revealing their daughter as Zay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}