{"url": "Zeerid_Korr", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Exchange members", "Category:Humans", "Category:Males", "Category:Members of Havoc Squad", "Category:Pilots", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Zeerid Korr"}, {"tag": "p", "text": "Zeerid Korr, also known as Z-man, was a male Human smuggler who was a former Republic Army commando in the Havoc Squad and later joined The Exchange during the Great Galactic War and the start of the Cold War between the Republic and the reconstituted Sith Empire. He fought at the Battle of Balmorra together with the Jedi Knight Aryn Leneer and they became friends. After transporting Leneer to face Darth Malgus, he left for Vulta to pick up his daughter and move to Dantooine and became a farmer, where he later was reunited with Aryn Leneer, for whom he had romantic feelings."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Soldier then smuggler"}, {"tag": "p", "text": "Little is known about Korr's early life. However, he served as a commando in the Republic's Havoc Squadron against the Sith Empire. He demonstrated exceptional skill as a star pilot, rivaling even Jedi pilots. He also learned skills with blasters and unarmed combat, to the point where he was capable of killing a man with a single strike. During the crucial Battle of Balmorra, Korr became steadfast friends with Jedi Knight Aryn Leneer. Korr's time in the military was tragically cut short by the sudden death of his wife Val and injury of his daughter Arra. It was Leneer who supported Korr in his mourning. Leaving the army to attempt to provide for his now legless daughter, Korr was unable to find any legal way to earn the credits to care for his family, and was forced to use his skills as a soldier and pilot to become a smuggler in service to the Exchange, a criminal organization. Desperate to get enough credits to provide Arra with prostheses, or at least a hoverchair, Korr (under the pseudonym Z-Man) undertook weapons-running missions all over the Outer Rim."}, {"tag": "h3", "text": "Mission for the Exchange"}, {"tag": "p", "text": "Korr was placed under the direction of a handler known as Oren, a man who he knew next to nothing about. Oren would task him with different weapon smuggling assignments. On several occasions, these missions ended in ambush, and Korr soon found himself in massive debt to the Exchange. After a particularly disastrous mission on Ord Mantell and a battle with a group of pirates that he survived thanks to his military skills, After Oren learned of the mission's failure, Korr was tasked with doing spice runs to compensate for the lost cargo. Korr was extremely reluctant to help anyone get ahold of any kind of spice, but had no other option, as his debt only continued to grow. As this was happening, the Sith Empire under Darth Malgus launched a surprise attack on the Republic capital of Coruscant, destroying the Jedi Temple and probably murdering many members of the Galactic Senate, the Chancellor included. Blockading the planet, the Sith made it nearly impossible for the criminal underworld to operate on Coruscant. Because of this, the spice addicts that partook in engspice brought in from offworld would suffer from withdrawals. Oren offered Korr an ultimatum: if he delivered engspice to Coruscant, bypassing the Imperial blockade, then he would be cleared of his debts. If he refused, they would terminate him. Negotiating the terms of the arrangement, Korr managed to coerce the Exchange into depositing 100,000 credits into his account before his departure."}, {"tag": "p", "text": "This arrangement being made, Korr journeyed to his homeworld of Vulta to finally give Arra the hoverchair he'd dreamed of buying for her. He purchased the chair and delivered it to his daughter, who was at the time being cared for by Korr's sister-in-law, Nat. Korr then learned of their harsh living conditions, which were caused by Nat's low pay, and Korr promised them that he would soon have enough to help them out of their situation once and for all, though he refused to explain how, as he kept his illegal jobs a secret from his daughter. But the engspice delivery had attracted the attention of the Hutt crime lords, who were looking to become involved in the business of spice running. Dispatching a bounty hunter called Vrath Xizor, a former Imperial sniper (a skulker, as they were colloquially called by Republic soldiers), the Hutts ordered that Z-Man be terminated before the spice could arrive at Coruscant. Korr (unknowingly) nearly stopped the plan before it even began, when he found Xizor watching his family in a park, but the man was able to convince Korr that he had no harmful intentions. Still, for guarded Nat's apartment for a few hours, leading him to receive an unexpected visit."}, {"tag": "h3", "text": "Reunion with a Jedi"}, {"tag": "p", "text": "Korr had a surprising reunion with Aryn Leneer on Vulta just prior to his departure. Leneer, upon learning of the Sith attack and the death of her Master Ven Zallow, requested that Korr transport her to Coruscant. She was then unaware of the cargo of Fatman, Korr's starship. Making their way to the spaceport, Korr and Leneer were ambushed unexpectedly by Vrath and a group of mercenaries that accompanied him. After killing multiple of them and narrowly escaping Vulta, Korr and Leneer jumped into hyperspace. Employing cunning uncharacteristic of a smuggler, Korr latched the ship onto an unaware Imperial transport, and arrived at Coruscant in the shadow of the transport. Korr and Leneer nearly made it through the blockade. Vrath, however, had arrived at Coruscant and notified Darth Malgus of the imminent arrival of the smuggler, Jedi Knight, and their illegal cargo."}, {"tag": "p", "text": "After being discovered, Korr boldly broke through the blockade and into the atmosphere of the city-planet. However, Malgus' cruiser Valor opened fire on Fatman, destroying it just as it broke through the atmosphere. Shielding herself and Korr using the Force, Leneer slowed their fall and allowed them to land safely on the elevated walkways of Galactic City."}, {"tag": "h3", "text": "A new path"}, {"tag": "p", "text": "Having lost the cargo of engspice, Korr devoted himself to getting back to Vulta to retrieve his daughter, then moving to Dantooine to escape the Exchange and start a new life. As he planned to make his way to a spaceport, he accompanied Leneer to the Jedi Temple first, unsure of what her intentions were. Along his journey and subsequent adventure into the ruined Jedi Temple with Aryn, Korr found himself infatuated with the Jedi. The two made their way to the Temple through the Works, an industrial area of Coruscant that contained a secret passage to the Temple. After reuniting with Leneer's droid T-7 and recovering a recording of her master's death, Korr realized that Leneer planned to kill Malgus out of revenge, and possibly even to murder his lover in order to hurt him even further. He tried several times to convince Aryn to abandon her quest for revenge against the Sith that murdered her Master, but to no avail. Zeerid then scouted the spaceport that received several Imperial transports, forming a plan to escape. He soon discovered that Leneer had returned to the Temple to kill Malgus, and discovered the two in the middle of an intense duel. Korr rescued Leneer, and explained that he had identified an Imperial shuttle capable of transporting them offworld."}, {"tag": "p", "text": "The two made their way inside the spaceport and located the shuttle. Aryn, who opted to remain on Coruscant to confront Malgus, sent Korr with her astromech on the shuttle. Korr tried to convince her to come with him, but she refused, although she ultimately spared the life of Malgus's lover. Leneer then convinced him to leave in the shuttle while she confronted Malgus alone. Korr reluctantly agreed and, after kissing her, left. Little did Korr know that the ship belonged to Vrath. He encountered Vrath soon after the ship began to take off, and engaged him in a vicious hand-to-hand duel. With both combatants having military training, both men were badly injured in the fight. Zeerid also learned of Vrath's military background during the fight, and Vrath learned of Korr's. After a mistake in Vrath's fighting strategy allowed Korr to knock him out, Korr secured him and made it through the Imperial blockade, as Malgus had ordered the shuttle to be allowed to leave, worrying that his lover might have boarded it before launch. Korr eventually realized that since Vrath knew about his daughter and would likely betray his family to the Exchange, Vrath would need to be killed. Zeerid was extremely reluctant to kill the unarmed man. But, in a dark act to protect his family, Korr refused Vrath's attempts to convince him to spare the bounty hunter's life, and Korr threw Vrath out of an airlock."}, {"tag": "p", "text": "Aryn, who was reminded of her allegiance to the light side of the Force, fought Malgus, but was ultimately defeated. Malgus decided to spare her out of a respect he felt for the Jedi and gratitude that she had not killed his lover, a Twi'lek named Eleena. He granted her clearance to leave Coruscant, as well as Korr. Korr eventually retrieved Arra, had afforded prosthetic legs for her, and started a farm on Dantooine. Months later, after believing Aryn to be dead at Malgus' hands, he was once again reunited with her. Although Korr initially worried that the Exchange had found him, he soon recognized Aryn, and she explained what had happened since the duel. She told him that she was staying on Dantooine with him, and he and Arra welcomed her gladly."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Zeerid's weapon of choice was a hip holster with its twin BlasTech 4s. Normally, he would keep an E-3 blaster in his ankle holster and E-9 blaster at the small of his back."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Paul S. Kemp has said that in his mind Zeerid is an ancestor of Jaden Korr. However, no canon source has confirmed that they are indeed related."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}