{"url": "Zebulon-B_frigate", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance to Restore the Republic starship classes", "Category:Frigate classes", "Category:Galactic Empire starship classes", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "Zebulon-B frigate"}, {"tag": "p", "text": "The Zebulon-B frigate was a frigate in production by Kuat Drive Yards in the year 4 ABY that was designed for the Galactic Empire's navy. The Alliance to Restore the Republic's Scavenger Squadron hijacked multiple Zebulon-B frigates from the KDY shipyards during an attempt by KDY's leader, Kuat of Kuat himself, to scuttle the docks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Zebulon-B frigate was produced by Kuat Drive Yards, a major starship manufacturer, in the shipyards that orbited the planet Kuat. It was in production by early 4 ABY, at the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. That year, some Zebulon-B frigates were being built at the KDY shipyards in preparation for when they would boost the ranks of the Imperial Navy after the result of a forthcoming battle near the Forest Moon of Endor, a major confrontation between the two sides that KDY was anticipating."}, {"tag": "p", "text": "However, as the Battle of Endor was being fought, the current Kuat of Kuat and head of KDY, not wishing to see the shipyards be taken over by the same Empire to which the company sold some of its products, tried to destroy the shipyards with explosives. As the yard went up in flames, Scavenger Squadron, an Alliance starfighter unit keeping an eye on the docks, managed to rescue multiple Zebulon-Bs as well as four Lancer-class frigates. The bounty hunter Boba Fett also saved most of the shipyards from destruction, foiling Kuat's plan to take down KDY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Zebulon-B frigate was first mentioned in Hard Merchandise, a 1999 novel by K. W. Jeter. It is unclear whether the ship was intended to be the more common EF76 Nebulon-B escort frigate, as the novel was the only publication to mention the Zebulon-B."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}