{"url": "Bhurra", "categories": ["Category:Legends articles", "Category:Bespinites", "Category:Criminals", "Category:Enforcers", "Category:Lutrillians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bhurra"}, {"tag": "p", "text": "Bhurra was a male Lutrillian who served as a lieutenant for the crime lord Vorse Tabarith on Cloud City. The Lutrillian was assigned to monitor the crime lord's wife, Aris Shen, and during the Galactic Civil War followed her to Market Row. There she escaped the thug with help of several spacers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Lutrillian Bhurra lived on Cloud City on the planet Bespin during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. There he served loyally as a lieutenant for the local crime lord Vorse Tabarith. Bhurra was entrusted with the job of monitoring Tabarith's wife, Aris Shen. This job included following Shen and recording where she traveled and who she talked to, attacking anyone who accosted her or insulted Tabarith. During the war Bhurra and several other thugs followed Shen to Market Row, a commercial corridor in the Port Town district of Cloud City where Shen planned to meet a group of spacers hired by her father, Arend Shen."}, {"tag": "p", "text": "Once Shen met with the spacers, they aided her in losing Bhurra and the other thugs."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bhurra was particularly bulky and broad shouldered for a Lutrillian, with impressive and lengthy white whiskers. He served Tabarith loyally which the crime lord valued, although he thought little of Bhurra's abilities."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bhurra and Tabarith's other thugs wore tinted goggles and black long coats while following Shen, in order to intimidate others. He also carried a blaster, a comlink and a set of brass knuckles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bhurra first appeared in The Jewel of Yavin, an adventure module released in 2014 by Fantasy Flight Games for Star Wars: Edge of the Empire. The book gives number of ways in which players can help Shen lose Bhurra, including simply killing him. This article makes no assumptions about the methods used, but does assume the players were successful."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}