{"url": "Zeffo_(species)", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Extinct sentient species", "Category:Force-sensitive species", "Category:Outer Rim Territories species", "Category:Zeffo"], "nodes": [{"tag": "h1", "text": "Zeffo  (species)"}, {"tag": "p", "text": "The Zeffo, also known as the Zeffonians, were an ancient sentient species native to the planet Zeffo. Many Zeffo could wield the Force, which they referred to as the \"Life Wind,\" and those who did became known as sages."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rise of the Zeffo"}, {"tag": "p", "text": "The Zeffo had evolved on the planet of the same name, where they had constructed many statues and relics dedicated to several Zeffo Sages, and were protected by the ancient automatons known as  Tomb Guardians."}, {"tag": "p", "text": "Three of the more esteemed sages, Eilram, Kujet, and Miktrull, were buried in elaborate tombs, both on Zeffo and Dathomir. Their culture extended beyond their homeworld, with elaborate temples and tombs built on Bogano, Ontotho, and Kashyyyk."}, {"tag": "p", "text": "The ancient Zeffo had established a relationship with the Wookiees of Kashyyyk. Bogano had a great Vault built by the Zeffo; as a result, the colony was believed to be a pilgrimage site, due to the presence of the Binog, a large creature important to Zeffo art and culture."}, {"tag": "h3", "text": "Corruption and demise"}, {"tag": "p", "text": "Though the Zeffo originated as a peaceful culture, over time they became more and more corrupt, eventually falling to the Dark side of the Force. Reigning in the time after Sages Eilram and Miktrull, Kujet ordered the destruction of the astriums the species used in their religious practices while promising their followers power and control over the Life Wind, but he proved to be treacherous and cruel with his reign marking the decline of Zeffo culture."}, {"tag": "p", "text": "From their seat of power on Dathomir, Kujet staged a massacre in the halls of the palace, reducing the brave rebels opposed to their rule to ashen ruin. When Kujet died, they were entombed within a sarcophagus that was placed on the walls of their great temple. Within his dead hands, Kujet held one of the last remaining astriums."}, {"tag": "p", "text": "Facing extinction, the remnants of the Zeffo fled into the great unknown, hoping to finally find peace."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In the years before the Great Jedi Purge, Jedi Master Eno Cordova became fascinated by the near-extinct Zeffo. In a record that appeared as a Force vision, the Jedi Padawan Cal Kestis heard the words of an ancient Zeffo, who was leading the remnants of their species into the \"great unknown.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}