{"url": "Zeffliffl_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Botanical sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Zeffliffl  (species)"}, {"tag": "p", "text": "The Zeffliffl were intelligent, seaweed-like aliens native to the planet of Zeffliffl, in the Atrivis sector of the Outer Rim Territories. Living in tight-knit groups, the species had a subconscious connection with its group members, which rejected any outsiders. A group of Zeffliffl traveled to Crseih Research Station in pursuit of healing for a sick groupmate."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Zeffliffl were a species that looked like a lump of dark green or blue-black seaweed. Several individuals existed together in close groups, such that to outsiders they appeared as a single multi-humped stack. The relationship between groupmates was so strong that any outsiders that tried to join it were automatically rejected in a subconscious manner analogous to an allergic reaction. In their natural environment, the leaf-like beings lived immersed in salt water so that when they traveled off-world, they carried sacks of salt water with them, which they periodically sprayed over themselves in order to maintain hydration. Their language sounded like leaves swirled through water. The species also was as intelligent as the average mammalian sentient."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Zeffliffl evolved on the planet of Zeffliffl, the fourth body orbiting Markbee's Star, located within the Atrivis sector of the Outer Rim Territories. They lived in the shallow, salt water seas surrounding the smaller southern continent of the planet."}, {"tag": "p", "text": "In 14 ABY, a group of Zeffliffl traveled to Crseih Station, an Imperial research station turned bazaar, on a mission to seek healing for an ailing member. The particular Zeffliffl was suffering from a disease, the symptoms of which included sickly yellow-green skin and leaves falling off. Crseih Station was home to the Waru, an extra-dimensional being that gained a reputation as a healer. Waru encased the sick member in a golder ichor that solidified and then exploded; the ill Zeffliffl was completely healed and was received back into its group. Present at the healing was the infamous smuggler Han Solo who disputed the veracity of the healing; however, it proved to be genuine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Zeffliffl were created in 1994 by Vonda N. McIntyre for her novel The Crystal Star. Their biological rejection of outsiders functioned to negate Han Solo's theories as to why the Waru was a sham. They were later mentioned in the video game Star Wars: Rebellion, which placed their world in the Atrivis sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}