{"url": "Zem_(miner)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Miners"], "nodes": [{"tag": "h1", "text": "Zem  (miner)"}, {"tag": "p", "text": "Zem was a Human male miner who worked on the planet Vanquo around the time of the Mandalorian Wars. Unconcerned by the Mandalorian threat nearing Vanquo, Zem worked the night shift at his outpost's comm system. In 3964 BBY, the outpost was visited by a young refugee, whom Zem took pleasure in tormenting—unbeknownst to Zem, the \"refugee\" was actually fugitive Jedi Padawan Zayne Carrick, who was engineering a plot to clear the camp so that he and his friends could take their supplies. Carrick and his partner Jarael, through a fake emergency transmission and a timely Jedi mind trick, convinced Zem and the other miners that the Mandalorians were attacking Vanquo, prompting them to evacuate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Zem was, as of the year 3964 BBY, employed as a miner on the Outer Rim world of Vanquo. Zem worked at a mining outpost nestled within Vanquo's mountainous terrain, manning the settlement's communications system and often exchanging jests and pranks with a miner named Zava at a different outpost. By 3964 BBY, Vanquo had become part of the front lines of the Galactic Republic's nascent war with the Mandalorian warrior clans. Although the Mandalorians were not far away, their conquests sending a steady stream of refugees to seek shelter on Vanquo, Zem was completely unconcerned with the Mandalorian threat. One night, a miner caught a young man sneaking around the camp's food stores, bringing him into the main tent where Zem was seated at the comm system. Zem delighted in tormenting the stranger, who claimed to be a refugee from Suurja, before the night watch leader took pity on the refugee and offered him food."}, {"tag": "p", "text": "At that moment, Zem brought up an incoming holographic transmission, showing a woman purporting to be Jedi Master Q'Anilia in combat. \"Q'Anilia\" informed the miners that the Mandalorians were landing in force on the other side of the planet, and ordered all present to evacuate immediately. Zem immediately realized that the transmission was fake, as it did not come over the official Republic channel—however, the young refugee, in actuality fugitive former Jedi Padawan Zayne Carrick, used the Force to trick Zem into saying it was over the official channel, driving him into a panic over the supposed Mandalorian attack. Zem sounded the evacuation siren as several explosions rocked the area of the camp, fleeing with the rest of the miners in a shuttle. Although Carrick chased after the ship, Zem closed the door and shut the former Padawan out. In truth, Carrick had masterminded the whole affair. He; his Arkanian Offshoot friend Jarael, or \"Q'Anilia\"; and his other companions had orchestrated the fake attack in order to easily plunder the outpost of its supplies. However, shortly after their false Mandalorian invasion, the Mandalorians attacked Vanquo in earnest, eventually seizing the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A gruff man, Zem enjoyed being cruel to the refugees caught around his camp, seeing them as pests who would interfere with the business being run at the outpost. Although the Mandalorian threat loomed nearby, Zem was completely unconcerned, believing that the Republic and Mandalorians would continue their stalemate indefinitely. Easily bored while working the night shift, Zem often entertained himself by joking with other mining posts over the comm system. He was weak-willed enough to be affected by a Jedi mind trick, and was quick to panic when he believed that the Mandalorians were attacking. Zem had light skin, with brown eyes and hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zem made his first, and thus far only, appearance in Knights of the Old Republic 7, a comic written by John Jackson Miller and released in 2006. In the issue, Zem was illustrated by Dustin Weaver."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}