{"url": "Zeltros/Legends", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Galactic Republic planets", "Category:Inner Rim planets", "Category:Low-gravity planets", "Category:New Republic planets", "Category:Type I atmosphere planets", "Category:Waterworlds", "Category:Zeltron culture"], "nodes": [{"tag": "h1", "text": "Zeltros"}, {"tag": "p", "text": "Zeltros was a planet in the Inner Rim, and the homeworld of the Zeltron race. An opulent world, hedonism was the doctrine encouraged by the empathetic Zeltrons, and Zeltros was continuously in a state of never ending revelry. The Zeltron appreciation of beauty in its many forms led to luxurious art and architecture covering the world, and the galaxy's most wealthy favored Zeltros as a vacation destination. Many who came to the planet were taken in by the celebratory atmosphere and the powerful pheromones of the Zeltron people to the point they found it difficult to leave, and even planetary invasions often floundered in the face of Zeltros' planet-wide festivities."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In accordance with that species' reputation, Zeltros was known as a luxury world, where many went to vacation, owing to the planet's abundance of pleasurable facilities ranging from amusement parks to theaters, night clubs, and much more. There was almost always a planet-wide party occurring, and even when it wasn't, the Zeltrons were looking for a reason to throw one. Like Naboo, it was ruled by an elective monarchy."}, {"tag": "p", "text": "The planet joined the Galactic Republic by 4000 BBY. Despite its famous atmosphere of leisure, Zeltros maintained a substantial defense force, although it lacked planetary shielding and was susceptible to orbital bombardments. The planet was invaded twelve times in six centuries before a battle in 4 ABY."}, {"tag": "p", "text": "During the Cold War between the Republic and the reconstituted Sith Empire, Zeltros was the site of a pazaak tournament that offered valuable and rare prices for the winner."}, {"tag": "p", "text": "The planet was never taken over by the Empire. To date, almost every invasion of Zeltros, save for a chain of three invasions shortly after the Battle of Endor, broke apart when the invaders made it planetside, the pheromones and party atmosphere overwhelming them."}, {"tag": "p", "text": "Of those three, the first was an invasion by the insectile Hiromi, who succeeded in taking over a large kitchen in the royal palace (arguably because the Zeltrons didn't notice, or didn't care), before being interrupted by a successful invasion by the nearly emotionless Nagai, who were interrupted by a third invasion of the Tofs, their natural enemies, resulting in the Nagai (and the Hiromi) allying with the others on Zeltros (including several notable Alliance and Imperial members) to drive the Tofs back, resulting in one of the largest parties in history, no mean feat by Zeltron standards."}, {"tag": "p", "text": "The planet was a member of the Alliance of Free Planets and also a New Republic stronghold during the Thrawn campaign."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Zeltros was attacked by the Yuuzhan Vong and the Ailon Nova Guard."}, {"tag": "p", "text": "During the Second Imperial Civil War, the scarcity of items caused the output of Hutt Queen Jool's illegal activities to skyrocket, allowing her to build the Paradise cantina on Zeltros. She noted that the Zeltrons were great partygoers and were very attractive, two things from which her business would profit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Many sources place Zeltros in the Inner Rim, but the Ultimate Alien Anthology and The New Essential Guide to Alien Species mistakenly place the planet in Wild Space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}