{"url": "Zenhai", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Republic Army personnel"], "nodes": [{"tag": "h1", "text": "Zenhai"}, {"tag": "p", "text": "Zenhai was a soldier in the Galactic Republic's army during the time of the Galactic War against the resurgent Sith Empire. In 3640 BBY, Zenhai was assigned to Sergeant Shanra Immel's squad and served with Republic Special Forces Division Colonel Jace Malcom in the battle of Kalandis Seven. During the course of the engagement, Zenhai and the rest of the squad were given orders to destroy the local spaceport and were ultimately successful in their mission."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zenhai served as a soldier in the Republic Army. In 3640 BBY, during the Galactic War between the Galactic Republic and the resurgent Sith Empire, Zenhai was assigned to Sergeant Shanra Immel's squad—along with Camur, Eron, Vaskus Kayle, Amden vor Keioidian, Min-Reva, and Yennir of the Green—and fought alongside SpecForce Colonel Jace Malcom on the desolate Inner Rim planet Kalandis Seven. During the battle, Zenhai and the squad were tasked with the destruction of a local Imperial-controlled spaceport. On the way to the spaceport, Zenhai and the squad were attacked, and Corporal Keioidian was fatally wounded. Immel activated Keioidian's med tracer before ordering the squad to move out and leave Keioidian behind."}, {"tag": "p", "text": "Three hours later, Zenhai and the squad finally reached the spaceport and were ordered to check in with Immel before proceeding with the mission, while Malcom attempted to capture a Sith planetary command ship. Zenhai and the squad started planting targeting beacons, which would allow their starfighters to destroy the spaceport regardless of the planet's fog. Shortly after they finished planting the last of the beacons, the spaceport was eliminated, though Malcom failed to capture the command ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zenhai first appeared in Alexander Freed's short story, The Last Battle of Colonel Jace Malcom, which was published in Star Wars Insider 137 and released on October 23, 2012. In the story, which focuses on Malcom and Immel, Zenhai is one of the soldiers who reports in to Immel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}