{"url": "Bib_Fortuna/Legends", "categories": ["Category:Legends articles", "Category:B'omarr Monks", "Category:Criminals", "Category:Cyborgs", "Category:Desilijic servants", "Category:Majordomos", "Category:Males", "Category:Nar Shaddaa residents", "Category:Slavers", "Category:Tatooinians", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Bib Fortuna"}, {"tag": "p", "text": "Bib Fortuna was a male Twi'lek from Ryloth. Bib served as a majordomo to Jabba Desilijic Tiure for many years. Considering he served Jabba for decades, it is unsurprising that few in the galaxy hated the Hutt as much as he did—the Twi'lek majordomo had tried many times unsuccessfully to have Jabba killed. A member of the Una Clan, Bib Fortuna was friendly with many B'omarr monks in Jabba's Palace—when he died, his brain was forcibly removed from his body by the ancient religious order, and placed in a jar for the enlightenment process."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "At some point in the past, Bib Fortuna was found guilty of exporting Ryll and was cast out of Twi'lek society. He then tried to enter the corporation of Kuat Drive Yards, but his untrustworthiness had him expelled from the planet of Kuat and he had a period of other employments involving spice smuggling. The Hutt crime lord Jabba Desilijic Tiure found him and asked for his assistance smuggling for him. When it was evident he may be caught again, he asked for a bigger position in Jabba's businesses. He soon worked with Naroon Cuthus and Bidlo Kwerve."}, {"tag": "p", "text": "Fortuna attended the Boonta Eve Classic of 32 BBY with his employer, who hosted the event. He stood at Jabba's side through the Hutt's welcome to all the contestants and spectators who attended the event. He witnessed Anakin Skywalker win the race, securing the young boy's freedom from a life of slavery. At the conclusion of the race, he was forced to wake Jabba, who had fallen asleep sometime after the second lap."}, {"tag": "p", "text": "At some point, he returned to Ryloth seeking his revenge and ransacking seven cities, capturing most members and selling them into slavery for Jabba. While finding loot for himself he came across Nat Secura and his mother, who chastised him for his actions, cursing his name. The insult resulted in Fortuna executing her and taking Secura under his wing, though he was horribly scarred. Fortuna only took Secura as a way to take over Ryloth for himself in the future, using the good name of Clan Secura."}, {"tag": "p", "text": "It was noted that he preyed on other members of his society. He had captured and trained several dancers for Jabba the Hutt, one of whom was the Human Jess. After he was cast out, other Twi'leks began breaking his name into two distinct parts as a way of symbolizing that he was cast out. Fortuna was able to procure the rancor for his master's birthday, which was being transported from its home on Dathomir to an unknown destination but crashed on Tatooine. Jabba was so pleased with the gift he offered Fortuna and Bidlo Kwerve two choices of gift—the position of majordomo and some greater gift known to history. Fully knowing what Jabba intended, Fortuna accepted the role of majordomo, while Kwerve was fed to the rancor. Fortuna was able to secure the services of Malakili, a famous beast handler from the Circus Horrificus, to take care of the beast."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "In 21.95 BBY, one month into the galactic conflict known as the Clone Wars, one of Jabba's rivals, a Hutt named Boorka, began an alliance with the Confederacy of Independent Systems. Jabba sought to eliminate Boorka, and arranged a meeting with the Jedi Knight Echuu Shen-Jon, which Fortuna was present for."}, {"tag": "p", "text": "During the first year of the Clone Wars, the Confederacy of Independent Systems set up a secret mining facility on the ore-rich Valsedian asteroid belt, deep inside Hutt Space. It was there that the male Twi'lek worked, likely in a position of administrator. While the facility was very isolated, the Separatist operations there did not go unnoticed; Jabba learned about it, and suspected that it was sold to the Confederacy by his distant cousin, Torpo. This violated the terms of a treaty between the Hutts and the Galactic Republic, and Jabba informed the Republic of the situation, which led to a team of Jedi being sent to investigate the asteroid belt to ascertain the existence of the mining installation."}, {"tag": "p", "text": "The Twi'lek administrator was working with a datapad while walking near the entrance of the facility exactly at the time when Jedi Masters Obi-Wan Kenobi and Keelyvine Reus entered the base. Reus acted quickly, captured the flinched Twi'lek and used a mind trick on him, ordering him to take the Jedi to his master. However, the administrator revealed that his master was not anywhere near the asteroid belt. Before the interrogation could continue, Kenobi sensed that the team's padawan members, who had taken an alternate route inside the facility, were in danger and rushed to aid them. Reus bound the Twi'lek at the nearby tubes with stun cuffs, and questioned him more closely. She suspected that Torpo was the master of the administrator, and asked about the whereabouts of the Hutt. The Twi'lek confused the Jedi by stating that while his master was gone, Torpo was inside the facility. Before Reus could learn more, she was suddenly attacked by Confederacy assassin Asajj Ventress, who challenged her to a lightsaber duel. The pair engaged each other, leaving the still-bound Twi'lek behind."}, {"tag": "h3", "text": "In the service of Jabba"}, {"tag": "p", "text": "Five years before the Battle of Yavin, Fortuna recruited six of Jabba's lesser minions, including Nivek, to kill Jabba's guards and make him tell all of his secrets for him, even under torture. Unfortunately, shortly after they started putting the plan into action, Gru'um and Miramba unleashed a bunch of freckers, spoiling it. Fortuna and his co-conspirators managed to kill all the freckers, who during the struggle slew all but Fortuna. Later, Jabba thanked Fortuna for being loyal to him, being a hero and risking his life for Jabba. Fortuna couldn't kill Jabba, after this."}, {"tag": "p", "text": "Circa 1 ABY, Bib Fortuna recruited the Wayfar spies to watch for Romo Vax because he suspected the man of double-crossing Jabba's organization. Fortuna later ordered Vax's assassination when he discovered the man to be a Sennex spy. In the meantime, Bib Fortuna was associated with the White Thranta Shipping Company, a front for illegal activities of Jabba the Hutt's criminal organization."}, {"tag": "p", "text": "When an undercover ISB agent infiltrated Jabba's Palace by posing as a smuggler, it wasn't long before Fortuna approached him in the main hall and invited the agent to his personal office. There, he invited the \"smuggler\" to talk about his experience. However, the undercover identity was not good enough for someone as deep in the business as Fortuna. He soon realized that his collocutor was lying and ordered the guard to toss him to the rancor. The intruder, however, fought his way out and escaped."}, {"tag": "p", "text": "In 4 ABY Fortuna had procured the services of a dancer called Oola, a naïve Twi'lek girl who was partnered with another girl called Sienn'rha. The two were being taken to Jabba's palace by a thug called Jerris Rudd when they were intercepted by Luke Skywalker, who killed Rudd and freed Sienn, but Oola refused to go, wanting to see what life was like in the palace. Skywalker and Fortuna shared a brief conversation where Skywalker told Fortuna that his way of life was wrong and his depredations on his own people would only lead to ruin. He promised that the Rebel Alliance could protect Ryloth from the Empire, and for a moment, Fortuna strongly considered the young Jedi's words. But reality took a grip, and Fortuna dismissed Skywalker's offer. As Oola was willing to return to Jabba's palace with Fortuna, Skywalker let the two go."}, {"tag": "p", "text": "Bib Fortuna's role at the palace included receiving visitors. C-3PO and R2-D2 encountered Fortuna when they arrived with a gift for Jabba. Fortuna demanded they give the gift to him, but the droids insisted they were to present the gift to Jabba personally. Fortuna acquiesced and led them into the throne room, where R2-D2 played Jabba a message from Luke Skywalker. Skywalker requested that Jabba bargain for the body of Han Solo, encased in carbonite. Skywalker's gift was the two droids themselves. Jabba refused to bargain, but kept the droids."}, {"tag": "p", "text": "Soon after, Bib was seen in the company of Jess, a talented musician hoping to leave Jabba's palace by joining a band. She stroked his lekku and he reciprocated the gesture in leading her by the hand around the throne room. She was again seen in Bib's company when the dancing girl Oola was fed to the rancor. Bib later left the musician to slumber alone on Jabba's dais, as he lay in wait with his master, ready to spring the trap as Leia Organa, disguised as Boushh, released Han Solo from the carbonite."}, {"tag": "p", "text": "After the unsuccessful attempt by Princess Leia Organa to free Han Solo, Luke Skywalker came to the palace. Fortuna was given orders that he was not to be admitted. Jabba did not foresee, however, that his majordomo would be weak-minded enough to fall for his Jedi mind tricks. After Fortuna led Skywalker to Jabba, Jabba became furious at Fortuna and knocked him off his throne. When Skywalker defeated Jabba's rancor, he, Han Solo and Chewbacca were sentenced to be thrown into the Great Pit of Carkoon. Bib Fortuna accompanied Jabba the Hutt to the executions on his Sail Barge. The Jedi and his friends proved more than Jabba's forces could handle and as such, his Barge was destroyed."}, {"tag": "h3", "text": "After Jabba's death"}, {"tag": "p", "text": "As Jabba's sail barge exploded, Fortuna escaped on a private skiff and returned to the palace to take over. He fought a small battle over the remainder of Jabba's possessions, and was the apparent winner. However, soon the mysterious B'omarr monks who inhabited the cellars removed his brain from his body and placed it in a spider-droid walker, much as the monks themselves used."}, {"tag": "p", "text": "Six months after the events at Endor, a Twi'lek by the name of Firith Olan received Fortuna's messages that he'd been secretly sending and arrived on Tatooine to claim Jabba's treasures. Olan uncovered clues that an Imperial Agent by the name of Lirin Banolt knew of the final location of the missing Strike-class medium cruiser, the Eidolon. Olan knew that if he were to take possession of the ship, his personal power would increase greatly. However, the Eidolon was a fake—Sate Pestage had a fake built and destroyed it while in hyperspace. The real purpose of the Eidolon was a hidden base on Tatooine, which Pestage could escape to."}, {"tag": "p", "text": "Olan used Fortuna's computer skills to unlock the location of various weapons caches scattered over Tatooine and took control of at least 64 TIE Interceptors. Rogue Squadron had been tasked by Admiral Ackbar with investigating events on Tatooine and uncovered the plot while enjoying the hospitality of Huff Darklighter. By this time, the Imperials began poking around led by Marl Semtin and destroyed Olan's TIE's. Olan tried to hide on Ryloth from his enemies and tried to abandon Fortuna on the planet but he stowed away on Wedge Antilles' ship and returned to Tatooine."}, {"tag": "p", "text": "Marl Semtin was tasked with securing the Eidolon Base and capturing Olan—he planned to put Olan in charge of the base given his underworld connections. Rogue Squadron attacked Eidolon Base, Olan panicked and Semtin stabbed him. Olan fled the base but ran right into Fortuna outside who took the wounded Twi'lek back to Jabba's Palace. He somehow convinced the monks to place his brain in the body of Olan, using the same techniques that got him in the walker in the first place. Then with Olan's resources at his disposal along with the credits he embezzled from Jabba over the years, Fortuna began rebuilding Jabba's criminal empire, and continued on in the criminal underworld."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bib Fortuna was a tall, white-skinned Twi'lek with two fat lekku—tentacular appendages that grew out of the back of his head—which he wore often draped over his shoulders for decorative effect. His visage displayed a high bony crest, a knobby brow, bright red eyes, and a fanged mouth. The front of the neck displayed a large goiter, like many other male Twi'lek—including the ancient Sith Lord Kopecz, the Imperial Dark Jedi Boc Aseca and the Rebel X-wing pilot Nawara Ven. According to Twi'lek standards, Fortuna was considered \"darkly elegant\" and attractive, notably due to his thick lekku."}, {"tag": "p", "text": "He often wore traditional black robes made from Jalavash worm silk, which accentuated his natural paleness, along with half-gloves and studded slaver wristbands. A pair of soft-soled shoes allowed the Twi'lek to walk down the corridors of Jabba's palace as silently as a wraith. He also kept a poisoned dagger concealed in the folds of his robes. In addition to his native Rylothean, Bib Fortuna also spoke Huttese, and he could at least understand Galactic Basic Standard, the \"common tongue\" of the civilized galaxy."}, {"tag": "p", "text": "When he became Jabba's majordomo, Fortuna grew even more power-hungry. He came to believe he would acquire the wealth and influence necessary to conquer Ryloth and mold his fellow Twi'leks into the kinds of subjects the Empire valued—spies, bounty hunters and mercenaries. By saving his race from \"exotic slavery,\" Bib Fortuna hoped he would bring back honor to his name and that of his ancestors."}, {"tag": "p", "text": "Fortuna had been among the first to attract the attention of the Empire to Ryloth by selling ryll spice off-world. While he had thought the Twi'leks would adapt to life in the wider Empire, they did not. His own people had come to hate him utterly, but he still wished to bring them out of the horrors of slavery. He also performed a ritual of where he listed to himself each of the day's annoyances he had experienced every night before he slept."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Return of the Jedi, Bib Fortuna was played by Michael Carter and voiced uncredited by the late Erik Bauersfeld, who also voiced Admiral Ackbar in the film. For The Phantom Menace, Alan Ruscoe was initially cast to play the character in a scene in the Senate, but this scene was cut. He was later portrayed by Matthew Wood for his appearance on Tatooine."}, {"tag": "p", "text": "Bib Fortuna actor Michael Carter, via an interview on TheForce.Net, has alluded to several cut scenes from Return of the Jedi that involved Jess and Salacious B. Crumb. Some of these scenes appear in \"Lapti Nek\": The Music Video from Jabba's Palace."}, {"tag": "p", "text": "During several scenes in Return of the Jedi, Bib Fortuna can be heard speaking something which can be interpreted as a twisted form of English, suggesting that he spoke a heavy dialect of Galactic Basic."}, {"tag": "p", "text": "In earlier drafts of Return of the Jedi, Fortuna's title was the High Beeser of Hoth."}, {"tag": "p", "text": "Bib Fortuna's first words in Return of the Jedi, \"Die wanna wanga,\" are frequently quoted by underworld characters in Star Wars video games, most notably in Jedi Outcast and Jedi Academy. It is also said by Gragra to Jar Jar Binks in The Phantom Menace."}, {"tag": "p", "text": "\"Best Birthday Ever\" says that his full name is Bib Oltwaxt Fortuna."}, {"tag": "p", "text": "In the webcomic The Clone Wars: The Valsedian Operation, a Twi'lek administrator was seen that resembled Bib Fortuna, although he was not identified. Tom Hodges later confirmed that the administrator was indeed intended to be Bib Fortuna."}, {"tag": "h3", "text": "LEGO Star Wars"}, {"tag": "p", "text": "Fortuna has made several appearances in LEGO Star Wars media, including LEGO Star Wars: The Empire Strikes Out, in which he attempts to sell R2-D2 and C-3PO cell phones, and LEGO Star Wars: The Padawan Menace. His most significant appearance is in The Phantom Clone, an episode of LEGO Star Wars: The Yoda Chronicles, in which he is confronted and insulted by a reluctant C-3PO, encouraged by a group of Padawans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Ambiguously canon appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "LEGO Star Wars: The Empire Strikes Out"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}