{"url": "Zephata%27ru%27tor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Duinuogwuin", "Category:Individuals of unspecified gender", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Zephata'ru'tor"}, {"tag": "p", "text": "Zephata'ru'tor was a Duinuogwuin Padawan apprenticed to Jedi Master B'dard Tone during the waning years of the Galactic Republic. The Duinuogwuin and Tone served the Republic during the Clone Wars against the Confederacy of Independent Systems, but Zephata'ru'tor was killed by the cyborg General Grievous during a battle over the planet Nadiem in 21.6 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Duinuogwuin, a flying dragon species that measured up to 100 meters long and possessed the ability to breathe fire and survive in vacuum, Zephata'ru'tor was accepted into the Jedi Order and taken as a Padawan learner by the Coway Jedi Master B'dard Tone in the years leading up to the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems."}, {"tag": "p", "text": "In 21.6 BBY, five months after the beginning of the Clone Wars on the planet Geonosis, Master and Padawan served in a battle on the planet Nadiem. When General Grievous, the cyborg commander of the Separatist Droid Army, fled from the battlefield after the Republic triumphed, Tone attempted to stop the notorious Jedi–killer but was badly wounded by Grievous. Zephata'ru'tor also tried to hinder the general from escaping in his Belbullab-22 starfighter, but Grievous killed the Duinuogwuin in space over Nadiem."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zephata'ru'tor was first mentioned, although only as Tone's Padawan, in General Grievous 1, a comic written by Chuck Dixon and published on March 16, 2005. Abel G. Peña gave the Padawan the name Zephata'ru'tor in Unknown Soldier: The Story of General Grievous, a 2006 article published in Star Wars Insider 86. In 2008, the character received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}