{"url": "Zero_Hour", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Zero Hour"}, {"tag": "p", "text": "\"Zero Hour\" is the finale of the third season of the animated television series Star Wars Rebels. The special 2 episode one-hour event premiered on March 25, 2017 on Disney XD and was comprised of the twenty-first and twenty-second episodes of the season. It is also the fifty-eighth and fifty-ninth episodes of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "While the rebels plot to attack the Imperial stronghold on Lothal, Grand Admiral Thrawn discovers the location of their secret base, leading to an epic clash."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Part One"}, {"tag": "h4", "text": "Thrawn's grand strategy"}, {"tag": "p", "text": "The episode opens with Grand Admiral Thrawn's Sentinel-class landing craft arriving at the Imperial headquarters on Lothal. The shuttle is greeted by Governor Arihnda Pryce and Admiral Kassius Konstantine. Thrawn disembarks from the shuttle flanked by two Death troopers, and he tells Governor Pryce that he brings urgent news. Unbeknownst to them, they are being watched from above by Agent Kallus, who is the rebel operative known as Fulcrum."}, {"tag": "p", "text": "Thrawn and the Imperials walk out of the hangar, and Kallus uses a mouse droid to spy on their conversation. Inside an office, Thrawn closes the blinds. When Admiral Konstantine asks him about the necessity of these precautions, Thrawn warns Konstantine and Pryce that they still have a traitor in their midst. Thrawn tells them that what he is going to reveal cannot fall into Rebel hands. Grand Moff Wilhuff Tarkin joins the meeting via hologram, stating that whatever Thrawn has to tell him had better be worth the wait. Kallus' mouse droid is inside the ventilation duct, transmitting the conversation to him."}, {"tag": "p", "text": "He informs Tarkin that the Rebels of the Phoenix Cell are planning to launch an attack. Tarkin initially does not believe him, but Thrawn counters that everything leading up to this moment has been rehearsal and that the real performance is about to begin. When Tarkin asks Thrawn about what the Rebels are going to attack, Thrawn responds that the Rebels are planning to attack the TIE Defender factory on Lothal. Thrawn's spies have reported that General Jan Dodonna's fleet is en route to reinforce Commander Jun Sato and Captain Hera Syndulla's forces. Kallus, eavesdropping, is surprised by the news that the rebels plan to attack Lothal."}, {"tag": "p", "text": "When Tarkin asks where the Rebel fleet is massing, Thrawn replies that he has not yet uncovered their location. Governor Pryce states that a coordinated attack by multiple Rebel cells is unprecedented. Thrawn replies that he has been waiting for this moment to wipe out the Rebellion. Kallus, listening, is horrified. Tarkin orders Thrawn to capture the Rebel leadership. When Thrawn responds that it may not be possible to take prisoners in the kind of battle he has planned, Tarkin states that he is confident an officer of Thrawn's caliber can pull it off, as he wants the Rebel commanders captured so they can be made examples of. Kallus prepares to leave."}, {"tag": "h4", "text": "Mustering the rebels"}, {"tag": "p", "text": "At Chopper Base, Ezra Bridger marvels at Hera Syndulla's success in rallying the Rebel forces for a strike on Lothal. Ezra thanks Kanan Jarrus, Garazeb Orrelios, Sabine Wren and, reluctantly, Chopper. However, Kanan thinks that the full credit goes to Ezra. He says that he and Hera recognized that there was something special about Ezra, and admits there were times that he could not teach Ezra everything. However, Ezra responds that he thinks his master did the best he could. When Kanan expresses doubt that he can teach Ezra anymore due to his limited Jedi training, Ezra reassures Kanan that his master taught him about life and how to be a better person."}, {"tag": "p", "text": "Hera then informs Ezra and Kanan of the impending arrival of General Dodonna and the Massassi Group. Ezra notes that that name sounds familiar, and Kanan reminds him that Dodonna got the Y-wings they stole on Reklam Station. General Dodonna is the leader of one of the largest Rebel cells Kanan knows of, and Kanan thinks he will be helpful in taking out the Imperial factories on Lothal. Above the planet Atollon, Commander Sato is on the bridge of the Phoenix Nest when General Dodonna's fleet of EF76 Nebulon-B escort frigates and CR90 corvettes exits hyperspace. Sato contacts Dodonna's flagship Vanguard, welcoming him to Atollon. General Dodonna intends to deal a blow to the Empire and show the galaxy what the Rebellion is capable of."}, {"tag": "h4", "text": "Unmasking Fulcrum"}, {"tag": "p", "text": "Meanwhile on Lothal, Kallus rides a speeder bike to the tower that once served as the home of Ezra Bridger. Inside, Kallus switches on a transmitter which projects an image of Fulcrum's symbol. Kallus tries to send an urgent message, but finds that his signals are being jammed. Thrawn startles Kallus with the code phrase \"by the light of Lothal's moons\", and asks Kallus if he would prefer to be called \"Fulcrum\" instead. Displaying a jammer, Thrawn tells Kallus that his Rebel friends won't be receiving his warning."}, {"tag": "p", "text": "Kallus charges at Thrawn, but the Grand Admiral punches him. Following a fistfight, Thrawn throws Kallus to the floor. Thrawn compliments Kallus on his fighting technique, but adds that he is familiar with the limitations of Imperial Academy training. Kallus flings a stormtrooper helmet at Thrawn, and the Grand Admiral catches it, distracting him long enough for Kallus to knock Thrawn to the ground and stomp on his jammer, growling that the Grand Admiral talks too much. Following a second round, Thrawn kicks him out onto the balcony, where Kallus is arrested by two Death troopers. Thrawn remarks that Kallus has the heart of a Rebel, and Kallus responds that he'll take that as a compliment. The Death troopers drag Kallus inside the tower."}, {"tag": "p", "text": "Back inside the tower, Thrawn tells Kallus, suspended by a pair of binders from a ceiling beam, that his transmission to the rebels has given him the last piece of the puzzle. Thrawn shows a holographic chart displaying the trajectory of General Dodonna's fleet and the trajectory of Kallus' Fulcrum transmission. Taken separately, Thrawn remarks that they mean nothing. Kallus tries to interject by claiming that there is no planet there, and that the rebels are smarter than Thrawn gives them credit for."}, {"tag": "p", "text": "Thrawn chides Kallus for not studying art, because there is much it can show you if you know where to look. While the Atollon system does not appear on any Imperial charts, Thrawn points out that it appears in the art of the ancient people of the Lothal sector. Thrawn identifies Atollon as the home of the rebel base, and orders Admiral Konstantine to deploy the fleet to those coordinates. He promises that he and Kallus will join them later."}, {"tag": "h4", "text": "Rebel base discovered"}, {"tag": "p", "text": "At Chopper Base, Hera informs Ezra, Kanan, Ryder Azadi, Commander Sato and General Dodonna via hologram that they have received an urgent transmission from Fulcrum. The rebels receive Fulcrum's warning that \"Thrawn knows about-\" before the transmission cuts off. When Kanan asks what this means, Ezra suggests that the Grand Admiral knows about the upcoming attack on Lothal. Ryder reports that most of the Imperial fleet has left the Lothal system. Hera realizes that Thrawn knows they are on Atollon, and orders all ships to assume battle stations."}, {"tag": "p", "text": "When General Dodonna asks how they can be certain, Ezra reveals that the last time this happened the Empire ambushed them on Garel. Meanwhile, one of Commander Sato's crew reports that five Imperial Star Destroyers have entered the Atollon system. Commander Sato orders the Phoenix fleet to assume Defense Formation Aurek One. Sato warns them to alert Rebel Command, just as Ryder's hologram vanishes. When Ezra notices Ryder's abrupt exit, Hera realizes that the Empire is jamming their long-range transmissions."}, {"tag": "p", "text": "Dodonna tells them to abort the mission, while Hera orders an evacuation of all ground staff and issues a Code K-one-zero alert. General Dodonna orders the fleet to jump into hyperspace and regroup at rally point Nova. When Commander Sato protests that they still have people on the surface, Dodonna replies that the Empire will cut them to pieces if they wait. Sato allows Dodonna's fleet to depart first, offering to cover them. Dodonna orders the other frigates to jump into hyperspace, but when one tries it is suddenly torn out of hyperspace. To the rebels' horror, it is revealed the Empire has brought Interdictor vessels to the fight. Sato quickly realizes that the rebels are trapped."}, {"tag": "h4", "text": "Thrawn's arrival"}, {"tag": "p", "text": "Meanwhile, a crew member aboard the interdictor cruiser informs Admiral Konstantine that the gravity wells are engaged. Konstantine then orders the forward batteries to fire, destroying the Nebulon-B frigate that attempted to jump into hyperspace just as Thrawn exits hyperspace aboard his command ship, the Chimaera. When Governor Pryce asks Thrawn about Tarkin's order to capture prisoners, Thrawn points out that General Dodonna is a courageous man, and wouldn't have been on the first vessel to flee. Thus, he reasons that the ship's crew are irrelevant. A captive Kallus is also present, restrained by two Death troopers."}, {"tag": "p", "text": "Thrawn then contacts the rebel commanders via hologram, telling them that the rebels are badly outnumbered, and that the Rebellion ends today. Hera vows that they will never surrender, but Thrawn coolly counters that he is not accepting surrenders at this time. Thrawn tells them that he wants them to know failure, utter defeat crashing down upon them, and that he is the one responsible, before signing off."}, {"tag": "h4", "text": "Hera's strategy"}, {"tag": "p", "text": "Studying the holographic battle order, Hera realizes that they are outnumbered, but vows to get the rebel fleet to safety. When Commander Sato asks how they should break the blockade, Hera replies that Thrawn believes that this is the entire Rebel fleet. Thus, she reasons that they need to make an opening big enough to get one ship through. Once the ship gets pass the Imperial jamming field, Hera states that they can call for reinforcements to attack the Imperial flanks."}, {"tag": "p", "text": "Dodonna welcomes Hera's plan, since it will allow them to divide the Imperial forces and escape. Sato thinks that the Ghost has the best chance, and vows to clear an opening for them. Hera doesn't plan to leave, and tells Ezra and Kanan to take the late Darth Maul's Gauntlet starfighter into hyperspace. Ezra and Kanan insist on staying, but Hera counters that the two Jedi have the best chance of success in escaping and getting help. Hera orders Chopper to accompany the Jedi. Before they can leave, Kanan tells Hera that he first has to warn someone in the wilderness. Hera refuses at first, but Kanan convinces her to trust him. Ezra is dubious that it is a good idea for Kanan to go warn their friend in the wilderness, and Kanan responds that he's a persuasive guy. When Hera asks who they are talking about, Kanan tells her she wouldn't believe him if he told her. Hera reluctantly assigns Ezra the mission, and Kanan wishes his Padawan good luck. Ezra wishes that the Force will be with himself."}, {"tag": "h4", "text": "The opening round"}, {"tag": "p", "text": "Meanwhile, Zeb asks Rex if he has any regrets about joining the rebellion. Rex responds that it is better than slinging joopas, despite liking the taste. The Ghost departs Chopper Base with the Gauntlet starfighter. In space, Commander Sato orders Phoenix Nest to launch its complement of A-wing and Y-wing starfighters against the Imperial fleet. He tells the fleet to assume spearhead formation, and orders the frigates and corvettes to protect the transports. Dodonna confirms that he is carrying out Sato's orders."}, {"tag": "p", "text": "Aboard the Chimaera, Thrawn realizes that Sato is deploying a Danaan strategy, something which he expects from the best commander to ever come out of the Mykapo system. Thrawn orders his fleet to reinforce the center and deploy their TIE fighters into the fray. He then orders Admiral Konstantine, via hologram, to keep his interdictor cruiser back until Thrawn orders otherwise. When Konstantine questions Thrawn's decision not to attack with overwhelming force, Thrawn counters that he has studied the rebels' penchant for defying convention and doing the unexpected. Thrawn adds that they will be prepared for as long as Konstantine does exactly as he is told."}, {"tag": "p", "text": "When Kallus tries to mock Thrawn for fighting over glory with Konstantine, the Grand Admiral counters that he is only interested in getting results for his Emperor. Meanwhile, the Ghost and the Gauntlet travel with the A-wings of Green Squadron. Hera orders the A-wings to keep the fighters busy and to clear a path for the Gauntlet. Wedge Antilles, flying an A-wing, confirms the orders. During the ensuing dogfight, Rex mans the Ghost's top turret."}, {"tag": "p", "text": "The Y-wings manage to bomb a Star Destroyer with proton bombs. Green Squadron dives in for a second sortie, but the rebel fighters are taken out by TIE fighters. Ezra and Chopper, traveling in the Gauntlet, see a CR90 corvette go up in flames in front of them. Seeing the rebel losses, Ezra hopes that Kanan is having better luck."}, {"tag": "h4", "text": "Meeting with Bendu"}, {"tag": "p", "text": "Meanwhile, Kanan rides his speeder bike past several large rocks to the krykna nest that is the haunt of his friend Bendu. The Bendu is angry with Kanan for bringing war to his quiet world, declaring that he will have no part in it. Kanan pleads with Bendu, but he counters that he is the one in the middle and takes no sides. When Kanan asks if he is leaving them to die and warns that the Empire will kill him, Bendu replies that he is beyond Kanan's worrying and wars. He responds that he is \"unseen, unknowable like a rock in the river.\""}, {"tag": "p", "text": "When Bendu suggests that there was a reason why this world was so difficult for the rebels to find, Kanan responds that maybe they were meant to find Atollon and him. Bendu questions for what purpose, and points out that he predates Kanan and will still be here long afterwards. Kanan tries to reason with Bendu by telling him that he once tried to be in the middle and to ignore the galaxy, but eventually realized that he could not turn a blind eye to innocents being harmed around him. Kanan argues that some things are worth fighting for."}, {"tag": "h4", "text": "Breaking Thrawn's blockade"}, {"tag": "p", "text": "Back in space, Hera tells her starfighters to keep the TIEs off their cruisers. Hera then hears that General Dodonna's Massassi group needs help, and heads to aid them. Zeb growls that there are too many ships to protect, just as two Rebel cruisers explode nearby. Thrawn's TIE fighters are inflicting serious damage and the red-painted P2 Sphyrna-class Hammerhead corvette is their next victim. In desperation, Commander Sato orders all ships to charge the blockade. During the charge, another Nebulon-B frigate is destroyed, the Vanguard is hammered by TIEs and a Dornean gunship goes up in flames. Dodonna watches the carnage with stunned horror, while Sato learns about the destruction of the Orion."}, {"tag": "p", "text": "Meanwhile, Thrawn orders his capital ships to hold their position, so that the rebel cruisers have to come to them. Aboard the Gauntlet, Chopper jabbers to Ezra that the Imperials are cutting them off. Another CR90 corvette goes up in flames, while a stricken Y-wing is shot down before it can crash into a Star Destroyer's hull. Ezra tells Hera that he can't get through as long as the interdictor cruiser is cutting them off. As Sato listens over the com, Hera tells Ezra to stay sharp and vows to find an opening."}, {"tag": "h4", "text": "Sato's sacrifice and Konstantine's folly"}, {"tag": "p", "text": "Ezra tells them to hurry up, as Sato watches yet another CR90 corvette explode. Sato, coming to a decision, orders Commander Bridger to go to heading 221 and prepare to jump. He then orders his crew to abandon ship and head for Atollon. The two pilots tell Sato they are staying, and he orders them to man their stations. The Phoenix Nest then flies towards the Imperial fleet. Zeb tells Hera that Sato is evacuating the carrier."}, {"tag": "p", "text": "Meanwhile, Admiral Konstantine, watching the scenario unfold, sees the Rebel command ship breaking off and orders his interdictor to intercept it. When his subordinate points out that Grand Admiral Thrawn ordered them to stay in their position, Konstantine angrily repeats his order and shouts that he will not be denied the glory of this kill. Konstantine's interdictor cruiser breaks formation to intercept the Phoenix Nest. Thrawn orders Konstantine to return to his assigned coordinates immediately, but Konstantine retorts that he has had enough of the Grand Admiral's games."}, {"tag": "p", "text": "When Ezra asks Hera what Sato is doing, she responds that he is drawing the interdictor cruiser out of formation and tells Ezra to get ready to jump. Meanwhile, Konstantine orders his crew to engage the interdictor's gravity well projectors. Konstantine smirks as Phoenix Nest comes under Imperial fire. Sato then orders his pilots to change course and charge the interdictor. Konstantine, panicking, orders his interdictor to use evasive maneuvers, but it is too late: Sato closes his eyes just before the Phoenix Nest rams Konstantine's interdictor, destroying both ships."}, {"tag": "p", "text": "Hera and Thrawn watch as the two ships go up in flames. Kallus also watches, with a mixture of shock and admiration at Commander Sato's sacrifice. At Hera's command, Ezra takes the Gauntlet into hyperspace. When one of Thrawn's crew reports that a rebel ship has escaped, Thrawn hopes that Konstantine's folly has not undermined his efforts. Thrawn orders his forces to press on with the attack, and to force the remaining rebels to the ground."}, {"tag": "h4", "text": "Rebel retreat"}, {"tag": "p", "text": "TIEs destroy General Dodonna's frigate Vanguard, and as its escape pods are launched Hera orders all remaining rebel forces to return to Chopper Base. A triumphant Thrawn and defiant Kallus watch the rebel retreat. Back on Atollon, Kanan continues to reason with Bendu by telling him that his friends are dying. When Bendu replies that all things are fated to die, Kanan responds \"not like this, crushed by overwhelming evil.\" Kanan pleads with Bendu to fight, but the Bendu is adamant about not fighting what he sees as petty battles. When Kanan accuses the Bendu of cowardice, he enters into a rage and summons a storm. Before disappearing, he remarks that perhaps it is the will of the Force that all Jedi perish, and that he carries out the will of the Force. Kanan is left alone."}, {"tag": "p", "text": "Meanwhile in hyperspace, Ezra petitions Mon Mothma to send reinforcements. However, Mothma is unable to send reinforcements because she fears that doing so would play into Thrawn's hands and wipe out all that they had worked to build. Ezra sighs that Thrawn planned all of this. Mothma admits that Senator Bail Organa was right: it is still too soon for open warfare with the Empire. She promises to negotiate fair treatment for the prisoners. Ezra counters that Thrawn may not take prisoners. Mothma compliments Ezra for his courage, and wishes that the Force may be with him. When Chopper suggests going back, Ezra insists that they are going to find help, from Sabine Wren."}, {"tag": "h3", "text": "Part Two"}, {"tag": "h4", "text": "Bombarding Chopper Base"}, {"tag": "p", "text": "Back at Chopper Base, Hera studies a holographic projection of Thrawn's fleet and deduces that the Grand Admiral is preparing for orbital bombardment. Zeb and Rex, manning Sabine's modified deflector shield generator, tell Hera they're preparing to fire it up. Rex is worried that the device will overload, commenting that they never got to test it while Sabine was still around. Hera says they can only hope that doesn't happen, but is confident that since it is Sabine's work, it will work just fine. At Hera's orders, Zeb fires up the prototype shield generator, which forms a shield that envelops Chopper Base. Zeb and Rex are relieved that the device works."}, {"tag": "p", "text": "Hera contacts Kanan, who is traveling back on his speeder bike to Chopper Base. She warns Kanan that Thrawn is preparing to launch an orbital bombardment, and when he tells her he's traveling as fast as he can, she asks him to please go a little faster. Hera vows to be ready to face Thrawn. In space, Governor Pryce informs Thrawn that their capital ships are in position and that the blockade is secured. When Thrawn asks about the rebel ships, she reports that the remaining vessels have fled back to the surface and are sheltering under a localized shield generator. Thrawn decides to test their mettle, commencing the orbital bombardment."}, {"tag": "p", "text": "The Chimaera and her sister ships unleash a hail of fire on Chopper Base. Hera tells Kanan to find cover, and his speeder narrowly dodges several turbolaser blasts. The Imperial bombardment begins to fry the shield generator, as Zeb and Rex try to keep it working. Kanan's speeder bike is destroyed by the bombardment, while Rex reports that the shields are overheating. Thrawn, Pryce and the captive Kallus watch the bombardment unfold. Hera looks desperate."}, {"tag": "p", "text": "Finally, Thrawn thinks the rebels have had enough, and orders the fleet to cease bombardment. Zeb and Rex begin cheering that the shield held up, and Hera responds that Thrawn was softening them up. Hera contacts Kanan, who opines that Thrawn is actually trying to kill them this time. Hera pleads for her love to come home. Outside, Kanan senses storm clouds gathering in the distance."}, {"tag": "h4", "text": "Mission to Krownest"}, {"tag": "p", "text": "Meanwhile, Ezra and Chopper arrive at the planet Krownest, flying into the atmosphere. Their ship is escorted by two Fang fighters, which give him permission to land at the Wren Stronghold. In the throne room, Ezra and Chopper are greeted by Sabine, Fenn Rau and Ursa Wren. Sabine asks Ezra why he's come here. Chopper tells Sabine they have escaped, and when Sabine asks what's happening, Ezra tells her that Thrawn ambushed them on Atollon."}, {"tag": "p", "text": "He pleads with Clan Wren to help. However, Rau tells Ezra that he's come at a bad time. Ursa informs the rebels that Clan Wren is locked in a civil war against Clan Saxon, which is backed by the Empire. Clan Wren's forces are stretched to the limit defending what ground they have. Ezra pleads with Ursa to hear him out, and she nods."}, {"tag": "h4", "text": "Rebel battle plans"}, {"tag": "p", "text": "Aboard the Chimaera, Thrawn assigns Governor Pryce command of the fleet while he leads the ground assault. Kallus laughs, and taunts Thrawn that he's been in that position before, and that these rebels know how to pull a victory from certain defeat. Thrawn counters that he and Kallus are not the same, as the rebels are about to learn. At the rebel command center, Zeb reports that their shield generator has taken a beating, doubting that it will withstand another assault. Hera believes that it won't have to, because Thrawn will send in ground forces to do his \"dirty work\"."}, {"tag": "p", "text": "Studying the battle plan, General Dodonna theorizes that Thrawn will launch an attack on the path through a narrow canyon. Rex advocates mining the approaches. Hera agrees to Rex and Dodonna's plan, and tasks Rex and Zeb with leading a squad to guard the pass. AP-5 then reports that scanners have picked up Imperial transports on the western quadrant. Hera realizes that Thrawn is launching his first wave."}, {"tag": "h4", "text": "Clan Wren's debt"}, {"tag": "p", "text": "Back on Krownest, the rebels and Clan Wren study a holographic projection of the Imperial fleet above Atollon. Sabine notes that the Rebels' big problem is that the Imperials have a second interdictor cruiser preventing the remaining Rebel ships from escaping. Rau opines that Ezra should count his losses and be fortunate to escape. Ezra retorts that his friends are trapped and that they need help. Tristan Wren apologizes that Clan Wren lacks the resources to help them since they can barely take care of their own."}, {"tag": "p", "text": "Ezra responds that he is ready to leave if the Mandalorians are unable to give assistance. Chopper beeps in agreement, and Ezra bids Sabine goodbye. Sabine insists on coming with Ezra. When Tristan points out that Ezra's mission is impossible, Sabine counters that she never imagined being reunited with her family and seeing Clan Wren free from Saxon's grip. Sabine adds that her friends make the impossible possible. She reasons that if Ezra thinks they can make a difference, she thinks they can win."}, {"tag": "p", "text": "Ursa adds that Bridger and his friends restored her daughter to her, which is a debt worth repaying. While Ursa can't leave Clan Wren undefended, she allows Sabine to take a few ships and any warriors willing to follow her. Sabine thanks her mother. When Rau states that they don't have much of an army, Sabine has Chopper bring up a holographic display of the second interdictor cruiser, and points out that they don't need an army."}, {"tag": "h4", "text": "The ground assault"}, {"tag": "p", "text": "Back on Atollon, Zeb and Rex wait in the pass for Thrawn's ground forces. Zeb hopes that Rex's plan will work, and Rex agrees. Using their macrobinoculars, Rex and Zeb spot a column of AT-DP walkers. Rex sets off detonators which destroy five of the walkers, saving the last one for Zeb, who destroys it with a rocket launcher. Thrawn, studying the battle from his shuttle, states that the rebels have exposed their \"meager defenses\" and vows to crush them."}, {"tag": "p", "text": "Thrawn orders his snipers to target the enemy mines, and the heavy AT-AT walkers to advance. Zeb and Rex try to detonate the remaining explosives, but they are ineffective against the large walkers. Zeb remarks that they should get Sabine to invent a shield generator that you can't walk through. Rex responds that he hopes they'll survive to tell her, before they flee. The AT-ATs begin blasting the rebels just as the A-wings launch their attack. After clearing the mines, stormtroopers charge into the fray."}, {"tag": "p", "text": "In the air, Wedge tells Hobbie to follow him in his A-wing. However, Thrawn orders his air groups to clear the sky of that \"annoyance\". TIE fighters attack the rebel A-wings and drive them away. Meanwhile, Rex and Zeb play cat and mouse with an AT-AT. Kanan, arriving on foot, uses his lightsaber to slash through the two right legs of the walker, toppling it and crushing two approaching stormtroopers."}, {"tag": "p", "text": "Zeb is glad that Kanan could join them, saying that Hera said he is bringing help. Kanan admits that he's uncertain about that. The rebels head into a cave, and Kanan pauses at the entrance, listening to the approaching storm. Just after Kanan runs into the caves, Thrawn's shuttle lands outside. Thrawn and six Death troopers disembark, and stormtroopers advance into the cave. Thrawn orders the armored division to destroy any rebel ships attempting to flee Chopper Base and to debark all ground troops to storm the base. He also issues orders to capture any rebel officers if possible."}, {"tag": "p", "text": "Rebel troops exchange fire with Thrawn's stormtroopers, while Hera tells General Dodonna to prepare their remaining ships for takeoff. When Dodonna asks about the blockade, Hera responds that she is only leaving aboard the Ghost. Kanan, Rex and Zeb avoid Thrawn's Death troopers under the coral mesa."}, {"tag": "h4", "text": "Mandalorian reinforcements"}, {"tag": "p", "text": "Meanwhile, Ezra's Gauntlet ship and the Fang fighters exit hyperspace behind the Imperial fleet. Ezra tells Chopper to jam the Imperial transmissions, while Fenn Rau orders the Mandalorian fighters to engage Thrawn's ships. Aboard the Chimaera, Governor Pryce learns about the arrival of rebel reinforcements from a comms officer. She recognizes the Mandalorian ships as Sabine's forces and sends TIE fighters to intercept them. She also orders the capital ships to maneuver to reinforce the fighters."}, {"tag": "p", "text": "Amidst the dogfight, the Gauntlet approaches the interdictor cruiser, and Ezra tells Chopper to contact Hera. Meanwhile, Kanan, Zeb and Rex arrive just as Thrawn's walkers begin destroying Chopper Base. When Hera asks about his friend, Kanan tells her not to worry because he thinks Bendu will be coming. Ezra then contacts Hera to tell her that he has brought help and that they will take out the interdictor. Kanan thinks this may be their only chance, and orders the rebels to evacuate."}, {"tag": "p", "text": "Back in space, Ezra's Gauntlet starship is pursued by TIEs. He tries to contact Hera, but hears no response. Sabine tells Ezra to focus on their job while Hera gets the others out. Chopper sets a course for the interdictor cruiser. Using deployment racks, Ezra, Sabine, Tristan and several Mandalorian warriors jump on the interdictor's hull, Ezra wearing a spacesuit equipped with thrusters. Sabine orders the Mandalorians to blow up the gravity wells and to be ready to activate their jetpacks. Ezra complains that he doesn't have a jetpack, and Sabine notes that his spacesuit has small thrusters."}, {"tag": "p", "text": "Meanwhile, a comms officer informs Governor Pryce that the enemy has deployed a strike force onto the hull of the interdictor. A captive Kallus watches while Pryce orders her forces to repel the \"rabble\". The Mandalorians fire their blasters at the gravity wells, but the Empire sends Jumptroopers to cut them off."}, {"tag": "h4", "text": "The Bendu's storm"}, {"tag": "p", "text": "Kanan's orders are timely, as the shield generator explodes after being shot by stormtroopers. Kanan remarks to Hera that the family is back together again, and Hera hopes they can keep it that way. The rebels, along with General Dodonna and AP-5, head towards the airfield as other rebel ships begin taking off. A Hammerhead and a CR90 make it, but one of the AT-ATs shoots down a GR-75 medium transport, which crashes and burns. The rebels then find themselves surrounded by Thrawn's Death troopers. Thrawn confronts Hera, stating he will now accept her surrender. He threatens to execute her friends, beginning with the Jedi, if she doesn't. Kanan draws his lightsaber in response."}, {"tag": "p", "text": "Thrawn's troops form a circle around the Rebels as he reiterates his demand. Hera tells him that he already knows her answer as storm clouds envelop Chopper Base. Thrawn, noting Kanan's nervous reaction to the storm, asks Kanan if he's afraid of it, and the blind Jedi counters that he should also fear the storm. Just then, a bolt of lightning narrowly misses the Grand Admiral. Kanan tells everyone to hang onto something. When Thrawn asks what \"Jedi devilry\" this is, the Bendu's glowing eyes appear in the clouds and he announces his presence. When Zeb and Hera demand to know what that is and what's happening, Kanan replies that his friend has come. Bendu announces that he brings death, and destroys two AT-ATs with bolts of lightning. The Bendu also begins to destroy the coral mesa housing Chopper Base. Everyone, heedless of side, runs for cover."}, {"tag": "p", "text": "The Bendu tells the rebels and Thrawn to leave this place because he is the light, the dark, and the Bendu. He strikes one of Thrawn's death troopers with lightning. Kanan says that they had better do what the Bendu says, and the Rebels board the Ghost. The remaining Rebel ships take off. Bendu calls out to Kanan and strikes the Ghost with lightning. When Hera asks Kanan if this is his friend, he admits to making Bendu angry. Hera snaps that she can relate to that. The Bendu strikes down one of the Rebel A-wings as the convoy flees into space. Meanwhile, the Bendu tells Thrawn to leave, and the Grand Admiral orders his troops to concentrate their fire on the center of the storm. The AT-ATs begin firing at the two eyes in the clouds. The Bendu manages to strike down one of the walkers before falling out of the clouds."}, {"tag": "h4", "text": "Escaping the blockade"}, {"tag": "p", "text": "Back in space, Ezra, Sabine and the Mandalorians clash with Imperial Jumptroopers. Hera contacts Ezra and tells him they are heading for the blockade, asking if they have destroyed the interdictor yet. Ezra responds they are working on the situation, while Mandalorian Fang fighters destroy two TIEs trying to take out Ezra. Ezra and the Mandalorians succeed in blowing up the gravity wells, escaping aboard the Gauntlet before the interdictor cruiser explodes."}, {"tag": "p", "text": "Witnessing the cruiser's demise, Governer Pryce is livid. Kallus takes the opportunity to taunt her for making a mess of Thrawn's fleet. Enraged, Pryce orders her crew to throw Kallus out of the airlock. Two stormtroopers escort Kallus into a turbolift, and he smiles as the door closes. Meanwhile, Hera leads the remaining rebel ships towards the Imperial blockade. Ezra tells her that they took out the second interdictor, and to meet him at Point 87. The Ghost fights its way through the Imperial blockade."}, {"tag": "p", "text": "Aboard the Chimaera, the turbolift door opens to reveal Kallus taking off his binders, with his stormtrooper guards unconscious behind him. He then escapes aboard an escape pod. Kallus transmits his coordinates to the crew of the Ghost, and Hera sees his escape pod on her scope and picks it up. After rendezvousing with Ezra's ship, Hera orders the Rebel ships to follow her, and Wedge replies that he's got her back. The rebels break past the Imperial blockade while an unhappy Pryce watches. Kallus, Rex, and Dodonna join the Spectres at the helm of the Ghost as what remains of the rebel fleet jumps into hyperspace."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "Back on Atollon, Thrawn and his stormtroopers surround the fallen Bendu. When Thrawn asks Bendu what manner of creature he is, the enigmatic being replies that he is one beyond Thrawn's power to destroy. Thrawn disagrees, and the Bendu prophesies that he foresees Thrawn's defeat as \"many arms surrounding [him] in a cold embrace.\" Undaunted by this, Thrawn personally tries to end Bendu's life by shooting him with his blaster, but the powerful Force Wielder is quick enough to disappear before that can happen. Thrawn and his troops hear the Bendu's laughter echoing around them, unnerving the Grand Admiral."}, {"tag": "p", "text": "In space, the Ghost travels with the tattered rebel fleet, with their sum total being two Hammerheads, the CR90 corvette Liberator and a smattering of starfighters. Via hologram, Ursa apologizes for the rebels' losses, but Hera thanks Clan Wren for offering help in their time of need. Sabine tells Hera that she wants to return the favor because her mother needs their help. Hera allows Sabine to go, but apologizes that she has to get the survivors to Rebel Command on Yavin 4. As medics treat the wounded, Kallus thanks Kanan for taking him in. The Jedi returns the favor by thanking Kallus for risking everything, clapping him on the shoulder."}, {"tag": "p", "text": "In the cockpit, AP-5 recommends a second hyperspace jump before heading to Yavin. Rex suggests doing three if they want to cover their tracks, and Chopper beeps in agreement. Kanan heads to the nose gun, and thanks Ezra for helping Sabine to save the day. When Ezra points out that they lost everything, Kanan shows empathy, but adds that he has learned to see defeat differently. Kanan knows that there is a future where they are all free, but states that it is up to them to make it happen. The rebel fleet then jumps into hyperspace."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}