{"url": "Zgorth%27sth", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Intelligence members", "Category:Males", "Category:Mon Calamari", "Category:Task Force on Alliance Security personnel"], "nodes": [{"tag": "h1", "text": "Zgorth'sth"}, {"tag": "p", "text": "Zgorth'sth was a male Mon Calamari who served the Alliance to Restore the Republic as an agent within Alliance Intelligence during the Galactic Civil War. Formerly a field agent, he was promoted to head the Intentions branch, reporting directly to Chief of Intelligence General Vernan. Zgorth'sth's skills as an analyst helped the Alliance Fleet successfully defeat the Imperial Oplovis Sector Fleet in the Mantooine system when his study of requisition reports led him to believe that the Imperial fleet was intending to destroy the Alliance's army units on the planet Mantooine. Zgorth'sth subsequently served with the Task Force on Alliance Security, a unit dedicated to recording and evaluating potential threats to the Alliance. He edited many of the reports submitted by members of the Task Force, as well as recording his own entries, such as one on the Gand Lu'daal-ud, who had acquired encrypted Alliance Intelligence datafiles. Zgorth'sth continued his role as an intelligence agent when the Alliance transitioned to the New Republic, serving with the direct successor to the Task Force on Alliance Security, the Department of Threat Assessment. The Department continued to keep track of possible threats to the security of the New Republic, and one of Zgorth'sth's reports was circulated among high-ranking generals, admirals, and senators."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zgorth'sth, a male Mon Calamari, was born on the planet Mon Calamari in the Calamari sector of the Outer Rim Territories. During the Galactic Civil War, he joined the Alliance to Restore the Republic, serving in Alliance Intelligence as a field agent throughout the Outer Rim. Around 0 ABY, Zgorth'sth was promoted and assigned as the Senior Officer of Alliance Intelligence's Intentions branch. Holding the rank of commander, he reported to General Vernan, Chief of Alliance Intelligence, and had fifteen subordinates serving directly under him. Zgorth'sth's main task consisted of reviewing reports that his staff had marked as potentially important and deciding whether or not it was worth committing Alliance assets to investigate further."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Zgorth'sth was sifting through reports filed by his staff when one, from Captain Ioth in Analysis, Naval Supply, caught his eye. Ioth had filed a report noting that the Imperial Oplovis Sector Fleet's supply requisitions had jumped by 4.1 percent. Zgorth'sth remembered a report filed eight months previously stating that the Oplovis Fleet had been defeated by a line of battle from the Alliance Fleet. The admiral of the Oplovis Fleet was \"retired\" by Lord Darth Vader two months later. Zgorth'sth analyzed the data, supposing it would take an extra two months for the new admiral to take control of the fleet, and a further four months for shakedowns of the men and command structure. He predicted that Imperial Naval Command had gotten impatient and ordered the fleet into action, causing the new commander to requisition extra supplies. Although he realized that the evidence was flimsy at best, Zgorth'sth also thought it was good enough to file a report and assign assets to watch the Oplovis Fleet. His report resulted in Alliance probe droid D-127X being assigned to monitor the fleet at its base near Harrod's Planet."}, {"tag": "p", "text": "Almost five weeks after being deployed, D-127X reported that the Oplovis Fleet was on the move. Zgorth'sth relayed the information to General Vernan, who ordered him to notify Fleet Intelligence of the developments. Vernan believed that the Imperial fleet was heading to Mantooine in the Atrivis sector to wipe out Army elements of the Atrivis Sector Force. Based on travel times, Vernan believed that if Admiral Gial Ackbar, commander of the Alliance Fleet, could get ships to Mantooine first, then he would be able to surprise the Oplovis Fleet as they exited hyperspace. Zgorth'sth sent the intelligence to Fleet, and, three days later, a battle line of three Alliance cruisers defeated the Oplovis Fleet with minimal casualties."}, {"tag": "p", "text": "By 2 ABY, Zgorth'sth was assigned to the Task Force on Alliance Security—a unit of 342 beings who compiled information on major threats to the Rebel Alliance—while still serving as head of the Intentions branch. Zgorth'sth personally edited much of the material that the Task Force had accumulated. He submitted a SecuriDex file on Lu'daal-ud, a Gand Findsman affiliated with the bounty hunter organization known as the Granse Confederacy. Lu'daal-ud had previously collected the bounty on Alliance agent Patel Odfath, who had been carrying important datafiles at the time. Zgorth'sth believed that Lu'daal-ud had kept the files. Although the files were encrypted, the Mon Calamari was worried that several key Intelligence operations could be compromised if the Gand ever sold them to the Empire. Despite the difficulty of getting to Lu'daal-ud, Zgorth'sth seriously considered sending an independent team after him to retrieve the data, and was willing to consider petitions from suitable candidates. After learning that the Imperial-allied Hydrospeare Corporation—which produced military equipment for aquatic environments—was designing new war machines, Zgorth'sth believed that the Empire may have been planning an assault on his homeworld. However, he surmised that the levels of bureaucracy such a project would have to go through would stall the endeavor considerably, and he hoped that the Galactic Civil War would end before they had a chance to deploy the new weapons against Dac."}, {"tag": "p", "text": "Zgorth'sth continued to serve the Alliance, and its successor state, the New Republic, throughout the duration of the Galactic Civil War. Sometime after 10 ABY, Zgorth'sth had been promoted to captain and was assigned to the newly-formed Department of Threat Assessment, which had replaced the Alliance Task Force on Security. He authored a report on several possible threats to the New Republic, including the Ailon Nova Guard, Churhee's Riflemen, the First Sun Mobile Regiment, the Imperial Hammers Elite Armor Unit, the Laramus Base Irregulars, the Mantis Syndicate, the Mercenary Guild of Coyn, the Natori Association, the Ragnar Syndicate, the Scimitar assault wing, and the m'Yalfor'ac Order. The document offered analysis on the organizations in question, and recommendations for future dealings with them. The report was circulated to Admirals Ackbar and Hiram Drayson; Generals Carlist Rieekan, Airen Cracken, Crix Madine, and Wedge Antilles; and Senator Garm Bel Iblis. The report was also sent to three retired officers, General Jan Dodonna, Admiral Adar Tallon, and Marshal Pashna Starkiller."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zgorth'sth was a capable intelligence agent, equally adept at both field work and data analysis. He found field work to be rewarding and had a love of what he termed the \"cloak and dagger\" elements of the job. He accepted that, due to being Mon Calamari, he was more conspicuous in Imperial-controlled regions than other agents; however, he was fully aware that there were some planets in the Outer Rim where he would blend in unnoticed. Zgorth'sth was proficient at data analysis—able to make intuitive leaps with seemingly unrelated data to form a larger picture of Imperial movements—but he considered the job dull compared to his previous work."}, {"tag": "p", "text": "Considered to be too cheerful by his immediate superior, General Vernan, Zgorth'sth had a sense of humor and a deep, booming laugh. The two officers engaged in friendly banter that extended to light insults, and Vernan called Zgorth'sth by the nickname \"Ziggy.\" An efficient officer, he took care in composing reports so that his findings and intentions were clear and precise. Vernan thought of him as a fine officer and considered returning him to field work. Zgorth'sth enjoyed a cup of gav while working."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zgorth'sth was introduced in the first edition of the The Rebel Alliance Sourcebook, published by West End Games in 1990."}, {"tag": "p", "text": "Although the image of a Mon Calamari published in the Rebel Alliance Sourcebook was not explicitly stated to be Zgorth'sth, the positioning of the image within the narrative text detailing the character indicates that the image related to the text in question. The later revelation of Zgorth'sth's species in Alliance Intelligence Reports supports this supposition. This article assumes that the pictured Mon Calamari is intended to be Zgorth'sth."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}