{"url": "Zevulon_Veers", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic members", "Category:Commission for the Preservation of the New Order personnel", "Category:Humans", "Category:Imperial defectors", "Category:Males", "Category:New Republic Defense Fleet personnel"], "nodes": [{"tag": "h1", "text": "Zevulon Veers"}, {"tag": "p", "text": "Zevulon Veers, called Zev for short, was the eldest Human son of Imperial Army General Maximilian Veers and a defector to the Rebel Alliance. Veers lost his mother at a young age, causing him to be strictly raised as a loyal Imperial youth by his father. The young Veers soon grew distant from his father and began questioning the Empire's motives, viewing their practice of slavery against non-Humans as immoral. Veers soon joined a battalion of COMPNOR's Sub-Adult Group where he received low scores from a Political Reliability Observer. After passing junior officer training, Veers was forced by his father to join COMPNOR's elite CompForce unit. It was there that he came to his decision to defect. While Veers's superior officer, Ivo Laibach, was interrogating a captive suspected of working for the Rebellion, a Rebel task force assaulted the CompForcers and took Veers prisoner. After a short time, Veers defected to the Alliance."}, {"tag": "p", "text": "Veers found life as a Rebel liberating, no longer having to be forced down a path of Imperial service by his father. In 10 ABY, he participated in the Battle of Calamari where he served as a gunner aboard the New Republic Star Destroyer Emancipator. Veers managed to destroy the Super Star Destroyer Allegiance during the battle, but was forced to abandon ship with the rest of the crew after the Emancipator began disintegrating inside the molecular furnace of a World Devastator. He later took part in an attack on the Emperor's Citadel on the planet Byss, where he and a New Republic commando team stowed away aboard several X-1 Viper war droids bound for the planet. They launched their attack and made it to the front of the Citadel, but were fended off by a group of Emperor Palpatine's chrysalide beasts. Veers and the surviving members of the commando team were rescued by the smugglers Salla Zend and Shug Ninx, and were transported safely off-world."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Imperial service"}, {"tag": "p", "text": "Zevulon Veers was the eldest Human child of Maximilian Veers, an up and coming Imperial Army officer. Born into a life of power and prestige, Veers spent a joyful early childhood under Imperial rule in the care of his mother. Several years after his birth, Veers and his family went on a summer vacation where his mother contracted a rare, fatal disease, and passed away. Veers was then left in the care of his father, who buried his own pain by committing nearly all of his time to Imperial service, and raised the young Veers to honor his mother by becoming a loyal Imperial youth."}, {"tag": "p", "text": "As Veers matured, he began growing increasingly distant from his father and longed for the love of his mother. He attended the finest schools in the Empire and had everything he ever needed, but he soon began to ask questions regarding the nature of Imperial rule. He wondered why his tutors, who were far more intelligent than him, were slaves, and why friends of his father's who spoke out against Imperial policy kept disappearing. He continued asking these questions but received no answers from anyone, including his father. In the face of what he viewed as Imperial atrocities, such as slavery against non-Humans, Veers began to believe that much of what the Empire stood for was a lie."}, {"tag": "p", "text": "At his father's behest, Zevulon Veers reluctantly joined a local battalion of the Empire's Sub-Adult Group, the youth branch of COMPNOR. The idea of working to improve society appealed to Veers, but he did not get along with many of the other youths and saw no point to the constant marching and climbing while singing New Order anthems he was drilled to do. Veers was able to get through his adolescence without making any major mistakes during his time in the Sub-Adult Group, but his father was dismayed at the low marks he received from a Political Reliability Observer. He was given a lecture by his father on how his low marks and constant questions while at a field trip to a slave camp had the potential to jeopardize the general's career, causing Veers to keep his ideas to himself from then on. He made it through the next few years without repeating his previous mistakes, but his mistrust of the Empire only continued to grow."}, {"tag": "p", "text": "Veers eventually passed junior officer training with the hopes of being assigned a non-combat position, but his father wished to toughen the younger Veers and forced him to join CompForce, COMPNOR's military branch. Veers thought very little of CompForce and was growing tired of the constant drilling he was being forced to do. A few weeks after the Imperial victory at Hoth, in which his father played an important role, Veers and his father returned from a short leave and were both treated as military heroes. Alongside his father, Veers attended numerous celebrations and heard many speeches about the glory of the Empire and the coming defeat of the Rebel Alliance."}, {"tag": "h3", "text": "Defection and New Republic service"}, {"tag": "p", "text": "During a routine CompForce police operation several months before Emperor Palpatine's death at the Battle of Endor, Veers served as a bodyguard to his battalion commander, Ivo Laibach, who began interrogating prisoners suspected of working with the Rebel Alliance. Intending to harden the young CompForcers to the sight of torture, Laibach began beating and torturing an elderly librarian, much to Veers's horror. Simultaneously, a squad of Rebels led by the librarian's daughter launched an attack on the CompForce battalion and wounded Laibach. Veers, disgusted at what he had witnessed Laibach do to the librarian, freed the old man and healed him with a medpac just as the Rebel squad leader came to her father's rescue. She was initially distrustful of Veers but was convinced of his loyalty after hearing her father's testimony. Veers was nevertheless taken prisoner by the Rebels but was treated kindly by them."}, {"tag": "p", "text": "Veers soon defected to the Rebel Alliance and served its successor government, the New Republic. Upon learning of his son's fate, the elder Veers wished his son had actually died during the Rebel attack and tried to put the shame of his son's defection out of his mind. The younger Veers disowned his father but still hoped that his family would reject the Empire and that his father would understand his decision to defect. However, Veers never saw nor heard from his father again."}, {"tag": "p", "text": "In 10 ABY, Emperor Palpatine was resurrected in a clone body and launched an offensive against the New Republic. Zevulon Veers served as a gunner aboard the New Republic Star Destroyer Emancipator when Admiral Gial Ackbar ordered the Emancipator and its fleet to engage the Emperor's newest superweapons, the World Devastators, which were attacking the planet Calamari. The Emancipator, under the command of Generals Wedge Antilles and Lando Calrissian, intercepted an Imperial transmission originating above Calamari and planned to drop out of hyperspace close to the signal's source. Calrissian ordered Veers to fire all of the Star Destroyer's forward turbolasers and ion cannons at his command upon arriving above Calamari. Veers fired the Emancipator's weapons immediately after the fleet dropped out of hyperspace and was able to destroy the source of the Imperial transmission, the Super Star Destroyer Allegiance, while its deflector shields were down."}, {"tag": "p", "text": "During this battle, Veers was in direct conflict with his father. After squadrons of starfighters were sent from the Emancipator to combat the World Devastators on the surface of Calamari, one Devastator ascended to low orbit and engaged the Star Destroyer. Calrissian ordered Veers and the other gunners to fire all forward torpedoes at the Devastator, but the Emancipator was caught in one of its large furnaces and began disintegrating, prompting Calrissian to order all hands to abandon ship. The crew of the Emancipator fled aboard escape pods and were picked up by newly arrived New Republic rescue frigates."}, {"tag": "p", "text": "Sometime later, Veers and a large New Republic task force under the command of Antilles and Calrissian infiltrated a shipment of the Empire's X-1 Viper Automadon war droids aboard the Imperial Star Hauler Reliance. En route to the Imperial fortress world Byss, the New Republic commando team intended to launch an attack on the Emperor's Citadel using the war droids. Calrissian was concerned that the war droids would be difficult to control once their battle programming was activated, but Veers assured him that they had manual override in case anything went wrong. Once the war droids were unloaded onto Byss's Imperial Freight Complex, Veers and the New Republic team activated them and began heading for the Emperor's Citadel. Veers, piloting one of the war droids, came under heavy fire from Imperial forces and, after encountering and defeating Imperial gunships, was able to make it through the city to the Emperor's Citadel with the rest of the team."}, {"tag": "p", "text": "Veers and the commandos came across a service bridge leading to the front of the Citadel. While under continued fire from Imperial forces, Veers and Antilles evacuated the war droids as they pressed their attack on the Citadel. At the same time, Palpatine ordered the release of his Chrysalide beasts in an attempt to combat the war droids. Veers and Antilles fled and took cover upon witnessing the beasts and allowed the war droids to fight them. The Chrysalide beasts continued their assault until every war droid was destroyed and began going after the New Republic ground team. An exhausted Veers continued to fall back with Antilles as the beasts advanced their approach, until the smugglers Salla Zend and Shug Ninx, in control of the freighter Starhook Ten, disabled an attacking beast with an ion blast and rescued Veers and Antilles. Veers, injured from the battle, struggled to board the vessel. Another Chrysalide beast attempted to attack the Starhook Ten but was thwarted. Once everyone was safely onboard, the Starhook Ten joined the rest of the newly formed smuggling fleet and fled Byss through hyperspace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zevulon Veers had a very turbulent relationship with his father after the death of his mother. He described the summer before his mother's death as the last happy one he truly ever had and, as he grew up, continued to miss the warmth of his mother's smile. Veers began to grow apart from his father as he aged and was disturbed by how much value his father placed on his own reputation. The entire course of Veers's life was based on only what his father wanted him to become."}, {"tag": "p", "text": "Veers was a very curious child and constantly asked questions pertaining to the Empire's treatment of its citizens, much to the annoyance of his father. His willingness to help society and his compassion for non-Human slaves often put him at odds with Imperial ideals. Veers had his faith in the Empire shaken numerous times throughout his childhood. He always wondered why the Empire enslaved non-Humans and bombarded planets from orbit, and why committing those acts seemingly brought glory to the Empire. When he joined the Sub-Adult Group, Veers found that he could not fit in with the other youths and spent much of his time playing Wegsphere."}, {"tag": "p", "text": "As an adolescent, taking courses in logic and philosophy only strengthened Veers's views of the Empire and allowed him to read between the lines of Imperial media reports and propaganda broadcasts. He thought of CompForce as little more than a group of teenagers carrying loaded weapons and often referred to the group as \"CompFarce.\" He promised himself that he would not end up conditioned to simply follow orders like his father, a conviction which grew following his father's victory at Hoth. Veers's animosity toward his father and his reduced faith in the Empire eventually led him to his decision to defect to the Rebel Alliance. He was brought to his breaking point after he witnessed an old man being beaten and tortured by his superior officer. Once he was taken prisoner by the Rebels, he was quick to join their cause."}, {"tag": "p", "text": "As a Rebel, Veers found that he could live the way he wanted to rather than having his entire life predetermined by his father. Due to their similar first names, members of the Rebellion often mistook Veers for Zev Senesca, a Rebel pilot who lost his life during the Battle of Hoth. Veers was always baffled by this notion and strove to become as honorable of a Rebel as Senesca was. He made use of his many skills during his time in the Rebellion and its successor state, the New Republic. He served as a gunner in the crew pit aboard the Star Destroyer Emancipator during the Battle of Calamari, and was able to destroy a Super Star Destroyer with his gunning skills. He later piloted an X-1 Viper war droid during the attack on the Emperor's Citadel and had extensive knowledge of the droid's battle programming."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zevulon Veers first appeared in the third issue of the Star Wars: Dark Empire comic book series, written by Tom Veitch and illustrated by Cam Kennedy. He later appeared in the fourth issue of Star Wars: Dark Empire II and was voiced by John Cygan in the comic book's audio adaptation. He was given a full backstory in the Dark Empire Sourcebook by Michael Allen Horne. Veers was given additional background information in Maximilian Veers's entry in The New Essential Guide to Characters."}, {"tag": "p", "text": "The Dark Empire Sourcebook mistakenly uses an image of a different crew member aboard the Emancipator in its entry for Zevulon Veers. It uses the image of a communications officer sitting next to Calrissian and Antilles, despite the fact that Calrissian refers to someone in the crew pit when he speaks to Veers. Veers is completely absent from the fifth issue of Dark Empire II, although the events of that issue are depicted in the Dark Empire II audio drama with Veers included."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}