{"url": "Zeta_Magnus", "categories": ["Category:Legends articles", "Category:Arkanians", "Category:Males", "Category:Planetary leaders", "Category:Scientists", "Category:Terrorists", "Category:Zeta Magnus' Empire members"], "nodes": [{"tag": "h1", "text": "Zeta Magnus"}, {"tag": "p", "text": "Zeta Magnus, also known as K'am'ir Zaarin, Saturna the Garu, and Eon Null was a male Arkanian mutant and a master geneticist and an enemy of the Galactic Republic. Believed to have orchestrated several terrorist attacks across the galaxy, Magnus was affiliated with the Confederacy of Independent Systems during the Clone Wars. Declaring himself Magister of Skye, Magnus unleashed a pathogen on the planet and oversaw the Battle of Skye."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born as an experiment by the Arkanian Dominion, the male Arkanian mutant named Zeta Magnus was created to serve as the prime clone of the Accelerated Transgenic Heuristic Abhorers. These Abhorers, an answer to the Arkanian Renegades' Assimilators, were created from the DNA of Yaka, rakghouls, Amorphiian androids, dianoga, and other horrors to serve the Dominion. Unleashed during the Arkanian Revolution, Magnus slaughtered countless enemies of the Dominion with his accelerated strength. After the Revolution was ended, the Dominion destroyed its Abhorers but failed to kill Magnus, who escaped his hunters and fled captivity. After eating his creators, Magnus began his search for new ways to quench his desires for violence and mental stimulation."}, {"tag": "p", "text": "A killing machine, Magnus learned the languages of each of his victims as well as teaching himself to play instruments such as the Mawanese vioflute, the drumheller harp, the B'omarr pipe nalargon, and the Zeltronian lute. A savant thanks to the noological implants in his brain, Magnus was a genius. Traveling the Unknown Regions, Magnus interacted with a schizophrenic bio-ship, the Vagaari, N'Gai, and Ebruchi species, as well as the Chiss Ascendancy and the Ssi-ruuvi Imperium before establishing a kingdom of Dark Worlds which would come to be blessed by the Sorcerers of Rhand. Upon the realization that he was genetically programmed to die, Magnus sought immortality and was thus approached by Darth Sidious, Dark Lord of the Sith. Sidious promised to help Magnus live forever in exchange for fealty. While Magnus intended to eat the Sith Lord, he agreed to meet with him and see what he had to offer. To this end, Magnus became known as a terrorist to the Galactic Republic. Orchestrating an infestation of stone mites in the Core Worlds, creating and unleashing the blue virus, gifting General Grievous samples of 3L41UH7 serum, and allowing Count Dooku and the Confederacy of Independent Systems to use Wayland as a base and lab wherein the dashta tissue samples and Morgukai Shadow Army might be experimented with. Magnus also operated a GeNode facility hidden deep on Dantooine that persistently eluded Jedi Master Mace Windu. When he assisted in reviving Grievous and making him into the robotic monstrosity he became, Magnus requested a payment of a doublenecked, eight-string quetarra."}, {"tag": "p", "text": "During the early stages of the Clone Wars, infamous terrorist Zeta Magnus was wanted by the Republic for several of these notable crimes. A geneticist, Magnus was believed by Senate Bureau of Intelligence to have orchestrated a slew of murders on Anaxes and the hive virus which crippled the Katana fleet. A clone of Magnus invaded the planet Marat V in the Marat system and subjugated the native S'kytri people. When the Jedi Order learned of his involvement on Marat V, the Jedi High Council dispatched Jedi Knight Obi-Wan Kenobi and Padawans Halagad Ventor and Anakin Skywalker to apprehend him and bring him into custody. While they were joined by Captain Brisha Shard and her MedStar frigate called the Golandras, Captain Shard's ship was ambushed and destroyed over Marat V. Evacuating the ship via three escape pods, the Jedi crash-landed on the planet accompanied by four clone commandos: Captain Nilo, Xoni, Quo, and Kupe formed Tark Squad. While Magnus joined forces with the Outland Clan far from the main population centers where his pathogen had taken hold, the Jedi met with Patriarch Klarymére of the S'kytri and prepared to hunt him down. Having established a citadel upon the sacred Canaitith Mountain, Magnus' Outlanders led assaults on the S'kytri and continued to spread the pathogen he introduced to their environment."}, {"tag": "p", "text": "As the Jedi met with the Supreme Council of the Highland Clans, the Magnus clone released a HoloNet News transmission accusing the Jedi of interfering in his sovereignty over Marat V and ordered them to be recalled lest he unleash a plague upon the world of the Republic. Unknown to Magnus, the Jedi planned an attack on his citadel by navigating the perilous labyrinth of the Entyrmion's subterranean tunnels. During their travels, the Jedi began to wonder at the identity of Magnus and his true nature. Ventor wondered if he might be Force-sensitive and the title, Saturna the Garu was any relation to the ancient Sith Lord Garu. Additionally, as Master Windu was interested in the arrest of the geneticist, the possibility of a connection with the Dantooine Garoo seemed plausible especially in light of Windu's recent exploits on that world. Ventor also pointed out that Magnus was an ancient Sith title meaning Lord of Lords. These questions led the Jedi to consider that Magnus could be the rumored and mysterious Second Sith. Interrupting their musings, the Jedi and S'kytri warriors were attacked by an Oskan blood eater, a concoction of Magnus which attacked them in the sweltering crystalline caverns."}, {"tag": "p", "text": "Despite this, the Jedi forced their way into the citadel at the summit of Canaitith just as the S'kytri launched into battle against Magnus' Outlanders. As the Jedi searched for their target, the three were betrayed by their clone commandos, who were in actuality thralls of Magnus himself. The four faux-clones were revealed to be Sun Guards when the Jedi awoke in the laboratory of Magnus himself. Standing over them, he relished in their deception and taunted Ventor as he recounted orchestrating the event which saw his parents consumed by a hive-virus. Magnus planned to scan the brains of the Jedi and implant them in clones which he could grow in a matter of hours. Displaying the Jedi clones already forming at the other end of the chamber, Magnus was interrupted by the S'kytri warrior Kharys, who blasted away the restraints from the Jedi and freed them. Fleeing with his droid, Blue-Tark, Magnus was pursued by Ventor as Kenobi and Skywalker dealt with the Sun Guard. Heading for the hangar, Magnus' ship, the Skyriver Invader was not primed for take off which allowed Ventor to keep up with him. Struck in the back by a liquid cable spike, Magnus was dragged to the ground by a furious Ventor. The battle went ill for Ventor, who lost several fingers and chunks of his flesh to the monstrous being, but was able to get the upper hand when the Skyriver's engines ignited and irradiated Magnus. Using his lightsaber, Ventor bisected the man, killing him."}, {"tag": "p", "text": "This however was not the original Magnus. For he remained far away within his Dark Worlds, on the throne world of Rennek. From here he released the first plague into the Republic as he had promised."}, {"tag": "p", "text": "At some point after the Battle of Endor, TriNebulon News reporter Andor Javin filed a report claiming that K'am'ir Zaarin was the real identity behind the Imperial agent Cronal/Blackhole, known at the time as the rogue warlord Shadowspawn. Javin stated that the Arkanian had an army of clone warriors and worked alongside a clone of the then-deceased Grand Moff Wilhuff Tarkin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A craven Arkanian, Zeta Magnus was fond of dressing in the garb of the ancient Magi Sentinels of Onderon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Abel G. Peña had stated that he intended the genetic terrorist to be Atha Prime, but the mention was cut before final release."}, {"tag": "p", "text": "The description of K'am'ir Zaarin working in league with a \"resurrected\" Grand Moff Tarkin as well as having an army of Clone Warriors, mirrors that of the description of the character Atha Prime. Prime was described as a \"genetics master\" and an \"architect of the Clone Wars\" and was to be the primary antagonist, along with Tarkin, of the cancelled The Epic Continues storyline developed by Kenner Products. Kenner invented the character as a primary antagonist to further their SW toy line following Star Wars: Episode VI Return of the Jedi. Abel G. Pena, the co-writer of The Imperial Warlords: Despoilers of an Empire, has several times attempted to canonize Atha Prime and make references to the cancelled storyline, making this connection deliberate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}