{"url": "Zeta-class_Heavy_Cargo_Shuttle", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Empire starship classes", "Category:Zeta-class Heavy Cargo Shuttles"], "nodes": [{"tag": "h1", "text": "Zeta-class Heavy Cargo Shuttle"}, {"tag": "p", "text": "The Zeta-class Heavy Cargo Shuttle, also known as the Zeta-class cargo shuttle, was a type of cargo shuttle used by the Galactic Empire in its fight against the Alliance to Restore the Republic. They were instrumental in carrying kyber crystals during the construction of the Death Star."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Zeta-class Heavy Cargo Shuttle featured two levels: an upper deck that housed the ship's controls, and a ventral cargo deck that could be detached and dropped off at a location. The shuttle also had four wings that retracted inwards when landing and outwards when in flight, similar to the Lambda-class T-4a shuttle. In terms of armament, the shuttles featured two wing-mounted heavy laser cannons and three hull-mounted laser cannons. Skilled pilots did not need to fully land the shuttles in order to drop off or pick up cargo."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Partisans's attack on an Empire refinery in Kashyyyk, the Padawan Jedi Cal Kestis, who had stolen an AT-AT during the confrontation, helped Saw Gerrera and his allies to move forward and destroyed a Zeta-class Heavy Cargo Shuttle with the walker. The AT-AT ended up being destroyed along with the shuttle when it was hit by it when it crashed."}, {"tag": "p", "text": "Before the Jedha insurgency started, the Guardians of the Whills Baze Malbus and Chirrut Îmwe raided an Imperial supply convoy dropped off at LZ-Cresh by a cargo shuttle."}, {"tag": "p", "text": "During the insurgency, hundreds of these shuttles were used during the Imperial occupation of Jedha to transport kyber crystals for the purpose of powering the Death Star's superlaser."}, {"tag": "p", "text": "A number of these shuttles were also present for the Battle of Scarif, a successful attempt by the Rebel Alliance to steal the plans for the Death Star."}, {"tag": "p", "text": "At least five were present at the Fondor Shipyards when they were attacked by the Rebel Alliance."}, {"tag": "p", "text": "Zeta-class shuttles were also used by the Imperial civilian government."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}