{"url": "Zeta-class_long-range_shuttle", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:Shuttle classes", "Category:Telgorn Corporation products"], "nodes": [{"tag": "h1", "text": "Zeta-class long-range shuttle"}, {"tag": "p", "text": "Zeta-class shuttle was a long-range personnel shuttle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Zeta-class shuttle was a blocky transport that was designed for rapid transit of personnel over great distances and was not suited for combat maneuvers. The shuttle had two large fuel tanks mounted on the port and starboard side, which carried additional fuel and life-support components for long-distance travels. These tanks were designed to be modular, so that empty ones could quickly be replaced at a stopover."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Produced by the Telgorn Corporation, the Zeta-class was included in the initial load out of Victory I-class Star Destroyers. The Zeta-class was retired with the advent of the Sienar Fleet Systems's combat-oriented Lambda-class T-4a shuttle."}, {"tag": "p", "text": "The Zeta-class shuttle Arkanoid was salvaged by the Zabrak P'laang Ri from the Galactic Empire prior to the Battle of Yavin of 0 BBY. When used by smugglers Han Solo, Avik Lore, and Chewbacca shortly after the battle to infiltrate the Empire's Zoma Station, the Arkanoid was given no suspicion by Imperial personnel at the space station as it docked."}, {"tag": "p", "text": "One other Zeta-class shuttle was assigned to the Star Destroyer Admonitor, during her mission in the Unknown Regions, per request of then-Admiral Thrawn. There were rumors among Thrawn's support staff that the alien had requested the shuttle to quickly return to Coruscant from his exile, should he ever be pardoned. Thrawn, however used the shuttle on one occasion to successfully infiltrate and destroy an Ebruchi pirate clan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}