{"url": "Zi%27am", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Zi'am"}, {"tag": "p", "text": "Zi'am was a male Human who lived on the planet Nal Hutta during the Cold War between the Galactic Republic and the Sith Empire. Zi'am was the child of a failed Sith named Kendrel and his wife Gianna. Like his father, Zi'am was Force-sensitive, and when his mother found out, she wanted for him to be sent to the planet Korriban to train as a Sith as his father had attempted to do before him. Kendrel, however, did not want to risk his son being killed by the Sith on Korriban if he failed his trials, and so tried to flee Nal Hutta with him. Gianna learned of Kendrel's plan and sent an Imperial-aligned individual to bring Zi'am back to her. The individual found Zi'am and his father still on Hutta in the spaceport of an industrial town called Jiguuna. When the individual explained why they were there, Kendrel refused to hand Zi'am over, causing the individual to shoot and kill him. Zi'am then fled back to his mother, who sent him to Korriban. Once on Korriban, Zi'am came under the tutelage of a Sith overseer named Harkun, who began training him to become a Sith despite his lack of cooperation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zi'am was a male Human who lived during the Cold War. He was the child of a failed Sith named Kendrel and his wife Gianna. His father had trained on Korriban but failed and fled before he could be killed, ending up working for a Hutt on the planet Nal Hutta. When it was discovered that, like Kendrel, Zi'am was Force-sensitive, his mother wished for him to be sent to Korriban to train as his father had. Kendrel was greatly opposed to the idea, however, based on his own experience on Korriban. He took the boy and attempted to flee from Nal Hutta, reaching a spaceport in the industrial town of Jiguuna. A comm officer at the spaceport named Mekks recognized the pair and informed Gianna of their location, as he owed her a favor. Gianna then traveled to the Poison Pit cantina in Jiguuna, where she tried to find someone to retrieve her son."}, {"tag": "p", "text": "Gianna successfully hired an Imperial-aligned individual in the cantina to retrieve her son. The individual found Zi'am and Kendrel in the spaceport and informed Kendrel why they were there. Kendrel begged the individual to let them flee and to tell Gianna they had gone to Korriban. When the individual persisted, however, Zi'am's father refused to let his son be taken, and the individual shot and killed him. Zi'am then crouched by his father's body, distraught by his death, but soon fled home to his mother."}, {"tag": "p", "text": "Once Zi'am returned to Gianna, she sent him to Korriban where he was enrolled in the Sith academy. At the academy, Zi'am was uncooperative with the Overseer assigned to him, who was named Harkun, and spent much of his time complaining about his father's death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zi'am was deeply upset by his father's death and crouched by his father's lifeless body after he was killed. The Imperial-aligned individual's ruthlessness scared him enough that he quickly abandoned his father's corpse and fled back to his mother. Zi'am's mother believed that he would hate her for her involvement in his father's death and that the grief and hatred would make him a strong Sith. She also believed he was particularly strong in the Force. Once he reached the academy on Korriban he spent much time complaining about his father's death and was often uncooperative with his overseer. The overseer considered him foolish and believed he did not appreciate his opportunity to become Sith, but was at least passionate which gave him great potential."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zi'am first appeared in the video game Star Wars: The Old Republic released by BioWare in 2011. He is involved in the quest \"Dreams of Korriban\" where his mother asks the player to retrieve him from her husband. The player has a choice to either allowing Kendrel and Zi'am to flee once they reach the spaceport (light side) or to kill Kendrel (dark side). If the player chooses to allow the pair to flee, the only options when returning to Gianna are to lie, saying that her son was taken to Korriban. This article assumes that the player chose the \"dark side\" option and killed Kendral due to the fact only Imperial characters of the Bounty Hunter or Imperial Agent class can undertake this quest. This is due to its location on Nal Hutta, which Republic players cannot access. If the player chooses to let Kendrel flee, then he later sends the player a message thanking him and letting him know that he and Zi'am successfully escaped. If they choose the \"dark side\" option, then Overseer Harkun sends a message instead informing the player that Zi'am is on Korriban. Both messages include a 13 credit reward."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}