{"url": "Zillo_Beast", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Blaster-resistant creatures", "Category:Creatures of Malastare", "Category:Reptiles", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Zillo Beast"}, {"tag": "p", "text": "The Zillo Beast, sometimes referred to simply as \"the Beast,\" was a semi-sentient, reptilian species endemic to the planet Malastare. The Dugs believed this gargantuan creature to be extinct long before 21 BBY; during the Battle of Malastare, however, the last specimen alive was inadvertently unearthed by an electro-proton bomb used by the Galactic Republic."}, {"tag": "p", "text": "Supreme Chancellor Sheev Palpatine sought to use the Zillo Beast's indestructible hide to aid the Grand Army of the Republic. Shortly after the creature was brought to Coruscant for study, however, it broke free from its restraints and rampaged through the capital. In the end, the Jedi and Republic army were left with no other choice but to kill the Zillo Beast using a powerful toxin, the same one that had compelled it to ravage Coruscant, but in larger doses. Before the creature was killed, Palpatine ordered it to be cloned."}, {"tag": "p", "text": "One Zillo Beast lived in Wild Space where it was worshiped as a god by the Benathy, though it was later killed by Kylo Ren."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Zillo Beast was a gargantuan serpent-like creature with a lengthy whip-like tail. At 97 meters tall, the Zillo Beast towered over all species on its native planet of Malastare and was considered at the top of its food chain until its presumed extinction. Its tail contained eight sharp spikes, and the beast itself uniquely possessed a third arm protruding from its back."}, {"tag": "p", "text": "Its heavy plated armor was invulnerable to explosions, blaster fire, and even lightsaber strikes. Jedi Knight Anakin Skywalker discovered that gaps in the creature's armored plates could be exploited to damage or stun the creature. On one such occasion, clone troopers were able to subdue the creature by using RX-200 Falchion-class assault tanks aimed at the gaps in its armor to put the beast to sleep for transport to Coruscant."}, {"tag": "p", "text": "While in captivity on Coruscant, Doctor Sionver Boll observed that the creature was possibly sentient. This deduction was reinforced by the creature's hostile behavior towards Supreme Chancellor Palpatine. After breaking out of its containment facility, the creature terrorized the planet in an unsuccessful attempt to kill the Chancellor. It was later killed by poison gas fired by Republic Gunships whilst climbing the Senate building, but Palpatine ordered Boll to clone the creature."}, {"tag": "p", "text": "By the Imperial Era, a Zillo Beast was worshiped as a deity by the Benathy on their homeworld. During a battle between the Galactic Empire and the Benathy, Darth Vader was unable to defeat the creature. However, years later, his grandson, Kylo Ren, would successfully kill the beast. With their god dead, Ren made the Benathy swear loyalty to the First Order."}, {"tag": "h2", "text": "Zillo Beasts in the galaxy"}, {"tag": "p", "text": "The scales, teeth, and tail spikes of a Zillo Beast were used as decorations in the Ubrikkian Floating Fortress of Garnac's hunting guild."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Zillo Beasts were amongst the most fearsome of all reptiles and were considered untameable."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Zillo Beast appeared in the episodes \"The Zillo Beast\" and \"The Zillo Beast Strikes Back\" from the Star Wars: The Clone Wars television series. Star Wars creator George Lucas felt the Zillo Beast would dislike Palpatine and chase him. Dave Filoni joked with Lucas that the Zillo Beast could sense Palpatine was a Sith Lord, and was actually trying to warn the Coruscanti."}, {"tag": "p", "text": "When asked about the Zillo Beast's potential return in Star Wars Rebels following the cancellation of The Clone Wars, Filoni stated during an interview with StarWars.com that a comeback wasn't possible because its scale was too challenging for the production and they had no reason for why the Galactic Empire would clone it. Though he suggested the possibility of introducing a baby specimen rather than a mechanical one, no Zillo Beast appeared in the show before its ending aired in 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}