{"url": "Zhir_Tolavor", "categories": ["Category:Legends articles", "Category:Alliance Military members", "Category:Gran", "Category:Males", "Category:New Republic Defense Force personnel"], "nodes": [{"tag": "h1", "text": "Zhir Tolavor"}, {"tag": "p", "text": "Zhir Tolavor was a male Gran, who served in the Alliance to Restore the Republic and later the New Republic, during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Tolavor was raised on the planet Kinyen, but left to become a trader. After traveling to several planets, Tolavar decided to settle on the planet Alderaan with his lifemate and they raised a family there. In 0 BBY, Tolavar traveled to Chandrila to finalize a business deal about some rare wine and while he was there, Alderaan was destroyed by the Galactic Empire, killing his family."}, {"tag": "p", "text": "Tolovor vowed to do all he could to fight the Empire and sold everything he had. He then purchased some weapons and joined the Rebel Alliance, where he volunteered for dangerous missions. He joined the crew of the YT-1300 light freighter Lazy Katarn and 3 ABY, traveled aboard the ship to Dalicron-4, where he and the rest of the crew rescued the child Caeleb."}, {"tag": "p", "text": "Four months later, Caeleb was kidnapped by the Dark Jedi Thaum Rystra and the crew of the Katarn were again tasked with rescuing the boy. They tracked Rystra to the planet Pamorjal, but after the Katarn was destroyed by the Pamorjal Freeman's League, they began to fly the YT-2000 light freighter Celestial Dancer instead. They attacked Rystra in the Cavern of Light on a remoted world and rescued Caeleb."}, {"tag": "p", "text": "The Alliance reformed into the New Republic and Tolovar continued to serve it in it's new incarnation. In 7 ABY, he and the rest of the crew of the Dancer flew to the Temple of Pain in the Tascollan Nebula, where they confronted Rystra and his Sith Master, Valik Kodank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}