{"url": "Zhug_Ship", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Bounty hunter starships", "Category:Heraklon-class transports", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Zhug Ship"}, {"tag": "p", "text": "This ship was a Heraklon-class transport utilized by the Zhug brothers, a bounty hunter group active during the years of the Dark Wars. In 3951 BBY, they took a job to collect the bounty on a former Jedi Knight, Meetra Surik, set by the Exchange crime organization. As the Zhugs were chasing her with their ship on her way to Onderon, both Surik and the bounty hunters were forced to land on Onderon's moon, Dxun, after taking damage from a blockading Onderon separatist fleet above the planet. The ship was destroyed in the crash-landing and its crew was killed by Surik and her companions soon afterward."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This ship was a Heraklon-class frigate-type transport starship, a model manufactured by Sadon Shipwrights that saw a wide use in the Republic during the time surrounding the Jedi Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to the end of the Dark Wars, a Duros bounty hunter group, the Zhug brothers, obtained this Heraklon-class ship. In 3951 BBY, G0-T0, a local crime lord of the Exchange crime organization in the Y'Toub system, set a bounty on a former Jedi Knight Meetra Surik, known as the Jedi Exile. The Zhugs took the job to collect the bounty."}, {"tag": "p", "text": "When Surik arrived on the moon Nar Shaddaa in order to find the source of the bounty on her head, the Zhug brothers made two attempts to claim the bounty. Their failure in both attempts resulted in the loss of Azanti Zhug, one of their leaders. After the attacks, they pursued the Jedi's small freighter, the Ebon Hawk, with their ship on her way off the moon."}, {"tag": "p", "text": "When the Ebon Hawk and the Zhug brothers' ship eventually arrived in the Onderon system, both ships encountered an Onderon separatists blockade that was holding Republic merchant ships and the securing military fleet above the planet Onderon, prohibiting them from entering the planet's capital city, Iziz. Soon after, following the order of Colonel Tobin, the separatist fleet opened fire on the blockaded Republic ships in the opening of the first battle of the Onderon Civil War. The Zhugs' ship took its share of fire, and the inflicted damage caused the ship to fall from the sky while screaming its ID signature, crash-landing in the jungles of Onderon's moon Dxun. Two Zhug brothers, following Zhug leader Dezanti Zhug, survived the crash-landing that wrecked their ship, while Surik's freighter landed nearby. Soon, the Zhugs encountered Surik and her companions, but they failed in claiming the bounty on the former Jedi Knight—their attack on her resulted in the death of the Zhug trio by the Exile and her companions."}, {"tag": "p", "text": "As a result of the destruction of the Zhug Ship, sales of Heraklon-class transports decreased due to its damaged reputation. Eventually, a change in the model's marketing to focus on the vessel's safety in case of an accident returned sales to a profitable level, ensuring the continuation of production."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "During the ship's pursuit of Meetra Surik and its destruction on Dxun, the vessel was operated by three Zhug brothers, including the leader, Dezanti Zhug."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Zhug Ship was first introduced in Star Wars: Knights of the Old Republic II: The Sith Lords, a video game released by Obsidian Entertainment at the end of 2004. In the game, the player controlling the Jedi Exile is allowed to visit several planets after leaving Telos IV. This article assumes that the Jedi Exile visits Nar Shaddaa before traveling to Onderon's moon Dxun, as presented in the game's Prima Official Game Guide. Several ships of the same class were briefly seen in the cutscene when arriving on Onderon, waiting in the planet's blockade. Soon after, the Zhugs' ship is found as wreckage on the surface of Dxun. Although the game doesn't name the ship formally, the game model is labeled as \"Zhug Ship\" in the game dialogue file."}, {"tag": "p", "text": "The Zhug Ship received its class alongside the technical description and history of the model in Message to Spacers 9, an article written by Patrick Stutzman and released in 2010 as an online supplement for Wizards of the Coast's Star Wars Roleplaying Game. The article also contained details of the events that led to the Zhug brothers crash-landing on Dxun, identifying that the damage had been caused by Onderon separatist forces under Colonel Tobin's command."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}