{"url": "Zhell/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with elements from unlicensed sources", "Category:Races and species stubs", "Category:Extinct sentient species", "Category:Human races", "Category:Pre-Republic"], "nodes": [{"tag": "h1", "text": "Zhell"}, {"tag": "p", "text": "The Zhell were a people indigenous to Coruscant and the possible ancestors of the Human inhabitants of the world. They consisted of thirteen Nations of Zhell, and their combined military force was known as the Battalions of Zhell."}, {"tag": "p", "text": "The Battalions of Zhell came into dominance on Coruscant by waging war on the Taungs for centuries. During one of these battles, the Battalions of Zhell suffered a near extinction level defeat when a volcano destroyed their main city. The volcanic ash would fill the skies of Coruscant for two years, so that the Taungs adopted the name Dha Werda Verda or the \"Warriors of Shadow\" for themselves. The battle was immortalized by an epic poem with the same name."}, {"tag": "p", "text": "The Zhell eventually recovered and drove the Taungs offworld—the Taungs fled to Roon. Since Coruscant was considered by some to be the homeworld of Humans, several historians hypothesized that the Zhell species may have been the ancestors of the Human race in the galaxy. The name Zhell may have inspired Zhellday in the Galactic Standard Calendar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Zhell were mentioned in the article Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon, however the article was never officially published. The related information that was to be published in the article is outlined below."}, {"tag": "p", "text": "After being conquered by computer systems, drugs were regularly employed to keep the populace pacified by the ruling oligarchy. Rebelling against this order, a wide-scale resistance movement was formed under the leadership of two main groups: The Alliance, and the United Confederation of Zhell, named after the general who united the thirteen formerly divided nations on Urthha (the planet where Tilotny deposited humans after taking them from the primary universe). The group under the leadership of President Zhell escaped with the help of a Infinity Gate and was transported to Notron; where they established their domain and rules."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}