{"url": "Biel_Ductavis", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Grand Masters", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Biel Ductavis"}, {"tag": "p", "text": "Biel Ductavis was a male Jedi Master who led the Jedi Order as its Grand Master at the end of the Pius Dea Crusades, a series of conflicts that began in 11,965 BBY and lasted for nearly one millennium. When the Order suspended the Galactic Senate following the arrest of Supreme Chancellor Contispex XIX in 10,966 BBY, Ductavis was installed as the leader of the Galactic Republic in an attempt to rebuild the galactic government."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male, Biel Ductavis was trained in the ways of the Force by the Jedi Order. He eventually achieved the rank of Jedi Master during a time known as the Pius Dea Era. Ductavis and his fellow Jedi remained on the planet Ossus while the Galactic Republic's Supreme Chancellors, who were adherents of the Pius Dea religion, tore the galaxy asunder with the Pius Dea Crusades, which were initiated in 11,965 BBY. During the reign of Chancellor Contispex XIX nearly one millennium later, the Order had begun work with Caamasi peacekeepers in hopes of ending the oppression of the Pius Dea-controlled Republic."}, {"tag": "p", "text": "After years of planning, the Order succeeded in overthrowing the Chancellor, arresting Contispex aboard his flagship, Flame of Sinthara, and suspending the Galactic Senate in 10,966 BBY. After Contispex was tried and imprisoned on the planet Caamas, the Jedi High Council installed Ductavis in the Office of the Supreme Chancellor; Ductavis also served as the Grand Master of the Jedi Order during his tenure, leading both the Republic and the Jedi Order. During his lifetime, Ductavis created a holocron that became known as the Ductavis Holocron, and it was stored in the vaults beneath the Great Jedi Library on Ossus after his eventual death. However, when Ossus was evacuated prior to the Cron Supernova that destroyed the Library, the Jedi were unable to open the vault containing the Ductavis Holocron, so it and the vault were buried beneath rubble."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Biel Ductavis was a male who was trusted enough to lead both the Republic and the Jedi Order in the aftermath of the Pius Dea crusades."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ductavis was sensitive to the Force and eventually ascended to the rank of Jedi Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Biel Ductavis was first mentioned in The Essential Guide to Warfare, written by Jason Fry. Ductavis was included as part of the background for the Pius Dea crusades. A codex entry in the PC video game Star Wars: The Old Republic suggests that Ductavis was elected to the office of Supreme Chancellor, which seems to contradict the information given in The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}