{"url": "Ziro_Desilijic_Tiure/Legends", "categories": ["Category:Legends articles", "Category:Black Sun members", "Category:Hutts of the Desilijic clan", "Category:Vigos"], "nodes": [{"tag": "h1", "text": "Ziro Desilijic Tiure"}, {"tag": "p", "text": "Ziro Desilijic Tiure, also known as simply Ziro the Hutt, was a male oriented Hutt crime lord, a Vigo of Black Sun, and an uncle to Jabba Desilijic Tiure. The son of \"Mama\" the Hutt, Ziro was the brother of Jiliac, Pazda, Ebor, and Zorba Desilijic Tiure. Ziro is one of the only Hutts that have been heard to fluently speak Basic as opposed to Huttese."}, {"tag": "p", "text": "During the Clone Wars, Ziro arranged a deal with the Confederacy of Independent Systems in a plot to gain more power amongst the Hutt clans. This plot involved the kidnapping of his own grandnephew, Rotta, who was Jabba's son. His plot was uncovered, and Ziro was arrested by the Galactic Republic and imprisoned in the Republic Judiciary Central Detention Center."}, {"tag": "p", "text": "Following intense debate among the Hutt Council, the renowned Duros bounty hunter Cad Bane was hired to return him to the Council's custody, freeing him from Republic captivity following a bloody holdup of the Senate Rotunda and transferring him to a prison cell on Nal Hutta."}, {"tag": "p", "text": "After concluding Ziro was too dangerous to the Council's operation to be left alive, Jabba the Hutt hired Sy Snootles, a singer and former lover of Ziro, to secure a datapad containing sensitive information regarding the Council. Though he was being trailed by Cad Bane, as well as the Jedi Obi-Wan Kenobi and Quinlan Vos, it would be Snootles who killed Ziro with two blaster shots to the chest."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early criminal life"}, {"tag": "p", "text": "Starting out as a loan shark on Sleheyron, Ziro moved to Coruscant to pursue a bigger career. He did, however, adopt the tattoos, headdress and jewels of wealthy Sleheyroni Hutts. He eventually became a vigo of the criminal organization Black Sun, and had a tattoo of its symbol. He used a rundown tower that used to belong to the Lantillian Spacers' Brotherhood as his personal base. The tower was transformed into a gaudy-looking pleasure palace."}, {"tag": "p", "text": "When the Jedi Council was seeking information on the Nightsisters after the attack on the Sedawan, Ziro was held captive in his own palace by Asajj Ventress. He was rescued by two Jedi, but was also confronted by Ros Lai at the same time, whom Ziro owed a debt. The Jedi agreed to cover Ziro's debt and give Ros Lai transport off Coruscant in exchange for a data chip containing intercepted Nightsister transmissions."}, {"tag": "p", "text": "At some point, Ziro began an affair with Sy Snootles, the famed singer of the Max Rebo Band who would later be his assassin."}, {"tag": "h3", "text": "Plot against Jabba"}, {"tag": "p", "text": "During the Clone Wars, Ziro ordered the murder of fellow Black Sun vigos, though his IG-86 assassin droid, KRONOS-327, failed in this task. Shortly after KRONOS-327 reported his failure, Ziro was approached by Senator Padmé Amidala at his palace on Coruscant, when she tried to reopen communications with the Hutts, as they believed that the Jedi had abducted Jabba's son, Rotta."}, {"tag": "p", "text": "In reality, Ziro had struck a deal with Count Dooku to kidnap the child as part of a plot against his nephew. When the Jedi sent to retrieve Rotta died, the Order would have no choice but to bring Jabba to justice and Ziro would gain control of the Hutt Clan. He attempted to dispose of Amidala, but was ultimately apprehended by the Coruscant Guard led by C-3PO and Commander Fox and put into custody. Via holocomm, he was forced to confess to his nephew of his part in his grandnephew's kidnapping. Furious at his uncle's treachery, Jabba vowed to have him punished severely."}, {"tag": "h3", "text": "Imprisonment"}, {"tag": "p", "text": "Ziro's time spent in Republic captivity was supposedly a brutal time in which he suffered many horrors. Blaming Senator Amidala for his current state, Ziro hired bounty hunter Aurra Sing to eliminate Senator Amidala for revenge. Sing attempted to kill Amidala on Alderaan, where she was attending a conference addressing the welfare of various refugees of the war. Sing only wounded the Senator, and was captured in the act. After Sing was captured, Jedi Padawan Ahsoka Tano and Jedi Master Anakin Skywalker visited Ziro in his cell. He admitted to the assassination attempt, which extended his sentence in the facility."}, {"tag": "p", "text": "Sometime later, Jabba and the Hutt Ruling Council conferred, discussing Ziro's importance to the Hutt's operation. It was concluded that Ziro was in possession of a highly sensitive datapad detailing the various illegal operations the Hutt Council undertook. Fearful for their safety, the Council planned to hold the Senate Rotunda hostage with a hired gunfighter, to use it as leverage for Ziro's release."}, {"tag": "p", "text": "Though the bounty hunter Cad Bane intially only signed with the Council to retrieve a layout of the Senate building, Bane agreed to take part in the actual raid, assembling a team including Aurra Sing, who eluded imprisonment by the Republic in exchange for testifying against Ziro, and technician Robonino. The ensuing raid resulted in the death of Senator Philo, as well as a number of Senate security guards."}, {"tag": "p", "text": "The Hutt was released via Supreme Chancellor Palpatine's orders to save the surviving Senators' lives. Despite being pursued across Coruscant's skylanes by Quinlan Vos, Bane and Ziro escaped the Jedi on an airspeeder and made it to the bounty hunter's ship."}, {"tag": "h3", "text": "Ziro's assassination"}, {"tag": "p", "text": "After Bane successfully extracted Ziro from the prison, he was delivered to the Hutt Council on Nal Hutta, where Ziro vowed that his death would mean the leaking of the datapad to the Galactic Republic. The Hutts instead decided on keeping him under control in a prison cell."}, {"tag": "p", "text": "Jabba covertly hired Sy Snootles to release Ziro from his cell, asking her to retrieve the information in Ziro's possession and to kill him when this task was accomplished. The other members of the Hutt Council, unaware of Jabba's plan, hired Cad Bane to track down Ziro and kill him. Ziro's first instinct was to flee to his mother's house, where the Council would least expect Ziro to flee. During this surprise visit, Ziro arranged a trade with his mother for her starship, giving her his swamp speeder."}, {"tag": "p", "text": "Using his new starship, Ziro and Snootles traveled to Teth, where Ziro planned to retrieve his personal datapad, deliver it to the Republic, and have the Hutt Council arrested. He showed Sy his father's grave where the holodiary was located. After getting her hands on this incriminating evidence, Snootles quickly revealed her assignment under Jabba, equipping a small blaster and executing Ziro with two shots to the chest."}, {"tag": "p", "text": "Around this time, the Jedi Council sent Jedi Masters Obi-Wan Kenobi and Quinlan Vos to bring Ziro to justice. Their investigation naturally led them to the Hutt Council's stronghold on Nal Hutta, where Vos used his natural psychometry abilities to track Ziro to his mother's house, who then directed them to Teth. However, by the time the Jedi and Cad Bane arrived, Ziro was already dead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ziro was very flamboyant, even among the Hutts. Unlike most other Hutts, he spoke fluent Basic with a high-pitched voice and slight lisp, though he understood his native Huttese as well. Like many Hutts, he was greedy and was determined to gain control of the Hutt criminal empire by any means, even if it meant blackmailing his relatives. He was also quite fashion-conscious for a Hutt, adorning himself with tattoos and showy hats. At some point, Ziro had cosmetic surgery to give his face a more symmetrical appearance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ziro the Hutt was voiced by Corey Burton in the Star Wars: The Clone Wars film and television series."}, {"tag": "p", "text": "Ziro was originally going to speak Huttese into a microphone which would translate his speech into English, but this idea was dropped because the producers felt that younger audiences wouldn't be able to understand what the translator was. Later, George Lucas stepped in and specifically asked for Ziro to sound like Truman Capote. The character was a favorite of the production team, and they planned to have him return in the TV series."}, {"tag": "p", "text": "Dave Filoni told MTV News that his continuity experts had told him that Ziro did not have a biological sex because he was a \"slug;\" therefore, Filoni framed the matter of Ziro's sexuality as \"questionable\" rather than answerable as straight or gay. Ziro's final chronological appearance in the episode \"Hunt for Ziro\" established his interest in females."}, {"tag": "p", "text": "The young reader book Watch Out for Jabba the Hutt! mistakenly identifies Ziro as Jabba's nephew, instead of his uncle."}, {"tag": "p", "text": "The only Ziro toy available was released in 2012, he was included in a Fighter Pods set from Hasbro and exclusive to the Target shops. The character was also featured in the Marbs Series by Jakks Pacific."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}