{"url": "Zin_Taal", "categories": ["Category:Legends articles", "Category:Carrion sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Zin Taal"}, {"tag": "p", "text": "Zin Taal was an Outer Rim Territories world located in the Carrion sector. By 11 ABY, the mercenary First Sun Mobile Regiment established a command base there. The New Republic, which intended to capture the base, dispatched a New Republic Special Forces strike force that was dropped onto the world. The team's mission on Zin Taal was eventually complicated by an unforeseen circumstance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Zin Taal was a remote terrestrial world located in the Zin Taal system, a part of the Carrion sector in the New Territories portion of the Outer Rim Territories."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Zintaal was inhabited by a group of native inhabitants. By 11 ABY, the mercenary unit known as the First Sun Mobile Regiment established a temporary command base on Zin Taal. Eventually, the New Republic Special Forces assembled a strike force in order to capture the base-camp, which New Republic Intelligence estimated to have been established within the prior three weeks and which was prognosticated to remain in place for at least another month before being relocated."}, {"tag": "p", "text": "The strike force was provided with orbital images of the First Sun Mobile Regiment's base that depicted patrol patterns and lookout posts. The New Republic agents were also shown the best lines of approaching the mercenary camp. After an uneventful journey to Zin Taal, the strike force was dropped from a shuttle in a manner appropriate to the team's specialty. The strike force then made its way to the regiment's base, although an unforeseen event complicated the mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zin Taal was mentioned in \"Special Military Unit Intelligence Update,\" a roleplaying game source article written by Timothy O'Brien and published in the November 1997 Star Wars Adventure Journal 15. The 2009 reference book The Essential Atlas placed the Zin Taal system, and therefore Zin Taal itself, in grid square J-4."}, {"tag": "p", "text": "In \"Special Military Unit Intelligence Update,\" Zin Taal is presented as a setting for an roleplaying adventure seed. The exact nature of the complication the New Republic agents encounter on the world is left up to the gamemaster player, with the suggested options being: the detection of the player-characters' drop-shuttle; the mercenary base being put on high alert in response to an attack by Zin Taal's natives; and the base moving sooner than anticipated. For the last option, the adventure seed also provides several possible reasons: the regiment taking on a new contract; the New Republic mission being leaked; or the mercenary unit's General Maska Zural being nervous."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}