{"url": "Zorba_Desilijic_Tiure", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Baron Administrators", "Category:Crime lords", "Category:Hutts of the Desilijic clan", "Category:Kajidiis", "Category:Mayors", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Zorba Desilijic Tiure"}, {"tag": "p", "text": "Zorba Desilijic Tiure was a Hutt crime lord and the leader of the Desilijic kajidic. One of few Hutts to possess hair—as a result of a genetic throwback—Zorba was the brother of Jiliac, Ebor, Ziro and Pazda, father of Jabba Desilijic Tiure, and grandfather of Rotta, Gorga and Grubba Desilijic Aarrpo. Zorba was an inept leader of Desilijic, and he had few supporters in his clan due to his outlandish schemes and financial mismanagement. During the Separatist Crisis, he was apprehended by law enforcement and sentenced to prison on the planet Kip. Jiliac took over as Desilijic leader and Jabba inherited much of Zorba's holdings."}, {"tag": "p", "text": "In 5 ABY, Zorba was released by agents of Director of Imperial Intelligence Ysanne Isard and traveled to Jabba's Palace on Tatooine in his ship, the Zorba Express. Zorba was refused admission to the palace, and he later discovered that Jabba had been killed by Princess Leia Organa. Determined to punish Organa, Zorba put out a bounty on her. Using a secret will of his son's, Zorba laid claim to much of Jabba's holdings throughout the galaxy including his casino on Bespin and his desert citadel on Tatooine."}, {"tag": "p", "text": "On Bespin, Zorba won control of Cloud City from Lando Calrissian and learned that Organa was in the city, in Imperial warlord Trioculus' captivity. He attempted to bargain with Trioculus for Organa to be handed over to him, but he refused, and Imperial forces clashed with Zorba's Cloud Police. Zorba emerged on top, and believed he had killed Organa after destroying an Imperial factory barge. Zorba's minions later informed him that Organa had survived, but he captured her on Hologram Fun World and brought her to Tatooine, planning to feed her to the sarlacc. Trioculus, however, rescued Organa, and fed Zorba himself to the sarlacc. Zorba escaped as well and helped Trioculus' rivals, the false Prophets of the Dark Side, defeat him. Zorba regained leadership of the Desilijic clan, but Jabba's will was later declared a forgery by the Hutt Grand Council. Disgraced, Zorba went into hiding and was rumored to have died soon thereafter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clan leader"}, {"tag": "p", "text": "Zorba Desilijic Tiure, a member of the Huttese Desilijic clan, was born around 1000 BBY on Nal Hutta; he had three younger siblings: Jiliac Desilijic Tiron, Pazda Desilijic Tiure, and the scheming Ziro Desilijic Tiure. As a result of a recessive genetic trait, Zorba (along with Pazda) was one of few Hutts to possess any hair. He had long, white, dreadlocked hair on his head and a great, braided beard; because it was such a rarity in Hutts, Zorba's hair marked him as a kind of mutant among many of the other Hutts and they rarely hid their distaste at it. Zorba was also a powerful crime lord and part of the Desilijic kajidic, a type of Hutt criminal syndicate, one of the most powerful in the galaxy; he, however, was an incompetent criminal leader."}, {"tag": "p", "text": "By 600 BBY, Zorba had ascended to the leadership of the Desilijic clan. The clan had previously been one of the most influential of the Hutt clans, but by the time of Zorba's life, it was falling on hard times and funds were low. An inept planner and organizer, Zorba's mismanagement of the clan made financial matters even worse; ambitious and daring—to the point that some, such as his brother Jiliac, believed him completely reckless—Zorba attempted many grand schemes during his time as leader, each one a failure and each one further emptying Desilijic's coffer. However, although he was unpopular among many of his fellow clan members, Zorba ruled Desilijic with an iron fist and warded off any attempts at his ouster."}, {"tag": "p", "text": "Although Zorba usually took a masculine personality, several times in his life he turned female in accordance with the hermaphroditic nature of Hutts and birthed offspring, who all followed in his slime trail and became crime lords themselves. One of them, Jabba Desilijic Tiure, was particularly criminally gifted, and Zorba saw him as his only heir; he taught him all he knew: how to double-cross those who trusted him, how to deal with smugglers, how to deal with his enemies, and how to control slaves. Jabba thrived and became one of the youngest Hutts to maintain his own criminal organization. Zorba himself was embroiled in a heated conflict with Desilijic's main rival clan, Besadii, and his opposite number, Aruk Besadii Aora; the two hated each other with a passion. At some point in his life, Zorba became a grandparent; his offspring produced two children of their own, Gorga Desilijic Aarrpo and Grubba Desilijic Aarrpo, and Jabba birthed a son, Rotta."}, {"tag": "h3", "text": "Imprisonment"}, {"tag": "p", "text": "Despite Zorba's raising Jabba, he and his son were not close; Jabba kept to himself, running his own organization with efficiency Zorba was incapable of matching. Despite this, Zorba occasionally visited Jabba at his desert palace on Tatooine, where he was always a welcome guest. In 32 BBY, Zorba was visiting his son when Jabba offered to free one of his slaves, Dorn, and allow him to work for Zorba. To prove his loyalty, however, Dorn was told to recapture the Ghostling children, whom he had previously freed from Gardulla the Hutt's custody. Dorn double-crossed Jabba, rescuing the children and escaping from Tatooine."}, {"tag": "p", "text": "By this time, however, Zorba was extremely old; ancient even by Hutt standards, he was over 900 years old and one of the oldest Hutts in existence at that time. Zorba was also tired of being in charge of Desilijic, and seeing his plans end without fruition again and again. During the Separatist Crisis, Zorba took his ship, the Zorba Express, to the backwater planet of Kip, hoping to mine valuable ulikuo gemstones, much sought-after for their aesthetics; Zorba was unaware that mining them was illegal on Kip, and he was apprehended by local law enforcement, though he was able to hide his stash of gemstones. Under pressure from the Galactic Republic, who hoped to put Zorba behind bars for as long as possible, the government of Kip tried him in court and he was sentenced to forty-five standard years in the Girigard Subsurface Correctional Facility, a far harsher sentence than what would normally have been given. Zorba's lawyer, Bequin Fobas, attempted to appeal, but as Kip had no appeals process this was not possible; Zorba was held in prison, and the Republic sent additional resources preventing his escape."}, {"tag": "p", "text": "The Hutt clans were furious, and many believed that Zorba had been framed. Although he was unpopular, the Hutt Ruling Council attempted to extradite him to Nal Hutta to face charges there, but again the local laws on Kip prevented this from happening. Zorba's opponent, Aruk, addressed the public, saying that he was glad Zorba would not be able to taint Hutt society any longer; Zorba's few supporters desperately tried to prove that he had been set up by a rival, to no avail. Jiliac took over control of the Desilijic clan, and Jabba was quick to absorb much of Zorba's holdings on Nar Shaddaa, Shaum Hii and Tyne's Horky. Zorba's conviction had a negative effect on the financial affairs of Desilijic, and to recover from this, the clan had to cut funding to many podracing circuits."}, {"tag": "p", "text": "Zorba, however, was unperturbed by the whole affair. He knew that his properties and businesses in Hutt Space would be turned over to Jabba, who would do a far better job at managing them than Zorba had. Zorba knew that by Hutt law, Jabba would have to sell the properties back to his parent at cost price, meaning that Zorba's term of imprisonment could prove potentially lucrative for the old Hutt. Additionally, forty-five years was insignificant in the long lifetime of a Hutt; Zorba's imprisonment seemed more like a vacation for him. While in prison, Zorba occasionally sent envoys to various clan meetings to represent him. Jabba performed even better than Zorba had anticipated, using various unscrupulous tactics to usurp Jiliac and become Desilijic leader. Zorba watched with glee, awaiting the day of his release, so that he could retire on Jabba's hard-earned funds. At some point during his stay on Kip, Zorba briefly conversed with an Imperial Grand Moff; the two were at odds, though, as the Grand Moff did not share Zorba's high opinion of Hutts and their culture."}, {"tag": "p", "text": "In 4 ABY, Jabba Desilijic Tiure was killed by Princess Leia Organa of Alderaan, a prominent member of the Alliance to Restore the Republic. The Desilijic clan was left in disarray, with many people laying claims to his various organizations; eventually, after months of infighting, two Hutts named Kumac and Jelasi ascended to the position once held by Zorba. As Kip was such a backwater world, news of this never reached Zorba. However, less than a year after Jabba's demise, Kip was conquered by alien pirates, and the prisoners of the Girigard Subsurface Correctional Facility were all freed in the chaos. Kip's natives had been unable to operate the Zorba Express, so Zorba found it exactly where it was left before his imprisonment; the old Hutt dug up his supply of gemstones and set a course for his son's residence on Tatooine. Unbeknownst to Zorba, his release had been engineered by Ysanne Isard, the Director of Imperial Intelligence and ruler of the Empire, who hoped to use Zorba for her own clandestine purposes."}, {"tag": "h3", "text": "Zorba the Hutt's revenge"}, {"tag": "p", "text": "Zorba arrived at Jabba's Palace on Tatooine, but was not admitted by its TT-8L gatekeeper droid, who informed him that the palace was under new ownership. When the gatekeeper droid learned he was a Hutt, it retracted, leaving him with no option but to leave. Confused and furious, Zorba made his way to the Mos Eisley Spaceport, hoping to find answers about Jabba's whereabouts in Chalmun's Spaceport Cantina. The cantina's denizens—among them Grand Moff Bertroff Hissa, who was on official Imperial business, and Tibor, a notorious Barabel bounty hunter—told Zorba the bad news: Jabba had been strangled to death by his slave, Leia Organa, at Carkoon. Distraught, Zorba swore he would get his revenge on Organa, and hired a group of bounty hunters, led by Tibor, to recapture the dormant Jabba's Palace."}, {"tag": "p", "text": "Zorba quickly recovered from the shock, and began planning how he could use the situation to his advantage. No will of Jabba's had been located, so many of his more lucrative properties and operations had been taken by local authorities; Zorba, however, knew of Jabba's secret \"true will and testament,\" a holorecording kept in the memory banks of a hidden droid named CB-99. Zorba and his entourage of bounty hunters located the droid and recovered the will; in the recording Jabba stated that he wished his entire legacy to go to Zorba, including his desert palace, his townhouse in Mos Eisley, and the Holiday Towers at Cloud City, Bespin. While Zorba claimed the will was authentic, many suspected it was a forgery."}, {"tag": "p", "text": "In the Zorba Express, the old Hutt and Tibor made their way to Bespin to reclaim Jabba's properties on Cloud City; it was also the last known location of Leia Organa. En route, Zorba spread the word among various criminal empires about Jabba's will. The Holiday Towers Hotel and Casino had been taken over by Lando Calrissian, the Baron Administrator of Cloud City, and, despite his demands, Zorba was not admitted entry into Jabba's former penthouse suite. Zorba requested an audience with Calrissian; while he waited for the baron-administrator to arrive, he sampled the sabacc tables offered by the casino, though rarely won any games. When Calrissian finally arrived, Zorba again voiced his demands for the hotel to be handed over. Calrissian refused, though, and knowing Zorba would never relent, he offered to challenge the Hutt in a game of sabacc. If Calrissian won the game, Zorba would leave the city and never return; if Zorba won, Calrissian would hand over Cloud City and appoint him governor. Zorba insisted that as they were in the property willed to him by Jabba, they use his deck of cards—which was marked with ultraviolet light, visible to Hutts but not Humans."}, {"tag": "p", "text": "Using the marked deck, Zorba triumphed over Calrissian, winning control of Cloud City. Zorba banished Calrissian and immediately took over the city. He hoped to reestablish the tourist trade that had once thrived on Cloud City, but had since fallen on hard times. The main obstacle for this was the \"braze\" created by a nearby factory barge under the control of would-be Emperor Trioculus, and Zorba made it his priority to negotiate with Trioculus to attempt to cut back the factory's toxic emissions. Meanwhile, Tibor had learned that Leia Organa was on Bespin, in the captivity of Trioculus; he told Zorba that Trioculus might trade her for Ken, a so-called Jedi Prince wanted by Trioculus who had been apprehended by the Cloud Police. To ensure that Ken was actually the \"Jedi Prince\" Trioculus coveted, Zorba decided to question him; Ken was initially defiant, refusing to cooperate, but a dosage of avabush spice—a potent truth serum—and some careful questions from Zorba eventually persuaded him to reveal that he was, in fact, the much sought-after Jedi Prince."}, {"tag": "p", "text": "Zorba arranged a meeting with Trioculus, and allowed the former slavelord to himself interrogate Ken. Zorba made his offer, pledging to hand over Ken if Trioculus closed down his factory and presented Organa to him. Trioculus, who had plans to make Organa his wife, vehemently refused, despite Zorba's protestations, and Zorba pronounced the two mortal enemies. Each of them signaled for their security forces to enter the meeting room, but Zorba's Cloud Police were far more numerous than Trioculus's stormtroopers; Zorba took the slavelord captive, and threatened to encase him in carbonite. With Trioculus imprisoned, Zorba led a ragtag fleet of bounty hunter vessels in an attack on the Imperial factory barge, where Organa was being kept. The ships made light work of the barge, destroying it within several minutes. Satisfied that Organa was dead and Jabba was avenged, Zorba returned to Cloud City to mock Trioculus. Trioculus vowed that an armada of Imperial ships would slag Zorba's city, but Zorba indeed encased Trioculus in carbonite and kept him in Cloud City, so that the Imperials would not attack."}, {"tag": "h3", "text": "In the belly of the beast"}, {"tag": "p", "text": "Zorba had a mimicry of Trioculus's carbonite slab placed in the Figg & Associates Art Museum, while he kept the real one in his ship. During his time administering Cloud City, Zorba began formulating a plan to turn Jabba's dormant palace into a high-security prison, where myriad prisoners could be kept. Shortly thereafter, members of the Central Committee of Grand Moffs rescued a counterfeit slab of carbonite that they believed was Trioculus's body. Zorba's efforts into making Cloud City a profitable business venture were being met with little success—despite destroying the factory barge and reducing the amount of braze, Zorba had lost over eighteen million credits in revenue; his audit droids informed him that this was because most tourists were choosing to visit Hologram Fun World instead of casinos. Zorba roused his bounty hunter team and made his way to Hologram Fun World in the Zorba Express, hoping to scare its visitors away."}, {"tag": "p", "text": "Zorba and his cohorts terrorized the tourists in Hologram Fun World, looting, plundering, and vandalizing. After a time, hordes of visitors fled, and Tibor had stolen a large amount of precious stones. During his vandalism spree, the Barabel bounty hunter had noticed Leia Organa and her fiancé, Han Solo, entering a performance of the renowned magician Bithabus the Mystifier—she had survived the destruction of the factory barge on Bespin. Tibor informed Zorba, but the Hutt quickly overcame his surprise and hatched a plan. One of his gang of bounty hunters, Cobak, was the same species as Bithabus; Zorba's minions captured the magician and gave his costume to Cobak, who would be able to pass for Bithabus. Cobak was able to lure Organa onto the stage and into a cage, which was taken by Tibor to the Zorba Express."}, {"tag": "p", "text": "Not wanting Organa to escape death again, Zorba and Tibor decided to take her to Carkoon on Tatooine, where she had killed Jabba, and feed her to the sarlacc pit. He spoke with her for the first time, though Organa was defiant, claiming that she had killed Jabba in self defense; Zorba had her locked up alongside Trioculus's body for the entirety of the journey to Tatooine."}, {"tag": "p", "text": "As the Zorba Express approached Tatooine, it was attacked by an Imperial vessel—the Central Committee of Grand Moffs's Moffship—which used a tractor beam to halt Zorba's progress. The Hutt armed himself with a portable ion cannon, while Tibor used dual blaster pistols, as the Imperials began boarding. Zorba and Tibor killed many of the attacking stormtroopers, but Grand Moff Hissa fired several smoke bombs, which impeded Zorba and Tibor's efforts. Zorba was captured and chained, and the Moffs located and thawed Trioculus, who threatened to kill Zorba; the Hutt was unperturbed, though, knowing that he had a trump card in Leia Organa. Zorba negotiated his release in exchange for informing the Moffs of Organa's location in his ship. After locating her, Trioculus broke his promise—he dropped Zorba from the Moffship into the sarlacc pit. The immense beast swallowed the Hutt whole—but later, the combination of the Hutt's bulk and protective mucous coating gave the sarlacc a fit of indigestion. The sarlacc vomited Zorba into the desert night."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "Zorba roamed the desert without food or water for days, waiting for someone to arrive and help him escape. Eventually, a Jawa sandcrawler gave Zorba passage to Mos Eisley, in return for a hundred slightly used Spin-and-Win machines from the Holiday Towers casino. In Mos Eisley, Zorba hired a spacer to take him to Space Station Scardia in the Null Zone—the residence of the false Prophets of the Dark Side, Trioculus and the Committee's enemies. Zorba hoped to sell the Prophets what little information he knew of Trioculus and the Committee's plans, so that he could get his revenge on those who fed him to the sarlacc. Zorba was able to hire a cargo freighter to deliver him to the Prophets, who, upon hearing he had information about Trioculus, welcomed him like an honored guest, with a banquet."}, {"tag": "p", "text": "Zorba had little to tell the leader of the Prophets, Kadann, though he informed the false Prophet that Trioculus and his allies sought to find the Lost City of the Jedi, and that the Moffs were traitors. While Zorba's information was of little use to the Prophets, he was able to provide a testimony—via recording—in the illegitimate trial of the Grand Moffs, conducted by the Prophets aboard Space Station Scardia. Zorba claimed they were plotting against Kadann, and that they should be harshly punished; he also stated that the Committee's leader, Bertroff Hissa, should receive a harsher sentence for worse crimes. Ultimately, Hissa perished on Yavin 4, Kadann was killed by Grand Admiral Afsheen Makati, and the remaining Moffs were wiped out by Ysanne Isard."}, {"tag": "p", "text": "Zorba left Space Station Scardia, and with his plot to kill Organa foiled, he returned to Hutt Space. At some point, Zorba ceded ownership of Cloud City back to Calrissian, who gave it to the Ugnaught workers who inhabited it. Zorba's other children carried on where he had left off in the hunt for Organa and Solo, posting a huge bounty; again, it was not met with success, and around 10 ABY it was rescinded. Through the Hutt courts, Zorba used Jabba's will to lay claim to his son's criminal empire, and control of the Desilijic clan was wrested from the hands of Kumac and Jelasi. Since Jabba's death, the Besadii clan—led by Durga Besadii Tai—had overtaken Desilijic as the most successful of the Hutt clans, and Zorba could never build Desilijic back into anything remotely like what his son had done."}, {"tag": "p", "text": "Zorba's final reign as a crime lord was short-lived, however. Some time after Zorba took control of the clan, the Hutt Grand Council deemed Jabba's \"true will and testament\" to be a forgery, and Zorba was disgraced. His properties and clan leadership were taken from him by a multitude of other relatives, and Zorba was left virtually penniless. Since the will was declared false, Zorba became extremely reclusive and was not seen in public for some time. Rumors abounded about his death, and they were considered to be accurate."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zorba Desilijic Tiure was extremely proud of his Hutt heritage. He believed Hutts to be a fair and honorable species; they were kind to each other, even if they expected everyone else to do their bidding. He often swore by the name of the ancient conqueror, Kossak the Hutt, and it pained him to hear other sentients speak ill of Hutts. Zorba was outraged when the gatekeeper droid at Jabba's Palace refused to admit him, believing it was because of anti-Hutt bias. Zorba was also extremely close to his family, especially Jabba, though Jabba and Jiliac did not have high opinions of Zorba."}, {"tag": "p", "text": "Zorba was unlike most Hutts in that he did not relish being in charge of criminal operations, and he often shunned power—for the almost 600 years he spent as leader of Desilijic clan, he was never really interested in running the clan and the family business. Despite this, he was an iron-fisted ruler, and he did not allow any attempts to usurp him to succeed. Zorba was something of an entrepreneur, and he was a Hutt full of ideas. He was constantly looking to see how he could expand his criminal empire in less-than-orthodox ways; he wanted to turn Jabba's Palace into a maximum security prison, and attempted to make Bespin a popular tourist destination. Zorba was totally inept at managing finances and running his criminal empire, and he almost bankrupted Desilijic with his outlandish schemes."}, {"tag": "p", "text": "Zorba was almost universally disliked by his fellow Hutts, and by most non-Hutts. Because of the rare genetic throwback that gave him a full head of hair, Zorba was often ostracized by other Hutts—they felt he was impure, and unfit to be in such a lofty position, and made no attempts to hide their displeasure at it. Zorba was a vengeful being, and he had no qualms about harming innocent people to achieve his own means. On Bespin, he destroyed an Imperial factory barge, killing all of its workers, in an attempt to kill Leia Organa, and he and his cohorts terrorized visitors at Hologram Fun World in order to alternatively attract them to his casinos in Cloud City."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zorba the Hutt was created by Paul and Hollace Davids for the Jedi Prince series of young reader's books. He first appeared in the third book, Zorba the Hutt's Revenge, in which he served as the main antagonist, and he made fleeting appearances in the next three books in the series, Mission from Mount Yoda, Queen of the Empire, and Prophets of the Dark Side. While the series is generally marginalized by the rest of the Expanded Universe, Zorba has been prevalent in other works. Tom Veitch's Dark Empire endnotes were the first source to mention him, in the same year that Zorba the Hutt's Revenge was released, and he has since been referenced in A. C. Crispin's Rebel Dawn; numerous Essential Guides; Episode I Adventures 7: Capture Arawynne, by Dave Wolverton; HoloNet News, by Paul Ens and Pablo Hidalgo; a Wizards of the Coast online article called Hutt! Hutt! Hutt!, which deals with his early life; and in Karen Traviss' Star Wars: The Clone Wars novelization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}