{"url": "Zorba_Express", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Hutt Cartel starships", "Category:Huttian star yachts", "Category:Starships of the Trioculus' Empire"], "nodes": [{"tag": "h1", "text": "Zorba Express"}, {"tag": "p", "text": "The Zorba Express, also known as Zorba's Express, was an ancient starship that belonged to Zorba the Hutt, shady businessman and father of the famous crime lord Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A typical bell-shaped Huttian starship, the Zorba Express belonged to a class of space yacht, the design of which predated the Clone Wars. When standing upright, the starship resembled a domed building distinguished by several spires. Its boarding hatch was shaped like a diaphragm shutter and could be accessed by a ramp. The cockpit of the Zorba Express was roomy enough to fit a Hutt, an astromech-sized droid and at least another passenger."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the second month of 22 BBY, Zorba was imprisoned on the muddy planet of Kip for the illegal removal of ulikuo gemstones, and the 'Zorba Express was abandoned on a cliff immediately after the Hutt's capture. However, the native inhabitants of Kip never figured out how to fly that spaceship. As a consequence, the Zorba Express was still waiting for its owner, when Zorba was freed by a group of pirates in 5 ABY. By that time, the Zorba Express was very much in disrepair; some observers believed that the vessel would not even be able to break the sound barrier after several more trips if it was not serviced."}, {"tag": "p", "text": "Despite that, Zorba still used his personal transport to get to Tatooine, a desert planet that had been the fiefdom of his son, Jabba. After discovering that Jabba had been murdered by Princess Leia Organa, Zorba laid claim to much of his son's properties throughout the galaxy. He took off in the Zorba Express, bound for the floating metropolis of Cloud City, in which Jabba once owned a casino. He also traveled to Hologram Fun World, an amusement park that drove customers away from his newly acquired casino. While there, Zorba successfully captured Princess Organa, and he put her in the Zorba Express so he could bring her back to Tatooine and execute her."}, {"tag": "p", "text": "However, Zorba and his yacht were captured in orbit of Tatooine by Trioculus, Supreme Slavelord of the Kesselian Spice Mines and self-anointed Galactic Emperor. As Zorba refused to cooperate with Trioculus' plan, the Hutt was fed to the monstrous Sarlacc of Tatooine, and the Supreme Slavelord remained in possession of his battered yacht."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}