{"url": "Zongorlu", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Noonian sector planets"], "nodes": [{"tag": "h1", "text": "Zongorlu"}, {"tag": "p", "text": "Zongorlu was a Galactic Republic planet in the Outer Rim Territories. It was conquered by the Mandalorian Neo-Crusaders during the Mandalorian Wars, shortly after the bombing of Serroco. The Mandalorians launched their assault on Zongorlu from Taris."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was the homeworld of the Zongorlu. According to Republic propagandist Captain Benegryph Goodvalor, they were represented in the Galactic Senate."}, {"tag": "p", "text": "Goodvalor also tried to scare off the oncoming Mandalorians by claiming the planet was defended by a huge number of Republic ships and troops, and that, on temperate days, the planet suffered from hurricane-force winds, magnetic storms in the ionosphere, searing heat on the surface, pyroclastic flows from volcanic ridges, high atmospheric sulfur content, and acidic rain in the polar regions. This report led Mandalorian leader Koblus Sornell to assume the mobile signal station the Mandalorians were taking to Zongorlu would require heavy-duty shielding for its transmitter."}, {"tag": "p", "text": "After putting the signal station in place, Sornell reported to Cassus Fett that the Republic propaganda was highly misleading. The planet actually had good weather. The vaulted Republic \"fleet\" consisted of abandoned ships that had been in orbit for perhaps fifty years. Sornell did not report to Fett from the signal station the Mandalorians had brought, but from the very one Goodvalor had been using, which was equipped with a directional transmitter Goodvalor had been using to send his propaganda to the Outer Rim. Goodvalor had abandoned the station when the Mandalorians arrived."}, {"tag": "p", "text": "The Mandalorians camped on the planet and held station for a week or so. During the time, there was no rain, and Sornell had to stop the troops from setting fire to the natives, fearing the entire camp would burn. The Mandalorians grew so bored on the planet that they, even Sornell, began missing hearing Goodvalor's broadcasts."}, {"tag": "p", "text": "Goodvalor offered a compromise to the Mandalorians on behalf of the Senate via a message sent to Sornell on Zongorlu. Without consulting Fett, Sornell used the transmitter on Zongorlu to send back a refusal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}