{"url": "Big_Inside", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Legends of Luke Skywalker—The Manga"], "nodes": [{"tag": "h1", "text": "Big Inside"}, {"tag": "p", "text": "Big Inside is a story that was published in The Legends of Luke Skywalker—The Manga. The story was written and illustrated by Akira Himekawa, and published on January 14, 2020 by Viz Media."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ride with Skywalker"}, {"tag": "p", "text": "A female biologist reflects on her mysterious experience with Luke Skywalker as a young biology student. The biology student was on a research trip on Agoliba-Ado and was preparing to depart for Agoliba-Ena when Skywalker arrived on a modified A-wing starfighter. After introducing himself, Luke invited the biologist aboard his starfighter. The cash-strapped biology student accepts his offer for a ride."}, {"tag": "p", "text": "During the journey, the female biologist tells Skywalker that she was investigating whether life originated on Agoliba-Ado or Agoliba-Ena and then colonized the other, or if they evolved independently. She adds that she is a biology student doing fieldwork under the supervision of her professor. Since her university is too frugal to have a dedicated research vessel, the biologist has to hitch a ride with travelers. Skywalker, who travels alone, says that it is nice to have company."}, {"tag": "p", "text": "When she asks Skywalker how long he has been traveling for, Skywalker admits that he has lost count. Skywalker thinks he has visited three or four planets. When Skywalker asks if he has seen any Jedi ruins, the biologist asks if he is an archaeologist. Skywalker says he is trying to learn as much as he can about the Jedi. The biologist thinks that the legends of the Jedi are either exaggerations or tall tales. She thinks that Skywalker is eccentric."}, {"tag": "h3", "text": "Into the exogorth"}, {"tag": "p", "text": "Skywalker spots a group of alluring, mystical dots which the biologist labels \"fireflies.\" These \"fireflies\" led the A-wing inside a large cave of an asteroid. While exploring the \"cave,\" Skywalker and the biologist find writing on the wall that appears to move. Skywalker makes out the word \"mist\" and wonders if they are related to the Jedi. The biologist says she has a \"bad feeling about this\" and thinks they should leave. However, the cave closes in and the pair realize that they are trapped in the mouth of an exogorth or a space slug."}, {"tag": "p", "text": "Skywalker asks the biologist if they are in danger. She explains that exogorths are giant creatures that live in asteroids and have an extremely slow metabolism. She predicts that the space slug won't move against for years if not decades. The biologist fears that they don't have many escape options since the slug is made from kilometers of thick layers of rock. Skywalker tries to be optimistic and suggests that there may be a way out."}, {"tag": "p", "text": "Traveling through the exogorth, they encounter starship wreckage, mysterious writing on the wall, and transparent membranes that circulated oxygen through the creature, allowing them to breathe. The biologist and Skywalker later reach an enormous cavern within a lake, which is inhabited by various mynocks. The mynocks attack the two travelers, forcing Skywalker to draw his lightsaber in self defense. The biologist recalls that Skywalker appeared to be sorrowful in having to kill monsters in self defense."}, {"tag": "h3", "text": "Surviving the stomach"}, {"tag": "p", "text": "The pair soon realize that the lake was the acidic stomach of the space slug. The two create an improvised raft with the skull and wings of a dead mynock. While the biologist is overwhelmed with stress, Skywalker is optimistic and adventurous. To calm her down, Skywalker strikes a conversation. The biologist explains that the exogorth's interior has an entire ecosystem inhabited by creatures who live in symbiosis with their host. She explains that they help the exogorth absorb its prey."}, {"tag": "p", "text": "Skywalker reassures the despondent protagonist that they will get out of here alive. He uses several glowing letters as a guide. When he advises her to learn as much as she can while inside the space slug, the biologist vows to gather as much data as possible for her university. She hopes to use her experience inside the exogorth to advance her academic career. Just then, a tendril trips their raft over. The biologist plunges into the exogorth's acid."}, {"tag": "p", "text": "Though she believes that she is dead, she awakes to find Skywalker telling her that they are past the exogorth's stomach now. Reaching the creature's gut, the two subsist on fungi growing inside the creature's gut. Skywalker had eaten some to test they were safe. Skywalker has also obtained water, using his skills as a moisture farmer. Skywalker reassures the biologist that they are not going to die. Hearing his voice gives her more energy than food or water."}, {"tag": "h3", "text": "Explorers"}, {"tag": "p", "text": "Continuing their journey, Luke and the biologist map out the exogorth, which describes as a maze of tunnels and interconnecting chambers. The protagonist also notices several glowing signs consisting of both writings and abstract paintings. She is amazed by the amount of art they had discovered inside the space slug, taking copious notes and doing sketches. Skywalker is also encouraged, saying that nobody believed him when he set out to recover the knowledge of the Jedi."}, {"tag": "p", "text": "The biologist thinks that the Jedi are mostly myths and that magic is not the same as science. Luke explains that real magic is always knowledge and that the galaxy is knowable and wondrous. Together, the pair escaped traps and encounters with monsters. The biologist is relieved that Luke always managed to get them out of these scrapes, which she thinks must be giving the exogorth a stomach ache. The biologist also discusses her theories about the mini-ecosystems they encountered with Skywalker. Skywalker believes that the writings may be related to the Jedi."}, {"tag": "h3", "text": "The Mist-Weavers"}, {"tag": "p", "text": "The pair encounter an elaborate chamber with plants, fungi and three \"statues.\" Skywalker observes that the chamber and \"statues\" show no sign of erosion and appear to have been carved yesterday. The biologist spots some writing at the base of the \"statues\" and believes that they were built by the builders prior to their deaths as a means of proclaiming their presence. The two travelers rest, regarding the chamber as a spiritual place or a place of refuge."}, {"tag": "p", "text": "While resting Luke notices that the statues are looking at them. Luke touches the hand of a female \"statue\" despite the biologist's warnings and collapses. When he awakens, Skywalker tells her that he heard them. The statue explains that she and her companions Shareen, Awglk and Wkk'e were Master Weavers of the Luminous Mist, whose art was to knot and entwine the strings of mists that cradled all sentient species and connected the far-flung worlds in order to create glowing portraits of mist. She describes the mist as something that connects them all and grows within them, comforting the downtrodden and grieving. She describes it as the bright essence that pulses within every cell of their living being."}, {"tag": "p", "text": "The trio had traveled through the galaxy, seeking to add new wonders to their loom. One day, they followed several bright sparks which led them into the exogorth. Realizing they had fallen into a trap, they had prepared for death. However, Wkk'e refused to give up. Due to her unique alien physiology, Wkk'e was able to enclose herself inside cocoons between the various stages of her life. She convinced her friends to let her spin cocoons out of the \"Luminous Mist\" in order to keep themselves alive. The trio were able to keep themselves alive for millennia."}, {"tag": "h3", "text": "Freeing the Mist-Weavers"}, {"tag": "p", "text": "The \"statue\" introduces has Shareen and explained that Skywalker's presence had prompted Wkk'e to wake her up and initiate contact with Skywalker. Shareen convinces her friends that they must offer him their help. Wkk'e thinks they are trapped here while Awglk says that none of them are sure of the future but can only hope. Discussing the matter with the biologist, Skywalker deduces that the Mist-Weavers need to be freed from their cocoons because they can't unwind them on their own. He resolves to cut open the cocoons with his lightsaber."}, {"tag": "p", "text": "The biologist warns Skywalker that they will die since time has passed. As Skywalker struggles with doubt and not knowing what to do, the biologist reflects on the burden of accepting someone else's sacrifice. Unable to watch Skywalker struggle with doubt, she left him alone and went together food. When she returned, she found Skywalker clutching the hand of one of the Mistwalkers. She counsels Luke not to keep carrying this burden, saying that it's more difficult to see him suffer."}, {"tag": "p", "text": "Skywalker confides that he once watched his mentor Obi-Wan Kenobi give his life so that Skywalker and his friends Han Solo, Chewbacca, and Princess Leia Organa could escape the Death Star. Through his death, Kenobi freed himself from this world and became part of the Force. Skywalker recalls that his late master had a look of peace on his face prior to his death and that he had trusted the Force. Skywalker admits that this is a lesson he still has a hard time accepting."}, {"tag": "p", "text": "The biologist notices that Shareen's face is peaceful and content. Realizing what he needs to do, Skywalker uses his lightsaber to cut through the cocoons, freeing the three Mist-Weavers who embrace each other. Shareen thanks Skywalker, referring to him as \"Bright-Heart.\"  While they thought they had found a way of escaping death, she realizes that they had only been lured by the fear of death into imprisoning themselves. She thanks Skywalker for helping her to reconnect with the turbulent flow of time and violent palpitations of hope. After thanking Skywalker, she and her friends becoming one with the Force, unleashing a bright burst of light."}, {"tag": "p", "text": "Skywalker then experiences a Force vision from Master Kenobi who tells his former apprentice that there are patterns in the Force like the rise and fall of tide. He explains that deeds from the past echo in the present, which will in turn echo from the future. Skywalker realizes that just as Kenobi freed himself from fear and doubt to save him, the Mist-Weavers freed themselves from fear and stasis to save them. Though Skywalker had felt hopeless at the moment, he now understands that accepting the sacrifice of loved ones and those who share their ideals is the first step to becoming more powerful that he can imagine."}, {"tag": "h3", "text": "Back on track"}, {"tag": "p", "text": "Skywalker and the biologist find themselves on the surface of the asteroid. She hugs Skywalker, thanking him for saving her so many times and giving him strength. She wishes that she can repay him even though she is not well versed in the Force. Skywalker says it is alright. The biologist thanks Skywalker for keeping her hope alive and saving her from despair and rejection so that she can love the galaxy again."}, {"tag": "p", "text": "Skywalker remarks that she analyzes everything like a scholar but that he understands what she is saying. Following the detour, Skywalker decides to take her back to Agoliba-Ena. Though the biologists' notes were all destroyed during the escape, she is optimistic and says that she plans to switch to studying exogorths. When Skywalker asks if being inside one is enough, she expresses curiosity about exploring what is inside other space slugs. Skywalker agrees and says there is more knowledge to seek in the galaxy."}, {"tag": "p", "text": "Reflecting on her adventures, the biologist acknowledges that people will be skeptical of her account. However, she says that it was enough to have glimpsed what no one else has seen. She takes pride in witnessing the mist or Force that embodies the universe reveal the bright heart of wonder and hope underneath."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}