{"url": "Zutton", "categories": ["Category:Canon articles", "Category:Artists", "Category:Males", "Category:Snivvians"], "nodes": [{"tag": "h1", "text": "Zutton"}, {"tag": "p", "text": "Zutton was a Snivvian male who was an artist who spent time in Chalmun's Spaceport Cantina on the planet Tatooine in 0 BBY. He and his brother Takeel were present when the local moisture farmer Luke Skywalker and the Jedi Obi-Wan Kenobi arrived in the cantina and was still in the building when the pair had a confrontation with the thugs Doctor Cornelius Evazan and Ponda Baba. Skywalker and Kenobi later passed Zutton speaking to the Nimbanel Mosep Binneed in the streets of Mos Eisley."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Snivvian male Zutton was an artist who frequented Chalmun's Spaceport Cantina in Mos Eisley on the planet Tatooine with his brother Takeel. Like most Snivvians, the pair were often referred to as snaggletooths. When the local moisture farmer Luke Skywalker and his droids C-3PO and R2-D2 entered the cantina in 0 BBY Zutton was stood with his back to the door talking to a human in front of the booth where Figrin D'an and the Modal Nodes were playing on stage."}, {"tag": "p", "text": "Zutton then moved to the front of the bar, and turned to look at Skywalker when the bartender Wuher informed the moisture farmer that his droids were not welcome in the establishment. The Snivvian then moved further down the bar, and was on the opposite side when the Jedi Obi-Wan Kenobi stepped in to defend Skywalker from the thugs Doctor Cornelius Evazan and Ponda Baba. Zutton later left the cantina, and was stood in the street talking to the Nimbanel Mosep Binneed when Kenobi, Skywalker, and his two droids passed the pair on their way to Docking Bay 94."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Zutton had light skin, black eyes, and brown hair. He had a hunchback, resulting in his right shoulder being notably higher than his left."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While in Mos Eisley, Zutton wore a red tunic over a black shirt along with light-colored pants and boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"Snaggletooth\" dates back to the original Kenner Star Wars toy line, in which an action figure based on the Snivvian was given the name. Later sources which are now identified as belonging to the Star Wars Legends timeline noted that the name Snaggletooth was actually a nickname, and that the male Snivvian's real name was Zutton. The \"Zutton\" name was later canonized with the release of the canon guide book Star Wars: Alien Archive. Meanwhile, the first canon source to provide the name Snaggletooth was the Star Wars: Card Trader mobile app. The character is otherwise unnamed in Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "Although the character in the film wears a red-colored shirt, the original Kenner toy featured blue clothing. The figure's clothing was changed to red during the toy line's production run, as was the figure's height. Snaggletooth's general appearance later served as inspiration for Katt Mol, a Snivvian character who appeared in the Star Wars: The Clone Wars television episode \"Padawan Lost.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}