{"url": "Zygerrian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with cut elements", "Category:Feline sentient species", "Category:Outer Rim Territories species", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Zygerrian"}, {"tag": "p", "text": "The Zygerrians were a sentient humanoid species native to the planet Zygerria. Members of the species were medium-sized, standing 1.7 meters tall on average and weighing around sixty kilograms. The Zygerrians were distinguished by their feline appearance, having pointed ears and clawed hands, while some individuals also had faces that were entirely covered in fur. The species was well-known for its long history of violence, war, and slavery, which the Zygerrians viewed as a natural order of life. This contributed to the Zygerrians being feared across the galaxy."}, {"tag": "p", "text": "Founders of the Zygerrian Slave Empire and the subsequent Zygerrian Slavers Guild, the Zygerrians conducted slaving operations in the Outer Rim Territories for centuries before the Clone Wars. At one point, the species was crushed by the Jedi Order but eventually recovered. During the Clone Wars, the Zygerrians allied with the Confederacy of Independent Systems, led by Count Dooku, in hopes of expanding their slaver empire. The Confederacy supplied them with the captured Togruta population of the planet Kiros, whom the Zygerrians hoped to sell at an auction."}, {"tag": "p", "text": "However, misunderstandings between Dooku and the Zygerrian Queen Miraj Scintel led to Scintel's death, while the Togrutas were rescued by the Jedi Obi-Wan Kenobi and Anakin Skywalker. During the reign of the Galactic Empire, the Zygerrian slaving business thrived, since slavery was permitted by Imperial Decree A-SL-4557.607.232. The Zygerrians kept close ties with the Empire, supplying it with slaves and receiving discounts on slaver permits in exchange. Due to the nature of their business, the Zygerrians also became targets for Rebel Alliance privateers, bounty hunters, and various non-affiliated spacers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Zygerrians were a bipedal sentient humanoid species. Feline in appearance, the species possessed strong, angular features and large, pointed ears. Other distinctive features included long fangs that jutted from their jaws and claws that extended from their hands. Some Zygerrrians had faces and ears that were entirely covered with fur—ranging in color from brown to gray, red, or black. Other individuals displayed a certain amount of bare skin on their faces, which was light in tone. The Zygerrians' eye color varied between yellow and blue."}, {"tag": "p", "text": "Males traditionally had more hair than females, with bands of fur growing on their cheeks. Male Zygerrians also displayed a number of bony spurs protruding from the chin, which females lacked."}, {"tag": "p", "text": "With an average lifespan of eighty-one years, the Zygerrians reached adolescence at ten years; they were considered adult at seventeen, middle-aged at forty, and old at sixty-one. Medium-sized, they usually grew up to 1.7 meters and weighed around sixty kilograms on average. They generally had sallow complexions and were physically strong, but some individuals suffered from obesity."}, {"tag": "p", "text": "The Zygerrians spoke Galactic Basic Standard with a pronounced accent. They also had their own language, which was spoken among the Zygerrian slavers on the planet Kowak, the species' major outpost active in the years following the Clone Wars."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Notorious slavers"}, {"tag": "p", "text": "A warlike species, the Zygerrians held strength—both physical and mental—in great esteem, viewing it as a means to gain power and authority. The Zygerrians were cunning, ensuring that they had the upper hand in any situation, and traditionally settled their differences with an unarmed fistfight. They believed that it was the natural order of life for the strong to dominate the weak, so slavery was normal for the species, and a display of weakness could mean death or enslavement in their culture. Those unfortunate enough to become their slaves were viewed as inferior species by the Zygerrians. As such, a slave market thrived on their homeworld of Zygerria."}, {"tag": "p", "text": "Because of those views, the species willingly cultivated its image as dangerous and unpredictable, in order to discourage others from challenging them. This tactic worked, and the Zygerrians were feared in spaceports across the galaxy, earning fame for their history of violence, piracy, slavery, and war. Despite their predations, the Zygerrians were nonetheless an advanced civilization."}, {"tag": "p", "text": "Founded centuries before the Clone Wars, the Zygerrian Slave Empire focused on slave trading in the Outer Rim Territories for many years, until it was defeated by the Jedi. Eventually, the Zygerrians reestablished their business under the Zygerrian Slavers Guild, which thrived due to its disciplined and structured approach to business, as well as the Galactic Republic's diffuse presence in the Outer Rim. Each Zygerrian slaver had to pay a yearly membership fee to join the Guild and was then allocated a patch of space in which to work. The size of that patch varied from one planet to an entire system, depending on the level of membership the slaver paid for. The Twi'lek species preferred to use Zygerrians over other slavers, since the Zygerrians' \"honorable\" business approach reduced the damage that slavery inflicted upon Twi'lek society."}, {"tag": "h3", "text": "Organizations and titles"}, {"tag": "p", "text": "The Zygerrian people were organized into clans and classes. They had a noble class, many members of which, despite their high status, pursued a career in the military. The Zygerrian Head of State was a monarch; female rulers held the title of queen, fully styled as The Most High Queen of Zygerria, while males were addressed as kings."}, {"tag": "p", "text": "Male heirs to the throne bore the honorific title of prince, while the entire family of the monarch was referred to as the Zygerrian Royal House. The monarchs resided within the Zygerrian Royal Palace. A group of elite soldiers called the royal Zygerrian guard was specifically trained to protect the royal family and ensure the prosperity of the species' slaving business."}, {"tag": "p", "text": "Individuals responsible for handling archives of the Zygerrian Slave Empire were called royal archivists. During the tenure of Queen Miraj Scintel and later King Atai Molec, the position of royal archivists was held by brothers Jorec and Mard Gemen. Zygerrian News was a media outlet that operated on the planet during the Clone Wars."}, {"tag": "h3", "text": "Traditional equipment"}, {"tag": "p", "text": "The species' natural physical strength was well-complemented by their mastery of various weapons, such as retractable shock whips. The shock whip was a traditional weapon of the Zygerrians that ensured that the target ensnared by the whip's electrified metal wires experienced great pain and muscle spasms. In combat, the Zygerrians tended to resort to non-lethal tactics, in order to maximize the number of prisoners captured."}, {"tag": "p", "text": "In addition to shock whips, electrostaffs also saw widespread usage by the Zygerrians. The species also utilized firearms, such as the Zygerrian blaster rifle, which could fire both regular blaster bolts as well as shots that detonated on impact, creating an explosion. The Zygerrians used shock collars to control their slaves, punishing those who displayed disobedience with painful jolts of electricity. Sometimes, those collars were outfitted with an explosive device that could be detonated if a slave tried to escape."}, {"tag": "p", "text": "The Zygerrians utilized various creatures to travel on their homeworld, including the winged brezak creatures that the royal guard used to patrol the ground for escaped slaves. In order to transfer slaves between planets, the species used highly durable freighters, called the YV-865 Aurore-class freighter. The transports came equipped with grappling turrets that could be fired through open bay doors to ensnare victims and reel them inside the ship. Each transport contained space for numerous enslaved individuals but only required one pilot to operate it. The Zygerrians also used the versatile, long-range HH-87 Starhopper to patrol the airspace of their holdings."}, {"tag": "h3", "text": "Clothing styles"}, {"tag": "p", "text": "Zygerrian clothing was characterized by a number of distinctive trends, both among royalty and other Zygerrian citizens. A typical male outfit consisted of a matching loose-fitting shirt and pants, with a piece of fabric worn around the neck, and a waistband held by a belt. Female clothing fit more tightly to their figure and typically consisted of a short skirt worn over pants. Females also donned various accessories, such as neck rings and coiled armbands worn above the elbow."}, {"tag": "p", "text": "Both males and females generally wore dark-colored clothes, with shades of gray, brown, and dark-green being fairly prevalent among the Zygerrian people, although brighter colors were also an option, such as red, orange, or blue. Contrasting with the dull color scheme, Zygerrian clothing was often accented with bright stripes of red or gold. Some Zygerrian outfits were adorned with patterns, reminiscent of designs appearing among the species' architecture."}, {"tag": "p", "text": "Individuals who held positions of power in Zygerrian society dressed in much more distinctive clothing. Zygerrian royalty displayed a lavish sense of style, exemplified by Queen Scintel's richly decorated long dress, golden neck and arm accessories, and a golden headpiece. Another member of the Zygerrian Royal House, Prince Sono Molec, wore a purple-colored outfit, complete with a long, flowing cape that was gold on the outside. During the Clone Wars, Prime Minister Molec wore a brown long-sleeved jacket with gold adornments. While stationed on Kowak, royal archivists Jorec and Mard Gemen wore identical blue-black outfits with white trim and white half-capes held at the neck by bead necklaces."}, {"tag": "p", "text": "Zygerrian traders wore a set of armor, consisting of a sleeveless tunic that ended in flaps of varying lengths at the waist. Their outfits were combined with large helmets that imitated the shape of Zygerrian ears and left only a small part of their faces exposed. Zygerrian royal guards, such as Omus Krill, wore a uniform that looked similar to the traders' attire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Zygerrians hailed from Zygerria, a planet located in the Chorlian sector of the Outer Rim Territories, on the outskirts of the galaxy. Organized under the Zygerrian Slave Empire, the species prospered on slave trade across the galaxy and especially within the Outer Rim. Eventually, the Zygerrian Empire came to dominate a large portion of the region, stretching from the planet Argazda down the Salin Corridor hyperlane."}, {"tag": "p", "text": "The slavers were also in control of the Triellus Trade Route, which provided access to the planet Ryloth, the homeworld of the Twi'lek species. At the height of their empire, the Zygerrians provided slaves to other powerful factions operating in the region, such as the Hutt Empire and Chevin slavers."}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the Sith Empire, the planetoid Zygerria Four underwent bombardment with an attempt to drive off slavers who had settled there. The bombardment drove away many slavers, with one rich slave trader abandoning an entire palace. The bombardment also uncovered the ruins of an underground city on Zygerria Four, which various archaeologists gathered to study."}, {"tag": "h3", "text": "Conflict with the Jedi"}, {"tag": "p", "text": "Thousands of years before the Clone Wars, the Republic outlawed slavery, and the Jedi—who served as the guardians of peace and justice for the Republic—began an anti-slavery campaign within the Outer Rim. As part of that campaign, the Jedi Order especially targeted the Zygerrians. After a brutal conflict, the Zygerrians were crushed, and many of their enslaved species were liberated."}, {"tag": "p", "text": "Their empire having fractured, the Zygerrians retreated to their homeworld, and they were not considered a threat by the Jedi or the Republic after that incident. However, ever since their defeat, the Zygerrians longed to restore their slaver empire to its former glory. By the year 22 BBY, the Zygerrians, along with the Karazak Slavers Cooperative and the Thalassian slavers, had once again emerged as one of the leading slaver organizations in the galaxy, with an estimated income of billions of credits. As of the beginning of the Clone Wars later that same year, the species had created the secret Zygerrian Slavers Guild, a successor organization to their former slaver empire."}, {"tag": "h3", "text": "Allies of the Confederacy"}, {"tag": "p", "text": "As the war raged on, the leader of the Confederacy of Independent Systems, Count Dooku, offered to supply the Zygerrians with slaves captured by Confederate battle droids on the battlefields. Dreaming of stretching the Zygerrian influence across the galaxy and believing the Republic too preoccupied with the war to stop her from reaching that goal, Zygerrian Queen Miraj Scintel allied her people with the Separatists. Aided by pirates and mercenaries, the Zygerrians began preying upon systems isolated by the war. They also established slaving outposts on many planets, such as Kowak and Listehol."}, {"tag": "p", "text": "During the second year of the war, the Confederacy invaded the planet Kiros and captured its entire Togruta population. On the orders of Dooku, the Togrutas were handed over to the Zygerrians, and Scintel hoped to sell them at the Royal Slave Auction on Zygerria with the hope of restoring the Zygerrian slavers' glory."}, {"tag": "p", "text": "Most of the slaves were transferred to a labor processing hub on the planet Kadavo, which was run by the Zygerrian Agruss, known as the Keeper. Meanwhile, Togruta Governor Roshti was kept on Zygerria to be presented at the auction as an example of the goods available for sale."}, {"tag": "h3", "text": "Scintel's auction"}, {"tag": "p", "text": "After liberating Kiros from the Separatists and finding the entire population gone, the Jedi Obi-Wan Kenobi and Anakin Skywalker embarked on a search for the missing Togrutas and infiltrated the Zygerrian homeworld. While Kenobi set off to search for the Togrutas, Skywalker posed as a slaver named Lars Quell, who wished to present a Togruta slave—in reality, Skywalker's Padawan, Ahsoka Tano—to Scintel. However, Kenobi was soon captured while trying to rescue Roshti."}, {"tag": "p", "text": "Scintel held the auction as planned, which was hosted by a Zygerrian auctioneer, and many wealthy individuals came to bid on the Togrutas, but the bidding was soon halted in order to present a new exhibit—the captive Kenobi. At that moment, the auction was interrupted by Skywalker and Tano, who—with the help of clone trooper CT-7567—attempted to liberate Kenobi and to force Scintel to surrender."}, {"tag": "p", "text": "However, after the clash of lightsabers and shock whips in the auction arena, the Zygerrians overwhelmed and captured the Jedi. Scintel kept her new captives alive, hoping to break the Jedi's will and make them her obedient slaves. Kenobi, CT-7567, and Roshti were transferred to Kadavo, while Tano was imprisoned on Zygerria and Skywalker made Scintel's personal slave. The queen's unwillingness to kill the Jedi prompted Atai Molec—the Zygerrian prime minister and Captain of the Guard—to invite Dooku to Zygerria to reason with her and execute the Jedi. After the Separatist leader arrived, Scintel refused to listen to him, and Dooku killed her. Meanwhile, Skywalker and Tano escaped and headed for Kadavo, prompting Dooku to contact Keeper Agruss with orders to kill Kenobi and CT-7567."}, {"tag": "p", "text": "As Skywalker and Tano attempted to break into the Kadavo processing hub, Dooku ordered them to cease, lest the Keeper drop the captured Togrutas into the maw of a volcano below the facility. In response, Skywalker called in Republic reinforcements that he had requested earlier. In the ensuing battle, the slaves were liberated, the labor processing hub was destroyed, and the Keeper was killed, dealing another blow to the Zygerrian business."}, {"tag": "h3", "text": "Subjugated"}, {"tag": "p", "text": "The species recovered yet again, as Molec—who had ascended to the Zygerrian throne as the new king after Scintel's death—successfully resurrected the Zygerrian Slave Empire. Meanwhile, the Clone Wars ended in 19 BBY with the fall of the Galactic Republic and the rise of the Galactic Empire in its place. Although the Galactic Empire quickly seized control of most of the galaxy, the Outer Rim Territories initially refused to acknowledge its authority."}, {"tag": "p", "text": "The Zygerrian slavers were no exception, as they entered an alliance with Tervig slavers and Sikurdian pirates and established illegal trade routes along the Listehol Run and the Shaltin Tunnels. The slaver union also began raiding the newly reorganized Corporate Sector, an independent territory that shared borders with the Outer Rim."}, {"tag": "p", "text": "The Galactic Empire was quick to respond to such insurgencies along the Outer Rim and began a campaign to subjugate that rebellious territory. In 18 BBY, an Imperial task force led by Admiral Wullf Yularen and Captain Bannidge Holt began the Listehol Campaign. A fleet of Invincible-class Dreadnaught Heavy Cruisers, Venator-class Star Destroyers, and TIE fighters under their command defeated the Sikurdian swarms at the Battle of Sagma. Yularen and Holt then besieged Zygerria, forcing the Zygerrians to negotiate peace with an Imperial advisor dispatched to the planet. Placed under Imperial control, Zygerria served as a base of operations for a series of unsuccessful Imperial raids on the planet Tervissis."}, {"tag": "h3", "text": "Relations with the Galactic Empire"}, {"tag": "p", "text": "However, the Zygerrians' tenure under the heel of the Galactic Empire was short-lived, since King Molec was able to negotiate a deal with Galactic Emperor Palpatine. In exchange for freedom from Imperial control, the Zygerrians agreed to restrict their slaving activities to the Outer Rim. The species enjoyed a rise in prominence once again, and the Zygerrian Slavers Guild went public after Imperial Decree A-SL-4557.607.232 legalized slavery under certain conditions. In 0 ABY, Imperial Admiral Terrinald Screed singled out the Zygerrians as some of the most infamous slave traders in the entire galaxy in a report that he sent to the Emperor."}, {"tag": "p", "text": "As the Zygerrian Slave Empire continued to grow, the species began having dealings with the Hutts once again. Meanwhile, the structure of the Zygerrian Slavers Guild and the species' reputation as harsh disciplinarians made it beneficial for the Galactic Empire to offer them slaver permits at a reduced cost, which, in turn, led the Zygerrians to actively traffic slaves for Imperial needs. Among the species the Zygerrians dealt in were the Twi'leks, the Mandalorians, and the Wookiees, the latter of which the Empire found most useful in the construction of the first Death Star superweapon."}, {"tag": "p", "text": "However, because of such close ties to Palpatine's Empire, Zygerrian ships were considered legitimate targets for Rebel Alliance privateers during the Galactic Civil War. Additionally, Zygerrian slavers were sometimes hunted by both the Imperial Navy and the Imperial Sector Rangers."}, {"tag": "h2", "text": "Zygerrians in the galaxy"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Occupation of Kiros"}, {"tag": "p", "text": "By the time of the Separatist Crisis, the Zygerrian species had ties to the Merson pirates, who supplied them with slaves captured in their raids. During this period, the Zygerrians raided the planet Rodis, where they captured a local military leader named Nilo. The Zygerrians later sold Nilo to the Rattataki war barons to fight in the Cauldron gladiator pits, impressing the barons with stories of Nilo's military exploits. However, Nilo did not survive his first fight, as he was killed by the prototype battle droid L8-L9 during the brawl."}, {"tag": "p", "text": "The Zygerrian Darts D'Nar allied himself with the Confederacy of Independent Systems during the Clone Wars. After Count Dooku's forces took control of Kiros, D'Nar was placed in charge of the planet. There, he faced off against the Republic troops led by Obi-Wan Kenobi and Anakin Skywalker, and he attempted to force the Jedi to surrender by threatening to detonate thermal annihilator bombs that he had planted throughout the capital city. However, the Jedi managed to disarm the bombs and captured D'Nar."}, {"tag": "h4", "text": "Battle of Tirahnn"}, {"tag": "p", "text": "Another member of the species, Zolghast, also served the Confederacy in the Clone Wars as a commander. When the Confederacy captured the planet Tirahnn, Zolghast was placed in charge of the occupation force there. The paranoid Zolghast spent most of his time in a secret bunker in the capital city, protected by Geonosian bodyguards."}, {"tag": "p", "text": "Since Tirahnn was located on the vital Perlemian Trade Route, the Republic planned to retake the planet a few months after it fell into enemy hands. To that end, a Republic strike team was dispatched to the planet to take control of a planetary ion cannon. The task was complicated by Zolghast being the only person who had the firing codes for the cannon, so the strike team infiltrated his bunker and captured him. With the codes, the Republic agents used the ion cannon to fire on the Separatist fleet in orbit of the planet, disabling it and opening a safe corridor for the main Republic invasion force to reach the planet."}, {"tag": "p", "text": "In the midst of the erupting battle, a unit of clone troopers was sent to collect Zolghast and bring him to the Venator-class Star Destroyer Solidarity. At that moment, the Separatists attempted to rescue Zolghast, sending a Force-sensitive Clawdite shapeshifter, Braxus Lyn, to free him and transport him offworld. Posing as Jedi Master Ezar Elasra, Lyn took custody of the Zygerrian and escorted Zolghast to a Sheathipede-class transport shuttle. While she was preparing the shuttle for takeoff, the Republic launched an attack, attempting to recapture Zolghast. Ultimately, the Republic was able to reclaim Tirahnn."}, {"tag": "h4", "text": "Attack on the Medica"}, {"tag": "p", "text": "At some point during the Clone Wars, a group of Zygerrians led by Colonel M'rch deserted combat and captured the spice transport vessel Wayfarer. However, the ship's engines had been damaged, and the Zygerrians were in dire need of supplies, most importantly bacta to treat their injured. The Zygerrians sent out a distress call, which was soon picked up by the Republic Pelta-class frigate Medica. Hoping to seize the vessel and its cargo of bacta, M'rch allowed the Medica to closely approach the Wayfarer, instead of opening fire as his subordinate Scroon suggested."}, {"tag": "p", "text": "M'rch then had the Wayfarer flood its hull with a magnetic charge, causing the vessel to securely attach itself to the Medica. The Zygerrians used hand torches to cut through the Republic vessel's hull and broke inside. Although most of the Medica's clone troopers were recovering in bacta tanks after a recent encounter with the Confederacy, the remaining troopers still managed to defend against the attack, thanks to the assistance of Obi-Wan Kenobi, to whom the Medica was giving an emergency transport. After all the raiding Zygerrians were subdued, Kenobi promised to treat their wounds with bacta, before turning them over to a prison camp."}, {"tag": "h4", "text": "Other Zygerrian sightings"}, {"tag": "p", "text": "At the later stages of the war, Zygerrians were also seen on the galactic capital of Coruscant. At least two of them were present aboard a train traveling through the Coruscant underworld, where they bore witness to the Coruscant Underworld Police's pursuit of Ahsoka Tano, who was on the run from the Jedi Order after being falsely accused of murder and terrorism. A number of Zygerrians were also seen on the planet Zardossa Stix during that period. One of them, a female, was an ally of the Frangawl Cult, a bloodthirsty organization hailing from the planet Bardotta."}, {"tag": "p", "text": "The Zygerrian female was present on Zardossa Stix when members of the cult tried to sacrifice the Bardottan Queen Julia, whom they had kidnapped from her home planet, to the cult's secret leader, the Nightsister Mother Talzin. When Jedi Master Mace Windu and Gungan Representative Jar Jar Binks arrived on the planet to save the queen, the Zygerrian tried to stop them from chasing members of the cult through the streets of a Zardossan city by throwing her pet tooka into a herd of domesticated eopie creatures, causing them to scatter in panic and slow down the Jedi and his companion. The setback was only temporary, as the pair ultimately succeeded in saving Julia. Another Zygerrian was also present at the stronghold of the criminal Pyke Syndicate on the planet Oba Diah around the time when Obi-Wan Kenobi and Anakin Skywalker visited the world during a mission on behalf of the Jedi Order."}, {"tag": "h3", "text": "The Thanda clan"}, {"tag": "p", "text": "During the early years of the New Order, the Zygerrian Thanda clan became infamous for its daring tactics. The Thandas staged raids on passenger liners and simply spaced—sent into the vacuum of space without a space suit—those they deemed not worth selling as slaves. This attitude provoked several spacers to come looking for the Thandas' leader, Atlee Thanda, to take him down and put an end to his clan's operations."}, {"tag": "p", "text": "Tracing the money of a rich shipping magnate named Brevis Taug, who sponsored the Thanda clan's fleet of slaveships, the spacers reached a space station above Zygerria. There, they sneaked aboard Atlee Thanda's personal yacht, the Scourge, and confronted the clan leader. The Scourge's databanks also revealed to the spacers information regarding other Zygerrian clans' operations."}, {"tag": "h3", "text": "Operations on Kowak"}, {"tag": "h4", "text": "Establishing a power base"}, {"tag": "p", "text": "Shortly after the end of the Clone Wars, King Molec's younger son, Prince Sono Molec, assumed control of the Zygerrian outpost on Kowak. The prince ruled from the city of Sclavos, where he possessed his own palace, which was rumored to have been built upon the ruins of an ancient Sith Temple. Molec converted Kowak into a power base for Zygerrian slavers operating on the border of two regions of the galaxy known as the Slice and the Trailing Sectors."}, {"tag": "p", "text": "The prince established a number of supply outposts on the planet, where fellow slavers could resupply, refuel, and store captured slaves. Seeking to resurrect the Zygerrian Slave Empire in its full glory, Molec also allowed various other factions—such as the Karazak Slavers Cooperative and the Trandoshans—full access to Kowak's facilities. Molec's business prospered for more than a decade, with the prince continuing with the tradition of holding slave auctions, which were accompanied by rich parties held inside the palace. The prince also ran a poaching operation on Kowak, supplying the semi-sentient Kowakian monkey-lizards to buyers across the galaxy."}, {"tag": "p", "text": "At one point, Sono Molec toured Zygerrian holdings in the southern Slice with his older brother, Hordem. Sono's recklessness drew the Zygerrians into a naval battle with the forces of Imperial Captain Ralchio Nervi. The engagement ended with the death of Hordem and the defeat of the Zygerrians, who fled from the battle. The king held Sono responsible for his brother's death and severed all ties to his youngest son, essentially exiling him to Kowak. In turn, holding a grudge against his father, Sono secretly plotted to assassinate him and become the new king. The young Zygerrian prince was also followed into exile by a number of other high-ranking Zygerrians, including the Gemen brothers and Rajim Armin, Atai Molec's former advisor, who became Sono's Captain of the Guard on Kowak."}, {"tag": "h4", "text": "Encounter with Rebel agents"}, {"tag": "p", "text": "Sometime after Sono's exile, a group of Zygerrians affiliated with the prince attempted to capture local Talz on the planet Vlemoth Port, when they encountered Nam Beroya, a Mandalorian warrior who tried to protect the Talz. Beroya was captured and was made Molec's personal slave, forced to fight in gladiator pits on Kowak. As a fighter, he enjoyed a two-year-long undefeated streak, earning himself the nickname the \"Prince's Sword.\""}, {"tag": "p", "text": "Two years after Beroya's capture, Molec made a bet with trade baron Dorn Sevelle of the Karazak Cooperative that Beroya would defeat six vicious Barabels in a fight. However, Beroya was exhausted after a recent fight with a Coynite gladiator, and he lost the subsequent fight with the Barabels. As a result, Beroya ended up in the possession of Sevelle, who was planning to sell the Mandalorian warrior to the highest bidder."}, {"tag": "p", "text": "During this time, a group of Rebel Alliance agents arrived on Kowak in search of allies who could help them repel an upcoming Imperial attack on their repair yard located on the planet Xorrn. Having gained access to a party preceding one of the slave auctions, the agents pleaded before Molec to provide assistance to their cause."}, {"tag": "p", "text": "The prince had no intention of crossing the Galactic Empire, but he decided to use the agents to reclaim Beroya. Sono promised the Rebels that he might consider helping them if they retrieved the \"Prince's Sword\"—failing to mention that the Sword was a living person—which he claimed had been stolen by Sevelle. The Rebels successfully rescued Beroya and gained allies in their fight against the Imperials on Xorrn."}, {"tag": "h3", "text": "The rescue of Arhul Hextrophon"}, {"tag": "p", "text": "Although the Zygerrian slaver business was mostly situated near their homeworld, in the time of the Galactic Empire the Zygerrians also controlled a smaller and less organized Slaver Syndicate based in the Karazak system on the other side of the galaxy. This organization, generally regarded as mere thugs, was controlled by the Zygerrian Pr'ollerg clan, which strongly dictated the Syndicate's politics. The Syndicate, estimated to have over 2,000 active members, actively employed bounty hunters to capture individuals with only minor bounties on their heads in order to sell them as slaves later."}, {"tag": "p", "text": "While working for the Empire, the Zygerrians made deals with Admiral Screed, who obtained three Twi'lek slaves from them—one of them a Force-sensitive named Boc Aseca. Screed praised the slaves' quality to the Emperor."}, {"tag": "p", "text": "Around 3 BBY, a group of Zygerrian slavers captured journalist Arhul Hextrophon and his family. The Zygerrians had been ferrying the captives for months before they were confronted by the smugglers Han Solo and Chewbacca over the planet Janodral Mizar."}, {"tag": "p", "text": "Solo broadcast an Imperial transponder code, claiming that twenty stormtroopers were going to board the slavers' ship to check their shipping licenses, forcing the Zygerrians to abandon ship. Since Janodral Mizar had a law giving slaver profits to their victims, Solo and Chewbacca left the ship and the Zygerrian treasure held aboard it to Hextrophon, departing in their own starship, the Millennium Falcon."}, {"tag": "h3", "text": "Ingan dire Stane's clearinghouse"}, {"tag": "p", "text": "Years before 2 ABY, a Zygerrian slaver named Ingan dire Stane held control of a pirate clearinghouse in the Far Xandil sector. A former mining asteroid, the clearinghouse was a platform where pirates from across the galaxy could trade their stolen goods between each other. It was also a major slaving hub, as crews of ships raided by pirates were being sold into slavery far away from where they had been originally captured. Since the clearinghouse was located in a backwater sector with very little Imperial or Rebel presence, Stane's business prospered."}, {"tag": "p", "text": "At one point, Stane acquired a Lorrdian female named Aral tukor Viest as his personal slave. Viest served the slaver as his most prized pet, entertaining his needs and desires. Over time, Stane began giving Viest increasingly more freedom, which proved to be his undoing, as Viest slowly began taking control of the Zygerrian's business over the course of several years. She eventually killed her master by slitting his throat and became the sole owner of the clearinghouse, the so-called \"flightmaster.\""}, {"tag": "h3", "text": "Other victims of the Zygerrians"}, {"tag": "p", "text": "Another member of the species, Marko Tyne, conducted unlicensed slavery in nine of the Thesme sector's star systems. For these acts, he was wanted dead or alive by Thesmian authorities. A short time after the Battle of Yavin, Tyne was killed by the bounty hunter Beilert Valance in the Junction City cantina on the planet Feriae Junction."}, {"tag": "p", "text": "At some point during the Galactic Civil War, the pirate Jondrell Inx captured Cressis Linrec, the daughter of Imperial Governor Linrec, and held her hostage on the planet Kallistas. Inx demanded that the governor pay a large ransom for his daughter, threatening to sell her to the Zygerrian Slavers Guild. Governor Linrec assigned Kallistas's governor, Dengless Rinn, to rescue his daughter. In turn, Rinn hired three bounty hunters to rescue the girl, hoping to resolve the situation quickly and keep Linrec's attention away from the planet, since Rinn himself was plotting an elaborate scheme against his superior governor."}, {"tag": "p", "text": "Following a pirate raid on her family's transport, a young Human female named Janildakara was sold into slavery to the Zygerrians, who branded her on the neck. After enduring the life of a slave for several years, Janildakara escaped and became a bounty hunter in the females-only House Renliss chapter of the Bounty Hunters' Guild. She hoped to use the Guild's help to find her family, who had not been heard of since the pirate attack."}, {"tag": "p", "text": "Around 3 ABY, the Calian Lobar Aybock was given to the Zygerrian slavers by the Galactic Empire, after being deemed unworthy to become a stormtrooper. Aybock's freedom was eventually bought by the Chevin Eedund Cus, who went on to train him in shockboxing, helping Aybock to become a champion in that sport. Contrary to their general reputation, not every Zygerrian was involved with criminal activities. Some individuals abandoned their species' traditional ways and became law-abiding members of galactic society."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The Zygerrians were originally created for The Star Wars Sourcebook, written by Bill Slavicsek and Curtis Smith, and published in 1987 as the first sourcebook for the West End Games Star Wars: The Roleplaying Game. The species was mentioned in the book's Han Solo entry, which was presented as an in-universe piece authored by Arhul Hextrophon, describing the story of Hextrophon's capture by the Zygerrians and subsequent rescue by Solo and Chewbacca."}, {"tag": "p", "text": "However, the 2005 Star Wars Miniatures article \"Showdown on Junction,\" the fifth mission scenario in \"The Hunt Within: Valance's Tale\" campaign, written by Jason Fry, retroactively identified Marko Tyne, a character from the Marvel comic book Star Wars 27, as a Zygerrian. Thus, the species' first canon appearance is considered to have taken place in that comic story, which was written by Archie Goodwin and published on June 26, 1979."}, {"tag": "h4", "text": "Star Wars: The Clone Wars continuity"}, {"tag": "p", "text": "The Zygerrian species played a substantial role in the Star Wars: The Clone Wars multimedia project. Writer Henry Gilroy originally developed a story outline involving the Zygerrians while working on the first season of The Clone Wars television series. However, Gilroy's proposed story was deemed too complex for the series at that point, so it was not produced as episodes for the show. Instead, Gilroy's story was realized as Slaves of the Republic, a 2008 story arc of The Clone Wars comic series. Written by Gilroy himself and illustrated by Scott Hepburn, this story tied into the television series."}, {"tag": "p", "text": "George Lucas, the creator of the Star Wars franchise, liked Gilroy's comic story enough to request that it be adapted as future episodes of the show. In 2011–2012, the Slaves of the Republic comics were adapted into three episodes of the television series, titled \"Kidnapped,\" \"Slaves of the Republic,\" and \"Escape from Kadavo.\" The episodes followed the same premise as the comics but featured a number of differences, most notably a visual redesign for the Zygerrians that conflicted with their previous depiction in both the comic series and the 2009 Galaxy at War sourcebook. The redesign was a result of the series' creative team wanting to make the Zygerrians a species that was unmistakably unique in its features."}, {"tag": "p", "text": "Furthermore, series Supervising Director Dave Filoni felt that the Zygerrians' comic-book design would appear on screen as if it were coming from a television show with limited makeup resources for aliens. The first designs of the Zygerrians created for the show by artist Darren Marshall were fairly bat-like and monstrous. Ultimately, Filoni decided to give the Zygerrians a more coyote-like appearance, believing that the mythological character Coyote's reputation as a trickster would make the species look more deceitful. In turn, the Zygerrian culture and architecture of their home planet were influenced by real-life Babylonian designs."}, {"tag": "p", "text": "There exists no official in-universe explanation for the two different Zygerrian designs, although Lucasfilm continuity manager Leland Chee speculated that there could be two Zygerrian subspecies. This article currently follows the events as portrayed in the television series, in accordance with Chee's statement that the series supersedes the comic books in terms of continuity."}, {"tag": "h4", "text": "Information superseded by the television series"}, {"tag": "h5", "text": "Appearance and society"}, {"tag": "p", "text": "According to the Slaves of the Republic comic series, which was published prior to the species' redesign,—as well as Galaxy at War, which built upon the comic series' portrayal of the species—the Zygerrians lacked any fur on their bodies. They had predominantly red hair, which some individuals preferred to style in ponytails and braids. Some Zygerrians also weaved various beads into their hair for aesthetic purposes. The species' most distinguishing feature was a series of bony spurs that protruded from beneath their skin on the face, giving them a jagged appearance."}, {"tag": "p", "text": "Most male members of the species usually had two larger spurs extending from the chin and a number of smaller ones that grew along the brow ridge and on other parts of the face, although there were exceptions, and some had only the chin spurs or none at all. Additionally, females had fewer spurs than males, but they instead had somewhat longer ears. The species' eye color varied from green to yellow or brown."}, {"tag": "p", "text": "Members of the species commonly wore red vests, with straps that stretched across their torso and held multiple pockets. Those outfits were worn in combination with spiked gauntlets. Zygerrian guards wore heavy armor, with helmets that completely covered their faces. At the time of the kidnapping of the people of Kiros, Queen Scintel wore a flowing white dress that had long sleeves and exposed the top part of her chest. Scintel's alternative set of attire consisted of a black jacket and a black cap."}, {"tag": "p", "text": "The comic books implied that the Zygerrians were generally viewed as primitive, while the television series referred to them as an advanced civilization. The comics also featured a Zygerrian law enforcement organization called the Sky Guard, which was absent from the on-screen adaptation. The position of Captain of the Guard—held by Atai Molec in the television series—is instead held by a Zygerrian named Slego in the comic series. In turn, Molec is merely addressed as an aide to Queen Scintel in the Slaves of the Republic comics."}, {"tag": "h5", "text": "Comic series' storyline"}, {"tag": "h6", "text": "From Kiros to the Shi'kar Straits"}, {"tag": "p", "text": "The Slaves of the Republic comic-book series was originally set early in the Clone Wars. However, the television-series adaptation took place later in the war's timeline; therefore, certain adjustments had to be made to the story. In the Slaves of the Republic, Count Dooku offers Queen Miraj Scintel an opportunity to expand the Zygerrian criminal empire into the Core systems with slaver franchises. When Scintel agrees, she is granted a place in the Separatist Council as Minister of the Slavers Consortium. In turn, the Confederacy stations its space forces in orbit of Zygerria, including at least one Lucrehulk-class Droid Control Ship."}, {"tag": "p", "text": "Meanwhile, Onyx, a Zygerrian slaver active during the Clone Wars, has been performing slaver operations in the Shi'kar Straits region on his vessel, the Fate's Hand, crewed by a number of Zygerrians, including Teek and the mechanic Ikis. At some point, Onyx has decided to capture a blixus. Although half of Onyx's crew is killed while bringing the blixus aboard the Fate's Hand, the creature is successfully placed in a tank inside the ship."}, {"tag": "p", "text": "Having liberated Kiros and witnessing that the Confederate commander Xerius Ugg was in contact with the Zygerrians, Obi-Wan Kenobi and Anakin Skywalker assault Onyx's ship in order to learn about the missing people of Kiros. Onyx releases the blixus, hoping that it will kill the Jedi. Instead, Kenobi and Skywalker kill the creature and capture Onyx and his crew, using their vessel to reach Zygerria. As rumors spread that the Separatists have captured the missing people of Kiros—despite Dooku's efforts to cover his tracks by lying that the Jedi killed the Togruta colonists—Dooku orders Scintel to delay the slave auction, but the queen refuses to comply."}, {"tag": "h6", "text": "Events on Zygerria and Kadavo"}, {"tag": "p", "text": "Promoting the Togrutas as prisoners of the Separatists, Scintel begins the auction, which gathers many influential figures, including representatives of the Smugglers Guild and two of the most influential figures of the Separatist Council: Techno Union Foreman Wat Tambor and Commerce Guild Presidente Shu Mai. After the Jedi's attempted escape, the auction is ruined, as the Separatists have fled at the first sign of trouble. Despite Dooku's orders to execute the captive Jedi immediately, the queen keeps them alive."}, {"tag": "p", "text": "Scintel's open promotion of the Togrutas as Separatist captives inspires fear throughout many neutral worlds in the galaxy and induces them to join the Republic. It also conflicts with Dooku's account that the Togrutas were killed by the Jedi. As Scintel's slave, Skywalker saves her from an attempt on her life by Bosso Weex, the leader of a group of spice runners, whose men have been enslaved by the Zygerrians."}, {"tag": "p", "text": "When Dooku comes to confront the queen on Zygerria, he is accompanied by the Dark Acolyte Asajj Ventress. After Dooku has killed Scintel, Ventress engages Skywalker in a lightsaber duel, but the Jedi escapes."}, {"tag": "p", "text": "Fearing that the liberation of the slaves might prove him a liar, Dooku sends Ventress and General Grievous to kill everyone on Kadavo. In a three-way battle between the Republic, the Confederacy, and the Zygerrians led by the Keeper, the Republic emerges victorious. The slaves are liberated, the labor processing hub is destroyed, the Keeper is captured, and the Togrutas are resettled on Kiros, where they are taught to defend themselves."}, {"tag": "h3", "text": "Other inconsistencies"}, {"tag": "p", "text": "In 2003, the \"Zygerrian Takedown\" mini-adventure for Wizards of the Coast's Star Wars Roleplaying Game, written by Jason Fry, addressed members of the Zygerrian species as simply \"Humans.\" Later, Fry's 2005 \"Valance's Tale\" article introduced the retcon that identified Marko Tyne as a Zygerrian. Thus, the Zygerrians' eventual depiction in The Clone Wars project introduced a conflict, as the Human-looking Tyne did not share any similar features with either the jagged Zygerrians from the Slaves of the Republic comic or the feline Zygerrians from the television series."}, {"tag": "p", "text": "Although published after the Zygerrian redesign in the Star Wars: The Clone Wars television series, the Star Wars: Force and Destiny Core Rulebook, a 2016 supplement for Fantasy Flight Games' Star Wars: Force and Destiny roleplaying game, addressed the Zygerrians as a \"red-furred\" species, which is more reflective of their original design from the Slaves of the Republic comic series."}, {"tag": "p", "text": "An inconsistency regarding the spelling of the species' name previously persisted in several Star Wars: The Roleplaying Game sources. Whereas The Star Wars Sourcebook originally spelled the name \"Zygerrian,\" a few subsequent supplements alternatively spelled the name \"Zygerian.\" However, all later sources, including all Star Wars: The Clone Wars material, have followed the original spelling with two R's."}, {"tag": "h3", "text": "Friends Like These gameplay alternatives"}, {"tag": "p", "text": "In 2017, the Zygerrians were prominently featured in Friends Like These, an adventure scenario published by Fantasy Flight Games for the Star Wars: Age of Rebellion roleplaying game. The scenario's storyline is described in this article up until the rescue of Nam Beroya. From that point on, the adventure presents two diverging paths that the players may take."}, {"tag": "p", "text": "They can possibly side with Beroya and instigate a slave revolt on Kowak, overpowering Prince Molec and his guards. In that case, former slaves liberated by the Rebels will accompany them to Xorrn. Alternatively, the players can deliver Beroya back into Molec's custody, after which they will be granted an audience with the prince."}, {"tag": "p", "text": "In the latter scenario, the Rebels can then inform Molec that the assault on Xorrn will be led by Captain Nervi, who killed Sono's brother and indirectly caused the prince's exile to Kowak. The players can try other incentives to convince Sono to join them; regardless of the reason, Sono is convinced to participate in the defense of Xorrn, providing a large number of Zygerrian troops and aerial support. As a precaution, Molec equips himself with a life-sign monitor tied to Beroya's and other slaves' explosive collars. That way, if Molec was to die, all the slaves would die with him."}, {"tag": "p", "text": "After the successful resolution of the battle, players are presented with an adventure hook involving Molec's plans to assassinate his father. When Molec is invited to his homeworld for an audience with his father, players have the option of accompanying him and helping him exact his revenge against King Atai Molec."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}