{"url": "Zzzzyxxx", "categories": ["Category:Legends articles", "Category:Guards", "Category:Individuals of unidentified species", "Category:Males", "Category:Star Tours personnel"], "nodes": [{"tag": "h1", "text": "Zzzzyxxx"}, {"tag": "p", "text": "Zzzzyxxx, also spelled Zzyxx or Zyzx, was a male officer who worked for Star Tours as a security guard for spaceport customs. Zzzzyxxx possessed his own workstation, where the officer would also control safety for Star Tours flights, as well as keep track on information such as the weather in destinations such as Cloud City, on Bespin. He commonly spoke a language other than the Galactic Basic Standard, and wore spectacles, a Star Tours uniform and kept a company mug on his desk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Officer Zzzzyxxx is a character that was seen only at the end of Tokyo's version of Star Tours before its revamp as Star Tours: The Adventures Continue. The figure design was recycled for the character Sonny Eclipse at Cosmic Ray's Starlight Cafe at Walt Disney World's Magic Kingdom park. According to Imagineer Kevin Rafferty, the two characters are intended to be cousins. A musician, Sonny Eclipse identified himself as a \"Zorkie\" from the city of \"Yew Nork\" on the planet \"Zork\". The character was named by Imagineering show writer Kevin Rafferty, who took inspiration from seeing an off-ramp sign for a \"Zzyxx Road\" while driving to Las Vegas."}, {"tag": "p", "text": "According to Daniel Wallace, Zzzanmxl was the last entry in the Holocron continuity database as of 2008, which means that, by then, Zzzzyxxx did not have his own entry in it."}, {"tag": "p", "text": "Zzzzyxxx's name has spelled three different ways in various official sources - \"Zzzzyxxx\" in \"Star Tours: Taking Off on a Star Tour\" (Star Wars Insider 104), \"Zzyxx\" in several issues of Disney News Magazine, and \"Zzyzx\" in Magic Journey: My Fantastical Walt Disney Imagineering Career."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}