{"url": "Zzzs", "categories": ["Category:Canon articles", "Category:Individuals of unspecified gender", "Category:Members of Kkkt's clan", "Category:Southern Mustafarians"], "nodes": [{"tag": "h1", "text": "Zzzs"}, {"tag": "p", "text": "Zzzs was a Southern Mustafarian. He and Father Kkkt saw the arrival of Darth Vader's ship on Mustafar. When Vader began building a structure to channel the Force, it caused a lot of lava storms to erupt all over the planet, and Zzzs gathered his people while Kkkt tried to hold it off. After the fifth storm, Kkkt explained to Zzzs that they must rally the other clans to destroy the structure."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point, Zzzs and Father Kkkt witnessed the arrival of Darth Vader's ship on Mustafar. As the ship flew across the sky, set afire due to entering the planet's atmosphere without shields, Zzzs asked Kkkt what it was. Kkkt thought it was an omen, and he examined the falling object through a ring of lava he had manipulated using The Force. Fearing this new arrival, Kkkt sent a scout party out to investigate it, but only Rrrn returned. He described a dark figure—being Vader—who single-handedly dealt with the rest of the scout party."}, {"tag": "p", "text": "Vader and the spirit of an ancient Sith began building a structure in the Gahenn Plains. It was meant to channel the Force energies from a dark side locus to open the door to another realm. However, each design kept failing. Every time the attempt was made, lava storms erupted on the Mustafarians. Kkkt tried to keep them at bay while Zzzs gathered their people, but the storms were getting worse. Kkkt contacted the other clanholds, who were experiencing the same thing. He decided to gather them all in an attempt to destroy the structure being built."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like other Mustafarians, Kkkt wore armor and a breath mask as protection against Mustafar's heat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zzzs first appeared in the comic Darth Vader: Dark Lord of the Sith 21, written by Charles Soule, penciled by Giuseppe Camuncoli, and published by Marvel Comics on September 12, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}