{"url": "Biggs_Darklighter/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Darklighter family", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Navy officers of the Galactic Empire", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Males", "Category:Moisture farmers", "Category:Red Squadron personnel", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Biggs Darklighter"}, {"tag": "p", "text": "Biggs Darklighter was a Human male starfighter pilot who served the Alliance to Restore the Republic and a childhood friend of Luke Skywalker during the time of the Galactic Civil War. Darklighter flew a T-65 X-wing starfighter with Red Squadron during the Battle of Yavin as Red Three, where he fell victim to Skywalker's father, Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (24 BBY–0 BBY)"}, {"tag": "p", "text": "Darklighter was born on Tatooine to the local agricultural magnate Huff Darklighter and his wife. He was raised a privileged child. The elder Darklighter owned dozens of moisture farms and bought water from other farmers at cut-rate prices. The water he did not use to irrigate his own crops he sold at high prices. As a teenager, Darklighter spent much of his time in the town of Anchorhead, where he met young Luke Skywalker. A strong friendship quickly developed between the two. Together, along with their friends Janek \"Tank\" Sunber, jealous Laze \"Fixer\" Loneozner, Camie Loneozner, and tagalongs \"Deak\" and Windy Starkiller, they would often socialize at Tosche Station, a power distribution center just outside Anchorhead."}, {"tag": "p", "text": "The strong bond between Darklighter and Skywalker was fueled by an intense undercurrent of competition that kept their lives charged. Together, they raced landspeeders through the streets of Anchorhead and T-16 skyhoppers through Beggar's Canyon in the Jundland Wastes \"tagging\" womp rats. They constantly pushed one another to the limit, becoming expert pilots. Skywalker was a better shot in his T-16, but Darklighter was the better pilot in his newer model. During one run through the canyon, Darklighter \"threaded\" his way through a small opening in a sixty-meter spindle of rock known as the Stone Needle, giving him near-legendary status among the Anchorhead residents. Skywalker, of course, was soon forced to match the feat."}, {"tag": "p", "text": "Darklighter and Skywalker also engaged in another semidangerous sport, \"invented\" by Fixer. Sandsurfing involved a \"surfer\" wearing repulsor disks on their feet while being dragged behind a sand skiff. Fixer, jealous of the superior piloting skills of his two friends, invented an obstacle course through the Dune Sea to prove himself better than they. During one run over the Great Pit of Carkoon, Fixer was knocked unconscious and fell towards the maw of the Sarlacc. Fortunately, Darklighter and Skywalker were able to save their friend. Not wishing the stunt to be duplicated, the two declared Fixer \"king of the sandsurfers.\""}, {"tag": "p", "text": "While young, Darklighter developed a romantic caring for Kandji, a local girl. She was captured by Tusken Raiders; by the time the rescue party arrived, she was dead, and all they could do was take revenge. He carried a hologram of her for the rest of his life."}, {"tag": "p", "text": "As Darklighter and Skywalker grew older, the two friends planned to attend the Imperial Academy together. They also planned on buying a starship after graduation and go into business together, though they did not have any specific plans as to what they would do. Darklighter's father arranged for his son's commission into the Prefsbelt IV Naval Academy, where Tank was also accepted. However, Skywalker's uncle, Owen Lars, kept his nephew behind on Tatooine for \"another season.\" A short time before Darklighter departed, the Anchorhead gang had a celebration and race in Beggar's Canyon. The adventure ended in battle when a clan of Tusken Raiders attacked. When Darklighter was wounded by a Raider's gaderffii stick, Skywalker was forced to pilot him to safety through the treacherous Diablo Cut."}, {"tag": "p", "text": "Darklighter was a skilled mechanic. He told Skywalker that a true pilot should know every last detail about his ship and how it works. So, just prior to leaving for the Academy, he decided to build a T-16 from scratch with some small assistance from Skywalker. The finished product, as Darklighter admitted, was a bit rough around the edges, but he was still proud of his work and insisted he could hold his own in his new craft against any pilot. Skywalker simply laughed in his face at the scrap heap. This angered Darklighter to an extent to which Skywalker had never seen him before, and the older man challenged his friend to a race through the canyon. What Skywalker thought would be a simple test run turned out to be a heated race, with Darklighter blasting out of the hangar without a word. His new T-16 began to shake and sway almost immediately. A lesser pilot would have been forced to slow down to maintain control. Darklighter only increased his speed. The race only lasted for about five minutes before Skywalker finally caught up with him. Just as he was about to commend Darklighter on his performance, pieces began to drop off of the makeshift T-16, including the engine. The craft crashed to the ground, rolling end-over-end several times before coming to a stop. Skywalker raced to the downed craft to check on his friend, but Darklighter was not in the pilot's seat. Fearing his friend had been fatally ejected from the craft, Skywalker was soon tackled from behind by a laughing Darklighter. Skywalker never knew exactly how Darklighter had managed to survive the crash."}, {"tag": "h3", "text": "Mutiny on the Rand Ecliptic"}, {"tag": "p", "text": "While at the Prefsbelt IV Naval Academy, Darklighter was taught by Soontir Fel along with fellow cadets Derek Klivian and Tycho Celchu. Darklighter and Klivian were wide-eyed youths who began to see the galaxy as more than just the Galactic Empire. When they and several classmates made contact with the Rebel Alliance while on a trip to the planet Bestine IV, their rebellious ideals began to take form. They met secretly with men who shared their ideals and, in their youthful naiveté, planned how they would single-handedly overthrow the Empire. The meetings were more brave talk than anything else. But the Academy Commander thought otherwise. He found out about the meetings from an informer and immediately apprehended the participants. Luckily for Darklighter and Klivian, they had been absent from that particular meeting, so were not on the informer's list. Additionally, the others had not revealed the two as members of the group. But their friends were taken and never seen again. At first, the two had thought it was simply a prolonged period of punishment or isolation. Then they thought their friends had been transferred to another unit. But gradually the cold reality of the situation made itself evident to them."}, {"tag": "p", "text": "They never truly learned what the Empire had done with their friends, but the effect on the two surviving cadets was profound. No longer did they talk childishly of overthrowing the Empire. Now, they talked seriously of deserting to join the Rebellion. He attended several social functions as a cadet, and among the people he met was Rivoche Tarkin, a prep school student at Clær and niece of Grand Moff Wilhuff Tarkin. His secret distaste for the Empire became known to her, and influenced her thinking regarding the New Order."}, {"tag": "p", "text": "Darklighter and Klivian kept biding their time until after graduation, at which point they were both fortuitously assigned to the same ship — the space-freighter Rand Ecliptic. It was a relatively small ship, so both of the youthful officers were given important assignments aboard it. Darklighter was made first mate and Klivian ship's executive officer. In his new post, Darklighter saw that the Empire endorsed expediency over honesty, and that the deaths of innocents were considered an acceptable price to pay for covering one's mistakes."}, {"tag": "p", "text": "A few short weeks later while on a mission to the newly-established Imperial Naval Yard in the Bestine system, Darklighter and Klivian put their plan of joining the Rebellion into action. The plan was to jump ship, locate Klivian's friend Lindy who had friends in the Rebellion, and join them. Their official mission was to make contact with the shipyard personnel to deliver a shipment of rubindum ore. Strangely, the ship's captain, Heliesk, sent both Darklighter and Klivian, uncharacteristic of his usual policy of assigning at least one to stay aboard at all times. This made the two men uneasy, fearing that he suspected something. But instead of seeking out the shipyard personnel, Darklighter and Klivian would instead spend their time seeking out Lindy, who soon found them. Lindy ushered the two men into a hangar where a group of friends who smuggled starship parts and raw materials to other Alliance contacts out of the system were waiting. There, Lindy told them he was awaiting the arrival of a new Rebel contact, known to him only as \"Starfire.\" The group was horrified when the hangar door opened and a squad of Imperial stormtroopers filed into the domed shell led by Captain Heliesk. The Imperials surrounded the group and Heliesk ordered Darklighter and Klivian to be taken back to the ship where they would be held prisoner, but not before dropping a rank cylinder into Klivian's hand."}, {"tag": "p", "text": "Back on the ship, the two discovered that the rank cylinder served as a key to the captain's quarters. When they were finally alone, they headed straight for them, where they met Heliesk once more. The captain, it turned out, was a Rebel spy — he was \"Starfire.\" With such valuable connections in the Empire, he could not afford to be exposed as an Alliance sympathizer. The solution, then, was that Darklighter and Klivian would stage a mutiny. The two were able to force the crew to abandon ship by setting the Ecliptic to self-destruct. With the help of Lindy and his friends, they manned the bridge and prepared to depart the planet with their valuable cargo of ore. As the ship left the planet, however, they were soon intercepted by a considerable number of TIE/LN starfighters stationed on Bestine IV. The Rand Ecliptic's feeble weaponry was ill-equipped to handle the attacking TIE fighters, but they only needed time to make the calculations for the jump to hyperspace. However, Darklighter quickly thought of a scheme. He turned the ship's starboard side toward the incoming swarm of fighters, and dumped half of the ore consignment directly into their path, creating a small-scale asteroid field. Few of the fighters were able to evade the tumbling and deadly ore. The few that did survive were unable to stop Darklighter, Klivian, and the Rand Ecliptic from entering hyperspace en route to a new life with the Rebel Alliance."}, {"tag": "h3", "text": "Service with the Rebellion"}, {"tag": "p", "text": "After deserting the Ecliptic, Darklighter officially joined the Rebel Alliance along with Derek Klivian. They would eventually become two of the Rebellion's most talented pilots and valued members. Their first assignment was service together in the Ecliptic Evaders, a squadron of Rebel starfighter pilots stationed in the Sullust system. Although Darklighter and Klivian were inseparable comrades, circumstances eventually parted them. At that time, graduates of the Imperial Academy and valued leaders such as these were extremely rare in the ranks of Rebel pilots, and General Jan Dodonna had little choice but to assign them to outposts where they could be most effective."}, {"tag": "p", "text": "In his first mission, Darklighter flew jointly with Wedge Antilles in an attack against an Imperial convoy protected by an EF76 Nebulon-B escort frigate, shortly after the new capital ships were assigned to protect convoys against Rebel starfighter attacks. The frigate launched its complement of two dozen TIE fighters at their squadron. Darklighter was able to destroy five enemy fighters, officially earning him the title of starfighter ace. However, another pilot, Amil Karsk, claimed his number-three kill, to make him an ace. Karsk was on his fifteenth mission at the time, and Darklighter allowed him to claim the kill as his own. From thereafter, when Darklighter ever achieved five of something, he would playfully give the third one to Karsk as a constant reminder. Following suit, Karsk later took the third of five scheduled patrols Darklighter was assigned to. The third mission was simple enough: escorting a CR90 corvette on a courier mission to Alderaan. The mission even promised a couple days of rest and recreation, but Darklighter gave it to Karsk regardless and was willing to call it even. Karsk was present on Alderaan when the first Death Star destroyed the planet. Darklighter would go on to develop a reputation as a great pilot with the Rebellion, piloting an X-wing in several space battles. He participated in a mission to steal a large number of X-wings from an Incom Corporation facility."}, {"tag": "p", "text": "Some time after joining the Rebellion, Biggs attended the debutante ball of Rivoche Tarkin, passing information from her to his Rebel contacts that served to avert a CompForce assault of the Duros Allied Army. Thrilled by the success of this, Tarkin wished to continue her work as a covert agent, and Darklighter put her in touch with the Alliance to continue her work."}, {"tag": "p", "text": "Shortly after the defeat of Operation Strike Fear, Rebel outpost AX-235 in the Cron Drift intercepted schematics for the the first Death Star using stolen Imperial communications satellites. Due to the importance of the information, they decided to send it by courier. Darklighter was sent in an X-wing to retrieve the data. However, after leaving AX-235, the power generator on Darklighter's X-wing broke down and he came under attack by Imperial forces. The Mon Calamari Star Cruiser Independence sent three R-22 Spearheads to protect him until a rescue team of CR90 corvettes and Lambda-class shuttles could arrive and repair his ship. After escaping the attack, he delivered the plans to the Independence and became friends with two of the pilots who had assisted in his rescue, Keyan Farlander and Samuel Raider. Darklighter's successes earned him an assignment to protect Massassi Station on Yavin 4."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Darklighter made a final trip to his native Tatooine. He visited his father, and tried to convince him of the Empire's evil. The elder Darklighter had little to say, noting that his son had already made his mind up. Later, he and Skywalker enjoyed an unexpected reunion at Fixer's shop in Tosche Station. Skywalker eagerly told Darklighter and his friends, Camie, Fixer, Deak, and Windy, of a battle he had witnessed in the skies above the planet. Using Skywalker's electrobinoculars to check for himself, Darklighter saw nothing but two ships sitting in orbit, and assured his friend it was just two ships refueling. Later in private, Darklighter told Skywalker that he and his friends in the service had made contact with the rumored Rebel Alliance and that they were going to jump ship and join them. He purposely kept the whole truth from Luke—that he had already jumped ship and joined the Alliance—to protect him from the full details of his experience with the Rebellion. The two childhood friends shared a bittersweet good-bye. Luke then told Biggs that he would always be the best friend he would ever have. Darklighter left the next morning."}, {"tag": "p", "text": "After his Tatooine visit, he went with a team to Commenor to escort a shipment of R2-series astromech droids carried by smuggler Captain Nera Dantels on her spaceship Starduster. Darklighter became romantically involved with Dantels. With the threat of the approaching Death Star, Darklighter was assigned to the X-wing Red Squadron under the call sign Red Three. Just prior to the engagement, he was reunited once again with Skywalker, who was to fly as his wingman as Red Five. The two friends shared a brief conversation, in which they promised to catch up on each other's stories when they returned. Darklighter reassured Red Leader Garven Dreis that Skywalker was \"the best bush pilot in the Outer Rim Territories.\" Just as they had in their youths, the two friends would once more be flying side by side defying death at every turn. This time, they would be flying against the Empire's greatest superweapon."}, {"tag": "p", "text": "During the assault on the battlestation, Darklighter narrowly escaped death when a TIE fighter dropped in on his tail. Unable to elude his attacker, he was saved when the TIE was destroyed by Skywalker's X-wing. He would go on to destroy several TIEs himself. It was Darklighter's original task, along with Skywalker and Antilles, to provide air cover first for Gold Squadron's attack run on the Death Star's thermal exhaust port, and then the subsequent approach led by Red Leader. When both attacks failed and all pilots were shot down, it was left up to the triumvirate of Skywalker, Darklighter, and Antilles."}, {"tag": "p", "text": "The three pilots began their own attack run down the Death Star trench, with Skywalker in the lead and Darklighter and Antilles flanking him for cover. Unfortunately, they were pursued closely by Darth Vader and two other TIE fighters. More than anything, it was the duty of Darklighter and Antilles to simply act as a buffer between the enemy fighters and Skywalker. If that meant they had to intercept attacking laser blasts, then so be it. As they neared the exhaust port, Antilles was first hit and had to abort the run. Darklighter was hit next. His X-wing, along with his astromech R2-F2, was destroyed in a blast from Vader's ship. Skywalker choked back remorse, knowing he still had a job to do. His proton torpedoes destroyed the Death Star. Darklighter's death effectively bought Skywalker more time to complete the task although it was only thanks to the unexpected aid of Han Solo that Luke succeeded."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Biggs Darklighter would go down in lore as one of the Heroes of Yavin. His name would forever be associated with bravery and valor among the future ranks of Rebel pilots. After the battle, Princess Leia Organa promised Skywalker that once the fight with the Empire was over, a monument would be erected to the fallen with Darklighter's name in a prominent place, to which Skywalker agreed was something he would have enjoyed. A New Republic starfighter base on Coruscant was later named Biggs Field in his memory. He always wanted to be something, to make a difference, to Skywalker and to everyone else. Although deeply saddened by the loss of his friend, Skywalker did not grieve over Darklighter, for he could still feel him through the Force. He simply regarded Darklighter's death as another level he had reached, the start of something new to which he had once again beaten Skywalker, only to leave him behind to catch up later."}, {"tag": "p", "text": "Although he died before the official formation of Rogue Squadron, Darklighter was considered one of its original members. After the squadron's reformation in the early years of the New Republic, Commander Antilles would often mention Darklighter's name as having died in service to Rogue Squadron in his introductory speech to new recruits as a legend to which they could never surpass. Darklighter's legacy paved the way for his younger cousin, Gavin Darklighter, also of Tatooine, to join the Rogues upon their reformation. The younger Darklighter initially approached Antilles asking for a place in the squadron because of the strong friendship Antilles shared with his cousin. Feeling an obligation to the young Darklighter, he allowed him in to the squadron, to say nothing of his impressive training scores. Gavin Darklighter would go on to more than earn his place with Rogue Squadron. Biggs Darklighter did not leave a goodbye message for his family before his death, leaving his father feeling uneasy. This would prompt Gavin Darklighter to make sure he recorded a message early in his career as a Rogue in the case of his death. He also improvised a maneuver shortly after joining the Alliance. By spinning his starfighter while firing all four cannons, he was able to destroy multiple incoming targets. It was called a Darklighter spin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An intense competitor since his youth, Darklighter was a man incredibly proud of his often superior skill as a pilot, but he was not arrogant. Instead, he would often use his own accolades to push others to be their best. His abilities and natural good looks lent him an air of supreme confidence in whatever he was involved in. In his days prior to witnessing the true tyranny of the Empire, he was overly-enthusiastic, much akin to his young, fellow pilots. He was recognized for his shaggy black hair and mustache. When he was in the Imperial Academy, he was forced to shave his hair and face. Even after the sobering effect Imperial cruelty had on him, he did not totally shed his attitude of blissful sanguinity."}, {"tag": "p", "text": "What slight egotism he did have would show itself as a trademark grin or telling facial expression that would adorn his face, aimed at those whom he had bested, in moments of personal victory. The look would often be the subject of playful derision among his comrades, as testified by Antilles, Klivian, and his cousin Gavin. In the rare occasion he was bested, Darklighter, given his competitive nature, would not allow the other to revel in their glory for very long. He especially would not allow someone to be satisfied or content if they had shortcomings he felt could be corrected. He would constantly get after that person until they did something about it, or until his badgering no longer had an effect on them. He could not abide someone letting their talents go to waste when they could be doing so much more, which is why Darklighter would push Skywalker so hard about going to the Academy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Biggs Darklighter was played by Garrick Hagon in the 1977 release of Star Wars."}, {"tag": "p", "text": "He first appeared in the various script drafts of Star Wars as King Kayos's son and the brother of the princess who would become Leia Organa. He was Luke Skywalker's younger brother and the brother of Windy Marstrap in the second draft. He was changed to Skywalker's friend in the third draft."}, {"tag": "p", "text": "The Essential Guide to Characters gives a birthdate of 24 BBY for Darklighter. Additionally, the revised fourth draft of Star Wars describes him as \"a burly, handsome boy a few years older than the rest.\" However, in the book X-Wing: Rogue Squadron, his cousin Gavin Darklighter, born in 10 BBY, claims to be only \"eight years younger\" than Darklighter, which would give him a birthdate of 18 BBY, making him a year younger than Skywalker."}, {"tag": "p", "text": "Although Darklighter only appears briefly in the film, the movie originally included several scenes, later deleted in the final release, in which he figured much more prominently in the story. The deleted scenes did appear in the novelization and the radio adaptation, where he was voiced by Kale Brown. The scene in which Darklighter and Skywalker are reunited on Yavin 4 was reintroduced in the 1997 re-release of the film. Only a small amount of dialogue was kept out for reasons that can only be speculated as having to do with the release of the Prequel Trilogy, since a small portion of the dialogue deals with Luke's father, Anakin Skywalker."}, {"tag": "p", "text": "While these scenes were cut from A New Hope, they were later used in the A New Hope radio dramatization, A New Hope novelization, and Marvel Star Wars #1, thus establishing that Biggs joined the Rebellion after the events on Tatooine at the beginning of Episode IV. However, in X-Wing: The Official Strategy Guide, it is stated that Biggs participated in the stealing of the Death Star plans, which happened before the events on Tatooine. Years later, in a retcon that helped explain these inconsistencies, the comic story Star Wars: Empire: Darklighter revealed through Biggs' narration that he had already joined the Rebellion, and kept the whole truth from Luke in that deleted scene to protect him."}, {"tag": "h3", "text": "TIE pilot flight gear"}, {"tag": "p", "text": "The TIE pilot gear depicted in Darklighter uses artistic license, and is shown with a feature the editors point out is not canon. The artists of the comic wanted to show Biggs' face, so the character was drawn with a clear face plate sealing the helmet in addition to the recognizable black TIE pilot helmet visor. This was added only so that the artist could give the characters identity and allow them to express facial emotions."}, {"tag": "p", "text": "In 2008, Hasbro released an Evolutions-series Legacy Collection action figure set that depicted Biggs Darklighter in the TIE pilot gear from the Empire comic with removable open-faced helmet, removable life support pack, and Biggs' SE-14r light repeating blaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}