{"url": "Biivren", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Biivren locations", "Category:Biivren sector", "Category:Expansion Region planets", "Category:Factory worlds", "Category:Galactic Empire planets", "Category:The Slice planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Biivren"}, {"tag": "p", "text": "Biivren was a planet located in the Expansion Region's Biivren sector. An industrial world controlled by the Galactic Empire, it was the site of a large zone of factories and refineries that gradually contaminated the planet's water supply."}, {"tag": "p", "text": "The Blood Razors swoop gang operated on Biivren and protected the industrial sector's inhabitants. Following the Battle of Endor, Imperial forces retreated from Biivren, leaving the world to face a shortage of drinking water. A group of free-traders subsequently shipped in large amounts of potable water to sell it to the highest bidder."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Biivren was a terrestrial planet located in the Biivren system, a part of the Biivren sector in the Slice portion of the Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Biivren was controlled by the Galactic Empire and served as a minor industrial world. When Biivren was taken over by large corporations, the Blood Razors swoop gang was formed to assist the outcast inhabitants of the planet's industrial sector. Biivren was mentioned in the Smuggler's Handbook, a book authored by the smuggler Platt Okeefe."}, {"tag": "p", "text": "Within six months of the Battle of Endor, a confrontation between the Empire and the Rebel Alliance in 4 ABY that saw the demise of Emperor Palpatine and the fragmentation of the Empire, the Imperial forces on Biivren withdrew from the planet. In the process, several of Biivren's factories and chemical plants were scuttled, intentionally finalizing the contamination of the planet's supply of water."}, {"tag": "p", "text": "Around that time, a group of free-traders learned of the situation on Biivren. The traders hatched a plan to transport drinking water to Biivren and sell it to the highest bidder. Locating a source of large amounts of potable water, the group shipped it past pirates present in the Biivren system and subsequently located sales contacts in Biivren starport. In the process, the free-traders encountered greedy government officials, competing merchants, and crimelords wishing to control the trade in water."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Although Imperial forces on Biivren frequently carried out patrols in the planet's industrial sector, vagrants, petty criminals, and refugees made up an entire society that thrived there. The swoop gang known as the Blood Razors operated in Biivren's factory area, chiefly trafficking black-market goods to the underground and redistributing materials stolen from Imperial forces. The gang avoided being noticed by Imperial forces on the planet by covering up their activities with swoop chases."}, {"tag": "p", "text": "The Blood Razors frequently made forays outside of their territory in order to raid Imperial and corporate facilities, attack convoys belonging to the corporations, and annoy officials of the planet's starport. In addition, while Biivren's industrial sector was officially governed by Imperial and local corporate authorities, the Blood Razors were the source of real order and justice in the area, with the local inhabitants being under their protection and most of the intruders there being subjected to harassment."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Outside the sprawling Biivren starport and the planet's business and residential districts, automated factories, chemical plants, and refineries stretched on for  kilometers. Biivren's industrial sector was honeycombed by greasy alleys, and the planet also featured Imperial supply depots. All of Biivren's industrial facilities were gradually contaminating the planet's water supply."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Biivren was introduced in \"Recon & Report: The Journey to Coruscant,\" a May 1994 article authored by Peter Schweighofer and published in Star Wars Adventure Journal 2. \"Recon & Report\" includes an adventure seed for use with the West End Games' Star Wars: The Roleplaying Game, and this article assumes the scenario plays out as described. The 2009 reference book The Essential Atlas placed the Biivren system, and therefore the planet Biivren, in grid square P-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}