{"url": "Bilbringi_Shipyards", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire shipyards", "Category:Northern Dependencies space stations"], "nodes": [{"tag": "h1", "text": "Bilbringi Shipyards"}, {"tag": "p", "text": "The Bilbringi Shipyards, or the Bilbringi repair yards, were a major military production facility first controlled by the Galactic Empire, then later the New Republic. Located in orbit with the asteroid Bilbringi VII, the shipyards were a mass of dockyard platforms, partially built starships, and construction vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bilbringi and its shipyards were a major component of Grand Admiral Thrawn's war machine. He turned the facility, under the command of General Drost, almost exclusively to the production of Star Destroyers. Several times during the Thrawn Crisis, smugglers infiltrated the yards to sabotage ships.[source?]"}, {"tag": "p", "text": "In 9 ABY, Talon Karrde and his crew saw the Empire working on a group of asteroids which were being outfitted with cloaking devices. Karrde would later give the data to the New Republic after Thrawn used the asteroids to lay siege on Coruscant."}, {"tag": "p", "text": "Bilbringi was the site of the showdown between Thrawn's forces and the New Republic – though the Republic took heavy losses, in the end they were victorious and captured the shipyards. The Executor-class Star Dreadnought Lusankya was taken there after it was captured by the Republic and repaired."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the shipyards built vessels for the New Republic. Two Imperial-class Star Destroyers were near completion as of 27 ABY. Five cruisers and fifteen corvettes constituted a quarter of the defense fleet station there, which also included the Dauntless. When Han Solo and Leia Organa Solo visited the shipyards in the hopes of convincing General Muun to aid in the defense of Vray refugees, the shipyards were constructing some five hundred vessels."}, {"tag": "p", "text": "The yards were taken by the Yuuzhan Vong in 27 ABY, and were mostly destroyed, with shipwombs taking the place of mechanical shipbuilding means. The system was later targeted by the Galactic Alliance during Operation Trinity, but the mission failed due to a combination of factors."}, {"tag": "p", "text": "Ten years after the Yuuzhan Vong surrendered, Jacen Solo as Darth Caedus used the Shipyards as a bargaining chip, along with Borleias, for the Imperial Remnant to join the Confederation War."}, {"tag": "p", "text": "While Borleias would revert to Galactic Alliance control after that war, Bilbringi remained with the Imperial Remnant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion names the Bilbringi Shipyards as the \"Imperial Shipyards,\" claiming that the bulk of the Imperial Navy was crafted there. Kuat Drive Yards, in fact, holds this distinction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}