{"url": "Bilbringi_system", "categories": ["Category:Legends articles", "Category:Galactic Empire star systems", "Category:Galactic Republic star systems", "Category:Imperial Remnant star systems", "Category:Inner Rim star systems", "Category:New Republic star systems", "Category:Northern Dependencies star systems", "Category:Yuuzhan Vong empire star systems"], "nodes": [{"tag": "h1", "text": "Bilbringi system"}, {"tag": "p", "text": "The Bilbringi system was a star system in the Inner Rim region of the galaxy, on the Namadii Corridor. The system was the site of the important Bilbringi Shipyards and played a pivotal role in the Thrawn campaign. The Bilbringi system was choked with asteroids and other debris; it lay close to several military shipment lanes. The asteroids of the star system were rich in metals and other natural resources utilized in starship construction, making it a perfect location to place the shipyards. The largest asteroid in the system was Bilbringi VII."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Leia Organa Solo first visited the Bilbringi system when she was nine years old."}, {"tag": "h3", "text": "Thrawn campaign"}, {"tag": "p", "text": "During the period of Grand Admiral Thrawn's leadership of the Imperial Navy, Bilbringi was under the command of General Drost and the shipyards were devoted almost entirely to the production of Star Destroyers. It was where Grand Admiral Thrawn began the installation of cloaking devices on several warships and on asteroids, in preparation for his attack on Coruscant."}, {"tag": "p", "text": "As the location of a rare crystal gravfield trap, the quickest way to identify cloaked objects, the system became a prime target for the New Republic who determined that an attack on Bilbringi was necessary in order to obtain the device, badly needed at the time in order to counter Thrawn's siege of Coruscant, where planting hundreds of the aforementioned cloaked asteroids in orbit around the capital was wreaking havoc with transportation into and out of the planet. The New Republic decided to attack fortified Bilbringi instead of another, less defended system in a bid to take the Empire by surprise. Unfortunately for them, Thrawn, being the genius that he was, predicted the move and laid a trap for the attacking New Republic fleet. The turning point in the Battle of Bilbringi came when the Grand Admiral was assassinated by his Noghri bodyguard Rukh at the height of the confrontation. Thrawn's second-in-command and Chimaera's captain, Gilad Pellaeon, was left with no choice but to order the retreat and abandon Bilbringi to the New Republic, in a bitter echo of the retreat he'd ordered five years before in the aftermath of the Battle of Endor. The battle marked the end of the Imperial resurgence under the intellectual drive of Thrawn, though the following year, the other half of the Imperial forces, under the reborn Emperor Palpatine, would strike out from their seclusion in the Deep Core. Taking advantage of the gains made by the late, last Grand Admiral, the Empire would retake Coruscant."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Following the battle and its subsequent capture, the Bilbringi system and its shipyards became a major base for the New Republic Defense Force. The Executor-class Star Destroyer Lusankya was brought to the shipyards after her capture from Ysanne Isard's forces at Thyferra, in order to complete her repairs before re-entering service as a New Republic warship."}, {"tag": "p", "text": "By 12 ABY, the world was represented by its own senator in the New Republic Senate. Artusian crystals from Artus Prime were shipped to Bilbringi."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong War, an important meeting took place at the shipyards between the captured Yuuzhan Vong agent Nom Anor and New Republic representatives Han Solo and Leia Organa Solo, during which Anor was nearly killed by exposure to vacuum. However, he was spared and would later return to his people. Later in the war, Bilbringi was captured by the extra-galactic invaders. In 26 ABY, the Adumari launched a flanking maneuver against the Yuuzhan Vong forces near the planet."}, {"tag": "p", "text": "Near the end of the war, in 29 ABY, the Galactic Alliance and Imperial Remnant fought the Yuuzhan Vong in the Second Battle of Bilbringi, as part of Operation Trinity. However, the operation failed, due to the Vong bringing down the HoloNet. The Alliance forces had to retreat, but not without both sides suffering heavy losses."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "In 41 ABY, Bilbringi was still not a full member of the Galactic Alliance. Jacen Solo offered Bilbringi and Borleias to the Imperial Remnant if they supported the Alliance at the Second Battle of Fondor. Pellaeon and the Moff Council took Solo up on his offer, though in 43 ABY at least Borleias remained under Alliance jursidiction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Bilbringi system in the Farfin sector (a misspelling of the true Farrfin sector) of the Core Worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}