{"url": "Bill_Smith", "categories": ["Category:Real-world articles", "Category:Editors", "Category:Reference work authors", "Category:Role-playing game authors", "Category:Short story authors"], "nodes": [{"tag": "h1", "text": "Bill Smith"}, {"tag": "p", "text": "Bill Smith has many Star Wars writing credits including books from the Essential Guides and from the West End Games Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bill Smith was born in 1968, and by the eighth grade was an avid roleplaying gamer. He received a bachelor's degree from the College of St. Rose in Albany, New York, and became an editor for a trade magazine. In November of 1990, Smith submitted his résumé to West End Games at the suggestion of a friend, and his editing and gaming experience earned him a spot on the West End Games staff."}, {"tag": "p", "text": "He immediately set to work designing adventures for Torg, another West End Games product, then Cracken's Rebel Field Guide and quickly became the Star Wars roleplaying game line editor in 1991. After Smith had worked at West End Games for a year, he got the opportunity to create the Second Edition, which saw publication in 1992. During his time at West End Games, in 1995, he was voted \"Favorite Designer\" by the Role-Playing Game Association \"Gamers' Choice - Hall of Fame\" Awards. (The RPGA is the world's largest organization for role-playing game enthusiasts.) He left West End Games in 1997."}, {"tag": "p", "text": "Smith lives with his wife Amy and their young son Billy in his hometown, located in the foothills of New York's Adirondack Mountains. When he is not busy writing and editing, he enjoys spending as much time as humanly possible with his wife and son, and at the local dirt tracks watching stock car racing. He now writes and publishes the Outlaw Galaxy series of novels and ebooks."}, {"tag": "h2", "text": "Star Wars contributions"}, {"tag": "h2", "text": "Other works"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}