{"url": "Bimmisaari/Legends", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Confederacy of Independent Systems planets", "Category:Confederation planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Halla sector planets", "Category:New Republic planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Bimmisaari"}, {"tag": "p", "text": "Bimmisaari, the capital planet of the Halla sector, was the homeworld of the Bimms and the adopted homeworld of a near-Human species of the same name who settled the planet in 2000 BBY. The planet was directly represented in the Galactic Senate and allowed a RRM settlement in 22 BBY, prior to the Clone Wars. During the Clone Wars the planet was located within Separatist-contested space and Hutt Space. It escaped most of the turmoil of the Clone Wars and Imperial repression thanks to its remote location."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A temperate world of dense jungles and forests of asaari trees, Bimmisaari was the homeworld of the Bimm species, a race of diminutive furred Humanoids. Constructing their cities in the middle of vast plains, the planet was colonized by a short Near-Human race which assimilated into the native population, calling themselves the Bimm as well. Speaking the same language and sharing the same culture, the Bimm were pacifists and attempted to maintain the beauty of their world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered by scouts from the Galactic Republic during the Great Manifest Period, Bimmisaari was colonized by a race of diminutive Near-Humans circa 2000 BBY. Forming a unified society with a ban on all weapons, the Bimm were governed by a council of Law Elders and petitioned the Galactic Republic for a seat in the Galactic Senate. Establishing the Tower of Law in the capital city of Glastro, to Law Elders would meet within while a bustling marketplace worked outside. Upon gaining representation the Bimm remained loyal to the Republic for centuries, but the decline of the Republic eventually saw Bimmisaari fall within the borders of Hutt Space. The Bimms welcomed refugees from the Republic that were relocated to their world by the Refugee Relief Movement and maintained high regard for members of the Jedi Order."}, {"tag": "p", "text": "Following the fall of the Republic, Bimmisaari was incorporated into the Galactic Empire. In 19 BBY, the Imperial regional governor of Sector 3 was based on Bimmisaari."}, {"tag": "p", "text": "Bimmisaari began to thrive as a major tradeworld by 9 ABY. During the reign of Grand Admiral Mitth'raw'nuruodo, the Law Elders opened negotiations with the New Republic in an attempt to break ties with the fractured Empire. It was during a diplomatic mission that Republic representatives Leia Organa Solo and Luke Skywalker had their first encounter with the Noghri, who tried to capture Skywalker and Organa Solo. Bimmisaari ultimately did choose to join the New Republic, and other worlds in the Halla sector such as Danuta followed suit."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the planet was conquered by the extra-galactic invaders, and was raided by the New Republic. When the Yuuzhan Vong were defeated, the Bimms aligned with the Galactic Alliance on the basis that their world would be provided aid to help them rebuild. When aid never came, the Bimms grew impatient and when Colonel Jacen Solo and Admiral Cha Niathal removed Chief of State Cal Omas, the Bimms began to question their allegiance to a fracturing government which failed to provide for them. Upon hearing of the burning of Kashyyyk by the Alliance, the Bimms seceded and joined the Confederation forming against the Alliance as the Second Galactic Civil War progressed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Bimmisaari in the Fakir sector of the Galactic Core. The Fakir sector is actually located in the Inner Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}