{"url": "Bin_Essada/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Males", "Category:Moffs of the Galactic Empire", "Category:Near-Humans"], "nodes": [{"tag": "h1", "text": "Bin Essada"}, {"tag": "p", "text": "Moff Bin Essada was a Near-Human male who served as the Imperial military governor of the Circarpous sector. After learning from Captain-Supervisor Grammel that Princess Leia Organa and Luke Skywalker were present on Circarpous V, he contacted Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Widely famed as an expert on unusual radiations, Moff Bin Essada served as an Imperial military governor presiding over the Circarpous sector, based on the territorial admintrative world of Gyndine. In the year 2 ABY, he received a First Priority communication from Captain-Supervisor Grammel, the commander of the Imperial garrison on Circarpous V, informed him that two strangers had been captured on the planet carrying a strange crystal. Just as he showed Essada the fluorescent crystal on the holo connection, the governor became curious, speculating on the phenomenon. Afterwards, he wanted more information about the strangers, and after a description, he concluded that it could be Leia Organa, which he did not tell Grammel. He also attributed a possible meaning to her male companion, Luke Skywalker, but could not identify him. He ordered Grammel that nothing should happen to the prisoners and was soon to send an important representative of the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Essada was an overweight, swarthy man, whose most outstanding feature was a series of chins falling in steps to the upper part of his chest. It was suspected that, while he appeared Human, his origins may not have been so, hinted at by his perpetually squinted dark eyes, which featured pink pupils ever sensitive to light. He had curling black hair, touched with white at the sides and dyed orange in a spiral pattern on top."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}