{"url": "Binayre_Pirates", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Pirate organizations", "Category:Smuggling organizations"], "nodes": [{"tag": "h1", "text": "Binayre Pirates"}, {"tag": "p", "text": "The Binayre Pirates were a band of pirates and smugglers that operated within the Corellian sector during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Binayre Pirates operated in the Corellian sector and were led by Captain Kath Scarlet. The Binayre maintained two home bases on the twin worlds Talus and Tralus, and were among the lowest criminal elements on those worlds. They were looked down upon as disreputable and untrustworthy even by other criminals. Several of them wore the insignia of Black Sun. On Talus, they operated from their bunker. The Binayre Pirates were tracked by the Corellian Security Force and the Federation of the Double Worlds, and they were also in open conflict with the Aa'kuan anarchist. After the Battle of Yavin, the Binayre Pirates controlled several areas of space in the Corellian system, including the Binayre Razorcat, the Trifecta Star and the Rayless Lantern. In space battles, the pirates flied M3-A Scyk fighters and Z-95-AF4 Headhunters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Circa 1 ABY, a commoner in the city of Dearic provided the coordinates of the Binayre Pirate Bunker on Talus to a spacer brave enough to visit it."}, {"tag": "p", "text": "Around the same time, Kath Scarlet and a group of Binayres pirates struggled on Talus against a spacer and an Imperial Security Bureau team led by Jeffren Brek for the control of the Z-95 Headhunter Dire Hound."}, {"tag": "p", "text": "The same year, Jabba the Hutt's bounty hunter Bronell dispatched a spacer to the Talusian pirate bunker in order to retrieve information about a CorSec officer who owned money to Jabba, as well as to the pirates."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}